{
  "article_id": "516e61792002",
  "url": "https://www.thenation.com/article/archive/sls-big-banks-and-other-triumphs-capitalism/",
  "title": "S , Big Banks and Other Triumphs of Capitalism",
  "date": "20250929T083000Z",
  "domain": "thenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "1. ‘SUPPOSE YOU GO TO WASHINGTON…’\nHave the poor suckers of this world ever lived in an age that offered such entertainment? Costly, to be sure, and they are the ones who are going to pay for it, but at least they are getting to watch some wonderful burlesque–first the pirates of a fraudulent system of communism forced to scuttle their own ship, and then the pirates of a fraudulent system of capitalism beginning to do the same.\nSo long as their focus was on Eastern Europe, our press and politicians couldn’t talk enough about “the triumph of capitalism and democracy.” But now that they begin reluctantly to concentrate on the piracy at home, they are–perhaps because so many of them are part of that piratical crew–understandably reluctant to admit the obvious: that our system is just as bogus and corrupt and irrelevant and defeated in its own way, offering neither the risks of true capitalism nor the safeguards of true democracy. Our system is a hoax.\nIf anyone still had faith in the system, the savings and loan adventure surely must have brought him to his senses and to his knees. The gambling debt of $500 billion ($150 billion plus interest and other incidentals)–or will it be, as some economists predict, a trillion four?–that the S&L industry left with the taxpayers has prompted even that deadpan Tory, George Will, to remark in wonderment, “We seem to have a capitalism here in which profits are private and we socialize the losses. Why are we, in effect–if you’re big enough, if you’re a huge bank or a savings and loan–why, in effect, are we guaranteeing everything? … What I’m asking is isn’t there a way to reform the system so that the taxpayers don’t get stuck with what happens when you have deregulation and risk taking that goes wrong?”\nThe answer to his question is: No, there is no way to reform the present system, because the system is owned and controlled by those who are ruining it. Voters, ordinary taxpayers, have nothing to say about it.\nMartin Mayer, a conservative economic historian, has seen his world crumble and become meaningless. The capitalism he set his watch by has stopped ticking. He finds the thrift mess almost unbelievable: “Players entered the game through a government charter and continued to play, however severe their losses, in violation of all capitalist principle–courtesy of a government that continued to insure their borrowings. This was not an accident: it was public policy.”\nWhen he talks about “players,” he makes it sound like customers at a casino. And that in fact is what it has become. Capitalism has become the Big Casino, with players guaranteed against loss, because in effect they have bought the house managers. That is public policy.\nMayer predicts plaintively that “future sociologists…will study the irruption of criminality into what had been conservative, even beneficent, organizations….They will seek to learn why the fiduciary ties that had set the unspoken, self-dignifying rules of a competitive society had been so grievously weakened in the late years of the twentieth century.”\nPopular\n\"swipe left below to view more authors\"Swipe →\nBut in fact, this has never been a competitive society, neither in the mythical “capitalist” commercial world nor in the even more mythical “democratic” world of politics. Big-big uncontrolled money has ruled both through special privileges, and the S&L disaster simply illustrates again what Mayer calls “the corruption that must ultimately infect any government where the costs of running for office are greater than those that can or will be borne by the relatively small community of the public-spirited.”\nOf course, this is nothing new; “democracy,” at least in modern times, has always been equated with the purchase of politicians by those with the money to do it. “Suppose you go to Washington and try to get at your government,” Woodrow Wilson said back in 1912 when he was running for President. “You will always find that while you are politely listened to, the men really consulted are the big men who have the biggest stakes–the big bankers, the big manufacturers, the big masters of commerce….Every time it has come to a critical question, these gentlemen have been yielded to, and their demands treated as the demands that should be followed as a matter of course. The government of the United States is a foster child of the special interests.” (He knew from experience, having capitulated to so many special interests himself.)\nIn the 1980s that trend reached the point where financial contributions from ordinary voters were hardly even sought. In the House of Representatives, writes Brooks Jackson, Democratic members commonly received “more than half their re-election funds from PACs and much of the rest from lobbyists and business executives.” The Congressional banking committees, the grand colluders in this conspiracy, were inundated with money from sleazy financial institutions and sleazy real estate developers, and from the hundreds of sleazy, high-priced law firms and sleazy accountants and sleazy appraisers that laid the foundation for their dirty work. From S&L interests alone, members of Congress received $11 million on the record–probably twice that much off the record–in the Looting Decade.\nThe buyers were not shy about their intentions. Fernand St. Germain was a below-average money-raiser before he became chair of the House Banking, Finance and Urban Affairs Committee from 1981 to 1989. In his first term as chair, contributions doubled. In his second campaign, 81.3 percent of his PAC contributions came from industries–banking, thrift, securities, housing and others–that fell under the jurisdiction of his committee, and 99.4 percent of this special-interest money came from outside his home state, Rhode Island. He was for sale on the national market. So industrious was he on behalf of his clients, The Providence Journal reported in 1985, that he had the second-biggest campaign treasury in the House, $650,000, with the legal right to haul it all away for his personal use on retirement.\nConsidering the return on investment, St. Germain came very cheap. And the $1.3 million Charles Keating spent on Senators Cranston, DeConcini, Glenn, McCain and Riegle–the Keating Five–was dirt cheap, too. It got results. As William Black, general counsel of the federal home loan bank office in San Francisco, has pointed out, “Have you ever heard of five senators calling in the head of an agency, and then all the top regulators out of the district, to talk about Mrs. McGillicuddy’s problems with Social Security? There were lots of constituents that needed protecting, but the one constituent who put up more than a million bucks in contributions to the five senators is the only one that got the protection. All of these other thousands of folks got the shaft.”\nThe really sad part about this story is that the scumbags in the moneylending world go on giving the public the shaft, generation after generation, and getting total cooperation from the government nevertheless. Fifty-seven years ago, Representative John Dingell, father of the present Michigan Representative, said, “Developments in the field of American banking convinced the people that America had no bankers and much less a banking system. What we believed to be a bank system was in fact a respectable racket and so many connected with it only cheap, petty loan sharks and shylocks.” The “respectable racket” description is not at all out-of-date; it still applies to most moneylending. Mayer writes of a senior S&L examiner, brought over from the Office of the Comptroller of the Currency to help pump out the thrift cesspool, who aptly expanded the description: “You know what’s wrong with this industry, Mr. Mayer? What’s wrong with this industry is that the people who own these institutions are slime.”\nAlthough that may be a bit too inclusive, it is not too harsh. The industry has become so thoroughly rife with corruption that some of the reporters who covered its breakdown most closely have, understandably, smelled a giant conspiracy. The collaborators on Inside Job–Mary Fricker of The Santa Rosa Press Democrat and Stephen Pizzo and Paul Muolo of the National Thrift News–concluded that there existed “some kind of network…a purposeful and coordinated system of fraud….At each step of our investigation our suspicions grew because, of the dozens of savings and loans we investigated, we never once examined a thrift–no matter how random the choice–without finding someone there whom we already knew from another failed S&L.” [Emphasis in original.]\nBut any conspiracy theory, to hold water, must include the commercial banking industry, too; many of the laws passed to allow S&L gambling also allowed commercial-bank gambling (with results that are just emerging and are depressingly familiar). And the conspiracy theory–which I think makes more sense than any competing theory–must also include government officials from top to bottom. If the S&L operators were slime, they were, as most of the historians of this sorry period seem to agree, no slimier than the overwhelming majority of the Congress, the Reagan-Bush White House gang and the bureaucracy. “Every revolution evaporates,” said Kafka, “leaving behind only the slime of a new bureaucracy.” The last detectable moisture of the American Revolution had evaporated by the end of the 1930s, and since then the vessel of our government has been coated by an ever-deepening slime–not only the slime of the bureaucratic bureaucracy but also of the Congressional bureaucracy and the executive bureaucracy. They gave us the Looting Decade by changing laws and regulations to invite criminal conduct, and then by taking great pains to guarantee that the criminals would rarely be punished or have to pay back what they stole.\nMost of the headlines have been reserved for the flamboyant looters and high rollers, and that’s good, because taxpayers at least deserve to be entertained by some Roger Corman-type horror dramas: Don Dixon, David Paul and Charles Keating have happily supplied us with the equivalent of Attack of the Crab Monsters. But what they did is understandable; thievery is what unregulated capitalism is all about.\nMuch more shameful, in a way, was the action, or sometimes the inaction, of the politicians and bureaucrats who were supposed to be keeping watch over the industry’s honesty and solvency. “Where, indeed, were the regulators while thrifts were being looted?” ask the authors of Inside Job. “During our investigation we got very little in the way of answers to that question. Spokesmen at the FHLBB [Federal Home Loan Bank Board] either flatly refused to discuss thrift failures or they lied about them. In 1983 they told us there was no problem. Then later, when the trouble burst into the open, they lied to us about the size of the problem. Then they lied to us about the causes of the problem. There was no fraud, no organized crime involvement–it was the economy’s fault, they said. Then they threw a blanket of secrecy over the solutions they said they had in mind.”\nThe greatest betrayal was not by the S&L lobby and the S&L operators–they, to repeat, acted predictably, as businessmen unregulated and unrestrained either by law or by the marketplace usually act–but by those in government who pretended to act on behalf of the general population.\n2.\nIT STARTED WITH CARTER\nKeeping in mind Woodrow Wilson’s remark, skip down eleven presidencies and we come to Jimmy Carter, the first in a series of betrayals, the fake populist who as much as any President in history put the government at the disposal of the first group on Wilson’s list, the big bankers. As Michael Harrington later observed, Carter came to power with a background that shared “so many of the prejudices and premises of the corporate ideology” that he “could not, and would not, effectively oppose it when it became militantly conservative in the late seventies.”\nThe nation had been given its first warning of what to expect from Carter when, during the 1976 campaign, Bert Lance, whose Georgia bank was a crucial financial backer of Carter, told the press his friend had proved in Georgia politics that “he campaigns liberal but he governs conservative.” Sure enough, as a candidate he promised that unemployment would be his top priority, but as soon as he was elected he switched and said “winning business confidence” was more important. He vowed that he would immediately push for the deregulation of the banks.\nTo drive that point home, shortly after taking office he sent Lance to meet with twenty-eight representatives from some of the nation’s largest financial institutions to promise that Carter would help them in any way he could. Columnists Evans and Novak reported that “Lance’s rhetoric was as impeccably orthodox as William Simon’s, if not Andrew Mellon’s.” But rhetoric was not enough for the bankers. A year later Walter Hoadley, chief economist for the Bank of America, said, “The fear across America–and it’s just beneath the surface–is that there will be a redistribution of income and wealth. The Carter administration has become a symbol of that fear.”\nIf such fear indeed existed among bankers, it was surely dispelled in 1979, when Carter, acting on the advice of David Rockefeller, appointed Paul Volcker to chair the Federal Reserve Board. It was a natural recommendation for Rockefeller to make. Volcker was a notoriously well-trained guard dog for the Eastern money establishment, having been a Chase Manhattan banker, a Treasury official in the Johnson and Nixon administrations and head of the Federal Reserve Bank of New York. Wall Street and the international banking fraternity loved him. They hated inflation–bankers don’t like to be repaid in money that is softer than the money they lend, even if the softer money makes the economy hum–and they knew that Volcker was mean enough to destroy the economy to save the hardness of their dollars.\nBecause Carter had refused to use government controls, rising oil prices had helped drive inflation to uncomfortable heights (13 percent). Wall Street and the big banks were convinced, as financial writer Leonard Silk put it, that “nothing would be so good for the market and the economy as a minor recession–stiff enough to reduce inflation and the trade deficit, although not so steep as to disrupt business plans for new investment or to wreck prospects for strongly rising profits in the next expansion.” The faith of Wall Street and the big banks was well placed. Only Volcker didn’t stop with a nice little recession. He created a killer.\nR. Dan Brumbaugh Jr., former deputy chief economist at the Federal Home Loan Bank Board, is among the many who trace the destruction of the S&Ls to Paul Volcker. “In October 1979,” he writes, “the Federal Reserve made a decision with ruinous results for the thrift industry. The Federal Reserve changed from a policy of stabilizing interest rates to a policy of slowing money growth to combat inflation. This contributed to a spike in interest rates that led to an unprecedented increase in thrifts’ cost of funds, which rose from under 9 percent in 1980 to more than 11 percent at the end of 1981, with almost no corresponding increase in revenues due to the preponderance of fixed-rate mortgages being held. This was the beginning of the modern thrift crisis.”\nVolcker tightened the money supply so much that the prime rate finally hit 20 percent. He had come into office stating flatly that “the standard of living of the average American [not the upper crust, mind you] has to decline.” It did. With the high interest rates, the average American couldn’t afford to buy a home or a car. Assembly lines closed down. When Volcker became chair of the Fed, unemployment was 5.7 percent; for nearly five years thereafter it averaged 8.2 percent, hitting nearly 11 percent at one time. Every percentage point stood for another million Americans out of work. In February 1982, a construction trade magazine turned its cover into a “Wanted” poster showing the faces of Volcker and the six other Fed members and charging them with “premeditated and coldblooded murder of millions of small businesses.” Murdered with them were many of their creditors, hundreds of small banks. But nothing was hit harder than the savings and loan industry.\nIt Was a Wonderful Life\nEstablished more than a century ago for the sole purpose of supplying home mortgages, the S&L industry had a reputation for restrained, sound management.\nAlthough the old-fashioned S&Ls were bubbling with conflicts of interest–builders, developers, realtors, title insurance companies and all the others who would stand to benefit from home building usually had no trouble getting a seat on their boards of directors–community pressures usually maintained business decorum. Until the early 1930s, the industry got along perfectly well without any direction higher than the state governments, which chartered individual thrifts but pretty much left them to their own devices.\nBut when nearly 2,000 thrifts failed in the Great Depression and depositors lost $200 million, the industry, wanting to regain the public’s confidence, asked the federal government to set up an agency that could hand out “seal of approval” charters. From that request came, as the authors of Inside Job write, “a federal S&L pyramid with the Federal Home Loan Bank Board in Washington at the top, twelve semi-independent regional federal home loan banks beneath it, and individual savings and loans at the base of the pyramid. Thrifts were given the option of being state or federally chartered, but those who chose a federal charter had to operate under strict federal regulations and examiners were sent to make sure they did.”\nPrior to the 1980s, they were examined rather strictly. But the thrifts that chose to remain under state charter were never closely regulated. However, the danger of corruption was slight. High risk was not the game of thrifts, and home mortgages did not lend themselves to fancy manipulation (as recently as 1980, 80 percent of S&L assets were in home mortgages). Hedged in by tradition and regulation, the people who ran the thrifts, whatever their ambitions, were in no position to compete with the big dogs of finance.\nDuring the early years of the Depression the S&Ls and commercial banks received another federal crutch that increased public confidence in their stability. For the banks this was the Federal Deposit Insurance Corporation (F.D.I.C.), and for the S&Ls it was the Federal Savings and Loan Insurance Corporation (F.S.L.l.C.). Both were funded by dues paid on deposits. (State-chartered thrifts could pay their way into the F.S.L.I.C. coverage.)\nBut for neither thrifts nor banks was the plan supposed to do more than comfort the small investor; the insurance–which started off covering up to $5,000 per depositor and stayed at that level until well after World War II–was not aimed at protecting the high-rolling, sophisticated investor. But that suited the S&Ls just fine, before the 1980s. Their traditional customers were wage earners, not high rollers. The thrifts gave modest interest rates to depositors and charged borrowers modest interest rates. And because S&Ls seemed so bland of purpose, they never had the hard reputation of commercial banks. “Banking establishments are more dangerous than standing armies,” wrote Thomas Jefferson, but thrifts never aroused that kind of fear. Indeed, until lately they have been swaddled and protected by grassroots myths of honesty.\nThat’s why, when evidence of vast corruption in the industry began to surface in the 1980s, some members of Congress, particularly those from the hayseed regions, refused to believe that good ol’ boys would do such things. As Senator David Pryor, the Arkansas Democrat, explained to New York Times reporter David Rosenbaum, “You’ve got to remember that each community has a savings and loan. Some have two, some have four, some have five, and each of them has seven or eight board members. They own the Chevy dealership and the shoe store. And when we saw these people, we said, gosh, these are the people who represent a dream that has worked in this country.” That only shows how unobservant, if not downright stupid, members of Congress can be. At the moment Pryor was spinning that homespun story, Arkansas thrifts were trying to recover from the bad management and corruption that had given them the highest percentage of insolvencies in the nation.\nNight of the Living Debt\nThe thrifts’ solid, relatively untroubled way of life came to an end with Volcker. By cutting the supply and thereby driving up the price of money, Volcker simply paralyzed most S&Ls. Before they could lend money for mortgages, they had to have it–and they were rapidly running out of money as tens of billions of dollars were withdrawn by their customers and placed in the much-higher-yielding money market funds or government securities. Of course, the S&Ls could always borrow working capital from banks, but it was available only at enormously high rates and for short terms. To take that kind of money and lend it out at lower rates for long terms would be madness and virtually guarantee bankruptcy.\nMany S&L managers were crazed enough to go that route, with the inevitable result. Others went bankrupt when the Carter-Volcker recession resulted in mortgage foreclosures. And other S&Ls, still solvent but nearly out of money, became hardly more than caretakers for old accounts. By the time Carter had finished his part in Wall Street’s scorched-earth policy and retired to Plains, Georgia, two-thirds of the nation’s S&Ls were losing money, and many were insolvent. A thrift is considered insolvent when losses eat up all its capital. To put it another way, for a savings and loan to be healthy, the loans and other assets on its books have to be worth more than what it owes depositors. But if an S&L makes a lot of risky loans that go bad, there may not be enough good ones left to cover all those CDs and savings accounts, and the S&L becomes technically insolvent.\nEdward Kane calls these insolvent thrifts “institutional zombies” because each has “transcended its natural death from accumulated losses by the black magic of federal guarantees.” These busted thrifts should have been shut down by the government and their depositors paid off without further ado. If they had been buried at the moment they stopped breathing, we would now be facing no S&L debt whatsoever. Brumbaugh argues that “if thrifts could be closed at the exact moment” they hit bottom, government “would incur only administrative costs.”\nWilliam Black, the San Francisco federal home loan bank office general counsel, agrees in his own way: “If you were acting in a timely fashion from the beginning, this whole thing would never have gotten so out of hand. If you act when there’s enough of a cushion, it costs the insurer nothing, because you can sell the thrift for market value.”\nFederal regulators sometimes waited as long as seven years before closing hopelessly insolvent S&Ls. A recent study by James Barth, another former chief economist at the F.H.L.B.B., showed that from 1980 to 1988 regulators delayed an average of two years before shutting down insolvent thrifts, although they knew that such delays allowed the busted thrifts to go on losing billions of dollars, which taxpayers would probably have to pay down the line.\nPolitical/bureaucratic delay in closing bankrupt thrifts has been the greatest sin of the S&L scandal; allowing them to stay in business virtually gave them a mandate to operate like Charles Ponzi, the notorious swindler of the 1920s who perfected the pyramid scheme of paying interest to depositors (or investors) not from profits, since there were none, but from new deposits. To succeed, the scheme must have a steady stream of new cash, lured by “seductive promises of high returns.” This is exactly what the insolvent thrifts relied on in the 1980s. And by doing so they endangered healthy thrifts by forcing them to compete with unrealistically high interest rates.\n3.\nTHE DEREGULATION DECEPTION\nWhy weren’t they closed? (We’re speaking now from the depths of the 1980-83 recession.) For one thing, the F.S.L.I.C. was a farcical insurance program; it had only a measly $6 billion in the kitty to pay off depositors at what Kane says were “already understood to be $100 billion worth” of insolvent thrifts. Which meant that the F.S.L.I.C., if it wanted to dispose of dead thrifts, would have to get its money through rescue legislation. But Carter, running desperately behind in his re-election campaign, wasn’t interested in such minor matters as the threatened collapse of a trillion-dollar industry. And then Ronald Reagan, being ideologically retarded, wasn’t either.\nPerhaps the most decisive reason the busted thrifts weren’t shut down was that the U.S. League of Savings Institutions, the industry lobby, was against the government’s taking any action that would result in a radical shrinking of its empire. If the league’s membership (around 4,000 at that time) was reduced by the number of S&Ls then or soon-to-be insolvent, it would lose its powerhouse role. So the league, the F.H.L.B.B. (which it controlled), and Congress (key parts of which it also controlled) created the great deception that the industry wasn’t really stinking from dead or dying thrifts and that nothing was wrong with it that fictional bookkeeping and freedom from regulations–in other words, fraud and anarchy–couldn’t cure. The rationale was that if thrifts were allowed to run their affairs any way they wanted–even as floating crap games–they could “grow out” of their distressed condition. This was a nice way of saying that if they were allowed to do some double-or-nothing gambling on some very long shots in real estate, farming, energy, junk bonds and anything else under the sun, well, just maybe they might hit it lucky enough to get back in the black.\nThe industry got what it wanted through a variety of hocus-pocus techniques authorized by legislation and bureaucratic fiat between 1980 and 1983. These were the chief hustlers who created the rules of the new era:\nThe $100,000 Man\nRepresentative Fernand St. Germain. Here we have a politician of infinite greed who became a multimillionaire by breaking many rules and possibly several laws over the years, but he was never punished and rose to a position of great influence. Former Speaker Tip O’Neill once said of St. Germain, “I don’t know a man with fewer friends in the House.” But his sleaze was so generic to the House that even when all sorts of conflicts of interest had become public, the Ethics Committee went out of its way to avoid chastising him. His colleagues knew of his honest graft; the press knew too, and the voters of Rhode Island were sometimes given evidence of his sleaze. But he lasted twenty-seven years in the House, and for the last seven years was in a position to do as much damage to the financial system as any one politician could.\nIn the perverse rating system of Washington, St. Germain was considered a liberal. He concocted a neopopulist mask for himself by talking tough about “big banks,” and introducing marginal consumer legislation and supporting subsidized housing that benefited fat-cat developers more than it helped the poor. But apparently his main goal in Congress was to get rich. The first big money he made on the side was in secret partnership with “one of the biggest developers and managers of federally subsidized housing in the Northeast,” Brooks Jackson reports.\nSt. Germain had an impressive talent for borrowing money in sweetheart deals. He bought restaurants worth $1.3 million without putting up any money of his own; banks were afraid not to give that kind of credit to the chair of the House banking subcommittee that handled their regulations. When St. Germain became chair of the House Banking Committee in 1981, he also became, in Jackson’s phrase, “the undisputed godfather of the S&L industry.” As such, he got waterfront condos at bargain prices and insider deals from S&Ls. But he was not without gratitude. When the chief executive of a Florida S&L who had done big favors for him sought federal permission to restructure the ownership of his thrift, Paul Nelson, St. Germain’s banking committee chief of staff, nudged the regulators through repeated phone calls.\nBesides being a tax dodger–he took about $400,000 in improper tax deductions–St. Germain was a leech. “He was seen night after night in Washington eating and drinking in the company of James (Snake) Freeman, lobbyist for the U.S. League of Savings Institutions,” who, assigned specifically to keep St. Germain happy, always picked up the tab, which ran between $10,000 and $20,000 a year. It was only right and proper that a gent with those credentials should have had so much to do with two pieces of legislation that incited crooks within the industry to do their worst, and encouraged crooks outside the industry to join in.\nThe first piece was the Depository Institutions Deregulation and Monetary Control Act of 1980. Dreamed up by the Carter Administration, it was a lousy law that went a long way toward muddling the distinctions between banks and S&Ls and corrupting the character of the latter. For one thing, it destroyed the traditional community orientation of S&Ls by killing all geographic limitations on their lending. In the good old days, S&Ls were restricted to making mortgage loans only in their immediate vicinity. No more. Now they could lend money across the country, which is why, for example, you and I now own golf courses in Texas and Florida that S&Ls in Wisconsin and Kansas and Arkansas, before going down the tubes, spent millions of dollars to build.\nBut the most treacherous and damaging part of the law was the provision that increased by 150 percent the F.S.L.I.C. insurance coverage of any single S&L savings deposit, moving the coverage to $100,000 from $40,000. It was a nuclear time bomb that, triggered by other rule changes in the next two years, would leave the thrift industry (and the national budget) looking like Hiroshima in 1945.\nThe provision, which avoided the close inspection of Congressional hearings, was sneaked in during the late-night write-up of the bill, stuck in “almost as an afterthought,” one member of the House banking staff later said. More likely, suggest the authors of Inside Job, it was the long-plotted forethought of a league lobbyist, Glen Troop, who was, according to L.B.J.’s infamous aide Bobby Baker, a fast man with a bribe. Other writers lay the blame elsewhere. Martin Mayer tells us that Senator Alan Cranston, best known as Keating’s highest-paid pal, cut the deal at the late-night session.\nBut Brooks Jackson argues persuasively that while the above rogues might have had their hands in it, the coup was St. Germain’s. He writes: “The Senate had voted to raise the level only modestly, to $50,000, and the House hadn’t approved any change at all. But with St. Germain taking the lead, the Senate-House conferees ‘compromised’ at $100,000….St. Germain slipped it into the large and complex banking bill.”\nExcept for its placement of St. Getmain’s sneak attack, Jackson’s account jibes with Representative Henry Gonzalez’s memory of the event. Gonzalez says there were only eleven other members on the House floor when St. Germain requested unanimous consent on several amendments to the pending banking bill. The House clerk had the only copy of St. Germain’s provisions. As Gonzalez told Matthew Miller in The Washington Monthly, “There was never one minute’s consideration or hearing on that increase. It took minutes–there was no debate.”\nWhy such a radical increase? Nothing like it had ever happened before. The protection was set at $2,500 when the F.S.L.I.C. was fashioned in 1933 and raised to $5,000 in 1934. It stayed at this level until 1949, when it went to $10,000; it went to $15,000 in 1966, to $20,000 in 1969 and then to $40,000 in 1974.\nWhy in the world would the S&Ls want to increase coverage to $100,000? The average depositor’s savings account was only $6,000 at that time. The 1980 increase was surely, as Jackson writes, “a perversion of the consumer-protection ethic that deposit insurance once embodied. At $40,000, insurance had been more than adequate to protect unsophisticated savers.” St. Germain pushed it up not to protect them “but to aid S&L owners. With their deposits insured up to $100,000, the associations no longer had to rely on the savings of citizens in their own communities. A huge, unregulated national market in brokered deposits developed. Corporations [and pension funds and credit unions] and wealthy individuals found they could split up their spare millions into convenient $100,000 bundles and park them as federally insured certificates of deposit in S&Ls all over the country.” It was as solid an investment as Treasury bills, for, with St. Germain guiding his gullible colleagues, Congress passed resolutions putting the full faith and credit of the United States government (you can translate that as “taxpayers”) behind the rickety F.S.L.I.C. insurance funds.\nThis act, writes Edward Kane, was the lightning that turned insolvent thrifts into gambling monsters: “In effect, FSLIC’s unconditional willingness to repay the zombie’s depositors allows its managers to open up a line of credit in any financial casino they can enter. This line of credit permits the zombie to book high-stakes bets even though it has no funds of its own to risk.”\nBut one should bear in mind that the increase to $100,000 coverage didn’t benefit only S&Ls. It also applied to commercial banks. And that may explain why the banking committees were especially hospitable to the change. As Martin Mayer points out, “Insurance that went to $100,000 looked like a way to save not the depositor but the institution,” and at the moment some of the biggest riskprone accounts were in commercial banking institutions. “We were on our way to the great scandal of the bailout of Continental Illinois, where in effect all the money expended by the FDIC went to giant foreign depositors and anonymous holders of Euronotes issued in tax-shelter locales like the Netherlands Antilles.” An excellent marksman, Mayer squarely hits the central motivation of bureaucrats and legislators in all that was done for both banks and S&Ls in the 1980s: to help the big depositors and the big moneylenders.\nSo much for St. Germain’s 1980 contribution to national disaster. His other contribution, which came in 1982, honored him by bearing his name: the Garn-St. Germain Depository Institutions Act, which will take its place in history alongside such names as the Teapot Dome. Which brings us to another key architect of disaster.\nHello Las Vegas\nSenator Jake Garn. This Republican’s home, Utah, should remind us that, for the most part, the S&L wrecking crew were from the West. That isn’t surprising. In the last quarter-century, most of our worst headaches have been supplied by Presidents and other politicians from that region. Reformers might want to keep that in mind, in case they have the opportunity someday to expand vastly the Air Force’s Western bombing ranges to include Salt Lake City, Phoenix, Denver, Los Angeles, any Texas city, et cetera, thereby removing the remnants of some of these crooked S&Ls as well as the people who created them.\nMayer writes that Garn has a “rather spacey manner (he was the Senator who went up in the space shuttle, and some staffers like to say he never came down).” As a former mayor of Salt Lake City, he is, needless to say, extremely conservative. A central figure in what some called “the Mormon Mafia,” Gain was chair of the Senate Banking Committee for the six years following the Senate’s change of party control in 1980; from that position of power he was able to foist on the government two other horrible mistakes: his protégé Richard Pratt (about whom we’ll have more to say in a moment) and M. Danny Wall, who had served Garn in Salt Lake City and was now, though thoroughly unequipped for the job, chief of Garn’s banking committee staff. Both Pratt and Wall would have catastrophic terms as the nation’s top S&L regulator.\nGarn, one of the Senate’s leading defenders of the use of junk bonds by S&Ls, seems utterly devoid of any ability to measure conflict of interest. Apparently without any feeling of shame, he has openly received financial homage from many shady members of the thrift industry, and from the shadiest member of the junk-bond industry. “Three of the five savings and loans with the largest holdings of…junk bonds contributed $100,000 or more in recent years to help establish the nonprofit Garn Institute of Finance at the University of Utah,” Kathleen Day reported last year in The Washington Post. “The S&Ls are Columbia Savings and Loan of Beverly Hills, Imperial Corp. of America in San Diego and CenTrust Savings Bank of Miami. Drexel Burnham Lambert Inc., the leading junk bond firm, also contributed $100,000 or more.” Happily, bad management has driven most of those contributors into the ditch, as it earlier did another big giver, Charles Keating of Lincoln Savings and Loan.\nWith Garn-St. Germain, the character of federally chartered thrifts was changed completely (the act applied only to federal thrifts). It was goodbye Bedford Falls, hello Wall Street and hello Las Vegas. The act removed the last controls on interest rates; now an S&L could offer any amount, however ridiculously high, to attract funds.\nNo longer were thrifts chained to home mortgages, the anchor that had allowed them to ride out many a storm. Now they could hoist the Jolly Roger and sail off to make secured and unsecured loans for the new and unfamiliar lines of commercial, corporate, consumer or agricultural ventures–in fact, 90 percent of their assets could be invested there. The temptation to go that route–securities, land sales, real estate developments–was so great that, not surprisingly, home mortgage business at the S&Ls dropped nearly 50 percent.\nBut there were even more dangerous changes. Now thrifts needn’t ask for the traditional down payments from borrowers but could provide 100 percent financing. That’s right; to swing a deal, a borrower needn’t put up a penny of his or her own money.\nTo complete the felonious scene, the new law (1) permitted developers to own S&Ls and (2) permitted the owners of S&Ls to lend to themselves. In short, the vault was not only opened to the crooks, it could be owned by them. No wonder, then, that at the Rose Garden signing of the bill, President Reagan, with his customary talent for unconscious confession, chortled, “All in all, I think we’ve hit the jackpot.”\nSavings and loan owners could now themselves buy land and build condos or anything else they wanted to throw up and not be limited to making loans to other developers. The owners could, in fact, borrow their depositors’ money for any kind of harebrained personal scheme, which is why the government, thanks to bankrupt thrifts, now owns such weird items as a buffalo sperm bank, a racehorse with syphilis, a kittylitter mine, and “development” land so remote that it could be used only as a game preserve.\nBrooks Jackson hardly needs to point out that “the Garn-St. Germain legislation created conditions in which speculation and swindles were sure to flourish.” Outrageous as that criminal atmosphere would have been for healthy thrifts, it was even more outrageous–and dangerous–for the insolvent thrifts, for they had nothing to lose by performing in the most irresponsible fashion, investing in the wildest schemes. Which is why the Federal Home Loan Bank Board should have wiped them out. And it is also why making laws and regulations to keep them in business by pretending they were “solvent enough” should have been considered a criminal act in itself, which brings us to the most important mechanic for this deception.\nVoodoo Deregulation\nRichard Pratt. In an Administration religiously committed to deregulation, nobody was more fanatical than Pratt. Many who have interviewed and written about him mention his physical presence: powerful, bull-necked, combative, blustering. He was a starting tackle on the University of Utah football team, and when he did his obligatory missionary work for the Mormon Church in New Zealand he became that country’s heavyweight wrestling champion. In the late 1960s he was chief economist for the S&L lobby.\nAt the age of 44, in 1981, he became Reagan’s first chair of the F.H.L.B.B.; the other two members were a Republican and a Reagan Democrat from Texas. Pratt stayed around the F.H.L.B.B. only a couple of years, but that gave him enough time to issue hell-for-leather rules that ruined whatever chance the industry might have had to recover. Not that everything he did was bad. He authorized federally insured S&Ls to issue adjustable-rate mortgages; if that change had been made five years earlier, the industry might have avoided the massacre of the Carter-Volcker years.\nBut otherwise, Pratt did nothing right. Martin Mayer, who, oddly enough, claims to like Pratt, summarized his F.H.L.B.B. tenure this way:\nIt was during Pratt’s two years as chairman of the Bank Board that the road to hell was paved and polished. He wrote the worst of the regs, and more than any other single person he wrote the Garn-St. Germain bill of 1982 that codified the perverse incentives the government gave the industry. (On its introduction in the fall of 1981, it was known as “the Pratt bill”; it went through Congress like a dose of salts, with virtually no hearings in either Senate or House Banking committees.)… If you had to pick one individual to blame for what happened to the S&Ls and to some hundreds of billions of dollars of taxpayer money, Dick would get the honor without even campaigning.\nThe basic goal of Pratt’s bank board was to keep zombies in business by making them appear to have some net worth when in fact they had none or had less than the law required. About 800 thrifts failed to meet the net-worth requirement in 1982. The bank board could have put them out of business, but instead it simply changed the accounting practices to falsify their net worth or, as Mayer puts it, the board “designed a program that permitted decapitalized thrifts to pretend they still had some of their own money in the game.”\nAmong the clever techniques were the following:\n(1) The “net worth certificate” program. In effect, as Mayer says, this allowed the S&Ls to print their own capital. How? By swapping paper with the F.S.L.I.C. The S&Ls gave the F.S.L.I.C. worthless notes, and in return the F.S.L.I.C. gave the S&Ls notes as good as money, which could be considered part of the S&Ls’ net worth.\n(2) “Good will.” It worked like this: The F.H.L.B.B. announced that instead of closing the insolvent thrifts, it would make them whole through mergers. It would merge healthy thrifts with failing thrifts, merge marginal thrifts with stone-broke thrifts or, yes, it would perform the greatest miracle of all by blending several insolvent thrifts.\nHow could they make one healthy thrift out of several deathly sick ones? Easy. The bank board simply credited the broke thrifts with enormous amounts of “supervisory good will”–customer loyalty, share of market and other voodoo trinkets–and allowed the thrifts to count this as part of their capital base. It was a shell game. The good will was an ersatz asset, totally meaningless and worthless–except as a bookkeeping device to keep the broke thrifts in business. By 1987, nearly 45 percent of the thrift industry’s net worth was “good will.” Many thrifts are operating today, some profitably, some not, that could never meet federal standards for capitalization if “good will” were deducted from their books. Talman Home Federal Savings and Loan, the largest thrift in Illinois, has half a billion dollars’ worth of good will on its books.\n(3) Another scam was the bank board rule that S&Ls could add “appraised equity capital” to their books. Let’s say a Dallas S&L came to own, through foreclosure or purchase, an abandoned airport out in the West Texas desert that was worth, at most, $20,000. The new rule allowed the S&L to count that commercial property as capital. But wait! If it got a crooked appraiser to jack up the value to outlandish heights, or if it teamed up with other crooked S&Ls to trade commercial property back and forth at fraudulently inflated prices, the Dallas S&L could transform a nearly worthless airport that was nothing but a tin building and a pasture of tumbleweeds into a half-million in “capital.” For each new dollar of capital created by reappraising owned property, bank board rules allowed an S&L to raise from the public $33 in deposits.\nSo, with its artificially created half million on the books, the Dallas S&L could call up Wall Street money brokers and offer an exorbitant interest rate that would persuade the brokers to deposit $16.5 million in hot money–all insured by you and me–which the Dallas S&L could then turn around and spend any way it wanted, ad infinitum, or at least ad bankruptcy.\nIt becomes clear that subordinate professionals–particularly appraisers and public accounting firms–played a key role in creating these frauds. Their presence is everywhere in this sordid history. With only slight exaggeration, William Greider says of the public accountants and auditors, “They were on the take, every one of them. Without exception.” And Stephen Pizzo, one of the Inside Job authors, adds: “I’ll tell you this–deregulation unleashed a tidal wave of corruption across the country….Appraisers, for example, figured out they could raise their standard of living just by raising their opinion of value. Slip the guy another $25,000 and suddenly a $200,000 piece of property is worth $20 million. It’s very simple.”\nA purple example of the part played by appraisers: In 1977 J. William Oldenburg, with a down payment of $80,000, bought 363 acres of land in Richmond, California, for $874,000. Two years later he hired the “right” appraiser, who certified that the land was now worth $32.5 million. That was the first step. The second step was to rehire the same appraiser in 1982 and get an update. This time, sure enough, the appraised value had soared–to $83.5 million. But who in the world would buy it for even a large fraction of that inflated price? Oldenburg supplied the answer by purchasing the State Savings of Salt Lake City, for $10.5 million, which in 1984 bought the land for $55 million. Only in America.\n4.\nBROKERED AND JUNK GROWTH\nSo now all the ducks were in order. Twenty-five percent of the nation’s thrifts were insolvent, but the new “regulatory accounting” that created funny money would cover that up and keep them in business. As for the rest of the industry, it was flying free and easy. Most regulations had been wiped out, and the regulators were disappearing too. There had been more than 700 federal examiners watching over the country’s 4,002 thrifts in 1980; four years later, with twice as many insolvent thrifts to handle and with S&Ls now empowered to do the complex business of commercial banks, Reagan’s budget cuts reduced the number to 679.\n“As the industry deregulated,” Inside Job tutors us, “inspectors accustomed to examining nearly identical sets of books at each thrift, books based on simple 30-year home mortgages, suddenly were expected to be able to follow the intricate machinations of highly speculative finance. Examining a $20,000 loan on a home was a far cry from trying to judge the quality or prudence of a $20 million loan on a shopping center or a multi-tiered master limited partnership.”\nThe regulators got so far behind that they tried to do their supervision by mail: asking for data, challenging it and waiting months for an answer, which often never came. Generally speaking, the only restraint on S&L operations was whatever professional morality the managers might be imbued with.\nThose who were unimbued could skim at will, dip into the till, make loans to themselves that they never intended to repay and make loans at usurious rates to other gamblers who proposed wild and hopeless projects from which the S&L owners could take kickbacks and enormous up-front payoffs. One developer went into Neil Bush’s Silverado S&L, for example, and asked to borrow $10 million. The managers said to him, “We won’t lend you $10 million. But we will lend you $15 million, if you will take that extra $5 million and buy some of our good stock.” And with that concocted infusion of “new capital,” the easygoing chaps at Silverado could launch another round of financial fun.\nWho cared if they were never paid back? Who cared if the house went bust? The F.S.L.I.C. and the F.D.I.C. (the Foolish Dumb Innocent Citizens, as Jay Leno translated the initials) would pick up the tab. The only thing needed to complete their happiness was loads of money. By no accident, such money had been available since 1980, from deposit brokers.\nHistorically, as we have said, S&Ls got their money from wage earners, small depositors, people in the community. It was the kind of source that allowed only slow growth, but it was safe growth. Regulations forbade an S&L from taking more than 5 percent of its deposits from money brokers, those Wall Street hustlers who were hired by pension funds, insurance companies, credit unions and government trust funds to find the highest interest rates anywhere in the country. They moved billions of dollars every day, but these were transient, volatile funds–“hot money,” it was called. The old 5 percent cap was to protect S&Ls from being lured too far down those dangerous billion-dollar paths.\nIn 1980 the bank board, pressured by the S&L lobby, killed the 5 percent rule and gave S&Ls the freedom to take all the brokered money they could get their hands on. Two years later, Garn-St. Germain made it easy to go after the brokered money by removing the last controls on interest rates.\nZombie thrifts, having nothing to lose, sought the brokered money by offering the highest, most unrealistic interest rates, thus forcing more conservative thrifts to follow, thereby endangering them, too. Using this hot money, some thrifts grew like cancers. In one year, forty thrifts grew 1,000 percent. Texas thrifts grew three times faster than the national average.\nNaturally, as with every aspect of the S&L adventure, the brokering of funds attracted the seamier element of society, from Merrill Lynch to Mario Renda, the latter being one of Inside Job‘s most colorful villains. A former tap-dance teacher and Boy Scout executive, Renda was a clever dog who immediately saw the potential of the new spirit of S&L greed. His technique was to go to thrifts and say, “If you will make loans to certain borrowers that I send to you, I will supply the money to lend to them.” Many of these pre-specified borrowers, it turned out, were members of the Mafia or kindred souls, and he was in effect laundering their money. But the S&Ls didn’t care. They snapped up the offer. Before he was arrested in 1987, he had brokered $6 billion to 3,500 institutions (some of which were commercial banks).\nOne can’t speak of brokered money without mentioning high-risk, high-interest “junk” bonds. Closely correlated with the fall of the S&L industry was the rise of the junk-bond industry, centered around the incredibly corrupt investment banking firm of Drexel Burnham Lambert, now in bankruptcy. It’s doubtful that the S&L scandal would have grown beyond the size of a large bunion on the foot of Miss Liberty if brokered money hadn’t been so available, and the same can be said of junk bonds, which the brokered money often went to purchase. As of last year, S&Ls owned $14 billion worth of junk bonds.\nInvestigators keep dropping their buckets into the Drexel cesspool and coming up with ties to some of the most notorious failures (Silverado, Lincoln, CenTrust, San Jacinto S&L) and with such corporate raiders as Ronald Perelman and the Belzberg family and the Bass brothers, all of whom, with the very questionable and secret assistance of the bank board, now own giant junk-bond-encrusted S&Ls, which they bought from the government during its infamous “fire sales” of 1988.\nTwo dozen of the largest thrifts went absolutely bonkers–each buying more than $100 million in junks. The ten largest gamblers in junks either went bust, had to be merged or are on the brink of insolvency.\nWhen Charles Keating, for example, wanted to buy Lincoln Savings and Loan, he simply solicited Drexel’s evil genius, Michael Milken, to market $50 million in junk bonds. “By the time Lincoln went broke six years later,” writes Jerry Knight in The Washington Post, “Keating had leveraged the original $50 million from Drexel into $454 million worth of junk bonds–$374 million of them bought from Drexel and Drexel clients.” Among the junk bonds Lincoln dealt in were those financing Robert Campeau’s purchase of Allied Stores and Federated Department Stores and the buyout of Eastern Air Lines, which, one and all, like their patron, went bankrupt.\nIt was, you see, an incestuous affair. Drexel had an intimate relationship with both sides of the ledger. The S&L crooks sold junks through Drexel to get the money to go into business, and then they gorged on junks bought through Drexel to get the high interest they needed for their Ponzi-like growth. Nowhere was this technique more dramatically used than in the founding and foundering of CenTrust Savings Bank of Miami, Florida.\nSix years ago David Paul bought a dying thrift and turned it into the nation’s twenty-third largest, with Drexel offering as many services as The Mikado‘s Pooh-Bah. Knight reports: “As CenTrust’s investment banker, Drexel raised $150 million of the thrift’s capital by selling junk bonds. As CenTrust’s bond broker, Drexel sold the thrift almost $1 billion worth of junk bonds. And as a customer, Drexel borrowed $15 million on an unsecured loan.”\nYou and I are paying for all that hocus-pocus. And what did we get for our millions? A little soap opera starring Paul, who was such a pretentious, phony bastard that it was only natural for him to select glitzy Miami as the place to do his business. He fitted right in and was embraced by The Miami Herald and by the highest level of the city’s moneyed establishment even after a local business daily, the Miami Review, pointed out that his reputation had been built on strange fictions. Paul had falsely claimed to have a Ph.D. from Harvard and an M.B.A. from Columbia. He had falsely claimed that the Citicorp and American Express buildings in New York City were among his “most successful real estate projects.” He had claimed that his mother, a Jew, was really a Catholic.\nBut if it was offended, Miami’s upper crust nevertheless went right on attending his princely galas, such as a party for the New World Symphony at which guests chomped on 1,800 stone crab claws, 1,500 lobster tails and 150 Peking ducks. When Elizabeth Taylor came to Miami for an AIDS fundraiser, CenTrust contributed $50,000 and Paul gave Liz a party on his $7 million, ninety-six-foot yacht.\nWith CenTrust gone belly up, you are now helping to pay for the yacht, for the 24-karat gold-leaf ceilings and gold-plated toilet pipes in Paul’s office building and for all of Paul’s good times.\nMeanwhile, State Thrifts Go Mad\nWhile the bank board and Congress were deregulating the federally chartered S&Ls, some of the states were just as busy doing the same. None did it more recklessly than Texas and California. Bear in mind that while state-chartered S&Ls may for a fee enjoy the safeguard of federal deposit insurance, they get to enjoy the freedom, or anarchy, of state regulation. State regulators are usually hacks and are often bought off. Like many of their federal counterparts, they are underpaid, undertrained, demoralized, confused. They did their jobs poorly before the 1980s deregulations, but they had impossible jobs thereafter.\nIt had always been easy to buy a Texas S&L; all you had to do to get a state charter was prove that you weren’t in prison at the moment you applied. In the new deregulated environment, it was even easier. Now everyone was buying into the game, particularly real estate developers, who brought to the industry the strong sense of social morality for which they are celebrated. By 1987, 80 percent of Texas thrifts were run by former real estate developers.\nBy the mid-1980s, the adventures of Texas S&L operators were becoming legendary. As Inside Job tells it, there were stories “about thrift board meetings attended by hookers whose services were paid for by the thrift, chartered jet-set parties to Las Vegas, gala excursions to Europe, luxurious yachts, ocean-front mansions, and Rolls-Royces–princely life-styles built on mountains of bad loans and bad investments…. In the newly deregulated environment new thrifts had sprouted throughout Texas like rye grass after a spring rain. Old, long-established thrifts were snatched up by young speculators eager for the opportunity to wheel and deal with insured deposits.” They weren’t interested in giving the traditional single-family housing loans. Hell no. It was skyscrapers–office buildings and condos–they were interested in.\nIf possible, California became even more of a wildcat state, especially after 1983, when the California legislature passed the Nolan Act, with only one politician in each house in opposition, a proportion that hinted at wholesale bribery. The act (sponsored by Republican caucus chair Pat Nolan, who later resigned when the F.B.I. released a film showing someone taking money on his behalf in a sting operation) made California as freewheeling as Texas, with just about anyone eligible to buy an S&L, lure deposits any way possible and blow the deposits on any whim, comforted by the knowledge that this marvelous adventure in Reaganesque capitalism would be insured by the full faith and credit of the United States government.\nLeading the California orgy was Lawrence Taggart, who had been a vice president of Great American First Savings Bank in San Diego (the thrift that so generously overlooked Edwin Meese’s mortgage debts) and who in 1983 became the new state Republican administration’s Savings and Loan Commissioner. By the time he took office the California industry was well down the road to boom/chaos. With virtually no regulation, some thrifts leaped from the minimum required starting fund of $2 million to a couple hundred million bucks overnight and to more than $1 billion in deposits within five years, much of it floating on some extremely leaky deals.\nFar from being worried, Taggart (“I was pro-business,” he says with the magnificient understatement) encouraged the industry expansion. In his first six months in office, he approved sixty charters, 210 in a year and a half. Last year, testifying before the House Banking Committee, Taggart was asked how many of the thrifts he had chartered later failed. His response: “Take your pick, Congressman.”\n5.\nGRAY AND OVERCAST DAYS\nLet us return now, while the looting goes on apace, to see what is happening at that citadel of incompetence, the bank board. In our last episode, you will recall, the incomparable deregulator Richard Pratt had done his dirty work and then quit in 1983.\nEdwin Gray was his successor. The thrift industry lobby picked Gray to chair the board, and of course the White House went along with the idea. I started to say “went along with the gag,” because the lobby considered Gray to be something of a joke. “They thought I was going to be their patsy,” Gray admits. After all, he was reputed to have the talents only of a goodwill peddler, a go-along-get-along sort of mushhead. As one of his friendlier critics said, Gray had the attention span of a doorknob. At least that was the way he appeared when he was press secretary to Reagan during Reagan’s California governorship and later when Gray handled public relations at Taggart’s thrift in San Diego. Gray was a firm believer in dereguation and had lobbied on behalf of Garn-St. Germain. So the crooks saw only blue skies ahead as Gray was sworn in for a four-year term by his old pal Ed Meese.\nAnd for quite a while it appeared that their judgment of him was accurate. No sooner did he have his name on the bank board’s door than Treasury Secretary Donald Regan, an alumnus of the Merrill Lynch gang that was doing so well with brokered deposits and junk bonds, called him on the phone and demanded to know if he was going to be a “team player” (apparently meaning one who would overlook the rot of the financial world); Gray assured him he would be. Early on, sounding like an indulgent uncle, he promised S&L operators, “We are going to allow you to do a lot of new things.”\nFor a time, he was blind to the corruption, deaf to warnings. A little over two months after becoming chair, Gray made a trip to Texas specifically to encourage a convention of S&L owners to exploit–as if they weren’t already–their emancipation from traditional restraints on how they could attract deposits and lend money (the title of his speech: “A Sure Cure for What Ails You”).\nOn that trip he was taken aside by Texas Savings and Loan Commissioner L. Linton Bowman 3rd. Bowman tried to warn Gray about the grotesque, frightening explosion of new growth in East Dallas, where miles and miles of unoccupied apartments and condos were already crumbling and vandalized, all of them empty but with junkyard cars parked in front to make it appear they were occupied. This wasteland had been the recent handiwork of Empire Savings, which, with brokered deposits and some razzle-dazzle bookkeeping, had grown in the blink of an examiner’s eye from a petty $20 million thrift to a bloated one of $330 million in “assets.”\nGray wasn’t interested in Bowman’s warning. Empire’s chair, Spencer Blain, had brought Gray into Dallas from the airport and Gray had noted with some surprise that Blain was driving a Rolls-Royce and wearing a $5,000 Rolex. Gray mentioned that he had never known a thrift operator with such luxuries, but Blain shruggingly explained, “We’re just very profitable down here in Texas,” and Gray was willing to believe it. After all, would Blain be living a lie–good ol’ Spence, who had been a bank board director for four years before running Empire?\nTeam player Regan remains unrepentant about his responsibility for the Looting Decade. The problem, he insisted in testimony before the House Banking Committee on September 30, 1990, was too much regulation, not too little. Incredibly, he claimed that restrictions that “limited the ability of U.S. banks to diversify their loans outside their localities…made them extremely vulnerable to regional economic troubles.” All such restrictions were actually removed in 1980.\nOut of Control\nA year later, Empire would be bankrupt and in receivership, the biggest insolvency caused by fraud in the F.S.L.I.C.’s fifty-year history. Losses in deposit insurance would total at least $165 million. Blain and a half a dozen S&L associates would be indicted for racketeering and fraud. Prosecutors said the bankers had been particularly expert at “land flips”–selling land back and forth to inflate its value artificially (one 117-acre plot increased in value from $5 million to $47 million in a few weeks of flipping).\nBy the time the Empire fell, Gray had begun to doubt the wisdom of thrift deregulation. Cautiously he had begun to speak out about its dangers. The Empire debacle turned him around completely. Because of his turnaround, the authors of Inside Job portray Gray as a hero. That judgement is excessively kind unless it is made simply to compare him to the depravity and willful incompetence of most Reagan-Bush appointees. But give him his due: Unlike virtually all other Reaganesque true believers, Gray was willing to change his religion when confronted with overwhelming evidence.\nBut still he took no drastic actions. Partly this was because he was understandably scared shitless. There was almost a trillion dollars riding on the nation’s thrifts, and the F.S.L.I.C. now had only a ridiculous $2 billion to cover losses. What if, by getting tough, he tipped over the precarious thrift structure and created such a panic among depositors that they started a run he couldn’t stop? Two billion dollars certainly wouldn’t begin to handle a string of major failures. He decided to go easy until he had more money at F.S.L.I.C. Though his caution was, in that context, understandable, the harsh fact remains that for the first two years of his term, the bank board issued not a single rule to cure the industry’s sickness.\nGray spoke up–which was enough to earn him the enmity of Don Regan and others in the White House who began to circulate ugly rumors about Gray in an effort to chase him from Washington–but he did not act. Finally, in February 1986, he could wait no longer. His enforcement chief had informed him that Texas was going down the tubes. Federal regulators there were overwhelmed. Reagan’s budget cuts had resulted in the firing of two-thirds of the examiners in District 9, which covered five states, including Texas. Twelve agents and supervisors were supposed to keep tabs on 300 institutions. Some of them hadn’t been examined in three years. The situation, particularly in Texas, was out of control. Fraud and insolvency had reached plague proportions. In March, 250 federal examiners hastily recruited from all over the country arrived in Dallas to inspect the books of every suspicious S&L in the region. Heading this emergency army was Joe Selby, a white-haired birdwatcher of deceptively benign appearance whom the crooked thrift bosses soon began calling the Angel of Death. He would not put up with their tomfoolery, their crazy excuses and their whining requests for more time to “straighten out” their hopelessly fraud-laden books.\nTomfoolery is not quite the appropriate term to apply to the business operations of such gents as Don Dixon. In the financial red-light district, Dixon was considered a hometown boy who made very, very good. He grew up in Vernon, Texas, near the Oklahoma border, and after some downs and ups in the construction business he was wealthy enough to think about buying a savings and loan. But he wasn’t wealthy enough to actually do it on his own. So he turned to a close friend who did have all the money he needed: Herman Beebe (whom you will meet again in the section on the Mafia).\nWith the kind of sloppy sentimentality that sometimes afflicts outlaws, Dixon decided the thrift for him was his hometown Vernon Savings and Loan. It was a good choice: With $82 million in assets and only $90,000 in delinquent loans, Vernon Savings was rated one of the soundest in Texas. Assuring the old owners (who had babied the thrift like a house plant for the past quarter-century) that he intended to keep it in the service of Vernon, Dixon bought controlling interest for $1.2 million down and a note (which would never be paid).\nThereupon, Dixon promptly broke his word by moving the thrift to North Dallas, which was becoming the capital of financial con men, and went into high gear funneling brokered deposits into doctored loans on high-risk commercial real estate ventures. No more of those corny family home loans for him. Dixon pumped so much helium into Vernon Savings that by 1986 it reported $1.3 billion in assets–a mere 1,600 percent growth rate in four years. And for most of those four years Reaganesque bank regulators, far from suspecting something phony in such growth, pointed to Vernon as a prime example of miracles that could be accomplished via deregulation. But behind the Vernon “miracle” was the usual Ponzi operation, plus some fraudulent bookkeping. In 1985 the thrift reported $36 million in bad loans. Accordng to Inside Job, regulators would later learn the correct figure was $212 million.\nTo get his hands on the millions flooding into Vernon, Dixon set up Dondi Financial Corporation, which became the nominal owner of Vernon but which he controlled, and thirty subsidiary companies which had nothing to do with Vernon and were thereby free to receive loans from it, which they did with a vengeance. As for Dondi, it creamed off $22 million of the $22.9 million in dividends declared by Vernon in three and a half years.\nThese millions did not lie fallow; Dixon shoveled them into a glorious whoop-de-do that made him so celebrated that surely even the densest of S&L examiners must have got wind of it and wondered. Didn’t they think it odd that this parvenu thrift operator suddenly had available for his use a $1.9 million chalet in Colorado, a $1 million beach house north of San Diego, a $2.6 million yacht (the High Spirits, sister ship to the President’s Yacht, Sequoia), a fleet of six airplanes that in three years cost Vernon Savings $5.5 million to lease and operate, and a $2.4 million hunting lodge, equipped with, among other things, $40,000 worth of handmade Italian shotguns? (Dixon and friends shot quail shipped in from Illinois, their wings clipped so they couldn’t fly from the hunters.)\nToday the government is making a big to-do about charging Dixon with enough fraud counts to hang him by his thumbs for 190 years and fine him $9.5 million, if convicted. But where were the federal regulators when Dixon was openly having such Dionysian fun (like paying women $10,500 for their company at a California beach party), which left us with a $1.3 billion bill when his S&L failed? The total damages the government is trying to recover from Dixon and his associates–who are accused of pocketing at least $40 million–represent, according to the F.B.I., more than what all the conventional bank robbers in the entire country reap in a typical year. Didn’t such an elaborately visible looting pique offical curiosity?\nFor four years the bank board and its regulators didn’t try to lay a hand on him. Bureaucratic inefficiency was one reason, of course, but we may also fairly assume that Dixon had a phenomenally long run with our money because many important people enjoyed his hospitality–folks like Gerald and Betty Ford, who freeloaded several trips on Dixon’s planes; Representative Jack Kemp of New York; California’s Senator Pete Wilson and Representative Tony Coelho; Senator Paul Laxalt of Nevada, one of Reagan’s closest pals; and some very potent lobbyists. And of course that unforgettably greedy Texas populist, Jim Wright.\nWhen Dixon’s yacht docked at Washington, D.C., which it did every year, you could hardly keep the Texas politicos away. As for Coelho–who eventually quit the House to avoid an investigation of favors he received from California S&Ls–he often used the yacht for partying with fat cats he hoped would give to the Democratic Congressional Campaign Committee, which he chaired.\nThe Wright Stuff\nBut nobody used the yacht more than Tom Gaubert, a Dallas multimillionaire who was such a generous contributor to Democratic causes and was so good at raising money that Coelho made him treasurer of the D.C.C.C. Gaubert used the High Spirits so often he took to calling it “my boat.” He raised a great deal of money–largely from Dixon and other scurvy S&L operators–to help win a Texas Congressional race for the Democrats that was particularly important to Wright. Gaubert understandably felt Wright owed him a big favor in return. The favor he asked had to do with his ambitions as an S&L operator.\nGaubert had paid $1 million for a tiny S&L in Grand Prairie, which is between Fort Worth and Dallas. Like Dixon and others, Gaubert used brokered $100,000 CDs to increase his S&L’s assets quickly from $40 million to $223 million. He then asked bank board regulators to let him buy another S&L and twenty-two branches of a third, which would give him $1.3 billion in federally insured deposits.\nBrooks Jackson writes, “It was a brassy request, considering the fact that he was under grand-jury investigation of suspicion of having swindled another S&L out of millions.” Indeed, some federal investigators flatly considered Gaubert a crook. Nevertheless, with the help of his Congressional friends he successfully delayed the bank board’s effort to end his control of the combined billion-dollar operation, renamed Independent American.\nBut his ownership was never secure because regulators kept discovering that Independent American had some very unsavory lending practices and kept books that weren’t even remotely accurate. In May 1987 federal authorities, finding that 40 percent of Independent American’s loans weren’t even drawing interest and that the thrift was probably half a billion in the red, placed it in receivership.\nBefore that happened, Gaubert kept hounding Wright to make Gray call off his investigators. Dixon, and dozens of other Texas thrift owners, were demanding the same thing. They told Wright that Gray had assigned a bunch of homosexual lawyers to harass them. Wright, treating Gray as though he believed the charge, forced him into several humiliating compromises.\nEven after Dixon and Gaubert’s thrifts had gone bankrupt and Wright could help them no more, he got his revenge on Gray–and pleased members of the U.S. League of Savings Institutions–by torpedoing the bailout legislation of 1987.\nThe bill would have allowed the issuance of $15 billion in bonds floated on Wall Street, with the bonds to be paid off from extra fees assessed the S&Ls. The bond money would be used by the F.S.L.I.C. to close insolvent thrifts. But the industry was against the bill. Shaky S&Ls correctly feared the money would be used to shut them down; healthy S&Ls rebelled at the idea of higher fees–they wanted taxpayers to pick up the tab instead.\nWhen Speaker Wright finally allowed the bailout bill to pass the House in May 1987, but with only a measly $5 billion, it was worse than useless because it included a “forbearance” provision that in effect was a promise that insolvent Texas thrifts would get a long stay of execution.\nIt was symptomatic of the perspective of Congress that Wright was not hounded from the speakership and from Congress by a House Ethics Committee interested in his enormously costly pimping for the thrift owners; the committee instead focused mainly on his petty cheating. And it was symptomatic of the press’s narrow perspective that few editorial writers noted that Wright was, as politicians go, a potentially great one, destroyed by his weakness for easy payoffs. After it was all over, he told his daughter, “We were just greedy. Dammit.” He had always been greedy, and there had always been a special interest ready to feed his greed. Not counting the millions in “soft” money spent on him indirectly, the thrift and real estate industries admitted giving gifts to Wright of $274,000 in the three years before he left Congress. With that money, they bought an extra year of looting. But they also ruined the reputation of a Speaker whose brief two years in the sun, the 100th Congress, were arguably more productive than any other period since the heyday of the Great Society in the 1960s.\n6.\nCHARLES CHEATING JR.\nThe interminable bullying by Speaker Wright was one of the two events that made Edwin Gray’s last year as chair of the bank board so memorably awful. The other was his confrontation with Charles Keating Jr. and the senators known as the Keating Five. Like many of his other troubles, Gray brought the Keating misery on himself.\nIf any one hustler was the living symbol of the underlying rot of the savings and loan industry as created by Congress and Reagan’s bureaucracy in the 1980s, it was Charles Keating. He was pious, he was a devoted family man–and he was lawless. He believed the main purpose of politics was to make people like him rich. Although Keating eventually wound up, by hook or by crook, a very wealthy fellow, it was a failed wealth. Everything he ever did was, in a way, a failure. Twenty years ago, he got one of President Nixon’s most meaningless appointments–to the President’s Commission on Obscenity and Pornography. Ten years ago he briefly managed one of the biggest and most costly busts in politics: John Connally’s campaign for the presidency. Nine years ago President Reagan tried to make him Ambassador to the Bahamas, but the nomination fell through when the press resurrected a 1979 scandal. It seems that Keating and his boss, Carl Lindner of the multibillion-dollar holding company American Financial Corporation (“A holding company,” as Will Rogers once explained, “is a thing where you hand an accomplice the goods while the policeman searches you”), had been charged by the Securities and Exchange Commission with fraud in making millions of dollars of improper loans to insiders and friends. Keating got off by promising he wouldn’t do that sort of thing in the future.\nFive years ago he and his family were worth $100 million, at least on paper. Today Keating claims to be broke (by which he means he had to sell his yacht and some of his wife’s diamonds), but he still lives and travels in high style, followed by a retinue of costly lawyers. Whatever money he has, his reputation is shot. Mother Teresa probably won’t be dropping by to give him another crucifix, as she once did (after Keating gave her $1.4 million). Most people would probably agree with the Chicago Tribune‘s assessment of Keating as “the greediest man in America,” and with the Resolution Trust Corporation, which in its $1.1 billion racketeering suit against him said he had “an evil mind.”\nIn 1976 Keating bought American Continental Homes in Phoenix from Lindner and became a highly successful real estate developer, who trained for his later dealings with Congress by contributing as much as $25,000 to a mere city councilman’s race. Developers do, after all, sometimes need to get permits from city governments.\nWhen the savings and loan industry was deregulated in the early 1980s, Keating saw a window of opportunity as big and as gloriously brilliant as the stained glass of Sainte-Chapelle. Saying that he was certain that he could “profit immensely,” in 1984 he bought for $51 million the old-line Lincoln Savings & Loan of Irvine, California, which had assets of almost $1 billion. Money for the purchase was obtained, naturally, by everyone’s favorite junk-bond swindler, Michael Milken of Drexel Burnham Lambert.\nHow could a guy who only five years earlier was battling the S.E.C.’s fraud charges, which he escaped not by proving his innocence but by promising to behave himself, wind up with a savings and loan? Why would the bank board approve such a purchase? It was one of the blackest marks on Ed Gray’s record, hardly lessened by his claim of ignorance: “I had never heard of Charles Keating. Didn’t hear of Charles Keating until sometime later. There are a lot of Lincoln Savings in America. That meant nothing to me.”\nTo win bank board approval of his purchase, Keating lied, lied, lied. He said he would keep Lincoln’s experienced managers; he said he would continue to concentrate on home mortgages in Southern California. But immediately on taking over he fired the managers and quit making home loans. He began doing what so many of the scoundrels were doing–getting the big brokered funds and investing them in wild schemes.\nApparently the network of federal home loan banks never made follow-up checks to see if the people granted S&L charters kept their word. If the San Francisco home loan bank, which had jurisdiction, had done a follow-up, it would have seen that from the very beginning Keating intended to make Lincoln his personal piggy bank. One of his first gambles was on a hunk of land outside Austin, Texas, a deal in which his old pal John Connally was involved. Connally defaulted, leaving Lincoln (and now the taxpayers) holding a $70 million loss on the land.\nSome of the other early loans and joint ventures, a total of $134 million, went to companies owned by Lee Henkel, who had been Keating’s friend since they worked together on Connally’s campaign. Keating surely must have thought his investment in Henkel would pay off when, in 1986, Keating got Reagan to appoint his buddy to the bank board (in part by getting one of his patsies, Senator Dennis DeConcini, to lobby Don Regan). There, according to Gray, Henkel “proposed a regulation that appeared to us could only benefit Lincoln Savings”–the proposal being made just a few weeks after Lincoln paid Henkel’s personal blind trust $3.7 million for 25,000 shares of stock in one of Henkel’s companies. (Insisting that his intentions had been completely honorable and misunderstood, Henkel resigned a few months later.)\nMuch of Lincoln’s money was spent through the S&L’s parent, American Continental Corporation, which became a developer of grandiose planned communities, resorts and hotels. The most infamous of the planned communities is Estrella, 20,000 acres in the Arizona desert that was supposed to be home to 200,000 tanned and happy residents.\nLooking at Lincoln’s books, one would have assumed that Estrella was making enormous profits from land sales; what the books did not show, say government examiners, was that Lincoln hired straw buyers and gave them money to buy the land at grossly inflated prices. It was a marvelous bit of abracadabra: the creation of “profits” by giving money away, after which these “profits” launched another wave of borrowing and lending, et cetera. Pure Ponzi. Today you and I own those 20,000 acres, still inhabited only by coyotes and jack rabbits, and we are spending about a million dollars a year just to keep the landscaping in shape.\nAs mentioned earlier, Keating was a great family man. At least ten members of his immediate kin were on the payroll of American Continental. The Keating family as a whole reaped at least $34 million in salaries, bonuses and stock sales.\nAlan Greenspan and the Five Stooges\nKeating’s biggest troubles with the government began when Gray, in one of his smartest moves, ordered in 1985 a radical reduction in the amount an S&L could invest directly in a project. Lincoln was already $600 million over the maximum set by Gray. Furious and frightened, Keating went to work in his usual style to have Lincoln grandfathered under the new rule.\nFirst he tried to get Gray out of the way by offering him a job at $300,000 a year. When that didn’t work, he began calling in political chits. Descending on Washington, Keating went to see Vice President Bush (aides said nothing of importance was discussed).\nThen Keating hired Alan Greenspan–whose conduct as a sleazy peddler of endorsements in this affair bodes no good for the future of the Federal Reserve Board, which unfortunately he now chairs–to write letters to Congressmen and to the bank board arguing that Keating’s desires should be met because he was a financier of infinitely sound judgment and ethics. Greenspan enclosed with his letter a report by the notorious accounting firm of Arthur Young; the Arthur Young agent who wrote the report later went to work for Keating at a salary of nearly $1 million a year.\nFinally, in April 1987 Keating called in his five senatorial stooges: Alan Cranston of California, John McCain (whose wife and father-in-law were partners with Keating in a shopping center) and DeConcini of Arizona (DeConcini’s campaign manager’s company got loans totaling $68 million, some now delinquent, from Lincoln), John Glenn of Ohio (Keating hired three of Glenn’s former staff members as lobbyists and lawyers) and Donald Riegle Jr. of Michigan. Of course they would later deny that the $1.4 million they received from Keating and his associates had anything to do with their actions, but they got plenty rough with Gray: What the hell were he and his regulators doing, harassing this good man? Officials from the San Francisco home loan bank were summoned to Washington one week later to be given a further going-over by the Keating Five.\nThe West Coast regulators called their bluff. They came to the meeting loaded with evidence that Lincoln should be taken away from Keating because it had become a rogue institution operating in an unsafe and illegal way, stuffing its files with postdated documents, doing no credit checks on its borrowers and lending money with phony appraisals or with no appraisal at all.\nNevertheless, despite this evidence, Keating was about to win the battle. A couple of months after these encounters, Gray’s term as chair ended and he was replaced by Senator Garn’s protégé, M. Danny Wall, one of the chaps who had written the disastrous Garn-St. Germain bill. The S&L lobby would not have a more dedicated friend. The Wall Street Journal later called him “The S&L Looters’ Water-Boy.”\nFirst he took the Lincoln case away from the San Francisco office and buried it in Washington. Then he killed Gray’s direct investment limit and some of the other reforms Gray had proposed. The upshot was that for another two years Keating and his gang at American Continental were allowed to loot Lincoln until it was hardly more than a shell. In April 1989 American Continental declared bankruptcy and the next day the government seized Lincoln. The failure of this thrift is expected to cost taxpayers $2.5 billion, much of the loss due to Wall’s delay in closing it down.\n7.\nPLENTY OF WARNING SIGNS\nEd Gray is probably not exaggerating in the slightest when he says of the S&L lobby, “The fact is … when it came to thrift matters in the Congress, the U.S. League and many of its affiliates were the de facto government. What the League wanted, it got. What it did not want from Congress, it had killed…. Every single day that I served as chairman of the Federal Home Loan Bank Board, the U.S. League was in control of the Congress as an institution.” And that, he says again accurately, is why Congress, “compromised by campaign contributions … did nothing year after year” to resolve the problem.\nNevertheless, Edward Kane is equally justified in tying the can to Gray’s tail by pointing out that as boss of the bank board he could have tried to overcome Congressional resistance by using his official position “as a ‘bully pulpit.’ A top official could develop persuasive data with which to alert the press and therefore the taxpayer as to the extent and dangers” of industry conduct “and plan to resign pointedly if Congress refuses to come around. If evidence developed that Congress chose to believe old friends and supporters within the thrift industry over his top regulatory officials, a conscientious regulator should find this to be an intolerable situation.”\nObviously, Gray did not find it an intolerable situation. He stayed to the end of his term in 1987. And although by sticking around he did manage to put in place a few reform rules, he could probably have done much more for the cause of industry reform if he had, as Kane recommends, raised holy hell on his way toward resignation, and continued to raise hell thereafter.\nIndeed, some think Gray would have been wise to arouse Congress by pulling the roof down. “If there’s one point to fault Ed on,” says Eric Hemel, who was Gray’s director of economic policy, “it was that he was not willing to risk a financial crisis in order to really spill the beans on this one. In late 1985, if he had said, ‘This is a house of cards and it’s going to fall,’ he felt that would have spurred financial panic. Did he make a mistake not taking that chance? In retrospect, sure. But at the time it was very hard to knowingly create a national financial crisis on your own.”\nBut Congress shouldn’t have needed bleats of outraged panic from Gray, either on or off the job, or a contrived financial crisis. A very real financial crisis was at hand and signs of it were surfacing everywhere. There was plenty of frightening evidence (had Congress been alive enough to feel fright) that both commercial banks and S&Ls were sliding down a very slippery deregulated slope on the way to disaster. Supervision by federal examiners was at an absurdly low level; incredibly, the number of federal examiners was slashed in 1982, 1983 and 1984, “precisely when the economics of FSLIC’s exposure to zombie risk taking was expanding and becoming harder to assess,” writes Kane. Hundreds of F.S.L.l.C.-insured thrifts went several years without having their books glanced at even once, while most state corps of examiners resembled Keystone Kops.\nFinancial institutions were succumbing to the crazed anarchy. Congress didn’t have to learn that through the bureaucratic grapevine. It only had to look at the statistics: Whereas before Ronald Reagan came to Washington the largest number of federally insured thrifts to fail in a single year (1941) was thirteen, in the first three years of his Administration 435 thrifts were buried and the first full year of Gray’s F.H.L.B.B. watch saw the death of another forty-one. It was a massacre. As for the commercial banking world, in September 1984 the chair of the House Banking Committee, Fernand St. Germain, noted that “56 commercial banks have slipped quietly down the tubes this year–a failure rate rivaled only in the dark days of the Depression.” And if statistics bored Congress, then it could simply read the headlines. Three mid-1980s catastrophes were warning enough of the mindlessness that was gripping the financial world.\nIn Banks We Trust?\nIn 1984 Continental Illinois–with $40 billion in assets the biggest bank in Chicago, the biggest bank in America excluding the two coasts, a bank that Dun’s Review called one of the five best-managed companies in the country because of what many outsiders perceived as its careful controls and high-quality loans–went kaput. It failed because the outside observers were wrong; Continental was rotten with bad management and bad loans.\nMore than $1 billion of the bad loans had been passed along to it in the oil-boom days by little Penn Square Bank in Oklahoma City. Growing by 1,500 percent (largely through brokered funds) in seven years, Penn Square had a reputation as a go-go bank. William Patterson, the senior executive vice president who ran Penn Square’s oil and gas division, had been called “monkey brains” when he was in college. Sometimes he came to work wearing a hat with Mickey Mouse ears. Sometimes he wore a German helmet. He was known around town for drinking beer from his cowboy boots.\nShopping-center banks like Penn Square don’t have the money to make huge loans all by themselves. They have to have help. They go “upstream” to enlist big banks as partners in the loans, just as small bookies pass off big bets to the Mafia. Penn Square’s partner was Continental Illinois, which had such oil fever that its top managers (who, by the way, were the highest-paid bank managers in the nation) issued orders to “buy more, more, more, more Penn Square loans.” Congressional investigators would later learn that Continental did not have loan documents for one-fourth of its oil and gas loans, and had no collateral for half of all its loans. Federal regulators didn’t mind. Every six months their auditors certified the bank to be safe and sound.\nThen the oil boom died. Penn Square died. And within two years Continental Illinois was dead too–the biggest bank failure in U.S. history. Ironically, its death was caused by Penn Square only in the sense that those highly publicized Penn Square dealings had caused the public, particularly foreign investors (who accounted for half of Continental’s deposits), to lose confidence in the bank, and moneylenders can’t survive without the public’s confidence. When a rumor spread around the world that Continental faced bankruptcy (which it didn’t at the moment), the big foreign banks turned rumor into reality by withdrawing many billions of dollars. Rumor killed Continental. Ah, what a disaster was there! If you added together all the deposits of all 10,000 banks that failed during the Great Depression, you would have a bank only one-quarter the size of Continental Illinois in 1984.\nBut federal officials and other major U.S. banks, fearful that if the corpse grew cold it might bring down the entire national banking structure, brought the brain-dead monster back to quasi-life by pumping $9.5 billion into it. The Federal Deposit Insurance Corporation–for the first time ever–guaranteed all deposits at Continental, not just those under $100,000. In fact, to reassure the banking public, it guaranteed all deposits at the twelve largest banks in the country–a commitment of about, gulp, $1 trillion. (Since that traumatic experience, it has been the government’s standard though unofficial policy in virtually all bailouts to cover all deposits, however large, disregarding the $100,000 ceiling. This is in violation of the spirit of the deposit insurance law.)\nUnable to find a buyer for Continental, the F.D.I.C. became its owner. As Judy Woodruff put it, “The nation’s eighth-largest bank had, in effect, been nationalized by the most conservative Administration in fifty years. Nothing like this had ever happened before.” Once again the formula had been capitalism for profits, socialism for losses.\nHardly had the financial world got over the embarrassment of Continental Illinois than it was confronted with two other great embarrassments, this time with S&L networks in 1985. Home State, the largest S&L in Ohio, had invested 43 percent of its assets in a shady Florida firm that went belly up. Ohio S&Ls were then covered only by a state deposit guarantee fund, but Home State’s losses alone depleted almost the whole fund. When depositors heard of Home State’s predicament, they began such a run on all Ohio S&Ls that the Governor temporarily closed them and called on the Federal Reserve for help.\nSo we come back to the question, Did Congress know that the same kind of bankruptcies from stupid, often illegal, loans could endanger the federal S&L insurance system? You bet it did. Representative Charles Schumer, who had no corner on the information, said at the time, “Here’s a scary fact. Just one scary fact. The F.S.L.I.C., the federal system which is much safer because it has the federal government behind it…right now has less, a smaller percentage of assets for each deposited guarantee than the Ohio system had.”\nAnd then, only two months later, came Maryland. Public reports of “management problems”–which the public was savvy enough to interpret as hanky-panky–triggered a run on Old Court Savings and Loan and began to spread so swiftly through the whole system that the Governor had to call a partial bank holiday (all withdrawals limited to $1,000 a month). Maryland’s S&L system, like Ohio’s, was state-supervised and privately insured. In fact, there was virtually no supervision and a totally inadequate insurance system. How did the debacle come about? Maryland’s Attorney General, Stephen Sachs, said it was because “highrollers were shooting crap with other people’s money.” It was the direct result of a “mom-and-pop regulatory apparatus … which has not been able to survive a go-go investment” and deregulatory atmosphere.\nSchumer, in reference to the Maryland rubble, said, “Old Court had over $150 million invested in loans in which the bank was a partner. In other words, the lender and the person getting the loan were the same person. That’s outrageous. No bank is going to check and see if it’s a sound loan if it itself is the owner of the property to which it is lending…. These state insurance systems allow banks and thrifts to do anything under the sun.” But in fact, as he was quick to add, federal regulations were allowing anything under the sun, too: “You have some federally insured thrifts that have huge percentages of their investments in real estate they own…. You have lots of them owning junk bonds.”\nIndeed they did. And the federally insured S&Ls were already collapsing. Some of the biggest and most scandalous bankruptcies had already occurred or were on the brink of happening at the very moment Ohio and Maryland sprang their headline-grabbing leaks. But only a few members of Congress, like Henry Gonzalez of Texas and Jim Leach of Iowa, paid much attention. When Ed Gray asked for more regulators in 1984, Congress ignored him, just as it did when he warned (as early as March) that unless Congress got ahold of the problem it was “very possible that at some point in the future, massive infusions from the U.S. Treasury and, hence, the American taxpayers, may well be necessary to shore up the system.”\nCongress was much more willing to believe–because the S&L lobby paid it to believe–industry finks like Alan Greenspan, who on a Nightline program devoted to the Ohio shutdown was tossed this marshmallow question by Sander Vanocur: “Is there a process of adjustment that every industry has to go through when deregulation takes effect?” Greenspan’s cheerful appraisal: “I would think so, Sandy. The advantages of deregulation will be quite considerable when they’re finally matured. And I think consumers, depositors, people involved with these institutions, will have a far greater range of services when it’s all in place. It is true, we are having a lot of minor difficulties in this process. I think it’s worth it, there’s no question about that.” Then he added one final shill: “I think that the banking and savings and loan community in this country is probably as solid as one could get in any type of institution.”\nAt that moment, hundreds of banks and S&Ls were failing in the largest depository wipeout since the Great Depression. And the S&Ls, with their shabby little billion-dollar Ponzi schemes, couldn’t touch the Ponzi scheme then (and now) in operation among the international bankers, who had made, by investment banker Felix Rohatyn’s calculations, a trillion dollars’ worth of shaky loans to gamblers like Nigeria, Mexico, Brazil and Argentina. Rohatyn’s description of the situation in 1985 was the purest Ponzi: “A thousand billion dollars. It’s a great deal of money. And we are on this kind of treadmill where we have to keep lending more and more money to these countries [with the loans on the banks’ books as “assets”] or to these borrowers in order to maintain a facsimile of solvency, in order to maintain the capital of the banking system.”\nLet us pause for a moment to savor Rohatyn’s analysis. Behind it is a morality tale (never mentioned by financial writers these days) that dates back to the late 1970s and early 1980s, when Middle East oil producers, savaging the world’s economies with their high prices, deposited much of their new riches in big U.S. banks. Having so much money on hand made the bankers very nervous (they needed to lend it to someone in order to make a profit), until they decided they could “recycle” it through the Third World at very high interest rates. Never mind that the borrowers really couldn’t afford such rates. Never mind that the developing nations were so desperate for money that this was like offering unlimited credit to a drunk gambler.\nBut the loan sharks weren’t as smart as they thought. The world market couldn’t support the high oil prices, which thereupon collapsed. So did the economies of many Third World debtors, who told the big banks they might as well forget about the loans. When Rohatyn was talking, in 1985, the banks were still lending money to them to maintain the fiction of solvency. Some still do. But most of the mighty moneylenders, grudgingly conceding that the relationship is hopeless, have in recent years been writing off many billions of dollars of bad debts. Occasionally, in the banking/thrift story, crime does not pay. But beware of happy endings. Today the big banks and their buddies in Washington are arguing, with little opposition, that they need more deregulation to get out of a mess caused, in part, by those bum loans to the Third World. But we’re getting ahead of our story.\n8.\nTHE BUSH COVER-UP\nThere were two reasons the thrift industry and the Reagan-Bush Administration wanted to hide the true extent of the S&L sickness. For the S&Ls, it was the best way to allow the losses to quietly become so enormous that it would be out of the question for the rescue to be paid for by the industry itself. Many experts believe that if the bailout had been carried out by 1986, the losses could have been held to a relatively paltry $20 billion or less. By delaying beyond that year, the losses quickly ballooned tenfold. That suited the thrift lobby just fine. Nobody could expect the S&Ls to handle a bill that big.\nAs for Bush strategists, they felt it was essential that the real scope of the S&L insolvencies be hidden until after the 1988 election. No doubt, they expected that wouldn’t be an easy task. By 1987 many nongovernment economists were estimating total insolvencies at between $50 billion and $100 billion. Taxpayers could guess where that money was going to come from.\nSo when M. Danny Wall took over as chair of the F.H.L.B.B., it was his duty as a good soldier to lie. Fifty to a hundred billion dollars? Nonsense, said Wall, “you only have a $2 billion problem here.” That was such a transparent falsehood that later in 1987 he allowed as how maybe the F.S.L.I.C. would need a $10 billion injection–still a relatively trivial amount that the industry could pay for through dues and the sale of bonds, if spread over several years.\nOn the July 7, 1988, MacNeil/Lehrer NewsHour, Representative Jim Leach confronted Wall with what Wall already knew, namely, that many experts in the industry were saying the rescue would take at least $50 billion to $70 billion. But Wall coolly brushed aside such numbers: “I’m reminded of a radio show back when I was very young, and that was Can You Top This? That’s what we hear these days. If someone finds themselves not being quoted any longer, they’ve got to ratchet up their number…. This is the Washington political game as to what is the size of the problem.” And then he added, with the sharpest deception of all, that “our current projections are there are resources enough.” At that moment the F.S.L.I.C. was $4 billion in the hole. What resources was he referring to? With the election just four months away, he could stall an answer to that one.\nWall was supported in his deception by then-Treasury Secretary James Baker and by Theo Pitt, chair of the S&L lobby. Baker told a House subcommittee in April 1988 that if the bank board got an infusion of only $10 billion it could “handle the problems of the industry over the next three years.” Later Pitt went on MacNeil/Lehrer to assure the public that “we don’t have a savings and loan crisis” and that “there’s not one dime of taxpayer money going into this recapitalization program.” Not a dime at the moment, no, but Pitt and Baker and Wall knew that the taxpayers would be called on after the election.\nSure enough, within days after Bush’s victory Republican spokespersons suddenly became quite candid. On November 30, L. William Seidman, head of the F.D.I.C. and soon to be appointed czar of the S&L cleanup team, was the first Reagan-Bush Administration official to admit that taxpayers would pick up most of the bill. Just closing down the 100 worst S&Ls, he admitted, would cost at least $30 billion. And there were hundreds of others that had virtually no pulse. By this time, keeping the zombie thrifts alive was costing the government $1 billion a month.\nDon’t Worry, Be Happy\nThere had been one other pre-election cover-up, not nearly so important financially but much more important politically. That was the Neil Bush long count.\nIn 1983 Neil Bush, William Walters, a Denver developer, and Kenneth Good, a Texas developer, became partners in JNB, an oil firm. In mid-1985, Bush joined the board of Silverado (better known as “Desperado”), a Denver S&L, which both Walters and Good already owed more than $100 million. They would eventually default on those loans. But in the meantime, Bush, who had received what in effect was a $100,000 gift from Good as well as other major financial assistance, was successfully pressing Silverado’s management–without mentioning these favors–to let Good off the hook on his debts. In other words, the Vice President’s son was up to his dyslexia in conflict of interest.\nIn 1986 federal examiners decided that Silverado was out of control (for the examiners, this was an embarrassing step to take, seeing as how some of them in previous years had encouraged Silverado into wild financial ventures). Deciding Silverado had far too many risky loans and far too much smoke in its bookkeeping, they warned management in early 1987: Reform, or else. The warning was ignored. By the late summer of 1988, examiners were ready to seize the company. But according to Time, a phone call from the White House (nobody has yet discovered who was on that end of the line) applied the brakes. The election was too close; Silverado’s collapse, which will cost taxpayers more than $1 billion, would inevitably have spotlighted the Republican candidate’s son, whose conduct had certainly been unethical and possibly illegal. So the bank board’s seizure of Silverado was delayed until December 9.\n9.\nTHE GIVEAWAYS BEGIN\nMaking misleading public statements to hide the real condition of the industry absorbed only a fraction of Wall’s time in 1987-88. Mostly he was busy making the kind of deals with S&L buyers that prompted financial analyst Jonathan Gray to quip, “If you can’t get the better of the Bank Board in negotiations, who can you beat?” House Banking Committee chair Henry Gonzalez (who did not hold that position at the time and was therefore restricted in his ability to serve as watchdog) now damns the deals as “giveaways,” and he is certainly not being excessive. Not that all the blame can be heaped on Wall. The giveaways were part of such a wide conspiracy that no one person, certainly no one person of Wall’s limited brainpower, could conceive and carry it out himself. But Wall was at the center of it.\nThe long delay in obtaining bailout money from Congress was about to pay off for friends of the Reagan and Bush administrations with enough resources to buy into the game. Particularly welcome, no doubt, were those several gents (including six owners of S&Ls) who had contributed $100,000 each in federally illegal soft money to Bush’s 1988 presidential campaign. Two such gents, Robert Bass and Ronald Perelman, did join the game, with winning results, as you shall see. The lack of an effective F.S.L.I.C. bailout fund, which was partly Wall’s fault, gave Wall the excuse to unload insolvent thrifts in breathtakingly subsidized bargain basement sales. The bank board had originally estimated that the subsidies to buyers would cost the government $39 billion. But the terms were so incredibly generous that, in fact, it will cost more than $70 billion.\nAnd the sales–called the “Southwest Plan” because most of the zombies on the block were in that part of the country–were done in total secrecy. Details of the sales were kept not only from the public but from members of Congress as well.\nWhen Senator Don Riegle, who was about to become chair of the banking committee, asked Wall’s office to fill him in on how the Southwest Plan was unfolding, they told him to bug off–the information was proprietary. The desire for secrecy must have been intense because Riegle, one of Keating’s boys, was known as a great friend of the S&L and banking industries.\nThe “plan” of the Southwest Plan was to entice, with fabulous favors, some of America’s rich folks to buy the ailing thrifts. They were guaranteed a prearranged profit (if their assets didn’t yield a minimum return the government promised to make up the difference) and marvelous tax advantages. By rushing to complete the deals before December 31, 1988, the bank board had no problem recruiting scores of buyers for its “expensive lunacy,” to use Mayer’s apt phrase. “Under the 1981 tax law,” he explains, “which still governed until the end of 1988, payments from FSLIC guarantees were not taxable income to the S&Ls–but the losses the FSLIC payments made up could still (you may not believe this, but it’s true) be used as deductions from the purchaser’s other income. The government made up the loss and then paid a second time in the form of reduced tax receipts.” In that situation, obviously, the purchasers of seized S&Ls would be eager to sell their assets–all those empty condos and shopping centers and vacant land and junk bonds–at a loss, because the greater the loss (which the F.S.L.I.C. repaid), the greater the tax write-offs they could claim for their other enterprises.\nOn September 5, 1988, the bank board announced the most expensive rescue of a single savings and loan association up to that time. The board unloaded the $16.3 billion American Savings and Loan of Stockton, California, the nation’s largest insolvent thrift institution, to a group of “vultures” (to use Newsweek‘s generic term) headed by Robert Bass of Fort Worth, one of the nation’s richest men.\nIn return for Bass’s injection of $350 million in cash to rejuvenate American Savings, the bank board offered $2 billion in subsidies. These included a $500 million I.O.U. from the F.S.L.I.C. (Since it was busted, it couldn’t deal in money, but its note was good at the Treasury.) In his first year of ownership, Bass recovered 30 percent of his down payment, and that doesn’t include the tax write-offs. A very sweet deal, as Neil Bush might say, but not unusual in that giveaway season.\nIn fact, the government got more from Bass than it did from some buyers, namely, the ones who didn’t put a penny down. In one eight-day period in August 1988, the bank board promised $8 billion in assistance to the buyers of nine thrifts–but only one of the buyers made a down payment, and that one put up only $20 million after being promised $585 million in assistance by the bank board. The $20 million bought control of nearly $1 billion in assets. These no-down-payment deals mocked the rationale Wall had given for the Southwest Plan in the first place, which was supposed to attract private capital to revive the zombies.\nOne of the neatest tricks of the Southwest Plan was turning two busted thrifts, Neil Bush’s alma mater Silverado and another Colorado thrift, Columbia Savings, into one of the most profitable thrifts in the country by merging and selling them to First Nationwide Bank of San Francisco for $96 million. The profits came from federal subsidies of more than half-a-billion dollars and tax breaks. In its first year of ownership, First Nationwide earned a profit of $48 million, or about half its investment.\nAmong the giveaways that raised the greatest public stink–Fortune magazine called it “The Screwiest S&L Bailout Ever”–was the merger of First Gibraltar Bank with four other bankrupt thrifts and the subsequent sale of the package to Ronald Perelman, king of Revlon cosmetics and reputedly the fifth-richest man in the United States. Perelman and associates paid $315 million. In return they got $7.1 billion in good assets, $5.1 billion cash to cover bad assets and $900 million in tax breaks for MacAndres & Forbes Holdings Inc., his investment company, which counted Revlon Group Inc. and First Gibraltar among its subsidiaries. In his first year of ownership Perelman reaped $121 million in tax breaks and $129 million in profits–a 79 percent return on his investment.\nWhat goes through the minds of ordinary Americans when they learn of deals like that? Rarely do we find out. But when Wall and the other two members of the bank board went before the House Banking Committee to reveal the luscious feast they had secretly laid out for the financial elite, we at least learn what went through the mind of one black man. Mayer uses this exchange to give his book its most human moment:\n“Did I understand you to say,” said Representative Walter Fauntroy, “that Mr. Perelman, in return for $315 million in cash, received benefits of $897 million?”\n“It might not work out that way,” said Danny Wall.\n“But it might?”\nVery reluctantly: “Yes, it might.”\nFauntroy leaned forward. “I have just one question for you, Mr. Wall,” he said.\n“Yes?”\n“Why is it only white folks who get that kind of deal?”\nHow could the bank board excuse selling First Gibraltar on such insanely generous terms? By faking the insolvent thrift’s real worth, that’s how. Believe it or not, the bank board rated as “worthless” thousands of acres of land that First Gibraltar, before collapsing, had paid $1.2 billion for. Last year Perelman sold 400 of these “worthless” acres for $7.5 million. That grotesque undervaluation allowed Wall’s gang to give Perelman millions more than would otherwise be justified. Is an observer overly suspicious to think of kickbacks?\nInternal bank board documents show that the government could have saved more than $4 billion by closing First Gibraltar and paying off its depositors at a cost of $6 billion. But of course the F.S.L.I.C. didn’t have $6 billion at that time; it was broke.\nSpeaking of rascals, it is worth remembering the kind of politically tinged deals that brought First Gibraltar to insolvency in the first place. One of the biggest was the development of Stonebridge Ranch north of Dallas, a 6,250-acre millionaire’s tract that was supposed to have 27,000 homes and apartments built on it but never got more than 270. Among First Gibraltar’s important shareholders who boosted the development were Robert Strauss, former chair of the Democratic Party and big-time insider of both political parties; his son, Richard Strauss; and J. Lingston Kosberg, a nursing-home owner and an active fundraiser for the Democratic Party in Texas. Young Strauss was in charge of the development, for which he got a $2.9 million annual salary. His father’s law firm was billing First Gibraltar $1 million a month. Before First Gibraltar went broke, it had sunk $330 million into Stonebridge. Recently the government sold it to a Japanese industrialist for $61 million. The $269 million loss will be paid by you and me. (Surely you must feel much more secure knowing that this same Robert Strauss is advising President Bush on how to lick the deficit.)\nThe pinnacle of insanity in the Southwest Plan was achieved by Wall, with the help of William Seidman. Fifteen zombie thrifts were sold to James Fail, which he merged into one named Bluebonnet Savings, based in Dallas. To get the fifteen, Fail put up $1,000 of his own money and $70 million in borrowed cash, and in return Wall’s agency promised him $1.85 billion in federal subsidies, or, as Senator Howard Metzenbaum puts it, “The U.S. taxpayer, compliments of the deal makers at the FSLIC, send Mr. Fail a check for what amounts to $23 million every month.” Fail must be feeling pretty good about the deal, seeing as how in his very first year of operation, with the first of the federal payments ($250 million) in his pocket, Bluebonnet became the most profitable large S&L in the country.\nTwo years after the transaction, it was discovered that (1) the deal had been greased by lobbyist Robert Thompson, who was George Bush’s legislative aide when Bush was Vice President and who was lent half a million bucks by Fail’s companies in 1989; and (2) the deal was totally in violation of bank board policy, if not downright illegal.\nFail had a tainted record. In 1976 he had beaten a securities fraud indictment in Alabama by promising to get out of the state and stay out. At the same time, the United Security Holding Company, which was controlled by Fail, pleaded guilty to securities fraud. That’s a felony.\nFolks who own companies that commit felonies aren’t supposed to be sold thrifts and subsidized with $1.85 billion. So why did the bank board do it–and do it with very fishy swiftness, just one day after Fail made an application that neglected to mention his indictment? That question leads us to William Seidman, chair of the Federal Deposit Insurance Corporation. Wall’s F.S.L.I.C. said it approved Fail’s application in 1988 because\n10.\nA SELLOUT BAILOUT\nTo everyone’s amazement, Congress did finally get around to passing a bailout bill, weighed down by the pretentious title of Financial Institutions Reform, Recovery and Enforcement Act of 1989. It promised $157 billion eventually to save the thrift industry, but it offered only $50 billion at the moment; this was supposed to dispose of 500 to 700 ailing thrifts over the next six years. It was a stupidly unrealistic estimate because it understated the level of inflation in the economy, understated interest rates, projected no recession or economic downturn whatsoever and projected a 7 percent growth in thrift deposits when they were actually dropping by 9 percent.\nWorst of all, with only $50 billion available, the program would start out $20 billion in the hole because Danny Wall, it turned out, had secretly promised $70 billion in “assistance” to those lucky guys who had taken thrifts off his hands under the Southwest Plan.\nNot to bore you with all the bureaucratic reshuffling that took place with the new legislation, let it be noted that the bank board was killed, the F.S.L.I.C. was absorbed into the F.D.I.C., Danny Wall eventually resigned and William Seidman, who as head of the F.D.I.C. had proved himself a master manipulator of press and Congress, was put in charge of a new piece of bureaucratic bric-a-brac called the Resolution Trust Corporation. The R.T.C. would control the cleanup and sell-off of the S&Ls and their assets.\nEvery expert within shouting distance of Washington knew that $50 billion wasn’t even half enough to make a real start on the bailout, but Seidman–like Wall and Gray before him–downplayed the true scope of the S&L disaster and stalled the day of reckoning. Why would he do such a thing? Why lie, when his lies were costing the taxpayers many billions of dollars more? Brumbaugh, who accuses the bank board chairmen of systematically lying, puts the nicest interpretation on it: “Everyone tries to be a team player in dealing with a very difficult situation.” The Reagan-Bush team was composed solely of liars.\nWall was a clod; Seidman is a smoothie; otherwise their cozy attitude toward the owners of financial institutions is pretty much the same. Mayer reports that when Seidman took over as chair of the F.D.I.C. in 1985 he called together the staff and counseled: “Bankers are our friends…. The FDIC should be a friend of the industry…. It should be like a ‘trade association’ for the industry.” The message to the staff was clear: Go easy on the banking industry.\nIn handling the savings and loan industry, Seidman has displayed the same attitude. He is adamantly against making the corporations that benefited from the 1980s deregulation binge pay for it; he wants taxpayers to foot the bill. On Nightline, Ralph Nader said “corporate taxpayers should pay for corporate scandals” and recommended legislation that would put a surcharge on the corporate tax system. Among other targets, said Nader, would be “banks like Chase Manhattan, which made $650 million in 1987 and only paid 1.3 percent federal income tax” [see afterword by Micah L. Sifry on page 623]. Seidman, smiling at such nonsense, responded, “Well, the U.S. government guaranteed these deposits, it wasn’t the corporations. It was the government elected by the people that guaranteed depositors that they would get their money. It’s always an easy answer to say, ‘Well, let’s just tax corporations,’ because they don’t vote. But the people vote, the people voted in the Congress and the President, and that government guaranteed these deposits.”\nTo that, host Forrest Sawyer responded: “But you know, you know what the average taxpayer is going to say. ‘Hold on a second. This is the same government that was supposed to be overseeing these S&Ls, and now, all of a sudden, you’re coming to me and telling me that I’ve got to pay for all those problems that you weren’t looking out for?’ ”\nSeidman: “Well, unfortunately, the government is elected by the people. The government simply did not do its job, but the people are responsible for what their government does.”\nIn other words, when the “people’s” government–that’s one of Seidman’s little jokes–lets banks and S&Ls go crazy, or when it gives away our money to crooks in the financial world, the voters are at fault; after all, they voted for the pols who appointed guys like Wall and Seidman, right? That’s the political philosophy of the chap now handling the Resolution Trust Corporation.\nSo it will come as no surprise to you to learn that Seidman’s R.T.C. has created an even bigger giveaway than the Southwest Plan of Wall’s era. Nor should you be surprised at the identity of some of the sharks circling the R.T.C. meat. ABC News economics reporter Stephen Aug found that “some of the best-known names in finance are waiting for the government to start selling.” Among them: former Secretary of Commerce Pete Peterson and his Blackstone Group; Lewis Ranieri of Prudential Insurance Company; Richard Pratt, the former chair of the bank board who helped ruin the S&Ls (one of the more offensive ironies); Ronald Perelman of First Gibraltar fame; former Treasury Secretary William Simon and his partner, former Federal Reserve vice chair and onetime S&L regulator Preston Martin.\nEdward Furash, a well-known bank adviser, said last summer, “There’s a small army of investors and lawyers and consultants and people who’ve been in government…who see this as the next best thing to the Oklahoma landrush.”\nMartin, whose Wespar Financial Services has snapped up several S&Ls, said the method of exploitation is easy as pie. What you do, he explained, is manage the rescued S&Ls conservatively for five years or so, raking in up to 20 percent profit a year, and “at the end of that time” you sell out to a “commercial bank holding company” or to a “group of investors from Japan.”\nPicking the Taxpayers’ Pockets\nTom Schlesinger of the Financial Democracy Campaign, an outfit backed with labor and liberal money, is right on target when he accuses the R.T.C. of becoming “a patsy for acquirers of insolvent S&Ls. Commercial banks like NCNB [North Carolina National Bank] and Banc One [of Columbus, Ohio] have been the biggest bidders for S&Ls in RTC conservatorship, and RTC has acquiesced completely to their brand of hardball–our terms or no deals. On March 15, RTC actually gave NCNB $700,000 to take Bankers S&L of Galveston and its $104 million in deposits off the agency’s hands.”\nAccording to a study by the Financial Democracy Campaign, just “fourteen mega-acquirers have received $54.4 billion in deposits–59 percent of all deposits transferred by the RTC through the end of September 1990.” In what R.T.C. chair Seidman calls “a great fall inventory clearance sale,” five big banks–Bank of America of San Francisco, Security Pacific Corporation of Los Angeles, North Carolina National Bank, Great Western Bank of Beverly Hills and Banc One–have received 40 percent of the total.\n“Week after week:’ says Schlesinger, “RTC announces a new set of pot-sweeteners for prospective bidders on S&L franchises. As a result, even more money is being picked from taxpayers’ pockets in order to consolidate the financial industry and RTC’s deals are more and more resembling the transactions that Danny Wall put together in 1988.\n“In fact, some of the same fatcats who reaped windfalls from Wall have used the proceeds to buy front row seats at RTC’s trough. For example, Revlon raider Ronald Perelman, whom Wall gave Houston’s First Gibraltar, was recently awarded the $2 billion San Antonio Savings Association.”\nHe’s right about the pot-sweeteners. Whereas under the Southwest Plan, at least buyers had to take all the assets of the insolvent institution, the good and the bad, now the R.T.C. allows the buyers of zombie thrifts to pick over their assets, keep the good ones and return the bad ones to the government. A year ago, the rule was that buyers had six months to pick over the carcass; now they have two years–and during those two years the R.T.C. pays the buyers for any losses they incur from dud assets. So far, more than half the assets have been dumped back into the taxpayers’ trash bin.\nIn fact, another sweet policy gives buyers the right to avoid handling the dud assets even for a trial period: They can bid solely on the thrifts’ most stable deposits and their most easily marketable securities. A sparkling example is the CenTrust Savings Bank of Miami, the largest failed S&L ($8.2 billion in assets) under the R.T.C.’s control. It was sold–or part of it was–to the Great Western Financial Corporation, the nation’s second-largest S&L, operating mostly in California and Florida. Now get this: Last year Great Western offered CenTrust $100 million for sixty-three of its branches. The deal didn’t go through because the R.T.C. seized CenTrust. This year, with the R.T.C. making the deal, Great Western got seventy-one branches for $60 million. A fantastic bargain. What’s more, Great Western walked off with only the healthy portions of CenTrust, leaving behind in the R.T.C.’s hands $3.1 billion of dying loans, junk-bond mutants and discarded real estate.\nOne of the most repulsive features of the R.T.C. program is that it permits billionaires to welsh on a deal. If these rich buyers agree to a sweetheart deal and then discover it isn’t as cushy as they expected it would be, they can back out. That’s what the R.T.C. did for Caroline Hunt, daughter of the right-wing kook H.L. Hunt and perhaps the richest woman in America. She bought Southwest Savings Association of Dallas from the government, decided she didn’t like it, and Seidman allowed her to back out on a $60 million commitment. Now the R.T.C. has Southwest Savings on its hands again.\nThese procedures have allowed the R.T.C. to pretend it is clearing things up when in fact it is simply becoming the world’s biggest trash collector. As economist Robert Litan put it: “People are led to believe that the Resolution Trust Corporation has done a lot of deals. It has; it’s shut down a lot of institutions, it’s sold a lot of institutions. But instead of actually resolving the institutions, it’s taken assets, troubled assets, off the books of these institutions and put them onto its own books, thereby becoming itself…the largest troubled savings and loan in the history of the world.”\nAnd then there is the sweetener concocted particularly for Seidman’s pals at the commercial banks. The R.T.C. now permits banks that buy S&Ls to keep a thrift’s branch network even when such branch banking is prohibited by state law.\nWorth noting, too, was a shift in policy last July that gives banks and other rich investors an opportunity to get their hands on thrifts even before they fail, and to do it in secret deals. Under this new plan, the R.T.C. will, instead of publicly advertising for bids, solicit proposals secretly from a favored list of 3,500 potential investors. Some analysts thought the R.T.C. was showing strange haste to start selling still-breathing thrifts when it already had on its hands hundreds of unsold zombie thrifts.\nThe Gold Rush\nWhy did Wall make such a frenzied effort to sell or give away or merge–anything but liquidate–the zombie thrifts? Why is Seidman continuing to do the same, in the same frenzied manner? One of the least noticed reasons: to save the big depositors, who were naked.\nResearchers at the Southern Finance Project, analyzing fifty-four of the largest thrifts that failed between 1987 and 1989, found that they were swollen with accounts not covered by the F.S.L.I.C.’s federal insurance limit of $100,000. One out of every $5 in these failed thrifts was in an account that exceeded $100,000. In some instances, the percentage was awesome. At CenTrust of Miami, for example, which the F.D.I.C. took over this February, 53 percent of its $8.2 billion was in uninsured deposits.\nRepeat: Those deposits were not covered by insurance. If the zombie thrifts had been liquidated, which would probably have been the cheapest technique to use, and if the F.S.L.I.C. had followed its own rules, the jumbo accounts (many of which contained more than $1 million) would have lost everything over $100,000. Cumulatively, rich speculators would have lost billions. To prevent that, Wall and Seidman sold and gave away and merged the zombies, keeping them “alive,” whatever the cost to taxpayers.\n“These numbers refute the myth that taxpayers are bailing out small savers,” said Marty Leary, a researcher at S.F.P. “It’s not the little old lady from Topeka or the farmer in Lubbock who are being rescued. It’s wealthholders whose brokers keep pumping these damaged S&Ls full of hot money.”\nIf this is unfair to taxpayers, it is only part of a larger unfairness that Michael Harrington once pointed out: “Where major banks [or S&Ls] are about to collapse, there is no point in a federal bailout which returns them to private hands. If Washington has to intervene, it makes sense for it to take over the bank and make it a public corporation, with employees and consumers on the board of directors.” But that would be socializing profits as well as losses, so no one (except the few die-hard populists) in the present crisis has proposed it.\nCrime in the Suites\nThree crime waves have washed across the S&Ls. The first was the looting that followed deregulation. The second was the fire sales of S&Ls to favored buyers. And now comes the third wave, and once again the government not only knows it is coming but claims it is helpless to stop the anticipated fraud.\nThe new wave has to do with the disposal of many billions of dollars in assets at the failed thrifts. “There’s a high potential for more scandal and ripoffs,” says Charles Bowsher, the Comptroller General. We have reached the place, it seems, when our public officials admit their readiness to hire sleazebags as agents to sell off our property to other sleazebags at bargain prices. David Cooke, executive director of the R.T.C., says: “If 90 percent of the people working for us are honest, that still means there will be 10 percent who won’t abide by the rules, and that’s a lot of money.”\nIt sure is. At the time he was saying that, the first inventory from 148 failed thrifts included 35,908 properties with a total book value of $14.9 billion. If the R.T.C. gets by with only 10 percent ripoffs, which would be a foolishly optimistic assumption, that still comes to $1.5 billion for the first batch of sales. The R.T.C. expects to sell ten times that much before the bailout is complete.\nBut anyone who thinks the thievery will end there is daft. Since the R.T.C. doesn’t begin to have enough staff to appraise and sell the stuff, it is contracting most of the job out to private real estate brokers and managing agents. That’s right, private real estate brokers–need we say more? Kickbacks, money laundering, fraudulent expenses and favoritism are inevitable. Stephen Labaton spelled part of it out in The New York Times: Because there is no screening of the buyers, “regulators expect that many of the buyers of the assets will be the property developers and speculators who defaulted on loans…for the same property. In a way, the process is set up to encourage a holder of property whose value has plummeted in a depressed real estate market to default on the loan and then repurchase the property at a substantially lower price.”\nOfficials at the R.T.C. also admit that some of the bidders will be those whose bad management caused the property to be on the market now and who know the true value of it better than anyone. They’ll be ready to pounce on the jewels hidden in the debris they left behind. Seidman says, “We have had cases where we had somebody working for us who was going to sell the property. He set the price low, got the price set low, left us and went on the other side and bought it from us. Things like that….Of course, he didn’t show up personally. He had somebody front for him. But there are all kinds of ways that people can sell things and take a little money under the table for having sold it to one group against another.”\nSeidman and his crowd promise to protect us from folks like that, but the protection is just another huge layer of corruptible bureaucracy: “I can assure that we are going to have more auditors and controls than we have seen around government for a long time?” That was no overstatement. At the F.D.I.C. and the R.T.C., Seidman sits atop a bureaucratic pyramid of 10,000 employees with an annual budget of $3 billion. Hordes of lawyers, accountants and various other overseers and constables are hanging around the lamppost on the R.T.C. corner. It constitutes one of the largest “emergency” bureaucracies ever thrown together. The Dallas regional office alone has hired 1,000 people. In addition to the standard inspector general that most government agencies have, the R.T.C. has been given a Super Cop (with a force of up to thirty special “contractor cops”) to ferret out corruption among federal officials and the hundreds of private firms that have won contracts to manage all the entities zombie thrifts lent money on or bought themselves: horse farms, hotels, spas, fish farms, golf courses. The contracts for managing this capitalist flotsam and jetsam are expected to cost $30 billion–a deep ocean of potential corruption.\nThe worst corruption to surface so far is that of the bureaucratic soul. The R.T.C. is breaking its back to help wealthy individuals and corporations, foreign as well as Yankee, get their hands on bargains. The sales of the big items–shopping centers, office buildings, hotels, warehouses, apartments–are auctioned via satellite, and the prices start at 70 percent of appraised value.\nBut let low-income people try to find out what cheap houses are for sale–where, when and at what price–and they run into a wall. The law creating the R.T.C. authorized it to sell low-priced homes to low-income people at reduced prices and handy financing. But the Association of Community Organizations for Reform Now, which claims that 70 percent of the R.T.C. housing in Texas could be offered to poor folks, says the agency is withholding its listings from them and selling the houses to speculators instead.\n11.\nTHE C.I.A. AND THE MOB\nSo many billions of dollars disappeared that one has to ask, where in hell did it all go? Joe Selby, who was one of the bank board’s much-hated examiners in Texas, says, “A lot of money got put into people’s pockets and they’ve rat-holed it somewhere. Some of it is in artwork, fancy homes, fancy airplanes and Rolls Royces. Some of it went to Rolex watches, lizard shoes, hunting parties and yachts.”\nThat’s too skimpy an explanation. No ratholes are big enough. Even if to Selby’s list you added all the cigarette boats and trips to European spas and Las Vegas outings and politicians bought, it wouldn’t be enough of an explanation.\nIt probably can’t be accounted for by totting up the miles and miles of empty office buildings and decaying condos. So where did the rest wind up? A theory pursued by a few reporters, but very few, is that a big hunk, a really big hunk, of the money wound up in the coffers of the underworld and the C.I.A. and that the former has stashed it offshore and the latter blew it on covert operations.\nPete Brewton, a very stubborn reporter for The Houston Post, has found possible links with the C.I.A. and the mob in at least twenty-two failed thrifts, including sixteen in Texas. Some of the people linked to the defrauded thrifts were involved in gunrunning, drug smuggling, money laundering and covert aid to the Nicaraguan contras.\nA typical Brewton case: In March 1986 Houston developer Robert Corson bought the Kleberg County (Texas) Savings and Loan for $6 million and changed the name to Vision Banc Savings. To get his thrift, Corson reportedly used a letter of recommendation from a judge who in 1988 would head George Bush’s presidential campaign in Harris County (Houston). Later the judge said he hardly knew Corson. So why did he write the letter? Was it a favor to Vice President Bush, who was keenly aware that the C.I.A. was desperately hustling money to get around the Congressional ban on support for the contras? Brewton claims “Corson is identified in federal law enforcement records as a ‘known money launderer’ ” and says that “one former CIA operative” told him that Corson “frequently transported large sums of cash…for the agency.”\nAt the time of the purchase, the thrift had assets of $70 million. Four months later it was insolvent. How come? Partly, says Brewton, because of a $20 million loan to help finance a Florida land deal. Corson’s thrift lost $17 million of the $20 million. Another thrift, Hill Financial Savings in Red Hill, Pennsylvania, put up $80 million to seal the land deal; it lost $40 million. Something fishy? Brewton says the Pennsylvania thrift, which has since gone bankrupt, had ties to the C.I.A. and organized crime, as did one of the men who put the land deal together, Miami lawyer Lawrence Freeman, a convicted money launderer for drugrunners.\nBrewton’s stories have not exactly stirred the national press to action. Under the very accurate head “The Story Hardly Anyone Wants to Touch,” the July Washington Journalism Review reported that “no major newspaper has yet followed up on the stories, and they have received only the briefest of mentions when they have been noted.” After reading only one of Brewton’s pieces, Jerry Knight of The Washington Post, who has done some good S&L stories, dismissed the whole series as “bullshit…so thin, so poorly sourced.”\nBut not everyone feels that way. Kathleen Day, who covered the S&Ls for The Washington Post before taking a leave to write a book on the mess, told W.J.R., “If I were still the key person on the beat, I would be looking into those stories. The thrift industry is not dismissing them. Given the gravity of the situation and how much the mainline press has missed, I’m surprised there hasn’t been more delving into it.”\nHouston Post editor in chief David Burgin, understandably smarting from the “world records for arrogance” set by the Eastern press, says, “The [Washington] Post has been asleep. [They] blew Iran-contra, and they blew HUD, and now they’re going to blow this.” But no more than The New York Times, which, except for a few smashing stories by Jeff Gerth that made it to the front page, has kept most of the S&L stuff buried in the financial section. One reason Brewton’s C.l.A.-underworld stories have been treated so lightly is that the only attention they stirred in Congress was a ridiculously inept “investigation” by a subcommittee headed by that unscrupulous boob Frank Annunzio, who, though known to have had his hand out to the thrift lobby over the years (and who in 1985 introduced a resolution that would allow thrifts to go on making wild investments), now goes around wearing a button that reads “Put the S&L Crooks in Jail.” Nobody takes him or anything he does seriously.\nThe few other reporters who have been down the C.I.A.-Mafia path at least partway do take Brewton’s conspiracy allegations rather seriously. In Inside Job, Pizzo, Fricker and Muolo write that toward the end of their long investigation they began to pick up reports of C.I.A. involvement. “Experts had wondered how so many billions of dollars could just vanish from the thrift industry without a trace. If some of that money were channeled into the Contra pipeline or used to serve other legal or illegal covert purposes, that could certainly be one answer…. We didn’t have time to investigate both that story and this one, but we want to be on the record as saying that we finally came to believe something involving the CIA and Contras was going on at the thrifts during the 1980s. After all, deregulation created enough chaos to accommodate just about anyone’s purposes. And taking out loans from federally insured institutions, giving the money to the Contras, and letting federal insurance pick up the losses does have the flavor of what Ollie North might think was a ‘neat idea.’ ”\nMob Rule\nThey don’t have time for the C.I.A., but on the other hand, Pizzo, Fricker and Muolo give plenty of space to the underworld’s presence. At the very heart of their fascinating book is Herman Beebe, a son of perhaps the most casually corrupt state in the nation, Louisiana. He would eventually go to prison for S&L fraud.\nBeebe’s first bank was the Bossier Bank & Trust in Bossier City, Louisiana. According to Brewton, Beebe in 1983 arranged for his Bossier Bank to lend about $2.8 million to Harvey McLean Jr. to help launch the Palmer National Bank in Washington, D.C.–the same one that later channeled money to Ollie North’s Swiss bank accounts. McLean and Stefan Halper had met while working in Bush’s 1980 presidential campaign, Halper as policy director and McLean as fundraiser. After the campaign Halper, who is the former son-in-law of Ray Cline, once the C.I.A.’s deputy director, went to work at the State Department and McLean became what Brewton calls “a major player in a number of failed Texas savings and loans.”\nAfter his Bossier beginnings, Beebe eventually built what Inside Job calls “potentially the most powerful and corrupt banking network ever seen in the U.S.,” stretching over fifty-five banks and twenty-nine savings and loans, in six Southern states and Colorado, California and Ohio. His “influence in banking circles was so pervasive by the mid-1980s that he could be connected in some way to almost every dying bank or savings and loan in Texas and Louisiana, yet few people had ever heard his name.” But he was well known by such mud-splattered politicians as Louisiana’s former governor Edwin Edwards, whom Beebe once had on his payroll at $100,000 a year.\nWas Beebe also a business associate of Carlos Marcello, Mafia boss of New Orleans? There were plenty of rumors to that effect, and rumors are about all Inside Job is going to give you. The Dallas Morning News once reported that “usually reliable federal sources” said Beebe’s bank was suspected of being a conduit for some of the mob’s Las Vegas skimmings. Beebe, who denies all underworld ties, parried with a $12 million libel suit. But he dropped it when the News promised not to make public any more of the information it had found out about him.\nAfter Beebe was convicted of fraud, he had a period of financial woe during which he was helped along with $30 million in loans from Southmark Inc., a huge (thanks to Drexel junk bonds) Dallas-based conglomerate. None of the books reviewed here give us much of a handle on Southmark, but, ah, the rumors they spin ’round it. The Inside Job trio say one of the rumors they didn’t have time to follow came from a reliable source who “told us he had phone records showing that a real estate broker who had dealings with both Southmark and Carlos Marcello had also made phone calls to Major General John Singlaub, of Contra-gate fame.” So what would phone calls prove? Maybe nothing. And Inside Job‘s claim that they “found Southmark’s fingerprints at Silverado Savings” is pretty skimpy, too.\nBut one can draw firm conclusions about Southmark’s character from what happened at its subsidiary, San Jacinto Savings. According to Brewton, “When Southmark bought San Jacinto, the thrift had relatively modest assets of less than $500 million. But the total soon mushroomed, in part because San Jacinto began to attract deposits from organized crime associates. Federal regulators say the organized crime money included millions of dollars in deposits that were brokered by Mario Renda, a New York Mafia associate who is in prison for bank fraud and racketeering.”\nSan Jacinto, whose assets reached $3.3 billion, failed. Brewton says its troubles are the handiwork of Joseph Grosz, senior vice president of San Jacinto and president of Southmark Funding, a subsidiary of Southmark. Grosz, says Brewton, is “a mysterious figure who is part of a circle of Chicago investors that has links to organized crime and the CIA.” (Sometimes, I must admit, Brewton’s use of the words “links” and “ties” and “connections to,” because no explanatory data come with them, makes me want to yell rude things at him. I assume, though, that The Houston Post is just as fearful of libel suits as any other newspaper, and Brewton must have told his editors enough background stuff to make them feel comfortable.)\nSo how much emphasis should we put on the Mafia and the C.I.A.? Neither Brewton nor the Inside Job trio claim that the fall of the thrift industry should be attributed entirely to the influence of the mob. But they sound convinced that federal investigators are stupidly (or selfishly) underplaying underworld influence. The Inside Job authors say, “We were told repeatedly by regulators, and even Justice Department officials, that the Mafia, the mob, organized crime, the Syndicate, whatever label you choose, had not and could not infiltrate the thrift industry in any serious way.” But these three reporters found that the bureaucracy was trying to hoodwink them, and that in fact, “at nearly every thrift we researched for this book we found clear evidence of either mob, Teamster, or organized crime involvement.” The familiar names cropped up again and again: Gambino, Genovese, Lucchese, Bonanno, Colombo, Marcello, Trafficante.\n“Did the leadership of these families have a sit-down one day and decide to loot S&Ls? Clues that surfaced at dozens of savings and loans convinced us that some form of coordinated operation existed. The evidence was overwhelming that the Mafia was actively looting S&Ls–in various, widely disparate locations, at the same time, in the same ways, often using the same people.”\nGranting all that, it would still be a great mistake to become so fascinated by the cobwebby trail of the C.I.A. and the flickering shadows of the underworld that we forget for even a moment who the main criminals are: “respectable” financiers and their getaway drivers in Congress, in the bureaucracy and in the White House.\n12.\nNOBODY PAYS EXCEPT US SUCKERS\nEd Buck, 35-year-old political activist, is best known for gathering most of the 300,000 signatures a few years ago that resulted in Evan Mecham’s being kicked out as Governor of Arizona. When Arizona’s two U.S. Senators, real estate millionaire DeConcini and war hero McCain, were caught in bed with Keating, Buck, who calls DeConcini and McCain “the highest priced prostitutes in Arizona,” went on the attack again.\nHe printed up bales of phony money, looking vaguely like dollar bills, that carried the inscription, “Use this note to buy influence in Arizona, illegal tender for favoritism from your U.S. Senator,” signed “Charles Cheating.” The money carried a picture of McCain on one side and DeConcini on the other. Within a matter of minutes after Buck picked up the phony bills at the printer, Secret Service agents were pounding on the door of his Phoenix home. They seized the bills, claiming they looked too much like real money, and thus saved those two fine Senators from further embarrassment.\nThat was the fastest action you are likely ever to see from a federal law enforcement officer in connection with the S&L scandal. Rap groups and museum directors get hauled into court much faster than do billion-dollar bilkers (and, as an ethics committee capable of stalling nearly a year has shown, a Senate investigation of those who helped the bilkers is pretty hard to get rolling, too).\nNobody seems to know how many S&L fraud cases are floating around the Justice Department. Some estimates are as high as 21,000. That’s a surreal number. Director of the F.B.I. William Sessions, who says fraud was “pervasive” among the seized thrifts (Seidman sets the fraud rate at 60 percent), admits his agents can’t begin to get a handle on the 6,000 cases they know exist.\nEven when there are neon signs pointing toward the crooks, the F.B.I. seems to get lost. Remember Mario Renda, the ex-tap dancer who teamed up with the Mafia to broker $6 billion to 3,500 banks and thrifts? Well, he was finally indicted for fraud in three federal districts. Jonathan Kwitny, the historian of corporate crime, tells the rest:\nRenda copped a plea for five years in prison and restitution of a paltry $10 million, without incriminating any big-fish borrowers.\nSurely, the F.B.I. should have immediately traced every loan Mr. Renda arranged at every institution he dealt with. Agents should have followed the money trail to whatever assets can be located. The same tactics should then have been applied to all other suspicious loans.\nBut the F.B.I. apparently didn’t do that. A bureau spokesman in Washington says that if agents looked into the loans, they would have been in the New York office. That office says it just sent leads on Mr. Renda to F.B.I. offices around the country.\nThis is amazing. This is our money. Why doesn’t the F.B.I. hire agents to trace those unrepaid loans and try to get our money back?\nAnother good question is, How come Attorney General Dick Thornburgh is so casual about the S&L rip-offs? Having actively tried to ruin the Iran/contra trials by refusing to release documents needed by the prosecution, Thornburgh now seems to be passively blocking the pursuit of S&L villains. Nobody has more loyally ignored Reagan-Bush-era crimes. He passed up most of the money Congress gave him last year to hire more fraud prosecutors. This year he has spent the money mostly on greenhorn attorneys unequipped and untrained to handle the complexities of S&L fraud. Senior attorneys in the Justice Department have had to handle simultaneously not only S&L matters but fraud cases in such disparate areas as Defense Department procurement, securities trading and environmental protection.\nThe Justice Department has at least a five-year backlog of S&L cases, and Thornburgh doesn’t seem bothered. “Can we reach every major case?” he asks rhetorically. “Probably not.” Certainly not at the rate he’s going. It took his attorneys three years to work up an indictment against Don Dixon, the Texas rascal who had misbehaved so boldly that he should have been one of the easiest to take to the mat.\nThornburgh’s fraud team of 160 lawyers in Dallas has given up trying to handle the most sophisticated swindles–although they are probably the ones that got away with the most money–because, as the U.S. Attorney for that district explained, “The juries have difficulty understanding complex transactions, and we have difficulty understanding them.” With literally thousands of cases still awaiting their attention, Thornburgh’s snails have so far produced 446 indictments and 331 convictions.\nThe judges and juries don’t seem terribly upset by the looting either. Although some criminals have got long sentences–Vernon Savings and Loan’s chief executive, Woody Lemons, got thirty years for taking $200,000 in loan kickbacks–the average sentence for the S&L crooks has been 1.9 years, about one-fifth as long as the average sentence (9.4 years) for bank robbers. The courts have ordered restitution of $56.6 million, including $25 million in civil settlements. But of the $2.5 million ordered in restitution by Texas courts this year, only $50 has been paid. No kidding: fifty bucks. Seidman boasted on Nightline not long ago that the Resolution Trust Corporation was collecting an average of about $1 million a day in fines. Ted Koppel was unkind enough to point out that at that rate it wouldn’t take more than a few centuries to get most of our money back.\nLittle action appears to be contemplated by the Bush Administration against the lawyers and auditors who helped make the S&L looting possible. Six of the largest auditing firms gave highly questionable S&L audits, but as of this writing the only lawsuit filed against them is the one aimed at trying to squeeze $560 million from Arthur Young (now merged into Ernst & Young), the notorious firm that gave clean bills of health to such looted S&Ls as Lincoln and Vernon. The government is especially mad because Arthur Young said Western Savings of Dallas was healthy in 1984 when it was actually $100 million in the red; the next year, when Western was $200 million in the red, Young claimed it was as solid as a rock. But the government must not be very angry with the corrupt accounting firms, seeing as how it is employing some of them to help the R.T.C. stagger through the resolution swamp.\nAs for the corrupt law firms whose partners should be in jail, Mayer is absolutely correct: “The failure of Gray’s Bank Board to control the egregious crookedness of so many S&Ls must be laid in large part at the doorsteps of the great Washington, New York, Chicago, Dallas, and Los Angeles law firms.” Half a dozen law firms have been forced to pay $50 million in pretrial settlements. But in general the lawyers have profited enormously from the crimes they helped commit. They have been hired by both sides, the government and the thrift owners. Even before his costliest court battles began in 1990, Keating alone had spent an estimated $70 million (of federally insured money, of course) on eighty law firms. Seidman says the R.T.C. will file 80,000 lawsuits this year, mainly to get clear title to land that was foreclosed on. It will pay $300 million this year (and for years to come) to private law firms to help out.\nEveryone in government seems now ready to concede that no more than a tiny fraction of the stolen and wasted money will ever be recovered, and there will be no wholesale imprisonment of S&L scoundrels. The best the public can expect is a few showcase trials–slicker than the one given Ceausescu, but serving the same purpose–of a Don Dixon or a Charles Keating to satisfy the unhappy taxpayers. Ninety-nine percent of the crooks will go free.\nMillions of Duped Citizens\nOf course, it’s all very satisfying to see on the front page of The New York Times a picture of Keating in chains and handcuffs, escorted by federal marshals, slouching off to the clink because he couldn’t make $5 million bail. The charge against him had to do with allowing his agents (who obeyed an internal memo: “Always remember the weak, meek and ignorant are always good targets”) to sell $250 million in Lincoln S&L bonds, now worthless, to 14,000 Californians, many of them senior citizens, leaving some without any savings at all. It was the meanest act of his mean career, and it will be politically profitable for Bush to get his Justice Department minions to hustle Keating into prison forever.\nBut, speaking of politics, one wonders what plans, if any, the Justice Department has to deal with Karl Samuelian, who served California’s Republican Governor George Deukmejian as chief fundraiser and the California Republican Party as finance chair. As the Santa Cruz News reminds us, Samuelian was managing partner in the law firm that worked out the “legality” of the bond issue for Keating. “Samuelian used his undoubted influence to obtain the necessary clearance from the state. Without the clearance the bonds could never have been sold.”\nThe Justice Department also delayed interminably in filing charges against the Silverado gang, though this was not necessarily caused by Neil Bush’s presence in the middle of the pile. It could just as well be explained by the Administration’s gratitude that Michael Wise, Silverado’s chair, helped raise $300,000 for George Bush’s presidential race, and that Larry Mizel, an important Silverado stockholder, helped raise $1 million for the Reagan-Bush ticket in 1984, and that Neil’s oil partner Kenneth Good scraped up $100,000 for the Republican National Committee even after he defaulted on $32 million in Silverado loans.\nWhen–if–Silverado’s past gets laid out in court, we might learn more about its connections with Southmark, which had ties to many of the crooked S&Ls. And we may learn if The Houston Post‘s Brewton was onto something when he said that Silverado, Mizel and Neil Bush’s partners Walters and Good “all had connections to individuals or S&Ls in Texas that did business with organized crime figures or CIA operatives…. Good is one Silverado borrower who got a large loan at a Texas S&L connected to Beebe and Corson [you will remember them as being allegedly connected to the underworld]. In July 1985, Good and his companies borrowed $86.3 million from Western Savings Association in Dallas to help him buy Gulfstream Land & Development, a Florida real estate company which later put Neil Bush on the board of one of its subsidiaries.”\nThose who were smart enough to defraud the government (a Texas A&M dropout would have been smart enough) are, for the most part, also smart enough to sidestep punishment. Many who looted the S&Ls of millions of dollars will continue to live the high life and will never be forced to repay a penny of what they stole because technically they are paupers. They are using an old legal ploy, transferring all their property and money to trust funds in their wives’ names or in the names of their children. The government can’t touch it, but they can.\nNeil Bush’s old partners, Walters and Good, who left $132 million in bad debts at Silverado, have gone the route of plush poverty. Although Walters drives expensive cars and can take his pick among rather comfortable quarters (a $1.9 million house, a $1 million condo and a $275,000 mobile home, all in California), everything belongs to a trust in his wife’s name. Likewise, Good, though he claims to be bankrupt, has the use of a $700,000 house in Tampa and a 2,000-square-foot condo in Manhattan.\nNeil Bush may not be the brightest porch light on the block, but he was smart enough to imitate Walters by buying a $550,000 house and putting it in his wife’s name. MDC Holdings, a major real estate company, holds the mortgage. MDC was a natural for Neil, since it had close ties with Silverado and got caught by the Securities and Exchange Commission in a shady deal with Keating’s Lincoln.\n13.\nDON’T PLAY IT AGAIN, UNCLE SAM\nIf, as seems entirely likely, there is no wholesale imprisonment of S&L scoundrels and no massive ouster of the politicians who betrayed us, who is going to feel most of the pain? You know the answer. You will, sucker. You, O citizen of this wretched Rome, are going to get raptus regaliter. Royally screwed.\nAnd I don’t mean just the bailout cost that the press loves to play with, contrasting it with the cost of other federal programs. David Maraniss and Rick Atkinson of The Washington Post–timidly using only the base $150 billion, and not the $500 billion it will come to, counting interest–pointed out that it could finance “the U.S. Food for Peace program at its current level for 136 years or the Drug Enforcement Administration for 262 years or the federal prenatal care programs for 717 years.” I prefer to use $500 billion and play the game in traditional S&L terms, housing. The median price of a house in the United States today is $98,000. Rounding that out, it’s obvious that for the price of the bailout we could build and give away 5 million homes. If, for the sake of the game, we figure four persons per family, that means we could supply free of charge a home for every family in our nine largest cities–New York, Los Angeles, Chicago, Houston, Philadelphia, San Diego, Dallas, Phoenix and Detroit.\nPainful as the bailout cost will be, it is not nearly so painful and dangerous to the economic health of America as the shift in and concentration of the control of credit, which we are already beginning to see. Ten years ago there were about 4,500 S&Ls in the country. Now there are fewer than 3,000. By the time the bailout storm troops get through selling them off, the number is expected to be down around 1,500, with a corresponding drop in mortgage money. Most will have disappeared, via mergers, into super-S&Ls and superbanks whose social usefulness will be equivalent to supertankers like the Exxon Valdez.\nWhen locally owned S&Ls and commercial banks are bought up, their loans are whisked away, usually far away. A super-S&L in California has precious little interest in lending mortgage money in Luling, Texas. A superbank in North Carolina couldn’t care less about giving a loan to an Abilene machine-shop owner. So applicants aren’t getting their loans as they used to.\nIn the past decade, nearly twice as many banks failed in Texas as did in the whole nation between 1943 and 1979. Nine of the ten largest Texas banks (which had 40 percent of their loans tied up in oil) went under. Nearly all of them were bought up by or merged with out-of-state banks. Sometimes the new ownership didn’t stop at the high-tide line.\nJim Hightower, Texas’s best-known corporation baiter, gives a stunning example of how small-town banks and S&Ls, by convoluted buyouts and re-buyouts, sometimes even disappear over the waves: “Depositors in Corpus Christi, Gonzales, Luling, San Antonio, Seguin and Yoakum now find their money–and their borrowing fate–in the hands of something called Pacific USA, which is not to be found in the U.S.A. at all, but across the water in Taiwan. It is a subsidiary of the Pacific Wire and Cable Co., one of the largest conglomerates in Taiwan.”\nThe moneylenders, who were willing to take any risk for big borrowers in the 1980s, are now reluctant to take any risk for small borrowers. This, by the way, makes them lawbreakers, but they don’t seem worried about that. The Community Reinvestment Act of 1977 declares that banks and S&Ls are chartered to serve the public and that they must help and give credit to low- and moderate-income citizens and small businesses.\nOnly once in its history has the Federal Reserve Board enforced that law. Today it is violated more than ever. Banks and S&Ls bailed out with your money are the stingiest of the lot. They have revived and pumped adrenaline into the ancient practice of redlining. In Texas, for example, where 40 billion bailout dollars have been lavished on banks and S&Ls in the past two years, virtually none have been reinvested as loans to minority neighborhoods. The Southern Finance Project found, for example, that although no banking establishment has grown fatter and wealthier from gobbling up failing banks and S&Ls in Texas than NCNB, in 1989 it loaned only one-half of 1 percent of its total mortgages in Houston, Dallas, San Antonio and Austin to minority borrowers.\nOrdinary people are, obviously, being screwed–in the name of “reform.” Whenever the money-masters of government carry out something “reformist,” we are in deep trouble. The disastrous S&L rule changes of the early 1980s were called “reforms.” Now the bailouts that concentrate wealth and credit are also called “reforms.” And the Bush Administration has other even more noxious “reforms” planned for the immediate future.\nMonopoly Capital\nThe plan adds up to the complete deregulation of commercial banks. Since 1985, when Vice President Bush was head of a task force studying financial market restructuring, he has been a patsy for the banks, which have been lobbying and finagling with considerable success to (1) reduce the S&L industry to an insignificant source for government-backed home mortgages (that goal is in sight), (2) allow banks to enter the securities business (the Federal Reserve recently made the first ruling in that direction) and (3) let banks do just about any damn thing they want to do.\nThe tainted S&Ls have provided the banks and the Administration with a wonderful rationale: The S&Ls are booed as the bad guys–ruffians, vandals, thieves–and the banks are patted and praised as the gentlemen–decorous, wellregulated (by comparison), sound, safe.\nIn fact, commercial banks are anything but. Since the mid-1980s they have been lending with as much abandon and stupidity as the S&Ls, and with as little supervision from the Feds. The industry has been falling apart for at least five years (Seidman’s vaunted chairmanship of the F.D.I.C. notwithstanding).\nOnly ten banks, with assets totaling $232 million, failed in 1980. Eight years later, 220 banks, with assets of $54 billion, either closed or were given emergency cash injections by the Federal Reserve. Bad management, bad luck, fraud and lousy supervision by Seidman’s cops all contributed. In 1986, with 1,400 of the nation’s 14,500 banks in serious trouble, Seidman admitted that half the problem banks hadn’t been examined in more than a year. “We’re spread very thin,” he said. “We don’t have enough people to catch the problems.”\nThings didn’t improve. Nor did thrifts have a corner on crooks. In 1987 the F.D.I.C. admitted that one-third of the banks that failed were brought down, at least in part, by insider dishonesty. The same year, with banks collapsing right and left, Stephen Aug reported on ABC Business World that “huge segments” of the commercial banking industry were “restructuring in what some say is a giant controlled bankruptcy organization.” And much of the emergency oxygen was being fed to the giants–Citicorp, Chase Manhattan, Bankers Trust, Manufacturers Hanover and Bank America.\nBut most of the popular press, to the extent that it was writing about moneylenders’ problems at all, was concentrating on the S&Ls. Don Dixon’s prostitutes were much more entertaining than Chase Manhattan’s disappearing Third World loans. And they were indeed disappearing. By last year all the big banks mentioned above were writing off huge portions–some by as much as two-thirds–of their Third World loans, thus admitting they would never be repaid.\nIn the past two years particularly, there was an orgy of bank gambling with leveraged buyouts and takeovers financed by junk bonds, and now the earth is beginning to shake. Indeed, the General Accounting Office has warned that seven of the nation’s ten largest banks plunged so deep into those risky loans that if even one of the highly leveraged companies should go bankrupt, an extremely dangerous chain reaction could result. Oceans of speculative commercial real estate loans made during the 1980s are also turning rancid.\nThe percentage of banks losing money keeps climbing; by this summer it had passed 11 percent. The bigger they are, the wider their cracks. In late September Chase Manhattan, the nation’s second-largest bank, laid off 5,000 employees, cut its stock dividend by half and admitted a probable $625 million loss for the quarter. Chemical Banking Corporation, the holding company for the nation’s sixth-largest bank, was right behind, only its stock dividends were cut 63 percent. And then Citicorp, the nation’s largest bank, answered sick call with a 38 percent drop in earnings. Poisoned by lousy loans, the biggies up and down the East Coast were turning green. Will California banks, which have been playing Nathan Detroit for the developers’ floating crap game, be next? Many experts think so.\nThe rot in commercial banking has been carefully covered up for years–just as the rot in the thrift industry was covered up. The duplicity is shared by bank owners and regulators. Writing two years ago about this trickery, Jerry Knight of The Washington Post told us, “For months, Seidman and Comptroller of the Currency Robert E. Clarke have insisted publicly that the problems of Texas banks are not serious enough to require any extraordinary government action. Behind the scenes, however, federal regulators have been bending the rules of banking to keep weak Texas financial institutions from going under and taking unusual steps to keep the public from learning how bad things are.”\nSound like a replay of the S&L coverup? Stanford economist Brumbaugh, who was one of the first to discover the true condition of the S&Ls, sure thinks so. He says, “We are in the midst of the largest government cover-up of a financial scandal ever in the country’s history.”\nJust how big is the mess they’re trying to hide this time? Last year 200 banks failed; another 200 are expected to go under this year. That’s for starters. In those numbers are none of the monster banks that are “too big to fail”–that is, banks so big the government is afraid to let them collapse, lest they drag down the whole banking system. What shape are the monsters in?\nThe scariest appraisal was given three months ago by Brumbaugh: “I believe that the following banks are very close to true insolvency…Chase, Chemical, Manufacturers Hanover, Bankers Trust and even Citibank and Bank of America…. In addition to that, there are 460 banks with $42 billion [in assets] that have had losses in each year since 1986. Those institutions are going to exhaust their net worth on an accounting basis this year. There are another $30 billion in assets at institutions that have had negative net income for the last two years.”\nBy “true insolvency” Brumbaugh means that the government’s bookkeeping system is phony: “The accounting method that we use in this country covers up true market insolvency when these institutions get to the end of the rope, and that’s exactly what happened with the savings and loan crisis, and it’s happening all over again with commercial banks. And in my opinion, the total losses that are embedded in those banks that are insolvent…are so great that the bank insurance fund is not going to be able to handle it, and taxpayer dollars are going to be necessary…. In order to resolve the problem, the taxpayers are going to have to pay a large portion of the losses that are embedded in commercial banks.”\nWhat? Another bailout, and this time one that will make the S&L bailout seem trivial? No, no, no, Seidman sputtered furiously (he and Brumbaugh were facing each other on Nightline). Brumbaugh, he said, was being “irresponsible.” He was “shouting fire in a crowded theater.” He was launching “a typical professorial-type attack.” Brumbaugh’s charges were “preposterous.”\nBut, as evidence showed in the next few weeks, Brumbaugh’s charges were not at all preposterous. In early September Charles Bowsher, who as Comptroller General heads the General Accounting Office, the agency that does audits and investigations for Congress, gave the chilling news: His investigators had discovered that whereas the F.D.I.C. claimed to have $13.2 billion on hand to help failing banks (an inadequate amount, even if it had been accurate), in fact, “if we had a more realistic” accounting practice, it might turn out that the fund was sucking air. Whatever the right figures were, he said, “not since it was born in the Great Depression has the federal system of deposit insurance for commercial banks faced such a period of danger as it does today.”\nOnce again Seidman rushed in to contradict the evidence, sounding very much like the cheerful Danny Wall of 1988: “I’ve said it before and I’ll say it again, the fund will be able to meet its obligations.” Is he bothered by the fact that more banks have failed in the past two years than in any comparable time since the Depression, and that these failures have reduced the insurance fund by 40 percent? Oh dear no. “I don’t think it’s a question of crisis and panic,” he told reporters after a Congressional hearing. “It’s a sign of increased stress.”\nBack to the 1920s\nNevertheless, though it is obvious that the tottering commercial banking world needs tighter regulations than ever, the industry and the Administration push on pell-mell for deregulation. In fact, the dismal condition of the industry is being used by the deregulating claque as their strongest, and weirdest, argument. Just as St. Germain, Garn, Pratt and Wall argued that the best way to help zombie thrifts recover was to remove all regulations so that they could “grow out” of their problems, now Bush, Fed chair Greenspan, Treasury Secretary Nicholas Brady, Seidman and others demand that the government dismantle what Seidman calls the “archaic laws” that for many years have controlled commercial banking. They, too, want to “grow out” of their perilous condition. What these laws do is protect the banking industry from its worst instincts by insisting that banks remain banks, and not become gamblers, hucksters and hustlers in other lines as well.\nThe deregulators will probably make their big power-play next spring, when, under mandate from Congress, the Treasury Department must come up with its “reform” plans for the banks. You can expect the other side to try to sell some blind horses to us, like offering to swap a lower ceiling on deposit insurance for wholesale abandonment of regulations–as if the rotters wouldn’t be just as happy engaging in risky activity under a lower ceiling as they have been gambling under the present one. If there is a double agent to be on guard against, it will be Donald Riegle, chair of the Senate Banking Committee. He and the moneylenders are–could any old saw be more apt?–thick as thieves. Riegle is recorded as receiving $200,900 from S&L officials and PACs between January 1981 and May 1990–second only to California’s Senator Pete Wilson ($243,334). Now that S&L money is seen to be tainted, Riegle has scrambled to redeem his reputation by returning $120,000 of it. But the commercial banks have stuffed his pockets too, and there is no record of his having returned any of that money.\nRecently Greenspan–that trustworthy fellow who guaranteed the morality of Keating and was one of the chief boosters of junk-bond purchases by S&Ls–guided his Fed colleagues into a disastrous decision. They ruled that J.P. Morgan (Morgan Guaranty Trust) could trade and sell corporate stocks. With this cloven hoof in the door, other banks will follow, and that will be the death of the Glass-Steagall Act, which Congress passed in 1933 to separate commercial banks from investment banks and thereby control some of the outlawry that had caused thousands of banks to fail. Next they will probably be targeting the Bank Holding Act of 1956, which was intended to keep banking out of commerce, and the McFadden Act, which limits interstate banking.\nWhat Greenspan, Seidman and their gang say to critics is, Oh, we want banks to be banks, too, but we want them to be universal banks. Which can be translated to mean uncontrolled banks, banks completely unfettered by regulations that restrict their operations–in short, pretty much a return to the reckless and lawless 1920s and early 1930s, which, if measured by the drama and excitement of collapsing financial structures, had it all over the 1980s.\nBrumbaugh, for one, is dumbfounded by what he’s seeing. “The administration and Congress just don’t want to acknowledge the problem,” he says with a sigh. “This is déjà vu all over again. You can’t believe it’s happening, but there it is.”",
  "word_count": 29215,
  "scraped_at": "2026-02-14T12:44:24.728199"
}