{
  "article_id": "517d4b7d845b",
  "url": "https://www.thenationalnews.com/arts-culture/film-tv/2025/09/02/horror-film-roqia-about-exorcist-with-alzheimers-blends-age-old-tradition-with-algerias-1990s-turmoil/",
  "title": "Horror film Roqia , about exorcist with Alzheimer , blends age - old tradition with Algeria 1990s turmoil",
  "date": "20250902T044500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Algerian filmmaker Yanis Koussim can still recall the first time he was truly frightened when watching something. He was six years old, and it was Michael Jackson’s ghoulish music video for Thriller, where the King of Pop transforms into a werewolf. “I’d never been very scared, but this traumatised me. I didn’t sleep for two weeks.”\nDirected by John Landis, the landmark Thriller music video was one of the contributing factors for Koussim becoming a director, alongside watching Steven Spielberg films. Not just the classics he made, but also others he was involved in, such as Poltergeist and The Goonies. “People can say: ‘Oh, it’s a popcorn movie.’ But one of my first emotional links with cinema was The Goonies. It was a communion.”\nSubconsciously, Koussim has ploughed all of this into his feature debut Roqia, a supremely effective Algerian horror that has just been unveiled in the Critics’ Week strand at Venice Film Festival.\nRoqia is the Arabic expression for exorcism. The film deals with an ageing raqi (a healer who fights evil through religious recitations), who is battling Alzheimer’s, and the concern that this may unleash an unspeakable evil.\nThe exorcism scenes are raw and unnerving, something Koussim studied carefully.\n“Roqia not only means an exorcism against demons, but also when you feel sad or depressed; you can go to an imam and he will do a roqia on you,” he explains. He even met with a raqi for research purposes, asking to see an exorcism against a demon, but was told that it was serious stuff. Instead, he was given advice that he applied to the making of the film.\nRoqia is partly set in the early 1990s, a period of great turmoil in Algeria, when the civil war pitted the government against Islamist rebel groups. “We were like a laboratory,” Koussim says. “The first time we had this kind of terrorist was in Algeria. After that, there was Al Qaeda and AQIM and Daesh. They came after. But during the 1990s, we experienced it first.”\nNow 47, Koussim remembers being in his mid-teens during that era, a time that proved formative not only for his budding interest in cinema, but also for the harsh realities around him. “Some of the terrorists in Algeria, I knew them,” he says. “They were my neighbours. I played football with them when we were teenagers.”\nAfter directing shorts and contributing to scripts for others – including Algeria My Love by Lotfi Bouchouchi – Koussim didn’t plan on writing a horror for his debut, but Roqia morphed into one. “I realised that it was a horror movie I was writing, because we lived horror. And I answered a question I had with Roqia: How do people like you and me suddenly turn into real monsters and commit such horrible crimes?”\nRoqia concludes with the quote: “Violent fundamentalism is not Islam but a distorted reading of its texts.” Expanding on this, Koussim speaks about his devout Muslim grandmother. “Islam, it’s a religion that fits in your life as you decide to welcome it as a person or as a believer,” he says. “It was not a religion that imposed itself on you. You choose how you welcome this religion.”\nIt really hit home when he heard that terrorists in Algeria claimed to be Muslims. “For me, no, it’s impossible that [extremists] share the same religion as my grandmother. And that’s why I made Roqia. Islam doesn’t need me to defend Islam, but I want to defend my grandmother and her beliefs.”\nHe wasn’t the only one in the family quietly battling fundamentalism. Koussim recalls his mother as being “very anxious”, but says that during the holidays in the 1990s, despite the danger, she'd let him go outside.\n“At the time, there were a lot of car bombs in Algiers. And I said: ‘Why did you let us go out? You were afraid of everything.' And she said: ‘I don’t know, but if I didn’t let you go out, it means that they have won.’ The will to fight the terrorists was stronger than her uncertainty about her children.”\nAlthough Roqia is among the first horror films to be made in Algeria, Koussim believes it will resonate with audiences. He notes that Algerians have long embraced the genre, recalling how horror titles dominated VHS rentals in the 1980s.\nStill, the pull of Hollywood remains strong. Koussim admits it would be hard to resist the allure of making a movie there. “My inner child would jump for joy.”\nAnd how would he feel if an American producer wanted to remake Roqia? Koussim says he would sell the rights, but only if he could co-write it, perhaps to shake things up. “Producers used to take more risks with movies,” he concludes. “I think Hollywood has to take more risks.”",
  "word_count": 804,
  "scraped_at": "2026-02-14T13:22:31.279185"
}