{
  "article_id": "51803a4e32fd",
  "url": "https://observer.ug/index.php/news/headlines/80928-iran-sentences-police-officer-to-death-for-killing-protester",
  "title": "Iran sentences police officer to death for killing protester",
  "date": "20240329T154500Z",
  "domain": "observer.ug",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Local police chief Jafar Javanmardi was arrested in December 2022 over the killing of a protester during the widespread demonstrations sparked by the death of Mahsa Amini in custody.\nIranian Kurd Amini, 22, died in custody in September that year following her arrest for allegedly violating the country’s strict dress code for women.\nJavanmardi was sentenced to death “in accordance with the Islamic law of retribution, known as the ‘qisas’ law, on the charge of premeditated murder,” the lawyer for the victim’s family, Majid Ahmadi, told the reformist Shargh daily.\nThe protester, Mehran Samak, 27, succumbed to injuries he sustained after being hit by shotgun pellets during a rally in the northern city of Bandar Anzali on November 30, 2022.\nRights groups based outside of Iran said Samak was shot dead by Iranian security forces after honking his car horn in celebration of Iran’s loss to the United States in the 2022 World Cup held in Qatar while at the Amini protest. The defeat eliminated Iran from the football tournament and drew a mixed response from government supporters and opponents.\nThe lawyer, Ahmadi, said at the time that the police official was charged with “violating the rules for firearms usage, resulting in the death of Samak.”\nIn mid-January, the judiciary’s Mizan Online website said the Supreme Court had annulled a death sentence and referred the case to another court. Gilan province, where Bandar Anzali is located, was a flashpoint of the nationwide protest movement that shook Iran.\nHundreds of people were killed during the months-long protests, including dozens of security forces, while thousands were arrested and nine men were executed in cases linked to the demonstrations.\ninarticle} inarticle}",
  "word_count": 278,
  "scraped_at": "2026-02-14T12:31:37.915349"
}