{
  "article_id": "51894ec2dc3e",
  "url": "https://www.rockmnation.com/2023/2/1/23579821/tigers-on-the-rise-set-to-face-another-set-of-tigers-careening-off-a-cliff",
  "title": "It Tigers ( Mizzou ) vs . Tigers ( LSU ) in Late Night Basketball",
  "date": "20230201T154500Z",
  "domain": "rockmnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Tigers on the rise set to face another set of Tigers careening off a cliff\nMizzou Links for Wednesday, February 1: Time to pad that NCAA resume in late night MU-LSU matchup\nWe’ve got another late one tonight. The Better Tigers (ours) are set to take on The Lesser Tigers (LSU) at 8pm tonight. Brandon’s preview for the game will be out early this morning, so this will be brief.\nFriends, the black and gold team you cheer for is doing quite well these days, and are a handful of wins from cementing a spot in the NCAA Tournament under first year coach Dennis Gates. They are winners of the last two by double digits — on the road at Ole Miss and at home vs Iowa State in the Big 12/SEC Challenge — and are sitting at 16-5, which is three win better than noted Mizzou “realist” Matt Harris said he thought they’d have at this point. Yay! They are also 4-4 in the SEC, a game back of Kentucky and Florida.\nAs for the Bayou Bengals, they are in a bit of free fall under new head coach Matt McMahon. In the past week, they lost by 7 to Texas Tech (11-10, 1-8 Big 12) in the Big 12/SEC Challenge and by 20 to Arkansas. In fact, they haven’t won a game since… I’m still scrolling… 12/28, when they beat Arkansas in their SEC opener. LSU is just 9-12 on the season and 1-7 in the SEC, and are tied for 12th place with Ole Miss.\nSide Note: It’s still hard for me to hear about LSU MBB and not be filled with rage over their coach former coach, Will ‘Loves to Cheat’ Wade. But alas, he was sent packing (far too late), and so I will simply channel my rage into their WBB coach, who truly deserves the ire of everyone.\nMoving on. Before we get onto to Bracket Watch, here’s a request from our favorite Mizzou coach, Dennis Gates, to show up tonight at Mizzou Arena. Only $5 for upper level and $10 for lower bowl!\nAnd finally, Tuesday is Bracket Day, so it is my duty to share this info with you this morning.\nAfter a 2-0 week the just-out-of-the-rankings Tigers find themselves now planted on the 7-seed line in Joey Brackets’ new edition. As a reminder, they’ve been as high as a 6-seed in his bracket (after the Illinois win), and in his post-Iowa State W bracket that evening, Missouri was an 8-seed and no. 30 overall. Movin’ on up!\nAccording to his seed list, Missouri finds itself as the overall no. 27 seed (their highest was 20, post-Illini).\nMatthew J Harris took a look at Bracket Matrix, which shares all the brackets. Seriously, there are SO MANY. Here’s what he found (and the link to Jerry Palm’s probably-way-too-high prediction):\nNot included in the matrix, but yes, another bracket, Bracketville updated their projections as of January 30. Same as Joe Lunardi, he’s got Mizzou as a 7-seed vs 10-seed Maryland, and they’re then faced with 2-seed Texas vs. 15-seed Youngstown State.\nTo wrap up the men’s news, Tuesday was also the normal MBB media day, and ABC 17’s Chanel Porter and other area reporters chatted with him and D’Moi Hodge.\nOn the importance of February basketball:\nOn the women’s side, Charlie Creme also released a new bracket. Looks like the continual throttling at the hands of their past six opponents have moved the Tigers further onto the outside of the tourney looking in, now in the Next 4 Out. They sit at 14-8 overall and 3-6 in the SEC. They’re 55 in the NET.\nHere’s their next 4 games, which features two teams currently included in Creme’s bracket:\nThur, 2/2 (H) vs. Vandy (10-12, 1-7 SEC, 3-5 on road, 104 NET)\nSun, 2/5 (H) vs Bama (16-6, 5-4 SEC, 6-2 on road, 23 NET, projected 8-seed)\nSun 2/12 (A) vs Arkansas (17-7, 4-5 SEC, 9-3 home, 36 NET, projected 9-seed)\nThur 2/16 (H) vs MS State (15-7, 4-5 SEC, 2-4 on road, 40 NET, projected 1st 4 out)\nAll hope is not lost, but they have some work to do.\nOn to the Links. MIZ!\nYesterday at Rock M\n- Josh’s new Revue features a truly unsettling photoshop, and compares Mizzou to Kick-Ass.\n- A new Dive Cuts with Matt & Sam asked if Mizzou is ready to lock up a tourney bid this week.\n- The Matts are back with a new edition of The Verdict. Watkins is looking at the dismantling of Iowa State, while Harris cuts up the video.\n- Nate the Great looked back at his 2022 Count the If’s piece, and examined how the Tigers did. They failed, you guys.\n- IN CASE YOU MISSED IT: I interviewed a bunch of delightful Mizzou WBB fans about their love of the sport and the team. Good stuff.\n- COMING UP: Parker examines his favorite uniforms of the season, and their record in each (thanks for the spreadsheet assist, ZWal) | Harris writes about big man Mo Diarra’s role | I’ve got a Mizzou vs Kentucky gymnastics preview in a ‘Battle of the Beamers’ | Matthew previews Tiger Style v OU\n- NEW! ROCK M QUOTE OF THE DAY (because my Digest is on hiatus):\n“The Tigers, adorned in their fresh vintage uniforms, squared off with former conference foe, Iowa State. Though the names of the players had changed, and the venue was several hundred yards further south, the nostalgia was splitting at the seams.” —Matt Watkins, The Verdict\nMore Links:\nHoops\n- St. Louis Post-Dispatch: With NET ranking spots at stake, Mizzou basketball begins ‘dog days’ of February (Dave Matter)\n- Columbia Tribune: Kwiecinski: Why Mizzou is a NCAA Tournament team, no matter what | Dennis Gates says Tre Gomillion is ‘day-to-day’ as Mizzou basketball’s injury updates (Chris Kwiecinski)\n- PowerMizzou: 2024 guard Travis Perry talks unofficial visit to Mizzou (Drew King) | WATCH: Dennis & D’Moi preview LSU |\n- Columbia Missourian: SEC Power Rankings: A chaotic month leads to some changes (Jaden Lewis) | Takeaways from another winless week for MU women’s basketball (Payton Havermann) | Looking for 3rd straight win, Missouri men’s basketball faces slumping LSU (Jack Knowlton) | Tigers get closer to hearing name called on Selection Sunday (Lewis)\n- Friend of the Pod (and me) Blake Lovell of Southeastern 14 has brought on a couple of Mizzou interns, and Rory Whetstone made her debut to discuss some hoops!\nFootball\n- PowerMizzou: Newcomer Profile: Jake Garcia (Jarod Hamilton) | In-state OL target Ryan Jostes talks Jr. Day visit (Sean Williams) | New in-state OL target in the 2024 class talks direct ties to Missouri and interest in the Tigers’ program (Williams)| News & Notes from Mizzou’s Junior Day (Williams) | Mizzou Report Card: Defense & Special Teams after the Early Signing Period (Hamilton)\nOther Mizzou Sports\n- Your weekly reminder from Dennis Gates on what to watch out for this week:\n- Baseball is coming. Time for some reading on the offseason changes: The Maneater: Replacing lost production is Missouri baseball’s key to success in 2023 (Reece Candler)\n- Your no. 14 (per RoadtoNationals.com), 7th in SEC, 3rd in South Central region) Tiger Gymnastics squad will take on the Kentucky Wildcats (no. 10 in RTN rankings) on Friday at home at 5pm. In the meantime, feast your eyes upon this awesomeness.\n- Softball season is just around the corner! Next Friday they’ll be in Clearwater!!!!! In the meantime: Justin Sykes named as MU softball’s first director of player development (Maddie Orr, Missourian). While we’re waiting, enjoy this:\n- Wrestling returns to the mats on Friday to take on Oklahoma.\nMizzou in the Pros\n- J’DEN COX NEWS: Kyle Snyder vs J’den Cox Headlines Best Matches At The Zagreb Open (Jon Kozak, FloWrestling)\n— — — — — — — — — — — — —\nIf you’re looking to sign up for ESPN+, Rock M Nation now has an affiliate link: click Here for ESPN+ Now!\nIf you’re looking to sign up for a new streaming service, you can try FuboTV: click HERE for FuboTV access — FuboTV now has ESPN, CBS, FS1 and more sports channels.\n(** RockMNation has affiliate partnerships. These do not influence editorial content, though RockMNation may earn commissions for products purchased via affiliate links.**)",
  "word_count": 1393,
  "scraped_at": "2026-02-14T13:34:25.217813"
}