{
  "article_id": "51903ec9e732",
  "url": "https://www.chicagotribune.com/2025/11/04/daywatch-lawmakers-pass-bill-to-strengthen-illinois-ability-to-set-its-own-vaccine-guidelines/",
  "title": "Daywatch : Lawmakers pass bill to strengthen Illinoi ability to set its own vaccine guidelines – Chicago Tribune",
  "date": "20251104T140000Z",
  "domain": "chicagotribune.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning, Chicago.\nLawmakers have passed a bill to strengthen Illinois’ ability to make its own vaccine guidelines — legislation that follows months of tumult over vaccines at the federal level.\nThe bill expands the authority of the Immunization Advisory Committee, which is a group of doctors and other experts and leaders that makes vaccine recommendations to the director of the Illinois Department of Public Health. The bill also requires that insurance companies in Illinois cover vaccines recommended by the director of the state health department.\n“This really is a reaction from the state of Illinois, given the politicization of public health policy at the federal level,” said chief bill sponsor Rep. Bob Morgan, D-Highwood. “We’re building out an infrastructure so Illinois can provide access to vaccines in the event of federal inaction or obstruction.”\nRead the full story from the Tribune’s Lisa Schencker.\nHere are the top stories you need to know to start your day, including:\nToday’s eNewspaper edition | Subscribe to more newsletters | Asking Eric | Horoscopes | Puzzles & Games | Today in History\nDick Cheney, one of the most powerful and polarizing vice presidents, dies at 84\nDick Cheney, the hard-charging conservative who became one of the most powerful and polarizing vice presidents in U.S. history and a leading advocate for the invasion of Iraq, has died at age 84.\nRelated:\nUS Rep. Jesús ‘Chuy’ García not running for reelection, source says, as last candidates file for 2026 campaigns\nU.S. Rep. Jesús “Chuy” García of Chicago will not run for reelection, a source close to the congressman said yesterday, apparently ceding the spot to his chief of staff, who filed to run for the 4th Congressional District seat that García has held since 2019.\nGarcía last week filed to run for reelection next year but yesterday his chief of staff, Patty Garcia, also filed for the same spot. A source who was briefed on the matter told the Tribune that the congressman was expected to withdraw his petitions to run for another term, leaving the Democratic slate free for Patty Garcia to win and all but ensuring she’d be elected in the heavily blue Chicago congressional district.\nGov. JB Pritzker says he’s still deciding whether ‘right-to-die’ legislation should become Illinois law\nDemocratic Gov. JB Pritzker said he was still deciding whether he’d sign legislation that would permit doctors to help terminally ill people end their lives, after the bill narrowly passed the General Assembly last week.\n“It was something that I didn’t expect and didn’t know it was going to be voted on, so we’re examining it even now,” Pritzker said.\nAldermen force special meeting to vet cost-cutting budget recommendations\nA group of Chicago aldermen scheduled a rare special City Council meeting in an effort to push Mayor Brandon Johnson to further consider budget cuts.\nThe group is demanding the Ernst & Young consultants hired by Johnson’s administration to create a budget report testify during the meeting next Monday about their findings. The move marks an escalation in pushback against Johnson’s budget plan as City Hall looks to plug a nearly $1.2 billion spending gap.\nHundreds gather in rural Illinois to remember lives of Darren Bailey’s son, family killed in helicopter crash\nFrom across the state, several hundred mourners gathered yesterday inside a cavernous gymnasium in rural southeastern Illinois to remember the son of Republican candidate for governor Darren Bailey, two of his grandchildren, and his daughter-in-law, all of whom were killed in a helicopter crash last month.\nCPD officer stands trial on accusations he sexually abused handcuffed woman\nA 25-year-old woman testified yesterday that a Chicago police officer sexually abused her while she was handcuffed to a wall at a North Side police station.\nWinthrop Harbor man accused of making death threats against Trump\nA man from far north suburban Winthrop Harbor has been charged in federal court in Chicago with making a series of online threats to President Donald Trump and others, saying in one video posted to social media he could get “a lot of (expletive) guns” and would “take care of business himself.”\nWill the Chicago Bears be buyers or sellers? What to know as Tuesday’s NFL trade deadline nears.\nThe NFL trade deadline is fast approaching. All trades must be submitted by 3 p.m. today.\nRelated:\nCollege Football Playoff’s 1st rankings are out tonight. What’s the path for Notre Dame and Big Ten teams?\nThe season’s first College Football Playoff rankings will be unveiled at 7 p.m. tonight on ESPN. CFP hopefuls have four weeks left in the regular season, followed by conference championship weekend, to make their cases for inclusion in the 12-team field.\nFrom cradle to grave: There was something for everyone alive and otherwise at the Chicago funeral directors convention\nThe National Funeral Directors Association annual convention, which recently ended at McCormick Place, and happens every October, and has met for more than 140 years, was not a solemn gathering. There was a small bar off to the side, between the booth for Southern Funeral Director Magazine and a casket maker. I saw women dressed as flowers trying to drum up attention for an AI-assisted database for funeral homes. I saw a man take bites of his hot dog between answering questions about cremation niches, those roomy holding spaces for urns. Hubert McQuestion, vice president of a longtime family-owned vault company, told me he slipped a check for $2 million into his late father’s jacket pocket, to be buried with him for eternity, though: “He still hasn’t cashed it.”\nRick Steves’ Europe: Carcassonne: The Fortress City of your travel dreams\nThe massive walls enfolding the old town are nearly two miles around, with 52 towers, each topped with a “witch hat” turret. For good measure, an outer rampart was added in the 14th century. While the double walls seem mighty enough, moats strengthened the city’s defenses even more. These weren’t actually filled with water and alligators – they were just a dry, dangerous no-man’s-land designed to expose attackers. The only way to beat a place like Carcassonne was a starve-’em-out siege. (Charlemagne supposedly tried it, but gave up.)\nRestaurant news: Crying Tiger opens with a love for Southeast Asia from chef Thai Dang in Chicago\nCritically acclaimed chef Thai Dang, who fled Vietnam as a 7-year-old refugee with his family, has partnered for the first time with Lettuce Entertain You, the biggest restaurant group in Chicago.\nThe new Southeast Asian restaurant was named for a ferociously fiery dish. Suea rong hai translates to crying tiger in the Thai language. Grilled sliced beef is served with a defining and spicy sauce.",
  "word_count": 1104,
  "scraped_at": "2026-02-14T14:21:26.198895"
}