{
  "article_id": "51915a318745",
  "url": "https://www.90min.com/dutch-defender-extends-contract-man-city-until-2027",
  "title": "Dutch defender extends contract with Man City until 2027",
  "date": "20241217T120000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Dutch defender extends contract with Man City until 2027\n- Kerstin Casparij has signed a new contract with Manchester City\n- The full back joined the club from FC Twente in 2022\n- Her initial deal was set to expire in the summer\nDutch international Kerstin Casparij has signed a new deal with Manchester City until 2027.\nThe 24-year-old full-back joined the club in the summer of 2022 from FC Twente, but was one of five players set to be out of contract at the end of this season. Casparij scored her first goal for the club earlier this month in the 2-0 home win against St. Polten, making her mark in the UEFA Women's Champions League.\nDespite interest from unnamed clubs, Casparij insists it was always her intention to extend her stay at the Joie Stadium. “There was a little bit [interest from other clubs], but I knew I wanted to stay and I’d already made up my mind,” she told the media earlier this week.\n“I think the initial conversations I had with the club were in March and I’d already made up my mind. I knew I wanted to stay. So any other interest was thank you but no thank you.”\nSince Casparij’s arrival in 2022, City have secured fourth and second place finishes in the WSL, but haven’t reached a domestic cup final. They were knocked out of the Champions League in the qualifying rounds during the defender’s first season, so reaching the knockouts in the competition this term represents a huge step forward for both the club and the player.\n“I felt my time here wasn’t done,” Casparij continued. “I still have a lot of areas to improve and, as much as I’ve grown over the last two-and-a-half years, I still think I’ve got my best games ahead of me.\n“The club felt like the right place to be and the right place to stay. It’s really become home over the last few years, so I just wanted to stay home for a little while.”\nGareth Taylor played a significant role in bringing Casparij to the club two years ago, and the defender is pleased with the progress she has made under the manager. “That’s the goal [to be one of the best full backs in the world] and Gareth helps me work towards that,” she concluded.\n“Like I said, I’ve still got a lot of areas to improve but I feel like City is the right place for me to be. Gareth has helped me so much and he holds me to really high standards, which works out for me as well.\n“I think the combination of the aspirations I have, and the club supporting me in that, it’s really good.”",
  "word_count": 457,
  "scraped_at": "2026-02-14T12:48:49.831995"
}