{
  "article_id": "51a5ebbf873e",
  "url": "https://www.justarsenal.com/we-want-to-find-more-consistency-says-arsenal-women-captain-kim-little/357994",
  "title": "  We want to find more consistency  says Arsenal Women captain Kim Little",
  "date": "20240115T184500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "I’m sure that winning the WSL is one of Arsenal Women’s top team goals. Our Gunners haven’t been able to get their hands on that most highly prized of trophy’s in English women’s football since 2019.\nComing into this season, head coach Jonas Eidevall was not afraid to spend heavily in order to have a large, high-quality squad. Only a hater would not be astounded by the caliber of Arsenal’s Women’s team, thanks to his effective recruiting.\nAnd, while some feel that\nJonas Eidevall not knowing his best 11 is the Gunner Women’s toughest challenge, the team as a whole has done well thus far. Even though their 1-0 setback to Spurs had some questioning their title credentials, they are still rightfully in the title race, sitting three points behind league leaders Chelsea.\nWhile commenting on the No More Red campaign, Arsenal Women’s captain Kim Little made some comments that I believe hint at how she and the girls might win the league.\nLittle, who is about to make her 300th appearance for Arsenal, acknowledges that they have found a way to get decent results from the top four teams (Chelsea, Manchester City, and Manchester United), but feels they are letting the fans down by not doing the same by thrashing teams they should beat like Liverpool and Tottenham Hotspur, who have picked surprise wins over them. She contends that they must be clinical and find a way to break down opponents that play a defensive game against them by understanding when to take shots and capitalizing on every opportunity that comes their way.\n“I think we played incredibly well in those games against the top four sides and rose to the occasion to get the results we wanted. But we ultimately lost games we shouldn’t have lost. There were disappointments we’ve had to learn from. We need to keep doing what we’ve been doing to win those big games while also finding a rhythm and consistency to get results elsewhere.\n“A lot of that comes down to efficiency. If you look back at any of those disappointing games over the past year, it wasn’t down to a lack of chance creation. We struggled with execution and the end product. Going forward, it’s about ensuring we’re taking shots from the right areas and being clinical. That’s the most important ingredient in those games where you’re up against a low block—the spaces are tight, and while we might see a lot of the ball, there are relatively few golden opportunities to score. We need to make the most of them.”\nGunner women ought to be listening to Kim Little. I can’t help but think that our Gunners know how to win the league, if they follow her advice. Hopefully, they’ve worked on their flaws and will play like they’re in it to win it when they return to league action next weekend. Arsenal Women looked in great form during\nyesterday’s 5-1 win over Championship side Watford, progressing our Gunners to the 5th round of the Women’s FA Cup.\nArsenal’s next league game is against Everton at Meadow Park on January 20th, kick-off 2PM UK.\nCOYGW!\nMichelle Maxwell\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….\nMore Stories / Arsenal Women",
  "word_count": 562,
  "scraped_at": "2026-02-14T12:22:28.984873"
}