{
  "article_id": "51af7eefc388",
  "url": "https://www.dailypress.com/2025/12/31/former-nansemond-suffolk-rb-george-pettaway-staying-with-jmu-for-third-year/",
  "title": "Former Nansemond - Suffolk RB George Pettaway staying with JMU for third year",
  "date": "20260101T044500Z",
  "domain": "dailypress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "COLLEGE FOOTBALL\nRB Pettaway returning to James Madison\nRunning back George Pettaway, a Nansemond-Suffolk Academy graduate, announced he’ll return for his third James Madison season after one with North Carolina. He was plagued by injuries in 2025, though he caught a touchdown pass at Oregon in the College Football Playoff. In 2024, he rushed for 980 yards and amassed 200 yards receiving.\nAlso returning for JMU is offensive lineman Zach Greenberg, who primarily was the starting center.\nJMU coach Billy Napier is hiring Rob Wenger, most recently of Sacramento State, as the Dukes’ special teams coordinator.Safety Curtis Harris/Lopez, who played for Chesney with Holy Cross and JMU, declared for the draft.\nVMI names coach from Carson-Newman\nVMI named Ashley Ingram as the 34th head coach in program history.\nIngram spent the last two seasons as the head coach at Division II Carson-Newman in Tennessee, where his teams were 16-6, going 13-4 in South Atlantic Conference play and earned an NCAA playoff bid. He amassed the most wins by a coach in his first two seasons in Carson-Newman history.\nIngram’s Carson-Newman teams ran the triple option. Before that, he spent 16 years with Navy in roles ranging from position coach to assistant head coach. He was an offensive lineman in the mid-1990s for three NCAA Division II champion North Alabama teams.\nVMI endured consecutive 1-11 seasons as Danny Rocco closed a tenure that began with a 5-6 campaign in 2023. Rocco, who was well over .500 as the head coach from 2006-21 for Liberty, Richmond and Delaware, has since become an assistant coach on James Franklin’s Virginia Tech staff.\nOffensive linemen come back to UVA\nAmong the players returning for Virginia will be three offensive linemen. One is former all-conference pick Makilan Thomas, whose 2025 season ended early because of an injury.\nOffensive lineman Monroe Mills also will return. He joined the Cavaliers last January but was sidelined because of an anterior cruciate ligament injury he incurred in the spring. Also coming back is Drake Metcalf.\nAmong departures from Virginia, wide receiver Jayden Thomas and defensive lineman Jacob Holmes declared for the 2026 NFL draft, and wide receiver Andre Greene Jr. said he would enter the transfer portal.\nSome Hokies line up to enter portal\nHokies running back Jeremiah Coney plans to enter the portal, according to Kolby Crawford. The 6-foot, 200-pounder has run 50 times for 254 yards in three seasons.\nAlso entering the portal, according to his Instagram story, is defensive lineman Arias Nash. He has one year of eligibility left. Also going to the portal from the Hokies is Braydon Bennett, a running back who played in four games for Tech after rushing in 2024 for 781 yards and 11 touchdowns for Coastal Carolina.\nA potential target for Virginia Tech is Penn State defensive tackle Xavier Gilliam, who is headed for the transfer portal, On3 Sports reported, citing his agent. The 6-foot-3, 300-pounder had 16 tackles in 11 games this season. Gilliam originally played for current Hokies coach James Franklin with the Nittany Lions.\nTribe CB Jones invited to NFL-FCS Showcase\nWilliam & Mary All-America cornerback Jalen Jones of Chesapeake earned an invitation to the inaugural NFL-FCS Showcase, which will be held Jan. 4-5 in Nashville, Tennessee.\nThe event, which is coordinated by the NCAA, the American Football Coaches Association and the NFL, will feature numerous pro scouts and provide an evaluation platform for 50 FCS prospects who are eligible for the 2026 NFL draft. Jones, a former Deep Creek High star, is among them.\nMany ex-JMU staffers join Chesney at UCLA\nNew UCLA coach Bob Chesney’s staff will look much like his James Madison staff did. That includes defensive line coach Sam Daniels, a former JMU standout who grew up in Portsmouth.\nAmong the other assistants reportedly going with Chesney to UCLA are Dean Kennedy (offensive coordinator), Chris Smith (offensive line/run game coordinator), Drew Canan (tight ends/special teams), Colin Hitschler (defensive coordinator) and former Virginia Tech player Eddie Whitley (defensive backs/nickel backs).\nCOLLEGE MEN’S GYMNASTICS\n3 Tribe athletes honored by ECAC\nWith the season opener two weeks away, three William & Mary standouts were selected to the Eastern College Athletic Conference Preseason Gymnasts to Watch list: senior Ricky Pizem, junior Evan Wilkins and sophomore Luke Tully.\nThe league’s preseason poll was also announced, and the Tribe was predicted to finish third by a vote of the conference’s six head coaches. Army and Navy tied for the top spot and were followed by W&M, Greenville, Springfield and Simpson.\nTENNIS\nUVA standout Jódar turning pro\nSpain’s Rafa Jódar, a standout freshman last season for Virginia who recently qualified for the Next Gen ATP Finals (for eight of the world’s top players younger than 20), said he will forgo his remaining eligibility with the Cavaliers and turn pro.\nSOCCER\nUVA star Godfrey signs with NWSL team\nLia Godfrey, a graduate midfielder for the Virginia women’s team, signed a professional contract with San Diego Wave FC of the National Women’s Soccer League.\nA first-team All-America honoree in 2025, Godfrey was the Atlantic Coast Conference Midfielder of the Year and an All-ACC first-team honoree in 2025. She tallied 11 goals and four assists.",
  "word_count": 861,
  "scraped_at": "2026-02-14T13:24:16.934892"
}