{
  "article_id": "51b5de199140",
  "url": "https://www.aol.co.uk/did-hannah-hampton-thanks-grandfather-145646319.html",
  "title": "We did it – Hannah Hampton thanks late grandfather for inspiring Euro success",
  "date": "20250728T154500Z",
  "domain": "aol.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "We did it – Hannah Hampton thanks late grandfather for inspiring Euro success\nEngland goalkeeper Hannah Hampton paid an emotional tribute to her late grandfather after revealing he died just two days before their triumphant Euro 2025 campaign began.\nHampton’s two saves in England’s penalty shootout with Spain to decide Sunday’s final capped off a brilliant Euros for the Chelsea stopper, who set the stage for Chloe Kelly to fire in the winning spot-kick and ensure the Lionesses defended the crown they won at Wembley.\nThe 24-year-old was named player of the match after the final, and on Monday shared she was heartbroken that her grandad did not live to see her fulfil their shared dream of seeing her play for England at a major tournament.\nPosting to her Instagram alongside a picture of her green England shirt with “grandpa” printed in the neckline, Hampton wrote: “Dear Grandpa.\n“Two days before the biggest tournament of my life, you left. It still doesn’t feel real. I kept thinking when I’d call nannie I’d hear your voice again – one of your jokes, or one of those little comments you’d make that somehow said everything without saying much at all.\n“You were one of my biggest supporters. You believed in me before I even knew what this journey would look like.\n“You were always there: watching, encouraging, teaching. You taught me so much, not just about football, but about life. About staying grounded, working hard, being resilient and doing things the right way.\n“I miss our chats. I miss you saying, ‘only us athletes understand’ — always with a little smirk like you were in on something special. And you were. You got it. You understood what this meant to me. You understood what it took.”\nHampton – who had usurped Euro 2022 winner Mary Earps to become Sarina Wiegman’s first-choice keeper – was under enormous pressure to deliver in Switzerland, particularly after Earps announced her shock international retirement in May, leaving Hampton with two uncapped backups in Khiara Keating and Anna Moorhouse.\nShe was a revelation at the tournament, from her wonder pass to set up Lauren James’ goal against the Netherlands in the group stage to playing through a bloody nose in their quarter-final shootout with Sweden.\nHampton kept England alive for 120 minutes in the final before denying Women’s Super League player of the season Mariona Caldentey, then back-to-back Ballon d’Or winner Aitana Bonmati, in the shootout.\nback to back. pic.twitter.com/UztquqXGcL\n— Hannah Hampton (@hannahhampton_) July 27, 2025\nHampton has made a point of proving people wrong her whole life. Had she listened to the doctors who diagnosed her with an eye condition that affects her depth perception, she might not be playing football, let alone goalkeeping, at all.\nOn Sunday, she proved her detractors wrong once and for all.\n“It breaks my heart that you didn’t get to see me walk out for our country at my first major tournament,” she continued.\n“Something you dreamed of for me, something we talked about so many times. I wanted to see your face or hear your voice after the game calling back home. I wanted to share that with you.\n“But I know, deep down, you were still there. I felt you with me. In the tunnel. On the pitch. In the tough moments. I heard you in my head when I needed strength. I hope I made you proud, Grandpa.\n“I carried you through every minute, and I always will. I did it. We did it.”\nHampton was one of four England players named in UEFA’s team of the tournament on Monday afternoon, along with defender Lucy Bronze and forwards Kelly and Alessia Russo.\nFour players from runners-up Spain also made the XI – Irene Paredes and midfield trio Patri Guijarro, Bonmati and Alexia Putellas – along with Italy’s Elena Linari and Germany duo Franziska Kett and Jule Brand.",
  "word_count": 650,
  "scraped_at": "2026-02-14T12:43:56.269296"
}