{
  "article_id": "520f64456369",
  "url": "https://www.90min.com/posts/eafc-24-toty-the-top-rated-cards-ranked",
  "title": "EAFC 24 TOTY : The top rated cards",
  "date": "20240121T201500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EAFC 24 TOTY: The top rated cards - ranked\n- EA Sports have revealed their men's and women's Team of the Year\n- Five players have been given a game-high 97 rating\n- Aitana Bonmati, Kylian Mbappe and Erling Haaland all feature\nVideo games have become increasingly intertwined with the ultimate beautiful game.\nZlatan Ibrahimovic tried to explain Lionel Messi's generational talent by likening what he did on the pitch to a virtual figure in a games console. \"He plays like he's on PlayStation,\" Ibrahimovic gushed years ago, \"it's unbelievable.\"\nAfter scoring a pair of near identical goals for Arsenal in this season's Premier League, Gabriel Martinelli took to social media, succinctly summing up the Thierry Henry-esque finish he performed not with any words but the combination of buttons to smash to replicate his goals on EA Sport's flagship game, FC 24.\nDespite his clear interest in the virtual world, Martinelli didn't make EA's Team of the Year (TOTY) for 2023. However, Messi was one of the 22 men and women includes in the respective starting XIs.\nHere are the best cards from this lofty group of world beaters.\nWhen is the EAFC 24 TOTY released into packs?\nSticking to tradition, the release of the TOTY cards will be staggered. Opening up with the six attackers on Friday 19 January, midfielders will follow two days later before defenders and goalkeepers get their turn on 23 January.\nBy 25 January, the entire team will be available in packs and via various in-game challenges.\nEAFC 24 TOTY top rated cards - ranked\n10. Kevin De Bruyne - 96\nAt his first meeting with Manchester City's incoming manager Pep Guardiola in 2016, the Catalan told De Bruyne: \"Kevin, listen. You can be - easily - a top-five player in the world. Top five. Easily.\"\nA 96 overall rating ensures that only three male players are ranked higher than De Bruyne but a few more are slightly better suited to this year's gameplay on FC24.\n9. Lionel Messi - 97\nPele retired when he was 36. Zinedine Zidane lasted until he was 34 and Johan Cruyff had hung up his boots while he was still 31. Lionel Messi - who turns 37 this summer - is still ranked as the best player in the world.\nA hefty 97 score reflects his success at the Ballon d'Or and The Best ceremonies but his top-line stats don't quite match up to his overall rating.\n8. Sam Kerr - 96\nThis will surely be Sam Kerr's highest-rated card for some time. The prolific Chelsea forward suffered a season-ending ACL injury a day before voting for this year's TOTY went live.\nNevertheless, Kerr had already delivered an unrelenting churn of performances to ensure that she was worthy of a suped-up set of stats.\n7. Sophia Smith - 95\nSophia Smith may be one overall rating lower than Kerr, but there is little to choose between the shooting, dribbling and physical face card stats. Yet, when it comes to passing and that all-important pace, Smith comfortably comes out on top.\nThe young star of the US national team also boasts a five-star weak foot compared to Kerr's four.\n6. Erling Haaland - 97\nErling Haaland may insist that he's \"not a dribbler guy\" but his TOTY card boasts a 91 rating in that category. When compared to his outrageous pace (96), shooting (98) and physical (97), then it's clear that Haaland's strengths lie elsewhere.\nPerhaps the one aspect of Haaland's game that lets his card down is his passing. Despite providing 12 Premier League assists since the start of last season - more than Bruno Fernandes or Martin Odegaard - Haaland's passing is a tame 80.\n5. Aitana Bonmati - 97\nThis has unmistakably been Aitana Bonmati's year. Barcelona's attacking hub not only won every trophy available at club and international level, but completed an unprecedented quadruple of individual awards; in less than six months, Bonmati was recognised as the best player in the world by UEFA, the Ballon d'Or and FIFA while also winning the World Cup Golden Ball.\nWhile there's no doubting how good Bonmati's card is, it doesn't quite come out on top in a video game where pace is still so valuable.\n4. Jude Bellingham - 96\nIt's easy to forget that Jude Bellingham is just 20 years young. By the time Bellingham was born, EA Sports had already released ten iterations of the FIFA series.\nAn unprecedented start to his Real Madrid career - leaving teammates \"amazed\", \"speechless\" and touting him as a future club captain - has been reflected with arguably the most well-rounded card in the entire game.\n3. Alexia Putellas - 96\nWhen Alexia Putellas first moved to Barcelona's academy, the coach Xavi Llorens couldn't tell which was her stronger foot because she had been practicing with her right so much. EA rightly recognised Putellas' bipedal brilliance with a five-star weak foot but when coupled alongside a five-star set of skill moves, few midfielder cards can beat the Barcelona sensation.\nDespite enduring a gradual reintegration into the first team for club and country after a year-long recovery from a torn ACL, Putellas comfortably received the most votes of any player, male or female, from a public intent of having her in the Team of the Year.\n2. Caroline Graham Hansen - 97\nBoasting stats of at least 93 in four different categories - pace, shooting, passing and dribbling (the good ones) - Graham Hansen has been recognised by Electronic Arts where France Football have criminally overlooked her.\nDespite serving as the sharp end of Barcelona's all-conquering European champions, Graham Hansen was not even nominated for the 2023 Ballon d'Or. Incredibly, she has been overlooked every year since the award's inception in 2018.\n1. Kylian Mbappe - 97\nPoland and Aston Villa full-back Matty Cash survived a World Cup knockout tie directly up against Mbappe - but only just. \"I spent the afternoon watching his clips and I knew it was going to be a tough test,\" Cash reflected. \"In real life, he's burning my legs.\"\nThere will be pixels in flames across the game when Mbappe's jet-heeled TOTY card finds its way onto the pitch. The fleet-footed 25-year-old has been handed 99 pace and the Quick Step Play Styles+. Effectively, this card is the virtual personification of a cheat code.",
  "word_count": 1059,
  "scraped_at": "2026-02-14T12:57:23.915908"
}