{
  "article_id": "521e0ad6f65c",
  "url": "https://dailytrust.com/nasarawa-united-coach-dogo-devastated-by-loss-at-enyimba/",
  "title": "Nasarawa United Coach Dogo  devastated  by loss at Enyimba",
  "date": "20250110T094500Z",
  "domain": "dailytrust.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nasarawa United Technical Director, Kabiru Dogo, has expressed his team’s devastation following their 2-1 loss to Enyimba in a rescheduled Nigeria Premier Football League (NPFL) matchday 17 clash in Aba on Wednesday.\nDespite creating several goal-scoring opportunities, the Lafia-based club was unable to convert, with Anas Yusuf netting the only goal for his side, while Joseph Atule and former Super Eagles striker Brown Ideye found the back of the net for Enyimba.\nIn a post-match interview, Dogo acknowledged that his side’s inability to capitalize on their chances was a key factor in the defeat.\n“We are devastated by the loss,” he said. “We created several opportunities to win, but unfortunately, we couldn’t take them.”\n- Cricket Federation confident ahead U-19 Women’s World Cup\n- Djokovic says he was ‘poisoned’ during 2022 Melbourne detention\nLooking ahead, Dogo stressed the need for Nasarawa United to strengthen their squad, particularly in attack, during the mid-season transfer window.\n“We are looking forward to rejigging the team during the break,” he stated. “We need to address our challenges, especially in the finishing department, as we head into the tougher second half of the season.”\nCurrently sitting at the bottom of the NPFL table with just 19 points, Nasarawa United has struggled to score goals this season and will be aiming for reinforcements to improve their fortunes.\nUPDATE NEWS:\nNigerians can now invest ₦2.5 million on premium domains and profit about ₦17-₦25 million. All earnings paid in US Dollars. Rather than wonder, click here to find out how it works.",
  "word_count": 254,
  "scraped_at": "2026-02-14T12:43:18.508144"
}