{
  "article_id": "529a4ef14500",
  "url": "https://goutsa.com/news/2025/05/27/utsa-athletics-leading-the-way-in-support-of-first-generation-college-student-athletes",
  "title": "UTSA Athletics Leading the Way in Support of First - Generation College Student - Athletes",
  "date": "20250528T031500Z",
  "domain": "goutsa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SAN ANTONIO – Lisa Campos grew up in the small southeastern Colorado town of Las Animas, where her parents Joe and Rose constantly impressed upon her the importance of education.\n“They did not receive a formal education, but they wanted a much better life for me,” Campos said. “They knew that education would really change the trajectory of my life. They knew that education would open doors for me later in life and I was really fortunate that they always talked about how important getting a college degree is.”\nCampos attended Colorado State University as a first-generation college student, earning her bachelor’s and master’s degrees and later graduating with her Ed.D. in educational leadership from UTEP. She now serves as Vice President for Intercollegiate Athletics at UTSA, leading an athletics department that is setting the standard for supporting first-generation college student-athletes.\nIn any given year, UTSA’s undergraduate student population is comprised of approximately 45 percent first-generation college students. The university provides a wide variety of programming and resources supporting first-generation students as part of the UTSA First-Generation & Transfer Student Center. In 2019, the Student Affairs Administrators in Higher Education (NAPSA) named UTSA a top university for its programming efforts to create a supportive and empowering campus for first-generation and transfer students.\nThe composition of UTSA’s student-athlete profile mirrors the institution. In the Spring 2025 semester, thirty-three percent – or 113 of the Roadrunners’ student-athletes – were the first in their families to attend college.\n“My entire career, I’ve always chosen to work at universities that serve first-generation students because I really want to give back,” Campos said. “My undergraduate and graduate experience was incredible and Colorado State was ahead of its time in serving first-generation students. They provided such wrap-around support for me. To be able to give back to first-generation students is really important to me.”\nMany of the staff members who serve UTSA’s student-athletes are first-generation college graduates. Including Campos, four of the 10 members of the department’s senior staff were first generation, including Shanda Hayden, the Senior Associate Athletics Director who oversees UTSA Athletics’ Student-Athlete Academic Services unit.\n“This institution provides a lot of support from day one,” said Hayden, who holds two degrees from the University of Kansas. “I didn’t have that when I was an undergraduate. Most new college students don’t know that they don’t know, so we’re helping them ask the questions they need to be asking and connecting them with a lot of different resources that can help them be successful. To me, what is also rewarding is that I am one of many examples that you can achieve.”\nKaden Chumbley is an assistant athletics communications director for the Roadrunners, working with UTSA’s highly successful baseball and women’s tennis programs. Like many of the student-athletes with whom he works, Chumbley found attending to college to be a steep learning curve, but one that prepared him well for life.\n“I’m from a small oil town in eastern New Mexico,” said Chumbley, a Texas Tech University graduate. “It means a lot to be first generation from the town I’m from just because there are a lot of opportunities right out of high school, so not a lot of kids go to college and I decided to take this route. The difference is you really don’t know what you’re getting yourself into. You can read about it and everyone’s experience is different but with no basis to go off of, you don’t know what to expect and you’re kind of adapting.\n“I think that’s a really good trait to have – to be able to adapt and learn as things come at you and then just being able to deal with those things.”\nChumbley, who has worked in the athletics departments at both Texas Tech and New Mexico State, joined the Roadrunners in the fall of 2024. He has been impressed with the support that exists at UTSA for first-generation college students.\n“I take a lot of pride in it,” Chumbley said. “Most universities in my experience didn’t really feel like a community of first-generation students. Just to know there are so many students here that are first-generation, you can really relate to a lot of other people.”\nTaryn Madlock, who recently concluded her sophomore season, is one of 16 first-generation student-athletes on the UTSA Softball team, which is comprised of 70 percent first-gen students. The Boerne, Texas, native finds the opportunity to chart her own course at a place that embraces first-generation students like her to be empowering.\n“I don’t have any standards or expectations on how I’m supposed to go through college, so I just get to figure it out on my own and make it my own story,” said Madlock, a medical humanities major. “It’s very impactful being surrounded by a bunch of first-generation college students. It’s encouraging being in the classroom with them and being able to go through this journey together.”\nParticipating in sports provides access to so many avenues in life and, according to Madlock, is an important vehicle for first-generation college students.\n“Athletics, I think, are the gateway for first-generation college students because a bunch of people out of high school don’t know what they want to do so they just kind of go off and figure it out on their own,” she said. “Athletics gives us an opportunity to figure it out while we’re in college and while we’re participating.”\nOutside of the GI Bill of 1944, the National Collegiate Athletic Association has provided the largest scholarship program for students to access higher education in the history of the United States.\nTye Odom is one of seven first-generation college student-athletes on the UTSA Baseball team. Hailing from Bishop in South Texas, Odom acknowledges that the opportunity to earn a scholarship through college athletics is central to the opportunity that it provides first-generation students.\n“It allows students and student-athletes to come to school and actually be able to afford it,” Odom said. “I would say that I have no choice of failing, so I have to get my degree and make my parents proud.”\nThe emphasis that Odom’s head coach Pat Hallmark and his staff place on academics was a major reason that Odom chose to attend UTSA.\n“I think it’s important to have coaches that push you to actually go to class; to get up and have conversations with your professors and your fellow students, as well,” said Odom, a kinesiology major. “Just having the degree makes you more successful in the real world.”\nBefore she considered pursuing a career in athletics administration, Campos attended Colorado State sporting events as a student, highlighted by watching future San Antonio sports legend Becky Hammon star for the Rams women’s basketball program. She believes collegiate athletics can be just as impactful for those first-generation college students who don’t play sports.\n“I was part of the college life and that’s what helped me get through my four years as a first-gen student,” Campos said. “Just getting engaged, I felt a part of the college campus because I went to football games and I went to basketball games. Athletics has a way of not just helping current student-athletes, but helping all first-gen students on the college campus.”\nHer positive experiences as a college student are what motivated Campos to pursue a lifelong career in higher education.\n“One thing about first-generation students, we don’t even know all the different careers out there,” she said. “I had no idea it was a possibility to work in higher ed until I started getting the support at Colorado State. I realized that I could work at a college campus the rest of my life.”\nCampos’ own experiences coupled with UTSA’s commitment to serving first-generation college students have created a highly supportive environment for its student-athletes and the more than 100 student workers within the department, many of whom also are first generation. It has created a benchmark for other collegiate athletics departments.\n“Being able to give back, being able to walk in the shoes of first-generation college students, knowing what their experience is and being able to support them is a big reason why I chose to work in higher ed,” Campos said. “I know first-hand the experiences that they’re having, whether it’s being homesick, having parents or family members who don’t really understand what college is about or stepping on a college campus for the first time not even knowing what that process looks like. I think that’s the most unique trait that I have that supports our students.”",
  "word_count": 1424,
  "scraped_at": "2026-02-14T13:20:24.403996"
}