{
  "article_id": "52bd88e2ba8d",
  "url": "https://www.southcoastregister.com.au/story/8258617/im-not-going-to-cop-abuse-anymore-ref-quits-in-disgust-after-20-years/",
  "title": "Ref verbally abused quits after abandoned ill - tempered Illawarra rugby match | South Coast Register",
  "date": "20230705T024500Z",
  "domain": "southcoastregister.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A Illawarra rugby referee with more than 20 years experience has quit, citing \"unacceptable and disgusting player abuse\".\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Kiama player referee Paul Chambiras says verbally abused him during the second-grade fixture between Kiama and Shamrocks at Ocean Park last Saturday, is being investigated by the Illawarra District Rugby Union board.\nThe IDRU's citations officer is also investigating two other Kiama players for 'dissent and unacceptable actions', which led to the referee calling the game off 15 minutes early.\nChambiras told the Mercury he was left with little choice but to call the game off because he feared for his and Shamrocks' players safety.\nThe experienced whistleblower was 'shooked up and inconsolable\" after the game and has since notified the IDRU and Rugby Australia he was quitting refereeing for good.\n\"This abuse has been going on for ages, and it needs to stop. I'm ...pissed off,\" Chambiras said.\n\"I've been refereeing for 20 years. I got my ticket in 2004, the last three years I've been refereeing on and off here in the Illawarra.\n\"I've been to Penrith here in Sydney, out to Matraville and Rockdale and all the way up to the northern beaches, I thought I'd seen it all, until Saturday.\n\"It was an absolute farce. I'm not going to cop that type of abuse anymore. One player told me to f... off twice.\"\nI'm not going to cop that type of abuse anymore. One player told me to f... off twice.\n- Paul Chambiras\nChambiras wrote an incident report for the IDRU, which the Mercury has viewed.\nIn the report the referee outlines the sequence of events which saw a player red-carded, two others issued yellow cards and the game called off early in the second half.\nThe drama unfolded after a Kiama player was penalised on three separate occasions for dangerous tackles.\nOn the third incident, which happened about 30 minutes into the first half, the player was issued a yellow card.\nChambiras states at this juncture the player in question displays his anger to the referee and as he walks off says Chambiras is a 'f...ing joke of a referee'.\nHe goes on to say the drama escalated when the player returned to the field early in the second half.\n\"I spoke to him, remarking if he received another yellow card, then it would be an automatic red card. He appeared to take offence to what I had said, and he seemed aggressive and agitated as he walked away to line up for the Kiama restart following the Shamrocks try,\" the incident report stated.\n\"Before the restart, the player was yelling to his team-mates stating: 'come on boys, let's put a few big shots on these pricks!'.\n\"As the game had become ill-tempered, these remarks would only result in someone getting seriously hurt.\n\"Then right after the restart, as he was running nearby to me as we moved downfield chasing the restart, he said 'and you are a f...... shit ref'.\n\"I immediately stopped the game, asked the Kiama captain and the player to come over to me, and then I awarded him another yellow card for the verbal abuse/dissent, and then an automatic red card.\"\nThe report goes on to mention the referee was subjected to more abuse by players and supporters as he and players walked off the field.\nOne of the Kiama players received a yellow card for dissent.\nChambiras wrote in his report and admitted to the Mercury that he also swore at a player he thought had verbally abused him.\n\"I thought No. 8 Scott Duncan had sworn at me, and I fully admit that I aggressively walked over to him, yelling at him to 'f...... stop this verbal shit towards me!'\n\"I'm not proud that I swore at him. For this, I apologised to him when everyone had cooled down some 10 minutes later.\n\"I should not have reacted like this. I have to admit that I was pissed off with the abuse by this point, but I was wrong to react how I did.\n\"I take full responsibility for my actions here.\"\nKiama Rugby Union Club hit out at certain individuals within the club for their actions at Ocean Park.\nThe club issued a statement which read:\n\"Kiama Rugby Union Club of over 60 years of participation of the IDRU competition does not condone the behaviour of certain individuals who participated in the 2nd grade game versus Shamrocks last Saturday.\n\"The committee of Kiama Rugby Football Club will follow procedures put in place by Rugby Australia to facilitate an outcome that is favourable to all involved.\"\nIllawarra Referees president Adam Lysle said Chambiras had the full support of his fellow referees.\n\"We've lost another good referee. How many more people are we going to lose. Our competition deserves better than this,\" he said.\n\"Referees make mistakes, referees make bad decisions. It doesn't matter what happens on the field, there is never, ever, ever any excuse for abuse.\n\"And the abuse our referee suffered on Saturday was beyond acceptable.\n\"I, as the president, will not stand by and let my referees continue to be abused without taking strong and swift action.\nWe've lost another good referee. How many more people are we going to lose. Our competition deserves better than this.\n- llawarra Referees president Adam Lysle\n\"We have worked so hard to change the mindsets of the clubs, to educate players and to work together with the Illawarra board so closely, and so well, and we have come so far.\n\"It's incidents like these that used to happen nearly weekly, and we've worked so hard to improve it, we are not going to let this incident go by the wayside without some action.\n\"We look forward to working together with the board and the club involved to bring about change for the betterment of rugby.\"\nIDRU president Tom Ellicott said the board had video footage of the game and was investigating the complaints.\n\"Paul lodged his red card report and also Respect Rugby complaints against three Kiama players which will now be dealt with as part of our internal procedures,\" he said.\n\"The complaints will be investigated by our citations officer who will then determine whether or not the matter should then proceed to the judiciary and then those matters will be dealt with by the judiciary in accordance with their rules and procedures.\n\"I can tell you that we abhor abuse of referees and any match officials and, or abuse of club officials for that matter.\n\"We're treating this matter extremely seriously and we've held our concern for Paul and we hope that he's okay. We know that, Adam and the referees are doing a lot to support him at this time.\n\"We can assure Paul and the referees that this matter will be thoroughly investigated, and where necessary serious sanctions will be taken against any person who has been found to have abused a match official.\n\"There are other matters being investigated by the board separately and there'll be a notice issued to the Kiama club to give an explanation concerning certain matters........ at this time I can't say much further because those matters are ongoing.\n\"But the district as a whole is frankly disgusted with the abandonment of the match and in the circumstances that has occurred. We will be ensuring that this doesn't occur again.\"",
  "word_count": 1241,
  "scraped_at": "2026-02-14T13:01:19.592334"
}