{
  "article_id": "52d0788c40c5",
  "url": "https://www.fortmorgantimes.com/2023/06/16/northern-colorado-athletics-david-hoage-preseason-all-america-wrestling-world-team-trials/",
  "title": "Northern Colorado swimming represented on world stage ; wrestling competes nationally",
  "date": "20230617T021500Z",
  "domain": "fortmorgantimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Football\nUniversity of Northern Colorado linebacker David Hoage is once again racking up more preseason nods ahead of his senior season. He received a spot on the Bluebloods 2023 FCS Preseason All-America Third Team.\nHe missed last fall due to a knee injury that occurred right before the season started.\nHowever, Hoage dominated in 2021. He earned multiple All-America honors, including third team All-America from the Associated Press and Stats Perform First Team Sophomore All-America.\nHe also set the UNC record for sacks in a single season (10.5), while finishing with 70 total tackles.\nHoage was recently named by HERO Sports as one of the top returning linebackers in the FCS.\nUNC opens its season at Abilene Christian on Aug. 31, before hosting the home opener against Incarnate Word on Sept. 9.\nWrestling\nNine UNC wrestlers competed at the USA Wrestling U23 Nationals Championship and the U20 World Team Trials.\nIn the U20 Greco World Team Trials, two Bears competed against each other in the 77-kilogram weight class. Derek Matthews beat Aydin Rix-McElhinney to advance to the U20 World Championships in Poland this August.\nAt the U23 Freestyle Team Trials, Stevo Poulin earned second in the 57-kg weight class, while Dominick Serrano (61) and Rudy Lopez (70) placed sixth in their respective weight classes.\nBenji Alanis (65), Vincent Zerban (74) and Rix-McElhinney (79) competed in the freestyle trials, as well.\nAt the U23 Greco World Team Trials, Dyson Kunz finished fifth in the 60-kg class.\n“Our guys continue to shine in the international styles of wrestling. I think this is a testament to the type of athletes we are bringing to Greeley,” UNC head wrestling coach Troy Nickerson said in a statement. “Not only are these kids trying to become All-Americans and national champions, but they are also trying to become world champions, as well. No matter what the style, wrestling is wrestling, and it all will translate once we hit the college season again in November.”\nGolf\nComing off of its NCAA Regional appearance, UNC coach Clayton Sikorski announced the hiring of Marty McCauley as assistant coach for the men’s and women’s programs.\n“We are very excited to add Coach Marty to our staff. I have known Marty for my entire coaching career, and he is not only an outstanding coach but also an outstanding human,” Sikorski said in a statement. “He will provide a great experience and a wealth of knowledge to our student-athletes. This hire will help us elevate both programs for years to come.”\nMcCauley comes to UNC after spending 13 years at Oklahoma City University, an NAIA program in the Sooner Athletic Conference. He coached 42 NAIA All-Americans, earned 41 team tournament championships, led the team to three national championships and nine conference titles.\n“I am very excited about joining the UNC staff and getting to work immediately to prepare for the upcoming season,” McCauley said. “I’m thankful to coach Sikorski and Athletic Director Darren Dunn for this opportunity and cannot wait to get to Greeley and be part of the Bear family.”\nMcCauley previously worked at Texas Tech, where he worked with five NCAA All-Americans and assisted with 10 tournament championships. He also helped the Red Raiders qualify for four NCAA Tournament bids. In 2010, the team earned a spot in the NCAA Tournament Elite Eight.\nMen’s golf\nIn addition to the coaching staff change, the Bears signed Peter Grossenbacher to the 2023-24 season roster.\nOriginally from Eaton, Grossenbacher spent four years at Colorado Mesa on the Division II level.\nHe was an All-RMAC selection three straight years, including first team honors in 2021 and 2023.\n“I’m very happy to round out this class with Peter,” Sikorski said. “It’s pretty cool he can finish up his college career so close to home. He has plenty of experience playing at a very strong D2 program, which should help us next year. Peter is a strong student, fits in with the culture and buys into the vision we have going forward.”\nGrossenbacher will join Antti Vahvaselka and Pietro Boeris in the upcoming season.\nSwim and dive\nFreshman Maria Erokhina participated in the 2023 Games of the Small States of Europe at the end of May. The event was hosted in Malta.\nErokhina, from Cyprus, won four medals for her home country, including two golds. She won the 200-meter breaststroke and helped the team win its 4×100-meter medley relay.\nThe rookie added silver medals in the 100 breast and 50 breast.\nShe qualified for the World University Games after her strong performances. It will take place July 28 through Aug. 8 in Chengdu, China.\nErokhina finished with a breakout season for the Bears in 2023. She placed second in the 200 breast at the Western Athletic Conference Championships in February. Her time of 2:13.47 set a new school record in the event.",
  "word_count": 805,
  "scraped_at": "2026-02-14T13:46:57.838353"
}