{
  "article_id": "52d1365bc004",
  "url": "https://wtop.com/dc-united/2024/07/concerns-over-audi-fields-pitch-force-organizers-to-move-dc-uniteds-leagues-cup-match-to-pennsylvania/",
  "title": "Concerns over Audi Field pitch force organizers to move DC United Leagues Cup match to Pennsylvania",
  "date": "20240729T203000Z",
  "domain": "wtop.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "D.C. United will play its second Leagues Cup match Wednesday in Chester, Pennsylvania, after tournament organizers said it had “concerns with the condition of the playing surface” at Audi Field.\nIn a statement, tournament organizers said the venue change will “ensure the best possible conditions for the competition.” The match between D.C. United and Liga MX side Santos Laguna has been rescheduled to July at 8 p.m. at Subaru Park, the home of MLS team Philadelphia Union.\nUnited has been issued an undisclosed fine for the last-minute relocation. The MLS club said in a statement that it will move up the date to install a new grass field at the Southwest D.C. stadium on Wednesday.\n“D.C. United apologizes to the fans who purchased tickets to witness the game in Washington, DC,” the statement read. “While this is the first time this has happened at the stadium, D.C. United has put greater parameters in place to protect this from happening in the future.”\nThe field’s conditions have come into question for weeks as more events added additional wear and tear. Recently, the stadium hosted a rugby match, the Olympic send-off game for the U.S. women’s national soccer team and a D.C. United friendly against Scottish champions Celtic FC. This past weekend, it hosted the two-day Broccoli City Festival.\nFor context, this is how choppy the field at Audi looked like before the @USWNT‘s send-off match last week. Very patch after months of events.\nAny corner kick in the southeast side would splash up with white paint in the air, clearly masking the lack of grass there. #DCU https://t.co/V4oEs8U2nW pic.twitter.com/DUg3WJXJOU\n— José Mauricio Umaña (@Jose_M_Umana) July 26, 2024\nDuring the U.S.’ send-off match, head coach Emma Hayes told reporters that midfielder Rose Lavelle was pulled due to injury concerns but the field’s condition played a factor in the team’s decision. U.S. midfielder Sam Coffey said players noticed the field’s conditions preparing for the send-off match, calling it “a little bumpy” to play on.\nLast season, Audi Field changed its playing surface following the end of the D.C. Defenders’ football season. According to a report by The Washington Post, team officials elected to change the field at the end of the United Football League season on June 2 to be available for the Argentine national team to use for training ahead of its June 14 friendly against Guatemala at FedEx Field. However, those plans fell through.\nThose who purchased tickets to attend the match in D.C. will be contacted directly about next steps via email. A team spokesperson confirmed to WTOP that the club plans to provide transportation to fans who want to make the trip to see the game in Pennsylvania.\nUnited has four regular-season home matches remaining on its schedule. The stadium is also the home venue of the NWSL’s Washington Spirit and the new women’s soccer team DC Power FC.\nGet breaking news and daily headlines delivered to your email inbox by signing up here.\n© 2024 WTOP. All Rights Reserved. This website is not intended for users located within the European Economic Area.",
  "word_count": 514,
  "scraped_at": "2026-02-14T12:09:30.348516"
}