{
  "article_id": "52d2e8e6a7d0",
  "url": "https://www.fromtherumbleseat.com/2023/12/21/24010513/mailbag-12-21",
  "title": "Mailbag 12 / 21",
  "date": "20231222T000000Z",
  "domain": "fromtherumbleseat.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The mailbag is brought to you by Section 103, home of the most unique and comfortable Georgia Tech apparel. Get 10 percent off your next order with coupon code FTRS to order items such as the Feliz Bobby Dodd sweatshirt in time for the bowl game.\nMailbag 12/21\nParis 2024. What events are on your must see TV list?\nDressHerInWhiteAndGold: A week early, but 2024 Resolutions?\nBen: Well, my wife and I just became foster parents, so my 2024 resolution is figure out how to parent.\nJack: Currently working on finding a full time job, so finding one and sticking with it is my gameplan for now (dm me if you have anything in Atlanta!)\nChris: Work on more personal projects, read more.\nJake: Work out more for sure, maybe eat a little better. The portion control was good in 2023, but the selection could be better.\nBillBrockman: How impressive is it that the school in Athens football team beat out Texas A & M - Commerce to avoid last place in graduation rate? 259th out of 260.\nJake: I sincerely hope anyone who gets the opportunity to have a college education provided to them makes the most of it, and I honestly hate to hear about their struggles to graduate folks. And plus, they are also in the same university system, when it comes to the playing school, if you will.\ntyler_pifer92: I can’t help but get Moses Wright vibes from watching Baye Ndongo. He’s more talented as a freshman than Wright was as a sophomore.\nOut of all the young guys we’ve seen on the court so far, who do you think has the biggest upside?\nJack: It’s Baye. Damon made a comment after one of the games recently that Ndongo looks like the guys playing in the NBA now. He’s easily got the highest floor I’ve seen of our current roster. I almost don’t want him to develop too fast so that he gets drafted (I don’t think that’s a realistic expecatation for now, to be clear), but seeing him grow is going to be one of the joys of this Georgia Tech season.\nJake: Agreed with Jack that it is Baye. Honestly, I agree about the Okogie-ification and leaving early fears, too, as well as him being better than Wright was as a sophomore already. That’s a good problem to have.\nDressHerInWhiteAndGold: Paris 2024. What events are on your must see TV list?\nBen: I will say that I generally don’t watch the Olympics much, but a couple of the sports that I like to catch (if they’re on) are wrestling and swimming/diving. I can also get on board with equestrian. I have participated or covered one of those sports at some point before I decided I didn’t want to be a Big J journalist.\nJack: Literally all of it. I’m actualy going for a week so I’ll get a shot to see rugby, soccer, and basketball in person! I was a swimmer growing up too, so I watch even the prelim heats no matter what time they’re at. Women’s swimming is going to be elite in Paris. The Australians have been training specifically to beat the US, and ACC titans Virginia make up the majority of our women’s relays. I can’t wait.\nIn terms of “only at the Olympics” events to watch, I do enjoy weightlifting as well. It’s a spot where a smaller country has a real shot at winning, so it magnifies the diversity of the Games better than the other sports.\nChris: I’ll watch literally any Olympic sport to be honest. I’ll follow tennis more closely than the others, but they’re all good to watch as far as I’m concerned.\nJake: Swimming, for sure, though I am of the opinion that the US Olympic Trials are on the whole a better watch than the actual Olympics. As for the rest of it, it is one of the only times water polo is actually televised and at a high level, so that will probably be my number two. Between those, it really is mostly just a rare opportunity to see others doing the sports I did in college/high school/growing up.\njabsterjacket: Is Tech football a net winner or net loser with the transfer portal so far this season?\nBen: Tech is an easy net winner, and I don’t even need to look that hard at who is coming in. They have not lost anyone of consequence to the portal. The “biggest” loss is Kennard who, outside of one game, had two sacks this season.\nChris: Agree with Ben, I think a net winner.\nJake: Winner, and I don’t think it is all that close.\nDressHerInWhiteAndGold: What say you ARCH/ID’s, 2024 Pantone color of the year?\n“PANTONE 13-1023 Peach Fuzz captures our desire to nurture ourselves and others. It’s a velvety gentle peach tone whose all-embracing spirit enriches mind, body, and soul.”\nBen: It looks like the old peach crayon. That’s the only thing I have to say about it.\nChris: it’s peach.\ngtbadcarma: The 12 team playoff begins next year. “The new 12-team College Football Playoff field will include the six highest-ranked conference champions, which will receive automatic bids. The top four teams will receive a first-round bye to the quarterfinals.” The 12 team projection, for a playoff this year, will all be Big 10 and $ec teams next year save fsu and Liberty. Do you actually believe they will allow more g5 teams such as an MAC, Cusa etc to have a shot going forward to or do you believe the mission statement will change given the collapse of the PAC-12 and the BIG 12 losing two of its biggest programs?\nBen: I think it will allow more teams to compete, but I think there is zero guarantee that it will be G5 teams, and I think it’s incredibly unlikely that it will be more than one G5 team most years.\nChris: I think they’ll allow one token G5 team per year but no more.\nJake: I hate to say it, but I am worried that it will be rare that second ACC and Big 12 teams get in the mix, let alone getting multiple G5 teams in.\nTkTheGoat: Probably a childish question, but would you rather receive two or three big ticket christmas presents or a bunch of small gifts?\nBen: For me, I don’t care so much about the price tag as much as I care about the thought that goes into it.\nJack: I’m with Ben, the thought and the actual utility of the gift I think stand out for me. One of my favorite gifts is the 20th Anniversary box set of U2’s All That You Can’t Leave Behind, and even though I don’t get to play those records all the time, it gets a prime position on my vinyl shelf and it gets to stand in prominence reminding me of the music I grew up listening to and continue to love.\nChris: Probably small stuff, I think part of the joy of opening gifts is getting multiple diverse things that all have some sort of meaning - one or two big ticket things means you’re done after 5 minutes.\nJake: A stack of books would last me the whole year, so I guess a few of those rather than one big thing would be my preferred way to go.\nTkTheGoat: What is our total win ceiling and floor for 2024 fball season?\nBen: I am hesitant to say that this team could win the ACC next season, but I think Tech, at its ceiling, will at least be in the competition to play in the championship game. At worst, there’s a regression and Tech is a fringe bowl team.\nJack: I’ll get back to you after the spring is over.\nChris: Its early, but the floor is probably 4-5 wins and the ceiling is probably 8.\nJake: I think the range is 5-9 wins. I think we have a lot of what it takes, but I am hesitant to say much until the rest of the defensive staff is solidified and such.",
  "word_count": 1355,
  "scraped_at": "2026-02-14T13:10:11.221975"
}