{
  "article_id": "53025beb6569",
  "url": "https://www.aol.co.uk/articles/sarina-wiegman-awarded-honorary-damehood-223000217.html",
  "title": "Sarina Wiegman awarded an honorary damehood in New Year Honours",
  "date": "20251229T234500Z",
  "domain": "aol.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sarina Wiegman awarded an honorary damehood in New Year Honours\nSarina Wiegman has been awarded an honorary damehood in the New Year Honours in recognition of her astonishing success with the England women’s football team.\nThe Dutch coach led the Lionesses to a second straight Euros title in the summer, having also steered the team to the World Cup final in 2023.\nWiegman, who began her role in September 2021, said: “I would like to express my sincere gratitude for this honour.\n“When I first arrived in England, I could never have imagined the respect and warmth I’ve experienced from the English people. I deeply thank the fans for their support.”\nWiegman’s honour follows another glorious summer for the Lionesses in 2025.\nThey rode their luck on their run to the Euro final in Switzerland before beating world champions Spain in a penalty shoot-out, following on from winning the competition on home soil in 2022.\nAlso honoured are team captain Leah Williamson, who becomes a Commander of the Order of the British Empire (CBE). Four other double European champions – Alex Greenwood, Georgia Stanway, Ella Toone and Keira Walsh – have each been made a Member of the Order of the British Empire (MBEs).\nWiegman added: “This title is a reflection of my exceptional team of players and staff. My congratulations go to Alex, Ella, Georgia, Keira, Leah and also Dr Ritan Mehta who have all been celebrated for their brilliant contributions.\n“Our team values mean that when there is recognition for one, then there is recognition for all. I want to pay tribute to every member of our Euro squad.\nYou certainly have made the country proud, Sarina ❤️ pic.twitter.com/8suTx8JXjp\n— Lionesses (@Lionesses) December 29, 2025\n“They should all be celebrated for everything they brought to the pitch and for the positive role they play in society. I’m proud to work alongside such a dedicated group of people.\n“It’s been a special year and as we look ahead to our next objective, qualifying for the 2027 World Cup, we hope we can continue to make the country proud.”\nWiegman took on the England role after leading the Netherlands to Euro glory in 2017, and to the World Cup final two years later. Earlier this month she won women’s coach of the year at The Best FIFA Football Awards.\nToone said in a statement issued to the Press Association: “To be awarded an MBE is an incredible honour and something I’m deeply proud of.\n“Representing England and being part of a team that has won the Euros twice has helped change the landscape of women’s football, these memories will stay with me forever.\n“Those achievements mean everything to me. This recognition is also incredibly personal because I want to dedicate it to my dad, who I lost to prostate cancer last year.\n“He was my biggest supporter, from the very first kick of a ball, and I know he’d be so proud. Continuing to raise my profile, I want to help raise awareness of prostate cancer and the importance of early detection, and to give back by helping inspire the next generation through the ET7 Academy.\n“If sharing my story can encourage people to have conversations, get checked, or support young players coming through, then that would mean just as much to me as anything I’ve achieved on the pitch.”\nStanway said in a statement to PA: “Receiving an MBE is a real ‘pinch me’ moment, after all, I am just a girl from Barrow.\n“Football was all I ever wanted to do and so many people have made sacrifices along the way to help me get to this point on and off this pitch. This honour, this recognition, is for all of them too. For my family, particularly my parents, coaches, mentors, team-mates and everyone who has seen something in me.\n“For as long as I play, and as long as I can make an impact after playing, I’ll continue to use my voice (and my feet!) to try to show girls and boys that anything is possible and that through sport you can make a positive difference.\n“I love my country and I’ll fly the flag wherever life takes me, to be awarded an MBE is such a huge honour so thank you and dream big!”\nWiegman also paid tribute to Kerry Davis, who became England’s first black woman international in 1982, and has been made a Member of the Order of the British Empire (MBE).\n“I’d also like to congratulate Kerry Davis,” said Wiegman. “She is a Lionesses’ legend and the women’s game would not be where it is today without her, and the contribution of so many former players. We have a lot to thank her for.”\nDr Mehta, England women’s head of medical and team doctor, becomes a Member of the Order of the British Empire (MBE), for services to football.\nFootball Association chair Debbie Hewitt said of the honoured Lionesses players: “Each of them has embraced the responsibility of being a role model for a generation of girls with sincerity and purpose. They have not only lifted trophies but helped lift the sport and society itself. Their recognition is thoroughly deserved.”\nOn Wiegman’s honorary damehood, Hewitt added: “We feel incredibly privileged to have not only the world’s leading head coach, but also an exceptional leader – someone who leads with integrity, humility, and a deep belief in human connection.\n“This award recognises her remarkable achievements on the pitch and the profound impact she continues to make away from it. It is further testament to how she has captured the hearts of the English public.”",
  "word_count": 940,
  "scraped_at": "2026-02-14T13:07:13.338655"
}