{
  "article_id": "5316c5e72f1c",
  "url": "https://theathletic.com/4089162/2023/01/14/why-el-clasico-in-saudi-arabia-and-how-to-watch/",
  "title": "El Clasico this weekend : All you need to know including why it in Saudi Arabia",
  "date": "20230114T090000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Real Madrid vs Barcelona this Sunday. The final of the Spanish Super Cup. El Clasico.\nYet the match will not be played at the Santiago Bernabeu or Camp Nou.\nInstead, it will be at the King Fahd Stadium in Riyadh, Saudi Arabia.\nSaudi Arabia’s hosting of the second Clasico of the season — Real won the first 3-1 — is predictably controversial, with supporters, journalists and human rights organisations criticising the choice of venue.\nAdvertisement\nThe match will no doubt be enthralling, with Xavi seeking his first silverware after returning to Barcelona, while Real are hunting their second of six trophies this season. But the location does beg the question: how and why?\nHang on — Saudi Arabia?!\nYup. Before the 2019-20 season, Spain’s football governing body, the RFEF, overhauled the Supercopa de Espana, which had been running since 1982 with a simple two-team format.\nIt decided to double the number of teams, inviting the runners-up of the Copa del Rey and La Liga to participate as well as the winners.\nOh, and it decided to move the entire tournament from Spain to Saudi Arabia. This was good news for everybody’s coffers, but not as good a deal for Spanish football fans.\nWhat are the financials?\nThe move makes plenty of sense for the RFEF. News outlets in Spain reported that Saudi Arabia has agreed to pay an annual fee in excess of €30million (£26.6m, $36.5million) per year until 2029.\nPrize money has also increased for the four teams involved, with the winners guaranteed payment in the region of €2million, with the runners-up receiving around half of that.\nBut what do Spanish supporters make of it all?\nA lot are unhappy that the prestige fixtures have been moved away from Spain to another continent.\nLast season, Athletic Bilbao’s midfielder Raul Garcia spoke out against the move, claiming that “football now is all about making money and finding sponsors”. He described the fixtures as “a complete nonsense”.\nAnd then there are the human rights issues.\nWho else has criticised it?\nAmnesty International last year called on the clubs involved in the tournament to take a stand over women’s rights and equality issues but said it failed to receive any responses.\n“The fact (is) that the Spanish soccer federation has decided to collaborate in this ‘whitewashing’ of the image of Saudi authorities,” said Esteban Beltran, director of Amnesty International in Spain.\nAdvertisement\nSpanish public broadcaster RTVE said it would not bid for the tournament’s media rights while the event is held in Saudi Arabia, citing concerns over human rights violations.\nBut Luis Rubiales, the president of the RFEF, who had an influential role in deciding to move the tournament to Saudi Arabia, has insisted Spanish football is improving the situation in Saudi Arabia.\n“We were the first ones to sign a contract that made it obligatory, if they wanted us to bring the Super Cup here, to let women into the stadiums, and they are there, and we have helped build a women’s soccer league in Saudi Arabia,” he told Cadena SER radio in 2022.\nAre there any other controversies?\nYou bet. Last year, Gerard Pique was forced to deny any wrongdoing after hackers stole a series of audio recordings from the RFEF that appeared to reveal the former Barcelona defender had helped to negotiate a €24million commission for taking the tournament to Saudi Arabia.\nEl Confidencial newspaper, which released the audio footage, claimed that Pique’s Kosmos Management received €4million for its part in negotiating the arrangement.\n“I have nothing to hide, everything we have done is legal,” Pique said in response.\nSo, to the football — will Ronaldo be there?\nThere is every chance Cristiano Ronaldo could be in attendance on Sunday given the fact it’s taking place in Saudi Arabia. The Portuguese forward attended Real Madrid’s training session on Friday and Ronaldo was seen laughing and joking with manager Carlo Ancelotti and former Madrid player Roberto Carlos.\nReal Madrid were training at Al Nassr’s training facility, which meant a brief reunion between Ronaldo and his former employers was always likely to happen. The King Fahd Stadium, which will host Sunday’s spectacle, is just a 30-minute drive away from Al Nassr’s home stadium, Mrsool Park.\nAdvertisement\nDon’t be surprised to see Ronaldo cheering on his former side against their arch-rivals from an executive box. Ronaldo, who won four Champions Leagues at Real Madrid, still has a good relationship with the club, having used their facilities to maintain his fitness after the World Cup and before signing his contract with Al Nassr.\nWhere can I watch it? And when is it?\nThe game gets underway at 10pm local time. That’s 8pm in Spain, with the game being shown live on Gol Mundial and Movistar Plus+.\nIn the United Kingdom, the game will be shown live on BT Sport 1 and will kick off at 7pm. ESPN have the rights in the United States, with the game starting at 2pm ET and 11am PT.\nWhat’s the team news?\nBarcelona have a clean bill of health but the same cannot be said for Real Madrid.\nEder Militao had to be replaced during the semi-final win over Valencia as the defender felt dizzy after being hit in the face by a ball.\nLucas Vazquez has been ruled out for a month and a half due to an ankle sprain, while Eduardo Camavinga is hoping to shake off a knock to his knee. Ancelotti will be unable to call on Aurelien Tchouameni and David Alaba as the duo did not travel to Saudi Arabia due to injury.\nHow did the two teams make it to the final?\nBoth sides progressed by winning their respective semi-finals on penalties. Real Madrid played out a 1-1 draw with Valencia in normal time, with Karim Benzema’s opener from the penalty spot being cancelled out by Lino’s equaliser just a minute after the half-time interval. Neither side could find a winner in extra time before Real Madrid won 4-3 on penalties. Benzema, Luka Modric, Toni Kroos and Marco Asensio all converted their spot kicks; Eray Comert and Jose Gaya both missed for Valencia.\nBarcelona’s semi-final against Real Betis also finished 1-1, with Robert Lewandowski and Nabil Fekir scoring in the 90 minutes. There were then two more goals in extra time thanks to strikes by Ansu Fati and Loren Moron before the tie had to be settled on penalties. Barcelona then won 4-2 in the shootout.\nAdvertisement\nHow many times have Real and Barca won the Spanish Super Cup?\nReal Madrid have the chance to level things when it comes to winning the Spanish Super Cup: they have won it 12 times, with Barcelona having lifted the trophy 13 times.\nHere’s the full list of their wins:\nBarcelona (13): 1983, 1991, 1992, 1994, 1996, 2005, 2006, 2009, 2010, 2011, 2013, 2016, 2018\nReal Madrid (12): 1988, 1989, 1990, 1993, 1997, 2001, 2003, 2008, 2012, 2017, 2020, 2022\nThis isn’t enough. I NEED MORE.\nYou’re in luck. On Monday, we announced an expansion of our Spanish football coverage, with four new writers and a team of editors joining Dermot Corrigan (whose piece on Real and Barca’s new-found love this week is a must-read). So we have plenty of outstanding coverage for you to get stuck into.\nFor a full preview of El Clasico from all of our writers, click here. Or if you’re interested in what it might be like to manage Real Madrid, click here. But maybe you’re of a Barcelona persuasion, in which case you’d be better off clicking here.\nOr, better yet, simply click here to see all of our Spanish football coverage.\n(Top photo: David Ramos via Getty Images)",
  "word_count": 1281,
  "scraped_at": "2026-02-14T13:34:56.075442"
}