{
  "article_id": "5318c80b0a4e",
  "url": "https://www.90min.com/posts/is-there-winter-break-2023-24-premier-league",
  "title": "Is there a winter break in the 2023 / 24 Premier League ? ",
  "date": "20230613T154500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Is there a winter break in the 2023/24 Premier League?\n- 2022 World Cup disrupted the Premier League's usual festive schedule\n- Busy Christmas period returns in 2023/24\n- Premier League clubs will enjoy winter break in January\nBefore he left his post at UEFA in disgrace, Michel Platini once sniffed that English players were \"lions in the winter and lambs in the summer\".\nThe lack of a winter break has long been held up as an explanation for the national team's half-century trophy drought in men's football - the Lionesses won Euro 2022 after a two-week hiatus over Christmas which is standard practice in the Women's Super League.\nIn 2013, a UEFA study suggested that a Premier League player is four times more likely to be injured in the final three months of the season compared to their counterparts in other European top flights.\nEngland's FA finally compromised at the turn of the decade but the outbreak of COVID-19 and the Qatar World Cup curtailed the experiment. Here's everything you need to know about the winter break's return in the 2023/24 Premier League season.\nFINAL PREMIER LEAGUE TABLE, TOP SCORERS & EUROPEAN QUALIFICATION\nHas the Premier League ever had a winter break?\nTechnically, no. The powers that be in the Football Association sanctioned a \"midseason player break\" for the first time between 8 February and 22 February 2020.\nAcross the two-week period, there were only ten Premier League fixtures (rather than 20) as each side was given at least 13 days between consecutive top-flight outings.\nLiverpool had a FA Cup fourth-round replay against Shrewsbury scheduled during the break which Jurgen Klopp and the first team boycotted. Under-23 coach Neil Critchley led the youngest starting XI in the club's history to a 1-0 win at Anfield.\nLess than a month after the partial hiatus, the outbreak of COVID-19 forced the suspension of football and sport across the globe. To make up for lost time, the compressed 2020/21 Premier League season did not include a winter break.\nHowever, it was dusted off for the 2021/22 campaign. Aside from a rearranged goalless draw between Burnley and Watford, there were no league matches between 23 January and 7 February 2022. Although, international players from the South American, North and Central American, Asian and Oceanic confederations were called up during this window.\nThe World Cup in Qatar between November and December 2022 provided a natural break in the 2022/23 Premier League season even if 133 players from the division competed in the international jamboree.\nIs there a winter break in the 2023/24 Premier League?\nUnless the globe is swept along in another storyline from a dystopian thriller, the 2023/24 Premier League season is scheduled to have a winter hiatus - which the competition insists on exclusively calling a \"mid-season player break\".\nAlongside the return of the mini-retirement period, England's top flight has committed to ensuring that rounds of matches during the packed festive period will be separated by at least 48 hours.\nThe first draft of the 32nd Premier League season will be made up of matches on 34 weekends, three midweeks and one Bank Holiday special.\nWhen is the 2023/24 Premier League winter break?\nWhile there will be a winter break of some sort between 13 and 22 January, the Premier League are doing things differently to other European leagues.\nInstead of a complete shutdown, Gameweek 21 will be played over two weekends as opposed to one. There are five games on one weekend (13-15 January) and five on the other (20-22 January). Thus, every team will earn at least one weekend off in between the FA Cup third and fourth rounds.",
  "word_count": 609,
  "scraped_at": "2026-02-14T13:08:27.624467"
}