{
  "article_id": "53295cda7770",
  "url": "https://www.ealingtimes.co.uk/news/24191196.hayes-tips-blues-star-macario-big-future-wsl/",
  "title": "Hayes tips Blues star Macario for big future in the WSL",
  "date": "20240317T200000Z",
  "domain": "ealingtimes.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea manager Emma Hayes believes that Catarina Macario could be one of the most impactful players in the Barclays Women's Super League.\nThe 24-year-old signed for Chelsea from Lyon back in June 2023 but has been out of the game with an anterior cruciate ligament (ACL) injury for the past 20 months before making her return in the WSL.\nAnd Macario made instant impact in her debut for the Blues during their 4-0 victory against Leicester, scoring just six minutes after coming onto the pitch.\nAdd that to her solo scoring firing Chelsea into the final four of the FA Cup with a testing 1-0 win over Everton and Hayes believes that the youngster is set to stun.\n\"Cat is really charismatic and whenever she's in the dressing room she always has a smile on her face,\" she said, speaking at the Women In Football Be Inspired Conference in partnership with Barclays.\n\"It was kind of like a birthday\" 😂\n— Sky Sports WSL (@SkySportsWSL) March 15, 2024\nCatarina Macario on THAT cake she gave Chelsea after scoring her first goal in her return from injury 🎂 pic.twitter.com/xTNSqsOQGo\n\"We know how much of a difference that makes when people walk into spaces all full of life.\n\"She's had to go through a lot and had a lot of setbacks but I've watched her grow a lot in the short time she's been here.\n\"She's already making an impact in this last push for the team.\n\"My goal for this is to keep Cat Macari on the pitch because she's a special player that the WSL will benefit from seeing a lot of.\n\"She's valuable and hugely influential for the United States as well so I'm excited to coach her at the international level too.\"\nHayes is set to leave Chelsea after 12 years at the end of this season to take up the role of US Women's National Team coach.\nHaving initially started her coaching career in the US, Hayes is understandably excited for the new international challenge but admitted that there are aspects of the club set-up she would definitely miss.\n\"At club level you get to work with the players everyday and develop them as people,\" she said.\n\"I'll miss getting to build relationships in the club set up.\n\"I will also miss Champions League Games and Cup finals here at Wembley.\n\"But I'll find new loves and new interests of course so I don't really think about the things I'll miss quite yet.\"\nHayes was invited to give a keynote speech hosted by Sky Sports anchor Hayley McQueen on her journey within the game at the recent Women In Football Be Inspired Conference in partnership with Barclays.\nThe two-day event at Wembley Stadium was attended by approximately 800, with the ingoing US Women's National Team manager thrilled to see so many inspirational women come together to share their own stories and build relationships.\n\"I love coming to Wembley and seeing a community of people working in the game and looking for not just different ways to connect but also to share ideas is what really matters,\" she said.\n\"Conferences like this is where the magic happens and people get to build relationships across the industry.\n\"It sells out in three hours for good reason and I think we can easily attract double the number in the future.\"",
  "word_count": 560,
  "scraped_at": "2026-02-14T12:47:10.229191"
}