{
  "article_id": "534039e2cddc",
  "url": "https://www.fourfourtwo.com/news/arsenal-beaten-by-liverpool-as-new-wsl-attendance-record-set-at-emirates-stadium",
  "title": "Arsenal beaten by Liverpool as fans set new WSL attendance record at Emirates Stadium",
  "date": "20231001T211500Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal beaten by Liverpool as fans set new WSL attendance record at Emirates Stadium\nThe Gunners suffered a surprise loss at home to the Reds in their season opener on another landmark day for women's football\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nArsenal's women were beaten by a single goal at home to Liverpool as fans set a new attendance record for the Women's Super League at the Emirates Stadium on Sunday.\nThe Gunners were looking to bounce back following their surprise elimination from the Champions League last month, but went down to a Miri Taylor goal on what turned out to be a disappointing debut for England's Alessia Russo.\nRusso, a summer signing from Manchester United, was handed a start by manager Jonas Eidevall but managed just one shot on target and was replaced by Stina Blackstenius after 73 minutes.\nTaylor's goal came early in the second half as the former Arsenal midfielder hit a low shot past Manuela Zinzberger to silence the home fans.\nIt was Liverpool's first win against Arsenal in the WSL since 2016 and represents an excellent start to the new season for the Reds as they look to improve on last term's seventh-place finish.\nFor Arsenal, meanwhile, it was a fresh disappointment following their recent European exit.\nHowever, the best news of the afternoon was the attendance of 54,115, a new competition record as women's football continues to grow in popularity across the country following the success of the Lionesses at last year's European Championship and their run to the Women's World Cup final in August.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n\"A NEW #BarclaysWSL record!\" the competition's Twitter account wrote in a tweet on Sunday. \"An official attendance of 54,115 at the Emirates!\"\nMore women's football stories\nSpain beat England 1-0 in Sydney to win the Women's World Cup for the first time in their history.\nFIFA suspended Luis Rubiales over his unsolicited kiss on Jennifer Hermoso, with Spain threatening to pull out of UEFA. The RFEF chief later resigned in an interview with Piers Morgan.\nAlex Greenwood tells FourFourTwo that England have changed more mentality-wise than ability-wise, with manager Sarina Wiegman imperative to that – and the 53-year-old's success with the Lionesses has seen her linked with the England men's team as a possible successor to Gareth Southgate, with the FA saying she would be under consideration for the role.\nMore recently, Wiegman has been linked with the Spain job as new coach Montse Tome remains under pressure.\nBen Hayward is a European football writer and Tottenham Hotspur fan with over 15 years’ experience, he has covered games all over the world - including three World Cups, several Champions League finals, Euros, Copa America - and has spent much of that time in Spain. Ben speaks English and Spanish, currently dividing his time between Barcelona and London, covering all the big talking points of the weekend on FFT: he’s also written several list features and interviewed Guglielmo Vicario for the magazine.",
  "word_count": 611,
  "scraped_at": "2026-02-14T12:41:00.605118"
}