{
  "article_id": "534f221d1cf7",
  "url": "https://thetab.com/uk/2023/08/23/from-dominos-to-degrees-heres-everything-the-lionesses-did-before-footie-fame-325025",
  "title": "Here is everything the Lionesses did before their football fame",
  "date": "20230823T124500Z",
  "domain": "thetab.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "From Domino’s to degrees: Here’s everything the Lionesses did before footie fame\nThe next England player could be dishing out your chippy tea on Friday\nThe Lionesses dominated at the World Cup, only just losing out as champions on Sunday. For many of the Lionesses, football fame isn’t their only achievement though, whether they’ve achieved degrees before, have worked up to six jobs just to get themselves to and from matches or are studying alongside playing football. It’s clear they work hard on and off the pitch, which really puts a lot of students who don’t make their 9ams to shame.\nWith the prize pool for the women’s World Cup sitting at £259million less than the men’s, many of the Lionesses have degrees to ensure their future after football. So, here’s the lowdown on what the current England team did before making it to the Super League:\nLucy Bronze – Worked at Domino’s\nThe Barcelona player was the first defender to receive the UEFA Women’s Player of the Year for 2018/19 and was The Best FIFA Women’s Player for 2020. Before her achievements on the pitch, Lucy worked in a Domino’s Pizza in Headingley and a bar in Leeds. The Domino’s branch she worked at was renamed “Lucy’s” in her honour prior to the Euro 2022 final, with Lucy having scored against Sweden in the semi-final.\nShe also graduated from Leeds Beckett University with a degree in sports studies in 2013.\nMary Earps — Had six part-time jobs\nNamed the best goalkeeper at the 2023 World Cup, Mary showed her dedication to football as a young woman, working multiple jobs so she could pay for her petrol to and from training. At age 17, Mary worked in a cinema, a toy shop, a stationery shop, worked for her father’s company and had two coaching jobs.\nMost Read\nMary then went on to play for Birmingham, Bristol City and Reading, alongside completing an information management and business studies degree at Loughborough University, coming out with a 2:1.\nLotte Wubben-Moy — University of California\nDefender Lotte studied in America at the University of Carolina, graduating in 2021 with a major in sports and exercise science and a minor in art history.\nWhile unlike many students, she doesn’t seem to have had a typical part-time job, she has completed an internship at Wasserman Media Group, which represent sport and media talent.\nBethany England — Worked at a fish and chip shop\nThe versatile lioness Beth England, playing in midfield and wing-back, also juggled responsibilities at a young age. Alongside studying for her A-Levels, aged 17 she worked in a Barnsley fish and chip shop. She also had jobs in a bakery, a factory, an Indian restaurant and at M&S. Her experience in the chippy has made her “a little bit of a fish and chips snob”, she told The Mirror.\nBethany is a law grad from BPP University, but has missed her graduation ceremony in both 2022 and 2023 due to football tournaments.\nAlessia Russo — Has a degree and an honorary doctorate\nFrom being the only girl on her under-eights team to playing at the World Cup, Alessia has definitely made her mark. She’s another Lioness who studied at the University of Carolina, but she also received an honorary doctorate from Canterbury Christ Church University this year.\nMillie Bright — Jobs at a leisure centre and stables\nOne of the figureheads of the 2022 Euros, Millie Bright also held down multiple jobs before finding a full-time home on the pitch. While she was playing for the Doncaster Belles, she balanced jobs at a leisure centre and as a horse groom.\nBeth Mead — Teesside University\nArsenal and England player Beth isn’t just a star on the field, she’s also balanced jobs with a university education and football commitments. Not only did she study sports development at Teesside University, but she played for Sunderland and worked in a village pub so she could travel to her matches.\nIn her honour, Teesside launched a Beth Mead scholarship in 2022, providing four students each year with a bursary of £1,200 and continued athlete support.\nRachel Daly — St John’s University\nHaving represented England since she was 15, competing at U-15, U-17, U-19 and U-23 levels before making the senior squad, Rachel has been very busy. However, she still found time to earn a degree from St John’s University in New York, studying on a sports scholarship. It was here that she also played for the university football team, despite not being able to play in her first year due to NCAA compliance regulations.\nNiamh Charles — Liverpool John Moores University\nNiamh is another Lioness who has a mortarboard and a pair of football boots, having graduated from Liverpool John Moores University. She attended the uni on a sports scholarship, studying sports and exercise science.\nShe’s also said she can see herself returning to education once she’s done with full-time football.\nEsme Morgan — Currently a university student\n21-year-old Esme is currently studying sports science at Manchester Metropolitan University. She’s put her degree into good use when she suffered a lower leg fracture in 2021, as it allowed her to understand her healing process.\nJordan Nobbs — Hertfordshire University\nJordan, the Lionesses’ “lucky charm”, has been on the England senior team since 2013. She also combined her football career with a degree in sports studies at Hertfordshire University.\nElla Toone — Leigh College\nMidfielder Ella may not have a BA like many of her fellow teammates, but she studied her Level 3 Extended Diploma in sport science at Leigh College, in her hometown Wigan.\nKatie Zelem — International College of Northern Denmark\nManchester United midfielder Katie is pursuing a master’s degree in sports business, using her downtime in Australia to catch up on lectures because she’s “quite behind”. She studied at the International College of Northern Denmark, earning her BA in international business.\nLauren Hemp — Manchester Metropolitan University\nNamed as one of the 10 most promising young players in Europe by UEFA, Lauren is another Lioness who’s gained a degree from Manchester Met. She graduated in 2021 with a sport coaching and development degree, the same year she travelled to Beijing to compete for Great Britain at the Olympic Games.\nRelated articles recommended by this writer:\n• ‘Hurting is an understatement’: Lionesses’ heartbreaking statements as they arrive home\n• Exactly how much the Lionesses are paid in comparison to men’s football wages\n• From team romances to sliding into DMs: Inside the love lives of England’s lionesses",
  "word_count": 1092,
  "scraped_at": "2026-02-14T13:04:13.434704"
}