{
  "article_id": "5368741874fd",
  "url": "https://www.broadcastnow.co.uk/broadcasting/dazn-app-joins-sky-platform/5189030.article",
  "title": "DAZN App joins Sky platform",
  "date": "20231222T111500Z",
  "domain": "broadcastnow.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The likes of Prime Video and Disney+ are already on the platform\nThe DAZN App will join Sky’s digital platform in the UK and Ireland in 2024.\nIt will become available on Sky Glass, Sky Stream and Sky Q, joining other streaming apps such as Prime Video and Disney+. This also means that viewers will be able to sign up to and watch content on NFL Game Pass, which is available through the DAZN App, on the Sky platform.\nEarlier this year, DAZN also launched a linear channel in the UK and Ireland on Sky, and it launched a channel on Prime Video. Chief financial officer Darren Waterman told Broadcast Sport earlier this year that DAZN sees the UK as an “important market”, but it has since missed out on Premier League rights - which were awarded to Sky Sports and TNT Sports earlier this month.\nDAZN does hold the rights to top level boxing and MMA, as well as the UEFA Women’s Champions League, Saudi Pro League, and the top women’s leagues in France, Spain, and Germany. It announced a free tier of subscription this month, starting in Germany with launches elsewhere in early 2024, where registered users will be able to access a selection of its content.\nShay Segev, DAZN Group CEO, said: “This is excellent news for both DAZN and Sky customers. It makes it even easier to access the DAZN app in the UK and Ireland, with all the great boxing and combat sports that we are so well-known for, as well as top-level women’s football, the Saudi Pro League, not forgetting the NFL Game Pass, and much more. DAZN’s distribution strategy is to be as accessible to as many sports fans as possible, and Sky’s great technology through Sky Q, Sky Glass and Sky Stream, will help us get into more homes across the UK and Ireland, so even more people can discover the sports entertainment universe we are working hard to create.”",
  "word_count": 328,
  "scraped_at": "2026-02-14T12:46:24.116231"
}