{
  "article_id": "53b586eaaa8e",
  "url": "https://inews.co.uk/culture/television/whats-on-tv-this-weekend-guide-listings-eurovision-2023-final-2335542",
  "title": "What on TV this weekend : Mae Muller represents the united kingdom at the Eurovision final in Liverpool",
  "date": "20230512T053000Z",
  "domain": "inews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Friday\nPick of the day: I’m a Celebrity South Africa Final\n9pm, ITV1\nBeing recorded before transmission and with no public vote, along with the fact that this run’s celebrity line-up are all past contestants with experience of how the show works, has robbed the format of much of what makes it special. The viewing figures (less than half of the autumnal contests) reflect that. Mind you, ITV won’t be entirely unhappy as even these reduced viewing figures are a lot healthier than the 9pm slot average. Anyway, Ant and Dec welcome us to the grand finale, as one of the remaining campmates is crowned our first-ever (and possibly the last-ever?) I’m a Celebrity Legend.\nEurovision Song Contest – Everyone’s a Winner\n7.30pm, BBC One\nA look at how even Eurovision failure is no bar to success. Fleur East and “a panel of celebrity Eurovision super-fans” toast the 20 most successful Eurovision songs that didn’t win – entrants whose songs have gone on to rack up millions of internet views and streams worldwide. Meanwhile, over on BBC Three at 8.30pm, The Big Eurovision Party sees some of the biggest stars in the recent history of the song contest perform their best-known Eurovision bangers and ballads. Presented by Edsilia Rombley, acts performing include 2022 winners Kalush Orchestra, Subwoolfer, Stefania and TIX.\nUnreported World\n7.30pm, Channel 4\nAs India’s population grows and cities expand, suburban areas are increasingly encroaching on the natural hunting grounds of leopards. Reporter Mandakini Gahlot joins with the government’s Leopard Task Force, assembled to contain the growing threat. In Karnataka, Bangalore’s surrounding villages have been terrorised by attacks and the frequency is rising. Gahlot meets a traumatised teenage boy lucky to have survived an encounter.\nThe Big Interiors Battle\n8pm, Channel 4\nThe suddenly ubiquitous AJ Odudu presents the latest round of this Interior Design Masters knock-off. The remaining five designers take on their first big group challenge as they are given the task of making over the local community cafe and performance space. Each is judged on their own area, as well as their cohesive design as part of a team.\nBlack Ops\n9.30pm, BBC One\nThis comedy thriller has something of Stephen Merchant’s BBC One series Outlaws about it – especially the idea of generally law-abiding people thrown out of their depth into the criminal underworld. Gbemisola Ikumelo and Hammed Animashaun are appealing as Dom and Kay, the police community support officers who go undercover in a drugs gang – the identity of the corpse in the body bag at the end of last week’s episode throwing them even further into the deep end.\nA Doctor’s Sword\n9.50pm, PBS America\nA medical graduate from Ireland, Aidan MacCarthy suffered some of the most harrowing experiences of the Second World War. Awarded the George Cross for bravery during the evacuation of Dunkirk, he was later captured by the Japanese and endured years of captivity before surviving the atomic bomb dropped on Nagasaki, returning home with a samurai sword. Now Aidan’s daughter travels to Japan in search of the person who gave it to him.\nSaturday\nPick of the day: Eurovision Song Contest 2023\n8pm, BBC One\nI can’t remember quite such a build-up to Eurovision, but then it has been 25 years since it was hosted in the UK (and then only because Ukraine is currently indisposed). So, come in Liverpool, where Graham Norton, Hannah Waddingham, Alesha Dixon and Julia Sanina make up the presenting team. Expect some droll banter as Norton shares the commentary with Mel Giedroyc. Mae Muller is, of course, the home hopeful, while the evening also features performances from last year’s first and second-place acts, Ukraine’s Kalush Orchestra and the UK’s Sam Ryder, as well as a celebration of the host city’s contribution to the world of pop music.\nFalklands War: The Untold Story\n7.30pm, Channel 4\nIt’s all about Eurovision today, as BBC One’s rivals capitulate with either repeats or movies. Among the best of these various reruns is this gripping and rigorous account of the Falklands War, which was first shown last year to mark the 40th anniversary of the conflict. It shows (to use Wellington’s words after Waterloo) what a damned near-run thing the 1982 conflict was. Or rather, as Lt Col Michael Rose, the head of the SAS in the Falklands, describes it here: “The campaign was a command-and-control muddle from the start.”\nInspector Montalbano\n9pm, BBC Four\nAnother chance to say arrivederci to Luca Zingaretti’s bullet-headed, espresso-quaffing Sicilian detective in the 2022 feature-length episode. Given the chilly spring weather of late, even those who have already seen it might be tempted to dip again into the sunshine and blue waters of fictional Vigata, as Montalbano grapples with the murder of the leader of an amateur dramatics company with a peculiar take on theatre. His assailant stabbed him in the chest, but without leaving a trace of blood.\nMatch of the Day\n10pm, BBC Two\nIn case football fans thought they had been forgotten in all the Eurovision mania, the weekly Premier League highlights package is over on BBC Two this evening. Leeds United vs Newcastle United, Chelsea vs Nottingham Forest and Aston Villa vs Tottenham Hotspur will be among the games being chewed over by Gary Lineker and guests, as title and European qualification hopes go side by side with relegation battles.\nThe Story of Bohemian Rhapsody\n10.20pm, Sky Arts\nWhile Eurovision musically dominates elsewhere, free-to-view Sky Arts is having a bit of a Queen night, including this documentary, which finds Richard E Grant narrating the story of the band’s classic 1975 track. Queen members Brian May and Roger Taylor return to Rockfield Studios in Wales (which itself was the subject of a highly engaging 2020 BBC documentary called Rockfield: The Studio on the Farm) to discuss how the music and lyrics came together. Friends and family – as well as Abba’s Björn Ulvaeus and members of The Darkness – reveal their thoughts on the song, while there is also rare footage of Freddie Mercury performing in the studio and the group’s first-ever TV appearance.\nSunday\nPick of the day: Bafta Television Awards 2023\n7pm, BBC One\nRob Beckett and Romesh Ranganathan host the TV awards show from the Royal Festival Hall in London, and unlike the movie Baftas, there is a good chance that viewers will have actually seen the TV programmes under consideration. Bad Sisters, The Responder, Sherwood and Somewhere Boy are in contention for the best drama, while Ben Whishaw (This is Going to Hurt), Gary Oldman (Slow Horses), Billie Piper (I Hate Suzie Too) and Kate Winslet (I Am Ruth) are among those up for acting awards.\nMOTD Live: Women’s FA Cup Final\n1.50pm, BBC One\nChelsea vs Manchester United (kick-off 2.30pm). All the action from Wembley Stadium. Chelsea have lifted this trophy in each of the past two seasons. They face a major threat to their supremacy from United, however, who have also pushed them all the way in the Super League and will be hoping to win their first major honour.\nThe Tragedy of Macbeth\n8pm, BBC Four\nFour-time Oscar nominee Saoirse Ronan, in her UK theatrical debut, and her frequent co-star James McArdle (Ammonite, Mary Queen of Scots) star in South African director Yaël Farber’s intense, atmospheric and critically acclaimed Almeida production of Shakespeare’s Scottish play. These almost-weekly “live” recorded performances on BBC Four will, for some, be reason enough to pay the licence fee.\nTen Pound Poms\n9pm, BBC One\nA new drama from Danny Brocklehurst (Brassic) is set in 1956 and follows a group of Brits who respond to an emigration advert promising a prosperous new life in Australia for only a tenner. “Goodbye rain,” Mancunian construction worker Terry (Warren Brown) tells his wife, Annie (Faye Marsay). “Imagine sunshine 300 days a year and tea in the garden. Imagine a garden…” Needless to say, things don’t quite turn out as advertised. Also arriving at the resettlement camp near Sydney is a nurse played by Michelle Keegan, whose fiancé got cold feet during the six-month sea journey down under.\nThe Big Fat Quiz of Sport\n9pm, Channel 4\nJimmy Carr hosts, with panellists Roisin Conaty, Judi Love, Joel Dommett, Dane Baptiste, Kerry Godliman and Tom Allen pondering why Paula Radcliffe apologised to the nation, which sports have been played on the Moon, and which trademarks belong to Muhammad Ali.\nThe Man Who Played with Fire\n9pm, Sky Documentaries\nA tense, four-part thriller-like documentary follows former diplomat Jan Stocklassa as he delves into the still-unsolved assassination of influential Swedish prime minister Olof Palme in 1986 – a shocking murder dubbed “Europe’s JFK shooting”. The bestselling Scandi-noir crime writer Stieg Larsson (The Girl with the Dragon Tattoo) was one of those obsessed with picking up where the police operation left off, and his files form the heart of an investigation which includes input from Palme’s son, Joakim, and several key witnesses.",
  "word_count": 1488,
  "scraped_at": "2026-02-14T12:55:29.586226"
}