{
  "article_id": "53c3466fae60",
  "url": "https://www.nunesmagician.com/2023/6/21/23767742/john-wildhack-lays-out-plans-for-the-future-of-syracuse-orange-athletics",
  "title": "John Wildhack lays out plans for the future of Syracuse Orange Athletics - Troy Nunes Is An Absolute Magician",
  "date": "20230621T164500Z",
  "domain": "nunesmagician.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 2022-23 Syracuse Orange athletic season came to a close with a press conference from Director of Athletics John Wildhack. It was held in the football wing of the Lally Athletics Complex Tuesday afternoon.\nJohn Wildhack lays out plans for the future of Syracuse Athletics\nSU’s Director of Athletics answered some questions about what’s next for Orange sports.\nWildhack, who is approaching the seventh anniversary of his hiring at SU, spoke about the state of the department and what it will be focusing on over the coming years.\nDome Renovations and Lally Complex Updates\nFirst on the agenda was the latest on upgrades to the JMA Dome and the still-under-construction Lally Complex.\nThe Dome has multiple scheduled enhancements over the next two plus years, with one major addition on track to debut this fall. A long-awaited replacement of the building’s Wi-Fi should be complete before football season, with JMA installing a 5G network.\nNew seating is still planned for 2024, as is the Miron Victory Court, which will connect the Dome to the Barnes Center at the Arch.\nA new football operations center is also expected to open in 2024, with an Olympic Sports Center now given a timetable of summer 2025. (Why they needed to focus on a new front door first instead of the practical stuff is beyond me, but at least it’s not delayed any further.)\nSyracuse and N.I.L.\nSU and NIL have been in a bit of a complicated situation since the departure of Adam Weitsman as the program’s de facto fundraiser. His public persona and relationship with Jim Boeheim made him the center of attention in that regard.\nLosing Jesse Edwards to West Virginia led to some speculation that Syracuse couldn’t cut it in the modern college athletics world. Wildhack attempted to calm those fears:\n“We’ve had a number of people step up in significant ways to support our NIL efforts. They’ve done so quietly... I think we’re in a better place with NIL than we were 90 days ago.”\nHe went on to say that while they made strides to keep Edwards in Syracuse, his departure was “not unique to Syracuse” and is happening in many other programs as well.\n“The transfer portal really kind of is free agency. We’re gonna have kids who go in the portal and leave, and we’re also gonna get athletes who come to Syracuse from the portal.”\nState of the Orange\nSyracuse University was tied for 5th-highest student-athlete graduation rate among all Power 5 institutions this past academic year. Wildhack said it’s an often-overlooked goal to prepare students for a life after their athletic careers, and he’s proud of SU for succeeding in this area.\nThere’s been a major coaching overhaul amongst the five Dome sports these past two years - but it seems that football will remain the odd team out.\nWildhack insisted that current HC Dino Babers is still under contract for “multiple years” (we believe that to be two), and he hopes to retain him at least that long.\n“I think we’ve had a very good offseason. The assistant coaches he’s brought in are very, very good. They’ve contributed instantly in recruiting... If we have success in 2023 and beyond, I hope Coach Babers is here for a long time.”\nHe also clarified that definition of “success” is building off last year and making another bowl game.\nAs for the other major sports: Wildhack is pleased with Adrian Autry’s transition to MBB head coach. Boeheim has settled into his new advising role and is available as a resource to all athletic programs.\nThe next step for Women’s Basketball and Men’s Lacrosse is respective returns to the NCAA Tournament, while Women’s Lacrosse continues to chase a championship.\nSyracuse and the ACC\nIn case there was any doubts with ongoing conference alignments - no, SU isn’t leaving the ACC anytime soon. Two takeaways here:\n- Wildhack believes Syracuse can continue to compete in the ACC, and that improvements to their facilities reflect that commitment.\n- A new revenue-sharing deal for the conference seems imminent.\nWhile he wouldn’t divulge too much, Wildhack made the comparison of Clemson’s 80,000 seat football stadium and the Dome bringing in 35,000 for basketball as examples of the “uniqueness” that a new deal would ideally take into account.",
  "word_count": 715,
  "scraped_at": "2026-02-14T13:08:04.425925"
}