{
  "article_id": "53cda343fe78",
  "url": "https://www.express.co.uk/celebrity-news/1872945/romeo-beckham-girlfriend-mia-regan-split-victoria-fashion-show",
  "title": "Romeo Beckham breaks silence after failing to join ex Mia at mum Victoria fashion show | Celebrity News | Showbiz & TV",
  "date": "20240302T124500Z",
  "domain": "express.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Romeo Beckham breaks silence after failing to join ex Mia at mum Victoria’s fashion show\nFootballer Romeo Beckham and Mia Regan recently confirmed they had split after five years together. However, that didn't stop the model from supporting her ex's mum at her Paris Fashion Week show.\nVictoria Beckham marks Romeo's 21st birthday\nRomeo Beckham has broken his silence after he opted not to appear at mum Victoria's fashion show in Paris. The 21-year old footballer has recently split with girlfriend Mia Regan after five years together.\nDespite parting ways with Romeo earlier this month, ex-girlfriend Mia supported Victoria Beckham on Friday at a fashion designer event. However, Romeo was nowhere to be seen.\nThe Brentford B footballer has since broken his silence after he failed to appear with his family to support Victoria. Romeo re-shared a photo of his eldest brother Brooklyn and wife Nicola, his sister Harper, and younger brother Cruz, captioning it with: \"FOMO [Fear Of Missing Out] - what an incredible show @victoriabeckham.\"\nMeanwhile, his ex-girlfriend Mia stepped out along in Paris wearing a grey mini dress with a plunging neckline. According to MailOnline, the model is still \"extremely close\" with Victoria Beckham.\nMia had been dating the son of David and Victoria Beckham since 2019. Romeo confirmed that the pair had called it quits in a post to his Instagram story, alongside a photo of the duo pulling funny faces at eachother.\nMia has previously worn items from Victoria's fashion collection and promoted them across social media.\nA source recently claimed to MailOnline: \"Victoria absolutely adores Mia and she is really sad that she and Romeo have split.\n\"She gets it, they are a young couple and of course the chances are they wouldn't stay together forever but she has her own relationship with Mia and the two women will still work together in the future.\"\nRomeo confirmed his split with Mia on Instagram last month and wrote: \"Mooch and I have parted ways after 5 years of love. We still have a lot of respect for each other, and still hold a strong friendship and always will.\"\nDon't miss: Sarah Beeny says she has never told her husband of 22 years ‘I love you'\nDon't miss: The 1% Club winner still hasn't received £98k prize despite filming months ago\nDon't miss: 'How dare you!' George Galloway explodes at ITV reporter's question\nMia also confirmed the split with a photo of the pair posing together.\nShe commented: \"This is Ro, we have grown up with each other since we were 16!!\n\"Love takes different forms & paths as you mature. We aren’t tougher romantically but we do share lots & lots of love for one another… after 5 years we friendzoned each other heheh.\"(sic)\nRomeo is the second eldest child of David and Victoria Beckham after his 24-year-old brother Brooklyn. He currently plays for the Brentford B football team after signing a one-year transfer deal year from Inter Miami.",
  "word_count": 494,
  "scraped_at": "2026-02-14T13:11:08.911906"
}