{
  "article_id": "53cfee4f23ee",
  "url": "https://www.cardchronicle.com/2023/5/19/23728788/friday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Friday afternoon Cardinal news and notes",
  "date": "20230519T184500Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "—After last night’s win over Florida State, the Louisville baseball team can lock up a spot in next week’s ACC tournament with two more wins over the Seminoles, or a split with FSU and two NC State wins over Pitt.\nFriday afternoon Cardinal news and notes\nRyan Gulam Zade arrived May 8th at 3:44 am. He’s happy that he shared this earth with Denny for a full day, and knows Jeff Brohm’s recruiting wins will lead to real wins on the football field.\n—It’s NCAA tournament game day for the U of L softball team, which will face Indiana in the Knoxville Regional this afternoon at 3. You can catch the game on ESPN2.\n—C.L. Brown has wasted no time stirring the pot in his new role as Courier Journal columnist, calling for U of L to honor former athletic director Tom Jurich.\n—UK women’s hoops transfer Kennedy Cambridge visited U of L on Thursday.\nIt’s also worth noting that Cambridge’s younger sister, Jaloni, is the No. 1 ranked recruit in the class of 2024.\n—The WNBA’s 2023 season begins today, and three former members of the U of L women’s basketball program are on rosters to start the year.\n—Tickets for November’s Empire Classic in New York are now on sale.\n—Texas, a team Louisville could face at the Empire Classic, is getting star guard Tyrese Hunter back for another season. He’ll play in the Longhorn backcourt alongside high-scoring Oral Roberts transfer Max Abmas.\n—On3 has Louisville at No. 4 in its post-spring ACC football power rankings.\n4. Louisville\nThe Cardinals are a darkhorse ACC contender this fall thanks to an upgrade at head coach and a cupcake conference schedule that doesn’t include Clemson, FSU or UNC.\nJeff Brohm returned home and has overhauled Louisville’s roster with 20 transfers, improving the team’s receiving corp, offensive line and secondary. He also signed his 2023 quarterback in Cal transfer Jack Plummer, who reunites with Brohm after spending three seasons at Purdue with 14 starts, and Stanford edge rusher Stephen Herron.\nThe Cards lost key linebackers Yasir Abdullah, Momo Sanogo and Monty Montgomery, but their defense should still be one of the better units in the ACC.\n—Josh Heird has announced four promotions for members of the U of L athletics staff.\n—Former Louisville WR Chance Morrow is continuing his college career at Buffalo.\n—The Basketball and Brew podcast has a lengthy interview with Cardinal assistant Nolan Smith here (video).\n—Flipping Joseph Stone Jr. — one of the highest-rated wide receivers in the class of 2024 — from LSU would be no small thing.\n—Ashton Gillottee is ranked here as the 62nd-best player in college football for 2023.\n—Racing Louisville opened up NWSL Challenge Cup play with a 3-2 win over the Kansas City Current on Wednesday.\n—A new study ranks Louisville as the sixth-best beer city in the United States.\n—Every time these highlights start making the rounds on the internet — which is like five times a year — I have to watch them up until the second Jaire interception.\n—Class of 2024 women’s basketball recruit Ava Watson has Louisville among her five finalists.\n—Louisville is among the favorites to land Florida linebacker Nicholas Rodriguez, who took an unofficial visit to U of L last month.\n—Class of 2026 tight end Jack Janda from Michigan has been offered by Louisville.\n—This is cool.\n—Georgia State DL transfer Jeffrey Clark had a great visit to Louisville.\n—Jeff Brohm appears to be pursuing another high-profile Jackson State WR transfer.\n—Louisville men’s tennis is vying for a couple of individual national championships this weekend. The Cardinal team advanced to the second round of the NCAA tournament last week before falling to No. 3 Ohio State.\n—Friday Irrelevance, double helping:\n—Jeff Brohm added a second OL transfer from Houston on Thursday.\n—The Louisville inmate who escaped from police custody and briefly kidnapped two people is still — at least at the time of this writing — on the loose.\n—Even in one of our worst seasons of the Dan McDonnell era, Louisville baseball is still the clear king of the Commonwealth.\n—The “White Men Can’t Jump” remake starring Jack Harlow is now officially streaming on Hulu.\n—U of L’s Jonneshia Pineda has been named to the 2023 50 Most Impactful High Major Assistants list.\n—And finally, the field for Saturday’s Preakness Stakes is down to seven horses after a Friday morning scratch. Derby winner Mage is currently a 4/5 favorite to take down the second leg of the Triple Crown.",
  "word_count": 756,
  "scraped_at": "2026-02-14T13:09:13.259553"
}