{
  "article_id": "53db7f9f8a2b",
  "url": "https://www.eastlondonlines.co.uk/2023/11/hate-crime-spike-in-islamaphobic-attacks-across-ell-boroughs-in-wake-of-conflict/",
  "title": "HATE CRIME : Spike in Islamaphobic attacks across ELL boroughs in wake of conflict – Eastlondonlines",
  "date": "20231125T164500Z",
  "domain": "eastlondonlines.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Israel-Hamas war has sparked a rise in both Islamaphobic and Antisemitic hate crimes in London. Ahead of another weekend of marches in London, Eastlondonlines reporter Aysha Imtiaz reports on the fears among Muslim communities, while here Rosie Harris-Davison looks at the surge of attacks on Jewish people.\nA Muslim woman was racially abused and publicly attacked on Stoke Newington High Street last week.\nAccompanied by her young children, she was punched, scratched on the face, shown the middle finger, and called a “Monkey” that needed to go “back home”.\nHer desperate pleas for help from witnesses and the police went unattended, sources close to the mother confirmed.\nHer experience is not a one-off aberration. Divisive rifts caused by the Israel-Hamas conflict and inflammatory language online have spiked hate crimes against Muslims in the Eastlondonlines boroughs.\nData by the Metropolitan Police shows that in the past year, there have been 170 Islamophobic hate crime offences within the four ELL boroughs.\nTower Hamlets recorded the highest spate of offences, with 74 Islamophobic hate crimes. Hackney, Lewisham, and Croydon recorded, respectively, 49, 25, and 22 hate crimes against Muslims. These figures do not yet reflect data from November, suggesting real-time cases may be much higher.\nMonitoring group TellMAMA reported that there has been a six-fold rise in hate crimes against Muslims compared to last year, with 69 of those crimes reported in London over the past six-week period.\nActon Mosque, for example, experienced five attacks in ten days in recent weeks.\nThe Metropolitan Police said in a statement: “Hate crime in our communities continues to rise…Since the terrorist attacks on Israel on October 7 to November 18, we have made a total of 389 arrests involving hate crimes and acts such as violence linked to protests in the capital.\n“83 people have been charged. Of these charges, 26 involve allegations of anti-Semitism offences.\n“Eight were for anti-Muslim offences and 20 for other faith hate crimes. Twenty-nine charges have been made for protest-related public order offences.”\nThis comes during Islamophobia Awareness Month in the UK, a period dedicated to raising awareness about Islamophobia, and despite broader efforts to reduce crime rates.\nOther efforts include the Mayor of London’s decision to increase funding to tackle hate crimes, while MP Zarah Sultana has called for scrutiny of ‘institutionalised racism’.\nAt a local level, ELL borough council initiatives to combat deep-rooted Islamophobia have been varied.\nTower Hamlets Council arranged a friendly football match between The Met Police and Tower Hamlets Community Safety Team to raise awareness for Islamophobia Awareness Month.\nHowever, a group called Hackney Muslims criticized Hackney Council’s silence over Islamophobia Awareness Month, saying a lack of visible initiatives, “…is saying we’re not bothered.”\nMeanwhile, in Tower Hamlets, Mosques such as East London Mosque and London Muslim Centre, held workshops earlier this month to teach women how to report hate crimes.\nA representative from Lewisham Islamic Centre told Eastlondonlines: “There is no doubt that Islamophobia is on the increase globally, the election of the far-right party in Holland yesterday further reaffirms this. Whilst the mosque itself has been subjected to hate from sections of the right-wing media for being outspoken on the issue of Palestine, we have not heard any complaints from individuals themselves about any incidents.\n“Islamophobia awareness month is important because it’s a month where special significance is attached to discussing and highlighting the issue, and this must continue in and out of November.”\nTellMAMA has found that hate speech against Muslims online incites greater community fractures.\nThey said: “Since October 7, the sheer volume of dehumanising, racialised, and violent language about Muslims, with the most extreme examples calling for genocide – with Muslims compared to rats or viruses from accounts who also call on or suggest a ‘civil war’ will occur on British streets.\n“Similar worrying examples weld the above to broader anti-refugee and anti-migrant narratives about so-called ‘invaders’ and that ‘patriots’ must ‘fight back to stop it’. More broadly, the danger is not only from what appears online but how it may inspire or motivate individuals to cause harm to Muslims and other communities on our streets.”\nResponding to the incident in Hackney, Councillor Alastair Binnie-Lubbock, for the Hackney Downs ward, said: “This attack sadly highlights the continued importance of November’s Islamophobia Awareness Month. My thoughts are with the victim of this attack and others who are being targeted because of someone else’s ignorance, cruelty, and bigotry. The Hackney I know is a place of love and a place where we can all strive to be better, more anti-racist, more aware, and more kind.”\nThe Met Police said: “This will not be tolerated. We have moved additional officers into our hate crime investigations – to ensure we are progressing investigations as quickly as possible and bringing offenders to justice.”",
  "word_count": 798,
  "scraped_at": "2026-02-14T12:05:46.209509"
}