{
  "article_id": "53eb2ba80338",
  "url": "https://www.hollywoodreporter.com/lists/predictions-hollywood-2026/",
  "title": "Predicting Hollywood in 2026",
  "date": "20251227T161500Z",
  "domain": "hollywoodreporter.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "YouTube decimates TV. Netflix buys Warner Bros. Bob Iger ties Disney to a boundary-pushing AI startup. Donald Trump picks which media moguls rule, gets broadcast newsrooms to pay him massive legal settlements and strong-arms studios to drop inclusion and diversity efforts. Given the truth-is-stranger-than-fiction year we just lived through, forecasting 2026 may be a fool’s errand. But, below, The Hollywood Reporter‘s journalists have a few educated guesses and smart takes about what the next year may have in store for the entertainment industry.\n-\nDisney + Taylor Swift\nDisney’s next big acquisition will shock the world in 2026. The purchase? Taylor Swift — for a cool $4 billion, the same price it paid for Lucasfilm in 2012. Well, not quite Swift herself, but a 360-degree Swift production and live event company that encompasses touring, film, TV, merchandising, experiential and future IP. Something with a catchy name (Evermore Entertainment, SwiftCo., etc) over which the ultimate showgirl will retain full creative control and veto power. In exchange, Disney+ will become the exclusive home to Swift content — an ever-expanding universe of concert docs, songwriting rooms and other behind-the-scenes exclusives. The deal will also see the “Fate of Ophelia” singer moving into scripted entertainment with a slate of interconnected streaming series and theatrical features — the Swift Cinematic Universe (SCU). Disney’s consumer products division will take over her merchandising, lending quality control to the process while overseeing vault drops timed to album releases and premieres (available only at Disney theme parks). The only Swift-related thing Disney won’t own? The music itself. That’s hers forever — but Disney will get first dibs at sync rights across all its properties. And, of course, bragging rights to releasing the first animated movie musical featuring all Taylor Swift songs. — Seth Abramovitch\n-\nMicrodramas Will Bid for Male Viewers\nIt will shock no one who has ever downloaded a microdramas app that women are often cited as the main consumers of these bite-sized, melodramatic and often romantic tales. But companies are making efforts — set to ramp up in 2026 — to expand their audience. First there’s a top player in the U.S., ReelShort, whose recent diversification of its genre offerings has resulted in the marksman series American Sniper: The Last Round and the Navy-themed drama Callsign: Legacy. In June CEO Joey Jia told THR that men made up 35 to 40 percent of ReelShort’s viewership — a figure that might change with the company’s plans to expand into “high-concept sci-fi, action thrillers, and elevated fantasy” next year, per Sophie Xiong, its global head of content. Then there are new companies like the startup MicroCo, which plans on producing crossover stories in horror and anime. Could a bro comedy along the lines of Neighbors be next? With more experienced Hollywood players getting in the game and comedy remaining a genre that can tolerate verticals’ ultra-low budgets, don’t count it out. — Katie Kilkenny\n-\nBox Office Will Rebound to $9.8 Billion\nWe’ve been here before. Remember in 2024 when bullish box office observers, including one very outspoken AMC chief Adam Aron, declared that 2025 domestic revenue would near $10 billion for the first time since the pandemic? Um, think again. If anything, 2025 will finish on par with 2024’s $8.8 billion, thanks to lingering pandemic/strike delays and fewer all-audience pics. The coming year is another matter; even the most circumspect Hollywood execs believe there will be substantial improvement — think in the $9.8 billion range due to a better slate. And research firm Gower Street believes global ticket sales, fueled by more robust Hollywood fare, could clear $35 billion (including $11.4 billion domestically). These predictions certainly look good on paper; let’s just hope they are not fantastical thinking amid the siege on theatrical in the post-COVID world. — Pamela McClintock\n-\nThe New Mogul Era Arrives\nAt a moment where the entertainment industry is facing an AI reckoning and a rush to consolidate, 2026 will be the year the next generation of moguls make their mark. David Ellison intends to take big swings at Paramount (and possibly Warners!); Lachlan Murdoch will seek to put his stamp on Fox, now free of meddling from his siblings; A new leader will rise at Disney, but who they are and what their priorities are will speak volumes about the company’s future; And Mike Cavanagh will join Brian Roberts atop Comcast, and he will have to figure out how what had been one of the biggest companies in media can compete when it is suddenly dramatically smaller than the rest. Meanwhile, the next generation of studios is being built before our eyes, but will they be defined by AI tools, or creators like MrBeast? 2026 is the year we will probably find out. — Alex Weprin\n-\nCritics’ Knives Out for Lucas Museum\nStar Wars mastermind George Lucas has spent at least $1 billion and well more than a decade pursuing his dream for a museum of what he terms “narrative art.” It’s a populist and distinctly American vision that puts blue-chip paintings, newspaper comic strips and sci-fi movie renderings in the same cultural conversation. His futuristic building in Exposition Park next to USC is already a landmark. But the lead-up to the planned September 2026 opening has seen significant staff turnover, including among respected leadership, as Lucas has assumed increasingly direct curatorial oversight. He may believe this as an auteurist’s prerogative. The art world, particularly critics, will likely view it as proof this is just a collector’s vanity project — and assess it and its mission accordingly. — Gary Baum\n-\nBroadway Will See a Rush of New Musicals\nWith only a handful of new musicals currently scheduled to open on Broadway in the 2025-2026 season, there’s already been a rush of shows trying to come to the Great White Way this spring, and even more may try to squeeze in before the Tony Awards cut-off. Before December, there were only four musicals up for possible contention for the best musical Tony Award, which is seen as the most prestigious trophy and the biggest boost to a show’s box office. This included The Queen of Versailles, which has already announced an early closing in December after receiving mixed to negative reviews for the Kristin Chenoweth-led documusical. Now, Off-Broadway hit Titanique and Beaches: A New Musical have announced limited runs on Broadway this spring, with Beaches coming in just before going on a national tour. How these shows will fare at the box office remains to be seen, particularly as the costs of producing a Broadway musical continues to rise, but why not compete for the top award at the Tonys? It may be their best shot in years. — Caitlin Huston\n-\nL.A. Production Won’t Rebound Yet\nAngelenos breathed a collective sigh of relief when California passed a historic expansion to the film and TV tax credit program earlier this year. There was good reason: a doubling of the annual cap and bump in the base subsidy has already led to studios announcing plans to shoot big budget features, including Heat 2 and the next installment to Jumanji, in the state. Still, there are major caveats. Most of California’s biggest competitors, including New York, New Mexico and New Jersey, saw larger upticks in production levels, and the state’s production spend fell year-over-year to $1.5 billion, per a report from industry tracker ProdPro. The takeaway? The changes to the tax credit program may have come too late. Other areas built out production infrastructure, once L.A.’s biggest advantage, as California was content to stay out of the tit-for-tat race to host Hollywood. And several of those regions offer cheaper labor and costs for material to build sets. For most productions, it may just not make sense to shoot in California anymore. Expect the first few months of 2025 to be an early test of the Gov. Gavin Newsom’s plan to save production in its cultural home. — Winston Cho\n-\nA Synthetic Movie Star Will Gain Traction\nEveryone went into a tizzy recently over Bob Iger’s pact with Sam Altman and what it meant for memeslop on Disney+. And there will no doubt soon be plenty of the stuff on the platform as personalized Pixar characters and Darth Vader run amok. But the real AI star of 2026 will be something more original – or, AI original. Think a “Tilly Norwood”-type character in a star vehicle, or an entire film – short or feature – made primarily by training a model. Whether it will be accepted by mainstream Hollywood is an open question. And whether it will be good is an even more open question. But it will certainly be viral, and in these attention-economy times, isn’t that what matters? — Steven Zeitchik\n-\nThe Limits of “Just Use AI”\nI don’t know how many times this year I’ve read, “You won’t lose your job to AI — you’ll lose it to someone using AI.” But that conventional wisdom will turn out to be wrong at workplaces that ultimately prize effectiveness. Yes, some select few workers will use AI to level up and be more productive in some ways than they are now. But those people will probably find ways to excel with or without AI anyway. In 2026, given that tech giants are larding products with AI tools to show that they are with the zeitgeist, it’ll become very clear that most workers will use AI to … just cut corners and turn in mediocre approximations of the work they already do. Not handing over your human effort at your job to a robot will be a signal to other human beings — whether they’re your viewers, readers, clients, buyers or bosses — that you’re willing to put effort into your work and think about what you’re doing. — Erik Hayden\n-\nYouTube Becomes Undisputed King of TV\nYouTube already accounts for more viewing time on TV sets than any other streaming platform (only Netflix comes anywhere close), but 2026 is the year it becomes the true king of TV. Not only will the platform retain its seat atop the Nielsen Gauge in terms of time spent, but YouTube TV will become the largest pay-TV platform in the U.S., jumping past Charter Spectrum and Comcast Xfinity, thanks in no small part to its planned genre packs, which will lower the cost of entry. Combined with the more than 125 million YouTube Premium and Music subscribers, fast growth in selling other streaming services through Primetime Channels and what are believed to be millions of Sunday Ticket subscribers, YouTube will become a runaway freight train of entertainment, cornering the creator market, dominating the pay-TV market, and getting everyone else into its own ecosystem. — Alex Weprin\n-\nApple TV Finally Gets Ads\nI need to pull my card on this one. (And in a nod to Apple TV’s Major League Soccer sister streaming service, let’s make it a red card.) This is at least the second year in a row (and across two different publications) that I’ve predicted Apple TV will add ads in the new year. To put it another way, the last time I confidently made this declaration, Apple TV would go on to still be known as “Apple TV+” for nine more months. Yikes. What makes me more certain this time? Not a whole lot. It’s just a good bet that one of these years Apple TV will have an ad-supported tier. After all, it’s the lone major U.S. streaming service without one, and the aforementioned MLS package (available as a standalone service or an add-on package) already runs commercials. And Apple TV, like all streamers not named Netflix and HBO Max, is going to face additional competitive firepower in 2026 as the latest result of industry consolidation. Even the largest company in the world (by market cap) could use an additional revenue stream. Plus, maybe the + was the ad-free promise? — Tony Maglio\n-\nA New Major Free Streamer Launches\nBetween them, the Roku Channel, Fox’s Tubi and Paramount’s Pluto TV account for about 6 percent of all TV viewing in the United States in a given month. As viewers have gotten used to (if not exactly thrilled about) streaming with ads, AVOD and FAST services have mushroomed with relatively low-cost libraries and an experience more akin to scrolling through a cable guide than hunting through endless menus in search of something to watch. The market seems ripe for a big media player with a deep library — say, an NBCUniversal or a Disney — to gain a quick foothold in a growing segment of the streaming market. — Rick Porter\n-\nChina Becomes a Force Again for Hollywood\nNo one can honestly say whether the recent rebound for Hollywood studio movies at the China box office is an anomaly or a trend. But it is worth paying attention to. When the first Zootopia turned into an sleeper hit in 2016, grossing a huge $236 million and propelling the film past the & $1 billion mark globally (its domestic tally was $326 million. Disney brass quickly decided to build a zootopia theme park attraction at Shanghai Disney. Opening in 2024, it has is one of the park’s most popular tickets and certainly primed fans for the sequel, which has become the second biggest Hollywood movie of all time among any move behind 2019’s Avengers: Endgame. The overall downturn is because the Chinese government wants more local film seen on its big screen (i.e. propaganda-leaning fare). James Cameron’s Avatar is another beloved Hollywood tentpole in China, and posted an outstanding opening day gross of $17. Is this a simple matter of three’s a charm, or the beginning of a thaw in relations? Ask us a year from now. — Pamela McClintock\n-\nNetflix’s Prairie Reboot Will Be a Hit\nNetflix aspires to (and largely succeeds at) offering something for every possible type of viewer — but one thing it hasn’t had much of in recent years is a big all-ages, co-viewing family show. Massive hits like Wednesday and Stranger Things might incidentally fit that bill, but with the Little House redo — despite cringeworthy character breakdowns like describing Pa Ingalls as “the original girl dad” — the streamer will give parents who grew up watching the long-running network series (and who might still read Laura Ingalls Wilder’s books with their kids) a reason to gather their families around a screen in a way Netflix hasn’t really tried much in recent years. — Rick Porter\n-\nJen Shah Will Be Back\nA recap for the uninitiated: Jen Shah, then a cast member of The Real Housewives of Salt Lake City, was arrested in a 2021 sting operation as cameras rolled on her Bravo show. Facing charges of conspiracy to commit wire fraud and money laundering, she continued to film (and deny) until an eleventh-hour switch to a guilty plea got her sentenced to six and a half years in a federal prison … where she reportedly palled around with fellow convicts Elizabeth Holmes and, possibly, Ghislaine Maxwell. Despite all this juice, Housewives impresario Andy Cohen maintains the network is “done” with Shah — who was released to house arrest on Dec. 10. The drama king doth protest too much, wethinks. If Shaw doesn’t find herself back on Bravo, some platform will have cameras rolling as soon as the terms of her parole allow it. And when they do, let’s consider it an act of charity to her victims. There’s still $6.5 million in restitution for her to pay. — Mikey O’Connell\nTHR Newsletters\nSign up for THR news straight to your inbox every day",
  "word_count": 2614,
  "scraped_at": "2026-02-14T12:20:36.742529"
}