{
  "article_id": "53ecac0bbd9f",
  "url": "https://theprideoflondon.com/2023/07/18/american-star-mia-fishel-chelsea-women/",
  "title": "22 - year old American star Mia Fishel reportedly to sign with Chelsea",
  "date": "20230718T144500Z",
  "domain": "theprideoflondon.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Emma Hayes’ raid of some of the best young players around the world continues. According to reports on Monday afternoon by Sergio Treviño Cantú of Fox Sports Mexico, 22-year-old Mia Fishel is on her way to Chelsea Football Club from Tigres UANL Femenil.\nThe credible news comes just 10 days after the west Londoners signed English youth international Brooke Aspin from Bristol City. The Blues, who were considered a part-time club in 2012 are building an incredibly deep squad that is not only going to create success now, but continue it for many years to come. Sam Kerr is the face of this team at this point in time, but she is not getting any younger. Players like Maika Hamano, and now Fishel in the forward position make it so that the transition period is much more seamless.\nThe forward competed with current Chelsea Women midfielder Jessie Fleming at the NCAA level in 2019 with UCLA. The two were large parts in the program finishing in the top-three in the United States collegiately for the third time in 10 years.\nFishel, a USWNT international who is yet to make an appearance for the senior national team was the No. 5 overall selection in the 2022 NWSL Draft by the Orlando Pride. The San Diego, California native declined to be a part of the Pride, expressing the fact that she did not want the draft to make this large decision for her.\nInstead, Fishel opted to move to Liga MX Femenil, a league that just began in July of 2017. It was the bigger stadiums, and the ability to win immediately that appealed the most to her. Many questioned her decision due to the infancy of the league, but at the end of the day, it more than worked out for her.\nThe two-time PAC-12 regular season champion appeared in 43 contests in the league and postseason for Tigres, scoring an astounding 34 goals. Last season, the forward won the Golden Boot in the Torneo Apertura, finishing the campaign 17 goals, eight more than anyone else on her team. In front of over 42,000 fans, the youngster netted the opening goal of the second leg of the semifinal of the tournament. Her goal scoring has to be considered the catalyst to her side capturing their fifth Apertura title.\nMia Fishel has the chance to be the next star in the frontline for Chelsea Women\nIn the most recent league competition, Torneo Clausura 2023 which concluded at the end of May, Fishel tallied 13 goals. That was fourth best in the league during that campaign behind former Barcelona superstar Jennifer Hermoso.\nJust this month, the 22-year-old helped Tigres hoist their second-ever Campeón de Campeones, a two-legged tie between the teams that won each season tournament. The former UCLA Bruin found the back of the net twice in the first leg after both teams failed to convert a chance in the first 68 minutes of the match.\nNot only has she shown her goal-scoring prowess at the Mexican top-flight level, Fishel has shown out at CONCACAF youth competitions. In the 2020 CONCACAF Women’s U-20 Championship, the Patrick Henry High School alum was awarded the Golden Ball, the tournament’s best player as the United States claim the top-spot in CONCACAF at the U-20 level for the sixth time. Fishel concluded with 13 goals during that competitions behind only now Lyon midfielder Melchie Dumornay, but ahead of USWNT star Trinity Rodman.\nShe is yet to receive a single cap for Vlatko Andonovski’s senior team. While the news is not official, the 22-year-old will hope that at a more high-profile club like Chelsea, her national team coaching staff will have no choice but to recognize her.\nOn both sides, this move is a win-win. With Aggie Beever-Jones looking like the next second-string striker behind Kerr, Fishel could provide even more depth. Whether she will go out on loan is a decision that is up to the club itself. Nevertheless, the next generation of superstars in west London is beginning to unfold as the foreseeable future looks just as bright as the present day.",
  "word_count": 687,
  "scraped_at": "2026-02-14T13:02:20.521136"
}