{
  "article_id": "540a2386f56d",
  "url": "https://www.yahoo.com/entertainment/tv/articles/tv-tonight-daisy-may-charlie-090203924.html",
  "title": "What on TV tonight : Daisy May and Charlie Cooper NightWatch , Strictly Come Dancing and more",
  "date": "20251026T213000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "What’s on TV tonight: Once Upon a Time in Space, IT: Welcome to Derry, and more\nFrom new Apple TV series Down Cemetery Road (adapted from a novel by Slow Horses’ Mick Herron), to Mortimer & Whitehouse returning for more fishing, to the fantastic documentary Once Upon a Time in Space and Liam Hemsworth replacing Henry Cavill on The Witcher, here’s what to look forward to, and catch up on, this week.\nWhat’s on TV tonight?\nOnce Upon a Time in Space\nBBC Two, 9pm; all episodes will be available on iPlayer today\nThe historical Once Upon a Time documentaries of filmmaker James Bluemel are more interested in humanity than didacticism. Previously, Bluemel has used his vivid oral history approach to tell the story of the Iraq War and the Troubles in Northern Ireland; not just in terms of what happened, but how it felt to live through it. In this fascinating four-part follow-up he does the same for space: humanising the history of space exploration through astronauts, cosmonauts and the loved ones they left behind.\nThe focus of tonight’s opening episode is not the 1969 moon landing but the expansion of the Nasa space program in the 1970s. This is the period in which astronauts such as Ronald McNair made history by becoming one of the first black Americans in space. “From slavery to space in four generations,” recalls his brother Carl, emotional. Another key figure is astronaut Anna Lee Fisher, who received widespread criticism at the time for going to space as a mother. Sexism aside, says her daughter, Kristen, she does wonder if there is something inherently selfish about being an astronaut. A question brought into sharp relief by the 1986 Challenger disaster, which claimed the life of Ronald McNair.\nb'\n'\nRobson Green: World’s Most Amazing Walks\nU&Yesterday, 8pm; all episodes will be available on U today\nThis gentle eight-part travelogue follows earnest actor Robson Green as he enjoys some of the world’s most beautiful walks. He begins tonight with a stroll alongside Hadrian’s Wall; a personal favourite of Green’s that has been soured by the felling of the tree at the Sycamore Gap.\nBlue Lights\nBBC One, 9pm; all episodes are already available on iPlayer\nTonight’s penultimate episode of the sublime Northern Ireland crime drama features a nerve-shredding scene in which a seemingly mundane piece of policing turns into a frantic blood-soaked nightmare. The best part? The paramedic for whom this is all just another day.\nThe Forsytes\nChannel 5, 9pm\nThe second week of the glossy period drama finds Jolyon (Danny Griffin) and Soames (Joshua Orpin) at odds over the ethics of an investment in India. More pressing, however, is Jolyon’s charged confrontation with Louise (Eleanor Tomlinson) and Soames’s desperate proposal to Millie Gibson’s Irene.\nJimmy Carr’s Am I the A**hole?\nComedy Central, 9pm\nNot even the hosting talents of Jimmy Carr can salvage this lifeless panel show. It is based on a popular Reddit community in which people tell a colourful story and ask if they are in the wrong. Tonight’s panel judges are influencer GK Barry and comedian Jamali Maddix. You can also watch it on Paramount+ from tomorrow.\nIT: Welcome to Derry\nSky Atlantic/NOW, 9pm\nThis gruesome eight-part prequel tells the story leading up to 2017 horror movie It, an adaptation of Stephen King’s classic novel. Bill Skarsgård reprises his role as Pennywise (the killer clown) although takes a backseat tonight for a tale about a group of 1960s kids tormented by a demon baby. SK\nWhat’s on TV this week?\nSaturday 25 October\nMichael McIntyre’s The Wheel\nBBC One/iPlayer, 8.20pm\nThere have been eight other versions of The Wheel around the world, yet none have made it beyond two series. As the British iteration begins its sixth run, what is its secret? For one, it has in Michael McIntyre a perfect host: bumptious and sympathetic, family friendly and a tad risqué – someone as ready to prick eminent egos as he is to lift the spirits of contestants fearing the worst. The lack of self-consciousness and celebrities genuinely invested in helping people win life-changing sums also helps – everyone is relaxed about being silly or, when the stakes are high, deadly serious.\nTonight sees a huge cash prize, engaging backstories (there are tears within the first five minutes), surely the best-received mention of Bobby Brown since the early 1990s and a long debate over the perfect cup of tea. The mix-and-match of famous faces remains as canny as ever, with Katherine Ryan, Susan Wokoma, Jill Scott, Layton Williams, Roman Kemp, Steve Pemberton and Reece Shearsmith all making their mark alongside, with doleful wit familiar to fans of Celebrity Traitors, Joe Marler. Only 10 questions are asked over the hour, yet the energy never flags.\nb'\n'\nLive International Rugby League: England vs Australia\nBBC One/iPlayer, 2pm\nAfter 22 years, the Ashes return to Rugby League with a three-match series kicking off this afternoon at 2.30pm at Wembley Stadium. With Australia the world champions, they will be strong favourites to triumph once again and continue a series-winning streak dating back to 1970.\nLive Women’s International Football: England vs Brazil\nITV1/ITVX, 4.45pm\nIt is hard to imagine Sarina Wiegman consenting to this week’s friendlies for the Lionesses being dubbed a “homecoming series”, with all the hubris that implies after this summer’s triumphs. Rest assured, England will be taking Brazil and Australia (whom England play on Tuesday, with coverage from 6.15pm on ITV4) very seriously, with the Seleção – like England – once again continental champions. Kick-off is at 5.30pm.\nMore in Entertainment\nWhoopi Goldberg struggles to sit at “The View” table during painful discussion: 'I'm out'\nStrictly Come Dancing\nBBC One/iPlayer, 6.20pm\nIt’s Icons Week and, following the elimination of a third leaden-footed bloke, Chris Robshaw, plus the loss of Stefan Dennis via injury, our dancers will be paying tribute to musical legends running the gamut from the Beatles to Taylor Swift.\n5 Days That Brought Down Prince Andrew\nChannel 5, 9.20pm\nAfter years of scandal and speculation of bad conduct, and with the recent publication of Virginia Giuffre’s memoir, Prince Andrew agreed to stop using his royal titles. This documentary assesses the events that led up to the downfall of the King’s brother, who still “vigorously” denies the accusations.\nNine Bodies in a Mexican Morgue\nBBC One, 9.20pm; all episodes are already available on iPlayer\nAnthony Horowitz’s enjoyably bonkers thriller approaches its denouement with federal agencies joining the search for the plane and its survivors, whose numbers are dwindling. GT\nSunday 26 October\nDaisy May and Charlie Cooper’s NightWatch\nBBC Two, 9pm; all episodes will be available on iPlayer today\nKicking off Hallowe’en week, siblings Daisy May and Charlie Cooper – who brought us the groundbreaking and hugely popular mockumentary This Country in 2017 – reunite for a new series in which they set out on a nationwide ghost hunt. They embark on a series of sleepovers in Britain’s most supposedly haunted places to see if anything, anything at all, happens in their quest for ghouls, spooks and scary apparitions.\nWhether you find it funny will greatly depend on if you enjoy their company as much as they do each other’s, on the cusp of their forties now and still joshing and spatting endlessly in full-on brother-and-sister mode. In tonight’s opener, they stay fairly close to home, heading to Gloucester Prison, which has long since shut its doors to the living. But it has a reputation for strong paranormal activity thanks to a 300-year history of incarcerating some of Britain’s most notorious criminals (Fred West among them), and with many of those who died or were executed there buried in the grounds. Not exactly a recipe for a restful night’s sleep in a tiny bunk-bed cell, especially when there’s an emergency fake-tan session to fit in as well.\nMayor of Kingstown\nParamount+\nTaylor Sheridan and Hugh Dillon’s gritty US crime drama returns for a fourth season. Now that Kingstown is finally free of the Russian mafia, Mike’s (Jeremy Renner) control comes under a new threat as competing rivals pile in to fill the power vacuum, sparking yet another bloody gang war. New episodes will arrive weekly.\nGuy Martin: The British Train that Changed the World\nChannel 4, 7.30pm\nCelebrating the 200th anniversary of one of Britain’s great engineering achievements, Guy Martin joins a team building a replica of the locomotive that pulled the first passenger train along the Stockton and Darlington railway and retraces the 26-mile journey that sparked a boom in rail travel.\nBBC Cardiff Singer of the World: A Celebration Concert\nBBC Four/iPlayer, 7.30pm\nGareth Malone and Danielle de Niese host a concert featuring previous winners and finalists from the internationally renowned singing competition. With performances from, among others, Natalya Romaniw, Catriona Morison, Ilker Arcayürek and Andrei Bondarenko.\nMortimer & Whitehouse: Gone Fishing\nBBC Two, 9pm; all episodes will be available on iPlayer today\nEmbarking on an eighth run, Bob Mortimer and Paul Whitehouse’s thoughtful series has lost none of its charm yet taken on the familiarity of a pair of comfy old slippers. Here, as a birthday treat for Paul, they pitch up at one of the great fly-fishing chalk-stream rivers, the Itchen in Hampshire, hoping to hook some wild brown trout.\nTrigger Point\nITV1, 9pm; all episodes will be available on ITVX today\nVicky McClure returns in Jed Mercurio’s explosive drama about a team of bomb disposal experts battling trigger mechanisms and terrorism on the streets of London. Tonight, Lana (McClure) endures a traumatic opening episode when a lone-wolf bomber starts targeting individuals in what appears to be a personal vendetta. GO\nTuesday 28 October\nMary at 90: a Lifetime of Cooking\nBBC Two, 7.30pm\n“People need to be reminded of old favourites,” says Dame Mary Berry while rustling up a cottage pie, although she could just as easily be talking about herself. Perhaps she is. Berry, often characterised as rather prim and proper and admitting herself that “once a girl guide, always a girl guide”, has a sense of mischief that can go underappreciated.\nHer first guest in this new series is Tom Allen (Alan Titchmarsh, Gabby Logan and Kiell Smith-Bynoe are among those appearing later), who brings that out in spades – or spoons, at least – as they discuss tarts and peaks while boating down the Thames. The premise is “making new memories with good friends”, which means watching a few old clips (Judith Chalmers pops up regularly) and updating some classic recipes with ingredients newer to Berry: samphire, lime leaves, lemongrass.\nTonight, alongside the aforementioned cottage pie with a twist, we get a Thai chicken traybake, pan-fried cod and bread and butter pudding, each eminently replicable and mouthwateringly presented, never sacrificing flavour for approachability. Whatever her tenth decade may hold, this is a celebration as low-key, classy and fun as its subject.\nThe Great British Bake Off\nChannel 4, 8pm\nThe four remaining bakers face Patisserie Week in a semi-final of cream horns, sugar glass domes and, as a showstopper, a sculpture of macarons.\nBattle Treasures with Foxy and Bruce\nSky History/NOW, 8.30pm\nFormer SAS man Jason Fox and historian Bruce Crompton join forces for this enjoyably granular, occasionally bloodthirsty new series about historical artefacts and their connections to modern warfare. They begin with an examination of assault rifles.\nThe Good Life: Inside Out\nU&Gold, 9pm\nPenelope Keith introduces another of U&Gold’s excellent sitcom retrospectives, with contributions from co-stars (Richard Briers and Paul Eddington from archive footage, of course) as well as assorted writers and producers. Strange now to recall it was a critical and commercial slow starter, but by the time of its boldly downbeat farewell, The Good Life was a lynchpin of British TV comedy – so much so that Elizabeth II was treated to her own bespoke episode a year later.\nWelded Together: Storyville\nBBC Four/iPlayer, 10pm\nRounding off another exceptional run of Storyvilles, this Belarusian documentary offers an unflinching depiction of generational trauma. Katya, a young welder, reconnects with her troubled mother and infant half-sister: a fulfilling, supportive working life is contrasted with the domestic chaos of addiction and abandonment, to potent effect.\nIn My Own Words: Tom Jones\nBBC One/iPlayer, 10.40pm\nSir Tom Jones is by turns tickled and moved to have his memory jogged in this lovely film. While the arc might by now be familiar – working-class upbringing in the Welsh Valleys, discovery of that extraordinary voice, 1960s stardom, television, Elvis and Vegas, knicker-hurling self-parody and unlikely comebacks – Jones remains a fine and perceptive raconteur. GT\nWednesday 29 October\nDown Cemetery Road\nApple TV\nApple’s Slow Horses adaptations of Mick Herron’s Slough House spy novels are among the greatest glories of the TV-streaming era. And as series five comes to an entertainingly edge-of-seat conclusion today, a starry new adaptation of another Herron novel lands. With Apple-sized budgets, a cast led by Emma Thompson and Ruth Wilson, and a scriptwriter, Morwenna Banks, who’s already a name, success seems all but guaranteed.\nEven so, this was Herron’s debut novel, and the first in the early years series of Zoe Boehm (Thompson) detective stories he wrote long before Jackson Lamb was a gleam in his authorial eye. So, while it clearly has Herron’s distinctive style and humour running through it like a stick of rock, it doesn’t always gel. Especially with a cast of well-known supporting actors who seem too keen to let us know they’re in on the joke.\nBy the end of today’s opening pair of episodes, though, it’s shaken off most of those jitters and keeping us nicely gripped as Wilson, in the role of not-to-be-deterred Sarah Tucker, employs the services of Oxford’s least promising private detective agency to investigate, following a deadly house explosion on her street.\nb'\n'\nThe Crash Detectives\nBBC Two/BBC One Wales/iPlayer, 7pm\nIn Caerphilly, the race is on to investigate why a rider lost control of a powerful motorbike and crashed into a wall on a quiet residential street. And in Chepstow, the air ambulance is called in for a woman seriously injured when the car she was travelling in collided with a stationary lorry.\nPortrait Artist of the Year 2025\nSky Arts/NOW, 8pm\nIt’s fascinating to see how differently each artist approaches their subject in this always-entrancing competition. In tonight’s fifth heat, Emily Attack, Melvin Odoom and Max Beesley are the trio of high-profile sitters waiting to see how the latest batch of qualifiers recreates them on canvas.\nThe Celebrity Traitors\nBBC One/iPlayer, 9pm\nWith barely more than a handful of players left in the game, and just two more episodes to go after this, the Traitors are under as much pressure as the Faithful to get the next Round Table right. First, though, there’s a seriously challenging mission to get through.\nGrand Designs\nChannel 4, 9pm\nYou can see the mischievous gleam in Kevin McCloud’s eyes when tonight’s self-builders tell him they want to build a giant 21st-century castle, complete with tower, castellations, a moat, arrow slits, courtyards and futuristic technology throughout. And they want to have it listed. Even with a budget of £2.2 million, surely that can’t all go according to plan, can it?\nDavid Hare Remembers... The Absence of War\nBBC Four/iPlayer, 10pm\nPlaywright David Hare recalls adapting his 1993 play The Absence of War, a thinly veiled critique of Labour leader Neil Kinnock’s failure to oust the Conservative government in the 1992 general election, for the BBC’s Screen Two strand. John Thaw, in a widely acclaimed performance, plays the lead in the adaptation which follows at 10.15pm. GO\nThursday 30 October\nThe Witcher\nNetflix\nThe fourth series of Netflix’s gory fantasy epic opens with a child telling the story of Geralt of Rivia, the superhuman monster hunter who is known as a Witcher. It is ostensibly a recap, but the intention is to reintroduce the character with a new face. Up until now, Geralt was played by Superman star Henry Cavill. In 2022, however, Cavill stepped away from the role after reportedly disagreeing with how the show was adapting the books of Polish author Andrzej Sapkowski. To much fan grumbling online, the part has since been recast with The Hunger Games’ Liam Hemsworth.\nThe transition takes getting used to. The soft-faced Hemsworth plays Geralt with the same growl as Cavill, but is an altogether gentler take on the character. A direction that befits a warrior who Sapkowski writes as being more sensitive than his rugged, brutish persona. Be warned, though: Geralt’s recasting is not an invitation for new viewers to hop on board. Today’s eight episodes pick up directly after the third series’ finale – with Geralt on his way to the evil kingdom of Nilfgaard to save his adopted daughter Ciri (Freya Allan) – and its fantasy world is as dense and impenetrable as ever.\nb'\n'\nAileen: Queen of the Serial Killers\nNetflix\nBetween 1989 and 1990, Aileen Wuornos murdered seven men across central Florida – a killing spree that ended with the electric chair. This disturbing true crime documentary uses never-before-seen death row interviews with Wuornos to stitch together the story of both what she did and why she did it.\nBrassic\nSky Max/NOW, 2am & 10pm\nThis anarchic comedy about a group of northern ne’er-do-wells has become one of Sky’s biggest hits. It reaches its end tonight with a swaggering blood-soaked finale; in which Joe Gilgun’s lovable rogue Vinnie attempts to broker a truce between two psychopathic gangsters in a carvery.\nInside The Tower of London\nChannel 5, 8pm\nTonight’s return of the long-running Tower of London documentary series follows the preparations for last year’s commemoration of the 80th anniversary of D-Day. The jewel in the occasion’s crown is organiser Debbie Whittingham’s poignant idea to have a lone bagpiper perform the haunting lament that echoed across the beaches on D-Day.\nArt Detectives\nU&Drama, 8pm\nWe have had crosswords, books and antiques, so why not a cosy murder mystery about art? This passable six-part romp follows the Heritage Crime Unit’s detective Mick Palmer (Stephen Moyer, who’s also currently appearing in The Forsytes on Channel 5) as he solves unusual culture-themed mysteries. Such as tonight’s brutal murder of an art historian.\nAll Creatures Great and Small\nChannel 5, 9pm\nThe sixth series of the soothing veterinary drama comes to an end tonight with momentous news: Japan has surrendered; the Second World War is over. For Callum Woodhouse’s soldier Tristan, however, the war cannot be folded away so easily. As illustrated by his triggering encounter with a shire horse. SK\nFriday 31 October\nReturn to Paradise\nBBC One/iPlayer, 8pm\nThe second series of the soapy police drama set in Australia – part of the global Death in Paradise universe – begins the day after the first series ended; Mackenzie “Mack” Clarke (Anna Samson) is still in her hometown of Dolphin Cove, after failing to return to her life and job in London. She decided to stay after overhearing her ex-fiancé Glenn (Tai Hara) – whom she jilted at the altar – saying he still has feelings for her. But she can’t pluck up the courage to tell him and now they find themselves working together again – she as a detective, he as a forensic scientist, with matters further complicated by Glenn planning his wedding to Daisy (Andrea Demetriades). So a will-they-won’t-they storyline is neatly set up for the series, plus a potential love triangle.\nThe crime-solving element in this opening episode of six concerns the death of a scientist working at a groundbreaking shark research lab, who is found dead alone on a boat – was it an accident or, as Mack suspects, a murder? She has to prove it – and Glenn and sidekick Colin (Lloyd Griffith) help to find the killer. Ardal O’Hanlon makes a guest appearance as Mack’s boss back in the UK.\nb'\n'\nUnreported World\nChannel 4, 7.30pm\nGuillermo Galdos reports for the documentary strand from Colombia, where rival anti-government militias who control the cocaine trade have brought the country to a state of violent conflict again. Civilians face a daily threat of killings, forced recruitment and displacement.\nBorderline\nITV1, 9pm; all episodes are already available on ITVX\nThis engaging policier is much helped by the odd-couple dynamic between the two leads – steady hand PSNI DCI Boyd (Eoin Macken) and the Garda’s sparky DI Regan (Amy De Bhrún) – as they solve cases that straddle the Northern Ireland border. In this first of a two-parter, a hurling star is murdered and their investigation uncovers a gambling and prostitution ring. Meanwhile, both officers’ past lives – personal and professional – crash into their present.\nSister Boniface Mysteries\nU&Drama, 9pm\nAnother enjoyably daft whodunnit; the Great Slaughter team are taking part in a team-building exercise against local rivals Stowington Police when one of Stowington’s members is murdered. Sister Boniface (Lorna Watson) starts sleuthing to help DI Sam Gillespie (Max Brown) and his colleagues find the culprit.\nHow Are You? It’s Alan (Partridge)\nBBC One, 9.30pm; all episodes are already available on iPlayer\nThe excellent comedy continues as the newly single Alan – “There were signs; we stopped tickling each other” – throws himself into fresh experiences to see if they can boost his mental health. As ever Felicity Montagu and Tim Key give great support to Steve Coogan’s cringe-making Alan.\nThe Walking Dead: Daryl Dixon\nSky Max/NOW, 10pm\nAfter a slow start, the third series of the apocalyptic drama gathers pace; after the shipwreck Daryl (Norman Reedus) and Carol (Melissa McBride) are now in Spain – and find themselves in the middle of a war between surviving factions. VL\nTelevision previewers\nStephen Kelly (SK), Veronica Lee (VL), Gerard O’Donovan (GO), Vicki Power (VP) and Gabriel Tate (GT)",
  "word_count": 3620,
  "scraped_at": "2026-02-14T13:06:52.943690"
}