{
  "article_id": "543c1bf41002",
  "url": "https://www.wbko.com/2023/08/17/wku-announces-four-additions-wku-hall-fame/",
  "title": "WKU announces four additions to the WKU Hall of Fame",
  "date": "20230818T000000Z",
  "domain": "wbko.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WKU announces four additions to the WKU Hall of Fame\nBOWLING GREEN, Ky. (WBKO) - Four great names in the history of Western Kentucky University Athletics will be inducted as the 32nd class into the WKU Athletic Hall of Fame in ceremonies set for Homecoming weekend this fall.\nThe 2023 class includes Darryl Drake (football), Harry Jones (baseball), Courtney Lee (men’s basketball) and Natalie Powers (women’s basketball).\nThe induction of the 2023 class will bring the number of former WKU athletes and coaches to earn berths in the school’s Athletic Hall of Fame to 170 since its founding in 1991.\nThe 2023 class will be inducted in a ceremony highlighting the annual W-Club Homecoming Brunch, set for 9:30 a.m. CT Saturday, Nov. 11, on the John Oldham Court in E.A. Diddle Arena on the WKU campus in Bowling Green.\nTickets for the event, which is open to the general public, are $30 each and can be purchased and/or reserved:\n• online at //alumni.wku.edu/wclubbrunch23 (then click on “Registration” and fill out the reservation form);\n• by calling the Alumni Office at 270-745-2586;\n• or, by contacting W-Club Executive Director Paul Just (270-792-4247) paul.just@wku.edu).\nEach active W-Club member who has paid his/her 2023-24 dues (or is a LifeTime member) may purchase up to two seats at the member discounted rate of $20 each (additional seats will be at the general public rate -- $30 each). However, seating is limited and reservations MUST be made — either online, by phone with the Alumni Association, or with Just — to ensure seating is available. Non-members and the general public are welcome, but must purchase seats (see above). Letterwinners who have not yet paid their ‘23-24 dues may do so online with a credit card (at //alumni.wku.edu/joinwclub) or at the door (exact cash or check only) with a prior reservation for the event.\nThe inductees will also be honored in ceremonies on Jimmy Feix Field at halftime of the annual Homecoming football game, set to kickoff at 2:30 p.m. WKU Head Coach Tyson Helton will pit his Hilltoppers against Conference USA foe New Mexico State at Houchens-Smith Stadium. Tickets for the game are available by calling 1-800-5-BIG-RED (or 270-745-5222). W-Club members with a valid 2023-24 membership card may purchase game tickets at a discounted rate at the W-Club Window at Gate 5 prior to the game.\nMore about the members of the 2023 WKU Athletic Hall of Fame class:\nDarryl Drake / Football, 3 letters (1975, ‘77-78); Assistant Coach (1983-91)\nDarryl Drake came to WKU from Louisville in the fall of 1974 and spent the bulk of the next two decades as a Hilltopper athlete and assistant coach. He was a part of two great Topper teams – the 1975 club that went 11-2 and won the Ohio Valley Conference title; and, the 1978 club that posted the top “turn-around” record in the nation, winning 8 of 10 games and claiming another OVC crown. Those two clubs were a combined 19-4 (12-1 in league play). As a senior, he had 31 receptions for 380 yards (12.3 yds/catch) and 3 TDs; and, he ran the ball three times for 99 yards and another score. Following his career on The Hill, Drake signed as free agent with Washington Redskins (’79) and later was with the Ottawa Roughriders of the CFL (’81) and the Cincinnati Bengals (’83). He returned to The Hill as a graduate assistant on Coach Jimmy Feix’ 1983 team and spent a total of nine seasons on the Topper staff – also working with WKU head coaches Dave Roberts and Jack Harbaugh. He left The Hill after the 1991 season to join the staff at Georgia (1992-96) and later coached on the college level at Baylor (’97, as offensive coordinator) and at Texas (’98-03). He was associate head coach of the Longhorns his last year there before moving on to the NFL as an assistant coach with the Chicago Bears (2004-12 – Including a Super Bowl appearance in 2007), the Arizona Cardinals (’13-17) and the Pittsburgh Steelers. (’18-19). Drake passed away on August 11, 2019.\nHarry Jones / Baseball, 3 letters (1968-70)\nHarry Jones of Media, Pa., was originally a walk-on and then became the only WKU baseball athlete ever to earn All-OVC honors three times (1968, ‘69 and ‘70). The first African-American to earn an athletic letter in baseball on The Hill, he is one of only two Toppers to be honored as a first team all-conference selection three times — the other was Hall-of-Famer Ralph Antone (twice in the OVC, ‘81 & ‘82, and once in the Sun Belt, ‘83). Jones completed his career with a .343 batting average while striking out just 14 times in 268 at-bats – that’s just once in every 10 at-bats! He became a force to be reckoned with almost immediately when, as a sophomore, he led the club in eight stat categories — batting average (.333), runs scored (19), hits (24), doubles (5), triples (1), total bases (34), walks (11) and stolen bases (15). His junior year, he posted the best batting average (.317) on the team among players who appeared in more than 20 games, while leading the Toppers in ABs (82), runs (17), hits (26) and RBI (16). As a senior season, he hit a career-high .368 (second best on the club — behind only Hall of Famer Don Durham’s .418 avg.) and led WKU in at-bats (114), runs (35), hits (42), doubles (7), home runs (3) and total bases (57) to earn team MVP honors. Overall, the three teams he played on posted winning seasons; and, his junior year (’69), the Hilltoppers won the OVC West Division crown, going 10-1 in conference play (17-11 overall). His performances were key factors in three Topper teams that posted the best conference finishes – that ‘69 championship and two runner-up efforts (’68 and ‘70) – in a period of 17 years (1962-78).\nCourtney Lee / Basketball, 4 letters (2005-08)\nA member of the WKU All-Century Team, Courtney Lee was an All-American and the Sun Belt Conference Player of the Year as a senior. A native of Indianapolis, he was a three-time all-conference selection after earning SBC Rookie of the Year honors as a freshman. He shares the WKU record for career points (2,238) with the legendary Jim McDaniels. Lee completed his years on The Hill ranked among the top seven in Hilltopper history in 11 career stat categories – first in points scored (2,238), games started (127), minutes played (3,957), free throw percentage (81.72) and 3-point field goals attempted (611); second in 3-point field goals made (245) and steals (242); third in field goals made (802); fifth in 3-point field goal percentage (40.1%); and seventh in scoring average (17.62 ppg) and in free throws made (389). In addition, the 461 points he scored as a rookie set a school scoring record for freshmen. Overall, his Topper teams posted four 20-victory seasons, won 96 of 130 games (73.8%) and were 56-18 (75.7%) versus SBC schools. Those clubs were 53-7 (88.3%) at home in Diddle Arena. As a senior, Lee averaged 20.4 points, leading the Hilltoppers to a 29-7 record, SBC division and tournament championships, and a berth in the NCAA Tournament where they reached the Sweet Sixteen. Lee was the 22nd pick in the 1st round of the 2008 NBA Draft (by Orlando) and went on to enjoy the longest playing career (12 years) of any Hilltopper in major league professional sports.\nNatalie Powers / Basketball, 4 letters (1998, ‘00-02)\nA member of the Sun Belt Conference All-Time Team selected on the league’s 30th anniversary in 2006, a two-time All-SBC first team pick (2001 & ‘02) and a member of the 2000 SBC All-Tournament Team, Natalie Powers came to WKU from Owensboro and completed her career on The Hill ranked sixth on the list of Lady Topper 1,000-Point scorers with 1,641 points (she remains 13th on that list). One of the top career shooters in WKU history – on 3-pointers, she hit 168 (3rd at the time and still 8th) at 38.3% accuracy (4th, now 6th); and, on free throws she made 461 (2nd, still 4th) at an 83.4% rate (a school record and still 4th). She finished her career with an average of 30.3 minutes played per game, the school record at the time. The 736 points she scored in 2001 was a Topper record (and is still the 4th best in the books as is her 22.3 scoring average that season). Powers’ 87.4 free throw percentage her senior year remains the best ever for a Lady Topper. And, her 7-8 (87.5%) shooting from 3-point range at home versus Middle Tennessee (Feb. 1, 2001) was also a single game record and is still the 4th best in the WKU books. All four of her Lady Topper teams made post-season tournament appearances (’98 and ‘00 in the NCAA; and ‘01 and ‘02 in the WNIT). She was particularly impressive in a 95-92 home win over Mississippi in the opening round of the 2001 WNIT in Diddle Arena (a perfect 11-11 at FT line and totaling 28 points). She sat out the ‘98-99 season with an injury.\nCopyright 2023 WBKO. All rights reserved.",
  "word_count": 1534,
  "scraped_at": "2026-02-14T12:40:20.097540"
}