{
  "article_id": "54606614c370",
  "url": "https://www.bbc.com/sport/football/articles/c3w5px1p735o",
  "title": "Why La Liga clubs are spending less than rivals : Guillem Balague column",
  "date": "20250907T121500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "From chaos to professionalism - but is La Liga being left behind?\n- Published\nThis summer's transfer window once more highlighted the widening financial gap between La Liga and the Premier League.\nEnglish clubs splashed out more than £3bn, with Liverpool's £125m signing of Alexander Isak the headline move.\nSpanish sides, by comparison, spent only £592m, well behind not just England but also Italy (£1bn) and Germany (£739m). The numbers reflect how much financial clout La Liga has lost in recent years.\nWithin Spain, investment was concentrated significantly at Real Madrid and Atletico Madrid, who spent £157m and £149m respectively.\nVillarreal did break their transfer record to bring in Georges Mikautadze for £25.5m, while Real Betis fought hard to sign Antony from Manchester United for £21m.\nElsewhere though, restraint was the rule: Sevilla raised £38m by selling Dodi Lukebakio and Loic Bade to balance their squad, Getafe sacrificed Christantus Uche - their outstanding player - to stay within regulations, and Barcelona limited themselves to low-cost reinforcements, finishing with a modest £16m surplus.\nThe contrast with the Premier League may seem stark, but behind the austerity lies a strategic shift. La Liga has consciously prioritised sustainability over the short-term fireworks of reckless spending.\nIs £3bn Premier League spending cause for concern?\n- Published3 September 2025\nTransformation from chaos to professionalism\nEarlier this century Spanish football was in disarray. More than 20 clubs entered bankruptcy proceedings, unpaid wages dominated headlines, and debts to tax and social security authorities ballooned above £595m. In that climate, Spanish clubs were widely seen as toxic investments.\nThe turning point came in 2013 with the introduction of La Liga's economic control framework, inspired by Uefa's Financial Fair Play.\nFrom then on, clubs could only spend what they generated. Salary caps were introduced, revenues had to be demonstrated before investments, and all transactions were closely monitored.\nThe change was dramatic as chronic debt was slashed, losses gave way to profits, and foreign investors returned. Today, funds hold stakes in clubs like Atletico, Valencia, Espanyol, Cadiz and Leganes.\nEven Barcelona, despite their stature, were forced to sell assets and activate financial 'levers' just to comply, showing that the rules are applied across the board.\nThis was not just a sporting reform, but actually the foundation of a new industry. Clubs moved from precarious ventures to stable enterprises capable of generating thousands of jobs and contributing significantly to Spain's economy.\nThe transformation from chaos to professionalism is arguably La Liga's greatest success of the last decade.\nThe league's reforms have also gone deeper than financial oversight. Governance standards have been strengthened, transparency enhanced, and clubs encouraged to professionalise their management.\nModernisation has become a priority, with increasing emphasis on data, technology, and diversified sources of income.\nYet, the model has also revealed its shortcomings. The rigidity of the rules has often left women's teams underfunded, since clubs prioritise their men's squads to stay compliant.\nEven Barcelona Femeni, the most dominant team in Europe, started the season with only 17 registered players, while rivals abroad operated with greater freedom.\nSmaller sporting sections have also been squeezed, highlighting the need for future adjustments that can balance financial discipline with inclusivity.\nFor years, Spanish football lived on two main sources of revenue: broadcasting and player transfers. Collective TV rights, introduced in 2015, doubled annual income to about £1.3bn, peaking at £1.4bn in 2019-20.\nTransfers boomed before the pandemic, but the market has since cooled. At the same time, piracy drains an estimated £510m to £595m each year, and there are concerns that the revamped Champions League could further undermine La Liga's value.\nAlthough La Liga secured a five-year domestic deal until 2027, future TV income is expected to stagnate or decline.\nHow Spanish clubs are still punching their weight\nThat reality has forced clubs to look elsewhere. Matchday revenues are being maximised through stadium exploitation, both for football and other events.\nAtletico Madrid's Metropolitano, for instance, will host 10 Bad Bunny concerts. The controversial deal with private equity firm injected £1.6bn into clubs, earmarked largely for infrastructure and international expansion.\nThough opposed by Real Madrid, Barcelona and Athletic Club, it underlines the strategy. Spanish football must broaden its commercial horizons to keep total revenues above the current £4.3bn a year.\nInevitably, financial discipline has reduced La Liga's glamour. The Premier League enjoys not just higher revenues but also structural advantages: English as the global language, stronger pay-TV culture, and a wider international reach. Spain cannot match this commercially.\nBut on the pitch, Spanish clubs continue to punch above their weight. In the past decade, La Liga sides have reached 15 European finals, compared to 13 for English clubs.\nReal Madrid, Barcelona and Atletico have been constant presences in the Champions League, Sevilla have dominated the Europa League, Villarreal triumphed in 2021, and even the Conference League has seen Spanish representation with Real Betis. The evidence shows that while England dominates financially, Spain still delivers competitively.\nIndeed, some of the biggest names in world football are now in La Liga - Lamine Yamal and Kylian Mbappe lead the new era, following a tradition that has already included Ousmane Dembele.\nOne of the only global superstars yet to be drawn in is Mohamed Salah. The allure of Real Madrid and Barcelona - clubs where history, glamour and tradition converge - remains unmatched, and for players, they are still the ultimate destinations.\nPart of La Liga's resilience lies in its youth systems. Spanish academies have always been strong, but in an era of tighter spending, they have become even more vital. Barca's La Masia, Real's Castilla and Atletico's academy continue to produce talent, but so too do Villarreal, Real Sociedad, Athletic Club and Celta Vigo.\nThis culture of player development guarantees a steady flow of high-quality footballers. It reinforces local identity while also providing clubs with valuable assets in the market.\nPlayers like Pedri, Lamine Yamal, Nico Williams and Alex Baena are products of this system - youngsters who break into first teams quickly and become international stars. For many clubs, their academies are both a sporting foundation and a financial safeguard, ensuring competitiveness without overspending.\nLa Liga's path is not to imitate the Premier League but to consolidate its own model.\nRelated topics\n- Published3 September 2025",
  "word_count": 1042,
  "scraped_at": "2026-02-14T13:22:17.837728"
}