{
  "article_id": "550a15f89316",
  "url": "https://www.moneycontrol.com/news/opinion/saudi-uae-and-qatar-three-middle-powers-setting-the-bar-on-leveraging-soft-power-12978458.html",
  "title": "Saudi , UAE and Qatar : Three Middle Powers setting the bar on leveraging soft power",
  "date": "20250328T061500Z",
  "domain": "moneycontrol.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Elizabeth Roche and Tridivesh Singh Maini\nThe post 1945 world order is crumbling, leaving it, as many analysts have said, in between orders. While there has been talk of the same for over a decade, recent events strongly reiterate this point. The Rubio-Lavrov meet in Saudi Arabia and the shocking 5 March public spat in the Oval office between US President Donald Trump and Ukraine President Volodymyr Zelenskyy are but two signs of a world in major churn.\nIncreasing role of Middle Powers\nThe disarray however gives “middle powers” the room to jostle and get better elbow room to bargain for their national interests. The phenomenon of global reordering involves reinvention, hedging bets, band-wagoning and leveraging hard and soft power depending on the situation.\nImportance of soft power\nAmerican political scientist Joseph Samuel Nye Jr, credited with coining the phrase “soft power,” describes it as a country’s ability to influence others without resorting to coercive measures. Meaning that, countries use their values, ideals, and culture to create good opinion among the people of other countries and attract them towards themselves.\nThe major tools used states use to attract publics across the world are music, sports, media, arts and culture. This is not to say that the tools of hard power – military coercion and economic sanctions -- are not important, in fact recent years have shown the limitations of soft power, with Nye himself coining the term ‘Smart Power’ – which is a right blend of soft and hard power.\nThe case of Saudi Arabia\nA strong example of this point is the fact that for the past several weeks, Saudi Arabia has been the epicentre of hectic diplomatic activity. It has been catapulted into the limelight as the venue hosting talks to end the three year-old Russia-Ukraine conflict\nIn February, Crown Prince Mohammed bin Salman (MBS) welcomed US Secretary of State Marco Rubio and Russian Foreign Minister Sergei Lavrov in Riyadh. And earlier this month, MBS also hosted to Zelenskyy and US officials in Jeddah in a bid to find common ground to end the conflict.\nThis is the same Saudi Arabia whose de facto ruler was once globally shunned for alleged involvement in the murder of a Washington Post columnist. He is now the host of the talks to end to the Russia-Ukraine war and bring peace to Europe.\nOther Saudi steps\nIn refashioning its foreign policy to play the role of peacemaker, Saudi Arabia under MBS is making a conscious effort to move away from the years of unsuccessful military interventionism in Yemen. There was of course the old image of Saudi Arabia as the home of Al Qaeda ideologue Osama bin Laden who masterminded the terrorist attacks on September 11, 2001, in the US. Couple these with Saudi Arabia as an oil producing state with a conservative society, the picture wasn’t flattering.\nFrom 2017-18, however, one can discern moves by Saudi Arabia to rebrand itself. For starters, allowing women to drive. Permitting men and women to mingle at the work place, granting Saudi women over the age of 21 the right to apply for a passport and travel without the consent of a male \"guardian\", permitting non-Muslim diplomats to purchase alcohol and the opening of cinemas are all steps MBS has been credited with introducing.\nThe new city state of NEOM, announced in 2017, which aims to transform Saudi Arabia into a global leader in technology, industry and tourism and now in the role of a peace broker are burnishing the image of the country. A perception going in Saudi Arabia’s favour as it plays peace broker in the Russia-Ukraine hostilities is its image as a country with a neutral position on the conflict.\nIn fact, it can be argued that Saudi Arabia has been trying to emulate another GCC member state Qatar.\nThe case of Qatar\nPossessing the third largest reserves of natural gas means enough resources to crank up its diplomacy several notches. One of the first high profile diplomatic engagements hosted by Qatar was the World Trade Organisation talks in 2001. The talks were inconclusive but 2001 meet is referenced even today while referring to trade disputes or WTO talks.\nMore recently, Qatar hosted the Football World Cup in 2022 – a rarity given that FIFA World Cup tournaments were usually hosted by Europe or the Americas. Besides football, hosting motor racing and tennis are also the norm these days.\nAnother space where Qatar has burnished its credentials is in journalism. Today, the Qatar based Al-Jazeera news channel is seen as a gauge of sentiments in the Arab Street. And it competes with established western outlets like BBC or CNN in reach and quality of news and current affairs programming.\nIt would of course be important to point out, that Qatar too has played the role of peace broker many years – engaged in high stakes diplomacy to bring peace between Israel and Hamas, previously in 2006-2007 and later in the aftermath of the 7 October 2023 terrorist attack.\nUAE, the early mover\nThe United Arab Emirates has been working on its soft power credentials to ensure it stayed put among the top 10 countries in the Global Soft Power Index 2025, compiled by the London based brand valuation consultancy Brand Finance. It was the first country in West Asia to normalise ties with Israel after the 2020 Abraham Accords. It has also been seeking to play a significant role in diplomatic issues pertaining to the Middle East. UAE while normalising ties with Israel has also maintained robust ties with Iran. UAE has also hosted important multilateral events like COP 28 in 2024.\nIn conclusion, in a changing world order while the western world – especially the US – may be following policies which are impacting its soft power adversely, several Middle Powers especially in the Gulf are seeking to strengthen their soft power. This soft power is not linked merely to cultural issues but the stance on important diplomatic issues.\nElizabeth Roche is Associate Professor and Tridivesh Singh Maini is a Faculty Member at OP Jindal Global University, Sonipat. Views are personal and do not represent the stand of this publication.\nDiscover the latest Business News, Sensex, and Nifty updates. Obtain Personal Finance insights, tax queries, and expert opinions on Moneycontrol or download the Moneycontrol App to stay updated!\n- On Saturdays\nFind the best of Al News in one place, specially curated for you every weekend.\n- Daily-Weekdays\nStay on top of the latest tech trends and biggest startup news.",
  "word_count": 1090,
  "scraped_at": "2026-02-14T12:34:28.579602"
}