{
  "article_id": "551797dc73da",
  "url": "https://www.globalsecurity.org/military/library/news/2024/12/mil-241218-state01.htm",
  "title": "Secretary Antony J . Blinken in a Conversation at the Council on Foreign Relations",
  "date": "20241219T123000Z",
  "domain": "globalsecurity.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Secretary Antony J. Blinken in a Conversation at the Council on Foreign Relations\nUS Department of State\nRemarks\nCouncil on Foreign Relations\nNew York, New York\nDecember 18, 2024\nMR FROMAN: Mr. Secretary, we are meeting at this historic moment where there have been tectonic shifts around the world. We've got wars in Europe, in the Middle East, in Africa. We have this unprecedented competition with China. We have the rise of the Global South. We've got pandemic preparedness, all sorts of climate change issues -\nIt's not working? Hello? That would be good. Could you hear me? Sorry. Is that okay? Wendy, can you hear me? Yeah, okay. I will speak more loudly. (Laughter.)\nAnyway, we're meeting at this time when really the world has been undergoing fundamental changes. I wanted to ask you: How do you think historians will look back at the Biden administration and how it met this moment?\nSECRETARY BLINKEN: Well first, Mike, wonderful to be with you. Wonderful, as always, to be back at the council to see so many friends, so many colleagues, so many faces I've known for such a long time.\nI think you have to start with a couple of things. You have to start with what we inherited, because it's very easy to forget everything that's now in the rearview mirror was front and center when we took office four years ago. We had, arguably, the worst economic crisis on our hands since the Great Depression. We had the worst public health crisis going back at least 100 years. We had a country that was riven internally, and we had relationships with allies and partners that were incredibly fraught - a perception from our adversaries that the U.S. was in inexorable decline. And I think one thing that can be said is that we reversed that.\nIf you look at what the President put in motion and where we are today, both in terms of the investments we've made at home in restoring our competitiveness around the world with everything from the infrastructure investments to CHIPS and Science, to the IRA, we're now in a place where at least our macro numbers are the envy of the world. Now, people aren't feeling that enough in their day-in, day-out lives, but I think that's coming, too.\nWe have more foreign direct investment than ever before. We're also the largest provider of foreign direct investment around the world. And to me, this is one of the most important measures of all, because when you're looking at foreign direct investment, you're looking at trust, you're looking at confidence, and that speaks volumes. And so what our adversaries as well as partners around the world are seeing is a country that has reinvested in itself, that's reinvested in its competitiveness, and that is ready to engage the world.\nThe other side of the coin, the part that we've been responsible for, has been to re-engage, re-energize, rejuvenate, and in many ways reimagine our alliances and partnerships. And as I sit here today, I feel confident that even with all of the problems you listed - and it makes you wonder why anyone would want this job - we're actually in a much stronger position than we were to contend with them. Because we're stronger at home, because we've restored and in many ways rethought our partnerships around the world.\nMR FROMAN: One of the new factors we're dealing with is this axis of autocracies or the axis of the aggrieved - China, Russia, Iran, North Korea - working together in new and different ways than expected. They're not natural allies with each other. There are lots of differences and interests between them and among them. What is the - what do you think the extent of their cooperation might be going forward? What are its limitations? And is there anything the U.S. can do to drive a wedge among them?\nSECRETARY BLINKEN: So we have seen an alignment among adversaries that's grown. There are a lot of antecedents; this goes back a long time. I think in many ways it was really accelerated by Russia's initial failures in Ukraine with the aggression against Ukraine, and Russia desperately needed more help. And it's strengthened its relationship with North Korea, and unfortunately, that's a two-way street. It's not only what Russia is getting from North Korea; it's also what North Korea is getting from Russia. It's strengthened its relationship with Iran, again, out of need. And these country - and Iran has also benefitted from this relationship.\nChina is also part of this mix, but in a slightly different place because it's so much more connected and in ways interdependent with the world that it does have to ask itself what the reputational cost of this kind of alignment is and what the consequences will be if it goes too far. And we can talk more about that, because we're seeing that play out in ways that we very much pushed along.\nBut I think most of these are marriages of convenience, not marriages of conviction. But that doesn't make them any less dangerous. I mean, think about it this way: You now have an ongoing aggression by Russia against Ukraine, and the primary drivers of that, what's sustaining it, is actually North Korea with missiles and with troops, and China with its contributions to Russia's defense industrial base.\nSo you can see - and this has also created an awakening among Europeans that what's happening halfway around the world in the Indo-Pacific matters to them, just as we're seeing an awakening among countries and partners in the Indo-Pacific that what's happening in Europe actually matters to them. I think one of the other things that we've done is we've built bridges between the Atlantic and the Pacific in ways we haven't seen before, so that we have allies and partners working together, because they understand that what happens in one place is going to have profound consequences in the other.\nMR FROMAN: I mean, it's not obvious - to your point - why is this in China's interest? They're getting - China has now drawn the U.S. and Europe closer together vis-à-vis the Indo-Pacific than ever before. If you're - well, if you're talking to your counterparts in China, what do they tell you about why it's in their interest to be throwing in their lot with such a excellent group like Russia, Iran, and North Korea? (Laughter.)\nSECRETARY BLINKEN: Well, first, of course, they would deny the premise. They will claim that they're not. But no, there's no there's no doubt that from China's perspective, given the - both the intent and the capacity it has, unlike any other country, to try to reshape the international system, to do it in a way that's more reflective of its interests and its values, knowing that we're the primary challenge to being able to do that, if another country or countries make life more difficult for us and our allies and partners, well, that's something that it's going to look at and maybe take part in.\nBut I do think it puts China in an increasingly difficult position, because if it aspires to this position of leadership, if it wants to be seen as a responsible rising power, then it can't, on the one hand, for example, be saying that it wants to make peace in Ukraine, while, on the other hand, fueling the ongoing aggression. Seventy percent of the machine parts that Russia is importing are coming from China, 90 percent of the microelectronics. And a lot of that's going to the defense industrial base and allowing Russia to continue the aggression against Ukraine.\nAs we've called out China on that, as we've put a spotlight on that, we've seen countries around the world, and particularly in Europe, say, \"No, this has got to stop,\" and even taking action against Chinese companies, against Chinese entities that are engaged in this practice. And for the Europeans, again, if China says it wants to have a better relationship with European countries on the one hand, and on the other hand it is fueling what is arguably the greatest threat to European security - not just Ukrainian security, but European security since the end of the Cold War - it doesn't hold up.\nSo I think China feels increasingly the awkwardness of that position. What that changes or doesn't in its policies remains to be seen.\nMR FROMAN: One of the other elements that's new in the system is - really is the rise of the Global South, and it's made for a much more complex world, where we're competing with China and others for the attention and affection of other of other countries. China has the Belt and Road Initiative. It throws around a lot of investment, doesn't tend to ask a lot of questions about human rights and corruption and governance the way the U.S. does when it goes in with foreign assistance. How can we compete better in the Global South? How do we - it's hard to fight something with nothing. It's not that we have nothing, but we don't have nearly as much as China does to put on the table. What's your view on how the U.S. government can do better going forward?\nSECRETARY BLINKEN: We have to have - and this is exactly what we focused on - we have to have a better offer, and I think we do. And we've spent a lot of time trying to better marshal those resources. Look, countries who've had the experience of Chinese investment - produced a lot of good things, but it's also produced, in many cases, a hangover that people wake up to, countries wake up to, piled with debt that they can't get out from under, shoddy construction standards, no focus on the environment, the rights and protections for workers. And all of that comes back to bite at some point.\nBut you're exactly right. You can't beat something with nothing. So we've done a number of things that I think have increasingly appealed to global majority countries, as they see an alternative to taking this kind of investment from China. We marshaled resources among many of the leading industrialized democracies. The initiative that the President engaged in, the Partnership for Global Infrastructure and Investment, is bringing together hundreds and hundreds of billions of dollars, which we're now putting into effect. The President was recently in Angola, seeing the actual realization of this Lobito Corridor that eventually will connect the Indian and Atlantic oceans in Africa, but across Angola, Zambia, the Democratic Republic of the Congo, and connecting it in ways that are putting together not just transportation but communications, agriculture, and creating a vibrant living corridor that's connecting the continent. That's a result of a very focused approach on marshaling these resources.\nWe can't do it everywhere. And of course, our benefit, our value added is also getting the private sector in on the deal. We're never going to compete with China dollar-for-dollar on a state basis. We can bring the private sector in.\nThere are a few other things, Mike, that are important. The international financial institutions have to be more responsive to the needs of global majority countries. They - these countries have to have greater access to capital. There are many countries that are caught in a different kind of middle-income trap, where, as you know very well, they don't have access. We've worked to expand the access through reforming these institutions. Janet Yellen, others have done a great job on that.\nAnd then the whole question of debt and helping countries get out from under the debt that they've been burdened with, including from China, that, too, we've been making a difference on, and you see countries responding. But all of this has to be sustained.\nAnd one other thing. We have a lot of tools in the United States government. We've worked hard to bring them together so that they're actually acting together, like the DFC. And I think, as we're looking at it now, we're really starting to see the results, and we're starting to see countries that want to work, partner with us and with our allies.\nMR FROMAN: Let's switch over to Iran. Iran has lost its primary proxy, Hizballah, in terms of its effectiveness as a second-strike capability. Its missiles have proven to be quite feckless against Israeli, U.S., and allied partners' defense. Is it inevitable that they go nuclear now? Is that - that's the third leg of their deterrence and defense stool, with the other two having proven to be weak. How do you see that evolving? And what advice would you be giving to the incoming administration on how to develop the relationship with Iran?\nSECRETARY BLINKEN: Well, look, there's no doubt this has not been a good year for Iran, and we're seeing that play out every single day. And I think Iran has to make some fundamental choices. One choice it could make - and should make - is to focus on itself and focus on trying to build a better, more successful country that delivers for its people, which is clearly what most Iranians want, and to stop getting involved in these adventures - or misadventures - throughout the region and beyond. Now, whether it will be wise enough to make that choice, I don't know. But they desperately need to be making that choice, and they need to be focused on their economy, focused on growing the country, and delivering for people.\nNow, if they don't make that choice, they have some hard decisions to make, yes, about where they're going to go in the future to be able to sustain the kind of troublemaking that, unfortunately, they've been engaged in for many, many years. I don't think that a nuclear weapon is inevitable. I think this is something that may be more a question now because as they've lost different tools, as they've lost different lines of defense, sure, you're going to see more thinking about that. But the costs and consequences to them for pursuing that route I think would be severe, so I am hopeful that that remains in check.\nNow, I'm also biased - and we worked together during the Obama administration. The one problem that we successfully took off the table through the so-called JCPOA, the Iran nuclear deal, was the prospect of Iran getting to a nuclear weapon anytime soon by bottling up, tying up the fissile material, making sure their breakout time in producing enough fissile material for a bomb was pushed back beyond a year. Now that breakout time in terms of the production of fissile material is a matter of a week or two. They don't have a weapon, and the weaponization piece would take them some time, but the thing that we could have eyes on most effectively to make sure that they weren't moving in that direction - the fissile material that this deal put in a box - unfortunately, the decision to break out of that box I don't think, to say the least, was a wise one.\nSo we have to find a way to - the next administration is going to have to find a way to engage this, because the production of 60 percent enriched uranium gives them the capacity, at least in terms of fissile material, to produce multiple weapons' worth of material on very short order.\nMR FROMAN: And looking at the U.S. approach to this, we've tried sanctions, we tried engagement with JCPOA, we've tried sanctions again. What do you think - what influence can we have on Iranian behavior? And do you think there is the prospect of a negotiation of a new deal on the nuclear piece of this with Iran?\nSECRETARY BLINKEN: I think there is the prospect of negotiations, and, of course, it depends on what Iran chooses to do and whether it chooses to engage in meaningfully. And of course, the incoming administration will have to make a decision. President Trump last time around, in pulling out of the deal, said that he wanted, as he called it, a better, stronger deal. Fine. Let's see what's possible.\nMR FROMAN: He wrote a book about that. Yeah, \"The Art of...,\" right.\nSECRETARY BLINKEN: So let's see. I think that would be a better way to approach it. But look, one way or another this much I know: From administration to administration, whether it's ours, whether it's the Trump administration, whether it was the Obama administration, there's been a shared determination and a shared determination that remains to ensure that Iran does not get a nuclear weapon. One way or another, I am convinced that, just as our administration had that policy, the next administration will, too.\nMR FROMAN: Given the success that the Israelis have had in Lebanon recently, how fearful are you that they decide this is the time to clean up all the issues in the neighborhood and go after Iran?\nSECRETARY BLINKEN: I think, from Israel's perspective, the success that they have had in dealing a terrible blow to Hizballah and, of course, to Hamas in the wake of the horrors of October 7th - but also at great human cost to the children, the women, the men in Gaza who've been caught in this crossfire of Hamas's making, initiation - but the damage that's been done to Hamas, the damage that's been done to Hizballah, the damage that's been done to Iran, its air-defense capacity in the wake of the second direct attack on Israel - Israel's response - very focused, very calibrated, and very effective in taking out Iranian air defenses. That's put it in a very challenged position.\nSo from Israel's perspective, I think they're - they've accomplished very significant and important strategic goals militarily. But the question now is: How do you translate those into enduring political successes? How do you move from Gaza, where, by Israel's own account, they've achieved what they fundamentally set out to achieve in trying to ensure that October 7th never happens again, dismantle Hamas's military capacity - they've done that - deal with the leaders who are responsible for October 7th - they've done that. Now is the time, assuming we get the hostages back, to move this to another place, where they're not left holding the bag in Gaza. Because if they do, if they wind up holding the bag, they'll be dealing with an insurgency for years. And that's not in their interest.\nSo Gaza has to be translated into something different that ensures that Hamas is not in any way in charge, that Israel doesn't have to be, and that there's something coherent that follows that enables the governance, the security, the reconstruction of Gaza.\nWhen it comes to Lebanon and Hizballah, I think there's an extraordinary opportunity not only to have dealt with pushing Hizballah back, allowing Israelis who've been chased from their homes in the north - 70-, 80,000 - to go back home, as well as Lebanese to go back to their homes in southern Lebanon - not only to have that on a more effective, sustainable basis. Because remember 2006, after the war, the basis for ending the war was Resolution 1701 and the notion that Hizballah would pull back, wouldn't be a threat to the border communities in Israel, and of course it was never implemented.\nNow, as a result of the ceasefire agreement that we negotiated along with France, we're in a position where that problem can be solved. But the larger problem of Lebanon standing on its own feet, asserting its own sovereignty - that's now a much greater possibility than it's been. And so we want to see, obviously, the election of a president to fill that vacuum. We want to see the institutions of the state standing up and taking responsibility for the lives of Lebanese. That offers a much different and better prospect going forward, and it also means Israel doesn't have to push things any further.\nAnd Iran - so much depends on what we were talking about before. What are the fundamental decisions that Iran's going to make? And that will in part dictate what Israel and what others do.\nLast thing - apologies for going on so long. Look, there is a much different trajectory that we see embryonically possible for Israel and for the region, and for our interests, too. We saw it when Iran attacked Israel in the response - the response not only of the United States where for the first time ever we came to Israel's active defense, but we brought other countries along. And not just European countries; countries in the region. So you can see what the integration of the region could look like, including on the security side of the ledger, in a way that isolates Iran and really sharpens the choice that it has to make about its own future.\nThat's possible. You can see it. But to get there it requires two things. It requires, of course, a resolution to Gaza, which in turn would start to open the door to pursuing normalization with Saudi Arabia; and it requires a resolution to the Palestinian question. It requires a credible pathway to a Palestinian state, because Arab countries that have not yet normalized with Israel, starting with Saudi Arabia, need that, want that, expect that. The problem we have now is we have two extraordinarily traumatized societies in Israel and among Palestinians. And having that conversation is almost impossible in this moment. But I still believe fundamentally that we're going to have to get that conversation, because it really offers the prospect of something that Israel has sought from day one, which is to be fully accepted and fully integrated into the region and have enduring peace and security.\nFirst step: Got to resolve Gaza. And then the work that we've done and that we're handing off to the next administration, including on the prospect of normalization between Israel and Saudi Arabia - carry that forward. That's really the vision for the future, and I believe that one way or another, one day or another, we're going to get back to it.\nMR FROMAN: You and Jake Sullivan and Bill Burns have been indefatigable running across the region, trying to reach a ceasefire and a resolution and a release of the hostages. There's been recent reports there's been a little bit of progress, perhaps, on the Hamas side in terms of making some compromises. You've got 31, 32 days left. What percentage do you put on the prospects of reaching an agreement? Where are you spending Christmas and New Year's? (Laughter.)\nSECRETARY BLINKEN: So one of the things that we know is that for those of us old enough to have grown up with Charlie Brown, there's the Lucy and the football moment, when - (laughter) - Lucy puts the football down and Charlie Brown comes up to kick it, and Lucy pulls the football away. So I don't want to hazard a guess on this, because we've had a few of those. But here's why I think and hope this is a really meaningful moment in finally getting this across the finish line.\nWhat's been the main impediment? The main impediment has fundamentally been Hamas, and Hamas at various moments believing that it could get the wider war that it's wanted from day one, that it could get Hizballah in, that it could get Iran in, that it could get other Iranian-backed proxies in. Now it knows that the cavalry's not coming to the rescue, and it can't depend on - can't even really think about - that wider war, precisely because of what we just talked about. Hizballah can't and won't do it; Iran can't and won't do it. That, I think, has concentrated minds in - among Hizballah - Hamas, excuse me, leadership about needing to bring this to a conclusion.\nBut you're also dealing with an organization where decision making is very, very challenged, very difficult. Just that piece alone is hard, and the communications piece isn't easy. So you're also dependent on a small number of individuals who may not have the same pragmatic framework that we would bring to this.\nSo all of that said, look, I'm hopeful. You have to be. We're going to use every minute of every day of every week that we have left to try to get this done. But I don't want to hazard a guess as to how - what the probability is. It should happen. It needs to happen. We need to get people home. We need to get the ceasefire. We need to get people moving in a different direction, toward better lives, toward repairing the terrible damage that's been done. And I think the entire world wants to see that happen. We also can't have Hamas not only holding hostage the individuals that it took on October 7th, but literally holding the Palestinian people in Gaza hostage to its view of the future.\nMR FROMAN: Let's switch to Ukraine. First year of the war, really quite remarkable series of successes: the strategic use of declassifying intelligence, the expansion and strengthening of the alliance, the transfer of an incredible amount of materiel to the Ukrainians. Over the subsequent year, year and a half, things have slowed down, it's been more of a war of attrition. The administration's come under some criticism for doing too little, too late, or not letting the Ukrainians use the weapons in ways that they would like to, of being perhaps a little gunshy of Putin's saber-rattling - nuclear saber-rattling. The Ukrainians will tell you they went into Kursk in part to show the Americans that you can invade a nuclear country and it won't escalate. Is their criticism - have merit?\nSECRETARY BLINKEN: So I think as we look at the trajectory of this going back to before the Russian reinvasion of Ukraine, as you've said, quite remarkably we've - we were able to see this coming, we were able to warn the world, we were able to use the time effectively - use the time effectively first to try to prevent the Russians from going in, but even as we were doing that, to make sure that we, everyone else was fully prepared if and when they did. We got the weapons to the Ukrainians quietly well before the reinvasion. We did a big drawdown in September before the February reinvasion, another one right before the new year.\nOne of the results of that is that when the Russians did go in, the Ukrainians had in their hands what they needed to repel it, to repel the efforts to take Kyiv and to push the Russians back, push back about 50 percent of what they initially took in Ukraine. And then every step along the way, Mike, we've tried to adapt and adjust to the changes in the battlefield and the changes in Ukrainian needs.\nBut one of the things that I think gets lost in the mix is that it's never simply a question of, okay, what weapon system are we going to provide at a given time. It's also: Can they use it effectively? Are they trained on it? Can they maintain it? Does it fit into a coherent battleplan? And all of those questions need to be answered, and the President has had to answer them. And Lloyd Austin has done a remarkable job in bringing so many countries together around this effort to provide the Ukrainians with what they need.\nThe President has another responsibility that's unique. Any of us can give him advice, counsel, recommendations. We can minimize one concern, maximize another. But where the buck stops is at that desk. And it has been his responsibility to make sure that Ukraine has everything we can possibly provide it to deal with the aggression, but also to avoid a direct conflict with Russia. We don't need a direct conflict between nuclear armed powers. I think he's navigated that extraordinarily well. And it's very easy for anyone to say - oh, coulda, shoulda, woulda - but he's the one ultimately who has to bear responsibility for those decisions and the interests of our country as a whole.\nNow, where are we? I think we're in a place where if you look at what is success for Ukraine, I think we're very much on a path to success in this sense. First, what was Putin trying to accomplish? He was trying to erase Ukraine from the map. And you don't have to trust me on that; you can listen to what he himself said repeatedly. This was an imperial project and an imperial project that's failed. Russia's - Ukraine is not erased from the map - far from it.\nSecond, the country that is emerging as a strong, independent sovereign country - increasingly connected to Euro-Atlantic institutions, increasingly able to stand on its own feet militarily, economically, democratically as a result of a lot of work that many countries have done - that, if that's fully realized, is the ultimate rebuke of Vladmir Putin and his designs.\nNow, at this point, getting to a ceasefire, I think, would be a good thing if it can be done on terms that respect those fundamentals and if it has within it the necessary arrangements, the necessary assurances, the necessary commitments so that further Russian aggression can be deterred. Because any ceasefire, in the back of Putin's mind it will be: rest, refit, and reattack at the right moment. We need to make sure that, one way or another - and there are different ways you can do this - Ukraine has what it needs to really deter any kind of additional aggression from Russia and be able to carry forward the project of building the country.\nMR FROMAN: Now, the Ukrainians say that requires NATO membership. That's the only -\nSECRETARY BLINKEN: That's one way -\nMR FROMAN: - security guarantee that -\nSECRETARY BLINKEN: That would be one way to do it but not the only way. And -\nMR FROMAN: Let's talk about the other ways. They've felt like they've had security guarantees before -\nSECRETARY BLINKEN: Yeah.\nMR FROMAN: - going back to 1994 when they gave up their nuclear weapons.\nSECRETARY BLINKEN: The Budapest Memorandum.\nMR FROMAN: And felt like anything short of that, Russia will do exactly what you said - just refit and reattack. What's - the U.S., Germany, a few of the other NATO countries are standing in the way of Ukraine joining.\nSECRETARY BLINKEN: No, we're not standing in the way. We've put Ukraine on a path to NATO membership. And successive summits of the NATO Alliance have been very clear about that.\nMR FROMAN: Is that a near-term thing or -\nSECRETARY BLINKEN: So what - here's what we did at the last summit, because I think our focus has to be not simply on oratory policy, the things that we say - but what is it we're actually doing to move Ukraine down that path? We set up for the first time in NATO's history a dedicated command whose purpose is to help Ukraine along that path, to take the practical steps that it needs to take - in continuing to build and reform its military institutions, to continue to strengthen its democracy - that are necessary for membership. And we are moving Ukraine down that path. Now, ultimately, I believe, yes, Ukraine will be and should be in NATO, and Article 5 is the best guarantor we have.\nBy the way, just a quick parentheses on this. We have an Alliance now - a NATO Alliance that's obviously bigger than it was before, with two new members, that's stronger than it's been, that's better resourced, that's better positioned. And this, to me, is the single best guarantee against war, against conflict, against aggression. Because the unique bargain that NATO members make and that I know people forget and don't think about, understandably, is Article 5 - is the notion that an attack one is an attack on all. And that says to any would-be aggressor anywhere: If I take on one NATO member, I've got to take them all on. And I think that's the fundamental reason why you haven't seen Russia attack a NATO member and the fundamental reason why the Alliance has been the single best deterrent against expanded Russian aggression.\nSo yes, this is the - I think the best thing. But there are other kinds of assurances, commitments, guarantees that could be part of any arrangements that are made that I think would also have that kind of effect. For example, we have European countries that have talked about the possibility, if there is a ceasefire and a resolution, of having some of their forces along the ceasefire line to patrol it, to protect it, to ensure it. That wouldn't be a bad guarantee either.\nMeanwhile, we've put in place with two dozen countries now bilateral security agreements between those countries and Ukraine that are 10-year programs, 10-year commitments, to help Ukraine build its deterrent and defense capacity. As that continues to move forward, Ukraine will be stronger and stronger.\nAnd the losses that Russia has taken through this are absolutely extraordinary. The fact that Putin has been willing to send so many people into a meat-grinder of his own making - at some point there's a limit to that.\nAnd one of the things I think that's increasingly apparent is the accumulated cost and burden of the sanctions, of the export controls in Russia. We're seeing that pile up more and more and more. Everything that Russia is trying to do takes longer, is harder to get done, and costs more. And so many of the industries of the future that they're dependent on have been now devoid of the necessary inputs that they would need from around the world to really succeed.\nSo I think if you put those together, my objective now in the time that we have is to make sure that we give the strongest possible hand to President Trump to play if there's going to be a negotiation, to get a good one, to get a good arrangement, to get something that will allow Ukraine to move forward as a strong, independent country and that will deter future Russian aggression. That would be a good deal. It'd be a good deal for the Ukrainians; it'd be a good deal for Europe; it'd be a good deal for us.\nMR FROMAN: Do you feel Russia can agree to a deal that doesn't take Ukraine's NATO membership off the table?\nSECRETARY BLINKEN: I think it's very challenging for Russia to do that, but good, and one level that - let's have things that are useful in any kind of negotiation. Ukrainians will decide what they want to do about that future. And what I think we're hearing from President Zelenskyy and others is, as has been the case for some time, they're very much prepared to engage in a negotiation, but we have to have a just result and we have to have one that's durable. And it's not going to be durable if it's not fundamentally just, and it's not going to be durable if it simply opens the door to future Russian aggression a year, two years, five years down the road.\nMR FROMAN: China. China is now cited as the pacing challenge for all of our efforts of defense. You've been instrumental in developing AUKUS and the Quad and the trilateral cooperation with Japan and South Korea, all as ways of sort of building infrastructure in the region to offset Chinese dominance. How do you feel over the - looking back over the four years, how much better are we now in terms of a credible deterrent to China vis-a-vis Taiwan?\nSECRETARY BLINKEN: Well, I think there are two things, just to step back for one second before getting to Taiwan. First, the other thing that we've seen over these four years - and not by accident, by intent - was greater convergence than I've ever seen in the approach to China by our key partners and allies in Europe and in Asia.\nAnd if you look at not only what we say as our declaratory policy when it comes to China, but also look at what we're doing together in terms of de-risking, in terms of making sure that we're dealing with problematic technology transfers, in terms of dealing with over-capacity and unfair trade practices, increasingly you have an aligned, unified approach. If you look at the China strategies that key partners have put out, we could be exchanging talking points, exchanging speeches. It's one - almost one and the same.\nThat's a source of incredible strength, because if we're trying to deal with something that we don't like that China is doing and it's just the United States alone, we're 20 percent of world GDP. If we're doing it in a way that's aligned with Europeans and aligned with the Asian partners, we're 40, 50, 60 percent of world GDP - a much heavier weight that China has to take account of, and it does.\nAnd maybe the best proof point of the success that we've had in aligning our policies with Europe and with key partners in Asia is the fact that every single meeting that I've had with my counterpart Wang Yi almost inevitably starts with 30 or 45 minutes of a discussion - i.e. monologue - about - complaining about everything we've done to align all of these countries. (Laughter.) So it seems to me this is the best proof point that we've been very successful in building this kind of alignment, this kind of convergence.\nNow, Taiwan is in another way a really good example of this, because what does China say every time the word Taiwan comes up: Don't even mention it; it's no one's business but our own. What we've been able to do is, I think, open the eyes of almost the entire world to the fact that, no, fundamentally this is everyone's business, because were there to be a crisis over Taiwan, the entire world would be affected by it. You've got 50 percent of commercial container traffic going through the strait every day. You've got 70 percent of the microelectronics, of the chips being fabricated on Taiwan. If that's taken off the - off the grid, you've got an economic crisis that goes right round the world.\nAs a result, more and more countries have weighed in with Beijing in the last two or three years saying: Don't do anything; we have to preserve the status quo; you have to preserve peace and stability. And the demand signal coming from countries for China to act responsibly is more across the board and clearer and louder than, again, at any time that I remember.\nAnd it's another way also of showing the extent to which, Mike, we have broken down these silos, where European friends and partners were concerned about what was going on in their part of the world, those in the Indo-Pacific just in their part of the world, Middle East, Africa, et cetera, their part of the world. What we've seen increasingly - what we've been able to show increasingly - is the indivisibility of security. And as I said before, for the Europeans, when they see China, along with North Korea, helping to fuel the ongoing Russian aggression, they know that what's happening halfway around the world matters to them.\nNATO - we inherited a Strategic Concept, as NATO calls it - basically the blueprint that NATO Allies agree to for what the Alliance is going to be all about - that when we came in was 10 years old. The word \"China\" was not in the document. Now, of course, China is a focus, not because we want to take NATO out of area to the Indo-Pacific, but because the Indo-Pacific is coming out of area into NATO. So I think - from where I sit, at least - because we've been able to build that kind of convergence, that acts as a much greater deterrent.\nLast thing is this: China, of course, has watched very carefully and very closely how have we and so many others have responded to the Russian aggression against Ukraine. And one of the most powerful things that was said at the very outset of the Russian aggression was from the then-Japanese Prime Minister Kishida, who stood up strongly for Ukraine, even though this was happening half a world away and not something that preoccupied most Japanese on a daily basis. And he said at the time what's happening in Europe and in Ukraine today could be happening in East Asia tomorrow.\nThat powerful statement encapsulated the fact that we've brought countries together in very practical ways to show that we're going to stand together when we have an aggression, not only against a country and a people but against some pretty fundamental principles that we think are necessary to upholding peace and stability around the world.\nMR FROMAN: Perfect.\nI'd open it to questions now from the audience. Just a reminder that this is on the record. Please —\nSECRETARY BLINKEN: Oh, it's on the record. (Laughter.)\nMR FROMAN: In fact, it's being livestreamed, so please stand, identify yourself, and make it brief.\nYes, Suzanne Nossel.\nSECRETARY BLINKEN: Hey, Suzanne.\nQUESTION: Great to see you. Thank you so much for this. I'm Suzanne Nossel. When you're talking about this axis of authoritarianism, I noticed you didn't touch really on the question of ideals, human rights, democracy. And I understand why, because this has really hardened into a struggle over economics and security. And it seems as though the human rights and democracy agenda for multiple reasons has become very zero-sum. Democracies are themselves struggling. And I'm wondering kind of how and whether you see this fitting into the way that we wage the struggle in the years to come, and particularly how you would frame to the next administration whether and why a human rights, democracy, and values agenda matters and how it ought to fit into their interpretation of U.S. national security.\nSECRETARY BLINKEN: Suzanne, look, the President sought from day one to put democracy and human rights as a central and an important focus of our foreign policy. And we've worked to do that in a variety of ways, including standing up the Summit for Democracy and trying to bring democracies together, in some sense to shore each other up at a time when so many of the democracies, including our own, are challenged. And I think we've had some success with that, and democracies are always going to be our port of first call when there's a challenge that we have to face, a crisis we have to deal with.\nBut I also believe they can't be our only port of call, because so many of the challenges that we have to deal with, if we're going to deal with them effectively, also require bringing in countries that may not meet our definition of what is a democracy or countries that have human rights challenges - that we want to deal with - but also are necessary in helping us to solve the problem. We've built big and broad coalitions of countries that extend beyond the definition of democracy to deal with things like food insecurity, to deal with the fentanyl and synthetic opioid crisis that arguably is the - has been the biggest threat to Americans, more people between the ages of 18 and 49 dying from fentanyl overdoses than from a car accident, guns, a heart attack.\nAnd so to advance the national interests, yes, we start with democracies and we want to continue to shore them up. But that can't be, in my judgment, the exclusive club that we do everything with, because we simply won't get at so many of the things that we need to get at if we're actually going to be effective in solving problems for the American people.\nLook, everyone in this room is so well-versed in the benefits that a much stronger democratic world would bring to the United States, as well as to other countries. And that's not going to change, and I would hope that that continues to be a focus for any successive administration, and certainly that's what we're sharing with our successors. But we have to also, I think, be clear-eyed about how do we solve a given problem, who do we need solve it.\nOne of the things that we've done is to build different coalitions of countries. Yes, we've re-energized our traditional alliances and partnerships, but we've also built new ones. And as I said at the outset, we've tried to reimagine - I've called it - my team hates it when I call it this, because they think people's eyes glaze over - variable geometry. We have collections of countries, institutions, stakeholders of different shapes and sizes to deal with a given problem. And again, the foundation is almost always a group of democracies, but I think it has to expand beyond that. And that's the way we've approached it.\nMR FROMAN: In the back there, I see. Yep, behind Roy. Thank you.\nQUESTION: Hello, hello, thank you. I'm Ashley Ehasz. Secretary, I ran for Congress this cycle in Pennsylvania. I lost, so you can probably guess which side of the aisle I was on. But I was in the Philadelphia suburbs, so our swing - swing voters. And a lot of the conversations I had with them were around the perception that our foreign policy teams are elite and aloof and out of touch, and they didn't believe what we were doing.\nHave you engaged with this perception at all, particularly around hiring practices?\nSECRETARY BLINKEN: Look - (laughter) - as someone who initially grew up on the Upper East Side not far from here, who went to private schools, then spent a lot of time in Europe, wound up in the Ivy League, and I'm now in this job - well, only in America. (Laughter.) So I agree in part with the premise of the question. One of the things that we've worked to do, we've tried to do, and I think we need to do a better job at, is connecting what we're doing to the real and lived lives of our fellow citizens. Because if you don't do that, you're just not going to sustain support for the policies you're pursuing. So I feel that very strongly.\nAnd we continuously have to find better ways to talk about what we're doing, to communicate it, but also to listen to our fellow citizens about what it is they need, what it is they're looking for in their lives, and what it is we're doing that can help them achieve that.\nI mentioned before - we were talking about NATO and - an abstraction to just about everyone probably outside of this room. And we know none of our fellow citizens, none of us, want another war. We just got out of 20 years of having American forces at war. The President ended America's longest war - 20 years in Afghanistan - and I'm proud of the fact that he did that. We ended the Iraq War a decade or so ago. People don't want that.\nThen they see these - this focus on this Alliance, NATO, and they say, well, isn't that heading in exactly the opposite direction? The case I tried to make earlier is the case I think we need to make a better job in making to people, which is the best way to prevent a war, the best way to make sure it never starts in the first place, the best way to ensure that a country doesn't commit aggression, is to have countries come together and say we've got each other's backs, and if one of us is attacked, all of us will respond. And NATO is the best proof you can have that that kind of collective defense, that's the way you don't have a war in the first place. We need to do a better job of explaining that, explaining the fact that, for example, our NATO partners - President Trump has rightly said that other countries should be doing more. He's right about that. Well, you look at Ukraine. We've spent a lot of money on Ukraine and defending Ukraine, about $100 billion. Our allies and partners, they've spent about $150 billion doing it. You talk about burden sharing; this is the best example of burden sharing I've ever seen. And of course, by the way, it's important to explain to people the money that we've spent defending Ukraine, most of that was spent here in the United States in our own defense industrial base - manufacturing, building stuff that the Ukrainians need to defend themselves. Good American jobs have been a result of that.\nSo it's a long way of saying I think you're exactly right and we need to have an ongoing conversation about how do we have a better conversation. How do we make sure that we're really hearing what people are saying and that they can see that what we're doing, or at least trying to do, is an answer to what they're actually looking for.\nMR FROMAN: Yes, this gentleman right here on the aisle.\nQUESTION: Hi, (inaudible). Sorry. A quick question. How do you deter the Houthis?\nSECRETARY BLINKEN: That's a very good question. (Laughter.) With some difficulty. (Laughter.) Look, they have - the rise of the Houthis, the capacity they've developed - fully supported by Iran - has gotten them to a place where they have assets that have built up that they have not been shy about using and continue to use.\nNow, they've tied what they're doing to Gaza. My concern, I think our shared concern, is that even when we get to the point where the conflict in Gaza is over, the war in Gaza is over, they may well continue because they've put themselves on the world stage.\nNow, the developments, though, of the last weeks, particularly what, for example, they've just seen with Iran running out of Syria along with the Russians, with Iran not being able to ultimately help the - help Hizballah survive the onslaught from Israel, with Hamas, I think that's also sending a message to them that they can't count on their patrons to continue to support them and, if necessary, come to the rescue if they get in trouble. I think that's going to have a check on what they're willing to do, what they're going to keep doing.\nNow, we've put together a collection of countries that have tried to protect shipping. We've tried to raise the consciousness of countries not only in the region but well beyond of the damage that the Houthi actions are having to international commerce in real and meaningful ways to the lives of people, starting with people in Yemen. And some of that's having an effect.\nBut I think the Houthis have to look at - make this calculation: Can they really count on the ongoing support? Are they going to be out there alone? And some of what we're seeing now suggests that they may be looking to move in a different direction, because I don't think they want to be in a direct conflict with us, and if they keep doing what they're doing, they're going to have a problem.\nMR FROMAN: All right. Mark.\nQUESTION: Hi. Thanks. Mark Angelson.\nSECRETARY BLINKEN: Mark, good to see you.\nQUESTION: Mr. Secretary, say what you would, please, a little bit more about Syria, maybe in connection with Türkiye. And if you wouldn't, then maybe - then maybe climate change and its - (laughter) - no, no - and its impact on China in the Arctic. (Laughter.)\nMR FROMAN: You covered a broad menu, a broad swath. (Laughter.)\nSECRETARY BLINKEN: So when it comes to Syria, I was around during the Obama administration when we had to deal with Assad's horrors and brutality. And to see Assad chased out of Syria, leaving aside all the other complications that we now have to face, in and of itself is something that I'm not exactly shedding any tears over.\nThe big - the fundamental question now is this: Can Syria, can the Syrian people, take advantage of this moment, put their country on a better track, and to seize an opportunity for the first time in decades not to be governed by a dictator, not to be governed by an outside power, not to be governed by a terrorist organization, not to be governed by one sect or minority over another? That's the challenge. It's the opportunity, but it's incredibly, incredibly fraught.\nWe came together just a few days ago in Jordan, bringing together Türkiye, Jordan, Egypt, the Gulf states, Iraq, some of our European partners as well. And we laid out together some principles for what we expect going forward in Syria if what emerges in Syria wants to have the recognition, the support that it's going to need from the international community. So I think that was a very useful exercise in kind of laying out those expectations, the principles that we put out. At least it says to the new authorities in Syria or the emerging authorities: Here's what we need to have in mind if we're going to get the support and recognition that that that we want. And we're engaged with the groups that are emerging, including HTS.\nThe question that they have to ask themselves is this - or maybe the lessons that I think they have to have in mind is this. One is Assad. Assad's utter refusal to engage in any kind of political process is one of the things that sealed his downfall. So they should be thinking about that. Now, of course, the other thing that sealed his downfall is the fact that his patrons became very distracted of problems of their own making that we exacerbated - whether it was the Russians in Ukraine, whether it was the Iranians and their attacks on Israel and everything that was done in response, or whether it was Hizballah.\nThe other thing they have to ask themselves is the Taliban - there is a lesson there. The Taliban projected a more moderate face or at least tried to in taking over Afghanistan, and then its true colors came out. The result is it remains terribly isolated around the world. And so if you're the emerging group in Syria, again, if you don't want that isolation, then there are certain things that you have to do in moving the country forward and make sure you're moving it forward in an inclusive way, in a non-sectarian way, to deal with and protect minorities, to deal with some of the security challenges, whether It's chemical weapons, whether it's groups like ISIS.\nSo what we're trying to do now is to make sure, with many other countries, that we have this unified approach and that these considerations are front of mind for HTS and those emerging in Syria. No guarantees whatsoever that it works that way. You can certainly see a path forward where the country fragments. I think that would have bad consequences for the Syrians and for people beyond Syria.\nBut we have a real stake in this. We know from hard experience that what happens in Syria doesn't necessarily stay inside of Syria. And whether it's enabling a base for terrorism that gets exported, whether it's mass displacements of populations that have had impacts way beyond Syria, it really matters.\nAnd the last thing I'd say is this. One of the successes that President Trump had during his first administration was effectively completing the job that was started by the Obama administration in eliminating the territorial caliphate that ISIS was trying to establish. The final nail in the coffin was taking back Raqqa, and that happened under President Trump's watch. So I think President Trump will have a strong incentive to want to make sure that we're at least keeping a lid on ISIS re-emerging in Syria.\nBut the most effective way to do that beyond making sure that we keep whatever forces are necessary to do that, that we have our partners who are able - who have been working on doing that with us be able to do their jobs, is also to try to support Syria in this construction project of a new and better Syria. I'm saying all of that with eyes wide open. Really, really hard, but at least there is a moment here, an opportunity, that I don't think any one of us expected. What we saw before Assad fled was most people running toward - to Damascus to try to re-establish relations with Assad, thinking he wasn't going anywhere. Well, that was proven powerfully wrong.\nMR FROMAN: Yes, Rosen.\nQUESTION: Mr. Secretary, Mark Rosen. The Iranian regime is commonly considered to be very unpopular within Iran. I wonder if you could talk about whether the U.S. should adopt a policy of regime change by - in Iran, by the Iranian people. And if so, what should we be doing to support the Iranian opposition more to make that happen?\nSECRETARY BLINKEN: So from my perspective, first, the internal dynamics in Iran are complicated. And we're in many ways not necessarily the best source of a clear view on that, precisely because we, of course, don't have diplomatic relations; we've been disengaged. And I think there'd be a certain amount of pretense in saying that we know exactly what the dynamics are inside Iran. Of course, we get as much information as we can. We have friends and partners who do have a clearer and better understanding. We put all of that together.\nAs I see it, I think the country is very divided. I think what you've described certainly is reflective of at least half the population, but not the entirety of it. And there are profound differences, as you know, between urban and rural. There's a very conservative element in Iran that's significant in number that probably remains beholden to the regime. So I don't think it's quite as clear-cut as that.\nBut there's no doubt that a large percentage of people want a different future for their country. There's no doubt that that different future would be better for everyone. So the question is: What, if anything, can we do to advance that?\nI think if we look at the last 20 years, our experiments in regime change have not exactly been resounding successes. (Laughter.) So I think we have to be - have an appropriate degree of humility in focusing in that way on a problem. But focusing on everything we need to do to effectuate policy change, stop the country from doing things that are threats to our interests, as well as threats to our values - that, yes, has to be front and center. And we have clear security threats emanating from Iran, and we have clear values threats emanating from Iran.\nWhat we've tried to do, at different points in time, is, to the best of our ability, further empower people inside Iran who want a different future for the country - to be able to communicate, to be able to stand up, to be able to have some resources to do that. But I will be the first to acknowledge it's really hard to do from the outside. I think what's most likely to succeed ultimately is even more of the Iranian people deciding that the direction, the governance of their country is not delivering for them the results that they want, the future that they want. And at some point, that will, I think, reorient the course of the country.\nI just - from my perspective at least and from my own experience, I think that's hard to engineer from the outside. And you inevitably end up with unintended consequences, second and third-order effects that you got to be very careful about. So I think we have to keep standing up for what we believe in. We have to keep standing strongly against manifestations of Iranian behavior that run counter to our interests or the interests of our allies and partners. We have to stand strongly with those in Iran who want a different future. But I am very - I'd be very wary about trying to engineer anything from the outside.\nMR FROMAN: (Inaudible.) Get you a microphone here, coming in your direction. Right here. Stay seated if you like.\nQUESTION: Mr. Secretary.\nSECRETARY BLINKEN: Good to see you.\nQUESTION: You seem to be taller than I remember you. (Laughter.)\nSECRETARY BLINKEN: Bill, I've got a little bit of help here today.\nQUESTION: At some point, Putin's going to want to talk to the United States about serious stuff around Ukraine (inaudible). Does he know who talk to and how to get those doors open?\nSECRETARY BLINKEN: Good question. Look, I think the answer is yes, and certainly we tried. In advance of the Russian aggression, we made a full-court press, a full-court effort, to engage the Russians and engage Mr. Putin. In fact, even before - well before the Russian aggression - look, we were trying to get the relationship with Russia to a different place, one that was a little bit more stable, a little bit more predictable. President Biden, President Putin met in Geneva, had a lengthy meeting. This was well before the aggression. And that's what we were trying to see if that was possible. That's the direction we wanted to move things in. There was - this was near the beginning of the administration. There were so many others we wanted to be focused on and concentrating our time and resources on, not conflict with Russia, whether over Ukraine or anything else.\nUnfortunately, I think what proved out over the last three years is that Putin's had imperial designs for a long, long time, starting really close to home in Chechnya, going to Georgia, then to Ukraine in 2014, and now again to Ukraine in 2022. And this was never about real concerns that Russia or Putin had about Russia's security. It really was about the imperial design that Putin has. And we've had to contend with that.\nI think as we look at this, if we'd felt over the course of the last couple of years that Russia was in place where it was prepared to have a serious conversation about resolving Ukraine in a just and durable way, we would have been the first to have that conversation. I would have liked nothing more than to be able to have that conversation. Unfortunately, all the information we had told us that they just were not serious about it and it would be a waste of time.\nNow maybe we're at a point where those conversations could be more productive, and I hope that's the case, and I'm sure the next administration if there's an opportunity will try to have those conversations and see if we can get some kind of at least near-term resolution on Ukraine, assuming that's where the Ukrainians want to go, and maybe work through some other issues.\nNow, we've continued to talk to them in a variety of ways and get things done that were really important to us. We've gotten people back from Russia who they had falsely imprisoned to use as political pawns, and that continues to this day. We've dealt with issues as they've come up where we've had real concerns about the possibility they might - they were contemplating the use of a nuclear weapon, concerns about weaponization in space, other issues. And we've even had deconfliction of one kind or another, for example in Syria, over the years, irrespective of the otherwise breakdown in the relationship. But I think we - it would be good to get back to a place where we can have a productive conversation, but so much of it depends on whether Putin is prepared to go there.\nMR FROMAN: Mr. Secretary, you've been an incredibly effective defender of American interests, promoter of a greater world, of a stronger world. We're so grateful for you to be a member of the council and to spend some time with us today, and we're very grateful for your service. Thank you. (Applause.)\nSECRETARY BLINKEN: Thank you, Mike.",
  "word_count": 10871,
  "scraped_at": "2026-02-14T13:16:41.070228"
}