{
  "article_id": "551b892dd858",
  "url": "https://www.bordermail.com.au/story/8559006/albury-united-escapes-thrilling-win-over-boomers-fc-in-awfa/?cs=9679",
  "title": "Albury United escapes thrilling win over Boomers FC in AWFA . | The Border Mail",
  "date": "20240318T054500Z",
  "domain": "bordermail.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "League champions Albury United learnt an early lesson after escaping with a thrilling 5-4 win over Boomers FC in the opening round of the Albury Wodonga Football Association on Sunday.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Greens have won all three competitions over the past two years and looked in control after bouncing to a 3-0 lead over the Cup quarter-finalists.\nHowever, the home side produced a stunning comeback to draw level at 4-all, but in the final minutes Sajan Majhi grabbed his second for the match-winner.\n\"When we got 3-0 up, perhaps we thought we would cruise, but they fought back and got a couple of goals and that turned it into an arm wrestle, we learnt a lot out of it, ultimately,\" United coach Matt Campbell revealed.\nGenerally speaking, clubs which learn lessons during a similar comeback are on the losing side, so it again highlights United's ability to respond to a tricky situation.\nAfter Boomers fought back to 3-2, the visitors pinched another to grab a two-goal buffer, before Boomers levelled the scores.\nLast year's Cup star Melkie Woldemichael then ran through the middle of the ground and was fouled just outside the box, allowing Majhi to convert the free kick as it took a deflection off Boomers' defensive wall.\n\"Our forwards got some good chances and finished pretty well,\" Campbell offered.\n\"Dirck (Angalikiyana) was playing his first game and he got a goal, another first-gamer in Rhyce Hore battled really well in the midfield and our goalkeeper Trent (Irvine) did really well, he pulled off a couple of important saves at important times.\"\nMeanwhile, Myrtleford's Jake Miles broke the deadlock as the visitors scored a 1-0 win over Wodonga Diamonds in the competition's first game on Saturday night.\nElsewhere on Sunday, Wangaratta City's Jack Whiley scored a double in the 3-1 win over St Pats FC, Melrose FC pipped Albury City 2-1 and Cobram and Albury Hotspurs finished 2-all.\nMeanwhile in division one women's, Diamonds toppled Myrtleford 6-0, Hotspurs defeated Cobram 3-0, Albury United beat Boomers 1-0, while the Melrose FC-Albury City game was postponed.",
  "word_count": 354,
  "scraped_at": "2026-02-14T12:47:08.718293"
}