{
  "article_id": "552bbf37c947",
  "url": "https://www.oann.com/commentary/what-the-us-economy-can-learn-from-the-nfl/",
  "title": "WHAT THE US ECONOMY CAN LEARN FROM THE NFL",
  "date": "20230213T184500Z",
  "domain": "oann.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Theodore R. Malloch & Nicholas Capaldi\nFebruary 13, 2023\n(Views expressed by guest commentators may not reflect the views of OAN or its affiliates.)\nAt the pinnacle of all sport lies the Super Bowl.\nIt is the supreme – world championship game between the winners of the National and American Football conferences, which commenced way back on January 16, 1967.\nThis 57th year, the two best teams in football will contest for the Lombardi Trophy in Arizona. The Philadelphia Eagles vs. the Kansas City Chiefs. We come from Philly (albeit two different sides of the track, so to speak) but this is not about our local preferences. Cheese steaks, scrabble, pretzels, and cream cheese are pretty good inventions, so too are life, liberty, happiness, and justice for all, you’d have to admit—all hail from the City of Brotherly Love.\nThe NFL\nOur focus here is on the NFL as a model and exemplar for the entire US economy were we so willing to tear a page from its success.\nThe National Football League is a football league that consists of 32 teams, divided equally between conferences. It operates at the highest professional level of American-style football (soccer is another category) in the world. Each NFL season begins with a pre-season in August, followed by the 18 week regular season which runs from early September into January, with each team playing 17 games and having one bye week. Following the conclusion of the regular season, seven teams from each conference (four division winners and three wild card teams) advance to the playoffs. A single-elimination tournament culminates in the Super Bowl, which is contested in February, each year where one team emerges as overall champion.\nFormed in 1920 as the American Professional Football Association (APFA), it renamed itself the National Football League for the 1922 season. After initially determining champions through end-of-season standings, a playoff system was implemented in 1933 that culminated with the Championship Game until 1966. Following an agreement to merge the NFL with the AFL, the championship was titled — the Super Bowl and it is the ultimate game each season.\nThe NFL has the highest average attendance (67,591) of any professional sports league in the world and is by far the most popular sports league in the United States. The Super Bowl is also among the biggest club sporting events in the world, with a viewership of 200 million in the US and about 1.5 billion, worldwide. The NFL is the wealthiest professional sports league by revenue and the sports league with the most valuable teams, some valued individually at over $5 billion dollars. The NFL is a huge success story.\nThe product of the NFL is exciting football games, period. The league does a great deal to ensure its’ quality, optics, media, rules, safety, and governance. It knows the value of its franchise and the many teams that undergird it. It guards its’ reputation and the wealth it manufactures for its owners, teams, players, as well as the cities where it operates. And those cities come to play. Look at the costs invested down the years particularly in new stadiums, some public-private ventures, others paid for by wealthy owners. The new SoFi, in Los Angeles cost $5.5 billion. The Allegiant in Los Vegas, $2 billion, Met Life in New Jersey $1.6. And Tennessee is building their Titans a $2.2 billion wonder.\nThe product, i.e., NFL games, are promoted through two things: COMPETITION and EXCELLENCE.\nYou all know about “any given Sunday.” Any team can win any week and the games are typically close. That makes for excitement and rivalry. It brings out the fans and all that comes with it, from tailgates to merchandise. It sells big television contracts. The excellent quality of everything NFL is closely monitored and constantly improved. They innovate like mad. It just gets better and better.\nAs an example, they have worked to overcome injuries, improve helmet technology and head injury protocols. Sports medicine has become its own specialized field of innovation with consequences way beyond football.\nThe NFL is a real meritocracy (and 70% of its’ athletes are black). There are no quotas, handicaps, affirmative action plans, bribes, or favors. You have to be top-flight to get a spot, which you have to earn. The whole enterprise is run on the premise that the best players, performing as teams, are coached to win—full stop. They are motivated, skilled, and remunerated to do one thing and one thing only — win.\nThe NFL rewards winners.\nThe draft and the salary cap facilitate this deliberate competition. The way new players are selected is very rigorous. Players from colleges and universities are chosen according to speed, strength, and size for a very limited number of positions. They are ranked and selected by team management based on need and past performance. Then they try out to make the cut. The weaker teams get the first and early drafts. The salary cap in 2023, was put at $224 million per team. That’s a record for the highest salary cap in league history. It is an increase of 7.97 percent. The cap sets the upper limit the whole roster any given team can pay its’ chosen players. The payment to any single player is not predetermined which allows teams to manage their recruits and contracts according to a market based or star system.\nActually, the League cleverly uses colleges and universities to prepare people (talent) for the real economy—as players and adults. This system of professionalization and apprenticeship works well, sorting out the best and most talented players and coaches.\nTwo things are worthy of note. First, the NFL actually shows how colleges and universities can contribute to the national economy. This is something that no longer can be said about the rest of ‘woke’ higher education and massive student debt. Second, the order of the draft maintains competiveness. No one team can ‘buy’ the championship. No one team can be guaranteed excellence since teams must still evaluate potential and exercise prudence and judgement.\nThe NFL is not monopolistic. It combined with the old AFL and operates as a 501 ©6. New teams have been added on a selective basis but rarely. There is no government regulation that the teams already in the league must accept a new entrant – equivalent to subsidizing a particular competitor. It does not preclude other leagues; indeed, some have been attempted and failed. What looks somewhat closed is really designed to encourage major investment and commitment to a functional system (rules of the game do not preclude creativity; rules designed to please the customer and therefore make money). You need to start a league not just a team to have a product like the NFL, and that is not easy. This is a market with a win-win result. Everyone gets rewarded, fairly. With self-regulation by the producers, you see a capitalistic reward base economic model that is the envy of just about everyone, the world over. It works very well. So why not copy it across the whole American economic spectrum?\nThe governing board of owners (all with considerable skin in the game) is analogous to the government or its regulatory bodies. Nonpolitical in nature, the owners want the whole ship to rise and work closely together to make sure it does. It is by definition clubby and while some differences exist, they work together for a common goal. Historically, markets have self-generated their own merchant law.\nThe NFL as a body serves the interests of the owners and customers (fans) not its own private agenda. It secures its viability, good reputation, and future by pulling together even while competing vigorously on the field.\nTeams can be owned by an individual, a consortium, or even a municipality (Green Bay). Some are more profitable than others and have a bigger fan base but they all compete equally.\nIf the federal government ran the NFL we would have the opposite of what we experience today. It would be a total flop. Too many stakeholders would mess everything up, ESG would guide play, and there would be no competition, let alone a finale – Super Bowl. They would give out participation trophies to all.\nOne super team that always wins, chosen and constructed by the government, would be boring, repetitive, and dull. The teams would have to all wear battleship gray uniforms and change their names to something more correct. Congress could represent a different “designated” city each season (fairness – equity) to win and the referees (regulators) would make sure they won. Funding would go to the most woke or the most politically correct team independent of performance. We would in effect have DEI in football. Diversity (too many black athletes now represented and no women), and inclusion (more females and sexually-challenged or trans players) and more teams that would dilute the talent level—teams for every place. Think of the comparison between a government football experience and the NFL!\nOn this day, we should all celebrate the NFL. Root for your team in this year’s Superbowl and hope that this fantastic capitalistic and competitive model can spread its wings across our whole economy.\nNeedless to say, it would be a lot like the Eagles—Fly, Eagles Fly.\nTed Roosevelt Malloch is CEO of Roosevelt Global Fiduciary LLC. He served as Research Professor for the Spiritual Capital Initiative at Yale University, Senior Fellow Said Business School, Oxford University and Professor of Governance and Leadership at Henley Business School where he co-led the Director’s Forum. His most recent books concern the nature of virtuous enterprise, the practices of practical wisdom and “virtuous business,” the pursuit of happiness, the virtue of generosity and the virtue of thrift. His latest book is Common Sense Business, co-authored with Whitney MacMillan, former Chairman and CEO of Cargill, the world’s largest privately held company. He has served on the executive board of the World Economic Forum (DAVOS); has held an ambassadorial level position at the United Nations in Geneva, Switzerland; worked in the US State Department and Senate; did capital markets at Salomon Brothers on Wall Street, and has sat on a number of corporate, mutual fund, and not-for-profit boards. He was very active in the Trump campaign of 2016. Ted earned his Ph.D. in international political economy from the University of Toronto and took his B.A. from Gordon College and an M.Litt. from the University of Aberdeen on a St. Andrews Fellowship.\nWhat do YOU think? Click here to jump to the comments!\nSponsored Content Below",
  "word_count": 1757,
  "scraped_at": "2026-02-14T12:14:06.832866"
}