{
  "article_id": "5540b9ea6ccd",
  "url": "https://www.canberratimes.com.au/story/8468044/auckland-a-league-gets-steve-corica-as-canberra-fans-wait/?cs=14280",
  "title": "Auckland A - League gets Steve Corica as Canberra fans wait | The Canberra Times",
  "date": "20231221T084500Z",
  "domain": "canberratimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Canberra's A-League supporters are still waiting for the Australian Professional Leagues to green light a capital expansion, but fellow newcomer Auckland is set to get a major jump on the transfer market.\nSubscribe now for unlimited access.\nor signup to continue reading\nWith Canberra's bid still being finalised and investors being secured, Auckland has appointed Steve Corica as inaugural coach and the club's owners have promised to make a splash in the player market.\nCorica was announced as leader of the start-up side on Thursday, his first appointment since being sacked by Sydney FC earlier this year.\nThe 50-year-old has spent time overseas with Ange Postecoglou and Kevin Muscat since his axing from the Sky Blues.\nHe will take charge of the as-yet-unnamed Auckland club for the 2024-25 season.\n\"Steve is a proven winner, both as a player, as a head coach, and he plays an attractive style of football,\" said Auckland's American owner Bill Foley.\n\"His philosophy is aligned with what we want to achieve at the club, to be successful and to entertain the fans.\n\"He is passionate about developing young players to succeed in the A-League and we are confident his appointment will attract some of the best talent from around New Zealand.\n\"The next step is to start our player recruitment in the January transfer window.\"\nThe APL - which oversees the men's and women's A-Leagues - announced its plans to expand into Auckland and Canberra in March. But Auckland struck first when it secured its investor backing, jumping ahead of Canberra by more than a month in terms of planning, coaching and player recruitment.\nIt was hoped the Canberra plan would be finalised before Christmas to give the club a presence in the open market from January 1, but that looks increasingly unlikely. The APL had set mid December as its latest target.\nCorica won two A-League Men's championships, a premiership, and the Australia Cup during his time at the helm of Sydney and will reunite with Terry McFlynn, who has been appointed as Auckland's director of football.\n\"I am really excited about joining the new Auckland A-League club,\" Corica said.\n\"It has all the ingredients needed to succeed, both on the pitch and in the community.\n\"We want to build a club that is known for its attacking and entertaining style of football and Aucklanders are proud to call their own.\"\nFoley, who co-owns Premier League club AFC Bournemouth as well as having a stake in French Ligue 1 side Lorient, has an estimated worth of more than $1 billion.\nThe new owner has expressed his desire to win from the get-go and Corica's knowledge of the local transfer market could work in his favour.\nCorica's replacement at Sydney FC, Ufuk Talay, said he isn't worried by his predecessor raiding the Sky Blues' squad for talent.\n\"I'm happy for Stevie to get that role and there's a chance to build a team with a clean slate,\" Talay said.\n\"It's not easy building the team but Steve has shown those qualities during his time at Sydney.\n\"That's the nature of the game, players come and players go, coaches come and go.\n\"Players make decisions for what's best for their careers and whether that's to stay or move to another club.\"",
  "word_count": 545,
  "scraped_at": "2026-02-14T13:10:12.425039"
}