{
  "article_id": "55549d983255",
  "url": "https://www.palatinate.org.uk/chelsea-vs-durham-women-pre-match-press-conference/",
  "title": "Chelsea vs Durham Women pre - match press conference",
  "date": "20250122T141500Z",
  "domain": "palatinate.org.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea vs Durham Women pre-match press conference\nBy Dylan McLaren\nPalatinate was lucky enough to be invited to attend the Durham Women FC press conference prior to their League Cup tie against Chelsea FC Women. The game is set to kick-off at 6:45pm on Wednesday, 22nd January, and sees The Wildcats face the reigning Women’s Super League Champions away from home.\nManager Adam Furness was asked about the challenges his side will likely face in the game, the importance of their travelling fans, the potential of his side both in the game and on the transfer market, as well as much more.\nThis is what he had to say:\nOn how he and his players are feeling ahead of such a big match:\n“We are excited to be here. We are proud to be here. We are the only championship team that has got through to the quarterfinals. There is a lot of excitement ahead in terms of the trip to go and play arguably the best team in the world currently. There is probably a little bit of a mixture of excitement nerves. Off the back of Sunday’s result [a 2-1 loss versus Charlton], a little bit of a damper in the in the camp, but it is an opportunity for us to just park that for a little bit and have a real test with Chelsea.”\nOn if this is the toughest match his team have faced:\n“We are under no illusions as to what we are what we potentially coming up against. A collection of world class players, and the speed of play they play at is certainly going to be different to what we are used to playing in the Championship. But what a great experience and a great opportunity for some of our players who will not have come across that level of play before.”\nOn how the players are coping mentally with the fixture:\n“You are going to go and play against some of the best players the world. Go and give it everything you have got, test yourself against the best, and let’s see where we’re at.”\nOn whether the game will be damage limitation, or if he feels the side can get a result:\n“We have to be realistic in our approach. If we go all out and try and play expansive football and try and open the pitch up and take the game to Chelsea, we are probably going to come off slightly worse. I think we have got to be pragmatic in our approach. Go with a game plan that we think helps us to be solid in certain areas of the pitch, and then like any game of football, if we are bright on counter attacks, there’s potentially opportunities to go and exploit. Set pieces might come into play; there’s different ways to score a goal. We have got to try and use everything that possibly comes up in the game to hopefully get up that other end regularly and threaten their goal.”\nOn the gap between the Women’s Super League (WSL) and the Women’s Championship:\n“I think realistically, there is a big step; I do not think anybody is under any illusions there. I think even within the WSL itself, there is probably a collection of teams at the top end that are playing at a level above the rest. Another step then down into the Championship and the top end of the Championship, where currently there is probably seven or eight teams that are fighting to get into that bottom end of the WSL.”\nOn travelling fans heading to the game:\n“Anybody that is traveling to come and support us, thank you. It is a hell of a trip to go midweek. We had the Brighton game cancelled last weekend. We had travelled, and it was disappointedly called off shortly before kick-off. We know a number of fans had travelled down there as well. So, anybody coming down to Chelsea, we massively appreciate their support. Even for the fans, it is an opportunity for them to see some of these world class players up close, and to hopefully see our players stand up and really take the game to them.”\nOn what it would mean for the city to cause an upset:\n“You dare yourself to dream a little bit in terms of pulling off that sort of shock. Could we do it? Why not? The reality is, it is going to be an extremely tough task, but if we were to pull it off, we know that we have a potential home semi-final. If that were to come to fruition, that would mean a huge deal to everybody here, and a massive night in Durham.”\nOn how their cancelled game against Brighton on the 11th of January has affected their preparation:\n“Definitely not ideal. The weather that week was always sort of lingering in the background, and we were fingers crossed that the game would go ahead. To get down there, travel the night before and then to find out a couple of hours before kick-off that it was being postponed was obviously a huge disappointment. Then, there is the knock-on effect. We have now got back-to-back midweek trips down south. Chelsea, and then Brighton next Wednesday; that creates its own sort of issues. Then with the league games wrapped around those on every Sunday, it becomes a really intensive period for us.”\nOn how players are dealing with fixture congestion:\n“Spirits are high. We are trying to manage the load across the squad, potentially looking to strengthen the squad as we go as well, but it is what it is in terms of where we are at currently with the squad. The ambitions of the club is that longer term, we want to be trying to play the likes of Chelsea regularly in the league fixture, but part of our journey is obviously to appreciate that we are currently where we are. Let us have a go with Chelsea and see how big that gap actually is!”\nOn if the club will make any singings before the Chelsea game:\n“We are hopeful that something will be announced that adds to the squad that we are able to pick for from the Chelsea game [Shortly after the press conference, Durham announced the signing of Canadian goalkeeper Rylee Foster from WSL side Everton].”\nOn if the fixture reflects the clubs’ long-term goals (asked by Palatinate):\n“Absolutely. Trying to get out of the championship is going to be a massive task. We know how competitive that is. You just have to look at the teams that are in there that are fighting at that top end. Teams investing a lot of money into their squads, an have real squad depth. So just getting out of the championship is going to be a really difficult task, but one that we need to take on for the club. The long-term ambition of the club here is to be in the WSL and have these fixtures like Chelsea week after week.”\nOn what the team’s biggest strengths are going into the game (asked by Palatinate):\n“Set pieces will always give you an opportunity. We have players in our squad who are capable of delivering fantastic set book delivery. So, if we are able to utilize those, then that is one way. Being realistic, the way that the game is likely to go is that we will probably have to play a little bit of transition football and some counter attack stuff, but we have some players in our squad that are really set up to play that way. We can exploit with pace and forward runs. There’s different ways to win a game and score a goal.”\nOn if this game against Chelsea caused his players to lose focus in their loss against Charlton at the weekend (asked by Palatinate):\n“I do not think that Chelsea was on their minds. On Sunday, I thought we started really brightly. First 10, 15 minutes, we were really front footed. A couple of half chances and we did not quite manage to score. Then, I thought we sort of stepped back a little bit and got caught overplaying at times. We gave away a really soft goal just before half time which did not help. Then, second half again, I thought we had a really good spell. On the front foot, a lot of momentum, a lot of pressure. There is a really contentious issue in the game [it seemed that a Charlton player stopped the ball on the line with her hand, however, play continued], which, unfortunately, did not go our way. I think that would have really changed the game. If we would have scored a penalty there and played 11 versus 10 for the last 30 minutes or so, we are probably coming into this Chelsea fixture on the back of a win. There are fine margins in games, decisions that change things. I think if we zoom out a little bit, we are still in a really strong place. We have some big games coming up, and if we can turn those into some wins, we are right back at that top end of the table.”\nOn wether Chelsea could underestimate his side by looking ahead to their weekend fixture versus Arsenal (asked by Palatinate):\n“We could wish. The reality, even if they change some of their players, rotate around their squad, the twenty-five that they are picking from are world class players. Whichever way they choose to approach the game, we are going to be up against some fantastically talented players. The line-up that they put out against Charlton in the FA Cup was full of world class players, and they certainly did not underestimate that fixture. Being the club that they are, and the team that they are, I do not think that the approach for them is going to be anything other than 100% focus to get the job done. They will be full throttle trying to get in front as early as possible and try and take the game away from us. That is our responsibility to try and make sure that that does not happen and see where it goes.”\nImage: James Boyes via Wikimedia Commons",
  "word_count": 1721,
  "scraped_at": "2026-02-14T12:23:15.391450"
}