{
  "article_id": "556b26adf5aa",
  "url": "https://www.usatoday.com/story/news/investigations/2023/08/03/scott-shaw-san-jose-state-trainer-mistrial-sexually-abusing-female-athletes/70507027007/",
  "title": "Mistrial in sexual abuse trial of Scott Shaw , San Jose State trainer",
  "date": "20230804T024500Z",
  "domain": "usatoday.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mistrial in case of ex-San Jose State athletic trainer accused of groping female athletes\nSAN JOSE, Calif. –– The federal criminal trial of Scott Shaw, the former San Jose State University athletic trainer accused of groping female athletes under the guise of medical treatments, ended Thursday afternoon in a mistrial.\nAfter a nine-day trial and more than 21 hours of deliberations, a jury of eight women and four men remained deadlocked on all six counts.\nShaw, who worked as the Spartans’ sports medicine director and head athletic trainer from 2008 to 2020 and as an associate director for two years before that, had been charged with six misdemeanor counts of abusing his authority by touching female athletes’ breasts, buttocks and pelvic areas without a legitimate medical purpose.\nWhile the majority of the jurors had voted Shaw should be found guilty, two jurors – both female – held out on five of the counts, and one of them held out on the other count. The result was a hung jury.\nJeff Pickett, the jury foreman, told USA TODAY he felt those two jurors had already made up their minds that Shaw was not guilty from the moment deliberations began.\n“As much time as I spent in there, I still don’t understand from a logical perspective and a review of the evidence what the reasoning was,” Pickett said.\nBecause Shaw was not convicted or acquitted, the government can retry him on each count. Assistant U.S. Attorney Michael Pitman declined to say whether prosecutors would do so, but Shaw’s defense attorney, David Callaway, said, “It appears very much that they will retry the case.”\nShaw, who had waived his right to testify during the trial, declined to comment. He expressed no emotion after the result was announced, and he walked quickly past reporters in the hallway without making eye contact.\nThe jury’s inability to reach a unanimous verdict illustrates the extremely high bar for winning criminal convictions in sexual assault cases, even when a flurry of accusers come forward to report strikingly similar conduct.\n“I have a myriad of emotions – primarily rage,” said Caitlin Macky, a former San Jose State swimmer who was among the women who testified that Shaw sexually assaulted her. “I feel just kind of like, not to sound dramatic, but a hopelessness in humanity. Sitting in the court and watching other people testify and knowing what the other women have gone through, I just cannot fathom not believing a survivor.”\nOver days of emotional testimony, eight female athletes – representing five San Jose State women's sports teams – had taken the witness stand and described how Shaw reached inside their bras and underwear, rubbed their breasts, grazed their nipples and touched their bare buttocks and groins.\nTheir accounts spanned his entire tenure at San Jose State. Many of the women said they were shocked, confused and upset because they had sought treatment for sports injuries to other areas of their bodies, including their shoulders, knees and lower backs.\nOne by one, they testified that Shaw didn’t ask for consent before touching them, didn’t explain his treatments or why they were necessary, didn’t ask if they wanted a chaperone present and didn’t use any draping – all standard practice for athletic trainers. Prosecutors said Shaw also did not document any of his treatments.\nThe women said Shaw didn’t check in during treatments to make sure they were comfortable and didn’t follow up with them later. Some said Shaw scoffed when they questioned his techniques, reminding them he was the expert.\nOne of the women, a former San Jose State soccer player, said she reported Shaw’s touching to her coach within hours of reading a USA TODAY investigation in April 2020 that detailed the allegations against Shaw for the first time publicly. The news organization’s investigation was referenced repeatedly by attorneys and witnesses throughout the trial as a catalyst for women to report their experiences.\n“All I could think about when I first found out was – it was hard for me to imagine that my teammate was going through the same thing,” the athlete said on the witness stand. “Nobody deserves to feel uncomfortable and violated by somebody they were supposed to trust.”\nThe juror who held out on all six counts told USA TODAY that the evidence she saw “was not strong enough to make me believe that he commit(ed) the act.” She spoke on the condition of anonymity, fearing repercussions as the juror who stood in the way of Shaw being convicted.\nShe said that nothing in the testimony made it “obvious that he purposefully, intentionally” violated the women. Had she believed that happened, she said she would \"have no problem saying, 'That's a guilty act.'”\nIn defending Shaw, Callaway said the trainer might have been a poor communicator and might have deserved to lose his job, but he did not act with malicious intent. Callaway attacked the women who reported Shaw, suggesting they embellished their accounts for financial gain and had been primed by the government and the media to believe they were victims.\nAlluding to the settlement money several of them received, Callaway accused the women of “jumping onto a bandwagon when there is a pot of money at stake.”\n“Once you start feeling like a victim, it will color your recollection of things that happened,” he said, adding Shaw was the real victim – “a victim of his specialty.”\nCallaway seized on alleged inconsistencies in some of the women’s accounts during his closing argument. For instance, one athlete testified that Shaw placed three electrical muscle stimulation pads on her body to treat her injury, but former athletic trainers and expert witnesses testified that such treatments require an even number of pads.\nAnother woman testified that Shaw pressed his erect penis into her crotch while stretching her hamstring. Callaway called that account “complete nonsense,” pointing to the testimony of the defense’s expert witness, Brett DeGooyer, a doctor of osteopathy, who testified that her description was physically impossible and suggested that what she felt was Shaw’s knee.\nShaw’s defense leaned heavily on DeGooyer, who practices sports medicine at a community hospital in eastern Washington state. He testified that virtually all of Shaw’s touching was “potentially appropriate” and that he performs many of the same techniques, including trigger-point or pressure-point therapy, which entails applying pressure to one area of the body to release tension in another.\nDeGooyer said, however, that he could not ascertain from the medical records he reviewed whether Shaw’s treatments were necessary or advisable.\nDuring cross-examination by Pitman, DeGooyer said he had reached his hand inside a woman’s bra and massaged her breast as recently as the previous week, though he clarified he had obtained informed consent and conceded Shaw had not.\nDeGooyer also acknowledged that there was no evidence Shaw was familiar with any of the osteopathic manual medicine techniques he described. Additionally, he testified that if a trainer who worked for him exhibited Shaw’s same pattern of failing to ask for consent, offer a chaperone or document treatments of female athletes’ intimate areas, he might report him to the police or board of certification for discipline.\n“It depends,” DeGooyer said.\nThe defense’s other witnesses, including former San Jose State softball player Sarah Hanson and former San Jose State volleyball coach Oscar Crespo, contradicted aspects of two of the accusers' testimony, saying they did not recall the women disclosing Shaw’s touching to them more than a decade ago, as the women had testified.\nShaw’s defense and underlying conduct bear striking resemblance to that of Larry Nassar, the former USA Gymnastics and Michigan State University physician who sexually abused hundreds of young women, said Danielle Moore, a Nassar survivor and founding board member of the nonprofit group The Army of Survivors.\nNassar and his attorneys also argued that his treatments entailed trigger-point therapy and osteopathic medicine medicine practices. He was sentenced in 2017 to 60 years in prison on child pornography charges and in 2018 to another 40 to 175 years in prison for seven counts of sexually abusing athletes in his care.\nOver 150 women presented victim impact statements at Nassar’s latter sentencing hearing, including Moore. Neither of his cases, however, made it to trial. Nassar pleaded guilty both times.\n“It's unfortunate that women are harder on other women and that it takes so many women or men to actually get a conviction,” Moore said. “It’s very sad that you have to have so many people in order to be believed. That’s why people just don't come forward, because they are scared of not being believed.\n“I really hope that these women, these athletes know that they have support out there in the world and are believed.”\nOf the eight women who testified in Shaw’s case, the youngest is now 22 years old and the oldest 37. Many have spouses, children and careers. Three of their partners sat among the spectators on the wooden benches in the courtroom, taking deep breaths as their loved ones relived traumatic experiences from early adulthood and Shaw’s attorneys tried to poke holes in their accounts.\nSeveral women teared up during their testimony, saying they had trusted Shaw and tried to justify his touching by telling themselves he was experienced and knew what he was doing. Deep down, they said, they knew something was wrong.\n“They trusted him to do his job, to help heal them, to treat their pain and their injuries so they could get back to doing what they loved,” MarLa Duncan, an attorney for the prosecution, said in her closing argument. “Instead of doing his job, the defendant preyed on their trust to cop a feel.”\nThe athletes who prosecutors called to testify represent a fraction of the women who have accused Shaw of sexual misconduct. San Jose State has paid more than $7 million to 30 of his accusers and their lawyers.\nSeventeen members of San Jose State’s women’s swimming and diving team reported Shaw’s touching to school officials in late 2009. But the university’s human resources department and campus police cleared Shaw of wrongdoing, enabling him to continue treating – and allegedly sexually assaulting – athletes for another decade.\nFor most of the women who said Shaw sexually assaulted them, the statute of limitations for criminal charges in their cases has long expired.\nIn California, that limit is typically three years for felonies and one year for misdemeanors, including sexual battery. Local and state law enforcement officers have never charged Shaw with crimes.\nHowever, the U.S. Department of Justice charged Shaw in March 2022 with deprivation of rights under color of law – a federal crime with a five-year statute of limitations, which allowed prosecutors to charge him with conduct that occurred as far back as early 2017.\nProsecutors ultimately charged Shaw with six counts of sexually assaulting four female athletes during treatment sessions between September 2017 and February 2020. They alleged he violated the women's right to due process under the Fourteenth Amendment, which includes the right to bodily integrity, while acting in his capacity as a public employee.\nTo prove that crime, prosecutors had to establish for each count that Shaw abused the authority of his official position, that he knew what he was doing was wrong and that the acts he committed were “so egregious and so outrageous that they shock the contemporary conscience.”\nIn making their case, prosecutors called three current and former athletic trainers who worked with Shaw, including two from San Jose State and one from St. Mary’s College, where he worked previously. All said they had never placed their hands inside female athletes’ bras or underwear or rubbed their bare breasts, nipples, groins and buttocks to diagnose or treat an injury – and never would.\nCindy Chang, the chief medical officer for the National Women’s Soccer League and longtime team physician for the University of California, Berkeley, testified as an expert witness for the prosecution. Having reviewed the eight accusers' medical records from San Jose State and their statements to federal agents, Chang concluded that Shaw ignored proper protocols for evaluating, explaining and documenting treatments and had no legitimate justification for touching intimate areas of their bodies.\nAdditionally, prosecutors called as witnesses three former Spartans men’s basketball players who had dealt with similar injuries as the women but whose accounts of Shaw’s treatments differed dramatically.\nThe male athletes – Ivo Basor, Ralph Agee and Garrett Ton – testified that Shaw explained his treatments beforehand and checked in with them during. He asked if they preferred to do certain treatments on their own using a tennis ball, gave them treatment plans to take home and followed up with them later. Shaw never touched their nipples or stuck his hands in their shorts or in their underwear, they said.\nA silver, faceless mannequin wearing a sports bra and shorts acted as a prop for the women to show the jury how and where Shaw touched them, in particular the way he placed stim pads near sensitive body parts.\nFor instance, one athlete who complained of lower back pain demonstrated how Shaw put both of his hands down her shorts, laying them across her buttocks, to adhere the pads just below her waistband. Macky, who had suffered a knee injury, showed how Shaw reached his hand down from the top of her underwear through the bottom to place a pad on her inner thigh, grazing her pubic area along the way.\nAnother similarity between Shaw and Nassar, Moore said, are failures by university officials and police to stop him sooner. A November 2022 outside law firm review commissioned by the California State University system found both San Jose State’s 2009-10 human resources investigation and the campus police investigation inadequate.\nThen-human resources administrator Arthur Dunklin did not interview all of the 17 swimmers and divers who came forward for the 2009-10 investigation and did not interview any athletes on other teams. His final report, just two pages long, concluded Shaw’s treatment method – pressure-point therapy – is a “bona fide means of treating muscle injury.”\nBelieving the school’s investigation was flawed, San Jose State’s swim coach, Sage Hopkins, repeatedly re-reported the allegations to campus administrators, federal agencies, the NCAA, the Mountain West Conference and other entities over the next decade. In 2018, Hopkins asked the university’s Title IX office to reopen the case and provided a roughly 300-page dossier documenting the allegations, but the office ignored his report and did not retain a copy of the materials, the law firm review later found.\nThe university finally agreed to reopen the case in December 2019 in response to Hopkins’ efforts. This time, a different outside law firm concluded Shaw violated the school’s sexual harassment policy in the cases of all 10 women listed as complainants. But even that investigation was inadequate, according to a subsequent investigation by the U.S. Department of Justice’s Civil Rights Division, which found the school violated Title IX for more than a decade by failing to adequately respond to Hopkins’ reports.\nThe university entered into a settlement with the Justice Department in September 2021, which required it to contact all of the roughly 1,000 female athletes who played sports for the school while Shaw was employed, asking them to report any inappropriate touching they may have experienced during treatments with him.\nThrough that outreach, federal agents identified more of his alleged victims, whose experiences became the subject of the criminal charges. That included one woman who said he abused her in early 2020 – after the school had reopened its investigation, but while it was allowing him to continue to work.\nIn a statement issued after the mistrial was declared, San Jose State said that “while the lack of a verdict and definitive resolution is disappointing, it does not diminish the pain endured by the survivors.”\n“We can only hope that the process of sharing their experiences in court brings some measure of vindication to those who have been harmed,” the statement said. “What’s never been in question is the resilience and bravery of those who stood up to tell their stories. The painful experiences of our student-athletes have led directly to improvements to our Title IX resources and processes.”\nHad the university handled the complaints appropriately in 2009, the women wouldn’t have had to wait more than a decade for a chance at justice, Macky said. As painful as it would be to have to testify against Shaw again if prosecutors retry the case, Macky said she would be willing.\n\"I’m kind of at a loss of understanding, but I think the only silver lining here is that (prosecutors) are willing to retry,\" Macky said. \"It just doesn’t make sense to give up on it now.”\nKenny Jacoby is an investigative reporter for USA TODAY covering Title IX and campus sexual misconduct. Contact him at kjacoby@usatoday.com and follow him on Twitter @kennyjacoby.",
  "word_count": 2817,
  "scraped_at": "2026-02-14T12:16:37.668235"
}