{
  "article_id": "557c5c5d0585",
  "url": "https://www.jamaicaobserver.com/latest-news/reggae-girlz-get-25-m-assistance-for-olympic-qualifying-games-against-canada/",
  "title": "Reggae Girlz get $25 - m assistance for Olympic Qualifying games against Canada",
  "date": "20230918T210000Z",
  "domain": "jamaicaobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Reggae Girlz get $25-m assistance for Olympic Qualifying games against Canada\nKINGSTON, Jamaica- The Jamaica Olympic Association (JOA), in collaboration with the Jamaica Football Federation (JFF) and the Bob Marley Foundation, has pledged a total of $25 million to assist the senior Reggae Girlz in their two-legged Olympic Qualifying match against Canada.\nThe first game is scheduled on September 22 in Kingston’s National Stadium, while the second game is scheduled for September 26 in Toronto, Canada.\nRyan Foster, the JOA’s general secretary and chief executive officer, announced the sponsorship at a press conference held at the JOA offices a short while ago.\nFoster stated that $15 million will go directly to the Reggae Girlz campaign, with the remaining $10 going to player incentives.\nThese incentives include bonuses for goals scored, assists made, clean sheets, and team prizes for Olympic qualification.\n“When the call was made for the Reggae Girlz to attend the Central American and Caribbean (CAC) Games in 2018, it was the first time I would have met many of the Reggae Girlz who are not part of this group in Colombia.\n“I believe the response from President Michael Ricketts at the time was the formation of a squad that is now known as the Reggae Girlz now in terms of what they have represented. They have gone on to qualify for two FIFA Women’s World Cups, and now we are saying history again, legacy again, the Olympic Games,” Foster said.\n“So we’d want to thank the JFF, the Reggae Girlz, and the Bob Marley Foundation for their support of the Girlz. For far too long, we have seen that sport takes cash to care. But it also takes something more profound, that relationship, that love, that support framework required to allow our athletes to self-actualize, and we want to continue to be a part of history,” Foster added.",
  "word_count": 310,
  "scraped_at": "2026-02-14T13:51:04.871209"
}