{
  "article_id": "559bdfb26090",
  "url": "https://www.hola.com/us/entertainment/20250612837887/which-latino-playing-fifa-world-cup-halftime-show-j-balvin/",
  "title": "Which Latino is playing at the FIFA World Cup halftime show ? ",
  "date": "20250612T231500Z",
  "domain": "hola.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA's taking a page out of the Super Bowl playbook. When the 2025 Club World Cup final hits MetLife Stadium on July 13, it won’t just be about the fútbol - there’s a full-on halftime show in the mix, and it’s stacked. And there isn't just one performer, there are three.\nThe trio of diverse international icons taking the stage is Doja Cat, Nigerian singer Tems, and representing Latinos is the one and only J Balvin. The Colombian superstar will be front and center, representing Latin culture on one of the biggest sports stages in the world.\nIn a statement released by FIFA, J Balvin said, “From Medellín to MetLife – I’m honored to headline the first-ever halftime show of the FIFA Club World Cup final. It’s a historic moment – for me, for Latin culture, and for every kid who dreams big.”\nBalvin’s connection to fútbol runs deep. Back in 2018, his track “Positivo” was the anthem for Telemundo’s World Cup coverage. More recently, in March, he teamed up with EA SPORTS FC to launch a new football pitch in Medellín’s Manrique neighborhood as part of the FC FUTURES initiative.\nIn 2023, he and his girlfriend, Valentina Ferrer, celebrated in the locker room with Colombia’s women’s national team after they beat South Korea at the Women’s World Cup. They shared a video, dancing with them in the locker room to Karol G’s ‘Amargura,' calling it a win for all Latinos.\nHe’s keeping his love of soccer going in the family, too. His toddler Rio, whom he shares with Ferrer, is already getting a feel for the sport. In 2023, the two-year-old took his first soccer class, and Balvin shared hilarious videos live, reacting and narrating how he was doing. “Two left feet,” he joked at one point, clearly enjoying the moment.\nThe show is being curated by Coldplay’s Chris Martin, which adds another layer of anticipation. But for fans of Latin music and fútbol alike, J Balvin’s spot on the lineup as a reggaetonero who grew up in Medellín, taking the global stage at one of fútbol’s most historic moments, is an inspiration.",
  "word_count": 354,
  "scraped_at": "2026-02-14T12:35:09.801772"
}