{
  "article_id": "55bc17da3ab3",
  "url": "https://www.westernadvocate.com.au/story/8872186/womens-ashes-australia-eye-manuka-oval-canberra-crowd-record/?cs=2629",
  "title": "Women Ashes : Australia eye Manuka Oval Canberra crowd record | Western Advocate",
  "date": "20250121T193000Z",
  "domain": "westernadvocate.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Australia's all-conquering women's team has promised to continue its Ashes domination in Canberra, putting the celebration champagne on ice in a bid to inflict more pain on England this week.\nSubscribe now for unlimited access.\nor signup to continue reading\nA record crowd is expected at Manuka Oval on Thursday night for the second Twenty20 clash of the multi-format series and a game that looms as Australia's chance to win the Ashes.\nOfficials are expecting close to a sellout, warning fans to get their tickets early to avoid disappointment at the gate despite Australia's unbeaten start across the first four matches.\nFans have flocked to the stands so far and the Canberra turnout is expected to smash the city's women's cricket crowd record of 4131, which was set eight years ago also against England.\nIt's a fitting way to celebrate Australia's impressive form despite losing stars Alyssa Healy and Ash Gardner, who are both in doubt for the game at Manuka.\nCricket ACT boss Olivia Thornton said ticket sales were a clear sign of the growth of women's sport and Canberra's appetite for elite-level action.\nThe Ashes clash is the last match scheduled for Canberra for the foreseeable future. The ACT government's deal to host the Sydney Thunder in the Big Bash has expired, and Cricket Australia has not scheduled any matches at Manuka Oval for next season.\n\"We've known for a long time that people turn up for matches in Canberra - they love their cricket and their passionate about it,\" Thornton said.\n\"People are voting with their feet and showing up, which is fabulous. We're on track to set a record for a women's international match at Manuka Oval.\n\"The previous record is just over 4000 from 2017. We're going to absolutely smash that. And it's a reflection of where this women's team is at - they're absolutely a force. They're unbelievable.\n\"And there's everything to play for. Retaining the Ashes is lovely, but winning an Ashes is even better.\"\nCricket ACT has been buoyed by the success of elite cricket this season. The Prime Minister's XI game against India attracted a strong crowd for an exhibition match and the two Big Bash games also had impressive turnouts.\nThe women's Ashes will build on that after Australia retained the Ashes with a win in the first T20 match in Sydney on Monday night.\nThe players had a muted celebration after the game with two T20s and a day-night Test match still to play before the trophy is officially handed over.\nThat's bad news for England, who are scrambling to stay motivated and in the contest after a disastrous start to the series.\nAustralia has enjoyed an injection of youth, with Georgia Voll making her T20 international debut in the absence of Alyssa Healy.\n\"Obviously it's a bit of a relief to retain the Ashes but we're not finished yet,\" Voll said.\n\"Everyone just had dinner and we headed home and then we got on a bus [to get to Canberra]. Everyone was pretty pleased, but we're not done yet.\n\"A clean sweep [would be lovely], but our next game is in Canberra and if we can get that win we'll head on to Adelaide.\"\nAustralian captain Healy and all-rounder Gardner are still under an injury cloud and it's unclear if they'll be fit to play at Manuka. The Australian team won't train in Canberra before the game, and coaches could opt to give Healy and Gardner extra time to recover to be any hope of playing in the Test match from January 30.\nThe silver lining to their absence is the rise of the next generation of Australian talent, including Voll. The 21-year-old made her one-day international debut last year and scored a century in her second match for Australia, but has had minimal cricket before her call on Monday night.\nAussies hopeful Gardner will play second Ashes T20I\nAustralian veteran Beth Mooney believes Ash Gardner could play in the Ashes' second Twenty20 International match but a \"flat\" Alyssa Healy faces a less clear path back from injury.\nFoot and calf injuries respectively ruled international stalwarts Healy and Gardner out of Monday's 57-run T20 defeat of England at the SCG that ensured Australia would retain the urn.\nGardner was diagnosed with a low-grade calf strain following her player-of-the-match performance in last week's third One Day International and replaced in the middle order by Grace Harris.\nMooney felt Gardner's scratching was \"precautionary\" and hoped she would be back to face England in Canberra on Thursday night, when Australia can secure a series victory.\n\"From all reports she (Gardner) is looking all right,\" said Mooney after scoring 75 runs from 50 balls at the SCG.\n\"Obviously there's a couple of days now between this game and Canberra so we'll have an opportunity to reassess with her and look at how she's feeling.\n\"I'd say it was pretty precautionary, just with what's ahead in the rest of the series with two more T20s and a Test match. She's obviously disappointed she didn't play tonight but looking long-term I think there's some big games to come.\"\nHealy will consult with specialists over the coming days and faces the prospect of a longer lay-off with her latest injury blow.\nAhead of Monday's game, Australia's captain reported soreness in the foot she originally injured during the T20 World Cup last year, making a late start to the WBBL with the Sydney Sixers as a result.\nHealy then had her latest Sixers campaign curtailed by a knee injury that went on to sideline her from last year's ODI series against India.\nLong-time teammate Mooney said the squad would rally around Healy following the fresh setback.\n\"As you can imagine, she's pretty flat,\" she said.\n\"She doesn't want to miss any games for Australia and unfortunately for her, she's missed a few in the last few months.\n\"We'll put her arm around her, wait and see what the SSSM (Sport Science Sport Medicine) staff say and what the prognosis is.\n\"We'll be keeping a close eye on making sure she's okay mentally but also doing all the right things with SSSM as well.\"\nThe Perth Scorchers' wicketkeeper in the WBBL, Mooney deputised for Healy behind the stumps on Monday night and looks likely to reprise that role in Canberra.\nBut the 31-year-old was unsure whether she had it in her to keep wicket in the one-off Test match to be played at the MCG from January 30; in all of Mooney's seven Test match appearances to date, Healy has been the wicketkeeper.\n\"I don't think I'll be able to walk after if I have to keep,\" Mooney quipped.\n\"We've got lots of players that can step into different roles and there's some good players outside of this group that could play a role if required.\n\"We'll wait and see what the prognosis with Alyssa is first and foremost and go from there.\"",
  "word_count": 1156,
  "scraped_at": "2026-02-14T12:19:25.456575"
}