{
  "article_id": "55cfad63e881",
  "url": "https://www.90min.com/talkingtransfers/barcelona-arsenal-in-talks-keira-walsh-fee",
  "title": "Barcelona and Arsenal in talks over Keira Walsh fee",
  "date": "20240619T101500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Barcelona and Arsenal in talks over Keira Walsh fee\n- Arsenal closing in on signing of Keira Walsh\n- Midfielder could leave Barcelona after successful two-year stint in Catalonia\n- Barca in line to bring in Laia Aleixandri from Man City\nKeira Walsh is edging closer towards a move to Arsenal from European champions Barcelona, sources have told 90min.\nThe England international signed for the Catalan side from Manchester City in September 2022 in a world-record deal believed to be worth £350,000.\nNews of Arsenal making a move for the midfielder first broke at the end of last week, with Walsh entering the final year of her contract at Barca.\nSources have told 90min that should Walsh be sold, Barcelona would look to recoup as much of their original transfer fee as possible in a bid not to lose out financially, but there is no suggestion Arsenal will pay close to the original fee because Walsh only has a year left on her deal.\n90min understands that the Gunners have been working behind the scenes on a move for Walsh for months and have been waiting for the right time to initiate club-to-club contact.\nThe move would seriously benefit Arsenal, whose midfield took a hit earlier this month after Victoria Pelova was struck down with a ruptured ACL while playing for the Netherlands.\nArsenal were targeting Walsh long before this happened, but Pelova's injury gives them an extra incentive to bring in an experienced midfielder ahead of next season, and they could boast among some of the WSL's finest options in the middle of the park with Kim Little, Lia Walti and Kyra Cooney-Cross all at the club.\nBarcelona are already lining up reinforcements in the event of Walsh's departure. The midfielder's potential exit from their squad is expected to unlock the transfer of versatile Man City star Laia Aleixandri.\nThe Spain international has been with the Cityzens since 2022, following her move from Atletico Madrid.",
  "word_count": 326,
  "scraped_at": "2026-02-14T12:52:15.735409"
}