{
  "article_id": "55d4d46ff372",
  "url": "https://www.walesonline.co.uk/news/wales-news/locked-up-criminals-justice-caught-33067716",
  "title": "Locked Up : The criminals justice caught up with in December",
  "date": "20260104T051500Z",
  "domain": "walesonline.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Locked Up: The criminals justice caught up with in December and what happened to them\nThese are the faces of the criminals who have been jailed for the most serious crimes in Wales in the past month\nHere are the faces of 88 people who have been jailed for the most serious crimes in Wales in the past month. They include a woman and a former solider she was having an affair who were given lengthy prison sentences for plotting to kill the woman's husband in order for them to be together.\nThe list also includes a former boxer who killed his friend with a punch, leaving him to bleed out on the kitchen floor. Another man, an NHS worker, was sent down for sexually assaulting two patients at the hospital he worked at. There were also two women who, while masked and hooded, raided a corner shop with a knife and demanded money from the lone member of staff.\nOnce again there is a shocking number of men who were jailed for crimes committed against women. They include an ex-football club chairman who exposed himself and sexually assaulted multiple women. A judge said he made himself \"a sexual nuisance to women\".\nA council worker was also jailed after he subjected people in a shop to a tirade of vile racist abuse and told them to \"go home\" and \"get back on the boats\".\nYou can find a round-up of the criminals jailed in November here.\nHere are the criminals and their crimes.\nMichelle Mills and Geraint Berry\nA woman and the former solider she was having an affair were each sentenced to 19 years in prison for plotting to murder the her husband. Michelle Mills and Geraint Berry hatched a plan to get rid of Christopher Mills so they could be together, and the couple discussed arrange of options from putting poison in his food to hiring a hitman to kill him before settling on a preferred method.\nThe plan was put into effect in September last year when two masked men armed with handguns - Berry and fellow veteran Steven Thomas - burst into the couple's caravan near Newcastle Emlyn and attacked Mr Mills. The intended target managed to disarm the intruders who fled into the night.\nIn the statement read to Swansea Crown Court Mr Mills described how he was \"devastated\" to learn of the background of the incident, and the of \"calculating\" nature of what was planned. He said he has been left suffering with anxiety and stress, adding: \"This has pretty much ruined my life.\"\nThomas Griffiths\nThe former boxer punched a father-of-three and \"left him for dead\" as he bled to death on the kitchen floor. The 12-year-old daughter of the victim said her \"heart has been broken into a million pieces\".\nThomas Griffiths, 34, killed handyman Christian Dean, 36, who was found dead at an address in Ynyshir, Porth, on June 26. Griffiths fled the property in Graig Road and called a friend, telling her he had hit Mr Dean. He could later be heard saying \"I've just killed someone\".\nA sentencing hearing at Cardiff Crown Court heard Griffiths had been drinking at pubs in Ynyshir before meeting up with his friend Mr Dean at the Union Jack Ex Servicemen’s Club, known as “The Bomb”. He was described as acting \"angry and aggressively\", while Mr Dean was described as \"happy and bubbly\". They were later seen leaving the pub together.\nSentencing him to 11 years' imprisonment, the judge told Griffiths: “You punched Mr Dean, killed him and left him for dead. When you left him, you knew or believed he was dead. You did not tell anyone and did not call for assistance, instead you set about getting away from the scene.”\nIeuan Crump\nThe former NHS worker was jailed for nine years after being found guilty of sexually assaulting two patients at a Welsh hospital. Ieuan Crump, 27, worked as a trainee health worker at the Grange Hospital in Cwmbran in August 2021.\nCrump assaulted two different patients on different occasions while performing bladder scans as part of his role. Crump had denied all charges against him and his defence barrister Marian Lewis described him as a “man of impeccable character”.\nHowever, after less than three hours of deliberations a jury returned to court and delivered unanimous guilty verdicts. In total, Crump was found guilty of nine charges of sexual assault, including three counts of assault by penetration.\nSending him down, the judge said: \"You manipulated extremely vulnerable women in significant amounts of pain, had taken extremely impactful pain medication to acquiesce and allow behaviour you knew you would be able to undertake in private.\"\nBethan John and Jessie Thompson\nWhile masked and hooded, the two women raided a corner shop with a knife and demanded money from the lone member of staff. The shopkeeper grabbed a plastic milk crate to defend himself from Bethan John, 25, and Jessie Thompson, 31, who subsequently fled empty-handed, discarding the knife in a hedge as they made off.\nWhen the pair were located by police they told the officer they had been planning to hand themselves in after the weekend. Sending them down, a judge at Swansea Crown Court said the courts would always act to protect vulnerable shop workers.\nThe victim said it was difficult to put into words the level of fear and anxiety the incident had caused. He said he had been left feeling scared whenever people entered the shop but said he had to keep on working.\nPeter Rees\nHe was jailed after he threatened to cut off handyman's testicles later stabbed a pensioner.\nPeter Rees, 67, plunged a kitchen knife into the chest of an 81-year-old man in a seeming revenge attack after wrongly coming to believe his victim was dating his partner. Rees had gone to live with his girlfriend and her pensioner friend after being evicted from his housing association flat when he pulled a knife on a maintenance man who was fixing his dripping tap and threatened to cut off his testicles.\nHe was on bail for this offence when he stabbed the pensioner.\nA judge at Swansea Crown Court described the facts of the case as \"disturbing to say the least\". He then told Rees that the only difference between the offence he committed - wounding with intent to inflict grievous bodily harm - and murder was \"luck\".\nMichael Mathews\nHe was previously given a life sentence for stabbing three strangers at a party. After returning to the community, Michael Mathews, 56, threated a woman with a carving knife outside a block of flats and has been jailed once again.\nMathews was out of prison on licence when he swung the blade at the woman during the course of an \"argument or discussion\" between a group of people. The 56-year-old later tried to run away from police, discarding a large carving knife as he fled on foot.\nSending him down, the judge said Mathews has a \"disturbing history of violence with a knife\".\nRhys Lewis\nHe drove his ex-partner to consider suicide by unleashing a deluge of abuse towards her. Rhys Lewis, 33, stalked his partner after the breakdown of their relationship as a result of his \"jealous and abusive behaviour\", a court heard.\nLewis sent a barrage of abusive voice messages to her phone, calling her \"simple fat c***\", and a \"f****** fat slob\", and repeatedly turned up at her home. The abuse left the victim considering whether to \"end it all\" after Lewis told her he would \"watch her little world crumble\".\nThe woman had previously reported an assault to the police and it was at that point Lewis started stalking her. Cardiff Crown Court said the defendant left 278 voice messages on the victim's phone within a four month period, which were abusive in nature, despite the victim changing her phone number multiple times.\nNicholas O'Connor\nThe ex-football club chairman who exposed himself and sexually assaulted multiple women was locked up and put on the sex offenders register. A judge told Nicholas O'Connor he had engaged in \"purposeful, deviant sexual conduct\" and made himself \"a sexual nuisance to women\".\nO'Connor's sexual offending was carried out in various locations in Swansea, Carmarthenshire, and Merthyr during 2024. The 35-year-old exposed himself to a woman and sexually assaulted her at a wedding venue in Carmarthenshire; tried to kiss a woman in Murton, Gower; exposed his penis to a woman and sexually touched her at a sports venue in Morriston; exposed himself to women working in a shop on Merthyr High Street; exposed himself to a young woman walking in a street in Morriston; exposed himself to a woman in the car park of the Asda supermarket on Swansea Enterprise Zone; and exposed himself to a woman in the car park of a One Stop shop in Morriston.\nKane Evans\nHe repeatedly plunged a kitchen knife into a stranger outside a social club in an attempt to kill him. Kane Evans, 20, stabbed his teenage victim a total of 10 times to the chest, abdomen and arm, with the wound to the stomach penetrating so deeply it severed his intestines.\nThe victim subsequently needed a 10-and-a-half hour operation to remove part of his bowel to repair the damage and he has been unable to play rugby since. In a statement which was read to Swansea Crown Court, the victim said he had been unable to play rugby since the unprovoked attack, and he feels \"lost\" without the sport.\nKane was given a 22-and-a-half year extended sentence for attempted murder after stabbing the young rugby player.\nMichael Dumbuya\nThe \"professional enforcer\" who was in possession of a sawn-off shotgun carried out a horrifying attack on an innocent man who he mistakenly believed had taken kilograms of cocaine. Michael Dumbuya, 37, and two men brutally beat his victim and filmed himself standing on the man's chest, saying: \"Where's my food?\"\nDumbuya travelled from London to Blackwood to carry out the terrifying assault after he had been employed by a wholesale drug dealer based in Columbia to use violence and to intimidate the victim, who they mistakenly believed was responsible for the loss of 6kg of cocaine.\nHe was sentenced to a total of 14 years and five months imprisonment.\nChristopher Moore\nHe smashed a glass bottle and used it to cut a man's face which left him with a permanent scar and needing 40 stitches. The assault was unprovoked but the attacker, Christopher Moore, told a trial the victim and others had made fun of his Irish accent but the judge said this wasn't the case.\nChristopher Moore, 31, and his victim Nathan Cheshire had both been staying at the Three Saints Hotel in Llantrisant when the assault occurred on June 10. Mr Cheshire and others were sitting on a wall in the car park and the defendant was sitting on his own a short distance away drinking.\nMoore was seen to move purposefully away in order to arm himself with the bottle and smash it, before walking up to the group and asking if anyone had a cigarette. He then set upon Mr Cheshire with the broken bottle and struck him a number of blows to his head and to his arms, as the victim attempted to cover himself.\nGavin Davies\nThe TikTok prankster launched an unprovoked and ferocious attack on a man in a shop after he began smashing up the store and shouting: \"I wanted to go back to prison\". Garin Davies, who frequently posts videos on TikTok under the name of Ruthless Roofers, punched and bit his victim after becoming intoxicated following his release from prison and engagement earlier that day.\nA number of posts from the 38-year-old showed him pretending to collapse in restaurants, diving in canals, and playing pool with a crutch. He has amassed more than 31,000 followers.\nOn August 14 he ran into a corner shop in Merthyr Tydfil before launching the attack. His victim described Davies as a \"monster\" and said he was \"fighting for his life\" during the incident.\nKenneth Crane\nHe locked a woman inside a house, demanded to see her phone and then raped her, a court heard. Kenneth Crane, 43, from Barry, left his victim feeling suicidal after subjecting her to months of abuse.\nOn one occasion he forced her to perform oral sex on him and raped her. On another, he held a kitchen knife to the woman’s face and threatened to harm her if she did not give him her phone. He also threw a cup of coffee at her, made her clean it up, and then strangled her up against a door.\nCrane also threatened to share private images of the woman on social media. He was sentenced to 15 years in prison for his \"depraved\" actions.\nSharon Wathan\nThe account manager stole over £240,000 from the company she worked for while it was forced to make redundancies and struggled to make ends meet following the pandemic. A court heard that Sharon Wathan, 55, had worked for CMU Management for a substantial period of over 24 years and ran the payroll management and had sole responsibility over invoices.\nA review of the pensions at the company in 2024 uncovered discrepancies over how much Wathan was receiving from the company compared to other employees. There were also two payrolls under her name, she had claimed she'd worked extra hours and overtime which she hadn't worked, and had been using petty cash receipts and keeping the money.\nThe overall loss to the company equated to just over £247,000. The court heard the fraud had had a \"massive\" impact on the company which was described as a local, family-run business.\nLukman Oyofo\nHe plied a teenage girl with alcohol before raping her in his flat after promising he would call her a taxi. A judge told Lukman Oyofo that his victim had been at a stage in her life when she was \"entering the adult world and experimenting with alcohol\" and said he had an \"ulterior motive\" in supplying the teen with drink.\nIn a statement from the victim read to the court in person, the teenager said the actions of Oyofo had had a \"tremendous impact\" on her whole life. She said she suffers with bad dreams from which she wakes feeling frightened, and she said she is now taking tablets for anxiety and to help her sleep.\nJason Stafford\nHe was the owner of three which became dangerously out of control and attacked a woman as she was carrying her six-day old baby. The mother was left with a cut to their head after being bitten and clawed. She described feeling \"the worst pain had ever experienced\" and required multiple operations and skin grafts.\nOne of the dog's claws caught the baby's head and the baby was bitten, but fortunately the baby's injuries were relatively minor.\nThe three dogs belonging to Jason Stafford, 49, were destroyed after the savage attack in Cardiff. Stafford was sentenced to a total of two years imprisonment and banned from having dogs for 10 years.\nDevon Wildgust\nHe sent a video of himself masturbating to someone he believed was a 14-year-old girl just a quarter-of-an-hour after meeting her online. Devon Wildgust, 22 contacted two profiles on social media in a matter of days and sent them a series of sexual messages and requests, unaware he was really chatting to decoy accounts being run by so-called paedophile hunters.\nA judge at Swansea Crown Court said he was \"constantly surprised\" that people were continuing to appear before the courts for such offending given how skilled the police and those running decoy accounts were at identifying them, and given the repercussions for defendants which often included \"being hounded from the community where they live\".\nDuring a conversation with the decoy which quickly turned sexual, Wildgust sent a video of himself masturbating, and when the decoy sent a picture supposedly showing the 'girl' in her school uniform, he replied: \"I wish I could rip that uniform off and make love to you\".\nDamien Shearer\nHe subjected his partner to a terrifying ordeal after holding a knife to her throat and hitting her to the arm with a hurling stick. Damien Shearer, 45, later apologised to her and asked her to promise not to call the police before walking off with a knife in his sock.\nShearer has been out drinking with the victim at a rugby club in Newport when he became angry when she said she wanted to go home. He threw one set of keys to her house but unbeknownst to the victim, he later found them and went home while the victim called out an emergency locksmith at great cost to change the locks.\nUpon entering the house she went up to the bedroom and pulled back the duvet to see Shearer holding two steak knives. He pinned her down on the bed and held the knives to her throat while threatening to kill her.\nKurtis Ball\nThe council worker subjected people in a shop to a tirade of vile racist abuse and told them to \"go home\" and \"get back on the boats\". Kurtis Ball, 24, continued to use offensive and racist language even after being arrested and then went on to threaten and assault a police officer.\nHe was also heard shouting \"Wales!\" and: \"F*** the f****** mosques\". . When a woman intervened to try to calm the situation the defendant subjected her to abusive sexual language and called her a \"slag\".\nSwansea Crown Court heard 24-year-old Ball was subject to a suspended sentence at the time of the offending after he and his father attacked customers and staff at a Swansea city centre pub when told they couldn't take their pints out onto the pavement. Sending him to prison, the judge said: \"You simply have learned nothing. You have run out of chances.\"\nCourtney Harris\nHe hit his partner in the head with a wine bottle while they were spending the night at a hotel and chased after her when she got into a taxi. After forcing himself into the vehicle Courtney Harris, 32, told the driver: \"I'm going to smash her head in.\"\nHarris and the victim were staying at a hotel in Cardiff when he accused her of being unfaithful. He slapped her a number of times to the face.\nIn a victim personal statement read to the court the victim said she now suffers with anxiety and is afraid to leave the house.\nKai Lewis\nHe carried out sex acts on children when he was under 18 leaving the victims feeling suicidal after the ordeal, with one saying it ruined her life. Kai Lewis, now 29, carried out a number of sexual assaults against his first victim, which began when she was of primary school age and he was in his mid-teens.\nOne of Lewis' victims did not realise what he did to her was wrong until they received sex education in school. The court heard that for the second victim, it wasn't until a sleepover that she understood what he had done was not normal.\nNicholas Anderson and Rebecca Welton\nThe drug-dealing couple were caught and later jailed after police pulled over their Range Rover. Nicholas Anderson and Rebecca Welton were found with a stash of cocaine, more than £800 in cash, and a so-called burner phone while a search of a rented property being used by the couple turned up weapons including a knife, an \"old revolver\", and further cash.\nA judge at Swansea Crown Court described class A drugs as a \"scourge on society\" and said while it was clear Anderson was the \"leading light\" in the couple's operation, his partner had been a \"willing, enthusiastic participant\"\nChristopher Palmer and Ceri Gibson\nThe two men were \"prowling the streets\" late at night looking for vulnerable people to rob. When Christopher Palmer and Ceri Gibson identified a target they \"befriended\" him and, after seeing how much money he had in his pocket, led him away from CCTV cameras and robbed him.\nSwansea Crown Court heard the pair had done something similar to another person some eight years earlier in almost exactly the same spot. The victim said he was shocked to learn he was not the first person the pair had robbed, and he said they were \"not safe to be walking the streets.\"\nNicholas Mitchell\nHe raped a woman he encountered during a family trip to Tenby. Nicholas Mitchell went to the Pembrokeshire seaside town with his daughters as Covid lockdown restrictions were being eased in May 2021 and met his victim in a pub.\nSwansea Crown Court heard that after meeting his victim, the 60-year-old attacked her in a dark alleyway where he sexually assaulted her before raping her. He then walked off and left the woman in a \"distressed and dishevelled state\".\nSending him to prison, the judge said Mitchell had obviously \"taken a fancy\" to his victim when they met and had subsequently carried out a \"violent, callous assault\" on a lone woman before walking off and \"discarding her without a thought\".\nJason Maddocks\nThe former solider suffering with a \"PTSD episode\" led police on a high-speed drug-fuelled pursuit which included him driving along the hard shoulder of the M4 at speeds in excess of 100mph and racing through a motorway service station. The chase came to an end when Jason Maddocks drove into an airfield and went off-road before abandoning the car - and the vulnerable missing woman who had been his passenger - and taking to his heels.\nA judge told 36-year-old veteran Maddocks that he had shown an \"absolute disregard\" for the safety of others. He also said it was only by luck that nobody had been seriously injured or killed by the defendant's driving. He was to 14 months in prison and given a driving ban.\nKelly Hopkins and Sion Harrison\nTheir drug dealing was exposed after a queue of people using a cash machine led police to them. Eagle-eyed police officers recognised the people waiting to get money from the machine as known drug users, and following them led police to a car being used by dealers offering cocaine, crack, ketamine and heroin.\nSending dealers Kelly Hopkins and Sion Harrison down, a judge at Swansea Crown Court told them he was not going to lecture them, but said he hoped they would come to understand the harm drugs were doing to communities in Swansea.\nKaelum Lane\nHe lost control of his car and crashed off the road between horse riders and a group of cyclists, miraculously avoiding both. Kaelum Lane's car ended up on its roof in the middle of the road after driving up an embankment and rebounding off a wall.\nThe 27-year-old tested positive for cocaine at the scene but then refused to provide a sample of blood for testing. The court heard Lane had previous convictions for multiple driving offences.\nDaniel Merriman and Jake Dighton\nThe two men launched an assault on one of their ex-partner's new boyfriend after a fallout on the phone. Daniel Merriman, 33, and Jake Dighton, 32, both from Llanelli, were jailed for their roles in the incident.\nWhen Merriman and Dighton saw Dighton's ex-partner with her boyfriend in a park, Merriman became \"immediately aggressive\". The court heard Merriman hit and kicked the victim to the face and head on a number of occasions, knocking him to the ground. Merriman got him in a headlock and Dighton joined in.\nWhen the victim's friend approached the pair, Dighton glassed him, causing him to suffer superficial head lacerations.\nBrian Armstrong\nThe father threatened to \"stab up\" his son and later waved a kitchen knife at him after encountering him in the street. Earlier that day, Brian Armstrong, 55, also left messages on his son's phone saying \"come and have a go if you think you're hard enough\".\nArmstrong had fallen out with his son, Lee Bowen, as well as his daughter and ex-partner and was described as acting \"aggressively\" towards them before the attack in August 2023.. Mr Bowen said he is concerned that when Armstrong, who was sentenced to nine months imprisonment for his actions, is released he will pose a \"significant threat\" to him and his family.\n\"I do believe he's capable of seriously assaulting someone,\" he said.\nKallum Mills\nThe driver led police on a 120mph chase during which he rammed a police car and performed doughnuts on a football field. Kallum Mills led police on three separate pursuits over a six month period which saw him racing through residential streets in the dead of night with headlights turned off, going through red traffic lights, going off-road onto footpaths, \"goading\" police officers while driving around playing fields, and driving at a police dog handler and his dog.\nMills has seven previous convictions for 20 offences including dangerous driving and driving while disqualified. The 23-year-old's barrister told the court his immaturity \"shone through\" in what had been episodes of \"appalling driving\", and she said his own family had said that \"he effectively behaves like the children in the family\".\nKeiron Harper\nThe teenager approached a man near a busy food festival and pointed a handgun at his head. Kieron Harper then lowered the weapon to the ground and fired it before raising it to his victim's head again. It was at this point that a steward at the festival intervened and shouted at the gunman.\nHarper, 18 responded by raising his middle finger to the steward, pulling up his hood, and walking away. Swansea Crown Court heard that he had bought the weapon - a Beretta air pistol - with the proceeds of his government Child Trust Fund.\nHarper was sentenced to three years detention in a young offenders institution.\nJames Liddle\nThe driver hit a pedestrian as he was crossing the road after he had kidnapped his ex partner and was speeding while inhaling gas from a balloon. The victim suffered a significant wound to his head and lost part of his middle finger.\nJames Liddle, 23, drove to his ex partner's home in Newport after sending her abusive messages concerning access to his daughter. He arrived in a Volkswagen Golf in the early hours and told his ex partner to get into the car before pulling her by the hair.\nHe was angry and erratic while driving, and was also inhaling gas from a balloon. The woman heard a \"loud bang\" and saw the windscreen smash but Liddle continued to drive at speed. The man Liddle hit was later found in a pool of blood by passers-by.\nLewis Dight\nHe was involved in a disturbance in the street in which men armed themselves with weapons to confront each other following a dispute over a dog lead. Lewis Dight - who initiated the violence by hitting his victim Jamie Glover on the head with a metal pole - subsequently went on the run and was found hiding in a \"cubby hole\" in the base of a bed.\nSentencing him to custody in a young offenders institution, a judge described 20-year-old Dight as \"someone who resorts to violence and threats with weapons\".\nRobert Stainer\nHe was jailed after making a series of lurid threats to his ex's new partner. Robert Stanier contacted the man via the professional networking site LinkedIn and told him he was going to \"destroy\" him and that he had associates based in Liverpool who were \"watching his every move\".\nStainer and his former wife separated in 2020 and she then \"moved on with her life\", something Stainer \"had difficulty accepting\". He had previously been given suspended sentence and made subject to a restraining order in 2024 after being convicted of harassing his ex partner and her new boyfriend.\nThomas Jones\nThe farmer who kept cattle in poor conditions and left ailments untreated was jailed and banned from keeping animals for a decade. Inspectors swooped on Thomas Jones' farm near Whitland after getting an anonymous tip-off about the carcasses of dead cows which had not been disposed of properly.\nAs well as cattle being kept in poor conditions, the inspectors found a blind and underweight dog living among piles of rubbish. Such was the condition of the dog and the level of its suffering, the animal had to be put down.\nThe court heard similar problems had been found on the farm some two years before the visit, with the farmer ordered to improve conditions for his animals.\nDafydd Evans\nHe used dating app to recruit men from abroad to work as prostitutes at a massage parlour he ran in Cardiff and took 50% commission from their sexual services. Dafydd Evans, 61, was also found in possession of indecent images of young boys, and took trips overseas in order to abuse children.\nEvans made in the region of £40,000 from the illicit venture which saw him contact vulnerable men from Ukraine and Brazil on Grindr and employed them at his massage parlour in Cardiff. He did this under the guise of a legitimate business but he exploited the men, by taking half of their earnings.\nSentencing him to 45 months' imprisonment, the judge told Evans he was \"no more than a common pimp.\"\nMohammed Ahmed\nHe pushed his former-partner into the road and told her he hoped she died. Mohammed Ahmed has a long history of assaulting, abusing, and harassing his ex and had already served a prison sentence for strangling her.\nCardiff Crown Court heard that the 36-year-old has repeatedly broken a restraining order against his former partner - on one occasion climbing into her property through a window, and approaching her in the street as she walked around Cardiff shouting and screaming at her.\nDuring one of the meetings Ahmed grabbed the woman and pushed her into the road near the Angel Hotel telling her he hoped she died, while in another he tried to pick her up in a shoulder lift while \"demanding that she show him some respect\". He was given another jail sentence for his actions.\nKonrad Jones\nThe serial offender tried to knock down his ex-boss with a stolen car. Konrad Jones, from Cwmbran, went on a crime spree on the night of May 7 after flying into a drunken rage.\nCardiff Crown Court heard the 29-year-old had binged on alcohol before attacking his then-girlfriend at her home. He went to her bed to wake her, accused her of cheating, called her a \"fat b***h\", and grabbed her by the throat.\nJones took his partner's car and then tried to run over his former boss. No explanation for this was heard in court other than that he had previously \"fought with his employer\".\nJones was also sentenced over a separate incident, from July 2023, when he an accomplice Tristan Chapman took turns to beat a defenceless man with a metal baseball bat. He was a 32-month jail term.\nCarl Thomas\nHe was previously jailed for wounding his girlfriend but when he got out of prison he assaulted her again. Carl Thomas, 44, was initially imprisoned in February last year after drunkenly knocking his partner out with a punch that broke her eye socket.\nThe assault led to the end of the relationship, but when Thomas came out of prison he continued to terrorise his ex. North Wales Police said he tried to control her by \"searching through her personal belongings and calling her place of work demanding to know where she was\".\nHuw Young\nHe repeatedly strangled his partner after she messaged male friends and smashed up her phone while saying \"The only way to get to you is to smash your phone up\". After assaulting her, Huw Young, 57, told her: \"If you call the police, I will seriously beat you bad before they get to you\".\nHuw Young, 57, had been in a relationship with his victim for a year and was violent towards her on a number of occasions. In a victim personal statement read to the court, the victim said: \"The incident has completely lowered my confidence and trust in people.\"\nLisa Regan and Philip Jones\nThe former husband and wife were escorted off an easyJet flight when police arrested on them on suspicion of drugs offences. Body worn police footage released by South Wales Police showed an officer speaking to Lisa Regan, and her ex-husband, Phillip Jones, both of Swansea, as they sat in their plane seats after landing back in the UK after a trip abroad.\nRegan, 53, and Jones, 44, were later jailed for overseeing a drugs operation supplying large quantities of cocaine to dealers in Wales. They had laundered the cash they had obtained by supplying drugs to dealers through a café in Blaenymaes.\nPictures found on mobile phones owned by the couple showed Jones cutting up a kilo of cocaine.\nTracy Lewis\nHe was sent to prison after he was caught buying large amounts of drugs from Regan (above) and running his own operation in the Ammanford area.\nTracy Lewis, from Llandybie, Carmarthenshire, has been jailed after pleading guilty to multiple drugs offences.\nKareem Abdo\nThe drug dealer who was involved in the supply of cocaine was found in possession of machine gun bullets during a police raid. was found in possession of three bullets which could be used in self-loading pistols or sub machine-guns. Kareem Abdo, 30, later told police he had learning difficulties and people \"took advantage of him\".\nDaniel Drabble, Ian Biddyr, and Ashley Williams\nThe trio were jailed for their involvement at the top of an organised crime group which was sourcing large quantities of cannabis - including from the US - and distributing it across West Wales. The gang laundered tens of thousands of pounds of profit through online cryptocurrencies as well as banking huge sums of cash. Police also recovered a kilo bar of silver during their investigation.\nThe court heard that at the head of the operation was 38-year-old year old Daniel Drabble who sourced large quantities of cannabis from the US and Britain and then \"directed, organised, and participated in\" the distribution of the drug across West Wales.\nThe police investigation identified Ian Biddyr as being Drabble's \"trusted lieutenant\" in the operation - the 47-year-old was responsible for storing multi-kilo quantities of cannabis as well as laundering some £200,000 through his bank account. The court heard that in the boot of an Audi car parked on his drive police found a suitcase of cannabis worth almost £49,000 at street-deal prices.\nThe court heard 40-year-old Ashley Williams' role was to receive packages of cannabis from the US and to handle tens of thousands of pounds in drugs money as well to exchange cash into cryptocurrency which he then forwarded to Drabble.\nPatrick McGinn\nHe and his partner carried out a brutal attack on a man in the street by repeatedly punching and kicking him to the head and stamping on his groin, a court has heard. Patrick McGinn and his then-partner Olivia Lewis then simply walked away, leaving their victim on the ground. The pair were arrested a short time later having been tracked down with the help of CCTV.\nSwansea Crown Court heard that while on bail for that attack McGinn launched a serious assault on another man by repeatedly hitting him with an object in an attack which left the victim bleeding heavily from head wounds. McGinn was sentenced to 51 months in prison while Lewis was given a suspended sentence.\nRyan Axton\nThe robber assaulted an acquaintance and rode off on his electric bike after drinking alcohol and taking cocaine following a funeral. The bike was never recovered.\nRyan Axton, 33, approached his victim Gareth Foster-Wells in Newport on September 7 as he rode past The Alexandra pub on his Boardman electric bike. The defendant initially asked for a cigarette before attempting to get on the back of the bike.\nAxton became aggressive when the victim said he could not give him a lift and he began swinging his arms towards the victim before a struggle ensued. He punched the victim to the left side of his face, causing him to stumble backwards, before making off with the bike.\nLeon Ley\nHe is back behind bars for failing to tell police where he was living. Leon Ley, a former member of an organised crime gang, failed to comply with a court order designed to stop him re-offending.\nThe grave digger turned drug dealer was sentenced to more than 11 years in prison in 2021 for his part in a criminal enterprise. They trafficked hundreds of thousands of pounds worth of cocaine from London to south Wales, and for his part Ley was subsequently made subject to a serious crime prevention order.\nAlexander Campbell\nHe was jailed for assaulting two police officers who were responding to reports of domestic assault. Alexander Campbell, 30, from assaulted the officers whilst they attempted to arrest him for injuring a woman. All three people attacked by Campbell sustained injuries, swelling and bruising.\nNicholas Mann and Kyle Morris\nThe two men were caught smuggling drugs into a crisis-hit Welsh prison using a drone. Nicholas Mann, 34, and Kyle Morris, 24, were jailed after a package containing illicit substances was recovered from the grounds of HMP Parc in Bridgend.\nAfter an abandoned car was found in the area, police officers conducted a search during which they observed a drone delivering a package to the prison yard before returning to the common land. They then spotted Mann and Morris fleeing the scene.\nDaniel Ellis and Lee Hanbury\nThe two men with \"appalling\" records for dwelling house burglaries went on a late night spree targeting houses in Swansea. After trying multiple properties Daniel Ellis, 34, successfully stole a car and a wallet, leaving the owner unable to feel safe in his own home.\nEllis tried to break in to multiple homes while Lee Hanbury kept a look out. During sentencing, the judge said the pair \"trawled the area looking for properties you thought you could safely enter without being apprehended\". \"\n\"This is frankly quite appalling, I don't know the last time I saw a record this bad for dwelling house burglaries,\" the judge said.\nPeter Yendell\nThe dealer was jailed after he was caught using his vehicle workshop as a front for his involvement in the wholesale supply of class A and B drugs. Peter Yendell, 37, was also found in possession of an imitation firearm.\nEvidence on his phone revealed he was involved in a large-scale drug operation across south Wales. A search of the Yandell's vehicle workshop in Tredegar revealed significant quantities of cocaine and cannabis, as well as the imitation firearm.\nDaniel Niewiadomski and Samantha Turner\nHe was wanted for robbing a convenience store when he was found hiding in an attic - and refused to come down to waiting officer until he had finished smoking his crack pipe. Police had been looking for Daniel Niewiadomski after he brandished a wine bottle at a shopkeeper and assaulted him while his accomplice Samantha Turner held the shop door open for him. When she was arrested she was also found to be in possession of a knife.\nDaniel Allen\nThe burglar broke into a man's house in the dead of night and \"made himself at home\" in the property. Daniel Allen smashed his way into the victim's house while the homeowner was away and trashed the place while drinking the cans and bottles of alcohol he had taken with him.\nHe then stole a haul of items including irreplaceable objects left to the victim by his late mother. Allen's advocate told Swansea Crown Court that Allen has 76 previous offences on his record and has been jailed for 17 shoplifting offences this year alone. He went on to add that Allen is \"simply unable to cope in the community\"\nJoshua Tobin and Joshua Chappell\nThe two young drug dealers were caught by police who had intelligence linking the car they were in to vehicle thefts. Despite the best efforts of people who stopped officers from following them, Joshua Tobin and Joshua Chappell were arrested and a subsequent examination of their phones revealed what they had been doing.\nNewport Crown Court heard both men - who are aged 19 and 21 - have previous convictions for trafficking drugs, with one of them being on a suspended sentence for dealing when he was caught again.\nJim James and Thomas Janes\nThe father-and-son team of cowboy builders bullied, intimidated and scammed homeowners out of hundreds of thousands of pounds. Jim James and his son, Thomas James, targeted people across south and west Wales - many of them elderly and vulnerable, and some in poor health - leaving a trail of misery, debt and shoddy work behind them as they extorted money from customers.\nSwansea Crown Court heard that when the pair were questioned or challenged about what they were doing they would become aggressive and confrontational, and in one case a customer was threatened with a \"gypsy war\" unless money was handed over.\nJailing the pair of eight years each, the judge told them their behaviour had been \"marked by a cruel callousness\" and said it was clear they had \"no regard for the impact on decent people whose lives have been shattered\".\nMatthew Moore, Matthew Hatherill and Jamie Colburn\nThe three serial shoplifters were jailed after a \"crackdown\" from neighbourhood police. Matthew Moore, Matthew Hatherill and Jamie Colburn spent Christmas behind bars after targeting shops in Barry and Talbot Green.\nLiam Jonathan\nHe was jailed after he was caught brandishing a Glock-like handgun in the street \"like a gangster\". Liam Jonathan, 36, was seen pointing the weapon at traffic on a bridge before telling people at a bus stop that he had done time for armed robbery, and then getting on the bus and flashing the weapon at the driver.\nMerthyr Crown Court heard Jonathan was suffering from a hypomanic episode at the time having stopped taking his bipolar disorder medication. Sending the 36-year-old to prison, the judge told him he knew how important it was to keep taking his medication so he would stay well.\nJoshua Watkins\nHe threw a rucksack into a garden as he tried to get away from police officers who had spotted him acting suspiciously. What Joshua Watkins didn't realise is that a police helicopter crew were watching his every move and saw exactly where the bag had landed.\nWatkins had thrown the bag packed with illegal drugs into a garden on the Ringland estate in Newport where officers were able to recover it. The 23-year-old, from Cwmbran was sentenced to two years and six months imprisonment after pleading guilty to possession with intent to supply cocaine and cannabis.\nNicky Barratt\nThe serial shoplifter was jailed after a spree of offending which saw him helping himself to hundreds of pounds worth of boxes of chocolates and more than five-dozen blocks of cheese. In total, Nicky Barratt stole goods worth more than £850 from shops in Swansea.\nThe 36-year-old was sent down for five months, with police saying they hope his stay in prison over the festive period will give him \"time to reflect on his choices\".\nLuke Hutton and Lee Walsh\nLuke Hutton was jailed for peddling cocaine to earn money, after claiming he \"did what he had to do\" to make ends meet when his benefits were stopped. When he was arrested by police the 25-year-old was found to have almost £9,000 in cash in his pocket.\nHutton was jailed for three years while his dealing partner Lee Walsh got 32 months. Sending the pair down, the judge said they had \"spread misery\" across Aberystwyth.\nHaroon Zaman\nHe stole more than £124,000 from over a dozen victims by running a cryptocurrency investment scam on social media. Between January 2021 and June 2023 Haroon Zaman hacked into his victims’ social media accounts and impersonated them online.\nHe then used these compromised accounts to promote fraudulent cryptocurrency \"investment opportunities\" to friends and family of the individuals he hacked. Victims were persuaded to transfer funds on the promise of risk‑free returns. In reality, no investments existed, and the 23-year-old defendant stole a total of £124,479 from 17 known victims.\nCaleb Jones\nHe turned up at Creamfields with £1,250 hidden in shampoo bottles but immediately told security about his stash. While walking towards the entrance to the music festival in August 2023, Caleb Jones, 21, indicated to security that he was in possession of illegal drugs.\nHe was taken to a nearby area where he was searched and found in possession of 85 MDMA tablets, 7.42 grams of crystalline MDMA and 4.34 grams of ketamine. During a police interview he claimed that he was attending the festival with approximately 20 friends, and he had agreed to take all of the drugs into the event for them to share.\nHowever, messages recovered from his mobile phone showed that Jones was actively dealing illegal drugs and had been planning to deal at the music festival.\nRhys Phillips\nHe exposed his genitals in a street while shouting: \"I like children and I'm going to rape children.\" The disturbing behaviour of Rhys Phillips in Brynmawr, Blaenau Gwent, was witnessed by the horrified occupants of passing cars and buses.\nCardiff Crown Court heard the incident happened at 8.30am on October 13 near the Nature's Hand disability services centre in Alma Street. Phillips, 22, had been receiving support from the centre for serious mental health issues, the court was told.\nHe was sentenced to 12 months in jail and a 10-year sexual harm prevention order.\nJordan Evans\nThe burglar had a shave with his victim's razor before stealing it along with a haul of items including clothes, cash, wedding gifts, and a passport Jordan Evans broke into a bedsit in the dead of night and burgled three bedrooms while the occupants were all out working as Uber Eats delivery drivers.\nSwansea Crown Court heard 36-year-old Evans, who has 61 previous offences on his record, cannot remember breaking into the house and searching the rooms due the amount of drugs he had taken.\nKushi Alket\nThe cannabis gardener was jailed after being found tending to a cannabis factory with more than 200 plants which were worth up to £87,000. Kushi Alket, 35, was discovered after there were reports of a burglary at units on an industrial estate in Hirwaun where the cannabis factory was based.\nHe was sentenced to nine months imprisonment.\nRobert Oakley\nHe threatened to kill people in a Carmarthenshire pub, jumped out of a property window to evade police, then urinated in a police vehicle after he’d been arrested.\nRobert Oakley, 28, went to the Carwyn James pub in Llanelli on the evening of December 2. He had been there drinking for more than two hours when a disturbance broke out inside.\nJamal Hourrieh\nThe drug dealer was found to be involved in supplying heroin and cocaine after messages on his phone to customers spoke about being \"active\" in the area. Jamal Hourrieh, 24, told his customers: \"Ring to get looked after\" and \"I love my Gs\".\nA search of Hourrieh's phone uncovered that he was sending between 70 and 200 messages per day to customers. He was sentenced to three years' imprisonment.\nJoshua Hayter\nThe well-known shoplifter attempted to flee the scene of a crime on a bicycle but was tackled by police officers patrolling Swansea city centre. Moments before he was arrested, 27-year-old Joshua Hayter had been seen attempting to sell high-value cosmetics that he had stolen from a nearby shop.\nWhen officers brought him to a stop they recovered hundreds of pounds worth of cosmetics along with 13 grams of cannabis. Hayter was already on a suspended sentence at the time of the arrest. He was jailed for eight weeks, with a further 16 weeks added for his previous offence.\nLiam Key\nThe serial drug dealer was found in possession of cocaine and messages on his phone from customers who asked him how much they owed him. The messages showed Liam Key, 23, had arranged to supply cocaine and cannabis to at least 17 customers.\nKey was discovered by police during the arrest of another man who received a text from the defendant saying \"I'm out by the gate\". An officer then went out to speak to him as he waited in his silver Volkswagen Golf, described as \"nervous and shaking\", which led to him being searched.\nTony Mann\nMessages on his phone revealed he was a cocaine dealer directing drug runners to supply to customers. A search of a property belonging to Tony Mann, 28, and his partner resulted in the discovery of 118g of cocaine as well as tick lists which revealed the amount of money owed to them.\nUwen Watts\nHe was jailed after he exposed his genitals to a woman and sent her a grossly offensive message. Uwen Watts, 20, from Milford Haven, committed the offences on the same day in February this year. He sent the woman links to pornographic material and exposed himself to her by being naked from the waist down.\nSending him down, the judge said the offending would have caused a “deep if not long-lasting effect” on the victim, and that there was “no alternative” to imposing an immediate custodial sentence.\nBrandon Down\nThe drug dealer was found in possession of more than £4,000 worth of cocaine after messages on his phone revealed he had been involved in the supply of the drug. Brandon Down, 25, was initially identified by the police's county lines and development team who seized a number of mobile phones.\nThe court heard that Down became homeless and began using class A and B drugs to cope. As a result, he turned to dealing drugs in order to fund his own addiction.",
  "word_count": 8329,
  "scraped_at": "2026-02-14T13:24:08.311558"
}