{
  "article_id": "55f8883c6562",
  "url": "https://www.broadcastnow.co.uk/production/wsl-and-womens-championship-renew-little-dot-partnership/5202255.article",
  "title": "WSL & Women Championship renew Little Dot partnership | News",
  "date": "20250220T164500Z",
  "domain": "broadcastnow.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Little Dot Sport will continue to create social content and run YouTube channels\nWomen’s Professional Leagues Limited, the organiser of the Women’s Super League and Women’s Championship, has renewed its social media partnership with Little Dot Sport.\nLittle Dot’s sport arm will continue to run the pair’s YouTube channels, which house live match streaming, highlights, and long-form content, and deliver real-time matchday coverage, using live clip rights and photography. It will also handle community management across the WSL and Women’s Championship’s social channels.\nLittle Dot has worked with the leagues for four years, during which time the WSL has become the most-followed domestic women’s football league in the world. Little Dot provides a dedicated team of social and channel managers for the WPLL, and provide strategic support and direction across social channels.\nThis will be the first time that Little Dot is formally contracted by the WPLL, which took over running the WSL and Women’s Championship from the FA last year.\nCatherine Rowley, head of brand marketing, Women’s Professional Game, said: “Little Dot Sport has been a fantastic partner in driving the growth of our social platforms, helping us engage and expand our audience in new and innovative ways. Their deep understanding of the women’s football community and shared commitment to elevating the game have been instrumental in our social media success. As we enter this next phase, we have bold ambitions to take our digital presence to the next level, and we’re excited to continue working together to bring fans even closer to the action.”\nRobbie Spargo, managing director, Little Dot Sport, commented: “Whilst working with the brilliant Women’s Professional Leagues team over the past four years, we’ve witnessed incredible growth in fan engagement, and this renewal gives us the perfect platform to inspire even more fans and the next generation of players. Our goal is to bring fans closer to the action, tell the amazing stories of these athletes, and amplify the visibility of women’s football worldwide.”",
  "word_count": 329,
  "scraped_at": "2026-02-14T12:43:05.077241"
}