{
  "article_id": "563105e9f3ca",
  "url": "https://www.justarsenal.com/we-got-it-over-the-line-beth-mead-on-arsenal-achieving-womens-champions-league-qualification/376915",
  "title": "  we got it over the line  Beth Mead on Arsenal achieving Women Champions League qualification",
  "date": "20240929T134500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gooners needed a big perfomance from the Arsenal Women on Thursday night, and that’s just what they got. Our Gunner women, eager to bounce back from a 1-0 loss to BK Hacken in the first leg of the UEFA Women’s Champions League round 2 qualifier, had to be ruthless and dominant, and beating Hacken 4-0 was just that.\nBy halftime, Arsenal led by two goals from Lia Walti and Mariona Caldentey, and had already turned the tie around (as they’d scored the two goals they needed to qualify). Even so, as unforgiving as they were when they came to that game, the Gunners weren’t content with just those two first-half goals; Beth Mead and in-form Frida Maanum scored in the second-half for that 4-0 win (4-1 agg).\nAfter the game, Mead, who scored a spectacular, addressed the media, and one topic she touched on was what the feeling in the Arsenal camp is.\nAs always, she acknowledged their motivation and hinted at the challenges they faced before the match against Hacken. However, she admitted they’re now relieved they’ve qualified for Champions League football, where they belong, and are relieved they got the job done.\nMead said, “Do you know what? I think we were motivated as a team and believed we could get the result. Don’t get me wrong, it was a bit of a long day and a bit nerve-wracking knowing the outcome if we didn’t win. It’s a minimum standard at Arsenal that we need to be in Europe and playing in the Champions League every season. Football is a crazy game, and it isn’t easy. I know there have been some crazy results tonight, and ultimately we got it over the line, and that’s what we needed to do tonight.”\nArsenal’s return to Champions League football this season, with home and away matches against Bayern Munich, Juventus, and Valarenga, is exciting. There’s so much to look forward to this season, with WSL and Champions League glory possible. There should certainly be a lot of optimism in the Arsenal Women camp.\nAfter securing Champions League football on Thursday night, our Gunners are back in WSL action today, travelling to King Power Stadium to take on Leicester City. Kick-off: 3PM UK.\nI’m feeling very excited about this season. How about you?\nCOYGW!\nMichelle M\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 416,
  "scraped_at": "2026-02-14T13:01:43.500087"
}