{
  "article_id": "56386436cac4",
  "url": "https://www.ksnblocal4.com/2023/11/25/nebraskas-450-million-memorial-stadium-project-faces-fundraising-questions/",
  "title": "Nebraska $450 million Memorial Stadium project faces fundraising questions",
  "date": "20231125T201500Z",
  "domain": "ksnblocal4.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nebraska’s $450 million Memorial Stadium project faces fundraising questions\nLINCOLN, Neb. (Nebraska Examiner) - If Nebraska football is a state religion, recent efforts to raise private funds for a new NU football facility and to pay players are its offering plate.\nThe people in the pews remain generous. Donors largely funded a still-under-construction $165 million indoor facility east of the stadium. History says they will continue to give.\nBut NU Athletics Director Trev Alberts’ latest push to raise $450 million to renovate Memorial Stadium is facing a Big Red rarity among some Husker boosters and state lawmakers: pushback.\nAlberts says the century-old stadium needs work to serve NU fans for the next 100 years. Among the changes planned, South Stadium would be replaced, improving fan seating, restrooms and concessions.\nMuch of the construction is required to meet federal law on accessibility for disabled spectators, NU officials say. They say some work is also needed to keep the stadium functional and sound.\nQuestions about timing\nYet even some longtime donors to the University of Nebraska and Husker football privately question Alberts’ timing and approach in pursuing a massive new football infrastructure project.\nThe NU system, including the University of Nebraska-Lincoln, faces a projected budget shortfall of $58 million over the next two years. Campuses are proposing cuts to academic programs and staff layoffs.\nThe University of Nebraska Foundation is in the middle of a $3 billion fundraising campaign to help NU broaden its academic reach and reputation in the coming years.\nNU football is also rebuilding. First-year coach Matt Rhule heads into the final game of his first season on Black Friday needing to beat Iowa to secure the program’s first bowl berth since 2016.\nTough optics\nState Sen. Steve Erdman of Bayard, who serves on the Nebraska Legislature’s budget-writing Appropriations Committee, said the stadium construction might well be needed. But, he said, Alberts should have waited for Rhule to win more games.\nSeveral donors who declined to be quoted by name criticized the optics of athletics asking for so much at this time. They said it risks eroding taxpayer support for NU, though the athletics department supports itself and pays millions to the academic side.\nA handful of donors said NU made things worse by doubling Alberts’ salary this month to $1.7 million and increasing his fringe benefits after insiders said he had been targeted for another job. His pay will jump to $2.1 million in 2026.\n“It looks bad to me when you have a situation where you’re considering or have raised tuition, and you’re trying to make cuts in your spending at the university level,” Erdman said.\nSome local boosters said Alberts risks donor fatigue among people who want to see results before the next ask and among megadonors who prefer different priorities.\nNU Regent Barbara Weitz of Omaha, whose family has given money to the university over the years, reflected some of that skepticism during the board’s October meeting.\n“Why now?” Weitz asked Alberts. “I know how important Husker athletics are, but I’m deeply concerned about the amount of money that we’re expecting to raise from a lot of the same people.”\nCollege athletics changing fast\nIn an interview Wednesday, Alberts said the stadium project would help NU athletics shore up its bottom line as it braces for the outcomes of several court cases that could result in revenue-sharing with players.\nHe referenced lawsuits against the NCAA and more questioning whether student-athletes should be paid, whether NCAA rules are anti-competitive, whether college athletes can bargain collectively and whether amateur athletes should receive some of the millions of dollars in television rights they help schools generate.\nOne lawsuit seeks to have Power Five schools pay players 50% of the average revenue from ticket sales, corporate sponsorships and television revenue. At a place like Nebraska, Alberts said, he tells donors that could mean finding ways to replace up to $40 million in annual revenue.\nPlayers are going to get a significant portion of that revenue, Alberts said. The question then is, what is Nebraska’s plan to deal with that? In that world, he said, “the healthiest balance sheet wins.”\nAnd Nebraska will have no debt, he said.\nMany universities are considering whether to compete at the highest level of college sports and adjusting to conference realignment, TV network influence, and name, image and likeness payments for players.\n“This started out for me as … a project that was about … let’s make sure we have the creature comforts that our fans desire,” Alberts said. “It turned into, ‘We better get busy very, very quickly creating a business strategy that is about replacing the lost revenue that’s eventually going to go straight to student-athletes.”\nDaunting scope\nAlberts said he understands that the “size and scope and the challenge of the project” makes some people uncomfortable. At the October Regents meeting, he told the board his plans can be scaled to the amount of money donors give.\nHe said his goal is to make sure Nebraska has the resources to compete, to keep running the athletics department independently and to support women’s sports and non-revenue sports robustly.\n“We will cut the cloth to fit the quilt,” he said. “If any of our anticipated sources (of funding) either don’t materialize or fall short of our expectations, we will alter our strategy and alter the total scope of our project.”\nNU Regents Jim Scheer of Norfolk, Kathy Wilmot of Beaver City and Elizabeth O’Connor of Omaha told Alberts they appreciated his acknowledging the need for financial off-ramps.\nScheer said he expects athletics to raise the funds, as it has “every time that I’m aware of.” But he said “a lot of people are unsure” given the uncertain state of the economy.\nWilmot told Alberts she did not want to commit to something that could eventually cost students and the university. O’Connor said she would have preferred more explicit fundraising deadlines and benchmarks.\nRegents Chairman Tim Clare, during the meeting, said he understood his colleagues’ questions but said, “Excellence matters at the University of Nebraska.”\nHe called NU sports a big part of “our brand.”\nHe said it attracts potential donors and students. And after selling out every home football game since the 1960s, Husker fans deserve “the best fan experience in the country.”\nQuestions about fundraising contract\nUltimately, the board voted to support the stadium project, unanimously approving paying an outside contractor up to $5.5 million to raise at least $225 million by the end of 2025.\nUnder that contract with the Nebraska Philanthropic Trust, known for its relationships with Omaha’s top donors, pays the fundraiser a monthly fee between $137,500 and $275,000 through 2025.\nIt also puts NU athletics on the hook for costs associated with raising funds. That includes hotels, meals and entertainment. The department must sign off on each expenditure.\nSeveral donors who spoke with the Nebraska Examiner described the contract as unusual. They said most contracts tie pay more directly to fundraising results.\nA 2022 survey by the National Association of College and University Business Officers on funding tuition discounts found only 10% of 341 colleges and universities surveyed reported paying a fundraising firm a fee regardless of success.\n“Where are the financial incentives tied to performance and timing?” one booster asked. “What’s to keep them from slow-walking the fundraising so they get paid the full amount?”\nSue Morris, who leads the Nebraska Philanthropic Trust, referred questions to Alberts.\nUniversity defends contract\nNU officials said the contract has a clear financial incentive built in: It lets NU nix the deal with 30 days’ notice. It also requires fundraising until at least $250 million is raised, even after the group would no longer get paid, once it hits the contract’s $5.5 million cap at the end of 2025.\nNU spokeswoman Melissa Lee said that Alberts, the next NU president and the Board of Regents will keep close tabs on fundraising progress and that NU won’t build until the money is in hand.\nAlberts said he was confident in the fundraising firm and model, which he and the University of Nebraska at Omaha used to build Baxter Arena and Maverick Park.\nAlberts said criticism comes with the job. He said massive fundraising projects typically prompt opposition at the beginning and middle. He said he is not surprised by donor pushback.\nFundraising is not an either-or between athletics and the academic side of the university, Alberts said. Nebraskans will support both, he said.\nHe called Nebraska Philanthropic Trust a “valuable and trusted partner” and said they will raise funds and help manage the project to keep it on time and on budget.\nHe said the group will work with the university and the athletics department on ideas to backfill space opening up at the stadium with academic purposes and on new ways to raise revenue for athletics.\n“Part of this is just my experience,” Alberts said. “We were successful in getting a couple projects done that … were very complicated. These are very, very hard things to do. … It’s expertise that quite frankly I felt … that we needed.”\nUNO results, memo\nNew facilities for hockey, basketball, volleyball, baseball and softball were part of Alberts’ push to help UNO jump into the more competitive and costlier world of Division I athletics.\nUNO has won recent conference championships in men’s and women’s soccer, softball and baseball. Defenders of Alberts say Husker football and men’s basketball are recovering, too.\nUNO officials questioned Alberts’ fiscal stewardship of the UNO athletics department after he left for UNL, according to an internal memo Flatwater Free Press reported on Nov. 1.\nThe UNO memo found that Baxter Arena needed infusions of state and federal funding to help cover operating expenses. He declined to discuss the memo Wednesday.\nSeveral regents did not return phone calls or messages seeking comment for this story.\nClare has said he is doing fewer interviews during the search to replace NU President Ted Carter, who leaves in January to lead The Ohio State University.\nCarter, who gained authority over NU athletics from the regents shortly before announcing his departure, approved Alberts’ raise.\nNebraska Examiner is part of States Newsroom, a network of news bureaus supported by grants and a coalition of donors as a 501c(3) public charity. Nebraska Examiner maintains editorial independence. Contact Editor Cate Folsom for questions: info@nebraskaexaminer.com. Follow Nebraska Examiner on Facebook and Twitter.\nClick here to subscribe to our 10/11 NOW daily digest and breaking news alerts delivered straight to your email inbox.\nCopyright 2023 KOLN. All rights reserved.",
  "word_count": 1759,
  "scraped_at": "2026-02-14T14:08:58.052167"
}