{
  "article_id": "564b7eda5c0d",
  "url": "https://www.insidehighered.com/news/admissions/traditional-age/2025/09/10/colleges-boast-record-enrollment-and-fall-classes",
  "title": "Colleges Boast Record Enrollment and Fall Classes",
  "date": "20250910T083000Z",
  "domain": "insidehighered.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "You have /3 articles left.\nSign up for a free account or log in.\nPhoto illustration by Justin Morrison/Inside Higher Ed | University of Minnesota Rochester | Nick Gould Photography | North Carolina A&T State University | UConn\nAnother year, another fall that seems destined for bleak enrollment numbers. Between concerns about international student enrollment and continued skepticism about the value of higher education, some institutions are struggling to fill seats. Unexpected melt has prompted some wealthy, highly selective institutions to pull students off the wait list last minute; for smaller institutions, enrollment declines are leading to layoffs and program cuts.\nBut for a lucky share, fall 2025 has brought record freshman classes and soaring enrollment projections. In some cases, those record-breaking numbers follow steady growth since the end of the COVID-19 pandemic; in others, they represent a rebound from declines.\nNo single through line characterizes this semester’s successes. Many colleges report surging interest—and increased investment—in their health-related majors. Some are seeing significant growth from their online programs, while others point to the rising popularity of dual-enrollment programs, which allow high schoolers to take college courses. Others still are leaning into the adage that retention is the best enrollment strategy, boosting their overall numbers by ensuring that students come back year after year rather than by recruiting larger freshman classes.\nAs institutions stare down the barrel of the so-called demographic cliff—which is slated to begin next fall, after a peak of 3.9 million high school seniors graduates this coming spring—these eight examples provide a window into the innovative approaches institutions are taking to solve the enrollment puzzle.\nStephen F. Austin State University\nLocated in eastern Texas, Stephen F. Austin is the newest member of the University of Texas system; it joined two years ago after existing as a stand-alone public institution for 100 years. That decision has paid off: This fall, SFA expects to welcome about 2,800 first-year students, an increase of more than 31 percent from last year’s incoming class. Total enrollment also increased for the first time since 2018. (These figures, like all the 2025 enrollment numbers in this article, are the institution’s anticipated fall enrollment numbers, with final figures expected in the coming weeks.)\nA major driver of that growth has been SFA’s participation in the UT system’s Promise Plus program, which covers tuition costs for students whose household incomes are below $100,000.\n“The ability to reach more students more than quadrupled based on the University of Texas system’s support and funding,” said Kent Willis, SFA’s senior vice president for enrollment and student engagement.\nThe university has also strengthened its connections with local schools, developing a program known as Lumberjack Lunch to help expose students from eighth grade through high school to the SFA community and the experience of attending a four-year university. Participants can attend cocurricular programs, like band and art camps, on SFA’s campus, as well as college-readiness courses.\n“We’re really working to take a lot of the great work going on in our academic units with faculty and packaging them in a way that is much more able to be understood and accessed by students and families,” Willis said.\nSFA’s transfers are also up by 16 percent compared to last year. About half of that growth can be attributed to new transfer pathway partnerships with four local community colleges, Willis added.\nUniversity of Minnesota, Rochester\nUMN Rochester is a relatively young school; its first class graduated just over 10 years ago. Since then, enrollment has climbed steadily, but this year represents a particularly high-water mark—enrollment is up 80 percent from last year.\nUMN Rochester specializes in the health sciences, offering degrees in everything from premed to health-care administration and addiction studies. Those fields are in high demand, said Lori Carrell, UMN Rochester’s chancellor, in part because they promise employment opportunities in the state, where about nine in 10 counties are experiencing health-care staff shortages. And because each of UMN’s campuses specializes in a different field, Rochester isn’t competing with other institutions in the system for students.\n“In launching in an already crowded higher ed market, deciding to be specialized in preparing students for health careers was absolutely critical for our viability,” she said. “Of course, when we launched, most of the state didn’t know we existed for a while. So, it wasn’t that at the very beginning everyone understood there was one place to go in Minnesota if you want a health career. But over this period of 15, 16 years, that reputation is being established.”\nThe university has also begun focusing much of its recruitment efforts on direct admissions, which offers automatic admission to high school seniors who meet certain criteria. Between the platform Niche and the state of Minnesota’s own platform, UMN Rochester increased its direct admissions enrollments fivefold—from about 20 students last year to about 100 this fall.\nUniversity of Connecticut\nThe University of Connecticut has focused its efforts on out-of-state recruitment, to strong effect; the institution welcomed a record-high first-year class of 6,550 across its campuses. Much of that growth can be attributed to ongoing efforts to draw students from across the country, in part by investing in marketing and building a staff of territory managers who are responsible for recruitment and outreach in different areas of the U.S.\nBut the university’s reputation has also been growing, said Vern Granger, director of undergraduate admissions—both for its actual academic programs, such as nursing, which received a $50 million gift two years ago, and because its sports teams have been in the spotlight of late. UConn’s women’s basketball team is the most successful in the NCAA, and its top player, Paige Bueckers, whose final season ended in spring 2025, has become a WNBA superstar playing for the Dallas Wings.\n“As we enroll more students, as those students have a good experience, that just dominoes, and I think all of those things have led to our increase in interest, and that larger pool has allowed us to enroll larger classes without seeing any impacts in the quality of the students,” Granger said.\nGeorge Fox University\nPortland, Ore.—one of the two least Christian cities in America, according to Pew Research—is also home to George Fox University, a private Christian college that now boasts the title of largest private institution in the state, with over 4,350 students. Its first-year enrollment broke the record both this fall and last.\nThat growth comes from a number of different areas, according to the president, Robin Baker, and vice president of enrollment and marketing, Lindsay Knox. For one thing, the university has started several Division III sports teams in recent years, including football, women’s lacrosse, men’s and women’s swimming, e-sports, and stunt—a competitive form of cheerleading—and athletes now make up about a quarter of all students.\nGeorge Fox has also attracted students to its growing nursing, engineering and business programs. At the same time, it hasn’t shied away from the arts and humanities, creating a great books program and constructing a new art and cinematic arts facility, the administrators said.\nFinally, Knox stressed that the university has invested heavily in student facilities, in contrast to many universities that have deferred maintenance amid budget constraints. The improvements include a new dining hall, a bridge connecting the two sides of campus and a chapel, she said, and the campus is working to remodel its dorms.\n“We’ve done those things because we believe the root of the undergraduate experience is still going to be residential,” she said. “It’s still going to be students embodied on this campus, and it’s important that they have good spaces, beautiful spaces, that showcase the community well and that they want to be a part of.”\nNorth Carolina A&T State University\nThe largest historically Black institution in the U.S., North Carolina A&T State has increased enrollment 6.4 percent since last fall, from about 14,300 total students to nearly 15,300, including gains among first-time undergraduates and transfer students.\nBut the largest year-over-year increase is among doctoral students. The university is welcoming 23 percent more students to its 14 doctoral programs than it did in 2024, according to Joseph O. Montgomery, associate vice provost for enrollment management. As N.C. A&T State has pushed to increase its Ph.D. population, officials have also made an effort to raise money to increase the amount of aid it can provide those doctoral candidates, producing a much higher yield rate, Montgomery said.\nIn addition, the university has developed several high-demand Ph.D. programs over the past four years, including in nursing, criminal justice and psychology.\nThe university has also seen increased retention rates, which Montgomery attributes to the creation of a new student success office in 2023 and a slew of student success initiatives—all part of its goal to reach a 70 percent graduation rate by 2030.\nOne of those initiatives allows students to take courses over the summer for reduced or free tuition, in an attempt to ensure students can finish their degrees on time without having to double up on courses in the spring or fall.\n“That allows for their success rate to go up in the classroom,” he said.\nAlamo Colleges District\nStudents at Palo Alto College, one of the Alamo College District's five institutions, during the first week of classes.\nPalo Alto College\nFor the Alamo Colleges District, a system of five community colleges in Texas that is anticipated to reach a total enrollment of 87,700 this fall, this year’s enrollment growth can be attributed primarily to two populations outside traditional-age students: adults and high schoolers.\nHigh schoolers have enrolled at ACD institutions through dual-enrollment, early-college and career-academy programs, which allow them to earn an associate degree or a certificate when they finish high school. The number of students participating in those programs has skyrocketed 31 percent since last fall, according to ACD chancellor Mike Flores. Meanwhile, the number of continuing students has increased by 13.6 percent.\nFlores said the system’s close relationship with 35 nearby school districts is part of the reason its high school student enrollment has exploded.\n“It’s a very relational partnership with them in discussing strategically: What courses do they need? Do we have the faculty? Can we work jointly to get more faculty with the credentials that they need?” he said. “And then we look at, what are the talent gaps in the area that exist? Maybe that’s in IT or cybersecurity. Maybe that’s in manufacturing … It really is an all-hands-on-deck approach.”\nLebanon Valley College\nThe small liberal arts college in Pennsylvania stands out because it achieved its highest-ever undergraduate enrollment without welcoming its largest freshman class. Instead, its retention rates have improved.\n“We’re really looking more, as an enrollment strategy, [at] selectivity,” said Edwin Wright, vice president of enrollment management. “We’re spending a lot more time looking at who we’re admitting and the likelihood of them not only retaining, but actually walking across the commencement stage.”\nIn addition to changing whom they admit, the college has invested in student success and support infrastructure, including efforts to improve students’ sense of belonging and provide more academic supports for struggling students. The college has also worked to strengthen the relationship between academic offices and athletics; 40 percent of the student body are athletes.\nAs a result, retention is up, especially among minority students: In the last year, retention for Black students increased 24 percent and for Latino students increased 9 percent.\n“That’s based on concrete efforts and initiatives to make sure we’re addressing those achievement gaps in student demographics,” Provost Michelle Maldonado said.\nUniversity of Idaho\nStudents at the University of Idaho participate in Welcome Week activities.\nThe University of Idaho\nThe Idaho flagship has been steadily boosting its enrollment for the past nine semesters, according to Dean Kahler, vice provost for strategic enrollment management; this fall, enrollment is projected to increase by 3 percent from around 12,300 students last fall.\nA large portion of that growth comes from neighboring states, Kahler said. The University of Idaho is part of the Western Undergraduate Exchange, a long-standing partnership of 16 institutions across the West that have agreed to charge students from other member states a reduced rate.\n“We have about 20,000 high school graduates [annually] in the state of Idaho. We’re not a very large state, population-wise. So, we do go outside of the state and after nonresidents and try to attract them to the state,” he said.\nDual enrollment has also been a significant asset for the university. In Idaho, nearly half of all high school students take some dual-enrollment courses; the university’s total dual-credit enrollment is about 1,700 this year, consistent with the past couple of years. And many of the university’s dual-credit students go on to attend the university once they finish high school, Kahler said, creating a reliable pipeline.",
  "word_count": 2126,
  "scraped_at": "2026-02-14T13:22:15.756838"
}