{
  "article_id": "565262327748",
  "url": "https://www.90min.com/england-1-2-france-player-ratings-31-5-2024",
  "title": "England 1 - 2 France : Player ratings as Lionesse Euro 2025 hopes suffer blow",
  "date": "20240601T001500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England 1-2 France: Player ratings as Lionesses' Euro 2025 hopes suffer blow\n- England suffered narrow 2-1 defeat against France in Euro 2025 qualifying clash at St James’ Park\n- Beth Mead opened scoring in first half but goals from Elisa De Almeida and Marie-Antoinette Katoto turned game on its head\n- Lionesses drop to third in their group below France and Sweden\nEngland suffered a blow in their UEFA Euro 2025 qualifying campaign as they were beaten 2-1 by France at St James’ Park on Friday night.\nThe Lionesses had the opportunity to take control of their group, which also consists of Sweden and the Republic of Ireland, but instead they slipped to third in the standings with it all to do in their remaining three games.\nDespite Beth Mead’s early opener, a goal in each half from France inflicted an agonising defeat on the Lionesses.\nHow the game unfolded\nIt was a rather lacklustre start to the game at St James’ Park as both sides attempted to feel their way into the game. England were handed a significant blow early doors, however, as goalkeeper Mary Earps picked up an injury in the opening 10 minutes of her 50th Lionesses appearance and was replaced by Hannah Hampton.\nThe first real chance of the game fell to Ella Toone on 20 minutes as she scuffed a cutback from Lauren Hemp and it rolled wide. England eventually got their goal on the half-hour mark, courtesy of a Beth Mead strike from close range.\nFrance’s first big opportunity came from a set piece as Maelle Lakrar connected with a corner kick and her header was goal-bound. Hampton, outstretched, was able to punch it away and out for another corner.\nElisa De Almeida produced an exquisite finish for France’s equaliser before half-time. A corner dropped kindly for her and she side-footed it into the top corner, giving Hampton absolutely no chance on that occasion.\nMead almost scored a second moments before the break as Lucy Bronze broke down the right and played a pinpoint through ball for the Arsenal star to run onto. Mead looked to curl an effort into the top left corner, but was expertly denied by Pauline Peyraud-Magnin in the France goal.\nFrance very nearly put themselves in front early in the second half as Delphine Cascarino danced her way into the box, but struck her effort just wide of the far post. Marie-Antoinette Katoto was the one to put the visitors ahead with 20 minutes left to play.\nEngland didn’t deal with a corner and in the second phase of play, the forward was able to bury an effort beyond Hampton. Set pieces proved to be the Lionesses’ downfall once again.\nSubstitute Chloe Kelly carved an opening late on, but her effort from range dipped over the bar and went out for a goal kick. Despite England seeing the majority of the ball, France remained risk averse and held out for the win.\nEngland player ratings (4-3-3)\nGK: Mary Earps - N/A - Concern early doors as she picked up what appeared to be a hip injury after a simple pass. Tried her best to continue but was forced off a couple of minutes later. Not the way she would’ve hoped her 50th England cap would go.\nRB: Lucy Bronze - 6/10 - Some positive runs forward, but left the rest of the back line a little exposed at times when England lost possession and she was so high up the pitch.\nCB: Millie Bright - 6/10 - Early mistake giving the ball away to Cascarino in the opening minute. Put in a few crucial defensive blocks, but did appear a little shaky at times. Understandable given she has only recently returned from injury.\nCB: Leah Williamson - 7/10 - Kept things ticking nicely when England were in possession. An incisive pass through the middle in the build-up to the opener, a quality the Lionesses missed while she was sidelined with an ACL injury.\nLB: Jess Carter - 6/10 - Booked in the first half for a tug on Cascarino as France looked to break. In at left back for the first time in a while and it showed.\nCM: Keira Walsh - 6/10 - She was marked well and wasn’t able to influence the game in her usual way. Instead, very much kept things ticking and was looking for space where she could.\nCM: Georgia Stanway - 6/10 - Picked the ball up in some good areas but unable to really influence the game. Unleashed an effort from range late on, but it was high and wide. Subbed.\nCM: Ella Toone - 6/10 - Should’ve opened the scoring in the first-half but scuffed her shot wide. A rather quiet game by her standards.\nRW: Beth Mead - 7/10 - Opened the scoring for England with a composed effort from a few yards out and could’ve had a second before the break. A mouthwatering back hell to nearly set up for the hosts, but the move unfortunately fizzled into nothing.\nST: Alessia Russo - 6/10 - Excellent hold up play in the first half as she dropped deep and set Hemp away down the left. Picked up good positions but nowhere near decisive enough in the final third.\nLW: Lauren Hemp - 7/10 - Her cutbacks into the box caused France plenty of problems and one eventually led to Mead’s opener. She ran into trouble early in the second half and gave the ball away in a dangerous area, but was lucky Toletti’s shot came to nothing.\nSubstitutes\nSUB: Hannah Hampton (8’ for Earps) - 7/10 - A big save to keep England ahead as Lakrar got a header on target from a corner. Not a lot she could’ve done for France’s equaliser. Didn’t look as assured in possession.\nSUB: Chloe Kelly (79’ for Mead) - 6/10\nSUB: Fran Kirby (79’ for Stanway) - 6/10\nSubs not used: Alex Greenwood, Jess Naz, Aggie Beever-Jones, Grace Clinton, Maya Le Tissier, Jess Park, Khiara Keating, Esme Morgan, Millie Turner\nManager\nSarina Wiegman - 6/10 - Opted for experience over form at the back and it didn’t quite go to plan as England ultimately suffered defeat on the night. It could be argued\nFrance player ratings (4-4-2)\nGK: Pauline Peyraud-Magnin - 7/10 - A crucial and fantastic stop to Mead a second moments before half-time. Didn’t have an awful lot to do as England failed to create many clear cut chances with all their possession.\nRB: Elisa De Almeida - 8/10 - A rather outrageous finish for the equaliser late in the first half. Struggled a little bit against Hemp’s pace as most of England’s threat came down her flank.\nCB: Wendie Renard - 7/10 - Defended against Russo well and was a calming, composed presence at the back from France.\nCB: Maelle Lakrar - 7/10 - A threat at set pieces and forced a decent stop from Hampton in the first half. Solid alongside Renard and offered England very little on the whole.\nLB: Selma Bachai - 7/10 - Will feel she was fouled in the build-up to England’s opener. Found the right balance between pushing forward and keeping position, with Beth Mead attacking down her flank.\nRM: Kadidiatou Diani - 7/10 - Arguably didn’t test England’s defence enough. There was space to exploit with her pace, but she wasn’t as threatening and as direct as she normally is.\nCM: Sandie Toletti - 6/10 - A tame shot at Hampton after capitalising on some loose play from Hemp. Quietest of all of France’s midfielders.\nCM: Kenza Dali - 7/10 - Marked Walsh well and did well to restrict the midfielder’s influence in the opening exchanges. Got the assist for France’s equaliser and her set pieces caused England a lot of problems.\nLM: Sakina Karchaoui - 8/10 - Played in a more unfamiliar role in midfield but contained England reasonably well. Made crucial interceptions and was there to win back possession for France on more than one occasion.\nST: Marie-Antoinette Katoto - 8/10 - Couldn’t control a cross in from Cascarino to level the scoreline, instead sending her effort high and wide. Barely involved until she took her goal extremely well to give France the lead in the second half.\nST: Delphine Cascarino - 8/10 - Put Bright under pressure and won a corner in the opening minute. Great defensive work to put off Lucy Bronze, who had broken into space down the right. Was able to dance her way around white shirts at times and was certainly France’s most dangerous player. Subbed.\nSubstitutes\nSUB: Amandine Henry (69’ for Cascarino) - 7/10\nSUB: Eve Perisset (86’ for De Almeida) - 7/10\nSUB: Louna Ribadeira (90+1’ for Katoto) - N/A\nSUB: Lea Le Garrec (90+1’ for Dali) - N/A\nSubstitutes not used: Solene Durand, Constance Picaud, Eve Perisset, Estelle Cascarino, Thiniba Samoura, Grace Geyoro, Sandy Baltimore, Ines Benyahia, Julie Dufour\nManager\nHerve Renard - 8/10 - His side had the beating of England at set pieces. They remained a constant threat, despite conceding possession for large spells. Used his substitutes well and ensured his side capitalised on England's frailties in the second half.",
  "word_count": 1530,
  "scraped_at": "2026-02-14T13:04:52.440335"
}