{
  "article_id": "5663ac57d335",
  "url": "https://www.usmagazine.com/celebrity-news/news/isaac-rochell-weighs-in-on-emily-kuchs-viral-canceled-wedding-story/",
  "title": "Isaac Rochell Weighs In on Emily Kuch Viral Canceled Wedding Story",
  "date": "20241101T173000Z",
  "domain": "usmagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "According to Allison Kuch’s husband, Isaac Rochell, there’s more to Emily Kuch’s canceled wedding story than what fans heard in her now-viral podcast interview.\n“It’s even more intense, too,” Rochell, 29, exclusively told Us Weekly while the couple debuted their Mac & Cheese x Corn Bread mashup recipe at the Finish Holiday Dinner in New York City. “There’s a lot [to it].”\nDuring an October episode of her “Sunday Sports Club” podcast, Allison, 29, gave her sister the space to unpack her experience two years after calling off her wedding to an unnamed NFL player the day their ceremony was set to take place in Hawaii. “There was a lot of me that was like, ‘Did I really just do that? Is this for good?'” Emily, a San Diego–based digital creator, recalled.\nEmily confessed that she had “a lot of things” to learn after ending her nearly 10-year relationship with the pro athlete, acknowledging that she “didn’t really know how to be my own person.” She broke down the events leading up to the pair’s would-be wedding day — from disagreements about signing a prenup to a secret bachelor party and uncomfortable rehearsal dinner — and explained her new perspective looking back on the “devastating” ordeal.\n“I started to try to view this as, like, ‘How could I use this experience to be a better person, a better partner for my next partner?’” Emily said. “You have to spend a lot of time with yourself. You have to date yourself. You have to love yourself.”\nThe interview quickly gained traction online — Us’ coverage of the podcast even ended up in the Kuch family group chat, according to Rochell — and Allison was pleasantly surprised by the response to her sister’s vulnerability.\n“I know she was a little bit nervous to share her story just because there’s so many opinions out there,” Allison told Us. “But the amount of positive feedback from women and men that were like, ‘I’m so proud of you for telling your story,’ but also how strong she is and helping other women that might be going through huge life changes, that feedback was great. I’m really proud of her.”\nRochell, currently a free agent in the NFL, noted that he’s “known [Emily] for a long time” and echoed his wife’s praise. “I’m super proud of her and I appreciate what Alli did, because I told Alli, like, you have a responsibility to your sister to do as best as you can do and give her the platform to tell her story. I just thought it was really cool of both you guys, really commendable,” he added. “But she did such a good job, it was classy.”\nRochell and Emily’s ex played football together at the University of Notre Dame before they each were drafted into the NFL. The former fiancé was never named during the Kuch sisters’ interview, but Emily was reportedly engaged to Baltimore Ravens star Ronnie Stanley, whom she was set to wed in 2022. (Us previously reached out to Stanley’s team for comment.)\nWhen it comes to Emily’s next chapter, both Allison and her husband are excited to see her thrive. “I think anything she puts her mind to, she’s gonna be successful in,” Allison told Us, noting that Emily is involved in the world of fitness. “I think that she’s done really hard things in her life and I think that if she has a passion and she goes for it, she’s gonna be very successful.”\nRochell gushed over his “super talented” sister-in-law, adding, “She’s got a lot of attributes that make somebody great, and I think she just needs the right opportunity, whatever it may be.”\nAllison launched “Sunday Sports Club” last year, supplementing her already popular TikTok presence with an accessible avenue into sports news for her mostly female followers. As a sports lover herself — and having spent seven years getting an up-close look at life within the NFL — Allison is helping open the door to a whole new demographic of football fans.\n“I feel like there’s been a toxic culture and such a negative view of, like, you have to do this to like sports or you have to be a guy. There’s just been so many hoops that people have had to jump through to be able to like it,” she told Us. “Now I feel like so many different women have opened up the space to be acceptable, not only for other women, but for people who might not [have been] interested in the space before this. So I am all for it, I think there’s so much to it. If you don’t like just watching the game, there’s so much beyond it that I think there’s something for everyone.”\nAllison also gave a shout-out to women athletes who are breaking barriers in their respective sports, including Caitlin Clark and Simone Biles. “You have women who are now these big sports figures that I think 10 years ago, it wasn’t as talked about,” she said.\nFor Rochell, Allison’s passion and fan base is proof that the couple’s 10-month-old daughter, Scottie, might experience a more inclusive future. “It’s a pivotal moment for people like Alli to lean into it and take advantage and create more space for people like our daughter,” he explained. “So like, 18 years from now, it shouldn’t even be a conversation.”\nThose hoping to hear more personal stories like Emily’s on “Sunday Sports Club” are in luck — Allison hinted during a recent episode that more special guests are on the way this season. When asked to give Us a preview, the influencer played coy.\n“I think that you’re gonna be very interested to hear some of the women’s stories coming up,” she teased.\nRochell frequently joins Allison on her podcast, but that’s not the only collab the couple has in store. The pair blended together “two holiday classics” for their Mac & Cheese x Corn Bread mashup, a recipe that puts Finish Ultimate’s cleaning powers to the test.\nFinish is encouraging users to vote for their favorite holiday dishes for the chance to throw their next dinner party on the brand. The Ultimate Host can win up to $10,000 to give the Ultimate Holiday Dinner. To learn more, visit FinishUltimateHost.com.",
  "word_count": 1050,
  "scraped_at": "2026-02-14T13:40:24.549720"
}