{
  "article_id": "56730a8b1e37",
  "url": "https://ndsmcobserver.com/2023/05/observer-all-commencement-teams-2023/",
  "title": "Observer All - Commencement Teams 2023 // The Observer",
  "date": "20230519T050000Z",
  "domain": "ndsmcobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Observer Women’s All-Commencement Team\nOlivia Wingate, ND SoccerWingate was the second-highest team scorer with 14 goals and 33 points in 2022. She earned Third Team All-American, First Team US Coaches All-Region and First Team All-ACC accolades during her career.\nMaddy Denner, ND XC, T&F\nDenner was named All-ACC and Outdoor Second Team All-American during her collegiate career, which includes three top-five times in program history.\nPayton Tidd, ND Softball\nReliable and elite, Todd has been named All-ACC three times, including First Team in 2019. Tidd has recorded a sub-3.15 ERA in each of her five seasons (as of May 15 for 2022-23).\nLucy Chamberlin, SMC Tennis\nChamberlin was named First Team All-MIAA with a 5-2 record in doubles play. She also collected Academic All-District accolades.\nClara Reudiger, HCC Tennis\nReudiger was named CCAC Player of the Week after leading the Saints to their first conference championship in program history in April.\nCaitlin Traxler, SMC Softball\nTraxler was named Second Team All-MIAA after leading Belles in 2023 with seven home runs and 37 RBI. Traxler also worked 41.1 innings in the circle.\nDara Mabrey, ND Basketball\nThe third Mabrey sister to play for the Irish scored double-digit points 71 times in her five-year career, including 20+ on 22 separate occasions. She was named to the ACC All-Freshman Team in 2019.\nKara Linder, ND Fencing\nBrother of fellow Irish fencer Luke, Linder made two All-American Teams and qualified for NCAA Championship in all five of her collegiate seasons.\nKasey Choma, ND Lacrosse\nChoma has scored 45 or more goals in each of the last three seasons. Named to 2022 IWLCA Midwest/West All-Region First Team.\nJackie Wolak, ND Lacrosse\nWolak has a jaw-dropping 89 assists in 18 games as a senior through May 15, 2023. Wolak achieved 2022 ACC All-Tournament and 2021 Inside Lacrosse Honorable Mention All-American selection.\nObserver Women’s All-Commencement Team\nRyan Bischel, ND HockeyBischel started every game for ND in 2022-23, posting a sparkling .931 save percentage and being named a finalist for the prestigious Mike Richter Award.\nIsaiah Foskey, ND Football\nFoskey broke Justin Tuck’s record for career sacks in Notre Dame history en route to becoming a second-round NFL Draft Pick.\nVinny Martinez, ND Baseball\nStanford transfer has been Notre Dame’s hottest hitter down the stretch, leading the Irish with 10 home runs and a slugging percentage over .600 as of May 15.\nConnor Fu, ND Tennis\nFu will represent Notre Dame in doubles in the NCAA Championships alongside freshman Sebastian Domingo. The duo have already been honored by the ACC twice this season.\nPat Kavanaugh, ND Men’s Lacrosse\nBrother of fellow star sophomore Chris has broken program record single-season assists each of the last three seasons. Named a finalist for college lacrosse’s most prestigious individual accolade, the Tewaaraton Award.\nJack Hoagland, ND Swim & Dive\nHoagland qualified for NCAAs and won the Blanchford Award in 2023. Holds school records in the 400 IM and 800 free relay.\nNate Laszewski, ND Basketball\nFormer All-ACC honorable mention forward led the Irish in points per game (13.7) and rebounds per game (7.2).\nMatthew Carmody, ND XC, T&F\nCarmody was named First Team All-ACC in the outdoor 5,000 meter, indoor 3,000 meter and indoor 5,000 meter in 2021. Top 10 in Irish history the indoor 3,000 and 5,000 meter.\nAxel Valenzuela, HCC Soccer\nSouth Bend native was named to CCAC All-Conference Second Team after scoring six goals, including a game-winner, and two assists in 2022.\nPalmer Jackson, ND Golf\nJackson, a 2021 Ping DI All-Region Tournament selection, has consistently paced the Irish in tournaments. He was also selected to compete in NCAA Regionals in 2023.",
  "word_count": 603,
  "scraped_at": "2026-02-14T13:09:16.567624"
}