{
  "article_id": "56a127e6fe2f",
  "url": "https://news.yahoo.com/three-things-byu-must-accomplish-213000749.html",
  "title": "Three things BYU must accomplish this spring",
  "date": "20230308T221500Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Three things BYU must accomplish this spring\nThis article was first published in the Cougar Insiders newsletter. Sign up to receive the newsletter in your inbox each Tuesday night.\nThe quarterback spot will always draw attention in BYU camps, and USC/Pitt transfer Kedon Slovis was impressive in his first drills with the Cougars this week. Meanwhile, new BYU defensive coordinator Jay Hill is installing his base defense and is impressed with the speed on that side of the ball.\nHere are a few of our BYU spring football camp stories:\nSlovis turns head in first spring practice (Jay Drew)\nWhy new faces will help in recruiting (Dick Harmon)\nFactors point to offense rolling (Jay Drew)\nCougar Insiders predictions\nQuestion of the week: What are three things BYU needs to accomplish in spring football practice sessions?\nJay Drew: The Cougars completed the first of 15 scheduled spring practice sessions Monday night, then head coach Kalani Sitake, offensive coordinator Aaron Roderick and defensive coordinator Jay Hill took turns addressing the media.\nSitake said the priority over the course of the next six weeks will be to identify which players deserve to be on the two-deep chart, which ones are right there and can add depth, and which ones aren’t worth keeping around. So that’s one the head man wants to accomplish.\nRoderick said he would like to improve the offense’s timing, with transfer quarterbacks Kedon Slovis and Jake Retzlaff needing to find a rhythm and get in sync with their new teammates.\nHill has perhaps the biggest task, as he’s breaking in a fairly new defensive coaching staff. His priority is to take a lot of speedy, explosive guys and get them to play within his system and adapt to his schemes.\nMy opinion is that the Cougars need to identify a No. 2 quarterback, find defenders capable of getting pressure on opposing quarterbacks and figure out who can play linebacker while starters Max Tooley and Ben Bywater recover from surgeries.\nDick Harmon: The first priority is for Jay Hill to establish his culture and scheme of BYU’s defense. Sitake made big changes on the defensive staff, and expects the hirings to be transformative, and it begins in spring ball. Kalani Sitake didn’t dismiss four coaches with expectations the hire of Hill would be transformative and it begins in spring. Hill must make decisions on who can play to his standards and develop depth and talent. Second, almost equally important is for Aaron Roderick to prepare Kedon Slovis to be an “operator” in his offense, then choose a backup QB.\nThe third most important development in spring has to be BYU’s defensive front. It has to develop into an attacking, pressure unit capable of collapsing pockets and pressuring QBs and creating enough disruption that BYU linebackers can make plays. This means Tyler Batty, Blake Mangelson, John Nelson and Atunaisa Mahe will need to be pushed hard, and edge rushers and defensive ends Aisea Moa, Michael Daley and Bodie Schoonover must elevate in competition with Boise State transfers Jackson Cravens and Isaiah Bagnah and Weber State transfer Nuuletau Sellesin. Mahe just squat-lifted a whopping 600 pounds, an impressive feat for any student-athlete anywhere.\nSitake is through being flexible with scholarships, having hard conversions at the end of spring, fall practice and fall semesters as an independent. As a Power Five team in the Big 12 his scholarships will be locked in for four years. He will need to be far more discriminating in who he hands out scholarships to. Expect heated battles in March.\nCougar tales\nBYU men and women made final appearances in the WCC basketball tournament, both losing on Monday. You can read about Mark Pope’s team making a remarkable second-half comeback that fell short against No. 1 seed Saint Mary’s here. On the women’s side, the Cougars fell short against Gonzaga, as Jeff Call reports here.\nFrom the archives\nRelated\nFrom the Twitterverse\nBYU KenPom Ranking:\n2020: 13\n2021: 20\n2022: 58\n2023: 75*\nBlame the portal, blame lack of LDS talent, blame whatever. That's a terrible trend. BYU lost 2 straight to UVU and finished 5th in the WCC this year. Nobody expected BYU to be good in 23, but isn't that the problem?— Jeff Hansen (@rakoto10) March 7, 2023\nBYU's Blake Freeland with a 37\" vertical jump, the best recorded by an OL at the Combine.\nThat's better than some notable WRs:\nAJ Brown (36.5)\nMichael Pittman (36.5)\nDeAndre Hopkins (36.0)\nStefon Diggs (35.0)\nCeeDee Lamb (34.5)\nAmari Cooper (33.0) pic.twitter.com/nNgqqi8tOU— NFL on CBS 🏈 (@NFLonCBS) March 5, 2023\nSince everything is Big 12 vs. Pac-12 these days, here are the Pac-12 per-game attendance numbers in hoops this season.\n1. Arizona | 14,115 (96.38% capacity)\n2. UCLA | 9,276 (67.22%)\n3. Arizona State | 8,071 (56.84%)\n4. Washington | 6,992 (69.92%)\n5. Colorado | 6,752 (61.03%)\n6.… https://t.co/LuvQCPLBnS— Mitch Harper (@Mitch_Harper) March 6, 2023\nExtra points\nLaura Gustin sets rebound record (Deseret News)\nRoderick prepares Slovis for NFL (KSLsports)\nQuestions at WR key in spring (Salt Lake Tribune)\nFanalyst\nComments from Deseret News readers:\nI’m pleasantly surprised how much the coaches are raving about the increase in athleticism at all positions. Sounds like BYU has gotten much more athletic this year. The most pleasant surprise for me is how good the situation is along the OLine. Great news!\n— befair\nThe last time Slovis played in LES, USC was in the Pac-12, BYU was independent, and he was throwing a pick to seal BYU’s first home win over USC\nThe next time he plays in LES, BYU will in the Big 12, USC is heading to the Big Ten, and Slovis will be starting for BYU.\nWho could have foreseen all of that happening in such a short period of time?\n— BlueCoug\nLast line of the article: “The Cougars fell short, but at least they went down swinging.”\nAs long as BYU (coaches and players) accept this mentality — the Cougars are going to struggle. It has been a pattern the entire season: begin slow, dig a hole for yourself, then expend all your effort to climb out of that hole ... but alas, fall short with too little too late. Clinging to moral victories (“go down swinging”) is an impediment to winning.\nInconsistent play is not what champions do. Yes, every team has its moments and lapses of smart game plan execution, but winning teams keep those in-game episodes to a bare minimum. You can’t be mediocre (or worse) for 25 minutes, play hard for 15 minutes ... and expect to win a 40 minute contest against good teams. BYU’s season record is the only proof you need attesting to inconsistent execution.\nOn next year’s team: Only Williams and George are seniors, but don’t expect BYU to all-of-a-sudden be a winning team because the remaining players are a year older and more experienced. At a minimum, the coaches need to find at least three talented 1st stringers at forward and center (with size). BYU coaches can’t be content to merely bring in players to fill up the team roster. Yes, it’s a tall order but the lack of recruiting size forcing BYU’s small ball approach (for 2 years now) is the single biggest contributor to BYU’s decline and its 19-15 season. BYU’s recruiting effort has got to increase substantially right now.\n— dazzle\nUp next\nMarch 9-10 | 5 p.m. | Baseball | vs. Creighton | @Omaha, Nebraska\nMarch 10 | 11 a.m. | Women’s tennis | vs. Boise State | @Provo\nMarch 10 | 2 p.m. | Track and field | NCAA Indoor Championship | @Albuquerque, New Mexico",
  "word_count": 1273,
  "scraped_at": "2026-02-14T13:07:56.807200"
}