{
  "article_id": "56a29d951a02",
  "url": "https://www.examiner.com.au/story/8852535/empty-stocking-appeal-2024-passes-50k-thanks-to-wd-booth-trust/?cs=2596",
  "title": "Empty Stocking Appeal 2024 passes $50k thanks to WD Booth Trust | The Examiner",
  "date": "20241228T024500Z",
  "domain": "examiner.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Things aren't getting any easier, but Launceston charities are forging ahead.\nSubscribe now for unlimited access.\nor signup to continue reading\nAs Northern Tasmania families grapple with cost of living pressures, the charities who help them will share in $62,335.50 thanks to The Examiner's Empty Stocking Appeal.\nThe funds were raised by generous Launceston groups, businesses and individuals in the lead-up to Christmas 2024.\nRoderick Brown, Salvation Army's corps officer, said the funds would directly help families who are struggling.\n\"As always we're very appreciative - we all are - for the generosity of the Launceston community, and The Examiner for their faithfulness in continuing to run the appeal on behalf of the community,\" Mr Brown said.\n\"It all goes pretty well directly into that emergency relief funding space - every dollar assists.\"\nThe funds will be split between the Salvos, St Vincent de Paul, City Mission and Launceston Benevolent Society.\nLBS board member Michelle Clark said there had been no reduction in people asking for help.\nRather, the Benevolent Society is increasingly being contacted by family groups as well as single parents and individuals.\n\"We're having a lot of families with three and four children - just caught in that cycle of [struggling]. Elderly grandparents, then the parents, next generation - the cycle's not breaking at the moment,\" she said.\n\"It's certainly not going to change overnight.\"\nThe appeal's $62,000 total is on par with the tally raised in 2023, but down on previous years.\nCharity representatives say this shows that cost of living isn't just impacting a small group of people.\n\"It's just tough for people, and trying to put some sort of positive spin on there gets harder,\" City Mission's Stephen Hill said.\n\"Sometimes the people that are helping people are on that fine line as well.\n\"We've got to provide some support to [our] staff and teams that are doing it, because sometimes their personal circumstances aren't too dissimilar to the people they're helping.\n\"Just because you're working in community services and emergency relief doesn't give you a pass from experiencing those same sort of effects, so we've got to be mindful of that.\"\nNevertheless, donations are continuing to have a huge impact on the lives of Launcestonians.\n\"The support of the appeal and other generous donations that come through means that we can have the most impact on people in those circumstances,\" Mr Hill said.\n\"I think we saw more tears after appointments than we've seen before - just because there was a recognition of gratitude around the help that was given and that it actually made a difference as well.\"\nSam Grace said St Vincent de Paul was \"extremely grateful\" for the community's ongoing support.\n\"The Christmas period for a lot of families and individuals can be a challenging time, with additional pressures placed on households,\" she said.\n\"These funds are invaluable to the work and support that SVdP provides families at this special time of year.\"\nLAST CHANCE TO DONATE AS FERGUSSON FAMILY GIFTS $12K\nLaunceston residents are being asked to dig deep one last time as the curtain closes on the 2024 Empty Stocking Appeal.\nThe appeal officially closes on December 31, however, donations can still be received into the early days of January.\nTo date, the appeal has raised about $59,000.\nOne of the major contributors to this year's appeal has been the Robert Fergusson Family Trust Foundation, who gave $12,000.\n\"People are struggling at the moment and that's why we like to donate to the Empty Stocking Appeal,\" foundation director Mary Fergusson said.\n\"We like to support it because it supports four local charities and helps people who are struggling with things like utility bills, putting food on the table, car registrations, and insurance.\"\nShe said the foundation regularly receives thanks from the charities who benefit from the appeal.\n\"City Mission, Salvation Army, Vinnies and the Benevolent Society acknowledge our donations and they're very grateful for them,\" she said.\nThe 2024 Empty Stocking Appeal set out to reach $100,000.\nIf you can help push the tally closer to the target, there are several ways to donate:\n- Direct debit bank transfer (BSB: 066-743; Acc: 011517887)\n- BPAY (Biller No: 49429, Ref: 0100 0211230 01517887 3)\n- In person at The Examiner's office at Level 1, 113 Cimitiere Street.\n- Via donation tins at Northern Tasmanian newsagents (until December 31).\nLIONS ADD $2000 AS EMPTY STOCKING ENTERS FINAL DAYS\nLaunceston residents are being urged to donate to the Empty Stocking Appeal as it enters its final days for 2024.\nThis year's appeal has raised more than $56,000, which includes two recent four-figure donations.\nAn anonymous donor gave $1500 to the appeal on Christmas Eve, while $2000 was donated by Riverside Lions Club.\nThe club has been a consistent contributor to the appeal and runs several fundraising operations.\n\"We do Bunnings barbecues every Friday,\" Riverside Lions president Robert Gillow said.\n\"Through the year we've got a food van we take out to UTAS Stadium at the football games. We donate every year to the Empty Stocking fund.\"\nLike many volunteer-based clubs across the country, Riverside Lions have been experiencing declining membership.\nDirector Graham Towns said the club had 28 members, including a handful who were aged 80-plus.\n\"Our average age is 73 so we're getting tired,\" he said.\n\"We're looking for members all the time.\"\nThe Empty Stocking Appeal raises funds for Salvation Army, St Vincent de Paul, City Mission and Launceston Benevolent Society.\nYOU CAN HELP!\nThere are several ways you can donate:\n- Direct debit bank transfer (BSB: 066-743; Acc: 011517887)\n- BPAY (Biller No: 49429, Ref: 0100 0211230 01517887 3)\n- In person at The Examiner's office at Level 1, 113 Cimitiere Street.\n- Via donation tins at Northern Tasmanian newsagents.\nMODEL CITIZENS SCALE UP EMPTY STOCKING COFFERS\nThere was something different about the seven men who arrived at Kmart Launceston last week.\nAll dressed in blue, they conspicuously entered the store with trolleys full of toys and left with nothing, rather than the other way around.\nThe toys were worth about $1200 - many donated from Launceston ToyWorld - and were given to the Kmart Wishing Tree.\nAt the same time, they donated $2000 to The Examiner's Empty Stocking Appeal, pushing the tally to $55,584.784.\nThe men were members of the Launceston Scale Model Club, a hobby group known for their annual expo in Summerhill.\nThe club turn will turn 40 next year - making it one the oldest of its kind in Tasmania - and regularly donates to Launceston charities.\n\"As a club we keep enough in the bank that we can cover ourselves for a year - our rent and our expos - and the rest we donate,\" vice-president Brent MacPherson said.\n\"We usually always do The Examiner [Empty Stocking Appeal] every year and we split it up between other [charities] every year.\n\"We put it all to [charities looking after] kids this year.\"\nFunds raised in Empty Stocking Appeal are split between Salvation Army, St Vincent de Paul, Launceston Benevolent Society and City Mission.\nThe appeal runs until December 31.\nWant to help? Here's how you can donate:\n- Direct debit bank transfer (BSB: 066-743; Acc: 011517887)\n- BPAY (Biller No: 49429, Ref: 0100 0211230 01517887 3)\n- In person at The Examiner's office at Level 1, 113 Cimitiere Street.\n- Via donation tins at Northern Tasmanian newsagents.\nGENEROUS DONATION TAKES APPEAL PAST $50,000\nTime is running out to donate to the 2024 Empty Stocking Appeal, but donations keep flooding in.\nOne of the appeal's most consistent contributors, the WD Booth Charitable Trust, donated $12,000 this week.\nThe generous donation helped take the appeal's tally to $51,790.78 on December 20, and was presented by the foundation's newest trustee.\nBusinesswoman Janine Healey is a familiar face to many Launcestonians, having worked across many not-for-profit organisations and been inducted into Tasmania's Honour Roll of Women in 2021.\nShe's thoroughly enjoyed becoming a trustee since taking on the role in February.\n\"It's just fantastic to be in a position to give away money to good causes,\" she said.\n\"We understand there's lots of cost of living pressures, and a lot of the charities who look after people are struggling as well, so this is a great opportunity.\"\nThe Empty Stocking Appeal is hoping to raise $100,000 in 2024.\nThe appeal's funds will be split evenly between City Mission, Launceston Benevolent Society, St Vincent de Paul and the Salvation Army.\n\"I'd just encourage everyone, if they can, to make a contribution because it's very important to those charities,\" Mrs Healey said.\n\"This year I think in particular, even if it's a dollar here or a dollar there ... pop it in the tin and support this cause.\"\nThe Empty Stocking Appeal runs until December 31.\nWant to help? Here's how you can donate:\n- Direct debit bank transfer (BSB: 066-743; Acc: 011517887)\n- BPAY (Biller No: 49429, Ref: 0100 0211230 01517887 3)\n- In person at The Examiner's office at Level 1, 113 Cimitiere Street.\n- Via donation tins at Northern Tasmanian newsagents.",
  "word_count": 1514,
  "scraped_at": "2026-02-14T13:16:21.867895"
}