{
  "article_id": "56be6583c4f8",
  "url": "https://thepeoplesperson.com/2024/06/26/official-manchester-united-confirm-exit-of-striker-lucia-garcia-282091/",
  "title": "Official : Manchester United confirm exit of striker Lucia Garcia - Man United News And Transfer News",
  "date": "20240627T001500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United have confirmed the exit of women’s team forward Lucia Garcia.\nGarcia joined United in July 2022 from Athletic Club. She spent two years at the club where she played under manager Marc Skinner.\nDuring her time at Leigh Sports Village, Garcia managed 16 goals in 60 appearances.\nShe scored twice in the Women’s FA Cup final last month as she helped the team win their first major trophy. The victory came against Tottenham Hotspur at Wembley.\nGarcia was also part of United’s record-breaking season, which saw Skinner’s side finish second, their highest-ever finish in the Women’s Super League (WSL). The team also secured Champions League football in the process.\nA previous report covered by The Peoples Person relayed that the 25-year-old was on the brink of joining Mexican side Monterrey this summer.\nGarcia said in her goodbye message, “For me, it has been two incredible seasons. I was so happy to have been a part of this team and to have helped the team. We are like a family.”\n“I am going to miss every single piece of Manchester United. All my friends, all the team, all the staff, all the workers here.”\n“I think one of the hardest parts is to leave the fans. I feel the support they give to me. I can feel they love me and I love them.”\nShe added, “[When they chant my name] I just feel it in my heart like ‘boom, boom, boom’. They give me the power to keep going, to keep fighting.”\n“But at the end of the day, I have to say goodbye. That’s so hard for me, and the only thing I can say to you all is I love you [from] the bottom of my heart.”\nGarcia is not the only high-profile exit. Goalkeeper Mary Earps is thought to be close to sealing a switch to Paris Saint-Germain. There is also uncertainty over the future of club captain Katie Zelem as well as Nikita Parris.\nWant to be the first to hear breaking Man United news? For carefully selected, crucial updates, join our WhatsApp channel: https://bit.ly/United-Breaking-News.",
  "word_count": 351,
  "scraped_at": "2026-02-14T12:47:36.314796"
}