{
  "article_id": "56d391d58e1c",
  "url": "https://www.burntorangenation.com/2023/1/24/23569319/longhorns-daily-news-latest-texas-mens-basketball-big-12-oklahoma-state",
  "title": "Longhorns Daily News : New odds give Texas men basketball fourth - best chance for Big 12 regular season title",
  "date": "20230124T214500Z",
  "domain": "burntorangenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "BetOnline.ag released their latest lines yesterday. According to how the bettors figure it, the No. 10 Texas Longhorns men’s basketball squad currently has the fourth-best chance at taking home the Big 12 regular season title at +700.\nLonghorns Daily News: New odds give Texas men’s basketball fourth-best chance for Big 12 regular season title\nPlus: Texas men’s basketball versus Oklahoma State tonight\nTexas’ last regular season title came in in the 2007-2009 season.\nWHAT THEY’RE SAYING ABOUT THE LONGHORNS\nAustin American-Statesman: What we know about Jahmal Fenner, LBJ football and the Texas job\nDallas Morning News: Texas women’s basketball teams shut out of AP poll for first time in 47 years\nInside Texas: How can Adonai Mitchell help Quinn Ewers?\nInside Texas: How former Texas Longhorns fared in the divisional round of the NFL playoffs\nInside Texas: New arrivals, player driven competition, and a key figure’s health in the latest Texas offseason notes\nICYMI IN BURNT ORANGE NATION\nRECRUITING ROUNDUP\n247Sports: The Stampede: Recruiting scoop and updates from Texas Junior Day\n247Sports: Emptying the notebook following 2023 Polynesian Bowl\n247Sports: Elite 2025 running back Jordon Davison talks Texas Junior Day\nInside Texas: On3 Consensus 4-star OT Michael Uini recaps junior day visit to Texas\nInside Texas: More intel following Texas’ Junior Day, coaches on the road\nInside Texas: The first signing period has been a success, and the second one currently lacks punch\nBIG 12 BREAKDOWN\nAssociated Press: College basketball poll: TCU inches closer to top 10; Baylor rises to No. 17\nOklahoman: Tramel: K-State leads Big 12 after dead-last preseason prediction\nOur Daily Bears: No. 17 Baylor outshines No. 9 Kansas 75-69\nViva the Matadors: Rational and irrational expectations\nFrogs O’ War: Big 12 Power Rankings: TCU knocks Kansas off the top\nFrogs O’ War: TCU DL Lwal Uguak declares for the 2023 NFL Draft\nThe Smoking Musket: Neal Brown acknowledges that the 2022 season ‘wasn’t good enough’\nWide Right & Natty Lite: Iowa State Men’s Basketball Preview: We’re talkin’ Kansas State\nBring On The Cats: Kansas State vs Texas Tech: Can Bramlage stay Doomy today?\nRock Chalk Talk: Kansas falls short vs Baylor, 75-69\nWHAT WE’RE READING\nSB Nation: How the Bengals retooled their running game\nSB Nation: Why the NBA loves to hate the Memphis Grizzlies\nSB Nation: The stupidest people are spreading a terrible Damar Hamlin clone conspiracy theory\nNEWS ACROSS LONGHORN NATION AND BEYOND\n- Texas men’s basketball takes on the Oklahoma State Cowboys tonight at 8pm Central.",
  "word_count": 413,
  "scraped_at": "2026-02-14T13:34:42.635057"
}