{
  "article_id": "56e34c73bd0d",
  "url": "https://www.90min.com/posts/reading-vs-chelsea-womens-fa-cup-preview-tv-channel-live-stream-team-news-prediction-19-3-2023",
  "title": "Reading vs Chelsea - Women FA Cup preview : TV channel , live stream , team news & prediction",
  "date": "20230317T213000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Reading vs Chelsea - Women's FA Cup preview: TV channel, live stream, team news & prediction\nChelsea are set to continue their title defence of the FA Cup against Reading in the quarter-finals this weekend.\nThe Blues are searching for the third consecutive FA Cup, and are heading into this tie with confidence, as they've climbed back to the top of the Women's Super League table this past weekend.\nReading, on the other hand, have had a tumultuous season thus far. They're only three points off the relegation spot in the WSL, and have suffered losses to Arsenal, Liverpool, Manchester United, and Everton since the new year.\nWhere to watch Reading vs Chelsea on TV/live stream\nWhen is kick off? Sunday 19 March, 14:00 (GMT)\nWhere is the match being played? Madejski Stadium\nTV channel/live stream? FA Player (UK & international)\nReferee? Carl Brook\nReading team news\nKelly Chambers has confirmed that Deanne Rose is back in training after a long-term injury, though is not expected to play any part in this tie.\nChelsea team news\nEmma Hayes was in good spirits at her pre-match press conference, speaking highly of Sam Kerr and Lauren James after winning big at the London Football Awards, though did not disclose any injury updates.\nReading vs Chelsea score prediction\nReading's last two FA Cup matches have ended in wins on penalties, with Kelly Chambers' side beating Leicester City 3-2 on penalties after a 2-2 draw in normal time before winning against Tottenham 5-4 on peanlties after a goalless 120 minutes. They are a side that clearly can handle adversity, but Chelsea may just be too good for them to shut out on the day.",
  "word_count": 280,
  "scraped_at": "2026-02-14T12:21:20.392097"
}