{
  "article_id": "56ecf048d052",
  "url": "https://www.taiwannews.com.tw/en/news/4969276",
  "title": "Japan exits the Women World Cup but sees progress in young squad | Taiwan News",
  "date": "20230812T010000Z",
  "domain": "taiwannews.com.tw",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "AUCKLAND, New Zealand (AP) — After the Japanese were eliminated early from the Olympics two years ago on home soil, they rebuilt, hiring a new coach and focusing on youth.\nThe result? Japan scored in droves at the Women's World Cup.\nLed by coach Futoshi Ikeda, the Nadeshiko racked up 15 goals, most of any team in the tournament. Surprising young midfielder Hinata Miyazawa had five goals to lead the field, matching Japanese legend Homare Sawa’s record set in 2011.\nBut it wasn't quite enough to hold off Sweden, which knocked Japan out of the tournament with a 2-1 victory in a quarterfinal match on Friday night. Midfielder Jun Endo sat on the field for a long time after the final whistle, sobbing, as Sweden's players celebrated.\n“We knew we were going to play a very skilled and technical team,” Sweden’s Kosovare Asllani said. “We didn’t want them to have a lot of time on the ball, because that’s when they’re the best.”\nAmanda Ilestedt scored a first-half goal and Filippa Angeldal converted a second-half penalty to give Sweden a 2-0 lead. Japan couldn't manage to break through until Honoka Hayashi's goal in the 86th minute.\n“There was a lot of time spent on defense and it was difficult to find our own pace, and we weren’t able to have a good offense,” forward Mina Tanaka said.\nIkeda said the team could be proud of their accomplishments. The Japanese swept the group stage without conceding a goal, then downed Norway 3-1 in the round of 16.\nAfter all, Japan's team was young, with an average age of just 24.9 years.\n“Since I became coach, I knew I was taking them to the World Cup and I, together with the players, have worked hard to this point,\" he said. \"The players have become one unit, working in the same direction. We created an environment where each player can grow.”\nIn 2011, the Japanese downed Sweden 3-1 in the semifinals and went on to lift the World Cup trophy after a penalty shootout with the United States. It was an emotional victory because of the devastating earthquake and tsunami that struck Japan earlier that year.\nJapan also went to the World Cup final in 2015 but fell 5-2 to the United States.\nAhead of the 2019 World Cup, Japan hired coach Asako Takakura, the first woman to manage the national team, but the Nadeshiko fell to the Netherlands in the quarterfinals.\nAfter the 3-1 loss to Sweden at the Tokyo Games, Takakura was replaced by Ikeda, who coached Japan to the 2018 Under-20 Women’s World Cup title. He helped develop many players on the team, including Miyazawa.\nEndo, who plays in the United States for Angel City of the National Women’s Soccer League. said the Nadeshiko will now turn to qualifying for the Paris Olympics next summer.\n’We will need to improve the quality even more,” she said.\nIkeda said he believed the young players will learn from the loss.\n“They are experiencing the toughness of the world games. They are able to play in these matches. They have to use this as experience toward the Olympics, other preliminaries,” Ikeda said. “We want these younger players to add strength to the Nadeshiko team.”\n___\nAP World Cup coverage: https://apnews.com/hub/fifa-womens-world-cup",
  "word_count": 547,
  "scraped_at": "2026-02-14T12:16:31.534763"
}