{
  "article_id": "572e917967d6",
  "url": "https://www.independent.ie/irish-news/no-more-mr-nice-guy-outspoken-pundit-joe-brolly-launches-new-podcast-42403512.html",
  "title": "  No more Mr Nice Guy  – outspoken pundit Joe Brolly launches new podcast",
  "date": "20230324T223000Z",
  "domain": "independent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "‘No more Mr Nice Guy’ – outspoken pundit Joe Brolly launches new podcast\nOutspoken sports and political pundit Joe Brolly and award-winning journalist and author Dion Fanning have teamed up to present a new podcast billed as “a podcast for the curious.”\nThe pair will kick off their new weekly podcast called ‘Free State’ next Tuesday, describing it as one which “stimulates, provokes, challenges and entertains, while never taking itself too seriously.” “Free State covers topics from sport to politics, love to loss, the human condition and how to fix the world, with guests from across the planet including Nigerian princes, former Prime Ministers, ex-convicts, footballers, boxers, and extraordinary people from every walk of life,” they said.\nBrolly, a barrister, GAA pundit, and columnist for the Sunday Independent, said the show would mean: “No more Mr Nice Guy” while Fanning said: \"Somebody has to be the adult in the room. Unfortunately that somebody is me\".\nThe series airs on the official website freestatepodcast.com and is also available on platforms such as Spotify and Apple. Brolly, a 53-year-old former Gaelic footballer from Dungiven, Co Derry, whose side won the 1993 All Ireland football championship, is well known for sparking controversy.\nHe recently claimed the GAA’s “reputation is at stake” over a row in January concerning the controversial All-Ireland club Senior Football club final in which the Kilmacud Crokes had too many players on the pitch late in the game. He also took a swing at his former employer RTE last summer when he said the format of the State broadcaster’s Sunday Game was “stage-managed” and “entirely unnatural”. He was sacked from his role as a sports pundit for RTE in 2019 following his controversial remarks about referee David Gough's performance in the Dublin-Kerry senior football championship which resulted in a draw.\nRecently he questioned why there was no outrage when The Wolfe Tones’ Celtic Symphony was sung at a Leinster rugby game, but there was when it was sung by Ireland women soccer players celebrating their qualification for the World Cup.\nHe also criticised Roy Keane for attending the World Cup in Qatar, and he has repeatedly hit out at hardline unionists and the UK Tories over Northern Ireland.\nIn 2012, Brolly donated a kidney to another man, whom he previously did not know.\nHe recently married podcaster Laurita Blewitt, who is a third cousin of US president Joe Biden, and Biden sent Brolly a pair of presidential cufflinks as a wedding gift.",
  "word_count": 412,
  "scraped_at": "2026-02-14T12:26:25.221352"
}