{
  "article_id": "575864678019",
  "url": "https://www.birminghammail.co.uk/news/showbiz-tv/itv-james-martin-saturday-morning-30486476",
  "title": "ITV James Martin Saturday Morning fans concerned as episode ends  an hour early  ",
  "date": "20241130T114500Z",
  "domain": "birminghammail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ITV James Martin Saturday Morning fans concerned as episode ends 'an hour early'\nViewers slammed the broadcaster for slashing the runtime of James' weekly show, which today aired from 8.30am.\nITV viewers have reacted with fury after noticing an HOUR had been cut off James Martin Saturday Morning's runtime today. ITV viewers slammed the broadcaster for slashing the runtime of James' weekly show, which today aired from 8.30am.\nThe programme was broadcast at an earlier time, lasting until 10.40am, when the FA Cup coverage began. \"It's just a shame that @ITV thought we wanted to watch football instead and cut an hour off,\" wrote Twitter/X user Pete Smith.\nIt came at the same time BBC Saturday Kitchen viewers were slamming the programme's line up - and were being forced to ditch the show for James' ITV rival. \"Can this programme get any worse? Can't hear any of them for shouting over each other. OFF SWITCH #SaturdayKitchen,\" one fumed.\nREAD MORE Urgent 'stay at home' warning issued over nasty bug 'sweeping all age groups'\n\"Watching Andi Oliver on #SaturdayKitchen has reminded me of Melissa McCabe @__Feast__ who represented N.I. in this year's #GBM and who has recently opened a restaurant in Rostrevor, County Down showcasing some wonderful, tasty creations. @women_food_wifi,\" a second said.\nBut a third typed: \"They’re so loud and annoying. Feel like I’m watching Saturday morning kids TV from the 80s. Hell from me.\" ITV cut from James to air Wealdstone v Wycombe Wanderers with an 11.30am kick off today. A show synopsis explained: \"All the action from the second-round tie at Grosvenor Vale. National League outfit Wealdstone shocked League Two Grimsby Town in the previous round with a 1-0 away win.\"\nThe Radio Times preview for the clash went on to also add: \"They now entertain a team that are flying high in League One, but were made to work hard for a 3-2 home win against York City in round one. Mark Pougatch presents, with analysis from Stuart Pearce and Jobi McAnuff, commentary by Sam Matterface and Lee Dixon, and reports from Gabriel Clarke.\"",
  "word_count": 347,
  "scraped_at": "2026-02-14T13:40:12.651609"
}