{
  "article_id": "5759e00af0ca",
  "url": "https://www.westmeathindependent.ie/2023/12/22/ange-postecoglou-european-super-league-constructed-by-people-detached-from-game/",
  "title": "Ange Postecoglou : European Super League constructed by people detached from game",
  "date": "20231222T174500Z",
  "domain": "westmeathindependent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ange Postecoglou: European Super League constructed by people detached from game\nBy Jamie Gardner, PA Chief Sports Reporter\nTottenham manager Ange Postecoglou says ideas like the European Super League often come from people who are “detached from what this game is all about”.\nSpurs were one of six English clubs who were signed up to the original Super League in 2021 before swiftly withdrawing amid fan protests.\nA European Court of Justice ruling on Thursday has forced UEFA to at least listen to proposals for rival competitions like the Super League in future, but all six Premier League teams involved last time have already distanced themselves from any attempt to revive the ESL.\nLabour leader Sir Keir Starmer has also vowed he will “make sure the European Super League doesn’t happen” if he becomes prime minister, but Postecoglou believes the plans are a non-starter if fans are not on board.\n“The response it got the first time around is a pretty good indicator of where it sits within the footballing fraternity in general,” the Australian said.\n“That’s always a pretty decent barometer. I always think with these concepts they’re always done in a room with people who sometimes are detached from what this game is all about.\n“It won’t surprise anyone that I’m fairly conservative with these things. I’m a traditionalist. I don’t like the game changing too much, I don’t like rules changing too much.\n“But I guarantee you I won’t be in that room when these kind of concepts are put together. But you have a fairly good barometer of what the most important people – the fans – felt about it and football people in general, so we’ll see what the outcome is.”\nArsenal and Liverpool issued statements pledging their commitment to the European football mainstream on Friday, after the other four members of the ‘Big Six’ had done so on Thursday.\nThe company behind the original Super League project, A22, announced details for new “open and meritocratic” men’s and women’s competitions within hours of the ECJ ruling on Thursday morning. In the men’s competition, 64 teams would be involved with 20 places available each year to teams based on their domestic performance.\nUEFA president Aleksander Ceferin mocked the proposals and said the format was “even more closed” than the one put forward in 2021, but A22 founder John Hahn told the PA news agency the principles of relegation and promotion were in line with domestic competitions across UEFA’s 55 member associations.\nReal Madrid and Barcelona, key supporters of the 2021 project, are on board. Juventus and AC Milan, two of the other 12 involved, have not commented yet but Inter Milan have strongly rejected it, so too Spanish side Atletico Madrid.\nThe president of Italian champions Napoli, Aurelio De Laurentiis, said his club was ready to hold talks over the new project. Napoli were not one of the 12 clubs who launched the 2021 Super League.\nCeferin said “football is not for sale” at a press conference on Thursday, which significantly featured executives from all the key stakeholder groups – clubs, leagues, players and fans.\nClubs have gained considerable concessions since 2021 – a new Champions League format starting next season featuring more matches, and the scope for even more in the future, and the establishment of a joint venture with UEFA to oversee commercial matters linked to the Champions League and other club competitions.\nThe ruling on Thursday clearly empowers clubs, but in the short term may be the catalyst for further reform in their favour rather than revolution.\nThe Saudi-led takeover of Newcastle effectively means the Premier League now has a ‘Big Seven’, but Magpies boss Eddie Howe said he was against the idea of a Super League.\n“I like the structure as it is,” Howe said.\n“I think the big thing in England was our supporters of football let their feelings be known the previous time that this was mentioned, and really I think ultimately it’s their call which way they want this to go.”",
  "word_count": 672,
  "scraped_at": "2026-02-14T12:46:22.285728"
}