{
  "article_id": "57591c742dce",
  "url": "https://www.redlandcitybulletin.com.au/story/8648326/jada-whyman-reflects-on-all-stars-match-against-arsenal/?cs=2678",
  "title": "Jada Whyman reflects on All Stars match against Arsenal | Redland City Bulletin",
  "date": "20240601T104500Z",
  "domain": "redlandcitybulletin.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "\"Young Jada would have been over the moon.\"\nCreate a free account to read this article\nor signup to continue reading\nShe's the girl from Wagga Wagga who has taken on the world and Jada Whyman is still in awe of the opportunities she's been given.\nSelected in the first A-League All Stars team to compete against Arsenal last week, the 24-year-old has a football resume as impressive as it is long.\nHighlighting the growth in appetite for women's soccer, more than 42,000 fans packed into Docklands Stadium for the game.\nSubbed on in the 44th minute, Whyman stepped into goals for retiring Matildas teammate Lydia Williams.\nHer first game since announcing her coming retirement, Williams had an emotional walk to the bench, embracing with her All Stars teammates and fellow Matildas on the Arsenal side.\nBut perhaps no hug was bigger or tighter than that she gave Whyman as the pair traded places.\n\"Young Jada would have been over the moon I think, I know I am now,\" Whyman said.\n\"It was so special for me being able to be subbed on for [Williams] and the career that she's had has been fantastic.\n\"To have that little moment where she's coming to the end of her career is very special to me, and something I will hold close to my heart for the rest of my career.\"\nAfter 19 years on the national roster, Williams will retire from international football after the 2024 Paris Olympics.\nShe'll continue in the A League for one more season.\n\"It's amazing to see the standing ovation that she got coming off the field, I think it just shows the impact she's had on football, not from just when the World Cup happened but long before that even happened,\" Whyman said.\n\"She has created such a pathway for all of us as footballers and for the game to be where it is today.\n\"I just can't speak more highly of her, I had the best week with her and I'm still learning off her every day.\n\"I had tears in my eyes when she was walking off, it was a pretty cool moment for me.\"\nNot only an outstanding experience for players, the game was a rare opportunity for Australian fans to see Women's Super League action in person.\nThe 2023/24 A League Women's season broke the league's attendance record with more than 312,000 fans watching games in person.\nWhyman's Sydney FC welcomed on average 7000 fans to Leichhardt Oval for home games.\nWhile attendance records reflect women's soccer's growing reach in the sport market, Whyman said more change is required at the top level.\n\"The Matilda's effect is very much still in force but I think for it to continue we also need the investment from our A League clubs to continue,\" Whyman said.\n\"The community I think has gotten amongst us hugely, I don't think that's the problem at this point. we have fans showing up to games, we have community grassroots increasing participation every month, I think we from top down need that investment through the A Leagues.\n\"I think the football community have done their part, the rest have to follow.\"\nReturning to national team camp this week ahead of the Matildas friendlies against China, Whyman continues to soak in every word Williams says.\nInvolved with the national system at the youth level since 2013, and the senior level since 2018, Whyman is yet to make her debut.\nMissing selection in the final World Cup squad in July 2023, Whyman returned to the Matildas squad in November last year.\nFeeling confident in how she is playing she is hoping to continue to develop not only through the camp but in the coming seasons.\n\"Goalkeeping is a long-term prospect and for me, I think it's going to be continue developing,\n\"Just coming off a season I'm feeling quite fit and playing wise I feel very confident in how I am playing.\n\"I just want to continue to build upon that within this camp, it's great being around top players that have just come off their seasons as well, so I'm just enjoying the fact of being in Matildas camp and learning what I can and playing my part where I can.\"\nThe Matildas will play two friendlies against China ahead of the Olympics, the first game on May 31 in Adelaide and the second on June 3 in Sydney.",
  "word_count": 738,
  "scraped_at": "2026-02-14T12:41:37.981541"
}