{
  "article_id": "57835a95bbad",
  "url": "https://www.canberratimes.com.au/story/8392635/careful-what-you-wish-for-united-coachs-var-warning/?cs=14280",
  "title": "  Careful what you wish for : Canberra United coach VAR warning for A - League Women | The Canberra Times",
  "date": "20231019T193000Z",
  "domain": "canberratimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Canberra United coach Njegosh Popovich has backed the A-League Women competition to adopt Video Assistant Referee technology - but with a warning.\nSubscribe now for unlimited access.\nor signup to continue reading\n\"Sometimes you've got to be careful what you wish for,\" he told The Canberra Times.\n\"I think that any technology and any improvement that's available is good for the game.\n\"But you watch the English Premier League, there's people that still don't understand VAR.\"\nVAR is currently used in the A-League Men's competition but not for the women. It's also used in every major domestic men's league in the world, and at international tournaments such as the World Cup.\nIn England's Women's Super League there's been recent debate about whether VAR should be brought in too, as like in Australia it's used in the men's top competition but not for the women.\nFootball Australia head of referees Nathan Magill said whether VAR is adopted in the A-League Women would be a better question for the Australian Professional Leagues, as they fund and oversee its implementation.\n\"A lot of it comes down to the stadium requirements where the matches are played and having consistency across the board,\" he said.\n\"At this stage, we're focused on the enhancements for the A-League Men's competition but I couldn't comment on where the APL would be for further expansion [to the A-League Women].\n\"VAR has been locked in for two years.\"\nVAR doesn't come without controversy though, as every decision it can add clarity too, there is always the risk of error, and that is what Popovich is wary of.\n\"VAR doesn't get it right every single time,\" he said.\nLast weekend Canberra had a 4-4 draw with Adelaide United in their season-opener, and there was no shortage of dramatic moments in the match described by vice-captain Nikki Flannery as \"bizarre\" and \"insane\".\nA total of three penalties were awarded on Sunday - two to Adelaide and one to Canberra, and in the 97th minute Vesna Milivojevic had a winning goal denied for being deemed offside by the assistant referee.\n\"It's just one of those ones for us,\" Popovich said, adding he didn't take issue with any of the refereeing decisions in the game.\n\"You can only control the controllables, and until the A-League makes a decision that VAR is a worthy thing to have for us, we've just got to be dealing with what we have.\"\nA-League Women round 2\nSaturday: Melbourne City v Canberra United, in Melbourne, 2.45pm.\nOur journalists work hard to provide local, up-to-date news to the community. This is how you can continue to access our trusted content:\n- Bookmark canberratimes.com.au\n- Download our app\n- Make sure you are signed up for our breaking and regular headlines newsletters\n- Follow us on Twitter\n- Follow us on Instagram",
  "word_count": 471,
  "scraped_at": "2026-02-14T12:40:53.468514"
}