{
  "article_id": "57ba9f32a5b8",
  "url": "https://metro.co.uk/2025/04/29/itv-releases-statement-ian-wright-amid-eni-aluko-punditry-row-22995387/",
  "title": "ITV releases statement on Ian Wright after Eni Aluko punditry row",
  "date": "20250429T163000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ITV have thrown their public support behind Ian Wright after the pundit was accused of ‘blocking’ opportunities for female broadcasters in women’s football by Eni Aluko.\nLast Wednesday, Aluko suggested that Wright needed to ‘be aware’ of the amount of punditry work he was doing which could block opportunities for female pundits.\nJust two days later, the former Chelsea and Lionesses forward issued a public apology to Wright, describing him as a ‘brilliant broadcaster and role model’.\nThe pair have worked together for several years on ITV covering England men’s and women’s matches. However, in a public response on Sunday, Wright said that he could not accept Aluko’s apology.\n‘I’ve got to say, I’m very disappointed about what Eni has said, she knows how I’ve helped her, supported her publicly, and I know the previous conversations she’s had with me and my management,’ Wright said.\n‘I’ve seen the apology on social media but I can’t accept it. but I also want to move on.’\nITV have now waded into the debate, with the broadcaster strongly backing Wright in a statement that undoubtedly raises questions about Aluko’s punditry future with the channel.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Ian’s standing in the sport is beyond question,’ an ITV spokesporson told The Guardian.\n‘As one of the UK’s most respected and much-loved footballers and sporting broadcasters, with a career spanning nearly four decades, Ian is an incredible advocate, ally and brilliant broadcaster of women’s football from a grassroots level as well as at the highest international competitions.’\nWright will be part of ITV’s coverage of the FA Cup final next month, but the broadcaster is yet to confirm its punditry lineup for the summer’s footballing action.\nEngland men’s World Cup qualifiers will be shown on ITV in June before the Lionesses seek to defend their European Championship crown in July, which will be broadcast on both the BBC and ITV.\nAluko, meanwhile, was scheduled to co-host the third edition of the Women’s Football Awards on Thursday but, on Tuesday, announced she would be stepping back from the role.\nMore Trending\n‘The Women’s Football Awards hold a special place in my heart. It was the first time an event of this scale was created solely to celebrate the incredible achievements in women’s football, and I’m so proud to have been part of it since the beginning,’ a statement began.\n‘However, I’ve decided to take a step back from being part of the hosting lineup this year. I don’t want anything to deflect from the joy, recognition, and celebration that this event is all about.\n‘This event belongs to the players, coaches, fans, and everyone who has worked tirelessly to elevate the women’s game.\n‘The awards will be hosted in the very capable hands of Gabby Logan and Jamie Carragher, who I know will bring their passion and energy to the stage. I love women’s football deeply, I’m proud of how far we’ve come, and I’ll absolutely be back involved in the future.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Ian Wright ‘very surprised’ by Mikel Arteta tactic during Arsenal’s defeat to PSG\nMORE: Ian Wright names PSG’s possible weak link against Arsenal\nMORE: Roy Keane and Ian Wright make FA Cup final predictions after Man City beat Nottingham Forest",
  "word_count": 609,
  "scraped_at": "2026-02-14T13:06:16.895805"
}