{
  "article_id": "57f79eee7ab5",
  "url": "https://www.bbc.co.uk/sport/football/66420237",
  "title": "England 0 - 0 Nigeria : Lionesses win penalty shootout to reach quarter - finals",
  "date": "20230807T144500Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England 0-0 Nigeria: Lionesses win penalty shootout to reach quarter-finals\n- Published\n- comments\nEngland scraped through to the quarter-finals of the Women's World Cup with a dramatic penalty shootout victory over Nigeria despite Lauren James' red card.\nGeorgia Stanway fired wide with the opening penalty but Nigeria missed their next two efforts and the European champions secured their spot in the last eight when Chloe Kelly smashed in the winning kick.\nIn an outburst of frustration, James stamped on Michelle Alozie's back in the 87th minute after losing possession and was rightly shown a red card following a video assistant referee (VAR) review.\nEngland were given an almighty scare but face Colombia or Jamaica next at 11:30 BST on Saturday.\nIt was an excruciating watch for England supporters in Brisbane as the Lionesses played 120 minutes on a knife's edge and were largely second best to Nigeria.\nJames' petulance meant England had to navigate extra time with 10 players, and Nigeria had their tails up following a sustained period of pressure prior to the Chelsea star's sending-off.\nThe nine-time African champions executed their gameplan to perfection, frustrating England, causing them problems on the break and winning almost every duel.\nThey hit the crossbar in each half, Ashleigh Plumptre's powerful drive ricocheting off the woodwork before Uchenna Kanu's header looped over goalkeeper Mary Earps and bounced off the top of the bar.\nEarps was kept busy throughout, needing to produce smart saves to deny Plumptre at her near post in the first half and later keeping out Uchenna Kanu, who had an excellent performance.\nSarina Wiegman's England side thought they had a penalty in the first half when Rachel Daly went down claiming a push by Rasheedat Ajibade, but it was overturned by VAR.\nEventually, England stumbled to the end of normal time lacking the fluidity they showed in abundance in the impressive display against China and held on to seal the deal in a shootout.\nOnly 24 hours earlier, back-to-back champions the USA were knocked out of the competition, and England were forced to show resilience to overcome one of their most challenging matches of Wiegman's tenure.\nJames' red card puts dampener on impressive tournament\nIn the build-up to England's last-16 tie there was plenty of praise for James, who has been simply sensational so far in Australia.\nThe 21-year-old stole the show in Adelaide when she scored two goals and assisted three in England's thrashing of China in their final group game.\nBut, as Wiegman has often reminded people, James is still young in terms of international experience, with this only her 15th appearance since making her debut a year ago.\nShe struggled to get on the ball in the first half as England's build-up play was slow and disconnected - a far cry from their slick attacking play against China.\nAs the game wore on several England players became frustrated. They were fortunate James' stamp did not prove too costly and they showed the type of resilience that has formed since Wiegman's arrival in September 2021.\nJames will miss the quarter-finals and could face a longer suspension should Fifa deem it worthy.\nHer loss will certainly be felt given she is England's leading scorer at the tournament, having also popped up to provide the winner in the 1-0 victory over Denmark in the second group game.\n\"I don't know what my heart rate is, I just know I'm 10 years' older,\" said manager Wiegman.\n\"I was not worried. It was a really intense game. Nigeria has done really well in the group stages so we were not underestimating them at all and they showed what a good team they were.\n\"We had trouble getting out of their press. We could do a little better but I also think we should give them credit.\"\nNigeria leave with heads held high\nNigeria manager Randy Waldrum had already praised his side's efforts in escaping a group containing Olympic champions Canada, co-hosts Australia and plucky debutants the Republic of Ireland.\nHe said victory over European champions England could have had \"significant implications\" for the development of women's football in Nigeria, but they can exit the tournament with their heads held high.\nThey more than matched England and carried momentum going into extra time, but just could not provide the ruthlessness that was needed.\n\"[The players] have been fantastic all tournament,\" said Waldrum. \"We've played four matches, including against the Olympic gold medallists and the European champions and had clean sheets in those games.\n\"I'm so proud of them. They have such a bright future. The players came together in an unbelievable way. They just played their hearts out and I couldn't be more proud of them.\n\"We can be and should be one of the top teams in the world. I think we have shown we're capable of playing with anybody.\"\nEngland captain Millie Bright made numerous last-ditch blocks, Earps faced more shots in the first half than in any other game under Wiegman and Nigeria rattled the Lionesses.\nAll signs had started to point to a historic Nigeria victory - they were seeking to become the first African nation to win a knockout tie - and even a corner from Stanway floated out of play in a rare break-up of Nigeria possession late in the second half.\nBut in the end England found a way, as they so often have under Wiegman, and it was the familiar sight of Kelly - who netted the winning penalty in the shootout victory over Brazil in the Women's Finalissima and scored the Euro 2022 winner against Germany - who ran away celebrating at the end.",
  "word_count": 942,
  "scraped_at": "2026-02-14T13:26:24.569994"
}