{
  "article_id": "5822de244fe3",
  "url": "https://www.mirror.co.uk/gaming/ea-fc-24-premier-league-32654917",
  "title": "EA FC 24 Premier League TOTS : latest leaks , release date , and what to expect",
  "date": "20240423T174500Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EA FC 24 Premier League TOTS: leaks, release date and what to expect\nEA Sports is set to continue the EA FC 24 TOTS promo this week with the release of the Premier League TOTS squad.\nThe Premier League TOTS (Team of the Season) squad is next up in Ultimate Team. Here's what to expect from the upcoming EA FC 24 Premier League TOTS promo.\nTOTS officially kicked off in EA FC 24 Ultimate Team last week, with EA Sports releasing the TOTS Live squad into UT packs, the first squad of the EA FC 24 TOTS promo. The TOTS Live squad replaced the Community TOTS squad in what was a big change, but the EA FC 24 Premier League TOTS squad is set to be released next – one of the most anticipated releases in the entire Ultimate Team calendar.\nWith the Premier League playing host to some of the biggest names in world football, the EA FC 24 Premier League TOTS squad is set to include some of the best players so far in Ultimate Team, and a few early EA FC 24 Premier League TOTS leaks have confirmed this. Unlike in FIFA 23 and FIFA 22, there will be no public fan vote to choose the EA FC 24 Premier League TOTS squad, with the Bundesliga TOTS the only league given a public vote.\nHere's everything we know about the upcoming EA FC 24 Premier League TOTS squad, including leaks, what to expect, and the release date.\nREAD MORE: EA FC 24 Squad Battles TOTS rewards: TOTS packs and player picks feature as rewards updatedREAD MORE: EA FC 24 Champions TOTS rewards: red picks return as FUT Champs rewards updatedEA FC 24 Premier League TOTS: release date\nEA Sports released the EA FC 24 TOTS release schedule last week, and based on this, we expect that the Premier League TOTS squad will be released on today at 6pm BST / 1pm EST / 10am PDT. The promo squad is expected to be available in packs for a week before being replaced by the Bundesliga TOTS squad on Friday, May 3.\nThe release schedule confirmed that the Premier League TOTS squad will be released between Friday, April 26 and Friday, May 3, with a Mixed League TOTS squad and a WSL TOTS squad also releasing during this period; but, with the Premier League a major league, it will more than likely be released on Friday, while the Mixed League TOTS squad and the WSL TOTS squad may be released on Monday, April 29, and Wednesday, May 1.\nEA FC 24 Premier League TOTS: leaks\nThe entire EA FC 24 Premier League TOTS squad has been leaked by reliable leaker @FutSheriff, with some interesting selections made. There are 18 players in total including three TOTS Moments, the same as in FIFA 23.\nHere's every EA FC 24 Premier League TOTS leak we know so far:\n- ST: Erling Haaland (Manchester City)\n- CB: Virgil van Dijk (Liverpool)\n- CDM: Rodri (Manchester City)\n- RW: Mohamed Salah (Liverpool)\n- GK: Alisson (Liverpool)\n- RW: Bukayo Saka (Arsenal)\n- CDM: Declan Rice (Arsenal)\n- LW: Phil Foden (Manchester City)\n- CB: William Saliba (Arsenal)\n- LW: Heung-Min Son (Tottenham)\n- CB: Gabriel (Arsenal)\n- CM: Alexis Mac Allister (Liverpool)\n- CAM: Cole Palmer (Chelsea)\n- ST: Ollie Watkins (Aston Villa)\n- RB: Ben White (Arsenal)\n- CM: Kevin De Bruyne (Manchester City) - TOTS Moments\n- CF: Christopher Nkunku (Chelsea) - TOTS Moments\n- LW: Alejandro Garnacho (Manchester United) - TOTS Moments\nEA FC 24 Premier League TOTS: what to expect\nAs with every promo in EA FC 24, we can expect to see some more Premier League TOTS players released as SBCs and Objectives, so keep your eyes peeled for those. The Ultimate Team season is also set to refresh the day before the Premier League TOTS begins, so a fresh batch of daily log-in upgrades and Premier League TOTS players as season objective rewards could potentially arrive.\nWhen the TOTS Live squad was released, EA rewarded every player in Ultimate Team a free TOTS Live guaranteed pack. We could get this for the Premier League TOTS – wishful thinking, I know. We may also see a Premier League TOTS evolution released, potentially similar to the current TOTS Live evolution where you could evolve a Premier League TOTS player from your club.",
  "word_count": 732,
  "scraped_at": "2026-02-14T12:22:36.082146"
}