{
  "article_id": "5828c123a48e",
  "url": "https://mlsmultiplex.com/uswnt-vs-china-prediction-projected-lineup-how-to-watch-01jwh83z3dvm",
  "title": "USWNT vs China : Prediction , projected lineup , how to watch",
  "date": "20250531T110000Z",
  "domain": "mlsmultiplex.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On Saturday, the United States women's national team will face off against China in a friendly. With some new faces like Lo’eau LaBonta making the team, Emma Hayes is continuing to experiment to see which players should receive regular call-ups. Here's what should fans know about the game.\nHow to watch USWNT vs. China\nTime: Saturday, May 31, 5:30 pm ET\nVenue: Allianz Field - Saint Paul, Minn.\nTickets: Click here\nTV & streaming: TBS and Max in English; Telemundo Deportes and Peacock in Spanish\nThe USWNT projected lineup\nThe USWNT lost their last match against Brazil in April, so they will aim to reverse their recent misfortunes by beating China. At the same time, this is another great window for Hayes to take a risk with her squad and experiment. She has proven her ability with her first-choice XI in a competitive environment already by winning the gold medal in the Olympics last summer.\nHowever, she must prove she can lead the USWNT to success with other players. Clearly, it will be some time before Triple Espresso is back with the national team. Sophia Wilson and Mallory Swanson are both pregnant. And Trinity Rodman is nursing her back injury and is not playing. She was brilliant in the last window, but sadly, her back is causing more problems than anticipated.\nHayes still has multiple options in the final third, but the issue is finding the right combination. On the other end of the formation, there is a goalkeeper competition. The decision on who will become the new first-choice keeper after Alyssa Naeher’s retirement from international football is still up in the air. Claudia Dickey, Mandy McGlynn, and Phallon Tullis-Joyce are all competing for that role in this window.\nTherefore, fans should expect the Starting XIs to differ drastically between the games against China and then Jamaica on Tuesday.\nUSWNT projected Starting XI (4-2-3-1, from left to right)\nMandy McGlynn (GK) - Crystal Dunn, Naomi Girma, Emily Sonnett, Emily Fox - Sam Coffey, Lily Yohannes - Ally Sentnor, Lindsey Heaps, Michelle Cooper - Catarina Macario\nUSWNT player status report\nGisele Thompson - out (hip)\nUSWNT vs China prediction\nHayes is expected to play around with the lineups, and maybe she will put a far more experimental XI than what is outlined above.\nYet, the Stars and Stripes are still in first place in the FIFA rankings, and China sits in 17th. As such, they still should end the game with a win. The roster for this window has some great scorers like Lynn Biyendolo, Macario, and Alyssa Thompson.\nThis friendly could be a little ugly, but the USWNT should win by a couple of goals. It would be surprising if they left Saint Paul with a draw or a loss.",
  "word_count": 460,
  "scraped_at": "2026-02-14T12:11:25.718041"
}