{
  "article_id": "58333bd2507b",
  "url": "https://cointelegraph.com/magazine/polkadot-indy-500-driver-conor-daly-dad-holds-dot/",
  "title": "Polkadot Indy 500 driver Conor Daly :  My dad holds DOT , how mad is that ? ",
  "date": "20240619T170000Z",
  "domain": "cointelegraph.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Conor Daly’s name is synonymous with speed. A legacy of agility and adrenaline courses through his veins, inherited from his father, the legendary Irish Formula One driver Derek Daly.\nHe’s also become part of the Polkadot family, so members of the community and staff from its developers, Parity Technologies, headed down to the 108th Indy 500 event on May 26 to watch him race. Daly surged from his 29th-place start out of 33 cars to the front of the pack and remarkably led for 22 laps.\nGiven that he was driving a pink Polkadot-branded DRR-Cusick Motorsports Chevrolet, he helped get the DOT brand out to a total TV audience of 13.3 million — and many more around the world — for around 10% of the 200-lap race.\nTo be fair, most would have asked, “What’s a Polkadot?” but it’s a start.\nDaly finished in 10th place in Indianapolis and won the “biggest mover” trophy.\nChrissy Hill, interim COO for Parity Technologies, said it was an amazing race to watch.\n“It was a momentous event, one that features on many people’s bucket lists, and I felt very privileged to be there as part of the team and the community,” says Hill.\n“Conor is an exceptional individual, and we were immensely proud to be the sponsors, reaching an audience of 13 million people, not including the impact on social media,” she said.\nCrypto and car racing: F1, Indy 500 and Supercars\nDuring the last bull run, crypto became heavily involved in the world of motorsports. In 2021, crypto exchanges signed dozens of high-profile, multimillion-dollar sponsorship deals with almost every Formula One team. By the start of the 2022 season, there were 16 official crypto team sponsors, in addition to Crypto.com, which became the flagship sponsor of the races themselves.\nHowever, the collapse of FTX and the bear market that followed saw much of that money dry up, though Crypto.com, a Singapore-based exchange and the first crypto brand to get involved in the sport, is still part of the fabric.\nIts name can be seen on hoardings around every circuit on the Grand Prix calendar, as well as on the cars of the Aston Martin Cognizant racing team. Cryptocurrency casino and betting platform Stake will also prominently feature over the next two years of Formula One, thanks to its naming rights for Sauber’s F1 car (a partnership announced by Drake).\nAnd OKX is continuing its sponsorship of McLaren race cars in 2024 and its relationship with star Aussie driver Daniel Ricciardo enabled Cointelegraph to chat with him in 2022 and 2023.\nOther players, such as the Minima layer-1 blockchain for DePin projects, are involved with the Supercar series via a data tracker for the McLaren GT4 supercar.\nHowever, this year, Polkadot is the only crypto entity to sponsor the Indy 500.\nWho is Conor Daly?\nDaly is the son of Ireland’s most successful F1 driver, Derek Daly, who raced in 49 F1 Grands Prix in the late 1970s and early 80s for teams like Tyrrell and Williams.\nBut he’s not merely riding on the coattails of a storied family name. With over 100 IndyCar races under his belt, including standing atop the podium and earning pole positions, Daly has carved out his own niche in the fiercely competitive world of motorsports.\nHe has won races at almost every level up to IndyCar and has won three championships. He’s been on the podium a lot. He is also only one of 29 drivers who have competed in both the Indy 500 and the Daytona 500 in the same year and driven in the Formula 2 series in Europe. Daly is also following in his father’s footsteps in broadcasting and hosts his own very popular podcast called Speed Street.\nSo, how did he end up flying the flag for Polkadot?\n“I’m not a tech leader, but I love to understand what is going on. When I first heard about Bitcoin, I was fascinated. Web3 is a huge interest to me and I love following the really smart people in this space. This is the future of the internet,” he tells Magazine.\n“I got a long message one day from Chris Wade from within the Polkadot community — it was a very long message. He said that it would be cool for Polkadot to be part of the largest attended sporting event in the world. He used a lot of words that I had to look up, but I knew that to win the Indianapolis 500 we needed sponsorship, so I paid attention.”\nWade runs an educational platform called Learn Polkadot. Once he captured Daly’s attention, he worked with a group of other community members to get the proposal through.\nSponsorship is vital in motor racing. A lot of money is required to ensure the car and team are running at peak performance.\n“I’m not an arrogant person, but I love Indy 500. I also believe that the exposure Polkadot can achieve is huge and opens the door to a whole new audience. At the same time, I discovered my dad holds DOT — and I never know. How mad is that?” Daly says.\nWhy did Polkadot decide to sponsor Daly?\nCreated by Ethereum co-founder Gavin Wood, Polkadot’s DOT had a huge run in 2021 and 2022 but has since slipped out of the top 10 and is down 44% since March. So while it has a big treasury in control of 41 million DOT (equivalent to $410 million) it could also benefit from greater exposure.\nWith a $9 billion-plus market cap, Polkadot is one of the largest Web3 protocols to have fully decentralized governance. The community of DOT holders can vote in favor of funding proposals through a process in which their tokens are locked up for a set period. This is part of the onchain decentralized initiative known as OpenGov, which was introduced in mid-2023 and also handles technical updates in the Polkadot ecosystem.\nOpenGov led to a remarkable rise in governance activity, with the average number of referenda and votes surging by 1,008% and 1,981%, respectively, in the first six months.\nTreasury proposals also saw a substantial increase of 405%.\nThe Daly proposal, OpenGov referendum #514, received overwhelming support from thousands of voters and committed 290,000 DOT to cover the sponsorship fee and associated costs for Daly’s race team.\nWhile it’s easy enough for a centralized exchange like Crypto.com to decide to pay sports sponsorship packages, there are significant challenges for a decentralized network like Polkadot to do the same. In early 2022, there were hopes the community might find a way to sponsor Spanish football giants FC Barcelona, but OpenGov had not been established at this point, and the bid fizzled out.\nHill says Daly was the first major sports sponsorship by the DAO and she wasn’t entirely sure if the community would get on board.\n“When you’re trying to get a community to vote on and pass a proposal to sponsor something that is sports-related, you have to do a lot of education around it, and you just can’t assume that people will know. It’s a different conversation than just a straight-up corporate sponsorship.”\nBut as it happened, the support was overwhelming.\n“He greatly impressed the Polkadot community, earning a remarkable 95.8% approval rating for his proposal,” Hill notes.\n290,000 DOT sports sponsorship package\nThe value of the sponsorship is about $2.1 million, and Daly says that’s something he does not take lightly.\n“It was a proud day when I received this grant, and I will do everything in my power, including winning, to repay this vote of confidence. At the track we are handing out thousands of leaflets on our hero cards with the QR codes for people to download a wallet and start their crypto experience.”\nDaly is now pretty in pink with the Polkadot branding. He sees a huge potential going forward to bring a whole new audience to crypto through racing.\n“My job is to make sure that our partnership benefits everyone – bringing Polkadot people to racing and racing people to Polkadot. And to win,” says Daly.\nBorn again crypto fan\nDaly has cryptocurrency firmly in his blood now. In July, he and a number of his team are hoping to travel to Brussels to speak at the Polkadot Decoded conference. He says he hopes to meet some of the people who backed his car and career.\n“It’s pretty unusual to secure a sponsorship based on voting — it’s very humbling. It would be a great honor to meet the community and explain what it is that I do and learn more about the Polkadot community, of course,” says Daly\n“Oh, and did I mention my Dad has some DOT? I never knew until I began this journey. It was meant to be.”\nIt sounds like Daly is lucky to even have his father still around, given the picture he paints of how more dangerous things were when he was racing.\n“Everyone crashes, every driver crashes, and I’m lucky not to have crashed in the past six years, and even then, I did not suffer injuries. In my father’s day, they were all lunatics and it was much more dangerous.”\nJillian Godsil\nBitcoin in jeopardy, Ether briefly breaks records, Biden takes action: Hodler’s Digest, Jan. 17–23\nThe best (and worst) quotes, adoption and regulation highlights, leading coins, predictions and much more — one week on Cointelegraph in one link!\nRead moreNBA star Tristan Thompson misses $32B in Bitcoin by taking $82M contract in cash\nNBA star Tristan Thompson says taking his $82M contract in 2015 in Bitcoin would have been “the best gamble in American sports history.”\nRead moreBrandt says Bitcoin yet to bottom, Polymarket sees hope: Trade Secrets",
  "word_count": 1623,
  "scraped_at": "2026-02-14T12:52:16.808893"
}