{
  "article_id": "584325af933a",
  "url": "https://theathletic.com/4706430/2023/07/20/sam-kerr-injury-australia-world-cup/",
  "title": "Sam Kerr shock injury overshadows Australia winning start at World Cup",
  "date": "20230720T163000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Stumbling on without your main character is very difficult. The US Office wasn’t the same after the departure of Steve Carell. Queen were so obviously all about Freddie Mercury that their performances with a replacement singer had to be billed as ‘Queen + Paul Rodgers’, and it still didn’t feel right.\nAdvertisement\nAustralia, co-hosts of World Cup 2023, find themselves in a similar situation. Since the decision to award this tournament to Australia and New Zealand four years ago, everyone knew this World Cup was all about Sam Kerr. Walk around Sydney this week and it’s obvious she is the literal poster girl for it.\nGO DEEPER\nThis is Sam Kerr, Australian sporting icon\nBut, in a tournament already damaged by the absence of other key players through injury — Vivianne Miedema, Beth Mead and Amandine Henry to mention three — came the biggest story so far. Kerr limped out of Australia’s warm-up in training yesterday with a calf injury. We don’t know the severity, but Australia manager Tony Gustavsson hinted it was serious. “She’ll be out for two games,” he said. “That tells you a bit about what grade it is.” But what Gustavsson really meant was that Kerr was definitely out for two games, and then the injury will be assessed. We could be talking about more than two games.\nAustralia announced that Kerr was out just two minutes before the team sheets were revealed, although they knew about her absence long before. Kerr’s troublesome calf injury flared up at the start of yesterday’s training session, but she conducted Australia’s press conference last night, with no mention of her problem. Don’t take her or Gustavsson on in a game of poker.\n“I hope you respect and understand the reason I couldn’t speak openly about it,” said Gustavsson afterwards.\n“At that point, we didn’t know 100 per cent what it was. We had a meeting at 9:30 last night, and that’s when we got the sad news. (Stopping) Sam was a massive part of Ireland’s game plan, so we didn’t want to give that away in advance. We didn’t play any mind games on the day. But we wanted to wait until the last second.”\nFollow the Women’s World Cup on The Athletic…\n- Women’s World Cup 2023: Group guides\n- Women’s World Cup fixtures, results, tables\n- Women’s World Cup 2023: Everything you need to know\nAnd so, rather than Kerr leading out her country for the biggest game in the history of Australian football, she was a reserve. Named as a substitute to allow her to sit on the bench and remain close to the team, Kerr still acted like a captain.\nAdvertisement\n“I think it was probably one of the most heartbreaking moments of my career,” said Steph Catley afterwards. “Sam is one of the best players in the world. She’s our spiritual leader. She means so much to this team. So, to have her go down a day before a moment like this was pretty awful. But I think, as a team, it added something to us; it added a little bit of extra fire. And I think everyone looked at it and said, ‘Well, I’ve got to step up now’, because we don’t have Sam.”\nKerr, who was tearful as Australia’s national anthem played around Stadium Australia before the game, was indeed a presence on the bench, but on the pitch, she was sorely missed. Part of Kerr’s brilliance is that she can turn hopeful balls into pinpoint through-balls with her movement and speed. She makes teammates’ lives easier.\nWithout her, Caitlin Foord led the line, but just isn’t the same type of player. Mary Fowler operated behind, and linked play well, but wasn’t making those classic Kerr runs. As Gustavsson mentioned afterwards, Kerr is also fundamental to the way Australia defend set-pieces, and Ireland threatened them with a stream of inswinging corners.\n“Sam Kerr is maybe the top striker in the world,” acknowledged Ireland manager Vera Pauw afterwards. “But Australia has so many powerful strong fast attacking players that our gameplay didn’t change because of that. The way they played, we had prepared for that. And I think we have (nullified them) in the way they want to get in behind. They didn’t get in behind once. That’s a huge compliment for our team. Our game plan worked perfectly.”\nBut the game plan was helped, of course, by Kerr’s absence. Without her, Australia only really had two plans with possession.\nThe first was bringing the full-backs, Catley and Ellie Carpenter, inside and getting them to play one-twos, which worked reasonably well at times, but also resulted in misplaced passes, turnovers, and allowed Ireland to break.\nAdvertisement\nThe second involved the centre-backs and central midfielders hitting long, hopeful balls for the two wingers. This was less effective.\nBut it was that second mode of attack which eventually paid off. Kyra Cooney-Cross’ ball for Hayley Raso was surely overhit, but Ireland’s Marissa Sheva bundled into the back of her and conceded a penalty, converted with remarkable coolness by Catley. That was the only difference between the teams.\nAustralia, in truth, created little else. It was a typical performance from a host nation on the opening day; a little overcome by nerves, as Catley conceded afterwards. “We knew there would be nervy moments,” she said. “It was the biggest occasion of our careers, we were expecting sloppiness, and we overcame that.”\nBut the question wasn’t about whether Australia won this game. The question is about whether they can win the tournament, and without Kerr the probability of a home success is significantly reduced. Australia’s next game, after which her progress will be reassessed, is a week away. There are no guarantees she’ll be fit for the final group game, against Canada, and no guarantees she will play again in this tournament.\nGO DEEPER\nA guide to Australia at the Women's World Cup: Will Sam Kerr have make tournament her own?\nBut Gustavsson is insistent that Kerr remains a major influence on this side. “The way she responded in training… everyone knew it might be something, but the players were able to focus on the training. Sam said, ‘This is not about me, this is about the team playing tomorrow.’ And she said the same thing today. And for her to do that, in that devastating moment, says a lot about her as a captain.”\nCatley, her replacement as both captain and penalty taker, concurred. “Sam’s still around, you know. She’s still got her effect on the team. She’s in every meeting. She’s in there at half-time talking to everyone. She’s doing the pre-game talk. She’s Sam. And she’s still with us. So, we’ll do everything we can to get as far as we can. And then, hopefully, we’ll see Sam Kerr later on.”\n(Header photo by Maddie Meyer – FIFA/FIFA via Getty Images)",
  "word_count": 1147,
  "scraped_at": "2026-02-14T13:27:00.980362"
}