{
  "article_id": "5869b60bd90d",
  "url": "https://www.prokerala.com/news/articles/a1396494.html",
  "title": "Domestic football : VAR to be used in Santosh Trophy knockout matches in Riyadh",
  "date": "20230301T101500Z",
  "domain": "prokerala.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Riyadh : , March 1 (IANS) For the first time in the history of Indian football, Video Assistant Referee (VAR) -- the FIFA-approved referee's decision review system in the sport -- will be utilised for domestic competition.\nVAR will be used for the knockout matches of the 76th National Football Championships for the Santosh Trophy being held in Riyadh, Saudi Arabia. The first semi-final between Punjab and Services later on Wednesday will be the first domestic match that will have VAR facilities available for the referee.\nVAR is currently not in use in the country's top two-tier professional leagues -- the Indian Super League (ISL) and the I-League. It has been used in India during the FIFA Women's U-17 World Cup in 2022 from the start and from the quarterfinals onwards in the AFC Women's Asian Cup.\n\"VAR will be used for the first time in Santosh Trophy for the first time. As we are using 10-12 cameras to broadcast the match, we also thought of using VAR,\" informed All-India Football Federation (AIFF) president Kalyan Choubey.\nIn an informal interaction with the visiting Indian media, the AIFF president said that they have plans to utilise VAR in other domestic tournaments, but the cost is a huge factor.\n\"We have lots of talented people in IT (Information Technology), so we want to use their expertise and set up a cost-effective system to use VAR for domestic competitions,\" said Kalyan Choubey, who took over as AIFF president after elections were held last year.\nThe VAR is a video match official who will review incidents like a goal (whether the ball has crossed the goalline or not), awarding of a penalty, offsides and fouls. As per the current approval of FIFA, if the VAR feels there is a clear error made by the on-field match referee, he/she can recommend an on-field review. However, the final decision still rests with the match referee.\nThe former India goalkeeper said his aim as AIFF president is to use technology to help develop Indian football.\nHe said the matches in Riyadh -- two semifinals, the third-place match and the final -- will be telecast on DD Sports, AIFF's Youtube channel and FANCode App.",
  "word_count": 366,
  "scraped_at": "2026-02-14T12:38:54.841736"
}