{
  "article_id": "587e83aa5d8d",
  "url": "https://www.snopes.com/fact-check/andy-reid-kansas-city-chiefs-kneel-anthem-travis-kelce/",
  "title": "Travis Kelce Chose To Stand When Coach Andy Reid Told Team To Kneel for Anthem ? ",
  "date": "20230928T181500Z",
  "domain": "snopes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On Sept. 27, 2023, an article on SpaceXMania claimed the head coach of the Kansas City Chiefs football team, Andy Reid, had told all the players to kneel for the U.S. national anthem, but Travis Kelce refused and stood instead.\nThe article stated:\nThe tradition of standing during the National Anthem has been considered by many to be a mark of respect for the nation and its servicemen and women. So, when Coach Reid issued the directive for the entire team to kneel, it was bound to raise eyebrows. Reid, known for his leadership both on and off the field, was making a bold statement, one that he felt was essential in the current socio-political climate.\n\"This isn't about disrespecting the flag or the nation,\" Reid mentioned in a press conference after the game. \"It's about standing, or in this case, kneeling against systemic injustice and racial inequality. We need to foster an environment where everyone feels equal, safe, and heard.\"\nWhile many players followed Reid's directive, star player Travis Kelce stood tall, quite literally. As players around him took a knee, Kelce remained standing, locking his arms and gazing steadfastly at the flag. The act of defiance was conspicuous and sparked a flurry of discussions.\nThis article was presented as a work of satire and originated from a website that describes its content as satirical.\nA small number of online commentators appeared to assume the story was real. One Facebook post stated, \"this [son of a bitch] coach is telling the players to kneel when the National Anthem is played.\"\nWe have frequently covered stories from SpaceXMania, which describes itself as \"a team of writers and editors based in New York, USA, dedicated to providing our readers with the latest news, analysis, and satire related to Elon Musk, Space, SpaceX, and everything in between.\"\nThe website's About Us section states:\nAt our website, we pride ourselves on offering a unique perspective on the world of space exploration. Our satirical articles provide a fresh and entertaining take on the latest space news, while our analysis delves deep into the technical, financial, and political aspects of space travel.\nThe website's disclaimer page states:\nPlease note that the article under the category \"SATIRE\" are satirical in nature and are not meant to be taken seriously. These articles are meant to be humorous and are often entirely made up. We make no claim that the information presented in these articles is true or accurate.\nReaders should exercise caution and use their own judgment when reading and interpreting our satirical articles. We take no responsibility for any actions taken based on the content of these articles.\nWe understand that some readers may be unfamiliar with satire and may not understand that these articles are not meant to be taken at face value. It is the responsibility of the reader to discern the intent of these articles and to understand that they are not presented as factual news.\nThe issue of kneeling during the national anthem gained prominence in 2016 when football player Colin Kaepernick took a knee, resulting in widespread controversy over athletes' activism and racial justice. The National Football League (NFL) was also criticized by athletes for not taking a strong stance on racial justice amid nationwide protests over the killing of Black people.\nThere is no evidence that Reid asked his players to kneel during the anthem. Reid did, however, speak out in support of the Black Lives Matter movement in 2020 and his players who were raising awareness of the issue. He said, \"We're sitting here with this push on Black Lives Matter, and absolutely they matter, man. I think it's a beautiful thing.\"\nKelce was also in the news in September 2023 because of rumors that he is dating singer Taylor Swift after she was seen at one of his games. The interest in their relationship resulted in attention on Kelce's history of kneeling during the national anthem, something we have fact-checked before. The Kansas City Star reported in September 2017 that Kelce took a knee during the national anthem just before kickoff for an away game with the Los Angeles Chargers. Sports journalist Robert Littal wrote on Twitter that Kelce was kneeling with his teammates \"against racial injustice and police brutality.\"\nThe satirical post has likely emerged from the attention brought by Swift's presence at Kelce's game. While it claims to show a divide of opinions in the Kansas City Chiefs team, it is clear that both Kelce and Reid have expressed support for the Black Lives Matter movement in different ways.",
  "word_count": 763,
  "scraped_at": "2026-02-14T13:49:20.090004"
}