{
  "article_id": "58a4fe730ede",
  "url": "https://www.perthnow.com.au/news/wa/sam-kerr-shares-photos-of-beautiful-moment-she-proposed-to-kristie-mewis--c-12633918",
  "title": "Sam Kerr shares photos of beautiful moment she proposed to Kristie Mewis",
  "date": "20231121T160000Z",
  "domain": "perthnow.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sam Kerr shares photos of beautiful moment she proposed to Kristie Mewis\nSoccer superstar Sam Kerr has shared the beautiful moment she got down on one knee to ask the love of her life to marry her.\nIn an Instagram post to her 1.8 million followers, Kerr simply wrote, “September 1st, 2023,” sharing three snaps of the adorable moment she proposed to US soccer star Kristie Mewis.\nWearing matching teal outfits the power couple declared their love to the world.\nThe three pictures show the Perth-born sporting icon proposing to a surprised Mewis, a close-up of them holding hands showing off the stunning ring and Kerr’s reaction to Mewis saying, “yes”, sporting a huge smile and a hand up in the air.\nThe lovebirds announced they were engaged earlier this month, but photos of the day were kept under wraps.\nA flood of congratulations and love heart emojis flowed in the comments from the official Matildas page, fellow soccer players and friends.\n“LOVE, LOVE, LOVE,” wrote Chelsea FCW player Millie Bright.\nMatildas teammate Mackenzie Arnold added, “Here they are, love you guys x” and Melbourne Victory player Emily Gielnik told the duo, “Happy for you both”.\nMewis revealed the news they were engaged in an interview with People on Thursday, November 9.\nThe two athletes took the next step more than two years after they confirmed their love after the Tokyo Olympics.\nMewis explained how “tough” it was during her team’s disappointing performance during the 2023 World Cup, but that she had a great support system.\nShe said her fiancee has “just been everything to her” and is her “biggest supporter”.\nLast month, rumours had swirled the couple were secretly engaged after footage merged of Mewis wearing what appeared to be an engagement ring.\nWA-darling Kerr was playing for the Chicago Red Stars when she met Mewis in 2019.\nAfter meeting on the field, Kerr said she was being “a s..t stirrer” which made Mewis get “so angry”.\nThe couple spoke online for nearly four months during the COVID lockdown in 2020, before spending two weeks of quarantine together.\nIn 2021, the pair sparked romance rumours when they were seen hugging post-match at the Tokyo Olympics.\nTheir hug made headlines as Kerr’s break-up from her previous relationship with another US player — Nikki Stanton — had not become public.\n“We’re not private people. I like sharing my story. I like sharing who I am outside of football. Football is 5 per cent of my life,” Kerr told UK publication Gaffer.\nLast month, the loved-up couple celebrated Kerr’s 30th birthday in the US after the Women’s World Cup, where the Perth-born star led the Matildas to the semi-final on home soil.",
  "word_count": 450,
  "scraped_at": "2026-02-14T12:56:55.594782"
}