{
  "article_id": "58bf4699d792",
  "url": "https://theathletic.com/4348449/2023/03/26/the-pulse-jokic-embiid-mvp-march-madness/",
  "title": "The Pulse : You wanted madness , right ? ",
  "date": "20230326T150000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Start every morning with The Pulse in your inbox. Sign up here.\nGood morning! Stay out of Trae Young’s way today, OK?\nWhile You Were Sleeping\nMVP showdown\nThe Nuggets rolled past the Bucks, 129-106, last night as potential MVPs Nikola Jokić and Giannis Antetokounmpo posted pretty much dead-even outings in a potential finals preview.\nJokić had 31/6/11, while Antetokounmpo put up 31 points (24 of them in the first half), nine rebounds and four assists with four steals.\nBut what does it mean for the MVP race? Well, not too much — it’s just one game, right? Simmer down. But we’ll get to do it all over again tomorrow when the 76ers and Joel Embiid head to Denver (9:30 p.m. ET).\nBracket watch\nMadness, indeed\nWhat a wacky men’s Final Four we’re shaping up to have. Left standing are a slew of misfits and bridesmaids:\n- What are you doing here, FAU? The Owls, maybe better known as the “Hey, didn’t Lane Kiffin coach there?” school, are in their first-ever Final Four. Remember, this is a program that had never won a tournament game before this year. One shining moment indeed.\n- Either Creighton or San Diego State will also make their first Final Four. Heck, the Bluejays are in their first Elite Eight since the FDR administration.\n- Texas or Miami will be there as well, each looking to finally be the bride. The ‘Canes have never seen a Final Four, while the Longhorns have been in three of them but never a championship game.\n- Oh yeah, and then there’s greedy UConn. The Huskies smushed Gonzaga, another perpetual bridesmaid, last night. They may not need a Rip Hamilton, Emeka Okafor, Kemba Walker or Shabazz Napier to hoist their fifth title since 1999.\nOn the women’s side, South Carolina’s dominance has reached historic heights. With the Gamecocks’ 59-43 thumping of UCLA, Dawn Staley’s squad has now won at least 35 games for the second season in a row.\n- That type of back-to-back season-long domination has only been replicated by Geno Auriemma’s Huskies. Pat Summitt’s late-90s Volunteers and Kim Mulkey’s early-2010s Baylor Bears came up just short of the feat.\nDespite being held to their second-lowest point total all season, South Carolina takes down UCLA 59-43.\nThe Gamecocks got 10 points off the bench from both Bree Hall and Kamilla Cardoso and will face Maryland on Monday in the Elite Eight. pic.twitter.com/iqO1BiZQjC\n— The Athletic (@TheAthletic) March 25, 2023\nSpeaking of Auriemma …\n- UConn’s run of 16 straight Elite Eight appearances (and 14 straight Final Fours) came to a screeching halt at the hands of Ohio State yesterday. The Buckeyes will make their first Elite Eight appearance in 30 years after the 73-61 win and will face Elite Eight debutant Virginia Tech.\n- But UConn likely won’t be down for long — the Huskies are expected to jump right back up as contenders next season with, among other key players, the return of Paige Bueckers.\nA final stat to melt your brain: This is just the second women’s tournament in history that won’t feature Tennessee, UConn or Stanford in the Elite Eight.\nAdvertisement\nBookmark this\nMLB Predictions\nThe cherry blossoms bloomed, baseball fans are angry about more rule changes and the Angels are prepared to be hurt once again. All that means MLB Opening Day is around the corner, and Eno Sarris has 10 bold predictions for the 2023 season. A few highlights:\n- A Mike Trout power surge is in order coming off an ‘unbelievably fun’ World Baseball Classic. Sarris projects a new Trout career high in homers will lead the league. How does 50 sound?\n- The Orioles will return to the playoffs on the heels of a 31-win improvement last year. Baltimore will snap its seven-year postseason drought (feels like 77 years) as it bears the fruits of a healthy player development system.\n- A player in the AL West will win MVP, and it won’t be Trout or Ohtani or any of the Houston mashers. Corey Seager will take the title, Sarris says, as he benefits from Angels voter fatigue and the perks of new shift rules.\nRead on for more of Sarris’ hot takes, including which California squad is predicted to boast baseball’s top rotation in 2023. Hint: It’s the team with some historically loose purse strings.\nAnd this, too\nNWSL is back\nThe NWSL season got underway yesterday with two games — concluding with an 89th-minute game-winning penalty from Alex Morgan. That’s the good stuff!\nSo, we’ve got season predictions via Meg Linehan and Steph Yang. A sampling:\n- Rookie of the Year: Expectations are, as you would expect, sky-high for No. 1 draft pick Alyssa Thompson (Angel City), but she was neither writer’s pick. Linehan has Michelle Cooper (Current) winning and Yang has Jenna Nighswonger (Gotham).\n- MVP: It’s unanimous — the award is Debinha’s for the taking.\n- Champion: Kansas City Current revenge tour or bust!\n- One weird thing that will happen: Both our writers predict “chaos” — Yang says we’ll get a 30-goal weekend from six games at some point, and Linehan is rooting for absolute madness on the league’s first-ever decision day to close out the regular season.\nAlso, for scientific purposes, we *need* your thoughts on the kits. They were all reviewed here, But if you only have time to conjure up one take today, command-F “Portland.”\nBriefs\nA statement starting XI?\nGio Reyna, after *all that,* returned to the USMNT starting XI Friday night against Grenada. It was his first start for the national team since September of last year. The game, the first competitive one under interim manager Anthony Hudson, was a romp, with Christian Pulisic involved in five goals in the 7-1 win. Next up? El Salvador on Monday back in Orlando at Exploria Stadium, where the Americans have never lost or tied. With a result, they can secure a spot in the Nations League semifinals and continue their title defense.\nBen Simmons out indefinitely\nIt appears we’ve seen the last of Ben Simmons this season. The Nets guard is out indefinitely after being diagnosed with a nerve impingement in his back. He hasn’t played since the All-Star break ended because he was nursing a sore knee. Asked earlier this week how Simmons would potentially be worked back into the rotation if he returned this season, coach Jacque Vaughn issued an all-time deflection: “The great thing is I don’t even think that far ahead. I don’t even complicate my life that way.” Yesterday, he said Simmons is “probably not going to join us for the rest of the year.” Where does Brooklyn go from here?\nAdvertisement\nYankees’ rotation takes another hit\nThere are now more members of the Yankees’ projected starting rotation injured than not. Luis Severino is the latest name to be hit, this time with another lat strain, and is expected to start the season on the IL. He would join fellow starters Carlos Rodón and Frankie Montas on the list, which also includes relievers Lou Trivino, Tommy Kahnle and Scott Effross. The outlook is bleak for what should have been one of baseball’s deeper rotations, on paper. In place of Severino, Clarke Schmidt is expected to start the second game of the season after Gerrit Cole goes on Opening Day.\nPulse Picks\nThe Lamar Jackson Situation took another bizarre turn Thursday. At this point, nobody involved looks good, Jeff Zrebiec writes.\nMLB insiders rank starting pitchers by tiers, from No. 1s to “guys.”\nHow Ryan Reynolds and Rob McElhenney are changing lives for the better at Wrexham.\nThe NHL does not have any information to suggest that its Russian players are facing “material” threats, either in Russia or elsewhere, if they choose to participate in teams’ Pride night activities, deputy commissioner Bill Daly said.\nHow USMNT goalkeeper Zack Steffen finally found peace after the pain of missing the World Cup.\nThe Phillies and Aaron Nola called off extension talks. What the mutual risk means for both sides.\nIowa dual-sport athlete Brody Brecht is stepping away from football to concentrate on baseball ahead of the 2024 MLB Draft. The pitcher, a potential first-round pick, started five games at WR for the Hawkeyes last year.\nHow a German programmer created “Out of the Park Baseball,” the deepest baseball sim ever made.\nMike Vorkunov’s latest exclusive: a conversation about the NBA with Google’s Bard AI chatbot.\nMets top prospects Mark Vientos and Brett Baty will not be on the team’s Opening Day roster.\n(Top photo: Mitchell Leff / Getty Images)",
  "word_count": 1428,
  "scraped_at": "2026-02-14T12:25:29.266376"
}