{
  "article_id": "58c804dccaa3",
  "url": "https://www.timesrepublican.com/obituaries/2023/12/ed-schultz/",
  "title": "Ed Schultz | News , Sports , Jobs - Times Republican",
  "date": "20231218T090000Z",
  "domain": "timesrepublican.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ed Schultz\nEd Schultz, 80, a lifelong Marshalltown resident, died at his home, surrounded by his family, Friday, December 15, 2023. Friends and family are invited to a “Please Wear Blue Jeans” version of a Celebration of Life at Mitchell Family Funeral Home, Thursday at 10:30 a.m., with a social hour/lunch immediately after the service. A private family burial and brief memorial service at Riverside Cemetery will follow the social hour.\nAnd, although Ed didn’t realize it, his passing was very peaceful partly due to compassionate skilled care by the Iowa River Hospice staff and Chaplin Harlan Nuss.\nEd was born April 16, 1943, the only son of August Edward (Gus) and Polly Wall Schultz. He graduated from Marshalltown High School in 1961, attended Marshalltown Community College and then Northwest Missouri State University, Maryville, MO, where he earned a bachelor’s degree in Secondary Education (physical education and industrial arts majors) in 1966.\nIn 1963, he was married to Lorraine Howard, at the Albion United Methodist Church. The couple observed their 60th wedding anniversary, August 18, 2023, with all their family present to celebrate.\nEd is survived by his wife, Lorraine, and two daughters and their families: Angie Schultz-Whelan and her husband, Kevin, and sons Steven and Todd; Jamie Edwards and her husband, Chris, and sons Cooper and Andrew (Drew). In addition, he is survived by his sister-in-law, Kathy Howard Rand and her husband, Wayne, and their sons, Joel (wife Amber) and Nathan.\nHis love of baseball and his determination to compete at his best consumed much of his youth and adulthood. In high school he was a 3-year letterman and all-conference choice in baseball. He also participated in football, basketball and track (though only in the weight-man’s categories, he would quickly tell you). At MCC he participated in a successful Student Council effort to initiate the community college’s first-ever baseball team. At NWMSU he played two years of varsity baseball and also lettered. As an adult he played Fast-Pitch Softball on several teams during the years when Park & Rec coordinated many area Fast-Pitch teams’ schedules, and he also volunteered on a citizens committee which worked with Park & Rec to develop the 6th Street Softball Complex.\nIn addition, he absolutely loved kids and loved helping them enjoy sports and healthy competition. His first job out of college was teaching and coaching at Green Mountain High School, where besides teaching physical education and industrial arts, he coached boys’ basketball, baseball and track. As a father and community volunteer, he coached for years — Marshalltown Football League, Marshalltown Girls Softball Association, YMCA boys’ and girls’ basketball, AAU basketball and Little League.\nCareer-wise, Ed was actually very proud of his scattered work history. He always said he wanted to learn something new, meet more people, see how different workplaces got stuff done, and the variety of jobs he held over the years was testimony to that. After teaching and coaching at Green Mountain, he was the Program Director at the Marshalltown YMCA (advising teen boys’ Hi-Y clubs, planning children’s day camps, chaperoning teen dances, arranging family Y Nights, teaching handball and racquetball). He also sold pop for Pepsi-Cola, then sold wine for H&F Distributing, he traveled for Harker Wholesale Meats, LeMars, and sold to restaurants in Iowa and Wisconsin, then he worked on a Road Crew for the Marshall County Engineer’s Office. For several years he was a partner-owner of S&S Oil Company, a local Standard Oil and Champlin Oil dealership.\nHe held three similar Purchasing Manager jobs – for Monfort Construction (which built the current JBS Complex), then for Monfort Pork (a predecessor of JBS) and then for MURCO Beef, Plainwell/Kalamazoo, MI. He was the General Manager of Stewart Building Center (before Spahn & Rose), but was forced to retire when he suffered his first stroke in December, 2001.\nDuring his active years, he was also a member of the Marshalltown Noon Optimist Club, a regional YMCA Leadership group, a former member of First United Methodist and then Hope United Methodist churches and a former MFL and MGSA board volunteer.\nBesides sports, his primary “hobby” was collecting friends, but he also played competitive racquetball, bowled, hunted, snowmobiled, skied (loved Colorado!) and officiated high school football and basketball. He loved camping with his family and his softball friends and enjoyed it when his Winnebago RV was joined by other camping families.\nIn later years, as health issues and subsequent strokes limited his mobility, his hobbies centered around attending his grandsons’ band, choral and show choir performances and watching them play baseball, soccer, lacrosse and basketball, as well as other less active things: eating out with friends, being able to follow Hawkeye men’s and women’s sports electronically and TV (addicted to Animal Planet, the History Channel, b/w cowboy shows, sports).\nIn addition, he loved homemade ice cream, steak, his Gramma Julia’s Cinna-yum-m-m-m rolls, playing Santa Claus, chaperoning teen trips to Colorado, a hearty laugh after a good joke, T-shirts which allowed him to brag about his grandsons, making fun of himself, being a host parent to two MCC Youth For Understanding exchange students, Schultz-Kaufmann and Green family reunions, being actively involved in planning class reunions for the MHS Class of ’61 and attending the group’s regular dinner meetings.\nHis sense of family included loving kids who needed/wanted another good adult role model in their lives, and as a result he acquired three nearly-adopted children: Zach Skriver, who lived with the Schultzes off and on for years; Peti Amstad, a Swiss exchange student who came for a year, stayed three, and is still part of the family and Tim Price, who was son David’s BFF 40+ years ago and hasn’t forgotten it.\nEd was preceded in death by his sons, David August and Douglas Kenneth; his parents, August E. and Polly Schultz; his paternal grandparents, August W. and Julia Kubik Schultz; his maternal grandparents, Albert and Sylvia Shelton Wall; his in-laws, Kenneth and Margaret Beye Howard and his brother-in-law, Elgin Howard.\nIn lieu of flowers, the family suggests that memorial contributions be directed to the Marshalltown Community College Foundation (3700 S. Center St.) and designated for either the Jodi and Jana Kerr Memorial Scholarship or the Don and Alona Rand Memorial Scholarship or to Iowa River Hospice (502 Plaza Heights Road).",
  "word_count": 1047,
  "scraped_at": "2026-02-14T12:16:51.071928"
}