{
  "article_id": "590fc962dce4",
  "url": "https://mesquitelocalnews.com/2025/01/22/bowling-michael-ramirez-goes-nuclear-sending-27-rockets-to-the-1-3-pocket-for-strikes-in-a-monster-774-series/",
  "title": "BOWLING : Michael Ramirez goes nuclear sending 27 rockets to the 1 - 3 pocket for strikes in a monster 774 series",
  "date": "20250122T164500Z",
  "domain": "mesquitelocalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Willie Theis\nMesquite’s Virgin River Bowling Center is still reeling from a barrage of 27 thunderous strikes Michael “Smurffzzz” Ramirez launched in Mesquite Merchants Men’s League action with a stratospheric 774 series for his Defense Preparedness team sponsored by Peggy Pope.\nWithout getting too deeply into the weeds on his 774, suffice it to say he began league play by running the front eight for strikes, went split/open in the 9th and struck out in the 10th giving him 11 strikes for a 263. Next, he fired six strikes and made all four of his spare shots in a clean 223, and finished an electrifying outing by beginning his third game with a spare and then peeled off 10 straight strikes, and with eight pins on his fill ball in the 10th finished with a stellar 288.\nAmazingly, earlier that same day in the 9:30 a.m. Early Risers League play showcasing his ability to throw strikes, he pummeled the 1-3 pocket for 24 strikes including 11 in a 279 gem along with games of 216 and 198 in a 693 series resulting in an eye-popping 244 average over his six games that day while throwing a grand total of 51 strikes.\nAnd his 51 strike total is the perfect segue into mentioning if you’ve seen him bowl you already know he can send pins flying with his strike ball, but for those readers who haven’t, once this baby goes online Wednesday morning detailing all his strikes, the whispers will turn into roars that he is indeed a bona-fide strike-throwing machine.\nAdditionally, catapulted by his aforementioned MML League 774, and coupled with a standout clean 725 set from a week earlier, he now has the high league average with a mouthwatering 223. And a little more scoop on his clean 725 is that it came with 24 strikes and marks on 10-of-10 spare shots in games of 248, 242 and 235.\nRamirez is to be saluted for the time and effort he’s put in with practice at improving his game and it’s reaped big dividends. Not surprisingly, but different, he also films his practice sessions which is a great learning tool.\nAway from bowling, Ramirez is a fan of the Pittsburg Steelers, and a trip to Tokyo, Japan is high on his bucket list.\nIn other sizzling pin action, Tony Urias, bowling for the Bulldog Towing team in the MMM League tossed 26 strikes including a 10-bagger in a standout 276 game en route to an impressive 709 series.\nHe began his bowling journey last season when he racked up a season-high 657 series, and to bowl his first 700 series in his sophomore season is pretty darn rare.\nIn fact, since I’ve been doing these bowling columns in both Mesquite and St. George he’s just the third bowler who’s ever tossed a 700 series in just his or her sophomore season of bowling. It’s not easy, but the same athletic ability that made him an outstanding three-sport athlete at Virgin Valley High School, coupled with lotsa practice on his game were key ingredients in making it happen.\nUrias is an avid fan of the San Diego Padres, Pittsburg Steelers, and also enjoys playing golf.\nMeanwhile, it seems of late it’s almost automatic that Austin Finster books at least one 700 a week and his latest, a 704 raised his MMM League average to 219, and Darren Simonds liked his consistent games of 242, 231, and 217 in a 690 as much as he did the classic car show in Mesquite this past weekend.\nIn other action, young bowling phenom Jacoby Ford threw 22 strikes in another top-notch scoring explosion with games of 241, 229, and 216 in a 686, and believe it or not, but when John Hollaway ‘only’ throws a 664 with a 247 game it’s somewhat of an off night for him.\nAnd when Dave Castro has his game running on all cylinders pins take a pounding like in his 662 set with 22 strikes and clean games of 232, 220 with his sole open in a 210, and Dennis Craft lives in St. George but continues winning accolades for his bowling talent in Mesquite for outings like his 661 with 22 strikes, a clean 224 along with a 220 and 210.\nAnd John Martin’s first-rate 660 raised his MMM League average a pin to 213 and he really liked the fact his Ohio State Buckeyes won the football game for the National Championship on Monday night, and sparked by clean games of 238 and 222 Mike Gentry delivered a 652 effort, and Alfred Oliveira V merits major kudos for a 640 series on games of 227, 225 and 188 in the very challenging Sunday Scratch & Sport Condition League where the shot pattern changes every two weeks.\nMike Dunlop who also plays a mean game of golf uncorked another strong outing with 18 strikes, a clean 221 and only two open frames in a 633 set, and his teammate, Duane Sullivan, an alumnus of Snow Canyon High School in St. George raised his MMM League average to 184 with a 629 series.\nFinally, Milan Carr probably wasn’t all that thrilled about his 625, but he was not doubt stoked about his Buffalo Bills defeating the Baltimore Ravens in a nail-biter on Sunday, Fred Emmons raised his Early Risers League average a pin to 180 with a 603 series, and Brian Collins continued a hot streak of late with another 600, a 602.\nIn single game play, James Hartley tossed 10 strikes in a 279, Bob Marget (633) chucked a 267, and Mike Yoder (655) racked up an eight-bagger in a 257.\nDoug Love (653) tallied a 256, Alfred Oliveira IV (625) popped a clean 256 with nine strikes in Kings & Quens League play, and Jeff Branche had eight strikes and three spares in a clean 256.\nErnie Kala (633) put together an eight-bagger in a clean249, Harry Uncles who’s also a heckuva good golfer tallied a 235, and Bob “Mr. 800” Field cranked out a 224.\nChad Klein has been a great addition to the bowling scene since returning to the lanes and he fired six strikes in a 207 and seven in a clean 224. Klein, who hails from Idaho loves golf and is also a big fan of Miami Hurricanes football, and his first 600 of the season is on the horizon.\nMeanwhile, Mike Rosenlof from Beaver, Utah bagged six strikes in a clean 223, Robin Drury punched out seven strikes in a 223, wBob Dixon smacked seven strikes in a clean 222, while Shaun Edwards, Sports Director for the Mesquite Senior Games logged a 221, and Frank Addamo had six strikes in a clean 216.\nJack Northover pocketed a 214 and he’s fired up about his Dodgers winning another World Series title next season, and Randy Kezior, in order to continue bowling due to an injury switched to bowling as a southpaw and is averaging 131, yet, he tossed a an impressive 212 game. That is one heckuva feat.\nPaul Butin and his two-handed delivery led to a 209 and he’s a huge hockey fan of the Colorado Avalanche but has also taken in a handful Denver Nuggets basketball games, and Jake Swingler tossed six strikes in a 204.\nFinally, Jedd Fisher hammered out five strikes in a 202, Roman Perez put together a five-bagger in a 202, and Clarence Bales chucked four strikes in a 200 game with only one open frame.\nOn the women’s side of the ledger, Reiko Schultz raised her City High Rollers League average three pins to 177 after finishing atop the scoring food chain as she lit up the scoring monitors with a standout 656 series and 19 total strikes including eight in a stellar clean 255 game.\nAnd Sandy Sheppard, fueled by 18 total strikes raised her CHR League average to 196 after peppering the lanes with a first-rate set 639 including nine strikes in a 250 game with one open, and Diane Marget also delivered a heckuva nice 626 effort and 243 game.\nLeeAnn Harmes (567-227) has been posting some quality scores on a consistent basis basically all season, and Bev Cormani put her strike ball to work throwing 14 of them in a 563 outing on games of201, 182 and 180.\nAnd inquiring minds would like to know what in the heck is going on with Gayle Parison’s bowling game. I mean, over the last month or so and whatever the reason or reasons, her bowling ball has shown some extra pop in dispatching of pins, with her latest a 537 with five strike including a turkey in a 201 affair.\nMeanwhile, Sheila Green chucked a season-high 526 on games with consistent games of 186, 170, 170 in Trio League action, Jane Burgoyne (512-185) continues booking solid 500 series scores, and southpaw Kim Finnegan mowed down 509 pins In LT League action on Tuesday morning.\nAnd like Finnegan, MaryAnn Davis (506-198) is a southpaw who tossed her zillionth 500, and Dodi Melendez fired a CHR League season-high 503 with 10 strikes and 11 spares during games of 176, 165 and 162 which raised her average two pins to 140. Away from bowling she’s a humongous NASCAR fan, has bowled at Women’s Nationals multiple times and it’s the same for state tournaments in both Utah and Nevada. Melendez retired from Coca Cola after many years employed as the payroll manager.\nIn single game action, Shayla Ortiz captured her first ink in this column for a 202 game with seven strikes, and a season-high 472 blew away her previous high 396. Away from bowling she’s works in Mesquite as an esthetician and is super knowledgeable about keeping skin, including facial skin looking great.\nAnd Krissy Davis was all smiles after throwing a season-high 187 which proved pivotal in also paving the way for a season-high 456 series which raised her average to 129. Something else she’s happy about is bowling with two of her brothers, Dan and David Johnson, and they all live in Beaver Dam.\nAnd I’d be remiss in not mentioning that Kathy Bussman, a true Renaissance person with talents and determination galore rolled a season-high 172 along with a season-high 408 which elevated her average to 123. And Bussman’s a gutsy woman who once celebratea a birthday with a skydiving adventure out of an airplane. You can read all about her many talents, achievements and amazing life in a superbly written article by Carol Saldivar in the Nov/Dec 2019 issue of the high quality VIEWON MAGAZINE.\nAlfred Oliveira 640-227, 225, 188; Michael “Smurffzzz” Ramirez 216l Johnny Manning 213; Dylan Kesl 210; Javiet Delgadillo 201.\nScott Mattingly 680-259; Dean Baum 667-226; Bruce Hooley 640-229; Ricky Trujillo 630-227; Al Gans 628-245; Rob Cormani 626-224; Dave Pershing 611-234; Bruce Hooley 611-229; Dave Johnson 610-208; Max Snyder 606-227; Alfred Oliveira V 606-214; Orlyn Meyer 605-225; Dylan Kesl 246; Sal Diaz 227; Chris Scott 224; Jim Lytle 224; Logan Hendrick 224; Raul Macias 224; Dan Aslin 223; Jerry Selbo 223; Dave Houghton 218; Troy Palmer 217; Bruce Hamilton 215; Ken Schloman 214; Ted Mickelson 214; Ken Meacham 213; Nick Paul 213; Ryan Baeza 212; Jeff Harmes 211; Warren Ferber 211; Jerry Holloway 209; Larry Willis 209; Denton Dorn 207; Bob Robbins 206; Gil Niimi 205; Randy Carter 205; Bob Ballard 203; Michael Donovan 203; Butch Loger 203; Dave Cirbo 203; Carlos Baeza 201; Dean Sheppard 201.\nLaurie Dillree (191) and Marge Mongola (186) both from the Ladies Trio League.",
  "word_count": 1922,
  "scraped_at": "2026-02-14T13:32:08.733885"
}