{
  "article_id": "593536b6d0ac",
  "url": "https://reason.com/2021/05/02/the-equity-mess/",
  "title": "The Equity Mess",
  "date": "20250328T203000Z",
  "domain": "reason.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Equity Mess\nDespite their professed goals, Democrats' pandemic policies have widened disparities between races, classes, and genders.\nTwo days before the 2020 election, Kamala Harris could have picked from any number of campaign themes. The number of COVID-19 cases had doubled over the previous month. At home, violent crime was up; abroad, negotiations with the Taliban over U.S. withdrawal from Afghanistan had bogged down. And ominously, Harris' opponent, Vice President Mike Pence, was refusing to state clearly whether Donald Trump would accept the results of the election.\nInstead of any of those closing arguments, Harris and her campaign team chose to emphasize, in a tweet, speech, and animated video, a single portentous word that in a remarkably short time has escaped the laboratory of academe, spread through newsrooms and human resources departments, and now lodged itself firmly inside the White House: equity.\n\"There's a big difference between equality and equity,\" a slightly bemused, slightly exasperated-sounding Harris explained over the image of an animated young white man vaulting his way confidently through a rock-climbing course after having started out in a more advanced position than his discouraged black counterpart. \"Equitable treatment means\"—the two hikers, now joined in success after the disadvantaged one was given a boost up, gaze confidently at the horizon from atop the summit—\"we all end up at the same place.\"\nFor decades, these two divergent philosophical and public policy concepts were represented by a battle over adjectival phrases. Should we strive for equality of opportunity, or equality of outcome? Though intellectual and political enthusiasm for the outcomes-based approach did have some high-water moments in the 1970s, the long twilight struggle against 20th century totalitarianism produced a rough if sometimes reluctant governing consensus that states powerful enough to promise economic and racial parity were far more likely to produce mass immiseration. Striving for equality under the law—removing legal discrimination by government—was less ambitious, but more doable.\nThat laudable goal, particularly in the United States, is being elbowed aside. The 21st century rebranding of equality of outcome into the shinier and more malleable term equity, with its redolence of ownership and fairness, gave activists a linguistic workaround to what had previously been a public relations obstacle of utopian unattainability. You can't and probably shouldn't just wave a magic wand to erase observed inequality. But inequity? That sounds to the ear more like an immediate and surmountable wrong, deserving of intervention.\nThe incendiary racial and gender politics of the past seven years—from Ferguson, Missouri, to George Floyd; #MeToo to Brett Kavanaugh, Donald Trump to Andrew Cuomo—has only increased demand for (and reaction against) identity-based analysis and activism. Democratic politicians have learned that embracing equity is now a campaign prerequisite. And though Joe Biden among the 2020 presidential primary field was arguably the least fluent in the language of identitarianism (notably clashing with his future vice president over their respective views on court-ordered school busing to achieve racial integration), his administration nonetheless codified the e-word into policy literally on Day 1, with an executive order titled \"Advancing Racial Equity and Support for Underserved Communities Through the Federal Government.\"\n\"I believe this nation and this government need to change their whole approach to the issue of racial equal—equity,\" the president said five days later, while signing some follow-on orders. It was a revealing slip of the tongue. The customary aspiration of leveling the playing field is being supplanted by a more ambitious promise to audit the validity of the final score. The administrative state is being explicitly tasked with rooting out the \"unbearable human costs of systemic racism\" by subjecting all regulations, federal agencies, and spending initiatives to the test of whether their impacts are spread equitably across populations.\nBut if we are indeed now assessing government activity not just by the flowery rhetoric of the salesman but by the bloodless exactitude of the auditor, then the Biden/Harris White House, along with Democratic-run states and big cities, may find themselves among the first against the wall. That's because no category of policies since the beginning of 2020 has failed that test worse than the government's attempts to cope with COVID-19. Donald Trump zig-zagged ham-fistedly on both policy and messaging, and his Food and Drug Administration threw up disastrous early obstacles to testing and vaccines. These mistakes cost lives. But Democrats are now in charge in Washington and have been mishandling the response elsewhere.\nThe very name of Biden's signature legislation, the $1.9 trillion American Rescue Plan, is an attempt to elevate purported intent over actual content. (Most of the funds will be disbursed long after the pandemic is over.) With their pivot to equity, administration officials are inviting all of us to judge them by their works, not their words. We should take them up on the offer. After all, the results of government COVID exertions to date, particularly for traditionally disfavored communities in Democratic-governed polities, have been demonstrably brutal.\nUnequal Unemployment\nOn February 12, Vice President Harris took to the pages of The Washington Post to sound the alarm about a clear and present crisis. \"About 2.5 million women have lost their jobs or dropped out of the workforce during the pandemic,\" she lamented. \"That's enough to fill 40 football stadiums. This mass exodus of women from the workforce is a national emergency, and it demands a national solution.\"\nIndeed, the share of adult women in the workforce had just hit 57 percent, a 33-year low, erasing hard-fought gains particularly for black mothers of minor children. Prior economic calamities, including the Great Recession of 2008–09, had primarily hurt men, but the COVID contraction was overwhelmingly female. As the headline on a November 2020 Dallas Federal Reserve study put it, \"Pandemic Disproportionately Affects Women, Minority Labor Force Participation.\"\nFor Harris, the economic wreckage from this borderless virus was self-evidently a federal issue. \"The American Rescue Plan addresses these urgent challenges,\" she tweeted February 16. \"It's time for Congress to act.\"\nBut a closer look at state-by-state unemployment numbers reveals not uniform damage but striking variation. And the determining factor seems to have less to do with the pathogen and more to do with politics.\nFrom February 1, 2020, when the pandemic really started to hit the United States, through the end of December, the net number of jobs decreased in 48 out of 50 states, according to the Bureau of Labor Statistics. But when you sort the results by the drop in the percentage of employment, a startling pattern emerges.\nEach and every one of the 18 states that suffered the worst job losses during that span, ranging from Hawaii's 13.6 percent to Nevada's 6.9 percent, voted in November for Joe Biden. In 11 of those, Democrats control the statehouse and both chambers of the legislature.\nMeanwhile, the 18 states with the lowest rates of employment change, ranging from Oklahoma's 4.4 percent loss to Utah's 0.3 percent gain, share their own anomalous political characteristic: They each feature unified Republican executive and legislative control of government. Only two of those 18, Arizona and Georgia, voted for Biden, and by the slimmest of margins.\nWhat explains this partisan pattern in COVID-era jobs reports? Certainly not the virus itself. Hawaii is not just the job-loss leader; it's also the state with the least mortality from the pandemic—30 deaths per 100,000 residents as of late February 2021, according to Johns Hopkins University. Job-growth leader Utah has the sixth-lowest death rate, with 57 per 100,000; New York is third in job loss, second in death rate; Mississippi is fifth in death rate, fourth from the bottom in unemployment. The explanation for the disparity lies elsewhere.\nThere are meaningful differences in governing styles and results between the two major parties on the state and local level. As a general baseline, GOP states tend to have \"right to work\" laws (prohibitions on mandatory union membership), lower taxes, lower minimum wages, and lower unemployment rates (4.6 percent was the December 2020 median for the 25 states with unified Republican governance). Democratic states tend to have higher taxes, higher minimum wages, higher cost of living, and higher unemployment (7.8 percent was the median for the 15 states controlled by Team Blue).\nSo it's little surprise that the coronavirus response, too, has diverged sharply along partisan lines. Blue-state governors in California and New York and Michigan have been far more strict about shutting down economic and physical activity than their red-state counterparts in Florida, South Dakota, and Texas. The comparative death tolls are roughly the same (California tracks with Florida, New York with South Dakota, and Michigan with Texas); the economic performances are anything but.\nThese inarguably poorer employment results under Democratic governance, which do not correlate with any measurable COVID-related health improvements, start looking much worse when you follow Harris' prompt to focus on females.\n\"Women with children, particularly Black women and those without a bachelor's degree, faced the sharpest declines and have recovered at much slower rates relative to those without kids,\" the Dallas Fed found in its November study. Why? \"Because many mothers are unable to work while they oversee remote learning and lack child care.\"\nParents of the country's 50 million public K-12 kids, and particularly of the 18 million who had not returned to regular in-person schooling as of early March 2021, haven't been able to make basic plans for more than a year. Women in two-parent households (including my own) have overwhelmingly borne the brunt; single mothers are scrambling to stay afloat. The severity of this lopsided labor-force dropout could last far beyond the pandemic itself, the Dallas Fed warned: \"The slow recovery from the Great Recession tells us that declines in participation rates, particularly for vulnerable demographic groups, can take years to fully recover, and they hinder overall economic growth.\"\nHarris in her op-ed highlighted the American Rescue Plan's proposed solutions to the gendered recession, mostly amounting to the federal government writing checks—$3,000 per child, plus housing assistance, unemployment insurance, and expanded child tax credits. \"Job loss, small business closings, and a lack of child care have created a perfect storm for women workers,\" she noted.\nBut the vice president gave only passing reference to the single biggest factor keeping mothers of minor children out of the labor force: the ongoing closure of, and uncertainty surrounding, public schools. And like economic restrictions, school closures are jarringly partisan.\n\"There is no relationship—visually or statistically—between school districts' reopening decisions and their county's new COVID-19 cases per capita,\" the Brookings Institution found in a July 2020 study. \"In contrast, there is a strong relationship—visually and statistically—between districts' reopening decisions and the county-level support for [Donald] Trump.\" A follow-up study in the fall by Education Next found the exact same leading correlation, with the second-biggest factor being the political strength of the local teachers union.\nAs with the economic lockdowns, these blue-state school closures have disproportionately harmed poor and minority children. \"The blunt fact is that it is Democrats—including those who run the West Coast, from California through Oregon to Washington State—who have presided over one of the worst blows to the education of disadvantaged Americans in history,\" wrote New York Times columnist Nicholas Kristof, nobody's idea of a conservative, on February 24. \"The result: more dropouts, less literacy and numeracy, widening race gaps, and long-term harm to some of our most marginalized youth.\"\nYet instead of confronting and attempting to roll back that glaring inequity, the Biden administration has actively made it worse.\n'Stakeholder' Science\nWhen Rochelle Walensky was Massachusetts General Hospital's Chief of Infectious Diseases last July, the mayor of Newton, Massachusetts, emailed the doctor about the contentious issue of school openings. She was particularly concerned about the March 2020 guidance from the Centers for Disease Control and Prevention (CDC) that kids and teachers alike be separated by an average of 6 feet, as opposed to the 3 feet advocated by the World Health Organization and most governments worldwide.\n\"I do think if people are masked it is quite safe and much more practical to be at 3 feet,\" Walensky replied. \"I think this is very viable for the middle/high schools and even late grade schools and would improve the feasibility. I suspect you may want to be at [6 feet] for some of the very young kids who can't mask.\"\nThat recommendation fit squarely with the emerging consensus of epidemiologists and pediatricians studying COVID-19. Whereas researchers were scrambling to understand the virus during the initial outbreak, fearing that snotty young children would become superspreaders through not just air droplets but physical surfaces, by summer enough time and international observation had passed to declare a few findings with confidence. Pre-teens, praise be, were disproportionately not catching, spreading, or suffering from the coronavirus. People also were not catching it from leftover gunk on inanimate objects. Outdoor play was not just safe but essential for reducing the spread of the virus and increasing the well-being of children. And as long as there was good masking, schools and day cares were considerably safer than the outside world.\nAnd yet blue states like California kept police tape around playgrounds well into the fall. The few big-city school districts that were even partially open, such as New York's, instituted—after torturous negotiations with locally powerful teachers unions—automatic-closure triggers based on overall community testing, despite in-school positivity rates that consistently came in at a fraction of those of the outside world. And even though a majority of the country's private schools found a way to safely reopen five days a week by ignoring the 6-foot rule, public districts in Democratic-run cities and states continued to use that initial, panicked global outlier of CDC guidance to drastically reduce class sizes, thus making daily in-person schooling a logistical impossibility.\nSo a lot was riding on the extensive new CDC school-reopening recommendations slated to be released February 12. Biden, after all, had promised repeatedly and pointedly on the campaign trail to \"follow the science\" on COVID. He had further vowed in December 2020 that most K-12 schools would be open within his first 100 days (an ambition hurriedly scaled back to K-8). American Federation of Teachers (AFT) President Randi Weingarten and National Education Association (NEA) President Becky Pringle, who met with first lady (and teachers union member) Jill Biden on Day 2 of the administration, were both repeatedly stressing that the CDC guidance would be critical to getting their memberships back in school buildings.\nAnd the president also had a respected new CDC director: Rochelle Walensky.\nYou would think that the stars would have been aligned to follow the science, scrap the 6-foot rule, and delink school-reopening from community spread. But Democrats had a different idea.\nBack in her days at Massachusetts General and Harvard, Walensky had been free to follow the science and speak her mind. In Washington, she soon found out that both science and speech need to be vetted. Eight days before unveiling the updated school guidelines, the new CDC director was rebuked by White House spokeswoman Jen Psaki for having let slip the incontrovertible truth that \"there is increasing data to suggest that schools can safely reopen and that safe reopening does not suggest that teachers need to be vaccinated.\" Retorted Psaki: \"Dr. Walensky spoke to this in her personal capacity.\"\nThe process for producing what was billed as the CDC's \"science-based reopening\" plan looked like this, according to a Washington Post preview: \"In a sign of how carefully the administration is tending to the many stakeholders, the CDC met with more than 70 organizations as it crafted the upcoming guidelines.\" Union presidents Weingarten and Pringle \"met directly with Biden's CDC head,\" the paper reported, and both received phone calls from the president himself.\nThe final results? Not only did Walensky reaffirm the 6-foot rule she had previously opposed, but she took the further step of asserting that schools currently operating under a 3-foot standard were objectively unsafe. Even more aggressively, the CDC recommended that buildings remain at least partially shuttered in communities that have 100 COVID cases a week per 100,000 residents, a standard that upon issuance disqualified more than 90 percent of American schools.\nAs Ohio State's Vladimir Kogan and University of California, San Francisco's Vinay Prasad observed tersely in a detail-rich analysis for Stat, \"The two core pillars of the guidelines…aren't supported by science\" and \"will keep schools closed much longer than necessary, harming kids.\"\nIn an excruciating post-guidance interview with CNN's Jake Tapper, Walensky made a hash of explaining her about-face, saying that \"a lot's changed since July.\" (One of things that has changed: There's now considerably more evidence, including studies conducted by the CDC, showing that kids in school settings are not disease vectors.)\nAs for letting community spread dictate reopening policy, the director, who had only months before advocated that \"schools should be the last thing to close and the first thing to open,\" now made a circular argument: \"If there's more disease in the community, there will be more in school….We really don't want to bring community disease into the classroom.\" Thus, the CDC in 11 months boomeranged from ignorantly (though understandably) worrying that kids might be superspreaders to fretting that school settings are vulnerable by virtue of being so safe.\nLater in the Tapper interview, Walensky hinted at what might be really motivating the stakeholder-massaged science: \"The American Rescue Plan has resources, $130 billion of resources, to facilitate and help schools get there,\" said the government's leading disease scientist. \"And that's really why…we're pushing…the Rescue Plan.\"\nIn truth, less than 5 percent of the legislation's overall $200 billion K-12 component goes toward physical mitigation such as ventilation upgrades and protective equipment. A whopping 80 percent—the vast majority of which is estimated to be spent long after the virus is in the rearview mirror, according to the government's own projections—is simply aimed at hiring and retaining personnel. That's where the fingerprints of the teachers unions start to stand out on the page.\nAfter Biden had been safely elected, the AFT's Weingarten reversed her longstanding opposition to opening classroom doors and started saying things like, \"Reopening schools is vital for the health and education of our children.\" That is, she said, if schools were given enough resources.\nDistricts adhering to the 6-foot rule require massive staffing increases to keep classes, and even buses, half-full. The Rescue Plan, which comes on top of the $69 billion in extra (and still largely unspent) funding Congress appropriated to K-12 in 2020, bankrolls this hiring binge. All at a moment when families are abandoning the public school system in record numbers.\nAs an understandably exultant Weingarten said after the CDC recommendations were released, \"The stage is now set for Congress and the Education Department to make this guidance real—and that means securing the funding to get this done.\" Her wish, in March, became Congress' command.\nBy disregarding the science, Biden's politicized CDC gave unions the leeway to present themselves as being in favor of school reopening while on the ground remaining practically opposed. Meanwhile, the mounting parental frustration helped smooth passage of a massive K-12 payday with no evident strings attached. Only under withering criticism from scientists did the CDC in late March revise its 6-foot rule to the global standard of 3 feet, though the agency kept its community spread guidance intact. Predictably, Weingarten and the unions attacked the correction as being unscientific.\nAnd how have America's heavy-handed school closures affected kids? Here, the lens of equity reveals an especially grim snapshot of historically underserved communities.\n\"For approximately 3 million of the most educationally marginalized students in the country,\" concluded the nonprofit Bellwether Education Partners in an October study, \"March [2020] might have been the last time they experienced any formal education—virtual or in-person.\" Kids without computers, or internet access, or an adult at home to supervise attempts at distance learning, have just fallen off the map: \"The long-term consequences of this crisis are difficult to estimate without seeming hyperbolic.\"\nAmong students who haven't disappeared, the ones stuck in distance-learning environments are slipping behind their in-person counterparts at an alarming rate. A December study by McKinsey & Co. estimated that the shift to remote learning just from mid-March to June last year cost students of color three to five months of education and white students one to three months. When it came to the new school year in the fall, the Associated Press and Chalkbeat found that \"districts where the vast majority of students are white are more than three times as likely as school districts that enroll mostly students of color to be open for some in-person learning.\"\nConcluded McKinsey: \"The COVID-19 pandemic has taken an especially heavy toll on Black, Hispanic, and Indigenous communities. Along with robbing them of lives and livelihoods, school shutdowns could deny students from these communities the opportunity to get the education they need to build a brighter future.\"\nAnd not only did Democratic politicians and teachers unions inflict harm on minority kids by keeping schools shut; many had the gall to do so in the name of fighting racism.\n'Culture of White Supremacy'\nOn March 1—350 days after closing down all public K-12 schools in his state—embattled Democratic Gov. Gavin Newsom finally announced the most tentative of reopening plans for California.\n\"We expect all of our transitional kindergarten to grade-two classrooms [to] open within the next month,\" said Newsom, who is facing a possible recall election over his handling of the coronavirus. Though the details were foggy, Newsom's price tag was not: an additional $6.6 billion from the state budget. \"Our core belief is this: Once you dip your toe in…once you build trust, then we will start to see a cadence of reopening across the spectrum.\"\nExhausted California parents were certainly hoping for more than a \"cadence of reopening\" for just three grades in a state with a milder year-round climate than the comparably COVID-afflicted Florida, where public schools have been open five days a week since September. Yet even that extremely modest ask from the governor was a bridge too far for some teachers unions.\n\"This is a recipe for propagating structural racism,\" responded United Teachers Los Angeles President Cecily Myart-Cruz.\nIt may seem counterintuitive to advocate, under the guise of anti-racism, the continuation of a policy that has overwhelmingly harmed poor and minority populations most. Yet that's what union officials have been doing from coast to coast.\n\"The push to reopen schools is rooted in sexism, racism, and misogyny,\" the Chicago Teachers Union charged in December. \"The culture of white supremacy and white privilege can be seen…in regards to the decision to reopen schools,\" wrote 140 members of the Pasco (Washington) Association of Educators in January. \"The process the District has undergone, as well as the plans they have put forth for reopening, are rooted in white supremacy norms, values, and culture,\" asserted a subset of the Cambridge (Massachusetts) Education Association in January. \"All the rich white parents suddenly concerned about mental health can take a seat,\" tweeted the secretary of the Oakland (California) Education Association in February.\nMany of these claims can sound disorientingly pyrotechnic to those who haven't kept current with the prevailing culture of big-city educational institutions. But such jargon is increasingly commonplace. Those \"Diversity, Equity, and Inclusion\" workshops that have suddenly become ubiquitous in corporate H.R. departments got their start on college campuses a decade ago and in K-12 not long after. Throughout the public education system there are Black Lives Matter curricula for students, \"implicit bias\" seminars to help white employees get in touch with their unconscious privilege perpetuation, and the relentless invocation of a word that some Americans might have thought had been retired decades ago: desegregation.\n\"We will not wait to dismantle the segregated systems we have,\" said Richard Carranza upon taking the chancellorship in 2018 of the New York City public school system, which is 41 percent Hispanic, 22 percent black, 18 percent Asian, and 16 percent white. Carranza's signature initiative before his resignation this March was \"Equity and Excellence for All,\" an approach that mostly involved assessing the racial breakdown of the city's perceived bastions of achievement (gifted and talented programs, specialized high schools), and, where black and Latino students were underrepresented, scrapping the selection criteria. Mayor Bill de Blasio put it most transparently when announcing in December that New York middle schools would no longer screen applicants for grades, attendance, or test scores: \"I like to say very bluntly: Our mission is to redistribute wealth.\"\nBut using the hammer of government to pound out equality hurts more than just the high-achieving outliers. The very communities such policies are intended to boost tend to get stuck even deeper in a mire of mediocrity.\nGeorge Mason University education professor emeritus David J. Armor, in a September 2019 paper for the Cato Institute, analyzed the outcomes of six large school districts that use the rapidly proliferating K-12 admissions process known as \"controlled choice,\" in which families list their ranked preferences for schools and then administrators ultimately choose based in strong part on leveling the demographic distribution across a given system.\n\"None of these districts has demonstrated significant closing of achievement gaps between higher- and lower-income students, one of the main justifications for these plans,\" Armor concluded, citing the flight of upper-middle-class parents after admissions changes were made. \"Controlled choice for economic integration is not working as intended. It is still controversial, and it may be contributing to growing racial and economic isolation among some larger school districts.\"\nSomething similar happened under Richard Carranza's leadership in one of his previous positions as well. \"San Francisco Had an Ambitious Plan to Tackle School Segregation,\" ran the headline of an April 2019 New York Times article examining the effort in depth. \"It Made It Worse.\"\nIn practice, the contemporary push for educational \"equity\" requires a near-constant thrum of demonization against those groups—rich, white, and Asian, mostly—who are perceived to be hoarding privilege. Carranza was notorious for calling parents who opposed his policy preferences racist. This intentionally confrontational strategy, coupled with policy changes that sand down standards and achievement, has had a predictable effect: Families are leaving the public school system.\nThe first middle-school district in New York to try out controlled choice happens to be the one my oldest daughter attends in Brooklyn. Results? There was indeed a welcome initial increase in mobility to desirable schools among kids from poorer neighborhoods. But for the first time in more than a half-decade, overall enrollment declined, and by a significant amount: 7 percent (evenly spread among racial groups, which supporters of the plan oddly considered to be a point in their favor). All of this was pre-pandemic, mind you.\nResponses to COVID have sped up familial secession. The nation's overall public school enrollment numbers are down around 5 percent in the 2020-21 academic year. Anecdotally, I have seen considerable evidence that ongoing uncertainty over whether schools will be reliably open five days a week come September 2021 is driving still more parents away from government-run schools.\nAs those with long enough memories can testify, this type of flight can create a vicious circle for those kids—again, predominantly poor and minority—who are left behind. Fewer students mean less funding, less public support, and invariably lesser quality. Educators may soon find themselves in a double bind of their own making. In the name of equity, they have kept schools shut and alienated families who have the means to leave.\nMeanwhile, by inviting parents to view policy through the prism of racial conflict, they have loaded a weapon that may soon be aimed back at them.\nThe San Francisco Unified School District drew local and international ridicule this winter for expending valuable time and energy preparing the removal of allegedly racist names (including \"Abraham Lincoln\") from shuttered schools rather than working to reopen them. Not only were these ostensible anti-racists pilloried for their slipshod historical work (one name was slated for removal because a museum named after the man commissioned a racially controversial statue 20 years after his death), but they also found themselves hoisted on their own r-word.\n\"This is racist,\" said outgoing San Francisco Board of Supervisors member Sandra Lee Fewer, tearfully, in a December Board meeting discussion about how school shutdowns disproportionately damage minority students. \"This is a disservice. It is one thing to say 'Black Lives Matter.' It's another thing to be saying 'While they're alive.'\"\nKnow Them by Their Fruits\nMinimum wage laws were initially championed at the beginning of the 20th century by segregationist white unions who sought to thwart competition from black workers. High minimum wages in the 21st century price out the unskilled labor of legal immigrants, who tend to be from Latin America or Asia, and put pressure on small businesses, which are disproportionately run by immigrants and women.\nBiden at press time was still urging Congress to pass a $15 federal minimum wage. When one of the chief backers of that idea in the House of Representatives, Rep. Ro Khanna (D–Calif.), was asked in February about the effect on small businesses, he replied: \"They shouldn't be doing it by paying low wages. We don't want low-wage businesses.\"\nThe Biden agenda is filled with such initiatives: invented originally to marginalize out-groups, applied in 2021 unequally on populations. Gun restrictions, which Biden aims to expand, trace their roots to the post-Civil War South's infamous \"Black Codes\" (which barred newly freed slaves from owning firearms, among other things) and are in the 21st century enforced in a more racially disparate way than just about any other category in the federal code. The Protecting the Right to Organize (PRO) Act, which the president strongly supports, would, in the name of enhancing labor rights, jeopardize the employment status of tens of millions of freelancers and gig workers, many of whom are mothers struggling to create flexible part-time schedules.\nState and local policies, even more than those from Washington, tend to demonstrate the chasm between rhetoric and reality. Los Angeles and New York City are graveyards of \"affordable housing\" policies that have made rents and mortgages anything but; meanwhile you can still buy cheap houses in plenty of stimulating cities where politicians rarely utter the phrase. There's a reason Texas and Florida are projected to gain a combined five congressional seats after the post-2020 Census reapportionment, while blue states California, Illinois, and New York will likely lose one apiece.\nIt's tempting in the face of Democratic misgovernance and progressive-activist overreach to simply hit the laugh track. Lord knows there's always a new presentation somewhere (as there was in Carranza's New York school system) warning that the hallmarks of \"White Supremacy Culture\" include such pathologies as \"individualism,\" \"objectivity,\" \"perfectionism,\" and \"worship of the written word.\"\nBut the equity fad also offers an opportunity. Focusing on results rather than intent is what citizenship (and political journalism) should be about, but too rarely is. We're all better off treating the intent of powerful actors with default skepticism and demanding that they show their work.\nIt will take years, decades even, to sort through comparative governmental culpability in coronavirus mitigation. As of March 12, the United States was still ninth highest in the world for overall COVID death rate, suggesting that the presidency of Donald Trump has plenty to answer for. But the U.S. was also 21st and dropping rapidly in death rate over the prior seven days, thanks to the country's impressively rapid rollout of vaccine distribution, a feat for which both Trump and Biden deserve some share of credit, though not as much as the pharmaceutical companies in the private sector. Journalists, politicians, and political consumers are, even more than a year into this health crisis, relentlessly seeking to affix partisan blame, suggesting that policy choices and individual behavior are the leading factors in comparative coronavirus lethality. But any good look at the death-rate map suggests that geography and climate, much more than opening/closing variation, correlates with COVID damage. The greatest impact of government policy may be on those who never got sick.\nIn its best application, the modern political notion of equity can be an invitation to assess how policies impact historically disfavored populations, perhaps leading to discoveries that the more appropriate goal of equality under the law is being thwarted either by bad actors or bad design. So if the 46th president wants to subject his own actions, particularly the massive American Rescue Plan, to a results-based analysis, let us help him with the task. Track what happens to poor and minority kids as a direct result of the CDC's school guidelines. See whether Biden and Harris follow through on their campaign pledges to scale back criminal justice overreach that has disproportionately harmed generations of black men. Measure whether economic opportunity at the lowest rung of the economic ladder has been expanded or legislated away.\n\"We have never fully lived up to the founding principles of this nation,\" Biden said while signing his racial equity order on January 20. \"That all people are created equal and have a right to be treated equally throughout their lives.\" Let's make him live up to that promise.",
  "word_count": 5517,
  "scraped_at": "2026-02-14T13:40:53.682125"
}