{
  "article_id": "59434946b8e2",
  "url": "https://www.canberratimes.com.au/story/8982534/matildas-match-slow-buses-talks-with-canberra-united-new-owners/",
  "title": "Matildas match : Slow buses , talks with Canberra United new owners | The Canberra Times",
  "date": "20250603T064500Z",
  "domain": "canberratimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "From the record crowd, to complaints about transport to Bruce, and rumblings of news on Canberra United's future, the Matildas' historic game on Monday night provided several talking points after the final whistle.\nSubscribe now for unlimited access.\nor signup to continue reading\nSome fans spent more than 90 minutes taking a 19km journey from Woden to Canberra Stadium - stuck in traffic with the rest of punters trying to get to their seats before kick-off.\nIt didn't take the sparkle of the Matildas performance for the 25,125 fans in the stands, but it did leave a bit of a bitter taste. Especially for those non-regular Canberra Stadium visitors, who were shocked by the traffic flow at Canberra's biggest venue.\nAs awesome as it was to have a packed Bruce stadium, many unlucky punters found themselves in a mad rush to make their seats in time for kick-off due to transport issues.\nGetting to Canberra Stadium for sell-outs remains a problem whether you drive or take public transport. Traffic flow is a huge issue, and viral social media posts following the match highlighted the frustration out there.\nOn Canberra Notice Board one post attracted hundreds of reactions, with people complaining about missing the kick-off, buses being stuck in queues with cars outside the stadium, and bus routes taking 90 minutes from the city or the 16km route from Woden.\n\"There's always things we can do better,\" Ian McGlynn from Transport Canberra, said on ABC Radio.\n\"There was a lot of congestion for buses coming from Woden and Tuggeranong and it was a bit of a car park to get into the back of the stadium, but everything else was very well patronised and we certainly had sufficient fleet there.\"\nMcGlynn said with a new stadium planned to be completed in Bruce by 2033, the government will aim to improve public transport and traffic flow in that area, but bus lanes are something that should happen sooner rather than later.\n\"There's a lot of stuff that can be done now,\" he said.\n\"Whilst there's now those preliminary discussions around what will replace Canberra Stadium, they're conversations that we're going to need to have going forward.\n\"Whether we can get the government to put some money towards putting in some [bus] lanes for us to get in, so that we can prioritise it, so more people leave the car at park-and-ride facilities and or at home.\"\nHEYMAN HINTS AT UNITED FUTURE\nMichelle Heyman's answer to the very last question of her post-match interview with media should be cause for excitement for the United fans among the massive turnout.\nHeyman was the star of the show in the 4-1 victory over Argentina, with the hometown hero attracting a huge cheer when she came onto the pitch as a substitute, and an even greater roar after scoring the final goal of the match.\nThe Matildas superstar is currently without a club, though. At least officially, as Canberra United's ownership for next season is still yet to be confirmed by the Australian Professional Leagues.\nIt would be a scenario that might prompt anxiety for most, but Heyman played it very cool when asked how she was feeling about her current situation, hinting that her playing future in the capital is all but assured.\n\"I've had plenty of conversations with the new owners, and I'm pretty happy with what's going on,\" Heyman said.\n\"So just waiting on the APL to just release everything. I'm feeling confident within Canberra United.\"\nWhat else did we learn from the massive game?\nCANBERRA NEEDS THESE GAMES\nIf Canberra can have a record-breaking crowd of 25,125 turn up on a 4-degree school night for a Matildas match, it obviously sends a strong message to Football Australia and the ACT government that the appetite for soccer is high in the capital and it deserves more international fixtures.\nThe crowd figure broke the all-time record attendance for soccer at Canberra Stadium which was set just last year by the Socceroos - and that old record had stood for 24 years prior.\nIt's clear there's momentum for both men's and women's soccer right now, and even though the ACT government didn't get Women's World Cup games in 2023 or any games for next year's Women's Asian Cup, these individual friendlies are extremely well received by Canberra fans.\n\"We need to be playing games in smaller stadiums compared to the bigger ones, like in Melbourne,\" Heyman said, encouraging more visits to the ACT from the Matildas.\n\"We got a full stadium here, and it was an incredible atmosphere. The girls loved it. Everyone's talking in the change room of how wonderful it was to play in front of Canberra.\"\nTILLIES FANS CAN BECOME A-LEAGUE FANS\nHeyman, like many Canberran soccer fans, were left wondering an obvious question after Monday night - how do you get the fandom of the Matildas to translate to the many national team players competing in the A-League Women every week?\n\"For the Canberra people, come support the A-Leagues,\" Heyman pleaded post-match. \"Be a part of it, because it is a fun time, and we do bring good energy.\"\nThe rise in popularity of women's soccer has been jaw-dropping.\nMatildas goal-scorer Amy Sayer spoke post-game about her 2017-18 season with Canberra United and that she never could have imagined how much soccer had grown in popularity since then.\nMatildas coach Tom Sermanni said he still had to pinch himself at the fanatical reception the Matildas received at every home game while he's been in charge this past year. It was the thing he said had stood out the most during that time.\n\"I've never witnessed a crowd such as the Matildas crowd,\" the coach explained. \"It's just unique, and I pinch myself when I go out and stand in front of it before the game starts. I just can't believe I'm back and had the privilege to be back in this.\"\nSermanni believes there is a way to harness the success of the Matildas, and it should be a priority for all involved in the women's game.\n\"I'm not an expert... but there's certainly got to be a way,\" he said.\n\"Three things need to happen in women's sport - one is the media need to give it better coverage, sponsors need to come on board and realise there's a great market there that's untapped in women's football, and [lastly] people need to come along to the games.\n\"McKellar Park should be full [for Canberra United games]. We need to see young girls, families and all people coming along and supporting the domestic players in the A-League.\n\"Canberra has got a really fantastic history in what was the W-League, now the A-League Women, and it would be a travesty if they were no longer in the league. They're the best supported club. They've got a fantastic structure here.\"\nMONTEMURRO NEEDS TO KEEP HEYMAN\nNew full-time Matildas coach Joe Montemurro now replaces Sermanni who had been interim manager since Tony Gustavsson left the role after the Paris Olympics last August.\nSermanni kept Heyman in the Matildas squad for his tenure after her stunning recall in February last year under Gustavsson, but there's no telling what Montemurro will do when he picks a squad for his first game in charge against Slovenia in Perth later this month.\nWhile Sam Kerr remains sidelined with injury, even if she isn't a starter Heyman keeps proving to be a key senior figure in the squad, bringing experience and confidence to their attack.\n\"I'm being a good teammate, good supporter, and just leading by example on the field,\" Heyman said on Monday night.\n\"I think the game changes a little bit when I get on the field. Maybe it is that experience that I can bring into this team. It gives everyone else a little bit more confidence within themselves when we're playing.\"\nSERMANNI'S MOST IMPORTANT LEGACY\nTom Sermanni had a brief but vital role in rebuilding the Matildas following their disappointing Paris Olympics campaign, and bringing in new or fringe players before next year's Women's Asian Cup.\nGoalscorer Amy Sayer described Sermanni's strength as being a \"great people manager\", and as a stalwart in the women's soccer scene for so long, there was obvious mutual respect within the Matildas squad that served him well.\n\"What I felt after the last Olympic campaign was it really hurt the team quite hard,\" Sermanni said in reflection in Canberra.\n\"There were great expectations amongst the team, and things didn't work out to plan. I felt when I came into squad that the confidence and the belief in the players, collectively and individually, was a fairly low ebb.\n\"We've been able to bring back a little bit more confidence, but also able to start to bring players who have been on the outside of the squad into believing that they feel part of the squad. If anything, hopefully I've achieved that.\"",
  "word_count": 1491,
  "scraped_at": "2026-02-14T12:36:00.185127"
}