{
  "article_id": "595607450f98",
  "url": "https://statenews.com/article/2025/09/president-guskiewicz-j-batt-hold-panel-discussion-on-future-of-college-athletics",
  "title": "President Guskiewicz , J Batt hold panel discussion on future of college athletics",
  "date": "20250913T001500Z",
  "domain": "statenews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In July 2021, the NCAA implemented new rules allowing student-athletes to be paid for their name, image and likeness, birthing a three-letter acronym that has upended college athletics, NIL.\nThursday afternoon, the Lansing Economic Club hosted a panel moderated by MSU President Kevin Guskiewicz, featuring MSU Athletic Director J Batt, Women's Basketball Coach Robyn Fralick and Men’s Golf Coach Casey Lubahn to discuss MSU’s role in the future of athletics.\nThe event brought together economic and business leaders from the Lansing area, with hundreds attending at the Kellogg Hotel and Conference Center. Guskiewicz and Batt held a joint discussion before introducing Fralik and Lubahn. The pair of MSU leaders discussed Batt’s background, vision for MSU, NIL and revenue sharing, among more.\nGuskiewicz, with a long history of working in sports medicine at the University of North Carolina, said that athletics is an important revenue driver and gateway for MSU.\n“Oftentimes, college athletics is described as the front porch to the university, and I often say that it's one of several pathways into the university,” Guskiewicz said. “It's a passionate, Spartan alumni group, and so it definitely helps to drive the economy.”\nBatt added that MSU can and should be a place for people to come and visit for athletics.\n“Whether it's football games with the greatest opportunity, but basketball games–women and men, hockey or soccer games, we're happy to play a part in the community, as far as driving people in from out of town and providing entertainment throughout,” Batt said.\nOn Tuesday, MSU introduced Jared Kozzin as its new Chief Revenue & Marketing Officer for athletics. Kozzin has spent more than 17 years working in sports, specifically in corporate selling and advertising. He’ll bring his experience in revenue building to MSU, where he’ll be “maximizing and diversifying revenue streams.” In February, MSU hired Jon Dykema for a similar role, before leaving for a front office role with the Jacksonville Jaguars. Just days after, Batt was named as the new head of athletics.\nThe college football general manager role has rapidly become one of the fastest-growing positions in the sport. In the post-House v. NCAA settlement era, the demand for athletic executives who can negotiate player and coach contracts, as well as assist with corporate sponsorships and marketing initiatives, continues to rise.\nBatt said he was glad to bring Kozzin aboard the leadership team in athletics.\n“It speaks to the evolution of college athletics broadly, and that we're going to look at every area possible to drive additional revenue to support our coaches and our student athletes and provide a great game day experience for all of our fans,” Batt said. “[He’ll oversee] everything from how we operate on tickets to corporate partnerships to different opportunities around campus and stadiums.”\nIn June, the House v. NCAA settlement marked an initial step toward recognizing student-athletes as employees. Under the agreement, athletes at MSU will share in the athletic department's revenue, totaling $20.5 million. Ahead of the panel discussion, Batt explained at a press conference that MSU intends to distribute the funds based on each sport’s revenue contributions, with football and men’s basketball receiving the largest shares.\n“Revenue sharing, as defined, is revenue shared back with those sports that generate it, and so our distribution patterns will generally follow the revenue generated patterns that we have,” Batt said.\nDuring the panel discussion, Batt talked in depth about the Student Compensation and Opportunity through Rights and Endorsements Act, or the SCORE Act, in Congress.\nBatt, a fierce proponent of the bill, said it is the “best piece of legislation on Capitol Hill today.”\n“The SCORE Act is our greatest effort up till now, to solve a lot of those things. It codifies student-athletes as student-athletes, not employees,” Batt said. “It's so important to not just college athletics, but the overall higher education system, that this happens; it's a really good effort.”\nThe SCORE Act, in part, would guarantee “medical care, including payment of out-of-pocket expenses, for an injury of a student athlete…during the period of enrollment of the student athlete…and a period of at least 3 years following graduation.”\nThe bill would also prevent student-athletes from unionizing and collectively bargaining for higher wages, better conditions and other guarantees similar to professional sports.\nWith the added need for revenue in athletics, President Guskiewicz said that it is important to be strategic when balancing investing in athletics vs. academics.\n“Athletics is an important part of the overall campus life and campus community, but we have 52,000 students here at Michigan State,” Guskiewicz said. “I always talk about the importance of being strategic, bold and always having the student focus. So we were committed there.”\nSupport student media!\nPlease consider donating to The State News and help fund the future of journalism.\n“I was in DC earlier this week making a case to strengthen the partnership between the Federal Government and America's leading research universities, like Michigan State, and so it takes all types of funding.”\nAs the costs of college sports rise some universities have implemented a student fee, included in tuition specifically for athletics. Both South Carolina and its in-state rival Clemson have instituted fees of $300 and $150, respectively.\nAfter the House vs. NCAA Settlement, the Florida Board of Governors approved $22.5 million, in part funded by student fees, for Florida college athletics. So far, no Big Ten schools have announced a new student fee to fund athletics.\nOnly three months on the job as Michigan State athletic director, Batt outlined his plan for navigating transformations that continue to consume college sports, saying he believes that leadership at MSU is inclined to adapt.\n“We've got tremendous leadership, and we're tremendously fortunate that we've got a great partnership across all of our of our university with all of our great leaders, to our new provost, to our advancement team,” Batt said. “We've got really great leaders all across this campus, and so certainly, following Kevin [Guskiewicz’s] vision for Michigan State University, I'm glad to be a part of that.”\nDiscussion\nShare and discuss “President Guskiewicz, J Batt hold panel discussion on future of college athletics” on social media.",
  "word_count": 1024,
  "scraped_at": "2026-02-14T13:32:36.636059"
}