{
  "article_id": "5974ac6c84cf",
  "url": "https://www.westmeathindependent.ie/2024/07/25/fifa-opens-proceedings-against-canada-amid-drone-spying-scandal-at-olympics/",
  "title": "FIFA opens proceedings against Canada amid drone spying scandal at Olympics",
  "date": "20240725T131500Z",
  "domain": "westmeathindependent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA opens proceedings against Canada amid drone spying scandal at Olympics\nBy PA Sport Staff\nFIFA’s disciplinary committee has opened proceedings against Canada Soccer and several individuals, including head coach Bev Priestman, amid claims a drone was used to spy on Olympic rivals New Zealand.\nAssistant coach Jasmine Mander and Joseph Lombardi, an unaccredited analyst with Canada Soccer, have been sent home in connection with what the Canadian Olympic Committee has said it believes to be two separate instances of a drone being used to record Football Ferns training sessions.\nPriestman, once the assistant to former Lionesses boss Phil Neville, has announced she will not take charge of the defending Olympic champions for Thursday’s New Zealand clash, their tournament opener, with ex-Everton manager Andy Spence filling in.\nA statement read: “The FIFA disciplinary committee has opened proceedings against Canada Soccer, Ms Beverly Priestman, Mr Joseph Lombardi and Ms Jasmine Mander due to the potential breach of article 13 of the FIFA disciplinary code and article 6.1 of the regulations Olympic football tournaments games of the XXXIII Olympiad Paris 2024 – final competition, following incidents involving a non-accredited member of the Canadian delegation at the Women’s Olympic football tournament, who is believed to have used a drone to record the New Zealand women’s football team.\n“The matter will be submitted for the consideration of the disciplinary committee in the next days.”\nCanada Soccer president Peter Augruso and CEO/general secretary Kevin Blue also expressed their “unequivocal disapproval” in a joint statement announcing that their organisation would be conducting its own independent investigation.\nIt read: “On behalf of our federation, we offer our sincere apologies to the impacted players, coaches, and officials.\n“Canada Soccer has always sought to prioritise integrity and fair competition, and we understand that competing with honesty is a baseline expectation for all Canadians. We failed to meet those expectations in this case, and for that, we apologise.\n“As an immediate next step, Canada Soccer will proceed with an independent external review. This review will address the circumstances of the current matter, and more broadly, will seek to understand the historical culture of competitive ethics within all of our programs.\n“The outcome of this review will be shared publicly and corrective actions, if necessary, will be taken. We will maintain prompt and transparent communication on this matter.”\nA statement from the COC said Mander and Lombardi would be sent home immediately and Canada Soccer staff would undergo “mandatory ethics training”.\nPriestman said: “On behalf of our entire team, I first and foremost want to apologise to the players and staff at New Zealand Football and to the players on Team Canada,” Priestman said.\n“This does not represent the values that our team stands for. I am ultimately responsible for conduct in our programme. Accordingly, to emphasise our team’s commitment to integrity, I have decided to voluntarily withdraw from coaching the match on Thursday.\n“In the spirit of accountability, I do this with the interests of both teams in mind and to ensure everyone feels that the sportsmanship of this game is upheld.”\nThe COC said it was told a non-accredited member of the Canada Soccer support team had been detained by French authorities in St Etienne following a complaint by New Zealand Football on July 22.\nFollowing the COC’s review of that incident it said it had learned of a “second drone incident” on July 19.",
  "word_count": 566,
  "scraped_at": "2026-02-14T13:05:02.275365"
}