{
  "article_id": "598e360924e3",
  "url": "https://www.today.com/parents/celebrity/jason-kelce-kids-social-media-rcna158191",
  "title": "Jason Kelce , Kylie Kelce  Scale Back  Posting Kids Online",
  "date": "20240626T181500Z",
  "domain": "today.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jason Kelce has no qualms about getting personal in public, from admitting online he doesn't wash his feet to going shirtless at a playoff football game.\nThe former Philadelphia Eagles center was even the subject of a documentary, \"Kelce,\" spotlighting his family life and his high-profile decision over whether or not to retire after the 2022-2023 football season.\nBut his level of exposure has only increased since brother Travis Kelce struck up with Taylor Swift, a relationship they went public with in September 2023.\nNow, devoted fans of the singer have adopted an interest in the Kelce family, especially Jason, his wife, Kylie, and his mom, Donna.\nWith so many new eyes watching, Jason Kelce tells TODAY.com that he and his wife are changing the way they approach posting online about their family life.\n“We were showing a lot of our kids early on on the show, not a lot, but a few clips. And Kylie and I have made a conscious effort that we want to scale back a little bit there,” he says.\nJason and Kylie share three daughters: Wyatt, 4, Elliotte, 3, and Bennett, 1, who was born just weeks after her dad and uncle's 2023 Super Bowl matchup. (Famously in the words of Wyatt, \"Uncle Travvy winned\" that game.)\nThe family prides themselves on being “as authentic and open as possible,” Jason Kelce says. In “Kelce,” the softer side of the NFL star is on display, with scenes of the offensive lineman reading to his young daughters, playing with them through injuries and offering them comfort after his Super Bowl loss.\n“I think there’s a point where you know, showing the kids is good. But there’s another point where you don’t want to do too much of that,” he says. “For us, we’ve come to the realization, let’s not put them out there that much at this young of an age.”\nPromoting his partnership with charcoal company Kingsford, Jason caught up with TODAY.com about his family life after announcing his retirement from the NFL, the smash success of “New Heights” and what it’s like being a common thread between sports-following fathers and pop-culture-loving daughters.\nJason Kelce’s ‘golden rule’ for ‘New Heights’\nOne of the most reliable sources of information on the Kelce family is “New Heights,” a weekly podcast hosted by Jason and Travis Kelce, which combines updates about their lives with hot topics from the football world.\nThe brothers have leaned into the new audiences reaped from Swift. For example, after Jason, Kylie and Travis were spotted in London for Swift’s “Eras Tour” shows — and more specifically after Travis hopped up on stage himself to be one of his girlfriend’s backup dancers — the official X account for the podcast teased a debrief of the buzzy weekend in the June 26 episode.\nThe account posted a graphic of the “New Heights” logo surrounded by British symbols (or should we say Easter eggs?) like a Union Jack, a Buckingham Palace guard, Big Ben and a cup of tea.\nWith so many new eyes watching, Jason Kelce tells TODAY.com that the brothers use the “golden rule” to decide what’s fair game to talk about on the podcast, versus what’s not.\n“Obviously, there are boundaries within anybody's life,” he says.\n“You’re always navigating that, between your personal lives ... what you want to share from a team perspective, when it’s acceptable, interactions you have with teammates, with friends, with coaches. There’s a line to balance,” he adds.\nThat line can be summed up as a form of the “golden rule”: Only share information you would be OK with having shared about you.\n“If somebody else was sharing this information about us, how would we feel?” Jason Kelce says.\nThey also ask themselves: “Is there any way this is going to upset somebody by sharing a story or an anecdote?” and “Is this going to upset us, if it’s potentially something that we don’t want to share about our lives?”\nBut after answering those questions, the goal is to be “open,” something he credits the show’s success to.\n“Ultimately, the show, I think that’s what makes it enjoyable is that it’s authentic, and it’s true, and it allows people to really see into the lives of what were two NFL players, now one NFL player,” he says.\nLife post-retirement\nIn March, after 13 seasons in the NFL, Jason Kelce announced his retirement with an emotional 45-minute speech, touching on his career highlights at the University of Cincinnati, the Eagles and the family milestones in between, leaving Travis Kelce wiping away tears.\nWith the NFL season kicking off Sept. 5 in Kansas City, he says he's still adjusting to his life outside of being an NFL player, though he's actually \"more busy that I've ever been.\"\n“You figure it was going to be the opposite when you retire, but because of all these different opportunities and there’s been a lot of decisions that have had to been made,” he says.\nIn May, ESPN confirmed Jason Kelce will join the football pregame show \"Monday Night Countdown\" as an analyst next season.\nThe football star was also recently in Cannes for a festival where he spoke about the success of “New Heights,” before jet-setting to London for two nights of the \"Eras Tour.\"\nBefore, football kept him \"grounded.\"\n“It used to be, ‘I can’t do any of that stuff because I have football practice.’ So, you can’t go to L.A. to shoot a commercial. You can’t go to this place to go do a charitable outing,” he says.\nEven though his days were filled with practice, games and other responsibilities, he was still based near the team and more importantly, near his family.\n“I’ve actually probably spent more time doing other things than I’ve ever done,” he says. “But we’re in a really, really fortunate situation as a family. And we’re trying to make sure that we’re enjoying it and being in a moment, and I’m kind of learning how to saying ‘no’ a little bit better for sure.”\nHis partnership with Kingsford is one of those opportunities. The charcoal company will follow his “grilling journey” throughout the summer as he embraces a mantra that applies to both his life now and outdoor cooking: “Slow is king.”\n“I'm trying to get better at grilling,” he says. “If I'm being honest, I'm not great at it right now.”\nHe associates grilling with his dad, Ed Kelce. Growing up, his dad would “grill anything” but his go-to was chicken wings, made specifically with his own sauce recipe.\n“At one point he wanted to quit his job and go full time to try and make his chicken sauce popular and join that business,” he says. “My mom had to talk him out of spending millions of dollars and trying to make a barbecue sauce work.\n“I think he always was a little bit upset that he never got to see that into fruition, but it was a necessary sacrifice where the family was at the time,” he adds with a laugh.\n‘Being a father is the most important thing anyone can do’\nJason Kelce has witnessed his place in the spotlight change firsthand.\n“For the beginning part of my career, the people that came up to me and tried to get pictures were these huge, fat, big, hairy guys, and now it’s 14 or 15 year old girls and women,” he says.\nHe attributes it to “pop culture” — read: Swift — and the documentary.\n“Moms have also identified with Kylie very much,” he says.\nThe importance of family was something the Kelce brothers always tried to highlight, he says. They aim to make it clear on their podcast that “family is such an important foundation and part of our lives.”\nHe and Travis Kelce have since become the center of a Venn diagram between football fan fathers and Swiftie daughters. The phenomenon is visible through Cetaphil’s viral Super Bowl ad depicting dads and daughters watching a game together and Swift fans paying tribute to Jason Kelce’s career with emotional edits set to pop hits like “Long Live.”\nJason Kelce says the role and platform is “surreal.”\n“For me, fatherhood is the most important thing in my life,” he says. “It’s really, really surreal to be in a position where you’re a unifying presence for that to take place and I think it’s it’s something that’s not taken lightly.”\nHe says he recognizes the stakes.\n“We obviously realize the tremendous privilege and position we’ve been pressed in, and we’re trying to, you know, all we want is—,” he starts.\n“I don’t know, I don’t know how to say that,” he adds, before reiterating, “Being a father is the most important thing that anyone can do, or any man.”",
  "word_count": 1464,
  "scraped_at": "2026-02-14T12:32:25.820393"
}