{
  "article_id": "5998eebed929",
  "url": "https://www.independent.ie/regionals/wicklow/west-wicklow-news/local-notes/blessington-bulletin/a1528150118.html",
  "title": "Blessington Bulletin",
  "date": "20230628T011500Z",
  "domain": "independent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Blessington Bulletin\nBlessington AFC AGM\nBlessington AFC held their AGM last Wednesday night June 21 in the Coimin Centre Blessington. There was a good turnout of members to hear a review of the past year both on and off the playing fields and to elect a new committee to look after the club for the season ahead. The club celebrates 55 years this year in Blessington having being formed way back in 1968.\nThe following Officers and Committee were elected on the night, President Eugene Tyrrell, Chairperson Alan Moore, Vice-Chairperson John Hardy, Secretary Eoin O’Connor, Juvenile Secretary Alan O’Donnell, Treasurer Ken Lynch, Vice Treasurer Lar McGrath, Registrar Edwina Hardy, Academy Director Jamie Lee Mathews, Child Welfare Officer Jill Moore, PRO Adam Cullen Senior Rep. Gary Mahon, Junior Reps. Tony Bridger, Draken Wasswa and Hugh Magee. I would like to wish the club all the very best for the season ahead which will commence in August.\nLouise captains Ireland\nLast Thursday night June 22 was a very special night for Blessington’s Louise Quinn. Louise was made captain of the Republic of Ireland Women’s Football team who played Zambia in a friendly match at Tallaght Stadium. Regular skipper Katie Mc Cabe is recovering from injury so she was not risked by the manager.\nThe Girls in Green are preparing for next month’s World Cup in Australia and they will play another friendly match against one of the top teams in the World France at Tallaght Stadium on Thursday July 6 before heading down under. Ireland won the match against Zambia 3-2 after coming from a goal down at halftime. The upcoming France match will be a much tougher match for the Girls in Green.\n‘Plunkett’ Boyle commemoration\nA commemoration was held at Knocknadruce Valleymount to mark the centenary of the death of Neil’Plunkett’ Boyle the last man to die the Irish Civil War in County Wicklow. A booklet is now available to purchase at local outlets. It contains with interviews of local people who knew Neil. The booklet is on sale in the Office Shop Blessington, Tourist Office Blessington and Daly’s Hollywood priced at €10 or you can obtain by post if you contain Maureen tel. 045 965776.\nParish Lotto\nThere was another Lotto Draw for the Parish/ St. Mary’s National Schools on Thursday June 8 with another new jackpot which once again was not won. This jackpot has now survived a lot of Lotto Draws. The winning numbers drawn were 2,5,6,16. The weekly winner won €25. The next Lotto Draw will have a brand new Jackpot which will be standing at €3,075. If you would like to join the Lotto or wish to find out some more information about the Lotto Draw you can contact the Parish Office which is open from Monday- Friday mornings only tel. 865327.\nCemetery Mass\nThis coming Sunday July 2 the Annual Cemetery Mass and Blessing of the Graves will take place in Manor Kilbride Cemetery at 2pm and in Templeboden Cemetery Lacken at 3pm. Please note that will be no mass in Lacken Church on Saturday July 1 due to the cemetery mass. All are most welcome to attend the ceremonies in both cemetery’s which will begin with mass and the Blessing of the Graves will follow. Parishioners are asked to notify relatives and friends living outside the area in plenty of time in case they may wish to come along on the day.\nSoccer tournament\nBlessington AFC ‘s annual James Nolan Memorial Tournament will take place on Saturday July 29. The Tournament is open to member and non-members. Coaches And players can bring along friends/family to join in on the day. Registration will take place at 9.30am. The club would love to see everyone along and compete in a great day of soccer in memory of one of our own James who sadly died supporting the Boys in Green at the Euros in Poland in 2012.\nBlessington AFC\nBlessington AFC are on the lookout for some new players for two of their schoolboy teams for next season which will commence in September. The teams involved are their U/15 and U/16 Teams. All those who are interested in joining up should contact the club asap.\nSummer Stars\nSummer Stars Reading Challenge is back for 2023 and running until 31 August at Blessington Library. Summer Stars encourages children to keep up their reading of the summer months. All children who participate receive a reading card, pencil, bookmark, certificate and medal. T\nhis year there are great prizes for some of Wicklow’s best attractions including Clara Lara, Greenan Maze, Wicklow Gaol and Beyond the Trees. Suitable for children of all ages and it’s all completely free. So make sure to get involved. Call into Blessington Library to get started. It is a great way for children to pass away the summer months.\nThe late Jerry McEvoy RIP\nThe death took place recently of Jerry McEvoy, Ballyknockan, Valleymount. His remains were removed to St. Joseph’s Church, Valleymount last Saturday morning June 24 for his funeral mass and his cremation took place later in Newlands Crematorium, Dublin.\nJerry was well known in the Lakeside area and will be sadly missed by all who knew him. Condolences to his family at this very sad time.\nPlay cancelled\nValleymount Theatre Company decided to cancel their weekend show ‘Acting can be Murder’ which was to go on stage last Friday night June 23 and last Saturday night June 24 due to a tragic loss in the parish. They hope to rearrange it at a later date. Tickets that were sold for last weekend will be valid on the new date or you can get a refund.\nScams\nIt may be summer but that does not stop the scammers from trying to catch you out. Three recent scams I came across are a Telephone call to your landline number claiming be from An Garda Siocahana Fraud Unit informing you that there is a problem with your bank account. The second one is a text message to your mobile informing you that your AIB Visa Card has been stopped because of a problem with your bank account and the third scam is a text message from Eflow to update your account. J The message is just be careful out there. AIB, Eflow and An Garda Siochana does not contact you in this way.\nCancer Drop-in\nWest Wicklow Cancer Support Drop-in Evening takes place in the Coimin Centre Blessington this Thursday night June 29 from 7.30pm – 9pm. You are invited to come along to their poetry, prose and musical verse evening where those present will be sharing their favourite excerpts with some home baking and tea/coffee. There is no need to book as there will be lots of spaces available and there is no admission charge. A contact number is 087 4346004\nBus service\nI am delighted to report that the bus that runs every Tuesday morning from Blessington to Newbridge has got a good response after a number of appeals were made to get people to use the service. It was in serious danger of being closed due to the numbers using it which would be a great pity as it has been operating for a number of years.\nMeanwhile Blessington Commuter has ceased its bus service from Blessington to Dublin City Centre for the foreseeable future due to a shortage of drivers. They do hope to get the service running as soon as possible. Their service operated from Monday – Friday and commenced only last year.\nLocal history\nLast week I told you that Blessington was built way back in the late 17th century by Archbishop Boyle. However the first known inhabitants in the area settled in Glen Ding more than 3,000 years ago. They were attracted to the land because it offered the security of a 50 mile view across the midlands. These settlers built a Ring Fort close to the wetlands area on the hill and two Bronze Age burial sites have been discovered at Carrig and Blackrock. Meanwhile the founder of Glendalough St. Kevin was born at Tipperkevin just outside Blessington.\nThe Blessington landscape figured in the battle against the Normans in the 12th century when the last Norse King of Dublin Mac Torcaill extended his territory to Glen Ding to control the crossing point of the north/south and east/west roads to Dublin but his efforts were in vain and the Normans won out and they settled in the area and their influence was seen in the establishment of a manor at Burgage called Villa Cumin after the Archbishop John Comyn. This area has since been submerged by the reservoir now known as Blessington Lakes.",
  "word_count": 1446,
  "scraped_at": "2026-02-14T12:00:07.980268"
}