{
  "article_id": "59af0bdd3c7a",
  "url": "https://thestandard.org.nz/open-mike-31-12-2023/",
  "title": "Open mike 31 / 12 / 2023",
  "date": "20231230T174500Z",
  "domain": "thestandard.org.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Written By:\n- Date published:\n6:00 am, December 31st, 2023 - 38 comments\nCategories: open mike -\nTags:\nOpen mike is your post.\nFor announcements, general discussion, whatever you choose.\nThe usual rules of good behaviour apply (see the Policy).\nStep up to the mike …\n- Comments are now closed\n-\nwillis getting caught being a dishonest hypocrite, all labpurs fault when in opposition ,all the council at fault now she's in power, kick her to touch nz.\n-\n3 waters replaced with rhetoric doing nothing but blaming others.Auckland is in massive trouble being the biggest contributor to the NZ economy Robertson and Hipkins could make good inroads into Nationals big surge last election .\nInfrastructure in NZ needs a huge investment in water sewage and transport schools hospitals etc National will apply their austerity of the sinking lid and propaganda. Kicking the can down the road as in the Cook straight ferry's and building roads for votes. But they are heading for a massive let down the promise of inflationary causing tax cuts is all National can do.\n-\n-\nHeartfelt wishes for Health and safety during 2024.\n-\nExactly what are the risks? How many parts per billion? I suspect the paranoia is fueled by technology that can detect infintesimal fractions of pathogens, pathogens that we humans have been associated with for tens of thousands of years. The only water we had to swim in before this incursion of forensic tech were generally rivers that drained huge swathes of farmland and bush which was almost certainly tainted to a greater or lesser degree. I cannot recall many if any gutsaches associated with a good refreshing swim on a hot day. I also suspect that this drive to live in a completely antiseptic world may be our ultimate undoing.\n-\nI went for a swim anyways so did plenty of others. Defintly think they are over cautious for a lot of the beaches.\nThats said there are plenty of spots where I wouldn't at pretty much no matter what swimsafe said knowing how bad and regular (if it rains it overflows) the sewage overflows are in the Henderson creek and entering the harbour at Te Atatu.\n-\n-\n-\n-\nCities had them up to almost Victorian times. The main solid waste removed from domestic dwellings was solid human waste and ash from domestic fires. The human waste was dug out of backyard earth closets – mixed with ash in the street, and the whole lot was raked up and collected at street corners to be removed by horse and cart to the countryside and used as fertiliser. Worked on a small scale, but not on a large scale.\nIn bigger cities, human waste and other disposables were chucked into the rivers. In London, the \"Great Stink\" of the summer of 1858 (and the proximity of the Houses of Parliament to the Thames) forced action and the construction of the \"Embankment\" which provided interceptor drains which diverted small watercourses and drains further East for processing and then discharge closer to the sea.\n-\n-\n-\n-\nAuckland's problem is sewerage overflow after heavy rain. It's always (well, in my lifetime, and I'm sure before) been the case.\nThere is cross-linkage between the stormwater and the sewerage systems – especially in older areas which didn't have the separation built in.\nThey've just build a huge new sewer pipeline to try to deal with this in the high-priced Ponsonby area. NB: I think this should have been paid for by a targeted rate.\nhttps://www.mcconnelldowell.com/projects/st-marys-bay\nBut there is also the issue of all of the 'stuff' from the streets (oil, dog poo, etc) being washed into the stormwater system after heavy rain. And this will always the the case. Swimming immediately after a downpour in a city is always at your own risk.\nGrowing up, we swam at an inner-harbour mudflat 'beach' – which had waste-water outlets and occasional sewerage overflows filtered through the bush and mangroves. You just didn't swim next to the outlets, and didn't put your head under after heavy rain.\nSlight aside: Have a friend who's just had a large chunk of basal cell carcinoma removed. The oncologist was perfectly fine with her swimming in the sea (even with the odd health warning) – but was adamant that she shouldn't swim at the pools – a much greater degree of 'contamination' is present.\n-\nMy street in Auckland was subdivided in 1905. My house originally had a \"night cart\" collection.\nIn 2005, the \"Clear Harbour Alliance\" separated the waste water and stormwater in our area to reduce pollution of the Meola catchment. I got a new wastewater connection, and the stormwater continued to be disposed by way of a sump which drains to the culverted and covered stream at the bottom of the street.\n-\n-\n-\n-\nIn plenty of places in Aucjland its not heavy rain but any rain. With the massive population growth and new devlopments all plumbed into the existing infrastructure it fails almost daily in a couple of places. Basically on an out of sight out of mind basis. Hence the sad situation in Henderson creek / Te Wai o Pareira which is roundly ignored although thats slowly changing given the work of https://www.rivercaregroup.org/\nA local communty group at its best imo everyone interested in their local waterways should take a look.\n-\nNot to mention the infill townhouse developments with full-site coverage (either from buildings or driveways) – removing any ability for the land to sponge up rainfall.\n-\nAbsolutely. The old North Shore City Council used to require that any development which increased the amount of impervious area in the areas closer to the coastline, had to install detention/retention tanks to take the first flush of stormwater. These could be plumbed in to provide non-potable water for things like flushing toilets, watering gardens and providing the first rinse in a washing machine.\nThe tanks could be installed under a concrete driveway, or tucked under the eaves of a dwelling. One company even provided under eave tanks which mimicked the appearance of weatherboarding in historical areas.\nI don't think this was carried into the Unitary Plan.\n-\nIts there, pretty much everybuild I work behind as a landscaper has retention tanks and there are rules about pemable space and some pretty cool permable paving products about now. Stoneset and Hydopave are good examples\n-\n-\n-\nAnd the fish were bigger!\n-\n-\n-\n\"Add to that climate change and increased rainfall pressures on everything. We're starting to see the hard end of our failures to respect nature.\"\nThe sum of the difference between now and past years.\nAdd to that, the increased pressures on sewerage systems and related infrastructure in a rapidly growing population is going to require both financial and structural co-operation between councils and government. This is especially true of Auckland.\nMadam Willis' comment does not auger well.\nCouncils are not entirely responsible for the situation. Past governments have to take some of the blame for their lack of over-all jurisdiction covering decades. For her to dismiss it as… \"nothing to do with government\"… is typical right-wing bull headedness and lack of comprehension about what is at stake.\nShe is a dunderhead.\n-\n-\nIn a former working life I used to have to know quite a bit about this.\nThe standards are based on a likelihood of making you sick, and as such have tangible meaning. There is a direct correlation between what is measured and the chance of a person becoming ill from swimming there. The unacceptable risk is quite low (e.g. you might only have a 5% chance of getting ill), but the risk is worse for immunocompromised people.\nEvents with lowish probability are particularly likely to induce the anecdotal fallacy\n“The anecdotal fallacy occurs when people use their limited personal experience to make sweeping conclusions about a given topic. It is an exceedingly common fallacy to commit, and nearly everyone has done it at one point or another.”\n-\n-\nCathedral, mountain, moon.\nTaken in Piemonte, Italy, the cathedral in the foreground is the Basilica of Superga, the mountain in the middle is Monviso, and, well, you know which moon is in the background.\nhttps://apod.nasa.gov/apod/ap231225.html\n-\nHere is a list of NZ's top YouTube content creators. They got millions of followers and above all, are GROWING when legacy media are shedding jobs and seems to be in terminal decline.\nYet legacy media is utterly indifferent to their obvious appeal. Why is that?\nhttps://voyager.nz/blog/the-top-new-zealand-youtubers\n-\n-\nI am currently on holiday so internet search skills are a bit limited.\nThe point isn't the content, it's that these people are growing an audience when legacy media numbers are falling despite a race to the bottom. These people are doing something right, yet the MSM pretends the audience they serve doesn't exist and the skills they have might not point to a different way of delivering content. Instead, it is a circle jerk of increasingly hubristic failure. 3news failing? No problem, they all get a job at TVNZ. TVNZ job cuts? They all fail over to commercial radio. All get sacked there? Back to TV or newspapers! RNZ struggling with a falling audience for news? They hire some proven dud from mediaworks to turn things around by doing more of the same. Not one of the top 20-30 youthful online content creators has been picked up by broadcast media, who prefer an increasingly rictus Simon or mummified Wendy and to continue to pretend they are the primary source of news and set the narrative, when really they are sliding to irrelevance because Topham Guerin has hired all the internet savvy kids.\n-\n-\nOddly, this bloke didn't make the cut with >4 million subs and more than a billion views clocked.\nhttps://www.youtube.com/@andy_cooks/shorts\n-\n-\nLittle wonder they're limiting press access to Gaza.\n//\nThe intensity of bombing in Gaza is something the researchers said they've never seen before.\n\"It's just the sheer speed of the damage,\" said Van Den Hoek. \"All of these other conflicts that we're talking about [Ukraine, Syria, Yemen] are years long. This is a little over two months. And the sheer tempo of the bombing — not just the scale of it but the sheer tempo — there's nothing that tracks [like] this in such a short timeframe.\"\n.\n[…]\nThe Financial Times did a statistical analysis that compared Gaza to the Allied bombing campaign over Germany during the Second World War.\nThree cities in Germany were effectively destroyed from the air during that war: Cologne, Hamburg and Dresden. In Hamburg and Dresden, a mix of high explosives and incendiary bombs created the notorious \"firestorm\" conditions that caused streets to melt.\nData analyzed by Scher and Van Den Hoek shows that by Dec. 5, the percentage of Gaza's buildings that had been damaged or destroyed already had surpassed the destruction in Cologne and Dresden, and was approaching the level of Hamburg.\nIsrael Defence Forces (IDF) dropped around 1,000 bombs a day in the first week of the campaign and said that it had conducted more than 10,000 airstrikes on Gaza as of Dec. 10. The number of aircraft involved or bombs dropped on each mission is unknown, but Israel's main strike aircraft are capable of carrying six tons of bombs each.\nFor context, London was hit with an estimated 19,000 tons of bombs during the eight months of the Blitz, and the atomic bomb that destroyed Hiroshima was equivalent to 15,000 tons of high explosive.\nThe figures for airstrikes do not take into account the many thousands of artillery shells fired into Gaza since Oct. 7\nhttps://www.cbc.ca/news/politics/israel-gaza-bombing-hamas-civilian-casualties-1.7068647\n-\nLeave my wife alone you muppets\n- Comments are now closed",
  "word_count": 1966,
  "scraped_at": "2026-02-14T12:30:24.731344"
}