{
  "article_id": "59c9206135f9",
  "url": "https://www.westernpeople.ie/opinion/truth-is-one-of-the-many-casualties-in-the-annihilation-of-gaza_arid-9391.html",
  "title": "Truth is one of the many casualties in the annihilation of Gaza - opinion",
  "date": "20240214T114500Z",
  "domain": "westernpeople.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The more critical of you will have noted the none-too-subtle change in how the war in Gaza is being reported. The war is over. That is not surprising. From the very start there could be only one outcome - an Israeli victory. The might of the Israeli Defence (Attack?) Forces against a reasonably well armed and courageous bunch of dedicated fighters was ever only going to have one outcome and that is the annihilation of the Hamas fighters.\nCourage and dedication is never going to suffice against the armoured cars and tanks and guns and unlimited financial support of Israel. Apart from Rafa, into which the Israeli Defence Forces has coerced practically the entire population of Gaza, the rest of the tiny enclave has been obliterated by constant aerial bombardment. The country - and it is an exaggeration to call it that - is in ruins. Western support for Israel has been crucial and largely uncritical.\nNow that the war has been won, it is important that the communications battle is won. For the past number of weeks, on our television screens and in the print media, every mention of Hamas has been given the prefix “the Iran supported” terrorists. In such an unequal contest it is important that there be a bogey man and, of course, Iran is the obvious choice. It is an independent country making its own choices and, it could be argued, supporting the underdog.\nSo, it was not just Hamas, Israel had to contend with. In the public consciousness, it is the all-powerful Iran, with its nuclear capabilities. (Does it not bring to mind Iraq, with its satanic WDM - those mythical Weapons of Mass Destruction?).\nNow, there has been no such prefix ascribed to Israel in this contest. No mention of the US with its nuclear arsenal and seemingly unlimited financial resources, unequivocally supporting Israel. No mention of the UK, no mention of Germany, of France, of Italy, of NATO, of the EU. And, indeed, little mention of Ireland’s spineless failure to even endorse the South African government’s call for an end to the conflict. We should hang our heads in shame!\nBut, not really. You have got to remember that the destruction of Gaza is the responsibility of Hamas and their attack on an “undefended” (where did the Israeli soldier hostages come from?) kibbutz in southern Israel and the heinous crimes committed by the attackers, the deaths of 1,200 Israeli citizens and the taking of 250 hostages.\nBut when over 27,000 Gazans, including women and children, have died as a result of Israel’s “carefully considered” attack plan, there is need to further soothe the conscience of the Free World. It is just as well that the Israeli army took every step to avoid civilian casualties!\nThe UN, to its credit, has been unyielding in its demand for a ceasefire in order to allow humanitarian aid into the starving population. There is universal support for such an intervention. That does not suit the Israeli view of the war, so the UN must be discredited and what better way to do that than to suddenly discover that UN personnel, based in Gaza, were to the forefront of the Hamas attack on October 7th.\nIt is as yet only an allegation, of course, but to be brutally honest, it would not surprise me if it proved to be the case. Gaza-based UN personnel would have been witness to the ongoing stranglehold Israel exercised over all aspects of life in Gaza, including the distribution of UN humanitarian aid. One can only take so much of being ground underfoot before striking back.\nSo, discrediting the UN is part of the Israeli commentary and if that involves undermining the reputation of a decent, well-intentioned General Secretary Antonio Guterres, well, what the hell! All, in the Israeli view, is fair in war and the Israeli view is the only view that counts. And of course, Israeli army spokespersons can, without batting an eye, blithely and without the need for verification report that 60% of aid reaching Gaza is commandeered by Hamas.\nBecause they control what goes on in Gaza, Israel also controls, to a very large degree, what comes out of Gaza and this particularly applies to the reporting of conditions in the area. Some very courageous journalists, mostly freelance but some attached to the Al Jazeera news channel, have been highlighting the targeting of hospitals and the destruction of infrastructure.\nIn doing so they have put themselves in the firing line. Al Jazeera is an English language TV channel based out of Qatar. It is generally regarded as an independent channel reporting on Middle East news in particular. It has lost some reporters to Israeli gunfire. Don’t bother to look for Al Jazeera on your TV screens. It has, to all intents and purposes, been muzzled for fear it might present an alternative view of what is happening.\nThere is anecdotal evidence that reporters, clearly marked with the internationally recognised PRESS label, have been targeted by Israeli forces. The label is supposed to offer protection. The last I heard 66 PRESS people have been killed. A clear indication of how accurate Israeli gunfire is. There has been some reporting of the numbers but no great outcry at this merciless attack on the Fourth Estate. One would imagine that this assault on an institution vital to democracy would merit a debate or even an interest by such as RTE's\nor .When it is all over (it won’t be for some time yet) and the 30,000 plus Gazan dead have been mourned, the gallant Israeli army has been feted for their skilful defence of their country, Netanyahu has been celebrated as a wonderful wartime leader and the conscience of the Free World (that includes us) has been soothed, the global narrative will be that, despite the “dreadful” loss of civilian life in that narrow strip of coastal land that used to be Gaza, it was imperative that Israel stood up to terrorism and Iran and won the day.\nWhat a world, what a place! Ain’t you glad you’re a member of the human race?\nThat Ballina pied piper Eamonn Walsh is at it again. He wants to bring the All-Ireland Fleadh Cheoil na hÉireann back to Ballina in 2028. He caused a little confusion and controversy back in the late 1990s when he first promoted the town as the venue for Ireland’s foremost traditional music and cultural festival.\nIt was a mammoth undertaking at the time but with passion, determination, perseverance and grit the Ballina piper coaxed and cajoled the local community to come on board, and with the considerable help of a committed band of brothers (and sisters), the Fleadh was secured for Ballina in 1997 and 1998. It proved to be a huge success and has gone down in the folklore as one of the greatest of the great Fleadhs.\nOver the week of an All-Ireland Fleadh, anything up to and over 500,000 people can descend on the host town. That brings its headaches in terms of organisation but it also brings its rewards in a spend in the hundreds of millions in the local area. That, to use a football analogy, is World Cup Finals stuff.\nEamonn is not a man to take things for granted. 2028 may be four years away but he is already up and running and hoping that Ballina can again set the standard for future Fleadhanna. Maith thu Eamonn.",
  "word_count": 1246,
  "scraped_at": "2026-02-14T13:01:25.045328"
}