{
  "article_id": "59d27fd67ff8",
  "url": "https://www.dailystar.co.uk/diet-fitness/jill-scott-1-daily-thing-36078690",
  "title": "Jill Scott does 1 daily thing to tackle common issue women experience in sport",
  "date": "20251016T183000Z",
  "domain": "dailystar.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jill Scott does 1 daily thing to tackle common issue women experience in sport\nResearch shows women are keen to participate in more sport but are held back for a variety of reasons - and Jill Scott is all too familiar with one of them\nNew research has shown that 64% of women in the UK took up a new sport in the last year. Many of which were spurred on by the success of the Lionesses and English Roses. Rugby, football, and tennis are among the top choices, but many still face hurdles when it comes to getting active.\nA poll of 2,000 adults found that nearly half of women (46%) are eager to get moving, but something regularly holds them back. Common obstacles include the cost of taking part, lack of access to suitable facilities, and equipment designed with men in mind.\nConfidence issues, low energy, and not having a workout buddy are also stopping women from joining in. Worryingly, 38% say they’re stuck in a vicious cycle—feeling too unfit to join a sports team, but unable to get fitter because they’re not participating.\nThe study also revealed that women are more likely to experience dehydration-related symptoms like dizziness or lack of motivation when exercising.\nCommissioned by hydration brand Liquid I.V., the research found that while 75% of women know staying hydrated boosts performance, many lack the know-how to keep their focus and drive.\nFormer England midfielder Jill Scott, who has teamed up with the powdered hydration brand for the brand-new Hot Seat Series, said: “I know first-hand how important it is to stay motivated and hydrated, and having the right support can make all the difference.\"\nShe added: “If you’re playing in a big group match or going for a quick run, when you’re working up a sweat, you’re not just losing water – you’re losing essential electrolytes that keep your muscles and mind performing at their best.”\nThe survey showed that women’s exercise sessions typically last less time than men’s, with only 21% of women working out for more than an hour, compared to 30% of men.\nWhen it comes to inspiration, Jessica Ennis topped the list for women (19%), while men were more likely to pick footballers Harry Kane or Marcus Rashford.\nJill Scott added: “Replacing both water and electrolytes, helped me to stay sharp, recover faster, and give my all every time I stepped on the pitch.\n“Even now, staying hydrated is something I make a priority every day.”",
  "word_count": 415,
  "scraped_at": "2026-02-14T13:06:54.089655"
}