{
  "article_id": "59d3ccab9040",
  "url": "https://www.illawarramercury.com.au/story/8387483/balgownie-and-shellharbour-march-on-to-champion-of-champions-grand-final/?cs=2568",
  "title": "Champion of Champions 2023 : Balgownie and Shellharbour reach grand final | Illawarra Mercury",
  "date": "20231016T043000Z",
  "domain": "illawarramercury.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Two Illawarra teams are one game away from being crowned Champion of Champions after progressing to the grand final in their respective divisions of Football NSW's prestigious tournament.\nSubscribe now for unlimited access.\nor signup to continue reading\nIn doing so the Shellharbour U18 women and Balgownie U14 boys teams will each be gunning for their fourth trophy in what has been a highly productive and fruitful season to date.\nShellharbour will play Manly Vale FC in the championship game after downing Rouse Hill Rams 2-0 in last Sunday's semi-final.\nBalgownie will battle Eschol Park FC next Sunday on the back of an impressive 3-0 semi-final victory over Terrigal United FC.\nShellharbour coach Ben Thurgar will be hoping history repeats and his team again down a Manly Vale side they beat earlier this year to win the NSW State Cup.\n\"That's the goal but we know and expect a tougher Manly Vale side this time around,\" he said.\n\"I'm super proud of the girls.\n\"It's been a big season for us and this is a big game for us coming up. We're aiming for our fourth trophy of the year. It would be a very special achievement if we could win and pick up our fourth trophy this year.\"\nShellharbour, who won the State Cup earlier this year and won their league and grand final double, progressed to the decider of the prestigious statewide knockout Champion of Champions tournament on the back of an impressive 2-0 win over Rouse Hill Rams.\nProlific striker Mia Fleming scored a goal in each half of the semifinal win but Thurgar was adamant Shellharbour's success in not only this game but throughout the tournament, was due to solid contributions from all players.\n\"It was 28 degrees at Valentines Park, it was a sweat box. But the girls dug in and performed really well and got the win and now we're preparing for another grand final,\" the coach said.\n\"It's obviously already been a great year for us but it would be ideal if we could finish the season with another trophy.\n\"The majority of these girls have been together going on seven years now, a win would be a fitting reward. These girls are super tight and they work hard for each other. They deserve all the success that comes their way. I'm a super proud coach.\"\nBalgownie U14 boys' coach Earle Canvin was also \"very proud\" of his quadruple-title chasing team.\nLike Shellharbour, Balgowine also won the State Cup earlier this year as well as winning the league and grand-final double.\nBut having lost last year's Champion of Champions grand final, Bally are desperate to go one better in 2023.\n\"This is sort of what's been driving us to be honest. We've only lost two games in three years,\" Canvin said.\n\"COVID hurt us. In the under 12 we got to the quarter final of the State Cup. We won that 6-0. I'm fairly confident we would have done well in that but COVID finished the season then and then there was no State Cup last year because of the wet weather.\n\"We did really well in last year's Champion of Champions but the other team was just too good on grand final day.\n\"We're hoping that potentially if we can get the right result this week we can go through the season undefeated. Not many teams go through a season undefeated.\n\"It's been a great journey so far for everyone involved in the club. Winning the league, grand final and State Cup is a huge achievement. We'd love to become Champion of Champions winners also.\"\nBalgownie progressed to the decider after an impressive 3-0 win over Terrigal United FC.\nOscar Holden Kim opened the scoring for Bally with a a super strike from 30 metres out before fellow midfielder Ben Garbutt added a second goal just before the halftime break.\nOliver Smede scored the third goal late in the second half to secure the win much to the pleasure of Canvin.\n\"The boys played really well in what was trying conditions for both teams,\" he said.\n\"We are excited now for the challenge ahead. I'm sure it will be another tough game. Hopefully we can come out on top.\"\nBalgownie and Shellharbour will contest their respective grand finals this Sunday at Valentines Park.\nUnfortunately two other Football South Coast teams' Champion of Champions' journey ended with semifinal losses last Sunday.\nWoonona Sharks women's team were beaten 3-1 by Seaforth FC, while Thirroul's over 30 females lost 3-0 to Forest Kilarney FC.\nOur news app has had a makeover, making it faster and giving you access to even more great content. Download The Illawarra Mercury news app in the Apple Store and Google Play.",
  "word_count": 791,
  "scraped_at": "2026-02-14T12:40:54.459294"
}