{
  "article_id": "59fedd239407",
  "url": "https://economictimes.indiatimes.com/news/international/us/psg-vs-nantes-prediction-live-telecast-live-stream-of-lionel-messi-kylian-mbapps-next-match/articleshow/98417615.cms",
  "title": "psg : PSG vs Nantes : Prediction , live telecast , live stream of Lionel Messi , Kylian Mbappé next match",
  "date": "20230304T181500Z",
  "domain": "economictimes.indiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A commanding 3-0 victory in the Le Classique trip to Marseille last weekend gave PSG an eight-point lead in the fight for the championship, and Christophe Galtier will now divide his attention between winning the league and remaining in Europe.\nWhen does PSG vs. Nantes start?\nThis Ligue 1 match will begin on Saturday, March 4 at 9:00 p.m. local time at Parc des Princes.Live TV channel for PSG vs. Nantes\nUK: Both BT Sports' TV and online services will provide live coverage of this game.USA: BeIN Sports is airing this game, and beIN Sports CONNECT is providing live streaming.\nCanada: FuboTV in Canada will exclusively stream every Ligue 1 game this season via beIN Sports CONNECT.\nAustralia: Kayo Sports and beIN Sports offer live and on-demand streaming of the Ligue 1 for Australian viewers.\nPSG vs Nantes lineups\nPresnel Kimpembe is unlikely to play again this year, and the hosts will rest some of their star players because Neymar won't be traveling to Germany.Starting lineup for PSG is as follows (3-5-2): Donnarumma (GK) — Marquinhos, Bitshiabu, Danilo — Mukiele, Vitinha, Zaire-Emery, Ruiz, Mendes — Ekitike, Mbappe\nRico, Letellier, Bernat, Ramos, Soler, Pembele, Gharbi, Housni, and Messi are the substitutes for PSG.\nDue to Evann Guessand's withdrawal, former Liverpool midfielder Pedro Chirivella is expected to make a comeback.\nStarting lineup for Nantes (4-3-3) is as follows: Lafont (GK) — Centonze, Girotto, Castelletto, Hadjam — Mollet, Chirivella, Moutoussamy — Blas, Delort, Ganago\nDescamps (GK), Guessand, Coco, Sissoko, Doucet, Corchia, Simon, Mohamed, and Victor are Nantes substitutes.\nPSG vs Nantes prediction\nPSG to win 3-1FAQs:\n- What are PSG fans called?\nThe socios - What is Nantes FC nickname?\nThe Canaries\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.",
  "word_count": 345,
  "scraped_at": "2026-02-14T12:51:58.448048"
}