{
  "article_id": "5a54b6a8120f",
  "url": "https://www.empireofthekop.com/2024/12/03/van-dijk-fifpro-mens-xi-nominees-2024/",
  "title": "Liverpool captain Van Dijk included among FIFPRO World XI nominees",
  "date": "20241203T090000Z",
  "domain": "empireofthekop.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On Monday, FIFPRO confirmed the nominees for its World 11 finalists in both men’s and women’s football.\nThe awards are determined exclusively by approximately 28,000 professional footballers across more than 70 countries, with the winners to be announced on 9 December.\nLiverpool represented among FIFPRO Men’s World 11 finalists\nThe men’s finalists includes several Premier League players, with one Liverpool representative in Virgil van Dijk, but Mo Salah is overlooked among the list of forwards to make the shortlist.\nPlayers’ performances from 21 August 2023 to 14 July 2024 are taken into account when nominated for selection in the FIFPRO World 11, with the requirement to have played at least 30 matches for club and country in that time.\nCongrats to Van Dijk but where’s Salah on FIFPRO list?\nFirstly, congratulations to Van Dijk for being included among the nominees for the men’s category, with his appearance on the shortlist a glowing testament to how highly he’s regarded by his professional peers.\nThe Liverpool captain shipped plenty of criticism during the 2022/23 season, when admittedly he was well below his usual standards, but he’s since roared back to reaffirm his status as one of the best defenders in world football – perhaps the best.\nJournalist Oliver Holt was in awe of the Dutchman’s performance against Manchester City on Sunday, labelling him a ‘Rolls-Royce’ of a player who ‘makes the game look too easy’. Even with the Premier League champions enduring a slump, to dominate so convincingly against such a successful team speaks volumes for the 33-year-old’s talents.\nWhile Van Dijk’s nomination is richly deserved, Reds fans might well be asking why Mo Salah didn’t make the cut among the forwards, with Cristiano Ronaldo included despite playing against limited opposition in the Saudi Pro League.\nMaybe the July cutoff point counted against the Liverpool winger, who’s been outstanding this season, but he still netted 25 goals in all competitions last term and has been a beacon of consistent brilliance ever since coming to Anfield in 2017.\nNot to worry – if he and his teammates maintain their current levels for the entirety of 2024/25, there’ll surely be a heavy LFC flavour to next year’s FIFPRO Men’s 11 finalists!",
  "word_count": 367,
  "scraped_at": "2026-02-14T12:49:12.384149"
}