{
  "article_id": "5a6774ba1334",
  "url": "https://wtug.com/ixp/532/p/west-alabama-monday-briefing-75/",
  "title": "West Alabama Monday Briefing",
  "date": "20241209T213000Z",
  "domain": "wtug.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "West Alabama Monday Briefing\nGood morning West Alabama. It is Monday, December 9, 2024.\nMonday Morning Observations:\nThe Bama haters have been celebrating since the Crimson Tide was left out of the first ever 12 team College Football Championship Playoff. While a credible case for Alabama’s inclusion was made by former coach Nick Saban and UA Athletics Director Greg Byrne, others like former Tide QB Greg McElroy and most ESPN talking heads were adamant that Southern Methodist University deserved a spot more.\nThe Mustangs became the darling of national radio sports talk shows and ESPN commentators this season. Perhaps it was a way of making up for SMU receiving the “Death Penalty” for cheating by paying players in 1987, after all, it is legal now.\nAnd of course, it is quite a story coming from no football team in 1987 and 1988, going 136-242-3 over the next 33 years to ACC runners-up and playoff participants in 2024. It’s the stuff that makes bad sports movies.\nAs soon as Clemson kicked the winning field goal in overtime Saturday night to beat SMU, the drumbeat for the Dallas school to be picked for the playoffs began. It continued until the playoff brackets were revealed yesterday morning.\nNever mind that favored SMU lost to a mediocre three-loss Clemson team (sorry Dabo) and also lost at home to BYU. Never mind that their strength of schedule was 75th nationally and their two regular season wins against nationally ranked teams were over 18th ranked Pittsburgh and 22nd ranked Louisville.\nThe CFP Committee should never again emphasize the importance of strength of schedule, it’s a farce. Yes, Alabama had three losses, but they came against the 9th strongest schedule (College Football Network) in college football, including then #1 Georgia.\nThat said, if Alabama had gone to Norman and not been embarrassed by a bad two-touchdown underdog Oklahoma team, they would have been in no matter what the commentators had to say.\nThis was an underachieving Crimson Tide team that had the talent to be undefeated. They could and should have been 12-0 but they didn’t have the discipline or intensity. At times the coaching was also underwhelmingly predictable.\nBut before letting disappointment cloud judgement and saying this team should turn down the ReliaQuest Bowl invitation to play Michigan, remember, the practice for the bowl will serve as an opportunity for the Tide to improve. The talent is there, and new talent is coming. Coach DeBoer believes there will be few, if any, opt outs. So just turn off the music at practice, cancel the ice cream truck and get serious about winning and setting the stage for a comeback year in 2025.\n(Opinions expressed in Morning Briefing are not necessarily those of the ownership, management or staff of Townsquare Media Tuscaloosa.)\nWeather:\nA cold front will bring continued rainfall through tomorrow night across West Alabama. That will be followed by another shot of cold overnight low temperatures before a weekend warmup.\nThere is a Moderate (1 in 5) Risk for strong to severe thunderstorms tomorrow but that is in southeast Alabama.\nWest Alabama Forecast:\n- 4:30pm: The University of Alabama Autism Spectrum Disorders Clinc presents \"Sensory Santa\". (904 Anna Avenue).\n- 5:30pm: Tuscaloosa County Christmas Tree Lighting at the Tuscaloosa County Courthouse.\n- 6:30pm: West Alabama Christmas Parade in Downtown Tuscaloosa.\n- 7:00pm: Tuscaloosa Symphony Orchestra presents Home for the Holidays at the Moody Music Concert Hall. (810 2nd Avenue). The Concert will feature the Alabama Choral Society and the Alabama Choir School.\nRingo Starr and his All-Starr Band played the Tuscaloosa amphitheater on Tuesday, July 3, 2012, they are coming back next year.\n55 years after beginning his musical career in Liverpool, England and rising to fame as the drummer for the iconic Beatles, the 72year old Starr returns to T-Town\nRingo and band will begin their spring tour in Bridgeport, Connecticut on June 12 and will have seven show dates in cities like New York and Philadelphia before playing at the Mercedes-Benz Amp on June 24th.\nPrior to beginning the tour Ringo will be releasing his second Country album, Look Up, on January 10, 2025. It is his first country album in 50 years.\nTickets go on sale Friday at the Mercedes-Benz Amp website.\nA toddler is dead and two other people injured after a crash Sunday near Glenn Allen on Fayette County 73. The 2-year-0ld was not strapped into a car seat when the crash occurred according to ALEA Troopers.\nTroopers report that neither of the two people injured, Steven B. Collins and Wendy J. Bailey, were wearing seat belts. They were transported to UAB Medical Center in Birmingham where they are being treated for their injuries.\nA narcotic complaint in the Empire Community of Walker County has led to the arrest of three people.\nPeople 60 and older can now register to receive food boxes from the West Alabama Food Bank. Food Bank Senior Program Coordinator Demonica Walker told news partner ABC 3340, \"The more the cost of living rises the more the need.\"\nDrought conditions across West Alabama should be rolled back a bit thanks to rain yesterday through tomorrow night. It has also assisted firefighters in bringing under control a 10-acre wildfire just off U.S. 82 in western Bibb County.\nA lot of West Alabama residents travel to the Costco store in Jefferson County to shop. if you are one of them and you bought eggs while there you might want to read about the egg recall at the link below.\nThe Women’s Leadership Alliance of the Chamber of Commerce of West Alabama has conducted a year-end event to celebrate accomplishments of women in business and develop strategies for continued development.\n- Clemson at Texas\n- Tennessee at Ohio State\n- SMU at Penn State\n- Indiana at Notre Dame\nFirst Round byes: Arizona State, Oregon, Boise State and Georgia.\nCollege football's winter transfer portal window opened today, and players have until Dec. 28 to enter. It doesn't mean they have to find their new schools by then -- or that they can't return to their previous schools -- but they have 20 days to decide whether they want to be in the portal.\nAt least 10 Alabama players are expected to enter their names in the portal.\nRead More: Alabama 2024 Transfer Portal Tracker\nAlabama will play Michigan in the ReliaQuest Bowl in Orlando on New Year's Eve. It will be a rematch of the CFP first round game the two teams played in the Rose Bowl last year, which the Wolverines won.",
  "word_count": 1094,
  "scraped_at": "2026-02-14T13:17:02.714202"
}