{
  "article_id": "5a6b505dbcca",
  "url": "https://cartilagefreecaptain.sbnation.com/2024/9/2/24233750/the-hoddle-of-coffee-tottenham-hotspur-news-and-links-for-monday-september-2",
  "title": "The Hoddle of Coffee : Tottenham Hotspur news and links for Monday , September 2",
  "date": "20240902T103000Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "good morning!\nThe Hoddle of Coffee: Tottenham Hotspur news and links for Monday, September 2\nA look at the month ahead\nAfter yesterday’s bummer of a loss, I think we should postpone the EFL Champ roundup til tomorrow and do a Look at the Month Ahead instead. Since I reckon you all will want to discuss Spurs things (or, different ways of folding cloth napkins).\nTottenham Hotspur men’s squad:\nWe’ve got an interesting month ahead - hopefully a month that’ll see quick returns for Dominc Solanke and Micky Van de Ven.\nAfter this week’s international break, (because the Euros Olympics weren’t enough international comeptition, apparently), Spurs return to action with a North London Derby against Arsenal. At home. During ... daytime? That’s an odd time to have it.\nI’m not too fussed with how this season’s shaken out so far. The Leicester draw was more upsetting to me than the Newcastle away loss. BUT nothing will upset me more than a poor result against Arsenal at home.\nThis isn’t an easy month. After that we have two matches against Brentford and United. Plus domestic and international cup fixtures against Coventry and Qarabag, respectively.\nIt’s just good to watch football again. You’d also think six matches in one month is more than enough for professional footballers, who are treated more and more like machines with each passing season. But apparently it isn’t, because we have international football for some cockamamy reason. And the even better news is that the Europa League group stage now consists of eight matches instead of six.\nHooray, hooray for the continued degradation of humanity!\nTottenham Hotspur men’s schedule: Arsenal (15 Sep), at Coventry (17 Sep, EFL Cup), Brentford (21 Sep), Qarabag (26 Sep, Europa League), Man United (29 Sep)\nTottenham Hotspur women’s squad:\nAnd the women’s team also begins their season this month. Not too sure what to make of their chances. Have they done much with the transfer window? Just two matches this month. One looks like a toughie agaisnt Villa, and the other against a newly promoted Palace.\nTottenham Hotspur women’s schedule: Crystal Place (22 Sep), at Villa (29 Sep)\nFitzie’s track of the day: Snowblind, by Black Sabbath\nAnd now for your links:\nDan KP: Ange Postecoglou thinks rewards will come for Spurs despite Newcastle loss\nThe Athletic ($$)’s talking points from Tottenham’s loss to Newcastle\nErik ten Hag says he isn’t Harry Potter",
  "word_count": 401,
  "scraped_at": "2026-02-14T13:01:33.076629"
}