{
  "article_id": "5a7daad9bfae",
  "url": "https://punchng.com/super-falcons-hail-captain-onome-ebi-as-she-retires/",
  "title": "Onome Ebi Retires : Super Falcons Hail Captain Legacy",
  "date": "20250918T090000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Super Falcons have hailed Captain Onome Ebi for her remarkable contribution to Nigerian women’s football, following her retirement from professional football.\nIn a heartfelt message posted on X on Thursday by teammate Rasheedat Ajibade, the football team praised Ebi’s leadership and legacy\n“On behalf of every member of the Super Falcons, we extend our deepest gratitude to you, Captain Onome Ebi, for your extraordinary service and leadership over the past two decades.\n“Your four WAFCON titles, and historic six FIFA Women’s World Cup appearances have made you a beacon of excellence for our team.\n“You have been more than a captain. You’ve been a trailblazer who paved the way for this generation of players,” Super Falcons wrote.\nThe team recounted her early days with Bayelsa Queens to shining on global stages in Sweden, Turkey, China, Spain, and back home in Nigeria, Onome was praised for proving that no dream is too big and no barrier too high.\n“Your resilience has inspired us to push beyond limits and believe in our potential to continue to make history.\n“As you retire from professional football, we celebrate your monumental legacy and wish you boundless success in your next chapter.\n“Your promise to mentor and uplift young African footballers ensures your impact will echo for generations.\n“Thank you, Onome, for being our hero. Cheers to a legacy that will never fade!,” the statement concluded.\nEbi, ends a 20-year-long career with the national team, earning 109 caps, the most by any Nigerian female player, and winning four African Women’s Championship titles.\nShe also made history in 2023 as the first African footballer, male or female, to play in six FIFA Women’s World Cup tournaments.\nIn her own post on Wednesday on X, Ebi reflected on her career,” Today, I officially retire from professional football.\n“The journey has been filled with challenges, victories, and lessons that shaped me into who I am today.\n“Though I hang up my boots, my purpose in the game continues to give back, to guide, and to be a voice for players.”",
  "word_count": 342,
  "scraped_at": "2026-02-14T12:36:51.402612"
}