{
  "article_id": "5aa46fe02663",
  "url": "https://www.aljazeera.com/news/2023/8/20/we-are-equal-spanish-fans-celebrate-womens-world-cup-win",
  "title": "  We are equal : Spanish fans celebrate Women World Cup win | Women World Cup News",
  "date": "20230820T224500Z",
  "domain": "aljazeera.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "‘We are equal’: Spanish fans celebrate Women’s World Cup win\nSpain’s women’s national football team win their first World Cup, defeating England 1-0 on Sunday.\nMadrid, Spain – As the thermometer crept up towards the high mark of 38 degrees Celsius, the empty streets started to fill with red-and-yellow shirts.\nFans wearing the colours of the national team were heading to a screening of the World Cup final at the indoor WiZink Arena in central Madrid. The 7,000 seats made available for Sunday’s show were sold out in half an hour.\nRecommended Stories\nlist of 3 items- list 1 of 3Canada women footballers reach interim pay deal, but say fight ‘isn’t over’\n- list 2 of 3How far can women’s football go?\n- list 3 of 3‘There are still struggles’: Fixing the diversity gap in women’s football\nThose queueing outside ducked into any shade that became available as the doors opened an hour before Spain took on England at noon local time.\n“This is a great opportunity to make the team famous in Spain,” former third-division footballer Sonia Trillo, 24, told Al Jazeera.\n“More people are supporting the team thanks to this competition. We have to take the opportunity and win the match.”\nThe reasons for this opportunity being so significant say a lot about the struggle women’s football is still facing. Even for World Cup finalists.\nInside the arena, supporters watched the game unfold on a giant cube suspended above them.\nIt hardly needs describing that Olga Carmona’s 29th-minute goal prompted wild celebrations, that groans met Jenni Hermoso’s penalty miss, or that joy erupted at the final whistle.\nBut it is more than just a football result in a country where the women’s game has struggled to be taken seriously.\n“The people used to see the women as less than men,” said Lucia Morales, a semi-professional footballer, on a terrace after the game.\n“Now we’ve shown that we are equal and can win also a World Cup.”\nThe Spanish players did that despite being shorn of some of their best players in a dispute over the lack of resources being given to the team and amid rumours of controlling behaviour by coaching staff.\nIn September last year, 15 players asked to no longer be selected. Eight have since returned to the fold and three made the World Cup squad.\nCoach Jorge Vilda may have led them to victory but celebrations with his players have been awkward at best.\nBack in Madrid, celebrations were also muted – although the World Cup has fallen at a bad time of the year for spectators in the capital, many of whom have escaped the August heat for their annual pilgrimage to the coast.\nThe final was also at a bad time of day. When Real Madrid have won a big match – or Spain have won a men’s World Cup or European Championship – the Plaza de Cibeles heaves with fans throwing themselves in the fountain.\nBut this has usually been at night, in May or June, not in the middle of the Spanish holidays and at a time of day when those still in Madrid are warned to stay indoors, away from the heat.\n‘Never seen’\nSome bars, though, like the one Lucia Morales visited, were still packed hours after the final whistle.\nThere were plenty of men in national jerseys but it was girls and women who took the lead in the singing and dancing.\n“It’s a change to celebrate with other girls,” Morales, 27, said. “And when the team gets back with the trophy, we want to see kids there, families – it’s something we’ve never seen with women’s football.”\nMany thousands are expected to turn out when the victorious Spanish team returns to Madrid on Monday night.\nThe women celebrating here also hope the new generation will have better chances than they did.\nTrillo had to stop playing for her team to start a job as a physiotherapist. By contrast, third-division men’s players can make a good living.\nThe top players ply their trade in England or at European champions Barcelona – who won an incredible 62 games in a row until May this year. This may be great for them, but bad for the competitiveness of the league.\nHope may be found in the example of Sunday’s opponents – England.\nTheir European Championship victory last year marked a surge in the women’s game, with the English FA introducing new pathways for girls to reach the top.\nThe chasm between the men’s and women’s game in England remains huge. But national team success has brought exposure – and progress.\nBy the time of the next World Cup, Spanish women may have found that La Roja has started doing the same for them.\nAnd more fans may take to the streets after matches – only this time, at night.",
  "word_count": 809,
  "scraped_at": "2026-02-14T12:16:14.169008"
}