{
  "article_id": "5ab0918f82c0",
  "url": "https://thepeoplesperson.com/2025/03/01/semi-automated-offside-technology-to-be-used-for-first-time-at-old-trafford-in-cup-tie-versus-fulham-291481/",
  "title": "Semi - automated offside technology to be used for first time at Old Trafford in cup tie versus Fulham - Man United News And Transfer News",
  "date": "20250301T140000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United’s FA Cup tie versus Fulham tomorrow will use semi-automated offside technology (SAOT) for the first time at Old Trafford.\nThe Red Devils welcome the Cottagers on Sunday afternoon in the cup for the second time in three seasons.\nIn a campaign where the home side’s league form has been well below expectations, Ruben Amorim will hope to go as far as possible in the cup competitions they remain in.\nOne aspect of the match will be historical however for the English game and Old Trafford.\nThe Sun report that “the FA Cup fifth round will create history in English football, as semi-automated offsides will be used for the first time.”\n“Seven of the eight FA Cup fifth round fixtures will use the new technology, aiming to speed up the VAR offside decision-making process.”\nPreston vs Burnley will be the only fixture not to use the SOAT because the tie is not taking place at a Premier League ground. The technology made its debut last night in Aston Villa’s 2-0 win over Cardiff City.\nIn theory, the technology should speed up decision making processes when it comes to deciding if a player is offside or not.\nThe “technology uses tracking cameras to help referees know when a player is offside.”\nThe biggest advantage is that it will flag up players in offside positions to the referee instead of having to draw lines on images, which can be seen as controversial and rather subjective.\n“SAOT has already been used at two World Cups (Qatar 2022 and Australia and New Zealand 2023 women’s tournament), in the Champions League since the 2022-2023 season, in the Serie A since January 2023, and in La Liga since the start of this season.”\nUnited fans will have been happy that it was not in use during the last round when Harry Maguire’s late winner would almost certainly have been ruled out for offside if VAR or SAOT had been in place.\nFeatured image Gareth Copley via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 338,
  "scraped_at": "2026-02-14T12:10:56.891376"
}