{
  "article_id": "5b171dcb437e",
  "url": "https://goprincetontigers.com/news/2024/12/5/tiger-blog-thursday-tigerblog-fun-fact-thursday",
  "title": "Princeton University",
  "date": "20241205T071500Z",
  "domain": "goprincetontigers.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Princeton University Athletics\nThursday TigerBlog - Fun Fact Thursday\nDecember 05, 2024 | Tiger Blog\nIn honor of Xaivian Lee's triple-double against Saint Joseph's Tuesday night, welcome to TigerBlog's Thursday of Fun Facts.\nLee's triple-double consisted of 18 points, 13 rebounds and 10 assists. As TB watched the end of the game on TV, knowing how close Lee was to the triple-double, he kept audibly groaning when Lee would go to the basket rather than dish.\nHe does acknowledge, of course, that Lee needed to do that to win the game, which is what Princeton did, by a 77-69 count. In fact, it ended up being the best of all worlds: Lee got his history-making achievement and Princeton got a big win.\nLee was extraordinary all night. He is an amazing player, one who obviously makes everyone around him better — and that is the best thing you can say about any player in any sport. He also has an innate ability to take over games at crunch time, which is what he did against the Hawks.\nIt really was inevitable that he'd get one at some point of his career. In fact, if you had to guess, do you think he'll have one for his career or he'll get at least one more?\nTB would go with the latter.\nFun Fact No. 1 for today: It is the first documented triple-double ever by a Princeton men's basketball player. As TB wrote yesterday, assists were not kept as an official stat until 1974, which means that there were some great Princeton players who never really had a chance at the achievement.\nAnd so that brings TB to the second Fun Fact for today.\nBill Bradley played in 83 basketball games at Princeton. Do you know how many times he had a double-double? The answer is 60.\nThat equates to a double-double in 72 percent of the games he played as a Tiger. Perhaps one day TB will go back and watch the video of all 83 of those games and see how many triple-doubles, if any, Bradley would have had.\nShifting gears, here is Fun Fact No. 3 for today: Princeton has 38 varsity teams, and exactly half of them — 19 — have won their most recent conference title.\nThink about that. Let that sink in. TB's thought when he first saw that was \"yikes.\"\nFun Fact No. 4: Princeton won five Ivy League championships (field hockey, women's soccer, men's and women's cross country, women's volleyball) and one non-Ivy title (men's water polo) this fall. No other league school won more than one.\nThat total of six championships, by the way, doesn't include the Ivy League tournament championship won by the men's soccer team.\nFun Fact No. 5: Messages from the human brain travel on nerves at speeds up to 200 miles per hour. That has nothing to do with Princeton Athletics — or does it? Remember when Pete Carril always said the biggest thing a player needs to do is \"see it.\"\nSeeing it is a direct result of messages from the human brain. And they need to move at that speed, or faster, to make a player pass like current head coach Mitch Henderson did.\nAlso, it reminds TB of something he heard Carril once yell in a practice at one of his best players when that player was a freshman: \"Ya gotta see it. What's that matter? Can't see it? I had a guy once who couldn't see it. Had to get rid of him. Couldn't do much with him.\"\nTB will not be revealing the identity of the player at whom Carril yelled. Just know that yes, he could definitely see it.\nWhat's the next fun fact. Hmmmm.\nFun Fact No. 6: The men's water polo team is in California now getting ready for its NCAA quarterfinal matchup tomorrow against fourth-seeded Stanford, the host school for the tournament. Princeton and Stanford will play in the second match of the day in Palo Alto, with start time at 5 pm Eastern.\nThe winner of that match gets the winner of No. 1 UCLA and Salem (from West Virginia) in Saturday's semifinals. The final will be Sunday.\nFun Fact No. 7: The Princeton men's hockey team was the College Hockey News Team of the Week this week after its 3-1, 3-1 sweep of then-No. 12 Ohio State last weekend.\nThe Tigers are back on the ice at Hobey Baker Rink this weekend against Union and RPI, with face-off both nights at 7. It'll be interesting to see how much momentum and confidence the Tigers take into those games after taking down the Buckeyes.\nFun Fact No. 8: Victor Hugo's novel Les Miserable contains a sentence that is 823 words long.\nDo you hear the people sing?\nHey, this was fun.",
  "word_count": 803,
  "scraped_at": "2026-02-14T12:18:23.363263"
}