{
  "article_id": "5b3c4e780cfe",
  "url": "https://www.timesandstar.co.uk/news/national/24566025.pastis-maker-pernod-ricard-scraps-sponsorship-psg-protests-marseille/",
  "title": "Pastis - maker Pernod Ricard scraps sponsorship of PSG after protests in Marseille",
  "date": "20240905T161500Z",
  "domain": "timesandstar.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "French wine and spirits company Pernod Ricard, best known in France for the anise-flavoured aperitif pastis, said on Thursday it has scrapped a new sponsorship deal with Paris Saint-Germain after protests from Marseille.\nFans of Marseille, the bitter rival of PSG, complained that the drink belongs to their city.\nPernod Ricard said in a statement it ended the global deal announced this week “because of the strong emotions aroused”.\nMarseille has long been associated with the French liqueur called pastis. So when Pernod Ricard announced the new commercial partnership with PSG, it left a bad taste in the mouths of Marseille fans.\nThe hashtag #boycottPernodRicard spread on social media as fans felt betrayed by a company that boasts about its Marseille origins.\nThe issue became so intense that even Marseille mayor Benoit Payan got involved, asking Pernod Ricard for an explanation.\nAlexandre Ricard, chief executive of Pernod Ricard, said he took the decision to scrap the four-year sponsorship after “listening to those who make the group successful, including our employees in France, our customers and our shareholders, first and foremost my family”.\nPastis is consumed in all regions of France, but it is particularly popular in the country’s south, where Paul Ricard, from Marseille commercialised the drink under his name in 1932.\nPernod Ricard was created in 1975 after a merger of Pernod and Ricard, which brought together two French anise-based spirits.\n“For more than 90 years, Ricard’s history has been intertwined with Marseille, the city that saw the group’s birth, growth and inspiration,” Alexandre Ricard said.\n“And this link is stronger than anything else. It is therefore a decision that comes from the heart that I am making today. I’m sure that everyone who has worked on this project will understand my choice.\n“Pernod Ricard will continue to proudly claim its origins and the sincere ties that unite our brands with their communities.”\nWhen the deal was announced, upset fans said they would stop drinking pastis, or switch to rival brands, while others called for a boycott of the more than 240 brands in the wine and spirits seller’s global portfolio.\nPernod Ricard said it had a global reach and excluded France “in terms of visibility or activations”.\nOn Thursday, it added the agreement was initially thought to promote its whisky and champagne brands internationally, not pastis.\nPSG and Marseille are the two biggest powerhouses of French football.\nTheir rivalry became popular during the 1990s.\nMarseille, the only French team to win the Champions League (1993), has fallen well behind since PSG was taken over by Qatari investors in 2011, but the rivalry still stirs up passion.\nThe four-year agreement was to begin this season and would have covered PSG’s men’s and women’s football teams and handball.",
  "word_count": 458,
  "scraped_at": "2026-02-14T12:48:38.399736"
}