{
  "article_id": "5b4c41ba84d0",
  "url": "https://www.dailymail.co.uk/femail/article-13591895/Why-men-suddenly-crying-public-Cristiano-Ronaldo-Dermot-OLeary-Jeremy-Clarkson-break-onscreen-four-writers-debate-tears-ultimate-strength-worlds-biggest-turn-off.html",
  "title": "Why ARE so many men suddenly crying in public ? As Cristiano Ronaldo , Dermot OLeary and even Jeremy Clarkson break down onscreen - four writers debate if tears are  the ultimate show of strength  or the   world biggest turn off  ",
  "date": "20240702T161500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Why ARE so many men suddenly crying in public? As Cristiano Ronaldo, Dermot O'Leary and even Jeremy Clarkson break down onscreen - four writers debate if tears are 'the ultimate show of strength' or the 'world's biggest turn off'\n- Cristiano Ronaldo burst into tears on Monday night after missing a penalty\n- READ MORE: Cristiano Ronaldo breaks down in TEARS after his extra-time penalty was SAVED\nCristiano Ronaldo, regarded by many as the greatest footballer of all time, cried nothing short of a river on Monday night, so frustrated was the Saudi-based striker with his inability to find the back of the net in the Euros knock-out match against Slovenia.\nAnd the footballing superstar isn't the only one to howl at the moon in public. Taylor Swift's squeeze Travis Kelce has cried on camera on multiple occasions during his football career.\nWhen King Frederik of Denmark took the Danish throne in January this year, he couldn't stop the tears flowing from his eyes, using his formal white glove to dry his moist eyes.\nAnd even Brits, renowned for our stiff upper lips, are beginning to let it go in public.\nDermot O'Leary has been known to well up when faced with harrowing real-life stories on This Morning and even Jeremy Clarkson, who appears granite of heart much of the time, couldn't help looking a little choked up when told it was better 'not to ask questions' about the fate of his beloved pet cow Pepper on an episode of Clarkson's Farm.\nMade In Chelsea star Sam Thompson has also appeared emotional in public, amid reported 'crisis talks' with his girlfriend Zara McDermott.\nBut should men wear their heart on their sleeves, or have the male species got a little bit, well, mushy?\nHere, two men and two women serve up their very different opinions on the issue...\nAnd they hadn't even lost the match! A distraught Cristiano Ronaldo is comforted by his team-mate Diogo Dalot on Monday night after his penalty was saved by Slovenian keeper Jan Oblak\nPrince to King equalled tears for Frederick of Denmark back in January this year; the country's new monarch couldn't hold back the flood as he greeted his people in Copenhagen\nTV presenter Dermot O'Leary regularly tears up at some of the tough real-life stories he discusses on This Morning, and even Jeremy Clarkson has been known to be moist of eye on Clarkson's Farm\nNO, MEN SHOULDN'T CRY IN PUBLIC\n'Men who bawl their eyes out at any given opportunity. Sorry, it's a hard pass from me!'\nMother-of-one Annette Kellow, 40, who is a journalist, from London, believes men should be 'stoic, sturdy and strong'.\n'Is there something in the water? It seems so, with blubbering bloke Ronaldo breaking down at last night's Euros.\nAnd he's not alone. Andy Murray has also wept on court, while Ireland rugby star Peter O'Mahoney started crying before the game.\nFans of cricketer Steve Smith even chanted 'We saw you cry on telly' when he walked onto the Ashes pitch in 2023.\nIt begs the question; should men be crying in public at all?\nMany moons ago I dated a guy who cried. He didn't like his job and he'd fallen out with a family member, then his car was broken beyond repair.\nYes, crying is a good release but this was generic life stuff. And dare I say it, menial.\nWriter Annette Kellow says she has little time for men who 'trauma-dump' in public\nIt instantly gave me the ick and I had to end the relationship after a couple of months. His eyes were wet when I told him too. Now if I see a hint of glaze I'm gone.\nCall me old fashioned but at one point men were stoic, sturdy and strong. They would open doors, be the shoulder to lean on and take a pragmatic approach to life. They were dependable and something that many now turn their nose up at; chivalrous.\nNow you have men who want to 'trauma-dump,' live in a coffee-cup festering bedroom at 40, and bawl their eyes out at any given opportunity. Sorry, it's a hard pass from me.\nSince my cry-baby boyfriend, I have avoided moist-eyed men at all costs and have only ever picked restrained ones who know how to act in public. Crying is for funerals, for really serious scary stuff, not for basic life issues which crop up day to day.\nWhile expressing emotions is healthy and of course, is beneficial for us all to find a network of friends and family for support, in my opinion, it's unnecessary for it to be so public.\nAs a woman, I would find it pretty alarming if I saw a man out and about having a full-blown weep fest, particularly if it was in the nighttime and dark.\nWhile I understand sometimes a man may find himself unable to hold back the tears, life presents us with many failures and difficulties and there's a time and a place for everything.\nWith so many emotional baggage boys around, I actually find it attractive to see a very composed man.\nSometimes discretion is everything and when he knows how to hold himself, and embodies a dignified approach, you can't beat it.\nFor me, I believe men crying in public will only lead to unwanted attention, speculation and while they may feel better for letting it all out, that's what toilets and snivelling under the duvet is for.\n'We must remember that a football field is a very different place to the office...'\nProfessional career coach Tim Mart, founder of employment training provider Know You More, says the essential test of a leader is how they manage their emotions...\nCristiano Ronaldo's tears have certainly revived the discussion over emotional expressiveness in leadership, and whether there is a place for it.\nEmotions are a natural part of our lives, and acknowledging them is essential for true leadership - but there are productive ways of doing so.\nLeadership shouldn't be about perfection, or ego, but should be about inspiration, motivation and empathy.\nRonaldo's emotional display doesn't indicate weakness, but the essential test of a leader is how they manage their emotions.\nLeaders who learn to skillfully control their emotions within the workplace are in a stronger position to motivate their teams and foster a culture that values emotions.\nShowing deep emotions at work, from anger to sadness, doesn't always have a positive impact on colleagues, says employment coach Tim Mart\nShowcasing deep expressions of anger, sadness or frustration in aggressive, or unproductive ways will have the opposite effect of this.\nYes, vulnerability can be inspiring, but expressing deep emotions can create feelings of discomfort among peers, where communication can drive motivation, understanding and affirmative actions.\nWe shouldn't see Ronaldo's tears as a sign of weakness, but as a metaphor of the blood, sweat and tears put into this hard, physical work to become the footballer that he is, and the grief of losing the penalty.\nBut we must remember, that a football field is a very different place to the office, where emotions aren't as off the cuff, and the goal posts aren't as intense, so they need to be handled differently.\nIt's important not to hide emotions in the workplace, but it's important to embrace healthy communication over intense expression, as this is more productive.\nYES, MEN SHOULD CRY\n'Being in touch with your emotions and masculinity aren't mutually exclusive'\nHolly Matthews, 39, from Coventry, is a qualified self-development coach and founder of The Happy Me Project and author of a book of the same name, helping women build their confidence.\nI am a huge fan of crying. I cry when I'm happy, sad, frustrated and in public if needed. Unfortunately, there are many negative connotations linked to crying, like, 'it's weak to cry' and men particularly get taught to 'suck it up' or 'dry your eyes' from a young age.\nBut this message is damaging. When we cry, we are afforded a 'release' and tears contain stress hormones, meaning we are literally crying out our stress. This clever tool can stop some of the eruptions we might encounter when we bottle things up inside and if we were able to see other people in their moment of crying, we may give ourselves permission to do the same where needed.\nCrying in public? Much better than keeping it all in and watching your mental health dive, says self-development coach Holly Matthews\nI'm lucky in that I have good 'crying mentors'. Both my parents were comfortable crying in front of me and seeing my strong Geordie Dad (who worked on oil rigs and ticks all the boxes of masculinity) cry over 'It's A Wonderful Life' every Christmas taught me that being in touch with your emotions and masculinity aren't mutually exclusive.\nPerhaps if men cried, there would be less 'straight to anger', less conflict, less war. If men were given the option to lift the lid on the boiling pot of human emotions we carry, then it wouldn't bubble over into places that are unhelpful to them. This might seem simplistic, but crying is self-care, it's brave and it allows others to see that we might be in need of support.\nNow, you may still be stuck in the 'story' that crying isn't what strong successful men and women do but every time you tell yourself that unhelpful story there will be someone else crying all the way to their best life. Steve Jobs was known to be a crier and I'm confident he did pretty well in life, even as the tears flowed freely.\nIn Japan they have realised the importance of this release and that culturally there is a huge stigma around outward displays of emotion and so 'crying clubs' have sprung up as a way to help. These clubs are called 'rui-katsu' which translates as 'tear seeking' and I really feel this is an incredibly pragmatic way to support our mental health.\nSo, do I believe that we should tell people to stop showing so much emotion in public places? No, I most definitely do not. I think the world is full of rage and war and humans wound up tightly like coiled springs and those people are wreaking havoc in our society.\nI believe we should stop stifling this natural coping mechanism because of old stories and societal pressure and my hope is that the Mums and Dads right now teach their boys (and girls) that it's OK and important that they feel their emotions, they release as needed and embrace any tears that come.'\n'I didn't cry at the birth of my daughter - but blubbed watching Coldplay headline Glastonbury, men should feel free to express their emotions.'\nRich Pelley, 50, from London, is a journalist and father-of-one.\n'To say us men are not in touch with our feelings is not only a general sweeping generalisation, but – speaking on behalf of the less fair sex – also plain wrong. It's just that our brains are wired differently. A girlfriend of mine would cry at the drop of a hat. I once came home to find her in floods of tears, and couldn't for the life of me work out what I must have done. Turns out, Helen Daniels from Neighbours had died Neighbours a few hours earlier (actually, twice – once at 1.45pm and again in the repeat at 5:30pm). (Anne Haddy, who played the character, died two years later, which was admittedly a bit sad. But we're talking about a TV character here).\nThere's nothing wrong with a good blub, says writer Rich Pelley, whether it's about your football team or something deeper\nThe same girlfriend cried when our pet goldfish died after one day because I'd hadn't sterilised the water, or whatever I was supposed to do, and had to ceremoniously flush him down the toilet.\nI can pinpoint three moments in my adult life when I've actually sat, with tears running down my face, in the privacy of my own home, for a specific reason. These were all private moments triggered by something personal. The main one was being dumped by the above long-term girlfriend. (At least being emotionally repressed wasn't one of the reasons she gave).\nOther sad moments – such as the death of a grandparent, the death of a Monarch (RIP Queen) haven't elicited a tear. I didn't cry at the birth of my daughter. I'm not a heartless monster. It's just that the sad thing hasn't happened *directly* to me. In all the death and childbirth, I didn't do much more than stand around and watch.\nYet I've stood up to my knees in mud watching my favourite bands with tears streaming down my face, and I haven't been ashamed to show it beyond initial protests of 'I must have something in my eye.' I realise it's not *me* headlining Glastonbury. But I get swept up in the emotion of the music happening *to me*.\nI certainly *might* cry when England get knocked out by Switzerland on penalties on Saturday. What made it worse for Ronaldo was his extra-time penalty against Slovenia was hardly a private moment. His hoof was played over and over in slow motion to half the world watching on telly. The trigger was his mum in the crowd, also in tears at the fact her son couldn't kick the ball past a goal keeper properly.\n'Even the strongest people have their bad days,' Ronaldo said after the game. 'I was sad at first but now I'm happy.' I'm sure he was when he remembered his 200 million Euro salary. But at least he wasn't afraid to show his emotion.\nThis should be a lesson to all men out there. There's nothing wrong with a good blub, be it to Coldplay playing Fix You, your favourite team getting beaten, or flushing your dead goldfish down the toilet.'",
  "word_count": 2325,
  "scraped_at": "2026-02-14T12:58:01.169144"
}