{
  "article_id": "5b531d7fed7a",
  "url": "https://punchng.com/orban-echegini-set-for-career-changing-moves/",
  "title": "Orban , Echegini set for career - changing moves",
  "date": "20230817T040000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Young Nigerian footballers Gift Orban and Jennifer Echegini are set for the biggest moves of their career yet as the former looks set for a deal with Premier League side Tottenham Hotspur, while Super Falcons 2023 Women’s World Cup star Echegini is close to a move to Italian giants Juventus, PUNCH Sports Extra reports.\nAccording to Turkish journalist, Ekrem Konur, English Premier League club Tottenham Hotspurs have agreed personal terms with Nigerian striker Gift Orban as the club continues their search for a replacement for Harry Kane, who joined Bayern Munich recently.\nOrban, 20, whose contract runs until June 30, 2027 at Belgian side Gent, has attracted interests from several European clubs following his impressive debut season with Gent, where he scored 20 goals in 22 appearances in the 2022/23 season.\nThe Nigerian has also started this season on a bright note already with five goals from four games.\nThe forward scored his first hat-trick of the season in a dominant 5-0 victory over Pogoń Szczecin in the UEFA Europa Conference League third qualifying round last Wednesday.\nThere’s been speculation about a possible transfer fee of €30m (N28bn), emphasising the significant value that Orban brings.\nGoals from Heung-min Son and Richarlison were not enough to earn Spurs a win in their first Premier League game of the season as the London club played a 2-2 draw with Brentford.\nSpurs are desperately in need of a striker and have identified the Nigerian as one of their targets, with Chelsea striker Romelu Lukaku also in consideration.\nHowever, Konur wrote on his Twitter handle that the English club has reached an agreement with the striker.\n“Tottenham Hotspur have agreed to personal terms with Nigerian striker Gift Orban, as the search for the successor to Harry Kane continues,” he tweeted.\nOrban only moved to Gent in January after arriving from Norway’s First Division outfit Stabæk and could be on the move to England if a deal is struck between the two clubs.\nAlso, Falcons star Echegini is set to moveafrom the United States to Europe with a move to Juventus FC Women almost done as the Italian club looks to bolster their squad ahead of the new season.\nEchegini made three appearances for Nigeria at the 2023 Women’s World Cup, featuring as a substitute in games against Canada, Australia and England.\nBut she did just enough to convince Juventus she is ready for European football.\nItalian journalist, Giovanni Albanese, confirmed in a tweet that the deal was close to being concluded as the midfielder had arrived in Turin to finalise negotiations.\n“The work under the track of Braghin leads to Jennifer Echegini, a midfielder born in 2001 for the Nigerian national team, back from an adventure with the Florida State Seminoles. She is in Turin: it is about her transfer to JuventusWomen.”\nJuventus Women are five-time winners of the Italian Serie A. They finished runners-up behind Roma last season and will play in the UEFA Women’s Champions League this term.\nRegarded as a shining prospect within Nigerian football circles, Echegini’s journey to Italy could well be a stepping stone to even greater heights.\nBorn and raised in London, England, Echegini embarked on her college career at the Mississippi State Bulldogs before joining the ranks of the Florida State Seminoles last year.\nIn a testament to her rapid ascent, she earned her maiden call-up to the Nigerian national women’s team mere weeks after joining the Seminoles.\nEchegini scored her first international goal in Nigeria’s resounding 3-0 victory over New Zealand in a friendly match held at the Marden Sports Complex in Alanya, Turkey, on April 11.",
  "word_count": 601,
  "scraped_at": "2026-02-14T12:40:20.992344"
}