{
  "article_id": "5b5bce775d35",
  "url": "https://cartilagefreecaptain.sbnation.com/2024/9/28/24256962/aston-villa-vs-tottenham-hotspur-women-preview-now-the-real-season-begins",
  "title": "Aston Villa vs . Tottenham Hotspur Women preview : now the REAL season begins",
  "date": "20240928T213000Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hello, Spurs fans. I have good news and bad news about Tottenham Hotspur Women’s next WSL league match tomorrow. The good news is that it’s going to be streamed on YouTube, making it much more accessible for people who want to watch.\nAston Villa vs. Tottenham Hotspur Women preview: now the REAL season begins\nSpurs ran riot over Palace last weekend. Villa at Villa Park will be a much greater challenge. Shame it’s on the same time as the men.\nThe bad news is that the match airs at exactly the same time as the men’s team at Manchester United on Sunday.\nThat is, as they say, extremely unfortunate, because unlike Tottenham’s dismantling of newly-promoted Crystal Palace last weekend, Spurs’ trip to Villa Park to play Aston Villa Women could be a heck of a match that most Spurs fans will probably end up watching on replay.\nWhat to Watch For\nTottenham rolled to a 4-0 win over Palace at the weekend and looked dominant in the process, peppering Palace with 26 shots, 16 on target. Spurs only managed to equal that shot tally once the whole of last season. Now, Palace is looking like a side that could end up being historically bad, so it’s important not to get too far over our skiis on this one, but the fact remains that this was a dominant offensive performance, and it bodes well for Spurs’ new-look offense.\nVilla will undoubtedly prove to be a much tougher opponent. In fact, Spurs Women manager Robert Vilahamn has told Jamie Spangher of the Halfway Line that the match promises to be “a bit tricky.” Villa have a new manager in Dutchman Robert De Pauw who spent the past two seasons at Bayer Leverkusen, and have spent a not insignificant amount of funds to upgrade their squad with some quality, if aging, talent.\nVilahamn confirmed that new signing and defender Ella Morris is in line to feature in this match after missing week 1 due to injury. Central defender Luana Bühler could also return to the side, meaning Spurs should have some solid options in defense. Spurs will likely roll with a similar midfield and attack that they had against Palace, with Maite Oroz ahead of Eveliina Summanen and Drew Spance, and a forward line of Jessica Naz, Haley Raso, and either Beth England or Martha Thomas. The trick will be whether that same lineup can be as effective against a much better team.\nOpposition View\nVilla are a well-managed side and while they ultimately fell short in week 1, they gave defending champions Chelsea a heck of a match last weekend. Villa have a potent attack, reinforcing former Lioness Rachel Daly with Liverpool’s young star Missy Bo Kearns, but lost Alisha Lehmann to Juventus in the offseason along with a few key defensive pieces from a team that finished seventh last season behind Spurs. And don’t forget former Arsenal star Jordan Nobbs, Ebony Salmon, and Kenza Dali, all of whom add to Villa’s depth.\nBut they have a talented new manager in De Pauw who’s goal is to transform Villa into an offensive side that wants to push the ball forward and play “beautiful football.” Based on their performance at Chelsea in week 1, they’re already making headway. Sunday’s match will be played at Villa Park in front of what they expect to be a raucous crowd and intimidating atmosphere; Spurs will have a much bigger challenge on their hands than they did against the Eagles.\nAnd don’t just take my word for it, here’s Vilahamn on Aston Villa’s team:\n“Last season, when you looked at the campaign before that, Aston Villa were in fifth and they were one of the teams we thought we could beat and finish in the top half. We did that. This year, they have invested a lot in their coach.\n“They have some really good players. They made a few changes and tactical switches at half-time [against Chelsea], which shows they have depth in every position. They obviously have a coach who can handle flexibility in his tactics. They competed with Chelsea the whole game.”\nWe’re not idiots, we know most of you will be watching the mens’ side at Old Trafford, and I think most people understand that. Hell, we can’t cover both matches, so we’ll focus our attentions on the United game. But you should know that this match is happening, and consider setting the ol’ DVR or watching a replay online as soon as it comes available. If Spurs can pick up a win at Villa Park, it sets them up nicely for even tougher upcoming league games against Liverpool, at United, and at Chelsea next month.\nHow to Watch\nAston Villa Women vs. Tottenham Hotspur Women\nSunday, September 29, 2024\n11:30 a.m. ET / 4:30 p.m. BST\nVilla Park, Birmingham, UK\nTV: not televised (USA/UK)\nStream: YouTube (direct link)",
  "word_count": 816,
  "scraped_at": "2026-02-14T12:22:40.262480"
}