{
  "article_id": "5b5ea8aeb9c7",
  "url": "https://www.flotrack.org/articles/14264967-ncaa-outdoor-track-field-championships-2025-womens-schedule",
  "title": "NCAA Outdoor Track & Field Championships 2025 : Women Schedule",
  "date": "20250605T164500Z",
  "domain": "flotrack.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NCAA Championship Track And Field 2025 Schedule: Women's\nNCAA Championship Track And Field 2025 Schedule: Women's\nWant to watch your favorites athletes at the 2025 NCAA Division I Men’s and Women’s Outdoor Track and Field Championships? Here’s the women’s schedule.\nNot long after the conclusion of the indoor collegiate track and field season in March, many of the sport’s biggest stars were back in action looking to find success outdoors, too.\nThe spring included a lot of hard work and some big meets, and it now is time for the biggest meet of all – the 2025 NCAA Division I Outdoor Track and Field Championships.\nThe top collegiate competitors will make their way back to the familiar Hayward Field on the University of Oregon campus in Eugene, Oregon, to compete for national titles from June 11-14.\nCatch all the action live on ESPN+, and visit FloTrack for breaking news, results, highlights and more. Portions of the competition on June 11-12 also will be broadcast on ESPN, while some events on June 13-14 will air on ESPN2.\n- Subscribe To FloTrack To Watch This Season’s Collegiate And Professional Events\n- NCAA Outdoor Track And Field Championships 2025 Qualifiers: Here’s The Women’s List\n- NCAA Outdoor Track And Field Championships 2025 Qualifiers: Here’s The Men’s List\n- 2025 NCAA Outdoor Track And Field Rankings\nThe student-athletes recently battled their way through a pair of regional competitions to determine the field for the national event at Hayward Field.\nEvery individual event at the NCAA Outdoor Track and Field Championships will feature 24 athletes – 12 from each regional – while each relay welcomes 24 teams – 12 from each regional event.\nThe 2025 NCAA Division I Track and Field West Regional was held in College Station, Texas, and the East Regional took place in Jacksonville, Florida. Both were held May 28-31.\nAs of June 3, seven defending champions are expected to be back at the NCAA Division I Men’s and Women’s Outdoor Track and Field Championships to put their titles on the line.\nFour of the returning champions are women: Alabama’s Doris Lemngole (3,000m steeplechase); Illinois’ Rose Yeboah and Georgia’s Elena Kulichenko (high jump); and Rutgers’ Chloe Timberg (pole vault).\nScroll down for a look at the complete women’s schedule for the season-ending NCAA Outdoor Track and Field Championships:\nNCAA Division I Outdoor Track and Field Championships – Women’s Schedule\nAll Times Eastern\nThursday, June 12\nField Events\n- 4:30 p.m. – Hammer Throw Final\n- 7:35 p.m. – Pole Vault Final\n- 8:15 p.m. – Javelin Final\n- 8:40 p.m. – Long Jump Final\n- 9:10 p.m. – Shot Put Final\nTrack Events\n- 7:05 p.m. – 4x100 Relay Semifinals\n- 7:21 p.m. – 1,500m Semifinals\n- 7:38 p.m. – 3,000m Steeplechase Semifinals\n- 8:08 p.m. – 100m Hurdles Semifinals\n- 8:25 p.m. – 100m Semifinals\n- 8:41 p.m. – 400m Semifinals\n- 8:58 p.m. – 800m Semifinals\n- 9:14 p.m. – 400m Hurdles Semifinals\n- 9:29 p.m. – 200m Semifinals\n- 9:56 p.m. – 10,000m Final\n- 10:36 p.m. – 4x400 Relay Semifinals\nFriday, June 13\nCombined Events\n- 2:45 p.m. – 100m Hurdles (Heptathlon)\n- 3:45 p.m. – High Jump (Heptathlon)\n- 5:45 p.m. – Shot Put (Heptathlon)\n- 9:43 p.m. – 200m (Heptathlon)\nSaturday, June 14\nField Events\n- 3:30 p.m. – Discus Final\n- 8:30 p.m. – High Jump Final\n- 9:10 p.m. – Triple Jump Final\nCombined Events\n- 6:30 p.m. – Long Jump (Heptathlon)\n- 7:45 p.m. – Javelin (Heptathlon)\n- 10:43 p.m. – 800m (Heptathlon)\nTrack Events\n- 8:50 p.m. – National Collegiate Wheelchair 100m Final\n- 9:02 p.m. – 4x100 Relay Final\n- 9:11 p.m. – 1,500m Final\n- 9:24 p.m. – 3,000m Steeplechase Final\n- 9:42 p.m. – 100m Hurdles Final\n- 9:52 p.m. – 100m Final\n- 10:02 p.m. – 400m Final\n- 10:14 p.m. – 800m Final\n- 10:27 p.m. – 400m Hurdles Final\n- 10:37 p.m. – 200m Final\n- 10:55 p.m. – 5,000m Final\n- 11:21 p.m. – 4x400 Relay Final\nHow To Watch The 2025 NCAA Division I Outdoor Track And Field Championships\nThe 2025 NCAA Division I Men’s and Women’s Outdoor Track and Field Championships will take place June 11-14 at Hayward Field on the University of Oregon campus in Eugene, Oregon.\nLive coverage will be provided by ESPN+ starting at 3 p.m. Eastern on June 11; 12:45 p.m. EDT on June 12; 2:45 p.m. on June 13; and 3:30 p.m. on June 14.\nOn June 11, ESPN will broadcast men’s action at 7 p.m. Eastern. On June 12, the women will be on ESPN at 7 p.m. EDT. On June 13, the second day of men’s competition will air on ESPN2 at 8 p.m. EDT. On June 14, the women will take the ESPN2 spotlight at 9 p.m. EDT.\nFor the entire event, FloTrack will be your one-stop shop for breaking news, highlights, results and more, so make sure top pop open that extra tab.\nAbout Hayward Field\nHayward Field, which was built in 1919, is no stranger to top-tier track and field events, including the Diamond League and the U.S. Olympic Team Trials.\nThe venue is named after Bill Hayward, who ran the University of Oregon track and field program from 1904 to 1947. Though it originally was intended for Ducks football, many additions and renovations over the century have helped it become a premier destination.\nIn September 2023, the venue became the first facility outside of Zurich or Brussels to host the two-day season-ending Wanda Diamond League Final, where the year’s 32 overall champions were crowned.\nWhat Schools Won The Team Titles At The 2025 NCAA Division I Men’s And Women’s Outdoor Track And Field Championships?\nThe Arkansas women took home the outdoor team title in 2024, sweeping the indoor and outdoor championships for the 2023-2024 season.\nFlorida, led by legendary head coach Mike Holloway, secured the men’s title in 2024, giving the Gators three consecutive outdoor men’s titles. Florida became the first team to three-peat since Texas A&M (2009-2011).\nWhat Schools Have Won The Most Titles At The NCAA Division I Outdoor Track And Field Championships?\nThe NCAA Division I Men’s Outdoor Track and Field Championships first was held in 1921.\nUSC owns the most men’s titles with 25, while Arkansas is the only other program with 10 or more (10).\nThe NCAA Division I Women’s Outdoor Track and Field Championships first was held in 1982.\nLSU has won the most women’s titles with 14. The next-closest is Texas with five.\nFrom FloTrack On YouTube\nKick Of The Week – Fifth To First In The Final Lap\nFloTrack Is The Streaming Home For Many Track And Field Meets Each Year\nDon’t miss all the track and field season action streaming on FloTrack. Check out the FloTrack schedule for more events.\nFloTrack Archived Footage\nVideo footage from each event will be archived and stored in a video library for FloTrack subscribers to watch for the duration of their subscriptions.\nJoin The Track & Field Conversation On Social\n- Follow us on Twitter @FloTrack\n- Follow us on Instagram @flotrack\n- Follow us on TikTok @flotracktv\n- Watch us on YouTube\n- Like us on Facebook",
  "word_count": 1201,
  "scraped_at": "2026-02-14T12:49:59.226727"
}