{
  "article_id": "5b61aa6d727f",
  "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-women/2024/2/16/24074221/chelsea-fcw-manchester-city-wfc-live-stream-time-tv-channels-how-to-watch-women-super-league-online",
  "title": "Chelsea vs . Manchester City , Women Super League : Preview , team news , how to watch",
  "date": "20240216T091500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Women’s Super League title could practically be decided on this February Friday, as league leaders Chelsea welcome second place Manchester City to Kingsmeadow. Three points separate the sides: Chelsea would move six clear with eight games to go with a victory.\nChelsea FCW vs. Manchester City WFC, Women’s Super League: Preview, team news, how to watch\nEarly title-defining match?\nOf course, on the flipside, a City win would blow the title race wide open and make the final three months a rather nail-biting affair.\nChelsea have not lost a home league game in three years: 32 wins, 1 draw — 33 unbeaten is the WSL record we share with Manchester City ... for hopefully just one more day.\nDate / Time: Friday, February 16, 19.15 GMT; 2:15pm EST; 12:45am IST (next day)\nVenue: Kingsmeadow, Kingston upon Thames, UK\nReferee: Abi Byrne\nForecast: Clear sky and light winds\nOn TV: BBC Two (UK); none (USA); elsewhere\nStreaming: BBC iPlayer (UK); Paramount+ (USA); The FA Player (int’l)\nChelsea team news: The big news is that Lauren James is good to go after being a late scratch against Crystal Palace last weekend due to illness. Millie Bright and Catarian Macario are very close as well, but won’t be available until after the upcoming international break.\nWe have kept a clean sheet in five straight and everybody’s getting in on the goalscoring act, including Mayra Ramírez with her tremendous backheel flick against Palace for her first ever Chelsea goal. Ramírez may not hold the world record anymore for biggest transfer in women’s football (Bay FC paid €735+85k to Madrid CFF to sign Rachael Kundananji earlier this week), but hopefully that’s the first goal of many, many more to come.\n“We are in a good moment. We’re winning, players are getting opportunities to play, we’re playing at Kingsmeadow, a place we love, so it is a fixture we look forward to.\n“When we play top WSL teams, you go toe to toe so it’s a much different game from recent ones playing a team with 11 bodies behind the ball, so you have to be prepared for that. Training this week has been focused on how we get into good situations and most importantly, how we execute.”\n-Emma Hayes; source: Chelsea FC\nManchester City team news: Gareth Taylor’s side are in almost as good of a form as Chelsea, with ten straight wins in all competitions, including the last four by clean sheet, the latest of which was a 1-0 away victory over Arsenal in the FA Cup last weekend. City in fact have the meanest defense in the division, having conceded just 8 goals in the 13 matches played (Chelsea are second best with 12). Meanwhile, Bunny Shaw paces their attack with 13 goals in 12 appearances.\nThe one big absence for City will be Jill Roord. The midfielder tore her ACL a few weeks ago, and, like Sam Kerr, now faces a lengthy recovery on the sidelines.\nPreviously: Chelsea needed a last-gasp equalizer against a City down to just 9 players in the reverse fixture at the start of the season. Both teams have gotten markedly better since. Overall, City have not won a league game at Kingsmeadow since 2016, though they do have a couple wins in the League Cup (2018, 2019) since that time.",
  "word_count": 554,
  "scraped_at": "2026-02-14T12:22:26.945369"
}