{
  "article_id": "5b70380124d9",
  "url": "https://www.dailyecho.co.uk/news/23235394.southampton-central-travelodge-rolex-watch-among-items-left-behind/",
  "title": "Southampton Central Travelodge : Rolex watch among items left behind",
  "date": "20230108T053000Z",
  "domain": "dailyecho.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A ROLEX watch worth thousands of pounds is among the items left behind at a budget hotel in Southampton in 2022.\nThe luxury, gold and diamond watch was found at Southampton Central Travelodge.\nOther expensive or quirky items recovered by staff last year include tickets for a round the world Cunard cruise and a prenuptial agreement.\nREAD MORE: Southampton Travelodge refurbished with new 'budget-luxe' design\nEach year, millions of people stay at the 582 Travelodge hotels across the UK, leaving behind hundreds, if not thousands, of objects.\nStaff keep track of the most bizarre ones and a list is compiled at the end of every year.\nThe 2022 lost and found inventory report mentions an oil painting of Queen Elizabeth II, a replica of the late Queen's state imperial crown and a Liverpool Football Club themed wedding cake.\nTravelodge spokeswoman, Shakila Ahmed, said: “With nearly 19 million customers annually staying at our 580 UK Travelodge hotels, including our hotels in Southampton, for thousands of different reasons, we do get a range of interesting items left behind. During 2022 this included a prenuptial agreement, a gold and diamond Rolex watch and a set of Air Pilot’s flight manuals.\n“Interestingly the 2022 lost and found audit also revealed that we are a nation striving for a healthy lifestyle as we have seen a significant rise in smart watches being left behind in our Travelodge hotels during the last 12 months.\n“When it comes to why so many of our customers forget their treasured items, it’s basically due to us all being time poor, juggling multiple tasks and being in a hurry to get from A to B. In the rush, valuable possessions are easily forgotten.”\nBelow are the most interesting findings from Travelodge hotels across Southampton.\nSouthampton Central Travelodge\n- Gold and diamond Rolex\n- Tickets for a round the world Cunard cruise\n- A prenuptial agreement\nSouthampton Travelodge\n- A large illustrated medical dictionary containing hand written notes\n- A foldable e-scooter\n- A set of Air Pilot’s flight manuals\nEastleigh Travelodge\n- A vintage Singer sewing machine\n- A box of UEFA Women's Euro 2022 flags\n- A signed LA Lakers basketball shirt\n- A Will with deeds to a coastal estate\nA message from the Editor\nThank you for reading this article - we appreciate your support in reading the Daily Echo.\nSubscribing to the Echo means you have unrestricted access to the latest news, features and Saints coverage - all with an advertising-light website.\nYou will also have full access to Saintsplus, your new home for Southampton FC tactical analysis, features and much, much more.\nDon't just take my word for it - subscribe today.\nFollow the latest breaking news in the Southampton area by searching Southampton News - Breaking News and Incidents on Facebook\nFollow the latest court and crime news on our dedicated group by searching Hampshire Court and Crime News on Facebook",
  "word_count": 487,
  "scraped_at": "2026-02-14T13:43:54.728644"
}