{
  "article_id": "5b95684e069b",
  "url": "https://www.birminghammail.co.uk/news/showbiz-tv/itv-loose-women-fans-baffled-29342732",
  "title": "ITV Loose Women fans baffled as Robbie Williams is  unrecognisable  ",
  "date": "20240612T170000Z",
  "domain": "birminghammail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ITV Loose Women fans baffled as Robbie Williams is 'unrecognisable'\nRobbie Williams appeared on the Loose Women panel to discuss his career and upcoming tour, but fans were left baffled by his drastically different appearance\nRobbie Williams turned heads on the Loose Women panel with his strikingly different appearance, leaving ITV viewers scratching their heads. The singer donned a tie-dyed green shirt, navy baseball cap, and chunky black glasses, showcasing a deeper tan than usual.\nDuring Wednesday's episode, Robbie, originally from Burslem and Tunstall, confessed he'd had a spray tan and hadn't had the chance to wash it off yet. Twitter was abuzz with comments on Robbie's new look, with one user posting: \"Is Robbie Williams ok? Had to take a double look didn't even recognise him @loosewomen #loosewomen.\"\nAnother chimed in with a quip about his tanned hands: \"@loosewomen @robbiewilliams fake tan hands #loosewomen #robbiewilliams.\"\nRead more\nA third remarked on his casual attire: \"Shows what he thinks of this programme...he couldn't be a**ed to change out of his pyjamas.\", reports Stoke on Trent Live.\nYet another fan humorously noted Robbie's resemblance to a certain Wayne's World character: \"How did Robbie Williams seamlessly turn into Garth from Wayne's World, minus the hair? #LooseWomen.\"\nFollowing his recent stint at Soccer Aid on Sunday night, Robbie's quirky Loose Women appearance comes hot on the heels of his involvement in the charity football match at Stamford Bridge stadium in Chelsea, an event he helped kick-start in 2006. Wearing a well-tailored blue suit, he accentuated his look with a grey-haired Mohawk.\nNevertheless, a few watchers conceded to not identifying him initially owing to his contemporary haircut.\nOne viewer posted on Twitter: \"Do you know I've only just turned it on and I didn't recognise Robbie Williams at first with his new haircut lol.\" Another one chimed in saying: \"Robbie Williams looks so different these days. I wouldn't have recognised him if it wasn't Soccer Aid.\"",
  "word_count": 322,
  "scraped_at": "2026-02-14T12:57:28.228435"
}