{
  "article_id": "5ba93ecf1cb7",
  "url": "https://mwnation.com/chawinga-sisters-for-caf-awards/",
  "title": "Chawinga sisters for CAF awards - Nation Online",
  "date": "20241122T083000Z",
  "domain": "mwnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chawinga sisters for CAF awards\nTabitha Chawinga and her sister Temwa, alongside the Scorchers have for the second consecutive year been nominated for Confederation of African Football (CAF) 2024 Awards set for December 16 in Marrakesh, Morocco.\nTabitha, who plays for Olympique Lyonnais of France and Temwa, who turns up for Kansas City Current of USA, will battle it against eight other nominees, including Chiamaka Nnadozie and Rasheedat Ajibade of Nigeria, South Africans Jermaine Seoposenwe and Thembi Kgatlana as well as Zambians Barbara Banda and Rachael Kundananji.\nScorchers, on the other hand, face Morocco, Nigeria, South Africa and Zambia among others, in the Team of the Year category.\nTemwa is hogging the limelight in USA’s Women’s National Football Super League where she has won the golden boot in her debut season with 20 goals.\nOn the other hand, Tabitha won the 2024 French Professional Football Players Union Women’s Player of the Season accolade, 2024 French Arkema First Division Player of the Season and the golden boot with 19 goals.\nFootball Association of Malawi (FAM) president Fleetwood Haiya said the nominations are a sign that the association’s ‘transformation agenda’ is taking shape.\nHe said: “Our transformation agenda is gaining momentum, and together, we will achieve even greater milestones.”\nBoth Temwa and Tabitha, in separate interviews, said they were excited to make the list for the second consecutive time.\nHowever, the sisters face stiff competititon nominations who helped their national teams qualify for Women’s Afcon, Olympic Games, and Women’s World Cup.\nTabitha and Temwa did not play for the Scorchers this year, having missed the Cosafa Women’s Championship.\nRenowned Fifa assistant referee Bernadettar Kwimbira Nzika said the Scorchers need to participate in continental competitions to raise their profile.\nShe said: “It’s sad that this team has not been taking part in continental competitions. The calibre of players that we have in Scorchers, if FAM had considered them for Women’s Afcon we could have even qualified for Fifa Women’s World Cup.”\nFootball fan Glyn Msutu said it is time to give the Scorchers maximum support.\nHe said: We have tried the Flames for a long time. This time let’s give the scorchers 100 percent support.\nAnother Scorchers supporter Maya Nzunga Kapalamula said without participating at such high profile competitions, it will be tough to upstage players from Nigeria, South Africa, Morocco and Zambia.\n“Lack of national team activities and success will always hinder these girls from winning individual awards,” he said.\nThis year, Tabitha was also nominated for the Ballon d’Or to become the first Malawian to achieve the feat, but she lost to Barcelona’s Aitana Bonmatí.",
  "word_count": 434,
  "scraped_at": "2026-02-14T12:52:52.994746"
}