{
  "article_id": "5bc703c86a51",
  "url": "https://www.ok.co.uk/celebrity-news/jeremy-vine-breaks-silence-after-33059418",
  "title": "Jeremy Vine breaks silence after Joey Barton ordered to pay him £75k in libel case",
  "date": "20240618T223000Z",
  "domain": "ok.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jeremy Vine breaks silence after Joey Barton ordered to pay him £75k in libel case\nJoey Barton called Jeremy Vine a 'big bike nonce' and a 'pedo defender' on social media after the veteran broadcaster questioned whether the footballer had a brain injury\nJeremy Vine has responded after Joey Barton was instructed to pay him £75,000 for labelling him a 'bike nonce' on social media.\nThe seasoned broadcaster took legal action against the ex-football manager Joey for defamation and harassment following online posts where Barton also tagged Jeremy as a 'big bike nonce' and a 'pedo defender'. Gervase de Wilde, Jeremy's lawyer, informed the London hearing that the abuse commenced post Barton's remarks about women, especially those in the media and football industry, from the end of 2023.\nIn one social media update, Joey likened female commentators Eni Aluko and Lucy Ward to notorious murderers Fred and Rose West. Reacting to this, Vine questioned if the former footballer had suffered a brain injury.\nBarton then initiated a \"calculated and sustained attack on Vine\" in January this year, according to Vine's lawyer, sharing several posts to his 2.8 million followers and started using \"#bikenonce\" on X, previously known as Twitter, causing it to trend on the platform.\nTo settle the case, Joey, 41, who has been unemployed since being dismissed by Bristol Rovers last October, conceded that his allegations were \"untrue\" and agreed to compensate Vine with £75,0000 for damages and legal expenses. He also issued a remorseful apology on social media.\nAfter the court session, Jeremy clarified that Joey's apology and vow to cover damages and legal costs is \"is not the final outcome of this case\", detailing the build-up to their legal clash. He recounted: \"After five defamatory tweets, my lawyer offered Barton a chance to settle: pay £75k, plus my costs, and make an apology. He ignored that offer and posted more disgusting tweets about me, even publishing my home address to his followers.\"\nContinuing on how the battle unfolded, the TV presenter said, \"When I then took my case to the High Court, a judge ruled that TEN of the tweets I complained of were defamatory. Having lost, Barton has returned to the offer we made after tweet five. There has therefore been a parallel action on tweets 6-10 and Barton will pay further damages on these.\"\nHe went on to reveal, \"A number of other steps including statements made in Court by way of apology are still to be taken, and Barton has agreed to pay my legal costs of all the claims. Jeremy Vine.\"\nJoey's statement from earlier today read: \"Between 8 and 12 January 2024 I published 11 posts which accused Jeremy Vine of having a sexual interest in children, and created a hashtag which made the same allegations, which were viewed millions of times. I recognise that this is a very serious allegation. It is untrue. I do not believe that Mr Vine has a sexual interest in children, and I wish to set the record straight. I also published posts during the same period in which I referred to Mr Vine having advocated forced vaccination during the Covid 19 pandemic, based upon a video clip of his TV programme.\"\n\"I accept that he did not advocate this policy and that the video clip has been edited to give a misleading impression of what he was in fact saying. I then taunted and abused Mr Vine for bringing a legal complaint against me. I have agreed not to make the same allegations again about Mr Vine and I apologise to him for the distress he has suffered. To resolve his claims against me in defamation and harassment, I have agreed to pay Mr Vine £75,000 in damages and his legal costs.\"",
  "word_count": 628,
  "scraped_at": "2026-02-14T13:30:24.668862"
}