{
  "article_id": "5be021bf76cc",
  "url": "https://www.pilotonline.com/2025/05/19/the-late-danny-mitchell-is-headed-to-hampton-high-athletics-hall-of-fame/",
  "title": "The late Danny Mitchell is headed to Hampton High athletics hall of fame",
  "date": "20250520T044500Z",
  "domain": "pilotonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "HIGH SCHOOLS\nDanny Mitchell to be put in Hampton hall of fame\nHampton High will honor the late former baseball head coach/football assistant coach Danny Mitchell at Tuesday’s 4:30 p.m. home game against Bethel by announcing that he will join legendary head football coach Mike Smith in the Crabbers’ new athletic hall of fame.\nMitchell’s son Matt is coaching the Peninsula District baseball champion Crabbers (17-0).\nCOLLEGE MEN’S BASKETBALL\nNSU signs former Wagner starter\nNorfolk State signed former Wagner and L.C. Bird High forward Keyontae Lewis. He started all 33 games for Wagner in 2023-24, when the Seahawks won the Northeast Conference Tournament and beat Howard in the NCAA First Four. He had 13 points and four rebounds in a first-round loss to No. 1 seed North Carolina.\nNSU coach Robert Jones participated in the National Association of Basketball Coaches Championship Basketball Clinic over the weekend in Las Vegas, putting together a lesson on creative ways to guard the pick and roll.\nLOCAL SOCCER\nLionsbridge romps in home opener\nLionsbridge FC gained its first victory of the season Sunday night in its home opener, 4-0 over Virginia Marauders FC of Winchester, before a big crowd at Christopher Newport’s TowneBank Stadium.\nFelix Ewald started the scoring in the sixth minute, heading in a pass from Damean Dominguez.\nRicky Louis scored off a Constantinos Christou assist in the 67th minute. Denis Krioutchenkov made it 3-0 in the 75th minute from a pass by Andrew Bennett, and Tre Barrett converted a pass from Christian Hatley in the 86th.\nLionsbridge (1-0-1) shares first place in USL League Two’s Chesapeake Division, which the Lions have won the past three seasons. They’ll face Patuxent in Maryland on Wednesday before returning home to face Greenville United of North Carolina on Sunday at TowneBank Stadium.\nMAJOR LEAGUE BASEBALL\nDodgers release Cox alum Taylor\nChris Taylor, a former Cox High and Virginia Cavaliers star, was released Sunday by the defending World Series champion Los Angeles Dodgers to clear a roster spot for utilityman Tommy Edman.\nTaylor, who played all three outfield spots and second base this season, is owed $13,435,484 from a $60 million, four-year contract to which he agreed before the 2022 season. Taylor, who turns 35 in August, was the longest-tenured position player on the roster.\nCOLLEGE BASEBALL\nSix Cavaliers, one Hokie gain ACC awards\nSix Virginia Cavaliers received All-Atlantic Coast Conference honors on the eve of the league tournament. Second baseman Henry Godbout and outfielder Henry Ford made the second team, catcher Jacob Ference, shortstop Eric Becker and outfielder Aidan Teel made the third team, and pitcher Tomas Valincius made the All-Freshman squad.\nVirginia Tech outfielder Sam Tackett was on the second team.\nCOLLEGE WOMEN’S GOLF\nUVA gains final NCAA match-play berth\nVirginia secured the final match-play spot at the NCAA championships with a 72-hole score of 15-over-par 1,167, advancing for the first time since 2016. Megan Propeck led the Cavaliers with a fifth-place finish to mark the second-best individual performance at the NCAAs in program history on Monday at the Omni LaCosta Resort in Carlsbad, California.\nThe Cavaliers will face top-ranked Stanford in Tuesday’s quarterfinal round of match play, starting at 9:50 a.m. Eastern time. The Cardinal won the tournament at 27-under 1,125.\nKennedy Swedick, Propeck, Jaclyn LaHa, Amanda Sambach and Rebecca Skoler each will play one-on-one matches against Stanford players.\nThe winner of that match will advance to the semifinals Tuesday afternoon against the victor between fourth-seeded Florida State vs. fifth-seeded Southern California. The final is scheduled for Wednesday.\nThe other half of the bracket will pit No. 2 Oregon against No. 7 Texas and No. 3 Arkansas against No. 6 Northwestern.\nPropeck matched her best round of the tournament by posting a bogey-free 69. She finished the tournament tied for fifth at 6-under 282. The only Cavalier to record a better finish at the NCAAs is Leah Wagner, the runner-up in 2005.\nArkansas’ Maria José Marin won the medal at 12 under, by two strokes over Mirabel Ting of Florida State.\nCOLLEGE MEN’S TENNIS\nODU adds two players\nThree-time reigning Sun Belt champion Old Dominion added Piet Steveker and Zech Hamrouni to the 2025-26 squad.\nA transfer from Louisville with two years of eligibility, Steveker went 9-9 this season for the Cardinals playing at the No. 5 and No. 6 singles spots. He’s from Germany.\nHamrouni is a freshman from Bristol, England, and has been as high as No. 178 in the world junior rankings.",
  "word_count": 742,
  "scraped_at": "2026-02-14T13:20:36.052793"
}