{
  "article_id": "5bf9afd222f6",
  "url": "https://www.the42.ie/ireland-wnt-watch-wales-euro-2025-play-off-injuries-returns-concerns-6539055-Nov2024/",
  "title": "Injury returns but fresh concerns : How is the Ireland squad shaping up for Euro 2025 play - off ? ",
  "date": "20241111T164500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "gdelt",
  "body_text": "EILEEN GLEESON WATCHED on as Ruesha Littlejohn made her first appearance of the season yesterday.\nThe 83-cap midfielder was introduced as a second-half substitute in London City Lionesses’ 2-1 defeat to Birmingham City in their top of the Championship clash.\nGleeson gave Littlejohn a warm embrace afterwards at Hayes Lane, and will be pleased with her availability for Ireland’s Euro 2025 play-off against Wales.\nBut the Irish head coach has some fresh injury concerns ahead of the decisive double-header on 29 November and 3 December.\nHere, we run through the weekend’s action and look at the shape the squad is in. For convenience, players are listed as they were for the first play-off against Georgia, and generally, only those in the frame currently are included.\nGoalkeepers\nIreland and Everton’s number one Courtney Brosnan marked her 29th birthday with a 1-1 draw against Crystal Palace yesterday. She will have been disappointed to concede in the opening minute, but was comfortable thereafter and produced a big save late on.\nGrace Moloney was on the bench for London City Lionesses, while Sophie Whitehouse’s Charlton Athletic didn’t have a game. Megan Walsh was also second choice for West Ham United’s 1-0 win over Leicester City.\nDefenders\nCaitlin Hayes has been absent from the Celtic squad for their last two games, which will be a concern for Gleeson. Cynic Women reported that Hayes was rested midweek amidst a hectic schedule, but she was expected to return for yesterday’s cup quarter-final showdown against Glasgow City. Her absence wasn’t addressed afterwards. The Hoops face Chelsea in the Champions League on Wednesday.\nLouise Quinn (hip) and Diane Caldwell (back) remain sidelined after missing the Georgia games, but Megan Campbell is available again having been named in her first London City Lionesses matchday squad of the season. The long-throw specialist was unused but her involvement is positive following an ankle setback. Chloe Mustaki has also made back-to-back starts for Bristol City, featuring in yesterday’s 2-0 win over Newcastle as she steps up her comeback.\nAnna Patten was named Player of the Match after another consistent performance for Aston Villa in their 0-0 draw with Manchester United, while Aoife Mannion came off the United bench.\nLiverpool captain Niamh Fahey was an unused substitute in their 3-0 defeat to Chelsea, while Jessie Stapleton was suspended for Sunderland’s win over Blackburn Rovers.\nMidfielders\nLittlejohn’s return was the standout story after another run of persistent Achilles issues, while her availability for Wales is a boost. So too is Megan Connolly’s: she is back in action with Lazio after a hamstring setback ruled her out of the last international window. The versatile Corkwoman has now made three consecutive starts in the back three, but missed a penalty in yesterday’s 1-0 defeat to Inter Milan.\nOn the contrary, Ellen Molloy went off injured in Sheffield United’s 1-1 draw with Portsmouth.”Molloy can’t continue but is able to walk off after appearing to tweak something playing the ball out,” as per an in-game tweet from the club. Molloy just recently made her international comeback.\nKatie McCabe produced another impressive performance for Arsenal on Friday night, providing two assists in their 5-0 win over Brighton at the Emirates Stadium. Denise O’Sullivan produced a typical all-action display for North Carolina Courage, but they exited the NWSL playoffs after a 1-0 defeat to Kansas City Current.\nTyler Toland bagged an assist as she captained Blackburn yesterday, Lily Agg and Heather Payne played full games for Birmingham and Everton respectively, and Izzy Atkinson was an unused sub for Crystal Palace.\nForwards\nLeanne Kiernan has been bright in her first two starts of the season for Liverpool. She was a creative spark, assisting in a 2-1 win over Aston Villa last Sunday but yesterday’s loss to Chelsea was a trickier one.\nAbbie Larkin came on after an hour in Palace’s 1-1 draw with Everton, while Marissa Sheva was an unused substitute as her Portland Thorns side bowed out of the NWSL playoffs to Gotham FC.\nIn Belgium, Amber Barrett started Standard Liége’s 1-0 weekend win over Westerio.\nOut of season\nKyra Carusa’s San Diego Wave didn’t make the NWSL playoffs, but she rediscovered her goalscoring form against Georgia after an injury layoff.\nJulie-Ann Russell was on the scoresheet too, while she is also in off-season after a hectic Women’s Premier Division campaign. She told The 42 she would stay sharp by training with boys at her local club, Salthill Devon, while continuing CrossFit sessions and running.\nAthlone Town goalkeeper Katie Keane and Cork City captain Eva Mangan were the other home-based players in Gleeson’s squad for Georgia.\nRecent absentees\nJess Ziu and Jamie Finn are on the long-term absentee list with ACL injuries, while Hayley Nolan remains sidelined after shoulder surgery.\nIn Scotland, in-form duo Saoirse Noonan and Emily Whelan continue to chase recalls. They featured on opposite sides in Celtic’s cup win over Glasgow City yesterday. Noonan had departed by the penalty shootout, while Whelan didn’t take a spot kick. Claire Walsh also played the opening half for Glasgow.\nAnother recently omitted player, Lucy Quinn, was absent for Birmingham yesterday after her impressive start to the season. Emily Murphy, who was unavailable for the last camp, has been in action for Wake Forest University, while Erin McLaughlin played 89 minutes for Portsmouth yesterday.\nPromising U17 international Eve O’Carroll was on the Manchester City bench again for their 4-0 win over Tottenham Hotspur on Friday night, but her wait for a WSL debut continues.\nSame applies for Tara O’Hanlon. The 19-year-old hasn’t been involved in City’s matchday squads, but she was in and around the Ireland camp against Georgia as she prepares to return from two significant hamstring injuries.",
  "word_count": 947,
  "scraped_at": "2026-02-14T10:47:55.224794",
  "_text_extracted": true
}