{
  "article_id": "5c12a5973779",
  "url": "https://www.adomonline.com/man-city-announce-premier-league-record-revenue-of-715m/",
  "title": "Man City announce Premier League record revenue of £715m",
  "date": "20241213T093000Z",
  "domain": "adomonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester City have announced a Premier League record revenue of £715m in their latest accounts, to 30 June 2024.\nEven though they could not repeat their historic Treble triumph of 2023, City’s unprecedented fourth consecutive English title success and victories in the Club World Cup and European Super Cup meant revenues still rose by £2.2m from £712.8m, which had been the previous best.\nWages dropped £10.3m to £412.6m as City recorded an overall pre-tax profit of £73.8m. Commercial revenue increased slightly from £341.4m to £344.7m.\nCity have now recorded a profit every season since 2014-15, with the exception of the Covid-impacted 2019-20 campaign.\nIn addition, they have confirmed an overall profit of £92.8m in transfer business done since the end of June, which included the sales of Argentina forward Julian Alvarez, defender Joao Cancelo and striker Liam Delap.\nThis means they are well placed to bolster manager Pep Guardiola’s squad during next month’s transfer window, if, as expected, it is decided reinforcements are required following their 10-game run with only one win.\n“Our constant ambition to target and achieve the unprecedented is a mark of the organisation that we have be come,” noted City chairman Khaldoon al-Mubarak in his assessment, which was written before the club’s worst run under Guardiola.\n“On and off the field, our passion for the next challenge is underpinned by deliberate and detailed planning and a shared belief in the collaborative learning culture that we have built.\n“This organisational approach is now part of our DNA. It is a product of the unwavering focus on constant improvement, in every aspect of the organisation, that has been in place since His Highness Sheikh Mansour became the club’s custodian in 2008.”\nThat belief is being tested like never before.\nThe Champions League defeat by Juventus on Wednesday has left City at very real risk of missing out on a play-off place. Winning the tournament in 2023 earned City £111.8m from that competition alone.\nThey go into Sunday’s Manchester derby with United at Etihad Stadium fourth in the Premier League, eight points behind leaders Liverpool, who also have a game in hand.\n“Winning the Treble in the previous season did not generate any sense of complacency in our teams on or off the pitch,” said chief executive Ferran Soriano.\n“We understand very well that the relentless pursuit of beautiful football, operational excellence, and constant innovation requires hard work and resilience.”\nThe accounts make no reference to City’s recent battle with the Premier League over the Associated Party Transaction (APT) rules, and only a fleeting reference to City’s ongoing case with the Premier League over 115 alleged breaches of financial rules.\nOn that, the financial statement reads: “On 6 February 2023, in accordance with Premier League Rule W.82.1, the Premier League referred a number of alleged breaches of the Premier League Rules by Manchester City to a commission under Premier League Rule W.3.4. In February 2023, in response to the charges, the club issued a public statement that it welcomes the review of this matter by an independent commission, to impartially consider the comprehensive body of irrefutable evidence that exists in support of its position.”\n‘Amounts owed by group undertakings’ has risen from £151.4m in 2023 to £267.4m in the latest accounts, which BBC Sport has asked the club about. ‘Other external charges’ have also risen from £124m in 2022 to £172.4m.\nThe club are in the middle of a £300m expansion of the North Stand that will raise Etihad Stadium’s capacity to 60,000 in time for Euro 2028. Khaldoon also confirmed a new women’s training facility will be opened during the 2025-26 season.",
  "word_count": 604,
  "scraped_at": "2026-02-14T12:48:56.945567"
}