{
  "article_id": "5c15b308566c",
  "url": "https://www.bandt.com.au/bt-awards-2024-the-work-the-bt-award-for-diversity/",
  "title": "B & T Awards 2024 The Work : The B & T Award For Diversity",
  "date": "20240925T041500Z",
  "domain": "bandt.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The B&T Awards are just weeks away from taking over the Hordern Pavilion in Sydney. This year’s lineup of Finalists show that they are the agencies truly at the top of the game.\nIn the previous edition of B&T Awards The Work, we looked at the Best Digital Campaign Finalists. This time, we’re looking at the B&T Award for Diversity Finalists.\nBut to find out who wins, you’ll need to grab your tickets for the B&T Awards now!\nHere, in their own words — and in alphabetical order only — are the finalists.\nAkcelo, “Big Tinder Wedding”, Tinder\nIn 2023, Tinder Australia celebrated the fifth anniversary of the Marriage Equality Act in Australia by launching “The Big Tinder Wedding” campaign. Tinder aimed to highlight & celebrate the many queer love stories that begin on the app each year, by offering to plan & pay for the weddings of selected LGBTQIA+ couples, who were ready to walk down the aisle.\nThe Big Tinder Wedding campaign spanned two distinct phases. At Mardi Gras 2023, Tinder initiated a nationwide search for LGBTQIA+ couples who met on Tinder & were ready to marry. Over 400 LGBTQIA+ couples initiated the application process, & two were chosen. The selected couples then featured in a YouTube reality series hosted by Brooke Blurton, documenting their journey from the wedding planning to the big day. The series was hosted on Tinder Australia’s YouTube channel, airing in time for Mardi Gras in February 2024.\nThe content series, which included nine episodes on YouTube and additional highlights on TikTok and Meta, showcased genuine moments from the weddings, driving significant engagement. It not only celebrated LGBTQIA+ love, but also proved successful for Tinder’s brand, contributing to an uplift in new users and notable lifts in key brand metrics during the Q1 ’24 phase 2 key campaign period.\nEleven, “The Wheelchair Ballkid”, Mastercard\nBeing a ballkid at a Grand Slam is a life-changing opportunity for tennis-mad kids. But those in wheelchairs have always been overlooked because society didn’t believe they could do it. While there were no specific rules disallowing people in wheelchairs from taking part, an underlying social bias prevented them from doing so.\nMastercard has been the official payments partner of the Australian Open for 8 years. Outside of this partnership, Mastercard needed to build on their established commitment to inclusion by design beyond just payments alone. We developed new assistive technology to bring the first wheelchair ballkid to the court during the first Grand Slam of the year, in Australia. Because a world where we all belong is Priceless.\nBut to find out who wins, you’ll need to grab your tickets for the B&T Awards now!\nWe brought together a network of passionate experts to make the first wheelchair ballkid possible – technology partners, ballkid coach and assessor Diana Sutterby, Paralympic wheelchair tennis gold-medalist Heath Davidson, previous world #4 tennis champion Alicia Molik, accessibility consultants and, most importantly, 11-year-old junior wheelchair tennis champion Sonny Rennison. We developed first-of-its-kind assistive technology that allows wheelchair users to seamlessly pick up and store tennis balls with the same speed, agility and accuracy as every other ballkid. The first wheelchair ballkid reached over 400 million people.\nEvery national television station covered the story with over 4.6 hours of broadcast, and it was front-page news in Australia’s two leading newspapers.\nMastercard has open-sourced the technology for all, available through inexpensive 3D printing, taking the impact from an event in Melbourne to the entire world. The pilot program was a groundbreaking success, showing what is possible. As a result of the campaign, wheelchair ballkids will take part in tournament matches in 2025.\nHowatson+Company, “I’m Dying Inside”, Modibodi\nLife’s a lot for young people. Heartbreak. Anxiety. Moving out. Coming out. Sex. #hustleculture. The f***ing climate crisis. Men. Then you get your period.\nTo show Gen Z how Modibodi, Australia’s leading period underwear brand, gives you the leak-proof support to navigate it all, we didn’t create an ad – we created a new series built for their favourite platform.\n‘I’m Dying Inside’ is a modern period drama created exclusively for TikTok. Five episodes, four housemates, all getting their periods at the same time. A taboo-breaking celebration of life today for young menstruators, exploring issues like baby-gay hook-ups, endometriosis flare-ups, accidental period sex stains and more.\nBut to find out who wins, you’ll need to grab your tickets for the B&T Awards now!\nCreated with the production value of TV, crafted for 9 by 16. Featuring a cast, crew and writer’s room made up of female and non-binary Gen Z talent, original screenplays dripping with cultural nuance and original music for each episode.\nBut we couldn’t just put the episodes on Modibodi’s TikTok channel and expect people to watch it. To make the algorithm work for us and drive views, we collaborated with TikTok to create an entire ecosystem of BTS content that tapped into platform trends and topics of interest.\nThis fresh approach to delivering content achieved huge results, helping an entire generation of young menstruators fall in love with the Modibodi brand. Slay.\nHowatson+Company, “TOUCH”, Mastercard\nOver 500 million people visit the cinema every year. Yet for those who are blind or have low vision, the experience is an afterthought. They rely on audio descriptions, screenreaders or a companion to explain what’s on the screen.\nTo launch Mastercard’s Touch Card – a bank card designed for the blind and low-vision community – we flipped the script and created an inclusive cinema experience that was truly priceless.\n‘TOUCH’ is a feature-length motion picture without pictures. Brought to life solely through Dolby sound, without images or audio descriptions. Made so all audiences can enjoy the magic of cinema together, no matter their level of vision.\nBut to find out who wins, you’ll need to grab your tickets for the B&T Awards now!\nIt follows an original story of a neuroscientist trapped inside his father’s mind, along with his ex-girlfriend and an unsuspecting delivery driver. To escape, they must journey through crumbling memories and forgotten worlds.\nThis new kind of film was developed in collaboration with consultants, composers, writers and actors from blind and low-vision communities all over the world – alongside award-winning filmmakers.\nTOUCH premiered at iconic theatres across Australia, where both sighted and non-sighted people were invited to experience the film together. After one premiere, the project garnered $10 million in earned media coverage and reached 74+ million people.\nBut this is just the start. The production learnings from TOUCH have been turned into a lesson module and taught in leading film schools, giving future filmmakers a blueprint to make more inclusive productions.\nOgilvy, “Til it’s Done”, Football Australia\nAustralia’s women’s football team, the Matildas, had been overlooked and underappreciated for years. Fans, the media and local sponsors weren’t interested in them – or in women’s sport.\nBut the Matildas never gave up on their desire to change perceptions of women’s sport, leave a legacy and succeed on the pitch.\nIn 2023, Australia hosted the first FIFA Women’s World Cup in the Southern Hemisphere. Football Australia and Ogilvy created a rallying cry for the Matildas, galvanising the nation behind the team and women’s sport.\nDrawn from the middle of the team’s name, ‘Til It’s Done captured the relentless drive at the heart of the Matildas’ story – in three simple words. It was a mantra for the team and their fans as the FIFA Women’s World Cup unfolded. And they rallied behind it.\nBut to find out who wins, you’ll need to grab your tickets for the B&T Awards now!\nTil It’s Done helped turn the FIFA Women’s World Cup from a sporting event that no-one watched into the biggest TV broadcast ever in Australia.\nThe Matildas advanced to the semi-finals, their most successful FWWC campaign ever. And when they lost that match, we knew their story wasn’t done.\nUnder 24 hours later, we went live with an iconic outdoor ad. A to-do list with the team’s audacious achievements crossed off. Uncrossed from the list? Everything still to be done.\n’Til we’re recognised by FIFA.\n’Til we’re not wearing men’s hand me downs.\n‘Til we make the country proud.\n‘Til all women are paid the same.\nThe poster, the ‘Til It’s Done language and campaign elements like the online video captured the Matildas’ inspirational story and provoked a long-overdue conversation about women’s sport. Days after our poster ran, the Albanese government committed to $200 million in funding for women’s sport. An incredible achievement for a once-overlooked team. A team that’s never done – ’til it’s done.\nOMD Diverse, “McDonald’s Australia: Year of the Dragon, From ‘Golden Arches’ to ‘Cultural Bridges’”, McDonald’s\nAustralia is home to a significant Asian population (17.4%), who are 32% more likely to dine at McDonald’s. Despite the significance of ‘Lunar New Year (LNY)’ within the community, 66% of Australians have never celebrated. This presented an opportunity for us to honour the rich cultural contributions Asian communities bring to Australia.\nTo forge genuine connections, McDonald’s commissioned research and uncovered something ‘golden’: Macca’s is a cherished space that provides a familiar comfort, quietly weaving into countless Asian-Australian family stories and linking generations. This makes the home of Macca’s a catalyst for cultural connection and storytelling, the perfect place to celebrate rich Asian culture.\nThis LNY, we invited all Australians to join the celebration, by decorating our ‘homes’ in vibrant LNY red. A ritual symbolising good luck and rich Asian cultural heritage. We transformed the window of our Darling Square restaurant into ‘Sydney’s largest billboard’ at the heart of Chinatown, serving as a beacon of cultural pride.\nBut to find out who wins, you’ll need to grab your tickets for the B&T Awards now!\nEnlisting Chinese-Australian artist Chris Yee, we documented his journey in creating a red-themed artwork that celebrates how LNY connects family culture with Australian life, displayed in six languages.\nThe unveiling of the artwork invited customers and influencers to snap and share photos, spreading heartwarming messages. The artwork and mini-docos took over Macca’s owned and paid digital spaces, creating a nationwide ripple of cultural celebration and unity.\nOur initiative resonated profoundly within the community: “This makes me feel acknowledged by Macca’s”. And we won’t stop here, McDonald’s plans to expand to more areas, ensuring more Australians celebrate with us during the next LNY.\nSnack Drawer “Enter The Chat”, Instagram Australia x Butterfly Foundation\nSince 2018, Instagram Australia has partnered with Butterfly Foundation to deliver educational initiatives driven by community feedback and research.\nResearch by Butterfly discovered the unintentional harm prevalent body appearance content on social media can have. 6 in 10 (59%) Australians have reported that diet and fitness content on social media impacts their body image; nearly two-thirds (63%) have said they compare their image to what they see on social media; and over a third (38%) agreed that social media has a ‘negative effect’ on their body image.\nTo do this, Butterfly & Instagram asked Snack Drawer to create a creator-led campaign to reach young people aged 16-24 in Australia and encourage users to discuss the impact of social media content on body image and support themselves online.\nBut to find out who wins, you’ll need to grab your tickets for the B&T Awards now!\nWe set out to address the insight that when it comes to consuming and creating content about body image, Gen Z feel like they’re being lectured at by people who don’t represent them. To connect with our audience, we needed to create entertaining, engaging, playful and positive creator content that underscored the importance of conscious content creation and highlighted the Instagram tools available to users.\nOur idea: ‘Enter The Chat’.\nA facilitated, intimate roundtable discussion where creators could share, learn and reflect on topics relating to Eating Disorders and body image. ‘Enter The Chat’ provided an opportunity to discuss social media trends, and how creators and their audiences may be affected by them, or unwittingly perpetuate them.\nThe campaign brought together six Gen Y & Z resonant creators with varying lived experiences and engagement with body image content, to encourage engaging conversation and understanding. The campaign resulted in the most successful organic Instagram x Butterfly campaign since the partnership began in 2018, and received overwhelmingly positive feedback, particularly across Butterfly’s social media channels.\nSpecial & PHD, “Shift 20 Initiative”, Dylan Alcott Foundation\nDespite almost 20% of Australians having a visible or non-visible disability, only 1% are represented by brands in their advertising and marketing communications, leaving a large portion of the Australian population feeling unseen and unacknowledged.\nPartnering with the Dylan Alcott Foundation, we were tasked with not only raising awareness around the lack of visibility of people with disability in mainstream media, but also inspiring long term change.\nIn response – we launched the Shift 20 Initiative, a collective movement of some of Australia’s biggest brands, committed to normalising disability by increasing visibility of people with disability in advertising.\nBut to find out who wins, you’ll need to grab your tickets for the B&T Awards now!\nThe campaign achieved blanket coverage across the national and global media landscape, creating mass inclusion on a national scale.\nIt Sparked a national conversation with 144 pieces of media coverage in AU & 467 in USA, Post launch, 200+ brands, organisations and agencies reached out to see how they could get involved with Shift20.\nHowever the true marker of success was the response from the community of people with disability, with personal stories shared expressing gratitude for the campaign’s role in raising awareness and fostering positive lasting change.\nBut to find out who wins, you’ll need to grab your tickets for the B&T Awards now!",
  "word_count": 2275,
  "scraped_at": "2026-02-14T12:33:06.208339"
}