{
  "article_id": "5c1f54a45de7",
  "url": "https://www.thenationalnews.com/news/mena/2025/05/10/hamas-rejects-latest-us-proposals-for-a-gaza-truce-and-distribution-of-aid/",
  "title": "Hamas rejects latest US proposals for a Gaza truce and distribution of aid",
  "date": "20250510T064500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Live updates: Follow the latest on Israel-Gaza\nHamas has rejected a US proposal for a Gaza truce and release of hostages, insisting it would only agree to a comprehensive deal that includes a full Israeli withdrawal and an end to the war, sources said.\nThey told The National on Saturday that Israel and the US, its closest ally and benefactor, are determined that Hamas puts down its arms, its leaders leave Gaza and for the group's network of tunnels to be destroyed.\nThey said the Trump administration and Israel, meanwhile, are quietly working towards the resettlement of Gaza's Palestinians, or at least the vast majority of them, away from the territory.\n“Israel is insisting on pursuing the voluntary or forcible eviction of Palestinians in Gaza,” said one of the sources. “The Trump administration is fully supportive of Israel on the issue and is doing a great deal of quietly pressuring regional stakeholders to go along.”\nIsrael has enthusiastically embraced proposals first made by Mr Trump in January to resettle Gaza's Palestinians, mainly in Egypt and Jordan, before effecting a US takeover of the territory on the Mediterranean and turning it into a beach resort.\nEgypt and Jordan, along with the UN and many countries, have denounced the proposals, with some labelling the plan as “ethnic cleansing”.\nHamas's rejection of the latest US proposal was conveyed this week by a senior official from the group to Egyptian and Qatari mediators in Cairo, said the sources\nNews of the US proposal surfaced this week, with sources saying it called for a 21-day truce in Gaza and the initial release of six living hostages, including a dual US-Israeli national, as well as the remains of six more who died while in captivity in the enclave.\nIn return, Israel would free an as-yet unspecified number of Palestinians detained in its prisons and allow humanitarian aid to enter Gaza, they added.\nHamas is believed to be still holding 59 hostages, of whom 24 are believed to be alive, according to the Israeli military.\nThe US proposal, however, makes no mention of an Israeli withdrawal from Gaza or a permanent ceasefire; two long-standing demands by Hamas. It also does not include ideas on how postwar Gaza will be run or rebuilt, according to the sources.\nGaza has since the 19-month-old war started seen two ceasefires; one in late November 2023 that lasted a week and another that went into effect on January 19, 2025, and ended on March 1. Gaza remained relatively calm until March 18, when Israel resumed air strikes and ground operations.\nUnder the latest US proposal, the humanitarian assistance that will flow into Gaza would only be distributed at Israeli-designated “safe zones” in the southern part of the coastal enclave around the city of Rafah, said the sources.\nGaza's estimated 2.3 million residents are facing acute shortages of food, clean water, medicine and fuel as a result of Israel's two-month blockade of the territory, where more than 52,000 Palestinians have died since Israel launched a ground and air offensive there in October 2023 in response to a deadly attack by Hamas on southern Israeli communities.\nPrime Minister Benjamin Netanyahu's security cabinet voted this week to intensify the offensive against Hamas in Gaza to the point of seizing the entire enclave, according to Israeli officials.\nThe sources said the newly approved Gaza offensive plan would move the strip's civilian population southward and keep humanitarian aid from falling into the hands of Hamas.\nInternational aid agencies warned on Friday that plans presented by Israel to control aid distribution in Gaza will only increase suffering and death in the devastated Palestinian territory.\n“Humanitarian aid should never be used as a bargaining chip,” Unicef spokesman James Elder said in Geneva.\nThe US ambassador to Israel, Mike Huckabee, said a new system for delivering humanitarian aid and food to Gaza was being launched, with deliveries set to begin “very soon”.\nA new US-backed group called the Gaza Humanitarian Foundation has put forward an aid distribution plan along the lines of Israel's demands, according to documents obtained by The Associated Press. The group is made up of American security contractors, former government officials, ex-military officers and humanitarian officials.\nMr Elder said that the plan as presented to the aid community appeared “designed to reinforce control over life-sustaining items as a pressure tactic”. He said that it does not comply with Israel’s obligations to allow and facilitate impartial humanitarian relief.\nHe said that the plan would entrench forced displacement “for political and military purposes”, as Palestinians will be forced to move to be closer to distribution centres.\n“More children are likely to suffer and risk death and injury as a consequence of this plan,” Mr Elder said. “There is a simple alternative. Lift the blockade, let humanitarian aid in, save lives.”\nWith additional reporting by The Associated Press",
  "word_count": 808,
  "scraped_at": "2026-02-14T12:53:40.546253"
}