{
  "article_id": "5c20c7869378",
  "url": "https://abcnews.go.com/Politics/hegseths-views-dei-women-combat-challenged-democratic-senators/story?id=117623370",
  "title": "Hegseth views on DEI and women in combat to be challenged by Democratic senators",
  "date": "20250114T124500Z",
  "domain": "abcnews.go.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hegseth's views on DEI and women in combat to be challenged by Democratic senators\nTrump's Pentagon pick faces scrutiny in a Tuesday confirmation hearing.\nPresident-elect Donald Trump's choice to lead the Department of Defense, Pete Hegseth, is expected to face a highly contentious Senate confirmation hearing on Tuesday, including his controversial views on defense policy issues.\nAs an author and former Fox News host, Hegseth has written and spoken extensively about how he thinks the U.S. military should be run. Democrats on Tuesday are expected to press him to account for his past statements on women in combat roles, transgender service, as well as diversity, equity and inclusion programs.\nThat's in addition to questions he'll face about reports that he sexually assaulted a woman at a conference in 2017 and about excessive drinking.\nIn meetings with senators ahead of his hearing, Hegseth said the 2017 incident was consensual and that he paid a settlement to his accuser to head off a lawsuit and to protect his job at Fox. He also denied that he had a drinking problem and promised that he wouldn't drink if he was confirmed as defense secretary.\nHegseth has denied the allegations. In an op-ed in the Wall Street Journal last month, Hegseth wrote \"the press is peddling anonymous story after anonymous story, all meant to smear me and tear me down.\"\n\"It's a textbook manufactured media takedown. They provide no evidence, no names, and they ignore the legions of people who speak on my behalf. They need to create a bogeyman, because they believe I threaten their institutional insanity,\" he wrote in the op-ed.\nIn his prepared opening statement obtained by ABC News, Hegseth makes no mention of the allegations against him does acknowledge his lack of military leadership experience.\n\"It is true that I don't have a similar biography to Defense Secretaries of the last 30 years. But, as President Trump also told me, we've repeatedly placed people atop the Pentagon with supposedly \"the right credentials\" -- whether they are retired generals, academics, or defense contractor executives — and where has it gotten us? He believes, and I humbly agree, that it's time to give someone with dust on his boots the helm. A change agent. Someone with no vested interest in certain companies or specific programs or approved narratives,\" Hegseth will tell senators.\nTrump voiced encouragement Tuesday morning in a social media post.\n\"Pete Hegseth will make a GREAT Secretary of Defense. He has my Complete and Total support. Good luck today, Pete!\" Trump wrote.\nSome Senate Armed Services Committee members had not yet received documents related to Hegseth and the results of his FBI background investigation, although committee chairman Sen. Roger Wicker and ranking Democrat Sen. Jack Reed have been briefed on the contents, according to sources familiar with the matter.\nSenate Minority Leader Chuck Schumer asked why there was a rush to start his hearing given the magnitude of the job.\n\"We have all read the reports about his radical views, his alleged excessive drinking, the allegations about sexual assault, and his failures in the financial stewardship of multiple organizations. These are such serious allegations for such an important job. So, why would the Armed Services Committee wish to rush through these hearings, particularly when the documents are not available to all the members of the committee, including the FBI background check?\" Schumer said.\nSome Republicans on the committee who said they got the chance to view other documents related to Hegseth's nomination were satisfied with what was provided.\n“I have reviewed everything necessary for the hearing tomorrow,” Sen. Ted Budd, R-N.C., said.\nTrump hasn’t wavered in his support of Hegseth. In an interview with NBC’s “Meet the Press” last month, the president-elect said he heard that senators were coming around on Hegseth.\n\"Pete is doing well now, I mean, people were a little bit concerned. He's a young guy with a tremendous track record. Actually went to Princeton and went to Harvard. He was a good student at both, but he loves the military, and I think people are starting to see it. So we'll be working on his nomination, along with a lot of others,\" Trump said.\nAsked if he still has confidence in Hegseth, Trump said, \"Yes, I do. I really do. He's a very smart guy.\"\nHere's a look at what Hegseth has said about policy and is likely to be challenged on:\nWomen in combat\nBefore Hegseth was chosen to be Trump's secretary of defense, he spoke out against women serving in ground combat jobs.\n\"I'm straight up just saying we should not have women in combat roles. It hasn't made us more effective, hasn't made us more lethal, has made fighting more complicated,\" Hegseth said during a podcast appearance in November.\nHegseth has said he is not against women serving as combat pilots or in female engagement teams on the ground, but if confirmed as secretary of defense he could give an order to close other combat jobs that were opened by his predecessors, like those in the infantry and special operations.\nBut during the same interview, he seemed to contradict and soften his hardline stance against women serving in ground combat units.\n\"I'm OK with the idea that you maintain the standards where they are, for everybody, and if there's some, you know, hard-charging female that meets that standard, great, cool, join the infantry battalion,\" he said. \"But that is not what's happened. What has happened is the standards have lowered.\"\nLast month Hegseth spent time on Capitol Hill for meetings with Republican senators who could be key to his confirmation, such as Lisa Murkowski, Susan Collins and Joni Ernst, who served in combat zones.\nWhile there he tried to clarify his views on women in the military to reporters.\n\"I also want an opportunity here to clarify comments that have been misconstrued that I somehow don't support women in the military. Some of our greatest warriors, our best warriors out there are women who serve -- raise their right hand to defend this country and love our nation, want to defend that flag and do it every single day around the globe. I'm not presuming anything,\" he said.\nHe continued, \"But after President Trump asked me to be his secretary of defense, should I get the opportunity to do that -- I look forward to being a secretary for all our warriors, men and women, for the amazing contributions they make in our military.\"\nFiring alleged 'woke' generals\nHegseth has suggested the firing of America's top military officer, Air Force Gen. CQ Brown, the chairman of the Joint Chiefs of Staff, as well as other senior officers who were involved either in the chaotic withdrawal from Afghanistan or \"woke\" DEI initiatives.\n\"First of all, you got to fire the chairman [of the] Joint Chiefs and obviously going to bring in a new secretary of defense, but any general that was involved -- general, admiral, whatever -- that was involved in any of the DEI woke s--- has got to go,\" Hegseth said in an interview on the \"Shawn Ryan Show\" podcast days before being nominated. \"Either you're in for warfighting, and that's it. That's the only litmus test we care about.\"\nIf he is confirmed as secretary of defense, Hegseth could recommend removing certain military leaders and Trump would have the authority to do so. While there could be legal challenges in trying to outright kick generals or admirals out of the military should they refuse a request to resign, the commander in chief has the authority to remove generals from their current positions and reassign them, effectively ending their careers.\nBut the fate of Brown is an open question, especially after an amiable but brief chat between him and Trump at last month's Army-Navy football game. During the second quarter, Trump and Brown talked for roughly 20 minutes about football and the situation in the Middle East and Ukraine, a U.S. official told ABC News. Brown also had a separate quick introduction and handshake with Hegseth at the game.\nTransgender service\nIn 2016, the Pentagon under then-President Barack Obama lifted restrictions on transgender people serving openly in the armed forces. But in 2017, Trump announced on what was then Twitter that transgender service members would no longer be able to serve in the armed forces, citing concerns over costs and readiness. The policy was implemented in 2019 and required transgender service members to serve in line with the gender they were assigned at birth unless they had already successfully transitioned or were grandfathered in under the Obama-era policy.\nIn 2021, the Trump policy was reversed under the Biden administration, allowing transgender service members to again serve openly and access related medical care.\n\"This change to the standards meant that men and women could join the military for the express purpose of transitioning, be nondeployable for a year, and take life-altering hormone therapy that would mean they would be nondeployable unless the military could guarantee the supply of medication,\" Hegseth said of the changes under Biden in one of his books.\nWhen he retakes office, Trump could reinstate his transgender military ban by executive order to the DOD by again citing cost or readiness concerns, which in turn would likely trigger new legal challenges. Senators are likely to challenge Hegseth on whether he would turn away would-be transgender service members, especially during a recruiting crisis.\nBrandon Wolf, national press secretary for the Human Rights Campaign, was critical of the “discriminatory” positions that Hegseth has taken.\n“The Secretary of Defense is responsible for supporting all our servicemembers, but Hegseth’s comments show an immense disrespect for those in the military who are gay, lesbian, bisexual, transgender, women, and anyone who doesn’t fit his own narrow ideology,” he said.\n-ABC News' Rachel Scott, Luis Martinez, Kelsey Walsh, Allison Pecorin and Oren Oppenheim contributed to this report.",
  "word_count": 1650,
  "scraped_at": "2026-02-14T14:16:36.217782"
}