{
  "article_id": "5c3909f538cd",
  "url": "https://www.landgrantholyland.com/2025/4/7/24402803/power-two-podcast-paige-buckets-finally-wins-a-title-in-her-last-game-with-uconn-wnba-nfl-nba-usc",
  "title": "Power Two Podcast : Paige Buckets finally wins a title in her last game with UConn",
  "date": "20250407T134500Z",
  "domain": "landgrantholyland.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome to a new episode of Land-Grant Podcast Network’s Power Two Podcast. On this show, we talk about Big Ten and SEC football…and everyone else. My name is Jordan Williams, and I am joined by my co-host DaNaysia Jones. Lock in as we run a power sweep through the college football landscape.\nPower Two Podcast: Paige Buckets finally wins a title in her last game with UConn\nThe Women’s College Basketball season has ended with Paige Bueckers and UConn winning a title!\nOn this week’s episode, Jordan and DJ discuss a new football camp. Khalen Saunders is launching an LGBTQ+ friendly football camp. DJ shares how excited she is about advocacy from people who are not members of the LGBTQ+ community. Football can be a very macho sport so we appreciate the effort to create a safer space for all types of athletes.\nIn the two-minute drill, we discussed the “upset” that Houston Men’s Basketball handed to Duke. This prompted a conversation about men’s basketball and the success of recent draft prospects from college. There has not been much success for many, but will there be one for Copper Flagg?\nThere were way-too-early comparisons between him and Carmelo Anthony at Syracuse which prompted a conversation about the Naismith Basketball Hall of Fame Class of 2025. The class features heavyweights such as Carmelo Anthony, Dwight Howard, Maya Moore, and Sue Bird. DJ and Jordan took a moment to celebrate their accomplishments.\nFor the rest of the show, Jordan and DJ react to the Women’s National Championship game between UConn and South Carolina. DJ revels in the fact that she was correct about UConn winning from the beginning and makes her usual complaints about officiating. Jordan celebrated the young talent in the tournament, specifically Sarah Strong. This prompted a debate about the recent women’s recruiting classes and the talent within each class.\nJordan believed that it was rare to see generational talents like Juju Watkins and Sarah Strong in back-to-back classes. DJ argued that there are great talents in each class before them because women’s basketball is on a generally upward trajectory. They do eventually come to a consensus and preview next week’s episode which will cover our SEC game picks and the WNBA Draft.\nIf you like the show, please share it with friends and family and leave a five-star review. If you want to keep up with the show, subscribe to the Land-Grant Podcast Network Feed where new episodes drop every Monday. You can also find Jordan’s article including B1G Thoughts on the Land-Grant Holy Land website.\nFollow the show on YouTube: @GetDefensiveSportsNetwork\nFollow the podcast on Instagram: @GetDefensiveSportsNetwork\nConnect with us on Twitter: Jordan: @JordanW330 and DJ:@dj_danaysia\nMost Popular\n- Current, former Buckeyes react to local radio host suggesting Ohio State ‘needs to miss the NCAA Tournament’\n- Ohio State in prime position for two top 2027 targets\n- Ohio State’s safety room has answers up top, and questions everywhere else\n- Ohio State offers 2027 RB, makes cut for a top OT\n- You’re Nuts: Should Ohio State be starting Taison Chatman?",
  "word_count": 514,
  "scraped_at": "2026-02-14T13:42:28.699223"
}