{
  "article_id": "5c4429398257",
  "url": "https://www.irishcentral.com/news/ireland-australia-womens-world-cup",
  "title": "Ireland defeated by Australia in Women World Cup opener",
  "date": "20230720T161500Z",
  "domain": "irishcentral.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ireland's desperate efforts for a late equalizer came agonizingly short in their first-ever game at the FIFA Women's World Cup in Sydney, Australia today, July 20.\nPlaying in a packed Stadium Australia in Sydney, Ireland set up to frustrate their heavily-fancied opponents in the first half, playing with five at the back and restricting Australia to just one shot on target - a long-range effort from Katrina Gorry that was easily saved by Courtney Brosnan.\nThe sides went in level at the break after a hugely physical first half, with plenty of crunching tackles from both sides.\nFantastic opening 45 minutes ?\nStrong performance against the hosts, huge second-half to come ?#COYGIG | #FIFAWWC pic.twitter.com/ggLosPu5mc\n— Ireland Football ⚽️?? (@IrelandFootball) July 20, 2023\nManager Vera Pauw would have looked for much of the same in the second half, but Marissa Shevo's needless shove on Hayley Raso gave Australian a golden chance to take the lead from the penalty spot five minutes after the half-time break.\nAustralia's Steph Catley made no mistake, sending Brosnan the wrong way with a brilliant strike to the top corner.\nIreland responded well after conceding the opener and gradually came out of their defensive shell as they attempted to snatch a deserved equalizer.\nThe introduction of 18-year-old Abbie Larkin gave Ireland added impetus in attack during the closing stages as Ireland began to put the co-hosts under significant pressure.\nA golden opportunity fell to Heather Payne with ten minutes remaining, but her contact was poor and the ball drifted harmlessly wide of the target.\nWith time running out, Ireland continued to press, with Megan Connolly's free-kick deflecting agonizingly over the crossbar as the game entered injury time.\nThere was still time for two gilt-edged opportunities as a visibly nervous Australia clung on.\nFirst, Larkin squared to Katie McCabe following an Irish breakaway, but the Irish captain saw her close-range effort saved from Mackenzie Arnold.\nIreland recycled possession and came even closer to a last-gasp equalizer when Louise Quinn headed narrowly wide in the final minute.\nGutted ?\nAn incredible effort from the girls in green who deserved at least a point in their opening match ?\nThe country is proud of you ?#COYGIG | #FIFAWWC pic.twitter.com/vJ1Ivw4c2H\n— Ireland Football ⚽️?? (@IrelandFootball) July 20, 2023\nSpeaking after the game, McCabe said there were \"lots of positives\" to take from Ireland's performance.\n\"The second half shows a better account of ourselves and we'll look to bring those positives into the game against Canada,\" McCabe told RTE's Tony O'Donoghue.\n'The second half shows a better account of ourselves'\n— RTÉ Soccer (@RTEsoccer) July 20, 2023\nLots of positives for Katie McCabe as she looks ahead to the game against Canada.\n?? 1-0 ??#coygig #wwc2023\n?Watch https://t.co/2W5kFtUgZE\n?Listen https://t.co/QHSJNYlfx8\n?Updates https://t.co/YLBQxszzTF pic.twitter.com/tgLExhBUXe\nThe Girls in Green now travel to Perth to take on Canada in their next group game on Wednesday, July 26.\nNext Stop: Perth ✅\nWe'll be full of confidence heading into our second match ?\nRest, recover & go again ??#COYGIG | #FIFAWWC pic.twitter.com/LvQS7rRYwL\n— Ireland Football ⚽️?? (@IrelandFootball) July 20, 2023",
  "word_count": 515,
  "scraped_at": "2026-02-14T13:27:04.558717"
}