{
  "article_id": "5c4fbe8705cc",
  "url": "https://sacobserver.com/2024/06/black-voices-black-bodies-life-in-the-age-of-ozempic/",
  "title": "Black Voices , Black Bodies : Life in the Age of Ozempic",
  "date": "20240606T083000Z",
  "domain": "sacobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Anissa Durham | Word In Black\nWord In Black teamed up with STAT, a health, medicine, and science newsroom, to report over the past year on the impact of new weight loss drugs on Black America.\nPhoto direction by Crystal Milner\n(WIB) – When was the last time you thought about your weight?\nIf you’re anything like most of us, it was probably today — while getting dressed.\nIn the United States, you’d think the greatest achievement in life is fitting into a smaller clothing size. We praise people for their efforts to lose weight, no matter the cost. And the societal obsession with weight loss has only gotten stronger with the arrival of Ozempic and a new wave of anti-obesity drugs. GLP-1 drugs started as treatments for type 2 diabetes and have since been approved for obesity and heart disease — all chronic conditions more likely to affect Black Americans.\nBut to think about taking the expensive drugs means grappling with affordability and access as well as centuries of oppression, systemic discrimination, and monitoring of Black bodies.\nRelated: New Obesity Drugs Are Seemingly Everywhere—Black Folks Feel Left Out\nIt’s not easy being Black and living in a larger body in a world that worships whiteness and thinness. So, we wanted to hear voices from the Black community about living in the age of Ozempic.\nHow do Black people feel about their health, the new obesity tools, and the relentless pressure to not be fat?\nWord In Black and STAT surveyed and conducted extensive interviews with more than a dozen people nationwide. We wanted to get as many voices from the Black community as possible, but it became clear that the burden to lose weight falls far more often on women.\nThey spoke with brutal honesty as they shared their journey with weight loss, and their encounters with family and a medical system rooted in anti-Blackness.\nHere are their stories in their own words, edited for brevity and clarity.\n‘I realized it was not my fault’\nSudi Kamose, Dundee, Fla., 33, teacher\nI was at home and my mom’s coworker came over and asked me what I wanted to be when I grew up. I said a model. She said, you can’t do that unless you lose weight and then my mom agreed.\nThat has stuck with me since, and those dreams were gone because I kept gaining weight. That memory started everything — I was 10. I struggled with disordered eating. Since age 11, I would go on diet after diet. It took me until, like two years ago, to realize what I was doing was very disordered.\nIn 2020, I went to the doctor because my heart rate was high, and it was skipping a beat. The cardiologist said my heart was fine but that I’m too large, and that it’s putting a strain on my heart. He said I needed to cut everything that I was eating in half. At this point, I was barely eating. I tried telling him my diet consisted of cereal — he didn’t believe me.\nI told him I don’t know what I should be eating. I’m also on antidepressants. He said, it doesn’t matter what you eat, you just have to cut everything in half. The cardiologist said, “you can’t be happy if you’re overweight, I don’t care what any of them say, they’re not happy.”\nThat experience at the doctor’s office pushed me to be where I am now. He used my depression against me, and that was wrong. I never went back. I only got the courage to write a complaint in February of 2023.\nThere’s definitely a racial component to it. The way we as a society started to pathologize fat bodies or stigmatize them, is because it’s further away from whiteness. I think doctors need to recognize there’s always been body diversity. And this is an issue because people are trying to profit off of our pain and our suffering.\nThe journey to being diagnosed with PCOS [polycystic ovary syndrome] was a very long one. I went to the doctor after I noticed I was gaining weight. I kept trying to lose weight and of course I wasn’t believed. My diagnosis came when I had my period for three months straight. I did not want to go to the doctor because I was so afraid they were going to tell me it was my fault. Which happened anyway.\nI finally went because I was bleeding so heavily, I could not work. I had to have someone come into my classroom so I could go and change my pad like every hour. Finally, I went to the gynecologist, and at 25 they diagnosed me with PCOS. Because of insulin resistance, that could be the cause of me gaining weight. And I realized it was not my fault, even though they kept telling me it was my fault.\nIt was a roller coaster of emotions, to lose weight and not lose weight. It really contributed to my depression because it’s upsetting when you have a goal and everybody in the world is telling you, you are wrong for existing the way you are. And you’re trying to change it but it’s not changing.\nMoving forward, I’m learning to dismantle my own internalized fatphobia and continue accepting myself. I still struggle with my ideal body type and what that would look like. My end goal is to understand that despite what body I reside in, I am still worthy of pursuing happiness, joy, and having fun.\n‘I would hear negative connotations about Black food’\nAlishia McCullough, formerly of Carolina Shores, N.C., 29, licensed clinical psychotherapist\nAs a teenager, I dealt with a lot of restrictive eating. Sometimes it would mean eating a can of fruit a day or grabbing snacks throughout the day. I didn’t have a lot of education or awareness about my body.\nAt that time, I would hear negative connotations about Black food, being labeled unhealthy or unclean. I started to internalize those messages and thought the way my family cooks and eats isn’t acceptable. So I followed very rigid and restrictive diets as a way to modify my body — the ideal was to be thin.\nNow, I’m so much more intentional about how I respond to my body. I don’t look at food as good or bad, more so what does my body need to feel nourished.\nIt wasn’t until I got into graduate school where I learned the term eating disorder — I could resonate with that experience. In grad school, I interned at a counseling center where I started to help lead their eating disorder support groups. But I noticed the training was through a white lens. I had to work with clients with a diverse background to learn that the BIPOC experience is different.\nThe medical field uses BMI to equate weight with health. But there’s lots of research to show that BMI is a made-up construction — the purpose was to see what the average white man looks like. That instrument got adapted into mainstream society, when insurance companies figured out they can use it as a way to increase people’s premiums, recommend weight loss surgeries and medications — and quite honestly discriminate against certain patients.\nIn my household, we grew up watching “My 600-pound Life” or “The Biggest Loser,” with constant messages from the media showing that fatness is bad, fatness is disgusting. The premise of these shows is this idea that these people are thin, lovable, desirable people within a fat body. And if you can burn off all the fat, you can uncover the person within.\nA lot of our bias is coming from these media messages. When people say you’re fatter and more likely to have chronic illness, I challenge back and say do thin people also not experience chronic illness?\nThe way we define health is so limited. Our mental health and stress go into our health concerns. We’re seeing higher rates of health issues in Black communities but a big part of it could be that we have been exposed to so much chronic stress over time, that it’s manifested into health issues that we don’t see in other communities. I think it is a result of living in these very racially high stress environments and it’s been passed through generations. When we look at health it does need to be more expansive — healing our culture systemically and culturally can play a big piece too.\nIt’s not actually the fat itself that makes people unhealthy. A lot of times it’s the fat phobia and weight stigma they experience when they go to a health care provider. If folks go to their provider and know they’re gonna say all these negative things about their body, they are less likely to see a medical provider.\nI’ve heard so many stories of folks being dismissed because a provider blamed everything on a person’s weight.\nFatness was not labeled as unhealthy or bad until Black folks were enslaved. Body size became a way of creating a culture of hierarchy around human worthiness. And it became this whole messaging around Black people being gluttonous, or promiscuous and all these things associated with the Black body.\nOur medical system could benefit from seeing people as experts on their body.\nAs Black women, there’s so many layers in our relationship to our bodies. On one hand we’re lifted up as the standard, we see that with the BBL culture, and on the other hand, we’re being degraded and hypersexualized.\nOne of the things diet culture promotes is thinness at all costs. You’d rather be thin and dead than another size and alive.\n‘I found comfort and connection with food’\nJonathan Gustave, Orlando, 38, licensed marriage and family therapist\nI’ve been overweight my entire life. As I got older, I realized that losing weight had a lot to do with how I saw myself. I felt that if I didn’t lose weight, I’d be less than a person and less than acceptable in society.\nMy relationship with food has been very terrible. As a child, my father abandoned my mother and I, in a cold basement of Chicago. Then, my mother disowned me, she left me in the hands of my grandparents, she never came back for me.\nAnd my grandmother suffered with a lot of depression after my grandfather passed away when I was 5 years old. There was a lot of abandonment and neglect in my life from the time I was born, until I got married and had my own family.\nI’ve learned that every single human being desires connection, in some way. So, in the times that I was bored, lonely, and frustrated as a child, I found comfort and connection with food. It just became a crutch for me, because of the lack of connection that I had with family members.\nI was recently diagnosed with type 2 diabetes in August 2023, and I was forced to change my diet. I also have more love in my life — my wife and my kids. So, I do my best to connect with them, so that I don’t seek that connection and comfort from food. But it’s difficult because I’ve been operating like this for 37 years.\nFunnily enough, people have never said that I was overweight. But that’s because I’m 6 feet 8 inches, my weight now is like 335. My weight has fluctuated from 320 to 365 throughout my adult life.\nMy primary care physician suggested that I get on Ozempic. Now that I’m type 2 diabetic, if I stay in this range the cascade effects of losing a toe, foot, going on dialysis, and kidney failure has me more focused on my body being healthier.\n‘Fatness, it’s just a kind of human diversity’\nTigress Osborn, Phoenix, Tex., 49, executive director of the National Association to Advance Fat Acceptance\nThere’s an increasing discussion around the idea that obesity is, in the words of obesity experts, a complicated chronic disease. There are many people who are resistant to the framing of obesity as a disease, and it’s not because we are in denial about whether there are health impacts of being in a larger body. It’s because we are resistant to our bodies being inherently pathologized, medicalized, and classified as a problem.\nThe only way obesity is classified as a disease is through correlation with other diseases. Some of those same diseases correlate with Blackness.\nA lot of Black folks are bigger because we have different body types that weren’t taken into account when we created these standards of how we designate body types. These huge capitalist entities are increasingly seeing Black folks as a market. As a fat liberationist, my perspective is that anti-fatness is a much more serious problem for Black and brown folks than being fat.\nWhen I think of fatness, it’s just a kind of human diversity.\nAnti-fatness is a form of systemic discrimination — it’s pervasive and insidious. One of the systemic injustices is the medicalization of fat.\nSo, what I want is for people of all sizes to have true body autonomy. Where we are presented with research that starts from a neutral perspective.\nOne of the challenges when we are talking about weight loss drugs is that we are talking about them as the end of fatness. It’s all over the media, Ozempic, Ozempic, Ozempic. And the chorus behind that is, so why are you still fat?\nPeople are still fat because even if they take these drugs, fat people are still gonna be fat. If I lose 20% of my body weight right now, I’m still going to be a visibly fat person. I’m not going to turn into Beyonce by taking Ozempic, even if I take it for the rest of my life.\nCulturally, we’ve been waiting for magic. And we like the narrative that magic has arrived. But those of us who are more suspicious of that narrative may be more cautious in relation to our health choices — and may choose never to opt into these drugs.\nNovo Nordisk has never had my best interest at heart. The idea that we can undo the social or systemic pieces, by asking individual fat people to lose weight, is preposterous. Injustice should not be solved by asking the people who are subject to the injustice to change themselves.\nI’m a pretty confident fat girl. I’m middle-aged, disabled, fat, and Black — there is no cultural preferencing of me in the world. I’ve learned to self-advocate for myself and I’m willing to. We want to build a world where people don’t have to advocate for themselves because we’re all advocating for each other at a community level.\nI am aware of the days that I am unhappy in my body. It’s hard to live in a fat disabled body. I celebrate my body a lot, but I’d be lying if I said there were never moments where I think it would be easier if I had some other body. But I don’t have that as a permanent mentality the way many people do.\nThe reason I feel like that is because the world is terrible to this body. I want the world to treat me better as an individual in my body and everyone better in that way.\nI am concerned that we as a community buy into these oversimplified health narratives — like soul food makes all Black people unhealthy, but is it though or is it racism?\n‘I used to say I hate you in the mirror’\nTimothy Conley, Los Angeles, 46, department chair of cinema and film at California College of ASU\nWhen I was a child, I was bullied. My family has a way of saying things that can be hurtful. Even my own relatives made fun of my weight when I was a kid. I was sad and I felt like the only friend I had was food. I started gaining weight in elementary school.\nAround 2007 and 2008, I lost 123 pounds. I was eating six meals a day like a bodybuilder. I was in pretty good physical shape, but I was not in a good emotional shape.\nA lot of it was ego driven. Someone bet me that I couldn’t get down to a certain weight. Off of that bet, I was determined to get down to that weight. The problem was there were no healthy mental, emotional habits — as I began to lose weight, I was just determined to prove people wrong.\nSo, I ended up gaining all that weight back, and more. I became a type 2 diabetic in 2012.\nI was completely depressed. Growing up in the Black community, there was no promotion of seeking therapy, or other pathways outside of the Black church. What happens after church on a Sunday? Mac and cheese, fried chicken, barbecue ribs, greens, cakes, and pies — that was not a place I could go to for health and wellness.\nI have been as heavy as 422 pounds and as lean as 250 pounds. Even when I weighed more than 400 pounds, because of my height of 6 feet 6 inches, and being an ex-athlete, I don’t look like an obese person, I look like a large ex-football player.\nMy relationship with food has been like a rough marriage that needs counseling. I love food, but then I hate food. I’m addicted to fast food.\nI used to be the guy that at 1 a.m., I’d go through the Jack in the Box Drive Thru and load up on the $1 menu. I would eat all that food and somehow go to sleep after.\nI used food as a coping mechanism, like some people use alcohol or drugs.\nI looked forward to the sensation, the taste of refined sugar and processed crap. I tried going to Overeaters Anonymous; that didn’t last very long, because I wasn’t really connecting with anybody. There were no Black folks in there, it was a bunch of white folks in a room.\nNot that I don’t have anything in common with white people; I didn’t want this group of white people. There’s a lot of Black people who need a support group but grew up in that era where the church was your support group.\nNow, I am an advocate of mental health support, especially in the Black community. Personally, I think that every human being on this planet should have somebody to talk to, that is not a relative or a loved one. The problem is the medical industry has made this unaffordable or really hard to access.\nBefore going to therapy, I used to say I hate you in the mirror. Even when I lost all that weight — I hate you.\nSixteen years since that’s happened, I’ve done a lot of work. Now my practice is being mindful. I use positive affirmations for myself and tell myself that it’s going to be OK and that you’re loved. And loving myself regardless of what size I’m at because you got one shot at this thing called life, in this body, and you’ve got to make the most of it.\nOzempic was a suggestion from my doctor … to get my A1C blood sugar levels down. The challenge with Ozempic is I’m not really hungry, so I have to remind myself to eat.\nI started Ozempic in the middle of October. I’ve had issues with diarrhea and nausea, and some stomach pain when I’m eating certain foods. My doctor didn’t give me a timeframe — he said it’s either Ozempic or surgery. It’s a big industry to keep people on drugs and Ozempic is making a lot of money.\nI’m hopeful that it’ll be worth it. I’m at an age now, where a lot of folks that look like me start passing away as they enter their 50s. I do have my concerns because I know the medical industry makes a lot of money especially off of the Black and brown community.\n‘Gaining weight has been really exciting’\nDJ Rock, Brooklyn, NY, 28, fitness instructor\nEver since I started my transition and gone on estrogen hormones, weight distributes differently. It’s more difficult for me to put off weight. In the past few years, I’ve seen a lot of weight gain, a rapid transformation in my body. That has taken a while to get used to.\nIn some ways, gaining weight has been really exciting. I feel like I have an ass now. I’ve talked to other trans women about the way our bodies and muscles work is just so different now than it used to be. That brings up anxiety.\nI’ve had some surgeries to feel better in my body, and part of that has been a fat transfer from my stomach to my hips.\nThere are some things that all women experience, which is societal pressure to look a certain way. For trans people in particular, there are concerns with my body for safety reasons. As a Black trans woman, I do feel safer after having gender affirming surgeries because of my ability to not get outed when I walk down the street.\nI’ve connected transness, weight loss, and my fitness journey as like this loss of control. You just kind of get on hormones — because I want to look a certain way, but I have to wait and see what happens with my body. It’s kind of scary.\nMost gym people fall into this cycle of bulking and cutting. For me, it’s constantly a challenge. I lose some weight and my stomach looks flatter and I’m feeling good, but then my ass looks smaller. Then I want to gain weight and grow my ass back.\nI’ve never tried weight loss supplements. As a fitness instructor, Ozempic feels like cheating.\nI don’t think it’s cheating for everyone. I would never blame or fault someone for being on Ozempic. I would support my clients if they decided that was best for them. For me, it feels like I can’t do it.\nAs a woman, I think about my body way more than I ever did before. Also, as someone who is always on display as a fitness instructor. Once I had gender-affirming surgery — it felt like this is the body I’m supposed to be in. In a weird way, thinking of my weight is gender euphoric — because I really am a Black woman.\n‘Weight loss culture is ingrained in Black women’\nPaige Booker, San Diego, 34, IT supervisor\nI ended up ballooning towards the end of college. I didn’t realize I had gotten so much bigger until I saw my photos from my wedding. When I saw the pictures, I was like ‘oh my goodness, who is this?’\nI’ve talked about this in therapy a little bit: when I was younger, I remember sneaking food in my room. As an adult, I’ve come to realize I’m an emotional eater.\nEven when I was much smaller, growing up in the South, I had what we call a frog in my arm.\nI’m not supposed to be in this large body. It did not always used to be this way. I need to do what I can, to make it a body that I’m proud of. What I found works for me is tracking my food, because I didn’t know how much I was or wasn’t eating. Most of the time, I’m looking at the number on the scale, but I’m into checking in more with how I feel. I’ve tried a lot of different exercises like CrossFit, strength training, cardio boxing, HIIT, tennis, and hiking to see what sticks.\nI feel like weight loss culture is ingrained in Black women. There’s always this need or feeling to be whatever is trending at the time. That changes, which makes it harder to always love who you are and celebrate your own uniqueness. I think about how many Black women I know who use waist trainers, or drink detox teas.\nEspecially if you have something special coming up, there’s this need to put it all into overdrive. We deprive ourselves in order to be rewarded with a good time. Which is really sucky.\nFor all the things that have been said to me about my body, my husband has been a huge help as well. He’s like a cheerleader — he’s always complimented my body; he’s never made me feel negatively about my body. While I have external sources that say, do better and be smaller. I also have my own voice and the voice closest to me that’s saying you’re doing good.\n‘As a bigger person, I’m much more reserved’\nJoycelyn “Terri” Turner, Desoto, Tex., 59, corporate trainer\nI gained weight in adulthood; after my only brother was killed in a car wreck when I was 29. I was very comfortable and happy in my body until my brother was killed. I’ve always been a foodie — after he died, food was my comforter. Food was always there if I didn’t have anyone to talk to. It was there when I got home from work and when I woke up in the morning.\nI went through a periodic succession of losses. My father died in 1990. My brother died in 1994. My mother died in 2003. In 2008, 2011, and 2019 I lost three very close girlfriends who were like sisters to me.\nWhen I recognized I had a problem, it was about 10 years after my brother’s death. From 1994 to 2015, I gained 140 pounds. I had gone through diets, fitness clubs, exercising on my own, and with friends. But in 2015, I made the decision to get gastric sleeve surgery. Once I had the surgery, I lost 95 pounds within six to seven months. Since then, I’ve kept off 90 of the 95 pounds.\nGrowing up, I was always on the thin side. And I had a very positive self-image. As I gained weight, it was interesting to see the different treatment I received from people. That was new for me, not shocking, but surprising. When I was smaller, guys readily opened doors, but when you’re a big girl, they’re not tryna open the door.\nI’m not nearly as confident walking into a room as I was, when I was smaller. As a smaller person, my attitude is very open and joyful. As a bigger person, I’m much more reserved — I don’t like that because that’s not who I am.\nI would say for the past 10 years, it’s been hard for me to warm up to people, because I’ve had so many losses. I’m afraid to feel. As far as my psyche goes, I’m coming to grips that I’m a survivor. And my body is going to be what my body is going to be.\n‘I was so dependent on this drug that I was losing myself’\nCarenda Deonne, Gastonia, North Carolina, 43, human resources professional\nI’ve never been quote unquote skinny. From the age of 30 up until now at 43 the struggle is even harder to lose weight. I have tried different diets, like the watermelon diet. I’ve tried a vinegar, ginger, and cayenne pepper concoction. I’ve tried Weight Watchers. I even went to weight loss facilities.\nI kept noticing either the scale was never going down, or the scale was going up. The conversation started with a doctor because I was labeled obese. Diabetes runs in my family, and I don’t want that.\nI felt frustrated. When I started looking at myself in pictures and seeing myself on camera — I felt very self-conscious about my body. To the point where I would crop pictures. I would change filters where my stomach looks flatter.\nAt the last weight loss facility I went to, they checked my leptin hormone, and it was way out of range. So, the feedback was I could try it naturally which would take a very long time, or I could use a weight loss medication like Wegovy.\nI did try Wegovy and it did work — I started losing weight. The issue was I had to try twice to get my insurance to approve it. And the supply and demand is crazy, you cannot find the dosages that you need to be consistent to stay on it. As soon as I stopped taking Wegovy, maybe two weeks, the weight started coming right back.\nI was on Wegovy for about four months. I got off Wegovy because I couldn’t find it anywhere. And by the time I got to a higher dosage, I started feeling very tired and had heart palpitations. I lost about 13 and a half pounds. I’m a pound and a half away from all those 13 pounds coming back.\nI do think we should accept our bodies for how we’ve been created. I am a full-bodied woman; I have hips and all of that. But I’m not looking at my body now with disdain. I am accepting who I am and the weight just as I am.\nI was so dependent on this drug that I was losing myself. I would spend 30-45 minutes a day calling pharmacies, trying to find Wegovy. It was like this addiction. One day, I just woke up and realized this mindset isn’t healthy. And that’s when I started to make a change.\n‘I learned and unpacked the lies that were told to me’\nBrandon Stewart, Dallas, 34, freelancer\nI was a very small child, around 6 or 7, I remember blowing up and getting really really chunky or husky over the summer. I was made fun of by my family — but they would feed me the leftovers from their plate. By the time I was 8 years old, I was already 5 feet 8 inches, with like a 30-inch waist. So, I was built like an adult, but I was in third grade.\nI became very body (self) conscious because it was a combination of my weight, being dark-skinned, and being feminine as well. It was like a perfect storm. I thought there was something wrong with me. I was very ashamed of having breasts and being thicker. I thought I was worthless.\nI developed a complex of not wanting to be seen — that lasted into adulthood. In high school, I didn’t want to date because I was queer, and I was afraid of being found out. And I thought, no one wants to date a fat person anyways.\nIn response to a sexual assault, I began to pile on weight because food made me feel comfortable. I thought, if I’m really big no one is going to want to touch me or I’ll be more intimidating if I’m bigger. One assault, I completely blacked out, that happened when I was 5. The ones that really impacted me, I was 8 and 9. People were making comments that I was built like a man — but I was a child. I guess I was a predator’s dream. I isolated myself, stayed in the house and ate.\nSo, the instance with the adult that sexually assaulted me — I came home late one day, and my mom was asking where I’ve been. I was trying to tell her, but she wasn’t listening.\nFrom 18 to 23 — I was being hit on by chubby chasers. I’ve had many people who made fun of me online but wanted to lay with me in the dark. This was when I identified as a gay man, and it felt awful. I wanted to believe that the queer community was a place where we can finally feel safe. It wasn’t like that; you have to look a certain way.\nNow, I identify as non-binary. I don’t fit the idea of what people think of genderqueer because being dark skinned and being bigger is often coded as masculine. It’s tough to see how fatphobia is interlaced in everything, but that’s how white supremacy works.\nAround 24 to 25, my concept of self-love began to shift. I began to learn myself and see that I’m a bad bitch. I realized I’ve always been beautiful, and a joy. I learned and unpacked the lies that were told to me about my blackness, fatness, and about my body. I realized a lot of the pain I was carrying about my body didn’t belong to me.\nBeing authentically loved by people in my circle was really healing. They helped reflect the beautiful parts in myself that I refused to see. It helped bring me out of that darkness. Within the last few years, I started doing self-portraits — I told myself I can’t be afraid to capture my body.\nI was diagnosed in February with congestive heart failure.\nI was kind of angry because I had been to the doctor, and they were saying I should lose weight. There was no exploration of how my body was functioning. This could have been caught a lot sooner.\nNow, I’ve been losing weight because I’m sick. In no way have I blamed it on my fatness. I’m not blaming my body; I’m appreciative of where my body has brought me and that I’m healing.\n‘It’s like the bigger you are, the better off you are’\nJemima Cishugi, San Diego, 25, patient service representative\nI’ve always been the big one in my family. I feel like my sisters have always had these nice petite physiques. When I work out, I naturally get an athletic build, but I always fluctuate. In middle school, my mom told me I should lose a bit of weight. People always complimented my sisters’ bodies, and it made me feel like I needed to lose weight. In high school, I was diagnosed with anemia and the doctor suggested I change my diet to help build up the blood in my body.\nIt’s also a culture thing. When I recently went back to Congo, all I heard was comments that I’m so big. They say “ya monene”, which means in Lingala you’re the big one. To them it’s a good thing, it means you’re healthy, you have wealth, you’re able to feed yourself and not be malnourished.\nA lot of the people who work hard or in the fields in Africa are skinny or smaller. It’s weird. Culturally it’s like the bigger you are, the better off you are.\nI hyper-fixate too much on my physical image. I feel like I’ll never not worry about my weight.\nSocial media has heavily influenced me. I still want, not the BBL look, but the natural look. I still want that look without having to go under the knife. My goal when I go to the gym is to have the biggest butt ever and I want a small waist, that hourglass illusion.\nWhen I see a white girl that has a bigger butt than me, I feel like that’s not OK. The stereotype is Black women naturally have a big butt — but I know that’s not true. I ask myself: Am I less of a woman then if I don’t have that? Or less of a Black woman?\nTo seek validation from men and social media, it’s just a dead end — it’s so toxic. I feel like as Black women, we’ve never been made to feel like we’re worthy or beautiful at all, on any platform. We’re always kind of the bottom of the barrel.\nThere’s days where I do feel beautiful. But if I’m being honest, I look at myself in the mirror and always look for imperfections. I don’t like myself. I don’t love myself. At this stage in my life, I feel so anti-Jemima right now, and that’s not healthy. I can’t change what I look like or who I am. I need to accept it and love it.\nI compare myself a lot. I always think, would life be different if I looked like this? Or if my nose was smaller? If I had longer natural hair? But I think I do deserve to feel beautiful and love my body. I think all women do.\n‘If I could just get Ozempic, you have no idea’\nMichel Hobson, Arlington, Tex., 67, health information technology trainer\nI have never, ever felt good about my body. Period, end of story. As a young Black girl, I can vividly remember turning 12 and being at the family BBQ, and the elders talking about how fat I was. And how I would be fat and look like the rest of the women in the family.\nSo, my sister who is only 18 months younger than me, they never said that about her — they said she would be the cute, thin one. And she is. I internalized that. Since I was 17, I’ve dieted.\nI started my career when I was 24. Back then if you were Black and got accepted into corporate America, you did whatever it took to stay there. I wore the uniform, and it covered up my body — a male colleague said he couldn’t tell what my shape is. That was a common comment back in the 1980s. You were so lucky to be in the room, in the building, with a badge that worked, you just had to move on.\nI gained a reputation, not for being cute but for being professional. And that was my way of coping — by being the smart girl.\nBoth of my ex-husbands cheated, with younger women. And the love of my life, who I met in high school, we reconnected 10 years ago — he left after seven years, again, for something younger, firmer, and more fabulous.\nI have to work at having a positive body image for the day. When it gets bad, I focus on what I’ve achieved. Recently, I moved and bought a townhouse, and while unpacking I came across a photo of me at 18 with the love of my life. I was cute as you know what — I had it going on. I realized, I wasted an awful lot of time, not wearing things I wanted to wear.\nYou got the rest of your life to diet. I would tell my 12-year-old self to stay in the moment, F what everybody else tells you, live your life, because you can’t get it back. This sounds silly now, but most of my life has been dieting. Even at my own daughter’s wedding, her wedding reception had carrot cake — I didn’t get one slice.\nI was diagnosed with type 2 diabetes in my early 40s. I’ve been doing consulting since 1998, because I couldn’t get a full-time job. I don’t have insurance; because of my age I have Medicare but it’s not what people think it is. I don’t go to the doctor. I’m not taking any medicine, other than vitamins. The only thing I can afford is to watch what I eat. It’s a day-to-day struggle.\nWhen I saw Oprah Winfrey, I identified with the struggle she’s had with her weight all her life, I saw how awesome she looked at 70. If I could just get Ozempic, you have no idea, I’d take it in a heartbeat.\nIs my weight all there is to me? No. I am very proud of what I have accomplished in my life. The things that I have overcome and the battles that I’ve fought, and the doors I have literally kicked in.\nI would take the medicine in a heartbeat if I could get it. Even if it meant, it would shorten my life. The people I love didn’t die fast deaths, they suffered. So, in my head, if I have a choice between going the way they went or going out in a way where I can achieve some part of my vision for myself — I’m down with it.\n‘The cost is astronomical’\nDeborah White, Clarksville, Tenn., 70, retired\nI’ve been a type 2 diabetic since 1994. I’ve tried a variety of drugs that didn’t work with my body. My doctor’s decided to put me on Ozempic in April 2023. The first month that I took it, it was awful. It gave me nausea throughout the day, every day, all day. I lost 20 pounds in five weeks, but that wasn’t intentional weight loss. I stopped taking it for two weeks, because I could not take the feeling of being nauseated all day. It did improve my A1C — it dropped it a little more than a point.\nWeight has always been an issue all my adult life. I eat when I’m bored. So, I had gastric sleeve in 2013. The sleeve is not a guaranteed weight loss, it’s a tool that you have to work with, and I failed miserably with that. Each one of my three daughters has had gastric bypass surgery. Obesity runs in our family — most of the women are obese.\nI am a retired nurse. It’s not like I’m an uneducated person. However, there’s not enough education provided to explain what will cause your blood sugar to increase.\nI’ve had medication failures that caused yeast infections, or the medication would drop my blood sugar too low. Along with Ozempic, I take the long-acting insulin and the short acting insulin, which I take prior to meals. The cost is astronomical — there was a time where I was paying $124 per vial of insulin.\nAn endocrinologist that I had seen told me about a program at Walmart where I can get insulin for $24.95 a vial. That’s something that they were not telling me. So, the health care disparity comes in when you look at the cost. Ozempic costs me $84 per application, per month. However, if I had commercial insurance, I could get a three-month supply for $25, but they don’t accept Medicare or Medicaid.\nIt can run as high as $1,000 per application, but $84 on a fixed income is still an awful lot of money because that’s another bill that you have to pay. Initially, I had to wait three weeks because the pharmacy did not have Ozempic available. When it hit the market and people knew it could help control weight, they were scooping it up.\nTo be unable to get medication because someone’s vanity stands in the way, that says a lot about the state of our nation.\n‘I’m the healthiest I’ve ever been’\nKaiya Tubbs, Peoria, Ariz., 16, High school junior\nLiving in a Black household, most people can relate to all the fried food and gravy. Even though it was delicious, it’s definitely not the healthiest option. I was personally a binge eater. I would feel really bad about eating and then later that day, eat everything and go insane.\nAround fifth grade, I gained a lot of weight kind of suddenly. My mom was very worried. Then in one year, I had lost 90 pounds in a year. Within a few months, I had gained it all back. Kids at school can be mean, even teachers would comment on my weight. Most people around me at the time made me feel like I had to lose weight.\nIt had a lot to do with PCOS [polycystic ovary syndrome], but I didn’t know I had it. I was diagnosed at 13. Before that, doctors diagnosed me with precocious puberty and had suggested to put me on weight loss drugs. But my mom was very adamant about not doing that.\nAfter we got the right diagnosis, it was relieving — it felt like a weight lifted off my shoulders.\nThe more I became in tune with my emotions, I stopped binge eating. I had to change my mindset. I think my relationship with food now is a lot better than it used to be. I understand that food is important to keep me active, energized, and awake. Food is meant to enjoy. It’s good to be happy when you get something that you enjoy to eat — but it’s not good to eat cause it’s there or because you’re bored.\nI don’t think I’ll ever not be aware of the fact that I’m bigger than most people. But I’m just not as uncomfortable in that fact anymore. I’m not afraid of it or scared to put myself out there.\nA lot of people think you can’t be in a larger body and still be healthy. But I’m the healthiest I’ve ever been. I view my body in a positive light. Even if I don’t feel it in the moment, I do love my body at the end of the day.\nI’ve met beautiful women who have the same body type as me, who’ve uplifted me. And helped me to understand that you can be big and beautiful. These women are stunning.\nNow, I’m really, really happy.\nAnissa Durham is a health data reporter for Word In Black, reporting on health in the Black community.\nCrystal Milner is picture editor for STAT.\nSTAT’s coverage of chronic health issues is supported by a grant from Bloomberg Philanthropies. Our financial supporters are not involved in any decisions about our journalism.",
  "word_count": 7554,
  "scraped_at": "2026-02-14T13:12:30.799760"
}