{
  "article_id": "5c966e87bc50",
  "url": "https://slate.com/culture/2025/09/taylor-swift-pitchfork-new-yorker-music-reviews-poptimism.html",
  "title": "Taylor Swift rise , Pitchfork fall grumps blame one thing for it all . ",
  "date": "20250924T100000Z",
  "domain": "slate.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Last week, Rolling Stone TV writer Alan Sepinwall became the latest prominent arts critic this year to get some form of pink slip. He was preceded by film critics at the Chicago Tribune, Washington Post, and Vanity Fair, as well as four senior arts critics at the New York Times who were “reassigned,” including its chief popular-music critic Jon Pareles. New York magazine recently summed up these developments in a piece titled “Do Media Organizations Even Want Cultural Criticism?” After examining media economics and web-traffic trends, the essay reached a gloomy diagnosis: “The vast majority of reviews go virtually unread.”\nMeanwhile, New Yorker staff writer Kelefa Sanneh published a piece in late August called “How Music Criticism Lost Its Edge,” asking why critics aren’t writing sharp, snarky reviews like in the good old Lester Bangs days. It felt a little like somebody yelling up at people trapped in a burning building, “Hey, why don’t you guys do those cool fireworks displays anymore?”\nThe decline of the negative review is a subset of the decline of the review, period, with a few specific factors I’ll come back to. But like many kvetchers before him, Sanneh largely lays the blame on what he calls “poptimism.” He describes it as the position that “critics should not just take pop music seriously but celebrate it—or else,” which “sometimes bled into a broader belief that it was bad manners to criticize any cultural product that people liked.”\nIf there really were a movement among critics saying that we shouldn’t criticize anything, I can see how that would be a problem. But as one of the people who is often (inaccurately) said to have helped start said movement, I feel comfortable telling you this is nonsense. Which Sanneh should know, since he is credited (inaccurately) with starting it even more often than I am. Potted histories often trace “poptimism” back to his landmark 2004 New York Times article “The Rap Against Rockism,” even though it never uses the word. His New Yorker piece seems partly to be an effort to disavow his part in that lineage, which he nods to and steers away from as quickly as decency permits.\nThat figures, as one of the main features of “poptimism” is that it doesn’t really have any firmly avowed adherents. For a few years in the 2000s, a cluster of critics and bloggers briefly took it up, usually within apologetic air quotes, as an umbrella for a set of questions that seemed to need asking. It was an intervention, an event, more than a true critical school of thought. By the early 2010s, most of us were ready to move on.\nSome people, however, won’t let us. Sanneh’s recent article touched off another cycle on social media, blogs, newsletters, and elsewhere of the “poptimism wars” that stubbornly arise every couple of years. I’ve generally tried to ignore this persistent mangling of the history and meaning of a term I wasn’t so fond of in the first place. Considering that part of the whole idea was never to be ashamed of things you like, it’s—ironic? Fitting?—that it came with such a cringeworthy name.\nNow, however, a critic I respect, not to mention a friendly acquaintance, is adding to the confusion. Sanneh’s piece has lent comfort to the parade of polemicists who for more than a decade have used poptimism as a straw-man target for everything they think has gone wrong with criticism or media or the world. (Along with the articles I just linked, there’s a legion of mostly vanished tweets, “skeets,” etc. I should have kept a log.) By the late teens and early 2020s, the tropes of rockism-vs.-poptimism were so ingrained that they became the plots of whole Hollywood movies, like A Star Is Born and Trolls World Tour.\nOnce and for all, then, let’s clarify what “poptimism” was and wasn’t, what it did and didn’t do, and the real problems for which it’s been made a scapegoat.\nWhere “Poptimism” Came From\nAs Sanneh’s piece says, “poptimism” was an answer to critiques of what was called “rockism.” The term has been misunderstood ever since as an issue of liking pop music vs. liking rock music, which wasn’t at all the point. In fact, “rockism” first emerged in the British music press in the 1980s as a clash between different kinds of rock, a post-punk generation’s dis against corny ’70s blues- and prog-rockers. But in the early 2000s, it was adapted to refer to the tendency among some rock critics and fans to dismiss other music—country, techno, R&B, dance pop, big diva ballads, hip-hop, plus whatever rock they didn’t like—for being insufficiently noisy, individualistic, artistic, or rebellious. Or because the artists didn’t write their own songs or play “real” (aka nondigital) instruments. It not only overlooked but denigrated those other genres’ inherent virtues and appeal.\nAt this point, remember, rock had been the dominant force in popular music for nearly half a century. As the critic Douglas Wolk wrote in 2006, rockism was “treating rock as normative … the standard state of popular music: the kind to which everything else is compared, explicitly or implicitly.” In itself, he emphasized, “it’s not intrinsically rockist to love rock.” Rockism meant using rock’s vocabulary as the implicit yardstick for whether any piece of music was heartfelt and authentic, as opposed to slick and phony. This was especially a problem because the genres whose sincerity and truth got dismissed tended to be those whose makers and audiences were less white, straight, and male (or, in the case of country, less urban and educated). On that level, the critique of rockism was political as well as aesthetic. In 2018 the scholar Robin James wrote a deeply theorized essay on the parallel rise of poptimism and “popular feminism” that helps explain why, while acknowledging that each can get you only so far.\nHow poptimism came to be the common term for non- or anti-rockism, however, no one is quite sure. The word was used as early as 1987 by the esteemed U.K. critic Simon Reynolds (though he says he might have picked it up elsewhere) as a barb aimed at bands evincing a kind of please-like-me bouncy sunniness. That it was coined as an insult may help explain the negative magnetism poptimism has exerted ever since: It’s a term people either love to hate or are reluctant to love even when we mostly agree with what it stands for.\nIt resurfaced on blogs and message boards in the early 2000s, again mostly among British writers, at first in an argument over whether music goes through up-and-down cycles or if you can find good stuff somewhere on the charts every year. The blogger Tom Ewing then cheekily adopted “Poptimism” as the name for his monthly DJ night at a London club; I initially came across the word in that context on his site, Freaky Trigger. (Ewing would later write a “Poptimist” column on Pitchfork from 2007–11.) But pop itself has never meant quite the same thing in England as in the U.S., as Reynolds (now an expat in Los Angeles) pointed out in a blog post earlier this month. Some U.K. writers have always found a bit mystifying the turn the poptimism discourse took next.\nExactly where that American turn happened remains unclear. It was probably partly in online exchanges now lost in the digital thickets, and partly at the annual music-critics-and-academics jamboree the Pop Conference, launched in Seattle in 2002 and still going today. One way or another, poptimism (or popism, or pro-pop) was tentatively embraced as shorthand for a newly self-conscious critical pluralism.\nThe first mainstream article to announce that development to the general public was in Slate in 2006, by my predecessor Jody Rosen. In “The Perils of Poptimism,” he defined the “goofily” named critical tendency as saying basically this: “Pop (and, especially, hip-hop) producers are as important as rock auteurs, Beyoncé is as worthy of serious consideration as Bruce Springsteen, and ascribing shame to pop pleasure is itself a shameful act.” Note that in each case, Rosen was saying as important, not more important. And he was already warning not to exaggerate the divide: “The rockist-poptimist polarity is often false, and even when it’s not, must we choose sides?”\nWhat Poptimism Was and Wasn’t\nI’ve always favored a minimalist definition: Poptimism posited that all kinds of music have the potential to be rewarding and are worthy of serious critical attention, including the music on the pop charts.\nBy the early 2000s, the pop-criticism field as we knew it had been going for almost four decades. We knew from pop history—from swing jazz to 1950s rock to girl groups to metal to disco to rap—that no matter what writers said at the time, being commercial didn’t mean that those genres were bad or fake. We’d seen all the cycles of critical reevaluation, and what was true of the past was probably true now: Judging or dismissing whole genres without being curious about their own contexts and qualities was critical malpractice. It also risked reproducing hidden biases, given that styles and art forms always bring social histories and significance with them.\nThe fact is that rock criticism itself was a poptimistic proposition from the first, championing the intellectual value of a pop-culture phenomenon most people then considered frivolous and lowbrow. Critics periodically reminded themselves of that, like the New Yorker’s Ellen Willis in 1968, writing about how “regrettable” it was that rock bohemians of that era had forgotten that from Chuck Berry to the early Beatles, rock ’n’ roll creativity had been driven by a hunger for financial success. Or the influential Dave Marsh in 1989 repenting of some of his own previous rockist excesses, including venerating albums over singles, and musical rebellion above equally central “voices of reconciliation.”\nSome older critics were irritated by poptimism for exactly those reasons, saying that that’s what they’d been doing the whole time. But when Rolling Stone and Rock and Roll Hall of Fame founder Jann Wenner was caught on tape in 2023 talking about how female and Black musicians didn’t have what it took to be “philosophers of rock,” it was a reminder how often the field had gone astray. Every mission statement needs a refresher from time to time.\nHere’s what poptimism was not. It was not a belief that pop music is inherently better than rock or any other kind of music, including the most obscure and eccentric. It did not say that popularity equals quality, that everything on the charts is good, or that the most popular music should get the most attention. It was simply open to the idea that it might be good, perhaps even hopeful that it was. (That’s the optimism in poptimism.)\nIt did sometimes propose, however, that popularity also can be interesting in its own right. Drawing in part on the field of cultural studies in academia, poptimism said you could observe things about the zeitgeist by noticing what’s big in pop culture at any given moment, good or bad, and trying to consider why it was catching on. It saw pop fans not as dupes of the system (or, rather, not more than any of the rest of us) but as people whose pleasures were worth investigating.\nThat said, there probably was a subgroup of critics who specifically valorized pop qualities including showmanship, artifice, production, image, brightness, humor, and catchiness. (This is closer to some of the original U.K. “pop-ists.”) Some of those same people might also have disliked the trappings of some kinds of rock. I don’t think many made it a dogmatic article of faith, but even if they did, as far as I’m concerned that’s not poptimism so much as personal taste. Which, contrary to the anti-poptimism myth, everybody’s also allowed to have.\nPersonally, I’ve never been a part of that big-shiny-tunes camp. My roots are as an artsy esoteric-music person, as my year-end lists tend to reflect. It had taken a while for me to warm up to what radio pop, among other genres, had to offer. That’s sometimes caused more pop-savvy critics to cock a brow at me, like, What took you so long?\nIn 2015 Tom Ewing, one of the few and foremost self-declared poptimists, wrote a brilliant “taxonomy” of 27 possible ways critics could write about pop, from the sociological to the formalist to the contrarian to the fashion-forward to the mythological to the deeply personal. To me, they’re all part of what poptimism was intended to foster, including conclusions that might say, “So that’s why this song is crap.”\nHow Poptimism Won the War (Hint: There Was No War)\nIn Rosen’s 2006 Slate piece, he said, “One thing’s for sure: Most pop critics today would just as soon be accused of pedophilia as rockism.” In other words, within a few years of this issue being named, it was more or less over. Similarly, although my 2007 book Let’s Talk About Love: A Journey to the End of Taste is often cited as a poptimist manifesto, in the text itself I addressed poptimism in the past tense. (I saw the book as a weirder, more personal experiment, though certainly one informed by the poptimistic turn.) It was a shift that “came with remarkable speed,” I wrote, naming a few factors: a generational shift among critics matched by the explosion of music debate on blogs and message boards (this was before social media as we think of it now); downloading changing the way people grazed across all types of music (streaming didn’t exist yet); and how this technological turnaround made the declining corporate music business seem like a less fearsome force.\n“Plus,” I added, “some fantastic pop happened to be coming out, and everybody wanted to talk about it.”\nThat last was no small point. As Tom Breihan of Stereogum wrote in 2023, covering Justin Timberlake’s 2006 “My Love” in his long-running “The Number Ones” column: “This was the moment when younger critics were loudly proclaiming that populist and previously-disrespected forms of music—chart-pop, glossy dance, Southern rap—were often more exciting than whatever was happening in your local indie rock club.”\nThat loudness felt necessary because criticism in the early 2000s, especially online, had been so heavily dominated by indie rock, indie bloggers, and, memorably, Pitchfork in its early, snotty all-indie phase. This was partly a matter of internet access. Young white people, especially college students, were online in much greater numbers than any other demographic. Rather than any previous generation of critics, I think, we were mostly addressing the atmosphere created by this mass of White Stripes and Arcade Fire worshippers who were given to endless sarcastic asides about the supposed pablum on the radio. In particular, many of the sonics of the 2000s indie boomlet (chronicled in Stereogum writer Chris DeVille’s new book Such Great Heights) were beginning to seem wan in comparison with the innovative beats and textures producers like Timbaland, the Neptunes, and Max Martin were bringing to the mainstream.\nHip-hop was finally replacing rock as the definitive force in American (and global) pop, but a lot of writers in general-readership publications still approached it with a reluctant skepticism. In an in-depth essay on rockism this month, the musician and thinker Jaime Brooks argued that in this period, the very concept of the “band” was beginning to be rendered outmoded by the advent of all-in-one digital production tools. Whatever combination of technological determinism and musical evolution was involved, rockist clichés, always dubious, began to seem totally untenable.\nThere were publications that consciously fostered the shift, such as Idolator, a Gawker offshoot that became a hub for smart pop writing under editor Maura Johnston, and Blender, which had begun as the music equivalent of a U.K. “lad magazine” but under editor Craig Marks had come to boast the most eclectic and inventive review section in print.\nBy the end of the decade, all kinds of publications had lead critics with a poptimist bent: Rosen at Slate, Sasha Frere-Jones (formerly of Slate) at the New Yorker, Ann Powers at the Los Angeles Times (now at NPR Music), and more. Even Pitchfork had started to review some pop, though never in the quantity and with the credulity some put-out indie purists would have you believe. Jon Caramanica, who was hired at the New York Times in 2010, seldom comes up in poptimism discussions, despite his ongoing focus mainly on rap, pop, R&B, and mainstream country. He always distanced himself from the debate because he found it redundant: “It’s hard for me to take seriously,” he said in 2017, “a movement mostly agonized over by people with closed ears who chose to open them.” (Guilty.)\nOverall, 2000s poptimism had been a velvet revolution: an adjustment whose time had come, with hardly anyone speaking out seriously against it, except perhaps the always stimulatingly contrarian Simon Reynolds. And after all, it was his word to begin with.\nThe Backlash Cometh\nI’m sure there were burblings before, but the first prominent anti-poptimism screed I can remember came in the New York Times Magazine in April 2014, in a column called “The Pernicious Rise of Poptimism.” The writer, Saul Austerlitz, declared off the top, “Contemporary music criticism is a minefield rife with nasty, ad hominem attacks, and the most popular target, in recent years, has been those professing inadequate fealty to pop.”\nLike most of its kind, the piece was scant on examples of these “nasty, ad hominem attacks.” One was the definitely unpleasant contretemps in 2006 (note: eight years earlier) in which Frere-Jones called Stephin Merritt of the Magnetic Fields a racist mainly because his tastes did not seem to include very much Black music. But everyone, including Frere-Jones himself, quickly agreed that the argument had gotten too extreme. If it had anything to do with poptimism, it was not in a way many other critics agreed with. The other was a more recent article on Grantland that included a line anti-poptimists have quoted ever since: “If you don’t like the new Beyoncé album, reevaluate what you want out of music.” However, the “you” this writer was addressing was mainly himself—he hadn’t liked Beyoncé’s 2014 self-titled album at first, thinking it was overhyped, but after repeated listens changed his mind. This is what Austerlitz found so bullying?\nAusterlitz also took, from Sanneh’s 2004 article, the list of genres and qualities rockists championed or excluded, and claimed that poptimism just reversed them: “disco, not punk; pop, not rock; synthesizers, not guitars; the music video, not the live show.” But those nots were Austerlitz’s paranoid invention—please point me to the critic who is against live shows?—when what poptimism advocated was an inclusive and.\nI personally came in for heat from Austerlitz for my first article as Slate’s music critic, in which I wrote about not liking the indie band the National. He quoted my often-tongue-in-cheek piece out of context and ignored all the glowing pieces I’d written about other indie artists in the ensuing months in order to paint me as an anti-rock philistine. Although Austerlitz’s piece was rebutted as a retrograde plea that no one ever question his own superior tastes, it set much of the tone for the next decade.\nA notable exception was in 2015, from Washington Post critic Chris Richards, who wrote that Austerlitz had “whiffed it” but did feel that an overbearing consensus was pressuring people to write uncritically about pop. I’m not convinced by the examples he pointed to, some of which seemed plainly not criticism, such as a BuzzFeed recap of Katy Perry’s Super Bowl halftime show that consisted mostly of a series of GIFs. He also cited the headline of a Fader piece that called Kendrick Lamar’s To Pimp a Butterfly “critic-proof,” but what writer Rawiya Kameir really said in her piece was that she doubted that white commentators would grasp enough of the context to decode it, not that it was beyond reproach. (Lizzo would later call for Kameir to “be unemployed” for giving her album a 6.5 on Pitchfork.) Still, while Richards disavows poptimism, I’ve always seen him as an exemplary practitioner of it. Last year he wrote pans of both Beyoncé’s and Taylor Swift’s big albums, but he never dismisses music solely for being pop—his recent review of Sabrina Carpenter’s new album, for instance, was quite a bit more positive than mine.\nMore typical is the controversial but widely read Substack writer Freddie deBoer, who’s been obsessed with the evils of poptimism for years and writes in tones like this: “The problem with the poptimist argument is that … it treats preferring other types of music as actively wicked, pathological, disordered.” (In brief, no, it doesn’t.) And again: “So you see friends, it’s wicked to like Bruce Springsteen.” (I wish someone had told me—now here I’ve gone and written four long, positive Springsteen pieces over the years in Slate!) The perfect moment came when deBoer suggested in 2024 that somebody write a piece about how the poptimist emperor had no clothes, maybe for the New York Times Magazine. “Although I doubt they have the guts to run any such thing.” True, the Times Magazine wouldn’t run such a piece—because the publication had already run it 10 years earlier, written by Saul Austerlitz.\nIn the same piece, deBoer went on, for far from the first time, about how poptimism ruined Pitchfork. It “went from exemplifying 2000s music snobbery to being the 2010[s’] most ruthless enforcer of poptimist dominance we have.” This was a common claim around the time of Pitchfork’s internal shake-up in early 2024, as a supposed reason it had alienated its core readership (along with, of course, that it “went woke”). One vigilant soul on Twitter even sat down and did the math:\nHow much more pop was Pitchfork covering? Later in the thread, he reveals: “From ’99 to ’18, the percentage of Pop albums reviewed more than doubled from 5% to 12%.” To be clear, then, Pitchfork went from 95 percent non-pop coverage to 88 percent non-pop. That tracks: Examine Pitchfork’s top albums of 2024, and you’ll find precisely one pop record in the top 10, Charli XCX’s Brat. The thread goes on to describe this as “the abdication by ex-alternative outlets of their initial cultural positions.” Or, as deBoer would have it, “ruthless” enforcement of “poptimist dominance.”\nYes, there are way fewer white-guy guitar bands covered on Pitchfork than there used to be. This is mainly because most indie fans listen to way fewer white-guy guitar bands now. There’s more experimental electronica, moody new-age-influenced atmospherics, hybrid hyperpop, and, above all, indie rock made by women.\nIndeed, all the wild claims that some dictatorship of the poptariat has forbidden people to enjoy rock music require the observer to blind themselves to such critical darlings as Boygenius (and its members individually), Waxahatchee, Wednesday, Mitski, Snail Mail, Bully, Mannequin Pussy, Wet Leg, the Beths, etc., etc., etc. The New York Times did a whole special project about how “women are making the best rock music today” back in 2017, and the momentum hasn’t flagged. Occasionally, even a boy slips in, such as MJ Lenderman.\nNever mind, though, because for poptimism’s most high-flown haters, like W. David Marx, author of the upcoming book Blank Space: A Cultural History of the Twenty-First Century, poptimism is far worse than anti-rock. It’s anti-innovation, anti-art altogether. “We have to reroute the entire discussion of culture to only champion the most radical forms of creative invention,” Marx writes. In other words, reinstate the high-culture/low-culture hierarchy of the past. Forget poptimism—get rid of pop-culture criticism altogether.\nWhat’s Really Going On Here?\nEven discounting the eager revanchist resentment of characters like deBoer and Austerlitz, what’s obvious amid all the static of anti-poptimism is that people are uneasy about something. I don’t believe it’s the content of most coverage of pop by actual critics—complainants seldom name any specific writers or articles. In part, it’s a basic misunderstanding of the nature of criticism. As my colleague Steacy Easton put it to me, “It assumes paying attention to a text means endorsement.” But mostly I think it’s groping for the causes behind larger cultural changes.\nI’ll admit that some of the “cheerleading” anti-poptimists gripe about does exist. Beware, for instance, of fannish critics who come bearing superstars’ nicknames, like “Bey” or “TayTay” or “Drizzy.” (I can’t say I’ve never attempted this jaunty informality, but I’ve long sworn it off.) However, most reviews I read include positive and negative points and thoughtful inquiries into meanings and themes.\nThe bigger issue is which reviews are getting assigned and published. Some of the smarter recent writers about poptimism, pro or con, have tried to frame it retroactively as critics’ response to the online attention economy, mirroring the interests of the largest numbers of readers in order to get clicks and to stave off the wrath of online fans. What this overlooks is that it was 2005. Frankly, anyone who had that much insight into where things were headed would probably also have known to just switch into a more viable line of work. In fact, the optimism in poptimism was part of the general techno-optimistic mood then—we thought the whole music world was loosening up, that online discourse would foster a new eclecticism of taste and an almost unlimited range of discourse.\nLike pretty much everyone else’s hopes about the internet, ours have come back to bite us in the ass. What we’ve gotten instead is indeed a click-based media economy, in which publications do try to produce as many headlines about a handful of big names as they can and are more hesitant to pay critics to write about new discoveries or obscure favorites, because they won’t get any views. There are still many specialty music sites where that work does happen, thankfully, but more and more of it is unpaid labor.\nSo, yes, to make a living, critics write about Taylor Swift, Drake, and other big names (Springsteen included—those pieces do get views). But critics doing criticism is just a tiny percentage of the volume of celebrity coverage. We are driven as crazy as anyone else by the avalanches of articles about Swift’s love life, her income, and what football fans think of her, not to mention the countless essays written by the political correspondents, health reporters, or senior editors who happened to take their daughters to the “Eras” tour and wanted to share all the epiphanies they had there. (We probably hate those more.) Likewise, USA Today’s parent company, Gannett, hired full-time Taylor Swift and Beyoncé reporters, and those people were not critics. I wouldn’t be surprised if it had said in the job descriptions, “No critics need apply.”\nBut people see all these things flip by in their feeds and assume that this is because of “poptimism.” No, that’s because of eyeballs. It’s because of money. There was plenty of this kind of coverage before the internet, of course—guess what? Entertainment Tonight and Us Weekly weren’t works of criticism either. But back then, newspapers and magazines imagined that readers who picked up the entertainment section to read about Julia Roberts might stick around for whatever weird stuff the music critic was reviewing that week, or for a live-show review. Now publishers can see that mostly they don’t.\nOver the same period, stars and record companies alike discovered that social media gave them an opportunity to communicate directly with fans and circumvent the press altogether. Social media also satisfied a lot of people’s appetites for music discussion in two-sentence bites or YouTube reaction videos, rather than anything more in-depth and challenging. And finally, streaming made music easier to dip into straight away instead of reading about it while deciding whether to make a purchase, and platform algorithms work in favor of making the biggest artists bigger. Even more so, they work in favor of keeping you on the platform.\nThis may be the biggest thing 2000s poptimism failed to anticipate: that rather than withering away, the music industry would find new ways to hegemonize, now arm in arm with the world’s biggest tech companies. And the laser focus from all directions on a handful of the biggest stars now feels of a piece with all the other ways billionaires and their lackeys hog all of society’s resources. Whereas poptimism wanted to take seriously all the pleasures listeners can get from pop, the prevailing cultural tone has become more like “Ask not what Taylor can do for you, but what you can do for Taylor.”\nThat’s also the logic that governs the labors of armies of stans, the Beyhive and Swifties and others who will swarm, insult, even dox you online if you voice a discouraging word about their beloveds. The atmosphere they create is the reason the anti-poptimist complainers feel so intimidated and annoyed. But nobody is targeted by these people (I want to say “kids,” as that’s generally what they are) more than critics. To name just one notorious example, poptimist ally Ann Powers got harassed by Lana Del Rey stans in 2019 for a mostly positive review.\nNone of this is critics’ fault or has much of anything to do with our taste or lack thereof. We know there’s an excess of pop coverage now. We desperately want to be able to cover a wider variety of other things as well. But that’s often not the work on offer. This is the reason my favorite anti-poptimist piece ever was by a U.K. writer named Michael Hann, called “Is Poptimism Now As Blinkered As the Rockism It Replaced?” Partway through, after going on about how pliant and gullible critics are, Hann says, “I know that to be true, because (as music editor of The Guardian) I’ve been commissioning those pieces.” Um, so, mate, how is this the writers’ fault, exactly? Again, this is not a criticism issue. It’s an industry issue. (And no, the Atlantic, poptimism didn’t somehow also kill music listings, for Christ’s sake.)\nAll poptimism has in common with most of these trends is that they’re products of the internet. But, again, the internet in distinctly different phases. This is why there was so little anti-poptimist pushback in the 2000s, and so much of it beginning around 2014 or 2015, and ever since. But naming poptimists as the culprits is a case of mistaken identity. We just happened to be there at the time, like everybody else.\nSo Where Did the Negative Reviews Go?\nSo if it’s not that poptimism turned critics all into simpering stooges for pop stars, why are there fewer negative reviews now? Here’s a quick list of real causes, only a couple of which Sanneh caught:\nThere are fewer staff critics now, like Richards at the Post, meaning way fewer people whose job is to review everything. Pieces are going to be assigned to freelancers who have an interest and a background to cover the subject. On one level, that’s good, as reviews are likely to be better informed and to not trash something out of ignorance. But it does mean that reviewers are more likely to be sympathetic to any given artist in advance. Freelancers prefer to cover things they like, not things they don’t. (Note: Like Slate’s other chief arts critics, I am a freelancer, not on staff. But at least we do have titles and thus some sense of continuity, even if it’s not job security or benefits.)\nYes, sometimes the stan harassment doesn’t seem worth it. That doesn’t mean that you pretend to like a record that you don’t. It means you might just let someone else cover it instead.\nFor big pop records, because of fears of piracy or “leaks,” record companies often won’t provide reviewers with listening streams in advance. (Back preinternet, you might have gotten it weeks early!) This means we have to start listening to the album at midnight Thursday night, like everybody else. We’ll prepare as much as possible beforehand, but then can listen probably only a handful of times before we have to file in the morning. Unless we’re either blown away or totally repulsed, it’s difficult to make a full assessment. In those circumstances, you’re likely to err on the side of caution. (This does lead to regrets: I wish, for instance, that I’d been harder on Swift’s Midnights.) As Sanneh says about his own impulses now, “Why commit that judgment to print, when, instead, I could wait to see whether it will grow on me, as awkward-seeming albums sometimes do?”\nHaving access to so much of the archive of past music journalism online, we can see how badly many of those old “cranky” negative reviews have aged. A lot of the Lester Bangs era, not to mention the early infamous Pitchfork zeros, etc., can read like arrogant, thoughtless dick-swinging more than wit or insight. Indeed, there are few critics who haven’t written snarky self-indulgent crap when we were young. You might say the field has matured out of that phase. Still, some qualities have risked getting lost in the process—I strongly agree there is not enough humor in criticism now.\nFrankly, turning thumbs up or down has always been the least interesting thing critics do. What matters is why.\nWhat Poptimism Accomplished\nAs Jaime Brooks quotes Sanneh himself saying, it’s debatable whether critics ever actually “influence shit.” But we can name some good things that came out of the paradigm shift that poptimist critics were part of:\nUnlike in the heyday of Britney Spears, members of the media are less likely now to treat female pop stars as nonpersons to be shamed for their sexuality and denied even the potential of being creative contributors to their own work. (If you think that this didn’t happen routinely to Swift well into the 2010s, think again.)\nThe media stopped deriding rap and R&B (yes, Beyoncé included) for being too fussed about “getting paid” as opposed to the righteous politics of “conscious” or “alternative” hip-hop. It was “all about the Benjamins” versus a rock star’s “It ain’t about the money, man.” Anti-rockist critiques helped people grasp that rap songs about the hustle might be equally authentic.\nThe press also mostly, though not entirely, stopped judging every Nashville country act by whether Hank Williams woulda done it that way. In the 1990s, the bulk of critics sneered at Shania Twain and Garth Brooks for being slick and pretty, not like the “outlaws” of the past. That bias isn’t gone (critics still vastly prefer “Americana”), but it’s less absolute. And some of the remainder frankly is Nashville’s fault.\nPoptimist critics would not stop reminding the Grammys every year that old white men—or at best younger white women—kept getting over-rewarded at everyone else’s expense. Eventually, they seemed to at least try to reform.\nMusical crossovers and hybrids in general have been the particular sound of poptimism since the pop/indie mashups of the aughts (from “A Stroke of Genie-us” to the mega-mashups of Girl Talk and 2 Many DJs) through the hyperpop of Sophie, Charli XCX, 100 Gecs, and more in the 2010s and 2020s.\nNo matter the genre, critics’ and audiences’ awareness of the influence of producers, songwriters, and other behind-the-scenes players and techniques in creating music has risen to unprecedented heights. (Though you still don’t have to look far to find people who have completely rockist reactions.)\nVarious kinds of elite recognition of pop: Without poptimism, would Kendrick Lamar have won the Pulitzer? (Even if he won it for kinda rockist reasons?)\nAnn Powers suggests that without poptimism’s defense of female and queer-coded music, and women’s taste as such, there would not be nearly as many women as top editors at venues of music journalism—including, right now, at Rolling Stone, Billboard, the New York Times, and even for a few years at Pitchfork (before Condé Nast moved it under GQ).\nIn the past 15 years, poptimism has also been matched by a shift within academia from a one-step-removed “popular music studies” (which tended to focus on “subculture” and “subversion”) to a more inclusive and cross-disciplinary “pop music studies.” As editor Eric Weisbard writes in the introduction to the hefty forthcoming Oxford Handbook of Pop Music, “Popular music studies at its core centered around the idea of the vernacular assaulting the genteel as the modern had the Victorian. … Pop music studies emerged from debates around blackface minstrelsy and hip-hop Blackness, 21st century TikTok challenges that blur genres, pan-Asian and pan-Latin hits that compete with Anglo-American offerings in the quest for planetwide streams.”\nHere are a half-dozen specific, smaller cases of poptimism done right:\nChris Molanphy’s “Why Is This Song No. 1?” series and Hit Parade podcast at Slate.\nNPR’s Turning the Tables project, led by Powers, posing an alternative to the inherited male-dominated canon of great albums.\nTom Ewing’s series Popular (going through all the U.K. No. 1s of the past) and Tom Breihan’s the Number Ones (doing the same for the U.S., now a book) and the Alternative Number Ones, both at Stereogum.\nThe mighty Singles Jukebox site of critics’ roundtables on current would-be hits.\nThe Singles series from Duke University Press, which answers the long-standing 33⅓ books-on-albums series with one-song volumes on everything from “Old Town Road” (also by Molanphy) to songs by ABBA, Jacques Brel, and Jonathan Richman.\nPodcasts like Switched on Pop, the New York Times’ Popcast, NPR’s Pop Culture Happy Hour, the Ringer’s 60 Songs That Explain the ’90s, etc., etc.\nBeyond Poptimism\nPart of why most critics were ready to move on from the so-called poptimist stage by the earliest 2010s was that it was only a first step in the direction of radical pluralism. Bringing dance pop and rap further inside the tent was one thing, but what about K-pop, reggaeton and corridos, easy listening, even the Broadway musical? Many more regional and niche styles and audiences remain neglected now: Gospel! Jam bands! Punjabi electronica! The kinds of shitposting online music that Simon Reynolds’ son Kieran covers in his column on Pitchfork! This is where staff writers, if they’re given the time and budget to explore their curiosities, can make a difference—the “reassigned” Jon Pareles was always a leader in the field that way. Sanneh’s own latest New Yorker piece on Bad Bunny’s current Puerto Rico concert run is also a model example.\nAs well, critics writing about pop do need to respond to the industry factors I raised above—to treat those moneyed machinations with skepticism without going back to cheaply denigrating the music, artists, and fans. There’s more to pop politics than checking for demographic representation, though that obviously still counts. And we do need avenues to support more-underground, noncommercial culture. Many of us are trying to make a space on our Substacks for the kinds of pieces editors today won’t buy, and even joining forces like the cooperative of ex-Pitchfork editors and writers at Hearing Things.\nAs the walls seem to close in on “the traditional review,” as the Times put it when shuffling out its veteran critics, we need new techniques to bring the highest critical standards to podcasts, videos, even TikToks, beyond reaction videos and chicken-shop dates. Defending criticism’s written tradition matters, but even more vital is to keep standing up for the whole mode of thinking it implies, even as the cultural climate turns against expertise, the humanities, free speech, and free thought.\nIt’s a struggle to be (p)optimistic in 2025. Thankfully, when you need consolation, or motivation, you can at least still reach for a pop song.",
  "word_count": 6589,
  "scraped_at": "2026-02-14T14:17:51.849496"
}