{
  "article_id": "5ca06a1e8c92",
  "url": "https://www.bbc.co.uk/sport/football/articles/c04gz9z7ddxo",
  "title": "2027 Women's World Cup: When is the European qualification draw?",
  "date": "2025-10-21T14:28:09.567Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "When is the 2027 Women's World Cup qualification draw?\n- Published\nEngland, Wales, Scotland and Northern Ireland will discover who they will face in qualification for the 2027 Women's World Cup on Tuesday, 4 November.\nThe European qualifiers will run from February to December 2026, with 11 nations progressing directly through to the tournament in Brazil. Another place could also be available for a European team via the intercontinental play-offs.\nA total of 32 nations will play at the 2027 edition, with the tournament set to expand to 48 teams for the 2031 World Cup.\nQualification is already under way in Asia and Africa.\nEngland women reached the final of the 2023 Women's World Cup in Australia and New Zealand, losing 1-0 to Spain.\nScotland missed out on making that tournament, but made it to the 2019 edition in France. Wales and Northern Ireland have never qualified.\nGet in touch\nSend us your questions\nHow does the draw work?\nThe European qualifiers are split into groups based on the results of the 2025 Women's Nations League, with 16 teams in League A, 16 teams in League B and 21 teams in League C.\nThe draw will put teams into groups of four or three (League C), with each nation playing one home match and one away match against the other countries in their group.\nThe winners of each League A group will automatically qualify for the World Cup, while the remaining seven direct spots, and a further berth in the inter-confederation play-offs, will be decided by two rounds of play-offs in October and November 2026.\nEngland will be in League A. Scotland, Northern Ireland and Wales will be in League B.\nWho is in each league?\nLeague A:\nFrance\nGermany\nSpain\nSweden\nNetherlands\nEngland\nItaly\nNorway\nPoland\nSlovenia\nSerbia\nUkraine\nIceland\nDenmark\nRepublic of Ireland\nAustria\nLeague B:\nPortugal\nWales\nSwitzerland\nScotland\nSlovakia\nIsrael\nLuxembourg\nMalta\nMontenegro\nLatvia\nCzech Republic\nFinland\nNorthern Ireland\nBelgium\nAlbania\nTurkey\nLeague C:\nBosnia and Herzegovina\nHungary\nRomania\nBelarus\nCroatia\nGreece\nAzerbaijan\nFaroe Islands\nKazakhstan\nEstonia\nLithuania\nArmenia\nBulgaria\nMoldova\nNorth Macedonia\nGeorgia\nAndorra\nLiechtenstein\nGibraltar\nCyprus\nKosovo\nHow do the play-offs work?\nThe first play-off path involves the teams finishing second and third in their World Cup League A groups, who will play the six winners and two best-ranked runners-up in League C. The victors will advance to the second round of play-offs.\nThe other path involves the four fourth-placed League A teams and four League B group winners being drawn into eight ties against the teams finishing second and third in the League B groups.\nThe teams from League A and the League B group winners will be seeded and play the second legs at home, with the eight winners progressing to the second round of play-offs.\nIn the second round, eight fixtures take place with the seven best-ranked play-off winners - according to the European qualification league rankings - qualify directly for the World Cup. The lowest-ranked winning team progresses to the inter-continental play-offs, which takes place in Februrary 2027.\nHow many other nations qualify?\nBrazil automatically qualify as hosts.\nAsia: 6 (2 inter-confederation play-off spots)\nAfrica: 4 (2 inter-confederation play-off spots)\nNorth, Central America and Caribbean: 4 (2 inter-confederation play-off spots)\nSouth America: 3 (including hosts Brazil) (3 inter-confederation play-off spots)\nOceania: 1 (1 inter-confederation play-off spot)\nEurope: 11 (1 inter-confederation play-off spot)\nThis article is the latest from BBC Sport's Ask Me Anything team.\nWhat is Ask Me Anything?\nAsk Me Anything is a service dedicated to answering your questions.\nWe want to reward your time by telling you things you do not know and reminding you of things you do.\nThe team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.\nWe will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.\nOur coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
  "word_count": 682,
  "scraped_at": "2026-02-14T11:17:46.626580"
}