{
  "article_id": "5ca47596a124",
  "url": "https://www.aspentimes.com/news/ski-and-snowboard-club-vail-alumna-makes-world-cup/",
  "title": "Ski and Snowboard Club Vail alumna makes World Cup debut in Kronplatz giant slalom",
  "date": "20250121T230000Z",
  "domain": "aspentimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ski and Snowboard Club Vail alumna makes World Cup debut in Kronplatz\nFellow SSCV alumna Paula Moltzan led the U.S. with her fourth-career World Cup podium\nVail’s Liv Moritz made her World Cup debut in a giant slalom in Kronplatz, Italy, on Tuesday. The Ski and Snowboard Club Vail and Vail Mountain School alumna did not qualify for a second run after placing 55th in her first trip down the Erta slope.\n“Super exciting. I was probably the most nervous I’ve ever been,” Moritz told U.S. Ski and Snowboard’s Sierra Ryder. “My legs were a little numb in the start, but I had fun.”\nNew Zealand’s Alice Robinson won the event with a two-run total of 1 minute, 55.28 seconds. Defending overall winner Lara Gut-Behrami finished second and American Paula Moltzan (1:56.22) rounded out the podium in third.\n“I told myself second run that I didn’t want to ski like a baby so I kind of just gave it my all and made mistakes but recovered and kept the speed going,” said Moltzan, who moved up seven places after her first run to capture her fourth-career podium. “I think it’s a good place to be building off going into world champs.”\nNina O’Brien — who, along with Moltzan and Moritz, are all SSCV alumni — also finished in the top 10.\n“Honestly, I’m happy with another top-10 and another solid GS result,” O’Brien said. “I think it’s an amazing day for the team and (I’m) really happy to see Paula finally get on the GS podium.”\nMoritz is in her second year with the U.S. Ski Team after representing the stars and stripes at the World Junior Championships in 2023 and 2024. She is also dual-sport athlete at the University of Denver, winning Summit League newcomer of the year in her first fall on the NCAA DI soccer squad. Last spring, she earned All-American honors on the slopes with a fifth-place GS finish in Steamboat Springs.\nAfter taking a win at the Holiday Classic in Steamboat Springs on Dec. 21, Moritz opened the new year on the Europa Cup circuit. She posted a 40th-place finish in the slalom in Les Diablerets on Jan. 8 and was 27th in the GS in Puy Saint Vincent, France, two days later.\nDuring her run in Kronplatz on Tuesday, the 20-year-old college sophomore unexpectedly lost a pole. Despite the hiccup, she still managed to walk away from her debut with some positive takeaways.\n“I thought I skied pretty well at the top,” she said. “As I got onto the pitch, I didn’t move enough to my right so I got sucked pretty low; it was a little bit dirty, but overall I think it was pretty OK for my first start.”\nWhen asked if it was everything she’d imagined, Moritz replied, “It is I would say what I expected. It’s a bit different just because everyone I look at I’ve been watching on TV and been looking up towards. So, it’s just cool to ski with such good skiers.”\nRadamus earns World Cup points in Wengen\nRiver Radamus placed 29th in the World Cup super-G in Wengen, Switzerland, last weekend. The Edwards skier also competed in the slalom on Sunday, but did not qualify for a second run. He currently sits 32nd in the overall, 13th in the GS and 25th in the super-G season standings.\nFellow SSCV alumni Kyle Negomir placed 38th in the super-G and 47th in the downhill.\n“It’s brutal to have such cool opportunities like this and make mistakes that prevent you from taking advantage,” he posted on Instagram. “But I’m trying to remember how amazed my 10 year old self would’ve been to get a chance to do this, no matter the result.”\nNegomir was 53rd in the first downhill training run in Kitzbuehel on Tuesday.\nBasalt takes step toward loosening ADU restrictions\nAt their Tuesday meeting, Basalt Town Councilors unanimously passed a first reading of an amendment to town code that opens up more of Basalt to ADU construction.",
  "word_count": 671,
  "scraped_at": "2026-02-14T12:19:25.167416"
}