{
  "article_id": "5cbee2a17574",
  "url": "https://thenff.com/insurance-queens-are-champions-of-nff-tingo-federation-cup-2023/",
  "title": "Insurance , Queens are champions of NFF - TINGO Federation Cup 2023 – The NFF Official Website",
  "date": "20240307T123000Z",
  "domain": "thenff.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Imade Osarenkhoe’s strike from six yards on the dot of half time, after handball in the box by Rangers’ defender Chinemerem Ugwueze, handed Bendel Insurance this year’s NFF-TINGO Federation Cup title and a ticket to represent Nigeria in next season’s CAF Confederation Cup competition.\nThe ‘Flying Antelopes’ threw in all they could muster in an interesting encounter at the Stephen Keshi Stadium, Asaba on Wednesday, but the ‘Benin Arsenal’ were determined to hew something out of a see-saw season in which they remained unbeaten in the Nigeria Premier Football League regular season only to end up empty-handed in the Playoff Championship.\nInsurance had come close in the 16th minute when Deputy Echeta hit the ball hard and goalkeeper Detan Ogundare spilled the shot, only for the rebound to be diverted.\nA minute into the restart, Rangers’ Shedrack Asiegbu let fly from the left side, but the effort went over the bar. In the 55th minute, Insurance goalkeeper Amos Obasogie spilled a shot from Rangers’ Godwin Obaje but there was no follow-up, and in the 70th minute, Osarenkhoe’s intelligent chip from a free-kick was tipped over the sticks by Ogundare.\nIn the women’s final played earlier in the afternoon, Cup holders Bayelsa Queens retained the trophy with a 4-3 penalty shoot-out defeat of Rivers Angels after regulation time ended 0-0.\nFormer junior international goalkeeper Onyinye Okeke saved from Angels’ substitute Sofia Agyaakwa before Zainab Olapade scored to give joy to the Bayelsa fans.\nWomen’s champions Bayelsa Queens pocketed the sum of 10 million naira (Ten Million Naira Only) while Rivers Angels were five million naira (N5 Million Naira Only) richer.\nMen’s winners Bendel Insurance went home with the sum of 15 million naira (Fifteen Million Naira Only) while Rangers International got the sum of Seven Million and Five Hundred Thousand Naira Only.\nRivers Angels’ forward Adaobi Okah won the top scorer award in the women’s category with her five goals, while Lobi Stars’ Joseph Atule and Kwara United’s Kamal Samad tied for the same award in the men’s category with four goals each.",
  "word_count": 342,
  "scraped_at": "2026-02-14T12:47:25.624632"
}