{
  "article_id": "5cc26e07c129",
  "url": "https://www.nytimes.com/athletic/5971561/2024/12/06/jon-moss-interview-referee-coote-klopp/",
  "title": "Jon Moss : How to improve VAR , Coote controversy and Klopp  gamechanging  call",
  "date": "20241206T110000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jon Moss is attempting to sum up English football’s complicated relationship with video assistant referees (VAR), five years on from playing a role in their introduction.\n“VAR is like a naughty kid at school,” says the former Premier League official. “He can be really good all week. And then he’ll punch someone at playtime. ‘Oh, there he is again causing problems’. That’s what it’s like.”\nAdvertisement\nIt says much about how many controversies are currently raging within Premier League refereeing that VAR — normally the sorest point of contention among players, managers and fans — feels like one of the less thorny issues for Moss to address with The Athletic.\nThere is the toxic world of social media, where referees are regularly subject to lurid conspiracy theories; the increasingly wild behaviour of managers towards match officials and, most pressingly, David Coote, the referee currently suspended by Professional Game Match Officials Limited (PGMOL), the body responsible for elite referees in England, after serious allegations over his behaviour off the field.\nMoss, who worked as a Premier League official between 2011 and 2022, addresses all these over the course of a Zoom call with The Athletic, but VAR is an obvious starting point given he was among the referees that rolled out the system in 2019 and battled its teething problems until his retirement. He accepts it is imperfect and inconsistent, but stresses it is an improving process in the Premier League.\n“Where VAR’s got to now is a million miles from when we first started,” he adds. “I know football fans probably don’t think that but in terms of process, slickness… it’s so much better. Has it got enough followers to be really successful? Only time will tell.”\nMoss is now watching events in England from the other side of the world. As Football Australia’s head of referees since October, having left his role as the Scottish FA’s VAR manager after just 52 days, Moss has his own responsibilities in the A-League.\nThe scrutiny is not the same but their use of VAR differs. Every decision reached with the assistance of replays is explained by a mic’d-up on-field referee, whose voice is projected around the stadium to bring either boos or cheers from supporters. It was a format trialled by the Premier League during pre-season games in Spain but failed to win the necessary approval for roll-out.\nAdvertisement\nMoss and the A-League are also open to trialling Football Video Support (FVS) a modified version of VAR where managers are given two challenges during a game to contest an on-field call made by the referee. That, in theory, would make VAR less intrusive and mirror other sports, including the NBA and NFL.\nTalks have been held with FIFA in the last fortnight after the concept was trialled at the Blue Stars/FIFA Youth Cup in May and the Women’s Under-20 World Cup in September. The expansion of trials was approved by the International Football Association Board (IFAB) on Monday and Football Australia is willing to put its hand up.\n“One of the things about the A-League that I really love is that they’re willing to embrace new technology,” says Moss. “They’ll try anything. They want to make the product as good as they possibly can.\n“You always have an opinion about whether something’s a penalty or not. If you can understand the process, hear the comms, you might still have the same opinion that the referee’s made a mistake. But at least you know there’s no conspiracy, there’s nothing underhand. Having been in a crowd and listened to an explanation, the crowd loved it. I’ve asked our referees to keep it that simple. Just say what the football fan would want to know.\n“Have we got it right so far in the Premier League, for example? I don’t think we have. I don’t think we involve the fans enough and therefore people always go against it.”\nMoss, 54, smiles at the suggestion he is Australia’s version of Howard Webb, the man he called his boss at PGMOL until March. “I’m just the better looking, fatter version,” he says.\nMoss, you suspect, will not envy Webb’s current problems. Coote has been suspended from match duties since historic video footage began circulating on social media in which he called former Liverpool manager Jurgen Klopp “a German c***”.\nAdvertisement\nThe Sun newspaper subsequently ran further damaging stories that appeared to show Coote snorting white powder in a hotel room. The Football Association had already launched its own investigation into those allegations when separate claims emerged, also in The Sun, that Coote had discussed giving a yellow card to a Leeds player with a fan ahead of a Championship game in 2021. The FA is now investigating that as well, with Coote denying any claims of corruption and saying he is the subject of “false and defamatory allegations”.\nMoss was a colleague of Coote in the Premier League’s Select Group One (SG1) referees and later, after his retirement, his manager.\n“You’ve always got to be careful as a match official how you conduct yourself and who you surround yourself with,” says Moss. “It’s important to have a tight circle of friends that you trust. And then it’s about living your life appropriately to the position that you hold.\n“David is a nice guy and I always found him to be hardworking, diligent and sensible. I hope that PGMOL conduct their investigations and when it comes to it he can move on either as a referee or in some other walk of life.”\nMoss has no wish to cast judgment on Coote but knows the episode has brought reputational damage upon PGMOL.\n“What the public have to realise is that for a number of years English match officials have been held in high esteem right around the world because they’ve never been involved in match fixing or anything like that,” he says. “These people are dedicated to the profession and they work really hard.\n“Unfortunately, these stories, whether you believe them or not, will undoubtedly cause damage. Some fans already had that perception of referees and this will add fuel to the fire.\n“All the people I worked with have always had the best interest of the game. And I would hope that will continue as well.”\nAdvertisement\nThe public unravelling of Coote has done his refereeing colleagues no favours in a job already facing heightened pressures in an age of social media conspiracies. PGMOL now offers psychological support to its officials, with an acceptance the demands are building.\nGO DEEPER\nWho is David Coote, the referee under investigation for Liverpool video outburst?\nMoss found his own notoriety in 2016 when sending off England striker Jamie Vardy for diving at a time Leicester City were chasing the Premier League title. It was front-page news. “I think he still hates me to this day,” he says.\nHis last match as a professional referee, the 2022 Championship play-off final, was also controversial, with police launching an investigation into abuse directed at Moss after he did not award Huddersfield Town a penalty.\nFootball continues to ask more from its officials. “I think refereeing has always been difficult but I think it’s changed because of social media,” he says. “Undoubtedly the effects are 24/7. It has just made it incredibly difficult.\n“I think people just expect more and more from referees and players. People can now sit and write anything they want about anyone and obviously that impacts younger referees. With all the intensity and scrutiny and with ex-referees just having a go about everything, it’s not a nice place to be sometimes.”\nMoss, along with experienced colleagues Mike Dean and Martin Atkinson, stepped down from officiating Premier League games at the end of the 2021-22 season.\nAmong all the red cards he showed along the way, one was for James Milner, who Moss had once taught as a youngster at Westbrook Lane Primary School in Leeds in the mid-1990s. Taking charge of the 2015 FA Cup final between Arsenal and Aston Villa stood as a career high.\nTwo of Moss’ four children have now embarked on their own refereeing careers. Youngest son Noah, 16, is overseeing grassroots games close to the family home in West Yorkshire, while 22-year-old Joe already has a PGMOL contract as part of their development group. Moss has done nothing to steer either away from the career.\nAdvertisement\n“I’ve had a great life thanks to football and refereeing,” he says. “So I think it’s a wonderful thing for someone to do. I really do. But undoubtedly your personality changes over the years.\n“There’s no worse feeling than coming away from a game knowing you’ve made an error. I don’t think you realise what impact it has on your family. You’ll get loads of hassle, you’re on the front page of every newspaper. It can be very tough on you and your family.\n“You have this cycle as a referee. Let’s say it’s a Saturday game. Saturday you make a mistake. Sunday you’re still in denial. And Monday you start coming out of it, acknowledging that, yeah, maybe you haven’t got that right.\n“And then Tuesday you’re open to coaching. Sometimes you can be told you’ve got something right on a Saturday night. And by Monday, that’s changed and you’ve got it wrong. Because the whole world’s had a look at it from 25 different angles.\n“Now I don’t judge referees on mistakes they make, it’s much more than that, it’s about how they are, how they conduct themselves. Sometimes you see more of the referee when they make a mistake than you do when things are going well.”\nMoss was supposed to remain with PGMOL in his post-refereeing years. In a position as select group director, he was responsible for managing Premier League referees alongside Webb through the 2022-23 season and much of the 2023-24 campaign until he stepped down in March.\n“I think it was probably too soon after I’d just finished,” says Moss. “All my colleagues were my mates and then I was having to manage them. I found it challenging. Because you lost a lot of friends overnight. That’s the reality of it. It’s a different relationship, having to tell someone they’ve not got a game at the weekend.”\nMoss, though, was there long enough to help drive through changes. As part of the Elite Referee Development Plan, support staff numbers were increased to raise standards. Included in that was a recruitment drive for more video analysts, who supply each referee with a tactical breakdown of how every team plays to shape how best to position themselves.\nAnd the person Moss thanks for the innovation? PGMOL’s old adversary, Klopp.\nIt was after the opening day of the 2022-23 season, when Andy Madley had overseen a 2-2 draw between Fulham and Liverpool. The game had been mercifully uncontroversial and Moss was taking a walk near his home when a phone number he didn’t recognise flashed up on his mobile.\nAdvertisement\n“I picked it up, and there was that undeniable voice that (Klopp) has,” he recalls. “He said he wanted to talk about the game on Saturday because he felt (Roberto) Firmino had barely touched the ball. He said, ‘Your referee kept getting in the way every time he was about to receive the ball. Every time he passed it, Andy Madley appeared like a ghost and slid into the pass’.\n“Andy was in the position that I expected him to be but that was no good for this style of play. That was a game changer for me overnight. So we sent it to the referee. We sent it to all the people that were observing the referees.\n“And that’s why, in that moment, we decided we needed analysts. Because the way we referee had to change. And we needed to have that kind of information.”\nEvery referee now receives a pre-match analysis pack that highlights how a team will set up for corners and free kicks, and how individual players have previously collected cautions. It is another layer of preparation for a full-time collection of 20 SG1 officials headed up by the experience of Anthony Taylor and Michael Oliver.\n“When you get on the Premier League, that’s just the beginning,” says Moss. “Now you’ve got to be even better than you are when you get there. I don’t think you realise how much you enjoy it until it’s over.\n“What I say to the referees when they’re whinging is, ‘Just enjoy each game because it’s soon over’. You definitely miss the buzz.”\nBut perhaps not the scrutiny of the Premier League. A job that has always had its challenges now has another layer of difficulty in a game where the pace of play quickens. Moss knows plenty will disagree but he maintains the standards are as high as they have ever been.\n“This is a really talented group of referees,” he says. “They can hold their own with the best in the world but unfortunately every time they make a mistake it’s magnified. They’ll have their difficult days but most weekends they get 98 per cent of the decisions right.”\n(Top photos: Getty Images; design: Eamonn Dalton)",
  "word_count": 2203,
  "scraped_at": "2026-02-14T13:44:13.798130"
}