{
  "article_id": "5cdf7d5bb9e7",
  "url": "https://www.camdencourier.com.au/story/9172906/jets-coach-hopeful-for-return-of-keys-players-in-alw-finals-bid/",
  "title": "Jets coach hopeful for return of keys players in ALW finals bid | Camden Haven Courier",
  "date": "20260211T051500Z",
  "domain": "camdencourier.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "JETS coach Stephen Hoyle hopes to have both goalkeeper Anna Leat and captain Cassidy Davis available for selection at some stage on the run home with A-League Women's finals still in sight.\nSubscribe now for unlimited access.\nor signup to continue reading\nKey duo Leat (concussion) and Davis (heel) have been sidelined for Newcastle, who sit ninth on the ALW ladder but only four points outside the top six with six regular-round fixtures remaining.\nThe Jets, trying to snap a three-match losing streak, visit Western Sydney Wanderers at CommBank Stadium on Friday (4:50pm) and welcome Perth to No.2 Sportsground on February 21 before breaking for the upcoming Australia-hosted Women's Asian Cup.\nLeat, a New Zealand international and former Women's Super League player with both West Ham and Aston Villa, landed in the Hunter this season and has started on 12 occasions but missed the last two outings with teenager Georgia Ritchie called up to don the gloves.\n\"Anna should hopefully be back soon,\" Hoyle said after training at Glendale on Wednesday morning.\n\"She got a knock on the shoulder, and from that she got a bit of the concussion stuff with her head so hopefully she'll get out of that protocol and be back soon.\n\"On that I thought Georgia, after a nervy first game for her which is tough, had a really good second game.\n\"As a 17-year-old I was really happy for her and the calmness she showed and what she put forward.\n\"But we understand how important Anna is and the level that Anna is as well.\"\nDavis, a club veteran who holds an A-Leagues record of playing 132 consecutive games, has struggled with heel issues across 2025-2026.\n\"Cass is a warrior for sure and we all know how hard she works to try and play football games, the record she had before is ridiculous,\" Hoyle said.\n\"She's been hurting herself, pushing herself too far for what she can do for this club and wanting to play and wanting to be on the grass every day.\n\"So we've had some conversations with her and now she's trying to get the heels right.\n\"I don't really have a timeframe on that for her but I want her to get the care that she deserves.\n\"A player like her, as she gets towards the end of her career, she needs to go out with an absolute bang and not peter off because she's struggling and she's hurt.\n\"We want to get Cass back to 100 percent with her heels and see the best of her in a Newcastle shirt.\"\nHoyle added that both Claire Adams and Zoe Karipidis were both back training this week and hopefully \"available for selection\" after missing last weekend's 2-1 loss to Melbourne Victory with \"niggles\".\nJets striker Kelli Brown said on Wednesday she has one eye on World Cup qualifiers with New Zealand later this month while UK-born Emma Bates revealed she supports English club Liverpool.",
  "word_count": 492,
  "scraped_at": "2026-02-14T12:38:01.083046"
}