{
  "article_id": "5ce901b104fc",
  "url": "https://www.armidaleexpress.com.au/story/8472154/senator-ross-cadells-transparent-gift-disclosure-log/?cs=9676",
  "title": "Senator Ross Cadell Transparent Gift Disclosure Log | The Armidale Express",
  "date": "20231229T004500Z",
  "domain": "armidaleexpress.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Newcastle-based Nationals Senator Ross Cadell prides himself on having the most transparent disclosure log in parliament.\nSubscribe now for unlimited access.\nor signup to continue reading\nFederal politicians aren't required to register any gifts under $300, but that doesn't stop Senator Cadell from registering everything, whether it be a kilogram of pudding or an antihistamine tablet.\nSenator Cadell's obsessive attention to detail - mixed with a good dose of tongue-in-cheek humour - was started by a mysterious box of biscuits and a challenge by the organisation Open Politics for politicians to be more transparent.\nThe first entry in his disclosure reads; \"10 Savoury biscuits in a blue cardboard box addressed to Senator Cadell and delivered to APH suite on 8/11/22, but with no card or indication who they were from\".\n\"The mystery bickies kicked it all off, I still have no idea where they came from,\" Senator Cadell said.\n\"Open Politics is always having a go at everyone, so I thought 'what the hell, we get lots of weird stuff so I may as be as descriptive as possible'.\"\nSenator Cadell has catalogued everything, down to the last teabag, although his gift register notes the teabags are often \"distributed by me to staff as I prefer a strong PG Tips or English breakfast over peppermint\".\n\"Any time we have a big sitting week in Parliament, a budget or estimates sitting, we get little survival packs with biscuits and tea - but it's is always peppermint tea, it's no good,\" he said.\nLiberal MP Julian Leeser clocked a mention for gifting a shortbread biscuit with green icing in the shape of Australia (\"approximately 100mm wide and 80mm tall\"), alongside a card outlining his support for the Voice referendum.\nAnother politician to feature is independent Senator and former rugby union star David Pocock, who gave his colleagues Wallaby scarves in the build up to the Rugby Union World Cup.\nHowever, Senator Cadell's register notes the scarf had \"no official licensing markings, brands or tags; potentially unauthorised knock off\".\n\"I joked that they were discount Chinese knock offs, because there's no Wallabies licencing on it, and the gold and green colours look a bit off,\" Senator Cadell laughed.\n\"That said, if Senator Pocock asks me to withdraw, I'll do so without hesitation then run away. He's got the biggest hands I've ever seen.\"\nAt times Senator Cadell's register reads more like a diary than a disclosure log.\n\"Two tickets and hospitality from the National Rugby League to see the mighty Newcastle Knights defeat the Canberra Raiders in an overtime cliffhanger at McDonald Jones Stadium,\" the document states.\n\"I took my father, I ate one single prawn (too nervous to eat) and then had two party pies when we were in the lead in the second half, and had seven Pepsi Max's throughout. Value unknown.\n\"Lunch at the Chevron worker facilities at Butler park (which I was unable to eat as I was feeling ill); two x Nurofen Tablets (which did not help); one x packet of Claratyne (which did); one x Chevron Cap. Cost unknown.\"\nThe Nationals Senator has also been gifted an extensive reading list and he's \"hooked into all the good stuff\", with war history, biographies and short essays all making the cut.\n\"In Parliament you spend a lot of time reading briefs, which can be kind of boring, so it's good to fill your mind with other stuff,\" he said.\nOf course it must be remembered Senator Cadell is a politician, and as such never misses an opportunity to take a sneaky jab at his opponents.\nVeiled criticism of the Port Stephens' wind farm and Labor's Murray-Darling Basin policies can be found hidden among the list of gifts.\n\"I had a poke in case other people were watching ... when you get a chance take a crack at government policy through the gift register, why not?\" Senator Cadell chuckled.\nExcerpts from Senator Ross Cadell's disclosure log\n- The National Waste & Recycling Industry Council gifted three Mini Wheelie Bin Desktop storage Pen/Pencil Organiser's, being approximately 1:10 scale size of a real wheelie bin at 120mm high and 80mm wide the storage wheelie bins have red, green and yellow lids and are to celebrate National Recycling Week. Cost unknown.\n- Joe Prevedello from the Australian Forest Products Association has gifted an embroidered baseball cap and lapel pin to recognise and promote National Forestry Day.\n- Wooden Christmas decoration, 2 pieces that slide together to make one decoration that's aprox 10cm by 10cm from Australian Forest Products Association. Value unknown.\n- The Australiasian Railway Association gifted two Rail Safety Week lapel pins, in striking colours symbolic of the key safety message \"Stand Behind the Yellow Line\" to promote Rail Safety Week. Cost unknown\n- Officially licensed Football Australia dynamic jacquard knit Green and Gold \"Matildas Volley Scarf\" Manufactured by Burley Sekem and provided by Football Australia at the display of the FIFA Women's World Cup 2023 trophy at Parliament House. Recommended retail price $29.99.\n- 750ml bottle of Karabakh 2014 Cabernet Sauvignon from the Goyol Winery which at 150 years old is the oldest and most historical winery in the Caucasus region of Azerbaijan, presented personally by Mr. Vagif Jafarov, Head of Mission of the Azerbaijan Embassy on behalf of the Ministry of Foreign Affairs of the Republic of Azerbaijan. Cost unknown.\n- \"Signs at the Bay\" proudly gifted my office an expertly screen-printed white XL T-Shirt bearing the message \"NO COASTAL WIND FARMS - PORT STEPHENS\" with a striking logo of a whale's tale, the shirt is one of a range of merchandise and signage they produce to protest the Governments pursuit of an off shore wind factory off the beautiful and delicate coast of Port Stephens, NSW. The shirt is proudly displayed in the window of my Parliamentary office in Parliament House, Canberra. Cost unknown\n- The Australian Forest Products Association has gifted a Christmas ornament that truly represents the quality and diversity of Australia's forest products sector through its design and makeup. In the shape of a traditional snowflake the size of the ornament is 100mm high and wide. One half is Australian hardwood and the other half Australian softwood and like all Australian timber products the ornament is storing carbon and helps save the planet. Cost unknown\n- In recognition of International Tea Day, Matthew Cossey, CEO of Croplife Australia has provided an afternoon tea pack containing 10 tea bags containing 15 grams of Twinings pure green tea, 10 tea bags containing 20 grams of Twinings Australian Afternoon tea, 10 tea bags containing 20 grams of Twinings Pure Peppermint, a 100 gram bag of Byron Bay Triple Choc Cookies and a 100 gram bag of Byron Bay Macadamia shortbread bites.\n- Nerada Organics 30 gram box containing 20 Pure Peppermint Herbal Infusion tagged tea bags, gifted by Australian Organic Limited for Organic Awareness Month to learn more and discuss organic and the opportunities that exist for the organic sector in Australia. Distributed by me to staff as I prefer a strong PG Tips or English Breakfast over Peppermint. Recommended retail price $3.60.\n- The Australian Forest Products Association has gifted a Christmas ornament that truly represents the quality and diversity of Australia's forest products sector through its design and makeup. In the shape of a traditional snowflake the size of the ornament is 100mm high and wide. One half is Australian hardwood and the other half Australian softwood and like all Australian timber products the ornament is storing carbon and helps save the planet. Cost unknown\n- The Australian Dental Association, whilst appearing at a select committee, gifted all senators a TelScope Telehealth System, which combines a Medical Device & App to Capture Intraoral Telehealth Images and Videos, it provides intraoral illumination and retraction and depression of the tongue & cheeks, it then Captures medical grade quality images & videos inside the mouth for instant telehealth or teledentistry transmission using the included app to a doctor, dentist, or specialist. Cost unknown",
  "word_count": 1333,
  "scraped_at": "2026-02-14T12:30:53.554003"
}