{
  "article_id": "5cfb69a05ced",
  "url": "https://fansided.com/posts/uswnt-3-up-and-coming-stars-at-2024-paris-olympics",
  "title": "3 up - and - coming Team united states women soccer stars at the 2024 Paris Olympics",
  "date": "20240720T174500Z",
  "domain": "fansided.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The USWNT's future generation has arrived. It's not on its way. We're looking at it.\nGone with the old, in with the new. That was a key theme for Emma Hayes as she named eight players under the age of 26 to the roster for the Paris Olympics. With youth brings excitement as this group of players looks for a bounce back from last summer under new leadership.\nThere were only two players under 26 at the 2020 Olympics under the guidance of Vlatko Andonovski. The page has turned. Time to click in those seatbelts - this group has a young core that is more than ready to bring this team back to life.\nHere are our three rising stars for the USWNT you need to keep an eye on at the Olympics this summer. (Note: Our criteria for 'up-and-coming': have to be 23 or younger and below the 45 cap threshold.)\n3 up-and-coming USWNT stars at the 2024 Paris Olympics\n3. Jenna Nighswonger\nJenna Nighswonger, a native of Huntington Beach, California, has been truly exceptional since being drafted fourth overall in the 2023 NWSL Draft. Similar to the reliability of Grandma's homemade cookies, she always delivers. The former Florida State standout has consistently excelled in a position that once was relatively unfamiliar to her from the beginning of her career with NJ/NY Gotham FC.\nThe 2023 NWSL Rookie of the Year converted from a traditional central midfielder to a left-back just last season.\n\"I really hated left back at first,\" said Nighswonger on 'The Women's Game' podcast. \"Then I just learned to embrace it and go with it. Now, I really truly love it.\"\nThe results in her new position with Gotham granted her a look on the national stage. Ever since that first call-up in November 2023, Nighswonger has made quite the impression. Those attacking instincts have not gone away. That is what makes her such a dynamite wide defender. Her willingness to bomb forward and execute that final cross is going to be incredibly useful at the Olympics.\nThe 2022 ACC women's soccer tournament MVP started in her first match for the Stars and Stripes a little over a month after that first call. The USWNT's No. 13 later netted her first goal in the 2024 CONCACAF W Gold Cup, a cool penalty to put the United States up by four over the Dominican Republic.\nHayes was cautious in the final match before the team jetted off to France, sitting Nighswonger due to load management. It was likely a good call by the former Chelsea leader with the defender playing the second minutes on her club team this season. She'll likely be the starting left back against Zambia, an opportunity she thoroughly deserves based on the immediate impact she has made donning her country's colors.\n2. Jaedyn Shaw\nThe versatile San Diego Wave FC attacker Jaedyn Shaw is without hesitation a superstar in the making. Just look at her impact in such little time with the national team. Don't be fooled by the fact that she is the youngster player on the roster by over a year. Shaw, who may be the second-best number 10 on this team, recorded seven goals and one assist in her first 14 appearances for the USWNT, including five goals in her first five starts.\nEven though Hayes didn't show much trust in Shaw in the send-off matches, her ability to flex into a winger or a false nine should allow her to see the pitch as an impact substitute when the time is right. There are few things Shaw can't do on the ball. Threading the needle with a through ball? Of course, she can do that. Driving centrally for a strike with either foot? All day.\nOn a club team that has not been very productive offensive this season, SD's No. 11 is tied for the team lead in goals with three. The beginning of her career with the Stars and Stripes has been one many dream of. The results we've seen in 2024 from Shaw don't lie. The Olympics is her time to show world football what the coming years will look like.\n1. Trinity Rodman\nThis is the summer of Trinity Rodman. With a starting role on one of the biggest stages under the guidance of a brilliant mind, her stardom could hit a whole new level. We could even make an argument that she is the USWNT's most important player as it searches for ways to find the back of the net.\nThe 22-year-old Washington Spirit winger has been brilliant in the NWSL this season, showing off just how deep her bag of tricks really is in the final third. If you didn't already know - that bag is deep just like one of those large-sized duffle bags you'd take on vacation. Maybe even deeper. The California native is simply a walking highlight reel. You never know what kind of magic she is going to pull next. That unpredictability could be crucial in breaking the struggles in front of the net.\nIn the draw to Costa Rica, Rodman was awarded the 'Michelob Ultra Superior Woman of the Match' by U.S. Soccer for her play down the right flank. She is tied with the dynamic Rose Lavelle for the team lead on the USWNT in assists in 2024. In club play, Rodman is one of five players with at least nine goal involvements in more than 1,200 minutes.\nAfter the World Cup, Rodman explained that she and her teammates \"weren’t being as true to themselves” as they should have. The youngster has seen what this type of stage entails. That's valuable. While she wasn't the catalyst many thought she'd be in Australia and New Zealand, that experience of failure may act as fuel for a special showing in France.\nEmma Hayes and company begin their journey for gold on July 25 in Nice against Zambia. The match will be broadcast in the States on USA Network.",
  "word_count": 998,
  "scraped_at": "2026-02-14T12:57:54.500881"
}