{
  "article_id": "5d004c1bcde7",
  "url": "https://www.juneesoutherncross.com.au/story/8210199/sam-kerr-wins-again-but-wont-take-it-for-granted/?cs=6417",
  "title": "Sam Kerr wins again - but wont take it for granted",
  "date": "20230525T204500Z",
  "domain": "juneesoutherncross.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sam Kerr is one of sport's serial winners - but Australia's record-breaking soccer star never takes it for granted.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Matildas captain received yet another accolade on Thursday in London, becoming the first woman to collect England's Football Writers' Association's prestigious Footballer of the Year trophy in two consecutive seasons.\nBut picking up the award just a couple of days before she aims to shoot Chelsea to a fourth consecutive Women's Super League title in England, thus completing another FA Cup-WSL double, Kerr explained how hard she felt it was to stay at the top.\n\"I think to some people it might look easy, but every year it gets harder and harder to win the league,\" said Kerr, whose team need to beat bottom-placed Reading on the final day on Saturday to seal the title again, although a draw will probably suffice.\n\"Anyone that's involved in football knows how hard it is to come back year after year and to stay at the top. So we're doing everything to win on Saturday.\"\nIt's such a rare feat to win the FWA Footballer of the Year trophy in successive years that no woman has previously achieved it in the award's short history while, among the men, Thierry Henry and Cristiano Ronaldo are the only two to have done so in three quarters of a century.\nKerr has had another triumphant season, not topping the WSL goalscoring charts for once but still netting 28 goals in all competitions, including some huge ones, not least the winner in Chelsea's 1-0 FA Cup final triumph over Manchester United earlier in the month.\nOf another breakthrough year for her and the women's game in England, where she's become a star, Kerr said: \"It's amazing. It's something that I'm very proud of.\n\"Off the back of the Euros, women's football has grown a lot. Walking down the street, the crowds are bigger, everything's just increased over the last year.\"\nNot only Kerr but also men's Footballer of the Year Erling Haaland picked up their prizes at a central London hotel at a gala dinner to mark the 75th anniversary of the award that was first won by Sir Stanley Matthews in 1948.\nManchester City's Haaland, who's scored 52 goals in 51 games ahead of Sunday's Premier League finale at Brentford, is, like Kerr, still looking for more silverware, with the English champions in line for a treble of Premier League, FA Cup and Champions League.\n\"I feel good, it's a special moment,\" he told the FWA. \"I expected to do good things but, to do this, I didn't expect.\"\nHe has broken the record for the most Premier League goals in a season with 36 as Manchester City wrapped up a third straight title with three games to spare, having trailed Arsenal by eight points at one stage.\nWith PA\nAustralian Associated Press",
  "word_count": 487,
  "scraped_at": "2026-02-14T12:21:48.368295"
}