{
  "article_id": "5d06af94c967",
  "url": "https://www.irishecho.com/2023/11/katie-in-top-form-for-fight",
  "title": "Katie  in top form  for fight",
  "date": "20231121T233000Z",
  "domain": "irishecho.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Katie Taylor she never considered retiring after her loss to Chantelle Cameron in Dublin back in May and claims that she has a lot of fights left in her. The 37-year-old Bray-born boxer says she wasn’t at her best entering the ring for her May 20 homecoming at the Three Arena with Cameron comfortably thwarting her ambition to be a two-weight world champion. The rematch takes place on Saturday at the same venue and will again be a 140lb super lightweight bout.\nSpeaking last week Taylor said it is a must-win fight for her but also stressed that she is in a much better place now than she was in May, although she would not go into detail on why that is the case.\nTaylor said: ‘‘The preparation has been a lot different. I feel a lot better going into this fight. I feel in top form right now. I don't want to really expand on it, I just didn’t feel myself going into the last fight. It was just a flat performance. I was good enough to step into the ring on the night, I just fell that bit short. Mentally and physically I feel a lot better for this one, that’s obviously a big deal. I'm not thinking that this fight is going to be my last fight and I’m not thinking of any other outcome other than a win. So any other outcome for me isn't even entering my mind. But I will obviously retire at the right time, when I feel it's right. Obviously, I can’t do this forever but retirement never came into my mindset the last time.’’\nKatie says she is really looking forward to the fight in Dublin’s docklands on Saturday night, saying ‘‘I am definitely looking forward to just getting revenge and putting things right. The disappointing part was the actual loss itself and that’s not how I wanted my homecoming to go. A lot of people, I think, are doubting me as well. I love these fights when people are actually doubting me. I think this could be one of the greatest nights of my career.’’\nLEINSTER HOST\nMUNSTER IN URC\nWhen it comes to interprovincial rugby Leinster has held the upper hand over Munster in recent seasons. However, last May the team in red had a rare win when they beat Leinster by one point in the semi-final of the URC at the Aviva. Jack Crowley kicked a last-minute drop goal to send Munster into the URC final where they beat the Stormers in Cape Town. Now the provinces meet again for the first time this season on Saturday when Munster travel to the Aviva. Coach Graham Rowntree has not been happy with Munster’s recent performances, but somehow they seem to be able to raise their game when they see those blue Leinster jerseys.\nMunster have confirmed the signing of Irish-qualified tight head prop Oli Jager on a long-term deal until the summer of 2027. Jager, who was born in London but grew up in Kildare, built a strong reputation with the Crusaders in New Zealand and will be eligible to play Munster from December. Hooker Eoghan Clarke and back-three player Colm Hogan are also returning to the province on short-term deals.\nLeinster coach Leo Cullen has all of his World Cup players back, but Irish prop Cian Healy, who missed the World Cup through injury, is now injured again.\nUlster are away to Glasgow on Saturday, while Connacht are in Pretoria to play The Bulls without their World Cup players, Bundee Aki, who has a hamstring problem and Mack Hansen, who has an ankle problem. Irish coach Andy Farrell will be watching for young players to impress in the URC games until the Heineken Champions Cup gets under way on Dec. 9, when the standards will ratch up a notch or two.\nNEW HOME FOR\nWEXFORD FC\nWexford FC are planning to move from their current home in Ferrycarrig Park to a new, custom-built stadium in Wexford town which will have a capacity for up to 6,000 supporters. The potential move was confirmed recently by Wexford County Council CEO Tom Enright, who said that a League of Ireland stadium will form part of the council’s ambitious plans to house a university campus, two new schools, housing and other sporting facilities within a land bank in excess of 100 acres stretching from Killeens across to Whiterock Hill. Wexford County Council also plans to provide land for Wexford GAA to install a new full-size 4G pitch. The move should help Wexford attract much more support, as the location of Ferrycarrig Park, which is located down a side road off the N11, did nothing to bolster attendances.\nDUBLIN GAA GET\nNEW SPONSOR\nStaycity are the new sponsors of Dublin GAA. The short-term apartment rental company has agreed a five-year deal to sponsor Dublin’s football, hurling, ladies football and camogie teams. The deal is believed to be worth in excess of €1.1 million per year and coincides with the launch of a new Dublin jersey for the 2024 season. Staycity have taken over the sponsorship from AIG whose 10-year association with Dublin ended recently.\nSCHMIDT STEPS DOWN\nFormer Irish Rugby head coach Joe Schmidt is stepping down from his role as director of rugby and high performance with World Rugby at the end of the year. The New Zealander took up the position in October 2020 but has decided to leave to spend more time with his family. Schmidt, who led Ireland to three Six Nations titles over his six-year tenure, moved to New Zealand after his time in charge of Ireland came to an end in 2019. The 55-year-old will remain on as a member of the high-performance committee and laws review group.\nA statement from World Rugby, who are based in Dublin, said: ‘‘Joe Schmidt has decided that he will continue to reside in New Zealand rather than relocate to Ireland in order to ensure the best possible work-life balance for him and his family.’’\nMANAGERS WANT\nMAOR FOIRNE BACK\nGAA inter-county managers are expected to ramp up their campaign for the return of the Maor Foirne ahead of next year’s provincial championships. Croke Park will again be lobbied strongly by managers to re-introduce the running selector, a role which was discontinued in 2021. GAA officials were approached earlier this year about bringing back the Maor Foirne on a limited basis after the Central Competitions Control Committee received correspondence from several managers. However, Central Council chose not to endorse the proposal, which through the fourth official would have seen a selector permitted onto the field a certain number of times to pass on messages from management. Central Council were persuaded to retain the status quo by the standing playing rules committee, who at Congress two years ago successfully recommended the role be disbanded due to the excessive number of pitch incursions and the impact they were having on games. But as the playing rules body is set to change in February under new GAA president Jarlath Burns there is renewed belief that a compromise can be sought to improve in-match communications between the sideline and players.\nDUPONT FOREGOES SIX\nCAMPAIGN FOR SEVENS\nAntoine Dupont, the French Rugby captain, will sit out next year’s Six Nations campaign so that he can prepare for rugby sevens at the 2024 Olympic Games in Paris. The French rugby federation confirmed last week that Dupont, one of the most exciting players in rugby union, will miss the 15-a-side competition, being held between Feb. 2 and March 16 next year. France’s first game is against Ireland in Paris on Feb. 2. Instead, the 27-year-old will play for his country on the World Rugby seven-a-side circuit, now known as SVNS. The scrumhalf, who was injured in the early round of the recent World Cup, but returned for the quarter-final defeat to South Africa, will join up with the national sevens squad in January. Dupont will then play in SVNS events in Vancouver, Canada in February and in Los Angeles at the start of March.\nCAT WALSH\nQUITS AT 31\nKilkenny hurler Padraig Walsh retired from intercounty action last week, without any fanfare. The 31-year-old defender said that he was retiring and that he would not be issuing any statement. He has been on the Kilkenny senior team since 2014 and won two All-Ireland senior hurling medals with the Cats. Padraig said his decision was based on ‘‘finding it harder to recover’’ from the demands of the game. The Tullaroan club member comes from a family steeped in hurling. His grandfather Paddy Grace won two All-Irelands with the county while his brother Tommy is considered to be one of the greatest ever defenders in the game. Padraig’s sister Grace is also a gifted player, who is still playing for the Kilkenny senior camogie team.\nO’BYRNE REVERTS\nTO KNOCKOUT\nDates have been agreed for the 2024 versions of Leinster’s secondary cup competitions, the O’Byrne Cup and Walsh Cup. Football’s O’Byrne Cup reverts to a knockout competition after a number of counties withdrew from playing out the round-robin competition earlier this year. Counties beaten in their first game will have another game in a new Shield competition. The Walsh Cup continues to be played on a round-robin format with three groups of three. Both Leinster pre-season competitions get underway in the first week of January.",
  "word_count": 1564,
  "scraped_at": "2026-02-14T12:40:36.970932"
}