{
  "article_id": "5d38f48a8129",
  "url": "https://www.theguardian.com/world/2025/mar/17/monday-briefing-is-rodrigo-dutertes-arrest-a-sign-of-the-iccs-strength-or-its-limitations",
  "title": "Monday briefing : Is Rodrigo Duterte arrest a sign of the ICC strength or its limitations ? | Rodrigo Duterte",
  "date": "20250317T071500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning.\nLast Tuesday, chaos erupted at Manila’s main airport as authorities arrested the Philippines’ 79-year-old former president Rodrigo Duterte, who had arrived from Hong Kong. An arrest warrant issued in secret by the international criminal court (ICC) accused him of crimes against humanity for his alleged involvement in killings during his brutal “war on drugs”.\nDuring a tense 12-hour standoff, Duterte told officers: “You have to kill me to bring me to The Hague.” But by the end of it, he was on a plane bound for the Netherlands. Seemingly on board that flight, Duterte filmed a video where he said he would accept responsibility for the “war on drugs … Whatever happened in the past, I will be the front of our law enforcement and the military. I said this already, that I will protect you, and I will be responsible for everything,” he said. His family has claimed he was “kidnapped”.\nOn Friday, a judge set 23 September as the date of a pre-trial hearing to establish whether or not the prosecution’s evidence is strong enough to send the case to trial. If a trial does go ahead, which could take years to complete, and he is eventually convicted, Duterte faces a maximum sentence of life imprisonment.\nOnly a few years ago, bringing Duterte to justice seemed a distant prospect. I spoke with the Guardian’s investigations correspondent Harry Davies about how Duterte ended up on that plane, what this arrest means for the ICC, and what happens next. That’s right after the headlines.\nFive big stories\n-\nBenefits | Keir Starmer is to defy growing anger by driving through welfare cuts for some of the UK’s most severely disabled people, with an overhaul that could see more than 600,000 benefit claimants lose out on an average of £675 a month.\n-\nUkraine | Donald Trump has said he plans to discuss ending the war in Ukraine with Vladimir Putin on Tuesday and that negotiators have already discussed “dividing up certain assets”. “We will be talking about land. We will be talking about power plants,” Trump said, when asked about concessions.\n-\nSpace | A pair of US astronauts stuck for more than nine months on the International Space Station will be returned to Earth on Tuesday evening, Nasa has said. Barry “Butch” Wilmore and Suni Williams are to be transported home with another American astronaut and a Russian cosmonaut after a SpaceX Crew Dragon craft arrived at the ISS early on Sunday.\n-\nBusiness | Buy-to-let has become the largest single type of business in the UK – nearly four times as prevalent as fast food takeaways or hairdressers.\n-\nHealthcare | The health secretary, Wes Streeting, has said he believes there is an “overdiagnosis” of some mental health conditions as well as “too many people being written off” – factors he said were key to the government’s welfare measures.\nIn depth: ‘This helps make the court and its mission feel less theoretical’\nDuterte rose to popularity with his dramatic and violent pledges to stamp out drug use and crime. During a campaign speech in 2016, he told a crowd: “All of you who are into drugs, you sons of bitches, I will really kill you … I have no patience, I have no middle ground.”\nThe ICC estimates that tens of thousands of people were killed in connection with Duterte’s anti-drugs campaign. The primary victims of his violent policy were poor men living in urban areas, while innocent bystanders were dismissed as “collateral damage”. There was no mistaking his goals and the means through which he was willing to get there. A few months after taking office in 2016, Duterte likened himself to Hitler, using the Holocaust as an analogy for his crackdown, declaring that he would be happy to slaughter millions of drug addicts.\nDespite the numerous allegations against him, the ICC’s case remains relatively narrow. It holds Duterte criminally responsible for the murders of at least 43 people between 2011 and 2019 linked to his war on drugs.\nDuterte’s legacy\nBefore becoming president, Duterte served as deputy mayor and then mayor of Davao, a city island, across about 20 years. As Kate Lamb highlights in her comprehensive profile of the former president, it was in Davao during the 1980s that the earliest version of Duterte’s war on drugs took shape: “Dead bodies regularly turned up on the streets.” Last year, Duterte admitted that he had a “death squad” to crack down on crime during his time as mayor.\nHis promise to replicate Davao’s brutal anti-drug crackdown on a national scale propelled him to the presidency in 2016. Yet, despite his bold claims, at the time of his election Davao still had the highest murder rate in the country and the second-highest number of rapes, according to national police data.\nOver the six years after his election, up to 30,000 people are estimated to have been killed, including innocent bystanders, in what Human Rights Watch described as a “campaign of extrajudicial execution in impoverished areas of Manila and other urban centres”. Officers were granted immunity from prosecution for deaths occurring in their custody, and victims’ bodies were often discarded in rivers, grasslands, and rubbish dumps.\nWhy now?\nDespite widespread condemnation of Duterte’s violent authoritarian crackdowns, his arrest was triggered by internal political squabbles. The former president had expected protection from his successor, Ferdinand Marcos Jr, who initially pledged to shield him from international scrutiny. Marcos, the son of former dictator Ferdinand E Marcos, won the presidency in a landslide with Duterte’s daughter, Sara Duterte, as his vice-president.\nTheir fragile alliance, widely seen as a marriage of convenience, collapsed in spectacular fashion. Sara Duterte declared she wanted to “cut off his head” last year and even threatened to exhume his father’s body and throw it into the ocean. In February, allies of Marcos impeached her. The two political dynasties have since been at war in the lead-up to the country’s midterm elections. As their feud escalated, Marcos’s once defiant stance on the ICC – insisting it had no jurisdiction – began to shift. Eventually, he stated that the Philippines would cooperate with any arrest warrant issued through Interpol.\nPressures facing the ICC\nWhile the recent developments may appear swift, the case against Duterte has been meticulously constructed over seven years. In 2018, the ICC initiated a preliminary inquiry into allegations of crimes against humanity committed by Duterte. This escalated to a full criminal investigation in 2021. In response, Duterte withdrew the Philippines from the ICC.\nHis arrest holds symbolic significance for the embattled court because it “has been able to demonstrate that it can continue its work and fulfil its mandate while it is under significant pressure from various directions”, Harry says. Donald Trump has imposed aggressive economic sanctions on the ICC and travel bans on its staff and the chief prosecutor, Karim Khan, is facing an investigation into allegations of sexual misconduct, which he denies.\nKhan, despite issuing high-profile arrest warrants against Benjamin Netanyahu, Vladimir Putin, and the Taliban’s supreme leader, Hibatullah Akhundzada, has so far struggled to secure their arrests. There is pressure on Khan to deliver – and the Duterte case may help. However, Harry adds that it is important to remember “this process began under his predecessor and there is a team of people who’ve been working on this for years, so this is not a case of a singular victory for him – it’s not as straightforward or simple as that”.\nThe significance of Duterte’s arrest\nFor the victims of Duterte’s actions, this is a significant moment. The former president’s brazen admissions of various crimes fostered the impression that he was untouchable – but now, he sits in The Hague, awaiting trial.\n“This also helps make the court and its mission feel less theoretical,” Harry adds. “Within days of securing the arrest warrant it acted effectively and quickly in a situation where there are a great many alleged victims, where the atrocity crimes are apparent, and I think that certainly has some symbolic value in this present moment.”\nDuterte’s arrest serves as a warning to other leaders: their fortunes can change and they too could find themselves on a plane to The Hague. But this is a double-edged sword, as it also underscores the ICC’s weaknesses – justice in this case hinged on the political will of an opposition leader seizing an opportunity to take down a rival.\nThis reflects a broader issue for the ICC. Arrest warrants for figures like Putin or Netanyahu may signal the court’s resolve, but they also highlight its limitations and impotence – there is no chance of either leader being detained in the near future. Still, Duterte’s arrest is a rare moment of respite for the court during an “acute and awkward moment”, Harry says. “It’s a much-needed win for the court at the moment, but this arrest is only the first step in securing a conviction, so this is more of a provisional victory. Cases can and have fallen apart before they get to a full trial.”\nWhat else we’ve been reading\n-\nJohn Harris writes beautifully about how he bonded with his young son (both pictured above) who has autism over their shared love of music, especially the Beatles, in a fabulous extract from his new book. Toby Moses, head of newsletters\n-\nBelieve it or not, it has been five years since the Covid-19 pandemic was declared. While much of the world has moved on, the remnants of that chaotic time remain all around us. Harriet Sherwood, Pamela Duncan, Matthew Pearce, and Tural Ahmedzade explore how this global health crisis has reshaped our perceptions of and approaches to death. Nimo\n-\nIf you thought those brightly coloured packets of snacks and Ella’s Kitchen pouches were the answer to your parental prayers, think again. Bee Wilson offers a nightmare-inducing glimpse at the pre-packaged and occasionally ultra-processed food the nation is feeding its children: “The total carbohydrates in a baby puree would have to hit 20g per 100g to fall foul of the law. This would be very, very sweet – about the same amount of sugar per 100g as a supermarket mini sugared doughnut.” Toby\n-\nAs Elon Musk runs roughshod through the White House as Donald Trump’s right-hand man, Tesla’s reputation has taken a major hit. Protesters have vandalised showrooms, turning them into battlegrounds of public outrage. Dara Kerr and Nick Robins-Early’s report has all the details. Nimo\n-\nI don’t know how national treasure status is awarded, but Oti Mabuse must be close to receiving the honour. The former Strictly star talks to Emine Saner about growing up in South Africa, life on tour and becoming a British citizen: “I represent not just women, or Black women, I represent African women, and I represent African women who come over from Africa to Europe.” Toby\nSport\nFootball | Newcastle defeated Liverpool 2-1 in the League Cup final to win the club’s first domestic trophy since 1955. Dan Burn (pictured above) and Alexander Isak scored the goals to seal the cup, before a late consolation from Enrico Chiesa gave the league leaders some hope in the dying minutes.\nFootball | Enzo Maresca has confirmed that Cole Palmer is likely to be forced out of England’s World Cup qualifiers against Albania and Latvia next week, with the Chelsea forward poised to have a scan on a muscular injury that caused him to miss the 1-0 defeat against Arsenal on Sunday.\nF1 | Britain’s Lando Norris believes he and his McLaren team are now favourites for the 2025 Formula One world championship after a strong victory at the season-opening Australian Grand Prix – but Ferrari’s team principal, Frédéric Vasseur, admitted his team had to up their game in working with Lewis Hamilton.\nThe front pages\n“Anger grows over Starmer’s ‘£675 a month’ disability cuts” – that’s the Guardian on this Monday morning while the Times has “Labour war of words on disability benefits”. “Death of the work ethic” – the Daily Mail cites findings that one in four young people don’t want to work at all. “Labour disabilities benefits cuts rebellion grows despite No 10 concessions” – that’s the i while the Telegraph’s story on school reforms takes aim at the education secretary: “Phillipson under fire for bowing to unions”. “Streeting: Docs over-diagnose mental issues” reports the Metro. “Miracle drug makes cystic fibrosis ‘vanish’” is pegged as an exclusive in the Express. “We will not become victims of this” – that’s the Mirror, about Chris and Sara Hoy, who have terminal cancer and multiple sclerosis respectively.\nToday in Focus\nPrice of a perfect playlist\nLiz Pelly, the author of Mood Machine: the Rise of Spotify and the Costs of the Perfect Playlist, tells Hannah Moore how the way we listen to music has changed over the last decade.\nCartoon of the day | Nicola Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nTo anyone aghast at the current behaviour of the human race, fear not – the universe may well be home to other, perhaps more enlightened beings, at least according to Dame Maggie Aderin-Pocock. The British space scientist will be giving the Royal Institution Christmas Lectures this year, science correspondent Nicola Davis reports, and she says while science has made giant leaps in the understanding of space, including the sheer size of the universe, there is still much to learn – not least whether humans are alone.\n“My answer to that, based on the numbers, is no, we can’t be,” said Aderin-Pocock. “It’s that human conceit again that we are so caught up in ourselves that we might think we’re alone.” This year’s Christmas lectures will try to riff on a “sense of wonder and exploration, and the sense that there’s so much more to discover”. As Aderin-Pocock noted, the idea that the Earth was at the centre of the universe – championed by the philosopher Aristotle – lasted for centuries before being overturned, while it was the work of Henrietta Swan Leavitt in the 19th century that gave astronomers the means to understand the scale of the universe.\n“And then suddenly we realised that we were so much more insignificant than we ever thought,” said Aderin-Pocock, adding that the astronomer Edwin Hubble subsequently showed the universe was expanding, while the eponymous Hubble space telescope later revealed 200bn galaxies.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2438,
  "scraped_at": "2026-02-14T12:34:58.097295"
}