{
  "article_id": "5d3f3d72df80",
  "url": "https://www.prnewswire.com/news-releases/paris-saint-germain-is-coming-to-america-as-european-champions-for-the-fifa-club-world-cup-2025-302472040.html",
  "title": "Paris Saint - Germain is coming to America as European Champions for the FIFA Club World Cup 2025™",
  "date": "20250603T143000Z",
  "domain": "prnewswire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Paris Saint-Germain is coming to America as European Champions for the FIFA Club World Cup 2025™\nBringing the best of France, Parisian culture and world class football to the United States, the Club of the New Generation is introducing several initiatives designed to connect with its rapidly growing United States fanbase\nLOS ANGELES and PARIS, June 3, 2025 /PRNewswire/ -- Fresh off a historic season crowned with a European championship, Paris Saint-Germain is heading to the United States this June to compete in the inaugural edition of the FIFA Club World Cup 2025™. The tournament marks a new era for global club football—and PSG is poised to make a statement on and off the pitch.\nAs France's sole representative in the competition, Paris Saint-Germain will join 31 of the world's top clubs for the most inclusive and expansive club tournament ever held. Taking place across 11 U.S. cities, the month-long competition will redefine what it means to be world champion. Paris Saint-Germain kicks off its campaign at the legendary Rose Bowl in Los Angeles against Atlético de Madrid on June 15, followed by a showdown with Brazil's Botafogo on June 19. The team will then head north to Seattle to face the Seattle Sounders on June 23.\nIntroducing the PSG House: Where Paris Lives in Los Angeles\nFrom June 14 to June 23, Paris Saint-Germain will open the doors to the PSG House, an immersive, experiential pop-up located at 8175 Melrose Avenue in Los Angeles. The PSG House is a vibrant lieu de vie—a hub of culture, community, and creativity where the best of Paris meets the energy of Los Angeles.\nThe PSG House, free and open to all from 10:00 AM to 7:00 PM, will feature:\n- Augmented reality booths, gaming stations, and trophy displays\n- A rooftop sport court and food trucks\n- Interactive family-friendly spaces, art lounges, and coffee bars\n- Partner activations and curated lifestyle experiences\n- A dedicated wellness center, inspired by facilities used by elite sports professionals, offering visitors a glimpse into innovative methods of recovery and trauma care at the highest level of performance.\nAs part of the Paris Saint-Germain experience, fans will have exclusive access to exclusive Paris Saint-Germain merchandise available only at the PSG House. These limited-edition pieces will include collaborations with French and international talents, spanning apparel, art, and accessories. This curated retail offering reflects Paris Saint Germain's unique position at the intersection of luxury, global street culture, and elite sport.\nFrom June 14 to 16, a Parisian workshop will host exclusive sessions for customizing sneakers and creating bespoke leather goods (reservation required). Additional programming throughout the week will include fashion, cinema, innovation, and community-focused workshops, alongside comedy shows, DJ sets, and art events—all showcasing the best creative talent.\nThe PSG House will also serve as a Content Studio, producing daily podcasts and video shows with players, influencers, and cultural creators.\nElevating Young Talent: PSG Academy U.S. Sessions\nWith seven academies across the U.S., the PSG Academy will offer exclusive training camps in Los Angeles during the Club World Cup. Led by official PSG Academy coaches, the sessions will follow the club's elite methodology—focusing on technical mastery, ball control, and real-game scenarios. Each camp will culminate in an awards ceremony, celebrating standout young players and fostering the next generation of football talent in the U.S.\nPSG's Expanding Global and U.S. Presence\nThe United States has long been a strategic growth market for Paris Saint-Germain. The club's presence is rooted in a deep and growing fanbase—nearly 5 million U.S.-based fans follow PSG on social media, and 18 official U.S. Supporters' Clubs represent the club coast to coast.\nTo serve this audience, Paris Saint-Germain has retail stores in New York, Miami, and Las Vegas, and operates a dedicated U.S. e-commerce platform. The club's cultural impact has been amplified through iconic collaborations with Nike, Jordan Brand, Fanatics, and Born x Raised, bridging football, fashion, and lifestyle. During the FIFA Club World Cup, PSG will take fan engagement to new heights with a program of immersive activations that celebrate the spirit of football and the style and culture of Paris.\nExperience PSG. Experience Paris.\nWhether on the pitch or in the heart of LA, Paris Saint-Germain is inviting all fans to celebrate the beautiful game—and the culture that surrounds it. With a European title in hand and a world stage ahead, PSG is bringing football excellence, global ambition, and Parisian style to the United States like never before.\nLearn more about Paris Saint-Germain's U.S. initiatives and the PSG House at: https://en.psg.fr/usa\nFor FIFA Club World Cup tickets and schedule, visit: FIFA.com\nAll matches will be streamed live and free on DAZN.\nAbout Paris Saint-Germain\nFounded in 1970, Paris Saint-Germain (PSG) is France's most successful sports Club and a leading force on the European stage. Under Qatar Sports Investments (QSI) ownership since 2011, PSG has grown into a multi-sport institution, excelling in men's and women's football, handball, judo, and Esports. In 2022, U.S.-based Arctos Partners invested in the Club to support its long-term growth strategy.\nWith a global fan base exceeding 500 million and a combined social media following of over 220 million across social media, PSG has become a cultural icon, sitting at the intersection of sport, fashion, and entertainment. Collaborations with global brands like Jordan have solidified its status as a globally recognized lifestyle brand. In 2024, the Club inaugurated the Paris Saint-Germain Campus, a state-of-the-art facility that sets new standards for athlete development and performance. As The Club of the New Generation, Paris Saint-Germain blends athletic excellence, cultural influence, and social impact to shape the future of sport and society.\nSOURCE Paris Saint-Germain",
  "word_count": 941,
  "scraped_at": "2026-02-14T12:36:00.429067"
}