{
  "article_id": "5d47613b7dd2",
  "url": "https://www.fool.com/investing/2025/05/13/rule-breaker-investings-gotta-know-the-lingo-vol-7/?source=iedfolrf0000001",
  "title": "Rule Breaker Investing Gotta Know the Lingo , Vol . 7",
  "date": "20250513T193000Z",
  "domain": "fool.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Our all-Fool cast is here to help you understand some common and not-so-common investing terms, so that you can leap tall buildings, swing from a web, and more importantly, be better investors!\nTo catch full episodes of all The Motley Fool's free podcasts, check out our podcast center. When you're ready to invest, check out this top 10 list of stocks to buy.\nA full transcript is below.\nThis podcast was recorded on May 07, 2025\nDavid Gardner: Asset location, inventory turnover, customer acquisition cost, spiffy pop. Each of these represents intermediate level terms that most serious investors know, and most people who are not serious investors do not know. Well, I'm inviting on three serious investors. This week, Motley Fool senior analysts in order to help teach the rest of us some new terms. Terms like the one I just let off with, each of which has been covered in the past episodes of this week's recurring series.me simple, some more advanced, all terms, we think you need to know. Drawn from investing in business, understanding these terms and the concepts behind them will enable you to become smarter about the game of investing smarter, which in my experience leads to happier and richer over time. Or maybe you already know these terms. In which case, I have a scoring system and you can score yourself this week. It's Volume 7 of Got Another Lingo welcoming in Nick Sciple, Yasser Al Shimi, and David Meier to teach you and me only on this week's Rule Breaker Investing.\nWelcome back to Rule Breaker Investing. It's Gotta Know the Lingo. Volume 7. The purpose of this series is to look at some of the terms that you might hear about and not always fully understand from business, accounting, investing, sometimes technology as well. Some new oncoming terms to get you thinking about the language of investing, business, and sometimes life to get you smarter about these concepts, we're about to do Volume 7. I'm going to be welcoming on Nick Sciple, Yasser el-Shimy, and David Meier to share three simple terms and then three advanced terms. I'll talk about the scoring system for that in just a minute.\nComing up a bit later this month, I'm excited to welcome back superstar business writer and marketer, Seth Godin, author of iconic books like Purple Cow, who will make his first reappearance on the Rule Breaker Investing Podcast since becoming my first ever author in August. It was August 1st, 2018. Seth Godin back ahead this month. I also want to call out last week's Mailbag for the extra notes coming in via Twitter X. The Mailbag was originally a bit light on the email side until I reached out over on Twitter X, put up the Ask Us Anything flag, so thank you again to those followers and listeners. Just a reminder that our email address is [email protected] to power up your Mailbag every month. You can always tweet us @rbipodcast on there on Twitter X as well at David G. Fool. There since February 2009, actually. I'm not quite OG status for Twitter, but 16 years of interacting with the public at large has certainly strengthened me and helped grow the Fool and this podcast. I mentioned the scoring system for this week.\nBefore I welcome our senior analysts. Let me make it clear how you can score this week's podcast while listening. You're scoring us. We have six terms for you, six that we're going to share this week and illustrate for you at the end. I'm going to ask you, dear listener, quietly to think with each one, did I learn anything from these Fools? If you feel like you didn't learn anything for a given term, your five minutes or so were wasted by that particular term, the score would be zero because you learned zero, and we were zeros. If on the other hand, you thought that was helpful. Maybe you even did know the term, but hey, they made me laugh. Give us a +1. Finally, if, as Nick or Yasser or David present their terms with their illustrations, if you find yourself delighted, not just by the quality of the learning, but maybe you got to smile along with it, if you really enjoyed it, give us a +2. That is the scoring system for Gotta Know the Lingo. Well, as I shared at the start of the year, just before we get started here, let me mention my 2025 book, Rule Breaker Investing is available for pre-order now. After 30 years of stock picking, this is my magnum opus, a lifetime of lessons distilled into one definitive guide, and each week until the book launches on September 16th, I'm sharing a random excerpt. We break open the book to a random page, and I read a few sentences. Let's do it.\nHere's this week's page breaker preview. Two sentences from near the very end of the book and I quote. \"To quote the British historian Thomas Babington McCauley on what principle is it that with nothing but improvement behind us, we are to expect nothing but deterioration before us?\" Then I wrote the word Excelsior. That's this week's page breaker preview to pre-order my final word on stock picking shaped by three decades of market crushing success. Just type Rule Breaker Investing into Amazon.com, Barnes and Noble.com, or wherever you shop for great books. When you think about it, a great investment book literally pays for itself. To everyone who's already pre-ordered, thanks. That means a lot to us. Before we start, I want to mention what happens next week. It's my birthday next week, and your annual birthday present to me. This has happened most every year, the last several years, is that you let me know what you've learned from me over the last year, or if you're a longer term listener, maybe what you've learned from me over the longer term. What have you learned from David Gardner, 2025 edition, Our email address, [email protected]. You can tweet us @rbipodcast on Twitter. Again, if you have a little extra time this week and you want to celebrate my birthday with me drop me a story. Drop me a few lines, a few paragraphs, if you like, [email protected]. I will turn it around and share back the ones that feel most apt, the most beautifully written, the most inspiring on next week's show. Thank you in advance. Without further ado, let's get started. Nick Sciple. Welcome to this week's podcast.\nNick Sciple: Great to be here with you, David.\nDavid Gardner: Nick is a senior analyst on the Motley Fool Canada Investing Team supporting our Canadian services outside of the Fool, most of his time gets taken up by his 2-year-old and his 10 month old, but Nick tries to find time to follow Alabama athletics and get to as many concerts and shows as he can. Nick, my icebreaker question for each of our senior analysts this week is, what is a financial term that you, Nick Sciple wish you'd known prior to adulthood?\nNick Sciple: Well, David, I think, for me, compound interest is the one that came to mind, it sounds a little technical and academic. But when I pictured getting wealthy as a kid, I pictured Scrooge McDuck in his bank vault swimming around in big buckets of gold coins. I thought you just saved your money, and you put it in the bank, and then slowly over time, that's all that happened, but I didn't realize that your money is actually out there working for you. It's like when you're a kid playing baseball or kickball, and there's some ghost runners on base, you already got a hit earlier on, and there's a pretend person out there running the bases for you. That's what your portfolio is doing. But as a kid, I really had no understanding of that as I came to grasp that more over time. It'd be crazy not to be participating in the stock market, participating as someone benefiting from compound interest out there in the world. I didn't understand that until later in life. I wish I would have known it earlier.\nDavid Gardner: Appreciate that, Nick. you're reminding me one of our fellow fools, Mark Reagan, who was at our company for some years, told a great line when I first met him. He said my mom raised me, and she said to me, Mark, there are three ways to make money in this world. With your mind, with your body, or with your money, which one would you like to do? And he said, Tell me about that third one. How can I make money with my money? Welcome, Nick, Roll Tide. Let's introduce next Yasser Al Shimi, Yasser is a senior analyst at The Motley Fool, where he serves as the acting advisor and investment coordinator for Global Partners, our international markets-focused service. Since having kids, Yasser's free time is a thing of the past, but he still manages to follow Italian soccer every week. Nonetheless, Yasser, welcome. Can you remind me of the team? I know it's like premier league. It's the big time.\nYasser El-Shimy: Sure. The league itself is called Serie A. That's a Italian soccer league. My team is AS Roma. That's a team I've followed for over 20 years now, and I think I'm going to stick with it for the next 20, at least.\nDavid Gardner: There I am showing my ignorance in a lot of ways of international soccer. I guess I should just ask you this basic question, Yasser, is AS Roma the best team?\nYasser El-Shimy: Well, that depends. For me, it is the best team. No questions asked. From a footballing perspective, however, it's not by far the best team in the world. Now, they don't have the resources to compete with the likes of Barcelona, Real Madrid, PSG, or some of the Premier League clubs, but they still nonetheless manage to play for the fans, play for the Jersey, and that's what I love the most about them.\nDavid Gardner: Thank you. Yes, so it looks like they're looking for at least one more promotion at some point. Yasser, what is a financial term you wish you'd known prior to adulthood?\nYasser El-Shimy: Well, I would have gone with compound interest, thanks a lot, Nick, but minus the mental image of swimming in gold coins. I think, for me, I would have appreciated learning more about diversification. I think that growing up, my parents and a lot of the people I knew, and, of course, I having grown up in Egypt, not in the United States. A lot of the people I know tended to invest almost all of their money in real estate or to a lesser extent in CDs, certificates of deposit in the bank. Unfortunately, not a lot of investments go the way of stocks, bonds, or other alternative investments that might exist. I think that has definitely been a missed opportunity for a lot of people, especially with the depreciation of the local currency over time.\nDavid Gardner: Thank you for sharing that, Yasser. Remind me of two quick facts. What was the year you came to the United States from Egypt? What was the year you bought your first stock? At what age?\nYasser El-Shimy: I moved to the US in 2007. I think I was around 25 years old at the time, and it took me two years to buy my first stock, and it was a process of, getting to learn what stock investing even is, and thanks a lot to the Motley Fool for helping with that. But ultimately, I decided to go ahead. Even as a graduate student, I set aside the little money that I had and started investing. Thank God I did.\nDavid Gardner: Fantastic. 2009, by the way, not a bad year to start investing.\nYasser El-Shimy: Exactly.\nDavid Gardner: Hey, David Meier. Welcome, David. Great to be with you.\nDavid Meier: Great to be with you, too. Thank you very much for having me.\nDavid Gardner: David is a senior analyst at The Motley Fool, where he's part of the Trends team, the lead investing liaison as well with our marketing teams. Since his daughter is out of the house married and an oral surgery resident at Case Western. He spends many afternoons on the golf course working to lower his handicap. David, I'm sorry to take you off the golf course this particular afternoon. How's the handicap?\nDavid Meier: On the way down, which is good.\nDavid Gardner: Do you want to quote publicly for all time through this podcast where you are right now or do you not want to?\nDavid Meier: I am a seven index right now and descending.\nDavid Gardner: Single ditch. Very impressive. David, what is a financial term you wish you'd known prior to adulthood?\nDavid Meier: Obviously cannot disagree with either of those two terms, but I'm going to go in a little bit of a different direction. I'm going to go with the term bond vigilante. First of all, it's just pretty cool. In your mind, pictures these armed men and women who are terrorizing the bond market. But in all seriousness, the reason that I think it's an interesting term is, hopefully, I won't screw up James Carvill's quote too bad, but he said \"Some people dream of coming back, being reincarnated as a 400 hitter or a psi Young Award winning pitcher in baseball.\" I want to come back as the bond market because in the bond market, I can intimidate anyone. What these bond vigilantes are are supposedly these groups of people who conspire and say, we are actually going to be the ones who set rates. The reason that it's interesting, in my opinion, is because over my 20-plus years of investing 20 at The Motley Fool, the bond market actually plays a role, and I think it's good for investors to understand how interest rates moving up or down can impact stocks. It's one of the things that's helped me become a smarter, happier, and richer investor over time.\nDavid Gardner: Thank you for that, David Meier. While that is not one of our official terms for Got to Know the Lingo this particular week. I'm going to call that a bonus. I admit I didn't really know the phrase bond vigilante either. There's at least one phrase on this week's roster that I didn't really know much about. I'm learning along with everyone else, and let's get started. Let me turn first to Nick Sciple. Nick, you're queuing up a simpler term in a more advanced term. We're going to rotate through our simpler terms first. What do you got for us?\nNick Sciple: David, so for my simple term, I went with proxy statement. Might also find it referred to as SEC Form DEF 14A. The proxy statement is a document that publicly traded companies are required to file with the Securities and Exchange Commission and distribute to their shareholders before any annual or special shareholder meeting. It exists to give shareholders enough information to competently vote on the matters before them at the meeting, whether that's election of electors at regular annual meetings, or if there's a big transaction where there might be a special shareholder meeting, that's to vote on that transaction, other changes in corporate policy. As well, gives you insights on executive compensation and incentives, insider ownership, potential conflicts of interest, and that things. All good. Background information, one of the most important SEC filings to check each year.\nDavid Gardner: Well, I would say, Nick, from the earliest days as a little investor raised on my daddy's lap, I think that I remember receiving through the mail proxy statements. then as I came of age, I would get them all myself for stocks in my portfolio. Do you have an opinion on how seriously we should take these, how much time we should spend for somebody who's keeping up with the diversification required by the Gardner Kretzman Continuum, a very difficult term to parse. We'll skip it this week. But for somebody who roughly has as many stocks in their portfolio, as their age, number of years on this earth, and that's me. I'm around 58 years old and I have around 58 stocks. How much time should I devote to proxy statements?\nNick Sciple: I think it is important to understand how management is compensated and what their incentives are. Especially when you're looking at a company for the first time and you're unfamiliar with the business. If management is incentivized to increase per share metrics, which I own the shares. I would like to increase earnings per share. That is a lot more aligned with me than, for example, a manager that's incentivized on adjusted EBITDA where, hey, those adjustments are pulling out some real important costs and also incentivize things like acquiring assets to juice those types of metrics. Knowing what the incentives are of the management team that you're following and knowing potential conflicts of interest they have is important. Is it important to spend a lot of time debating whether they should be hiring auditing firm versus another auditing firm? I don't think you should spend any time on that at all, who is running the business and what their incentives are, I think is super important, especially when you're starting a position.\nDavid Gardner: Thank you. I might also add that I agree executive comp would jump off the page versus who the auditing firm is. I think maybe in terms of time management, we're all time-starved in this society. We should be. There's so much productivity to our every hour, I hope. But I would say it makes a lot of sense. Do you agree, Nick, to focus on the proxies of your biggest holdings? If I have a small starter position in something that really isn't going to tilt my portfolio too much, maybe I shouldn't spend too much time with that proxy. If I have a 5% or greater position in anything, you guys should probably vote that proxy.\nNick Sciple: That's right. I'd say, the bigger the position is, the more important it is. The more influential a particular manager is over the business, the more important that is. You might be curious about what's going to happen next for Berkshire Hathaway. Well, if you read through that proxy statement, you get a pretty clear sign of who the next chairman is going to be. It's going to be somebody with the last name Buffett. But I think for different company, [inaudible].\nYasser El-Shimy: I'm so glad you brought this term to the podcast, Nick because this is actually not from a time management standpoint, but this is the first document that I go to whenever I come across a new company, and it's for the exact reason that you say. I want to know who the management teams are. But more importantly, I really want to know what their incentives are. Charlie Munger famously said, \"If you give me the incentives, I'll show you the behavior.\" We have seen across the years of stock market investing, that is exactly what tends to happen. You can root out what you think is bad behavior right away just by spending a few minutes going over that section. Lastly, I'll say, the other thing that you get to see is, who are you investing alongside. You get to know who owns a big stake. Who's been selling their stake. It's it's a document chock-full of information, and it's nowhere near as famous as a 10K or a 10Q or anything like that.\nDavid Gardner: Good points, David Meier. Nick, let me turn back to you to close. I've asked you each to produce an interesting and illustrative sentence to put your term into to close. What do you got?\nNick Sciple: My sentence is, if you're worried, your management team is taking advantage of you and other shareholders. Go check the proxy statement, and you'll find out real quick.\nDavid Gardner: Very well done. Thank you, Nick, for getting us off to a fine start proxy statement. Term Number 1 this week of the simpler sort. Let me move on to Yasser El-Shimy. Yasser. Term Number 2, what do you have?\nYasser El-Shimy: Well, so some of us Rule Breakers are familiar with the first trait of a Rule Breaker that David came up with, and that was top dog and first mover. However, I'm going with a slightly version of that term today, which is something that you'd find in MBA textbooks, basically, the first mover advantage. Now, what we mean by first mover advantage is basically the benefits that a company would gain by being the first to enter a new market or introduce a new product or service that even creates a new market. This strategic position can give a company several advantages, including brand recognition, for example. Being the first allows you to establish a strong brand. Maybe even brand association. If your company's name becomes a verb or the action that's being done, think of Google, for example, for search and Uber for ride-sharing and so on. It can give you other advantages, including having bigger market share in that new market. It can give you resource access. If you can secure critical resources like patents, supplier contracts, or even physical locations, think Prologis for warehousing, for example, that could be an interesting example here. All of that gives you an advantage as a first mover that makes it a little more difficult for your rivals, for your competitors, to try and play catch up with you. The final thing I'm going to conclude here in terms of the advantages is effectively setting the industry standards or the customer or user expectations. First mover can define basically how products work. They can set the expectations for the end users of what they can come to expect from the service or from the product, and therefore forcing anyone who is trying to enter into this sector, a later entrant to adapt to those expectations and those standards that that first mover had in fact set itself.\nDavid Gardner: First mover advantage is obviously very important concept, and you're right. It is a little bit the stuff of MBA or grad students in coming from the business world, Yasser El-Shimy. I do think that it's something anybody can understand. It can be taught or explained pretty well to a bright child, and they are real. You're right. You mentioned brand and setting the benefits of brand, and I sometimes just think about the media coverage that goes to somebody like OpenAI, the sheer amount of brand building that the media does for you because you got out first. It's hard to put a number on it. Maybe there's a new term here, Brandwagon. I don't think I'm going to go there, but there's getting on the Brandwagon with the media helping you out is part of that, but I really appreciate your points about consumer expectations, making the rules early, even though you're ironically breaking the rules, but setting the standards of expectation.\nNick Sciple: It's really interesting in either technology adoption or in the process of innovation, you're absolutely right. First movers can grab a lot of that advantage for themselves. But there's a paradox in there in that sometimes it's actually the fast follower that reaps all the benefits because either they come up with a better way of doing something or less expensive or something. The first mover did a whole lot of hard work, but it was the company that came in second that reaped all the rewards. Again, it could not agree more that it is a great thing to understand. But just beware, there's somebody out there always trying to get you.\nYasser El-Shimy: That's an excellent point. Thank you so much for raising that because I was actually going to talk about some of the risks that come with being a first mover here, including what I might call a first mover disadvantage. There are certain sectors where there are, in fact, lower hurdles for new entrants to come into that sector, especially in technology. Think, for example, coding. That's something that's both quick and easy to do and scale as well. If you're a first mover, good for you, but that may not necessarily give you a clear advantage over late entrance. In fact, we might come from behind, fix your mistakes, out innovate you, and still benefit from the fact that you had made the first move to create the market to begin with. I'm thinking here, for example, Zoom for video conferencing versus Webex by Cisco. Cisco was the first to create this field or industry and Zoom comes in with a better product and basically takes a lot of market share.\nDavid Gardner: It's a good example, and obviously we can find good examples on both sides. That's why we're just here to educate and to make sure that you, dear listener, know these terms and have a nuanced appreciation, even of the simpler terms like Yasser's first mover advantage. Thank you for that, Yasser. Do you have an interesting illustrative sentence for us?\nYasser El-Shimy: Sure. My sentence is the Patriots first mover advantage makes it impossible for another New England football team to rise and claim to be the team for New England.\nDavid Gardner: I don't think even if you don't like the Patriots, and I know some people listening don't. You can't disagree with that. Well, said. Let's move on. You went from football to football. Very nice, Yasser. David Meier, you have our final simple term. This is term Number 3 for Gotta Know The Lingo, Vol. 7. What you got?\nDavid Meier: I'm coming with portfolio management. Now, I actually was down in our asset management group for a while, and so I actually got to manage other people's money. I thought about this a lot. But portfolio management, really, when it comes down to it, it's just how are you collecting a group of stocks into a portfolio that is going to try to do what you want it to do? There's no right way to do this. Sometimes it gets much more complicated or it seems much more complicated than it is. For example, like professional investors on Wall Street. They will say, I need a portfolio of stocks that are not correlated with each other. Well, that's great, but that's hard to do. Then I remember something that you said, David, which was, make your portfolio be the future that you want to see. That's a completely different approach to portfolio management. I will say this. The way I try to go about it and the way I still try to do it is I try to create a group of companies in a portfolio that have the highest quality and the most attractive risk and reward. I figure if I can do that, over the long term, I should be able to beat the market a little bit. But put very simply, anybody can do portfolio management, however they want, because it's just a way of putting stocks together.\nDavid Gardner: Really appreciate that. Portfolio management, when you rock out that phrase, a lot of people for them, it probably means something formal and something that they need to study. While none of us is going to disagree with that, it is important and it is worthy of study. I don't think, David, as you're saying, that there's any single school of how to do this. In fact, I would say in some ways, it is undertaught. Even just looking at our company, I think the Motley Fool does a great job identifying stocks you might want to add to your portfolio. We've tried to think about people's portfolio dynamics over the years. But the reality is, other than our asset management part of our company, which is regulated, and we don't really talk about that here, everybody is left to their own to figure out how to manage their own portfolios. We can't give specific prescribed advice about what to do in your portfolio, even though that would be so relevant if we could. Anyway, therefore, there's a little bit of choose your own adventure. What color is your parachute? I'm all about that. I really want each of our listeners to be thinking about one or more principles that contain their intentions. Roughly how many stocks do you want to have? What kinds of diversification, etc?\nYasser El-Shimy: David, I wanted to ask you, and maybe I'm throwing you a hand grenade here, but the pros and cons of concentration, being concentrated in your portfolio versus being diversified. We always hear arguments on both sides of those coins, and I would love to hear your thoughts on it.\nDavid Meier: Oh, it's such a great question and thank you for asking it. Well, there's something to be said for investing heavily in what you know. Because that's the thing you're most comfortable with. That's the thing that you probably pay attention to the most. Also may be the thing that if there are times when the stock is volatile, because you know it well, you may be more patient with it. You may actually think on a longer term time horizon than if I was trying to switch things in and out. But there is actually you don't necessarily just want one stock some people can do it. Not everybody can because that's going to be a very volatile portfolio. But do I need five to create diversification? Do I need 8, 10, 12? Some of it will depend on your own bandwidth, meaning how many of these can I follow? If I'm a normal retail investor who's doing this as part of the families, I'm a breadwinner. Plus, I'm trying to manage the family's finances. Probably not a whole lot of extra time to be going through this. I personally think you can get some decent diversification on about 10-12. If you can follow more, and you know those companies, it certainly will help.\nDavid Gardner: Well, well said. Yasser, hand grenades are welcome. I don't really think that qualified as a hand grenade. It was just a very thoughtful and important question to ask. Thank you for sharing that. David, your interesting and illustrative sentence, please, portfolio management.\nDavid Meier: I think for everyone, the best portfolio management is the one that enables you to sleep best at night.\nDavid Gardner: I do love that, and that is an excellent sentence. Thank you, David Meier. We are at the halfway point of this week's podcast, my dear Fools. We've just gone through three simpler terms, a reminder for each of them now, proxy statement, first mover advantage, portfolio management. Again, if you feel like you already knew any of those and we added no value to your life for that one or even all three. Well, that would be a zero. No, that would be sad. That would be a zero. On the other hand, if for one or more of these terms, you learned something or laughed, give us a plus one. Finally, if you found yourself utterly delighted and you now see the world in a new way that you didn't before this week's podcast, give us a plus two for that one. This is a quality assurance system. Let us know on social media or via our mailbag, how we scored for you this week. Why? Let's now move from our simpler to our more advanced terms, gentlemen. I'm going to turn back to Nick Sciple. Nick, what is your more advanced term for Gotta Know The Lingo, Vol. 7?\nNick Sciple: My more advanced term is 10b5-1 trading plan, which if that doesn't sound complicated, it is. Refers to Rule 10b5-1 of the Securities Exchange Act of 1934. A 10b5-1 trading plan is a pre-arranged written plan established by corporate insiders, like officers, directors, or other large shareholders to buy or typically to sell company stock at a future date. They exist to provide an affirmative defense for those insiders against insider trading. To qualify for that, you have to establish the plan at a time when you don't have material non-public information. You have to give your broker specific instructions on how to carry out those trades, whether the date, price or a formula, calculate those and also, you have to exercise no further influence over the plan once you've established it. There's also a minimum cooling off period. It's about 90 days after you put the plan in place. Then since 2023, now every time a company files a quarterly or an annual report, they have to disclose those 10b5-1 plans that their executives have entered into during the quarter. It gives you advanced notice on upcoming buying or selling from insiders of the companies you own.\nDavid Gardner: Very well explained again, Nick, for those keeping score at home, and I hope you are, if you're wondering how this is spelled, it's 10b5-1, just to make sure we're parsing the language as perfectly as Nick, who by the way, is a lawyer would do himself. I admit this is the one I need to look up, guys. If you just hit me with 10b5-1 trading plan, I know it in concept, but I didn't actually know it by that highly technical name, but I appreciate that you brought it, Nick. Let me ask you back, what is significant about 10b5-1 trading plans for you as an individual investor?\nNick Sciple: If you looked at the headlines last Friday, you may have seen just about anywhere you look on big financial websites, Jeff Bezos has filed to sell up to five million dollars worth of Amazon stock. If you go check Amazon's 10-Q, you will indeed see that on March 4th, 2025, Jeff Bezos, founder and executive chair of Amazon adopted a trading plan to satisfy Rule 10b5-1, where he's going to sell 25 million shares of amazon.com over a period ending May 29th, 2026. When you see that headline and say, Bezos is selling $5 billion of stock. Maybe I should be concerned about what's going on with Amazon right now. If you actually drill into what's going on here, this is a plan established two months ago that's going to run over the course of a year plus. If you go and cross reference those sale numbers with the proxy statement that we talked about earlier, you see that's less than 3% of Bezos's overall stake in Amazon, something that's very likely just for personal financial planning, funding his other business interests, not something to worry about as an investor.\nDavid Meier: I'm glad you brought this one up too because I think it's very important that executives, directors, etc, disclose ahead of time when they're going to be selling. One of the things I can't stop thinking about Peter Lynch and his favorite quotes is that people sell stocks for a variety of reasons, but they only buy for one. Yes, it's great to know this information, and it's also great to know when they've actually purchased shares as well. There might be just a little more information value in the purchase, but it's always good for investors to understand what is happening with the leadership of the company and their stakes in the company.\nNick Sciple: I'm glad you mentioned the purchase angle, and I think there's definitely a lot more information available in management purchases than there are in sales. I did mention, you can use a 10b5-1 plan for share purchases, although that's pretty rare to see done, management blind buying into the market, although you do see that, occasionally, one example we saw actually earlier this year, TKO Group, which is the parent company of WWE and UFC, their controlling shareholder endeavor, bought about $300 million in stock over the course of just about a month between January 17th and February 12th at prices up to $177 per share. Know anything about TKO Group? There's some pretty big catalysts coming down the line this year. The UFC's rights agreement with ESPN expires here at the end of 2025. They're going to be launching a new boxing league in collaboration with the Saudi Entertainment Authority this year, and then domestic rights for the WWE's premium live events also expire in March of next year. With management blind buying in January and February, legally compliant, maybe says something about how they expect those negotiations to proceed throughout the year. If you look at the shares here today here in the mid 160s, management was blind buying 10, $15 higher than where we are today. Maybe it's something to have your eye on.\nDavid Gardner: There you go, Nick Sciple somehow managing to fit in some references to WWE and/or UFC. I know you're a fan. By the way, Netflix seems to be doing pretty well with its WWE show.\nNick Sciple: That I think is going to be a big driver for Netflix's advertising business moving forward. You think about that weekly inventory, getting folks to tune in. They're continuing to put the gas pedal on when it comes to sports content. Going to have another Christmas Day game this year, another boxing event this year. I don't think this is the end of Netflix's forays into live sports.\nDavid Gardner: Well, and as I look this up, because I did not immediately recognize the numbers and letters together in the way that they're configured on my friend Wikipedia, one of my best friends in this world, I found out that SEC Rule 10b5-1 was enacted by the SEC in the year 2000.\nIt's been around for 25 years, but then it wasn't around for 100 years. It makes me glad that I think, in general, the world for individual investors, the world of transparency and better information, is so much more present here in 2025, starting really somewhere around 2000. Remember Arthur Levitt, SEC chair. We had something to do with that back in the day, Regulation FD, Fair Disclosure, where companies could no longer give information just to Wall Street. Any material information had to be given to individual investors, and the Motley Fool was a big proponent of that and helped get that passed. Anyway, it makes me happy to see that this has been around for 25 years, but it does make me wonder, Nick, about the century before that.\nNick Sciple: That's right. It was the Wild West, I guess, back before we got some of these investor protection laws here in the past 25 years.\nDavid Gardner: How about an interesting and illustrative sentence to go?\nNick Sciple: If you see insider selling under a 10b51 trading plan, usually, that can be safely ignored. But when you see purchases made under a 10b51 trading plan, you should start paying attention.\nDavid Gardner: Very well done. Very well said, thank you, Nick. Let's keep moving on to term Number 5. Yasser earlier you brought us first mover advantage. You could even argue you were taking advantage of a first mover advantage with that introduction of that term. What do you have now for term Number 5?\nYasser El-Shimy: For term number five, I'm going with insider ownership. Insider ownership refers to the shares of a company that are owned by executives, directors, and other key insiders. Think, for example, venture capital firms and so on that may have invested early in the business and kept their shares in the business as they IPOed. These individuals often have significant control over the company and they exercise a lot of influence over its decisions and how the company operates. But I think the most important element of insider ownership is the signals that it sends to market. I'm going to just go ahead and say that generally speaking, the higher the insider ownership, the more positive I feel about the stock, and I can go on about why that's the case, if you'd like.\nDavid Gardner: Well, do go on a little bit about why that's the case.\nYasser El-Shimy: I think there's an important signal in the insider ownership here. The first one is alignment of interests. The higher the insider the ownership, the more certain you are as a retail investor, that the company's management has skin in the game. It's deeply invested in the company and its success, and that the interests of management should align, hopefully with those of other shareholders who have obviously vested interest in the company's success. But it can also be a confidence indicator. It shows you that executives, directors, and so on, feel pretty bullish about where the company is headed and the business they are creating and that's always a good indicator to have. Finally, I think also and that's my favorite one, perhaps, it should signal an inclination on the part of management and the board to be more long-term oriented or have more of a long-term focus. Companies with higher insidership, they often prioritize sustainable long-term growth over just the quarterly earnings and kind of trying to move the company around one way or another in order to make it for just one quarter.\nDavid Gardner: Thank you for that, Yasser and Yasser and or other senior analysts, if I'm interested by this, if I'd like to know how to find these numbers, what is a ready source that you could recommend that I as an individual investor tap into?\nYasser El-Shimy: Sure. One easy free source to use, although I cannot vouch for the veracity of those statistics would be Yahoo Finance. If you go on Yahoo Finance and you write the stock name, under financials, you'll find a bullet that says, Percentage of shares owned by insiders or something like that along those lines. That's a very easy way for retail investors to access that information. Although, for us, we tend to rely on other more professional behind payroll sources for that data.\nNick Sciple: Yeah, I might also just a double underline. You can go to the proxy statement, which we talked about earlier. That won't be updated throughout the year, unless there's additional special meetings at least around May, every year, you'll get the proxy statement filed for the companies that you follow, and they will disclose all shareholders, usually over 5% and then also for any named executive officers, they'll tell you exactly how many shares those individuals hold. The proxy statement at least once a year, will give you some of that information as well.\nYasser El-Shimy: I have to give Nick kudos for weaving in his proxy statement again into this term. Bravo Nick\nDavid Gardner: Plus one to Nick. [laughs] I do ask you guys just to independently come up with your terms, but it is fun to see the interconnectedness, because in insider ownership, we do see some proxy statement. We also see some 10b51 trading plan. These are one level down in terms of complexity. This is more under the hood relative to many people that we meet in society at the water cooler at work on the bus or in our investment club who don't necessarily know these things or know how to look for these things but they do count. Thank you. Thank you Yasser, thank you Nick, for those comments, Yasser interesting and illustrative sentence, please.\nYasser El-Shimy: Let's go with this one. The Gardner Brothers' big insider ownership in the Motley Fool gives us Fools confidence in the business and its future.\nDavid Gardner: Well, I really appreciate that. Come on, score one for the home team and without navel-gazing too much, thank you for that. Tom and I are substantial owners of the Motley Fool. All of the other owners are our employees. We really have no outside capital in our company, despite having taken in a lot of venture capital money back in the day. That's a fun story we don't often talk about, but thank you for that, Yasser. Appreciate that. Insider ownership. By the way, we always hope our insiders are friendly, good people. Sometimes they are active private equity types or showing up trying to sway or take over the board. This is also something to be guarding against in some cases. Let's move on to our final term this week. Gotta Know The Lingo, Vol. 7. David Meier, last time you went with portfolio management, is the next one tied in?\nDavid Meier: Not really.\nDavid Gardner: That's fine.\nDavid Meier: Yes, I appreciate that.\nDavid Gardner: It's a horse of a different color.\nDavid Meier: But it is one that's been popping up in the news lately. From a current event standpoint, the term that I would bring to everybody is stagflation. It's probably a term that we haven't heard here in the United States for going on 40 plus years because I think that was the last time it occurred. What is stagflation? It is the combination of stagnant growth so the growth of our economy is very small to zero at a time when inflation stagflation is rising. This is actually a very bad scenario for our economy. One of the reasons that it's bad is because those two things work against each other. For example, if I wanted to increase the growth of investment in our country, one thing I could do is I could bring down interest rates. But bringing down interest rates actually might make the inflation problem worse. Making the inflation problem worse we would all feel the negative effects of rising prices. But one way that I can make inflation come down is to increase rates. But the unfortunate byproduct of that is if I increase rates to combat inflation, I actually might push the economy into a recession because companies will not be willing to invest in growth in whether it's factories or human capital and things like that. The fact that it's coming up in the news gives me a little bit of pause, and that's why I think it'd be good to bring it to listeners today.\nDavid Gardner: I appreciate that, David. The last time I really heard that in a regular way was in my undergraduate economics course at the University of North Carolina Chapel Hill, which, by the way, was the late 1980s, which is the last time reflecting on it at that point that it had happened. I admit I ended up not majoring in Econ. I went the English literature route. I didn't really tie a bone or complete this. But, David, have you looked back at this, can you remind us of how we got out of it the first time through?\nDavid Meier: Well, this is part of the problem. It actually takes a long time to get out of it. If I remember my history correctly, there was significant stagflation in the early '70s, but it wasn't until the late '70s and early '80s when interest rates increased, some of it from the Fed actually pushed the economy into a recession. Again, it's a negative outcome that we didn't necessarily want, but that's what resets things, unfortunately. The recession resets the expectations, the aggregate demand comes down, people stop buying things. Therefore, prices moderate. You combat the inflation. Then people say, oh, wait, there's an opportunity. Let me start investing because United States has typically been a great place to always invest. Then the economy then mends itself on the way out.\nYasser El-Shimy: Let me throw you a curveball, David.[laughs]\nDavid Gardner: Not a hand grenade this time.\nYasser El-Shimy: Not a hand grenade this time.\nDavid Meier: I expect nothing less from you.\nYasser El-Shimy: It's just a curveball. If I were to put you on the spot and ask you to choose either 10 years of stagflation or 10 years of deflation, which would you go for?\nDavid Meier: Oh, boy, I would go for 10 years of stagflation. If we had 10 years of deflation, that would be exponentially worse than stagflation, because at least we have a little bit of growth, prices might be moving higher, but we would still be able to consume things. In a deflationary environment, the problem there would be even if prices are coming down, no one would be buying anything because most likely companies would be shedding labor. We'd probably see in a situation like that, unemployment rising rapidly. Again, we're talking deflation across the board, there are certain instances where deflation is a good thing. But if all of our prices are going down, then businesses are probably struggling. If businesses are struggling, employment is struggling, therefore, citizens are struggling. I'd much rather have 10 years of stagflation.\nDavid Gardner: Fortunately, we haven't had deflation in any meaningful way in a long time. Although there have been worries over the last 15 years. The markets have reacted, and it's not pretty. Let's actually add some pretty here, David. What is your interesting illustrative sentence to close?\nDavid Meier: So Peter Lynch, going back to him again, also said, If you spend 13 minutes a year studying the economy, you've probably wasted 10 minutes. I disagree. Given that stagflation has reared its ugly head again, I suggest spending at least five minutes on it.\nDavid Gardner: Are you throwing a hand grenade at Peter Lynch on this podcast?\nDavid Meier: No, it's definitely not a hand grenade. [laughs] It is a backhanded compliment.[laughs]\nDavid Gardner: Well said. Fellow Fools, there you have it. Gotta Know The Lingo, Vol. 7 We had six terms this week, just to review them in order. Proxy statement. First-mover advantage, portfolio management, 10b51 trading plan, insider ownership and how to find it, and stagflation. I think my talented fellow Fools did indeed bring some simpler and some more advanced, a little bit of header talk here at the end of this week's podcast. How'd you score at home? Remember, 0, 1 or 2 for each of those, feel free to tweet it out if you got a high score or a particularly low score. We hope your results, dear listeners speak for themselves, whether it was a 0, 1, or 2 for each of our terms, we had a lot of fun bringing that to you this week. Thank you again to Nick Sciple, Yasser El-Shimy, and David Meier. In fact, I want to give them each an opportunity for a final line. It's baseball season again and in Major League Baseball, as hitters come up to bat, they get their requested walk-up music played. For my senior analysts this week, I thought, why not give them a walk-off line? Let's do it in order. Nick Sciple, you're up first with your walk-off line.\nNick Sciple: I think it's OK to steal lines from other people and bring them together and make them in.\nDavid Gardner: Sure.\nNick Sciple: Something new so here's what I'll go. On the Canadian Investing give me love to quote Stein's Law, that which cannot go on forever must stop. I think that certainly describes the macroeconomic world that we're in today. Jack Bogle always used to say, You should stay the course. Keep on investing. My favorite head football coach ever. Nick Sciple says, trust the process. Listen, in this world that we're in, that which cannot go forever, must stop. Stay the course, trust the process, and you'll be a successful investor over the long term.\nDavid Gardner: Pretty good walk-off line. Thank you, Nick. Yasser, your walk-off line.\nYasser El-Shimy: Sure. As a recent steward of our global partners' service, I would like to remind investors that there are other markets beyond the United States, and that is not to say that we should not be investing in the US, absolutely not. But rather, that diversification is not just for sectors or market caps, but it's also for geographic locations, and being overly concentrated in one geography can come with its fair bit of risk. Look at your portfolio, think about how diversified you are from a geographic perspective.\nDavid Gardner: Thank you, Yasser. Very well said. Could you put the name again on the service that you help lead?\nYasser El-Shimy: Global Partners.\nDavid Gardner: Something to consider signing up for, fellow Fools. Let's go to David Meier. David, your walk-off line.\nDavid Meier: How do I top those two? I guess maybe I don't need to top it, but how am I even in the same ballpark?\nDavid Gardner: Just play music with this.\nDavid Meier: I'll give it a try. In periods of short-term volatility, quality companies are always your long-term friends.\nDavid Gardner: What a nice close. I was reminded last time on volume six in this series, our fellow Fool Analyst Sanmeet Deo rocked the Dos Eckes man of TV advertising and fame, who says, \"As you'll all remember, stay thirsty, my friends.\" But Sanmeet went with \"Stay curious, Fools.\" That is indeed the spirit of this series. Gotta Know The Lingo, where we're here to educate, especially, of course, always to amuse and rich, as well, but to educate. We're actually building up quite a glossary of terms, A-Z. Once you start multiplying 6*7, we've done 40 plus terms and concepts at this point.\nIf you enjoyed what you heard and want to keep learning with your child in the car or just by yourself on your phone somewhere, Google, Gotta Know The Lingo, Rule Breaker Investing, and you'll see our previous six episodes in this series. A final reminder next week it's my most self-indulgent podcast of each year because it's my birthday week. What have you learned from me? It'll be the latest addition to 2025 of what you've learned from David Gardner. It's always fun to summarize the cardinal points or things that you've heard from me and just share them back. I take your gifts in the form of emails, [email protected] is the address, and then I share them back out as a summary of some of the most important takeaways that I can give you in investing and business and life. Again, [email protected]. You can tweet us at @rbipodcast. In the meantime, have a foolish week. Fool-on.",
  "word_count": 9173,
  "scraped_at": "2026-02-14T12:53:40.592447"
}