{
  "article_id": "5d6020c10441",
  "url": "https://www.natlawreview.com/article/gt-newsletter-competition-currents-june-2023",
  "title": "GT June 2023 Competition Currents Newsletter",
  "date": "20230613T053000Z",
  "domain": "natlawreview.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In This Issue1\nUnited States | Mexico | The Netherlands | Poland | Italy | European Union | Japan\nUnited States\nA. Federal Trade Commission (FTC)\n1. Statement regarding termination of CalPortland’s attempted acquisition of assets owned by rival cement producer Martin Marietta Materials, Inc.\nOn April 28, FTC Bureau of Competition Director Holly Vedova responded to CalPortland’s abandonment of its proposed $350 million acquisition of assets from rival Southern California cement producer Martin Marietta Materials, Inc. following the FTC’s investigation. Director Vedova stated, “[t]he transaction would have reduced the number of cement suppliers in Southern California from five to four, further concentrating an already concentrated market, and was presumptively illegal.” Had the transaction gone though, the FTC believed CalPortland could raise prices and that coordination among the remaining market participants would be more likely.\n2. FTC sues to block biopharmaceutical company Amgen from acquiring Horizon Therapeutics.\nOn May 16, the FTC announced it had filed suit to block Amgen Inc.’s $27.8 billion acquisition of Horizon Therapeutics plc. There is little direct competition between the two parties, making this a novel antitrust challenge. Horizon makes drugs for rare diseases, including Tepezza to treat thyroid eye disease and Krystexxa for chronic refractory gout. As neither of the two medications have competitors, the FTC seeks to block the transaction given agency concerns that the transaction would “enable Amgen to use rebates on its existing blockbuster drugs to pressure insurance companies and pharmacy benefit managers (PBMs) into favoring Horizon’s two monopoly products.” The FTC linked its opposition to this deal to its investigations into PBM practices, with the agency expressing concerns that Amgen had previously conditioned rebates on PBMs giving its drugs preferred placement on their list of covered medications.\n3. FTC deepens inquiry into prescription drug middlemen.\nIn June 2022, the FTC launched an investigation into the PBM industry, subpoenaing the six largest PBMs to provide information regarding their business practices. As part of its investigation into PBMs, including their impact on rebates and fees with drug manufacturers, and pharmacy reimbursements for patient prescriptions, the FTC announced on May 17, 2023, that it had issued additional subpoenas to two group purchasing organizations: Zinc Health Services, LLC and Ascent Health Services, LLC (both organizations negotiate drug rebates on behalf of PBMs). The FTC has issued these information demands under Section 6(b) of the FTC Act.\n4. Statement regarding termination of Boston Scientific Corporation’s attempted acquisition of a majority stake in M.I.Tech Co., Ltd.\nOn May 24, the FTC announced that Boston Scientific Corporation had abandoned its planned purchase of a majority stake (approximately 64%) of M.I.Tech Co., Ltd. for $230 million, following investigations by the FTC and antitrust agencies abroad. While few details as to the specific antitrust concerns have been provided, Director Vedova commented, “I am pleased that Boston Scientific and M.I.Tech have abandoned their proposed transaction in response to investigations by FTC staff and our overseas enforcement partners. The FTC will not hesitate to take action in enforcing the antitrust laws to protect patients and doctors.”\n5. FTC approves final order requiring Mastercard to stop blocking the use of competing debit payment networks.\nOn May 30, 2023, the FTC finalized its consent order (after conclusion of the public comment period) related to its December 2022 complaint against Mastercard Incorporated, claiming that Mastercard had violated the Electronic Funds Transfer Act, the Durbin Amendment, and the FTC Act. This related to Mastercard’s alleged practice of requiring merchants to route Mastercard-branded debit card payments solely through its own payment processing network (by withholding necessary information), rather than allowing the use of competing debit payment networks to process these transactions. Under the consent order, Mastercard must provide information needed to enable other payment networks to process these transactions.\nB. Department of Justice (DOJ)\nJustice Department reaches settlement in suit to block ASSA ABLOY’s proposed acquisition of Spectrum Brands’ Hardware And Home Improvement division.\nOn May 5, 2023, the DOJ announced it reached a settlement in its suit challenging ASSA ABLOY AB’s proposed $4.3 billion acquisition of Spectrum Brand Holding Inc.’s Hardware and Home Improvement division. The DOJ alleged the merger of ASSA ABLOY and Spectrum (two of the three largest competitors in residential door hardware – a $2.4 billion industry) would eliminate important head-to-head competition, thereby risking lower quality, increased prices, reduced innovation, and poorer service in the sale of premium mechanical door hardware and smart locks. As part of the settlement, ASSA ABLOY will divest assets to Fortune Brands Innovation, Inc., including two of its premium mechanical door hardware businesses and two residential smart lock businesses in the United States and Canada, along with other smart lock units in the two countries. The settlement also calls for a monitor to oversee the divestiture. The settlement is subject to court approval.\nC. U.S. Litigation\n1. Tamenang Choh et al. v. Brown University et al., Case No. 3:23-cv-00305 (D.C. Conn. 2023).\nOn May 15, the Ivy League and its member universities moved to dismiss a putative class action lawsuit two former Brown University student athletes had filed in March alleging that the Ivy League’s prohibition on athletic scholarships is a price-fixing scheme designed to raise education costs and decrease the compensation student athletes receive for their services on behalf of the schools. In their motion, defendants accuse plaintiffs of trying to “misuse the antitrust laws to force the Ivy League to change the policies that help define both the nature of Ivy League athletics and the broader undergraduate experiences available at the Ivy League’s member institutions.” Relying on the Ivy Manual, a policy book for the Ivy League member institutions, defendants argue that the policies identified in the Complaint increase, rather than decrease, competition by creating “campus cultures that do not prioritize athletics over other aspects of their education mission.” Relying on recent authority from NCAA v. Bird, defendants further argue that “[i]ndividual conferences (unlike the broader NCAA) are not standalone antitrust product markets” and therefore “lack market power.” And that other conferences that do afford athletic scholarships are “viable” picks for potential student athletes – noting that “[p]laintiffs’ own allegations affirmatively concede that high-achieving student-athletes consider, and many attend, numerous other academically and athletically rigorous schools.” In addition, pushing back on plaintiffs’ claim that the Ivy League’s policies are a per se restraint of trade, defendants argue this case should follow a rule of reason analysis in part because sports teams “must reach agreements to help define the nature of the product they offer.” Defendants also argue that individual plaintiff Tamenang Choh’s claims are time-barred because they “accrued out the Sherman Act’s four-year limitation period” and “no tolling doctrine applies or is even alleged.”\n2. Value Drug Co. v. Takeda Pharmaceuticals USA Inc. et al., Case No. 2:21-cv-03500 (E.D. Pa.).\nIn a one-page order, U.S. District Judge Mark A. Kearney denied summary judgment to both defendant Takeda Pharmaceuticals and the drug buyers that brought suit accusing Takeda of striking anti-competitive deals to limit generic competition on its anti-gout drug Colcrys. Takeda, along with the companies accused of conspiring with it, had requested summary judgment on all claims, while plaintiff and the proposed class it represents had only asked Judge Kearney to rule on their conspiracy claim and for a declaration that most of Takeda’s Colcrys patents were not infringed by the marketing of other defendants’ generics. On May 24, the Court denied the motion, explaining that “following extensive study of the varied credibility and fact-centered arguments and assumptions presented in” the parties’ motion papers he had found “several genuine disputes of material fact precluding judgment as a matter of law on all or part of each challenged claim or defense.”\n3. Mariam Davitashvili et al. v. Grubhub Inc. et al., Case No. 23-522 (2d Cir.).\nOn May 30, 2023, Grubhub and Uber Eats asked the Second Circuit to reverse a lower court’s denial of their motion to compel arbitration of customers’ price-fixing claims because the companies’ arbitration agreements include a class action waiver and a provision delegating arbitrability of disputes to the arbitrator. The appeal is from a March 16 ruling of Judge Lewis A. Kaplan holding that the companies had not shown that customers agreed to arbitrate claims and that, in any event, the arbitration clauses do not apply to the claims alleged. The lower court also criticized the companies’ arbitration clauses, which he described as “an infinite arbitration clause” that if enforced according to their terms would require arbitration of any claims between the companies and the plaintiffs – even those that have nothing to do with the plaintiff’s use of the platform.\nIn its appeal, Grubhub argues that Appellees agreed to Grubhub’s Terms of Use when : (1) they were told “‘[b]y placing your order, you agree to Grubhub’s terms of use’—with a hyperlink to the Terms of Use” and (2) when “Grubhub emailed Appellees linking to the Terms of Use, specifically informing them that the dispute resolution terms had been updated, and that use of Grubhub would manifest assent.” Grubhub also argues that the Terms of Use required arbitration of Appellees’ antitrust claims, because Appellees agreed to arbitration of “‘all’ disputes that ‘in any way relate’ to their ‘use of’ or ‘relationship with’ Grubhub” and “Appellees’ antitrust claims are related to their use of and relationship with Grubhub in multiple ways”—namely the Terms of Use “specifically address the relationship between prices restaurants charge on and off the platform, which lies at the heart of this suit.” Uber has argued that the district court erred in refusing to enforce the parties’ Delegation Clause – an agreement to arbitrate threshold disputes over arbitrability – even though Appellees failed to specifically challenge the Delegation Clause and erred in holding that the parties’ dispute is not arbitrable.\nMexico\nCOFECE initiates probe into distribution and commercialization of scopolamine in Mexico.\nOn May 2, COFECE initiated an ex officio probe for cartel conduct in the market for the distribution and commercialization of scopolamine in Mexico.\nScopolamine is medication that treats motion sickness, nausea, and colitis. Among other important uses in the health sector, it is also an antispasmodic (relieves muscle spasms) and a local analgesic. This sector is a priority for COFECE given its impact on wellbeing and quality of life.\nThe term for this investigation is up to 120 business days, starting Oct. 26, 2022, the date the investigation began, which may be extended for the same period up to four times. If at the end of the investigation there are no elements suggesting cartel conduct, COFECE may decide to close the file. However, if COFECE finds a likely violation of the Federal Economic Competition Law (LFCE), those responsible for the conduct will be called to a trial-like proceeding to present their defense.\nPursuant to the LFCE, if cartel conduct is proven, the responsible economic agents may be fined up to 10% of their revenues. Those who have aided, abetted, encouraged, or induced such practices may also be economically sanctioned. Individuals who have participated in the promotion, execution, or order of this type of agreement between competitors could be punished with up to 10 years of imprisonment, pursuant to the provisions of Article 254 bis of the Federal Criminal Code.\nThose who have participated or assisted in this type of conduct may seek to avail themselves of the benefits of COFECE’s Leniency Program.\nThe Netherlands\nA. Dutch Competition Authority (ACM) decisions, policies, and market studies.\n1. ACM sanctions egg purchasing cartel in the Netherlands.\nThe ACM fined three companies that purchase eggs (Interovo, Wulro and Global) from farmers for entering into illegal price-fixing agreements. According to the ACM, for years the involved companies carried out illegal price-fixing in violation of competition rules. Although the ACM has confirmed it imposed penalties on the companies for the infringement, it may not reveal the amount of the fine since it is bound by an interim order of the Rotterdam District Court.\n2. ACM blocks proposed acquisition of waste processor.\nOn May 23, the ACM decided to block waste processor AVR’s proposed acquisition of competitor AEB. According to the ACM, the combination would result in market dominance. If the acquisition went forward, AVR would occupy more than 60% of the market for household waste processing services in the western Netherlands and would be the largest overall operator across the Netherlands.\nB. Dutch courts\n1. Dutch Supreme Court seeks CJEU ruling regarding decisive influence.\nOn April 21, 2023, the Dutch Supreme Court ruled it would ask the Court of Justice of the European Union (CJEU) by way of a preliminary ruling whether the antitrust presumption of “decisive influence,” which is used when a parent company holds all or almost all of its subsidiary’s shares, should be used when assessing if a national civil court has jurisdiction over a follow-on damages case. The Dutch Supreme Court requires the clarification in deciding whether to accept jurisdiction in a legal dispute between Dutch beer company Heineken and Greek rival Macedonian Thrace Brewery (MTB).\nAs background, in 2015, the Hellenic Competition Commission fined Heineken subsidiary Athenian Brewery (AB) for entering into exclusive agreements with wholesalers and retailers, a fine subsequently upheld. In 2017, MTB initiated a follow-on damages claim before the Amsterdam District Court against AB and Heineken. MTB argued that Heineken – i.e., the Dutch parent company – should be held responsible for the anti-competitive actions of its subsidiary, AB, even where Heineken was not named in the Hellenic Competition Commission’s decision.\nThe Amsterdam district court rejected the complaint in 2018 on jurisdictional grounds but was overruled by the Amsterdam Court of Appeal in 2021. AB and Heineken in turn appealed that latter judgment before the Dutch Supreme Court, arguing that Dutch courts cannot preside over a case where all the major facts are linked to Greece. The Dutch Supreme Court indicated it would give the parties involved five weeks to comment on its suggested questions, after which it would refer the questions to the CJEU.\n2. Amsterdam Court of Appeal seeks CJEU ruling regarding anchor defendant doctrine.\nOn April 25, the Amsterdam Court of Appeal ruled that it intends to refer several preliminary questions on the anchor defendant doctrine to the CJEU. The judgment is part of an appeal four major Middle East utility companies initiated against an Amsterdam District Court judgment that it did not have jurisdiction over follow-on damages claims the utility companies initiated against the companies involved in the European Commission (EC)’s power cables cartel decision.\nThe four utility companies are claiming over €350 million in damages in the Netherlands, using Dutch-based Draka under the so-called anchor defendant doctrine. Draka itself is not addressed in the EC’s decision as such, although it belongs to the same economic entity as one of the cartel participants.\nThe Amsterdam Court of Appeal is seeking CJEU guidance on whether Draka qualifies as an anchor defendant. Essentially, the court is asking if there is a close enough connection for a claim against an anchor defendant who did not directly participate in the cartel but managed the shares of a cartel participant. In particular, the court is asking the CJEU whether (a) the anchor defendant and co-defendants must belong to the same company under the doctrine, and (b) the other defendants must be actual cartel participants or merely entities of the named cartel participants.\n3. Dutch court annuls ACM decision to block Bergman Clinics/Mauritskliniek merger.\nOn Dec. 23, 2021, the ACM blocked health care provider Bergman Clinics’ acquisition of Mauritskliniek. The ACM found that Bergman Clinics already had a very strong position vis-à-vis health insurers and determined the contemplated transaction would give Bergman Clinics an even stronger dominant position.\nOn May 12, 2023, the Rotterdam District Court ruled that the ACM had not sufficiently demonstrated that Bergman was indispensable for health insurers and insureds. Therefore, the court annulled the ACM’s decision, but the ACM may appeal this decision.\nPoland\nA. Significant amendment to Polish Act on Competition and Consumer Protection takes effect.\nOn May 20, the amendment to the existing Act on Competition and Consumer Protection finally came into force. The scope of the amendment is broad and covers in particular:\ni. Implementation of the ECN+ Directive (Directive (EU) 2019/1 of the European Parliament and of the Council of 11 December 2018 to empower the competition authorities of the Member States to be more effective enforcers and to ensure the proper functioning of the internal market), which aims to increase the effectiveness of enforcement of EU competition law, including strengthening the position of the President of the Office of Competition and Consumer Protection (UOKIK President);\nii. Stricter penalties, including the introduction of parental liability.\nPlease see the May issue of Competition Currents where we discuss the new law in detail.\nB. UOKiK President launches explanatory proceedings regarding major producers of French fries and chips.\nThe UOKiK President announced that he will conduct explanatory proceedings regarding major producers of French fries and chips, including Frito Lay, McCain, Farm Frites, The Lorenz Bahlsen Snack-World, Intersnack and Iglotex.\nThe UOKiK President intends to verify whether these producers unfairly used a contractual advantage in their relationships with potato suppliers. The regulator will determine whether the rights and obligations under supply agreements were fairly balanced between the parties, including with respect to terms of supply, setting compensation for farmers, and quality tests of supplied potatoes.\nAt this stage, the proceedings are not directed against any specific entity. However, if explanatory proceedings confirm the regulator’s suspicions, the UOKiK President may launch proceedings against specific companies. If the UOKiK President finds an infringement of the prohibition of unfair use of contractual advantage, he may fine the perpetrator up to 3% of the company’s annual turnover.\nC. UOKiK President issues practical guidelines for displaying discount prices.\nAs of Jan. 1, 2023, entrepreneurs organizing any form of promotion or sale must display not only the discounted price but also the lowest price from the 30 days preceding the reduction. Such obligation results from the implementation of Directive (EU) 2019/2161, known as the Omnibus Directive, and aims to eliminate fictional discounts.\nThe provisions apply to all entrepreneurs, including online platforms and price comparison websites. It also applies to entrepreneurs outside the EU if they sell directly to Polish consumers.\nSince the beginning of the year, the UOKiK President has been investigating how the new regulations are being applied, and it turns out that entrepreneurs have been struggling to apply them in practice. The UOKiK President noted that prices are not calculated correctly, and even if they are, they are displayed in an unclear and misleading way. Consumers also have complained about the practical application of the new regulations.\nFor these reasons, the UOKiK President has issued practical guidelines on how to inform consumers about discounts, aiming to address the most common problems. The guidelines explain in particular:\ni. What “information about discount” is and in what situations the new law should apply;\nii. How discounted prices should be calculated for displaying information about discounts;\niii. How discounted prices should be displayed in order not to mislead consumers;\niv. If and how the new regulations should be applied in specific cases, such as last-minute offers, loyalty programs, sale of flawed products, conditional or bundled sales, or discounts being gradually increased over a period of time.\nItaly\nItalian Competition Authority (ICA)\n1. ICA opens investigation into Italian Soccer Federation for alleged abuse of dominance.\nDuring its meeting on May 16, 2023, ICA resolved to open an investigation for alleged abuse of dominance against the Italian Soccer Federation (“Federazione Italiana Giuoco Calcio”, FIGC).\nFIGC is an association that unites all the sports clubs and associations involved in soccer sports in Italy, both at the professional and amateur levels (i.e., the Lega Serie A, the Lega Serie B and the Lega Pro, the Women’s Soccer Division, the National Amateur League, the Italian Referee Association, etc.). Thus, FIGC functions as a central entity to which the Italian National Olympic Committee (CONI) entrusts exclusive power of regulation and coordination of all soccer-related activities.\nAccording to ICA, FIGC may have abused its incumbent position in the organization of amateur and youth-level competitions in the youth sector through a number of allegedly intimidating acts (e.g., deferrals before the competent Territorial Federal Court or amendments to the existing regulations). ICA says these acts hindered – if not eliminated – the participation of amateur sports associations affiliated to FIGC itself to participate in youth tournaments of a play/amateur level organized by Sports Promotion Bodies in the Campania Region.\nICA already has carried out inspections at the premises of FIGC Campania and FIGC Youth and School Sector, and the investigation should be closed by June 30, 2024.\n2. ICA issues new guidelines on settlement procedures pursuant to Article 14-quater of Italian Competition Law.\nOn May 22, ICA published procedural guidelines for application of Article 14-quater of the Italian Competition Law (Guidelines). The provision, which had been introduced in the Italian antitrust framework in August 2022, allows for undertakings subject to ICA investigations into violations of rules on anticompetitive agreements or abuse of dominance to have access to a settlement procedure.\nThe procedure described in the Guidelines provides for discussions among the ICA and the investigated undertakings and the presentation of a settlement proposal by the parties to the settlement, which would be a proposal the ICA can either accept or not. If ICA does not accept the proposal, the investigation will be back on the ordinary procedure track and, more importantly, ICA will not be able to use the acknowledgments made and the evidence collected during the settlement procedure against the parties to the proceeding.\nFurthermore, to make settlement procedures more appealing to undertakings, the Guidelines establish that if the successful conclusion of a settlement procedure occurs in the context of an investigation that does not deal with a secret cartel, ICA will agree to a 20% reduction of the fine to the adhering undertakings (reduction applied after the application, if needed, of the 10% of the turnover ceiling). If, on the other hand, the settlement procedure allows the successful closing of an investigation of a secret cartel, the fine reduction will be limited to 10%. If applicable, such reduction would be added to the one provided for with the adoption of antitrust compliance programs.\nThe Guidelines will be applicable to all investigations opened following their publication, as well as to all ongoing investigations in which ICA has not yet issued its statement of objections.\nEuropean Union\nA. European Commission (EC)\n1. EC conditionally approves MOL’s proposed acquisition of OMV Slovenija.\nFollowing an in-depth investigation (i.e., Phase II review), the EC approved MOL’s acquisition of OMV Slovenija, subject to certain conditions. The proposed remedies, whereby MOL would divest a nationwide retail network of 39 fuel stations in Slovenia to the Shell Group, removed EC competition concerns involving the reduction from three to two retail motor fuel operators in Slovenia in a market with high barriers to entry and expansion.\n2. EC sends statement of objections regarding Korean Air’s proposed acquisition of Asiana.\nIn February 2023, the EC opened an in-depth investigation into Korean Air’s proposed acquisition of Asiana, the two largest airlines in South Korea and each other’s main competitors. The EC has concerns that the contemplated transaction will restrict competition in the provision of passenger and cargo air transport services between the European Economic Area and South Korea and issued a warning on May 17, 2023. The EC has until Aug. 3, 2023, to conclude its investigation and decide on the contemplated transaction.\nB. EU General Court\n1. EU General Court annuls two EC decisions that approved aid to Lufthansa and SAS during the COVID-19 pandemic.\nOn May 10, 2023, the EU General Court (GC) annulled two EC decisions on state aid given to the airlines Deutsche Lufthansa AG (aided by Germany) and SAS AB (aided by Denmark and Sweden) in the context of the COVID-19 pandemic.\nThe EC deemed both measures compatible with the internal market under Article 107(3)(b) TFEU and the Communication from the Commission on the Temporary Framework for State aid measures to support the economy in the current COVID-19 outbreak (TF).\nThe GC’s rulings can now be appealed before the Court of Justice of the EU:\na. Lufthansa Case\nIn the judgment related to Lufthansa (joined cases T-34/21, T-87/21) the GC annulled the EC decision to approve the recapitalization of the airline by Germany, amounting to 6 billion euros, in the context of the COVID-19 pandemic. The measure at issue consisted of three different elements, namely an equity participation of approximately €300 million, a silent participation that was not convertible into shares of approximately €4.7 billion (Silent Participation I), and a silent participation of €1 billion with the features of a convertible debt instrument (Silent Participation II).\nTwo airlines, Ryanair DAC and Condor Flugdienst GmbH, brought two actions for annulment of the decision. The GC upheld the claims on the following grounds:\ni. Germany had infringed point 49(c) of the TF, which requires that, to be eligible for a recapitalization measure, the beneficiary must be unable to obtain financing on the markets at affordable terms. Indeed, according to the GC, nothing in the contested decision indicated that the EC assessed whether Lufthansa could have raised a non-negligible part of the necessary financing on the markets, for instance by providing a collateral.\nii. The price of the shares at the time of the entry of the German State into the capital of Lufthansa did not constitute an alternative step-up mechanism, which was required by point 62 of the TF to incentivize the beneficiary to buy back the State capital injections. Likewise, Silent Participation II, at the time of its conversion into equity, was not accompanied by a step-up or similar mechanism.\niii. Lufthansa enjoyed significant market power at other airports in addition to the only two the EC assessed, namely Frankfurt and Munich. Indeed, the GC found that the EC ignored several factors that could provide information on Lufthansa’s market share in other airports, such as the number of flights and seats offered to and from the airports concerned.\niv. The remedies Germany proposed to attempt to prevent Lufthansa from increasing its market power in those markets where it already has significant market power – i.e., the divesture of slots in the Frankfurt and Munch airports – were deemed insufficient because the slots had already been assigned to existing competitors in the two airports since it was determined that they could not be assigned to new entrants, and the assignments were insufficient to preserve competition.\nb. SAS Case\nIn the judgment related to SAS (case T238/21), the GC annulled the EC decision to approve the recapitalization of the airline by Denmark and Sweden, amounting to 1 billion euros, in the context of the COVID-19 pandemic.\nThe measure at issue consisted in the subscription by the two Member States of two recapitalization instruments: first, State hybrid notes (the hybrid capital instrument); and second, new common shares (the equity instrument). Furthermore, the recapitalization plan provided for the conversion of certain existing hybrid notes and bonds held by private actors into either new commercial hybrid notes or common shares.\nRyanair brought an action of annulment of the EC decision before the GC. Indeed, the GC only partially upheld the claims of the applicant, as it found that:\ni. The hybrid capital instrument was accompanied by a proper step-up mechanism, given that it provided for remuneration for the State hybrid notes by means of an interest rate which increases over time.\nii. The equity instruments subscribed by Denmark and Sweden were not accompanied by any step-up mechanism, within the meaning of point 61 of the TF.\nHowever, the GC annulled the EC decision stating that partial annulment of an act of the EU is possible only if the elements it sought to have annulled could be severed from the remainder of the measure.\nIn the present case, although the measure at issue was composed of two instruments, according to the GC, it nevertheless concerned a single measure aimed at the participation of two Member States in the recapitalization of SAS. Consequently, the unlawfulness found in connection with the equity instrument affected the compatibility of the whole of the measure at issue with the internal market.\nJapan\nA. JFTC cautions Japanese securities company for problems regarding initial public offering (IPO) price determination method.\nA Japanese securities company was a lead manager for 21 companies listed on the Tokyo Stock Exchange (TSE). The securities company offered an estimated issue price lower than the companies’ claims for two of these listed companies. According to the Japan Fair Trade Commission (JFTC), the opening prices of IPOs were more than double their IPO prices, and the two companies could have raised more money.\nIn the past JFTC report on the IPO pricing, they stated that “if a lead manager in a dominant position unilaterally set the IPO price or otherwise conducted the transactions in a manner that unjustly disadvantages the newly listed company in light of normal business practices, there is a risk that this could be problematic under the Antimonopoly Act.”\nIn this case, though the JFTC has not deemed the situation a violation of the Antimonopoly Act because the securities company has not set unreasonable prices without consulting with the two companies, the JFTC cautioned the company not to engage in any conduct that would constitute a violation of the Antimonopoly Law in transactions related to initial public offerings in the future.\nB. JFTC approves commitment plan with approximately 750 million yen in refunds.\nOn April 6, the JFTC approved a pharmacy’s commitment plan that includes a refund of approximately 750 million yen to about 80 suppliers and 750 vendors. JFTC suspected that the pharmacy abused its superior position by returning unsold goods and other items affected by COVID-19 to the supplier without the supplier’s consent. The JFTC had expressed that these actions would be problematic as abuse of a superior position even if COVID-19 influenced them and even if they were agreed upon with the suppliers.\nA commitment plan is a procedure whereby a company is exempted from cease-and-desist or surcharge payment orders from the JFTC by voluntarily “committing” itself to improvement through a plan in response to a suspected violation of the Antitrust Act.\nRead previous editions of GT’s Competition Currents Newsletter.\n1 Due to the terms of GT’s retention by certain of its clients, these summaries may not include developments relating to matters involving those clients.",
  "word_count": 5079,
  "scraped_at": "2026-02-14T12:14:54.567959"
}