{
  "article_id": "5d61b47f64a8",
  "url": "https://liverpooloffside.sbnation.com/liverpool-fc-women-news-results/2023/6/17/23764474/matt-beard-on-rebuilding-and-moving-forward-in-the-wsl-liverpool-fc-women",
  "title": "Matt Beard On Rebuilding and Moving Forward in the WSL",
  "date": "20230617T160000Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After Liverpool’s triumphant return to the WSL in 2022, it was hard not to get our hopes up for what their first season back in the top flight would bring. However, an early, season-ending injury to talisman and high scorer Leanne Kiernan, as well a string of early season poor results, jolted up all back down to Earth.\nMatt Beard On Rebuilding and Moving Forward in the WSL\nThe manager looks to build on Liverpool’s solid seventh place finish next season.\nOnce thoughts of winning the title off of Chelsea were gone, we all knew that the team’s only goal should be survival. Finishing seventh out of 12 teams was mission accomplished, with Kiernan back on the mend and spirits high.\nMatt Beard is looking forward to next season as the Reds continue to rebuild into the force that they had been. The key is slow and steady progress in making their way up the table.\n“We have ambitions at this football club to challenge. We know it’s not going to happen overnight but we’ve had a good start back in the WSL and now it’s about kicking on again,” Beard said.\n“Everton and Aston Villa had a good season last year and then obviously you’ve got the top four, which long term is our aspiration. As I’m always saying, we want to compete and do as well as we can – but next year is about improving on last year and trying to break into that five and six and see how far that can take us.”\nAs for the summer, the men aren’t the only Liverpool team planning a busy summer. Beard plans to bring in his own crop of new players to freshen up the team.\n“We’re looking at probably no more than seven. What we want to try to make sure we do [is] to improve the depth of the squad so it raises the standards in training, it raises the competition for places. I think, for me, that’s the most important thing,” he said.\nWith a year in the top tier under the belt, the Reds should find it easier to recruit high-level talent to their team. The debacle with Kiernan showed how thin the team is up front without their leading lady, so efforts should be made to bring in someone else to help score goals besides Katie Stengel.\nAnother consideration is the World Cup happening next month. Liverpool have several players who will be off representing their countries in Australia and New Zealand, which will truncate the pre-season training. It will also make the transfer window a bit trickier, unless they can get their business done before players are set to leave.\nOverall, there is a sense of optimism within the club and with the fans. There’s also the hopeful feeling that outside pressure has forced the owners’ hands and made them put more money, effort, and backing into growing their women’s side into the elite force their men’s side is.\nThere’s still plenty of women’s football left to watch this summer, and plenty more opportunities to see the likes of Shanice van de Sanden, Kiernan, and captain Niamh Fahey fight to lift the ultimate football prize before the club season resumes.",
  "word_count": 539,
  "scraped_at": "2026-02-14T13:08:22.587407"
}