{
  "article_id": "5d738db84173",
  "url": "https://www.theglobeandmail.com/opinion/letters/article-carbon-tax-policy-popularity/",
  "title": "Has the carbon tax failed ? Plus other letters , March 21 :  Warrants a national referendum  ",
  "date": "20240321T084500Z",
  "domain": "theglobeandmail.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Show me the money\nRe “We have met the enemy of the carbon tax, and it is us” (Report on Business, March 19): The carbon tax should never have become a political football, but that’s mostly due to the state of politics and not to the merits of the policy.\nCitizens’ Climate Lobby Canada has advocated for the carbon fee and dividend policy for more than a decade. It’s been frustrating for us to carry on proposing, protecting and strengthening this policy.\nFinally, some big players are speaking out in support. The Royal Bank of Canada, one of the biggest banks in the world, supports carbon pricing. I’ll wager that they have a larger climate department than our government (”RBC plans to bolster lending for decarbonization, renewable energy” – Report on Business, March 6).\nNow Elon Musk has released statements that sound as though he’s singing from our songbook. Does anybody want to argue with Mr. Musk? Go ahead. I dare you.\nCathy Lacroix Toronto\nRe “Political hot air has scorched the carbon tax” (Editorial, March 19): I think the carbon tax warrants a national referendum, with the government postponing the April 1 increase until results are counted.\nIt would separate this controversial part of climate policy from political parties. It would amount to a referendum on whether Canada is to be an active participant against climate deterioration.\nIf this issue just goes into the mix during the next federal election campaign, it would be tied up with who is or isn’t disenchanted with Justin Trudeau and who approves or disapproves of Pierre Poilievre.\nJohn Goyder Oakville, Ont.\nOption A: Axe the tax. Result: profligate carbon fuel use; global heating; violent weather; crop failure; death and destruction.\nOption B: Keep and increase the levy on carbon fuel. Result: Clean alternatives become cost-competitive; lifestyles become more modest.\nWhich will Canadians choose? Based on polls, it looks clearly to be option A.\nBrian Swinney Burlington, Ont.\nOur thermostat has been set between 16 C and 19 C for most of the year for a couple of decades. We drive roughly the same mileage every year.\nBut based on my natural gas and gasoline consumption – two commodities where the carbon tax can be calculated – and knowing that hidden costs trickle down through many items we purchase, I am certain we do not break even with the carbon rebate, let alone come out ahead. The whole idea seems to defy logic, whereby government takes my money, processes it through the bureaucracy, invests some of it in climate action then miraculously gives it back.\nIn our house, and I suspect in many others, the carbon tax has failed because it doesn’t achieve the goal of reducing consumption. To suggest that it failed because government didn’t properly sell it suggests that we are not very bright.\nJudith White Okotoks, Alta.\nNot fantastic\nRe “Plastics recycling has consequences for people and the planet – and it may just be a scam” (Opinion, March 16): I am grateful to contributor Adnan Khan for his diligence in tracking down where our plastic waste ends up. His finding it out of sight and out of mind in toxic, smouldering mountains across the planet, in less fortunate nations, is both distressing and, sadly, unsurprising to me.\nI’d like to turn the lens around and focus on the source of this scourge. Who is filling and distributing all the single-use plastic containers that line retail shelves? Cleaning products, food products and virtually all non-solid consumer products are contained in single-use plastics.\nLarge corporations are the main ones doing this. It’s an excellent way to contain, ship, brand and divide vats of product into small, pricey consumables.\nYou’d think we could figure out a way to decant all this stuff into reusable containers, right? Let’s explore ways to make plastic a less profitable tool for corporations.\nTom Oak Victoria\nLike a deer trapped in the headlights of an oncoming vehicle, most Canadians watch helplessly as the climate warms and environmental disasters descend upon us and the rest of the world.\nWe seem unable to take meaningful action to avoid disaster. We know we should ban a great many forms of plastic. We know most can’t be recycled. We know we have to reduce consumption in the developed world. We know that resources on our planet are finite.\nYet economists are alarmed when consumption decreases. Yet it is often taboo to mention overpopulation. Yet we know that nothing can grow forever.\nIt seems increasingly unlikely that we will step out of the headlights in time.\nPatty Benjamin Victoria\nGoal!\nRe “Women’s sports is big business. Larry Tanenbaum gets it. MLSE doesn’t” (Report on Business, March 19): It was great to read about the popularity of women’s sports, particularly with respect to the new Professional Women’s Hockey League. Not to be overlooked are the remarkable developments in Canadian women’s soccer.\nOlympic medalist Diana Matheson is leading the establishment of a professional women’s soccer league in Canada called Project 8. Women’s leagues in Britain and the United States are drawing large audiences, and Canadian players are having a noticeable impact in these competitions.\nProject 8 is a huge opportunity to invest in women and women’s sports. It will be wonderful to cheer on these players, on home soil, in 2025.\nLaura Smith Ottawa\nViewing guide\nRe “Niagara Falls braces for record crowds hoping to take in solar eclipse’s path of totality” (March 19): The total eclipse is a path, not a point.\nIn Ontario, it’s viewable in the Queen Elizabeth Way corridor from Hamilton to Niagara Falls, along the entirety of the north shore of Lake Erie, from Fort Erie to Leamington and as far away from the lake as Brantford and St. Thomas. It’s also viewable from the Highway 401 corridor along the north shore of Lake Ontario and the St. Lawrence River, from Port Hope to Montreal. Toronto is not the centre of the universe and does not get the total eclipse.\nFor nice viewing, try stopping at a quiet roadside park in the area described. Need an overnight stay? How about a cost-effective, small-town motel.\nWant gridlock traffic, wall-to-wall people, lineups for everything and exorbitant hotel costs? My mistake: Niagara Falls is the place to be.\nDon Bowes Burlington, Ont.\nLetters to the Editor should be exclusive to The Globe and Mail. Include your name, address and daytime phone number. Keep letters to 150 words or fewer. Letters may be edited for length and clarity. To submit a letter by e-mail, click here: letters@globeandmail.com",
  "word_count": 1093,
  "scraped_at": "2026-02-14T12:17:15.887038"
}