{
  "article_id": "5d7c4e4ccc1f",
  "url": "https://www.namibian.com.na/jamaica-defy-france-but-sweden-netherlands-win-world-cup-openers/",
  "title": "Jamaica defy France but Sweden , Netherlands win World Cup openers",
  "date": "20230723T194500Z",
  "domain": "namibian.com.na",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Perennial underachievers France were held 0-0 by Jamaica to make a frustrating start to their Women’s World Cup campaign on Sunday, but Sweden and the Netherlands both won by slender margins.\nFrance have never lifted the World Cup despite the strength of their women’s domestic league and were defied by a battling Jamaica in the Sydney rain in front of nearly 40,000.\nHerve Renard’s France, one of the pre-World Cup favourites along with holders the United States and England, hit the woodwork late on and had more possession and chances, but Jamaica refused to fold.\nThe Jamaicans only made their Women’s World Cup debut in the previous edition in 2019 and lost all three games, so this point was a precious first in the competition for them.\n“I would say it’s the number one result we have had so far, men or women — I would put it there,” coach Lorne Donaldson declared.\nThe only sour note was the dismissal in injury time of star striker Khadija Shaw for a second yellow card. She will miss their second game of the tournament against Panama as a result.\nThe Jamaicans, ranked 43 in the world to France’s five, celebrated wildly at the final whistle and defender Deneisha Blackwood was paraded in the air.\n“You’re playing a team like France who are just fantastic. I mean, just looking at the rankings, you would say that result on this stage has to be number one,” Donaldson said.\nBrazil play Panama in the same group on Monday.\nNervy Swedes\nIn the first match of day four of the tournament in Australia and New Zealand, Sweden were given a scare by South Africa before winning 2-1.\nThe third-ranked Swedes fought back from a goal down and conjured up the winner in the 90th minute through Arsenal defender Amanda Ilestedt, much to the relief of their fans in miserably wet conditions in Wellington.\nA goal early in the second half by Hildah Magaia — in which she suffered a match-ending injury — had given South Africa hope of an upset in front of 18,317 spectators.\nBut that was soon cancelled out by Barcelona star Fridolina Rolfo before Ilestedt’s late intervention, heading home from close range for a hard-fought victory.\nItaly face Argentina on Monday, also in Group G.\nSweden coach Peter Gerhardsson said “nerves and tension” were behind a shaky start to their World Cup campaign.\n“It’s OK to be nervous but you need to have the courage to still make that pass,” Gerhardsson said.\nThe Dutch, losers 2-0 to the United States in the final four years ago, had less trouble against debutants Portugal in the New Zealand city of Dunedin.\nDefender Stefanie van der Gragt scored with a powerful header on 13 minutes with what turned out to be the winner.\nThe Netherlands now face the United States on Thursday in a rematch of their final, with Group E supremacy at stake.\nSunday’s match in Dunedin, played in front of a crowd of nearly 12,000, saw the Dutch have more of the ball but Portugal threatening on the break.\nPortugal’s first shot of the game finally arrived in the last 10 minutes but the Dutch were ultimately fairly comfortable winners.\nEvacuated\nTwo-times former champions Germany enter the fray on Monday when they face World Cup debutants Morocco.\nGermany are another of the favourites to win the tournament but their coach Martina Voss-Tecklenburg warned that women’s football has never been more competitive.\n“All the games are tight, women’s football teams have come ever closer,” the former international player said on the eve of her team’s opening match.\n“All the countries coming here are not only proud to be at the World Cup but they absolutely have the quality to play here and to pose problems.”\nCo-hosts New Zealand return to action on Tuesday to begin the second round of group matches.\nThe New Zealand team had to be evacuated on Saturday after a fire at their hotel in Auckland.\nDefender CJ Bott called it “not ideal” and “not a situation anyone wants to be in”.\n“We went down the fire exits,” she said.\n“One was a bit smoky but the majority of us got down the other exit.”\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 807,
  "scraped_at": "2026-02-14T13:01:12.864499"
}