{
  "article_id": "5dac4c0c0bba",
  "url": "https://www.centralwesterndaily.com.au/story/8143101/ladder-predictions-and-players-to-watch-2023-woodbridge-cup-seasons-blockbuster-preview/?cs=104",
  "title": "2023 Woodbridge Cup season preview for first grade | Central Western Daily",
  "date": "20230411T071500Z",
  "domain": "centralwesterndaily.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "With rugby league so close you can almost taste it, the Central Western Daily has put together a huge Woodbridge Cup season preview to get the mouth watering.\nSubscribe now for unlimited access.\nor signup to continue reading\nFrom players to watch out for, to the ever-popular ladder predictions, we've dug deep to bring you the best coverage on offer.\nManildra Rhinos\n2022 finish: 1st\nCoach: Ben McAlpine\nIs it possible for this side to get even stronger?\nWith Will and Luke Petrie continuing on at Manildra, McAlpine still involved and a host of local players returning from last year's Woodbridge Cup premiership side, you'd be convinced the Rhinos could go back-to-back just on that alone.\nThe additions of Joey Lasagavibau and Saulala Houma make this side even scarier, and makes the predicted finish for Manildra easy.\nPlayer to watch: Saulala Houma\nThe man is a human wrecking ball.\nThe former Newtown Jets man will run over opposition defences quite easily and it's scary to think how many metres he'll make in this competition.\nPredicted finish: 1st\nCanowindra Tigers\n2022 finish: 2nd\nCoach: Ronnie Lawrence\nThe Tigers will probably look at last season as the one that got away.\nTom Clyburn Oval was full of despair when Manildra scored an extra-time win in the preliminary final, and there's no doubt revenge will be on Canowindra's mind.\nFormer coach Kevin Grimshaw has returned to St Pat's and Ronnie Lawrence is the new man in charge.\nHaving been around the traps for a long time, Lawrence knows what works and should lead Canowindra to another successful season.\nPlayer to watch: Jakiel Mariner\nA former under 20s state of origin player, Mariner is a new signing at the Tigers and will be an exciting addition to the squad.\nAs it goes out at Canowindra, any player has the full support of the fans and there'll be plenty to cheer about when this man enters the field.\nPredicted finish: 2nd\nTrundle Boomers\n2022 finish: 3rd\nCoach: Brad Watt and Adam Hall\nBoom, boom, boom, you can never count Trundle out.\nLast year it was hard to judge how the Boomers would go, and a round three 30-0 loss to Canowindra, followed by another heavy defeat to Peak Hill meant the start of its season was inconsistent.\nBut they're a champion side out West, and the Boomers came home strong for a third placed finish before bowing out in straight sets of the finals.\nA semi-final loss at home to Orange United Warriors would've lit a fire in the Trundle boys, and there's no doubt they'll come out strong.\nAdam Hall is unlikely to feature on the field, but his fingerprints will be all over the side with him and Brad Watt co-coaching.\nTrundle took first blood with a Woodbridge 10s victory and they'll be determined to return to past glory.\nAny side that features Wales international Connor Farrer can't be left out of contention. The reigning Woodbridge Cup player of the year is a gun - there's no doubt about it.\nCo-coach Watt said the aim will be to continue Trundle's love of finals footy.\n\"We've been competitive for the past five or six years, anything short of finals would be disappointing - we'll just aim to make finals to start with and then anything can happen from there,\" he said.\nPlayer to watch: Matt Bermingham\nWhen Watt was originally appointed co-coach, there was a definite excitement at seeing what Trundle's younger players have to offer.\nCentre Matt Bermingham has been with the club for around three to four years, having started in Youth League and the Parkes-based man is the one Watt's anointed as his side's player to watch.\n\"There's a couple of young boys that might have a breakout year,\" he said.\n\"Matt Bermingham has had a good pre-season, been training on his own and he's looking fit and strong ... he's a good kid.\"\nPredicted finish: 5th\nOberon Tigers\n2022 finish: 4th\nCoach: Abel Lefaoseu\nIt took coach Lefaoseu almost half a season to get the side he wanted last year, and once he got his way as Oberon were a force to be reckoned with.\nUnfortunately, the football gods were on Manildra's side in the grand final, as the Rhinos produced their best performance of the year.\nThe Tigers have signed Blake Fitzpatrick from St Pat's this season, and the seasoned campaigner will be crucial as he steps back out in black and gold again.\nPlayer to watch: Caylib Marston\nPredicted finish: 4th\nPeak Hill Roosters\n2022 finish: 5th\nCoach: Blaize Fuller\nA sensational start to last season was hurt by Peak Hill going through a mid-season rut.\nIf the Roosters are to go better this year, they'll need to address what went wrong and there's probably none better to do that than 2022 Woodbridge Cup coach of the year Blaize Fuller.\nLast year, Peak Hill were only two games away from the grand final when it was knocked out in week two by eventual winners Manildra.\nAfter winning the award, Fuller said he was determined to win a competition with Peak Hill and as one of the best fullbacks in the competition, he'll need to lead from the front again if they are to succeed.\nThere's no doubt when Peak Hill are on, they look like competition winners, however discipline is the key and that's all that'll separate them from glory.\nKiyan Shaw and Mitch Hutchings will be big losses for Peak Hill, but additions from Dubbo like Josh Ferguson will help soften the blow along with locals returning to the side, according to Fuller.\n\"Seeing our success last year and what we can do, they want to come back and go further,\" he said.\nIn terms of goals, Fuller isn't holding back.\n\"I want to win it all,\" he said.\nPlayer to watch: Torin Hando\nWoodbridge Cup is full of talented hookers, and Hando is right up there with the best of them.\nThe creative hooker has been a consistent fixture in the Roosters jersey, and you'd argue his form has never changed that whole time.\nIf Peak Hill are to win the competition, Hando and Fuller will be its best.\nPredicted finish: 6th\nOrange United Warriors\n2022 finish: 6th\nCoach: Ethan Bereyne\nLike the Roosters, Orange have a side capable of winning the competition.\nHowever, discipline is what proves costly for the Warriors whenever a defeat comes its way.\nThe semi-final at Oberon was there's to win, however the match fell away and unfortunately the Warriors were bundled out.\nNow with Bereyne in the side, United will have one of the most damaging second-rowers in the competition while centre Dion Jones will be crucial on the edge too. Bereyne confirmed him and halfback Matty Fuller will operate on the right side while the returning Tyrrell Charters and Jones will work together on the left.\nFormer CYMS player Isaac Lettice will also play fullback, replacing Ben French and Josh Dugan.\nBereyne is feeling positive heading into the season.\n\"I've got nothing to complain about, we've got real good numbers, every one is listening and learning and made it very easy for me,\" he said.\n\"Obviously to win it is the goal, but getting through our first five rounds would be a start, I want to see how we get through that.\"\nPlayer to watch: Dion Jones\nFor Bereyne, one of the men joining him from CYMS will be key to his side's fortunes this year.\n\"When he's on, he'll be a very hard mark to stop - same with the likes of big Will Cusack,\" he said.\n\"Him and Tyrrell will connect real well on that left edge - they've had a real good connection at training, everything they've done on the opposed side they've done real well together.\"\nPredicted finish: 7th\nCondobolin Rams\n2022 finish: 7th\nCoach: Jake Haddrill\nOften sides, from NRL right down to Woodbridge Cup, are criticised for lacking identity - when it comes to Condobolin this year, that won't be problem.\nThe Rams in 2023 will be completely different to sides from the past few seasons.\nThe identity will be based off hard-work and defence - then throw in a sprinkling of magic from Tryonne Johnstone and you've got a strong side.\nThis year Condobolin will look to build on the solid base formed from the work of 2022 captain-coach Mitch Dinsey, who can now fully focus on his role in the halves.\nHaddrill is the signing of the season, and was skipper when Condobolin won its last Cup in 2016. He then went on and improved his rugby league IQ with Forbes, winning two premierships.\nAnd it's some advice he received at the Magpies, that Haddrill will lean on to inspire his troops.\n\"At Forbes, Camo Greenhalgh said to our whole that 'success comes to those that never give up' and that's what I'm bringing back here now,\" he said.\nPlayer to watch: Reece Poulson\nHe looks, and plays, like Reagan Campbell-Gillard.\nOften the hard-working front-rower goes through a season unnoticed, but the Central Western Daily sports desk saw a glimpse of what Poulson can do.\nHe won't have the blinding right foot step at the line, but he'll work hard every game and form the identity that Haddrill is looking for.\nPredicted finish: 3rd\nCSU Mungoes\n2022 finish: 8th\nCoach: Blake Armstrong\nThe social media kings and queens. If this competition came down to the quality of social media presence, the Mungoes would be an easy first.\nBut it's a pair of mates that might help the students squeak into the finals this time around.\nRay Sargent and Ryan Thompson have been named as co-captains for the 2023 campaign, with the former excited to get things underway.\n\"I was pretty happy to be named alongside Ryan. He's a good mate of mine since we've grown up together as well. That's really awesome.\n\"Ryan and I went to school together at Oberon. This is his first year at the club after coming across from Oberon Tigers. Partnering with him is a pretty special feeling.\"\nPlayer to watch: Ryan Thompson\nThompson comes across to the Mungoes after being a part of the Tigers' grand final run in 2022.\nWith a side expected to comprise of a \"50-50\" split between new and returning players, big game experience will be even more valuable than it normally is.\nPredicted finish: 10th\nGrenfell Goannas\n2022 finish: 9th\nCoach: Ty Ashe and Daniel Harveyson\nCo-coach Daniel Harveyson isn't shying away from his side's goals. The Goannas want to return to finals.\n\"We want to be in finals footy, that's the goal, looking at the side we're starting to build I think that'll be pretty achievable,\" he said.\n\"I think we'll give it a good shake this year after a couple of poor years.\"\nThat strong squad is based off an aggressive recruitment strategy, with Harveyson stating they 'got strung in the last few seasons not getting in early enough'.\nThose players will be some former locals now living in Orange, with a handful from Cowra and Young. Orange City flanker Darcy Holmes is one of those recruits.\nGrenfell will have to deal with the loss of gun hooker Michael Smith this season, with Frazer Ryder and Josh Edwards to step in to that role.\nLast year's Youth League captain Caleb Haddin will move up a grade and play second row.\nPlayer to watch: Toby Barrons\nCo-coach Harveyson has labelled fullback Barrons with the title.\nBarrons cleaned up at Grenfell's presentation night and Harveyson predicts 'he'll go well in a much improved side'.\nPredicted finish: 8th\nCargo Blue Heelers\n2022 finish: 10th\nCoach: Duncan Young and Blake Cramer\nWith player numbers down drastically in 2022, it was a tough year to be a first grade Cargo fan.\nBut according to coach Duncan Young, they won't have those same issues during this campaign.\n\"We've been getting good numbers for training which is always a good start,\" he said.\n\"Numbers was a big thing last year. We were struggling week to week last season just to get enough numbers. Hopefully this year we can start strong and follow through.\"\nPlayer to watch: Tom Bray\nA Cargo junior, Bray has certainly impressed with the big boys this off-season after making the leap from youth league. Club president Ashley Brown described him as a \"hard worker\" who is as deadly in attack as he is consistent in defence.\nPredicted finish: 12th\nMolong Bulls\n2022 finish: 11th\nCoach: Jack Thomas\nSpeaking to first time coach Jack Thomas, there's a certain excitement in his voice about the Bulls this year.\nThe 10s tournament was a 'lot better than expected' for Thomas with more players going to Peak Hill than he accounted for.\nWhile the Bulls may have decent numbers this season, depth will be a problem with most players swapping time between playing for Molong Magpies in rugby union and the Bulls.\nThomas has managed to bring a number of his mates into the side too, stating there's players from Dubbo, Bathurst and Parkes running out for the Bulls this season - along with Cody Ramsey's brother Jesse.\nPlayer to watch: Zac White\nThomas has given his boss White the nickname 'Mr Media' and given his halves partner the player to watch title.\nWhite has consistently split his time between playing for the Magpies and Bulls and will be a constant threat throughout the season.\nPredicted finish: 11th\nEugowra Golden Eagles\n2022 finish: 12th\nCoach: Ricky Whitton\nNo club has had a tougher off-season than the one faced by the Golden Eagles.\nThe floods that ravaged the town of Eugowra back in November 2022 levelled the town and left many homes uninhabitable.\nThe impact it had on the footy team was also felt, with the normally pristine Ian Walsh ovals left in ruins.\n\"That first session turning up all together and seeing the impact was very mixed emotions,\" first grade coach Ricky Whitton said.\n\"The oval destroyed; the fence line ripped up and swept away, likewise the goal posts. Sheds were barely salvageable.\"\nBut from all accounts, the commitment shown by the players has has been unrivalled.\n\"On and off the field, there were hands willing to help with the rebuild from everything the town and community has endured,\" Whitton added.\n\"I set up our cones and drills nonetheless and we dodged and sidestepped our way through washed up fish remains, some chickens, divots as big as tackling bags, glass, wood and bindis.\n\"A brother of mine from back home was able to take time away from his gym and personal preparations to travel across and help run us through the first couple months of training, both the men's and ladies.\n\"That extra insight and help in getting our bodies right for the start of the season, which the club and playing group is greatly appreciative, even the ones who hated the running parts, myself included, has helped immensely towards our season start.\"\nPlayer to watch: Preston Thorpe\nOne half of a halves pairing along with Jayden Seaman, the young group from Eugowra will be looking to turn some heads.\n\"A lot of the older and more experienced players of previous years have hung up the boots up due to family, work and as much as I know it hurts them, their bodies just not able to push through what their hearts want and that's play for the club they love and are proud of,\" Whitton added.\n\"I believe this year we will shock a lot with our abilities, hunger and the strength of how we have come together.\n\"We may be undersized compared to a lot of teams in the comp this year, but size in this game we love isn't measured by how big you are across the park but by what is beating in your chest and what you are playing for, and for us, this year is for community and surviving.\"\nPredicted finish: 9th\nWHAT DO YOU THINK? We've made it a whole lot easier for you to have your say. Our new comment platform requires only one log-in to access articles and to join the discussion on the Central Western Daily website. Find out how to register so you can enjoy civil, friendly and engaging discussions. Sign up for a subscription here.",
  "word_count": 2722,
  "scraped_at": "2026-02-14T13:36:03.668944"
}