{
  "article_id": "5dc10aed9efc",
  "url": "https://www.medicalnewstoday.com/articles/counting-steps-or-logging-minutes-what-is-the-best-way-to-measure-exercise",
  "title": "Is it better to measure exercise in minutes or steps ? ",
  "date": "20240521T234500Z",
  "domain": "medicalnewstoday.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- Researchers say choosing a way to measure progress on exercise should align with personal preferences.\n- They report that people who exercise the most live the longest and have a lower risk of cardiovascular disease.\n- They say counting steps or counting time both have advantages and downsides.\nThe Sesame Street character known as The Count would love modern exercise.\nThat’s because there is a lot of counting.\nBut should we count the steps or the time we spend when it comes to chasing exercise goals? Should we count at all?\nYes, says a new study. As to what we count, it probably doesn’t matter.\nResearchers at Brigham and Women’s Hospital (BWH) in Boston, a founding member of Mass General Brigham, say both time and step-based exercise targets are equally associated with having a lower risk of early cardiovascular disease and early death.\nThey say it doesn’t matter which method a person chooses, only that they choose a method aligned with their personal preferences.\nIn the new\nCurrent\nThe authors pointed out most of the existing evidence regarding health benefits of exercise came from studies in which participants self-reported physical activity. Few data points existed regarding the relationship between health and steps.\nIn the age of smart watches, step counts are now a popular metric among fitness tracking platforms.\nIn their study, the researchers searched for an answer regarding how time-based goals stack up against step-based ones?\n“We recognized that existing physical activity guidelines focus primarily on activity duration and intensity but lack step-based recommendations,” said Dr Rikuta Hamaya, the lead study author and a researcher in the Division of Preventive Medicine at BWH, in a statement. “With more people using smart watches to measure their steps and overall health, we saw the importance of ascertaining how step-based measurements compare to time-based targets in their association with health outcomes – is one better than the other?”\nThe scientists examined data from 14,399 women who participated in the Women’s Health Study and were free of cardiovascular disease and cancer.\nBetween 2011 and 2015, the participants, who were aged 62 years and older, wore research grade wearables for seven straight days to record their physical activity levels, only removing them during water-related activities or sleep.\nParticipants were given annual questionnaires to ascertain health outcomes of interest during the study period. Researchers were particularly interested in cardiovascular disease or death from any cause. The scientists followed up with participants through the end of 2022.\nThe research team discovered that the women engaged in a median of 62 minutes of moderate-to-vigorous intensity physical activity per week and accumulated a median of 5,183 steps per day.\nDuring a median follow-up of nine years, approximately 9% of the women died and roughly 4% developed cardiovascular disease.\nParticipants engaged in higher levels of physical activity (whether counted as steps or time in moderate-to-vigorous activity) were associated with large risk reductions in early death or cardiovascular disease.\nThe most active quarter of participants saw risk reductions of 30% to 40%, compared with the least active quarter.\nWomen in the top three quartiles of physical activity outlived those in the bottom quartile by an average of 2.22 months (those who tracked time) and 2.36 months (those who tracked steps) at nine years of follow-up.\nThis survival advantage persisted regardless of body mass index (BMI) differences.\nHamaya said that, while both step counting and time recording are useful in portraying health status, each has its advantages and downsides.\nFor example, step counts may not account for differences in fitness levels. If a 20-year-old and 80-year-old both walk for 30 minutes at moderate intensity, their step counts may differ significantly.\nConversely, steps are straightforward in measuring and less subject to interpretation compared to exercise intensity. Steps also capture even sporadic movements of everyday life and these kinds of daily activities are likely those performed by older people.\n“For some, especially for younger individuals, exercise may involve activities like tennis, soccer, walking, or jogging, all of which can be easily tracked with steps,” Hamaya said. “However, for others, it may consist of bike rides or swimming, where monitoring the duration of exercise is simpler. That’s why it’s important for physical activity guidelines to offer multiple ways to reach goals. Movement looks different for everyone, and nearly all forms of movement are beneficial to our health.”\nThe team said their study incorporated only a single assessment of time and step-based physical activity metrics. They also noted most women in the study were white and of higher socioeconomic status.\nThey also said the study was observational, so causal relations cannot be proven. In future studies, Hamaya said he’d collect more data via a randomized controlled trial to better understand the relationship between time and step-based exercise metrics and health.\nDr. Rohit Vuppuluri, an interventional cardiologist at Chicago’s Northwest Vascular Cardiologists who was not involved in the research, told Medical News Today that consistency is what’s important.\n“There are multiple methods to achieve your exercise goals,” Vuppuluri said. “Exercising to achieve a step-goal is great because it is a low impact exercise that can be done anywhere and anytime. Wearable devices make step counting very simple. The greatest benefit of step counting is that it can be done throughout your day so you can achieve your goal without having to set aside time for exercise.”\nHowever, Vuppuluri said counting steps may not produce a rigorous exercise regiment for some people and may take too long if done at a slower pace.\n“Setting a time-goal for daily exercise will make the workout more time efficient and the intensity can be varied to match your goals,” Vuppuluri said. “Timed workouts allow for a more structured exercise routine that can incorporate running, swimming, cycling, etc. Timed goals may not be beneficial for people who are unable to set time aside for regular exercise.”\nVuppuluri said, ultimately, both methods are effective for cardiovascular health.\n“Incorporating both strategies is the best option, so that the exercise regimen remains flexible and allows each person to tailor their fitness program to achieve their individual cardiovascular goals,” Vuppuluri said.\nDr. Julia Blank, a family medicine physician at Providence Saint John’s Health Center in California who was not involved in the research, said the study confirms people who exercise tend to live longer.\nBlank also told Medical News Today it was interesting the study also confirmed there are health benefits regardless of a person’s BMI.\nHowever, Blank also pointed out study limitations.\n“While the study followed people over a nine-year period, the actual intervention/measurement of physical activity occurred only for one week, with annual questionnaires used to monitor subsequent health effects,” Blank said. “The population studied was limited to women, predominantly white, and of higher socioeconomic status than one might get if doing more random sampling of the population, so these findings may not necessarily apply to everyone.”\nBlank also pointed out it was an observational study, not a double-blind randomized clinical trial, “so it doesn’t establish a causal relationship between exercise metrics and health, just that there is an association.”\nDr. Tracy Zaslow, a primary care sports medicine specialist at Cedars-Sinai Kerlan-Jobe Institute in Los Angeles and a team physician for Angel City Football Club and MLS team LA Galaxy, told Medical News Today the study helps translate the previous minutes of activity goals into steps-based goals.\n“The study is limited as the researchers only looked at women over 60,” said Zaslow, who was not involved in the research. “Further studies of broader populations would be beneficial. But I think it’s information that can be used to further encourage physical activity and an active lifestyle, especially for the study population of women over 60 years old.”\nZaslow said people should always check with their doctor before starting an exercise program. Then start slowly with walking and gradually increase activity.\n“Baby steps tend to be more effective than attempting long/hard workouts until you’ve built strength and stamina,” Zaslow said. “Start with just a few minutes and advance as tolerated.”\nZaslow also advised keeping it fun.\n“Find a workout buddy to help maintain motivation. Create a family challenge to encourage everyone to move more. Incorporate activity into daily life: Take the stairs instead of the elevator. Park so you are forced to walk a bit to your destination,” she said.\nDr. Dana Ryan, the director of sports performance, nutrition and education at Herbalife, told Medical News Today both methods are valuable as long as people are moving.\n“Shooting for 7,000 to 10,000 steps per day is a wonderful goal for everyone, but we also want to address intensity as well as strength training,” said Ryan, who was not involved in the research. “Exercising can be useful, but not always. You may be at the gym for 45 minutes, but it’s about the time that was actually spent doing the work.”\nRyan said 20 minutes of solid work is more beneficial than being at the gym for 45 minutes and not necessarily exercising the whole time.\n“We need to be careful with how we are counting our time,” she added. “Ultimately the more movement the better, we should aim to increase our steps but also try to add strength training and flexibility into our routine several days a week.”",
  "word_count": 1544,
  "scraped_at": "2026-02-14T12:08:43.495707"
}