{
  "article_id": "5ddfa7b5e1ac",
  "url": "https://ew.com/hallmark-christmas-movies-2025-schedule-11862290",
  "title": "Hallmark Christmas movies 2025 schedule",
  "date": "20251207T150000Z",
  "domain": "ew.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- Hallmark's 2025 \"Countdown to Christmas\" series includes 29 brand-new holiday films and TV shows.\n- Brandon Routh, Lacey Chabert, Jonathan Bennett, and Tamera Mowry-Housley are among the lineup's leading lights.\n- New movies and shows premiere weekly through Dec. 21.\nIt's the holidays, so we may as well deck the halls with boughs of Hallmark.\nThe network, a go-to for all things cozy, is celebrating 16 years of its “Countdown to Christmas” series with 29 brand-new holiday films and television series airing on the Hallmark Channel and, a day later, its streaming service Hallmark+.\nThat includes Tidings for the Season, a redemptive tale about a single mom played by Tamera Mowry-Housley who inspires a curmudgeonly newscaster to change his ways.\nAlso on deck is A Keller Christmas Vacation, which centers on a trio of siblings (played by Jonathan Bennett, Brandon Routh, and Eden Sher) touched by the holiday spirit after begrudgingly embarking on a cruise with their parents.\nPlus, Teen Wolf’s Holland Roden plays a Buffalo Bills superfan in the cameo-laden Holiday Touchdown: A Bills Love Story. And Lacey Chabert is a consultant tasked with deciding whether a child ends up on Santa’s naughty or nice list in She’s Making a List.\nIn addition to the movie lineup, Hallmark is also celebrating the season with a holly, jolly collection of new TV shows. There's Mistletoe Murders, a Christmas-themed crime series starring Grey’s Anatomy alum Sarah Drew, as well as Finding Mr. Christmas, which offers 10 aspiring actors the chance to star in a Hallmark holiday film.\nLearn more about Hallmark’s full holiday movie and television slate — and see Entertainment Weekly’s exclusive photos — below.\nMistletoe Murders Season 1\nPremieres: Oct. 17 at 8 p.m. ET/PT on Hallmark Channel, with two episodes released each week through Oct. 31\nCast: Sarah Drew, Peter Mooney\nContains: Death, mystery, and mistletoe\nOfficial description: \"Mistletoe Murders follows Emily Lane (Drew), the outwardly friendly and optimistic shop owner of a charming, year-round Christmas-themed store, Under the Mistletoe. However, her inner voice reveals a sardonic sense of humor, cunning intellect, and keen eye for details most people would miss… because Emily has a big secret. Residing in the quaint tourist town of Fletcher's Grove, Emily finds herself compelled to investigate not-so-quaint local murders. And when Emily begins her personal investigations, Detective Sam Wilner (Mooney), a smart local cop — with a crush on Emily that is not completely unrequited — begins to wonder if there's more to Emily than meets the eye.\"\nA Royal Montana Christmas\nPremieres: Oct. 18 at 8 p.m. ET/PT\nCast: Fiona Gubelmann, Warren Christie\nContains: Royalty, rurality, and romance\nOfficial description: \"Overwhelmed by her royal duties during the Christmas season, Princess Victoria of Zelarnia (Gubelmann) is ready for a change of pace. Looking to decompress in the days leading up to Christmas, she decides to take a vacation to Peaceful Pines Ranch in Montana, where she celebrated Christmas as a child with her late father. Upon arrival, she meets her dashing guide, Huntley Blaylock (Christie), who presents her and the other guests at the ranch with a rustic experience that is far from the royal treatment. This Christmas, Huntley must decide if he wants to step into a leadership role and carry on the family ranch's legacy as his parents, the owners, approach retirement. Unaware of her status as a princess, Huntley puts Victoria through the rigors of a Montana ranch experience. Victoria also plans to help Huntley revive the ranch's Christmas Holly-Day Dance. Victoria finds herself charmed by both Huntley and this different pace of life. As the two start to fall for each other, things get complicated when Huntley discovers Victoria is a princess. As Christmas approaches and her time at the ranch comes to an end, Victoria must decide if she should return to her royal life or stay in Montana with Huntley and the ranch she has grown so fond of.\"\nA Christmas Angel Match\nPremieres: Oct. 19 at 8 p.m. ET/PT\nCast: Meghan Ory, Benjamin Ayres\nContains: Two angels playing Christmas cupid\nOfficial description: \"Monica (Ory) and Michael (Ayres) are Christmas Angels tasked with bringing destined soulmates together during the most magical season of all. Typically, Angels work alone, but when the Christmas Connection Department faces the threat of downsizing, Monica and Michael are unexpectedly paired to ensure Daisy and Patrick fall in love before Christmas. The partnership isn't without its challenges: Monica is a by-the-book traditionalist who follows every heavenly rule, while Michael embraces spontaneity and delights in earthly joys like hot chocolate, snowball fights, and holiday dancing. Their clashing styles – and the undeniable spark growing between them – complicate their mission. As Christmas Eve draws near, Monica and Michael worry that their differences will keep them from completing their mission in time. But just when it seems all hope is lost, a surprising turn of events changes everything — leading to a Christmas connection no one saw coming.\"\nMerry Christmas, Ted Cooper!\nPremieres: Oct. 25 at 8 p.m. ET/PT\nCast: Robert Buckley, Kimberley Sustad\nContains: A trip to the ho-ho-hospital\nOfficial description: \"Weatherman Ted Cooper (Buckley) loves Christmas, but the past three have been terrible. This year, Ted has made up his mind that things will be different – this will be the Christmas things turn around for him. But Ted's relentless optimism is about to be put to the test as he is faced with a litany of injuries and obstacles when he travels back to his hometown of Lackawanna, N.Y., for the holidays. Within hours of arriving at his sister Kate's house, he finds himself making a trip to Urgent Care after falling off a ladder while hanging decorations. While there, he runs into Ruth Mittens, his former high school science teacher, who was always his cheerleader. He also reconnects with the charming Hope Miller (Sustad), except now she's Dr. Hope Miller, with whom he went to high school and quietly crushed on from afar. Ted is optimistic that this budding romance is the beginning of his Christmas comeback, but his looming holiday bad luck still has a few curveballs in store for him. Luckily for Ted, he won't have to face them alone – he'll have the support of Kate, Ruth, and Hope to help him overcome the challenges thrown his way and finally enjoy a well-earned merry Christmas.\"\nFinding Mr. Christmas Season 2\nPremieres: Oct. 27 at 8 p.m. ET/PT, with new episodes each week through Dec. 15\nCast: Jonathan Bennett, Melissa Peterman\nContains: A little Christmas competition\nOfficial description: \"Finding Mr. Christmas follows 10 aspiring actors who compete in a variety of outrageous Christmas-themed competitions to prove they have what it takes to land the next Hallmark leading role – from making gingerbread houses to physical challenges like horseback riding and skiing. Joined by beloved Hallmark guest judges each week, one contestant will be sent 'home for the holidays,' while the winner lands a leading role in one of this year's Countdown to Christmas movies.\"\nBaked With Love: Holiday\nPremieres: Oct. 27 at 9 p.m. ET/PT, with new episodes each week through Dec. 15\nCast: Tamera Mowry-Housley, Anna Haugh, Vaughn Vreeland\nContains: Holiday sweets galore\nOfficial description: \"In Baked with Love: Holiday, 10 talented pairs of home bakers face off in a warm-hearted, family- recipe bake-off. They will infuse their heritage, personal stories, and cherished family recipes into classic bakes with a holiday twist and serve their dishes to a panel of expert judges. In the end, one pair will be crowned the Christmas Baking Champions and win the ultimate prize of $50,000 and a chance to have one of their bakes featured in a Countdown to Christmas movie.\"\nChristmas on Duty\nPremieres: Nov. 1 at 8 p.m. ET/PT\nCast: Janel Parrish, Parker Young\nContains: Enemies to lovers, a perfectly-timed snowstorm\nOfficial description: \"Blair (Parrish) and Josh (Young) have been bitter rivals ever since they trained together at The Basic School in Quantico, where they were both at the top of the class, competing to be number one. After graduation, Blair got Josh's dream job, and they haven't spoken since. Three years later, their paths cross unexpectedly at the base holiday party, where the two get into an argument and cause a scene. As punishment, Blair and Josh are both assigned to Christmas Duty, where they'll work through the Yuletide together… for 24 hours straight. They plan to stay away from each other, but when a snowstorm prevents all the Christmas presents from being delivered to base, they are forced to team up for a special mission… to save Christmas.\"\nA Newport Christmas\nPremieres: Nov. 2 at 8 p.m. ET/PT\nCast: Ginna Claire Mason, Wes Brown\nContains: A time-traveling adventure thanks to a magical wish\nOfficial description: \"Ella (Mason) is a charitable and spirited Newport socialite in 1905 who dreams of using her wealth to start a foundation to help others in town. After learning her father intends for her to become engaged to a man she's never met at the upcoming Christmas Eve ball, Ella goes for a nighttime sail in her schooner to clear her head. Upon seeing a comet shoot across the sky, she wistfully wishes for a different life. Ella is shocked to suddenly find Nick (Brown), a sailor and local Newport historian, aboard her schooner and accuses him of being a stowaway. But Nick insists he owns the boat and a standoff ensues. Once on dry land, Ella realizes that somehow, she's traveled from 1905 to 2025. As she spends time there and gets a glimpse at what her future in 1905 appears to be, she becomes reluctant to return, especially since she and Nick have grown close and she now knows how true love feels. But the legacy Ella built in her time — and the course of Newport's history — risks being erased the longer she stays in the present, so the two plot a course for her trip back through time. But what awaits her at home is even more surprising that what she found in the future.\"\nMistletoe Murders Season 2\nPremieres: Nov. 7 at 8 p.m. ET/PT, with new episodes each week through Nov. 21\nCast: Sarah Drew, Peter Mooney\nContains: Even more death, mystery, and mistletoe!\nOfficial description: \"There are all-new mysteries in Fletcher's Grove, as Christmas shop owner Emily Lane (Drew) once again proves her sleuthing skills alongside local Detective Sam Wilner (Mooney). But this season, the biggest mystery may be Emily herself – when secrets from her past and the shadowy group known as CH1M3RA resurface, leading to revelations and a shocking finale that promises to change everything.\"\nChristmas Above the Clouds\nPremieres: Nov. 8 at 8 p.m. ET/PT\nCast: Erin Krakow, Tyler Hynes\nContains: A new spin on A Christmas Carol\nOfficial description: \"When workaholic CEO Ella Neezer (Krakow) tries to skip Christmas by flying to Australia, she's in for the flight of her life. Haunted by her past, present, and future, she's forced to confront the choices that led to her success yet left her flying solo. With the help of three quirky spirits and a surprise reunion with her ex (Hynes), she might just rediscover the magic of Christmas – and the love she thought she'd lost.\"\nA Keller Christmas Vacation\nPremieres: Nov. 9 at 8 p.m. ET/PT\nCast: Jonathan Bennett, Brandon Routh, Eden Sher\nContains: A scenic vacation, Superman, and siblings being siblings\nOfficial description: \"Christmas this year is going to be a little different for the Keller family, as parents, Anne and Ben, buy their three adult children – oldest son, Cal (Routh), middle son, Dylan (Bennett) and daughter, Emory (Sher) – a river cruise down the Danube River from Germany, through Salzburg, to Vienna touring beautiful European Christmas Markets and towns along the way. The one problem? The very different siblings, who are each going through their own personal life challenges, have naturally gone in separate directions over the years, and the idea of spending 10 days cooped up on a river cruise together makes each Keller child cringe for their own reasons. But they say 'yes' because that's what families do, never expecting it to turn out to be a glorious once-in-a-lifetime experience full of missed connections, new friendships, stunning vistas, relationship upheaval, budding romances, shipboard games, family bonding, and a secret that brings them all together in time for Christmas.'\nThree Wisest Men\nPremieres: Nov. 15 at 8 p.m. ET/PT\nCast: Paul Campbell, Tyler Hynes, Andrew Walker, Margaret Colin\nContains: Family holiday calamity, the realities of growing up, and a mall Santa trying their best\nOfficial description: \"The Brenner family is back, and their lives are more chaotic than ever! As Luke (Walker) is expecting twins, Taylor (Hynes) is debating a monumental job opportunity out of state, and Stephan (Campbell) attempts to plan for his upcoming nuptials, everyone's stress heightens when they learn their mom (Colin) has put their childhood home up for sale, marking their final Christmas in the Brenner house. With unexpected in-laws visiting, wild animals lurking in freshly cut Christmas trees, and a hesitant mall Santa, the boys will have their work cut out for them as the holiday begins to loom. As they navigate adulting at a level they have yet to reach, they must learn to once again lean on one another to rise to the needs of their growing family, conquer the newest challenges in their lives, and, most crucially, have the best Christmas EVER!\"\nTidings for the Season\nPremieres: Nov. 16 at 8 p.m. ET/PT\nCast: Tamera Mowry-Housley, B.J. Britt, Elijah-Justus Lewis\nContains: Broadcast journalism changing lives for the better\nOfficial description: \"Adam Kade (Britt) is the serious face on the local news. His life takes an unexpected turn in early December when he meets Robbie (Lewis), a 10-year-old who is Adam's biggest fan. Robbie has an important request: He wants his favorite newscaster to talk about more than just what's going wrong in the world. How about reporting on the good stories, too? Adam is ambitious and wants to move up in the world, but he takes this question to heart as the holidays approach. He discovers Robbie's mom, Lucy (Mowry-Housley), is a single parent working hard to take care of her son. The last thing she needs is anything complicating a very busy schedule, including Adam. As new friendships form and Adam gains a healthy perspective, his reporting changes. He starts covering feel-good stories about hometown heroes during the holidays. A romance develops between Adam and Lucy, and Lucy lets go of always being so self-reliant as she and Adam draw close. But when Adam's reporting leads to bigger opportunities, he must decide what matters most this holiday season – the bigger job he has been longing for or his newfound community, including the love of a boy who thinks of Adam as his hero.\"\nHoliday Touchdown: A Bills Love Story\nPremieres: Nov. 22 at 8 p.m. ET/PT\nCast: Holland Roden, Matthew Daddario, Joe Pantoliano, Tracy Pollan, Caroline Aaron, Steve Schirripa, Patti Murin\nContains: Football! Football! Football!\nOfficial description: \"The Quinns and DeLucas have lived next door to each other for decades in the shadow of Highmark Stadium – the home of their beloved Buffalo Bills. With their longtime friendship rooted in being proud members of Bills Mafia, the two clans have enjoyed cherished traditions that revolve around cheering for their favorite team – especially at the holidays when they celebrate the last home game before Christmas. Pediatric doctor Morgan Quinn (Roden) and the Bills' VP of Stadium Development Gabe DeLuca (Daddario) have been lifelong friends, but Gabe has always held a torch for her – a fact obvious to their families (Pollan, Aaron, Schirripa, Murin)… and everyone else who crosses their path. When Morgan learns from her Uncle Tommy (Pantoliano) that someone anonymously helped her family get by after he was drafted more than 60 years ago – and that he continues to receive a Christmas gift each year to this day – she decides to find his benefactor and give her uncle a Christmas he'll always remember. Aided by Bills Mafia friends of theirs, Morgan and Gabe work together to unwrap the gifter's identity. Along the way, Gabe's love for Morgan deepens and in turn, she begins to see him in a new light though neither is daring enough to admit their feelings. Meanwhile, Morgan's hopes of pulling off her surprise for Uncle Tommy get sacked. That is, until Gabe takes matters into his own hands and uses his connections with the Bills to pull off the surprise of a lifetime for Morgan and both their families that will make this a Christmas they'll never forget. Cameos: Coach Sean McDermott, Ray Davis, Damar Hamlin, Dion Dawkins, Dawson Knox, Reid Ferguson, DeWayne Carter, Joshua Palmer, Jim Kelly, Steve Tasker, Thurman Thomas, Scott Norwood, Andre Reed, Chris Brown, Luke Russert.\"\nMelt My Heart This Christmas\nPremieres: Nov. 23 at 8 p.m. ET/PT\nCast: Laura Vandervoort, Stephen Huszar\nContains: A secret fair entry and one fiery feud\nOfficial description: \"Holly James (Vandervoort), a passionate glassblower striving to establish her artistic identity, dreams of showcasing her creations at the Fern Grove Fair. Despite previous rejections from Jack Dubois (Huszar), who oversees the entries, Holly finds an unexpected opportunity to assist legendary glassblower Bianca Bonhomme, to help Jack. Unfortunately, Bianca is struggling with a creative slump and needs help managing her booth. While Holly assists Bianca, she also secretly displays her own art under a pseudonym, and her vibrant work becomes a surprise hit, overshadowing Bianca's work and challenging the fair's traditional norms. Holly does everything she can to help Bianca without giving away her identity while also growing closer to Jack, but unfortunately Walter, a news reporter, discovers the mystery and outs Holly, shattering her relationship with both Bianca and Jack. Holly is now forced to pick up the pieces and try to melt them back together.\"\nWe Met in December\nPremieres: Nov. 27 at 8 p.m. ET/PT\nCast: Autumn Reeser, Niall Matter\nContains: A missed connection in the most wonderful time of the year\nOfficial description: \"On an unexpected layover in mid-December, Annie Lane (Reeser) and Dave Weeks (Matter) meet as strangers in a beautiful hotel all decorated for the holidays. It's love at first sight, and they end up having a magical night of sharing hopes, dreams… and a perfect kiss. But when they fail to exchange numbers and miss each other the next morning, Annie and Dave fly back to Chicago with no easy way to track the other one down. The only clues they have are those shared about plans for the upcoming holiday season, and the two embark on separate quests to find one another. Along the way, insightful wisdom shared during their time together leads Annie and Dave to make important changes in their lives, leading them both to find ways of making this Christmas special for themselves, their families, and their loved ones.\"\nThe Snow Must Go On\nPremieres: Nov. 28 at 6 p.m. ET/PT\nCast: Heather Hemmens, Corey Cott\nContains: A Christmas showcase and a bit of Broadway magic\nOfficial description: \"Isaiah Heyward (Cott) last appeared on Broadway almost 10 years ago. Since then, getting back on Broadway has been a challenge. To escape the grind of the city and re-evaluate his life, Isaiah visits his sister, Jess, and teenage niece, Aurora, in upstate New York for the holidays. But his yuletide respite is interrupted when he learns Aurora's high school may have to cancel their annual Christmas musical because they can't find a director. With a nudge from Aurora and the school's guidance counselor, Lilly-Anne Brigente (Hemmens), Isaiah decides to save the Christmas show and jumps in as director. Isaiah's situation gets a little more complicated when he learns that an influential Broadway producer's daughter is in the school production, so Isaiah decides to cast himself as the lead in order to land a part in an upcoming Broadway show. But while the curtain rises on rehearsals and the Christmas Eve opening night fast approaches, Isaiah finds some Christmas surprises of his own, as he stumbles upon an unexpected romance with Lilly-Anne, creates an unanticipated bond with his students, reassesses his priorities, and ultimately discovers that the greatest holiday gift is found when love, family, and friendship take center stage.\"\nThe More the Merrier\nPremieres: Nov. 28 at 8 p.m. ET/PT\nCast: Rachel Boston, Brendan Penny\nContains: Babies! Babies! Babies!\nOfficial description: \"Alice (Boston), an emergency room doctor at a small, rural hospital, always volunteers to work the Christmas Eve overnight shift and goes the extra mile to make the holiday merry and bright for patients and staff. When the hospital gets snowed in, Alice and Brian (Penny), the newly hired top-rated cardiologist, find themselves in the middle of a bona fide baby boom when three women — including the only OBGYN for miles around — go into labor on the rarest birthday of the year. As they team up to bring these bundles of joy into the world as the night wears on, Alice, Brian, and the rest of the staff also work hard to make the holiday feel festive for all the patients. Though they may have different approaches to medicine — and to life — there's a spark between them, and by the end of their shift it's clear that this may be the Christmas Eve that changes them both forever.\"\nAn Alpine Holiday\nPremieres: Nov. 29 at 6 p.m. ET/PT\nCast: Ashley Williams, Laci Mailey, Julien Samani\nContains: Estranged siblings taking an unforgettable trip in honor of their family\nOfficial description: \"A grandmother's last wish brings two estranged sisters, Faith (Williams) and Kelly (Mailey), back together to travel to the French Alps for Christmas to recreate her first trip there with their grandfather. Facing all the challenges and wonder this unique holiday adventure brings, they learn to cherish their sisterhood above all, while also making room for romance to blossom between Kelly and their French mountaineer guide, Frederic (Samani).\"\nA Grand Ole Opry Christmas\nPremieres: Nov. 29 at 8 p.m. ET/PT\nCast: Nikki Deloach, Kristoffer Polaha, Rob Mayes, Eliza Maher, Luke Benward, Sharon Lawrence, James Denton\nContains: A time-traveling country Christmas adventure complete with several famous cameos\nOfficial description: \"Gentry Wade (Nikki DeLoach), daughter of late country music icon Jett Wade – half of the famed duo Winters & Wade – abandoned her dream of a songwriting career and distanced herself from her father's legacy following his tragic accident 30 years prior. When the Grand Ole Opry invites her to represent Jett at their centennial celebration at Christmas, she's hesitant to return to the place steeped in bittersweet memories. Encouraged by her good friends, Gentry visits the Opry and, while seated in one of the vaunted venue's oak church pews, is suddenly transported to 1995. Gentry's lifelong friend Mac (Kristoffer Polaha), a country music talent manager, finds himself in 1995 as well. Thanks to some Christmas magic, Gentry gets precious time with her father, creative inspiration to finish the song she began decades earlier as a teen, and learns surprising answers to questions about her father that have followed her for the last three decades. Cameos by: Bill Anderson, Brad Paisley, Dailey & Vincent, Drew Baldridge, Jamey Johnson, Maggie Baugh, Megan Moroney, Mickey Guyton, Pam Tillis, Rhett Akins, Riders in the Sky, Suzy Bogguss, Tigirlily Gold, T Graham Brown.\"\nThe Christmas Cup\nPremieres: Nov. 30 at 6 p.m. ET/PT\nCast: Rhiannon Fish, Ben Rosenbaum\nContains: A Christmas contest for the ages\nOfficial description: \"After a knee injury threatens to cut her career short, Staff Sergeant Kelly Brandt (Fish) returns home in low spirits for the holidays. Her family tries to help by encouraging her to lead her hometown team in the annual Christmas Cup against the rival town. It takes a lot of work, but Kelly organizes her team and gets them as competition-ready as she can with the help of Fire Captain Quinn Stokley (Rosenbaum). Sparks begin to fly with Quinn, and through the whole process, Kelly is reminded of how much she loves to lead, but her heart still hopes she will be cleared to return to serve. Kelly ultimately receives the call she has been waiting for; however, it's not what she expects. With the Marines needing her to report to the Hawaiian base on the day of the competition, Kelly soon realizes there is more than one way to serve a community.\"\nChristmas at the Catnip Café\nPremieres: Nov. 30 at 8 p.m. ET/PT\nCast: Erin Cahill, Paul Campbell\nContains: An adoptable cat café at Christmas! What more could anyone need!?\nOfficial description: \"Olivia Pierce (Cahill) is a marketing executive from Oakland, Calif., who is this close to realizing her dream of purchasing a condo, but she's a bit short on the down payment. When she learns that her late great aunt left her half of a cat café in upstate New York, she thinks it's the Christmas miracle she needed – as long as she can sell and close the deal before the holidays. Olivia's plan hits a bump in the road when she meets Dr. Ben Kane (Campbell), the veterinarian who owns the other half. The café serves an important role in the town – helping homeless cats find forever homes – and he has no intention of closing up shop. Christmas is the most important time of the year, as they plan many activities to help raise funds and get them into the black. Olivia and Ben strike a deal – she agrees to help him plan the fundraising events at the café over the next three weeks in exchange for Ben promising not to drag his heels on selling at the end of that time. Unless Ben notes, she ends up changing her mind – a lot can happen in three weeks, after all. As they work together and a spark between them grows, Olivia becomes part of the neighborhood, gains an appreciation for the café's adorable feline inhabitants and what it means to Ben, as well as to the entire community. And when she learns the surprising reason her great aunt opened the café in the first place, that just might be the cat-alyst for change that will give them all a Merry Christmas.\"\nTwelve Dates 'Til Christmas\nPremieres: Dec. 5 at 8 p.m. ET/PT, with new episodes each week through Dec. 19\nCast: Mae Whitman, Julian Morris, Toby Sandeman, Nathaniel Parker, Jane Seymour, Lucy Eaton, Mary McDonnell\nContains: Lots of love in a little English town\nOfficial Description: \"Talented Saville Row textile pattern designer Kate (Whitman) lives in the quaint village of Blexford, England, next door to her father Mac (Parker), who is long-divorced from Kate's mother Delilah (McDonnell), a globe-trotting American always on an adventure. When not at work, Kate looks after Mac, who's recovering from a motorbike accident and is inclined to spend his days sitting in his recliner. Unbeknownst to Kate, her best friend Laura (Eaton) signs her up for The 12 Dates of Christmas – a holiday-themed matchmaking program in the days leading up to the holiday featuring carefully curated, yuletide dating experiences, in an attempt to get Kate out of her rut. Lovingly coerced by Laura and longtime best friend Callum (Morris), a reluctant Kate ultimately gets into the spirit of the program and is caught off guard when she meets someone (Sandeman) who reinvigorates her zest for life. But when Delilah unexpectedly shows up on her doorstep – literally – Kate and Mac's life and holiday season get upended. Meanwhile, Mac may be embarking on his own romance with local Evelyn (Seymour), a widow who slowly helps him step outside the confines of his house and open his heart. As Kate wends her way through the 12 dates, she takes a circuitous route to romance while also making some important discoveries about herself.\"\nShe's Making a List\nPremieres: Dec. 6 at 8 p.m. ET/PT\nCast: Lacey Chabert, Andrew Walker\nContains: A naughty or nice list dilemma\nOfficial description: \"Falling on Santa's Naughty or Nice list used to be a call made by Santa and his elves. But with the number of kids worldwide skyrocketing, Santa has outsourced the job to the Naughty or Nice Group, a consulting firm that has cornered the market on determining a child's niceness thanks to an airtight formula. As a top inspector with the group, it's Isabel's (Chabert) job to make the tough calls by assessing the children on her list and assigning a verdict. When she is tasked with evaluating a mischievous 11-year-old Charlie Duncan, she expects a routine case. But things get complicated when Isabel unexpectedly falls for Charlie's widowed father, Jason (Walker), and begins to question the rigid rules of her job. As Christmas approaches, Isabel must choose between following the holiday algorithm or following her heart.\"\nSingle on the 25th\nPremieres: Dec. 7 at 8 p.m. ET/PT\nCast: Lyndsy Fonseca, Daniel Lissing\nContains: Two single Pringles enjoying the holidays together\nOfficial description: \"For Nell Duke (Fonseca), nothing is worse than being single at Christmastime because everywhere she looks, couples are kissing under the mistletoe. After her family cancels holiday plans at the last minute, Nell decides to spend the week of Christmas having fun on her own! When she crosses paths with her neighbor Cooper (Lissing), a financial analyst who prides himself on being happily unattached, he notices Nell struggling with being alone and decides to share tips on how to keep the holidays festive. Cooper inspires Nell to challenge her insecurities and find happiness in being on her own. In turn, Nell helps Cooper realize he's missing out on real connection. In the fun partnership that forms, the friendly singles' Christmas together starts to feel like something more. Their special connection falls apart when Nell finds out Cooper only offered to help because he felt sorry Nell had to spend the holidays alone. To make Christmas truly magical this year, Cooper must show real growth of character while Nell finds her own strength in being single during the holidays. Inspired by the song 'Single on the 25th' by Lauren Spencer Smith.\"\nA Suite Holiday Romance\nPremieres: Dec. 13 at 8 p.m. ET/PT\nCast: Jessy Schram, Dominic Sherwood\nContains: Faux royals, the romantic backdrop that is New York City in winter\nOfficial description: \"It's Christmas week when Sabrina Post (Schram) arrives at the iconic Grand Fairbanks Hotel in New York City, ready to accept the ghostwriting position for the memoir of Grayson Westcott – a famous art dealer. As a struggling writer, Sabrina can't believe her luck: a paycheck and a stay in her own suite at the hotel. She feels like Cordelia, the heroine from her favorite series of children's books written by Hazel Holley. What promises to be a perfect week is complicated when Sabrina meets Ian Turner (Sherwood), a handsome British visitor, at the hotel bar. When Ian assumes Sabrina is another wealthy guest at the hotel, she doesn't correct him – a decision she doesn't regret after learning that Ian is a member of the British aristocracy. Or so she thinks. The truth is that Ian is not a wealthy lord but is the personal secretary of Lord Spencer Braxton. Ian is in town for the holidays to oversee the installation of an exhibit featuring the Braxton Royal Jewels at the Avalon Museum. As the week unfolds, Sabrina shows Ian Christmas in New York and the two start to fall for each other.\"\nOy to the World!\nPremieres: Dec. 14 at 8 p.m. ET/PT\nCast: Brooke D’Orsay, Jake Epstein\nContains: A Christmas and Hanukkah joint celebration!\nOfficial description: \"When water lines break at Temple Beth Am, it leaves its members in need of a place to celebrate Hanukkah. Across the street, St. Joseph’s Episcopal Church is quick to open its doors and offer shared space for the holidays. With the last night of Hanukkah and Christmas Eve falling on the same day this year – something that rarely happens – the reverend and rabbi choose to offer a joint service for their congregations. But that means Nikki Roberts (D’Orsay), St. Joseph’s youth choir director, must team up with Jake Cohen (Epstein), the substitute youth choir director from Temple Beth Am, and put on a single music program. These two are old high school rivals, and together, they’re ready to compete for the top prize. That’s not helping matters at a time when partnership matters most. To lead a successful fundraising effort for the temple, Nikki and Jake have to put aside their differences and learn how to work together. In doing so, they discover teamwork can move mountains and open hearts, including their own. On their big night, Nikki and Jake find a way to unite people through the power of song and prove that coming together is the best way for everyone to celebrate the holiday season.\"\nA Make or Break Holiday\nPremieres: Dec. 20 at 8 p.m. ET/PT\nCast: Hunter King, Evan Roderick\nContains: A very un-holly, jolly holiday break-up\nOfficial description: \"Liv (King) and Daniel (Roderick) are hosting their families for the first time this Christmas, and stress is at an all-time high. When unspoken irritations within their relationship finally reach a boiling point, Liv and Daniel find themselves at odds and decide they need to take a break from each other. However, relaying this news to their families will most certainly ruin Christmas, so they decide to move forward with their original plans and will pretend to be a happy couple while everyone is under one roof. As they navigate the complexities of their respective families and work together to create a holiday celebration they'll all remember, Liv and Daniel begin to rediscover what they love about each other and may not have to pretend much longer.\"\nThe Christmas Baby\nPremieres: Dec. 21 at 8 p.m. ET/PT\nCast: Ali Liebert, Katherine Barrell, Barbara Niven\nContains: Surprise baby!\nOfficial description: \"When a baby boy shows up on their doorstep days before Christmas with a note written specially for them, Erin (Liebert) and Kelly (Barrell) must learn how to navigate their new relationship and career dynamics while unexpectedly caring for a newborn. As the couple spends more time with the baby as a temporary solution until he can be placed permanently or they can find his mother, they begin to realize that they want to adopt him themselves and go about navigating the complicated world of fostering to adopt all while their business is booming at the busiest time of the year, Christmas.\"\nWith reporting by Emlyn Travis\nGet your daily dose of entertainment news, celebrity updates, and what to watch with our EW Dispatch newsletter.",
  "word_count": 5790,
  "scraped_at": "2026-02-14T12:12:58.269356"
}