{
  "article_id": "5e2118953347",
  "url": "https://www.liverpoolfc.com/news/lfc-ambassador-dowie-set-anfield-presentation-and-marathon-charity-effort",
  "title": "LFC ambassador Dowie set for Anfield presentation and marathon charity effort",
  "date": "20250313T123000Z",
  "domain": "liverpoolfc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NewsLFC ambassador Dowie set for Anfield presentation and marathon charity effort\nLiverpool FC Women ambassador Natasha Dowie is eagerly anticipating two special occasions – starting at Anfield on Friday night.\nThe former Reds striker and ex-teammate Becky Easton will both be welcomed onto the pitch at the women’s team’s Barclays Women’s Super League clash with Manchester United at the club’s home stadium.\nThe pair will be presented with their own, unique England legacy caps to mark their achievement of representing their country at senior international level.\nPlayer legacy numbers for the England women’s team were introduced in 2022, with every international ordered chronologically by when they debuted.\nThe pieces of history are celebrated in physical form by a velvet cap per player that features the individual’s legacy number embroidered on the front.\nDowie – who is No.173 having scored five times in 14 appearances for the Lionesses – and Easton (No.104, after 44 caps) have chosen to have theirs presented at Anfield.\n“Normally it’s presented to you at an England game at Wembley, and a lot of the former Lionesses have been presented this way,” Dowie told Liverpoolfc.com.\n“But myself and Becky both have our legacy caps, we feel like our heart is at Liverpool Football Club and that’s where our fondest memories are. And we really wanted to get these legacy caps presented at a Liverpool game.\n“So, the FA have been kind enough to post them to us and we’re going to be getting them presented at the Liverpool v Man Utd game.\n“It’s a huge honour. To represent your country is something that you’ve always dreamt of as a kid and to have this now as something to look back on and to be able to say I’ve played for my country, and what number I was when I represented my country, is pretty cool.”\n- Be there for Friday's match at Anfield – buy tickets here\nDowie is also currently deep into training for the London Marathon on April 27.\nThe 36-year-old will be raising money on behalf of the Owen McVeigh Foundation when she tackles the gruelling 26.2-mile challenge, having jumped at the chance to represent the local charity, which also works closely with LFC Foundation.\n“It has definitely never appealed to me before but I met Mark and Jo, who lost their son Owen,” she explained.\n“The Owen McVeigh Foundation is an incredible foundation and charity that helps support kids that are suffering with cancer. For the first time ever they got offered a space in the London Marathon. They have been trying for years, and they got the one spot.\n“I messaged Mark and said, ‘Can I be the one to run it for you?’ And straight away he got back to me and said yes. It’s a great cause, it’s going to definitely get me through the 26.2 miles, thinking of what I’m running it for.\n“I’ve already raised £21,000, which is incredible, but we’ve still got four to five weeks maybe left, so I want to keep raising as much as I possibly can. Anything to support the Foundation, any support, would be much appreciated.”\nYou can support Dowie and the Owen McVeigh Foundation with a donation here.",
  "word_count": 537,
  "scraped_at": "2026-02-14T13:05:49.765013"
}