{
  "article_id": "5e26494c6692",
  "url": "https://www.advanced-television.com/2026/01/16/dazn-scores-fifa-womens-champions-cup-2026-rights/",
  "title": "DAZN scores FIFA Women Champions Cup 2026 rights",
  "date": "20260116T083000Z",
  "domain": "advanced-television.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "DAZN scores FIFA Women’s Champions Cup 2026 rights\nJanuary 16, 2026\nDAZN, the sports streaming platform, will broadcast the decisive showdowns of the FIFA Women’s Champions Cup 2026 worldwide, with the exception of Brazil, China, Morocco, the UK and the Republic of Ireland, while in the US only the semi-finals will be broadcast. The tournament will be available free-to-view on DAZN’s platform.\nThe inaugural FIFA Women’s Champions Cup will be awarded on February 1st at Arsenal’s Emirates Stadium after bringing together the top women’s clubs from each confederation to compete for a new trophy on the international stage. Fixtures will showcase some of the most celebrated clubs in women’s football, including reigning European champions and emerging powerhouses from across the globe.\nThe first stage of the 2026 competition unfolded across two knockout rounds. In Round 1, AFC champions Wuhan Chegu Jiangda WFC hosted OFC champions Auckland United FC, edging past the New Zealand side in a hard-fought encounter. Wuhan Jiangda’s journey was then brought to an end in dramatic fashion in Round 2, as they were overcome by CAF champions ASFAR. The Moroccan side advanced to the decisive phase in London.\nThe two semi-finals will be staged at Brentford’s Gtech Community Stadium on January 28th. Supporters can look forward to two high-profile encounters: Concacaf champions Gotham FC (USA) will face CONMEBOL champions Corinthians (Brazil) at 12:30 GMT, followed by UEFA Women’s Champions League holders Arsenal (England) taking on ASFAR (Morocco), the CAF Women’s Champions League 2025 champions, at 18:00 GMT.\nOn February 1st, the action will move to the Emirates Stadium, where the first women’s intercontinental club champions will be crowned. The venue will host both the third-place play-off at 14:45 GMT and the final at 18:00 GMT, bringing the first FIFA Women’s Champions Cup to a memorable close.\n“With world-class players, iconic clubs and a truly global stage, the FIFA Women’s Champions Cup marks a defining moment for women’s club football. We’re delighted to partner with premium broadcasters who’ll play a vital role in showcasing the final stage of this new tournament – which is visionary, ambitious, impactful and deeply connected to fans and communities everywhere – to the world,” commented Jill Ellis, FIFA’s Chief Football Officer.\nShay Segev, CEO of DAZN Group, added: “DAZN and FIFA share a vision to make football accessible and inclusive for fans everywhere. The FIFA Women’s Champions Cup is a landmark event for global football, and by offering free access to the tournament, DAZN is breaking down barriers and ensuring that the best of women’s football reaches the widest possible audience. This is another step forward in our mission to grow the game and celebrate its incredible players.”\nIn the UK, the action can be watched live on Sky Sports.\nOther posts by :\n- SES predicts end of ‘big’ Geo satellites\n- Amazon Leo gets approval for 4,504 extra satellites\n- SpaceX gets a portion of India\n- TerreStar wants to build LEO network\n- Musk: “No Starlink phone”\n- Russia accused of eavesdropping on satellites\n- FCC welcomes Musk’s 1m satellite plan\n- Telesat has problems with an LEO\n- Orbital debris a real danger",
  "word_count": 524,
  "scraped_at": "2026-02-14T12:51:34.064138"
}