{
  "article_id": "5e376d053083",
  "url": "https://www.marieclaire.com/celebrity/royals/queen-letizia-world-cup-australia/",
  "title": "Queen Letizia Wows in a Scarlet Hugo Boss Power Suit as Spain Clinches World Cup Victory",
  "date": "20230829T220000Z",
  "domain": "marieclaire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Queen Letizia Wows in a Scarlet Hugo Boss Power Suit as Spain Clinches World Cup Victory\nAllow us to introduce you to this glamourous queen.\nSelect the newsletters you’d like to receive. Then, add your email to sign up.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nDelivered daily\nMarie Claire Daily\nGet exclusive access to fashion and beauty trends, hot-off-the-press celebrity news, and more.\nSent weekly on Saturday\nMarie Claire Self Checkout\nExclusive access to expert shopping and styling advice from Nikki Ogunnaike, Marie Claire's editor-in-chief.\nOnce a week\nMaire Claire Face Forward\nInsider tips and recommendations for skin, hair, makeup, nails and more from Hannah Baxter, Marie Claire's beauty director.\nOnce a week\nLivingetc\nYour shortcut to the now and the next in contemporary home decoration, from designing a fashion-forward kitchen to decoding color schemes, and the latest interiors trends.\nDelivered Daily\nHomes & Gardens\nThe ultimate interior design resource from the world's leading experts - discover inspiring decorating ideas, color scheming know-how, garden inspiration and shopping expertise.\nBelieve it or not, there are royal families around the world that are not the British royal family—and they are not only as fascinating as the Mountbatten-Windsors, but sometimes more so. And, though this article is actually not about the BRF, we did write about Prince William’s decision not to attend the women’s World Cup final in Australia yesterday, where England lost to Spain, 1-0. (Spoiler alert: the decision was not received well.) William’s absence was juxtaposed with the presence of Queen Letizia of Spain, who was in attendance alongside her daughter Princess Sofia. Who is Letizia? We’d be happy to introduce you—but first, let’s check in on how she spent her (very exciting) weekend in Australia.\nAt the World Cup\nFor yesterday’s match between Spain and England, Letizia went for a tried-and-true designer and a signature color, Tatler reports. Known as one of the most glamorous royals globally, the Queen of Spain did not disappoint in Sydney, wearing a red blazer and trousers by Hugo Boss. “The choice is unsurprising: the label is a staple (the queen favors sharp tailoring and sleek silhouettes) and bold scarlet is one of her signature colors (as well as being the color of Spain’s national kit),” Tatler reports. (Fashion diplomacy is employed by royals far beyond the British; the team’s nickname is “La Roja,” which is Spanish for “red.”) “The boot-cut trousers and longline blazer struck the right balance between business and regal elegance,” the outlet continues. To finish off the look, Letizia wore Latouche black boots, diamond and ruby earrings by Gold&Roses, and a Carolina Herrera bag. In addition to watching the match with bated breath from the presidential box, Letizia and Sofia joined the victorious team for the trophy presentation ceremony.\n“Champions! Champions! World Champions!” the Spanish royal family wrote on X (formerly known as Twitter). “You are the best football players in the world. This is FOOTBALL and it is HISTORY! Thank you, Spanish women’s football team, for making all of Spain rock.” Ahead of the game, Letizia told Spanish media that “regardless of what happens, they are already champions.”\nAfter the victory, Letizia and Sofia visited the team’s locker room, where they “congratulated the players and coaching staff, highlighting the brilliant performance throughout the tournament,” the Spanish royal family said in a statement.\nMeet Queen Letizia\nMuch like one Catherine Elizabeth Middleton, Letizia broke royal protocol as the first Spanish queen to be born a commoner, The Independent reports. She was raised in a middle-class family, and her father was a journalist—in fact, Letizia comes from a long line of journalists, as her paternal grandmother was a radio broadcaster for 40 years. Letizia herself took that career path, earning both a bachelor’s degree and a master’s degree in journalism and, while at university, working multiple jobs in media, for newspapers and a major international news agency, EFE. Letizia worked briefly as a journalist in Mexico before returning to Spain to report for the Spanish versions of Bloomberg and CNN. In 2003, she gained prominence as a news anchor for Telediario 2, the most viewed daily evening news program in Spain; throughout her career, Letizia has reported from the U.S. on presidential elections, broadcasted live from New York City following the September 11 attacks, and reported on the Iraq War, The Independent reports.\nGet exclusive access to fashion and beauty trends, hot-off-the-press celebrity news, and more.\nLetizia met her husband King Felipe—then Prince of Asturias—at a dinner party in 2002 that was organized by fellow journalist Pedro Erquicia, where The Independent reports that the two formed “an instant connection.” The couple had a low-profile romance for several months before announcing their engagement on November 1, 2003. And, just as Letizia has ties to Kate, she also has ties to Meghan Markle—Letizia had been divorced before marrying Felipe, having married for the first time in 1998 and divorcing a year later. While her first marriage likely would have posed challenges for Felipe and Letizia—who wanted to be married in the Catholic Church and would require special permission from the Vatican to do so—Letizia’s first wedding was only a civil ceremony.\nFelipe and Letizia married on May 22, 2004, in Madrid; for the occasion, Letizia wore a gown by Spanish designer Manuel Pertegaz and an off-white silk tulle veil that was a gift from Felipe.\nSince then, the Prince and Princess of Asturias became King and Queen of Spain in 2014 when Felipe’s father, King Juan Carlos, abdicated the throne. (See, the BRF isn’t the only royal family with controversy.) The couple share two daughters—Leonor, who is the heir to the throne, was born in 2005, and Sofia was born in 2007.\nAs Queen, she “has continued much of the work that she focused on during her time as a journalist: raising awareness towards social issues such as children’s rights, culture, and education,” The Independent reports. And if you are a British royal family aficionado and recognize Letizia, it’s for good reason—she was one of many European royals present at King Charles’ Coronation last May.\nThe Rest of Her Week\nEven without the World Cup, it has been a big week for Letizia—and an emotional one. Her eldest, Leonor, is the heir presumptive to the Spanish throne and, following in the footsteps of her father and grandfather, began three years of intensive military training this week. Letizia looked emotional, Tatler reports, as she, Felipe, and Sofia dropped Leonor off at the General Military Academy of Zaragoza in northeastern Spain. Leonor, speaking to reporters, said she is entering this new chapter of her life “with enthusiasm” but also admitted she was “a little nervous.”\nThis step is a major one for not just Leonor but for women and the military in Spain. In a press conference this past March, Spanish Defense Minister Margarita Robles said of Leonor’s decision to attend military training “it shows that we will have, when the time comes, a supreme commander who is a woman, and in the recent years, we’ve made a big effort to incorporate women into the armed forces. It’s an essential step in the life of Her Royal Highness…toward the leadership of our country.”\nThe World Cup caps off a summer that included the family’s annual summer getaway to Palma de Mallorca, where, among other activities, they (like the rest of us) took in a screening of Barbie, Hello reports.\nRachel Burchfield is a writer, editor, and podcaster whose primary interests are fashion and beauty, society and culture, and, most especially, the British Royal Family and other royal families around the world. She serves as Marie Claire’s Senior Celebrity and Royals Editor and has also contributed to publications like Allure, Cosmopolitan, Elle, Glamour, Harper’s Bazaar, InStyle, People, Vanity Fair, Vogue, and W, among others. Before taking on her current role with Marie Claire, Rachel served as its Weekend Editor and later Royals Editor. She is the cohost of Podcast Royal, a show that was named a top five royal podcast by The New York Times. A voracious reader and lover of books, Rachel also hosts I’d Rather Be Reading, which spotlights the best current nonfiction books hitting the market and interviews the authors of them. Rachel frequently appears as a media commentator, and she or her work has appeared on outlets like NBC’s Today Show, ABC’s Good Morning America, CNN, and more.",
  "word_count": 1403,
  "scraped_at": "2026-02-14T12:04:47.157286"
}