{
  "article_id": "5e55d24c72c7",
  "url": "https://www.prnewswire.com/news-releases/scripps-reports-q2-2024-financial-results-302218391.html",
  "title": "Scripps reports Q2 2024 financial results",
  "date": "20240808T211500Z",
  "domain": "prnewswire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "CINCINNATI, Aug. 8, 2024 /PRNewswire/ -- The E.W. Scripps Company (NASDAQ: SSP) delivered $574 million in revenue for the second quarter of 2024. Loss attributable to the shareholders of Scripps was $13 million or 15 cents per share.\nBusiness notes:\n- Scripps now believes its 2024 Local Media election-year political advertising revenue will reach record levels, with even the low end of the new range, $270-$290 million, above any previous year. Previously, the company had given a range of $240-$270 million. The increased outlook is being driven largely by U.S. Senate races in Montana and Ohio as well as controversial ballot issues in several states. There also could be upside captured in the new dynamics of the race for president.\n- Progress continues on the planned divestiture of Scripps' Bounce television network. Bounce, whose programming is created for Black audiences, is distributed over the air, on cable and on most major streaming/FAST platform services. Bounce has grown viewership and revenue – at a 14% CAGR – since Scripps acquired it as part of the Katz networks in 2017.\n- The Scripps Networks' national advertising upfront sales season is winding down with volume increases in the low single digit percent range over last year, driven largely by the success of the company's women's sports strategy.\n- Viewership of the WNBA has skyrocketed with all media partners, including ION's Friday night franchise, which has seen three games so far this year with more than 1 million viewers each. Scripps' revenue for the WNBA is up 85% from the 2023 season.\n- On the local front, Scripps Sports recently signed the newest Stanley Cup champions, the Florida Panthers, to a production, sales and distribution rights agreement. The Panthers are the third National Hockey League team to partner with Scripps Sports for the distribution of their broadcast rights. This will be Scripps Sports' first season with the Florida Panthers and the Utah Hockey Club and the second year with the Vegas Golden Knights.\n- Companywide, expenses met or bettered expectations in the second quarter through tight expense management.\nFrom Scripps President and CEO Adam Symson:\n\"During the second quarter, our Local Media political advertising revenue came in much stronger than expected at $28 million, driving 40 percent growth in the first half of the year over the same period of 2020 and creating some local core advertising displacement. That start to the year and our latest back-half outlook led us to once again raise our expectations for 2024 presidential election-year revenue.\n\"Election spending remains robust for the U.S. Senate races in Montana and Ohio, and at least four states where we have stations have placed reproductive rights issues on their November ballots. We are beginning to see additional upside from Vice President Kamala Harris's entry into the presidential race. Overall, this year's political ad revenue performance for broadcast television is a testament to our durability as a brand-safe platform for political candidates and campaigns.\n\"While the results of last year's national advertising upfront are still impacting our quarterly results in the Scripps Networks division, we are seeing a better performance in this season's upfront sales cycle. With commitments from the majority of our advertising agency clients, we have volume increases of low single digits over last year. Sports has been the differentiator. Our WNBA Friday night franchise on ION has so far showcased three games where viewership surpassed 1 million, proving to advertisers that ION can deliver them to significantly large sports audiences. Viewership of our NWSL Saturday night franchise continues to grow as well, and we are optimistic that the Paris Summer Olympics will fuel additional enthusiasm for women's soccer – and viewership and revenue for us.\n\"As we move through the second half of the year, this management team continues to see a clear path to significant debt paydown by year end. Our expectations for segment profit are driven by the robust political advertising revenue outlook. We also are exercising prudent expense management, and we are progressing nicely with our efforts to sell the Bounce TV network and some non-strategic real estate assets. All of these factors give us confidence we can bring down our leverage significantly going into 2025.\"\nOperating results\nTotal second-quarter company revenue was $574 million, a decrease of 1.6% or $9.2 million from the prior-year quarter. Costs and expenses for segments, shared services and corporate were $479 million, up from $471 million in the year-ago quarter.\nLoss attributable to the shareholders of Scripps was $13 million or 15 cents per share. In the prior-year quarter, the loss attributable to shareholders was $682 million or $8.10 per share. The pre-tax costs for the prior-year quarter included a non-cash goodwill impairment charge for Scripps Networks of $686 million as well as an $8 million restructuring charge, increasing the loss attributable to shareholders by $8.01 per share.\nSecond-quarter 2024 results by segment compared to prior-period amounts:\nLocal Media\nRevenue was $365 million, up 3.6% from the prior-year quarter.\n- Core advertising revenue decreased 6.9% to $139 million, due in part to displacement from political advertising.\n- Political revenue was $28.2 million, compared to $3.8 million in the prior-year quarter, a non-election year.\n- Distribution revenue was $194 million, compared to $195 million in the prior-year quarter.\nSegment expenses increased 2.1% to $277 million. Segment expenses in 2024 reflect additional programming expense associated with the sports rights agreements for the National Hockey League's Vegas Golden Knights and the former Arizona Coyotes.\nSegment profit was $88.1 million, compared to $81 million in the year-ago quarter.\nScripps Networks\nRevenue was $209 million, down 9.7% from the prior-year quarter. Segment expenses were $171 million, relatively flat from the year-ago quarter.\nSegment profit was $37.7 million, compared to $60.3 million in the year-ago quarter.\nFinancial condition\nOn June 30, cash and cash equivalents totaled $26.7 million, and total debt was $2.9 billion.\nDuring the first six months of 2024, we reduced the outstanding balance on our revolving credit facility by $40 million and made mandatory principal payments of $7.8 million on our term loans.\nWe did not declare or provide payment for either of the 2024 quarterly preferred stock dividends. We have sufficient liquidity to pay the scheduled dividends on the preferred shares; however, this action provides us better flexibility for accelerating deleveraging and maximizing the paydown of our traditional bank debt. The dividend rate on the preferred shares, which compounds quarterly, increased to 9% per annum and will remain at that rate. At June 30, aggregated undeclared and unpaid cumulative dividends totaled $27.3 million. Under the terms of Berkshire Hathaway's preferred equity investment in Scripps, we are prohibited from paying dividends on or repurchasing our common shares until all preferred shares are redeemed.\nYear-to-date operating results\nThe following comparisons are to the period ending June 30, 2023:\nRevenue was $1.1 billion in 2024 and 2023. Political revenue was $45.4 million, compared to $7.4 million in the prior year, a non-election year.\nCosts and expenses for segments, shared services and corporate were $953 million, up from $926 million in the year-ago period, reflecting higher programming expense and production costs associated with the sports rights agreements for both Local Media and Scripps Networks.\nLoss attributable to the shareholders of Scripps was $25.8 million or 30 cents per share. The 2024 period included an $18.1 million investment gain and a $6 million restructuring charge, decreasing the loss attributable to shareholders by 11 cents per share. In the prior year, loss attributable to shareholders was $714 million or $8.49 per share. Pre-tax costs for the prior year included a non-cash goodwill impairment charge for Scripps Networks of $686 million as well as a $24.5 million restructuring charge, increasing the loss attributable to shareholders by $8.18 per share.\nLooking ahead\nComparisons for our segments are to the same period in 2023.\nConference call\nThe senior management of The E.W. Scripps Company will discuss the company's quarterly results during a telephone conference call at 9:30 a.m. Eastern, tomorrow, Aug. 9. To access the live webcast, visit http://ir.scripps.com and find the link under \"upcoming events.\"\nTo access the conference call by telephone, dial (877) 336-4440 (U.S.) or (409) 207-6984 (international) and give the access code 1958030 approximately five minutes before the start of the call. Investors and analysts will need the name of the call (\"Scripps earnings call\") to be granted access. The public is granted access to the conference call on a listen-only basis.\nA replay line will be open from 12:30 p.m. Eastern time Aug. 9 until midnight Sept. 9. The domestic number to access the replay is (866) 207-1041 and the international number is (402) 970-0847. The access code for both numbers is 7111467.\nA replay of the conference call will be archived and available online for an extended period of time following the call. To access the audio replay, visit http://ir.scripps.com/ approximately four hours after the call, and the link can be found on that page under \"audio/video links.\"\nForward-looking statements\nThis document contains \"forward-looking statements\" within the meaning of the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. Forward-looking statements can be identified by words such as: \"believe,\" \"anticipate,\" \"intend,\" \"expect,\" \"estimate,\" \"could,\" \"should,\" \"outlook,\" \"guidance,\" and similar references to future periods. Examples of forward-looking statements include, among others, statements the company makes regarding expected operating results and future financial condition. Forward-looking statements are neither historical facts nor assurances of future performance. Instead, they are based only on management's current beliefs, expectations, and assumptions regarding the future of the industry and the economy, the company's plans and strategies, anticipated events and trends, and other future conditions. Because forward-looking statements relate to the future, they are subject to inherent risks, uncertainties, and changes in circumstance that are difficult to predict and many of which are outside of the company's control. The company's actual results and financial condition may differ materially from those indicated in the forward-looking statements. Therefore, you should not rely on any of these forward-looking statements. Important factors that could cause the company's actual results and financial condition to differ materially from those indicated in the forward-looking statements include, among others, the following: change in advertising demand, fragmentation of audiences, loss of affiliation agreements, loss of distribution revenue, increase in programming costs, changes in law and regulation, the company's ability to identify and consummate strategic transactions, the controlled ownership structure of the company, and the company's ability to manage its outstanding debt obligations. A detailed discussion of such risks and uncertainties is included in the company's Form 10-K, on file with the SEC, in the section titled \"Risk Factors.\" Any forward-looking statement made in this document is based only on currently available information and speaks only as of the date on which it is made. The company undertakes no obligation to publicly update any forward-looking statement, whether written or oral, that may be made from time to time, whether as a result of new information, future developments, or otherwise.\nMedia contact: Michael Perry, The E.W. Scripps Company, (513) 259-4718, [email protected]\nInvestor contact: Carolyn Micheli, The E.W. Scripps Company, (513) 977-3732, [email protected]\nAbout Scripps\nThe E.W. Scripps Company (NASDAQ: SSP) is a diversified media company focused on creating a better-informed world. As one of the nation's largest local TV broadcasters, Scripps serves communities with quality, objective local journalism and operates a portfolio of more than 60 stations in 40+ markets. Scripps reaches households across the U.S. with national news outlets Scripps News and Court TV and popular entertainment brands ION, Bounce, Grit, ION Mystery, ION Plus and Laff. Scripps is the nation's largest holder of broadcast spectrum. Scripps is the longtime steward of the Scripps National Spelling Bee. Founded in 1878, Scripps' long-time motto is: \"Give light and the people will find their own way.\"\nNotes to Results of Operations\n1. SEGMENT INFORMATION\nWe determine our business segments based upon our management and internal reporting structures, as well as the basis on which our chief operating decision maker makes resource-allocation decisions.\nOur Local Media segment includes more than 60 local television stations and their related digital operations. It is comprised of 18 ABC affiliates, 11 NBC affiliates, nine CBS affiliates and four FOX affiliates. We also have seven CW affiliates - four on full power stations and three on multicast; seven independent stations and 10 additional low power stations. Our Local Media segment earns revenue primarily from the sale of advertising to local, national and political advertisers and retransmission fees received from cable operators, telecommunications companies, satellite carriers and over-the-top virtual MVPDs.\nOur Scripps Networks segment includes national news outlets Scripps News and Court TV as well as popular entertainment brands ION, Bounce, Grit, ION Mystery, ION Plus and Laff. The Scripps Networks reach nearly every U.S. television home through free over-the-air broadcast, cable/satellite, connected TV and digital distribution. These operations earn revenue primarily through the sale of advertising.\nOur respective business segment results reflect the impact of intercompany carriage agreements between our local broadcast television stations and our national networks. We also allocate a portion of certain corporate costs and expenses, including accounting, human resources, employee benefit and information technology to our business segments. These intercompany agreements and allocations are generally amounts agreed upon by management, which may differ from an arms-length amount.\nThe other segment caption aggregates our operating segments that are too small to report separately. Costs for centrally provided services and certain corporate costs that are not allocated to the business segments are included in shared services and corporate costs. These unallocated corporate costs would also include the costs associated with being a public company. Corporate assets are primarily cash and cash equivalents, property and equipment primarily used for corporate purposes and deferred income taxes.\nOur chief operating decision maker evaluates the operating performance of our business segments and makes decisions about the allocation of resources to our business segments using a measure called segment profit. Segment profit excludes interest, defined benefit pension plan amounts, income taxes, depreciation and amortization, impairment charges, divested operating units, restructuring activities, investment results and certain other items that are included in net income (loss) determined in accordance with accounting principles generally accepted in the United States of America.\nInformation regarding the operating results of our business segments is as follows:\nOperating results for our Local Media segment were as follows:\nOperating results for our Scripps Networks segment were as follows:\n2. CONDENSED CONSOLIDATED BALANCE SHEETS\n3. EARNINGS PER SHARE (\"EPS\")\nUnvested awards of share-based payments with non-forfeitable rights to receive dividends or dividend equivalents, such as our RSUs, are considered participating securities for purposes of calculating EPS. Under the two-class method, we allocate a portion of net income to these participating securities and, therefore, exclude that income from the calculation of EPS for common stock. We do not allocate losses to the participating securities.\nThe following table presents information about basic and diluted weighted-average shares outstanding:\n4. NON-GAAP INFORMATION\nIn addition to results prepared in accordance with GAAP, this earnings release discusses adjusted EBITDA, a non-GAAP performance measure that management and the company's Board of Directors uses to evaluate the performance of the business. We also believe that the non-GAAP measure provides useful information to investors by allowing them to view our business through the eyes of management and is a measure that is frequently used by industry analysts, investors and lenders as a measure of valuation for broadcast companies.\nAdjusted EBITDA is calculated as income (loss) from continuing operations, net of tax, plus income tax expense\n(benefit), interest expense, losses (gains) on extinguishment of debt, defined benefit pension plan expense (income), share-based compensation costs, depreciation, amortization of intangible assets, impairment of goodwill, loss (gain) on business and asset disposals, acquisition and integration costs, restructuring charges and certain other miscellaneous items. We consider adjusted EBITDA to be an indicator of our operating performance.\nA reconciliation of the adjusted EBITDA measure to the comparable financial measure in accordance with GAAP is as follows:\n5. SUPPLEMENTAL CASH FLOW INFORMATION\nThe following table presents additional information on certain sources and uses of cash:\nSOURCE The E.W. Scripps Company",
  "word_count": 2685,
  "scraped_at": "2026-02-14T12:17:52.292461"
}