{
  "article_id": "5e8ff6502fe8",
  "url": "https://www.abc.net.au/news/2024-05-31/afl-inside-essendon-bombers-arizona-fitness-training-camp/103856606",
  "title": "Inside Essendon American training camp that set club on path towards ending infamous finals drought",
  "date": "20240530T223000Z",
  "domain": "abc.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Inside Essendon's American training camp that set club on path towards ending infamous finals drought\nWhen Essendon crashed and burned at the end of last season, its leaders decided enough was enough.\nThe Bombers' first season under Brad Scott started brightly, with the club sitting inside the top four after going 4-2 through the first six rounds of the season, before a familiar slide began.\nEssendon went 4-4 over its next eight matches, losing four in a row before winning four in a row to sit in sixth spot at the bye.\nScott's side was as high as fifth after Round 17 before losing five of its last seven matches to finish the season in 11th. The five losses included back-to-back humiliations by 126 points to the GWS Giants and by 70 points to Collingwood to round out the season.\nJordan Ridley was forced to watch those final two losses on the sidelines after he'd suffered a quad injury in Round 19.\nAfter seeing his team's season end with a whimper, Ridley reached out to Exos Sports, an American company that had developed a reputation for working with elite athletes all over the globe.\nExos was behind Germany's strength and conditioning program during its victorious 2014 FIFA World Cup campaign, where \"Die Mannschaft\" ousted a Lionel Messi-led Argentina side in the final.\n\"It started out with having a couple of conversations with him (Ridley) and pulling a program together that would fit his off-season and essentially be a primer for his pre-season,\" Zev Gollis, who is in charge of recruitment and logistics at Exos, told ABC Sport.\n\"Then that had a domino effect and just led to more of his teammates coming on board and wanting to make the investment to come out here.\"\nEarly signs of positive chemistry building\nRidley was soon joined in Arizona by 13 other teammates. Essendon vice-captain Andy McGrath, leading goal-kicker Kyle Langford, and rugged defender Jayden Laverde were among the veterans leading the pack. They were joined by youngsters Ben Hobbs, Archie Perkins, Jye Caldwell, Sam Durham and 2022 No.5 pick Elijah Tsatas, who was the youngest player on the trip at 19.\nThe buy-in across Essendon's playing group was so great that even Jade Gresham, who'd only recently joined the club via the trade period, made his way over to the US to join his new teammates.\n\"That was another good part of the group, we had some guys that were younger and then we had guys like Jordan and Jayden that were on the older side,\" Gollis recalled.\n\"It was nice to see the dynamic there with the more experienced players getting the younger guys to buy in and the younger guys being really open to feedback from us and taking inspiration from those guys as well.\"\nRich Pruett, the Director of Performance at Exos, worked closely with the Bombers cohort during their time in Arizona. He praised the senior players for setting the tone during the training camp.\n\"I will say a lot of the credit for the success has to go to the older players in the group,\" he told ABC Sport.\n\"They were the ones who were constantly corralling the young bucks and realised getting them away from their situations back home in order to come here and put the work in was a major key.\n\"You could see there was a great culture building and it's no surprise that they've had the success they've had so far this season.\"\nBoth Gollis and Pruett recalled the entire Exos facility being taken aback by the energy brought about by the Bombers cohort.\n\"The biggest surprise and the enjoyment of working with them was just the energy they brought into every training session, they were maniacs,\"Pruett said.\n\"It was so much fun to work with them and it's awesome to see how well they're doing right now because it was a blast and an honour to get to work with them.\"\nPruett even recalled an occasion where the Bombers took over the facility's music system, blasting Australian artist FISHER's hits as they were put through their paces.\n\"We have an iPad that controls the music here,\" he said.\n\"They would want FISHER on and we would crank it to full blast and the entire building was like, 'What the hell is happening?'.\n\"You'd just hear these guys over in the corner (yelling) and they were just feeling it, getting the energy.\n\"You were just wondering where this energy was coming from. Their level was definitely well above the average pro athlete that I've worked with in the past, so it was definitely enlightening for sure.\"\nLate-game fadeouts a point of emphasis\nBy the end of the 2023 season, Essendon had developed a reputation for failing to run out games.\nOften, Scott's side would come out of the gates on fire before being overrun by fitter, faster and stronger teams.\nPruett said the fadeouts were a particular point of emphasis among the players who came out to train in Arizona.\n\"A lot of the guys that came out were leaders on the team, and they were aware of it and that was the main point of conversation around a lot of the training,\" he recalled.\n\"Now realistically speaking, are we going to improve that within two weeks that far out from the season, not necessarily. But what we can do is educate them on ways to do that as they progress and get closer (to the season).\n\"I think a lot of it is a testament to their awareness and their understanding of what was needed going into this season.\n\"It was a main point of concentration within the leaders on the team themselves. They were constantly talking about needing to push themselves.\"\nWith the Bombers wanting to simulate late-game situations where they would usually be exhausted, Pruett and his team worked on \"trying to completely empty the tank\" on the players, allowing them to work past the point of exhaustion.\nComparing last year's Anzac Day contest against Collingwood to this year's fixture shows the early results of the fitness camp are promising.\nEssendon looked headed towards a famous win against the Magpies in 2023, leading by 28 points at the final change, before Collingwood stormed home with seven unanswered goals in the final term.\nThe Bombers blew a lead early this time, but steadied to put together a stirring second-half showing against the reigning premiers where they went toe to toe before a Kyle Langford miss in the final minute resulted in a draw.\nThe nuts and bolts of the program\nHaving worked extensively in women's soccer in the United States, Pruett had some indication of what the fitness levels would be for the Essendon players, but was still left pleasantly surprised once they got underway.\n\"From the side of resistance and strength training we were completely in the dark ... we didn't really understand where they were going to be at in the weight room,\" he said.\n\"To my surprise, they were fairly educated and well-versed in resistance training and it didn't really require a ton of breaking things down and really coaching the basics. We were able to skip all of that and really get into some good training while they were here.\"\nThe Bombers cohort was split up into two groups, with the players doing two-a-day workouts. In the morning, the players would go through workouts geared towards improving their footwork, acceleration, sprint speed and endurance. Having done their cardio, the afternoon sessions would be centred around lifting and strength training.\n\"One day we would work on acceleration, one day we would work on multi-directional stuff, so we'd almost try to turn it into a block learning session so they could fully maximise an hour or two of the skill of changing direction or the skill of just acceleration, so they could really hone in on those specific movement patterns,\" Pruett said.\n\"In the weight room, we found taking them through more of a split-themed lift to where it was an upper and lower split to where we get maximal recovery with their legs because those guys are on their legs all the time - they were doing additional training on the weekends while they were out here.\n\"They were covering anywhere between five to 10 kilometres depending on what they had planned for their session on the weekend, so we were also having to stay in communication with them on that so we could auto-regulate our program based off of what they were doing on the pitch during the weekends.\"\nExos was also mindful of how much time the players spent on their feet throughout the program, given they were doing extra work themselves.\n\"Their conditioning with us, we thought about the fact that they're getting a ton of work on their legs already, especially with the stuff they were doing with themselves, so what other buckets could we fill with their conditioning?\" Pruett said.\n\"If they were going to be getting some extensive play out on the pitch, then we need to work on a little bit more intense shorter stuff.\n\"We thought about filling that bucket of intensive conditioning where we would have them do non-contact conditioning.\n\"We'd have them on VersaClimbers, bikes, take them through different circuits just to get their heart rate up and to hang out there on the very high end and we'd hold it up there for anywhere between 10 and 30 minutes.\"\nIn addition to going through the workouts, the players also had access to an on-site dietitian and a physical therapist. Exos prepared detailed reports on each player's progress which were sent to Essendon's strength and conditioning team ahead of the club's pre-season.\n\"Their staff in Australia could've easily told them to stay there, but they were super collaborative with us and encouraging of them to go out and have this experience and get takeaways from that,\" Gollis said.\n\"Any time we have the opportunity to work with teams that have that mindset, it's always a recipe for success.\"\nA German football icon left floored\nExos' relationship with the German Football Association (better known as DFB), meant world-renowned manager Hansi Flick was on-site when the Bombers were in Arizona.\nFlick, who recently signed as the manager of FC Barcelona, was in town going through some rehab at the facility after a hip replacement at the same time Essendon's players were being put through their paces.\nHaving won four Bundesliga titles as a player and then two more as the manager of Bayern Munich, Flick is no stranger to being exposed to elite athletes. He guided Bayern to a historic treble of the Bundesliga, the German Cup (DFB-Pokal) and the UEFA Champions League in 2020 before accepting a role as Germany's manager for the 2022 FIFA World Cup.\nDespite having plenty of experience around some of the best athletes in the world, Flick couldn't believe what he was seeing from the Bombers.\n\"He would watch them do their training - this is a guy who has worked with the highest level in soccer which is a very fit sport - and he would sit out there every day and just watch them and he was just in awe,\" Gollis recalled.\n\"He would tell me, 'These guys are cracking jokes and laughing but they're still running harder and faster than any athletes that I've ever seen before'.\n\"That was really the big surprise, the actual fitness level of these guys before they'd even hit their peak, even for someone who'd worked with athletes at a world class level.\"\n'The young buck' and veteran impress trainers\nAs photos on social media filtered out from the training camp in Arizona at the end of last year, a number of players had notably bulked up since fans had last seen them in action.\nPerhaps the most impressive transformation was in young midfielder Sam Durham, who had spent his first three seasons at the club playing primarily on the wing and halfback.\n\"He had a great mullet, the young buck,\" Pruett recalled.\n\"He definitely put on some weight. He was already adding the weight on when he got here, and that was one of the main things a lot of the veterans were telling him that he needed to do.\n\"He was already in that mindset and I think we were like the tipping point of pushing that envelope a little bit more and helping him explore ways of doing that.\n\"Obviously, our dietitian was talking him through how to properly do that. I'm not going to say it was (only) us by any means, we might've shown him a few good things that he could take away, but we were looking at pre and post pictures and he'd definitely beefed up a little bit.\"\nThe additional bulk has allowed Durham to shift into Essendon's engine room this year, with great effect.\nThe 22-year-old is averaging career-highs in disposals (19.9), tackles (4.3), inside 50s (3.6) and clearances (4.1), and has helped transform the Bombers' on-ball brigade into one of the AFL's most formidable midfield units.\nDurham has recorded three separate games of 25 disposals in his last four outings after having just one such game in his first three seasons at the AFL level.\n\"It's not uncommon for players to come here and be transitioning into a different position,\" Pruett said of Durham's transformation.\n\"It's either something they want to try on their own or something the team has told them to do.\n\"Different positions across every sport have different body types. The next part of it is the education and understanding.\n\"Yeah, we're not going to turn you into a Marvel character in two weeks, as much as we'd like to tell you that, but you can get the education and understand where you're at and based on the goals, we determine what's the strategy for you to get there in the most efficient and safest way possible, especially for guys like this that have to be strong, but have to be able to run.\n\"How can they get the best of both worlds and gain strength without sacrificing their movement ability?\n\"We have guys in every sport who are making changes like that and they come to us for guidance on how they can recomp their bodies and gain strength in new areas that will aid them in that transition.\"\nKyle Langford arrived in Arizona on the back of a career-best season which saw him kick 51 goals, but wasn't one to rest on his laurels.\nGollis recalled being taken aback by the Essendon forward's professionalism and attention to detail.\n\"I feel like he was the guy that probably spent the most time at the facility,\" he said.\n\"He asked a lot of questions from all the staff, all the guys did, but I just noticed him in particular. Even with myself, he was asking how the business works and talking with our PTs and getting insights.\n\"I think he was someone that was really eager to take advantage of the program. Now, he's one of the best forwards in the league and it's no surprise that it's paying off for him.\n\"All the guys were really eager to come out here and learn, so they all got done what they needed to do.\"\nAfter winning eight of its first 11 matches in 2024, a visibly fitter, faster and stronger Essendon side is off to one of its best starts in the last two decades.\nThey are a long way off any guaranteed success, but if it eventuates, teams around the competition will look to emulate the off-season camp that kicked off an era of success.",
  "word_count": 2624,
  "scraped_at": "2026-02-14T12:41:42.710267"
}