{
  "article_id": "5ea11350cee7",
  "url": "https://www.uefa.com/returntoplay/news/0287-195d047565ff-9739988b73e5-1000--champions-league-referees-promoting-new-campaign/",
  "title": "Champions League officials to promote  Be a Referee ! campaign | Inside UEFA",
  "date": "20231106T190000Z",
  "domain": "uefa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Champions League officials to promote 'Be a Referee!' campaign\nSunday, November 5, 2023\nArticle summary\nReferees will wear special jerseys to highlight UEFA's initiative, which aims to attract 40,000 new officials each season.\nArticle top media content\nArticle body\nMatch officials will wear unique shirts during this week's UEFA Champions League group stage matches to promote the new 'Be a Referee!' campaign.\nThe campaign, launched at the end of August, is UEFA's first-ever refereeing recruitment drive, and is designed to inspire young people across Europe to take up officiating. Working with member national associations, UEFA aims to recruit 40,000 new referees each season.\nThis week, top referees such as Danny Makkelie, Jesús Gil Manzano, Szymon Marciniak, and Daniele Orsato will be sporting special Macron shirts with special 'Be a Referee!' lettering to raise awareness of the programme, with special on-screen messages also set to feature in TV broadcasts ahead of games.\nDanny Makkelie, Champions League referee:\n\"It is a true pleasure to be part of the 'Be a Referee!' campaign, and I am excited about the unique shirt designed specifically for this cause. I am eagerly looking forward to a successful match and hope it will be a fantastic opportunity to promote our campaign.\"\nReferee to reach your next level\nTo kick off the campaign, top referees Michael Oliver and Stéphanie Frappart featured in a special video game-style clip, which showcased the skills needed and the excitement involved in officiating matches at different levels, from grassroots through to a major international final.\nProduced in 35 languages, UEFA shared the video with all 55 European national football associations, who recruit and train new referees.\nZvonimir Boban, UEFA Chief of Football and Director of technical development:\n\"This campaign holds immense significance for the future of football, as referees play a pivotal role in safeguarding the game on the field of play. In addition to improved fitness and a deep understanding of football, refereeing can equip young individuals with invaluable life skills that will serve them both on and off the field.\"\nRoberto Rosetti, UEFA chief refereeing officer:\n\"Being a referee is a very difficult job and courage is the most important value for refereeing. Protecting football and protecting the image of the game is our common goal.\"\nInstant impact: three national associations bringing more referees on board\nFinland\nThe Football Association of Finland (SPL) has attracted 800 new participants on its basic referee course over the past year, a huge number given the nation’s total number of qualified referees stood at 2,000 at the end of 2022.\nThis recruitment drive has included awarding a referee of the month prize in every region, much-needed recognition for officials.\nThe association’s refereeing courses have also been made more flexible, with the benefits of becoming a ref shared widely on the SPL's official website and social media channels, with particular support for young referees, or ‘game leaders’, participating in youth football.\nPortugal\nThe Portuguese Football Federation (FPF) is working hard to forge links with schools and universities. In schools, students have been offered the opportunity to referee interclass games, with some selected to then officiate interschool and finally regional level competitions, with weekend-long practical courses providing training and key knowledge on the laws of the game. Elite referees have also visited schools to share their experiences and demonstrate a pathway into the professional game.\nSwitzerland\nLast month, the Swiss Football Association (SFA) participated in a special \"Week of Referees\" alongside six other national sports federations, promoting respectful behaviour to officials. Men's national team coach Murat Yakin and SFA head of referees Sascha Amhof both recorded messages to thank everyone for their hard work and contribution to a fair game.\nAs part of the initiative, teams at all levels, from grassroots to the men's and women's Swiss Super Leagues entered the pitch before the game without the referee, with officials joining afterwards to applause.\n\"We are delighted that Swiss top-tier teams and many regional associations are showing solidarity with this action, giving referees the attention and recognition they deserve,\" said Amhof.\nThe SFA has a diverse pool of more than 4,800 registered referees from 92 nations, and has re-launched a website to attract more participants, featuring an interactive quiz.",
  "word_count": 702,
  "scraped_at": "2026-02-14T12:40:42.343962"
}