{
  "article_id": "5ee72d09829d",
  "url": "https://www.nbcnewyork.com/news/business/money-report/super-bowl-live-updates-chiefs-49ers-usher-and-star-studded-ads/5126481/",
  "title": "Super Bowl 2024 ads recap : DoorDash , DunKings , Beyoncé and the most - talked about commercials",
  "date": "20240212T054500Z",
  "domain": "nbcnewyork.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This was CNBC's live blog tracking all the commercials of Super Bowl 58. Read here to learn more about the ads and to watch them again after their debut.\nSuper Bowl 58 is in the books, and the Kansas City Chiefs won out over the San Francisco 49ers. But not everyone who tuned in to the matchup came for the big game.\nWatch NBC 4 free wherever you are\nThe Super Bowl is advertising's biggest stage, with companies jockeying for a limited supply of spots to get their products in front of millions of consumers. For the second consecutive year, the average cost of a 30-second ad spot was $7 million. Even as linear ad revenue slips, companies know there's no opportunity guaranteed to reach more people than the Super Bowl.\n\"Sports is still an advertiser's delight,\" Disney CEO Bob Iger said during the company's earnings call Wednesday.\nThis year, consumer packaged goods like Oreos, Pringles, Mountain Dew, Doritos and M&Ms dominated the ad line up. There were plenty of celebrity endorsements from the likes of Christopher Walken, Ben Affleck, Beyoncé, Quinta Brunson, Jenna Ortega, Kate McKinnon and Jennifer Aniston.\nThere were fewer automotive commercial this year, but those in the mix focused on showcasing new electric vehicles.\nHere are some of the notable commercials that aired during Super Bowl 2024:\n- Beyoncé tries to break the internet, with Verizon\n- Uber Eats wants you to remember it delivers almost anything\n- Ben Affleck and the DunKings, in Dunkin's ad\n- E-Trade introduces picklebabies\n- BMW starts 'Talkin' like Walken' to sell EVs\n- Arnold Schwarzenegger as a good neighbah for State Farm\n- Tina Fey enlists stunt doubles to help her experience everything Booking.com has to offer\n- Kate McKinnon and Hellmann's Mayo Cat take on food waste\n- Dan Levy and Lil Wayne do your homework for Homes.com\n- Robert Kennedy Jr. runs a Super Bowl ad\n— Amelia Lucas, Michael Wayland, Micah Washington, Gabrielle Fonrouge, Lorie Konish, Drew Richardson, Dan Mangan and Jordan Novet contributed to CNBC's Super Bowl coverage.\nSuper Bowl ads: Celebrities, snacks and 'Flashdance'\nThat wraps up the Super Bowl 58 ad slate.\nThe biggest snack brands from Oreos, Pringles and Mountain Dew to Doritos, M&Ms and Starry dominated the line up.\nThere were some head-scratchers, like Martin Scorsese's alien invasion and a curiously shaped Duolingo owl.\nAnd two commercials even spoofed the 1983 film \"Flashdance\" — looking at you, Nerds and T-Mobile.\nWe had stars. We had snacks. We had giveaways. And we had a heck of a lot of fun.\n— Sarah Whitten, Sara Salinas\nChiefs are back-to-back champs\nThe Kansas City Chiefs are Super Bowl champions. Again.\nAfter an overtime thriller that featured 75 minutes of lead changes, Patrick Mahomes led the Kansas City Chiefs to becoming back-to-back champs. This marks the Chiefs third Super Bowl victory in five years and puts Mahomes on a rare trajectory as a 28-year-old with three Super Bowl rings and a long career ahead of him.\nMecole Hardman caught the game-winning touchdown pass on a cleverly designed play from head coach Andy Reid, and Kansas City erupted into jubilation on the field immediately after.\n— Jake Piazza\nSan Francisco goes ahead in OT\nSan Francisco kicker Jake Moody made his third field goal of the game after a lengthy drive to start overtime.\nThe 49ers took a 22-19 lead but will have to stop Patrick Mahomes before they get to hoist the Lombardi Trophy.\n— Jake Piazza\nHet Gets Us returns to the ad slate\nFor the second year in a row, nonprofit religious organization He Gets Us is commanding conversation for its Super Bowl ads.\nThis year, the campaign's spot centered around Jesus washing the feet of his followers. The commercial again raised eyebrows on social media and spurred questions of who funds the pricey spots.\n— Sara Salinas\nAnd we're headed for overtime\nSan Francisco 49ers will receive the ball first during Super Bowl 58's overtime period, which is using new rules set by the National Football League just for playoff and championship games.\nBoth teams are guaranteed a possession, even if the first team to get the ball scores a touchdown. Each team gets three time outs, but no challenges. All reviews will be done by the officiating crew and the booth.\nThe overtime period is 15 minutes long.\n— Sarah Whitten\nTie ballgame\nThe battle of the kickers continues.\nKansas City kicker Harrison Butker nailed a short field goal to tie the game at 19-19 with three seconds left in regulation.\n— Jake Piazza\nMoody drills the go-ahead field goal\n49ers kicker Jake Moody got his chance at another big kick, and he delivered by drilling a 53-yard field goal to put San Francisco up 19-16.\nIt's up to the 49ers' defense now to stop Patrick Mahomes and the Chiefs.\n— Jake Piazza\nTaylor Swift Eras Tour on Disney+\nA blank white screen. Minimalist typeface. A series of iconic Disney lines shuffle on screen including \"May the Force be with you,\" \"Ohana means family,\" \"Why'd it have to be snakes?\" and \"Just keep swimming.\"\nIt ends with \"...Are you ready for it?\"\nThat's how Disney promoted that Taylor Swift's Eras Tour concert film would be exclusively on its streaming service Disney+ during Super Bowl 58.\n— Sarah Whitten\nDoorDash wants to deliver every Super Bowl ad to one lucky viewer\nDoorDash claims that it can deliver \"pretty much anything.\" So to live up to that promise, the delivery platform is offering to deliver goods — including snacks, cars and tax software — from all of the Super Bowl ads to one lucky viewer who enters the correct promotion code.\n— Amelia Lucas\nT-Mobile gives Jason Momoa that 'home internet feeling'\nIn the second T-Mobile ad of the night, Zach Braff and Donald Faison serenade \"Game of Thrones\" and \"Aquaman\" star Jason Momoa about the benefits of T-Mobile's home internet to the tune of \"Flashdance... What a Feeling.\"\nMomoa joins in, dancing and belting out his own version of the song.\n\"Flashdance\" star Jennifer Beals appears at the end, asking Momoa to sing it again, this time without his shirt.\n— Sarah Whitten\nChiefs tie it up\nThe Chiefs knotted the game up at 16-16 after getting stopped in the red zone and opting for a field goal.\nHarrison Butker drilled the ball through the uprights, which made the 49ers' missed extra point in the drive before all-the-more critical in the outcome of the game.\n— Jake Piazza\nBudweiser makes an 'old school' delivery\nWhen the power flickers, the Bud runs low and the roads are blocked with snow, it's time to deliver fresh kegs of Budweiser the \"old school way.\"\nThat's the premise of Budweiser's 60-second Super Bowl commercial.\nClydesdales trudge through the snow pulling a wagon filled with a new beer supply and nearly lose their way to the local bar. A friendly dog leads them the rest of the way and the bar erupts in cheers as a keg is wheeled inside.\n— Sarah Whitten\n49ers take the lead back\nJust when it looked like Patrick Mahomes and the Chiefs were finding their stride, Brock Purdy and the 49ers surgically drove down the field for the go-ahead touchdown.\nPurdy hit a running Jauan Jennings in stride, who then muscled his way into the end zone. Kansas City blocked the extra point to keep it 16-13 in favor of San Francisco.\nSan Francisco used a blend of Christian McCaffrey on the ground, a big play from wide receiver Brandon Aiyuk and a gutsy decision to go for it on fourth down to take the lead back.\n— Jake Piazza\nMicrosoft ad puts AI software on display\nMicrosoft's first ad for the big game in four years puts the attention on the company's free Copilot chatbot, which draws on artificial intelligence models from key partner OpenAI. The software maker's Copilot can generate human-like text, create images and answer questions from the web based on a few words of human input. It debuted last year, initially in Microsoft's Bing search engine, and has since shown up in other places, including the Windows 10 and Windows 11 operating systems.\nDuring the commercial, a young woman uses the Copilot iOS app to generate storyboard images for a script. Other people ask about coding, chemistry and a proposed sign for a truck-repair shop.\nAfter OpenAI's ChatGPT took off in late 2022, Microsoft has spent billions on computing infrastructure to handle generative AI tasks, along with additional investment in the startup. After all that spending, Microsoft wants to make money. In November the company started selling corporate subscriptions on a Copilot add-on for the Microsoft 365 productivity apps, and in January a premium Copilot Pro offering became available.\n— Jordan Novet\nKia tugs at heart strings for new all-electric EV9 SUV\nKia Motors took a different approach to its Super Bowl ad than other major automakers, leaning into an emotional message about family for its new all-electric 2024 Kia EV9.\nThe 60-second spot features a young girl figure skating in an arena but in the crowd there's an empty seat next to her father. After the performance, the two traverse snowy roads and terrain in the all-electric SUV to arrive at the girl's grandfather's house.\nThe father plugs in lights and a speaker to the vehicle's onboard power unit to light a frozen pond. The young girl then performs for the grandfather who wasn't able to make it to the rink.\nKia America Vice President of Marketing Russell Wager told CNBC the ad is meant to promote the new vehicle but also Kia's commitment to all-electric vehicles. He said Kia wants to be in the same discussion as U.S. EV leader Tesla when consumers consider an EV.\nThe Kia EV9 is the first large all-electric SUV from a mainstream brand to compete against the R1S from EV startup Rivian and the pricey GMC Hummer EV SUV.\nThe ad – set to Cat Power and Coldplay's collaborative track \"Wish I Was Here\" — was created by California-based David&Goliath, Kia's creative agency.\n— Michael Wayland\nKansas City takes the lead\nKansas City took the lead for the first time after Patrick Mahomes found a wide open Marquez Valdes-Scantling to go ahead 13-10.\nA muffed punt by 49er Ray-Ray McCloud on the play before set the Chiefs up with the short field, and Mahomes and company wasted no time taking advantage of it.\n— Jake Piazza\nKC Chiefs kicker breaks Super Bowl field goal record\nKansas City Chiefs kicker Harrison Butker has kicked the longest field goal in Super Bowl history. The 57-yarder passed through the posts in the third quarter of the big game.\nThe previous record was set in the second quarter of the same game by San Francisco 49ers' Jake Moody, who successfully made a 55-yard field goal.\nThe score now stands at 10 to 6 in favor of the 49ers.\n— Sarah Whitten\nPaging Dr. Umstick\nWhat happens when comedian Eric Andre has a meltdown on an airplane?\nEnter Dr. Umstick.\nFor its first ever Super Bowl advertisement, frozen dessert maker Drumstick is leaning into absurdist humor. The 30-second spot features a small marionette, reminiscent of those on the British show \"Thunderbirds\" from the '60s, called Dr. Umstick.\nAs Andre suffers a vague medical episode 36,000 feet up, a flight attendant asks if there's a doctor on the plane. While there is a real medical professional who offers aid, it's Dr. Umstick that comes to the rescue. Sort of.\nHe offers the cabin crew and passengers Drumstick ice cream cones. After all, he's not a \"body doctor.\"\n— Sarah Whitten\nVW leans into its American heritage to celebrate new EVs\nVolkswagen is celebrating its American heritage and new all-electric vehicles with a 60-second ad called \"An American Love Story.\"\nThe spot features the company's 75-year history in the U.S.– from its iconic VW \"Bug,\" or Beetle, and Microbus \"hippie van\" synonymous with 1960s counterculture to newer products, including its ID. 4 and ID .Buzz van all-electric vehicles.\nThe commercial features well-known moments of VW's past in the U.S., including nods to past advertisements of the German automaker.\nThe ad – set to Neil Diamond's 1971 hit \"I Am…I Said\" – ends with, \"We shape its metal. You shape its soul.\" It was created by New York-based ad agency Johannes Leonardo.\n— Michael Wayland\n'I pity the fool' Skechers ad\nMr. T, who played the foil to Rocky Balboa in Rocky III, starred in a Skechers commercial with Tony Romo.\nRomo starts the ad by saying, \"There's no T in skechers,\" to which Mr. T responds that \"T is always in Skechers.\" Mr. T drops his iconic line from Rocky III, \"I pity the fool\" in reference to people who don't wear Skechers.\n— Jake Piazza\nBeyoncé stars in Verizon ad to break the internet\nThirty-two time Grammy winner Beyoncé starred in a Verizon ad that featured her attempting to \"break the internet.\"\nIn the spot, Beyoncé announces several new newsworthy events, each one topping the last on her quest to \"break the internet.\" Despite it all, she's unsuccessful at overloading Verizon's internet.\nThe commercial ends with Beyoncé declaring, \"Drop the new music,\" which sent users of social media platform X into a tizzy trying to decode if there was new music from the megastar.\n— Jake Piazza\n'Dina and Mita' make a fiery debut in Doritos' commercial\nDoritos is bringing the heat to its Super Bowl ad — and it sent 'abuelas' Dina and Mita to do the dirty work.\nThe dynamic duo made an appearance Sunday night to promote Doritos 'Dinamita' tortilla chips — spicier varieties of its popular chips in Chile Limon and now four new flavors: Flamin' Hot Queso, Smokey Chile Queso, Tangy Fiery Lime and Hot Honey Mustard.\nAt the beginning of the minute-long commercial, 'Wednesday' star Jenna Ortega strolls the aisles of a grocery store as Dina and Mita look to snag the last Chile Limon-flavored Dinamita bag on the shelf — before it's quickly snatched by 'Top Gun: Maverick' actor Danny Ramirez. The abuelas go on an action-packed mission to get the bag back.\nDoritos are a product of Frito-Lay, a wholly owned subsidiary of PepsiCo.\n— Micah Washington\nToyota pitches performance with its new Tacoma pickup truck\nToyota Motor showcased its Tacoma pickup truck – one of its most crucial new products – during its return to Super Bowl advertising after a one-year hiatus.\nThe 30-second ad features the recently redesigned pickup truck racing through different rocky and sandy terrains with passengers screaming \"shut the front door\" or \"woah, woah, woah\" while gripping the vehicle's ceiling handle.\nThe voiceover quips that the handles the passengers were clinging to come standard on every Tacoma: the \"shut the front door\" handle, \"woah, woah, woah, woah\" handle, and \"no me gusta\" handle.\nThe ad, called \"Dareful Handle,\" was created by Publicis Groupe's Saatchi & Saatchi.\nToyota, which is the \"Official Automotive Partner of the NFL,\" is also airing a 30-second ad in Spanish for the Tacoma during Univision's broadcast of the Super Bowl.\nToyota's choice to showcase the Tacoma stands out from other automakers, which largely used their ads during the big game to feature all-electric vehicles.\n— Michael Wayland\nBud Light genie grants wishes for an epic night\nBud Lights' tiny genie grants wishes for football fanatics in the beer brand's 60-second commercial.\nTwo-time Super Bowl winner Peyton Manning and musician Post Malone join in on the fun as the wishes grow more and more demanding, including a request for a trip to the Super Bowl.\nAnheuser-Busch InBev, the parent company of Bud Light, has been focusing on marketing for sporting events and concerts amid backlash last year following a partnership with transgender influencer Dylan Mulvaney.\nResulting boycotts dented Bud Light sales, and the beer was dethronement as the best-selling beer in the U.S.\n— Micah Washington\nPfizer toasts to 'the next fight'\n\"Here's to science. Here's to the next fight. Let's outdo cancer.\"\nThat was Pfizer's message during the big game Sunday, set to \"Don't Stop Me Now\" by Queen.\nThe pharmaceutical giant was at the forefront of the Covid vaccine push a few years back, but it's been looking to its pipeline and dramatically cutting costs as that business declines.\n— Sara Salinas\nDon't forget, Uber Eats delivers almost anything\nTo remember that Uber Eats delivers almost anything, all you have to do is forget something else. That's the premise of the delivery service's 60-second Super Bowl ad.\nStarting with Jennifer Aniston forgetting long-time friend and \"Friends\" cast member David Schwimmer, the spot showcases celebrities and everyday people forgetting important details.\nVictoria and David Beckham forget the name of the girl group Victoria was a member of in the '90s, Jason \"Jelly Roll\" DeFord forgets he has face tattoos and Usher forgets that he's the Super Bowl Halftime performer.\nThe ad previously featured a controversial joke about a man forgetting that peanut butter contains peanuts (he's allergic), but it appears that bit was removed.\n— Sarah Whitten\nHero Cosmetics gets in on the action\nHero Cosmetics ran an ad just before the second half, with an anthropomorphic pimple begging to be popped. The company's Mighty Patches aim to help you clear blemishes, without the squeeze.\n— Sara Salinas\n'Hold my Oikos'\nActor and comedian Martin Lawrence teams up with former NFL tight end and current sports commentator Shannon Sharpe in Oikos' 30-second Super Bowl commercial.\nAfter crashing their golf cart in a pond, Lawrence and Sharpe banter about whether to call a tow truck. Lawrence hands Sharpe his half-eaten yogurt, saying, \"hold my Oikos\" and steps into the water to retrieve the cart.\nLawrence lifts the cart over his head and tosses it back onto the green. The commercial then touts how Oikos yogurt is packed with protein.\n— Sarah Whitten\nWelcome to Pluto TV country\nIt's Pluto TV's 10th anniversary, and it's celebrating on football's biggest stage.\nThe Paramount-owned, ad-supported streaming services is making its Super Bowl debut with a 60-second ad set in Pluto TV Country.\nHere, couch potatoes (people sporting large potato costumes) are grown and fed with \"the finest content from PlutoTV.\"\n— Sarah Whitten\nParamount+ promises a 'mountain of content'\nParamount+ mined its deep content library for its Super Bowl ad.\nAs Creed's \"Higher\" plays, \"Star Trek\" star Patrick Stewart hikes an animated Arnold from \"Hey Arnold\" and prepares to throw him upwards to the top a mountain cliff.\nStewart and Arnold alongside Drew Barrymore, Peppa Pig, \"Survivor\" host Jeff Probst, Knuckles from \"Sonic\" and a few other Paramount-owned characters are making their way up Paramount Mountain and have reached an impasse.\nMiami Dolphins quarterback Tua Tagovailoa has attempted to throw a grappling hook to the top of the cliff face, but fails, complaining if it was a football he could have done it. Stewart suggests throwing the football-headed Arnold, but Tagovailoa and Barrymore don't want to \"throw the child.\"\nStewart, donning an old school football uniform, makes his attempt. He fails and wonders aloud, \"Now if there was only someone made of pig skin.\"\n\"Oh dear,\" says Peppa as the commercial ends.\n— Sarah Whitten\nThe last decade of Super Bowl halftime performers\nSince the very first Super Bowl in 1967, the championship football game has included a halftime show. However, for decades the headliners were college marching bands, Disney characters and an Elvis impersonator.\nIt wasn't until boy band New Kids on the Block took the stage in 1991 that fans started to see the mid-game break as a concert-like performance. Then, two years later, Michael Jackson raised the bar.\nHere's who has taken the stage in the last decade:\n- 2023 — Rihanna\n- 2022 — Dr. Dre, Snoop Dogg, Eminem, Mary J. Blige and Kendrick Lamar\n- 2021 — The Weeknd\n- 2020 — Shakira and Jennifer Lopez\n- 2019 — Maroon 5\n- 2018 — Justin Timberlake\n- 2017 — Lady Gaga\n- 2016 — Coldplay\n- 2015 — Katy Perry\n- 2014 — Bruno Mars\n- 2013 — Beyoncé\n— Sarah Whitten\nYeah, yeah, yeah\nHere's Usher, taking the stage for the Apple Music Super Bowl halftime show. He's kicking it off with \"Caught Up.\"\n— Sara Salinas\nGifting with Etsy\nHow did America thank France for the Statute of Liberty? With a custom cheeseboard from Etsy, of course.\nIn Etsy's first ever Super Bowl commercial, the retail site encourages shoppers to use its new \"gift mode\" to find unique gifts for friends and family.\n— Sarah Whitten\nE.l.f. Beauty taps Judge Judy, cast from Suits\nE.l.f. Beauty returned to the big game on Sunday with a Super Bowl ad that featured Judge Judy as \"Judge Beauty\" and cast members from \"Suits\" – the USA Network's hit drama from the 2010s that recently got a second life on Netflix.\nThe ad features the famed judge overseeing a case against a corporate executive, played by Gina Torres, who is accused of using company funds to buy overpriced makeup.\nThe case's plaintiff, played by Rick Hoffman, calls pricey makeup a \"scam\" and in the end, Torres is sentenced to \"$14 glowy skin\" courtesy of E.l.f.'s best selling Halo Glow Liquid Filter.\nThe spot focuses on a core principle that's at the center of E.l.f.'s identity: Price does not equate to quality, and good makeup can still come at a drugstore price.\nThe ad aired just days after E.l.f. posted another quarter of outsized revenue growth and market share gains. The retailer has won over Gen Z and Gen Alpha shoppers with its viral TikTok marketing, but it's looking to expand its share with older shoppers and turn prestige makeup diehards into drugstore believers.\n— Gabrielle Fonrouge\n49ers lead heading into half-time\nHarrison Butker puts points on the board for the Kansas City Chiefs with less than a minute left in the first half.\nAt the midway mark, the San Francisco 49ers holds the lead with 10 to 3. Kansas City will get the ball to start the second half.\n— Sarah Whitten\nRobert Kennedy runs Super Bowl ad\nIndependent presidential candidate Robert Kennedy Jr. ran an ad for his 2024 presidential campaign, drawing on the historic roots of the Kennedy dynasty while urging Americans to vote independent.\nThe commercial had a vintage aesthetic that featured photos of Kennedy at various campaign events.\n— Jake Piazza\n'The DunKings'\nBen Affleck's journey to become a pop star, which was teased in an advertisement at this year's Grammys, continues in Dunkin's Super Bowl commercial.\nAffleck recruits Matt Damon and Tom Brady for his boy band \"The DunKings.\"\n— Sarah Whitten\nFirst touchdown...finally\nThe San Francisco 49ers scored the first touchdown of the game via a savvy play call from head coach Kyle Shanahan.\nIn a slow-developing trick play that likely felt like an eternity for 49ers fans, wide receiver Jauan Jennings caught a lateral pass from Brock Purdy, then threw it across the field to running back Christan McCaffrey. McCaffrey dashed his way into the end zone to put San Francisco up 10-0 with four minutes left in the first half.\n— Jake Piazza\nReese's teases big changes in commercial for its Caramel Big Cups\nBig changes are coming to Reese's — or are they? The narrator of the candy brand's spot has a handful of dedicated Reese's super-fans and viewers at home on their edge of their seats. But don't worry, the commercial is just to share that Hershey is making a \"few million\" of its Reese's Caramel Big Cups.\nDan Levy and Lil Wayne do your homework\nActor Dan Levy starred in a Homes.com commercial in which Levy plays a character taking over the company from his great-uncle.\nThe board room is skeptical, however Levy assuages their concerns by playing them a video in which he does \"the homework\" necessary to take over the company and help customers find homes. Lil Wayne is one of the experts who researches the local schools, and the commercial is capped off with Jeff Goldblum stamping his approval.\n— Jake Piazza\nT-Mobile 'Magenta Status' auditions\n\"Suits\" stars Patrick J. Adams and Gabriel Macht, Jennifer Hudson, Common, Laura Dern and even Bradley Cooper and his mom audition to be T-Mobile's next \"Magenta Status\" spokesperson.\n— Sarah Whitten\nKate McKinnon and Hellmann's Mayo Cat take on food waste\nKate McKinnon, fresh off her turn as Weird Barbie in Warner Bros.' hit \"Barbie,\" stars in Hellmann's new Super Bowl spot alongside a feline known as Mayo Cat.\nThe 60-second commercial centers on how Hellmann's can help with food waste, as Mayo Cat, a cat actor called Chipmunk, rises to fame for having a meow that sounds like \"mayo.\"\n\"This year's Big Game spot ... will certainly deliver on the laughs and the message of how to put a 'paws' on food waste,\" said Chris Symmes, senior marketing director of dressings North America at Unilever. \"We're excited to be back in the Big Game and to continue using this cultural moment, and second most wasteful food day of the year in the U.S., to help inspire viewers to think creatively about what's in their fridge.\"\n— Sarah Whitten\nE-Trade picklebabies\nTrash-talking babies take center stage in E-Trade's Super Bowl commercial.\nThe spot compares the fast-growing sport of pickleball to the daunting world of securities trading as two babies play doubles against two large, competitive adults.\n— Sarah Whitten\nOreo teaches us to \"twist on it\"\nWho needs to flip a coin when you can twist an Oreo?\nThat's the premise of Oreo's Super Bowl commercial.\nThe 30-second spot features Roman guards using the cookie, and a twisting maneuver, to decide if they should let the Trojan Horse through the gates, and two men who encounter an alien craft twist to determine if they tell anyone about their encounter.\nThen comes Kris Jenner, the matriarch of the Kardashian clan, sitting at her desk talking to a television producer.\n\"So, every little detail about our family will be on TV? Who would watch that?\" Kris asks, reaching for an Oreo. She twists.\nLaughing, she replies, \"Hope you can keep up.\"\n— Sarah Whitten\nLL Cool J brings the 'chill' to football fans during the big game\nThe Super Bowl can be tense for competing teams' loyal fans, so Coors Light brought in LL Cool J to chill things out.\nThe rapper and actor delivers beers to fans in hopes it can mitigate that competitive conflict.\nHe conducts the icy Coors Light train, traveling at a high-speed, where he runs into Grammy Award-winning artist and country musician, Lainey Wilson.\n— Micah Washington\nSan Francisco 49ers score first\nJake Moody puts the San Francisco 49ers up by three points with a successful 55-yard field goal to start the second quarter.\nThis is the longest field goal in Super Bowl history.\n— Sarah Whitten\nTrump tweaks Taylor and Travis amid right-wing election conspiracy theory\nFormer President Donald Trump took some shots hours before the game at pop superstar Taylor Swift and her Kansas City Chiefs player boyfriend Travis Kelce, who have become the focus of a bizarre election-year conservative conspiracy theory.\nIn a social media post, Trump blasted the idea of Swift again backing his likely November election opponent, President Joe Biden, and claimed to \"like\" Kelce while admitting the feeling is almost certainly not mutual.\nRight-wing social media influencers have claimed, baselessly, that the romantic relationship of the couple is phony, and was cooked up somehow to benefit Biden, whom Swift endorsed in 2020 when he defeated Trump.\n\"I signed and was responsible for the Music Modernization Act for Taylor Swift and all other Musical Artists,\" Trump wrote in his Truth Social post. \"Joe Biden didn't do anything for Taylor, and never will. There's no way she could endorse Crooked Joe Biden, the worst and most corrupt President in the History of our Country, and be disloyal to the man who made her so much money.\"\n\"Besides that, I like her boyfriend, Travis, even though he may be a Liberal, and probably can't stand me!\" Trump added.\nDina LaPolt, an attorney who played a key role in winning passage of the Music Modernization Act, which Trump signed into law in 2018, told Variety, \"Trump did nothing on our legislation except sign it, and doesn't even know what the Music Modernization Act does. Someone should ask him what the bill actually accomplished.\"\nThe MMA updated copyright law to better compensate performers for music played on digital streaming services, and also provided for compensation for performers who had been shortchanged on payments for recordings made prior to 1972.\n— Dan Mangan\n'Book whoever you want to be'\n\"Book whoever you want to be\" is tagline for Booking.com's Super Bowl commercial, featuring Tina Fey.\nFey explains that there are so many choices on the travel website that she's hired body doubles to help her experience all the options.\nThe spot includes cameos from \"30 Rock\" alums Jack McBrayer and Jane Krakowski as well as award-winning actress Glen Close.\n— Sarah Whitten\nHow are Nerds Gummy Clusters made?\nHow do Nerds Gummy Clusters get all those tangy, crunchy Nerds on the outside? The candy brand's 30-second Super Bowl commercial answers that question.\nAnd the answer is \"Flashdance.\"\nAs a rendition of Irene Cara's \"What a Feelin'\" blasts in the background, a giant gummy blob appears on a stage walking toward an empty chair. It pulls a chain dangling overheard, and a shower of rainbow colored Nerds descend, attaching to its form.\nThe commercial ends with Addison Rae, who rose to fame on TikTok, munching on a bag of Nerds Gummy Clusters.\n— Sarah Whitten\nScoreless in Las Vegas after the first quarter\nThe Kansas City Chiefs and the San Francisco 49ers are tied at zero to close out the first quarter of Super Bowl 58.\nThis is the first scoreless first quarter Super Bowl game since the New England Patriots and the then St. Louis Rams five years ago.\n— Sarah Whitten\nLike a good neighbah\nArnold Schwarzenegger appears in State Farm's Super Bowl ad as \"agent State Farm,\" an action hero who rescues puppies and pregnant women from burning buildings.\nIt's a commercial within a commercial as Schwarzenegger's acting is constantly interrupted by the director who wants the actor to pronounce \"neighbor\" with a \"bur\" not a \"bah.\"\nThe gag continues throughout the spot as Schwarzenegger pronounces other words that rhyme with neighbor in his iconic Austrian accent.\n— Sarah Whitten\n'Kingdom of the Planet of the Apes' trailer\nComing May 10 from Disney and 20th Century Studios, \"War of the Planet of the Apes\" picks up several generations after Caesar's reign.\nApes are the dominant species on the planet and humans have been reduced to living in the shadows. Directed by Wes Ball, the film centers on a tyrannical ape leader and a young ape who questions everything.\n— Sarah Whitten\nBMW starts 'Talkin' Like Walken' to sell EVs\nFamed actor Christopher Walken gets a taste of his own medicine, or at least his own voice, in BMW's Super Bowl ad for its new all-electric i5 sedan.\nThe 60-second ad is called \"Talkin' Like Walken.\" It starts with the celebrated actor seriously discussing the first BMW 5 Series EV with a valet attendant before lighter-hearted music begins and everyone Walken encounters starts imitating his well-known, dramatic voice and speech cadence.\nAlthough the overall growth of EVs is slower than many expected, sales in the luxury segment remain strong, led by Tesla. BMW's i5 sedan will compete with the Tesla Model S, with a starting price of about $68,000 to $87,000.\nBMW's lead U.S. creative agency, San Francisco-based Goodby Silverstein & Partners, created the ad, which also features a cameo by singer and Super Bowl halftime performer Usher.\n— Michael Wayland\nPepsiCo's Starry makes its Super Bowl debut with Ice Spice\nSoda brand Starry makes its Super Bowl debut in a spot featuring rapper Ice Spice. Starry's lemon and lime mascots come face to face with Ice Spice's old favorite soda in the commercial.\nPepsiCo introduced Starry more than a year ago. The lemon-lime soda replaced Sierra Mist, which struggled to take market share from Coca-Cola's Sprite and Keurig Dr Pepper's 7 Up.\n— Amelia Lucas\nApartments.com \"Extraterrentrials\"\nApartments.com aired its new \"Extraterrentrials\" ad featuring spokesperson Jeff Goldblum and two extraterrestrial beings who are looking for a place to say.\nThe military personnel in the commercial start off by saying they can't understand what the beings want, until Goldblum comes in and says they are clearly looking for a place to rent.\n— Jake Piazza\nMichael Cera-Ve\nActor Michael Cera popped by on Sunday to promote skincare brand CeraVe, for the obvious crossover opportunity.\nImages of Cera holding the company's popular facial washes and moisturizers spurred jokes online in recent days that Cera invented the products. (He didn't.)\n— Sara Salinas\nTemu returns to the big game with Super Bowl ad, surrounded by controversy\nTemu just aired a Super Bowl ad for the second year in a row. And this one was marred by controversy even before it ran.\nThe controversial Chinese e-commerce giant, owned by PDD Holdings, skyrocketed to prominence last year after it ran an ad during the big game just a few months after it was founded. For the second year in a row its ad promises the opportunity to \"shop like a billionaire.\"\nThe company is looking to rival Amazon and win over U.S. shoppers by being the next best \"everything store\" with lower prices than competitors, but lawmakers say it uses slave labor in its supply chain and spies on its customers.\nThe allegations have prompted a congressional investigation into Temu, along with Shein and other apparel retailers with a manufacturing presence in China, from the House Select Committee on the Chinese Communist Party.\n\"Some people watch the Super Bowl for the commercials as much as the game. It's sickening to think a company built on slave labor with close ties to the Chinese Communist Party is going to make a direct appeal to millions of Americans all at once,\" committee member Blaine Luetkemeyer, R-Mo., told CNBC of Temu's ad. \"A flashy advertisement for the site's cheap products is lipstick on the ugliest pig around.\"\nIn response, a Temu spokesperson told CNBC its standards and practices surrounding the use of forced labor are \"no different\" from major e-commerce players like \"Amazon, eBay and Etsy\" and the allegations \"are completely ungrounded.\"\n\"Before setting up their stores and listing products on Temu, every seller has to sign an agreement. This document stands as a pledge to maintain lawful and compliant business operations, and adhere strictly to the legal standards and regulations of their specific markets,\" the spokesperson said.\n— Gabrielle Fonrouge\nJason Sudeikis, Lionel Messi star in Michelob Ultra commercial\nMichelob Ultra's commercial features \"Ted Lasso\" star Jason Sudeikis and superstar Lionel Messi, putting on a clinic for a bunch of beach-goers.\nMichelob Ultra is owned by the world's largest brewing company, Auheuser-Busch InBev. In January, AB InBev Chief Executive Officer Michel Doukeris said the beer market was still resilient amid looming supply chain issues.\n— Micah Washington\nChris Pratt stars in Pringles' commercial with a very familiar mustache\nPringles' commercial stars actor Chris Pratt as himself — but with a handlebar mustache that looks just like the one sported by the Kellanova brand's mascot, Mr. P, on the side of the chips can. The resemblance helps Pratt land a new gig as Mr. P.\n— Amelia Lucas\n'Wicked' teaser\nUniversal offered Super Bowl viewers a glimpse of the first of two films based on the Tony Award-winning musical \"Wicked\" on Sunday.\nStarring Cynthia Erivo as Elphaba and Ariana Grande as Glinda, the spot featured just one snippet of Erivo belting out a line from \"Defying Gravity,\" but promised lots of visual whimsy for fans.\nThe first film, directed by Jon M. Chu (\"Crazy Rich Asians\"), will arrive on Nov. 26.\n— Sarah Whitten\nDisclosure: Comcast is the parent company of NBCUniversal and CNBC.\nIt's mullet mayhem for Kawasaki's Super Bowl ad\nA newcomer to this year's Super Bowl advertising slate is Kawasaki, which many may know for its motorcycles and Jet Skis. You won't see those rides in the Japanese company's ad, though. Instead, you'll see the new Kawasaki Ridge two-seat, side x side off-road vehicle.\nAnd you'll see a whole lot of mullets.\nThe 45-second ad, called \"Mullets,\" depicts people and animals alike coming into contact with the vehicle and instantaneously growing mullets — the \"business in the front, party in the back\" hairstyle that was popular in the 1980s and is having a bit of a renaissance. The ad's characters include a bear, turtle, bald eagle — and retired professional wrestler Stone Cold Steve Austin.\nIt was created by San Francisco-based Goodby Silverstein & Partners.\n— Michael Wayland\nPopeyes' Super Bowl debut puts the spotlight on its chicken wings\nPopeyes makes its Super Bowl debut with a commercial highlighting its recent launch of chicken wings.\nActor and comedian Ken Jeong stars as Howie, a man who was cryogenically frozen the year that Popeyes was founded. Scientists unfreeze him now that the Restaurant Brands International chain finally offers chicken wings as a permanent menu item, with five flavors.\nHowie also gets an introduction to other modern technologies: Roombas, Labradoodles and self-driving cars.\n— Amelia Lucas\nTo Lindt, 'life is a ball'\nPerry Como's \"Round and Round\" plays in the background of Lindt's 30-second Super Bowl commercial.\nWith the tagline \"Life is a Ball,\" the spot showcases different people indulging in the iconic creamy chocolate balls.\nThe commercial was directed by Michael Gracey, who helmed 2017's \"The Greatest Showman.\"\n— Sarah Whitten\nAubrey Plaza has a 'blast' in Mountain Dew commercial\nPepsiCo's Mountain Dew is featuring actress Aubrey Plaza in its Super Bowl commercial.\nThe \"White Lotus\" actress is faced with mild to wild scenarios, but not even a blow to the head from pool noodles or a shaky elevator could stop her from \"having a blast\" — a reference to the citrus-flavored beverage.\nPlaza is reunited with her \"Park and Recreation\" costar Nick Offerman as they fly dragons and share a laugh while indulging in some Mountain Dew.\n— Micah Washington\n'Deadpool & Wolverine' trailer drops\n\"You're little cinematic universe is about to change forever,\" Wade Wilson promises in the first trailer for \"Deadpool & Wolverine.\"\nThe third installment in the Deadpool franchise, this new film is the first connected to the Disney-owned Marvel Cinematic Universe. The trailer features plenty of swearing and adult humor, making clear that the Ryan Reynolds-led film is embracing its \"R\" rating and not pulling any punches.\n— Sarah Whitten\nBetMGM is for everyone, except Tom Brady\n\"The truth is you've won too much, Tommy,\" Vince Vaughn tells seven-time Super Bowl winner and famed quarterback Tom Brady in BetMGM's ad for Sunday's big game.\nThe spot depicts various scenarios where individuals question their eligibility to use BetMGM, only to have Vaughn reassure them that their only disqualification is being Tom Brady.\nHockey Hall of Famer Wayne Gretzky also makes an appearance. He is permitted to bet using BetMGM, because he is not Tom Brady.\nBetMGM on Friday announced a new partnership with social media platform X to integrate betting odds into X's sports content.\n— Sarah Whitten\nM&M's offers comfort to 'almost champions' with lookalike ring\nM&M's spot highlighting the candy's function as a comfort food features some notable losers — or near-winners, as they might call themselves — offering consolation where it can.\nMiami Dolphins legend Dan Marino narrates the spot introducing M&M's \"Almost Champions Ring of Comfort.\" To make the ring, M&M's are crushed into diamonds. Then Football Hall of Famers Terrell Owens and Bruce Smith and two-time Academy Award nominee Scarlett Johansson sigh onto the gems, which are shaped into a ring resembling the one given to Super Bowl winners.\n— Amelia Lucas\nWe have kick off\nKansas City Chiefs kicker Harrison Butker kicked off to San Francisco 49ers returner Ray-Ray McCloud for a touchback to begin the action.\n— Jake Piazza\nKansas City Chiefs win the toss\nAs the visiting team, the San Francisco 49ers selected \"tails\" during the coin flip to start off Super Bowl 58.\nThe coin landed on heads. The Kansas City Chiefs offered to defer, meaning they will get the ball to start the second half and the 49ers will receive the opening kickoff.\n— Sarah Whitten\nGronk misses his chance at redemption\nFanDuel ambassador Rob Gronkowski missed his Kick of Destiny. Again.\nThe sportsbook promo promised $200 in bonus funds to every bettor who put $5 on Gronkowski if he had made the kick.\n— Jake Piazza\nTurboTax brings in Quinta Brunson for her first Super Bowl ad\nTurboTax has released a Super Bowl commercial in each of the last 11 years, but this is the first for \"Abbott Elementary\" star Quinta Brunson.\nThe actress, under the direction of Taika Waititi, asks viewers: \"What if the most epic move of Super Bowl Sunday was… taxes?\"\n— Sarah Whitten\nCBS's pregame show has started\nCBS's pregame show for Super Bowl 58 has started.\nAn emotional introduction video of players and family describing how meaningful the big game is kicked off the action, followed by play-by-play commentator Jim Nantz and color commentator Tony Romo breaking down some of the keys to the game for both teams.\n— Jake Piazza\nMacquarie Capital expects over $1.5 billion to be wagered on Super Bowl 58\nChad Beynon of Macquarie Capital shares his predictions that Super Bowl 58 will have on the sports betting industry.\nGronk's 'Kick of Destiny' redemption\nRob Gronkowski missed his \"Kick of Destiny\" last Super Bowl. Now he's back with a vengeance.\nThe FanDuel promotion promises $200 in bonus bets to all patrons who put $5 on the former NFL tight end to make a 25-yard field goal on Super Bowl Sunday.\n— Sarah Whitten\nLas Vegas has invested billions into sports. Will it pay off?\nOnce known mainly for gambling and debauchery, Las Vegas has catapulted itself to the world of professional sports in recent years. Now it's hosting Super Bowl 58.\nAllegiant Stadium, where the Super Bowl will be played, has spurred change. The $2 billion venue was built for the NFL's Las Vegas Raiders and opened in 2020. It holds a capacity of 65,000 people. This has allowed the city to host events of major magnitude, such as sold-out Beyoncé and Taylor Swift concerts in 2023, and now, the biggest U.S. sporting event of the year.\n\"We're not really concerned about our supply of fun being more than the United States or the world can handle,\" said Las Vegas Convention and Visitors Authority CEO Steve Hill in August 2023. \"We're going to keep adding to that, and we're confident that people around the globe are going to continue to come.\"\nAllegiant Stadium brought 1.52 million incremental visitors to the area, according to the 2023 impact report by the Las Vegas Raiders, with 88% of those visitors saying it was \"the primary reason for their visit.\"\n— Natalie Rice\nReba McEntire to belt out National Anthem\nAcclaimed country singer Reba McEntire will help kick off Super Bowl 58 with a rendition of the national anthem.\nR&B singer and actress Andra Day will perform \"Lift Every Voice And Sing,\" and Post Malone will sing \"America the Beautiful.\"\nThe big question is how long will it take McEntire to belt out the anthem? You see, there's always a prop bet on the length of the national anthem.\nHere's how long previous singers have taken:\n- 2023: Chris Stapleton - 2:01\n- 2022: Mickey Guyton - 1:51\n- 2021: Eric Church & Jazmine Sullivan - 2:17\n- 2020: Demi Lovato - 1:49\n- 2019: Gladys Knight - 2:01\n- 2018: Pink - 1:52\n- 2017: Luke Bryan - 2:04\n- 2016: Lady Gaga - 2:23\n- 2015: Idina Menzel - 2:04\n- 2014: Renée Fleming - 2:03\n- 2013: Alicia Keys - 2:36\n- 2012: Kelly Clarkson - 1:34\n— Sarah Whitten\nSuper Bowl commercials 2024: Here’s what viewers can expect\nMarcus Collins, University of Michigan marketing professor and 'For The Culture' author, joins CNBC's \"Squawk Box\" to discuss this year's Super Bowl commercials, whether they make financial sense for companies, and more.\nHow the NFL is transforming the media business with streaming\nThe NFL isn't just the most popular sports league in the U.S., it's also the most valuable with the highest-rated programming and the priciest ad time.\nIn 2021 the league signed an estimated $110 billion worth of media deals covering 11 years, which reportedly was nearly double the value of its previous contracts.\n\"If you're the most valuable content on those platforms, you're going to be the bulk of their investment. And that's what we are,\" said Brian Rolapp, chief media and business officer for the NFL.\nAn average of nearly 18 million people tuned in to watch football games across TV and digital platforms during the 2023 regular season, the highest since 2015 and the second-highest ever, according to the NFL.\nThe pinnacle of the NFL's popularity is the Super Bowl, the biggest television event of the year. Of the 30 most-watched broadcasts of all time in the U.S., 22 have been Super Bowl games, according to Nielsen.\nThe NFL's move to ESPN in the late 1980s catapulted the rise of cable TV. Now, its jump into streaming is having ripple effects across the media and tech landscape.\n— Andrew Evers, Julia Boorstin and Jeniece Pettitt\nTaylor Swift arrives at the Super Bowl with Ice Spice and Blake Lively\nIn what may have been the most tracked travel itinerary in recent memory, Taylor Swift has arrived safely in Las Vegas ahead of Super Bowl 58.\nThe NFL tweeted on Sunday a picture of Swift on site at Allegiant Stadium, hours after the pop star performed a show in Tokyo, Japan. She was accompanied Sunday by actress Blake Lively and rapper Ice Spice.\nSwift arrived back in the U.S. yesterday in Los Angeles, off the heels of four back-to-back shows in the Tokyo Dome.\nPublic speculation on whether Swift would make it back to the U.S. in time to attend the Super Bowl in support of her boyfriend Travis Kelce (tight end for the Kansas City Chiefs), reached a fever-pitch in recent weeks. The public interest even prompted a press release from the U.S. Embassy in Japan, assuring fans that Swift would be able to pull off the international trek.\n— Drew Richardson\nUsher to headline this year's halftime show\nUsher will light up the stage at halftime during Sunday's Super Bowl.\n\"It's an honor of a lifetime to finally check a Super Bowl performance off my bucket list,\" he said in a statement ahead of the game. \"I can't wait to bring the world a show unlike anything else they've seen from me before.\"\nUsher follows Rihanna, who performed the 2023 halftime show and broke viewership records when she unveiled her second pregnancy during the performance.\nHe's expected to bring in a number of musical cameos including Lil Jon and Ludacris to perform his hit song \"Yeah.\"\n— Sarah Whitten\nLive from Allegiant Stadium\nOur colleagues at NBC News are live from Allegiant Stadium with on-the-ground coverage of Super Bowl 58. Follow along for concession menu items, fan updates and live game reports.\n— Sara Salinas\nAmericans will bet a record $23.1 billion on Super Bowl 58\nSunday's Super Bowl 58 will take place in Las Vegas, the gambling capital of the nation.\nAnd a record 67.8 million Americans are expected to place an estimated $23.1 billion in bets on the game, up from $16 billion last year, according to the American Gaming Association.\nBut if you wager money, keep in mind that the U.S. government expects to participate in your gains, said Mitchell Drossman, national director of wealth planning strategies at Bank of America.\n\"The IRS is your silent partner when it comes to anything that you win,\" he said.\n— Lorie Konish\nHow to watch Super Bowl 58\nIf you're looking to catch Sunday's big game between the Kansas City Chiefs and the San Francisco 49ers there are plenty of ways to watch.\nFor tradition cable users or those who subscribe to live TV streaming services, the game will air live on CBS. A kid-friendly version will also be available on Nickelodeon where virtual filters, on-field graphics and guest reporters will pop up.\nIf you're hoping to stream the game, it will be featured on Paramount+, CBS Sports HQ, CBSSports.com and the CBS Sports app, which is available on TV devices such as Amazon Fire TV, Apple TV and Roku.\n— Sarah Whitten",
  "word_count": 8130,
  "scraped_at": "2026-02-14T12:41:15.928254"
}