{
  "article_id": "5f0306586b14",
  "url": "https://www.recorder.com/Keeping-Score-Bad-week-for-UMass-50214546",
  "title": "The Recorder - Keeping score : Bad week for UMass",
  "date": "20230311T030000Z",
  "domain": "recorder.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning!\nIt wasn’t a good week for UMass, first the Blarney Blowout and then the Brooklyn Blowout. Blarney, the annual drunkfest where UMass students showcased alcohol abuse, the latter where the UMass basketball team said sayonara to the season.\nUMass lost by 33 points to Richmond, a sub-.500 team that was favored by three points. Did the coaching staff forget to give the team a wakeup call for the 11:30 a.m. tipoff? Are bed checks still allowed? Is it possible for a team to play that badly after a good night’s sleep?\nThe 71-38 score was a national embarrassment for the school and a crushing blow for athletic director Ryan Bamford who on March 29, 2022, anointed Frank Martin to be the program’s savior. “There is no better coach, no better fit, and no better time than right now for Frank Martin to be our coach,” said Bamford, who could compose a greatest hits list of all his coaching introductions.\nMartin went along with the notion he’d lead the Minutemen on the road to Damascus. He bragged of being the greatest coach in the history of Kansas State, and of having the winningest seven-year record at South Carolina since the 1970s. “We’re going to be relentless,” he promised. “We’re going to answer the bell. We’re going to get this program back in the NCAA tournament.”\nAfter a 9-3 start against non-league teams, UMass went 6-12 in the A-10 and fell to 187th in USA Today’s Sagarin ratings, one spot ahead of mighty Montana.\nBamford hasn’t had a winning season in basketball or football since he arrived here eight years ago this month. Under his watch UMass has become a career killer, just ask Charley Molnar, Walt Bell and Matt McCall.\nPat Kelsey probably shuddered when he saw Tuesday’s UMass score. Six years ago he left Winthrop University in Rock Hill, S.C., to coach the UMass basketball team and bolted a half hour before his introductory press conference. Kelsey had a sick feeling in his gut that he’d be swallowed up by bureaucratic apathy and the losing culture.\nHis decision to do a mea cupla and return to Winthrop was courageous. He stayed in Rock Hill for four winning seasons, and after his penance moved south to coach at the College of Charleston. This week the Cougars beat UNC-Wilmington to win the CAA tournament and qualify for March Madness with a 31-3 record.\nKelsey signed a contract extension in February and said, “Defense wins championships but so do administrations, and Matt Roberts is the best AD in America.”\nThat had to sting, and it makes me wonder if Frank Martin has ever regretted not running for the hills.\nBay State sports fans are getting slammed by ads imploring them to sign up for FanDuel and get $100 in bonus bets, or sign up on DraftKings and get “up to” $200, but like they said at the chariot races, caveat emptor. According to bettingusa.com, bonus bets (or bet credits) always expire, only pay net winnings, restrict certain types of wagers, and are non-withdrawable.\nThe Mass. State Lottery has counter-attacked with $50 scratch tickets called Billion Dollar Extravaganza. What handsome tickets they are, but the odds of winning $100 (net $50) are 9-2, of winning $500 ($450 net) are 45-1, and of hitting $1,000 (less taxes) are 832-1. As for the reality you’ll win anything higher, fuhgetaboutit.\nThe UMass hockey season ended on Wednesday with a 5-2 loss to BC before a sparse crowd of 1,376 at the Conte Forum. Despite the down year (13-17-5, 7-14-3) the Minutemen averaged 4,429 fans at the Mullins Center which was slightly more than last year, according to the College Hockey News.\nAlso per CHN, the Big Ten is king of the college hockey box office (through March 7), averaging 6,259 fans per game throughout the league. The National Collegiate Hockey Conference was next (5,358), followed by Hockey East (3,733) the Central Collegiate Hockey Assoc. (2,441) and the ECAC (2,018). RIT and Sacred Heart led Atlantic Hockey, averaging 2,815 and 2,224 per game, respectively.\nUMASS SQUIBS: UMass football coach Don Brown has hired Jim Reid to be an analyst. Reid won three conference championships at UMass in the 1980s and 247Sports named him linebacker coach of the year at Iowa in 2013. … Spring football starts March 28 and the spring game is April 29 when fans can get a look at QB transfers Taisun Phommachanh (Clemson/Ga. Tech) and Carlos Davis (Western Carolina). … UMass softball improved to 5-9 after taking two from Colgate last weekend in Tallahassee… UMass baseball opened the season by taking two of three from Navy last weekend. … UMass women’s lacrosse is 5-1, its only loss to No. 5 BC. … UMass men’s lacrosse is 3-2 including an 18-9 loss to Yale witnessed by Bulldogs fan Jim Still: “Not the most talented UMass team out there right now, but Greg Cannella is an excellent coach.”\nSQUIBBERS: Northfield native George Miller did a splendid job on deadline of covering Pioneer’s 70-69 win against KIPP (Knowledge Is Power) Academy of Lynn on Tuesday. Coach Scott Thayer’s Panthers have put Pioneer on the map at a time when enrollment’s down and the school needs all the publicity it can get. … UMass transfer Tre Mitchell played all 40 minutes and scored 17 points in West Virginia’s 78-62 win against Texas Tech in the Big 12 tourney on Wednesday. … Over 1,000 fans crowded into Orr Rink last Saturday and saw Amherst lose a 1-0 overtime heartbreaker to Williams in the NESCAC semifinals. One day later, Bowdoin won the championship, 3-2, in OT. … The Ft. Lauderdale Sun Sentinel reported that MLB is set to take over the local broadcasts of up to 16 teams — including the Braves, Tigers, Rays and Cardinals — when Bally Sports and AT&T SportsNet go belly-up as expected. … Baseball was saddened to learn that Rays’ radio voice Dave Wills died in his sleep on Sunday morning. The 58-year-old Wills joined the team in 2005 and was on the air the previous day for the Rays-Yankees game. … Some good news for UMass hoops: The Minutemen topped 50,000 in home attendance and averaged 600 more fans per game (3,580) than 2021-22. … Greg Carvel praised his former assistant Ben Barr after last week’s sweep of the Black Bears: “Ben is doing a really good job up there. His team plays hard. We had the better goalie. We are 6-4 in our last ten games. Played better down the stretch.” … Aaron Rodgers has the DTs — Donald Trump syndrome — he just can’t let it go that the Packers moved up to get Jordan Love with the 26th pick in the 2020 draft. … ESPN’s Mel Kiper says four QBs could go off the board within the first nine picks on April 27: CJ Stroud to Houston, Bryce Young to the Colts, Will Levis to the Seahawks and Anthony Richardson to the Panthers. The Patriots pick 14th and need a cornerback, but SI predicts they’ll take Georgia OL Broderick Jones. … Former UMass goalie Jonathan Quick won his first game as a Golden Knight on Sunday, making 25 saves in a 4-3 win against Montreal. … RIP Tim McCarver, a Hall of Fame broadcaster but no friend of the Boston Red Sox, as per Roger Angell’s account of the 1967 World Series. Almost a half-decade later, listeners heard McCarver groan the moment he saw Koji Uehara pick off Kolten Wong to end Game 4 of the 2013 World Series. … Bob Lemon pitched 13 seasons, all with Cleveland, won 207 games and said of his 128 losses: “I never took the game home with me. I always left it in some bar.”\nChip Ainsworth is an award-winning columnist who has penned his observations about sports for decades in the Pioneer Valley. He can be reached at chipjet715@icloud.com",
  "word_count": 1318,
  "scraped_at": "2026-02-14T13:07:55.190817"
}