{
  "article_id": "5f05078c7ba7",
  "url": "https://www.afl.com.au/aflw/news/1062179/erin-phillips-oam-announced-as-best-on-ground-medal-presenter",
  "title": "Erin Phillips OAM announced as best on ground medal presenter",
  "date": "20231108T024500Z",
  "domain": "afl.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The AFL officially launched the 2023 NAB AFLW Finals Series today, unveiling the 2023 Premiership Cup and marking the beginning of a spectacular four weeks of finals football across the country.\nGeneral Manager Women's Football, Nicole Livingstone was excited to announce that recently retired AFLW champion, Erin Phillips OAM, will present the medal for best on ground on NAB AFLW Grand Final day, an accolade she has won in two of her three AFLW Grand Final appearances.\nThe dual league best and fairest and three-time All Australian played her final AFLW game on Saturday, bowing out with a late-game goal and finishing as the most decorated player so far in the competition's history.\nSpeaking at the 2023 NAB AFLW Finals Series Launch today, Phillips said she is looking forward to the finals festivities over the next four weeks.\n\"I remember when Debbie Lee presented me with my very first best on ground medal, it was really special for me. It's a really nice reflection when you can perform at your best on the biggest stage possible, so I'll be looking forward to presenting this medal to the worthy winner in December.\n\"The AFLW finals series this year is going to be epic. The fans will create a great atmosphere and I'm looking forward to going along as a spectator and taking my kids,\" Phillips said.\nAFL General Manager Women's Football, Nicole Livingstone said the perfect scene was set for the 2023 NAB AFLW Finals Series.\n\"We are excited to confirm the 2023 NAB AFLW home-and-away season was the highest attended season on record, with a total attendance of 234,525 recorded across the 10 rounds,\" Livingstone said.\n\"The quality of football this season is some of the best women's footy we have ever seen, and we have an incredible finals series shaping up, all culminating with what we hope will be another record-breaking NAB AFLW Grand Final on Sunday 3 December.\n\"I'm delighted Erin will be at the Grand Final to help us celebrate. She is one of our foundation players and has provided some of the most iconic moments of the women's league since its inception.\"\nLivingstone also announced today that the AFL will introduce a celebration of AFLW retirees and AFLW award winners at the 2023 NAB AFLW Grand Final.\nSimilar to the traditional festivities at the Toyota AFL Grand Final, eligible AFLW retirees and AFLW award winners, including the league Best and Fairest, Leading Goalkicker, Rising Star, Mark of the Year and Goal of the Year recipients, will be honoured in a fitting pre-match tribute.\n\"As the women's game evolves, so does the delivery of our Grand Final presentation and the need to recognise the significant contribution of the players to the competition,\" Livingstone said.\nAs part of the Finals celebrations, the 2023 NAB AFLW Premiership Cup Tour will also hit the road this month, visiting four states and territories across two weeks in the lead up to the 2023 NAB AFLW Grand Final.\nCommencing in Adelaide on Monday, the Cup Tour aims to celebrate female football excellence from grassroots to the elite, highlighting a number of football communities that have experienced participation growth in women and girls' football in South Australia, the Northern Territory, Queensland and Victoria.\nThe AFL also announced this week that kids will go free to the entire 2023 NAB AFLW Finals Series, including the Grand Final, as well as a price freeze on adult tickets for weeks one to three.\nTicket prices for weeks one to three will remain the same as the 2023 home-and-away season and the previous three finals series – frozen at $10 for adults and concessions, while juniors (under 18) can attend for free.\n2023 NAB AFLW Grand Final tickets will be $20 for adults and $10 for concessions, while access for juniors remains free.\nA bumper first week of Finals is scheduled, with minor Premiers the Adelaide Crows set to take centre stage at home against the Brisbane Lions in the first qualifying final at Norwood Oval on Saturday afternoon.\nThe action then heads north as the Gold Coast SUNS host the Sydney Swans at Heritage Bank stadium in the first elimination final on Saturday night.\nA super Sunday afternoon is scheduled as the second elimination final kicks off with Geelong Cats taking on Essendon at GMHBA Stadium, before the series heads to Ikon Park to see Melbourne take on the North Melbourne Tasmanian Kangaroos.\nAll 2023 NAB AFLW Finals matches will be broadcast live nationally on the Seven Network and Fox Footy and streamed live on Kayo. Matches will also be streamed live via womens.afl and the AFLW Official App.\nFurther information on the 2023 NAB AFLW Finals Series can be found here.",
  "word_count": 786,
  "scraped_at": "2026-02-14T12:40:43.538060"
}