{
  "article_id": "5f0acca30762",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=327338",
  "title": "Verizon named Telecommunication Services Sponsor for FIFA World Cup 26™ and Tournament Supporter for FIFA Women World Cup 2027™",
  "date": "20240924T181500Z",
  "domain": "webwire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Verizon named Telecommunication Services Sponsor for FIFA World Cup 26 and Tournament Supporter for FIFA Womens World Cup 2027\n- Deal marks first-ever agreement between FIFA and the world-class network provider\n- Verizon will power experiences for fans and customers leading up to, during, and after FIFA World Cup 26, while also ensuring state-of-the-art connectivity across stadiums\n- Collaboration to ensure everyone across the tournament can follow every second of the action\nAn agreement between Verizon and FIFA was announced today, with the world-class network provider named the Official Telecommunication Services Sponsor for the FIFA World Cup 26 in Canada, Mexico and the U.S., as well as a Tournament Supporter in the U.S for the FIFA Womens World Cup 2027.\nBuilding on Verizons reputation as the go-to communications network partner of choice for sports and entertainment powerhouses, Verizon will now be powering future FIFA World Cup experiences for fans, players, media and more. For the FIFA World Cup 26, Verizons connectivity services will play a vital role across stadiums, official sites and various parts of the tournament operations, in what is the first-ever deal between the two organizations.\nThe FIFA World Cup and the FIFA Womens World Cup are events that bring together global communities with a shared passion for the game, said Hans Vestberg, Chairman and Chief Executive Officer of Verizon. Verizon is committed to powering experiences that fans love, whether theyre on the ground or on the go. Our partnership with FIFA will power this connection for soccer fans around the world and enable the type of experience that only Verizon can deliver.\nFIFA President Gianni Infantino added: Football unites the world, and to unite the world we need to ensure that everyone is connected. Verizon is joining us on this journey to make football truly global, and will create the network that brings fans, players, partners and media alike together in 2026. We believe in the power of unity and, together, were excited about how Verizons involvement in these two groundbreaking tournaments can help grow the global game.\nThe FIFA World Cup 26, the pinnacle of mens soccer, is coming to the U.S. for the first time since 1994 as well as Canada and Mexico and will be the largest ever held, with 48 teams playing 104 matches. In partnership with FIFA, Verizon will help cater for the influx of fans, players and visitors around the country ensuring that networks across stadiums, communities and cities keep fans, players and every attendee connected to all of the action. In addition, Verizon will deploy a program for international fans to access the Verizon network upon landing in the U.S. and Canada, ensuring a reliable connection for all visitors.\nThe FIFA Womens World Cup 2027 will be the tenth edition of the tournament, with 32 nations competing for glory. Brazil will host the FIFA Womens World Cup for the first time, becoming the first ever South American nation to host the competition. The U.S. has hosted the competition twice and won it four times.\nAs an Official Tournament Supporter for the FIFA Womens World Cup 2027 in the U.S., Verizon will bring experiences for fans leading up to, during and after the games, including activations, unique giveaways, player meet-and-greets ahead of the tournament, and more.\n( Press Release Image: https://photos.webwire.com/prmedia/8/327338/327338-1.jpg )\nWebWireID327338\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 575,
  "scraped_at": "2026-02-14T12:33:07.060653"
}