{
  "article_id": "5f3089da93cf",
  "url": "https://www.westmeathindependent.ie/2025/10/16/gibson-believes-athlones-bench-options-will-aid-double-mission/",
  "title": "Gibson believes Athlone bench options will aid double mission",
  "date": "20251017T000000Z",
  "domain": "westmeathindependent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gibson believes Athlone’s bench options will aid double mission\nAthlone Town star Madison Gibson believes John Sullivan will have some major selection headaches ahead of the Women’s FAI Cup final this Sunday.\nAthlone face Bohemians at Tallaght Stadium on Sunday, bidding to add the FAI Cup to their Women’s Premier Division crown.\nChloe Singleton (the Athlone native receiving a warm ovation from the crowd) and Kerryanne Brown both made their returns from injury in last Saturday’s 4-0 win over Sligo Rovers. Their return in the last league game of the season increases the options available to team manager Sullivan.\n“We have a really strong bench, especially with Chloe and Kerryanne coming back. They made their debuts (for the season) tonight, so really proud of them for that. And we have such a strong bench with the younger girls. So yeah, John has a hard time selecting the team each week, but that’s a good problem to have,” Gibson told the Westmeath Independent, following the victory over Sligo.\n“It was definitely good for us. We wanted to end the season with a win and keep the momentum going for the big game next Sunday. So yeah, every game we want to put on our best performance and I think we did,” she continued.\nNaturally Madison was delighted for her teammate and fellow American Kelly Brady, who finished as the league’s top scorer.\n“She definitely earned it. You know, she works so hard. She’s running everywhere and those goals come from all her hard work this season, so really proud of her and I’m glad she got it (the Golden Boot award).”\nGibson’s wing wizardry has laid on many chances for Brady and others this season. Asked about her role in the team’s success, she said modestly: “I just try to get the ball in the box for my teammates to help them get the goals.”\nThe scorer of two goals last Saturday evening, Gibson again demonstrated her specialty of scoring direct from corners - something which has become a serious weapon in Athlone’s arsenal.\n“I always just try to put it on top of the keeper and give my team the best chance of getting it in the goal. So yeah, I just try to whip it in and I aim to put it on top of the keeper every time I take a corner,” she said.\nAlthough agreeing that Athlone have a significant advantage in experience over Bohemians, Gibson is not taking their challenge lightly by any means.\n“We know that Bohemians are a good side and they have ended the season very strong so we’re not going to take anything for granted,\" she said.\n\"We’re going to try our best and we respect them no matter where they finished in the league. We know that they’re a good team and we have to play to our best to beat them.”\nAsked if it was difficult for the team to remain focused after the sudden resignation of former manager Colin Fortune, Gibson said: “We know things like that happen in football and we just had to keep our heads and that’s exactly what we did and put our best foot forward,” added Madison, who works on a part-time basis in the recently reopened Lough Ree Inn in Coosan Point.",
  "word_count": 549,
  "scraped_at": "2026-02-14T13:33:20.432974"
}