{
  "article_id": "5f308fa2356a",
  "url": "https://www.broadcastnow.co.uk/broadcast-magazine/what-makes-a-successful-podcast/5191906.article",
  "title": "What makes a successful podcast ? ",
  "date": "20240418T153000Z",
  "domain": "broadcastnow.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "At the Broadcast Sport Content Summit, Vibrant Television, talkSport and Two Circles execs discussed how podcast producers can monetise their content and ensure it pops with listeners\nWhat is the idea behind your podcasts?\nISH KALIA The idea for Big Kick Energy came about because I know [comedian and podcast presenter] Maisie Adam from having exec produced A League of Their Own.\nMaisie’s always been a fan of women’s football, and the reason Big Kick Energy works is because [co-presenter] Suzi Ruffell has only really got into women’s football since the Euros win. She’s the avatar for people who don’t really follow the game, but are happy to ask quite basic questions. So we had that nice balance – we do serious conversations and cover some of the serious issues, but we have a laugh as well.\nLUCY LAVERY We have the benefit of being under the talkSport banner, as well as the wider umbrella of The Times and The Sun, which helps with promotion. Our ideas vary – sometimes someone will come up with a really big idea, pitch it and you think, ‘Wow, that’s amazing’.\nBut then when we analyse who it is aimed at, it might only appeal to a limited audience, which we don’t want. You want the big reach, the big cult following. And everyone wants something that goes viral every episode.\nFRANCIS KELLY We’re mainly sports federation-based and for brands, so we’re fortunate that we already have our audience. But then it’s about tailoring what we do to reach our audience. We have to look at different routes to market and how we can engage with that community. We use social media content a lot.\nHow do you grow your audience?\nIK Maisie and Suzi already have social media and comedy followings, so that helps. We focus a lot on the Women’s Super League, but there are other leagues too, and we want to platform those teams and audiences as well, but it’s really hard to please everybody when you’re putting out a 45-minute show. Our access point is comedy, so if you like comedy, you don’t necessarily have to like football to listen in, and that hopefully will help us continue to grow.\nLL It’s important to be constantly developing your podcast, because you will reach a natural plateau. But we’ve found that our loyal listeners are very sensitive to change – if you change a presenter, all hell breaks loose. So it’s about when we make a change, doing it very slowly so they [the audience] almost don’t notice.\nThat’s the same with our visual podcasts as well. We started slowly introducing clips and now when we do pitch a podcast, nine times out of 10 it is visualised. That’s how podcasts are going to evolve in the future – visualisation is going to be key.\nFK A lot of [our content] is around a sports tournament so you have a short time span to get people engaged. Most podcasts are ones that you listen to on a regular basis. So if we try to disrupt that with something for a two-week or four-week span, it needs to have something that will get people’s attention. And again, that’s where the social media side of things comes to the fore.\nThe one where we have been able to play around and mix things up editorially is the Fantasy Premier League pod. For our first season last year, we were trying to add an extra guest and reach beyond the realms of the established fandom and find people from outside of sport who love playing the game, to reach a new audience that way. But we found that listeners wanted the core three people, so we’ve gone back to that.\nIK We’re a weekly podcast so we’re following the weekend’s games and looking at some of the news stories around that week. Because it’s topical, you will come to it because you want to hear Maisie and Suzi’s opinions on stuff that’s going on.\nBut what I like about podcasting – slightly contradicting what’s happening at talkSport – is you can tinker a bit with the format week by week. Anyone here who works in television will know there’s a lot of chin stroking and there are a lot of stakeholders, and it takes months to get things signed off, sometimes years. With our podcast, I quite like the slightly punk aesthetic of it, where we just record a pilot and stick it out.\nHow do you monetise your podcast?\nLL We’re trialling having a podcast behind a paywall, which is obviously quite difficult because there’s no ‘try before you buy’. [For that to work] it has to have real exclusivity, something that they can’t get anywhere else. IK We did two live shows in London and one in Brighton, and we’re planning to do a few more up north.\nIt’s a natural progression because they’re comedians and they’re used to being on stage, working a room and talking to the audience.\nFK Our monetising side of things depends on each federation, how they want to distribute their podcast and what their end goal is. For a lot of them, it is about brand awareness. We do a lot of work with brands that associate themselves with the podcast.\nLL From my perspective, it varies depending on the project. Sometimes we’ll have a brand approach us and say they’re looking to put their stamp on a rugby podcast, and then we’ll work with them editorially to try to shape it to fi t their criteria.\nIK We’re on the megaphone platform. Ads run through it, so that brings in some revenue, which helps pay for some of the costs. And there are obviously potential branding opportunities.\nLL We get ad revenue from listenership on different platforms, but our main driver of revenue is sponsorship. And we also try to tap in to the big events, such as the Olympics, Euros, World Cup and so on. We make sure we reach out to brands with plenty of time to say, ‘We’re building this exciting product and we’d really like your stamp over this’.\nFK Whereas we don’t use ads because, for a lot of brands, they don’t want to have other brands appear within their podcasts.",
  "word_count": 1051,
  "scraped_at": "2026-02-14T12:41:57.392292"
}