{
  "article_id": "5f414268147a",
  "url": "https://www.theguardian.com/world/2026/feb/13/friday-briefing-will-westminster-ever-clean-up-its-act-over-lobbying",
  "title": "Friday briefing : ​Will Westminster ever clean up its act over lobbying ? ",
  "date": "20260213T090000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. The fallout from the revelations about Peter Mandelson’s relationship with convicted paedophile Jeffrey Epstein has already claimed several high-profile scalps, including Keir Starmer’s chief of staff, Morgan McSweeney.\nAs attention turns to whether Starmer can steady his premiership, it is vital not to lose sight of something else that this episode has laid bare: Westminster’s enduring relationship with corporate lobbyists.\nThe files sent a shock wave when they showed Mandelson forwarding highly sensitive emails to Epstein within seconds of receiving them. Far less examined were questions about his former firm, Global Counsel, and its links to Palantir, the US tech company which now boasts major UK government contracts, including with the NHS.\nWes Streeting’s decision to publish his WhatsApp messages with Mandelson was intended to draw a line. Instead, it illustrated how seamlessly political and corporate networks overlap. One exchange showed Streeting circulating a US politics briefing that came to him via Jim Murphy, the former Labour cabinet minister who now runs the lobbying firm Arden Strategies. That same firm is under scrutiny for offering corporate clients, including arms companies, access to senior officials for fees reportedly as high as £30,000.\nTo understand why these connections matter, and why lobbying reform so often stalls despite cross-party promises, I spoke to Henry Dyer, the Guardian’s investigations correspondent. That’s after the headlines.\nFive big stories\n-\nUK politics | Keir Starmer’s attempt to shake up his top team after the disastrous Peter Mandelson scandal began on Thursday, when he forced out his most senior civil servant with a view to replacing him with Antonia Romeo.\n-\nUK news | Parents of one of the victims of Vincent Chan have said they live in “constant fear” of the long-term damage the trauma will have on their child, as the paedophile nursery worker was sentenced to 18 years in prison.\n-\nEpstein files | A top lawyer at Goldman Sachs and former White House counsel to Barack Obama has resigned in the wake of emails showing a close relationship between her and Jeffrey Epstein, whom she referred to as “Uncle Jeffrey”.\n-\nEducation | Primary school-age children who question their gender could be allowed to use different pronouns under long-awaited government guidance to schools on the subject.\n-\nMedia | President Trump’s multibillion dollar lawsuit against the BBC over the editing of one of his speeches has been set for a year’s time.\nIn depth: ‘What’s infuriating is knowing it’s an issue and doing nothing’\nConcerns about lobbying are not new. In early 2010, in the aftermath of the MPs’ expenses scandal, David Cameron, then opposition leader, warned that “secret corporate lobbying” would be the “next big scandal”. In his speech, he said: “We all know how it works. The lunches, the hospitality, the quiet word in your ear, the ex-ministers and ex-advisers for hire, helping big business find the right way to get its way.”\nThe irony, Henry Dyer tells me, is that a decade later Cameron himself would face scrutiny after lobbying ministers and senior officials 56 times at the height of the pandemic in what critics described as an increasingly desperate effort to secure government support for Greensill Capital, the finance firm he advised and held shares in.\n“What it shows is that Westminster has been fully aware that the access of outside private interests [sometimes to] MPs and Lords, but sometimes through MPs and Lords to government and ministers, is there,” Henry explains. “Everyone knows it’s happening.”\nIt is an issue that reaches both chambers of parliament, with Henry having reported doggedly on lobbying and standards in the House of Lords. My colleague Peter Walker produced a comprehensive rundown in 2021 of the lobbying scandals that have plagued Westminster. It is telling that, only five years on, it already feels outdated.\nYet, Henry adds, “None of the successive governments of different parties have taken the action necessary to deal with it.”.\nHow does lobbying work?\nBefore we delve into the scandals at the heart of government, I asked Henry to explain how lobbying works. “If you and I worked in a company making widgets and wanted regulation changed, we could try to get a meeting with a minister and lobby directly,” he says.\nThe public record may simply note that a meeting occurred, he adds, but it doesn’t have to state that lobbying took place.\nLobbying can also be outsourced. “We could hire a consultant lobbyist, perhaps someone with links to the minister. Under the regulations, they would have to declare that we were their client and that they had lobbied on our behalf. There’s slightly more transparency, but it’s not radical transparency,” Henry says.\nMinisters also routinely accept tickets, travel and event access. These are all declared, but rarely prevented. This was one of the first scandals to dog Labour months after their landslide elections in the summer of 2024, known helpfully, as freebiegate. The Guardian’s political correspondent Pippa Crerar has an excellent run down of how the scandal unfolded and the impact it had on Labour.\n“Before the Qatar World Cup, more MPs took an interest in Qatar and joined All-Party Parliamentary Groups (APPGs), likely knowing it could mean tickets and travel,” Henry says. “Those are gifts worth thousands of pounds. They are declared, but nothing stops them.”\nThat point is worth emphasising: in many cases there is little evidence that parliamentary rules were technically broken, even when it is clear that ethical lines have been blurred. That gap is precisely why campaigners have long argued for tougher, clearer rules.\nWhat have Labour done?\nThere has been piecemeal reform on lobbying since 2010. Under the coalition government there was the Lobbying Act, for example, which introduced a threadbare set of regulations on consultant lobbying.\nWhen Labour was in opposition, it made a series of promises on lobbying and standards, Henry says, largely in response to the PPE procurement scandal. During the pandemic, nearly £4.1bn of public money went to suppliers with political connections, many through so-called “VIP” or “high priority” lanes that fast-tracked firms referred by ministers and MPs, often without adequate due diligence.\nReaders may recall figures such as Michelle Mone, whose company supplied unusable PPE and who has been ordered by a court to repay £122m, and Owen Paterson, whom a parliamentary watchdog found had made 14 lobbying approaches in an “egregious” breach of the rules that brought parliament into disrepute.\nLabour was vocal in opposition, but what have they managed to do while in government? There have been some notable tweaks. The government has a register of lobbyists it interacts with that used to be published quarterly, which Labour described as ridiculous in opposition. “In power, they changed it to monthly declarations on gifts and hospitality, but not meetings,” Henry says.\nA 2024 parliamentary committee report called for contact made via WhatsApp and other instant messaging platforms to be included in the lobbying register. The messages published by Wes Streeting show exactly why that matters, yet there has been little sign of movement on implementing the change.\nThe government also announced that they would restrict payments for ministers leaving office following a serious breach of the ministerial code.\nAnd last October, Labour created the Ethics and Integrity Commission, which was central to Starmer’s promised robust new approach to government and to any ministerial misdeeds. The commission took over the previous committee, which was described by critics as fundamentally toothless.\nWill this make a difference? Henry isn’t convinced. “It’s effectively the Committee on Standards in Public Life with a new title,” he says. “It has no new powers. It can make recommendations, but the government can ignore them.”\nHe adds that the government introduced the Representation of the People Bill yesterday, which proposes a limit on foreign gifts of £2,230.\n“That’s a very high threshold. If you or I accepted a £2,230 gift related to our work, there would be serious questions. For MPs, it’s still seen as fine. That speaks to a culture that hasn’t changed.”\nThere are individual MPs who go further, Henry says, pointing to Sian Berry who publishes a list of everyone she meets and more frequently than the government does.\nOther MPs refuse gifts. “But the culture in Westminster remains that accepting gifts worth more than £2,000 is fine and electors won’t think it’s an issue,” he says.\nEarlier this week, Darren Jones, the chief secretary to the prime minister, delivered a speech on reviewing standards in public life, arguing that “Peter Mandelson’s disgraceful behaviour” raised questions about whether the current system is robust enough to catch those who seek to break the rules.\nHenry listened closely. There were warm words about reform, he says, but little in the way of concrete change.\nWhy has there been so little change?\nLobbying as an issue in politics has been cropping up since the first world war. So why have successive parties been unable to fix it? “Because politicians find it useful to be given briefings,” Henry says.\nA report by Rowena Mason, the Guardian’s Whitehall editor, published during the 2024 general election illustrates this point. More than a dozen private-sector lobbyists and consultants were embedded in Labour’s shadow cabinet teams after the party sought business help to shape policy, particularly in complex areas such as AI. Faculty AI told staff, in a leaked memo, that it had amended its ethics policy to allow an employee to work with Labour one to two days a week.\nWhat politicians are failing to grasp, Henry says, is that “repeated failures to clean up politics are more damaging than the individual scandals,” adding that people accept there will be politicians who break the rules. “What’s infuriating is knowing it’s an issue and doing nothing.”\nThe reports on the possible impact of lobbyists in the heart of government continue to come out in drips. A big area now is AI, Henry explains, which the government is keen to be seen embracing.\n“One big company is Palantir,” Henry says, which has tremendous access to the British state. Since 2023, Palantir has secured more than £500m in contracts with the NHS and the Ministry of Defence (MoD).\n“Starmer visited its offices in the US while Mandelson was ambassador,” Henry says. “Palantir was a client of Global Counsel, Mandelson’s lobbying firm. He still held shares.”\nHe pointed to a recent report in the Times reporting a party hosted by Palantir to celebrate a large contract with the MoD. The invite list included MoD employees, journalists and others in the defence industry.\n“That is the gifts and hospitality culture Cameron warned about in 2010 happening again,” Henry says.\nWhat else we’ve been reading\n-\nItaly are having a cracking Winter Olympics, with 13 medals through the first five days of the contest. Is it as simple as homefield advantage, or is there more to it? Beau Dure digs in. Charlie Lindlar, newsletters team\n-\nI love Alexis Petridis’s list of the best songs inspired by literature. There are so many I didn’t know about! Aamna\n-\nPeter Walker digs into Keir Starmer’s unpopularity in this analysis. Is it the man himself, deepening disapproval in all politicians … or both? “People relate better to politicians who look like they enjoy the job, and they react quite badly to politicians that look pained by it,” one pollster chips in. Charlie\n-\nLabour’s earned settlement proposals have sparked a major furore. Union leader Andrea Egan explains why so many across the labour movement are mobilising against it. Aamna\n-\nAs someone who sticks their fingers in their eyes every day putting contacts in, I found great value in Sarah Phillips’s ultimate experts guide to taking care of your eyes. (Turns out its leafy greens you need, not carrots). Charlie\nSport\nWinter Olympics | Vladyslav Heraskevych has accused the International Olympic Committee of doing Russia’s propaganda for them after he was barred from racing in the Winter Games because he wanted to wear a “helmet of memory” in honour of Ukraine’s war dead.\nFootball | Arsenal’s lead over Manchester City at the top of the Premier League stands at just four points after Mikel Arteta’s title-chasing side were held to a 1-1 draw at Brentford. Meanwhile, Manchester United took a big step towards the quarter-finals of the Women’s Champions League by sealing a comfortable lead in the first leg of their playoff against Atlético Madrid.\nFootball | Thomas Tuchel has signed an extension to his England contract that will keep him in charge of the national team until after Euro 2028. Tuchel will remain manager regardless of England’s fate at the World Cup this summer.\nSomething for the weekend\nOur critics’ roundup of the best things to watch, read, play and listen to right now\nFilm\nIt’s Never Over, Jeff Buckley | ★★★★☆\nAmy Berg’s arresting documentary about the exquisitely beautiful and prodigiously talented 90s singer-songwriter, Jeff Buckley, explains how he and his mother were abandoned when he was an infant by his father, Tim Buckley, a singer and counterculture figure who was to die of a heroin overdose in his late 20s. Jeff died at 30, in an accidental drowning in Wolf River Harbor, Memphis, Tennessee, in 1997. Berg uses extensive interviews with his mum, Mary Guibert – the film’s executive producer – and two of his girlfriends, Rebecca Moore and Joan Wasser, as well as Jeff’s answering machine messages and archive 90s material to tell a very sad story with sympathy and urgency. Peter Bradshaw\nTV\nHow to Get to Heaven from Belfast | ★★★★☆\nIn this new sitcom from Derry Girls creator, Lisa McGee, Dara (Caoilfhionn Dunne), Saoirse (Roisin Gallagher) and Robyn (Sinead Keenan) are old school friends who reunite to attend the funeral of Greta (Natasha O’Keeffe), who completed their teenage gang of four. According to the local grapevine, Greta was killed by a fall down the stairs but Saoirse immediately suspects foul play, and the friends are soon investigating. It’s written with McGee’s customary wit, brutality and sensitivity, and the actors keep the whole thing together and emotionally credible, though the preposterousness of the plot increases at a geometric rate. Buckle up, and enjoy. Lucy Mangan\nMusic\nFabiano Do Nascimento & Vittor Santos Orquestra: Vila | ★★★★☆\nOver the past decade, Brazilian guitarist Fabiano do Nascimento has honed a sound so expansive it may make you think the prolific soloist and collaborator had four hands playing his instrument. On Vila, he features alongside the 16-piece Vittor Santos Orquestra, showcasing his ability to weave seamlessly through the orchestra’s dynamic range rather than playing a single role. It’s imaginative mood music that never quite reaches its full dramatic and explosive potential. Instead, the album luxuriates in gentle, sweeping viola and violin lines, and alternates between metallic picking and warm strumming on the guitar. Ammar Kalia\nBook\nSuper Nintendo by Keza MacDonald\nThe Guardian’s video games editor delivers a winsomely enthusiastic biography of Nintendo, the company that had become an eponym for electronic entertainment long before anyone had heard the words “PlayStation” or “Xbox”. MacDonald’s conversations with all the gifted (and often eccentric) creative people who actually make the games are full of wholesome insights, as are her own superb analyses of favourite games, and of the general vibe of Nintendo: its “toymaker philosophy” is an antidote, she argues, to the increasingly baleful role that technology plays in all our lives. Steven Poole\nThe front pages\n“PM ousts top civil servant in shake-up of No 10 team” is top story at the Guardian. The i paper has “Cull at No 10 as Starmer tries to relaunch his leadership” and the Telegraph says “Rayner turns on Starmer over pubs”. The Times leads on “Pupils able to change their gender at school” while splash at the Mail says “Labour opens door to trans children in primary schools”. The Independent headlines on “Ratcliffe’s own goal over ‘apology’ for UK migrants slur”, while the FT splashes with “City champion Schroders agrees to £9.9bn takeover by US rival Nuveen”. The Mirror says “Unmasked”, in reference to the murderer of 12-year-old schoolboy Leo Ross.\nToday in Focus\nWes Streeting: the UK’s next prime minister?\nKeir Starmer was on the brink of a leadership contest this week, but he pulled it back. That does not mean his rivals have gone away. Nosheen Iqbal speaks to Kiran Stacey about one of the most hotly tipped contenders: Wes Streeting\nCartoon of the day | Ben Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nWatching the sun set over Bolivian salt flats. Living without screens. Having no sense of what time or day it was. Since April 2022, Andreas Graf has lived a life of freedom.\nAfter building a career in engineering, the then 31-year-old Norwegian got too “hungry for adventure” he decided to literally get on his bike. Four years later, he’s been cycling around the world, visiting everywhere from Turkmenistan to Nepal and Australia to Ecuador (with the help of a few ferries and flights, of course).\nNow back home, Graf tells Rachel Dixon he worries slightly about readjusting to what most of us call normality. “I haven’t looked into a computer screen in almost four years, so it just feels so wrong,” he says. “I want to go out and look at a tree! On the weekend, I’m going to take my tent and disappear in the forest for a little while.”\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2937,
  "scraped_at": "2026-02-14T12:37:54.267386"
}