{
  "article_id": "5f4eaf078561",
  "url": "https://www.mirror.co.uk/travel/uk-ireland/im-treated-like-security-risk-35911044",
  "title": "  Im treated like a security risk at airports because of my rare condition  ",
  "date": "20250916T160000Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EXCLUSIVE: 'I'm treated like a security risk at airports because of my rare condition'\nRebecca Legon was born with a rare condition called PFFD, which stopped her leg from forming correctly during early fetal development. She has spoken about the issues she has encountered while travelling\nA star of Britain's Missing Next Top Model is 'treated like a security risk' at airports because she has a limb difference.\nRebecca Legon was born with a rare condition called PFFD, which stopped her leg from forming correctly during early foetal development. She had it partly amputated at the age of six, so she could wear a prosthesis and lead a more active life.\nThe East Sussex woman can't run, but is pretty mobile with a walking stick and leads a full, happy life. \"Because I was born like that, I grew up and adapted. In daily life, I kind of do pretty well,\" she told the Mirror.\nAs is the case for many people with disabilities, travelling can be a huge source of anxiety and problems for Rebecca. Issues that may seem small to some people, such as a broken escalator, can become serious obstacles for her.\nREAD MORE: Historic European city has highs of 27C in October and is totally 'magical'READ MORE: Beautiful UK island rejects charging tourists as it ‘just doesn’t make sense’\"It's the invisible barriers that make life extra tough. A few weeks back, I was coming home from my family holiday. The flight was delayed. I had my 10 and 7-year-olds with me. I had to make it to the connecting flight, with the kids in tow and hand luggage. I was worried we weren't going to make it.\n\"As we exited the aircraft, an escalator was out of order. I made it up, but it was really difficult in an already challenging moment. As I sat on the flight, I thought, 'It's crazy this keeps happening.'\"\nOver the years, Rebecca has encountered many hurdles while travelling, including hotel bathrooms without accessible showers. \"You have to crawl in,\" the mum-of-two, who starred on the BBC Three show Britain's Missing Top Model, explained.\nAirport security is also a problem. \"During the security checks, you get yourself worked up and anxious. It makes you feel like you're guilty. You're extra manhandled. The problem is that the laws vary. There is no one rule that fits all,\" Rebecca said.\n\"On two occasions, I have had to take my prosthesis off completely. You have crazy thoughts at that point. You are quite vulnerable. Is anyone going to mess with it? They're taking part of your body and putting it through a security scanner. Sometimes they make you take your trousers down. It is very invasive and not very comfortable.\"\nMost of the issues arise in countries where airport technology is less advanced. Rebecca believes if all airports had full-body scanners, then she would encounter far fewer difficulties when travelling.\n\"The second incident, which really shocked me, was at Dubai airport in 2023. Despite Dubai being known for such fantastic accessibility, I was pulled aside by the head of security who demanded a search in a private room and insisted I remove my prosthesis to be put through the security scanner,\" she said.\nREAD MORE: Holidaymaker 'horrifically burned as Shein top reacts with suncream’READ MORE: Newlyweds 'heartbroken and embarrassed' as their honeymoon is cancelled\"It was a frightening experience, and I felt extremely vulnerable and disrespected. Thankfully, I was travelling with close friends, so I felt safer that I wasn’t alone. There seemed to be no legitimate reason for her request - it has left me a little anxious about returning to visit my best friend who lives there.\"\nRebecca proudly represented England’s Lionesses amputee football team at the inaugural Women’s World Cup in Colombia in 2024 and is passionate about supporting the global rise of inclusive sport.\nShe is also a keen hiker and lover of physical challenges. She believes the mind is often stronger than the body. Through her advocacy, she inspires others to embrace resilience. With determination and a positive mindset, she believes that almost anything is possible.\nSadly, her experience is not unusual; recent research from MMGY, of more than 3,473 adults, revealed that 84% of individuals with accessibility needs have had a negative experience while travelling.\nThe top five issues included:\n- Challenges with accessible transportation\n- Difficulty boarding or disembarking\n- Inaccessible or unclear travel information\n- Costs associated with accessible travel\n- Lack of staff training on how to assist passengers with mobility needs\nRebecca is a supporter of Ottobock’s Invisible Class campaign, which aims to raise awareness of issues and demonstrate the potential that arises from sharing knowledge, challenging established structures and making experiences visible. Ottobock has created a A Guide To Accessible Travel for individuals seeking to support the community and join the journey to make every journey possible.",
  "word_count": 814,
  "scraped_at": "2026-02-14T12:36:53.427203"
}