{
  "article_id": "5f67480d693e",
  "url": "https://www.90min.com/sonia-bompastor-winning-part-chelsea-dna",
  "title": "Sonia Bompastor : Winning is part of Chelsea DNA",
  "date": "20241211T173000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sonia Bompastor: Winning is part of Chelsea's DNA\n- Chelsea host FC Twente in the UWCL on Wednesday evening\n- The London clubs have won every single game so far this season\n- Sonia Bompastor says they won’t take their foot off the gas\nChelsea manager Sonia Bompastor insists her side will not take their foot of the gas for Wednesday night's clash with FC Twente as winning is \"part of their DNA\".\nThe London club find themselves in a strong position as the season approaches the midway point. They are currently top of the Women’s Super League (WSL) and top of their UEFA Women's Champions League (UWCL) group.\nAs 2024 is set to draw to a close in the coming weeks, Chelsea have a handful of games left in the calendar against FC Twente, Leicester City and Real Madrid.\nAlthough Bompastor's side have already qualified for the knockout rounds of the Champions League, the manager insists they will go into their games against Twente and Madrid with the same attitude they always do. To win.\n\"We just want to keep going and keep winning,\" Bompastor told the media in her pre-match press conference this week. \"It's part of our mentality. It's part of the DNA of the club.\n\"We never take anything for granted. Every game is really important. We want to keep our good dynamic, our good results and the main goal in this group is for us to stay in first place at the top of the table. We still have two games left and we want to win both.\"\nRotation will be the key to keeping everybody fresh ahead of this stretch of games. Chelsea have also been boosted by the recent return of defender Niamh Charles after a long injury absence.\nBompastor hinted at possible changes ahead of the winter break as she emphasised the need to utilise the entire squad available to her. \"We play so many games and when you play for a club like Chelsea, you know as a player, you will be involved in the games at one point,\" the manager added.\n\"Everyone is important. You cannot expect to win titles with 11 players. It's an opportunity for me to rotate the squad sometimes and just to show my trust to my players and the squad.\n\"The [Twente] game is really important. Our main goal is to finish at the top of the table - we haven't achieved that yet - so we are really focused and we want to win the game tomorrow. It's that simple.\"",
  "word_count": 426,
  "scraped_at": "2026-02-14T12:48:59.649815"
}