{
  "article_id": "5f7a61b2dc53",
  "url": "https://www.gdnonline.com:443/Details/1319996/US-women-hold-off-Brazil-to-claim-gold",
  "title": "Olympics : US women hold off Brazil to claim gold",
  "date": "20240811T011500Z",
  "domain": "gdnonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FOOTBALL – The United States claimed a record-extending fifth Olympic gold medal in women’s football after Mallory Swanson earned them a 1-0 win over Brazil in the final at Parc des Princes yesterday.\nFollowing a goalless first half, Swanson broke the deadlock 12 minutes after the break to earn the US their first Olympic title since London 2012 after a perfect run in the tournament.\nUS coach Emma Hayes enjoyed almost instant success as she secured the title only two months after taking the job.\n“I’m very emotional, it’s a dream of mine to be in this position,” a tearful Hayes told Eurosport. “I have to thank my dad for pushing me to this point, to be able to come and coach an incredible group of players that have received me so well.\n“(They have) taken on everything I asked, they are tremendous people, players and role models. I love them.”\nBrazil were dangerous in the opening stages and came close to scoring when Gabi Portilho drew a great save from Alyssa Naeher shortly before halftime. Naeher did well again in injury time to claw away Adriana’s header from point-blank range.\n“It’s Brazil, we know they’re such a tough opponent, we knew it wasn’t going to be easy, they weren’t going to give us anything,” US defender Crystal Dunn told reporters.\n“We trusted everyone was going to do their job and I’m really proud of the backline and of course Alyssa back there is such an incredible asset to the team.\n“It just came down to trusting everyone was going to do their job.”\nBrazil great Marta returned after a two-match ban handed down for a red card, coming on as a substitute after the hour mark, but did not have much impact as Brazil were beaten by the Americans in an Olympic final for the third time.\nGermany beat Spain 1-0 to win the bronze medal on Friday.\nSwanson, making her 100th international appearance, found the net with low finish after a solo run and a great pass from Korbin Albert to cut through the Brazilian backline.\nIt was her fourth goal of the tournament.\nBrazil could not capitalise on the three big chances they created to send the match to extra time, but received a huge ovation from their fans after the final whistle.\n“We knew it was going to be a difficult game, we did our best, we pressed and I think we were better in the first half,” Brazil midfielder Adriana said.\n“We didn’t manage to score in our chances and they scored on their best chance, but I’m confident we are going to develop into a better team.”\nIt was an intense and evenly fought duel cheered by a huge crowd at Paris St Germain’s stadium, with the likes of American former Ballon d’Or winner Megan Rapinoe, ex-Arsenal manager Arsene Wenger and Tom Cruise also in attendance.\n“The crowd was tremendous, Brazil was tremendous, I’m speechless,” former Chelsea manager Hayes added.",
  "word_count": 496,
  "scraped_at": "2026-02-14T12:57:46.226443"
}