{
  "article_id": "5f80eb5259f1",
  "url": "https://www.teamtalk.com/liverpool/liverpool-get-final-alexander-arnold-revenge-on-real-madrid-as-ornstein-confirms-contract-length-arrival-date",
  "title": "Trent Alexander - Arnold : Liverpool get final revenge on Real Madrid as Ornstein confirms contract length , arrival date",
  "date": "20250505T143000Z",
  "domain": "teamtalk.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Liverpool\nPremier League • England\nLiverpool get final Alexander-Arnold revenge on Real Madrid as Ornstein confirms contract length, arrival date\nTrent Alexander-Arnold’s free-transfer move to Real Madrid from Liverpool has been confirmed – with all the details around the arrangement he will sign at the Bernabeu now coming to light – but with the Reds seemingly having managed one final act of revenge towards the Spaniards over what will ultimately prove an extremely hard-to-swallow departure.\nThe worst-kept secret in football is now 100% official after Alexander-Arnold confirmed on Monday morning that he has taken the difficult decision to leave his boyhood club this summer after 20 years on their books. And while he stopped short of confirming a move to Real Madrid would be next, all associated with Liverpool and the watching world know exactly where he is heading.\nThe move to the Bernabeu will end one of the longest-running transfer sagas in recent memory. The Spanish giants’ interest in signing the Reds’ vice-captain dates back a good three years, with their plans to land him at the end of his deal in summer 2025 long since known to be their grand plan.\nReal, of course, did try and do a deal earlier, seeing two offers for the 26-year-old rejected by Liverpool in the January window as Carlo Ancelotti’s side looked to compensate for the season-ending injury sustained by veteran defender Dani Carvajal – the man Alexander-Arnold is now expected to replace.\nThe Spanish giants have also made it clear they wanted to bring the player in before his deal at Anfield officially expires on July 1, having asked Liverpool what it would take to bring him to Bernabeu a month prior so he could feature in FIFA’s latest initiative, the upcoming much-expanded and hugely-lucrative, Club World Cup.\nHowever, according to journalist David Ornstein, Liverpool will not let that happen and the move to take the 33-times capped England star will not go through until July, as initially slated.\nWriting on The Athletic, Ornstein stated: ‘Alexander-Arnold is expected to join Real Madrid as a free agent, with sources in Spain – speaking anonymously to protect relationships – suggesting a proposed six-year agreement, which would start in July, is in the process of being completed.\n‘A deal for the right-back, 26, to join the Spanish side has now entered its final stages and is on course to be signed in the coming weeks.’\nThat six-year deal, through to the summer of 2031, is expected to net the player a hefty £240,000 a week package, while Real are also reported to have given the player a significant seven-figure bonus payment as a signing-on fee.\nGO DEEPER\n⚪ Trent Alexander-Arnold done deal: The best free-agent signings Real Madrid have ever made\n⚪ Alexander-Arnold done deal: The last 10 players Real Madrid convinced to leave their local team\nTrent Alexander-Arnold: Star wanted to be honest with Liverpool fans\nConfirmation of Alexander-Arnold’s exit now, rather than after the season has concluded, means the player will get the chance to bid farewell to the fans that have idolised him for several years in their final home game of the season, against Crystal Palace at Anfield, on May 25.\nAnd according to The Times’ Paul Joyce, Alexander Arnold ‘wanted to clarify his plans now’, rather than ‘waiting until after the title parade on May 26’, as he ‘does not want to be viewed as a coward who sneaked out the back door’.\nConfirming his departure in a message on his X page, Alexander-Arnold posted: “After 20 years at Liverpool Football Club, now is the time for me to confirm that I will be leaving at the end of the season.\n“This is easily the hardest decision I’ve ever made in my life.\n“I know many of you have wondered why or been frustrated that I haven’t spoken about this…\nAfter 20 years at Liverpool Football Club, now is the time for me to confirm that I will be leaving at the end of the season.\nThis is easily the hardest decision I’ve ever made in my life.\nI know many of you have wondered why or been frustrated that I haven’t spoken about this… pic.twitter.com/emAw5RvXq0\n— Trent Alexander-Arnold (@TrentAA) May 5, 2025\n“I think first and foremost, I want to say it’s not an easy decision and there’s a lot of thought and feeling that has gone into it. I’ve been here 20 years now, loved every single minute of it, achieved all my dreams, achieved everything I’ve ever wanted to here,” he told Liverpool’s official website.\n“Giving everything day in, day out for 20 years, I’ve got to a point now where I feel like I need a new change, a new challenge for me as a player and as a person. And I think now is the right time for me to do that.”\n“There’s a lot I would like to say,” he said of Liverpool fans. “The main thing is a massive thank you. You guys have been there from the start with me, you guys have supported me, been there.\n“I’ve felt the support, the love, everything that you guys have done has never been unnoticed by me, I’ve loved every single minute of it. I hope they have felt that has been reciprocated and that I’ve given everything I could to the club.\n“I’m just hoping that we’re able to carry on winning games, the noise [around my decision] doesn’t take away from the fact of what we’ve achieved this season.\n“It has been an amazing season. It has been amazing to be part of it, and I just hope that everyone is able to maybe not dwell on this news for too long and be able to celebrate what the rest of the lads have done.”\nWhile Alexander-Arnold is yet to comment on the reasons for joining Real Madrid, some detail into why the move was greenlit offered by Spanish football expert Guillem Balague back in March.\nThe player himself has also not hidden from his desire to win the game’s biggest prizes, saying earlier this season: “The most important thing is trophies if I’m honest.\n“I want to win trophies. I’m a player who is highly motivated by winning things and being elite. That’s probably the main factor of anything. If you have a personality that’s elite, who wants to win and will do anything to win then that’s what drives them.”\nHaving come through the club’s academy, Alexander-Arnold has made 352 Liverpool appearances, scoring 23 goals and providing 92 assists.\nHowever, unlike Steve McManaman and Michael Owen before him, the right-back can’t claim that he’s heading to the Spanish capital to satisfy a thirst for silverware given Liverpool’s form and recent Premier League title success since Arne Slot took over as manager.\nAnd, as Ornstein points out, ‘losing Alexander-Arnold isn’t a good look for Liverpool’s owners, FSG, given that a £100m asset will be walking away for nothing’.\nOrnstein concludes: ‘At the age of 26, his best years remain ahead of him and the fact that they won’t be spent on the red side of Merseyside is a bitter pill to swallow’.\nSeven reasons Alexander-Arnold has decided to leave for Real Madrid\nConstant expectation of major trophies\nWhile Alexander-Arnold has amassed a respectable medal collection with Liverpool, winning just about everything there is to win, the sheer frequency of honours he could expect to pick up at Real Madrid may outweigh it. Madrid are the Champions League’s most successful club, winning two of the past three finals and five of the past nine, and could enable Alexander-Arnold to add some more glittering honours to his cabinet. Winning trophies with Liverpool will always be special for Alexander-Arnold, but he could become even more decorated at Real Madrid – and in an age where people seem fixated on honours when judging a player, that could hold some weight.\nBallon d’Or ambitions\nAlexander-Arnold recently hinted he would like to aim for the Ballon d’Or while in the prime of his career. And although Manchester City’s Rodri won the Ballon d’Or in 2024, it has more frequently been claimed by LaLiga players than Premier League players in recent memory. Only once has a Liverpool player won the Ballon d’Or; there have, in contrast, been 12 times when a Real Madrid player has, which is the joint-most of any club. Alexander-Arnold could boost his chances of winning football’s biggest individual accolade by standing out in a star-studded Real Madrid team with his own unique role.\nExperiencing a different culture\nOn one hand, Alexander-Arnold is in his comfort zone, playing for his boyhood club for the only team he has ever known. That may suit him, but he may also be eager to challenge himself in a different league and culture. Spanish football is experiencing a resurgence – the men’s national team are the current European champions, the women’s team are the current world champions, and La Liga representatives Real Madrid are the reigning European champions at club level – and it would be fascinating to see how he would adapt to that style of play. The lifestyle would also be a change for Alexander-Arnold and, deep down, who wouldn’t prefer the Spanish climates?\nBellingham linkup\nIf he was to move to Real Madrid, Alexander-Arnold would be able to link up with another English superstar in the shape of Jude Bellingham. The pair get on well thanks to being international teammates and that may help Alexander-Arnold settle in the Spanish capital. Bellingham certainly hit the ground running after joining Real Madrid from Borussia Dortmund and Alexander-Arnold could back himself to do the same. English players abroad can often become popular and Real Madrid could assemble a squad that contains two of the very best.\nHaving no regrets\nWho knows, but this opportunity might never come around again. Real Madrid have shown determination to wait for the right target in cases such as Kylian Mbappe, but their need to reinforce at right-back is becoming more urgent and if it isn’t with Alexander-Arnold, it could be with one of a number of alternatives. The ship might sail. In that case, Alexander-Arnold’s decision might be made for him, but would he look back with any regrets? By moving to Madrid, he could say that he had tested himself on the most illustrious of stages. He will have had a splendid career still if not, but he will have to consider if he will be wondering ‘what if?’ by the time he reaches the end of his career – hopefully a long way away just yet.\nEngland role\nWhile Alexander-Arnold’s role with Liverpool has been dominant in terms of the regularity of his gametime, the same cannot be said for his England career. Granted, he has more competition at international level, but he was often overlooked by Gareth Southgate. Now, he will be wondering what Thomas Tuchel thinks of him. Naturally, his form at club level will impact the new England head coach’s decisions. But will it benefit Alexander-Arnold to remain in sight in English football, or could it actually benefit him to prove himself abroad? There are arguments either way, but the recent change of Three Lions manager means this could be a clean slate for Alexander-Arnold in an England shirt and he has an impression to make.\nMoney\nAlexander-Arnold has seen his wages increase over time at Liverpool, becoming one of their best-paid players. In his next deal, he may want to be elevated to the position of being their outright top earner. It remains to be seen whether or not Liverpool would appease that ambition. Over in Madrid, meanwhile, he would not be the top earner – due to the fortunes Mbappe is receiving – but could nevertheless take home a bigger salary than what he currently earns from Liverpool. There are more important footballing factors to consider, but as always for players of this calibre, money could play its part. This is already becoming one of the big off-field sagas of the season; Alexander-Arnold has a lot to weigh up.",
  "word_count": 2015,
  "scraped_at": "2026-02-14T13:20:59.719292"
}