{
  "article_id": "5f9e9fc9f5d3",
  "url": "https://theathletic.com/4254814/2023/02/27/mls-apple-tv-thiago-almada/",
  "title": "Reviewing Season Pas debut on Apple TV ; Thiago Almada stunners : MLS Weekly",
  "date": "20230227T234500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome to our new column collecting news, insights, and highlights from the world of Major League Soccer. This will be a team effort from all of our staff writers covering the league, but we’ll start this first edition with one of our newest additions: Elias Burke, who will be reporting on American soccer from Los Angeles after covering West Brom and Derby County for our UK operation.\nAdvertisement\nThe opening weekend of the 2023 MLS season was… interesting. From the comfort of my sofa, after having El Trafico postponed due to heavy rain, I ingested MLS on American soil for the first time as the league and Apple TV kicked off the season with an 11-game slate running from 1:30 to 9 p.m. Pacific. It was a long day.\nThe action on the field was largely solid. Thiago Almada stole the show with two stunning goals late to ensure Atlanta United fans left Mercedes-Benz Stadium delighted. Watching Wayne Rooney’s D.C. United turn over the fancied Toronto FC was pleasing also — not so much because of any allegiance to the Black and Reds, but because Theodore Ku-DiPietro, the scorer of the winning goal in the 3-2 victory, has the coolest name in football.\nWhile I sympathize with the effort of putting together 11 games in one day for the first time, the Apple TV experience was not without its hitches. But overall, it was an exciting insight into a league like no other. I can’t wait to do it again. – Elias Burke\nSeason Pass is here\nThe good\n• If there was any room for immediate improvement under the new deal, it was on enhancing the quality of the match feed. With cameras and angles largely determined by each team’s local broadcast partner, jumping from one MLS match to another on ESPN could cause major whiplash with the broad array of picture qualities and sight lines.\nWell, one thing is undeniable after Season Pass’ debut: the picture quality is much, much better across the board. Last week, an article on the league website promised “more camera angles, 1080p video, Dolby 5.1 audio, and enhanced data and graphics in live match coverage.” The jump to 1080p was evident and a sight for sore eyes, making it easier to discern players from one another, to track the ball on the far end of the pitch and enhance the overall experience.\nAdvertisement\nThere were some issues, of course. At one point during Inter Miami’s opener against CF Montreal, there was a one-to-two-second delay between the match feed and the audio. Other matches experienced brief blips of darkness as a feed was momentarily cut, or strange errors with sound mixing or mismatched audio and video.\nStill, the overall quality of the opening weekend’s feeds was far closer to that seen in Premier League broadcasts than MLS’s past baseline. That alone counts as a victory for Week 1. – Jeff Rueter\n• Among MLS’s promises for Season Pass was that the broadcasts would do more to showcase things that make MLS special. To that end, I enjoyed a lot of little touches the broadcasts found time for throughout the weekend, especially when it came to fan entrances and pregame ceremonies, in particular Charlotte’s remembrance of club captain Anton Walkes, who died tragically this past offseason.\nThere’s certainly room to grow in this regard, but for a first effort prepared on a condensed timeline, it was nice to see. – Alexander Abnos\nAlmost time! #MLS Season Pass won't be a flawless tonight – there may be some hiccups* – but it will 1080p steams with the best talent in the business.\nLook for it to get better every week.\n*None of you online are harsher critics than our internal expectations. pic.twitter.com/0oTDr0fWfo\n— Mark McClure (@mrkmcclr) February 25, 2023\nMajor League Sales pitch\nIf there was one major complaint from the first weekend of MLS Season Pass, it’s that it felt at times a bit too much like an MLS infomercial. The opening game of the weekend, NYCFC’s visit to Nashville, was probably the best example in part because it was simulcast by Apple and on Fox as part of the latter’s English-language linear TV deal.\nOn Apple, the commentators pushed Nashville’s new Johnny Cash-themed jerseys constantly on the audience, even going so far as to say where they were for sale online. There was also discussion about the new MLS playoff format which included the assertion that it makes the regular season more important. That is undoubtedly up for debate, especially considering the fact that 63% of the league now makes the playoffs. While seeding matters in the playoff for home-field advantage, that was true under the last format, too.\nIt sounded like the goal was to get a national broadcast feel, but going to league talking points just makes this an MLS “homer” broadcast much in the same way local broadcasts felt for specific teams. It is understandable that MLS was celebrating the launch of this new broadcast “network,” but if the homer feel continues into the regular season it’s going to be tougher to stomach. – Paul Tenorio\nAdvertisement\nWait til they hear about Hot G. Right\nWhile it’s impossible to ensure a 100% level of accuracy with match subtitles, there were some glaring issues that will hopefully resolve as the season goes on. At one point during FC Dallas’ match against Minnesota United, commentators were allegedly discussing United States international striker J. Zeus For Era. Apple users can attest to autocorrect’s ability to quickly learn a phone handler’s specific lingo; hopefully, something similar will happen here. – Jeff Rueter\nFox’s barebones operation\n• The league should be furious at Fox’s lack of investment in its English linear deal. The network isn’t sending talent to games, instead flying them to broadcast out of the Vista facilities in Ft. Lauderdale, Florida. The halftime DoorDash-sponsored “set” behind Stu Holden and John Strong was evidence of the level of resources dedicated to this deal.\nNot the most luxurious studio for Fox's MLS coverage. pic.twitter.com/jUhefIHoVN\n— Nathan Tucker (@SportWatcherPRO) February 25, 2023\nThis isn’t anything new from Fox. They’ve done multiple MLS games remotely in the past few years. A Washington Post report last year indicated Fox was prepared to “use mostly remote production and send a minimal contingent of staffers” to the 2022 World Cup before Qatar Airways sponsored the broadcast.\nStill, considering that MLS decided to seek a linear partner for this season, it has to be disappointed with such a low level of investment. For a large portion of fans, the games on the Fox networks, especially those on over-the-air Fox like Saturday’s opener, will be their only exposure to MLS. A minor-league-looking set doesn’t communicate what the league and Apple are trying to project. – Paul Tenorio\n• Say what you want about Fox’s janky halftime set, at least they weren’t trying to sell me a jersey every five minutes and reminding me how awesome and cool and revolutionary MLS is every 10 minutes. Strong and Holden’s commentary probably wasn’t as good as it would have been if they were there in-person, but it certainly wasn’t bad, and I appreciated being able to watch a game without quite so much forced salesmanship. If Fox can figure out a way to make its on-camera setup even slightly less embarrassing, then I don’t think the linear deal is all that bad. But there has to be a happy medium somewhere between their abdication and MLS’s indoctrination. I wonder who will find it first. – Alexander Abnos\nA weird whiparound\nThere is real potential for the whiparound show, MLS 360, but some kinks clearly need to be worked out. Early in the day, studio shots had the four co-hosts standing with their back to the camera, looking up at a giant screen. It was awkward and uncomfortable for the viewers — and probably for the talent, too. They finally introduced chairs to the set and that made things much better.\nAppleTV’s redzone-like MLS 360 show is going full Mystery Science Theater 3000. pic.twitter.com/526A0kMPg6\n— Cork Gaines, Ph.D. (@CorkGaines) February 26, 2023\nIt’s also hard to fathom the sheer amount of commercials that appeared on the whiparound show. One thing that stands out about the format’s gold standard – NFL RedZone – is the lack of commercials, especially considering ad breaks make up a huge part of the normal football-on-TV experience. Here, MLS is asking you to turn off a sport that is commercial-free in order to watch a show that is filled with commercial breaks. And late in the night as there were fewer games being played, the commercial breaks ended up coinciding with goals several times. Not ideal.\nOne other weak point that will improve with repetition: learning when to lay out and just let the game and the broadcast tell the story. Thiago Almada’s dramatic game-winning stoppage-time free kick goal for Atlanta United is a great example. The crew started speaking immediately as the goal was scored, robbing the MLS 360 audience of the reaction from a crowd of 67,538 at Mercedes-Benz Stadium. One of the selling points of this league is the atmosphere in the stadium. Atlanta is one of the absolute shining examples for this league of the growth and popularity in local markets. Save the analysis for the replays. Let the environment tell the story that MLS needs to sell. – Paul Tenorio\nAdvertisement\nA jarring transition\nNo doubt, MLS and Apple are trying to create a distinct look for these broadcasts. However, the pivot from live action to a replay was jarring after just ten or fifteen minutes. The screen went all-black save for an MLS logo in the middle — nothing too bizarre for an American sports broadcast. But the accompanying sound is an off-putting tone akin to pushing the wrong key on an old PC. If that continues to be the signifier for an instant replay, this viewer might prefer to save the highlights for after the final whistle. – Jeff Rueter\nEn Español\nOn the Spanish-language side, in-game analysis throughout the night was informed and astute. In Nashville-NYCFC Jorge Perez Navarro’s boisterous play-by-play contrasted nicely with Marcelo Balboa’s measured analytical tone and occasional bits of Spanglish.\nThe in-studio product later on Saturday night featured a mix of experienced voices and up-and-coming talent. Veteran host Tony Cherchi was paired with analysts Melissa Ortiz and former Portland Timbers superstar Diego Valeri. The nerves were evident at times, but Cherchi did well to keep the conversations flowing.\nValeri, who retired last summer while playing with his boyhood Club Lanús, was especially impressive. He was composed and personable on camera and he displayed a deep knowledge of MLS teams and current players. Ortiz, who also does English-language sideline reporting for U.S. men’s and women’s national team games on HBO Max, did well in her second language. That’s not an easy task.\nHowever, there was a notable lack of Latinos on the English-language side of the broadcasts. That’s a surprise considering the sport that’s being showcased and the coveted young bicultural Latino demographic that MLS wants to appeal to. There’s plenty of bilingual talent on staff so it could be simply a matter of mixing some of the studio pairings in the future.\nThe visual presentation and storytelling of the Spanish telecast mirrored the English feed. The look and feel, as well as the big picture storylines, were virtually identical. That was expected, but to start on Saturday, during the 4:30 pm ET slot, the studio and in-game graphics were in English on the Spanish feed. That later changed for the primetime matches.\nVideos, like an excerpt of Don Garber’s interview with Maurice Edu, were presented without subtitles. That could be an intentional strategy to appeal to bicultural English-dominant Latinos or a sign that Apple and MLS don’t have the resources to provide that level of transcreation. – Felipe Cardenas\nOn the field\nSpirit of the Rams\nAs currently constructed, D.C. United bears some resemblance to manager Wayne Rooney’s Derby County side of 2021-22. That was one of the most remarkable teams in the English Championship that season, despite suffering relegation.\nAdvertisement\nAfter being handed a 21-point deduction by the English Football League for entering administration and breaching the league’s profitability and sustainability rules – akin to UEFA’s Financial Fair Play rules – Rooney’s Derby side of academy graduates and free agents collected a series of upsets that drew plaudits across the country. These underdog wins earned him a reputation as a coach who can motivate young and inexperienced teams to beat highly-fancied opposition.\nD.C. United showed the spirit of that Derby team against a Federico Bernardeschi-led Toronto side, after Italy international Lorenzo Insigne departed in the 31st minute with an apparent leg injury. Outside of a clumsy challenge to gift Toronto a penalty, 16-year-old Matai Akinmboni repaid Rooney’s faith by delivering a performance that belied his years in central defense, and 21-year-old Theodore Ku-DiPietro came off the bench to score the winner in the eighth minute of injury time to round off a spectacular comeback.\nWhile Saturday’s win was a positive start to the season, D.C.’s pass map from the game’s first 68 minutes highlights the work still to be done to make D.C. a coherent outfit from back to front.\nOf their 14 league wins that season, a significant portion came by way of late winners at home, where the defiant Pride Park support willed their team to victory. If D.C. United is going to improve significantly from last season, they must take the fighting attitude they displayed against Toronto, stabilize the defense and find ways to progress the ball more consistently. – Elias Burke\nJim Curtin reads The Athletic\nOr, at the very least, he saw the money quote from our annual MLS executives survey, in which one executive said that Curtin’s Philadelphia Union team, who are widely predicted to do very well this season and have been among the league’s best in recent years, are “not even that f—ing good.”\nThe Union played like they had a point to prove to whoever said that (and perhaps some other people) in a dominant 4-1 win over the Columbus Crew. And then, this:\n“First of all, anonymous quotes are for cowards” – Jim Curtin responds to the below comment, adding he did use it in yesterday’s film session with the team #DOOP https://t.co/QntF2TSkm1\n— Meg Swanick (@Meg_Swanick) February 26, 2023\nAlmada show\nThiago Almada can really strike a ball. The 21-year-old from the Fuerte Apache neighborhood of Buenos Aires saved Atlanta United in week one with two highlight-reel goals from outside the penalty area. Both strikes came in stoppage time, erasing San Jose’s one-goal lead that had held firm for over 80 minutes.\nAdvertisement\nA disciplined San Jose side had done well to frustrate Atlanta United’s attacking intent for the majority of the match. But big-money players are supposed to be big-time difference makers, and Atlanta United has a special player in Almada, whom the club paid a reported $16 million to acquire one year and one World Cup win ago.\nThiago Almada is HIM! 👀\nThe 21-year-old scored a 93rd-minute banger and a 99th-minute free kick to will @ATLUTD to victory. pic.twitter.com/2I3B2mzeu7\n— Major League Soccer (@MLS) February 26, 2023\n“Thiago with the first goal from outside the box, and then that amazing golazo to win the game… It was special for us and I hope the fans are happy with it,” said Atlanta United manager Gonzalo Pineda after the match.\nAlmada’s talent has never been in question. He adapted to MLS right away in 2022 through consistent performances and game-changing goals. His late inclusion to Argentina’s World Cup roster, and the subsequent 30 days he spent training with the world champion Albiceleste in Qatar, has given him more confidence and sharpened his game before the 2023 MLS season.\nAtlanta United always needs a showman. The soft-spoken Almada promises to entertain for as long as he’s in black and red. – Felipe Cardenas\nDriussi’s jaw-dropper\nAustin FC will want to forget Saturday night’s humbling home loss to newcomers St. Louis City…with the exception of Sebastian Driussi’s ridiculous lob over St. Louis goalkeeper Roman Bürki. The goal tied the game in first-half stoppage time and reminded audiences around the world of how good a player Driussi truly is.\nWorld class from El CRACK! 💥 pic.twitter.com/BhbQ8DvEzd\n— Austin FC (@AustinFC) February 26, 2023\nIt all happened pretty fast, but there’s a lot of planning that occurs inside a player’s head before he tries to chip a goalkeeper. Driussi either noticed Bürki was off his line as he made his deep-lying run or he caught a glimpse of the ‘keeper’s bright yellow kit before he deftly controlled Leo Väisänen’s long ball. The end result was a masterclass in composure and opportunism from Driussi, with his weak foot. – Felipe Cardenas\nHow does this happen?\nAustin FC defender Kipp Keller’s giveaway to St. Louis’ Jared Stroud seemed inexplicable at the time. Subsequent video review has revealed one possible explanation: That Stroud, who was Keller’s teammate in Austin last year, called for the ball as if he was still wearing green and black.\nAdvertisement\nThat would help explain Keller’s brain fart. But is that what happened? We might never know for certain, in part because this is the only video we have of the incident that’s legally shareable outside the Apple ecosystem:\nStroud back in Austin 😏 pic.twitter.com/uRlAQNE7ch\n— St Louis CITY SC (@stlCITYsc) February 26, 2023\nFor his part, Stroud told the St. Louis Post-Dispatch “maybe he recognized me,” in reference to Keller, who he called a “good friend of mine.”\nPersonally, I find it hard to believe anyone would be quite so devious to someone they call a friend. – Alexander Abnos\nOther notes\n• A genuine congratulations and “nice job” to Minnesota United for getting an away win without talismanic playmaker Emanuel Reynoso to open the season. That’s an objectively great result. Still, feels like Game 1 of 34 might be slightly early for a “tough day for the experts” tweet. I’m sure the experts would all be totally ok with having their tough day at a later date, when the season is a bit more complete. – Alexander Abnos\n• Serhiy Kryvtsov played 12 years for Shakhtar Donetsk in his native Ukraine before moving to Inter Miami this past offseason. Due to the ongoing conflict in the region, the defender hasn’t played in front of a packed, lively crowd in a while. His goal wasn’t exactly attractive, but it clearly meant a lot, both for him and an Inter Miami team that went on to win 2-0 at home over Montreal.\nKryvtsov on MLS: \"It was beautiful, I forgot how it's like to play with fans (due to the situation in Ukraine.\")\nSays he thankful to the fans.\nMentions in Europe it's more technical, MLS there's more running and physical:\n\"It's just attack attack.\" #InterMiamiCF\n— Alex Windley (@aaw_1998) February 26, 2023\nWhat we’re hearing\nChicago Fire sign U-22 striker\n(This item also appears in David Ornstein’s weekly column)\nThe Chicago Fire have finalized a transfer for PAOK forward Georgios Koutsias, a source with knowledge of the deal confirmed to The Athletic.\nAdvertisement\nKoutsias, 19, is currently on loan to Volos NPS. The Fire will pay a transfer fee of $2.5 million for the young striker, who has two goals and one assist this season. Koutsias is seen as a replacement for Jhon Durán, who was sold to Aston Villa for $18 million in the January window. Like Durán, Koutsias will take up an Under-22 Initiative slot for the Fire. The Under-22 Initiative incentivizes MLS teams to buy players under the age of 22 to develop with an eye toward selling them.\nThe deal is expected to be announced in the coming days.\nThe Fire are also continuing to pursue a designated player at the No. 9 position. An earlier chase for Nottingham’s South Korean forward Hwang Ui-jo fizzled out, but the Fire remain in the market for a top-level forward.\nChicago also recently traded for former Sierra Leone and Middlesbrough striker Kei Kamara. The Fire will be the 10th MLS team for Kamara, 38, who has scored 139 goals in 16 seasons in the league. Polish striker Kacper Przybyłko is also on the roster, but failed to impress last season with just five goals after moving from Philadelphia. – Paul Tenorio\nPreseason St. Louis concerns from a pair of MLS insiders\nSt. Louis City looked streetwise and opportunistic in its surprise win against Austin, making the Texans pay for shambolic defending. Before the season, though, multiple coaches and sporting executives expressed concern about the club’s roster, a decent chunk of which is made up by former MLS Next Pro players.\n“I think they’re underestimating the league a little bit,” said one source, a sporting executive at an MLS club. “I know Transfermarkt isn’t everything, but if you go through the values of the players on the team, Atlanta is at the top of the heap with ($56 million) and St Louis spends a third of that. A lot of those guys are MLS2 guys from last year — they had success there, but sometimes that’s a curse. I know they want to be loyal to those guys, they took them to a championship. They have some decent role players but they took almost 10 guys and brought them to the first team. It’s going to be a long year.”\n“It will be a miracle if they finish anywhere other than last place,” added another source. “The league has grown a ton in recent years and you’d think they’d have learned from clubs like Cincinnati. You can’t roll out a USL lineup and succeed in this league, even if you play physical, direct football.”\nAdvertisement\nFor what it’s worth, St. Louis’ best player on Saturday might have played in MLS Next Pro, but he’s also 26 years old with a few seasons in the German Bundesliga on his résumé.\nEduard Löwen ran the show for STL, assisting on Tim Parker’s opener and setting the table for Nico Gioacchini, who fed Klauss for the winner.\n.@stlCITYsc GAME WINNER! 🔥\nJoão Klauss with a beautiful turn and finish in the 86th minute to make history for #AllForCITY pic.twitter.com/15QqFqtzAg\n— Major League Soccer (@MLS) February 26, 2023\nHead coach Bradley Carnell has to be happy with that. – Pablo Maurer\nHudson was set to join Houston\nCurrent U.S. men’s national team interim coach Anthony Hudson was very close to joining Ben Olsen’s staff at the Houston Dynamo, multiple sources told The Athletic over the past few weeks. Hudson interviewed for a place on Olsen’s staff and seemed set to join the club before he realized he’d be needed to shepherd the USMNT in Gregg Berhalter’s absence. As of now, Olsen is complemented by ex-MLS player Aurélien Collin, former Crew and Dynamo assistant Tim Hanley and former Dynamo U-17 head coach Adin Osmanbasic. – Pablo Maurer\nA coach at Coachella\nIn October, Chris Wilder’s stint as manager of Middlesbrough came to an abrupt end. Despite the club’s aspirations to push for automatic promotion, the manager was sacked after 11 games with the club having won just two of those. Since then, the man who led Sheffield United to the brink of Europa League in 2019-2020 has been out of a job. Perhaps his next role will take him far from a Premier League push altogether.\nIn February, Wilder spent weeks around the Coachella Valley Invitational, per sources speaking anonymously to The Athletic to avoid linking him to any single club. Wilder, who has friends on participating teams’ coaching staffs, was enjoying the matches and sunny weather in a break from the English winter. The sources did not link him to having tangible interest in an MLS role in the short-term, but did relay that he enjoyed the league’s level of play even in tune-up scrimmages.\nOne can’t rule out that seeds have been sewn, however. In December 2019, I was at the USL Summer Meetings and noticed that Anthony Hudson was catching up with folks in the lobby between sessions. The following month, he was announced as head coach of the United States U-20 program — and, three years later, is the senior team’s interim boss. In short, this game has a funny way about it at times. – Jeff Rueter\nA word with Federico Bernardeschi\nIn mid-February, The Athletic caught up with Toronto FC’s Federico Bernardeschi during Toronto FC’s preseason preparations in California. There’s more to come this week from him, Lorenzo Insigne, Bob Bradley and new goalkeeper Sean Johnson on Toronto FC’s aims to swiftly return to the East’s elite.\nFor now, here are the Euro champion’s thoughts on what’s been a tumultuous series of events for ex-team Juventus and Serie A as a whole. – Jeff Rueter\nAdvertisement\nAre you surprised by what has come out regarding Juventus, with the points deduction and (Chairman) Andrea Agnelli and the board resigning?\nNo surprise, no. I (feel bad for) my ex-teammates, because for me, this situation is bad for them, and for the fans. But I think that Juventus is a big, big team in Italy, in Europe. Juventus has a great, great history behind it. For me, the next two, three years, (they) will go on to win. They’re gonna win. They’re gonna win.\nIn his press conference, Agnelli said that England is overtaking the sport and that Italy isn’t able to compete. Did you feel that Serie A was not as competitive as it was by the time you left?\nNo, it’s just people talking. Serie A is a great, great league. Inside the league of Serie A, there are many, many champions and great teams with great history. Now, for sure, the Premier League is the (best) league in the world. For sure. In the years of the 80’s, 90’s, 2000s’, it was Serie A (at the top). For me now, it’s a little process of change for the league of Serie A, but I think it’s great.\nBeyond the field\nFC Dallas fan Erik Tillisch was in the stands when his team advanced on penalty kicks against Minnesota United in the 2022 MLS Cup playoffs. He made sure of it, moving his first chemotherapy appointment to treat recently-discovered breast cancer to ensure he was at the soldout Toyota Stadium in Frisco.\nDuring the match, Tillisch – an FC Dallas season ticket holder since 2008 with his wife, Leslie – held a white sign that said, “Hi Paul, I start chemo Wednesday. Can I have your cancer shirt?”\nIt was a reference to the “F**K Cancer” undershirt Dallas midfielder Paul Arriola wore last season to honor his mother-in-law who continues to undergo treatment for stage 4 lung cancer.\nArriola saw the sign, and enthusiastically obliged.\nTillisch brought Arriola’s shirt with him to chemotherapy. He had it with him when he rang the bell, signaling his final day of treatment in December. And, officially in remission, Tillisch returned the shirt to Arriola Tuesday before the start of the MLS Season.\nIn October, STM @etillisch68 was set to begin chemotherapy for stage-2 breast cancer. To show his support, @PaulArriola gave him his \"F Cancer\" shirt. Arriola had been wearing the shirt all season.\nFour months later, Erik returned the shirt, cancer free. pic.twitter.com/AVny2LIYAm\n— FC Dallas (@FCDallas) February 22, 2023\n“I hope that, by giving the shirt back, the next person who receives it will find the same inspiration to fight that I did,” Tillisch told The Athletic. “It got me through the lowest times of my treatment. It reminded me that there were others out there who were here to support me during that fight.”\nAdvertisement\nTillisch added his own message to the back of the shirt before returning it, “Be sad for a moment, be inspired, and fight for a lifetime.”\n“I didn’t ever expect anything like this to come from me wearing the shirt,” Arriola told The Athletic. “What was the most special to me is just the inspiration that he has and the motivation that he has to also inspire others.”\nArriola, who got married in the offseason and watched his mother-in-law walk his wife, Akela, down the aisle, doesn’t have a specific plan for the shirt now, but he’s staying active in cancer organizations this season, specifically, Family Reach and Stand Up To Cancer.\n“Last year really opened our eyes,” Arriola said. “We were able to see firsthand the impact that we can make on other people’s lives.” – Emily Olsen\n(Top photo: Kevin C. Cox/Getty Images)",
  "word_count": 4780,
  "scraped_at": "2026-02-14T11:59:57.039979"
}