{
  "article_id": "5fa1e23f5188",
  "url": "https://movieweb.com/best-movies-about-fbi-agents-ranked/",
  "title": "The 15 Best Movies About FBI Agents , Ranked",
  "date": "20230625T160000Z",
  "domain": "movieweb.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "There’s something about a couple of FBI agents walking into a scene that immediately gives credence to a movie. Maybe it’s the inevitable suits, maybe it’s the badges, maybe it’s the way they like to oh-so-subtly reveal a weapon under a jacket rather than just whipping one out. Some of these movies are meticulously researched; some are fact-based, and some are a little more fanciful (we’re looking at you, Face/Off, but here are the 15 best films we’ve enjoyed about the Federal Bureau of Investigation.\n15 Point Break (1991)\nClearly, this is one of your less truly factual FBI films, and that’s because it’s mostly about Patrick Swayze and Keanu Reeves surfing and jumping out of airplanes. Keanu is Johnny Utah, a newbie agent and former college football player paired up with Agent Angelo Pappas, played by Gary Busey, which really raises some eyebrows about the Bureau’s hiring techniques. They’re after a gang of bank robbers called the Ex-Presidents, so named for their penchant for wearing rubber face masks that look like former heads of state.\nUtah ends up going undercover with the gang, which necessitates learning how to surf and to seduce the girlfriend, Tyler (Lori Petty), of the leader, Bodhi (Patrick Swayze). Utah uses what are likely not sanctioned FBI tactics to try and get his man, including jumping out of an airplane without a parachute, and letting the key suspect go surf himself to death, but it sure is enjoyable.\n14 Donnie Brasco (1997)\nNominated for an Academy Award for Best Adapted Screenplay, Donnie Brasco was based on a memoir by Joseph Pistone, who was played in the film by Johnny Depp, an FBI agent who went deep undercover with the New York Bonnano crime family in the 1970s under the moniker Donnie Brasco.\nPosing as a jewel thief, Pistone/Brasco ends up forging an uneasy friendship with hitman Lefty Ruggiero (Al Pacino). Pistone/Brasco’s allegiances are twisted and torn as he tries to satisfy the FBI, Lefty, and his family without endangering anyone, although Lefty ended up in jail and Pistone/Brasco’s family is still in witness protection.\n13 The FBI Story (1959)\nJames Stewart starred in this 1959 drama that had a leg up over its competitors in the category of FBI movies: J. Edgar Hoover was a consultant. Not only did he tell the director Mervyn Le Roy, who was a friend, to ax scenes in which he didn’t approve of the Bureau’s portrayal, but he also made a brief cameo and ensured that two agents were on set at all times. Stewart played Chip Hardesty, an agent who tells the story of his life with the FBI in flashback.\nHe goes from a Knoxville government clerk flirting with Vera Miles to an inspired agent investigating the Klan in the South, to a more experienced field agent trying to take down the likes of Dillinger and Machine Gun Kelly. The film ends after the death of Hardesty’s son in WWII and the conclusion of Hardesty’s career.\n12 Face/Off (1997)\nJohn Woo’s cult action film had the capacity to be unwatchably silly, but he pushed it that little bit further and it became fantastic. John Travolta played stalwart FBI agent Sean Archer, although much of the time he looks like Nicolas Cage, who is playing mad criminal Castor Troy, because the two have had their faces swapped, in what has to be a major violation of all sorts of medical ethics.\nTroy killed Archer’s son, and after Troy ends up in a coma whilst arranging a bomb plot with his twin brother who is of course named Pollux, Archer does what any good agent would do and has his face switched with that of his deadly enemy without his knowledge or consent. Of course, he can’t leave Troy without a face, so Troy now becomes Archer, which no one had the foresight to think might be confusing. It’s violent, and totally bananas, and there are probably FBI rules against all of it, but you can’t deny how much fun it is.\n11 The Siege (1998)\nDenzel Washington and Tony Shalhoub starred in this 1998 action thriller as special agents Hubbard and Haddad, desperately trying to stem a series of terrorist attacks taking place in New York City. Much like real life after 9/11, law enforcement came down with terrifying harshness against the Arab-American community, and Haddad’s son is one of many arrested.\nBruce Willis plays Army General William Devereaux, who takes over once the President instigates martial law, and it’s clear he is not the good guy. He nearly kills the FBI agents, who are definitely the good guys, but in the end martial law is revoked, Devereaux is arrested, and order is tidily reinstated.\n10 Wind River (2017)\nTaylor Sheridan’s 2017 neo-Western stars Jeremy Renner and Elizabeth Olsen as government agents (U.S. Fish and Wildlife and FBI, respectively) trying to solve the murder of an 18-year-old girl whose frozen body was discovered on a Wyoming Indian reservation. The agents butt heads with the medical examiner and security guards at a nearby oil-drilling site, and it’s revealed that Lambert (Renner) has a personal tragedy of his own: his teenage daughter died in the same way as the new victim.\nThe film was a critical success, not least for Sheridan putting the spotlight on the huge number of indigenous women who are assaulted and/or killed every year in the U.S. and Canada.\n9 American Hustle (2013)\nDavid O. Russell’s 2013 film is a highly fictionalized version of the FBI’s Abscam sting operation of the 1970s and 80s, which involved the takedown of a number of government officials for bribery and corruption, mostly in New York, New Jersey, and Pennsylvania. Christian Bale and Amy Adams play con artists Irving and Sydney who are caught by an FBI agent (Bradley Cooper), who promises to let the pair go free if they can help him take down the mayor of New Jersey (Jeremy Renner).\nThe characters played by Bale, Adams, and Renner were all loosely based on actual players in the Abscam sting, but loose cannon agents Richie DiMaso (Cooper) and Stoddard Thorsen (Louis C.K.) have no specific historical counterparts.\n8 J. Edgar (2011)\nA biopic of the FBI’s most famous director starring Leonardo DiCaprio and directed by Clint Eastwood was always going to be big, whether a flop or a hit, and it was mostly a success, with DiCaprio in particular getting acclaim for his performance as the beefy, complicated character. The film goes over seminal moments in history such as the kidnapping of the Lindbergh baby, the Red Scare, and the introduction of forensic science into the Bureau’s arsenal of crime-fighting tools.\nThe film also delves into his close relationship with his mother (played by Judi Dench), his discomfort with women, and his possible romantic relationship with colleague Clyde Tolson (Armie Hammer). In his later years, Hoover increasingly resorted to less-than-legal tactics to avenge what he saw as attacks on his reputation. Overall, it’s an intriguing, star-studded study of a perplexing yet fascinating life.\n7 No Man of God (2021)\nGoing hand-in-hand with our fascination with the FBI is our fascination with serial killers, and Amber Sealey’s 2021 film combines both. Based on historical transcripts, Elijah Wood is Special Agent Bill Hagmaier, who from 1984 to 1989 took on death row inmate Ted Bundy (Luke Kirby) as a case study with the Behavior Science Unit. It’s always a risk to get close to a manipulative killer like Bundy, but that’s exactly what Hagmaier did over those five years, and the performances of the two leads take what could have been a story you’ve seen before into something much more intriguing.\n6 The Departed (2006)\nThis isn’t a straight portrayal of an FBI agent, but there are still a lot of ties to the organization. Martin Scorsese’s 2006 thriller is based on a few sources: 2002 Hong Kong crime drama Infernal Affairs, the Winter Hill Gang out of Boston led by Whitey Bulger, and the corrupt FBI agent who fell in with them, John Connolly.\nThere’s a good deal of overlap with the 2015 film Black Mass, in which Johnny Depp played Bulger and Joel Egerton Connolly, but in The Departed the roles went to Jack Nicholson and Matt Damon, with the addition of Leonardo Di Caprio as a fictional undercover state trooper based on the character played by Tony Leung in Infernal Affairs. There’s a lot of undercover criss-cross deception, and Costello is eventually revealed as an FBI informant.",
  "word_count": 1419,
  "scraped_at": "2026-02-14T13:00:00.683239"
}