{
  "article_id": "5fa95de16eaa",
  "url": "http://usa.chinadaily.com.cn/a/202401/09/WS659ca0e9a3105f21a507b3f0.html",
  "title": "GASC recognizes voluntary programs",
  "date": "20240109T030000Z",
  "domain": "usa.chinadaily.com.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "GASC recognizes voluntary programs\nBetter fitness facilities with greater accessibility, numerous sports activities at all levels and quality services provided to sports-for-all enthusiasts are all testimonies to the rapid development of China's national fitness campaign.\nThe growth is boosted by the growing number of voluntary service fitness programs across the nation, which are organized by local sports bureaus, sports-for-all associations and clubs. These programs have played a vital role in attracting more people to fitness and sports, and provide scientific training guides to people looking to participate.\nThe Sport For All Department of the General Administration of Sport of China last week awarded 50 outstanding voluntary service fitness programs, which were selected from 254 programs collated by the sports ministry this year. For the past three years, more than 800 programs have been recognized by the GASC, and a total of 293 programs have been awarded as \"outstanding\".\n\"We are very pleased to see that a number of quality and influential voluntary service fitness programs have emerged across the nation. The variety of these activities is increasing with greater participation. There are some outstanding cases that facilitate the growth of the national fitness campaign,\" read a statement by the GASC.\n\"The aim of the national fitness campaign is to help people achieve a better physical condition and enjoy a healthier lifestyle. And the goal of organizing voluntary service fitness programs is to help facilitate the national fitness campaign. These campaigns are voluntary and free to everyone. In the future, the GASC will help to stage more of these quality programs across the nation.\"\nAmong the 50 programs that were highlighted this year was Balizhuang soccer voluntary service program, which is organized by Beijing Sports Bureau in the capital's Chaoyang district.\nA soccer match, called the \"Balizhuang Super Cup\" by locals, takes place each year on Aug 8, and many of the teams boast players from wide age range — from 20 to above 60 years old. In the Balizhuang area, there are eight community soccer teams along with several other teams from nearby companies.\nOne of the teams is called \"The Same Age Men\", as the team was founded by a group of friends who were all born in the 1950s. With the expansion of the team, it now boasts more than 50 members, with several young guns who are in their 20s. Each week they will train at least three times. Sometimes they will travel to other cities, or even countries, to challenge other community squads.\n\"Some of us will take planes, but many retired people like me would like to take trains, as we have more time to enjoy the trip. Over the years, we have traveled to other provinces including Shandong, Hainan and Henan. We even traveled to South Korea to compete,\" said the team's captain Liu Jianmin.\n\"For those young guys who still need to work, they will fly back to the office soon after the matches. But for the retired lads like me, we will stay and explore the cities for a few days.\"\nAnother team in Balizhuang is called \"Happy Sunshine\" which boasts more than 20 players, most of whom are above 60 years old.\nIts skipper, Gu Daquan, is a former professional who played at Chinese Super League club Beijing Guo'an in the 1980s, and then became the head coach of Beijing Women Football Club before his eventual retirement.\nHe told media that the number one rule he had for his current team was to not allow anyone to play after drinking and the second rule was to prepare enough medicines needed by the older members of the squad.\n\"We are not that aggressive on the pitch, and we avoid physical confrontation as much as possible. We are not young, so we play for fun and our health. The priority after each match is to find a decent restaurant where we can have post-match meeting and analysis,\" Gu joked.\nFor the past few decades, Balizhuang has been home to more than 200 professional soccer players, including former Team China and Bundesliga midfielder Shao Jiayi.\nApart from competitive sports programs, the voluntary programs cover a wide range of activities including free guided community fitness training, customized sports services to people with disabilities and online fitness challenges.\nshifutian@chinadaily.com.cn\nMost Popular\n- Guangdong beats Macao 2-0 in first leg of soccer cup\n- Para teams set to leave mark on ice\n- US skier Johnson wins women's downhill as Vonn crashes at Milan-Cortina Games\n- Su Yiming clinches first medal at Milano-Cortina\n- Over 300 athletes from 35 countries and regions kick off Asian championships in Tianjin\n- Legacy of Beijing 2022 lives on as Milan welcomes Games",
  "word_count": 782,
  "scraped_at": "2026-02-14T12:41:25.891911"
}