{
  "article_id": "5fb1fecc0ffc",
  "url": "https://www.jamaicaobserver.com/2025/02/18/no-bunny-busby-energised/",
  "title": "NO  BUNNY  BUT BUSBY ENERGISED - Jamaica Observer",
  "date": "20250218T081500Z",
  "domain": "jamaicaobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NO ‘BUNNY’ BUT BUSBY ENERGISED\nReggae Girlz plan for Peru games despite Shaw’s absence\nDespite the absence of captain and star striker Khadija “Bunny” Shaw, Head Coach Hubert Busby is eyeing the upcoming international friendly matches against Peru as pivotal moments to refine the Reggae Girlz’s strategy and generate momentum ahead of the 2027 FIFA Women’s World Cup qualification tournament.\nThe two matches are set for February 23 and 26 at the Estadio Miguel Grau in Piura, Lima, Peru.\nBusby says Shaw’s absence from the Reggae Girlz squad is due to a minutes-restriction set by Manchester City. The decision aims to ensure Shaw returns to international duty at peak condition, while respecting her club’s fitness management.\nFollowing Manchester City’s 4-3 loss to Arsenal on February 2, Shaw was subjected to racist and misogynistic abuse online. In response, she took a stand and withdrew from the team’s League Cup semi-final match against the same opponent on February 6. However, she subsequently made a strong return to the pitch, scoring twice in City’s 4-0 win over Liverpool.\n“The most important thing about Bunny’s health is that Sunday was her first start in 2025, as I’m sure everyone has noticed,” Busby said. “She had been out for a while and had limited minutes, and she’s still on restrictions. As a result, Manchester City is monitoring her progress in terms of her return, and we’ve obviously respected that.\n“It was great to see her getting in at the start and her getting two goals but I think it is outside of that, obviously she needed some time; she took the time and she made that decision to come back in due course and she was back in flying colours the last couple of games.\n“But really, I think it is in terms of load management. We’ve had a few players in similar situations that we called in as well where their clubs have shared some of their guides with us, and we are in close contact with our medical people as well. So, decisions in terms of bringing in players in are also made with that in mind and that is one of the reasons why she is not in the squad.”\nBusby says he hopes Shaw will be back to full fitness soon and looks forward to having her in the squad for the next window.\nHe says the primary objective for the upcoming games is to continue implementing the team’s evaluation process and embed their playing principles.\n“The goal is to continue with implementing our evaluation process. It’s really about implementing our playing module in terms of what we are looking to do with our philosophy, all the playing principles we want to embed in this team,” Busby said.\nWhile winning is always important, Busby says the team’s focus is on improving their performances and ensuring that every player understands their roles and responsibilities.\n“Winning matches is always important, but outside of that, what is really important is for us to be able to improve our performances and implement the things that we have set out to do, each and every camp,” he said.\n“We definitely have improved on those principles. Are we there where we want to be? Absolutely not. We are still far from the standard that we want, but we are making progress, and I think that is the most important thing.”\nThe Reggae Girlz will face a stiff challenge from Peru, a team they last met in the 2019 Pan American Games, where Jamaica secured a 1-0 victory.\nThe 23-player squad for the upcoming features a mix of local and overseas-based talent. These overseas players included Jazmin Ferguson and Nyema Ingleton.\nFerguson, a defender at Louisiana State University, was recently recognised by the United Soccer Coaches as one of the “Defenders to Watch”. Ingleton, from Burnaby Central High School in British Columbia, is making a name for herself in Canadian soccer. Both Ferguson and Ingleton are poised to make their senior Reggae Girlz debut.\nThese upcoming friendlies, Busby says, will also serve as an opportunity for him to integrate some players back into the group, particularly those who have been away due to schools and other commitments.\n“We are excited to have those players and see how they make the step up again,” he said.\nFULL SQUAD\nGoalkeepers – Rebecca Spencer, Aliyah Morgan, Liya Brooks\nDefenders – Allyson Swaby, Chantelle Swaby, Naya Carodoza, Siobhan Wilson, Jazmin Ferguson, Deneisha Blackwood, Kameron Simmonds, Nyema Ingleton\nMidfielders – Atlanta Primus, Njeri Butts, Amelia Van Zanten, Drew Spence, Jade bailey, Olufolasade Adamolekun\nForwards – Tiffany Cameron, Kalya McKenna, Shaneil Buckley, Jody Brown, Reanna Blades, Ricshya Walker",
  "word_count": 774,
  "scraped_at": "2026-02-14T12:19:18.200797"
}