{
  "article_id": "5fb1decf435d",
  "url": "https://www.twtd.co.uk/ipswich-town-news/36885/keane-to-be-assessed-ahead-of-fleetwood-clash/onthisday",
  "title": "Keane to Be Assessed Ahead of Fleetwood Clash - Ipswich Town News",
  "date": "20231003T230000Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Thursday, 3rd Oct 2019 13:10\nStriker Will Keane remains a doubt for Saturday’s top-of-the-table clash with third-placed Fleetwood at Highbury.\nThe 26-year-old was left out of the 18 for last week’s 4-1 home victory over Tranmere due to a minor groin problem and manager Paul Lambert says the former Hull City man will be assessed over the next few days.\nThe Blues are travelling to the North-West this afternoon and will be training at The Cliff, Manchester United’s old first-team training ground which is now used by some of their academy sides and their women’s team.\n“We'll see how he is in the next couple of days if this one's too soon I don't know, but I'll see how he is,” Lambert said of Keane, who coincidentally came through the ranks with the Red Devils.\nLambert says there are no other new injury problems: “No, we seem to be not too bad. There's a couple of games in the next few days so most guys will play between Saturday and Tuesday.”\nCentral defender Toto Nsiala has played three U23s games since returning from the hamstring injury he suffered in pre-season and appears likely to make his first senior appearance in the Leasing.com Cup tie against Gillingham on Tuesday.\n“He's doing really well,” Lambert said. “Again, I'll see how he does as well so [he'll play] either this one or Tuesday.”\nMore and more players have come back from injury in recent weeks, while fewer appear to be suffering new knocks. Asked whether he believes his rotation policy will reduce injuries this season, Lambert added: “There is a part of that, but there's also a part of trying to pick a team to win a game, and the lads have been great whether they're the ones out or the ones in, they've been really, really good.\n“It's keeping their fitness up rather than just keep training and training and training with nothing to show for it. They've been great, and I can't praise them highly enough.”\nRegarding those still out longer term, Lambert says Teddy Bishop, Freddie Sears and Jack Lankester are all making progress but are still a fair way off a return.\n“The guys are doing great, Freddie, Teddy and Jack but they haven't trained,” he added. “They're with the fitness guys and the medical team, and the next step is to come in with us, but they haven't done that.\n“Hopefully, it won't be in the too distant future, but they're still a good bit away from playing first-team football, but they're doing really well.”\nLambert says there’ll again be wholesale switch of personnel for the Gillingham match next Tuesday: “We'll definitely be changing for the Gillingham game. It's impossible not to and as I said before the main priority is the league.”\nAmong those likely to be involved in that match having scored both goals in the 2-0 victory over Tottenham’s U21s in the Blues’ first game in the competition is Jordan Roberts, whose League One involvement has been very limited this season. However, Lambert says there’s been no moaning from the former Crawley man.\n“He's been fine,” he said. “He's trained well, and he's not given us one bit of problem with it.\n“He'll understand that it's difficult to get in the side when everybody is at a really high level, but training-wise there haven't been any issues.”\nIs he still in his thoughts? “Yeah, everybody is whether you're not playing or you're on the bench. I need everybody. I said that before, the football club will only have success if everybody goes the same way.”\nLambert says, as was the case with the Tottenham match, he’s hoping that Armando Dobra and Idris El Mizouni’s departure for international duty can be delayed so they can play in the Leasing.com Trophy.\n“We're in dialogue with their national teams at the minute,” he said. “If I can keep them here then great, then I'll look at them on Tuesday.”\nLambert reiterated that he is no fan of the competition: “I'll say it again, when games aren't good and people say the quality isn't good, we have too many games in this country, far too many.\n“And it's another competition where if you're in it you try and win it, but for me, it isn't the most important thing.”\nHe says he had no hesitation in calling off next week's home game against Wycombe due to the number of international calls.\nAlan Judge (Ireland), Armando Dobra (Albania U19s), Anthony Georgiou (Cyprus) and Adam Przybek (Wales U21s) have already been called up while Andre Dozzell, Flynn Downes (England U20s) and Idris El Mizouni (Tunisia full or U23s) could also be away.\n\"No, we have too many players missing,\" Lambert said. \"Maybe Downes, maybe Dozzell, maybe Judge, maybe Dobra, maybe Idris and Anthony, so there's six right away.\n\"It's too many for me to go and treat any lightly or any game with contempt — I won't do it, I'll go with my strongest possible hand to play. Those lads being away is too many.\"\nPhoto: TWTD\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nCOYB\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 877,
  "scraped_at": "2026-02-14T12:07:16.424459"
}