{
  "article_id": "5fcaee30a582",
  "url": "https://www.cpr.org/2025/05/16/interview-denver-mayor-trump-housing-16th-street-mall/",
  "title": "Interview : Denver Mayor Mike Johnston on standing up to Trump , the housing shortage and 16th Street Mall",
  "date": "20250516T181500Z",
  "domain": "cpr.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s been a trying year for Denver’s mayor. Mike Johnston has battled with the Trump administration over the city’s welcoming immigration policies. An uncertain economy may mean cuts to the city budget. Yet big things are happening. A top attraction – the 16th Street Mall – is finally reopening. And a women’s soccer team is on its way, with a sparkling new stadium. Ryan Warner spoke with the mayor at his office.\nThis interview has been lightly edited for length and clarity\nRyan Warner: I want to start with immigration. Of course, you were grilled by Congress in March. Now the Justice Department is suing Denver and Colorado for that matter over so-called sanctuary policies. Is there any policy or approach that you are thinking of changing as a result of federal threats?\nMayor Mike Johnston: No is the short answer and the reason why, which we've said over and over, including in testimony before Congress, is we do not violate any federal, state or local law at this point. Denver abides by all of the laws that are required of us, and there's no grounds by which they could cut federal funds or be able to refuse us access. Their claim, we haven't seen the actual complaint yet, but their claim is that they are just angry because we're not actively cooperating and doing their job for them; that would be like them being angry that we're not solving the Ukraine war for them. That is an explicit federal power, which is managing immigration, managing foreign affairs. Cities don't do that. They can't sue us for not doing a federal job when we don't violate any federal law.\nWarner: Well, there are communities that are more, shall we say, collaborative with federal immigration enforcement than Denver has been, and then Colorado has been. Would you agree with that?\nJohnston: I would agree, but I'd say about 50 or 60 percent of Americans probably live in a jurisdiction that does something similar to what Denver or Colorado does, and we're actually more collaborative than some other cities. But in Denver, what we do is we don't ask someone's status when we stop you for speeding because it's not relevant to whether you were speeding or not. And so we don't know your status. Federal law says you can't prohibit a city employee from sharing information about someone's status with the federal government if you have that information. Our employees don't have that information because we don't ask it, and so we're not hiding any of that data. And, which other cities don't do. If we do have someone in our custody, like in our county jail and ICE wants access to them, they can alert us and say, we want to get John Smith, and we would say, “Okay, he's scheduled for release this Thursday from 2 to 4:00 PM. You can contact him then if you want.” So we do notify them of the release of any person that they're looking for, but we wouldn't know that person's status because we don't ask that status when they arrive in our system.\nWarner: And that is not a question you are prepared to start asking.\nJohnston: No, because the reason why is we want to run a safe city and if you start asking people their immigration status when they come to the hospital or when they come to a court, if you come to testify as a witness or as a victim in a trial, you're not going to do that if you're afraid the first thing that we'll do is ask you your status and report you for deportation. That's how you get unsafe cities is people are afraid to go to schools, they're afraid to go to church, they're afraid to go to hospitals, they're afraid to go to public buildings. We think that is part of what keeps the city safe. And keep in mind, if you are committing a crime, if you are doing something violent in the community, we're actively looking for you. We would partner with the federal government in actively looking for you if you had committed a violent crime, but if your only civil infraction was you crossed the border without proper documents, but now you are working in our community, going to the local neighborhood church and taking your kids to school, that is not a safety threat for Denver.\nWarner: There are people who are disturbed by the idea that someone crosses illegally, that someone stays in this country who doesn't have status. It doesn't sound like you share any of that frustration or anger that folks are present here.\nJohnston: I think when you know enough people who share the stories of how they got here, you realize that it is an eminently human thing that any one of us would do. I mean, I was a school principal before this. I had a lot of students who had this experience and they were kids who were 17 and would tell me, a student of mine, like Flavio, who's comfortable with me sharing the story because he shared it before himself, he was three years old when his dad was one of the people in his town who spoke out against the local cartels and the cartels came in the middle of the night and murdered his dad. And so his mom put him in a car that morning and just drove and drove and drove and drove until they got to Denver. That's where he's been since then and when he came through high school and wanted to go to college, he wasn't documented, went back to Mexico. The only way he could do it was go back and apply. So he'd spent months hiding from the cartels who were still looking for him to become a citizen and the first thing he does when he gets his papers is come back home and enlist in the US Army because he wants to give something back to the country that's given him so much. I think these are the stories of families that come here and I don't think any of us in most of those circumstances would do anything different. But yes, of course we want them to play by the rules, to apply for work authorization, to pay taxes, and they want the same thing. Our focus has really been on connecting them with jobs and with housing so they can contribute to the community, which is what they want to do.\nWarner: Let's spend just a moment on the word sanctuary. Literally a safe place for people and creatures, the holiest part of a church. I suppose whether or not you agree with the label, did Denver sacrifice too much to be a refuge?\nJohnston: I'm so glad you went to the definition because when I was going before Congress, I wanted to ask that question, which is how do you define sanctuary? There's some version of sanctuary which is harboring people from federal law enforcement. Are you protecting them from federal law enforcement? We are not doing that. Are we a welcoming city where when you arrive on our city streets in January in ten degree weather with sandals and a t-shirt, yes, we will find you a place to sleep tonight so you don't freeze to death. We will try to get you food and shelter and access to services. We think that is a humane thing to do and a welcoming thing to do.\nWarner: You might shut down someone's gym or rec center for a time to make a space for that person leading to some frustration in your city.\nJohnston: Yeah, I think we have to make hard decisions in these moments and I never met a Denverite who said, “I would let a child freeze to death on the street to keep my rec center open another hour at night.” And obviously our preference would be to do both, to keep all those rec centers open all the hours and make sure no kids freeze to death on the streets. We didn't create this crisis. We didn't ask for this crisis, but when you have 200 or 300 people a day arriving in your city with no services and no support and no warm clothes, I think the humanitarian thing to do is to make sure that they're safe and then help them do what they want to do, which is to work and support themselves. Almost every newcomer that I talked to would say to me the same thing, “Thank you Mr. Mayor. I don't want any help. I don't want any charity. All I want is a job.”\nWarner: Washington has the purse strings. It's unclear to me who in Washington holds them these days, the president or Congress, but what federal funding is threatened? Perhaps more importantly, what are you willing to sacrifice on behalf of Denverites to preserve your approach to immigration?\nJohnston: Well, keep in mind the threats on federal funding cuts are not going to be unique to immigration. They're going to be about our willingness to sign allegiance or bend the knee on every single executive order the president has issued. So will we disavow every diversity, equity and inclusion practice? Will we align to all of their policies around transgender sports participation? It will not be simply a question about immigration. It will be, will you sign on to all of their policy prescriptions in the executive orders?\nWarner: Are you saying that out of speculation or because you've gotten specific messages already that that's the case?\nJohnston: We've gotten actual notice from them on the requirement that we would have to sign on to some of these executive orders just to access basic transportation funding. And so this is one where we're not going to be bullied or blackmailed out of our values. We're not going to abandon the belief that we think there are real histories of racial inequality in this country and those are things we should have a strategy to address. That's true for how we do business, and we are proud about that. And so we'll stand for what we believe in and we'll fight for all of our taxpayer dollars because we believe we're entitled to them. And on every one of these issues, there's nothing we're doing that is breaking the law. There's no DEI practice we have that is illegal. Every one of them is compliant with federal law.\nWarner: Is there less money in your coffers, federal money in your coffers right now because you haven't signed these pledges?\nJohnston: They've cut about $40 million so far from our FEMA funding. And that's a good example of how particularly absurd it is because that was a grant that we applied for under the condition that the requirement was you had to use that money to serve migrants that had arrived in your city. We then applied for that grant, got it, used that money, and they're now denying us that grant because we used the money to support migrants in our city. And so I can't solve that problem where they just wanted to reverse the policy of the grant we'd already received and we're suing over that. And so we'll bring a suit to get those dollars back and we're prepared to sue affirmatively on a number of these issues where we think that it's clear that it’s not the government's purview to deny taxpayers their own tax resources when we're not in violation of any laws.\nWarner: Anything that you're on board with in terms of this administration?\nJohnston: Wow, I have a hard time coming up with an item on that list. I'm hopeful that one of the things this administration will do will be to pursue real aggressive strategies on adding housing supply. If you want to “build baby build” in terms of building more affordable housing, we want to do that. We need to do that in cities like Denver that are high growth. And so it's not entirely clear what HUD's strategy will be, but if that seems to be part of the president's agenda in the past, we would like to be a part of a partnership to bring on more affordable housing.\nWarner: HUD is Housing and Urban Development. Indeed, you want more affordable housing. I'll note that voters turned down your proposal to raise sales taxes to fund that. What's your most powerful tool today?\nJohnston: I think it's all of the above. We do have city dollars that we use right now. We do have permitting changes we've made to help the permitting process go faster for affordable housing. And we do a lot of public private partnerships where we don't need to fund all of the cost of building a new unit. We just fund the small amount of the difference between what it would cost to build a market rate unit and an affordable unit, so then our public taxpayer dollars go farther. We have a goal to bring on 3,000 units of affordable housing this year. That's about almost three times what the city was doing two or three years ago.\nWarner: On homelessness in particular, this was obviously a key issue from the very start of your campaign for mayor in 2022. Your plan is called “All in Mile High” and it has meant fewer encampments, thousands of people off the streets. But many brought into shelters linger there without permanent housing. What's the holdup?\nJohnston: Yeah, I mean, first is, I think it's important to revisit this has been already a historic success and we're just getting started. There's more to do, but just to note, I mean we've closed every large encampment in the city of Denver. I mean, two years ago there were almost a thousand tents in downtown. A hundred, 200 person encampments around places like the post office you couldn't get in and out of. And so the fact that we don't have a single large encampment left in the city, huge progress. We've dropped family homelessness by 83 percent in the city, which is fantastic for us. And we've become the largest American city ever to end the cycle of homelessness for veterans. And you're right, the thing we are working to do better on now is they go from living on the street to living in our transitional housing sites. And then from there we want to move them into permanent housing so they're in their own rental unit that they can afford. And there the same challenge they're facing is the same challenge that every nurse and teacher and firefighter and server in this city is facing is can I find an affordable unit to rent?\nWarner: And you say 3,000 are coming on this year.\nJohnston: 3,000 will come this year. We need to probably do closer to 5,000 to meet the need. And so that was what we were hoping to do with the ballot measure. Those resources are not available, so we have to be more creative about that. But we are adding units every year. But the real challenge that's going to stress the city in all places is if we don't have enough affordable housing supply, it is going to force pressure into more homelessness. It's going to force more and more blue collar workers to move out of the city. It's longer commutes, it's more impact on climate. It's more traffic and congestion. So I think this is going to continue to be one of the most important issues we have to solve is the amount of affordable housing supply we've got to deliver.\nWarner: Interesting that there are more rentals on the market than in years past. That's after a big construction boom and rents are going down slightly as a result. So how does that fit into the picture? So how does that fit into the picture? Is housing density beginning to work?\nJohnston: That does show to us that the basic math works. If you bring on more units, then prices go down. When you have massive scarcity in units, prices go up. I think our concern is that data is lagging about three years because what matters is how many new units are we starting today because that'll be the supply two or three years from now. And so we are worried that we've seen reductions in the number of permits for new units in the last year. Obviously a lot of uncertainty in the world, both from interest rates to recession, etc. and so we have to really push to stimulate enough in the pipeline for new growth because the last time we had a shortage in the pipeline was when you saw the massive 15, 20 percent spikes in rental properties in the 2021, 2022, and 2023. And so I think some good signs now, but we have to keep up with supply or demand will get scarce again and prices will skyrocket again.\nWarner: Lately in Colorado, I've been made to think of housing as different from the picket fence things we drew when we were in kindergarten of the traditional house. I mean, you've been an advocate of micro housing and certainly we are hearing a lot about accessory dwelling units, you know sort of mother-in-law suites. There's also this concept, the “missing middle” housing. I'll say this is a newish term for me, but housing that fills the gap between single family homes and large apartment complexes. The state is pushing for, and Denver is embarking on a path toward more “missing middle” housing and some of it gets pretty inventive and creative. How do you envision Denverites living in ways they may not right now in masses?\nJohnston: I think this is the most important part, and Ryan, I would say this is what I didn't do a good enough job communicating about on our ballot measure is when people hear the word affordable housing, they think public housing. They think folks that are on public benefits, you think of the old public housing projects of our childhood. What they don't realize is that 50 percent of the Denverites who rent tonight cannot afford to rent in Denver, which means they're paying more than 30 percent of what they make to rent. Those are not people that are unemployed or on welfare. Those are people that are working full-time as teachers or working as servers or working at a retail or working at the Starbucks that you go to everyday. When we're talking about “missing middle housing,” it is housing for that missing middle class resident who doesn't make enough money to be able to pay the rent but is not low income enough or unemployed enough to qualify for a lot of public support. And so what we want to get people comfortable with is the idea to take that fancy 200 unit condo you saw come up in your neighborhood, which has $3,000 or $2,500 a month rents. And you say, “Who are those for?” What we want is to build buildings like that that will have beautiful apartments inside, and you might have a hundred of them, but 30 of them we will put in public dollars to buy down the cost. So those would be affordable. So you could have a doctor making $400k living next to a nurse making $80k. They both have the same units with the same furnishing, but our public investment has made one of those units be what we would call deed restricted to stay affordable. So that nurse never pays more than 30 percent of whatever he makes in his income.\nWhen you think about wacky new ideas, I do think you'll see things like we're looking to convert some of these empty commercial office buildings into residential. It's hard sometimes to make the right shape or structure to do a lot of two or three bedrooms, but you could see more of what we might call dormitory style housing where you might have young people who would want to live in a smaller unit where you have a shared bathroom on a floor like you would in a college dorm. But if you're 22 or 23 and it's your first job and you want to be downtown and you could pay 600 bucks a month for rent instead of $2000, that could be a real option.\nWarner: Soon, housing developers won't have to think about parking with many of their projects. How do you think that will change life?\nJohnston: Well, one of the reasons why we think this is important is it can change dramatically the amount of units you can add. If you look at a typical apartment building, two thirds of the real estate on that place is the parking.\nWarner: That's been referred to, or is referred to in those circles, as a podium. It's like the first five or six floors either above ground or underground are for parking.\nJohnston: That's right. And what we find is we're not obviously prohibiting parking. We're letting the market decide on parking. A good example, if you go across the street from where we're sitting now, is the new Populus Hotel.\nWarner: Which is the first famously with no parking.\nJohnston: Famously with no parking but they also rent parking spaces from the city and county, from available lots that are in the neighborhood. So they have access to parking. They're just saying, “We don't need to build another 400 spaces on our property or beneath our property.”\nWarner: And so that maximizes housing on a particular plot of land.\nJohnston: Correct. And it also encourages people to use more public transit to bike or to walk or to do a ride share or do others which have hopefully less impact on climate and on traffic.\nWarner: There is a big kickoff at the end of the month for the new and improved 16th Street Mall. It's fascinating to me because before the pandemic, commercial space was about 9 percent vacant along the mall. Today it's like 27 percent. That is a quarter of the mall or more. You notice sort of an empty storefront. That's according to the downtown Denver partnership. What will make the mall worth visiting?\nJohnston: It is going to be fantastic when we reopen. Your listeners can't see, but behind you, you'll see on my wall a full life-size model of 16th Street with every single retail spot that we need to fill. And many of them we have now filed, but when you come to see it, if you remember, the old 16th Street used to have the bus lanes and there was an island in the middle.\nWarner: Yes, I remember playing Frogger a fair amount.\nJohnston: It is a little bit of Frogger. So what we've done now is moved the two bus lanes into the middle center, and then they made these very wide, wonderful sidewalks that take up both sides. And so we'll have big patios, we'll have art activations there, we'll have performers there. But we'll also have a whole set of fantastic new retailers that we've brought back to downtown. And we described this as, it will feel like the best of Denver, only in Denver. You'll see a lot of your favorite neighborhood restaurants or bars or retail shops that will also be in downtown. And you'll find some brands you haven't seen before. There'll be new park space, there'll be new open consumption of locations where you could sit and walk outside and sit on the patio and have a beer or sit in the park and have a beer or a drink. We'll have a new mini soccer field for your kids to play on. There'll be some great new art activations. So I think what you're going to find is an incredibly vibrant 16th Street that is going to be connected to a really reviving and vibrant downtown. And so yeah, people should get excited to come back down at the end of this month. It will be open all the way up through block ten. So buses will be running, fences will be down, it'll be great, sunny 16th Street.\nWarner: Thirteen blocks altogether according to the sprawling map on your wall there. So are you saying that you have tenants, businesses, perhaps that you're not revealing to us today that will shrink that 27 percent commercial real estate vacancy?\nJohnston: So we're talking about two things. One is on 16th Street, we're focused on the ground floor retail. When you walk down 16th, are there stores and restaurants open there? And we've put about 50 new businesses in there this year that will be ready to open over the course of the summer.\nWarner: Do you want to drop some names? I mean, people love a brand.\nJohnston: There are a couple of great ones that you'll know. Olive & Finch, which people probably know and have been to, will have a spot there that you'll see.\nWarner: Olive & Finch, the kind of sandwich shop.\nJohnston: It's a great sandwich shop. We'll have a Leven Deli that's going to be opening over there that moved from its first location in Golden Triangle.\nWarner: Leven Deli, the Jewish-inspired deli.\nJohnston: Which is fantastic. We have the Pavilions that will still be open on the upper end of the mall. What you'll see are new spaces that are closed to driving that are just pedestrian locations. So Glenarm, where the Paramount Theater is, will now be a fully closed pedestrian space where you can sit outside and eat or drink or walk. What we're focused on is getting more and more people downtown. And so that 27 percent number you're talking about is commercial office space. It's the 40 story commercial building that is behind 16th Street.\nWarner: I understand that you're focusing on that which is immediately engaging the pedestrian.\nJohnston: Correct. And we think that draws more people back to want to work downtown or be downtown because it feels active and vibrant. And so that is our attractive magnet.\nWarner: Is Denver dropping the word mall? I'm starting to see literature that's just 16th Street.\nJohnston: We've done a lot of thinking about how to describe the new vision for the future of it, and we're going to do a big unveiling on Tuesday, and so you should come. It’s going to be very exciting.\nWarner: And yet work was just transformed by the pandemic. And the office worker that we knew is just not the office worker we see today. So isn't there a fundamental shift that you cannot change even as you try to draw people downtown?\nJohnston: We do have to do a couple of things at once to make downtowns more active. One is we're going to move it from what we used to think of as a central business district to what we'll call a central neighborhood district. It should be a neighborhood like any other. You used to think about it, oh, you live in a neighborhood, but you go downtown. We want downtown to be more of a neighborhood; that means more residential units. So what we'll do is convert these commercial buildings into apartment buildings, into residential. So instead of having to bring new businesses into those buildings, there'll be residents who are there. We'll also update some of those commercial buildings from very old 50 or 60-year-old commercial buildings that aren't as attractive to places with different and better and more attractive amenities that folks do want to be drawn back to the office for. We'll look at ways that we can creatively use that space, like bringing artists back who wouldn't normally think that they could office or have space downtown, taking startups who would've thought they couldn't afford to be downtown to come in at discounted rates as some of those places were.\nWarner: Are you picturing like a beatnik Bohemian artist in Republic Plaza in a former like oil and gas law firm?\nJohnston: Yes. Right now we have public employees in Republic Plaza who are yes, what used to be the penthouse suite of Republic Plaza full of oil and gas executives is now public servants. We leased space there because we wanted to keep it active. We wanted to keep our employees in person downtown. So yeah, we want a combination of all of the great pockets of Denver's life to be present in downtown. That does mean artists, that does mean startups, that does mean young people and old people and people with kids and families. We want that to be the reality of how downtown feels.\nWarner: Meanwhile, you have high hopes for downtown, certainly high hopes for a national women's soccer league stadium, and what will be the city's fourth largest park. And there's a slowing of sales tax growth, which will no doubt affect coming budgets. And there are in fact talks of cuts and layoffs. So I don't know, square all the hopefulness I'm hearing with some of the economic realities and frankly the vagaries that you've alluded to.\nJohnston: I think for us, the really important part of this is particularly in times of challenge, you know for folks that are whitewater rafters when you are in a hard rapid, the most important thing you do is keep paddling. You don't actually stop moving. And so here the key is we do think the most important thing is to keep investing in the things that will drive long-term economic development. That means, yes, the soccer stadium and the development around there is a great opportunity for economic development. It's 1,100 jobs. It's half a billion dollars of tax revenue. The stock show and the investment in the stock show asset will drive economic growth, Ball Arena and River Mile, those are all key developments that drive growth. I was talking to Federico Pena (former mayor and former U.S. Secretary of Transportation) who said 40 years ago he got the same feedback and folks are saying, “You know what? Now's not the time to build an airport or build a convention center or build Coors Field.” But the reality is those are the economic drivers now that make Denver, Denver.\nWarner: But you still have to pay firefighters.\nJohnston: Correct. And the key is these are mostly all capital investments. So for instance, the women's soccer franchise, that is not a general fund dollar. It doesn't come out of a department. It doesn't replace a job or a program. It is meant for capital construction or infrastructure. The same will be true with our parks investment in the new Park Hill golf course becoming a park.\nWarner: Does that have a name yet?\nJohnston: We don't yet. It's Park Hill Park right now, which is not yet probably the right long-term name, but it's better than Park Hill Golf Course. So we will both of course be mindful and thoughtful about how to balance the budget and protect core public services. But we also do think you want to use your capital dollars to invest in projects that will help us grow our way out. Because if you don't do that, then you just start dying faster instead of living faster. And we want to keep investing while we go.\nWarner: Did you call Federico Peña up with this question? Do you see this as the same type of inflection point that a Mayor Peña or a Mayor Webb faced as they considered or a Mayor Hickenlooper as they considered the questions of Coors Field, of the airport, of the transformation of LoDo?\nJohnston: I do think those were major strategic investments that were made that changed the future of the city. I think there are a series of investments we're proposing now that we think will do the same thing. And so for us, that is why you want to be dreaming the next stage of what Denver is while you're still managing the current stage. We're going to keep picking up trash. We're going to make sure we have officers on the street. We're going to provide core public services. But yes, we want to be able to focus on those core services and still be mindful of going to where the puck's going to be.\nWarner: But what does go first? What gets jettisoned if sales growth slows? I mean, it's common among politicians to hear that you want it all. I get it. And of course you want to promise it all, but you can't have it all.\nJohnston: That has been told to me a couple of times, I think. I still keep believing it's possible. But no, I agree with you. We will have to, as we get more and more information on what the economy is doing and what's going to happen, you see cities around the country facing this challenge, you see private sector companies facing these challenges with high interest rates, with real fear of recession, consumer confidence, business confidence are at all time lows right now, as low as they were in COVID or in the Black Monday of the 1980s. It's like those are real data points to be concerned about. And the volatility of the federal government does not help us. So we know that's true and we'll be prepared to figure out how to manage that reality and we'll have to make hard decisions. I'm not denying that we will, but we did that last year. Last year we reduced the size of government in Denver for the first time in 15 years. We slowed the growth of government for the first time in almost 15 years because we saw some of these indicators coming.\nWarner: You slowed the growth of government or you actually cut it?\nJohnston: Both. We actually cut the total number of employees while at the same time expanding the number of, say police officers and 911 call takers. We strategically grew in some areas, but we reduced the overall headcount of the city and we slowed its growth rate to accommodate for what we saw as risks in the economy. And so we did that last year. We know that economic projections look even tougher this year. So we'll keep watching that and we'll come out with a plan to figure out how to keep core services in place and figure out where we can make responsible adjustments.\nWarner: Any inklings of where responsible adjustments occur?\nJohnston: No, I mean I think that is what we do in the budget process as it's four months of us working with departments together to say, here are the projections we have, here are the numbers we have, what are the things where we could tighten and how do we make sure those aren't affecting core services? And that's a back and forth I do with our executive directors every year with feedback from city employees.\nWarner: I mean there are city council members who've expressed concerns that you're rushing big projects through and that perhaps your office lacks transparency in so doing. Are you moving too fast?\nJohnston: No. I think that what we know is that we want to move with the urgency our residents deserve. And people aren't saying, “Could you deliver me an affordable rental unit in five to seven years?” That's no one's timeline. No one's saying, “Could you make sure we have economic growth in downtowns? We don't want to have shuttered retail buildings on 16th Street in five years.” No. They want those things to happen now.\nWarner: Do I need a soccer stadium tomorrow?\nJohnston: Well, you won't have one tomorrow, but you will in two years. And what you do want is, for instance, at that site in particular, you've had a vacant blighted piece of land for 20 years that nothing has happened on and neighbors have been promised for 20 years something was going to happen there. And we think it's time to deliver on that promise and bring something that will actually bring economic activity and vibrancy to that neighborhood. We think that's a win-win for that neighborhood.\nWarner: Okay. Mayor, you're a Democrat. Although the race is nonpartisan, but your party has total control of state government. They are still, I think, finding their footing nationally. Do you take a lesson away from 2024?\nJohnston: Yeah, I do a lot of them. I think a top one is people want to be able to see evidence that we can deliver results on things that matter to them and that we're focused on those things. For me, the biggest things are things like affordability. Can I afford to live in my town? Is my town safe? Can you solve the crisis I see every day, like homelessness or addiction or mental health. They want to see the things right in front of them every day that we're focused on fixing.\nWarner: If that were true, wouldn't Joe Biden and then Kamala Harris have sailed to the White House, say on the back of the Inflation Reduction Act, you know with shovels in the ground all throughout communities in Colorado, the Midwest,\nJohnston: One of the challenges on a lot of those projects is shovels weren't in the ground. Those shovels are going to go in the ground and the Trump administration and those projects will be finished in the Trump administration. So sometimes we talked about this, the permitting, the zoning, the regulatory things that slow all of those projects down meant you had the dream, but if you couldn't actually get the thing built, then people are still looking to say what happened on all those items? And so I think those are places where a lot of times progressive cities and progressive states have put in more and more regulation than make it harder to build the very progressive things. We want to build light rail or renewable energy or pedestrian mobility. And so I think for us, it's both having the vision and the dream, but showing you can actually execute on governing in a way that changes people's lived experience each day. And I think that's something that we have to be more attuned to. And for us, that looks like homelessness. It looks like affordable housing, it looks like public safety, and it looks like economic growth that creates jobs.",
  "word_count": 6481,
  "scraped_at": "2026-02-14T12:19:58.397399"
}