{
  "article_id": "5fd599f93fae",
  "url": "https://www.finanznachrichten.de/nachrichten-2024-09/63303039-axi-financial-services-uk-limited-axi-renews-partnership-with-manchester-city-star-and-england-international-john-stones-399.htm",
  "title": "Axi Financial Services united kingdom ) Limited : Axi Renews Partnership with Manchester City Star and England International , John Stones",
  "date": "20240919T103000Z",
  "domain": "finanznachrichten.de",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SYDNEY, Sept. 19, 2024 (GLOBE NEWSWIRE) -- Axi, a leading global Forex and CFD broker, has announced the continuation of its collaboration with England international John Stones. Since partnering with the Man City star, Stones has continued to have unparalleled success on the field. The season ended with his club winning the Premier League championship for the fourth consecutive time - the first time a Premier League club has ever achieved this.\nHannah Hill, Head of Brand and Sponsorship at Axi, states, \"We are beyond thrilled to renew our collaboration with our Brand Ambassador, John Stones. Last year, we witnessed football at its finest as our longtime partners, Man City, accomplished a historic milestone, winning four back-to-back the Premier League titles. With over 250 appearances for Man City, John's remarkable skills and commitment to finding the competitive edge perfectly aligns with our values and ambitions. Just like John, we are dedicated to excellence and to sharpening our edge. We look forward to another awesome season and greater successes.\"\nBack in January, Axi launched their first player activation with John Stones for their Spread Betting campaign. Targeted exclusively at the UK audience, the activation featured John Stones reflecting on some of his most iconic moments on the field.\nIn addition to John Stones, Axi has been the Official Online Trading Partner of Premier League Champions, Man City for both the men's and women's teams, as well as City Football Group (CFG) Brazilian football club, Esporte Clube Bahia. Recently, the broker also announced a renewal of their partnership with CFG owned LaLiga club Girona FC, as the club's Official LATAM Online Trading Partner for two more seasons.\nAbout Axi\nAxi is a global online FX and CFD trading company, with thousands of customers in 100+ countries worldwide. Axi offers CFDs for several asset classes including Forex, Shares, Gold, Oil, Coffee, and more.\nContact: mediaenquiries@axi.com\nCFDs are complex instruments and come with a high risk of losing money rapidly due to leverage. 68.5% of retail investor accounts lose money when trading CFDs with this provider. You should consider whether you understand how CFDs work and whether you can afford to take the high risk of losing your money.\nGleichzeitig vollzieht sich an der Wall Street ein lautloser Favoritenwechsel. Während viele auf Wachstum setzen, feiern Value-Titel mit verlässlichen Cashflows ihr Comeback: Telekommunikation, Industrie, Energie, Pharma – die „Cashmaschinen“ der Realwirtschaft verdrängen hoch bewertete Hoffnungsträger.\nIn unserem aktuellen Spezialreport stellen wir fünf Aktien vor, die genau in dieses neue Marktbild passen: solide, günstig bewertet und mit attraktiver Dividende. Werte, die nicht nur laufende Erträge liefern, sondern auch bei Marktkorrekturen Sicherheit bieten.\nJetzt den kostenlosen Report sichern – bevor der Value-Zug 2026 endgültig abfährt!\nDieses exklusive PDF ist nur für kurze Zeit gratis verfügbar.",
  "word_count": 458,
  "scraped_at": "2026-02-14T12:48:18.008470"
}