{
  "article_id": "5fda3520f78c",
  "url": "https://www.aol.co.uk/articles/jess-carter-didn-t-want-192327397.html",
  "title": "Jess Carter  didnt want to leave hotel  after racist abuse at Euro 2025",
  "date": "20260123T200000Z",
  "domain": "aol.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jess Carter ‘didn’t want to leave hotel’ after racist abuse at Euro 2025\nDefender Jess Carter has revealed she did not want to leave her hotel room during England’s victorious Euro 2025 campaign after being targeted with online racist abuse.\nThe 28-year-old Lioness played her part as Sarina Wiegman’s side retained their European title in Switzerland last summer, but did so having to deal with vile attacks which prompted her to step back from social media.\nCarter told the BBC: “It was the first time where I lacked in confidence on the pitch. I didn’t want to leave the hotel in case the people who were saying those things were going to be in Switzerland with us.\n\"I didn't want to leave the hotel.\"\nEngland's Jess Carter received racist messages online during Euro 2025. pic.twitter.com/g6YIOT8QnU\n— BBC Sport (@BBCSport) January 23, 2026\n“It was quite a scary time and it was just really sad. It kind of totally devalues you as a human being.\n“I do not mind if people don’t like the way I play football, everyone is entitled to their opinion. But when you start attacking them as human beings and [for] what they look like, it’s a really sad thing to do.”\nCarter’s comments came after a 60-year-old man pleaded guilty to sending abusive posts referencing her race and suggesting people with brown skin were “murderers” and “groomers” to her TikTok account during the tournament.\nShe said: “It’s just really sad. I felt a sense of responsibility to speak up, not only for myself, but just for anybody else that’s facing that kind of abuse. We want great rivalries, but the abuse, for me, doesn’t need to come with it.\n“But that’s got worse. A lot of the players, specifically with the Lionesses, the profiles are getting huge now and every player should feel comfortable walking along the street and being whoever they want to be, and it’s getting to a place where I think a lot of people don’t feel that comfort any more.”\nCarter, who urged social media companies and the police to work more closely in a bid to tackle the issue, left Women’s Super League side Chelsea during the summer of 2024 with five league titles under her belt to join Gotham FC in the United States.",
  "word_count": 384,
  "scraped_at": "2026-02-14T13:06:58.328066"
}