{
  "article_id": "5fe2c2471b45",
  "url": "https://www.dailyexcelsior.com/womens-world-cup-hosts-urge-fifa-not-to-sign-saudi-sponsor/",
  "title": "Women World Cup hosts urge FIFA not to sign Saudi sponsor - Jammu Kashmir Latest News | Tourism",
  "date": "20230203T181500Z",
  "domain": "dailyexcelsior.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "GENEVA, Feb 2: Women’s World Cup co-hosts Australia and New Zealand urged FIFA not to sign a sponsor deal with the tourism authority of Saudi Arabia where “rights of women remain severely restricted.”\nLeaders of the two national soccer federations warned in a letter to FIFA, including president Gianni Infantino, that unilaterally sealing the “Visit Saudi” sponsorship could “severely tarnish the reputation” of the 32-nation tournament that starts in July.\nThat is despite the tourism brand being endorsed by men’s World Cup-winning captain Lionel Messi, who was announced last year as a paid pitchman.\nSuch a confrontation between a World Cup host and FIFA is unprecedented in recent history, and is likely to shine more attention on so-called “sportswashing” investments by Saudi Arabia.\n“We write to express our serious disappointment and concern at the news of the apparent appointment of Visit Saudi as a sponsor,” Chris Nikou of Australia and New Zealand’s Joanna Wood wrote Wednesday in the letter to FIFA seen by The Associated Press.\n“We cannot express strongly enough the potential repercussions and fallout that could result of this decision.\n“Australia and New Zealand, both as sovereign nations and as football associations, have for decades placed the utmost importance on gender equality, and have sought to promote these ideals around the world,” the letter said, reminding FIFA their governments have invested hundreds of millions in the soccer event.\nTournament organizers and government officials in both countries were said not to have been consulted, they claimed, nor offered the chance to make a counter proposal for a domestic tourism campaign.\nWood is among the few women to lead one of FIFA’s 211 member federations and also an elected member of FIFA’s ruling council which Infantino chairs.\nFIFA did not immediately respond to a request for comment.\nSaudi Arabia has made progress in women’s soccer in the past three years creating a national team and a domestic league, plus preparing a bid to host the 2026 Women’s Asian Cup.\nIn Saudi society, however, women’s freedoms are limited by strict male guardianship laws.\n“While we acknowledge some important and positive gender equality reforms have commenced in Saudi Arabia, it remains undeniable under any reasonable standard that the rights of women remain severely restricted,” the Women’s World Cup hosts wrote to FIFA.\nTony Gustavsson, head coach of Australia’s women’s national team, didn’t directly comment on the issue of the sponsorship Thursday while unveiling a squad for the Feb. 16-22 Cup of Nations tournament, but said “I know what these women stand for and what the team stands for.”\n“I’ve had the privilege to meet the Matildas alumni and everyone knows the core values of this team,” he said. Football Australia “is seeking more information and the team knows what they stand for.”\nThe “Visit Saudi” campaign was among more than 30 sponsors at the men’s World Cup in Qatar last year.\nFIFA did not formally announce that deal which became apparent through pitchside advertisements when the games started in November.\nThe Women’s World Cup is to be played July 20-Aug. 20. The United States is defending its title in the first edition of the marquee tournament expanded to 32 teams.\nIt will also be the first test of FIFA’s policy to separate broadcasting and sponsor deals for the Women’s World Cup from the men’s event. That was intended to give independence to women’s soccer and prove it had its own commercial value.\nInfantino previously defended the women’s tournament when he used the platform of the finals tournament draw in Auckland in October to criticize broadcasters for making offers for rights that FIFA deemed unacceptably low. (AP)",
  "word_count": 604,
  "scraped_at": "2026-02-14T12:14:12.926649"
}