{
  "article_id": "5ffb87c8d9f2",
  "url": "https://www.devdiscourse.com/article/education/2848191-minister-cautions-potential-external-interference-in-singapore-about-class-lessons-on-israel-hamas-conflict",
  "title": "Minister cautions  potential external interference  in Singapore about class lessons on Israel - Hamas conflict",
  "date": "20240304T100000Z",
  "domain": "devdiscourse.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Minister cautions 'potential external interference' in Singapore about class lessons on Israel-Hamas conflict\n- Country:\n- Singapore\nSingapore's education minister on Monday cautioned against the \"potential external interference\" from parties with an agenda to undermine the city state's cohesion following a recent online uproar about the Israel-Hamas conflict.\nEducation Minister Chan Chun Sing said the episode has led to some educators receiving rude and abusive comments relating to the ''Character and Citizenship Education (CCE)'' lesson package on the Israel-Hamas conflict.\nThis has led to some teachers being abused and highlights how damaging online misrepresentation can be, Chan said in Parliament during a budget debate on the education ministry's spending.\nAccording to the TODAY newspaper, Chan's response came after numerous posts began circulating on social media channels late last month, voicing concerns over what schools are teaching students about the conflict in Gaza.\nPresentation slides purportedly used during the lesson were also circulated online, including one that illustrated the conflict using an example of two students quarrelling after a football match.\nOnline commentators alleged the Minister of Education (MOE) had trivialised the conflict in Gaza by comparing the grave situation there with a football match.\nChan revealed that the slide in question was not issued to all schools, but was added by one school to help students relate to the subject matter.\nHe added that some online users have also \"selectively picked out\" a slide from the lesson presentation to assert that schools were telling students that the situation in Gaza only started on October 7.\nChan said on Monday that \"some external online parties\" have taken an active interest in the discussions surrounding the CCE lesson.\nSome have also joined in the discussions to further incite anger and unhappiness while others \"play on Singaporeans' conscience to adopt their positions\", he added.\n\"It is not difficult to guess the agenda of these external parties,\" said Chan, adding that Singaporeans should not fall prey to attempts to ''rile up our people and undermine our cohesion.\" Hamas on October 7 launched an attack on Israel, killing over 1,100 people and taking over 200 hostages.\nThe attack was followed by a military response by Israel that to date has killed over 30,000 in Gaza, mostly women and children.\nOn Monday, Chan said the cherry-picking of the slide \"insinuated that MOE was pro-Israel\" and that the ministry had characterised one side as aggressor and the other as victim. This has riled up many people, the report quoted the minister as saying.\nDebunking this point, the minister said the actual words used on that particular slide were referring to \"events since October 7\".\nIt was also preceded by another slide that emphasised how the conflict had a long and complex history.\n\"This is indeed a sobering reminder that in the online space, it is not always easy to separate those who question the material with well-meaning intentions, from those who join the fray with ulterior intent, to stir up negative emotions on an already sensitive topic,\" Chan was quoted as saying.\nThe minister said the MoE had also provided background material for teachers on the historical developments behind the conflict.\nHowever, this was meant to be shared with students who wished for more information on history as the learning objective of the CCE lesson was not to teach history.\nChan's comments come after Minister for Foreign Affairs Vivian Balakrishnan said during MFA's budget debate last week on the Israel-Hamas war when the latter said Israel's military response had ''gone too far''.\nBalakrishnan said that if Singapore allows external issues to sow discord domestically, Singapore ''will be vulnerable, we will not be independent, we will not have autonomy''.\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)\nALSO READ\nPalestinians look to salvage Gaza's history from ruins of Israel's military offensive\nControversy Surrounds U.N. Expert's Remarks on Israel\nEXPLAINER-What is the two-state solution to the Israel-Palestinian conflict?\nIsrael indicts reservist, civilian over betting on military operations\nIsraeli president ends fraught Australia visit to comfort Jews as Gaza war protests follow",
  "word_count": 680,
  "scraped_at": "2026-02-14T12:07:30.403964"
}