{
  "article_id": "6005da95fccd",
  "url": "https://www.the42.ie/tottenham-set-to-sign-e70-million-gibbs-white-6759705-Jul2025/",
  "title": "Tottenham set to sign €70 million Gibbs - White",
  "date": "20250710T194500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Updated at 21.56\nTOTTENHAM HAVE announced the signing of Ghana forward Mohammed Kudus from West Ham and look set to close in on a £60 million (€70 million) deal for Nottingham Forest midfielder Morgan Gibbs-White.\nSpurs are rebuilding under Thomas Frank and agreed on what is understood to be a £55 million (€64 million) deal for Kudus.\nThe 24-year-old leaves the Irons having made 80 appearances and scored 19 goals during two years after joining from Ajax.\nA statement on the club website read: “We are delighted to announce the signing of Mohammed Kudus from West Ham, subject to work permit.\n“The Ghana international has agreed a long-term contract and will wear the number 20 shirt.”\nNottingham Forest midfielder Gibbs-White is, meanwhile, set to have a medical at Tottenham ahead of a proposed £60m transfer.\nSpurs have met the England international’s release clause, and a deal is accelerating at pace, the PA news agency understands.\nGibbs-White joined Forest for £25m (€29m) in the summer of 2022 following their promotion to the Premier League and was instrumental in delivering European football to Forest for the first time since 1996, with seven goals and eight assists in 34 Premier League games.\nHe was on Manchester City’s radar earlier this summer, but north London now appears to be his next destination.\nForest’s late collapse in their pursuit of Champions League football has proved costly, as Gibbs-White will now swap the Conference League for Europe’s premier competition.\nLosing Gibbs-White, who has won four caps for England, is another blow to Forest, who are also set to sell Anthony Elanga to Newcastle.\nMeanwhile, Arsenal are set to make Olivia Smith the first £1 million (€1.2 million) player in the women’s game after agreeing a world-record fee with Liverpool.\nAs first reported by the Guardian, the PA news agency understands a seven-figure deal has been accepted for the 20-year-old forward.\nIt is anticipated that Smith’s move to Arsenal will eclipse Naomi Girma’s £900,000 (€1 million) switch to Chelsea from San Diego Wave in January.\nSmith, who joined Liverpool for £210,000 (€244,000) from Sporting Lisbon only last year, could have her medical at Arsenal within the next 48 hours.\nArsenal are believed to have seen off competition from several clubs — including Women’s Super League champions Chelsea — to land Smith, who netted seven times in the WSL last season.\nLiverpool were reluctant to sell their player of the season, but felt Arsenal’s offer was too good to turn down.\nIn 2019, Smith, aged 15 years and 94 days, became the youngest person to play for Canada.\nSmith is set to become the third major signing for Arsenal this summer, with the club keen to carry on the momentum of winning the Champions League.\nChloe Kelly, 27, has already signed from Manchester City, while 26-year-old Taylor Hinds’ move from Liverpool was announced earlier this week. Smith’s expected move also fits Arsenal manager Renee Slegers’ decision to bring down the average age of her squad.\nBoth Arsenal and Liverpool have been approached for comment.",
  "word_count": 506,
  "scraped_at": "2026-02-14T12:23:31.402556"
}