{
  "article_id": "6009256da4dc",
  "url": "https://www.the42.ie/eileen-gleeson-ireland-wnt-manager-6253955-Dec2023/",
  "title": "Third time a charm - Why Eileen Gleeson changed her mind on Ireland job",
  "date": "20231219T154500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE BIG QUESTION: What changed for Eileen Gleeson?\nThe new Republic of Ireland head coach had repeatedly ruled herself out of the running through her interim reign.\nHer focus was on her day job as FAI Head of Women and Girls’ football, but somewhere, amid a 100% record and Nations League promotion, there was a change of heart.\nYesterday, Gleeson was announced as Vera Pauw’s permanent successor, ”the outstanding and preferred candidate”, after a worldwide search, with her initial contract running until the end of the Euro 2025 campaign.\nAnd this morning, the 51-year-old Dubliner was unveiled at the Aviva Stadium.\nIt was a case of third time lucky, after she previously applied for the “dream job” in 2017 and 2019.\n“When I came into the process I came in pretty speedily in a very tumultuous and transitional time,” Gleeson, flanked by FAI Director of Football Mark Canham, began.\n“I was very much in the headspace of the Head of Women and Girls’ football role. It could have went any way. The team was decompressing form their first-ever World Cup qualification, there was a change of management, there was a lot of transition.\nI had to get a feeling of how it was for me as well. As the camps went on, I started to really feel the connection again with the pitch and the team and with the progress we were making and the excitement of it. I started enjoying the role more, I felt comfortable in it.\n“I started to change my mind as the process went on and throughout conversations with Marc then I expressed my interest and entered into the process.”\nCanham shed some light on that, and how a strictly interim role ultimately turned full-time.\nHe said the FAI “genuinely scoured the world,” using external assistance like a recruitment agency and data analytics company through their search. They started with a longlist of 42 applicants; whittled it down to 12 and after an extensive interview process; moved to seven and two respectively.\n“Eileen came into that process at an appropriate time and went through all the same steps as everyone did and won the role — and deservedly so,” Canham said.\n“It wasn’t a case of trying to persuade Eileen, we were very clear at the start that Eileen wasn’t going to be there, but that view changed and we speak all the time.”\nGleeson, interestingly, singled out the 1-0 win in storm-hit Albania on Halloween night as a turning point, and also revealed her applications for the vacancies previously filled by Pauw and Colin Bell.\nThis is not a new phenomenon that I’ve wanted to be the head coach of Ireland. I applied for the two previous roles and was unsuccessful, so this is an actual evolution. Was I happy in the Head of Women’s Football role? Absolutely. And then this opportunity came.\n“It has to be right for me in that moment and I felt that it was at that moment. If you’re asking for a critical, specific time where I changed my mind, it was standing in the rain in Albania. I mean, who wouldn’t want to be there?”\nThe former Glasgow City, Peamount United and DLR Waves boss also went some way in explaining why she did not publicly throw her hat in the ring amid increasing questions from the media.\n“It is a recruitment process so I didn’t feel the need to disclose that nationwide. Like all candidates, confidentiality and privacy is very important and I value that. I didn’t tell many people at all so I was hardly likely to come and discuss it in a nationwide capacity. When I said I wasn’t interested at that time or I wasn’t pursuing the role, that was the truth at that moment.\n“As the campaign evolved, so did my feelings around the role and my interest levels in the role, and here we are today and it’s the proudest time of my life.\nI’ve been involved in women and girls’ football in Ireland for over 30 years so everything I’ve done is to be the best coach and really apply, engage in continuous professional development on and off the pitch to end up in this role and here I am. I couldn’t ask for anything more.”\nGleeson – who had a stint as Pauw’s assistant – added that there was no update available on her backroom team, with appointments due to be finalised “early in the new year”. Emma Byrne and Colin Healy were her assistant coaches through the Nations League.\nIreland’s next camp is in February, with a pair of friendlies expected before the Euro 2025 draw on 5 March and the qualifiers kicking off in April.",
  "word_count": 787,
  "scraped_at": "2026-02-14T14:08:16.671266"
}