{
  "article_id": "600a826e63f4",
  "url": "https://www.canberratimes.com.au/story/8540956/aston-villa-interest-in-canberra-a-league-men-bid-as-investor/?cs=14280",
  "title": "Aston Villa interest in Canberra A - League Men bid as investor | The Canberra Times",
  "date": "20240301T024500Z",
  "domain": "canberratimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "English Premier League club Aston Villa has emerged as a potential partial backer for Canberra's A-League men's bid in a huge boost to the stalled expansion process.\nSubscribe now for unlimited access.\nor signup to continue reading\nThere's been little recent developments about the bid's attempt to find $25 million major investors to support a new A-League Men team, as well as taking on the existing A-League Women's team, Canberra United.\nA-Leagues commissioner Nick Garcia expressed his confidence in the Canberra bid two months ago amid concerns it was falling behind the other preferred expansion team in Auckland, with both teams slated to play in the 2024-25 season kicking off in October.\nGarcia said they were in \"advanced discussions with a party for Canberra\" and were \"very positive\" a deal would be finalised soon. But as weeks turned into months, there's been crickets on further progress.\nThe new owners of the Canberra men's team will be expected to take over the running of the successful women's side currently administered by Capital Football.\nThe APL and Capital Football have not yet spoken in detail about how a transition of ownership for the women's team would work, which has created uncertainty for current United players about their futures at the club.\nThe new A-League Men's owners would have to buy the intellectual property rights to Canberra United and the women's side in order to merge the teams into the same club.\nWhile rumours have swirled about who will be the major investor in Canberra's A-League bid, English media reported overnight that V Sports, the holding company that owns Aston Villa, wants to contribute funding to the venture.\nHowever, it is understood Aston Villa will only come on board once Canberra and the APL can finalise the yet-to-be-revealed major investor.\nV Sports, owned by Nassef Sawiris and Wes Edens, already have soccer investment in Spain, Egypt, Japan, and Portugal, but this would be their first push into the Australian market.\nSince V Sports fully purchased the club in 2019, Birmingham-based Aston Villa have steadily been on the rise.\nThe club was promoted from the Championship to the EPL for the 2019-20 season, and is now fourth on the table, in a position to play Champions League next season.\nThere is a bit of an Australian connection with Aston Villa, too. In 2022 the club visited Down Under as part of a pre-season tour, and this year they signed goalkeeper Joe Gauci from Adelaide United. Mile Jedinak and Mark Bosnich are two former high-profile Socceroos to play for the Villans.\nThe APL was contacted for confirmation.\nAuckland's A-League team has already announced its backing from American billionaire Bill Foley. The club has also appointed coaches and officials.",
  "word_count": 453,
  "scraped_at": "2026-02-14T12:47:31.424679"
}