{
  "article_id": "6013fae6082d",
  "url": "https://www.singletonargus.com.au/story/8944110/labor-and-nationals-vow-upgrades-for-torontos-lyall-peacock-field/?cs=305",
  "title": "Labor and Nationals vow upgrades for Toronto Lyall Peacock Field | The Singleton Argus",
  "date": "20250416T074500Z",
  "domain": "singletonargus.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Nighttime sport will return to Lyall Peacock Field regardless of the result of the federal election after Labor and the Nationals both made commitments to upgrade the Toronto ground.\nSubscribe now for unlimited access.\nor signup to continue reading\nUsually the nondescript oval is filled with footballers, cans of beer, and the waft of steak sandwiches, but on Wednesday it played host to media and politicians, who came bearing promises of money.\nIncumbent Labor Member for the Hunter Dan Repacholi firstly promised $340,000 to upgrade Peacock Field's lighting to 150 lux, enabling it to host night Newcastle Rugby League and Northern NSW Premier League soccer matches.\nJust over two hours later, Nationals leader David Littleproud, shadow minister for sport Anne Ruston and Nationals candidate for Hunter, Sue Gilroy, rolled into Peacock Field, gazumping Labor with a $2 million commitment to upgrade the ground.\nMs Gilroy said a Dutton government would deliver lighting capable of hosting night games, new toilets and inclusive facilities suitable for female athletes.\n\"Lyall Peacock Oval has been at the heart of local sport and community life in the Hunter, but the current facilities are holding our clubs back, especially when it comes to supporting women's sport and hosting major events,\" Ms Gilroy said.\n\"At the moment, the lighting on the field isn't good enough for evening use, and the facilities don't meet the standards needed to grow the game for women and juniors.\n\"This $2 million investment will change that and ensure this oval is a welcoming, modern space for everyone.\"\nLabor's $340,000 commitment to Peacock Field was part of a $2.67 million package to upgrade sporting facilities in the western and northern parts of Lake Macquarie.\nToronto Tigers Baseball and Cricket Club will benefit from a $880,000 upgrade of lighting at Water Board Oval in Blackalls Park, and $300,000 will go towards drainage at Bernie Goodwin Oval, the home of the Morisset Strikers Football Club.\nBarnsley United Football Club has $550,000 to upgrade lighting at three fields at Taylor Park, there's $300,000 for lighting improvements to four courts at Rathmines Tennis Club and $300,000 has been committed to drainage and re-levelling of Douglass Street Fields for Dora Creek Swampies rugby league.\nMr Repacholi, himself a four-time Olympic shooter, said he knows firsthand the benefits of playing sport.\n\"Sport is the glue that holds communities like this together,\" Mr Repacholi said.\n\"It also teaches our kids how to respect others, how to listen and work as a team, how to listen to coaches, how to respect coaches, and how to respect other teammates and other competitors.\n\"It teaches you to win and teaches you to lose because there are high emotions at either end of that. I think they're really good life skills, going into anything you do in life.\"\nMr Repacholi denied the funding was strategic when asked ahead of the Nationals' announcement at Peacock Field.\n\"If the Nats are here announcing the exact same thing, then that's great,\" he said.\n\"It's really good because no matter what, these guys, all these sporting clubs, get what they need.\"\nMr Repacholi said he hoped the new lighting at Peacock Field would be installed for the start of the 2026 Newcastle Rugby League (NEWRL) season.\nNEWRL club the Macquarie Scorpions and Northern NSW League One club Toronto-Awaba Stags are the main tenants of Peacock Field.\n\"It's been at least 15 years since we've had a night game here,\" Scorpions president Kevin Maher said.\n\"That's because of the standard of the light and the requirements of Newcastle Rugby League and NSWRL, and apart from everything else, it's dangerous.\n\"We're busting to be able to play night games here.\"",
  "word_count": 610,
  "scraped_at": "2026-02-14T12:19:55.762966"
}