{
  "article_id": "6025c2faf166",
  "url": "https://www.whittierdailynews.com/2024/11/30/alexander-trojans-season-filled-with-valuable-lessons/",
  "title": "Alexander : Trojan season filled with valuable lessons – Whittier Daily News",
  "date": "20241201T050000Z",
  "domain": "whittierdailynews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LOS ANGELES — This makes two Saturdays in a row that a team from Notre Dame has come into L.A. and had its way with a team from USC.\nA week ago it was Notre Dame’s women’s basketball team coming to L.A. and thumping JuJu Watkins and the Trojans, and afterward, coach Lindsay Gottlieb specifically talked of how the Irish “exposed” her team’s flaws and maybe provided a template for improvement.\nThis Saturday was a little late for going back to the drawing board for Lincoln Riley and the football Trojans, though the idea of not allowing length-of-the-field interception runbacks didn’t need to be reinforced but was anyway, in playoff-bound Notre Dame’s 49-35 victory before an announced crowd of 73,241 at the Coliseum.\nBut, in a back-and-forth game that got occasionally wild and eventually turned on a 99-yard interception return by Christian Gray with 3:38 left in the game and a can-you-top-this 100-yard return by Xavier Watts on the Trojans’ desperate attempt to draw close with 1:18 left, there were indeed lessons to be learned, and reinforced, not only going into whatever bowl game the Trojans wind up in but more permanently for those players who might return in 2025 and beyond.\nA 6-6 record probably doesn’t begin to tell the whole story. This team was tested a lot and did grow a lot, over a season that was undoubtedly a disappointment to those with championship ambitions but was heartening, by Riley’s description, in the way players handled adversity and challenges.\nThat was a large part of the message the head coach gave his team in the wake of Saturday’s disappointment. The guys who kept coming back for more demonstrated traits that don’t always come out in a season where the near misses and crushing results keep coming.\n“These are transformational years for these guys,” Riley said afterward. “These guys go through a lot on a very public stage. They put their heart and soul on the line. … Anybody that has watched us play, you cannot deny that.\n“And to go through emotionally what we have and still continue to do it, you can’t question this football team,” Riley added. “You know, there’s times we could have played better, sure. There’s times we could have coached better. Did we miss some opportunities? Yes, we did. We laid it on the line every single week and my message to the guys was, you continue to do that in your life, you continue to do that in this football program, the things you want will come.”\n“And they needed to walk out of that locker room with their heads held high,” Riley continued. “If you quit, if you give in, if you crack, if you fall apart, then you ought to walk into the locker room with your head down. This team has no reason to put their head down. And I said, I’m proud to coach this team. I’m very, very proud.”\nRiley said there was another reason why he expressed pride in his group and talked of how he enjoyed coaching them. Any one of us who has been on or around a team that has gone through a losing season, or one below expectations, knows that the locker room can turn toxic if players allow it to.\nThere have, in fact, been coaches who have confided that they didn’t want to have any sort of postseason gathering for a team because it wasn’t very pleasant to be around. (Trust me, I’ve covered a few.)\nThis team?\n“I think this group really cared about one another and they really didn’t want to let each other down,” Riley said.\n“I mean, you coach long enough, you’re going to be part of teams at times that don’t win some games or go through tough moments, and the majority of times I’ve been through that, at some point there’s finger-pointing, there’s some dissension, something either I had to do as a coach or watched other head coaches do when I wasn’t a head coach, that they’ve got to get between that or stop that.”\n“That never happened on this football team, not one time,” Riley added. “And that’s why I knew every week we were going to show back up and we were going to keep rolling, and I knew we’d have a chance to make a run here at the end.”\nFrom here, of course, there’s plenty of uncertainty, as there is in seemingly every college program.\nThere are 34 seniors on USC’s roster, 15 of them on the two-deep, who were honored during Senior Day ceremonies before the game. There are many others who, in the new world of unlimited free agency, have choices via the transfer portal and likely will be considering NIL opportunities. For any coach, re-recruiting current players can be as critical as looking for help from the outside. Even assembling a roster for a bowl game carries a certain amount of uncertainty.\nBut re-recruiting, and retaining, the guys who provide that character and that leadership is a good start. And if they can come up with a roster led by guys for whom this isn’t just the next stop, their chances might be even better. Like cornerback Jaylin Smith, who joined the Trojans in 2021 out of Bishop Alemany High and came out of the Coliseum tunnel for the last time Saturday.\n“It’s surreal,” Smith said. “I just remember being, like, moving into the village yesterday, so I feel like the memories … it all ain’t hit me yet. But I just look at all the memories, and, you know, the tradition and the culture, everything that SC stands for. I love everything about USC, and (I’m) just blessed to be a part of this, and blessed to stay home, you know, to have the opportunity to showcase and be here.”\nNot a bad recruiting (or re-recruiting) spiel.\njalexander@scng.com",
  "word_count": 983,
  "scraped_at": "2026-02-14T13:17:45.678214"
}