{
  "article_id": "603a4f638c6a",
  "url": "https://www.westmeathindependent.ie/2025/11/28/this-award-is-also-for-my-team-mates-kayleigh-shine/",
  "title": "  This award is also for my team mate : Kayleigh Shine",
  "date": "20251128T170000Z",
  "domain": "westmeathindependent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "‘This award is also for my team mates’: Kayleigh Shine\nKayleigh Shine's consistent contribution to the success of the Athlone Town’s women team was recognised at the Westmeath Community & Sports Awards when the defender was announced as the overall winner in the Sports award category.\nShine was also the winner of the 'Outstanding Achievement of the Year' sports category.\nThe Drum native played a key role as Athlone completed the double by winning the Women’s Premier Division title and the Women’s FAI Cup. She has now won two Women’s Premier Division medals and two Women’s FAI Cup medals with Athlone.\nThe local star was selected on the 2025 SSE Airtricity Women’s Premier Division Team of the Year. Shine was also named on the PFA Ireland Women’s Premier Division Team of the Year, with this selection voted for by the players.\nShine continues to be an influential presence on the Athlone Town team and has been part of the squad since the club joined what was then known as the Women’s National League in 2020.\nSince establishing herself with the senior team, she has made over 100 appearances for the club and was virtually ever present in Athlone Town’s successful league campaign, missing just one game. She also started all six of the club’s European matches.\nDuring an exciting adventure in what was the club’s first foray into Europe in women’s football, Athlone defeated the champions of Wales (Cardiff City), Croatia (ZNK Agram) and Serbia (Red Star Belgrade). A defeat to Icelandic champions Breidablik ended Athlone’s hopes of progress in the Champions League, and Athlone subsequently lost out to Glasgow City in Women’s Europa Cup. Yet this adventure was just another chapter in a historic season which culminated in double glory.\nShe described winning the overall sports award as an \"honour\", the accolade also reflecting the contribution of her team mates to the club's double success.\n\"There have been so many great sporting achievements from all the category nominees throughout the year so it is an honour to be chosen as the overall award winner. This award is also for my team mates as without their commitment we would not have achieved the double this season,\" Kayleigh said.\nThe defender said the commitment she and her team mates give during each season is \"tough\", but they are willing to make the sacrifices necessary to achieve success.\n\"We go from January to October. It is tough but we are willing to make those sacrifices as a team and it is great when it pays off with the success we had this season,\" Kayleigh added.\nDescribing the season as \"momentous\", Kayleigh said the aim was to achieve \"back-to-back\" Premier Division and FAI Cup titles.\n\"We have built a team of incredible players to get to where we are today and it's great to see that so many have re-signed for next season. When I first joined the club in 2020 I never thought we'd be in this position.\n\"No team has ever won the league and cup double in successive seasons and I don't see any reason why we can't do so next year,\" Kayleigh concluded.",
  "word_count": 524,
  "scraped_at": "2026-02-14T12:50:50.208767"
}