{
  "article_id": "603f3ec94018",
  "url": "https://www.highschoolot.com/story/from-the-spot-state-s-strongest-conference-los-jets-legacy-the-academy-impact-lingers/21056933/",
  "title": "From The Spot : State strongest conference , Los Jets legacy , the academy impact lingers",
  "date": "20230920T184500Z",
  "domain": "highschoolot.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "From The Spot: State's strongest conference, Los Jets legacy, the academy impact lingers\nWelcome to From The Spot, HighSchoolOT’s new soccer column for HSOT Insiders that will be weekly during the boys and girls soccer seasons.\nI’ll use this column to shed light on high school soccer trends across North Carolina, as well as my observations as I continue year No. 16 of covering high school sports in this state.\nThe column will always be broken up into six parts, though what constitutes each will change from week to week. They are: the kickoff, first half, second half, extra time, golden goal, and PKs (the column name kind of dictates we end on that, after all).\nKickoff — The Los Jets legacy lives on\nAs I bounce around the state covering soccer, I've developed a particular affinity for the 2A class, and you can go back almost two decades for why.\nIn 2004, Jordan-Matthews became the first team in any sport to win a N.C. High School Athletic Association championship with a predominately Hispanic starting lineup.\nIt's not remembered in the same vein as the NCHSAA's 1968 boys basketball championship, which pitted an all-white New Hanover team and an all-black team from West Charlotte, and is credited as having ushered in a desegregated era in much the same way the 1966 NCAA championship did with Kentucky and Texas Western (now UTEP).\nBut it was a seminal moment for the NCHSAA nonetheless.\nIt's no longer unusual to see a team with that sort of make-up making the state final, especially in the 2A class — schools with about 700-1,000 students. These schools are in a soccer sweet spot where they avoid the metro areas that dominate 4A and, to a lesser extent, 3A. But at the same time, they have decent numbers and can field a team with depth that doesn't have to move players too far out of natural positions.\nFor big home matches at some of these schools, you'll find the excitement of high school football's Friday night (albeit a smaller crowd) mixed with imported fervor and international flair — \"Let's go boys!\" quickly followed up with \"Vamos chicos!\"\nIt probably would've felt out of place in 2004, but it doesn't anymore. It's just another example of an atmosphere that makes high school sports special.\nCredit the Los Jets for making it possible.\n1st half — The academy impact on HS soccer\nNo other sport in the state gets hit the way boys soccer does by the demands of club and non-scholastic sports.\nAnd note the specificity: boys soccer.\nWe have a running list of high school boys soccer seniors from North Carolina who have committed to play at the next level, with a catch — they must still competing for their high school team this year.\nThis isn't unusual. In the last two seasons, the HighSchoolOT all-state boys soccer team (2022 and 2021 links here) has featured three players who were committed at the time of their honor. A handful committed after the season, like 2021 state player of the year Aidan Payne of New Hanover did, eventually going to N.C. State.\nCompare that to the girls' game, which had 13 Division I recruits on this spring's HSOT first team alone (the two that were not were sophomores).\nWouldn't it be cool to open this year with 13 Division I boys soccer recruits playing for their high schools?\nBoys basketball can sort of relate to this problem. There's been added pressure on the best of the best to transfer out of a traditional high school and play for a non-scholastic team. But even then, it's a numbers game, and a soccer academy trying to have its best team needs more depth than a non-scholastic basketball team does.\nThis explains why, back when I did an all-decade team for the 2010s, the college commitments changed from Wake Forest, UNC and UVA at the start of the decade to UNC-Asheville and Tyler Junior College in the latter half.\nA quick look at some of the top NCAA soccer programs explains why academies are important: sometimes U.S. players are competing against international players for scholarships.\nThat look also shows something else: a lack of Division I programs compared to those on the women's side. With fewer spots available in the first place, the urgency to do something that separates themselves from their peers ramps up.\nBut at the same time, many of those who give up their high school careers for academies end up committing to Division II and Division III schools that would've taken them no matter their path.\nAdd that to the U.S. Men's National Team's stagnation on the world stage, and it makes you wonder what's been truly accomplished by this approach to player development.\n2nd half — The strongest conference in the state is...?\nThere are three emerging candidates for this, and no one else seems all that close.\nFirst, let's go ahead and define what I mean by strongest conference: it does not mean every single team must be a playoff-caliber team. But it does mean that the first 5-6 teams in the conference standings should have good records, some nice wins, and against decent competition.\nThere's the Raleigh-centric Cap-6 Conference (Athens Drive, Broughton, Cardinal Gibbons, Enloe, Leesville Road, Sanderson), the Southwest Wake Athletic Conference (Apex, Apex Friendship, Cary, Green Hope, Green Level, Holly Springs, Middle Creek, Panther Creek), and the north-of-Charlotte Greater Metro 4 Conferece (A.L. Brown, Cox Mill, Hickory Ridge, Lake Norman, Mooresville, South Iredell, West Cabarrus).\nLet's look at each one's case:\nCap-6: The \"worst\" team has a winning percentage higher than 60! Three are currently ranked in the HSOT top 10. Only Sanderson hasn't spent at least one week in the top 25.\nSWAC: Four teams in the HSOT top 13, only Apex, Cary, and Panther Creek have not spent at least one week ranked in the top 25 this year.\nGM4: Three teams in the HSOT top 11, six are in the top 25. Only South Iredell has not spent at least one week ranked.\nIf you like true top-to-bottom strength, the answer is the Cap-6. If you value top-end teams, it's the SWAC. If you value parity, it's the GM4, because who knows what the final standings will look like.\nLike all conference arguments, the playoffs will be what settles this argument. The Cap-6 and SWAC are no strangers to the final, but a GM4 team hasn't made the final since 2007.\nExtra time — The returning finalists and remaining unbeatens\nLast year's state finalists are more or less still hanging around. These are their records and HSOT rank as the week began.\n- 4A champ Cardinal Gibbons: 5-2-1, ranked 6th\n- 4A runner-up Weddington: 6-0-2, ranked 1st\n- 3A champ Hickory: 6-2-2 (7th in 828 area code)\n- 3A runner-up Jacksonville: 7-3-2 (3rd in 910 area code)\n- 2A champ Owen: 6-1-2, ranked 16th\n- 2A runner-up Clinton: 8-1 (9th in 910 area code)\n- 1A champ Christ the King: 3-6\n- 1A runner-up Rosewood: 4-3\nEvery team above, save for perhaps the 1A ones, should still be considered a state title threat if they catch fire at the right time. And even in 1A, you have to remember that the field lacks top-end dominance (Christ the King over the past two seasons was an anomaly) and those two teams could still, under the right circumstances, make a run again.\nWeddington in particular brought back so many contributors from last year's team that they were our preseason No. 1. Seeing them live against South Mecklenburg, it's not hard to envision a team that finishes that well being a tough out.\nWeddington is one of a handful of teams that remains unbeaten as we enter the second half of this week's schedule.\nIn the NCHSAA, they are:\n- North Moore 7-0-1\n- Mount Airy 8-0\n- Elkin 7-0-1\n- Thomas Jefferson 6-0-2\n- Midway 9-0\n- Research Triangle 9-0-1\n- Raleigh Charter 5-0-1\n- Jordan-Matthews 5-0-2\n- Salisbury 9-0-1\n- Patton 9-0-3\n- First Flight 6-0\n- Triton 11-0\n- Ben L. Smith 3-0\n- Enloe 8-0-1\n- Green Level 6-0-2\n- West Forsyth 9-0-2\n- Lake Norman 8-0-2\n- Weddington 6-0-2\n- A.L. Brown 7-0-3\n- Myers Park 3-0-2\nA few others from other associations are:\nThe Fayetteville Crusaders (5-0) and New Life Camp (4-0-1) from the N.C. Homeschool Athletic Commission; Matthews Christian (15-0), Fellowship Baptist of Durham (6-0-1), and Tabernacle Christian of Hickory (6-0) from the N.C. Christian Schools Association; Fayetteville Academy (9-0), Gaston Day (8-0), and Wesleyan Christian (11-0-1) of the N.C. Independent Schools Athletic Association.\nGolden goal — Stats that may only interest me\n- Daniel Sykes of Overhills is averaging 20.3 saves per game! Usually this is a terrible stat for the team because it means you're giving up a lot of goals and you're probably losing a lot. Somehow, Overhills has managed all right, going 4-4-1 and outscoring opponents 25-19. If they can best Pine Forest, they may even get a 1-seed in the 4A playoffs.\n- Fernando Hernandez of Southwestern Randolph is second in the NCHSAA with 26 goals, helping the Cougars improve from just 7-12-2 last year to 10-2 this year already. You can tell from our coverage last week that he's a pretty well-liked teammate out in Ulah.\n- Goals allowed is always an important stat, and these schools are among the state's best: Enloe (4 goals allowed in 9 games), First Flight (1 goal allowed in 6 games), Owen (3 goals allowed in 9 games), and Wesleyan Christian (4 goals allowed in 12 games).\nPKs — The thing(s) I'm looking forward to\nThe 10th annual Wake County Cup final is on Thursday and HSOT Live will stream it online! This year's final will pit host Leesville Road versus Holly Springs.\nI love the Wake County Cup and wish there were more tournaments like it — even in other sports.\nThe eight-team field typically features the top two teams from the previous year's Cap-6, SWAC, Northern Athletic, and Greater Neuse River Conference. However, there are sometimes substitutions as teams can't work it into their schedules. Each team plays three games of pool play, followed by a final game.\nThe championship is the only match that can feature two teams from the same conference — all others can be swapped around.\nThe tournament's longevity — it started in 2013 — is also noteworthy in a world where high school competitions start and end quicker than the latest forgettable fashion fad. There's something about the format and the way you're entered into it — making it earned from the year before instead of an invitation — that makes it special.\nApex won last year, while Leesville Road most recently won in 2021. Cardinal Gibbons (2019, 2017, 2014), Green Hope (2018, 2016), and Apex (2022, 2015, 2013) have won all of the non-Leesville titles. Holly Springs is making its first appearance in the final.\nrelated\n•Credits\nCopyright 2026 by Capitol Broadcasting Company. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.",
  "word_count": 1851,
  "scraped_at": "2026-02-14T13:09:28.847223"
}