{
  "article_id": "60539b71b626",
  "url": "https://www.afl.com.au/news/1388386/footy-family-and-fun-the-true-story-behind-these-legendary-moments",
  "title": "Footy , family and fun : The full story behind these Legendary Moments",
  "date": "20250904T014500Z",
  "domain": "afl.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "IF A PICTURE is worth a thousand words, the brilliant photography brought to life through the AFL's Footy Focus series tells the story of Australian Football.\nSince 2019, thousands of amateur photographers have submitted their work from local matches and grounds right around the country, showcasing the essence of the game and highlighting the important role it plays in the community.\nFooty Focus is back for 2025! Submit your entries here.\nTo celebrate all that makes the game great, we have revisited some of the best photos from Footy Focus and told the story behind the story.\nThis is Toyota Legendary Moments, celebrating the game at the grassroots level.\nA family affair\nPictures: Blake Parry\nTHERE was a lot going on after the final siren sounded on Tony Notte's 300th WAFL game with Swan Districts.\nBut the noise of the home crowd, his elated teammates who had just chaired him from the ground, and wall-to-wall well-wishers faded into the background when Tony locked eyes on his proud wife Jess, and two-and-a-half-year-old daughter Alaska perched on her shoulders.\n\"It was a bit of a surprise, actually, when I saw them,\" Tony recalls of the beautiful family moment captured by photographer Blake Parry.\n\"I'd started walking off, and was thanking all the people that had come out, and then they just popped up straight in front of me.\n\"I think that was kind of a little bit of the shock in the photo ... I didn't know exactly where they were going to be.\n\"It was a big build up for the whole day, and the expectation is to win those games.\n\"I was just so happy we actually got the win, and then to see those two after the game. It just made me really happy, and it just topped off the day.\n\"That photo just brings a smile to my face every time I see it.\n\"It's not so much about the game, it's just Alaska's face that gets me more than anything ... just that big smile.\n\"That feeling was always something that I wanted to be able to share after having kids, to be able to bring them to the footy and let them enjoy it. So, to see her smile and like that ... she loves coming to the footy.\n\"She knows that footy means getting an ice cream and getting to see Daddy run around the ground.\"\nThe 2024 season was a big one for the Swans - who made a preliminary final - and for Tony, whose 300th game was quickly followed by another major milestone when he passed Bill Walker's 305 matches to become the club's all-time record holder.\nIt was an amazing accomplishment, made even more impressive given Tony played his last three seasons living in Busselton, a two-and-a-half-hour drive from Perth, where he had moved to pursue a career in the wine industry.\n\"That's the thing about that little period, I knew all these moments were coming all very close to each other,\" he says.\n\"The club was building it up, and there was stuff going on left, right and centre there for a while.\n\"I felt a bit like I was the centrepiece, and I was just trying to maybe just get through it a bit so that I didn't have the limelight on me as much.\n\"So many people helped me over my career, and you're nervous because you really want to win those games for them, really. And I think I was more looking forward to the celebrations after with everyone. That's why I was so happy to share those moments with everyone.\n\"They were great milestones, and obviously something I'm very proud to have achieved.\"\nThe much-loved veteran played on in 2025 as he aimed for an elusive premiership. But with finals out of the picture for the injury-hit Swans, Tony didn't feel the same joy after a win against East Fremantle in June, and he knew it was time to retire.\nThe three-time club best-and-fairest winner played his 323rd and final game, taking him to fourth on the all-time WAFL games played list, at the beloved home ground of the club that had been such a huge part of his life.\n\"I couldn't have asked for a better send off than what I got that day,\" he says.\n\"It was obviously really hard leaving a place that I'd grown up at - it was my second home, pretty much.\n\"So, leaving the club and not being able to rock up and see so many familiar faces was probably the hardest thing.\n\"We didn't get the win, but just the day itself and what the club did for me, and the way they sent me off ... it made me feel very special and very honoured.\"\nA premiership that meant more than a game\nPhotos: Jordan Sacchetta\nDAREO Rogers moved to the Murrumbeena Lions to rediscover his love of football. He did that and so much more.\nThe raw emotion of Jordan Sacchetta's picture of Rogers' goal celebration late in the Lions' drought-breaking 2024 Southern Football Netball League Grand Final triumph is there for all to see.\nBut the story behind that brilliant shot began in more difficult circumstances 12 months earlier.\nRogers had to sit in the stands and watch his team, who hadn't won a flag in 21 years, lose the 2023 Grand Final after he was ruled out for a yellow card infringement in the prelim, something that still doesn't sit well with him.\n\"It killed me because I was sitting there watching the boys go out and me not being able to contribute or fight and go to war with them ... I just felt helpless, really helpless,\" he says.\n\"I remember sitting there with my family and I said to them, my grandfather in particular, 'I never want to feel like this again, and I'll do everything I can to make sure that you watch me with the premiership medallion around my neck in 12 months' time'.\"\nRogers shared a special bond with his grandfather, known as Toto through their Hungarian heritage, who never missed any of his games.\nAs much as he was told he didn't, Dareo felt he had let down the club he'd fallen in love with by missing the 2023 decider.\nHe came back early and threw himself into pre-season like he never had before and was closing in on the 2024 season when tragedy struck, with Toto unexpectedly passing away.\n\"I just said to myself, and I said to the club (that) everything about 2024 is going to be about him,\" he remembers.\n\"He motivates me, and he's going to motivate me to win this premiership.\"\nRogers followed up with an impressive season that helped steer the Lions into another Grand Final.\n\"It came to the Grand Final morning, I was just so excited, and I felt like nothing could ever go wrong on that day,\" he says.\n\"I felt like we were going to win, and I truly believed there was just something in the air where I felt so relaxed and no nerves.\n\"I was just like, 'We're going to do this'.\n\"And it was (Toto) driving me ... I truly believe it.\"\nWhatever was driving Rogers that day, he had a big influence on the game, kicking four goals and winning the medal for best on ground.\nHe has special memories of the goal he kicked that was captured in Jordan's picture, a photo he says has significant meaning to him.\n\"In the last quarter, I just felt these goosebumps of emotion,\" he says.\n\"With that goal, I remember it was a front and centre ball which came in, and I was like, 'I'm gonna get this'.\n\"And I remember our full forward just tapped it down, I've picked it up off the ground, I snapped it on my left foot, and that was my fourth goal for the Grand Final.\n\"I just grabbed the jumper, and it was just pure joy, relief, celebration ... I just honestly felt everything over the last 12 months was built from sitting in the stands, missing out on the Grand Final and being helpless, to losing my grandfather, to then playing in a game and showing up all year and knowing every single week that I was just driving for this one goal.\n\"And in that last quarter, just all the emotion let out and I just grabbed that jumper.\"\nRogers has fond memories of the kind words teammate Mitch Virtue, who is also in the picture, in that moment.\n\"He goes, 'We're premiership players, brother',\" he recalls.\n\"He was just awesome, and him being in that photo too just makes it more special, that there's someone there who I love playing with to celebrate that moment too.\"\nMore heartwarming moments came after the final siren sounded.\n\"I just looked at the sky first, when I dropped to my knees and put my arms up (and said) 'we've done it',\" he says.\n\"And then from there, some of my family members came over, and my partner, I just gave her a big hug. I just bawled my eyes out. My Dad said, 'Mate, I'm so proud of you'.\n\"Then I saw my grandmother and I ran over, jumped the fence and gave her a hug, and she goes, 'He was always with you, he was always here'.\n\"It was just unbelievable.\"\nFrom the ground up\nPhotos: Jayden Humphris\nMOLLY O'Toole was always proud of her deep family connection with the South Croydon Football Club. But there was one thing missing.\nMolly desperately wanted to pull on the club's storied red, white and blue guernsey, but South Croydon, a club in Melbourne's outer eastern suburbs, didn't have a women's team.\nBut one casual chat triggered a chain of events that would culminate in Molly's dream coming true.\nShe was talking to then club president Cathy White early in 2017, when the topic of women's football came up.\nOne thing led to another and 12 months later, after a lot of hard work and determination, the inaugural South Croydon women's team entered the Eastern Football League.\n\"I was pretty lucky with the club that everyone was on board,\" says Molly, a driving force behind the women's program.\n\"We wanted to create a program for women, to create a community where people can come and just have some fun.\n\"I always loved sport, always wanted to play footy, and always wanted to play for the club.\n\"My parents were on the committee, and my two brothers played, so our family is heavily involved in the club.\n\"I always had that love for the club, and just always wanted to put on the jumper.\n\"So, essentially, I was just like, 'Okay, let's create a team'.\n\"Some clubs had some backlash from people, and weren't as supported, but we had none of that. The men are super supportive.\n\"Everyone gets around each other, which is great.\"\nIn just their second season, South Croydon's Premier Women's side won their inaugural premiership and followed it up with another in 2024.\n\"I am very proud of the program ... to win a Grand Final in our second season was just unbelievable,\" Molly says.\n\"There's no better feeling.\n\"So, to have won two Grand Finals is a really great achievement for the program.\"\nPerhaps even more satisfying than that, however, is that South Croydon's women's program is flourishing, with a junior pathway for girls to follow their AFL dreams through the age groups up to the senior club, which is known for its inclusive environment where all are welcome.\nMolly, who serves as club secretary, plays Reserves these days, but was proud to have played in the Premier team with her younger sister, Sarah, who along with their two older brothers, Luke and Josh, have all been on-field leaders at the club.\nWith Mum and Dad, Wendy and Damien, both long-time volunteers, Molly's family are Bulldogs through and through.\nThat family connection, strong support and pure joy of playing the game she loves with her teammates is what comes to mind for Molly when she looks at the picture captured by former South Croydon player Jayden Humphris after a win during the 2021 season.\n\"The atmosphere in the rooms is just unmatched, and it's unreal to have all that support after a win,\" she says looking at the picture.\n\"One of my brothers is actually in the corner as well, it's so special to have all the boys getting around after singing the song, and we do the same for them.\n\"The majority of those girls are still at the club, maybe three or four in that photo have moved on through work or injuries, so they don't really play anymore. But they still get around the team when they can and come up to support.\n\"Our president at the time, Cathy, she was our first female president of the club, her daughter's in that photo too, so it's pretty special for her.\n\"Cathy actually pulled on the jumper for one game too, alongside my mum, so we all got to play together, which is pretty cool.\n\"Back in our first year, we were quite short in numbers, so we had a few of the mums pulling the jumper, which was great.\n\"I'm pretty proud of where the program is at, with all the support that we get from everyone, and just to have that community of women where we can all just come together.\n\"We just love playing together.\"",
  "word_count": 2263,
  "scraped_at": "2026-02-14T12:43:44.236523"
}