{
  "article_id": "605a617cfaf5",
  "url": "https://woub.org/2025/08/08/ohio-director-of-athletics-julie-cromer-set-to-depart-ohio-university/",
  "title": "Director of Athletics Julie Cromer leaving Ohio University",
  "date": "20250808T234500Z",
  "domain": "woub.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sports\nDirector of Athletics Julie Cromer is leaving Ohio University for a role at LSU\n< < Back toATHENS, Ohio (WOUB) — Ohio University will look for a new Director of Athletics after announcing that Julie Cromer will depart for a new role at LSU. The announcement comes six days before the first official athletic competition of the fall sports season.\nCromer began her tenure as Ohio University’s Director of Athletics on August 31, 2019 and saw consistent on the field success with three MAC Championships in Football (2024), Women’s Soccer (2023) and Men’s Basketball (2021). She oversaw success off the field with a record 94% graduation rate, the second highest in the MAC.\nDuring her nearly six years with the athletic department, Cromer received individual awards for her work with the Bobcats. She was awarded 2024 Athletic Director of the Year by the (National Association of College Directors of Athletics. In 2023, Cromer was named Nike Executive of the Year by Women Leaders in College Sports.\nCromer helped secure sport-specific funding for facility upgrades including at Peden Tower, the Ohio Softball field, Bob Wren Stadium and in the Convocation Center.\n“Julie has been a transformative leader for Ohio Athletics, and her impact on Bobcat Athletics and her leadership within the national athletics community leave a lasting legacy,” said Ohio University President Lori Stewart Gonzalez. “She brought a vision rooted in integrity, student success, and competitive excellence and she strengthened our program across every dimension. We are grateful for her leadership and wish her the very best in her next chapter.”\nPending approval from the LSU Board of Supervisors, Cromer will serve as the Executive Deputy Athletic Director and Chief Operating Officer for LSU Athletics.\n“Julie is a widely respected leader in college athletics who brings tremendous experience at the highest levels to our university,” LSU Director of Athletics Scott Woodward said. “Not only is her perspective as an established athletic director invaluable to charting our path forward, but her previous experience at the executive level impacting several institutions will help drive our continued growth and success. Julie’s expertise and vision will be major assets to LSU as we navigate this transformational time in college athletics, and we’re excited to welcome her to Baton Rouge.”\nA national search for Cromer’s successor is underway, with the goal of appointment during the academic year.",
  "word_count": 392,
  "scraped_at": "2026-02-14T14:18:43.679456"
}