{
  "article_id": "6073558fb0b1",
  "url": "https://www.broadcastnow.co.uk/broadcasting/itv-renews-lionesses-rights-until-2029/5198560.article",
  "title": "ITV renews Lionesses rights until 2029",
  "date": "20241028T141500Z",
  "domain": "broadcastnow.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The men’s side is also shown by the free-to-air broadcaster\nITV has renewed its agreement with the FA to broadcast the England women’s football team, in what the FA describes as a, “record deal”.\nThe free-to-air broadcaster has shown the Lionesses on its platforms since 2021, and will continue to do so until at least 2029 - the previous deal would have finished at the end of this season. It will air all qualifying fixtures for the FIFA Women’s World Cup 2027 and UEFA Women’s Euro 2029, as well as the team’s UEFA Women’s Nations League campaigns and all international friendlies.\nThere is a commitment for more than half of the matches each season to be shown on ITV1, with the remainder available on ITV4 and ITVX\nITV also broadcasts the men’s side’s qualifiers, Nations League fixtures and friendlies after a deal agreed last year, and will share the Women’s Euro 2025 with the BBC next summer.\nNiall Sloane, ITV director of sport, said: “We are delighted to continue our relationship with The FA and the England Women’s National Team. This is an exciting time for the Lionesses’ and we are proud to show our support by showcasing the matches free to air on ITV.”\nJames Gray, the FA’s commercial director, said: “We’re delighted to announce this new agreement which maintains ITV as the home of England senior teams for the coming years. ITV have given the Lionesses brilliant backing since 2021, overseeing a truly historic period for the team and the whole of the women’s game. This record deal shows our shared commitment to grow the team’s profile even further and give them the best possible platform to continue to inspire the nation. We thank ITV for their support and know that millions of fans across the country will continue to enjoy tuning in to their excellent coverage as the team seek to make more history.”",
  "word_count": 317,
  "scraped_at": "2026-02-14T13:05:28.768921"
}