{
  "article_id": "60add8c7a9c7",
  "url": "https://www.azernews.az/region/247911.html",
  "title": "FIFA backs expanding World Cup to 64 teams",
  "date": "20250925T073000Z",
  "domain": "azernews.az",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA backs expanding World Cup to 64 teams\nby Alimat Aliyeva\nThe International Football Federation (FIFA) is considering increasing the number of participating teams in the 2030 World Cup from 48 to an unprecedented 64 teams, Azernews reports.\nThis expansion proposal was put forward by Alejandro Dominguez, president of the South American Football Confederation (CONMEBOL), and is expected to receive strong support from FIFA.\nThe upcoming 2026 World Cup, set to be hosted by the United States, Mexico, and Canada, will feature 12 groups of four teams. The top two teams from each group, along with the eight best third-placed teams, will advance to the round of 32 (1/16 finals). This format means teams will need to play eight matches to claim the championship.\nFor the 2030 tournament, FIFA’s proposed format involves 16 groups of four teams, with the top two teams from each group progressing directly to the round of 32. Similarly, teams will need to play eight matches to win the title, despite the larger number of participants.\nUnlike the 2026 event, the 2030 World Cup will be uniquely hosted across six countries: the opening matches will take place in Uruguay, Paraguay, Argentina, and Spain, while the main stages of the tournament will be held in Portugal and Morocco. This multi-continental hosting is intended to celebrate the centenary of the first World Cup, which was held in Uruguay in 1930.\nIn a related move, FIFA recently announced the expansion of the women’s World Cup in 2031 from 32 to 48 teams, reflecting the growing popularity and competitiveness of women’s football worldwide.\nThe expansion to 64 teams would make the 2030 World Cup the largest in history, potentially increasing global fan engagement and providing opportunities for more nations to showcase their talent on football’s biggest stage.\nHere we are to serve you with news right now. It does not cost much, but worth your attention.\nChoose to support open, independent, quality journalism and subscribe on a monthly basis.\nBy subscribing to our online newspaper, you can have full digital access to all news, analysis, and much more.\nYou can also follow AzerNEWS on Twitter @AzerNewsAz or Facebook @AzerNewsNewspaper\nThank you!",
  "word_count": 361,
  "scraped_at": "2026-02-14T12:36:20.990643"
}