{
  "article_id": "60b0e5a3ddb4",
  "url": "https://prostamerika.com/fulham/",
  "title": "",
  "date": "20240625T043000Z",
  "domain": "prostamerika.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Many players are legends at their clubs. Some ascend to spending long enough at two clubs to be legends twice. Jimmy Conway, who died last week, was legend enough to be honored in two countries on different continents.\nIn his tribute on this site, former Prost Portland Editor Brennan Burns explains what elevated Conway among his playing counterparts when the NASL closed its doors:\n“…. what stands out in Conway’s achievements from his counterparts is the lasting impact his organizational skill brought to youth development, from the recreational to the most competitive levels across the state and surrounding region.\n“Conway’s establishment of coaching credentialing programs and the youth development setup via his leadership tenure at the Oregon Youth Soccer Association paved the way for the profound success the current Timbers enjoy, right down to the academy structure and feeder clubs that foster the advancement of youth players today.”\nIt’s not just in Portland that Conway’s contribution has affected those yet to be born at the time he graced the wing.\nI was at Fulham on Saturday to watch the promotion chasing Cottagers face Barnsley. I didn’t select this match because of Jimmy’s death. I selected it because of Jimmy’s life.\nMy love of football began when I watched my first ever live game.\nIt was November 16, 1974 when Fulham hosted Sunderland in the days when the second division was still called Division Two. These were the line ups that day:\nAmong the names football historians might recognise on the Fulham side are Bobby Moore who captained England to their only World Cup and Allan Mullery who won 35 England caps.\nOn the Sunderland side, Ian Porterfield went on to manage clubs like Aberdeen, Chelsea and Sheffield United.\n“If you grew up playing the game in the Portland area, odds are good that you were coached by someone trained by Jimmy, if not by Jimmy himself.”\n–Timbers Army\nAmong the other heroes who so enthralled a ten year old kid was Fulham and Republic of Ireland winger Jimmy Conway. He left for Cascadia in 1978 where his impact as Burns explained in his article is still being felt today.\nNineteen years later, I made the same journey and I often wondered if the soccer passion that I found in the entirety of Cascadia would have existed without Jimmy Conway.\nOne man who knew Conway very well is former Timbers mascot Jim Serrill.\nHe pointed us to the emotional tribute given by the Timbers Army before giving his own:\n“Through his work, he was able to identify individuals for higher level training and ultimately was responsible for licensing well over 1,000 soccer coaches, truly creating an army of soccer instructors in and around Oregon.\n“Forget teaching someone to fish: if you teach them to teach, you can benefit an entire community. This was perhaps Jimmy’s greatest gift to all of us.\n“If you grew up playing the game in the Portland area, odds are good that you were coached by someone trained by Jimmy, if not by Jimmy himself.”\nSerill added this from his own, by his own admission, broken heart:\n“Every time I pass by a Soccer pitch filled with children, I will look to the Heavens and give Jimmy Conway a wink and a smile.”\nThat passion for the sport in Cascadia prompted me to start this site.\nWe started in Seattle while Seattle Sounders, then as now owned by Adrian Hanauer and coached by Brian Schmetzer, played in the USL.\nThe site quickly became Cascadia focused, even though the Sounders rose to Major League Soccer leaving Portland Timbers and Vancouver Whitecaps momentarily behind in the minor leagues.\nAs I began to make repeated visits to Portland, one name kept coming up in conversation – Jimmy Conway.\nDespite declining health limiting his interactions with the younger public, his name was spoken of in hushed tones similar to the way West Ham fans still revere Bobby Moore and my fellow countryman Jimmy Gabriel is by Sounders fans.\nPeople who’d never even seen them play spoke and still speak of these men with extraordinary reverence. You can see evidence of the respect for Jimmy at first hand in the video further down this article and the match report below.\nWhen back in London, I never miss a chance to return to Craven Cottage, the stadium where my love affair began. I selected the Fulham v Barnsley game some weeks ago, well before news of Jimmy’s death broke.\nI first became aware of his passing when I opened my email to see the official announcement from the Portland Timbers. My first thought was naive in the extreme; “I wonder if Fulham are aware of what’s happened in Oregon overnight and whether they’ll commemorate it.”\nThe doubt in my mind was brief.\nAs I checked the Fulham site for team news for my match preview, I saw a wonderful tribute to the Irishman. As well as statistical details of his playing career, one sentence stuck out from that article:\n“Due to his decade-long spell in SW6, Jimmy was offered a testimonial, but turned it down as he felt that the Fulham supporters had given up enough of their money keeping him in a job over the years.”\nIf that was the mark of an incredible man, so was the fact that through 15 years of playing (443 games), he never once received a booking or a red card. That respect was replicated by the power of the minute’s applause given by young and old.\nDid I want to join in?\nYes; but a stronger urge overtook and that was the urge to show people in Portland how loved their icon was over here.\nAs the applause ended and before posting it anywhere, I sent the video to Serrill who passed it on immediately to Conway’s wife, Noeleen.\nIn the hope it had brought her some comfort and cheer privately, we subsequently tweeted it out and as the Pacific Northwest woke up just after 7am, the video began to circulate there. Portland soccer fans woke up to see a packed Craven Cottage applaud their mutual hero.\nThe tributes from Fulham didn’t end there. Club Vice Chairman Tony Khan released a tweet announcing the tribute and offering condolences.\nAwful news that former @FulhamFC player Jimmy Conway has passed away. Jimmy made 360 appearances for the club over ten years & played in the 1975 FA Cup final. Our condolences to his family. At the Cottage tomorrow, we’ll pay tribute to a club legend revered by everyone at Fulham pic.twitter.com/aavqPdaR1U\n— Tony Khan (@TonyKhan) February 14, 2020\nJimmy’s passing came too late to make the Barnsley match programme but there is every chance more will appear in time for the home game with Swansea on February 26th.\nJimmy played his international football for the Republic of Ireland.\nIn a moving tribute on their website, the Football Association of Ireland (FAI) honored the Dubliner who started his career with Drumcondra side Stella Maris before playing for Bohemians.\nStella Maris is a club best known for its youth system which may give readers some insight into Jimmy’s passion for coaching young players when he arrived in Oregon.\nJohnny Giles, David O’Leary, and Eoin Hand are three of its more famous graduates all of whom went on to represent the Irish national team.\nIn the article, FAI Interim Deputy CEO Niall Quinn said:\n“I am very saddened to hear of Jimmy’s passing and extend our sympathies to his family and friends.\n“One of my earliest FA Cup memories is watching the 1975 final when West Ham beat Fulham 2-0 at Wembley and Jimmy was the only non-English player on the field.\n“I can remember being so proud to see an Irishman playing in the FA Cup final, it was an inspirational moment.”\nQuinn emulated that in 1987 when he appeared at Wembley in the League Cup final for Arsenal.\nHe wasn’t though the only Irishman on the pitch. He was joined by Arsenal teammate and of course Stella Maris alumni, David O’Leary.\nThe consequences of Jimmy Conway’s contribution to the football will be felt forever. In Portland, young players will be coached by those who were coached by him. They in turn will teach more American youngsters the game.\nIn Ireland, he will continue to inspire men like Niall Quinn whose inspiration to advance football in their country has now guided him to a post-playing career in administration.\nAnd for us? My love affair that started that day led to being a fan at countless games and ended with the creation of this site.\nIt is now sending young men and women to cover games from the press box not only in Cascadia, but across America and, since the birth of Prost International, in the UK too as well as Australia.\nWithout the men who kicked the ball up and down SW6 so excitingly that day 36 years ago, none of this would have happened.\nThat’s why on Saturday, I celebrated Jimmy Conway’s life as much as mourned his death.",
  "word_count": 1511,
  "scraped_at": "2026-02-14T12:08:02.809196"
}