{
  "article_id": "60ca7827e207",
  "url": "https://www.npr.org/2024/12/26/nx-s1-5232865/beyonce-halftime-show-netflix-cowboy-carter-christmas",
  "title": "Beyoncé halftime show and 2 NFL games were a hit for Netflix : NPR",
  "date": "20241226T221500Z",
  "domain": "npr.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 'Beyoncé Bowl' halftime show was a massive hit for Netflix. The football was too\nNetflix's Christmas Day NFL games were a hit. Is it a sign of things to come?\nSports fans who tuned into Netflix's landmark streaming Wednesday of two NFL games may have felt a bit of troubling déjà vu – at first.\nThat's because this crucial event – signaling the entry of the industry's largest streaming service into the blockbuster business of professional football – kicked off with audio problems in the early moments of host Kay Adams' opening presentation.\nIt was a worrying callback to problems Netflix had with its last big live event, the boxing match in November between YouTube star Jake Paul and former champ Mike Tyson when viewers struggled with blurry audio and got regularly kicked off the live stream.\nFortunately, Adams' sound problems were quickly fixed, allowing Netflix to step up with a two-game programming event that felt like the streaming service's version of the Super Bowl – complete with a lushly-produced halftime show for its second game featuring pop superstar Beyoncé that could stand up to any Big Game presentation.\nIn fact, the actual football games may have been the least impressive part of Netflix's big day, as Super Bowl champions the Kansas City Chiefs ran over the Pittsburgh Steelers in the first game, 29-10 and the Baltimore Ravens dominated the Houston Texans on their home turf for the second contest, 31-2.\nStacking its teams of hosts and commentators with experienced broadcasters, Netflix delivered a mostly smooth visual presentation with lots of glitzy graphics and all the information fans needed to follow the game. The connection issues that plagued the Tyson/Paul fight seemed largely absent, at least for this viewer, particularly while watching the games in slightly delayed playback.\nAccording to Netflix, more than 200 countries tuned in at some point during the Chiefs vs. Steelers contest, making it the second most popular live title on the streaming service.\nSo, it makes sense the streamer would take advantage of the occasion to shoehorn in lots of references to other Netflix products, including a pregame interview with WWE wrestler Liv Morgan to prompt the debut of WWE Raw live events next month and realistic-looking football-shaped cakes tying into the streamer's game show Is It Cake?\nThere were also loads of commercials, which seemed to play even for subscribers with ad-free plans, though if you watched the games via replay, you could skip past them.\nBut the full games expired from Netflix three hours after the event; two programs offering highlights from each game's plays are available to watch on demand, and the streamer says Beyoncé's halftime show will also be offered as a standalone program to rewatch.\nQueen Bey, a Houston native, certainly brought the fire to her hometown for what the streamer dubbed the \"Beyoncé Bowl\" halftime show. Performing songs from her album Cowboy Carter for the first time – including her reboots of \"Jolene\" and \"Blackbird\" – she was a vision in white and sequins backed by a cavalcade of dancers decked out in white cowboy hats and ace collaborators like Post Malone and Shaboozey. Her daughter, Blue Ivy, even made an appearance.\nBeyoncé's epic live performance lasted more than 13 minutes – handily overshadowing Mariah Carey's pre-taped appearances before each game – also proving that Netflix could muster the production value and imagery to match any Super Bowl-level performer.\nWhich was, ultimately, the most important point of the entire day – proving that the streaming service is ready to compete with the big dogs of broadcasting by offering glitch-free NFL games live to a subscriber base of more than 282 million accounts.\nNetflix isn't the only streamer offering live NFL games. Amazon's Prime Video has Thursday Night Football and Peacock also offers live coverage of some NFL games. But Netflix, as the largest and most profitable streaming service, has a symbolic and substantial impact when it comes to a certain kind of programming.\nWith its plans to stream WWE Raw live events starting next month and a new deal to present the FIFA Women's World Cup, Netflix is turning toward one area of television streaming services haven't yet dominated: live sports.\nWhat that ultimately means for the future of television – and the future of sports media – we may just be starting to learn.",
  "word_count": 727,
  "scraped_at": "2026-02-14T12:33:41.302054"
}