{
  "article_id": "60ccb8c153f8",
  "url": "https://www.prokerala.com/news/articles/a1590113.html",
  "title": "WPL 2025 Auction : Looking at how tournament scouting scenario has changed",
  "date": "20241214T091500Z",
  "domain": "prokerala.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New Delhi, Dec 14 : Two seasons into the Women's Premier League (WPL), and the tournament's impact is evident not only on the game itself, but also on scouting of the players, as franchises seek to discover talented cricketers from the Indian domestic circuit.\nOnce the five teams made their retentions clear for WPL 2025, the franchises' were quick on their work to organise trials and camps for their targeted players.\nFor instance, defending champions Royal Challengers Bengaluru had revealed last month in a media release about conducting couple of camps for seeing at players of their interest, following which they would create a shortlist of players and the back-ups to target at the auction, to be held in Bengaluru on Sunday.\n2023 WPL winners Mumbai Indians also recently had a camp in Mumbai, where their head coach Charlotte Edwards was in attendance alongside bowling coach and mentor Jhulan Goswami, as per social media posts.\nMoreover, in the recent U19 women's tri-series between India A, India B and South Africa in Pune, IANS understands that scouts of MI and RCB were in attendance for all matches, and took note of players who did well and had registered for Sunday's auction.\nNisarg Naik, a Mumbai-based cricket talent scout, has been in the women's cricket scouting ecosystem since 2021 and began recommending players to WPL franchises before the inaugural season began in 2023.\nHe contrasts the current situation with that during 2023, when Indian coaches in the five franchises' support staffs primarily used their knowledge and contacts to get more details about players fitting well as per their requirements.\n\"What I really think was there was a short time for preparation that time. All players only knew about their teams 10-15 days ago. So, it meant that they could not have invested more on scouting at that point of time. At that time, the data usage was also very basic. The data wasn't much taken into consideration while taking in the players, as it was more based on someone who knew someone.\"\n\"Other than that, there was just basic ground level scouting – like someone knew of a player in a particular state association and they would tell about the players, and gather data or videos. Cut to now, and there is now expansion of grassroots scouting.\"\n\"There are scouts everywhere, and the WPL teams have appointed two-three scouts each. Like, for almost every domestic match, you have eight scouts overall. The franchises have segregated the duties of scouts, and are watching matches in all over India,\" he said in an exclusive conversation with IANS.\nAfter the 2024 WPL season ended on March 17, some franchises like UP Warriorz and Gujarat Giants conducted mid-year skills-cum-conditioning camps for their domestic players, while also bringing in other talented players in the circuit. Organising plenty of camps has now become a norm for teams before and after WPL seasons.\n\"Like, on November 29, a camp was organised for looking at the players who did well in the Senior Women's T20 Trophy and Challenger Trophy and they got the opportunity there to showcase their talent to the teams. A camp is very important now, because there they prefer to see the players as per match situation.\"\n\"They see that how a player is capable to deliver his or her skill during a particular situation and via match simulations. They prepare a kind of setup - like where if I am a finisher, I have to finish the in 20 balls and make 40 runs. This is how the calibre and capability of a player is determined in the camp.\"\n\"Same goes for a bowler, like how he or she is bowling and what are the variations in hand. Then for an opener or a top six batter, how they fare in those slots because in women's cricket, what usually happens is that the first six overs are very important,\" elaborated Naik, who played U14 football for Maharashtra, was in state's probables in cricket and had stints as net bowler for IPL teams.\nLatest technological tools and artificial intelligence are also being used to identify talented players by WPL teams. But Naik, who got his initial scouting lessons from Vinayak Samant, who served as a scout for the Punjab Kings, talks about how making personal connections with players comes in handy for him to see who can be the best fit for the respective franchises.\n\"There's an app called Ludimos, which was used in trials of the Delhi Capitals, and by other state associations too. When I go scouting, I stay with the scouts and take their inputs as well, which can help me further in this role. Apart from this, I make contacts with the players themselves, and there are players who send their videos to me.\"\n\"It's good for me that I've made these connections all over in India with domestic players, and it's good for them as well to trust on me. I'm investing in the players, and it will be great that we are producing players for our country. If I would have played more of cricket, I would have been playing for India as an individual player. But now I've got the chance to represent more players from my end, and I'm very happy with that.\"\nThe first two seasons of the WPL have revealed the considerable depth of talent in Indian women's cricket. With the five franchises' investing into expanding player scouting efforts, using both established methods and modern-day tools, it will only further enhance the growth and development of women's cricket in India.",
  "word_count": 933,
  "scraped_at": "2026-02-14T12:48:52.238617"
}