{
  "article_id": "60e5756b5ab0",
  "url": "https://www.harvardmagazine.com/2024/11/ivy-league-athletics-career-success-harvard-study",
  "title": "Do Ivy League Athletes Outperform in Careers ? ",
  "date": "20241104T150000Z",
  "domain": "harvardmagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "What role should athletics play in Ivy League college admissions? Do athletes merely take spots from more academically qualified applicants? Or does participation in sports build a special kind of human capital that isn’t taught in classrooms, one that might make educational contributions to all undergraduates? Holman professor of business administration Paul Gompers ’86, Ph.D. ’93, and colleagues at the National Bureau of Economic Research (NBER) compared the careers of Ivy League varsity athletes to those of their non-athlete classmates and found that even after controlling for concentration, chosen industry, year of graduation, and other factors, the athletes earn 3.4 percent more over their entire careers, and attain more senior positions in the organizations they join, than their classmates. They do so despite entering college with modestly lower academic qualifications (possibly attributable to the 20 to 30 hours a week spent during high school on sports rather than academics). The outperformance, the researchers say in a working paper, begins about 5 years after graduation and persists through 25 years out, the end point of the study, which included more than 400,000 Ivy League graduates.\nSome of the economic outperformance, they write, may be attributable to “athletes in sports that are primarily associated with elite private prep high schools (e.g., crew, squash, lacrosse, fencing, and equestrian), suggesting that prior socioeconomic status may play a role in labor market success.” But that effect is small, says Gompers, and doesn’t explain the even greater outperformance of athletes in socioeconomically and racially diverse sports such as football, basketball, and track and field.\nThe same effect appears for athletes from sports with the lowest academic thresholds for admission, including football, men’s and women’s hockey, and men’s and women’s basketball. “For these athletes,” the study argues, “it is reasonable to claim that labor market outperformance is less likely to come through socioeconomic channels and more likely to come through the development of skills that may be important in the labor market.” Because athletes’ outperformance accumulates over time, and athletes are more likely to be rated by their workforce contacts on LinkedIn as skilled managers and leaders, the researchers suggest that “non-academic development of human capital” may be a factor.\nMost undergraduate classroom education aims “to build students’ human capital primarily, if not exclusively,” they write, “through the development of academic skills” known to enhance career outcomes and economic mobility. But what kinds of “human capital”—intangibles that may be valued in the labor market—might athletics teach that aren’t typically learned in a classroom? At Harvard, the researchers point out, the athletics department’s mission statement refers to “the lessons that have long been taught by athletic participation: the pursuit of excellence through personal development and teamwork, ethical and responsible behavior on the field and off, adherence to the spirit of rules as well as to their letter, leadership and strength of character, and sportsmanship….” In Gompers’s view, students who participate intensely in extracurriculars, such as elite musicians and editors of school newspapers, are learning skills not easily taught in class. What is different about athletics, he points out, is broad-based participation.\nGompers, a standout former runner at the College, points to six factors that could contribute to athletes’ career success: resilience, built by dealing with losses and training through adversity; the support and friendship of teammates on and off the field; a commitment to teamwork; long-term goal-setting to achieve excellence; a willingness to take instruction from a coach or mentor in order to improve performance; and efficiency and organization—because athletes’ academic commitments come on top of many hours of weekly practice.\nNotably, the study comes to a different conclusion than a 2023 paper by Ackman professor of public economics Raj Chetty and colleagues, who projected that the future earnings of non-athlete elite college graduates would be higher. The NBER authors point to differences in methodology as the principal explanation: Chetty predicted future earnings based on a one-year snapshot of earnings at age 25, whereas the NBER study used data spanning 25 years, revealing the presence of a five-year post-college outperformance threshold. Gompers says Chetty’s main point, that athletes are admitted to elite colleges “far more often than they should be,” based solely on other criteria, is “absolutely true. Our pushback to this is that if athletics”—and other extracurriculars—“are part of the education, then we should consider someone’s ability to participate in a meaningful way as part of the admissions process.” If certain kinds of human capital are being built outside the academic program, how could that be extended to or shared with classmates?\nGompers allows that it remains unclear whether participation in athletics fosters valued human capital (is it, in economic terms, a treatment effect), or whether athletes succeed in the labor market and in sport because they already possess desirable characteristics (a selection effect). Are labor market outcomes different for athletes who participate in team versus individual sports? Because athletes enter business and finance careers at much higher rates than other students do, perhaps as a result of the influence of teammates, he also doesn’t discount altogether the possibility that their success in the workplace could be driven by ex-Ivy athletes in senior positions hiring peers or younger ex-Ivy athletes—his wife’s favored interpretation and the subject of much discussion at the dinner table. “That’s why we want to do follow-up work.”\nThe researchers are now examining “whether or not those connections matter for recruitment and promotion” at “every single firm in the economy,” going back 50 years. And they are exploring whether professional recruiters, when presented with nearly identical résumés—one from a former Harvard soccer player, for example, and the other from a non-athlete—infer that the athlete is good at working in teams. “In the résumé experiment,” Gompers explains, “we’re trying to elucidate the perspective of these professionals to see whether they naturally associate athletes with particular sets of skills.”\n“What I hope,” he continues, “is that these studies help Harvard and other elite colleges think about the right role for athletics in education.” In that spirit, the researchers suggest that future studies should consider whether interactions between athletes and non-athletes at elite universities could be catalyzed to improve the career outcomes and work productivity of all students. The findings, they write, “could inform admissions policy as universities attempt to build future undergraduate classes that are greater than the sum of their parts.”",
  "word_count": 1056,
  "scraped_at": "2026-02-14T12:18:34.381573"
}