{
  "article_id": "6103ac379ab9",
  "url": "https://www.citizen.co.za/news/top-10-news-stories-day-20-november-2024-2/",
  "title": "Top 10 stories of the day : Farmer gets Christmas in jail | Diamond dealer magistrate steps down | Yaz Plus contraceptive  mix - up  ",
  "date": "20241122T193000Z",
  "domain": "citizen.co.za",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Here’s your daily news update: An easy-to-read selection of our top stories.\nToday’s news: Murder-accused farmer Zachariah Olivier saw his bail application postponed to next year, the magistrate in notorious diamond dealer Louis Liebenberg’s case has recused himself, and a recall is underway of an erroneous batch of Yaz Plus contraceptive pills due to an alarming “mix-up”.\nIn entertainment, media personality Pearl Thusi tells The Citizen she was inspired by Kiernan ‘AKA’ Forbes’ bravery to do a Comedy Central Roast after she first declined.\nIn sport, the South African Football Association (Safa) has dismissed claims that they covered travel and accommodation costs for the South Sudan team during an Afcon qualifier.\nNews today: 22 November\nThe weather on Saturday will be warm to very hot for the most part. Some showers and thundershowers are on the cards and a fire danger warning has been issued. – Full weather forecast here.\nPigsty murders: Zachariah Olivier to spend Christmas in jail [VIDEO]\nIt’s going to be a grim Christmas and new year for Limpopo farmer Zachariah Olivier accused of killing two women and throwing their bodies into a pigsty after his bail application was postponed to next year.\nThe 62-year-old Olivier was expected to apply for bail in the Polokwane regional court on Friday.\nWATCH: Magistrate in Liebenberg case steps down, Louis disrupts court proceedings\nDezzi Liebenberg, wife of the notorious diamond dealer Louis Liebenberg, applied for bail in the Bronkhorstspruit Magistrate’s Court on Thursday.\nIn an unexpected twist at the end of the proceedings, Magistrate Vusimuzi Mahlangu announced that he is recusing himself from the case in the interest of justice.\nPregnancy risk: Recall of popular ‘Yaz Plus’ contraceptive in SA after tablet ‘mix-up’\nThe South African Health Products Regulatory Authority (Saphra) is collaborating with Bayer to ensure a speedy recall of an erroneous batch of Yaz Plus contraceptive pills due to an alarming “mix-up” that could compromise its birth control effectiveness and lead to unwanted pregnancies.\nApparently, the pharmaceutical and biotech giant mistakenly filled a “limited number” of packs with 24 hormone-free placebo pills instead of the 24 actual hormone tablets used for contraception.\nWeekly economic wrap: Inflation shoots the lights out, the repo rate not so much\nThe past week was quite exciting on the economic front, with inflation decreasing by a full 1%, although it did not change the Reserve Bank’s mind about cutting the repo rate by more than 25 basis points.\nOn the international front, geopolitical tensions fuelled a rally in safe-haven commodities, Bianca Botes, director at Citadel Global, says. “Gold extended its upward streak, surpassing $2,660/ounce as investors sought refuge amidst escalating Russia-Ukraine tensions and the US’s veto of a Gaza ceasefire resolution.”\nGayton McKenzie says SA Rugby’s deal with US investor ‘does not give it 20% stake in the Springboks’\nThe deadline to decide South African rugby’s commercial future is inching nearer.\nThe 14 unions making up the domestic landscape will on 6 December vote on whether to accept a R1.3 billion deal to sell a 20% stake in the South African Rugby Union (Saru).\nLegal council slams media over reporting of lawyer’s acquittal in disabled child payment case\nThe Legal Practice Council (LPC) criticised a media report about an attorney’s acquittal after allegedly stealing the settlement money meant for a disabled child.\nIt has stressed that the lawyer, Steven Gqeba, is still suspended and the decision to acquit him is not yet final.\n‘I thought of Kiernan and how brave he was’ – Pearl Thusi on accepting Comedy Central Roast after first declining\nMedia personality Pearl Thusi said she was inspired by Kiernan ‘AKA’ Forbes’ bravery to do a Comedy Central Roast after she first declined to have her own roast.\nThusi said she initially declined because she wasn’t in a good space.\n“I said ‘no’. I wasn’t in a good space when they called me but I was on a journey of healing, which is what I’m sharing on my reality show,” Thusi told The Citizen as she walked the red carpet to her roast.\nSmash Afrika replaces Lawrence Maleka as ‘Big Brother Mzansi’ host\nTV presenter Smash Afrika has been announced as the new host for Mzansi Magic’s popular reality show, Big Brother Mzansi, for the upcoming Season 5.\nThe show was previously hosted by actor and TV personality Lawrence Maleka.\nSafa refutes claims of funding South Sudan’s expenses\nThe South African Football Association (Safa) has dismissed claims that they covered travel and accommodation costs for the South Sudan team during their Africa Cup of Nations (AFCON) qualifier in Cape Town.\nIn a one-sided affair at the Cape Town Stadium on Tuesday night, Bafana Bafana hammered the Sudanese 3-0 to end their Group K campaign unbeaten with four wins and two draws.\nProteas women eager to bounce back from World Cup heartache\nA little more than a month after their defeat in the T20 World Cup final, all-rounder Sune Luus says the Proteas women’s team are eager to pick themselves up and bounce back during their month-long home tour against England starting this weekend.\nPlaying their second successive T20 Women’s World Cup final, the SA team were defeated by New Zealand in the trophy battle at the global showpiece in the United Arab Emirates in October.\nYesterday’s news recap\nRead here: CryptoQueen ‘hiding in SA’ | Bail denied for Dezzi Liebenberg | Sho Madjozi leaving music business\nSupport Local Journalism\nAdd The Citizen as a Preferred Source on Google and follow us on Google News to see more of our trusted reporting in Google News and Top Stories.",
  "word_count": 927,
  "scraped_at": "2026-02-14T12:10:16.911237"
}