{
  "article_id": "612ad36063fc",
  "url": "https://theathletic.com/4103970/2023/01/18/ali-riley-new-zealand-uswnt-world-cup/",
  "title": "Ali Riley embraces the future and reckons with the past in return to New Zealand",
  "date": "20230118T221500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In The Journey to the Cup, The Athletic follows six players as they work towards a place in the 2023 Women’s World Cup. Follow along as we check in with them each month in the build-up to the tournament, tracking their progress as they prepare both mentally and physically for a chance to shine on the game’s biggest stage.\nWhile normies might struggle with major time differences, globetrotter Ali Riley is an old pro.\nAdvertisement\n“If you’re on the east coast you are six hours ahead, but a day behind,” she wrote as we tried to coordinate times with her in New Zealand, an equation that was ultimately much more successful than my simple attempts to add 18 hours. It’s apparent she’s used to putting time differences in ways that let your brain do a little bit of shorthand.\nRiley was already in Wellington/Te Whanganui-a-Tara, waiting for her luggage at the airport along with the rest of the Football Ferns, en route to their training camp. She had just come from a couple of days celebrating former teammate Rosie White’s wedding, dodging the wet and somewhat unseasonably cold summer weather in the southern hemisphere. The Ferns have congregated on home soil, outside of a FIFA window, to play the United States in two friendlies, and perhaps to build some excitement in one of the host nations for the 2023 World Cup.\n“I think it’s such a cool way to kick off the year, the World Cup year, having this tour, being in New Zealand, for me being able to go to one of my best friend’s weddings,” said Riley. “It’s a nice preview of what it will be like in the winter for everyone coming to New Zealand. Very, very wet.”\nThis is not a typical Ferns roster. Through a combination of factors — including playing outside of the FIFA window, the long travel and various injuries — many usual starters are simply unavailable for this camp. Riley herself is still managing a hip injury from last fall.\nSeveral of the players assembled for these games have a zero next to their names, showing how many times they’ve been capped for New Zealand. Sixteen of the 26 players are on 10 caps or less. Riley and Betsy Hassett are by far the most capped players on the team, with 148 and 138, respectively. The next most experienced players are Anna Green, with 81, and Erin Nayler, with 79.\n“I think it’s a really good challenge for me as a captain and as a leader to make sure that our environment is very welcoming,” Riley said. “To make sure that players feel really valued and know that they are contributing and playing a really important role.”\nAdvertisement\nRiley’s leadership is crucial in a camp with so many newcomers as they face down a United States who last defeated New Zealand 5-0 in a February 2022 game in Carson, and the year before that beat them 6-1 at the Olympics in Japan. (Betsy Hassett and Paige Satchell, who orchestrated that Olympic goal against the U.S., are both on this January 2023 roster.) On Wednesday afternoon, the U.S. beat New Zealand 4-0 after the less experienced Ferns managed to hold them to a scoreless first half in front of a record crowd for the home side (12,508).\nAt 35 years old, this might be Riley’s last World Cup. It might not — she said she doesn’t know yet. She’s been captain of this squad for a long time, and she’s been a leader for a long time. What’s changed, she said, is taking on a generational mindset.\n“Empowering the next leader,” said Riley. “It’s along similar lines of wanting to make sure to leave a type of legacy. But it’s not about me, it’s just I want to really, really make sure the team can continue to feel empowered to continue pushing for what they deserve. To compete at the highest level. This World Cup and beyond, I think New Zealand, we need to have good performances. We need there to be a shift in the culture of women’s sports, and particularly women’s soccer in New Zealand, if we want to continue to be competitive.\n“I think this tour, and where we are right now, it’s all about opportunity and setting standards. And, I mean, that’s the perfect mindset to have, I think when you’re starting a new year. We will absolutely be challenged by playing USA for these games. But I think that’s a great way to see where we are, what the focus will be, what we can do against the U.S. that we’ll be able to translate into what we can do against a Norway or Philippines or Switzerland.”\nRiley named the three countries that join New Zealand in Group A for the 2023 Women’s World Cup. It’s on everyone’s minds — the players and the locals alike — that this is a rare opportunity for tiny New Zealand to get to shine. They’re the dominant team in their Oceania confederation, but they’re also a team that has often been asked to compete with global contenders who have bigger populations and budgets.\nAdvertisement\nA successful World Cup — and here Riley talked about success for the Ferns coming with winning at least one game and getting out of the group stage — on home soil could be a watershed moment, the way the 1999 World Cup in the U.S. was for Riley herself growing up in Southern California.\n“We want to get people excited about this tournament,” she said. “We want everyone to realize that there is a demand for women’s soccer, for women’s sports. We want the sponsors to get excited. We want to increase investment in women’s soccer and women’s sports in New Zealand. And we want little girls to start playing soccer, for the idea to dream big and that they can do anything that they put their mind into. I think that that’s something that the U.S. has had for so long.\n“So if we can have anything like that happen in New Zealand — I mean look at the change (1999) created. So I think the more games we can have here with top opposition with any type of build up to the World Cup is so awesome.”\nWith the travel restrictions due to COVID-19, Riley hasn’t been to New Zealand in five years. In June 2018, she was on the squad that lost 3-1 to Japan in Wellington, when she was unable to play due to a quad injury. After that game, then-head coach Andreas Herras was criticized by New Zealand football media for playing an overly defensive game, calling a three-goal concession a good result after the game, and for saying in the same conference that New Zealand “will never have that quality to compete with Japan.”\nThis prompted former Ferns captain Abby Erceg to withdraw from the national team, saying at the time, “You can see how I couldn’t stand to wear that fern on my chest any more when his vision was to cower in a corner and not get beat by too much.”\nErceg’s withdrawal was then followed by complaints against Heraf by 12 Ferns players, alleging workplace bullying and saying they would not play as long as Heraf was head coach. New Zealand Football then commissioned an independent review that found that some of Heraf’s behavior had “crossed the line to bullying and harassment.”\nRiley called it “a very tough tour” and left it at that.\nAdvertisement\n“I don’t feel like I’m in a place to really get into what happened on that tour,” she said. “But I guess basically what I can say is that having a coach like Jitka (Klimkova), who puts the player, the person, first; has a very holistic approach; is someone who is super ambitious and enthusiastic and backs that up with processes that really can get the best out of each player… I feel like she is a great leader, and just is so open to conversation, and she loves New Zealand, and she is so bought into the importance of culture and listening, and she makes us feel valued. And I think it’s sad to say that that’s refreshing.\n“We went through big changes in the Federation after that tour,” Riley added. “So this is a great opportunity for me going back… to leave New Zealand with new, positive, optimistic, energetic vibes and feelings compared to the last time I left here, when I was really close to leaving the national team.”\nThat determined sense of optimism is a Riley hallmark; it’s not unrealistic, nor is it unearned. Riley has done the grind for the national team and multiple women’s professional leagues and earned a landing on her feet each time.\n“I worked my ass off to have a leadership role in those teams,” she said.\nThe work has brought her to this moment, where she’ll be one of the faces of a World Cup host nation team.\n“It already is such a different feeling,” she said of returning to New Zealand. “I think just specifically being back in Wellington, in a city where I had such a terrible experience that was a really, really traumatizing thing. It’s such a different feeling. I think it’ll probably be weird being in the city and being in the stadium. But that’s, I think, something that’ll be a good test for me, to be able to tap into the people that support me, and talk to people I need to in order to kind of acknowledge those feelings and, not necessarily move past them or ignore them, but just embrace that as part of my journey and what I’ve gone through. And also the person it made me to now be, willing to do whatever it takes to support those who need it and speak up at whatever the cost. I think what I’ve realized through that experience that, again, the players are so powerful, and especially when you’re united, I think there’re very few people who can stop us when we come together and stand up for what was right.”\nThe Football Ferns’ two friendlies against the United States in Wellington and Auckland/Tāmaki Makaurau highlight the two cities that the United States will also play in for their World Cup group stage games. So despite some griping from fans about playing outside the FIFA window, or local media calling these games “an unnecessary distraction,” there’s ample reason to look for positives for the Ferns, the host cities, and the tournament as a whole.\nAdvertisement\n“What a cool experience for the players who haven’t been in camp before,” Riley said. “I mean, imagine getting your first cap in New Zealand against the USA. That’s something you can never take away from someone.”\nAnd, said Riley, she can’t control what people write about the team. Leave the handwringing to the press. The players know there’s pressure, and Riley appreciates it.\n“I think there might not be a lot of people who have huge expectations of us, but for us to perform well and to make our families proud in New Zealand and the opportunity we have to change women’s sport here, I think, is amazing pressure to have,” she said.\nShe can’t say whether it feels different to be the host nation. They haven’t actually gotten to the hosting yet. Riley can’t put her finger on it, either, when asked if she can describe her energy right now, or the vibe in camp. It doesn’t quite feel like the beginning of a road to the World Cup, or like a “new year/new mentality” sort of thing. It’s a lot of new players in camp, a lot of things yet to test under Klimkova, expectations to measure out and fine tune. It is what it is.\nThere was much muffled shuffling of luggage. No time to dwell; Riley was on the move, joining her teammates in a team vehicle, preparing for a day of welcomes and meeting with physios.\n“I just feel really excited and honored,” she said, “But I’ll be able to probably tell you more the closer I get.”\n“The Journey to the Cup” series is part of a partnership with Google Chrome.\nThe Athletic maintains full editorial independence. Partners have no control over or input into the reporting or editing process and do not review stories before publication.\n(Top image: Hannah Peters/Getty Images; Design: Sam Richardson)",
  "word_count": 2082,
  "scraped_at": "2026-02-14T13:34:52.225191"
}