{
  "article_id": "613ebd305a1e",
  "url": "https://www.myjoyonline.com/japan-pm-joins-fight-for-more-female-toilets-in-parliament/",
  "title": "Japan PM joins fight for more female toilets in parliament",
  "date": "20260102T050000Z",
  "domain": "myjoyonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Audio By Carbonatix\nJapan's Prime Minister Sanae Takaichi is among some 60 female lawmakers petitioning for more women's toilets in the parliament building to match their growing representation in the legislature.\nA record 73 women were elected into the 465-seat Lower House in October 2024, exceeding the previous high of 54 in 2009.\nOne opposition lawmaker, Yasuko Komiyama, said there were often \"long queues in front of the restroom... before plenary sessions start\", and quoted another MP who said she had \"given up\" going to the toilet before a session began.\nThere is one female toilet with two cubicles near the plenary chamber, though the entire building itself has nine female toilets with 22 cubicles.\nThere are a total of 12 men's toilets with 67 stalls and urinals across the building, according to local media reports.\nThe current situation is \"often inconvenient\" because female staff and visitors also share the toilets, said Ms Komiyama from the opposition Constitutional Democratic Party.\n\"I want to raise my voice and prepare myself for the day when women hold more than 30% of [parliamentary seats] in the future,\" she wrote in a post on Facebook.\nJapan's parliament building was built in 1936, a decade before women was given the right to vote in 1945. The first women were appointed to parliament in 1946.\nThe parliament building is a sprawling three-storey structure, with a central portion that is nine storeys high. The building occupies 13,356 square metres (143,800 sq ft), the equivalent of about two football pitches, with a total floor area of 53,464 square metres.\n\"If the administration is serious about promoting women's empowerment, I believe we can count on their understanding and cooperation,\" Komiyama said, according to Japanese media.\nChair of the Lower House committee Yasukazu Hamada has \"expressed a willingness\" to consider the proposal for more women's toilets, said an Asahi Shimbun report.\nThe Japanese government earlier set a target of having 30% of leadership roles across all sectors of society held by women by 2020, but at the end of that year the timeframe was quietly pushed back by a decade.\nWomen currently hold nearly 16% of the seats in the Lower House and about a third – or 42 out of 125 seats – in the Upper House.\nTakaichi, who became Japan's first female leader in October last year, had pledged to raise female representation in her cabinet to levels comparable to Nordic countries, which hold the top spots in terms of female leadership.\nEven then, she'd appointed just two other women to her 19-member cabinet.\nIn Japan, the dearth of women's restrooms extends beyond the legislative chamber.\nLong lines in front of women's public restrooms are a common sight nationwide.\nFormer Prime Minister Shigeru Ishiba had said his government would look into \"enhancing women's restroom facilities\" to make Japan a society where \"women can live their lives with peace of mind\".\nLatest Stories\n-\n‘I wanted to be an architect but ended up as a nurse’ – Diana Hamilton reveals\n14 minutes -\nFrom wards to worship: Diana Hamilton reveals how nursing school shaped her destiny\n32 minutes -\nMahama demands binding deadlines for African reparations\n1 hour -\nThis is not the time to settle political scores – Bawumia to government\n2 hours -\n5 definitive Valentine’s Day gifts to win your lover’s heart in Ghana\n3 hours -\n37% of SHS students exposed to drugs – Opare-Addo\n3 hours -\nNLC secures court injunction against striking tertiary unions\n3 hours -\nWaiting in the Ring: life inside Bukom’s halted boxing scene\n4 hours -\nRed Notice cancellation: OSP official fires back at Ofori-Atta’s lawyers\n4 hours -\nOfori-Atta saga: Red Notice ends after arrest – OSP official clarifies\n5 hours -\nAAG raises alarm over billboard demolitions, calls for presidential intervention\n5 hours -\nHealth Minister to chair probe into ‘No Bed Syndrome’ death; promises system overhaul\n5 hours -\nPrime Insight to tackle ‘galamsey tax’ debate, cocoa reforms and Ayawaso East fallout this Saturday\n5 hours -\nCocoa crisis, galamsey complicity and election credibility to dominate this Saturday’s Newsfile\n6 hours -\nINTERPOL deletes Red Notice for Ofori-Atta as extradition process continues — OSP confirms\n7 hours",
  "word_count": 701,
  "scraped_at": "2026-02-14T12:13:32.658821"
}