{
  "article_id": "614ec758b6fb",
  "url": "http://www.bignewsnetwork.com/news/278239473/feature-wuhan-women-claim-historic-afc-title-inspire-nation",
  "title": "Feature : Wuhan women claim historic AFC title , inspire nation",
  "date": "20250525T124500Z",
  "domain": "bignewsnetwork.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Feature: Wuhan women claim historic AFC title, inspire nation\nby sportswriters Yue Wenwan and Zhao Jiantong\nWUHAN, May 25 (Xinhua) -- When backup goalkeeper Chen Chen dove to her left to parry away the final penalty kick, sending the ball skimming out of the danger zone, the final whistle followed immediately and history was made.\nIn an instant, Chen's teammates sprinted toward her, screaming with laughter while engulfing her in embraces. On an unforgettable night in central China, Wuhan Jiangda stood atop Asian women's football.\nAfter 120 grueling minutes of play and six nerve-shredding rounds of penalties, Wuhan defeated Melbourne City FC to clinch the inaugural AFC Women's Champions League title - a first not just for the club, but for China and Asia.\nPOWER OF RESILIENCE\nThe crowning moment was more than a trophy. It was a tribute to the grit that defines Wuhan's women's football.\n\"We kept the trophy here in Wuhan!\" shouted hometown star Wang Shuang, her voice quivering as she hoisted the trophy aloft. Her 98th-minute equalizer from the penalty spot breathed new life into a game that had seemed lost.\nWuhan clawed back from the brink of defeat twice during the final. They forced extra time with Wang's last-gasp equalizer, then survived a penalty miss in the shootout to ultimately prevail. It was, as head coach Chang Weiwei said, a \"title earned through the hard way with bumps, bruises, and endless fight.\"\nInjury and exhaustion ravaged the squad, with starting goalkeeper Ding Xuan suffering a fractured arm and midfielder Dai Chenying hospitalized with a torn meniscus. Veteran defender Wu Haiyan, spent and sore, still threw herself into tackles. Captain Yao Wei, not fully recovered from injury, stepped up first in the shootout.\n\"Champions are not born in comfort, they're forged under pressure,\" said Chang.\nA JOURNEY MARKED BY STRUGGLES, SUPPORT\nWuhan's path to glory was anything but smooth. Just five days after winning their fifth consecutive Chinese Super League title, they began their AFC campaign. Their group-stage performance was shaky, and they only just scraped through into the knockout stages after two defeats and just one win.\nBut in the knockout rounds, the team was transformed. They edged past Japanese powerhouse Urawa Red Diamonds in a dramatic penalty shootout, then dispatched Ho Chi Minh City in the semis. Facing top-tier opponents from Japan, Vietnam and Australia, Wuhan's squad played 330 minutes across three matches, with two of them ending with penalties.\n\"All I want to say is thanks, thanks to our tenacious players, the local government, the football associations and our fans,\" noted Chang. \"It was an impossible journey without their support.\"\nOn Saturday night, Wuhan Sports Center Stadium became a sea of 18,715 fans. And hours before kickoff, roads around the stadium were gridlocked.\n\"I'm so proud of what we achieved,\" said goalkeeper Chen, who made two crucial saves in the shootout. \"But we couldn't have done it without our fans.\"\nFrom chants to synchronized claps, the energy inside the stadium never waned. Elderly fans held banners reading \"Wuhan Women, Brave Warriors.\" Before the penalties, the song Believe in Yourself echoed through the stands, uniting thousands in chorus.\nVoyah Motors CEO Lu Fang brought over 500 employees to the game. \"Tickets were gone in a flash,\" he said. \"What these women showed tonight - their resilience and belief - inspired all of us, whether in sports or industry.\"\nMelbourne City head coach Michael Matricciani admitted in the post-match press conference that the partisan crowd had added to the occasion and made a huge difference to the result.\nWith the semifinals and final being staged in a centralized location, Wuhan's hosting of the final was not a given. After eliminating Urawa Reds, the original favorites to host the tournament's latter stages, local government and club officials worked tirelessly to ensure that Wuhan would be the host city.\nA LEGACY OF GROWTH\nAs fans poured out of the stadium, many joined in a powerful chorus of Iron Roses, a famous Chinese song that praises resilient women. Meanwhile, a group of supporters unfurled a giant Chinese flag, chanting deep into the night.\nThis was more than the end of a tournament. It was the continuation of a legacy decades in the making.\nWuhan is the hometown of many players on the Jiangda team, as well as China's national team. Five within the championship squad once studied at Wuhan Wansongyuan Primary School, a local football-specialty school. Since the 1990s, Wuhan has invested heavily in grassroots development for girls' football, from schools to universities and then to professional clubs.\nIn 1999, Jianghan University founded a women's football team. Two years later, Wuhan Jiangda Women's Football Club was established. After years of combining campus training with professional ambition, they finally entered the national top flight in 2017 and never looked back.\nWith this AFC title, Wuhan has earned a slot at the inaugural FIFA Women's Champions Cup in 2026.\n\"We'll keep moving forward and showcase the spirit of Wuhan women's football on the world stage,\" noted Chang.",
  "word_count": 837,
  "scraped_at": "2026-02-14T12:50:22.248343"
}