{
  "article_id": "6151d929404c",
  "url": "https://www.blayneychronicle.com.au/story/8689021/2024-paris-olympics-the-western-area-athletes-to-watch/?cs=103",
  "title": "2024 Paris Olympics : The western area athletes to watch | Blayney Chronicle",
  "date": "20240718T204500Z",
  "domain": "blayneychronicle.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Bring on the sleepless nights.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe 2024 Olympic Games starts on Friday, July 26, and the eyes of the world will be on Paris.\nOur region will get swept up in the excitement as well, with a number of western area athletes to chase their gold medal dream.\nHere you can find all about our Olympic and Paralympic athletes as well as their home town, medal prospects and more so you can drop some knowledge around the home and office over the coming weeks.\nEllie Carpenter\nHome town: Cowra\nSport: Football\nThe most famous face of our western area stars. From her junior days running around Twigg Oval at Cowra, Carpenter has now played for the Matildas on 77 occasions, plays for arguably the biggest women's club team in the world in French powerhouse Lyon, and is a role model and hero to young girls across the country.\nCarpenter will become a three-time Olympian at Paris and she and the Australian side head to Paris having finished fourth at the Tokyo Games.\nMedal prospects: You've got to get around the Matildas. After fourth at Tokyo and an incredible run to the World Cup semi-finals last year, the Australian side heads to Paris as a strong medal hope. There's no Sam Kerr or Katrina Gorry and it's tricky draw, but there's still a lot to like about this team.\nWhen to watch (all times AEST): Australia has been pooled with gold medal favourites the USA, Germany and Zambia.\nFriday, July 26: Australia v Germany, 3am\nMonday, July 29: Australia v Zambia, 3am\nThursday, August 1: Australia v United States, 3am\nThe finals start on Saturday, August 3 and the gold medal match kicks off at 1am on Sunday, August 11.\nClare Hunt\nHome town: Grenfell\nSport: Football\nWho could have predicted Hunt's rise over the past few years? When the Matildas played at Tokyo, she was never really in contention for an Australian spot. Now, she heads to Paris as one of the key figures in Australia's defence.\nHunt will make her Olympic debut at Paris, having shot to prominence courtesy of a string of outstanding performances at last year's World Cup.\nMedal prospects: As per above with Carpenter. USA, Spain and France will be among the favourites but Australia is a definite medal contender.\nWhen to watch:\nFriday, July 26: Australia v Germany, 3am\nMonday, July 29: Australia v Zambia, 3am\nThursday, August 1: Australia v United States, 3am\nThe finals start on Saturday, August 3 and the gold medal match kicks off at 1am on Sunday, August 11.\nMariah Williams\nHome town: Parkes\nSport: Hockey\nWilliams played touch football and soccer while growing up, but once she got a hockey stick in hand and started running around with the Parkes Rovers it was clear this was the sport for her.\nAfter leaving Parkes to attend Hunter Sports High in Newcastle, Williams quickly moved up the ranks and she made her Australian debut in 2013 at just 17.\nShe heads to Paris having played at two previous Games while she's scored 15 goals in 81 games in total for her country.\nMedal prospects: The Netherlands are sure to start big favourites at Paris, but the Hockeyroos are right there alongside teams from Argentina and Germany. One of our perennial medal contenders at the Olympics, the Australian team has what it takes to finish on the podium.\nWhen to watch: Australia has been pooled with Argentina, Great Britain, Spain, United State and South Africa.\nSunday, July 28: Australia v South Africa, 8.45pm\nTuesday, July 30: Australia v Great Britain, 1am\nWednesday, July 31: Australia v United State, 9.15pm\nFriday, August 2: Australia v Argentina, 4.15am\nSaturday, August 3: Australia v Spain, 8.45pm\nFinals start Monday, August 5, with the gold medal match at 4am on Saturday, August 10.\nLachi Sharpe\nHome town: Lithgow\nSport: Hockey\nSharp's story is that of so many other talented kids out west. He played junior hockey for the Zig Zag club at Lithgow, but it soon became quick he was a special talent so that meant plenty of travel.\nWhen he was 13, he joined the Ryde Hockey Club and he and his father had to make the trip to Sydney three times a week just for training.\nHaving made his Kookaburras debut in 2017, Sharp scored on his Olympic debut at Tokyo and returned home with a silver medal.\nMedal prospects: Australia is fourth in the world heading to Paris so we like to think Sharp will be on the podium again this year.\nWhen to watch: Australia is in Group B with Argentina, New Zealand, Belgium and India.\nSaturday, July 27: Australia v Argentina, 9.15pm\nMonday, July 29: Australia v Ireland, 6pm\nWednesday, July 31: Australia v Belgium, 3.45am\nThursday, August 1: Australia v New Zealand, 6.30pm\nFriday, August 2: Australia v India, 9.15pm\nFinals start Sunday, August 4, with the gold medal match at 3am on Friday, August 9.\nJack Hargreaves\nHome town: Nyngan\nSport: Rowing\nLet's hope this far west product wins another gold just so we get more screen-time from his dad. During the Tokyo Olympics, we spoke to Peter while he was at a pub in Brisbane while he was watching and then he popped up on TV, looking like he was having a great time. We don't blame him at all, given his son has become one of the world's top rowers.\nThere wasn't much water around Wellington and Nyngan - place Hargreaves grew up - and he only originally took up rowing at St Joseph's College in Sydney to stay fit for rugby season.\nAfter being part of a new-look 'Oarsome Foursome' that won gold at Tokyo, Hargreaves has moved to the men's eights as Australia has prioritised that event for Paris.\nMedal prospects: Australia has never won gold in the men's eight but that's the target for Paris as Hargreaves and fellow Tokyo fours champions Spencer Turrin and Alex Purnell have moved to the bigger team. The team won gold at the World Cup regatta and then collected bronze at the World Rowing Championships last year, so expect them to be in the mix again.\nWhen to watch:\nMonday, July 29: Men's eight heats, from 7.40pm\nThursday, August 1: Men's eight repechages, from 6.20pm\nSaturday, August 3: Men's eight final, 7.10pm\nJack O'Brien\nHome town: Walgett\nSport: Rowing\nOne day you're running around with the Walgett Wolves junior soccer side, the next you're wearing green and gold at the Olympics.\nJoseph 'Jack' O'Brien will compete alongside the previously mentioned Hargreaves in the men's eight at Paris, having been a part of the team which finished sixth at the Tokyo Games.\nO'Brien was born in Dubbo - his mother required Royal Flying Doctor Service transport after going into labour early at the family property - before going to school at both Bowral and St Joseph's College in Sydney.\nIt was at Joey's where his interest in rowing really began and his talents were spotted soon after. He represented Australia at the under 23 World Championships and in 2019 he made his senior national debut.\nMedal prospects: As said above, the eights team is a big chance of gold. The Australian men's eight has been the biggest threat to a dominant Great Britan since the Tokyo Games and those two countries, along with the Netherlands, shape as the biggest contenders heading to Paris.\nWhen to watch:\nMonday, July 29: Men's eight heats, from 7.40pm\nThursday, August 1: Men's eight repechages, from 6.20pm\nSaturday, August 3: Men's eight final, 7.10pm\nMichelle Bromley\nHome town: Gulgong\nSport: Table tennis\nBromley honed her skills as a child while playing tirelessly with her dad in the shed at their family home in Gulgong.\nBy the time she was 14, she was already an Australian representative and national champion.\nThis year marks Bromley's second trip to the Games and she heads to Paris having won five of her seven matches at the Australian Olympic qualifying tournament.\nShe'll compete in the women's team event at Paris.\nMedal prospects: Australia isn't really a global superpower in the world of table tennis. After being bounced out in the first round at Tokyo, let's hope Bromley can get a win or two this time around.\nWhen to watch:\nMonday, August 5: Women's team round of 16, from 6pm\nTeam events continue through until the gold and bronze medal matches from 6pm on Friday, August 9.\nCorey Toole\nHome town: Forbes\nSport: Rugby 7s\nOkay, this one is a little bit tenuous but we'll claim him as a western athlete. Toole was born in Forbes but he and his family made the move to Wagga, where they still call home. But he still has plenty of family in Forbes and they'll no doubt be glued to their screens when the men's Rugby 7s side lines up.\nA flying winger, Toole has starred for the ACT Brumbies and has often been described as the fastest man in Super Rugby. Watch out if he gets into clear space at Paris.\nMedal prospects: While Australia has been a global power in the women's game, the men have been a bit of an outsider. Australia is currently ranked ninth in the world and heads to Paris having been knocked out by eventual gold medal winners Fiji at the quarter-final stage at Tokyo Games.\nWhen to watch: Australia has been pooled with Argentina, Samoa and Kenya.\nWednesday, July 24: Australia v Samoa, 11.30am\nThursday, July 25: Australia v Kenya, 3am\nThursday, July 25: Australia v Argentina, 11.30pm\nFinals start Friday, July 26, with the gold medal match at 3.45am on Sunday, July 28.\nJamieson Leeson\nHome town: Dunedoo\nSport: Boccia\nAt just 21 years of age, Leeson will be heading to her second Paralympic Games this year.\nLeeson was diagnosed with spinal muscular atrophy when she was 18 months old and her boccia prowess was spotted during a school competition.\nShe was part of the mixed pairs BC3 competition at Tokyo and she and her Aussie teammates just missed out on a place in the semi-finals.\nShe'll again team up with Australian champion Daniel Michel in the pairs at Paris.\nMedal prospects: The gold is a real possibility. Leeson and Michel are the No. 1 ranked team in the world and were crowned pairs world champions last year. At the 2023 AIS Sport Performance Awards, they were named Team of the Year ahead of the likes of the Hockeyroos and Australian Diamonds. That's the calibre of athlete we're talking about.\nWhen to watch:\nFriday, August 30: BC3 pool matches start from 4.30am\nPool matches run through to Sunday, September 1, when finals begin. The gold medal match is at 2.30am on Tuesday, September 3.\nTuesday, September 3: BC3 pairs matches start from 7.50pm\nEmilie Miller\nHome town: Bathurst\nSport: Wheelchair rugby\nAs a child, it seemed Miller was destined to be a swimming star. But at 12 years of age tragedy struck when she slipped while diving into the pool and the injury left her a quadriplegic.\nShe refused to let that end her sporting dream though, and she first became a handcycling star who competed all over the world. A lack of competition meant she didn't get to compete at Tokyo, and soon she discovered the world of wheelchair rugby.\nRoughly a year later Miller was competing at Wheelchair Rugby World Championship and now she's headed to Paris as part of the Australian 'Steelers' team, which is made-up of men and women.\nMedal prospects: As strong as any other sport Australia is competing at. The Steelers are ranked number one in the world and motivated after missing out on a medal for the first time at Tokyo. Prior to that, it had been back-to-back gold medal wins.\nMedal prospects: We're a very big chance. The Steelers finished fourth at Tokyo and just missed out on a medal, but the team heads to Paris as number one in the world. With superstars Riley Batt and Chris Bond leading a hugely motivated outfit, gold is the goal.\nWhen to watch: Australia has been pooled with Great Britain, France and Denmark.\nThursday, August 29: Australia v Great Britain, 7.30pm\nSaturday, August 31: Australia v France, 3.30am\nSaturday, August 31: Australia v Denmark, 9.30pm\nFinals start Sunday, September 1, with the gold medal match to be played at 3.30am on Tuesday, September 3.\n- Do you have a western area Olympics story to tell? Get in touch via nick.guthrie@dailyliberal.com.au",
  "word_count": 2092,
  "scraped_at": "2026-02-14T13:02:48.481233"
}