{
  "article_id": "616b325e6d93",
  "url": "https://www.techradar.com/streaming/great-north-run-live-stream-2023-watch-mo-farahs-last-race",
  "title": "Great North Run live stream 2023 : how to watch Mo Farah last race online from anywhere",
  "date": "20230910T090000Z",
  "domain": "techradar.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Great North Run live stream 2023: how to watch Mo Farah's last race online from anywhere\nSix-time champion Mo Farah competes for the last time\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nYou are now subscribed\nYour newsletter sign-up was successful\nWatch a Great North Run 2023 live stream\nYou can watch the 2023 Great North Run for free on BBC One and BBC iPlayer in the UK. Away from home? Use a VPN to watch a free stream from abroad. Full details on how to watch a Great North Run live stream just below.\nGreat North Run 2023 preview\nAfter a superlative career spanning two medal-laden decades, Mo Farah has decided that the 2023 Great North Run will be his final competitive race. On Sunday morning, the six-time winner of the world-famous British half-marathon will tread the 13.1-mile course from Newcastle City Centre to South Shields via the iconic Tyne Bridge for the last time as an elite athlete, but will the 40-year-old be able to sign off in style?\nKenya's Geoffrey Kamworor, the three-time half-marathon world champion who also finished second at this year's London Marathon, is the favourite in the elite men's race, along with Ethiopia's Muktar Edris, the two-time 5000m World Champion who named his son after Farah.\nIt's impossible to look past Peres Jepchirchir in the elite women's race. As well as being the reigning Olympic marathon titleist and a two-time half-marathon world champion, the Kenyan has made a habit of smashing half-marathon records. She'll be eyeing up the 1:04:28 set by Brigid Kosgei in 2019, though she won't be the only one, with her compatriot Sharon Lokedi, the reigning New York City Marathon Champion, set to push her all the way.\nBut it's not just the elites that have made the Great North Run the biggest half-marathon in the world. 60,000 people will be pounding the pavements not just in the name of a challenge, but for loved ones who can’t be there, those taken too soon and those for whom the mere act of existing is far tougher than any endurance race.\nRead on as we explain how to watch a 2023 Great North Run live stream from anywhere - starting with how to watch the Great North Run for FREE in the UK.\nWhen does the Great North Run start?\nThe 2023 Great North Run start times are as follows:\n- 10.30am BST – Elite wheelchair start\n- 10.35am BST – Elite women start\n- 10.37am BST – Visually impaired start\n- 11am BST – Elite men and mass participation start\nHow to watch a FREE Great North Run live stream in the UK\nFans in the UK can watch the 2023 Great North Run for FREE!\nThe race is being shown on BBC One, with coverage getting underway at 10am BST on Sunday morning. You can live stream the action on BBC iPlayer.\nAway from the UK right now? No worries:\nUse ExpressVPN to watch BBC iPlayer from abroad.\nBBC iPlayer is free to use (with a valid TV licence) and works across a wide range of devices including smart TVs, laptops, games consoles, mobile phones, tablets and streaming sticks.\nIf you're already a subscriber, you can also watch the the Great North Run via Eurosport and Discovery+, with a subscription costing £6.99 per month or £59.99 for the year, and including TNT Sports.\nHow to watch Great North Run from outside your country\nIf you're abroad right now and struggling to tap into your local coverage of the race, you'll want a VPN. This'll help you circumvent the geo-blocking that will try to stop you watching a Great North Run live stream in particular parts of the world.\nThey're a useful means of getting around this issue, are cheap, and easy to set-up as well. Here's how it's done.\nUse a VPN to watch Great North Run from anywhere\nExpressVPN - get the world's best VPN\nWe've put all the major VPNs through their paces and we rate ExpressVPN as our top pick, thanks to its speed, ease of use and strong security features. It's also compatible with just about any streaming device out there, including Amazon Fire TV Stick, Apple TV, Xbox and PlayStation, as well as Android and iOS.\nSign up for an annual plan now and get an extra 3 months absolutely FREE. And if you change your mind within the first 30 days, let them know and they'll give you your money back without a quibble.\nHow to use a VPN to watch the 2023 Great North Run\nUsing a VPN is as easy as one-two-three...\n1. Download and install a VPN - as we say, our top choice is ExpressVPN.\n2. Connect to the appropriate server location - open the VPN app, hit 'choose location' and select the appropriate location, eg: 'UK' for iPlayer.\n3. Go to the broadcaster's stream - head to your home broadcaster's site or app and watch as if you were at home - BBC iPlayer for UK citizens abroad.\nHow to watch 2023 Great North Run: live stream in the US without cable\nFloTrack is live streaming the Great North Run in the US. Brace yourself for some brutal timings though, with coverage set to start at 5.10am ET / 2.10am PT in the early hours of Sunday morning.\nA monthly FloTrack subscription costs $29.99, with an annual subscription costing $210.\nBoth packages give you access to the entire FloSports network, which also includes coverage of cycling, motorsport, rugby and American football, all of which can be watched on a range of devices, including iOS, Android, Roku, Fire TV, Chromecast and Apple TV.\nOut of the US and want to watch your home coverage? No worries - just use a VPN as described above.\nHow to live stream Great North Run in Canada\nIn Canada, the Great North Run is also being shown on FloTrack, which costs US$29.99 per month or US$210 for a year, the equivalent of US$12.49 per month.\nCoverage starts at 5.10am ET / 2.10am PT in the very small hours of Sunday morning.\nFloTrack covers loads of track and field events live and on demand, and offers FloTrack Originals, all of which you can watch online or on your device with the FloSport app, which is compatible with iOS, Android, Apple TV, Roku, Amazon Fire TV, and Chromecast.\nAbroad right now? A good VPN will help you tap into your home coverage no matter where in the world you are right now.\n- Something speedier? How to watch an F1 live stream\nHow to watch Great North Run 2023: live stream in Australia\nIn Australia, the 2023 Great North Run is being shown on FloTrack, which costs US$29.99 per month or US$210 for a year.\nLive coverage is set to begin at 7.10pm AEST on Sunday evening.\nAbroad right now? A good VPN will help you tap into your home coverage no matter where in the world you are right now.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nAatif is a freelance copywriter and journalist based in the UK. He’s written about technology, science and politics for publications including Gizmodo, The Independent, Trusted Reviews and Newsweek, but focuses on streaming at Future, an arrangement that combines two of his greatest passions: sport and penny-pinching.",
  "word_count": 1228,
  "scraped_at": "2026-02-14T13:37:23.360542"
}