{
  "article_id": "6170d98af4be",
  "url": "https://www.ocregister.com/2025/12/13/usc-womens-coach-lindsay-gottlieb-addresses-shooting-at-brown-university/",
  "title": "USC women coach Lindsay Gottlieb addresses shooting at Brown University – Orange County Register",
  "date": "20251214T033000Z",
  "domain": "ocregister.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LOS ANGELES — USC women’s basketball head coach Lindsay Gottlieb shared strong feelings regarding the school shooting that occurred at Brown University on Saturday.\n“The college football cycle has been in the news a million times and are we going to report about this? It’s the guns,” Gottlieb told reporters at the start of the postgame press conference that followed USC’s game against UConn.\n“We’re the only country that lives this way. Parents should not have to worry about their kids.”\nGottlieb is a 1999 graduate of Brown, where she played basketball and served as a student assistant coach for the team in her senior season.\nAs of 6 p.m., Saturday, at least two people were killed and eight were critically wounded at the Providence, Rhode Island Ivy League research university. Authorities were still searching for the active shooter, according to reports.\nStudents were taking final exams in an engineering and physics building when the shooter, who fled on foot, opened fire.\n“I have a teammate who has a daughter who is in the basement of a library because they don’t know what’s going on there, and she’s flying there tomorrow,” Gottlieb continued.\nMore than 70 school shootings have occurred in the United States this year, according to data collected by CNN. Forty-two were on college campuses and, altogether, at least 29 people have died and over 100 more have been injured.\n“It doesn’t need to be this way,” Gottlieb said. “Sending thoughts and prayers to my teammates who have kids there, to the parents who have to worry about their children. We’re the only country that lives this way.\n“I wanted to start with that because I would be remiss if I didn’t mention that. Hopefully, everyone is safe and praying for peace for those who’ve lost people. That’s more important than basketball. We can all be better.”",
  "word_count": 309,
  "scraped_at": "2026-02-14T14:19:37.606805"
}