{
  "article_id": "61759933aa23",
  "url": "https://www.thenews.com.pk/print/1140674-welfare-of-youth-top-priority-pm",
  "title": "Welfare of youth top priority : PM",
  "date": "20231222T033000Z",
  "domain": "thenews.com.pk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welfare of youth top priority: PM\nISLAMABAD: Caretaker Prime Minister Anwaarul Haq Kakar on Thursday, terming the young generation as the future of nation, said the welfare of the youth was the top priority of the government.\nChairing a meeting of the Prime Minister Youth Programme, he directed that the disbursement of loans under the Programme should be done with utmost care and responsibility. He further directed that the youth of the newly merged districts of Khyber Pakhtunkhwa should be given special attention in PM Youth schemes.\nThe prime minister ordered to evolve a special strategy to achieve the desired results of the skill development schemes.\nHe directed that training programmes should also be started for master trainers regarding skill development to increase their capacity and to impart quality training to others.\nDuring the meeting, the prime minister was given a detailed briefing regarding the PM’s Youth Programme. It was informed that 550,000 people had been trained under the PM Skill Development Programme since 2013 while some 56,000 more people would be trained mostly in high-tech skills in the next phase.\nAdditionally, it was informed that under PM Laptop Scheme, 500,000 laptops were distributed to the youth since 2013, while 100,000 more laptops would be distributed to the youth in current year.\nThe meeting was further informed that under the PM Youth Business and Agriculture Loan Scheme, easy loans worth Rs100.7 billion have been provided to the youth since 2013.\nSimilarly, some 83,323 youths were given opportunities in badminton, football, squash, volleyball and other sports under PM Talent Hunt and Sports League.\nThe meeting was informed that schemes worth Rs80 billion have been earmarked in the PM Youth Development Package 2023-24. These schemes include Education Endowment Fund, Women Empowerment, Business and Agriculture Loan, Tube-Well Solarisation, Laptops Scheme, Sports Endowment Fund, Green Revolution, Digital Hub One Window.\nSpecial Assistant to the Prime Minister for Tourism and Youth Affairs Syed Wasi Shah and other concerned government officials participated in the meeting.\nMeanwhile, caretaker Minister for Privatisation and Inter-Provincial Coordination Fawad Hassan Fawad called on caretaker Prime Minister Anwaarul Haq Kakar.\nThe caretaker minister for Privatisation and Inter-Provincial Coordination briefed the prime minister about privatisation process of the State-Owned Enterprises (SOEs).\n-\nJessica Alba, Cash Warren Finalize Divorce After 16 Years Of Marriage\n-\nChina’s AI Boom Takes Center Stage At Spring Festival One Year After DeepSeek Stirred The Industry\n-\nJames Van Der Beek Called His Sixth Child Jeremiah 'healing For Us' Before His Death\n-\nElon Musk Vs Reid Hoffman: Epstein Files Fuel Public Spat Between Tech Billionaires\n-\nGordon Ramsay Denies Victoria Beckham Got Handsy With Brooklyn At His Wedding\n-\nGordon Ramsay Makes Unexpected Plea To Brooklyn As He Addresses Beckham Family Feud\n-\nPrince Harry Warns Meghan Markle To 'step Back'\n-\nSelena Gomez Explains Why She Thought Lupus Was 'life-or-death'\n-\nNew Zealand Flood Crisis: State Of Emergency Declared As North Island Braces For More Storms\n-\nNancy Guthrie Case: Mystery Deepens As Unknown DNA Found At Property\n-\nJames Van Der Beek's Brother Breaks Silence On Actor's Tragic Death\n-\nMegan Thee Stallion On New Romance With Klay Thompson: 'I'm Comfy'\n-\nNicole Kidman Celebrates Galentine’s Day Months After Keith Urban Split\n-\nJustin Bieber Unveils Hailey Bieber As First Face Of SKYLRK In Intimate Campaign Debut\n-\nCaitlin O’Connor Says Fiance Joe Manganiello Has Changed Valentine’s Day For Her\n-\nRachel Zoe Sends Out Message For Womne With Her Post-divorce Diamond Ring",
  "word_count": 577,
  "scraped_at": "2026-02-14T14:08:10.219141"
}