{
  "article_id": "61e0acf62091",
  "url": "https://www.cityam.com/how-michele-kang-put-wsl-newcomers-london-city-lionesses-on-fast-track/",
  "title": "How Kang put WSL newbies London City Lionesses on fast track",
  "date": "20250904T094500Z",
  "domain": "cityam.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How Michele Kang put WSL newcomers London City Lionesses on fast track\nIf anyone needed any reminder, one incident this summer illustrated the depth of owner Michele Kang’s dedication to turning London City Lionesses from Women’s Super League anomalies into a European force.\nIt was while the club were in the Netherlands last month for a pre-season training camp, during which they played local side FC Twente Vrouwen, that Kang – the US-based billionaire entrepreneur turned women’s football pioneer – decided to pay an impromptu visit.\n“She was, I guess, flying over,” London City Lionesses managing director Sarah Batters tells City AM. “So she landed in Rotterdam, drove an hour and a half, watched the team for 45 minutes, then got in the car and went to her next engagement.\n“For her, it was super important to come and support that friendly in a field in the middle of Holland. She’s very involved. She’s very passionate about women’s football, very passionate about high standards and doing everything the best that we can do.\n“Of course, she’s demanding. She wouldn’t be where she was if she wasn’t, but she cares a lot. And one of the real testaments to Michele is the relationship she has with our players. She comes to matches and the training ground and the players will hug her, they’re so pleased to see her.”\nKang has also thrown her considerable wealth and influence at making London City Lionesses – the only team in the WSL not affiliated with a men’s club – a success since adding the club to her Kynisca group, which also includes OL Lyonnes and Washington Spirit, two of the leading teams in Europe and the US, 18 months ago.\nHaving achieved promotion to the WSL for the first time in May, the club have splashed the cash on no fewer than 15 new signings including former Euros winners Danielle van de Donk and Nikita Parris, and her fellow England international Katie Zelem.\n“Michele has been involved in the process of convincing the players to come and take a chance on us and to get involved in the project, because we’ve got players that have been used to playing at some of the biggest clubs,” says Batters.\nThe club, who play their home games at Bromley FC’s Hayes Lane, have also begun work on turning their Kent training ground into one of the biggest and best equipped in women’s football as they look to develop a pipeline of youth talent for the future.\nWe train women as women, not small men\nFor all these reasons and more, London City Lionesses are determined to not merely buck the trend of promoted clubs going straight back down but make their mark on the WSL and, ultimately, qualify for the Champions League.\n“I think it’s pretty clear our intention during the transfer window. Michele and the team have definitely not held back in bringing new signings into the team,” says Batters.\n“I don’t think the team that we’ve got would accept being relegated at all. It’s a completely different style of play in the WSL and the opposition is another level, so there’s absolutely no complacency. But we’re not just going to give it a go.\n“We’re going in it to succeed, to stay up, and hopefully push that top half of the table at least. Champions League is certainly the ambition.”\nLondon City Lionesses do not benefit from the financial subsidies from men’s football of the WSL’s biggest sides, Arsenal, Chelsea, Manchester United and Manchester City, nor the obvious cross-marketing opportunities that being part of a huge brand provides.\nHaving a sole focus on women’s football has its advantages, however, says Batters, who cites the constant need “to prove the business case to get anything done” at other clubs and a more dedicated set-up for nurturing and treating talent.\n“To be independent is very liberating,” she adds. “Everyone here is committed because they believe in the potential of women’s football. We’re really fortunate with Michele – there’s no compromise when we need something, we are just able to get what we need.\n“I know from experience that some of the [women’s] clubs at the top are still borrowing gyms from the academy. Man United women have just got back into their own training facility, having had to loan it to the men for a couple of years.\n“The club has a philosophy of training women as women, not small men, focusing on how they train during their menstrual cycles, what additional support [they need]. The research around women as athletes is way behind men’s, and we are investing and working with experts and focusing on that.\n“I hope that means that other clubs are thinking of it as well. But we know when we’re in football that the primary focus is always the men’s club. Our laser focus on women should give us an advantage.”\nLondon City Lionesses eye own stadium\nLondon City Lionesses are also unusual in that they can tap into expertise from their sister clubs in the Kynisca ecosystem. Batters has consulted Washington Spirit, whose game at Bay FC recently set a new NWSL attendance record, on growing fanbase, which has helped to turn home crowds from hundreds into thousands.\nThat turnout should get another bump from arriving in the WSL and the afterglow of a victory by the other Lionesses, England’s Women, at this summer’s Euros. Their name dates back to their past as Millwall Women but to avoid confusion they increasingly use London City.\n“I think it’s harder now to separate the impact of the Lionesses versus the impact of a growing league, but certainly having the girls win the Euros is only beneficial,” says Batters.\n“We don’t have any current Lionesses, but the fact that we’ll be welcoming some to our stadium is going to bring more people that want to come and watch the match. Then hopefully they have a great time and then they want to come back and they start building their fandom.”\nOn Saturday they face a WSL baptism of fire against European champions Arsenal at Emirates Stadium. It is also a handy benchmark of the level that Kang and London City Lionesses are trying to get to, with their own home a long-term goal.\n“It’s definitely something we’re interested to do,” says Batters. “There’s a real opportunity to build a stadium for women’s football, especially with the World Cup coming [to the UK] in 2035.”\nThe club’s arrival in the big time has brought them a kit deal with Nike and front-of-shirt sponsorship from female athlete-led media company Togethxr, co-founded by USWNT star Alex Morgan, snowboarder Chloe Kim, among others.\nKang remains their biggest asset, however, so amid league-level discussions on how to achieve better competitive balance it is no surprise that London City Lionesses are mindful of any measures that could disincentivise investment.\nSays Batters: “I think we need to ensure that clubs can keep investing in players. Otherwise it would be boring, right? If it’s just those top teams associated to four of the biggest men’s clubs able to succeed, I don’t think that’ll be a very interesting league to watch for the next five years.”",
  "word_count": 1203,
  "scraped_at": "2026-02-14T12:23:28.582789"
}