{
  "article_id": "61f95ac446b3",
  "url": "https://www.arsenal.com/news/uwcl-preview-arsenal-v-bayern-munich-women",
  "title": "UWCL Preview : Arsenal v Bayern Munich Women",
  "date": "20230329T131500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The stage is set for one of the biggest matches of the season so far, as we host Bayern Munich in the second leg of our UEFA Women's Champions League quarter-final.\nOur Gunners will be striving to overturn a 1-0 loss away to Bayern last week in order to reach the semi-finals of the competition for the first time in a decade\n20,000 tickets have already been sold for the tie, which is a Women's Champions League record here in the UK. It's not too late to cheer us on at Emirates Stadium tonight - purchase your tickets here!\nLast time around\nDespite Bayern Munich's slender lead heading into this clash, there are a host of positives to take from our away display at the Allianz Arena on Tuesday. Lea Schuller's header just before the stroke of half-time put the hosts in front and despite a second half to be proud of and an incredible performance from Caitlin Foord, we were unable to break through the Bayern backline.\nSince the first leg on Tuesday, both sides have recorded vital wins in their respective leagues. Our German opponents shot to the top of the Frauen-Bundesliga at the weekend following a late 1-0 win over rivals Wolfsburg. Georgia Stanway's 84th-minute penalty was the difference-maker.\nAs well as providing some much-needed momentum, our decisive North London Derby win over Tottenham on Saturday also brought us back into the title race, with very little between the four teams at the top of the WSL. With our Gunners still to play Chelsea, Manchester City and Manchester United one more time, it's still all to play for in Europe and at home.\nHow to watch\nWe kick off at Emirates Stadium at 8pm (UK) and tickets are still available to buy!\nFor those of you at home, the fixture will be streamed live on Arsenal.com.\nWhat the managers say\nEidevall on Bayern: \"They have good individual players: goalkeepers, central defenders, fullbacks and so on. But you also can see that they're a very well-organised team. They work very hard together collectively.\n\"With the away goals rule, a result like this would have been really complicated to manage. Now, it is not complicated. We just need to win the football match.\"\nStraus on us: \"The last few weeks have been very tough and tiring, but confidence is high after the last two matches. The players are dealing with the huge strain brilliantly at the moment.\n\"We're in the hard period of the season and you have to be able to deal with that if you want to be champions. We want to present the best version of ourselves in tomorrow's match.\"\nLina Magull on us: \"We're aware of what Arsenal are capable of, that they want to have a lot of the ball and are very good on the ball. We saw that last week, which is why we want to make sure we have more possession ourselves and execute our attacks better.\n\"We didn't do that so well at the Allianz Arena last week. Despite that, though, we can travel to London confidently on the back of two important wins.\"\nTeam news\nSteph Catley misses out again with a foot injury. Jonas Eidevall noted that Lina Hurtig will miss out on the next international break with Sweden because of foot surgery but that she will be available to come off the bench against Bayern.\nLong-term absentees Beth Mead and Vivianne Miedema remain on the sidelines with ACL injuries. The contact injury Gio sustained against Tottenham at the weekend is not expected to be long-term. The Brazilian winger cannot feature in this fixture as she is not a part of the Champions League squad.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 644,
  "scraped_at": "2026-02-14T12:44:50.661537"
}