{
  "article_id": "620beef45eba",
  "url": "https://www.dailymail.co.uk/femail/article-12238625/Im-personal-trainer-workouts-need-body-like-Kate-Middleton.html",
  "title": "Im a personal trainer and here are the workouts you need to do to get a body like Kate Middleton",
  "date": "20230701T090000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Want a body like Kate's? I'm a personal trainer and here are the workouts you need to do to get a toned figure like the Princess of Wales (and you might be surprised)\n- The Princess of Wales, 41, is known to lead an active and healthy lifestyle\n- For all the latest Royal news, pictures and videos click here\nWhat's the secret behind Kate's fabulous figure?\nWell if you ask her uncle Gary Goldsmith, it's her mother Carole.\n'Carole has always looked after herself and eaten healthily,' he's said in the past.\n'And she has a stunning figure. That mentality of considering your diet and exercise is evident in the girls [Kate and Pippa] also.'\nEvident indeed.\nThe Princess of Wales runs, swims, plays tennis and hits the gym along with numerous other exercises. Pippa is equally active.\nJust this year, Kate revealed how she loves to join in with her three children whenever they play sport.\n'I do it all,' she said. 'Whenever I can squeeze in exercise I do, even jumping on the trampoline with the children before school.'\nSo just what exercises does it take to get the Princess of Wales's toned arms and sculpted legs?\nHere, Fitness First personal trainer Ray Gabriel-Anyassor reveals all to MailOnline (and you might be pleasantly surprised...)\nA personal trainer has shared their expert tips on what exercises are best to get a body like Kate's\nWant to get toned like Kate? Look no further. Follow these simple tips for workouts recommended by fitness expert Ray\n'The key to achieving a strong body like Kate is consistency and discipline,' Ray reveals.\n'Kate is in fantastic shape – she looks lean, toned and strong.\n'Genetics plays a great role in the composition of our bodies and for the lucky ones, their natural body shapes may take a little less work to look like Kate’s.\n'However, for most of us, a disciplined fitness routine and diet is paramount to achieving a toned look.\n'Just like Kate, a regular and consistent training plan can help you achieve that toned look by helping you build muscle.'\nHe added: 'I imagine that the Princess combines weight training with something like Pilates, which focuses on improving muscle tone.'\nAs seen in our graphics above, Ray recommends incorporating squats, skipping, dumbbell bicep curls and Russian Kettlebell swings into your workout routine.\n'Aim to hit these exercises for 8-12 reps, 4 sets of each,' he said.\n'Pair opposing muscle groups on the same day (for example biceps and triceps with quads and Hamstrings/glutes)'.\nRay also believes walking up an escalator, doing chores around the house and walking around the supermarket has more benefits that you may think.\nHe said: 'These small activities increase our daily calorie expenditure and help to keep us in a calorie deficit – this is the key to fat loss. Ensuring that you do these things as part of your normal day will help you towards your fitness goals without feeling like you’re putting in extra 'work.'\nThe Princess of Wales has achieved perfectly toned arms thanks to her extensive fitness routine. Pictured at the Guards Polo Club on July 6, 2022 in Egham, England\nSpeaking about Kate, he continued: 'Given her busy schedule, we can assume that she gets a portion of her cardio from her busy, active lifestyle – walking, running, skiing or playing a sport such as tennis.\n'Luckily, you don’t need to train for hours on end to achieve this. Most of us feel like we don’t have enough time in the day to fit in working out too.\n'However, all you need could be 45 minutes a day, 3-4 times a week to achieve a strong toned body. If you’re short for time, prioritise full body weight training workouts and an anaerobic ‘finisher’ to end your session.'\nAnd Ray believes that your time in the kitchen matters just as much as working out in the gym.\n'Upping your protein intake will help you feel fuller with less food,' he said.\n'And it is essential for muscle growth and maintaining muscle mass. Aim to get protein in with every meal.\n'Some great high protein foods are: chicken, turkey, salmon, eggs, cottage cheese, nuts, tofu and quinoa.'\nSo what are sporty Kate's favourite exercises?\nTennis\nKate is a big fan of tennis and attends Wimbledon every year. Roger Federer proved no match for the Princess of Wales when they met on a Wimbledon tennis court last month\nKate pictured with Roger Federer as they played on Wimbledon's Number 3 court last month\nAlthough many remember Kate's love of hockey from her school days, the royal was, in fact, most devoted to tennis and has carried her fondness for the sport through to adulthood.\nJust last month the royal, 41, appeared in a video with tennis champ Roger Federer, 41, to highlight the work of ball boys and girls at the upcoming Wimbledon tournament.\nDuring the four-minute video the Princess of Wales is seen serving against Federer - who has won the championship eight times.\nAt one point, Kate even managed to get a shot past the Swiss star, prompting him to exclaim: 'I think it was on the line. Amazing!'\nHowever, the retired champ isn't the only famous name to challenge the Princess, as in 2021, she faced off against British ace Emma Raducanu for a friendly spar.\nKate was all smiles when playing tennis with British US Open champion Emma Raducanu in September 2021\nThe 20-year-old tennis prodigy declared that she was 'very impressed', adding: 'Her forehand was incredible!'\nKate used to be spotted playing the sport at the Hurlingham Club in Fulham, where annual membership costs from £1,600-a-year when she and the Prince of Wales were based at Kensington Palace in London.\nThe royal was a regular at the private members' club and took tennis lessons for many years, becoming a 'good minor athlete' with a 'nice top spin', according to one report.\nAlong with their children, Prince George, Princess Charlotte and Prince Louis, Kate and William were also said to make the most of their tennis court in Anmer Hall in Norfolk when staying at the residence.\nMuscle-Tightening Exercises\nKate enjoys CrossFit, callisthenics and aerobic exercise, skipping, indoor rowing and intense interval training. Pictured trying a strength training exercise during a visit to Landau Forte College Derby in February\nWhen it comes to her fitness go-to, Kate’s secret is apparently ‘The Plank’, an exercise that requires no equipment, just core strength.\nOne royal insider previously revealed: ‘Kate is an exercise junkie. Pippa and Kate take their toned physiques extremely seriously. And mother Carole, in her 60s, is in extremely good shape.’\n‘[The plank] tightens her muscles,’ says the source. ‘There are three elements, the basic plank, the side plank and the prone sky dive, all of which are positions Kate can hold for 45 seconds or longer and repeat at least ten times each.’\n'So what do they involve? The basic, or ‘front’ plank means you hold a position similar to a push-up, resting on forearms and tiptoes, for the maximum possible time to strengthen your back, shoulders and abdomen.\n‘The side plank requires you to balance on your side, holding your body straight with feet together and one arm flexed directly under your shoulder.\nWhen it comes to her fitness go-to, Kate’s secret is ‘The Plank’, an exercise that requires no equipment, just core strength (stock image)\nThe Princess of Wales put her core strength to the test in a spin class during a visit to Aberavon Leisure and Fitness Centre in Port Talbot in February\n‘Meanwhile, the prone sky dive plank is slightly less excruciating, as you have to lie on your tummy and gently raise your chest off the floor until your tummy muscles beg for mercy.’\nWhile that might be enough for most of us, not Kate. The Princess also enjoys CrossFit, callisthenics and aerobic exercise, including cycling, skipping, indoor rowing and intense interval training every morning, a regime which takes her an hour.\nWhile spinning isn't something that the royal has mentioned in the past, her cardio training certainly came in useful during a visit to Port Talbot, Wales, in February where she and William battled it out on the bikes.\nDespite wearing a skirt and heels, Kate came out on top in the end.\nAnd, to calm her mind and stretch her active muscles there’s yoga, ‘which she adores, it keeps her supple. Seated poses — known as asanas — are a Middleton favourite.\nKate is also said to enjoy Pilates.\nHockey\nWhile visiting her old school, Kate took part in a day of activities and festivities to mark the occasion of St Andrew's Day at St Andrew's School in November 2012\nAn avid sportswoman, Kate was captain of the hockey team of St Andrew's prep school in Berkshire, where she studied from 1986 to 1995.\nDuring a visit to the prep school in 2012 where she opened its new Astroturf hockey pitch, the Princess of Wales described her time at St Andrew's as some of the 'happiest years of my life.'\nKate said: 'It was while I was here at school that I realised my love of sport. Sport has been a huge part of my life, and I feel incredibly grateful for the opportunities I had to get outside and play in such wonderful open spaces - though sadly there was nothing quite as glamorous as this in my time.\n'I hope that you all enjoy playing sport here as much as I used to, and make the most of these incredible facilities.'\nRugby\nKate joined in with drills on the pitch during her visit to Maidenhead Rugby Club on June 7\nKate, who took over Prince Harry's former role as England's rugby league patron in February last year, previously shared how she enjoys playing rugby with her children.\nNigel Gillingham, who is President of the Rugby Football Union, told Town & Country, he explained: 'She was telling me that she regularly plays rugby with her children in the back garden—and lots of other sport.'\nNigel also said that Kate has observed that her daughter Princess Charlotte can get 'very competitive' while playing rugby with her brothers - showing the apple doesn't fall far from the tree.\nPictured in February 2022 during a visit to Twickenham stadium where she met with the England's team players\nAnd earlier this month, Kate proved how she is always ready for action as she arrived at Maidenhead Rugby Club in her sports gear and got stuck into drills.\nAlthough the athletic princess got stuck into the activities, she had to be reminded during the drills that it was 'walking only' which led her to reply: 'Sorry, sorry!'\nIt was harder work than it looked forcing herself not to run, she later said. But she was still able to leap athletically and even twirl as she caught the ball and threw it to her teammate Courtney Lawes, who later declared her a ‘very good’ player.\nAdditionally, during an appearance on House of Rugby, Mike Tindall was asked which royals he'd include in his dream rugby team. 'I've got the Duchess of Cambridge on one wing because she loves running, she can run all day. Engine!' he replied.\nRunning\nKate pictured during a SportsAid event at the London Stadium in Stratford in February 2020\nSince her early days at school, it was reported that Kate is a fan of cross country, and just like her sister Pippa, is known to enjoy running to keep fit.\nWhile living in Norfolk, the then-Duchess of Cambridge always did her best to find time to run as often as possible, having enjoyed long runs with the family dog Lupo by her side before he passed away.\nAnd being a busy mother of three didn't stop Kate, as sometimes she even ran with a young Princess Charlotte in her buggy.\nSailing\nIn 2007, sporty Kate took part in the Sisterhood rowing Challenge to raise money for charities, and was spotted training with her teammates on the Thames\nThe Princess also took part in the King's Cup regatta at Cowes on the Isle of Wight against Prince William back in August 2019 in support of their chosen charitable causes\nThough Kate is only considered an amateur sailor, as a working royal, the Princess of Wales has taken part in several sailing events, never hesitating to hop on board to ride the waves.\nWhen out on the water, Kate's upper body, core and arm strength are put to the test as the sport involves pulling lines, as well as hoisting and trimming sails.\nHaving enjoyed sailing since she was young, Kate will have mastered the art of putting her muscles to the test and will have built up the endurance to power through an entire race.\nBefore her marriage to Prince William, she even took part in the Sisterhood Challenge, a rowing event where women of all sporting abilities could take part to raise money for a selection of charities close to the organisers' hearts.\nWhat is Kate's diet like?\nNot only is a strict fitness regime at the top of Kate's list for keeping fit but so is a healthy diet based around nutritious home-cooked meals.\nOne source previously told the Mail: 'She drinks smoothies morning and afternoon, containing spirulina, kale, matcha, spinach, romaine, cilantro and blueberries.\n'Her organic diet is rich in antioxidants and she adores salads and bowls of seasonal fruits.'\nAnd when the Princess wants to add a little sweetness to her drink, she whizzes berries along with almond milk.\nBack in January, the Prince of Wales boasted that his wife is a 'very good' cook as he took part in a cooking class for young carers.\nHe said: 'I do a bit of cooking, not much though. Catherine’s very good though.'\nWilliam has gushed about how good Kate's cooking is (pictured the princess taking at a Big Lunch at St Luke's Community Centre in 2018)\nSome of the mother-of-three's favourite recipes include soups, salads, curries and her children's go-to dinner, cheesy pasta.\n'In the evenings she indulges her hobby of cooking William's favourite supper, roast chicken,' a report from Vanity Fair claimed in 2012.\nIf you're a lover of desserts, there is no need to worry. The Princess of Wales also saves room for a sweet treat every once in a while.\nThe family's former personal chef, Darren McGrady, previously said that the classic British sticky toffee pudding is her favourite.",
  "word_count": 2423,
  "scraped_at": "2026-02-14T12:00:07.399796"
}