{
  "article_id": "6261816d2943",
  "url": "https://www.winnipegfreepress.com/uncategorized/2025/03/18/juju-watkins-driven-to-lead-top-seeded-usc-on-deeper-run-in-womens-ncaa-tournament",
  "title": "JuJu Watkins driven to lead top - seeded USC on deeper run in women NCAA Tournament – Winnipeg Free Press",
  "date": "20250318T150000Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "JuJu Watkins driven to lead top-seeded USC on deeper run in women’s NCAA Tournament\nAdvertisement\nLOS ANGELES (AP) — JuJu Watkins grew up tuning into the NCAA Tournament and making her own bracket.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nLOS ANGELES (AP) — JuJu Watkins grew up tuning into the NCAA Tournament and making her own bracket.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 18/03/2025 (333 days ago), so information in it may no longer be current.\nLOS ANGELES (AP) — JuJu Watkins grew up tuning into the NCAA Tournament and making her own bracket.\nNow, it’s the super sophomore’s time to shine, leading No. 1 seed Southern California in pursuit of a deeper run than its Elite Eight appearance a year ago.\n“Every year the goal is to break others’ opinions,” she said.\nThe Trojans (28-3) host 16th-seeded UNC Greensboro (25-6) in a first-round game Saturday at Galen Center.\nUSC was the Big Ten regular-season champion in its first year in the league, losing to crosstown rival and overall NCAA Tournament No. 1 seed UCLA in the tournament title game. The Trojans’ other defeats were to Notre Dame and Iowa.\nWatkins is averaging 24.6 points — 2.5 less than last year — and 6.9 rebounds while playing 35 minutes a game. She’s notched six games with 30 or more points, her best being a 40-point effort against California Baptist.\nLast season, Watkins led USC to the program’s deepest run in the NCAA Tournament in over 25 years. She was the nation’s No. 2 scorer, averaging 27.1 points, and she led all freshmen in scoring with a record 920 points. She had 14 games with 30 or more points, including a 51-point outburst at Stanford, the most points by any men’s or women’s player in the nation.\nStill, the urge to be better is always there.\n“She looks at what she can improve first. She never points a finger at somebody else,” USC coach Lindsay Gottlieb said. “It’s always where can she grow and that’s a pretty remarkable trait for a 19-year-old.”\nPart of Watkins’ support system is Phil Handy, a 53-year-old former Los Angeles Lakers assistant who coached in the women’s Unrivaled Basketball League this season. They met through a mutual family friend when Watkins was in eighth grade.\n“I saw the drive in her, I saw her curiousness, what does it look like to be great,” Handy recalled in a phone interview.\nWatkins credits Handy for being “very there for me.” He views himself as her “trainer, coach, big brother, uncle.” They text regularly and watch game film together over Zoom. When Handy is in town, they hit the gym.\n“Whenever there’s work to do, she’s never saying no,” he said.\nThrough watching more film this season, Watkins has toiled to match her basketball knowledge with her formidable skills on the court.\n“She’s really challenged herself in that way to become a smarter player to where she understands how to read defenses and what teams are doing,” Handy said.\nWatkins chose to attend college in her hometown — just a few miles from her primarily Hispanic and Black neighborhood of Watts — and the community comes out to support her. Men, women and children of all ages and races clamor for photos and autographs after games and Watkins patiently rewards them.\n“She’s pretty remarkable in how she handles the sort of craziness around her,” Gottlieb said. “She’s a natural introvert.”\nA massive three-panel mural of Watkins wearing her iconic bun in a Nike ad went up on a building in downtown Los Angeles last month.\n“How cool,” Gottlieb said, “but she shows up here and I tell her to play better defense or make the right read. She’s so coachable and humble.”\nWatkins downplays talk of her succeeding Caitlin Clark as the face of women’s college basketball.\n“I think it’s an honor, but I don’t really think about that much,” she said. “The main goal is just staying present here and handling business.”\nHer off-court business overseen by Klutch Sports is thriving. She has NIL deals with Nike, Fanatics, snack maker Mondelez, United Airlines, Degree deodorant, State Farm, Gatorade and collectibles company Funko, among others. Her NIL valuation is one of the highest in the country at an estimated $739,000, according to On3.com.\nWatkins is bolstered by her family, including parents Robert and Sari, both former college athletes who are ever-present in the front row. Her sister, Mali, sometimes sings the national anthem at games.\n“They always tell me, ‘Just go out there and do you,'” she said.\nSeeing Watkins in person has become a hotter ticket. The Trojans’ average home attendance rose to 5,932 this season from last year’s 4,421. Celebrities like Snoop Dogg, Kevin Hart, Jason Sudeikis, Michael B. Jordan and Sanaa Lathan, who starred in “Love & Basketball,” one of Watkins’ favorite movies, have showed up. The year before she arrived attendance averaged 1,037.\n“We’re trying to make it feel like football,” she said, referring to USC’s biggest sport. “That’s my goal here, to make it feel like a big thing.”\nWatkins, of course, is the main focus of opposing defenders who by now know her go-to spots on the floor and try to take them away. But she’s got a running mate in forward Kiki Iriafen, a graduate transfer from Stanford who returned to her hometown.\nIriafen’s 18.2-point average is second to Watkins while her field goal, 3-point and free throw averages are all higher than the sophomore.\n“She’s raising my IQ in all ways and pushing me to be a better player,” Watkins said.\nUCLA coach Cori Close has seen Watkins up close, with the Bruins losing two of three to the Trojans this season. Close cites Watkins’ “elite-level work ethic” as one of the reasons she’s so good. Watkins is known for hitting USC’s gym at night to put up hundreds of shots, similar to the late Kobe Bryant’s diligence.\n“When you’re driven by success sometimes there is no balance,” Handy said.\nLast year, a loss pushed Watkins to lonely hours of work, but she’s learning moderation.\n“Sometimes it’s OK to walk away from it for a little bit,” she said. “I’m watching ‘Severance’ right now. Just watch a TV show, chill and get back to it the next day.”\nWatkins’ placid facial expression belies whatever is happening on the court. Behind closed doors, however, Handy sees her fiery side when she misses shots or doesn’t pick up something as quick as she expects.\n“She just has an appetite,” he said. “It definitely reminds you of great athletes before her time, the Kobes, the MJs, the women’s players.”\nIt’s almost go-time for the Trojans and that means Watkins is narrowing her mental focus.\n“Now I’m kind of in this space where nothing else is around me,” she said. “Just go tunnel vision for as long as possible.”\n___\nAP March Madness bracket: https://apnews.com/hub/ncaa-womens-bracket and coverage: https://apnews.com/hub/march-madness",
  "word_count": 1350,
  "scraped_at": "2026-02-14T12:43:02.458105"
}