{
  "article_id": "626f0e0e9c63",
  "url": "https://www.aol.co.uk/articles/visit-nature-filled-corner-turkey-050000777.html",
  "title": "Visit this nature - filled corner of Turkey before it discovered by the crowds",
  "date": "20250926T131500Z",
  "domain": "aol.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Visit this nature-filled corner of Turkey before it’s discovered by the crowds\nYou won’t be able to thank “Kaptan June” in person, although you’ll feel like hugging her by the end of your time in Dalyan. She died from Covid three years ago, aged 100, and a memorial has been erected in her honour in the Kaunos Tea Garden area of the town. There you will find the Essex-born conservationist, better known outside this beautiful corner of Mugla Province as June Haimoff MBE, standing sentinel over a loggerhead sea turtle (Caretta caretta).\nThe tribute is in recognition of her work from the mid-1980s onwards to preserve the endangered species (and more besides), and if you want to see why she was so motivated, and how her efforts over 35 years have been rewarded, just saunter to the bank of Turkey‘s Dalyan River, which runs behind her statue. Before long, one or two of these large, graceful creatures will break the surface on the journey to or from Iztuzu Beach.\nIf you’re not a turtle or the skipper of a boat, the easiest way for you to get to the beach is in a dolmus (minibus). You can catch one every 15 minutes from a small rank near the mosque in the centre of town. It will cost 100TRY (£2) for a round trip, take a quarter of an hour and drop you off near “Kaptan June’s” baraka – or beach hut – and also the Sea Turtle Research, Rescue & Rehabilitation Centre (RR&RC) she helped establish in 2009.\nRead more: The best hotels in Istanbul for 2025, reviewed\nBut hold back before you visit the inpatients at the RR&RC. Stop before you hire a sun lounger next to the small metal frames guarding the loggerheads’ eggs in the sand. Look around. It’s not hard to appreciate why Haimoff fell in love with this narrow spit of land separating the Mediterranean from the freshwater delta of the Dalyan River. She first saw it in July 1975 and, after several return visits, finally moved into her baraka nine years later.\nOutrageous plans to redevelop the area soon prompted her to start a campaign that, in modern terminology, became viral and would subsequently involve Greenpeace, the World Wildlife Fund and the Duke of Edinburgh. By September 1987, she had succeeded in stopping the building of a huge 1,800-bed resort-hotel on the spot where the dolmus now drops you off. Delightfully, the literal and metaphorical ruins of that crass act of corporate vandalism are still there to enjoy today.\nThe Turkish government issued a protection order to stop any future development the following year and, due to Haimoff’s passion and activism, the village along the banks of the snaking River Dalyan has been able to grow into a town and prosper at a more sedate pace over the last four decades. In so doing, it has been saved from becoming just another identikit Mediterranean playground for the party crowd.\nTrue, there is a busy main drag (Maras Street) a block inland from the waterfront that looks like it could be in any typical resort – sunburned Britons, lively outdoor bars with huge TVs and “I Shot the Sherriff” on repeat, fast food joints and shops over-stocked with “genuine fake” White Fox and Stussy and counterfeit football shirts (although not Man United these days) – but it just feels different.\nIt’s as though somebody at some point decided that Dalyan should probably have one of those “busy main drag” things, but their heart wasn’t really in it.\nThe cagirci employed to attract your attention and persuade you to enter their establishments are charming here rather than insistent; the ice cream stalls are manned by young members of the family that own them, and the bar staff and merchants seem both born to serve with a smile and cut a fair deal. Businesses and restaurants with real soul co-exist quite naturally in the same space as karaoke bars, sex-on-the-beach cocktails and all-day breakfasts. The Unique Art Gallery at the far end of Maras Street is a case in point.\nRead more: Inside the Turkish resort that’s gone from cheap to A-list hangout\nIf you can get past the imperious white cat who, much to the faux irritation of the shop owner Kenan, has taken up residence on the front step of his shop (“I call it ‘Cat’, it thinks it owns the place and it’s not even mine, I just feed it”), you’ll be rewarded with an air-conditioned Aladdin’s cave as a refuge. Huge Russian pine cabinets display intricate silver and gold bijouterie garnished with gemstones. Beautiful ceramics and textiles sourced from all over Turkey keep them company.\nThe jewellery pieces are designed and made by the owner. They are weighed on the counter before he calculates (what turns out to be) a very reasonable price. To browse there for half an hour before going back to the “noise and the haste” outside is, as the poet Max Ehrmann put it, “to remember what peace there may be in silence”.\n“Cat” is only one of many well fed and neutered stray felines around Dalyan – cared for by charities such as Arthurs’ Legacy Cat Sanctuary and Cat Paws – and you’ll find several more under the tables at Saki, just around the corner. This is a fabulous restaurant famous for never having had a menu since it opened more than a decade ago. Instead, a charming young man with excellent English takes you through a choice of over 30 mezes kept in a chilled cabinet and recommends combinations and wine options (2500TRY/ £50 for two). The cute Rabbit Hole vegan and veggie restaurant across town and the calorific Parla Bakery & Pastry shop close to the dolmus rank compete for the best eating experience in Dalyan, but Saki’s location and walnut feta dip just about edge it. We went twice in a week.\nFast food it isn’t, but as you wait to be indulged, you might want to look across the river and take in the floodlit Lycian tombs that were carved high into the cliffside in 400 BC. Just 50TRY (£1) for a return crossing in a rowing boat taxi the next morning proves the sublime ornate facades designed to mimic temple architecture to be unforgettable at close quarters. A 20-minute walk away lies the ancient city of Kaunos, responsible for their existence.\nFounded in the 10th century BC and abandoned in the 1400s before being rediscovered in the 1840s, this was once an important port under the Persians, Alexander the Great and the Romans, among others. A stranger to tranquility, it was also subject to frequent attacks from Muslim pirates and various Turkish tribes. Excavations have uncovered a heritage including an amphitheatre, acropolis, temples, baths and city walls.\nIt is an unbelievably well-preserved footprint of a city that requires little effort to imagine as bustling but, by contrast, there are only a handful of paying visitors (14HRY or £7) milling about today. Without a guidebook, you could visit Dalyan and leave without realising what you have just missed. The town makes no noise about its storied ancient neighbour across the river – there aren’t even any signposts to the site until you’re on top of it.\nRead more: The best cities to visit in Turkey\nThe only plausible reason for his uncommon humility is that, despite being only 15 miles from Dalaman Airport and a Jet2 destination, the town is still infused by the spirit of June Haimoff and refuses to surrender itself to the mass tourism of resorts like Marmaris just 50 miles away. For as long as it lasts, this is a very good thing.\nWe stayed a five-minute walk away from the centre of Dalyan at the Turay Hotel. Medium-sized and unpretentious, it is a value-for-money, family-run place on the riverbank with friendly staff and a jetty where you can take breakfast. They are as oblivious as the indolent cats asleep on the dinner tables to the constant boat traffic taking tourists on river trips to and from the huge Lake Koycegiz.\nThe town that shares its name with the lake is a one hour boat ride away, and people make the journey for market day on Monday, but Dalyan has a superior market day of its own on Saturday. Head past the fake designer goods and on to the covered produce market. It is a complete assault on the senses that has probably been hitting the unprepared just as hard since the old women chewing seeds behind the stalls were young girls.\nRead more: How I fell for frenetic Istanbul\nTubs of dayglo spices, cocky young porters pushing each other around, the smell of fresh honeydew melons in the back of a truck and free samples of familiar foods that confound expectations can all be found here. Accept that you are not leaving without making a purchase, and take cash. You will always need cash in Turkey (government taxes make businesses extremely reluctant to accept cards, although they will if left with no option).\nA tight roll of 3000TRY (£60 without drinks) will buy two tickets for a four hour Moonlit cruise to the middle of the glass-smooth lake for a BBQ on the boat, a swim in the gathering gloom, and then 39C thermal baths and a sulphur-smelling mud bath at Sultaniye on the way back. It is advisable to get tickets at least a couple of days before, as the trips from both the hotels and the town are incredibly popular.\nYou will disembark at about 11pm. The compact size of Dalyan means that whatever you intend to do next will be less than 15 minutes away, so you should definitely have time to visit “Kaptan June” at her monument. Without the “Mother of the Caretta carettas”, you would not be standing in this almost hidden gem on the Mediterranean coast. Go on, give her a hug.\nHow to get there\nA number of airlines, including British Airways, Jet2 and easyJet, offer direct flights to Dalaman, Turkey. Flight time is around four hours. From Dalaman, Dalyan is a 45-minute drive, which is best done via a hire car or transfer.\nRead more: Where to stay, eat and visit in Cappadocia",
  "word_count": 1712,
  "scraped_at": "2026-02-14T13:21:31.940746"
}