{
  "article_id": "627397aaf21a",
  "url": "https://www.nbcphiladelphia.com/news/business/money-report/pro-pickleball-players-are-now-getting-a-higher-salary-than-wnba-nwsl-players/4059073/",
  "title": "Pro pickleball players are now getting a higher salary than WNBA , NWSL players",
  "date": "20241219T224500Z",
  "domain": "nbcphiladelphia.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- Pro pickleball's metrics are on the rise in its first year as a unified professional sport.\n- The average pay of players on the PPA Tour and MLP was $260,000, the league said.\n- The unified league, called the United Pickleball Association, has helped create efficiencies and opportunities across the business.\nPickleball is paying off for America's best players.\nStream Philadelphia News for free, 24/7, wherever you are with NBC10.\nThe Professional Pickleball Association said on Thursday that the league is seeing growth in everything from attendance to players, and even salary.\nIn fact, the average pay of the more than 60 women on the PPA Tour and Major League Pickleball was $260,000, according to the league. That is more than the highest-paid WNBA player's annual salary and more than double the average salary of National Women's Soccer League athletes.\nThe league said pro pickleball players earned more than $30 million collectively. This is based on salary alone and does not include endorsement deals.\nPro pickleball has come a long way since its inception.\nLast December, some players formed a collective to voice their concerns about the future of Major League Pickleball after they were asked to take a 40% pay cut.\nIn February, Major League Pickleball and the Professional Pickleball Association completed their long-awaited merger, creating the United Pickleball Association. The deal also included $75 million of outside investment.\nThe PPA Tour and Major League Pickleball retained their own distinct brands. The PPA Tour features an individual bracket-style tour, while MLP is a team-based format.\nSince the creation of the United Pickleball Association, the off-court drama has died down and the league has been working to refine its product and its business, led by stars like 17-year-old Anna Leigh Water, and top players Federico Staksrud and Ben Johns.\n\"It's just these immense efficiencies that came about as we were able to merge, and as a result, it was great for our business,\" said Samin Odhwani, United Pickleball Association's chief strategy officer.\nOdhwani said being under one umbrella created cross-promotional opportunities for players and also opened doors with sponsors and their sales team.\nAs a result, the sponsorship business grew by 50% year-over-year with more than 50 sponsors across both the PPA Tour and MLP brands.\nOdhwani projects that UPA revenue should top $100 million in the next few years.\nViewership and interest also remain strong. In 2024, the league said 320,000 fans attended PPA Tour and MLP events, up 40% from the year prior. It also marked the first year in which revenue from ticket sales surpassed revenue from amateur registration, the league said.\nFans tuned into 350 hours of pickleball television in 2024 across Fox, CBS, ESPN, Amazon Prime, Tennis Channel and others, according to the UPA.\nPickleballTV, a joint venture between the UPA and the Tennis Channel, said fans watched more than a billion minutes of the sport this season.\n\"2024 was the best year ever for pro pickleball,\" Odhwani said. \"We had 320,000 plus attendees at our events, 27,000 amateurs playing and candidly, just a unified league.\"\nHeading into the new year, UPA said its priorities include expanding media rights partnerships, growing the amateur business and continuing to build existing pros into household names in the world of sports.",
  "word_count": 544,
  "scraped_at": "2026-02-14T12:18:17.284851"
}