{
  "article_id": "6292fc145798",
  "url": "https://punchng.com/oshoala-quits-barca-joins-bay-fc/",
  "title": "Oshoala quits Barca , joins Bay FC",
  "date": "20240202T041500Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Super Falcons forward, Asisat Oshoala, bid farewell to Barcelona Femini fans in an emotional post on Instagram on Thursday as she confirmed her departure from the club to join National Women’s Soccer League club Bay FC, The PUNCH reports.\nOshoala completed her move to Bay FC on Thursday after signing a two-year deal with an option of another year for a reported fee of $162,000.\n“As I bid farewell to this incredible team and the city that has been my home for the past five years, I am filled with mixed emotions,” Oshoala said in a post on Instagram.\n“It has been an absolute honor and privilege to wear the Barcelona Femini jersey and represent this prestigious club.\n“Since joining the team in 2019, I have had the opportunity to be a part of some of the most memorable moments in the club’s history. Together, we have lifted several trophies and these achievements are a testament to hard work, dedication and I feel privileged to have been a part of this team.”\nThe former Liverpool and Arsenal forward joined Barcelona permanently on a three-year deal after an impressive loan spell from Chinese side Dalian Quanjian in 2019.\nShe went on to make 162 appearances in all competitions for the club, scoring 117 goals, including a record-setting season feat in 2022, when she was the joint top scorer in the league with 19 goals.\nThe two-time Ballon D’or nominee top the scorers chart three times in Spain, helping the club win the UEFA Women’s Champions League twice in 2021 and 2023, four league titles, three Spanish Super Cups and the Copa de la Reina three times.\nShe is the first African woman to win the UEFA Champions League in 2021 and also score in the Champions League final in 2019.\nShe added, “But beyond the trophies and accolades, what I will cherish most are the relationships I have built with some of my teammates, coaches, staff and the amazing fans. You have become my family and I will forever be grateful for the love and support you have shown me.\n“As I embark on a new journey, I want you to know that Barcelona Femini will always hold a special place in my heart. I will carry with me the memories, lessons and friendships that I have gained during my time here.”\nReacting to her arrival at the club, Bay FC General Manager Lucy Rushton, believes the Nigerian will bolster the club with her quality.\n“To have the opportunity to add a player of Asisat’s quality, experience and winning pedigree to our roster is an exciting and important day for the club and the NWSL,” Rushton told the club website.\n“She (Oshoala) brings a top-class mentality to the field combined with pace and technical ability that allows her to lead the line, while also giving those players around her the license to be creative and thrive in space. Asisat is a proven goal scorer at the most elite levels of World football, and she comes here to continue that with Bay FC.”\nThe six-time CAF Player of The Year winner will occupy an international roster spot and joins the team pending the receipt of her P-1 visa and International Transfer Certificate.",
  "word_count": 540,
  "scraped_at": "2026-02-14T12:41:19.369806"
}