{
  "article_id": "629e93aa4b3f",
  "url": "https://www.longislandpress.com/2023/02/22/jeff-teat-riptide-lacrosse-li/",
  "title": "Jeff Teat , Riptide Expanding Lacrosse Foundation on Long Island",
  "date": "20230222T180000Z",
  "domain": "longislandpress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jeff Teat, Riptide Expanding Lacrosse’s Foundation on Long Island\nJeff Teat could be one of the best athletes you have never heard of, and if you have heard of him, you might not fully appreciate what he’s doing.\n“We’re watching Wayne Gretzky,” New York Riptide General Manager and Executive Vice President Rich Lisk told the Long Island Press. “This is what Gretzky was and how he was.”\nThose are lofty expectations to put on the shoulders of the 25-year-old Brampton, Ontario native. After all, Gretzky is far and away the greatest hockey player of all time and the ultimate monopolizer of the record books of the National Hockey League (NHL).\nBut in Canada’s other main athletic export, box lacrosse, Teat is piecing together an impressive resume.\nHe was a collegiate standout at Cornell, earning three United States Intercollegiate Lacrosse Association (USILA) All-American honors and two Tewaaraton Award nominations, which are given annually to the player deemed the best in the National Collegiate Athletic Association (NCAA).\nHe is one of just three players ever to be drafted first overall by teams in both the outdoor Premier Lacrosse League (PLL) and the indoor National Lacrosse League (NLL). During his rookie season for Atlas — one of eight teams that are not aligned with home cities and play their games at touring neutral sites — he finished second in the PLL in scoring, won the Rookie of the Year Award, and was a finalist for MVP.\nIn his first NLL season, he set a rookie record for assists and points and, again, was named Rookie of the Year. This season, in just nine games, he’s leading the league with 34 goals, ranks fourth with 40 assists, and is second with 74 points — and he is doing all that right here on Long Island for the Riptide, the only professional lacrosse team in what is considered the hotbed of the sport in the United States.\n“I definitely knew Long Island has a great lacrosse atmosphere,” Teat told the Press. “The one thing that stands out to me is that it’s a tight-knit community… really passionate. They really just love the game of lacrosse, either playing it or watching it.”\nBeginning play in December 2019, the Riptide has brought indoor, also known as box, lacrosse back on Long Island to Nassau Coliseum after the disbanding of its predecessors, the New York Saints (1989-2003) and New York Titans (2006-2009).\nCompared to the more traditional outdoor (also known as field) lacrosse — which is played on a field measuring 360 feet long by roughly 200 feet wide — box lacrosse is played on an artificial surface with smaller nets measuring just 4 feet by 4 feet within the confines of a hockey rink. That’s approximately 200 feet in length and 80 feet in width.\n“There are such small quarters, small nets, and it’s super physical,” says Armando Polanco, content distributor and marketing agent for Madison Square Garden (MSG) Networks. “You’re literally just killing each other — it was right up my alley and perfect for my kind of style of play. I just couldn’t get enough of it and I just fell in love with it even more.”\nPolanco had the quintessential Long Island lacrosse experience growing up in the 1990s. The Oceanside native attended Nassau Community College before playing Division 1 across the street at Hofstra University. He went on to play two seasons with the Saints in the NLL and another two with the Philadelphia Barrage of Major League Lacrosse, which merged with PLL in 2020.\nBut Polanco didn’t get into lacrosse until high school, when he was recruited to the sport as a way to keep in shape during the football offseason.\n“I think a lot of [kids] gravitated toward lacrosse, which is kind of a really good hybrid of football, soccer, and hockey kind of mixed,” Polanco said. “It quite frankly could be a reason why there’s such a plethora of solid athletes coming out [of Long Island].”\nLong Island has had its fair share of local heroes on the gridiron. Wayne Chrebet and Marques Colston attended Hofstra, D’Brickashaw Ferguson starred at Freeport, and Vinny Testaverde and Boomer Esiason grew up on Long Island. Then, of course, there is Jim Brown, the legendary Cleveland Browns running back deemed one of the greatest in NFL history who also was a lacrosse standout at Manhasset High School before attending Syracuse.\nBut the pipeline of football talent doesn’t have the nurturing foundation that outdoor lacrosse has on Long Island.\n“We’re definitely not known like the Texases, the Pennsylvanias, or the Floridas for football players,” Polanco said.\nSome of the top coaches either originated or worked on Long Island. Some of the top youth academies and teams in the country like Team 91 Long Island Boys are here. The top men’s and women’s college programs have set up shop in the area to recruit — and rightfully so.\nEight Long Island high schools were ranked inside the USA Lacrosse/Nike’s National Boys Top 25 rankings last season. Five from the Island made the National Girls’ Top 25 rankings.\nNow, before they even get to high school, the plan is to bring them to box lacrosse, which Lisk explained has “a different language” and “more physicality.”\nThe Riptide have already started a youth academy in hopes of developing a pipeline of indoor lacrosse talent that runs from every corner of Long Island straight to Nassau Coliseum.\n“My goal is to have them learn to play box lacrosse, and they go into our box league, and that box league is going to go into high school box league, and that high school box league is going to go into a college box league,” Lisk explained. “Then we’re going to keep tabs on where they are in college, and on the day I stand on that podium, I can draft a legitimate kid that’s been in our junior Riptide program from the ground floor up to become a part of the Riptide.\n“That will be one of the things I want to leave here when I’m long gone.”\nTeat is helping to establish that presence on Long Island as well. In January, he, the Riptide, and Warriors Lacrosse launched Teat’s Warriors, a community-based collaboration that includes tickets being provided to underprivileged communities on Long Island. Teat himself will participate in stick-stringing clinics for children at Lacrosse Unlimited locations around Long Island.\n“The sport of lacrosse is small in itself,” Teat said. “It’s definitely growing, but compared to the NBA, NFL, NHL, it’s nowhere close to that and we know that. So that small interest from everybody on a collective level… it’s a great way to reach out to people and introduce the sport to someone who may not get the opportunity to do so in the first place because it’s a wealthier sport.\n“In basketball, you can just pick up a ball and go to the court… so we’re just hoping to open the door for someone that may not be able to learn [under normal circumstances].”\nOnce the game is truly accessible to all in the area, Long Island will definitively be able to put down lacrosse as its finest export.",
  "word_count": 1202,
  "scraped_at": "2026-02-14T12:38:58.833855"
}