{
  "article_id": "62c28f052815",
  "url": "https://www.hogshaven.com/2024/6/6/24171337/daily-slop-6-jun-24-cornelius-lucas-tyler-badass-michael-davis-joe-whitt-make-the-headlines",
  "title": "WFT News : Washington Commanders News Links",
  "date": "20240606T121500Z",
  "domain": "hogshaven.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Daily Slop - 6 Jun 24: Cornelius Lucas, Tyler “Badass”, Michael Davis & Joe Whitt make the headlines\nA collection of articles, podcasts & tweets from around the web to keep you in touch with the Commanders, the NFC East and the NFL in general\nArticles\nBullock’s Film Room (subscription)\nIs Cornelius Lucas ready to start at LT for the Commanders?\nBreaking down veteran swing tackle Cornelius Lucas and looking at if he’s capable of being a starter at left tackle this season\nThe first thing that stood out to me when watching Lucas from this past season was his hands. He has a powerful punch that can disrupt pass rushers and generally placed his hands well when throwing those punches.\nThe powerful punches and good hand placement are good traits for Lucas, and funnily enough similar traits to rookie Brandon Coleman. The downside of these plays though is the two-handed punching, which again is an issue with Coleman. Lucas largely got away with it against the Falcons in a one off game, but when he became the starter for the last three games of the season after Leno went down injured, teams spent more time studying him and found out how to attack that weakness.\nIn Lucas’s second start of the season against the Jets in week 16, he faced edge rusher Bryce Huff. Huff signed with the Eagles in free agency this offseason, so will face the Commanders twice a year. On this play, you’ll see Huff has studied Lucas a bit more than the Falcons did because he had more film to watch. He knows that two-handed punch is coming and so he uses it against Lucas. You can see off the snap that Huff starts his rush wide but quickly works inside towards Lucas to bait the punch. Lucas falls for the trap and throws both hands, which Huff anticipates and shows great skill to duck under as he dips around the edge and past Lucas. Fortunately for Lucas, Sam Howell got the ball out quickly to avoid a sack, but Huff showed that he had studied Lucas and knew how to get the better of him.\nQuinn was so impressed with Biadasz that he gave the player a simple, but effective nickname: “Badass.”\n“Do you guys like it?” Biadasz asked reporters with a smile on his face. “It’s cool with me.”\nSigning a center is not a sexy move, but it was hard to deny that the Commanders needed one this offseason. Biadasz, a fourth-round pick from 2020, was one of the best on the market, making a Pro Bowl in 2022 with 53 career starts in 61 appearances.\nFor a quarterback like Jayden Daniels, who is just starting to learn the ropes in the NFL, it’s not a bad thing to have a badass snapping him the ball.\n“He’s doing a great job on his end,” Biadasz said of Daniels. “He’s one of the first in the building every single day. He’s doing a hell of a job, doing extra in walkthroughs with [offensive coordinator Kliff Kingsbury]. He’s always in the film room.”\n— The Commanders went through 11-on-11 drills today for the first time in front of reporters, marking the first time we’ve seen Daniels go against something resembling an NFL style pass-rush. He had to scramble out of the pocket a couple of times, but Daniels remained calm as blitzers closed in around him. He went through his progressions, had impressive footwork and zipped the ball to his targets. It’s still just June, but it’s a good sign of his development.\n— Aside from Daniels’ pocket presence, the most noticeable difference was how loud practice was during 11-on-11 drills. The defense was being vocal, communicating their reads to one another, while the offense was making checks at the line of scrimmage. Clearly, being on the same page has been a focal point for the new coaching staff, and that extra attention is paying off.\n— The Commanders continue to put together their best strategy for the new kickoff rules, and just as Quinn has said for weeks, there was a large group of players taking turns catching kicks. The list included Kazmeir Allen, Emmanuel Forbes Jr., Austin Ekeler, Dax Milne, Tyler Owens, Jahan Dotson, Austin Jones, Davion Davis, Mike Sainristil, Jeremy McNichols, Damiere Byrd and Brian Robinson.\nRiggo’s Rag\nCommanders CB Michael Davis looking to silence doubters in 2024\nThe veteran cornerback has a point to prove.\nDavis is coming to the nation’s capital with a point to prove. Based on comments via Fan Nation, he’s looking to maximize the opportunity in Washington and soak up Whitt’s vast knowledge in pursuit of silencing some increasing doubters next time around.\n“It was my time for me to be on the East Coast, for me to be here for you guys with the Commanders. So I mean, just a great opportunity for me to be here. I’m excited to go to work with (defensive coordinator) Joe Whitt Jr. because I know that he can develop, he develops corners and I know that. I’m eight years in, but I still know that I have an extra level to go to. And I know that with Joe Whitt, he’s able to tap into that potential for me. He’s able to help me tap into that potential so I know that I can skyrocket my game.”\n- Michael Davis via Fan Nation\nThe former undrafted free agent has been getting starting reps ahead of Forbes according to those in attendance at voluntary organized team activities. It’s still early in the process, but it seems as if the Commanders have plans to get Davis heavily involved.\nWashington Post (paywall)\nQuinn: Commanders unaware of allegations against Brandon McManus until last week\nThe Commanders released kicker Brandon McManus, who faces allegations of sexual assault in a lawsuit filed by two women, on Sunday.\n“We did release Brandon,” Quinn said at a news conference before the Commanders’ offseason workout Wednesday in Ashburn. “I found out some of the information on May 27th. And then we released him on June the 3rd.”\nHe provided no details about the team’s conversations with McManus or his representatives.\n“This is under investigation,” Quinn said. “So I can’t comment a lot. But what I can say is a little bit about what I told the team. And I think like most things, not necessarily related to this but as a lesson, let’s make sure you always let somebody know and tell. There’s usually a whole bunch of people that want to be part of the solution. And so when you have that, whether that’s for this team or any team or a parent, that kind of communication allows you to come up with some solutions.”\nWashington signed Ramiz Ahmed on Monday to replace McManus, but could look at other kickers before and during training camp. Ahmed has been with the Chicago Bears and Green Bay Packers but has yet to kick in an NFL game. Ahmed made 10 of 13 field goal attempts for Birmingham in the UFL this spring. Two years ago he made 14 of 22 attempts for Pittsburgh in the UFL.\n“It’s also moments like this that guys get their opportunity and when they do, a lot of times, people have been waiting for that shot, that moment,” Quinn said of Ahmed.\nPodcasts & videos\nWashington Commanders DC Joe Whitt Jr. on Jamin Davis Playing EDGE | Emmanuel Forbes in Trouble?\nNew defensive coordinator already making impact on Commanders\nNFC East links\nI know we don’t have a whole lot to stand on right now. We get our ass kicked by the Eagles almost every single game these days. But, we still have the Super Bowls and at least we don’t have the most punchable face in the league. I’m pretty sure at this point with Sirianni even Eagles fans would agree with that. He’s the most smug, Delco-looking dude who loves to go to Wildwood to hit up the boardwalk. Good luck finding a bigger asshat than this guy.\nSo now he wants to brag that the Eagles signed Saquon Barkley. First off, go ahead. Congrats on overpaying for a running back who will 100% sulk and bitch when Jalen Hurts is snagging those 1-yard touchdown runs. Now is Saquon a good player? Sure. He’s fun, he can break a 70-yard run once a game followed by a bunch of 3-yard dives. But he’s not the best player on the Giants, not even close. He was the biggest name, not the best player. He was also a garbage No. 2 pick. Hated it then, hated it even more now.\nYou think you’re bragging when in actuality you just made sure we didn’t have to pay $13 million for a running back. Thank you. Thank you for not worrying about Boston Scott, who is the guy that we feared the most against the Eagles. If Sirianni wanted to shit talk us, there are plenty of other options to go. Have fun with Saquon.\nBlogging the Boys\n3 defensive tackles Cowboys should inquire about trading for\nThe Cowboys still have an issue at defensive tackle.\nPhidarian Mathis, Washington Commanders\nFrom the front office to the coaching staff, the Washington Commanders pretty much cleaned house this offseason. No doubt there will be some pretty big ramifications after wiping the slate clean throughout the organization, the most significant of which could be going from Ron Rivera to Dan Quinn as their new head coach.\nWith Daron Payne, Jonathan Allen, and Johnny Newton, Quinn already has a better DT rotation than he had during his time in Dallas. That means players like Phidarian Mathis, a former second-round pick, could be available via trade. He’s a pure 1-technique who missed his entire rookie season due to injury and was buried on the depth chart in 2023.\nBlogging the Boys\nZack Martin talks possible retirement as he enters his 11th NFL season\nThe end for the future Hall of Famer could be sooner than people think.\nRight guard Zack Martin is entering his 11th season with the Cowboys. He’s been the model of consistency with nine All-Pro and Pro Bowl selections. However, all good things come to an end at some point, especially in the NFL, where the average career is around four years. So, Martin’s journey reaching it’s climax is certainly nearing, and it’s something he discussed recently as the Cowboys are going through their minicamp.\n“I’m not saying 100%, but I think it’s definitely in the realm of possibilities,” Martin said. “And that’s one thing I don’t want to do. For myself, I don’t want to be thinking, ‘Oh, this is it. This is it.’ I want to stay in the moment, and I want to play the best that I can play at this point and be the best right guard this team needs on a weekly basis. And then fter the season, we’ll figure out what’s going on.”\nWell, that’s certainly a statement.\nNFL & UFL league links\nArticles\nPro Football TalkUFL averages 816,000 viewers in the 2024 regular season\nThe UFL’s first season went well. Better than the 2023 seasons of the two leagues that came together to create the UFL.\nVia Sports Business Journal, the UFL’s 40 regular-season games on ABC, Fox, ESPN, ESPN2, and FS1 averaged 816,000 viewers. Last year, the USFL averaged 601,000 viewers, and the XFL averaged 622,000.\nThe key is that the UFL had a larger presence on broadcast TV. Six games (all on broadcast TV) had audiences in excess of a million.\nThat’s a great start, and it suggests that maybe this spring league will do better than those that came before it, all of which failed. While there were various reasons for it (including COVID), they failed. The UFL seems to be doing well.",
  "word_count": 1977,
  "scraped_at": "2026-02-14T12:41:33.694025"
}