{
  "article_id": "62ca68b248a7",
  "url": "https://www.starsandstripesfc.com/uswnt-news/2023/12/28/24014882/jaedyn-shaw-uswnt-united-states-womens-national-team-usa-call-up-goals-striker-nwsl-san-diego-wave",
  "title": "SSFC Spotlight : Jaedyn Shaw primed for huge role with USWNT",
  "date": "20231228T161500Z",
  "domain": "starsandstripesfc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As the United States Women’s National Team enters a new era, one of the key areas for improvement is on the attack. Being shut out three times over the past year is a concerning trend, although there appears to be change on the horizon with several players recently introduced to the senior level. Jaedyn Shaw enjoyed a breakout 2023 with the San Diego Wave in the National Women’s Soccer League. The versatile 19-year-old forward has already taken advantage of her opportunities under interim manager Twila Kilgore and recorded two goals in recent friendlies.\nSSFC Spotlight: Jaedyn Shaw primed for big role with USWNT\nThe attacker enjoyed a successful 2023 for club and country.\nBorn in Frisco, Texas, Shaw competed with FC Dallas and Solar Soccer Club, demonstrating inherent technique and the ability to learn quickly with a strong drive to improve. She committed to the storied University of North Carolina women’s soccer program at the age of 14 and was also invited to train with Paris Saint-Germain, which “planted a seed to want to go pro early.” Despite suffering a serious ACL tear at the age of 16 that required “a lot of [rehabilitation]” in the midst of the COVID-19 pandemic, Top Drawer Soccer rated her as the number-two player in the class of 2023. Coaches praised her abilities to “understand time and space” and “get on the ball in very tight spaces.”\nIn the spring of 2022, the Washington Spirit brought her in for preseason training as a “non-roster invitee,” extending the invitation for an additional period. However, Shaw signed with the San Diego Wave Fútbol Club through a discovery process after the league “amended the entry process” which allowed her to circumvent the draft and age restriction policy. She made her debut and scored the game-winner in a 1-0 victory over the Chicago Red Stars. Her first professional season ended with three goals in seven NWSL matches, helping lead a run to the semifinal round of the playoffs.\nThis year, after switching from winger to her preferred attacking midfielder role, Shaw continued improving, contributing seven goals and four assists in 29 appearances across all competitions as her club claimed the NWSL Shield for the best regular season record. In addition to being named to the league’s Best XI team, San Diego signed her to a multi-year contract through the 2026 season. The senior players, including Alex Morgan, have served as a “great resource,” providing a “high ceiling” and allowing her to learn from established professionals.\nAfter spending 2022 unsure of her future, Shaw was able to focus on playing without worrying about uncertainty. “Having a preseason, having had a lot of games in this year alone, has helped me grow,” she shared recently. “Just, like, watching film, going over, whatever I feel like I need to work on from the last game. Going into camps [and] learning things there. I feel like I’ve had a lot of time this year just to, like, reflect and go over my game, and figure out what I need to work on... I feel like a lot of it is just preparation. Having a full season to prepare for this game is very helpful.”\nAt the international level, Shaw has been a regular member of the United States program, beginning with a star turn that saw her claim the Golden Ball at the 2018 CONCACAF Girls’ Under-15 Championship after scoring a brace in the 3-0 final win against Mexico. Following a two-goal performance with the U-20 team to the Sud Ladies Cup in France, she was included on the roster for the 2022 FIFA U-20 Women’s World Cup and appeared in all three matches during the disappointing run that ended in the group stage – U.S. Soccer subsequently awarded her with Young Female Player of the Year. Her senior international debut came this year, which resulted in four caps and two goals in friendlies against Colombia and China; a “nifty chip” put away a 3-0 friendly win over the former opponent, while the game-winning finish in the latter secured a 2-1 comeback victory in her hometown of Frisco, Texas.\n“It’s a bit surreal for me,” Shaw said after scoring in front of a crowd that included 50 friends and family members. “I walked from my house to Toyota Stadium to watch FC Dallas games. Playing here at this high level of competition is crazy.”\nCapable of lining up at striker, winger, and attacking midfielder, Shaw is a productive player who can create with both feet and works hard to make an impact on the defensive side of the game. She is described as “very smooth on the ball” with a great ability to “dribble and penetrate,” while personally citing “creativity, vision, and versatility on the ball” as her best qualities. Her incisive passing and vision can break down opponents in a compact final third, with her club making sure the teenager gets the ball in advantageous areas.\n“She’s been utilized in [all] top four positions: wide left, wide right, [No. 9] and also as a [No. 10],” said San Diego manager Casey Stoney. “I think now, she’s played more of a 10 role, it’s how she can position herself between the lines, how she can face forward. Because once she gets to faced forward with the body position, her ability to play a through ball is some of the best I’ve ever seen. She sees things other people don’t see.”\nShaw made the risky decision to turn professional early and quickly adapted to the next level, becoming one of the top players in the NWSL. She has also been impressive in her brief time with the USWNT, appearing ready to take on a significant role with the program over the next decade and beyond. As with any new inclusion, building chemistry with teammates is perhaps the most pressing priority, particularly for a group that has recently lacked cohesion in the final third. Time is ticking as the Olympics draws near, with the competition potentially serving as opportunities for the program to bounce back and the next generation of American talent to reestablish placement atop the mountain.",
  "word_count": 1024,
  "scraped_at": "2026-02-14T12:31:05.637824"
}