{
  "article_id": "62dcc4124742",
  "url": "https://soonerswire.usatoday.com/lists/oklahoma-sooners-softball-national-championship-patty-gasso-jordy-bahl-tiare-jennings-jayda-coleman-rylie-boone/",
  "title": "Oklahoma Softball : 5 takeaways from the Sooners 2023 championship run",
  "date": "20230611T231500Z",
  "domain": "soonerswire.usatoday.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "5 takeaways from Oklahoma Sooners record-breaking national championship season\nIt's been a few days since the Oklahoma Sooners clinched their seventh straight national championship. Still, it feels surreal the kind of season the Sooners had.\nThey finished 61-1. They have a 53-game winning streak. They possess the No. 1 offense, ERA and fielding percentage in college softball despite not having a National Player of the Year finalist. They had a 14-0 beat down of then No. 1 UCLA. The countless clutch, come-from-behind moments. A perfect postseason. A three-peat.\nIt was an incredible season that created a number of memories for the team and its fan base. It was a run that helped further elevate the game of softball to national consciousness. Here are five takeaways from the 2023 season for the Oklahoma Sooners.\n1. Patty Gasso is the difference\nChris Plank said it best: \"People want to say that OU softball has an unfair advantage, and I would agree - because we have Patty Gasso.\"\nIn the same way it does for Alabama football, the Oklahoma Sooners are able to retool and reload because players want to win. But more than that, Gasso has created a player-friendly and player-centered culture.\nShe's created a culture that values personal development as much as player development. Given the success they've had, it's easy to see that it works.\nAnd it's little things like this, where she stands behind players and women, not just at Oklahoma, but across the sport, encouraging athletes to simply be themselves out on the diamond.\nWith all of the pressure that collegiate athletes are under, Gasso has been a part of the emphasis on taking care of the player mentally.\nThe success matters to Gasso, and at the same time, it's only a part of what she's at Oklahoma to do.\n2. Pitching and Defense Wins Championships\nIn the first two years of their championship three-peat, the Oklahoma Sooners relied on an offense that set new standards for home runs and run rules. The offense remained the best in softball, but it wasn't as explosive as last year. It didn't matter because Oklahoma also had the best pitching staff and defense in the country as well.\nJordy Bahl, Nicole May, Alex Storako and Kierston Deal led Oklahoma to a 0.96 team ERA. In the NCAA tournament, Oklahoma had five shutouts to lead the team to their third straight championship.\nEven when Oklahoma's No. 1 fielding defense had uncharacteristic miscues, the pitching performed in a way that made it inconsequential. When the pitching staff needed the defense to make a play, it did, such as when Jayda Coleman skied above the wall to rob Florida State of a three-run homer in Game 2 of the WCWS finals.\nThe Oklahoma Sooners were a complete team in 2023, which is why they were went on a 53-game winning streak after losing their only game of the season.\n3. The offense was still great\nYou can't replace a hitter as great as Jocelyn Alo. Arguably the greatest power hitter in softball history isn't someone you simply replace. In 2022, the Sooners hit 155 home runs and scored 579 runs. In 2023, they hit 115 home runs and scored 503 runs.\nThough Oklahoma's offense didn't average as many runs per game, it was still fantastic, leading the nation in runs per game, batting average, home runs, per game, and on-base percentage.\nOklahoma had four players hit better than .400 on the season. Five players had double-digit home runs, and Grace Lyons and Cydney Sanders each had nine home runs.\n4. Jordy Bahl finishes strong\nOn March 11, Jordy Bahl threw two innings against Mississippi State and allowed three hits, four walks and two earned runs. On that day, her ERA was 2.28.\nThrough the first 11 appearances of the season, Bahl allowed 14 earned runs.\nIn life, and in the 2023 season, it wasn't about how Bahl started, but how she finished.\nOver her final 28 appearances after the rough outing against the Bulldogs, Bahl allowed five earned runs. Those earned runs came in three appearances.\nIn the NCAA Tournament, Bahl allowed one earned run, in a win over Clemson, and allowed none in the Women's College World Series.\nBahl's 2023 season can be defined by resilience and mental toughness. After a strong true freshman season, expectations were sky-high for the standout pitcher. And while the first month and a half of the season didn't go to plan, Bahl showed incredible resiliency to turn things around after that Mississippi State performance.\nOver the final three months of the season, Bahl was the best pitcher in softball and arguably Oklahoma's most important player during its NCAA Tournament run, which earned Bahl the Most Outstanding Player award.\nBahl's toughness and ability to work around jams were critical to the Sooners' championship run. When it looked like teams were about to break through against the Sooners and end their winning streak, Bahl locked in and stole back momentum.\n5. They too deep\nStarting with the top of the order, the Oklahoma Sooners lineup was literally too deep. Jayda Coleman was a threat in the leadoff spot to get on base or open the scoring with her home run power. Tiare Jennings has led the Oklahoma Sooners in RBIs every season she has been in Norman.\nKinzie Hansen bounced back from an injury-plagued season in 2022 to be a huge contributor to Oklahoma's success in 2023. She was arguably the Sooners' best hitter and came through in the clutch so many times that you might have to change the spelling of the word to \"Klutch.\"\nThe Sooners could have put Rylie Boone at the top of the order given her .392 batting average and .493 on-base percentage. Boone would be the leadoff hitter for 99% of teams in the country because of her ability to get a rally going like she did several times in the NCAA tournament.\nThere was no easy out in Oklahoma's lineup. Even Cydney Sanders, who was the only regular starter to hit under .300, came through with a home run in the WCWS finals deciding game.\nGrace Lyons, Alynah Torres, Haley Lee and Alyssa Brito each had huge at-bats for the Sooners on their way to the 2023 national championship.\nIt's the depth that Oklahoma brings to the ballpark every day that makes them so difficult to beat. Just when you think you might get a break after getting through the top of the order, that back half of the order makes you pay and turns the lineup over back to Coleman and Jennings.\nEven with Lyons and Lee departing after running out of eligibility, the Sooners' lineup will be just as daunting in 2024 with the rise of Jocelyn Erickson and any players they add from the transfer portal this offseason.\nIn addition to the depth in the lineup, Oklahoma's pitching staff proved a key factor beyond Jordy Bahl. The Sooners received key starts from Nicole May and Alex Storako. Kierston Deal provided reliable innings in relief throughout the postseason.\nBecause of the success, and the culture created by Patty Gasso, her coaching staff and the team leadership, they'll be an attractive landing spot for grad transfers or star players looking for a better opportunity to ply their craft.\nThe incredible depth the roster has will continue. That's why there's little doubt the Sooners will be in another position to win a title in 2024.\nMore Softball!\nOklahoma Sooners outside top spot in Softball America's Preseason top 25\nTrio of Oklahoma Sooners selected to preseason All-American teams\n5 Oklahoma Sooners included in Softball America's top 100 for 2025\n'College GameDay' team takes batting practice with Oklahoma Softball\nOklahoma Sooners unveil Patty Gasso statue at Love's Field\nContact/Follow us @SoonersWire on Twitter, and like our page on Facebook to follow ongoing coverage of Oklahoma news, notes, and opinions. You can also follow John on Twitter@john9williams.",
  "word_count": 1322,
  "scraped_at": "2026-02-14T13:08:27.846121"
}