{
  "article_id": "62e1d41ba9f1",
  "url": "https://www.townandcountrymag.com/society/tradition/a65539378/princess-beatrice-edoardo-mapelli-mozzi-england-lionesses-parade-2025-photos/",
  "title": "Princess Beatrice Went to the Lionesses Victory Parade With Family to Celebrate England Historic Win",
  "date": "20250729T171500Z",
  "domain": "townandcountrymag.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Princess Beatrice and Edoardo Mapelli Mozzi brought their children out to the victory parade on Tuesday to celebrate England’s win in the 2025 UEFA European Women’s Championship. The family were among thousands lining the Mall and in the plaza surrounding the Victoria Memorial in front of Buckingham Palace to welcome home the Lionesses after their win over Spain, becoming back-to-back European Champions.\nBeatrice and Edo have two children together, Sienna, 3, and Athena, 7 months, and Edo has a son Christopher, 9, from a previous relationship. All three of their kids were with them at the parade.\nFor the parade, Beatrice wore a Ralph Lauren sweater, Farm Rio skirt, and red Rothy’s flats. She accessorized with a Sydney Evan “Love” bracelet and a matching “Love” ring.\nThe royal family has been very supportive of the Lionesses in their recent bid to defend their title from 2022. Prince William and Princess Charlotte were in the stands cheering on the team at the final in Basel, Switzerland on Sunday, where the Prince of Wales also handed out the gold and silver medals to both teams after the match. Earlier this month, William was at the Lionesses match against the Netherlands during the group stage on July 9 in Zurich. As patron of England’s Football Association, known as the FA, he visited the team's training center at St. George’s Park on June 30 before the Lionesses departed for Switzerland.\nKing Charles issued a personal message to congratulate England women’s football team after they won the semifinal in Geneva last Tuesday as well as another hearty round of applause after the final. “For more years than I care to remember, England fans have sung that famous chant ‘football’s coming home’,” the King wrote. “As you return home with the trophy you won at Wembley three years ago, it is a source of great pride that, through sporting skill and awesome teamwork, the Lionesses have made those words ring true. For this, you have my whole family’s warmest appreciation and admiration.”\nBeatrice’s sister, Princess Eugenie, also shared her joy to her personal social media on Instagram Stories after the match concluded, writing, “Come on @lionesses, you absolute LEGANDS [sic].”\nAfter their win, the team returned to England on Monday, where they were first outfitted by team sponsor Marks & Spencer and later had a special appearance in front of 10 Downing Street and a meeting with UK Deputy Prime Minister Angela Rayner.\nThe Guardian also reports that there are talks for the team to visit Buckingham Palace or Windsor Castle this fall for a formal reception.\nRachel King (she/her) is a news writer at Town & Country. Before joining T&C, she spent nearly a decade as an editor at Fortune. Her work covering travel and lifestyle has appeared in Forbes, Observer, Robb Report, Cruise Critic, and Cool Hunting, among others. Originally from San Francisco, she lives in New York with her wife, their daughter, and a precocious labradoodle. Follow her on Instagram at @rk.passport.",
  "word_count": 499,
  "scraped_at": "2026-02-14T12:12:29.467030"
}