{
  "article_id": "63049ae295a0",
  "url": "https://greatbendpost.com/posts/6fd6a089-1533-4ff1-a6bc-2af253f78098",
  "title": "Texas Tech biggest and richest fan explains how hed fix college sports",
  "date": "20260101T201500Z",
  "domain": "greatbendpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "MIAMI GARDENS, Fla. (AP) — Because he is a billionaire, the chairman of the Texas Tech board of regents and the school’s No. 1 superfan, the easiest route for Cody Campbell would be to keep pumping money into his school’s sports programs and let the chips fall where they may.\n“For Texas Tech, the best thing that could happen is the whole thing continues to be chaotic,” he said.\nBut Campbell, an oilman by trade and a problem solver at heart, has a distinct vision of where college sports is and where it needs to go if it is going to survive past, say, 2030.\nIn an interview with The Associated Press in advance of Tech’s College Football Playoff game against Oregon, Campbell argued that Congress needs to create a new entity that can oversee college sports. Its main focus? Maximizing revenue.\n“We have professionalized the cost side of college sports,” he said. “But we’re still running this amateur revenue-generation program.”\nThe idea of creating a new agency is among the talking points that thrust Campbell into the national conversation about how to run an industry that now pays players millions but also risks bankrupting athletic departments and destroying the smaller sports that are bankrolled by football and basketball.\nHe believes there is an extra $7 billion per year to be had by a smarter TV structure. In the interview with the AP, he suggested the solution is more complex than simply changing the law, tearing up the current deals and starting over.\n“Congress needs to set up a system of governance that empowers them to make commercial decisions so they can maximize their value,” Campbell said of college leadership.\nHe sees an entity with not one commissioner, but a handful, all of whom run their individual sports and make their own decisions about media rights.\nA man who disdains the status quo and those who uphold it — think conference commissioners, some athletic directors and school presidents — Campbell disputes the idea that his vision will pull power from all those people. By putting more money in their pockets, he explains, everyone will be stronger.\nThe SEC’s Greg Sankey has argued that Campbell’s views “reflect a fundamental misunderstanding of the realities of college athletics.”\nCampbell’s response to commissioners and others who criticize him: “I would say, ‘How many private equity deals have you done?’ I’ve done a dozen or more. ‘How many times have you issued a public bond or financed a multimillion-dollar project?’ I’ve done it quite a lot. Did you actually play major college football?”\nA dealmaker from West Texas\nCampbell, who grew up in the West Texas town of Canyon, was an all-conference offensive lineman for the Red Raiders in the early 2000s who spent 2005 with the Indianapolis Colts.\nHe made his money through a combination of real estate and oil deals. According to ESPN, he and his partner, John Sellers, have sold four iterations of their company, Double Eagle Energy, for a total of around $13 billion.\nThe money has allowed Campbell to almost singlehandedly shift the fortunes of Texas Tech athletics. He donated $25 million to help rebuild Texas Tech’s football stadium. He fronts The Matador Club, the collective that took advantage of loose regulation in the startup days of NIL to reportedly funnel more than $60 million to Texas Tech players since 2022.\n“I know some of the commissioners have not necessarily agreed with them and don’t think he sees the big picture,” Red Raiders coach Joey McGuire said. “But when you’re in the room, you’ll understand. He’s smarter than you.”\nPrivate equity only a short-term solution\nIt wasn’t so much the money but the experience he gained in raising the money that Campbell believes makes him suited to help shape college sports.\nFor instance, he sees a role for private investment — the likes of which are capturing headlines in the Big Ten, Big 12, University of Utah and elsewhere — as a bridge to a day when conferences maximize their media rights. It is not, he says, a permanent solution, especially the way the conferences are going about it.\n“It’s basically just a payday loan, the way these things are being structured,” Campbell said. “They don’t really solve the fundamental problem.”\nCongress has answers but not the right ones\nCampbell casts himself as a supporter of the SCORE Act, legislation seeking to regulate college sports that has languished in Congress for a year even though he disagrees with its key points and sees it more as a launching point than a final product.\n“I don’t think that many people who’ve been following sports for an amount of time think the NCAA is the right entity to be given a huge amount of additional power to override state law and be exempt from any kind of lawsuits,” he said, singling out two key elements proposed by the bill.\nHe figures a new entity might be able to build that trust and says he pushes this agenda not to benefit Texas Tech — all Texas schools have big boosters who can write big checks under any rulebook, he says — but because of what college, and college sports, did for him.\nA belief that college sports is bipartisan\nPiggybacking on the reality that football and basketball fund everything in college sports, Campbell sees TV as the best way to save everything.\nHe says tapping into that additional $7 billion a year will bankroll women’s and Olympic sports, which have become increasingly vulnerable as attention and resources head toward football.\nA reliable Republican fundraiser, Campbell says he is aligned with President Donald Trump, who signed an executive order called “Saving College Sports,” part of which calls for protecting and expanding women’s and nonrevenue sports.\nYet Campbell sees no conflict with the fact that the reworking of the TV deal aligns more closely with a bill proposed by a Democrat. Rewriting the 1961 Sports Broadcasting Act was the headliner in legislation proposed by Sen. Maria Cantwell, D-Wash.\n“I know he’s supportive in general of two things,” Cantwell said in an earlier interview with the AP. “One is making sure the top two (conferences) don’t run away with all the money. And secondly, I think he sees this as a way to even out the resources across all schools so we can still have ‘Any Given Saturday.’”\nCampbell said he is a realist. He knows Congress works slowly and doesn’t always have sports on its mind. His faith in finding a solution isn’t diminished by that, however. He cited internal polling that showed more than 85% of Americans “want to see women’s sports and Olympic sports preserved.”\n“And 85% of Americans don’t agree on anything,” he said. “The reality is, if we don’t make some reforms and we’re not careful, those sports are going to go away.”",
  "word_count": 1142,
  "scraped_at": "2026-02-14T14:22:32.422016"
}