{
  "article_id": "632eb665ac1a",
  "url": "https://www.cityam.com/rfu-backing-of-red-roses-can-aid-better-english-pro-structure/",
  "title": "RFU backing of Red Roses can aid better English pro structure",
  "date": "20250821T100000Z",
  "domain": "cityam.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "RFU backing of Red Roses can aid better English pro structure\nSo it begins. Red Roses vs USA at the Stadium of Light. Friday night, BBC 1. That’s a USA fielding the rugby player with by far the biggest social media following on the planet, Ilona Maher. You won’t find a hotter ticket this year than the Women’s Rugby World Cup final at Twickenham on 27 September. Nor hotter favourites than England on home soil, even if their collective Insta followers are dwarfed by Maher’s. England (and especially the RFU) expects. No pressure then.\nThe Red Roses stars carry the weight of great expectation into this World Cup. Their footballing counterparts, the Lionesses, are held up as the blueprint for an acceleration of interest in girls’ and women’s rugby union. The comparisons, however, are unfair. Rugby isn’t football in terms of breadth and depth of engagement, for either sex. No sport is.\nLive, free-to-air exposure is gold-dust, but the noise around this tournament – from media and sponsors – will be commensurately lower than for the Uefa Women’s Euros. At least initially. But if/when the Red Ross reach the final…\nAnd reach the final they most certainly should, for a likely showdown against New Zealand’s Black Ferns, who pipped them at the death in that exhilarating final at Eden Park in 2022. The ‘if’ in the ‘if/when’ is a nodding of a scrum cap to the Red Roses’ likely semi-final opponents, Canada, who drew with the Black Ferns in May.\nIf it is hard to see beyond these three nations of the 16 competing at this WRWC, it is because the sport divides between those unions that have truly financially committed to the elite game, and those that are persisting with an essentially amateur model. Credit Canada for bridging the financial divide to be on terms with the better-funded teams, enabled by a $1m Mission: Win Rugby World Cup 2025 fundraising campaign. Unlike the Red Roses and New Zealand, Canada’s squad is not centrally contracted to its union.\nThe RFU has committed to their Red Roses in spite of the well-aired financial challenges facing the game, and not simply because it is unambiguously the right thing to do. It also makes strategic sense. Embed rugby in the lives of a broader swathe of the population and its grassroots will become stronger, local clubs healthier, the supporter base for both the men’s and women’s professional games broader.\nTo that end, and as is customary at all major sport tournaments, the RFU has ensured there is a plethora of ‘activation’ activities surrounding the competition, intended to amplify the positive messages created by the matches themselves.\nI will declare an interest here as chair of GB Wheelchair Rugby. Today in Sunderland there is an England vs France women’s wheelchair rugby match. Part of our drive to increase female participation in a sport which sees mixed gender teams competing at the Paralympics, and a further reminder that rugby takes many forms and is open to all.\nNow, perch on the edge of your seat.\nPerfect imperfections\nLast week’s AI co-authored Sport inc. asking whether football was the perfect sport elicited far more responses than usual. These ranged from head-scratching at football’s ubiquity to suggestions of contender perfect sports.\nOne reader, a former Olympian, declared: “Football allows the unintelligent to believe their opinions are intelligent. Perfect democracy.”\nHe must have overheard me once or twice at half-time!\nAnother reader made a passionate case for volleyball, based on its simplicity and a global popularity curiously unmatched in the UK. As evidence he cites: “Even in countries as remote as Burma in 2000, I was able to play in the backyard of a stupa against a pair of buddhist monks with a couple of strings serving as the dividing space between the two sides.”\nTaking time out from WRWC preparations, an RFU exec argued the case for rugby, believing that the advanced use of tech will break down the complexities of the game for the uninitiated. He ended on a lighter note: “I’m also not sure football could sell 280k pints of Guinness at a match, have fans co-mingle and then occupy the same pubs post-match – and no violence.”\nI guess quite a few sports could play the non-violence after drinking card though!\nFinally, I salute those few readers who pulled me up for not spotting AI’s error in describing the laws of cricket as rules. Bowled all ends up.\nGulliver’s pickles\n“OK! Perhaps don’t say that out loud in public!!!”\nThat was the message from a padel entrepreneur when I admitted I’d not tried his sport but instead was making my first venture onto a pickleball court this week. Not only was I stepping onto a repurposed badminton court at the local leisure centre, but I was also stepping into the racquet equivalent of the VHS vs Betamax debate.\nThat lazy scribe’s source of usually vaguely reliable data, Google, provides estimates of up to 30m padel players worldwide and 9m pickleballers. No doubt which is the hotter sport in the UK right now, but I’ll have to try padel to understand why. After all, pickleball requires far less in the way of court infrastructure and can be dirt cheap to access. £12 for an hour’s court time on Tuesday evening between four of us. Plus £2.75 leisure centre entry each. That’s cheaper per person than our first pints in the bar opposite afterwards. I admit I was playing with a borrowed £100 paddle though.\nThe experience for this abjectly useless tennis player? Much like Lilliputian ping pong on Gulliver’s giant table (Indeed, given the surroundings, it took me back to table tennis sessions at the Walnuts Leisure Centre, Orpington as a teenager in the 70s). Worked up a sweat, tried to follow the ‘soft hands’ instruction, completed a successful shot more often than I flunked one, have forgotten the scores already (which I’m assured is a vital part of the attraction), enjoyed the pint, will be back.\nPadel report to follow, as and when.\nTwo for another day\nThe headlines proclaiming that British horseracing will be ‘on strike’ for a day next month seem rather wide of the mark. Cancelling four meetings in protest at the government’s proposed increase in betting tax could be construed as an act of financial self-harm by the sport. Does it expect punters to descend on Westminster en masse that day? Little good similar action has done farmers with tractors in response to inheritance tax changes. More on this in Sport inc. nearer strike day on 10 September.\nIt is reported that Red Bull’s acquisition of the beleaguered Newcastle Falcons has led to a surge in season ticket sales for rugby union’s rebranded Newcastle Red Bulls. As the Red Bull sporting empire expands (football, ice hockey, F1, sailing and counting), why haven’t other brands followed this marketing model? To be explored.",
  "word_count": 1151,
  "scraped_at": "2026-02-14T12:12:21.485715"
}