{
  "article_id": "6338eb7fa612",
  "url": "https://www.kaieteurnewsonline.com/2024/12/20/gff-and-meyba-launch-new-kits-to-unite-guyanese-fans-and-boost-team-performance/",
  "title": "GFF and MEYBA launch new kits to unite Guyanese fans and boost team performance",
  "date": "20241220T083000Z",
  "domain": "kaieteurnewsonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Latest update February 14th, 2026 12:35 AM\n- Stabroek News shuts down after four decades\n- House approves $1.5 trillion National Budget\n- Guyanese protest ‘anti-poor’ budget, flag multimillion allocation to “dormant” Commission of Information\n- Trump says he will visit Venezuela after ‘very good’ relationship with interim president\n- 4 nabbed for armed robbery of Herstelling businesswoman\nDec 20, 2024 Sports\nKaieteur Sports- The Guyana Football Federation (GFF), in collaboration with global sportswear brand MEYBA, is proud to launch its new team kits, marking an exciting milestone in their five-year partnership announced in September. The kits are designed to celebrate the vibrant spirit of Guyana while equipping the national teams with cutting-edge performance apparel as they gear up for a packed 2025 calendar featuring major campaigns for both male and female national teams.\nThe year kicks off with the Concacaf U-17 Women’s and Men’s World Cup Qualifiers, then the U-20 Women’s World Cup Qualifiers followed by the senior men’s participation in the Concacaf Gold Cup Preliminaries, the FIFA World Cup Qualifiers and later on their Nations League campaign. The senior women’s team will also take to the field for the Concacaf W Champions Cup Qualifiers.\nThe newly unveiled kits feature designs inspired by Guyana’s rich cultural heritage, striking colours, and passion for football. Jonathan Jones, MEYBA’s Head of Global Marketing, shared his enthusiasm, noting: “It’s a proud day for MEYBA to release our first international kits with the Guyanese Football Federation. Guyana is a very special place, and we’re thrilled to be working with a federation that is as forward-thinking as the GFF. The kits are directly inspired by the essence, colours, and love for Guyana. We can’t wait to see them on the pitch as the\nGolden Jaguars prepare for the 2026 World Cup qualification with MEYBA by their side!”\nGFF President Wayne Forde also expressed his pride in the partnership and the unveiling of the new kits: “This partnership with MEYBA represents an important step forward for the Guyana\nFootball Federation. These new kits not only symbolize the pride and identity of our nation but also showcase our commitment to providing the best for our players and fans. We are excited to see our teams donning these jerseys as we continue our journey towards the Gold Cup 2025 and FIFA World Cup 2026 Qualifiers.”\nKit Details\nMen’s Home Jersey: The home kit showcases a bespoke Jacquard base with an all-over jungle sublimation pattern, representing the colours of Guyana’s national flag. Key features include omni move technology, a reflective GFF badge, tri-colour raglan sleeves, a V-neckline, and\nhidden design elements throughout.\nMen’s Away Jersey: The away kit offers a classic pinstripe design combined with geometric jacquard elements. A dual-color reflective GFF badge and an exclusive MEYBA neckline blend retro aesthetics with modern performance.\nWomen’s Home and Away Kits: The women’s kits feature bespoke designs inspired by the sights, sounds, and vibrant colors of Guyana, creating a unified identity for all GFF teams.\nFounded in Barcelona, Spain, in 1981, MEYBA gained international recognition as the\nfirst branded kit supplier for FC Barcelona, famously worn by legends like Maradona and\nJohan Cruyff. Today, MEYBA continues to deliver high-performance sportswear to\nprofessional clubs and international federations worldwide, including in Europe, the USA,\nAfrica, and South America.\nThe new Guyana Football Federation kits are available exclusively at MEYBA.com\nstarting Wednesday, 18th December.\nThe GFF is thrilled to continue its partnership with MEYBA, confident that these kits will\nnot only enhance team performance but also reflect the pride and identity of the Guyanese\npeople.\n(GFF and MEYBA launch new kits to unite Guyanese fans and boost team performance)\nSubscribe to get the latest posts sent to your email.\n- Concacaf W Champions Cup Qualifiers, global sportswear brand, Guyana Football Federation, MEYBA, U-20 Women’s World Cup Qualifiers\nYour children are starving, and you giving away their food to an already fat pussycat.\nFeb 14, 2026\n(Reuters) – Australia were dealt an early blow in their quest to reach the Super Eight stage of the Twenty20 World Cup after the depleted former champions crashed to a 23-run defeat by Zimbabwe...Feb 14, 2026\n(Kaieteur News) – Georgetown has always possessed the air of a place living on memory. Not history in the grand sense, not the kind that builds monuments and sustains civic pride, but memory that is faded, selective, and slightly resentful. The old wooden houses, leaning like tired men; the...Feb 01, 2026\nBy Sir Ronald Sanders (Kaieteur News) – When the door to migration narrows, the long-standing mismatch between education and economic absorption is no longer abstract; a country’s true immigration policy becomes domestic — how many jobs it can create, and how quickly it can match people to...Feb 14, 2026\n(Kaieteur News) – Members of Parliament from both the PPP Govt side and the opposition aisles have a challenge on their hands. Mr. Speaker, or Mr. Master Executioner. If government MPs choose Mr. Executioner, they giveaway the game -the Speaker delivers for their benefit. When the...Freedom of speech is our core value at Kaieteur News. If the letter/e-mail you sent was not published, and you believe that its contents were not libellous, let us know, please contact us by phone or email.\nFeel free to send us your comments and/or criticisms.\nContact: 624-6456; 225-8452; 225-8458; 225-8463; 225-8465; 225-8473 or 225-8491.\nOr by Email: glennlall2000@gmail.com / kaieteurnews@yahoo.com",
  "word_count": 893,
  "scraped_at": "2026-02-14T12:48:46.355825"
}