{
  "article_id": "635405fbfda5",
  "url": "https://www.chicagotribune.com/2025/09/07/chicago-stars-orlando-pride-martin-stadium/",
  "title": "Chicago Stars set season attendance mark , get the win at Martin Stadium",
  "date": "20250908T014500Z",
  "domain": "chicagotribune.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Near the start of the second half, the Chicago Stars earned a free kick. Defender Sam Stabb sent the ball to the top of the net and scored the first goal of the game.\nThe sun beamed down on the players, but the cool lakeside breeze kept the game at a comfortable temperature. Fans slammed their noisemakers in support after forward Jameese Joseph gave the Stars a 2-1 lead.\nThe crowd roared in excitement as they watched their team beat the Orlando Pride 5-2 in a new venue. Finally, it seems like the Stars have their long-desired soccer atmosphere.\n“I love coming to women’s sports and seeing the support that you get from your community,” said Stars fan Ruth Allard. “Seeing the kids get to see people they can look up to is something that our generation was at the tail end of. So, I get very emotional and excited.”\nThe Stars played their first game at Northwestern’s Martin Stadium against the Pride in their “Lakefront Faceoff” match. It was a preview of what’s to come next season for the NWSL team.\nStars President Karen Leetzow announced the team will play its 2026 campaign on the campus of the Wildcats. It’s not a permanent move — at least not yet — but it’s been an intriguing option for the Stars as they search for a home stadium.\n“It is incredibly accessible,” Leetzow said in the Sept. 4 announcement. “It’s in a terrific community that is very supportive of women’s sports. It’s close to a built-in fan base with university students. It’s just got all the things you could possibly want for these athletes.”\nThe team had merch stations set up in front of various Northwestern facilities. Some ticket holders earned the chance to meet inactive Stars forward and Olympic gold medalist Mallory Swanson before the game. In the south end of the field, there was a fan zone where a DJ played music and kids participated in big Jenga, dances and more.\n“It’s pretty organized and it’s very spacious,” fan Allison Winchester said of the venue. “It’s in line with a lot of what the other NWSL teams have, which is good because we’ve been lacking that a bit.”\nThe Stars and their current venue, SeatGeek Stadium, have reached a sour point in their relationship. The venue, located in Bridgeview, has given fans traveling problems. Taking public transit to SeatGeek can mean three or more separate buses and trains, and traffic around the area makes it difficult to drive.\n“They’ve been incredible hosts to us, but really, really hard for our fans to get to,” Leetzow said. “And certainly with nationally televised schedules, there are challenges when they want to do a Friday night game. Getting people from the city of Chicago out to Bridgeview has just been a crazy challenge.”\nThe fans agreed. The trip to Martin Stadium was a breath of fresh air for many in attendance.\nPhotos: Chicago Stars defeat Orlando Pride in the ‘Lakefront Faceoff’ in Evanston\n“It’s painfully far (for me) to go see them play in Bridgeview,” North Side resident Kelly Cooper said. “Now that they’re playing up here, I think they’re going to get a different and hopefully bigger audience.”\nAdded Winchester, who was wearing her Stars jersey: “Going to SeatGeek is fine if Lake Shore Drive and I-55 isn’t backed up. But coming (to Martin Stadium), it’s such a scenic drive that even if you’re going 30 miles an hour, you’re still in a beautiful environment and not on a highway.”\nThe match offered the gorgeous view of Lake Michigan that Northwestern fans get to see during football, lacrosse and soccer games. It was a peaceful addition to the atmosphere for the spectators.\n“We walked along the lake (on) the little path up from the south parking lot, it’s stunning,” Winchester said.\nThe players noticed the difference in energy at Martin Stadium. They also had to adjust to playing on turf compared to SeatGeek Stadium’s grass, but they adapted well in the Stars’ win.\n“I feel like it’s just a really cool atmosphere, a lot more people can come now, and it’s really good vibes,” said midfielder Julia Grosso, who scored a goal in the 69th minute. “I think that the new stadium gave us that win.”\n“Playing on turf, you want to make sure you’re doing more plyos (so that) your knees and your ankles are strong enough to handle (the turf),” Joseph said.\nThe Stars have consistently been near the bottom of average attendance in the NWSL. SeatGeek Stadium holds up to 28,000, meaning their games have looked virtually empty despite thousands of fans being present.\nChicago Stars will play their 2026 NWSL season at Northwestern’s lakefront Martin Stadium\nStars fans nearly filled the 12,000-capacity Martin Stadium, which brought an increased amount of noise whenever the team scored a goal. The official attendance was 10,127, the highest number for the Stars this season.\nThose who were there hope the new setting will get others to start watching women’s soccer.\n“I hope that it means that the fan base will grow and that we’ll see more people at the games. Just to me, it feels like this is a much more appropriate venue,” said fan Laura Ferdinandt. “They haven’t had the greatest season, but for it to be something exciting to look forward to and bring some energy into the team and the fans, I think it’s a great move and it’s a really exciting opportunity for the team.”",
  "word_count": 918,
  "scraped_at": "2026-02-14T13:42:39.524678"
}