{
  "article_id": "635c423480a3",
  "url": "https://www.cityam.com/only-valid-fifa-world-cup-bid-is-uk-2035/",
  "title": "UK to host first Fifa World Cup since 1966 triumph",
  "date": "20250403T120000Z",
  "domain": "cityam.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UK to host first Fifa World Cup since 1966 triumph\nThe United Kingdom’s 2035 Fifa Women’s World Cup bid is the only “valid” application, according to Fifa.\nThe organisation’s chief Gianni Infantino admitted at the Fifa Congress that it’s the “one valid bid” following the submission deadline.\n“I can confirm that we have received one bid for 2031, and one valid bid for 2035,” Infantino told Fifa delegates in Belgrade. “The 2031 bid is from the USA and potentially some other Concacaf nations. The 2035 bid is from Europe, from the home nations.”\nEngland FA CEO Mark Bullingham said: “ We are honoured to be the sole bidder for the FIFA women’s World Cup 2035. Hosting the first FIFA World Cup since 1966 with our home nations partners will be very special.”\nThe event would be the first football World Cup on these shores since the 1966 edition, when England’s men won their sole trophy.\nPrime Minister Sir Keir Starmer last month threw his weight around the bid for 2035, which would see England, Wales, Scotland and Northern Ireland co-host the World Cup.\nStarmer said the planned bid had his government’s “full support”, adding “football is and always will be at the core of our country’s identity”.\n“Whether we watch on TV, play at the weekends like I do, or simply enjoy soaking up the atmosphere in the pub, it brings communities together like little else.”\nWorld Cup coming?\nSpain had been a keen bidder but did not submit before the deadline.\nEngland’s last major tournament was the 2022 European Championships, which were won by the Lionesses at Wembley.\nEngland co-hosted the men’s Euros earlier this decade, with the final at the national stadium marred by illegal entries.\nBut the home nations and Ireland will host the 2028 men’s European Championships.\nDublin, Liverpool, Glasgow, Newcastle, Birmingham, Cardiff and London will share the hosting duties.\nNorthern Ireland was set for some representation at Belfast’s Casement Park but its redevelopment – to satisfy Uefa hosting rules – was delayed and eventually dropped.\nEverton’s new Bramley-Moore Dock stadium was picked over Liverpool’s Anfield, while Villa Park, Tottenham Hotspur Stadium and the Etihad will all host matches.",
  "word_count": 363,
  "scraped_at": "2026-02-14T13:06:36.467513"
}