{
  "article_id": "63bbc8970bd8",
  "url": "https://mesquitelocalnews.com/2023/09/27/bowling-jacob-martinez-opens-mesquite-bowling-season-with-a-705-series/",
  "title": "Bowling : Jacob Martinez opens Mesquite bowling season with a 705 series",
  "date": "20230927T161500Z",
  "domain": "mesquitelocalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Willie Theis\nJacob Martinez could not have scripted a better beginning to his 2023-24 season at the Virgin River Bowling Center.\nBut first, let’s take a quick gander into how he even ended up bowling in Mesquite in the first place. As late as August 1st, bowling in Mesquite wasn’t even a consideration as he was all set to return for another year of league play at Sunset Lanes in St. George.\nHowever, when Sunset Lanes unexpectedly was sold and closed for bowling at the end of August, it left bowlers scrambling to find a new home. And with Dixie Bowl already filled to capacity with leagues, Martinez and teammates Stan Benally, Terrull Benally and Myles Benally fortunately found a landing spot in the Mesquite Merchants League.\nSo, let’s fast forward to his first game of the season in a house he’s never bowled in before and he blistered the lanes with a standout 248 effort. And he followed with a 231 and 226 for an eye-popping 705 series while tattooing the 1-3 pocket with 22 total strikes.\nAmazingly, Martinez only began league bowling in 2020, generates a ton of revs with his smooth, yet powerful delivery, and already sports a career-high 730 series and 287 game.\nHe graduated mana cum laud from Utah Tech University last spring, graduated from Dixie High School in St. George in 2019, and is pursuing further studies in the medical field with the goal of becoming a chiropractor.\nAway from bowling he’s a huge fan of the Denver Broncos, Colorado Rockies and Denver Nuggets, and also likes the resurgent Colorado Buffaloes football program which had become the epicenter of college football the first three weeks of the season.\nFinally, this isn’t the last time you’ll be reading about Martinez unleashing his potent strike ball for big scores. It’s the beginning!\nIn other stellar pin action, Scott Mattingly led all series scoring with a 750 which included a 279, while John Hollaway (735-278) has bragging rights to both the high series and game rolled in week 1 of the Wednesday Men’s League, and Al Gans (713-276) can still hang with the best when he brings his strike ball to the party.\nAnd Mike Rogers (705-250) showed yet again why he’s one of the best bowlers in Mesquite, Milan Carr (705-247) who loved the dominating performance of his Buffalo Bills on Sunday delivered one of his own on Monday, while Austin Finster (699-269), a barista at Starbucks and powerful young man capable of some explosive scoring fell a stick shy of a 700, and a third perfecto for Mike Saldivar (669-278) is certainly doable.\nAnd it sure seems like newcomer Todd Koller (691-246) will be capturing his share of ink this season, and it also looks like Bruce Hooley (671-270) will follow his outstanding season last year with another this season.\nDave Castro (663-244) still travels to senior tournaments in California and continues posting some good numbers, and John Martin Jr. (645-249) is another newcomer to Mesquite bowling and has the game to light up the scoring monitors on a regular basis.\nMeanwhile, Norm Ritchie averaged 218 between a pair of first-rate outings (658-230 & 651-235), Bob Marget (645-257) who hails from “The Land of 10,000 Taxes” (Minnesota) had a good first week back on the lanes, and Dan Aslin (651-224) is a truly avid reader of great books and merits ink for an impressive clean series, while Randy Kezior averaged 208 between two terrific outings (630-225 & 621-225).\nAnd Gil Niimi averaged 203 between two good outings (616-226 & 607-222), Angel Hernandez (615-216) is off to a good start in his sophomore season, Brian Collins averaged 203 between a pair of competitive performances (612-226 & 607-215), and the duo of Dale Davidson (602-223) and Robert Melendez (601-219) also delivered some nice pin action.\nIn single game play, Dennis Craft is a talented and crafty southpaw bowler who led all single game action with a 288, and also averaged 227 between a pair of top-notch performances (681-288 & 674-269, Darren Simonds (632) popped a 279, and Doug Love (693) who grew up on a dairy farm in Pennsylvania uncorked a 278.\nMeanwhile, Dean Sheppard (620) finished a 269 game with an impressive 9-bagger, Alan Jacobson (628) chucked a career-high 267, Sal Diaz (632) popped a 245, and Johnny Harper (235 & 205) smacked two nice deuce games in Early Risers League action.\nAnd it’s great seeing Martin Carrillo back on the lanes and pounding out a 233, Javier Delgadillo’s (579) impressive clean 228 game included a 4-bagger and seven total strikes, and Stan Benally chucked a 225, and Chris Scott fired a 225.\nWade Heileson who hails from Idaho registered a 218, Ken Schloman booked a 215, Steve Serrano tallied a 214, Wally Posey cranked out a 213, and Mike Foote (597) racked up a 211. And finally, Fred Emmons, Dick Lonick, Richard Long, Bob Davis, Mark Brackelsberg, and Dave Keil notched games of 205, 205, 204, 203, 202, and 201, respectively.\nOn the women’s side of the ledger, Sandy Sheppard finished atop the scoring food chain with a 617 set on games of 224, 202 and 191 with 18 total strikes, and coupled with a 606 four days later, averaged 203 for the week, while Bev Cormani’s (587-216) good outing portends a 600 is likely on the horizon, and Cheryl Rogers (587-218) who also plays senior softball launched her 2023-24 season with a first-rate effort.\nAnd it’s great seeing MaryAnn Davis (572-213) back on the lanes after missing all of last season with a foot injury, and look for both Autumn Telford (568-201) and Diane Marget (564-203) to begin pounding out even beefier scores as both have a history of putting up some big ones.\nJan Quinn definitely merits ink after rolling her best series in a year, a nifty 560 that included a nice 212 game, Evelyn Hooley (538-196) also joined the scoring action, and Reiko Schultz pocketed a solid 524 set.\nAnd it’s always super seeing Kerri Roberts pummeling pins and she dispatched 522 of ’em in the first night of City High Rollers League play last Thursday, Jane Burgoyne (511-191) has been working on her game and it looks like she’s headed to her best season of bowling in Mesquite, and it’s looking like that could also be the case for Francine Gastelum (510-200).\nIn single game action, Lynae Page (528) popped a 214, Shari Reynolds (511) tossed a 208, while both Debbie Hansen (516) and Renee Swall (503) each booked a 200 on the nose.\nHIGH SCORES\nRandy Brown 681-256; Jeremy Telford 670-243; Dean Baum 640-224; Dylan Kesl 640-242; Dale Knight 639-225; Harold Hendrick 635-235; Jeff Branche 631-220; Mike Yoder 629-236; Bobby Dixon 620-245; Ernie Kala 619-246; Rob Cormani 619-234; Duane Sullivan 615-214; James Hartley 613-212; Larry Moultrie 610-226; Bryan Pierce (608-224); Allen Cope 256; Jerry Holloway 243; Koa Paka Ned 235; David Harris 232; Dalton Smith 228; Larry Willis 228; Mike Bock 227; Larry Moultrie 226; Randy Carter 226; Bill Rife 224; Jeremy Turlington 224; Gary Smith 223; Alan Pearson 220; Carlos Baeza 220; Frank Addamo 220; Mike Gentry 217; Ken Schloman 215; Rob Hartman 214; Bill Funk 214; Jose Mendoza 214; Steve Serrano 213; David Newman 212; Mike Foote 211; Bob Ballard 211; Bob Morgan 210; Logan Hendrick 209; Ted Mickelson 208l Rod Engle 206; Bob Robbins 205; Brent Schlesinger 205; Harry Uncles 205; Jon Fjeld 205; Mardon Connelly 203; Shaun Edwards 203; Britt Kesl 202; Mike McClure 202; Jake Noll 201; Jimmy Webb 201; Red Powell 201; Ed Hoepfner 200; Paul Buntin 200; Jamie Turlington 515; Nannette Kezior 511-192; Krista Kilpatrick 501.",
  "word_count": 1275,
  "scraped_at": "2026-02-14T12:39:48.763690"
}