{
  "article_id": "63cf26e64b09",
  "url": "https://www.france24.com/en/live-news/20230117-hot-brit-label-wales-bonner-launches-buzzy-menswear-week-in-paris",
  "title": "Hot Brit label Wales Bonner launches buzzy menswear week in Paris",
  "date": "20230117T210000Z",
  "domain": "france24.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hot Brit label Wales Bonner launches buzzy menswear week in Paris\nParis (AFP) – One of the buzziest ever menswear fashion weeks launched in Paris on Tuesday, with young British designer Grace Wales Bonner showing why she is tipped for big things with her homage to the \"black flaneur\".\nIssued on:\nThe 31-year-old, who has Jamaican heritage, has made her name with smart references to black artistic icons and colonial history -- as well as the seemingly effortless cool of her outfits.\nThat has made her one of the frontrunners for one of the highest-profile gigs in the fashion business at Louis Vuitton, where a huge void was left by the death of Virgil Abloh in November 2021.\nBonner's first physical show at Paris Fashion Week, spread across the ornate rooms of the Hotel d'Evreux in the Place Vendome, successfully burnished her reputation.\nThe silk Savile Row tuxedos, tweed coats and studded corduroy trousers evoked, in her words, \"the black flaneur\", and she name-checked artists such as the writer James Baldwin and singer Josephine Baker who made Paris their home in the 20th century -- often escaping prejudice elsewhere.\n\"What I found most interesting about these international artists and writers being in Paris, was what it opened up for them in terms of freedom of expression,\" she told a scrum of reporters backstage.\nBonner has also made smart moves commercially, teaming up with Adidas for sportier offerings that offered a preview of her commission to outfit the Jamaican national football team.\nShe is one of several women who have opted to focus on menswear, as male clothes become the more daring and interesting side of the industry.\n\"With menswear, I went into it because I thought there's a lot more room for expression within that. It feels like menswear is not overdeveloped -- it can be quite conservative at times,\" she told AFP.\nThere is also excitement around another young Brit, Bianca Saunders, who holds her show on Wednesday, and for the return of award-winning US designer Emily Bode, known for using recycled material, who stayed away from Paris during the pandemic.\nWhile many are worried about the impact of possible recessions, tightening environmental regulations and inflationary costs, menswear is seen as a bright spot.\nThis menswear week in Paris is boosted by the return of two big names: Saint Laurent later on the opening night and John Galliano's Maison Margiela closing the week on Sunday.\nGivenchy notably abandoned haute couture and took up menswear after the arrival in 2020 of US designer Matthew Williams, known for his luxury streetwear.\nThey stage their catwalk show on Wednesday, with key rival Dior strutting out on Friday.\n© 2023 AFP",
  "word_count": 448,
  "scraped_at": "2026-02-14T13:34:54.144553"
}