{
  "article_id": "63e05043246b",
  "url": "https://northdallasgazette.com/2025/06/11/nijaree-canady/",
  "title": "NiJaree Canady - North Dallas Gazette",
  "date": "20250612T040000Z",
  "domain": "northdallasgazette.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NiJaree Canady, a 22-year-old African American softball phenom, has become the first college softball player to sign a Name, Image, and Likeness (NIL) deal worth more than $1 million, a historic moment in collegiate sports.\nThe former Stanford ace transferred to Texas Tech, where she secured a groundbreaking $1,050,024 one-year contract through the Matador Club, an NIL collective affiliated with the university.\nThe deal includes a $1 million direct payment, $50,000 for living expenses, and an additional $24 in honor of her jersey number.\nAccording to BlackNews.com, Canady, who was named the 2024 USA Softball Collegiate Player of the Year, entered the transfer portal shortly before Texas Tech hired Coach Gerry Glasco. He acted quickly to bring her to Lubbock—with backing from NFL quarterback and Red Raider alum Patrick Mahomes—and offered her not just a starting role but an expanded opportunity to develop her offensive skills.\n“The coaching staff and their vision were a major reason I made this decision,” Canady told ESPN.\nShe described her transition from Stanford’s Palo Alto campus to West Texas as smooth, noting that the environment reminds her more of her hometown of Topeka, Kansas.\nUSA Today noted that Canady’s impact on the field was immediate and unmatched.\nDespite suffering a minor injury, she helped lead Texas Tech to its first Big 12 regular-season and conference titles, finishing the season with a 26-5 record and a nation-leading ERA of 0.86.\nShe also threw a two-hit shutout with 10 strikeouts to deliver the program’s first-ever win at the Women’s College World Series. Coach Glasco called Canady the best pitcher he’s ever coached and said he believes she can lead Texas Tech to a national championship.\nHer resume is as stacked as her fastball is deadly.\nIn addition to her 2024 USA Softball Player of the Year honor, Canady received the Honda Sport Award, was a two-time Women’s College World Series All-Tournament Team selection and dominated at Stanford with a 41-10 record and a 0.67 ERA over two seasons. She also represented Team USA in the 2024 Japan All-Star Series.\nBefore college, Canady was a standout at Topeka High School, where she was a two-time Kansas Gatorade Player of the Year and led her team to back-to-back state championships.\nShe graduated in 2022 and was ranked as the No. 11 softball recruit in the nation by Extra Innings Softball.\nOff the field, she’s equally grounded—an academic All-American who enjoys reading and spending time with her dog.\nShe is the daughter of Bruce and Katherine Canady, and her brother Bruce Jr. plays football at Cal. Canady’s NIL deal not only sets a new benchmark for college softball but also signals a shift in opportunities for Black female athletes in a space that other demographics have long dominated.\n“She’s changing the game—literally and financially,” Coach Glasco said.",
  "word_count": 468,
  "scraped_at": "2026-02-14T13:20:19.740148"
}