{
  "article_id": "63f01205ac1f",
  "url": "https://www.wtol.com/article/news/nation-world/march-madness-bracket-skipping/507-ff33bffd-f0d0-4f68-bfee-a8241a99e3a5",
  "title": "Many Americans skipping NCAA March Madness brackets",
  "date": "20250320T140000Z",
  "domain": "wtol.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WASHINGTON — In East Lansing, Michigan, college sports often dominate conversations — especially in March, when everyone seems to be filling out their NCAA brackets.\nJessica Caruss would know; she has lived in the area for most of her life. She loves sports, and she's a Michigan State fan, but she won't be drawing up a March Madness bracket that shows her team (or any team) winning it all.\n“Oh, I’m aware. I just don’t do brackets or anything,\" Caruss said. \"I don’t gamble; I don’t see the appeal of it. For me it’s not a rush. It’s stressful.”\nShe's far from alone in bypassing the brackets. As the annual tournament kicks off, some Americans skip the madness — or at least they don't try to predict who will win. A new poll from The Associated Press-NORC Center for Public Affairs Research shows that about 7 in 10 U.S. adults say they “never” fill out a bracket for the NCAA men’s or women’s basketball tournament.\nThis group leans more female: About 6 in 10 bracket avoiders are women.\n“I'm probably not going to watch. I have not really been into it in quite some time,” Caruss said. “I’ve never understood the March madness.”\nOther bracket avoiders plan to watch tournament games but won't predict winners. Chris Lara lives in Belvidere, Illinois, but supports UCLA because of his California roots. Both the UCLA women’s and men’s basketball teams will be competing in the NCAA tournament, and he plans to cheer them on. But he doesn’t feel confident in his ability to determine the winners for every match-up in a bracket.\n“I don’t have the knowledge to pick the teams correctly or to know the ones that are the best,” Lara said. “I would just go with my heart and pick teams. ... And then it wouldn’t work out well.”\nFor some people, the madness is barely registering.\nJustin Campbell, a 29-year-old from Brookhaven, Mississippi, said he’s never followed sports closely. He’s not tracking the NCAA tournament, let alone making a bracket. He might tune into a game if it’s on at a restaurant he’s at, but basketball takes a back seat to football in his corner of southern Mississippi.\n“I’m sure if I was in a different town where it was all we talked about, it might be different,” Campbell said. “But where I am, football is more the big thing.”\nEven among the sliver of U.S. adults who fill out a men’s or women’s bracket at least “some years,” about two-thirds of that group say the fact that other people were doing it was a “major” or “minor” reason for their participation.\nIn the suburbs of Seattle, Laura Edain said she’s not interested in March Madness, either, and does not plan to seek out any games. Edain, 55, used to work in an office that may have had more discussion of March Madness and brackets as it happened — or she would overhear references to Gonzaga University's many tournament runs — but the bracket predictions have never appealed to her.\n“I don’t think I would have participated, even then,\" Edain said. \"And now, I just am not in any kind of circle that really talks about it at all.”\n___\nVisual Storytelling News Editor Panagiotis Mouzakis in London contributed to this report.\n___\nThe AP-NORC poll of 1,112 adults was conducted Feb. 6-10, using a sample drawn from NORC’s probability-based AmeriSpeak Panel, which is designed to be representative of the U.S. population. The margin of sampling error for adults overall is plus or minus 4.1 percentage points.\nCopyright 2025 Associated Press. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.",
  "word_count": 614,
  "scraped_at": "2026-02-14T12:10:52.080937"
}