{
  "article_id": "643cfe52409c",
  "url": "https://theathletic.com/4265155/2023/03/03/manchester-united-mason-greenwood-future/",
  "title": "Mason Greenwood and his Manchester United future : The state of play",
  "date": "20230303T093000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United announced Aug. 21 that Mason Greenwood will not return to the team.\nIt is now a month since the criminal investigation into Manchester United and England forward Mason Greenwood was dropped and the general public remains none the wiser as to his future at Old Trafford.\nGreenwood, 21, has not played for United since he was arrested in January 2022. He subsequently faced a police investigation but charges against him for attempted rape, assault occasioning actual bodily harm and controlling and coercive behaviour were discontinued by the Crown Prosecution Service in early February.\nAdvertisement\nAll three counts related to the same complainant, who is not identified in our reporting because, under UK law, she is entitled to anonymity for life. This is also why comments on this article are switched off. We can, however, provide some informed analysis of the conversations we have had with individuals familiar with the situation, none of whom are prepared to speak publicly due to the sensitivity of the discussions.\n- Latest: Manchester United’s Mason Greenwood return plan included ‘hostile’ figures list\n- Manchester United told senior staff that Mason Greenwood will return\n- Survey: Manchester United and Mason Greenwood\nUpon the discontinuation of the charges, the CPS said “a combination of the withdrawal of key witnesses and new material that came to light meant there was no longer a realistic prospect of conviction”.\nWhile the criminal case may be over, Greenwood’s future as a footballer for United remains in the balance, with the club currently conducting its own investigation as they seek to build as full a picture as possible of the events that led to a complaint being made against him last year. This has involved United representatives meeting with Greenwood.\nA month after launching the investigation, the option of reintroducing Greenwood to the club’s first-team squad as part of a possible phased return to football does remain firmly under consideration, but club sources insist no decision has yet been taken and it is one of several options, including a parting of the ways, that remains possible.\nUnder the scenario Greenwood stays, United would be likely to follow a phased process, taking into account the sentiment of fan groups, sponsors and the women’s team at differing stages. It would include encouraging Greenwood to receive a form of counselling or therapy, ahead of a possible broader rehabilitation.\nIt has also been suggested that such an approach may also include exposing Greenwood to a television interview in which he is challenged on the events that have taken him to this point.\nThe sources also added how, in the event the club decides to bring Greenwood back, United may seek to frame him as a young man who has made mistakes and is remorseful for his actions, while also believing they have a responsibility to help rehabilitate a player who has been on the club’s books since the age of six. United sources counter that they would only present the player in this way if they consider it to be the truth on the basis of their internal findings.\nAdvertisement\nUnited declined to comment when approached for this report, other than pointing to the club’s statement last month in which they said: “The club will now conduct its own process before determining next steps. We will not make any further comment until that process is complete.”\nLast weekend, The Sun newspaper reported Greenwood is to become a father after his partner became pregnant. This follows previous reports in the same newspaper that Greenwood has reached out to United team-mates, including a meeting with former academy players and messages sent to senior United players on social media, all of which offers the impression of Greenwood attempting to bring more stability to his life.\nWhile Manchester United declined to comment formally, club sources insisted there are no active discussions with broadcasters. They also said it is premature to say the club is, at this stage, leaning one way or another while the “process” is ongoing. As such, the prospect of severing ties also remains.\nThey added that any ultimate decision after the findings will be taken by the club’s co-owner Joel Glazer and chief executive Richard Arnold. This is of course only true as long as United remain under the ownership of the Glazer family, with the club currently considering offers from Jim Ratcliffe’s INEOS group and Sheikh Jassim of Qatar, while minority investment or alternative financing models remain a possibility, too.\nUnited are conscious of the brittleness of any rehabilitation plan for Greenwood, given the volatility of the past year. Many within the club are also aware that restoring the player to their setup may take a sledgehammer to their reputation.\nUnited manager Erik ten Hag has not spoken publicly about Greenwood, aside from when he referred to the club’s statement when asked for his view in a press conference, but he has had at least one conversation with the player. Ten Hag is in an extremely strong position at Old Trafford after transforming the club’s fortunes since taking over last summer and his view will be taken under consideration by Arnold and Glazer.\nAdvertisement\nTen Hag’s view will be weighed up in the discussion, while the director of football John Murtough will also feature, but this is ultimately a call that will require sign-off from the very top. At this moment in time, the investigation is being carried out by a very small circle of senior United executives, with Arnold overseeing but not actively involved in the meetings, which include the club’s legal counsel.\nAlthough United were unable to conduct any kind of internal process while Greenwood remained under criminal investigation, the club did not completely cut communication with the player’s representatives during that time. For example, the club sent security personnel to assist Greenwood’s parents during the player’s bail hearing at Manchester Magistrates’ court.\nAdditionally, United were made aware in advance when The Sun published a story about a breach of bail conditions and the club ensured the information reached the player’s family, who would also have been contacted by the newspaper as a matter of courtesy.\nDuring a hearing at Manchester and Salford Magistrates’ Court on October 17, the court heard the complainant made allegations against Greenwood following an ABE (achieving best evidence interview). This is a video-recorded interview with a witness deemed vulnerable or intimidated where the recording is intended to be played as evidence in court at a later date. However, the complainant subsequently provided a retraction statement.\nGreenwood — whose United contract runs until the summer of 2025 with the option of a further year’s extension — has not commented publicly since he issued a short statement when the CPS dropped the charges, which read: “I am relieved this matter is now over and I would like to thank my family, loved ones and friends for their support. There will be no further comment at this time.”\nThe Athletic has previously reported that some members of the Manchester United women’s team feel deeply uneasy about the prospect of Greenwood returning to the men’s first team, given that he has not been cleared, while others are more circumspect, waiting to hear the findings of United’s process.\nNatalie Burrell is a fan of Manchester United’s men’s and women’s teams and founder of the Manchester United Women’s Supporters’ Club.\nAdvertisement\nShe told The Athletic in early February: “I don’t think he should play again for Manchester United. They need to make a statement and letting him back would be the worst thing they could do. It would set our club back in terms of what we’re trying to do with our women’s team and campaigns like Her Game Too, which are trying to encourage women to play and watch football.\n“I just don’t want to see him training. I don’t want to see him in a (United) kit. I don’t want to see him ever coming out at Old Trafford again.”\n(Top photos: Getty Images; design: Eamonn Dalton)",
  "word_count": 1336,
  "scraped_at": "2026-02-14T13:46:06.995767"
}