{
  "article_id": "6447d8a99f86",
  "url": "https://news.illinoisstate.edu/2026/01/redbirds-soar-into-nashville-for-fcs-national-championship-game/",
  "title": "Redbirds soar into Nashville for FCS national championship game",
  "date": "20260105T093000Z",
  "domain": "news.illinoisstate.edu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Redbird fans from across the country converged in Nashville, Tennessee, Sunday, ahead of the Illinois State University football team’s appearance in the FCS national championship game Monday, January 5, against Montana State University.\nBirds on Broadway\nHundreds of fans decked out in Redbird attire and “Beat Montana State” stickers crowded into Dierks Bentley’s Whiskey Row in downtown Nashville Sunday night for the Birds on Broadway Pre-Championship Party.\nJermaine Barton ’14, an All-Missouri Valley Football Conference right tackle who played at Illinois State from 2012-14, was among more than 30 members of the 2015 FCS Championship runner-up team at the party.\nBarton, who traveled to Nashville from Indianapolis, said he wants to “see them finish business for us” after the 2014-15 Redbirds fell just short in the final seconds of their national championship bid against North Dakota State in Frisco, Texas.\n“For a full 10 years, it’s been on my mind every day. I still think about it,” Barton said. “So, it’ll be nice to come back and see them finish it.”\nBarton attributes much of Illinois State’s success in the 2025 FCS playoffs to the team’s balanced running/passing offense. He also sees a trait reminiscent of his 2014-15 team: “They’re tough,” Barton said. “(Head coach) Brock (Spack) put that in them.”\nSusan Nelson-Brown ’78, an alumni network organizer and past president of the Alumni Board of Directors, arrived at the pregame party from her home in Dallas, donning head-to-toe Redbird gear—from a red fur hat to Reggie Redbird tennis shoes.\n“I am a super Redbird fan. I love my team, and this is a once-in-a-lifetime opportunity,” Nelson-Brown said. “I feel that we are road warriors, and we will win this game tomorrow, and I am waiting to buy the championship flag to take home to Dallas.”\nWally Sparks ’83, who played on the Redbird football team from 1979-82, met up with several of his teammates, including his former roommate, at the pre-championship party.\n“I’m just happy for the University. It’s great to watch the success,” he said. In 2015, Sparks traveled from his home in St. Louis to Frisco to watch the Redbirds in the FCS title game. He’s looking forward to another shot at a national championship.\n“It’s terrific,” Sparks said. “I hope it’s as good a (national championship) game as the last one, with a little different result.”\nAnother St. Louis native, Hilary Crews, the mother of sophomore defensive back Aidan Crews, was among several Redbird football parents at the pre-championship party. She said traveling to all 17 of Illinois State’s games, including five-straight away from Normal throughout the FCS playoffs, has been “exhausting but amazing at the same time.”\n“Most of the families that are here tonight have been everywhere with their kids,” Crews said.” It’s just been such an amazing experience and so exhilarating.”\nAidan Crews has extra support in Nashville, with his grandfather, Dan Bruening ’71, who played football and ran track at Illinois State, cheering from the FirstBank Stadium stands.\n“For him to be here and experience this with his grandson, it’s just been phenomenal,” Hilary Crews said.\nOn neon-lit, bustling Broadway Street outside of Dierks Bentley’s Whiskey Row, longtime Redbird football season ticket holder Dawn Watson ’87, M.S. ’97, said she’s confident in Illinois State’s ability to win a national title.\n“This year, we’re going to win it for Brock, because it’s his birthday!” Watson said. “It’s been unbelievable with not being ranked (in the playoffs) and winning on the road. We’ve still got one more win to get, and we’ll get it done.”\nSunday afternoon, Redbird fans gathered at Martin’s Bar-B-Que Joint for a pregame celebration before the Illinois State women’s basketball team faced Belmont University.\nNext stop, Nashville\nTwo charter buses transported fans from Normal to Nashville Sunday as part of a sold-out travel package for the FCS Championship game.\nJudge James Knecht ’68 invited his grandsons, Jack and Jace, for what he expects to be a memorable experience.\n“I am looking forward to the game with optimism,” Knecht said. “This team has been touched by lightning—they’re fun to watch. I love to watch this team because of talent and grit, and I particularly enjoy players with local connections.”\nBeth Harding Nybakke and David Nybakke also boarded the fan bus to Nashville. Harding Nybakke said they’re looking forward to cheering on the Redbirds before, during, and after the game.\n“Watching the team come together throughout the season through the ups and a few downs … they’ve overcome injuries and obstacles and played with heart,” Harding Nybakke said. “The family vibe among the players and coaches is palpable.”\nSpotlight on the Birds\nAfter flying to Nashville Friday afternoon, the Redbirds bused to FirstBank Stadium Saturday for a team photo, a press conference with head coach Brock Spack, player media availability, and a team practice.\nDuring his press conference, Spack emphasized the significance of Monday’s national championship game.\n“The ultimate success in our sport is to win a national championship. I think that would be awesome,” Spack said. “I told our team there’s only one first time (for a program to win a national title). … I said, ‘Fellas, you have the chance to do something that no one’s ever done.’”\nFCS Championship game\nIllinois State (12-4) faces No. 2-seeded Montana State (13-2) in the NCAA Football Championship Subdivision (FCS) national championship game Monday, January 5, at 6:30 p.m. CST, at FirstBank Stadium (Vanderbilt University) in Nashville, Tennessee.\nCheer on the Birds\nVisit the official Redbird Championship Headquarters at GoRedbirds.com/Nashville to learn more about how you can join the journey for a national championship.\nFollow the action\nThe national championship game will be televised live on ESPN. Several watch parties are planned in Bloomington-Normal and across the country. The game will also air live on WJBC AM 1230 / 102.1 FM / 98.9 FM WJEZ / The Varsity Network.\nRead more about the Redbird football team’s historic 2025-26 playoff run and follow our coverage from Nashville of the national championship game at News.IllinoisState.edu.",
  "word_count": 1000,
  "scraped_at": "2026-02-14T14:22:38.251140"
}