{
  "article_id": "64bc1002d9f8",
  "url": "https://www.dailymail.co.uk/news/article-15049645/Barry-Davies-Britain-National-Service.html",
  "title": "Commentating legend Barry Davies says Britain should bring back National Service and says  we wont recognise what English quite soon  - and reveals the one current pundit he cannot stand",
  "date": "20250830T150000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Commentating legend Barry Davies says Britain should bring back National Service and says 'we won't recognise what's English quite soon' - and reveals the one current pundit he cannot stand\nLegendary commentator Barry Davies has claimed that Britain should bring back National Service and admitted that he fears for his grandchildren because of the state of the country.\nThe 87-year-old broadcasting icon covered 10 World Cups and 17 Olympic Games and is the last surviving commentator from England's victorious campaign in 1966.\nDavies is known for his commentary on iconic sporting moments including Maradona's infamous 'hand of God' goal against England at the 1986 World Cup, amid a five-decade career which saw him work on Match of the Day from 1969 until 2004.\nBut it was during National Service that his broadcasting career began.\nBorn in 1937, Davies was among the final officers to complete the 18-month compulsory service, which ended in 1963, and he worked with the British Forces Broadcasting during his time with the British Army of the Rhine in West Germany.\nThe commentator would round up military matches for the British Forces Network radio, which he claims taught him valuable skills of discipline and timekeeping.\nOn returning from Germany he was given a job by BBC Radio, working on Sports Report, and later television at ITV before the 1966 World Cup.\n'National service did totally change my life,' Davies told The Telegraph.\nLegendary commentator Barry Davies has claimed that Britain should bring back National Service\nThe 87-year-old admitted that he fears for his grandchildren because of the state of the country\nDavies' broadcasting career began when he was on National Service, working with the British Forces Broadcasting during his time with the army\nAnd he believes it should be reintroduced but that 'most wouldn't even clean their own shoes'.\nThe London-born broadcaster spends his winters in Florida and became the first of his trade to be inducted into the National Football Museum hall of fame in March.\nBut he fears that we won't recognise the country for much longer.\n'I think that we won't recognise what's English quite soon. Go and walk along the street. If you can find an Englishman on the street in London, you're doing quite well,' he said.\n'If you stop to ask a question about this, it becomes racist. I'm certainly not that. But the standard of life has fallen so much. I dread to think of what life might be like in 10 years' time. I worry for my grandchildren, even though I know I won't be here.'\nDavies' famous lines include 'Where were the Germans? But frankly, who cares?' during Great Britain's men's hockey victory at Seoul 1988 as well as simply saying 'Oh no' when Gareth Southgate missed his penalty at Euro 1996.\nAnd such is the lasting popularity of his 'interesting, very interesting', to describe Derby's Franny Lee scoring against his former club Manchester City in 1974, that it was the title of his autobiography, published 33 years later.\nMemorable for a different reason is the sensitive tone he struck when describing the tragic scenes at Heysel in 1985, before, remarkably, having to commentate on the match.\nBut Davies is critical of modern day commentary, which he believes involves too much talking.\nThe 87-year-old broadcasting icon covered 10 World Cups and 17 Olympic Games. He also spent 35 years on Match of the Day\nThroughout his career he had a heated rivalry with the late legendary commentator John Motson, with the pair competing over the most important matches\nDavies is known for his commentary on iconic moments including Maradona's infamous 'hand of God' goal against England\nHe singles out the popular Ally McCoist, adding that he can't listen to him and turns the television down if he is speaking.\nWhile Davies has no problem with women commentating on the men's game, he said he would like to see 'a couple of men do a women's match' as 'it should be both ways\nThroughout his career he had a heated rivalry with the late legendary commentator John Motson, with the pair competing over the most important matches.\nTheir rivalry started after Motson was chosen to cover the 1977 FA Cup Final in what was viewed as a snub by Davies.\nMotson, who passed away in 2023, was sometimes as more connected to the public.\n'Barry works from the grandstand while Motty works from the terraces,' was how Jonathan Martin, head of BBC TV Sport in the Eighties and Nineties, described it.\nWhile Motson's style was information-heavy, Davies' was measured for the most part, with bursts of excitement to illuminate the great sporting moments.\nDavies' retired from broadcasting in 2018, with his final job covering that year's Wimbledon Championship.",
  "word_count": 789,
  "scraped_at": "2026-02-14T12:12:16.090761"
}