{
  "article_id": "64c70dcfb295",
  "url": "https://www.theguardian.com/world/2023/jun/12/first-edition-boris-johnson-resignation",
  "title": "Monday briefing : How Boris Johnson bade farewell to parliament … for now",
  "date": "20230612T064500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning.\nWhat a weekend. The Conservative party is again on the edge of civil war after one of the country’s most divisive politicians decided he was bowing out, before the electorate could push. Less than four years after he won an 80-seat majority, Boris Johnson is departing parliament. Unlike so many before him, it is not to spend more time with his family, who didn’t warrant a mention in his bitter resignation. Rather, Johnson dramatically quit on Friday lashing out at the cross-party investigation into the Partygate scandal, which concluded that he had misled parliament and recommended an extended suspension from the House of Commons. This, crucially, would have allowed for a recall petition and a potentially embarrassing byelection in Uxbridge and South Ruislip, where he held a majority of 7,210. Miranda Bryant spoke to his constituents as they said farewell to their local MP.\nBut that was neither the start nor the end of Rishi Sunak’s weekend woes. Johnson’s departure was preceded by Nadine Dorries’s resignation as MP for Mid Bedfordshire after she was left off Boris Johnson’s controversial resignation honours list. And a third was to follow over the weekend, with Nigel Adams, another Johnson ally, deciding he wanted to join in the fun. The melodrama has been music to the Labour party’s ears, as Rowena Mason and Aubrey Allegretti reported that Labour sources view the seats of both Dorries and Johnson as winnable. Read Alexandra Topping’s detailed analysis on the opposition parties’ chances for more information.\nTo add to the intrigue, Johnson alluded that he might be coming back, writing “It is very sad to be leaving parliament – at least for now …” However, Sunak and the Conservative officials he attacked would have to approve his application as a candidate elsewhere at the next general election – an unlikely scenario. For a rundown of a weekend in Tory madness, keep reading. First the headlines.\nFive big stories\n-\nFrance | An 11-year-old British girl was shot dead as she played on swings at her family home in Brittany, France on Saturday. Solenne Thornon, 11, died immediately while her father, 52-year-old Adrien, was shot in the head, leaving him in a critical condition in hospital. The girls’ mother, Rachel, 49, was shot in the back and the head but was reportedly out of danger. Authorities said a 71-year-old Dutch man was taken into custody. French media reported there had been a conflict between the British family and their neighbours over a plot of land.\n-\nScotland | Nicola Sturgeon has been questioned by detectives investigating allegations of financial misconduct by the Scottish National party. The former first minister and SNP leader was released without charge, pending further inquiries, after voluntarily going to a police station. She is the third senior figure in the SNP arrested as part of Operation Branchform, which is investigating allegations that more than £600,000 in donations for an independence campaign was misspent by the party.\n-\nColombia | The four young Colombian siblings who managed to survive for 40 days in the Amazon jungle after their plane crashed have been reunited with their family as further details emerged of their astonishing feat of endurance. The children’s grandfather, Fidencio Valencia, who visited them in the Bogotá hospital where they are recuperating, said they were “shattered but in good hands and it’s great they’re alive”.\n-\nSociety | A new study has found that almost 7% of the UK population has changed their sexual identity over a six-year period. Women aged over 65 are one of the most “sexually fluid” groups, challenging the assumption that moving between heterosexual and non-heterosexual identities is more common among younger people.\n-\nTony awards | It was a big night for Brits at the Tony awards, after Jodie Comer won best actress in a leading role in a play and Tom Stoppard sprawling family drama Leopoldstadt was named best play. It was also a historic night for non-binary actors: J Harrison Ghee was named best actor in a leading role in a musical and Alex Newell won best featured actor in a musical.\nIn depth: ‘Kangaroo courts’, ‘cowards’ and ‘civil war’\nJohnson’s 1,000-word resignation was laced with resentment, paranoia and indignation, taking aim at the government, the Labour MP Harriet Harman who led the privileges committee probe into the lockdown-breaking parties, and Sue Gray, the civil servant turned Labour chief-of-staff who first investigated him. Echoing Donald Trump’s rhetoric in the US, Johnson lambasted a “witch-hunt” orchestrated by the establishment that pushed him out of office (even though he chose to step down). Read Peter Walker’s full analysis of his resignation for more context and examination.\nMany are clearly happy to see the back of Johnson (for now). Labour’s deputy leader, Angela Rayner, called Johnson a “coward” who has “no respect” for the 2019 Conservative voters who put their faith in him. And a diplomat (of all people) reportedly said “Typical Boris. Full of shit” in response to the news. Aubrey Allegretti reported that senior Tories have told Johnson and his allies to “shut up and go away” and yesterday Grant Shapps, a senior cabinet minister, claimed that the “world has moved on” from Boris Johnson.\nHowever, it seems the Conservative party has not.\nAlthough Johnson has plenty of foes, he still has a significant number of allies, and they could make things very difficult for Sunak’s government. Before we look at what might happen in the future, let’s take a look back at how we got here.\nWhere it all began\nLast Tuesday morning, seven MPs who have been investigating whether Johnson had misled parliament over Partygate unanimously concluded that the former prime minister had indeed, recklessly or deliberately, misled the Commons about what had happened, and on more than one occasion. The full findings will be published later today and are expected to be damning.\nEven though Johnson has developed something of a reputation for managing to survive scandals, these findings would have been particularly challenging to weather, especially as the committee recommended that Johnson be suspended for more than 10 days. This punishment would have likely resulted in Johnson fighting for his marginal seat in a byelection. After receiving a confidential copy of the findings, Johnson had two real choices: fight or run, while throwing as many stones as possible, and find a hiding place to recoup. Johnson chose the latter, and he did so in the most explosive fashion possible.\nFirst, his outrider, Nadine Dorries, announced her resignation, hinting at mysterious goings on that had prompted a reversal in position – just hours before she said she had every intention of running in the next election. Her failure to be named in Johnson’s honours list presumably played a part too, with the suggestion that Sunak had blocked her ascension to the Lords in order to avoid a tricky byelection. Clearly that did not work for the prime minister.\nAnd then came the Johnson announcement. He claimed that the inquiry was akin to a “kangaroo court”, run by people who had an egregious bias against him, despite the fact that the majority of those on the committee were from his own party. He was quick to spin a narrative that a cabal of remainers wanted to take “revenge” for his role in Brexit and “ultimately reverse the 2016 referendum result”.\nDespite opting to quit before the public and press could see the specifics of the verdict, Johnson has implied that he has been “forced out”, fuelling a paranoid narrative that conspiracy is afoot.\nOver the weekend\nEven though the work week was over, the drama knew no end. As the temperature soared in London on Saturday, Sunak’s politically induced headache got a whole lot worse. The prime minister was heavily criticised for clearing Johnson’s resignation honours list, which included many of those involved in the Partygate scandal. Johnson’s former principal private secretary, Martin Reynolds, who oversaw a garden party during lockdown restrictions in 2020, was knighted with the Order of the Bath for his public service. A peerage was also given to his chief of staff, Dan Rosenfield, and a CBE to Jack Doyle, his former director of communications, both of whom were in office during some of the Partygate era of controversy – Aubrey Allegretti’s explainer on why No 10 and Johnson’s team were at loggerheads over this list is a great rundown of the situation. Then another of Johnson’s allies, Nigel Adams, quit parliament, triggering a byelection in Selby and Ainsty.\nJohnson’s antics continued to enrage his former colleagues who accused him of trying to derail the government. Senior officials have been demanding that Sunak ensure that Johnson is barred from standing as a Conservative candidate in the next election.\nFormer Cabinet minister Jacob Rees-Mogg – a Johnson ally who was knighted in his resignation honours – has warned that any attempt to block Johnson could plunge the party into “civil war”.\nWhat’s next\nRishi Sunak has tried to win over his party and the public by being the “stability” guy. He has spent most of his eight-month premiership attempting to move the party away from the theatrics that defined the previous government. But in one fell swoop, his efforts have crumbled and he is left with three byelections, a new internal war and a press nightmare.\nAs for Johnson, like many disgraced politicians he has a number of options in front of him, as Michael Savage lays out in this explainer. He could get some of that highly lucrative speaker circuit cash like Liz Truss; he could decide he is not done with the government and come back, either in another byelection or in the next general election. He may even go back to his journalistic roots with some well-placed columns.\nWhat is clear through his lack of remorse, regardless of his next steps, is that he is unlikely to fade into obscurity. At least for now.\nWhat else we’ve been reading\n-\nNick Robins-Early takes a look at the pro-Trump campaign that has been attacking Joe Biden’s mental health and how it has begun to accelerate its hostile tactics. Nimo\n-\nTurns out a limp handshake isn’t just a bad way to introduce yourself. Sam Pyrah looks at the link between grip strength and everything from poor cognition to heart health – and offers some tips to improve yours. Toby Moses, head of newsletters\n-\nWould you ever want to meet your doppelganger? Eva Wiseman examines our collective fascination with finding our lookalikes and what happens when you do. Nimo\n-\nAs the weather warms up in Britain, Joel Snape asks how much we should worry about sun exposure. A lot, it turns out – so lather on the sunscreen and read a book not a tablet if you want to protect your skin and your health. Toby\n-\nI really enjoyed Michael Hogan’s interview with the actor Rosamund Pike (pictured above). The pair discuss the fallacies of the wellness industry, her new 10-part BBC audio drama People Who Knew Me and her fascination with espionage. Nimo\nSport\nTennis | Novak Djokovic, above, secured a record 23rd grand slam title with a straight-sets victory over Casper Ruud at Roland Garros. He now has one more grand slam than Rafael Nadal. On Saturday, Iga Świątek battled to a three-set win over Karolina Muchova to win her third French Open title.\nFootball | Manchester City overcame Inter Milan 1-0 to win the club’s first Champions League title on Saturday – a “total victory for politics in football” according to Barney Ronay, as the Abu Dhabi owned-side have achieved total domination of club football with barely a complaint from the authorities.\nCycling | Denmark’s Jonas Vingegaard won the 75th Criterium du Dauphine on Sunday, underlining his credentials as one of the favourites to defend his Tour de France title a few weeks before it begins.\nThe front pages\n“Senior Tories tell Johnson to ‘shut up and go away’” says our Guardian front page this Monday morning. The Times has “Sturgeon questioned for 7 hours after arrest” while the Daily Telegraph says “Suspend Sturgeon from SNP after arrest, party told”. “Nic nicked” – that’s the Sun today while in the Daily Express it’s “Sturgeon arrested in SNP fraud probe”. The i turns it into a watershed moment: “End of an era in UK politics: Sturgeon arrested, Johnson out in cold”. “3 Brits missing in boat blaze” – the Daily Mirror reports on “holiday horror” off Egypt where a dive trip came to a disastrous end. Same story in the Metro: “Brits in hols boat inferno”. “Suella: Keir’s in pocket of the eco mob” goes the splash headline in the Daily Mail. “UBS draws lines for Credit Suisse staff amid fears of ‘cultural contamination’” – grab the Financial Times to read that one.\nToday in Focus\nWhat’s behind the rise in dog attacks?\nSeven people have been killed by dogs in the UK so far this year. Simon Usborne reports on the worrying increase in attacks\nCartoon of the day | Edith Pritchett\nSign up for Inside Saturday to see more of Edith Pritchett’s cartoons, the best Saturday magazine content and an exclusive look behind the scenes\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nThe Guardian’s latest A new start after 60 column profiles Veena Torchia, who left east London to open a business in India. Torchia, who is of Indian descent, made the move with her Italian husband Maurelio. The pair started a vegan food range in lockdown in the UK, and now have a whole vegan cafe in Pushkar.\nIt’s a far cry from Britain, where Torchia suffered racism and alienation as “the only brown girl” at school, and where she and her husband never felt at home. Despite having previously experienced homelessness and cancer, Torchia says life is on the up again. “There’s a can-do attitude [here]. No matter how little you have, everything is possible.”\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day – with plenty more on the Guardian’s Puzzles app for iOS and Android. Until tomorrow.",
  "word_count": 2378,
  "scraped_at": "2026-02-14T12:45:57.234672"
}