{
  "article_id": "64f043b31874",
  "url": "https://www.timesheraldonline.com/2026/01/12/thomas-gase-guide-will-third-time-be-the-charm-for-49ers-in-seattle/",
  "title": "Thomas Gase Guide : Will third time be the charm for 49ers in Seattle ? ",
  "date": "20260113T043000Z",
  "domain": "timesheraldonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The San Francisco 49ers are rewriting “It’s a Wonderful Life” — except this time, every time a 49ers player gets injured, the team gets a win.\nYep, the 49ers overcame odds once again. Even though star tight end George Kittle suffered a season-ending injury, San Francisco rolled to another victory on Sunday, defeating the defending Super Bowl champion Philadelphia Eagles 23-19.\nSo the 49ers — missing Kittle and possibly wide receiver Ricky Pearsall along with defensive stars Fred Warner, Nick Bosa, and now possibly Dee Winters — will give us that third game against Seattle this year on Saturday. The 49ers will once again have to win on the road and play much better than they did two weeks ago, but one thing is clear.\nDon’t count this team out.\nAlthough the time of the Saturday game hasn’t been released yet, they’ll likely play on Saturday afternoon. So get ready to watch that one, along with a bunch of other NFL, college football, hockey, and basketball games to go along with local games in soccer and basketball. Once again, the Thomas Gase Guide has you covered, starting with the NFL.\nNFL\nThe 49ers and Seahawks will share Saturday with the Denver Broncos and the visiting Buffalo Bills, who defeated the Jacksonville Jaguars last week.\nOn Sunday, the Chicago Bears will host the Los Angeles Rams after both teams came back to win their first-round games this past weekend against the Green Bay Packers and Carolina Panthers, respectively. Of all the weekend games, this should be the best one. The Bears look like a team of destiny after coming back from a 21-3 deficit against Green Bay. But the Rams are the more experienced team, with Matthew Stafford having won a Super Bowl in 2022.\nThe final game on Sunday will be the New England Patriots hosting the winner of the Pittsburgh Steelers and Houston Texans, who played Monday night before the Times-Herald and Vacaville Reporter went to press.\nCollege Football\nSo it’s kind of weird — Indiana will be playing Miami for the national title a week from Monday on Jan. 19. And it’s Miami that’s the big underdog. After doubting Indiana for a majority of the season, wondering if the Hoosiers were going to beat anyone really good, I can say that I was wrong.\nThe Hoosiers are for real, and they’re going to win this game against the Hurricanes in a lopsided blowout. After Indiana defeated Oregon twice, defeated Ohio State in the Big 10 championship, and killed Alabama in the quarterfinals of the college football playoffs, I’m sold. So are the Las Vegas Raiders, who must be salivating at the thought of drafting Heisman Trophy-winning quarterback Fernando Mendoza.\nLocal Sports\nThere are plenty of local games this week, although I’m wondering if soccer fans should not be allowed to come to Corbus Field for a while. At least one fan’s behavior on Friday night in the Bethel-Vallejo matchup was uncalled for and showed not only sports at its worst, but human beings at their worst, for all to display.\nI get yelling at a referee if you disagree with a call, but there are some things you just can’t say, and the words uttered to the three officials during the Friday contest I’m not allowed to even mention in this paper.\nIf you can control your emotions and not act like a 5-year-old who doesn’t get his toy, then yes, there are some good soccer matchups to watch.\nOn Tuesday, St. Patrick-St. Vincent School travels to American Canyon for a nonleague boys contest, while Benicia is at College Park the same night. Vallejo High hosts Salesian at Corbus Field (behave everyone) in girls play, and St. Pat’s is at home against John Swett.\nOn Wednesday, Vallejo High hosts John Swett in boys play, while Bethel’s boys team is at Hercules. Thursday’s big matchups include Bethel High’s boys hosting John Swett and Benicia’s boys at Ygnacio Valley. On the girls side, Vallejo High travels to John Swett, Bethel plays at Albany, American Canyon hosts Vintage, and Benicia plays at home against Las Lomas.\nOn Friday, American Canyon hosts Vintage in boys play, while St. Pat’s hosts Hercules in a girls game.\nHoops fans are in for a treat as well, with big matchups all over the place, starting on Tuesday with Bethel High traveling to Salesian. In other boys games, Vallejo plays at Kennedy, St. Pat’s is at Albany and Benicia visits Mt. Diablo. On the girls side, the same night, tune into Vallejo hosting Hercules, St. Pat’s hosting Pinole Valley, or Benicia playing at home against Mt. Diablo.\nOn Wednesday, the St. Pat’s boys play at John Swett, while the Vallejo boys travel to Encino. The Bethel High girls team plays that same night against Arroyo.\nThursday night features American Canyon’s boys hosting Vintage, while the Bethel boys’ team plays Albany at home. In girls play, Vallejo is at El Cerrito, Bethel is at Miramonte, and American Canyon hosts Vintage.\nFriday night is a big matchup with St. Pat’s hosting St. Mary’s, while Vallejo is in town to host Albany. ELITE High’s boys and girls teams travel to Westlake Charter the same night, but the best matchup in town on Friday has to be St. Pat’s and Bethel girls playing at St. Pat’s.\nIf it’s college sports you enjoy, Cal Maritime’s men’s and women’s teams play Pacific Union at home in a doubleheader on Saturday. The Solano men’s and women’s basketball teams both play at Marin on Wednesday and return home to both play Los Medanos on Friday.\nNBA\nThe Warriors had big wins last week against the Milwaukee Bucks and Sacramento Kings, but then lost over the weekend to the Atlanta Hawks to complete a 2-2 week (they also lost to the Clippers).\nAnd that’s what this team basically is in a nutshell — a .500 club.\nThe 21-19 Warriors will play three home games this week, starting with a Tuesday night matchup with Portland, a squad the Warriors have struggled against this year. On Thursday is a stellar matchup against the New York Knicks, one of the best teams in the Eastern Conference. Finally, Golden State hosts Charlotte on Saturday at 5:30 p.m. I’m guessing there are going to be a lot of seats available for that game since some other Bay Area team may be playing on the road around the same time.\nOther NBA games to watch during the week include a Monday night matchup between the Kings and Lakers that is always fun to watch — no matter what the records are. A rivalry is a rivalry.\nThe new big rivalry to watch may be San Antonio and Oklahoma City, which face each other Tuesday night. On Wednesday, I would tune in to watch Cleveland at Philadelphia and Denver at Dallas, while Thursday’s big games are Oklahoma City at Houston, Milwaukee at San Antonio, and Phoenix at Detroit.\nThe Los Angeles Clippers at the Toronto Raptors is a decent game on Friday, while Saturday promises a stellar matchup with Phoenix at New York and Boston at Atlanta. That last one isn’t what it used to be with Larry Bird going up against Dominique Wilkins, but it’s still fun. Portland at Sacramento and Toronto at the Los Angeles Lakers should be fun Sunday night games to watch after the football games are done.\nNHL\nIt’s hard to believe the San Jose Sharks are like the Warriors this year with a record above .500, but I’ll admit the Sharks are more exciting to watch. For one, most of the Sharks’ players never get thrown out of a game. So that’s cool!\nThe most exciting Shark to watch is by far Macklin Celebrini. The guy can’t drink legally for another year and a half, but he’s already in the top three players in the game. His nice goal and assist against the L.A. Kings on the road last Wednesday sparked the team to an overtime win. He recently had a 13-game streak with at least one point (9 goals, 18 assists, 27 points) before it ended Sunday against Las Vegas.\nThis week, the Sharks are on the road. In fact, they only have one home game (Friday, Jan. 23) until Feb. 26, with the Olympics taking over the ice. This week, the Sharks are at Washington on Thursday, and I’d make it a point to watch this game. Celebrini against Alexander Ovechkin? Yes, please!\nThe Sharks also play Detroit this week on Friday night.\nOther exciting matchups to watch this week include Tampa Bay at Pittsburgh, Detroit at Boston, Toronto at Colorado, and Dallas at Anaheim on Tuesday night. Interesting Wednesday games include the Las Vegas Golden Knights at the Los Angeles Kings and Philadelphia at Buffalo. Thursday I would tune into the Sharks’ game against Washington, as well as the New York Islanders at Edmonton Oilers and Philadelphia at Pittsburgh.\nFriday and Saturday night are all about Anaheim squaring up against its rival, the Los Angeles Kings. These two teams hate each other, so if you like fights, watch the Saturday game. Boston at Chicago is an Original Six matchup on Saturday night, while Florida at Washington and Montreal and Ottawa are big matchups the same night. On Sunday, I’d tune into Tampa Bay at Dallas and Ottawa at Detroit.\nRead\n“The Match” by Mark Frost (to read on the 70th anniversary week of one of the best days in golf history)\n“Monsters of the Midway” by Jim Dent (to prepare to watch the Bears play the Rams)\nWatch\n“Elway” on Netflix (to prepare to watch the Broncos’ postseason game)",
  "word_count": 1606,
  "scraped_at": "2026-02-14T14:22:26.167233"
}