{
  "article_id": "6509233ce6f2",
  "url": "https://www.greatlakesadvocate.com.au/story/8985023/carol-duncan-honoured-with-oam-for-contributions-to-newcastle/",
  "title": "Carol Duncan honoured with OAM for contributions to Newcastle | Great Lakes Advocate",
  "date": "20250609T014500Z",
  "domain": "greatlakesadvocate.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "DOCTORS, broadcasters, historians, and more Hunter personalities have been recognised with King's Birthday honours this year. Newcastle Herald journalists spoke to them about their awards, their contribution and their advice.\nCAROL DUNCAN\nCarol Duncan jokes that she's probably one of the \"handiest connectors\" in Newcastle.\nSubscribe now for unlimited access.\nor signup to continue reading\nWhen you spend more than three decades working in the media, serving as a Labor councillor or sitting on numerous art and culture committees, you gain an insight into what makes a city tick.\nAnd by whom the decisions are made.\n\"After my unicorn career, you sort of know everybody and it means if there's something you want to know or want help with or you need a connection, the chances are, I probably know who you need to talk to,\" Ms Duncan said.\n\"I really love that. That is what helps build community and actually have it form an embrace around the nearly 200,000 of us.\"\nMs Duncan's service to the Newcastle community will be recognised on Monday when she receives a medal of the Order of Australia in the general division.\n\"It's amazing,\" she said. \"I am speechless for someone who is never short of words.\"\nDespite being such a proud advocate for Newcastle, Ms Duncan grew up in Sydney and broke into the music industry working for record label Sony, where her job involved pushing releases from the likes of Bruce Springsteen, the Rolling Stones, Billy Joel, Midnight Oil, and Michael Jackson to radio stations and TV networks.\nThat led to her first radio gig in Hobart, before she was lured back to NSW with a job at the newly launched NXFM in Newcastle, which had previously been AM station 2NX.\nMs Duncan spent seven years in commercial radio at NXFM and NEWFM before finding her true calling at 1233 ABC from 2001 to 2014, where she fell in love with the \"intimacy of communication with people.\"\nIn 2007, Ms Duncan was part of 1233 ABC's Walkley Award-winning coverage of the Pasha Bulker storm and its aftermath.\n\"When people are brave enough to share stories with you, whether it's radio [or another medium], media is still such a powerful way of sharing stories that can help other people feel like they have a place, that they're not alone, that they're not the only ones going through an awful thing,\" she said.\n\"Being able to find your tribe, no matter what that is, is so important because it keeps people afloat.\"\nAway from the microphone, the Hamilton resident continued to serve the community.\nIn 2012 she founded the Lost Newcastle history page on Facebook, which she initially thought would only be used by fellow \"history nerds.\"\nJust last week, Lost Newcastle attracted its 80,000th follower.\nShe's also continually advocated her passions for music and the arts in Newcastle. Ms Duncan is the chair of the Public Art Reference Group and Community and Culture Advisory committees and is about to join the Newcastle Fringe Festival board.\nShe was also a founding member of the Newcastle Live Music Taskforce to help preserve the city's late-night economy.\nNot surprisingly, Ms Duncan's passion for community led to her successfully running for Labor as a Ward two councillor in 2017.\nShe served two terms before losing a Labor preselection last year to Paige Johnson.\n\"Local government is probably the most rewarding, worst-paid job ever,\" she said. \"It was something I took really seriously.\n\"When people are affected by an issue, whether it's a piece of footpath outside their house or a big decision and you're part of a team making that decision for the next decade for the city, it's a big responsibility.\n\"In any of those things, you know you're never going to please everyone, but you just try to do the best that you can.\"\nSince 2023, Ms Duncan has continued to channel her passion for communication into her role as the public engagement lead for the Hunter Medical Research Institute.\nMIKE SCANLON\nWHEN it comes to the Hunter's history, Mike Scanlon's pen has written many of its pages.\nThe former Newcastle Sun and Newcastle Herald journalist, weekly history columnist and published author is more than just a writer.\nHe's a historian, a custodian and has made it his life's work to salvage stories from the region's past.\n\"It was almost by accident,\" Mr Scanlon said.\n\"I realised there were all these stories, it started off with a column and it's been going since about 2000, so almost 25 years finding all these odd, unusual and quirky stories around the place.\n\"Weird things happen in Newcastle that probably don't happen in a lot of other places.\"\nMr Scanlon's contributions to the media and community history have been recognised with a Medal of the Order of Australia (OAM) in the King's Birthday Honours.\nHis journalism career started as something of a holiday job. It was the mid-1960s, and Mr Scanlon had toyed with the idea of becoming a diplomat or an architect until a cadetship at the Sun came along.\n\"It really wasn't meant to be a 60-year job, it sort of just grew with me,\" he said.\nDespite being housed in the same building and under the same ownership, the Herald and the Sun competed fiercely for the afternoon trade when the blokes from BHP got off shift.\nThere were three or four editions a day, the Herald had made a name for itself as a more \"serious\" broadsheet. \"We were a bit more flash,\" Mr Scanlon said.\n\"I remember that there was, I think, a floating rig that blew up in the harbour, and they said, 'Go out and interview everybody and leave nothing for the Herald, even interview the victims' dogs',\" he said.\n\"The next day, from memory, we did such a good job we dedicated the whole edition to it, I think the Herald just ran a small piece on page one because we'd covered it.\"\nWhen the Sun collapsed in the 1980s, Mr Scanlon was one of about 16 employees drafted to the Herald.\nMr Scanlon covered courts, general news, local councils, wrote the Topics column, became assistant to the deputy editor, had a stint as night chief-of-staff and at one point was editor of the Newcastle Post.\nIn 2006, he was honoured with a lifetime achievement award in recognition of his four decades in the game.\n\"I liked the pace of it, the excitement, it was very frenetic really,\" Mr Scanlon said.\n\"I got into history by accident, actually, I wanted to do a story about the wholesale abduction of sailors in the sailing ship days.\n\"It was an extraordinary story. Nobody wanted to work on the sailing ships, which were hard work, when they could work on the steamers going up and down the coast for more money and better conditions, so they were just abducted from the streets. I've been following it for years.\"\nThat's just one of many tales Mr Scanlon can tell; the rest are in his books The Hidden Hunter and Past Port.\nFor him, preserving the Hunter's history before it disappears is more than a pastime; it's a duty.\n\"They're great stories,\" Mr Scanlon said.\n\"I feel really humbled and honoured, and it's a great privilege to help people and to roll out these stories about their past lives, war stories.\n\"Everyone's got a great story if you listen long enough and hard enough, and that's what I'm trying to bring to the fore.\"\nMr Scanlon said he felt privileged to be nominated for an OAM.\n\"I'm just at a loss for words. I'd like to thank whoever nominated me; it's one of those things you don't expect, and it's very nice,\" he said.\nAbout 20 years on from retirement, he shows no signs of slowing down.\n\"I think I'm just driven, I like to discover something new and interesting, go to unknown territory and write it up,\" he said.\n\"They call me a self-starter. I just went out and found stories, in many cases, where people didn't think there was one.\n\"Hopefully, my readers will come along and enjoy it as well.\"\nDR JOHN DRINAN\nJohn Drinan described his Order of Australia (AM) award as unexpected from his Mid North Coast home at Bonny Hills.\n\"You do what you do in life, and you don't need acknowledgment for that work because so many others have done far more,\" he said.\nBut his list of achievements written in his citation for this year's King's Birthday Honours says otherwise, showing his tireless work for his community, agricultural industries and the environment for decades.\nA former long-term resident of Singleton, Dr Drinan and his wife, Anne, moved to Bonny Hills in 2017 to retire, well, at least retire from farming.\nThe couple had some close friends who were already living in the district and they thought it would be a lovely place to live. Since that time he has immersed himself in the life of the community.\nRotary, Landcare, and Bonny Hills Progress Association, he has been heavily involved in these groups.\n\"Anne and I love the community here, so it is easy to become involved in these groups, especially the Progress Association, whose members are committed and highly capable,\" he said.\nHis next project, now that he has stepped away from executive roles in the various community groups, is writing a book about the flora of the region, which he describes as magnificent in spring and summer.\nHe would also like to emulate the long life of his much-admired mother, Flo Drinan, who died aged 102.\n\"At 82, I would love to live as long as my mother, who was a much-loved member of the Singleton community,\" he said.\nThe Drinan family has strong connections to the Singleton district, and John and Anne lived on their property \"Wahgunyah\" at Glendon Brook for 30 years.\nDr Drinan grew up in Singleton, and he would spend time during his childhood visiting and working on \"Wahgunyah\", the property his father Bernie and his sister Margaret Boyce jointly shared as a \"lifetime stewardship. It was time spent helping his aunt Mrs Boyce that shaped his future career.\nHe went onto enjoy a successful career as an agricultural researcher and educator including being the principal of Tocal College, Paterson from 1981-87.\nPrior to taking on the role of principal at Tocal College, he was the head of the Department of Animal Production, Hawkesbury Agricultural College of Advanced Education, 1975-1981.\nHe held various senior positions in agricultural research and advisory bodies, including chairing the Rural Research and Development Corporations, 1996-1997 and a member of the Dairy Industry Adjustment Authority (2000-2006) and Chief Executive, (2006-2008). He was a member of the Australian Animal Health Laboratory Advisory Committee, 2000-2005.\nHe worked as an academic at Newcastle University and is particularly proud of his involvement in establishing allied health degrees such as physiotherapy and occupational therapy at UON.\nAs he has done at Bonny Hills Dr Drinan's life in Singleton was one that involved a strong commitment to Rotary, Landcare, and the church (St Patrick's Catholic Church, Singleton Parish). While as a Rotarian in Singleton, he was awarded the Paul Harris Fellowship, Rotary Club of Singleton on Hunter, Rotary International, 2004 and the Paul Harris Fellowship, Rotary District 9670, Rotary International, 2008.\nHe was also very active in establishing environmental groups while he lived in Singleton. He was a Foundation Member, Singleton Shire Healthy Environment Group, 2009-2016 and a community representative, Environmental Strategy and Action Plan, Singleton Council, 2015-2017. He was a member of the Upper Hunter Mining Dialogue, 2011-2017.\nSince his move to Bonny Hills, he worked for several years writing a book on the impacts of mining on the Hunter Valley.\nHe launched his book The Sacrificial Valley Coal's legacy to the Hunter at the late Wendy Bowman's home, 'Rosedale', Camberwell near Singleton in November 2022.\nAt the launch, Rosedale's beautiful garden on the banks of Glennies Creek was filled with community members, people whose homes and properties had long ago been acquired by the mines, representatives from environmental groups, Dr Drinan's family and friends and former colleagues.\nAt that time, he said, \"I drove up the Valley to Scone yesterday and felt physically sick at the destruction that has been wrought to this once beautiful place.\"\n\"For that, I don't blame the mining companies or their workers. I am not anti-coal mining, as I know what coal has done economically, but now it must stop.\n\"The world has changed, and so must the valley.\"\nHis opinion of the Valley and the need for change remains steadfast, and he will continue to engage where he can in ensuring the environment, no matter where he lives, is protected and cherished.\nSHALEIGH LENNOX\nTHERE are worse places to work.\nShaleigh Lennox started out as a Nipper and has been a dedicated member of the Cooks Hill Surf Lifesaving Club since 1992.\nShe's patrolled beaches, put in more than 1188 hours in support operations and as a duty officer since 2009, worked on the frontline in floods and shown others the ropes to keep the coastline safe.\nNow, she's been awarded an Emergency Services Medal for her efforts, recognising more than 30 years of service to the Hunter community.\n\"I joined as a Nipper,\" Ms Lennox said.\n\"My family lived quite close to the coast, so I think my parents signed me up because having an understanding of the surf and being safe in the surf and living so close is important.\"\nHer love of the beach saw her become director of lifesaving for the Hunter branch in 2007, where she established the duty officer role and brought in new policies that helped shape rescue and patrol operations.\nMs Lennox has held several frontline roles including patrol captain, zone supervisor and duty officer.\n\"Surf lifesaving is extending further out from the flags,\" she said.\n\"The role that I do looks at those areas outside of the flags, and if there are people swimming in dangerous areas, we organise jet skis or whatever we can to cover those areas.\n\"There hasn't been any loss of life between the flags, and I think that says a lot about keeping that area of the coast safe.\"\nOutside the flags, Ms Lennox played a critical role in evacuations during the Hunter's hazardous 2007 June floods and through every major flood incident within the region since.\n\"Before we did this routinely, responding to floods, we didn't really have the gear, it was dark, we'd have to get the equipment to the area because all the roads were flooded and everything,\" she said.\n\"There was a lot of unknown, but there was just a sense of everybody being in it together, pitching in and helping out.\"\nIt's the camaraderie that has kept Ms Lennox going, along with seeing young Nippers come through the ranks like she did and the knowledge that her work helps keep the community safe.\n\"I would trust all of those guys with my family, so I think that's a great indication of the knowledge and the skills that they've got,\" she said.\n\"People can get into trouble so quickly in the surf, and being there to help them out or give them some education, even on the beach, helping out and being such a huge part of the community, I really enjoy that.\"\nMs Lennox said receiving an Emergency Services Medal was \"totally unexpected\".\n\"I'm really honoured to get it,\" she said.\n\"There are so many deserving people out there, so to be recognised, I'm humbled as well.\"\nStephen Raymond\nStephen Raymond first joined emergency services 35 years ago out of necessity but chose to stay out of love.\nThe Marine Rescue NSW (MRNSW) Hunter and Central Coast zone duty operations manager was awarded an emergency services medal as part of the King's Birthday honours on Monday, June 9.\n\"It's very humbling and much appreciated to get recognised for this award,\" he said.\nLiving in the middle of a heavily forested area in Braidwood in the NSW Southern Tablelands, Mr Raymond joined the Rural Fire Service (RFS) to protect his community.\n\"I got started in 1989, and it was self-preservation, really,\" he said.\n\"I moved up through the RFS and became a captain of a brigade, then went into a paid position in 1998.\"\nAfter 27 years with the RFS, he decided to move to the newly created Marine Rescue NSW nine years ago.\n\"There were three organisations brought together under one banner, there was a lot of culture to be built, new policies and standard operating procedures,\" he said.\nIn his role at Marine Rescue he coordinates emergency calls from Triple Zero, tasks rescue units out on the waters and overseas equipment and training of staff and volunteers.\nFrom Gosford up to Port Stephens, Mr Raymond oversees seven units of volunteers and staff.\n\"We save lives on the water, and people are having the worst day of their lives, and we go in there, and bring them home safely,\" he said.\n\"There is nothing more rewarding than being able to do that.\"\nMost days out on Hunter waters were not smooth sailing, however.\n\"We are sending people out on rough seas and dangerous situations but you've also got to be able to make sure they're safe and get back safe as well,\" he said.\n\"We have to manage different weather conditions and incidents evolving in dangerous conditions,\"\nNearly every day on the coast involves a rescue, with his team bringing 2800 back to safety last year.\n\"We had one in Lake Macquarie where we had nine people in a scuba diving boat, the boat was sinking,\" he said.\n\"We got the call early, and we sent two boats and our jet skis out - it could have ended a lot differently.\"\nFrom his days with the RFS, he still remembers the intense bushfire that ripped through Catherine Hill Bay in 2013 and flames that came into Dudley and the back of Newcastle.\n\"What I remember most during those big fires were people being very generous with donations,\" he said.\n\"One lady in her late 80s walked a couple of miles to our fire control centre to bring us water and cut up oranges.\"\nThe best part of his job was the people, he said.\n\"I'm working with volunteers, with passionate people that want to be here and doing this for no financial reward,\" he said.\n\"I owe it all to the great people that I've worked with over the last 35 years who have made it possible for me to work in the industry.\"\nSISTER CARMEL MOORE\nIt was 1997 when Sister Carmel Moore reached a critical juncture in her life as a Sister of St Joseph.\nShe had already spent more than three decades as a school teacher, high school principal and hospital chaplain, to name a few roles, but there was something else she felt called to do.\nThat was founding the Living Waters Meditation Centre at The Junction, a place where participants take time out to connect with their true selves.\n\"I think that's my life's main work,\" Sister Carmel, who has received a Medal of the Order of Australia (OAM) for service to the Catholic Church in Australia, said.\n\"I had a need within myself to find silence and inner peace.\n\"It was something I craved, even from when I was young. Entering the convent did a lot for that, but I also wanted to share it. I experienced a call to do it. \"\nAbout 800 people have participated in the centre's weekly meditations over the past 29 years.\nAnd the waters are still flowing, with between 40 to 50 participants presently attending the centre's bi-monthly retreat mornings.\nThere are also offshoot groups that meet weekly across the Maitland-Newcastle diocese that share the centre's Benedictine Charism.\nSr Carmel said she was initially surprised at the centre's success, but, upon reflection, it's easy to understand - the unrelenting distractions and pressures of modern life were driving a corresponding need for spiritual solace and meaning.\n\"There are many people who come along because the world's just too fast for them; their lifestyle is too heavy for them. They are seeking life's deepest meaning and their truest self,\" she said.\nNow 90, Sr Carmel handed over the centre's administrative reins about 12 years ago, but is still actively involved in its activities.\n\"I fill in for people if they can't come, but I don't want it to be all about me, because if I can't come someday, I don't want it to end,\" she said.\nThe centre's philosophy is closely related to another of Sr Carmel's roles as a member of the Sisters of St Joseph's inter-congregational eco-spirituality committee.\n\"We aim to spread the sense of God in creation, which involves caring for the earth, our common home,\" she said.\n\"When I'm swimming at Merewether baths, I see a lot of people just gazing at the sunrise or the beauty of the clouds and the ocean. That is all helping to bring them into the contemplation of the beauty around them.\"\nSr Carmel admits she initially wasn't too keen on accepting a King's Birthday award, but she accepts that it also recognises the Sisters of St Joseph and all of those who have supported her.\n\"I'm embarrassed by all of this, really,\" she said.\n\"There are a lot of people who have done a lot more than I've done, and there are so many people who silently go about doing great things without any recognition.\"\nShe noted religious life was very different from when she entered the Sisters of Joseph at Lochinvar 72 years ago.\n\"We have gone from being a very disciplined and minutely organised group to being free to be the people that we were meant to be,\" she said.\n\"There is a beautiful sense of community among our sisters. It's not a rigid community, it's a friendly and supportive community that allows us to use our own gifts.\"\nDOUG SAXON\nOutside of his family and friends, Fishing Point's Doug Saxon had three major passions in life: education, local history and music.\nWhether it was ensuring he knew the name of every child in the various primary schools where he served as principal, or writing the 22 local history books he had published, or coordinating the various Newcastle and Hunter Jazz Club festival lineups, Mr Saxon launched into everything with passion.\nOn Monday, Mr Saxon's service to education, local history and music is being recognised in the King's Birthday honours list with a Medal of the Order of Australia in the general division.\nSadly, Mr Saxon died in July last year after a bout of influenza A. He was 78.\n\"He would have been so pleased,\" Mr Saxon's wife, Judith, said of the OAM. \"He spent a lot of time doing it, but he really enjoyed it.\n\"He had a passion for local history and keeping the music going, and the things he was really sure about in education. He loved being a principal.\"\nMr Saxon grew up in Hamilton and attended the local public school. He would later publish the book Hamilton: Memories of Life and School in the 1950s in 2010.\nWhile at Newcastle Boys High, he met Judith, who was a Newcastle Girls High student, at a school dance.\nAfter initially working as an accountant, Mr Saxon moved into teaching and took up his first post at western Sydney's Villawood East Public in 1968. Within 10 years, he became a principal at Yanco in the Riverina.\nMr Saxon returned to the Hunter in 1983 as Bonnells Bay Public School principal (1983-87) and led Cessnock East PS (1987-1992) and Jewells PS (1992-2006) before retiring in 2006.\nIt was while he was living in Yanco in 1980 that Mr Saxon's love of local history was first ignited. He used to take students to the nearby village of Morundah on excursions to visit its historic school building.\n\"They did a dig, talked to the local people and made a great big study of it, and a publication was put together,\" Judith said.\n\"That was the first of all the local histories he did over the years.\"\nMr Saxon continued to write local history books, focusing predominantly on the Hunter region, telling the stories of the schools he taught at and the development of Lake Macquarie suburbs Awaba and Morisset.\nHe also published a book in 2017, Michael Scott: An Artistic Life, on the founder of the Blake Prize for religious art.\nHis last books, Eraring's History - Farming, Monkeys and Electricity and Dora Creek Memories 1870-2020 were published in 2020.\n\"After each publication he did, I'd say, 'That's the last one, isn't it?'\" Judith said.\n\"But he always did another one. He just loved it.\"\nWhile Mr Saxon didn't play an instrument himself, he always held a rich love of music. While a principal, he promoted musicals strongly and encouraged his three children and four grandchildren to follow their passion for music.\nHe was a member of the Newcastle and Hunter Jazz Club and was the organisation's festival band coordinator for 14 years, right up until his death a month out from last year's event.\nOn July 27, the Newcastle and Hunter Jazz Club is hosting the Doug Saxon Memorial Concert at Wangi Wangi District Workers Club in his honour.\nCATHERINE JOHNSON\nWhen Catherine Johnson started work in cancer care in 1990, it was a different world.\n\"It was very difficult, treatment was very limited, and it wasn't always successful,\" Ms Johnson said.\n\"We've seen huge transformations in the care patients receive now. That's been driven through clinical trials and research.\"\nA clinical nurse consultant in medical oncology at the Calvary Mater Newcastle, Ms Johnson has been appointed a Member of the Order of Australia.\n\"I've worked in clinical trials for 20-odd years at the Mater,\" she said.\nHer work is a mission of the heart.\n\"I've been working in healthcare for a very long time. It's important to me,\" she said.\n\"It's been a very rewarding career.\"\nShe aimed to follow the example of her parents by \"serving the community\".\n\"It's a joy to give back,\" she said.\nShe's held senior roles on numerous committees in the cancer nursing field.\nAmong her achievements, she helped develop the Cancer Nurses Society of Australia in 1998-99 and later served as its treasurer and deputy chairperson.\nAs an editorial board member with the Australian Journal of Cancer Nursing from 2011-20, she helped share knowledge in the field.\nMs Johnson is secretary/treasurer of the International Society of Nurses in Cancer Care.\n\"I've worked internationally and done projects in Latin America and Sub-Saharan Africa in breast cancer screening.\n\"In Latin America, I have led projects across five countries, training nurses in cervical cancer screening and prevention and breast cancer screening.\n\"I trained nurses who worked with women to prevent and detect early cancers in low and middle-income countries. \"\nShe said this work was \"really rewarding\".\nHer work on clinical trials for Mater patients in Newcastle was a labour of love.\nWhen patients respond to treatments, it's a \"lovely feeling\".\n\"It's great for them,\" she said.\nWhile working in cancer care could be emotional, she said \"we are working to improve the outcomes\".\n\"There are moments where it's very sad, difficult and challenging, but there are also rewarding moments.\n\"I work with great teams and wonderful nurses all around the world.\"\nThe international nurses she worked with \"do so much with so little\".\n\"That is humbling and makes me appreciate everything we have here,\" she said.\nIt gave her perspective.\n\"It makes what we do on a day-to-day basis easy, even though we sometimes think we're resource-constrained and working in difficult circumstances.\n\"We live such a privileged and fortunate life in Australia.\"\nShe added that cancer often gives people \"the chance to have a new perspective on life, even though it's difficult\".\nAsked about the prospects of a future cancer cure, she said \"we see people living with cancer for a long time and living well\".\n\"It's now a chronic disease to a large degree, rather than something that is a life sentence.\"\nShe was humbled to receive the King's Birthday honour, knowing that \"somebody would nominate me and recognise the work I do\".\nMARK HOLTON\nIt was perhaps a relic of his rugby league days that Mark Holton has never had much fear of having a crack at something. A career of running onto the field with the intent of out-gunning the other guy will do that to you.\nIn that sense, he says he has lived by a fairly simple philosophy of having a go at everything. If you bite off more than you can chew, you just have to chew harder.\nMr Holton would probably not admit it - rather, he would tell you that he was merely in the right place at the right time - but there is the distinct sense that it is that same philosophy that led him off the field and into the boardrooms of a litany of charities and sporting organisations that have defined his past three decades of community service.\nMr Holton's list of accomplishments is long, but a few names are on there that are close to his heart.\nHe got involved with the children's health charity Ronald McDonald House, for example, not long after retiring from his sporting career as a rugby league player and referee (he calls it his time \"running around\"). He was called in to help set up the charity's accounting system and, not long after, was asked if he would consider becoming a volunteer treasurer.\nThat was 30 years ago, and still, he has no plans to call full-time.\n\"I just see myself as someone who puts their hand up to help when they are asked,\" Mr Holton said. \"I went down to Ronald McDonald House to help them with a bit of software, thinking 'here's another client', but when I saw what it was doing, I thought I couldn't charge this organisation. And I want to help it.\"\nMr Holton is one of several Hunter identities to be conferred with Order of Australia honours over the June long weekend.\nMr Holton will be inducted for his services to the community for his involvement in community and regional sports, business, and charity.\nThe most recent of his achievements was establishing, among other sporting leaders, the Regional Academies of Sport, effectively merging the Hunter and Central Coast academies to help young athletes outside the city get access to high-quality training and development opportunities. Mr Holton has been the chair of the organisation since 2022.\n\"There are so many great kids here, and their parents have to go to extraordinary lengths to get them to sporting practice sessions, training and development, which often aren't on the coast,\" he said.\n\"Putting something together that would allow them to get that development without having to leave home really just appealed.\"\nLES PETERKIN\nThe old fable goes that when asked how they had created a stunning and intricate sculpture of an elephant from a lump of formless stone, the sculptor said they had not. They just chipped away all the pieces of stone that were not part of the elephant.\nThere is the sense that, in some ways, Stockton potter Les Peterkin has approached his life as a teacher and an artist in the same way; not by grand sweeping strokes, but by gradual and lovingly diligent degrees.\nTake ceramics, for example. Mr Peterkin did not have any particular vision of becoming a potter, but he took an evening class when he was a teacher in Sydney to satisfy an interest and soon found it spoke to him. Not long after, he started teaching the class.\nWhen he met his partner, they started a business. He began selling his art while he was working as a teacher. Thirty years later, he retired to Stockton, where, on the King's Birthday long weekend, he was in line for induction to the Order of Australia for his services to the arts.\nFrom the formless medium, the picture takes shape.\nMr Peterkin's work evokes the sea. His art is full of vibrant sea life, water blues and natural curves. It's folky and colourful, and in each work, there is the sense that it has been laboured over.\nStill, the artist believes that there is nothing innate in the arts. No one is born with it, but it belongs to everyone. The elephant is there; it's just a matter of chipping away at it.\n\"It's all learnable,\" Mr Peterkin, who has amassed a considerable following online where he posts videos of his work and process, said. \"It's just that if you want to do something, you go ahead and get on with it.\"\n\"They say that if you're once a teacher, you're always a teacher, and I suppose that is one of the reasons why I learned how to make videos.\"\n\"I have done a lot in my life, and I've worked hard, but I never expected to get any accolades. If they turn up, it's all the better.\"\nMr Peterkin said he was humbled by the King's Birthday honour and was looking forward to celebrating with friends on Monday.\nLEHETTA LANE-PORTER\nCOMING from a family of educators, Lehetta Lane-Porter has always been passionate about providing opportunities to Indigenous youth.\n\"Within my family dynamics, from my mother to my three sisters, we are all educators,\" she said.\nThe 40-year-old Gamilaraay Yuwaalaraay woman has been recognised for her work and awarded a Public Service Medal in the King's Birthday honours.\nMs Lane-Porter has been instrumental in supporting First Nations students to succeed in school, complete year 12 and move on to employment and training.\nShe has worked as head of boarding at Aboriginal Hostels Limited's (AHL) Kirinari Newcastle hostel for the past eight years.\n\"I was actually a student within Aboriginal Hostels Limited, where I left my home and lived in Dubbo for many years in a boarding setting, so I often reflect on my own time there,\" she said.\n\"The passion I walked in the door eight years ago, I still strongly have that today.\"\nShe helps connect students to cultural, sporting and social events to build their confidence, self-identity and community connections.\nIn her role, she also encourages students' annual participation in the Boots for Bright Futures campaign, working with Australian National Rugby League clubs to paint footy boots for auction to raise money for the fight against youth suicide.\n\"I've got kids from far northwest NSW, western NSW, and the northwest of NSW. Being even exposed to NRL players, within itself, is an excitement. It's not something they get to see every day in their home community,\" she said.\n\"Being able to share the journey with them while they play the Indigenous round is something special.\"\nMs Lane-Porter said she was honoured and humbled to receive a Public Service Medal.\n\"It's actually quite a surprise. I'm still inquisitive. I don't know who made the nomination, but I'd love to know who it is,\" she said.\n\"I feel very honoured to be receiving it and have those three little slash initials after my name.\"\nHer mother, known as Aunty Beth, received one last year.\n\"Both her and I now get to share that glory together,\" she said.\nMs Lane-Porter said she enjoyed guiding the next generation of indigenous leaders and would continue to do so.\n\"They come to my boarding setting to be provided with better opportunities educationally, but also culturally,\" she said.\n\"I will continue to do what I do and hopefully change many more lives of the Indigenous youth that come across my path.\"\nGORDON GORTON\nFrom his career as a police officer to his commitment to volunteering, Gordon Gorton has dedicated his life to serving the community.\nNow, his service has been recognised with a Medal of the Order of Australia (OAM) in the 2025 King's Birthday Honours for service to the community through a range of service organisations.\nThe Rutherford resident was a police officer for 35 years who was stationed across the Hunter and at Lithgow, and retired ranked chief inspector at Maitland Police Station.\nMr Gorton said the honour is a very appreciated shock.\n\"To me it means that some of the work I've done with the community over the years has been recognised,\" he said.\n\"You just poke along and do what you're doing and you don't look for accolades, but when you do get an accolade like this you say 'wow, I might have done a bit'.\"\nWhether stationed in Maitland, Cessnock, Lithgow, Scone or Maclean, Mr Gorton has always become involved with local clubs like Apex, and organised many community projects like skate parks and blue light discos, and coached sporting teams.\n\"You got respect that was the main thing, two-way respect. The community respected you and vice versa,\" he said.\n\"People knew who you were, you weren't just the copper down the road, they knew who you were and your values.\"\nIn 2002 he was awarded the NSW Police Diligent and Ethical Service Medal.\nAfter retiring, Mr Gorton still felt a strong calling to help the community and volunteered in a number of roles including as an official hospital visitor to mental health patients with NSW Health.\nHe also served as a juvenile justice conference convenor with the NSW Department of Communities and Juvenile Justice.\n\"I've always had an interest in mental health and there was an opportunity there to work as an advocate for patients in various mental health institutions, both adult and adolescents in the Hunter Valley area,\" he said.\nA former Cessnock Goannas Rugby League Football Club president, Mr Gorton is still very much a Goanna at heart despite moving to Maitland a few years ago, and is a director on the board of Cessnock Leagues Club.\n\"Rugby league has always been an interest of mine, and also what I found too from my point of view as a policeman when you go to a particular community, you've got to get involved with that community,\" he said.\nIRENE HEMSWORTH\nIrene Hemsworth dedicated her life to supporting others, and she has had her service to Maitland recognised in the 2025 King's Birthday Honours list.\nMrs Hemsworth had been volunteering since she was just 12-years-old, and at the time of her death in September 2024 was still active on 12 committees, at 84-years-old.\nShe has been honoured with a Medal of the Order of Australia (OAM) in the general division for service to the community of Maitland.\nIt's recognition that's long overdue, according to her daughter Raylene Teague.\n\"We're so proud of her in all honesty, I think it's been long overdue with the amount of work she's put into the community,\" she said.\n\"I know she would have liked to have been here to get it but it is what it is.\n\"She'd be chuffed.\"\nMrs Hemsworth has volunteered at a range of Maitland sporting clubs, church groups, scripture at schools, the RSL, op shops and school P&C associations.\n\"She started volunteering when she was about 12 at Sunday school, and then just never stopped,\" Ms Teague said.\n\"It was always if we wanted to be involved with something whether it was swimming or netball, or soccer or dancing, whatever it was mum would also throw her support behind that because she knew organisations were only as strong as the volunteers that it had.\"\nMrs Hemsworth has held roles at Maitland Netball Association, Maitland RSL Netball Club (co-founder and former president), Maitland Park Sport Recreation Board, Maitland Sports Council and was a learn to swim instructor.\nShe also was president of RSL Youth Club for almost 40 years, and was a member of the Maitland RSL sub-branch women's auxiliary.\nOne of her greatest passions was being a scripture teacher, where she taught at local schools from 1973 to 2024.\nMs Teague said her mum's strong Christian values drove her to volunteer.\n\"It (volunteering) was always from a Christian belief of serving others, so the scripture was important to her,\" she said.\n\"Principals of schools came up to me at her funeral and said mum didn't push Christianity, she was just the epitome of Jesus and loving everybody, it was all just about how to love one another and maybe that drove her volunteering.\"\nMs Teague said her mum's own life experiences often determined the groups she joined, whether it was a cancer support committee after being diagnosed with breast cancer, or becoming a learn to swim instructor when her daughter needed to learn to swim.\n\"We had a brother who passed away at eight-months-old and going through that as a young mother that she was, and the support she received, the was always looking at how to repay people and her motto was always 'if you can, I think you should',\" Ms Teague said.\nThis isn't Mrs Hemsworth's first award, having been named Maitland Citizen of the Year in 1989, and a Freeman of the City in 2014.\nBRIAN JACK\nBrian Jack has been active in the community for more than 50 years, and while his biggest thrill has been his career as an auctioneer, he has always been passionate about helping young people.\nNow, his decades of service have been recognised with a Medal of the Order of Australia (OAM) in the 2025 King's Birthday Honours for service to the community of Maitland.\nThe Aberglasslyn resident said while he has never been in it for the accolades, it's nice to be appreciated.\n\"I never went looking for accolades, and the only kudos that I received was from myself that if I'd helped somebody to turn them into a better person, I felt good,\" Mr Jack said.\nMr Jack has held roles at a number of Maitland clubs and organisations, including being the inaugural president at the Rotary Club of Maitland Sunrise, and the longest-serving president of the Maitland High School Ex Students Association.\nHe has held roles on the junior selection panel of Newcastle Knights Rugby League, where he helped young people achieve their best.\nWhether through Rotary, rugby league or work, Mr Jack has always found ways to help young people. At the Rotary Club of Maitland Sunrise, one of his portfolios was youth service.\n\"I always liked youth service because I always say the youth are our future of tomorrow, and we've got to get them there,\" he said.\nOne of his proudest career moments was judging state auctioneering at the Sydney Royal Easter Show, and judging the national competition in 2019, the same year he retired.\n\"I've got a lot of pleasure out of doing a lot of things and I've helped quite a few young auctioneers come through, I've trained a few and to see them go on and become the men in the industry they have really, really makes me happy,\" he said.\nIn his career Mr Jack started as an employee at Lindsay and Comerford from 1969 to 1972, then was an auctioneer with Carr Bros from 1972 to 1985 before becoming a partner at Jones and Berry from 1985 to 2019.\nDAVE SAMS\nConsidered to be a quiet achiever, Dave Sams is being honoured with one of the greatest accolades.\nThe Anna Bay man has been awarded an Order of Australia medal (OAM) in the King's Birthday Honours for his service to the community of Port Stephens.\nMr Sams originally thought the phone call to say he had been nominated for an OAM was a scam call.\n\"I never expected to get a call like that,\" he said.\nWith a passion for the community and volunteering, Mr Sams said he couldn't have achieved the recognition on his own.\n\"I've volunteered alongside a lot of good people and I wouldn't have been able to achieve whatever I have without those people I volunteered with,\" he said.\nIn his thirties, Mr Sams created his own job, in hopes of helping other unemployed people and the community.\nMr Sams founded the not-for-profit Salamander Bay Recyling Centre in 1994, formerly Not Everybody Works Employment Centre and today still works at the centre.\n\"I'm there until I retire,\" he said.\nThe recycling centre which has now become more commercialised, once received boxes full of recycled treasures.\n\"Stuff would come in the door and it was going out as quick as it was coming in,\" Mr Sams said.\nMr Sams has been an instrumental part of the Port Stephens Suicide Prevention Network, where he spends time volunteering.\nHe joined the network after his son, Robert, took his life.\n\"Your kids bury you, you don't bury your kids,\" Mr Sams said.\nThe heartbreaking loss of his son steered Mr Sams in a new direction - to help others who have lost ones to suicide.\n\"I'm involved with putting Lifeline signs out at bus stops and I've tried to put as many signs out across Port Stephens as possible,\" he said.\nHe helped create Solace Place, opened at Boat Harbour in 2014, for those seeking a quiet place for reflection.\n\"It's a good place to go and sit and reflect,\" Mr Sams said.\nMr Sams also founded Port Stephens Survivors of Suicide (SOS), which deals with issues after suicide.\n\"It had a real ripple effect on my family,\" he said.\n\"I would talk to people who had lost loved ones and it was an opportunity for them to talk about the person,\" he said.\nMr Sams was also there from the beginning of the Salamander Bay Men's Shed and said he wanted to create an environment where men could socialise and interact.\n\"Talking and getting things off your chest is so important,\" he said.\nAnother passion of Mr Sams is the environment and he is a former member of both the Anna Bay and Boat Harbour Parks and Gardens Group and Soldiers Point Tidy Towns Committee.\nHe is also a current Landcare volunteer and can often be found at Robinson Reserve planting trees.\nEverything Mr Sams does around the community is for the kids and he said he would like to see more volunteers in Port Stephens.",
  "word_count": 7709,
  "scraped_at": "2026-02-14T12:35:30.640038"
}