{
  "article_id": "6562a9c115d2",
  "url": "https://www.starsandstripesfc.com/black-history-month/2023/2/1/23581086/black-history-month-sophia-smith-usa-uswnt-portland-thorns-nwsl-championship-mvp",
  "title": "Black History Month : Sophia Shines Bright",
  "date": "20230201T151500Z",
  "domain": "starsandstripesfc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome to February! February 1st marks the start of Black History Month in America, where we celebrate the achievements that Black people have made and the many things that Black people have provided this great nation and the world. It’s also a chance to reflect on the many hardships Black people have endured throughout American history and continue the conversations that will lead to the changes necessary to improve life for Black people moving forward.\nBlack History Month: Sophia shines bright\nThe future is already here, and the world better recognize.\nAs I have done in previous years, I will bring that conversation to the soccer world. Soccer is a sport that’s rich with history, and a lot of the iconic moments, players, or events that define the beautiful game’s history is a result of black people. So, over the next 28 days, I will bring you quick stories about a Black player, an iconic moment in Black soccer history, or other soccer achievements made by a Black person or team. Some will be domestic stories, while others may span the globe. In the end, it’s an opportunity to recall some important players or moments that you may have already known while also learning something new, because Black soccer history is soccer history. By doing this, I hope to gain a lot of new knowledge, and I invite you to join me on that journey.\n——-\nOver the past year, there has been a revolution brewing in the National Women’s Soccer League as well as on the international scene. It has taken over the league and established the expectation of dominance on the international level. That revolution can be spelled simply: S-O-P-H-I-A.\nSophia Smith has become one of the great gems in soccer over the past year, as she has stepped up to become one of the greatest players in the world. However, her greatness wasn’t an overnight revelation. It has been brewing since she was a kid.\nGrowing up in Colorado, she starred both in soccer and basketball for her high school. However, her knack for the incredible was ever apparent, and she quickly rose up the ranks to become one of the best young talents in the country. In early 2017, as a 16-year-old, she was a part of the USWNT U-17s, representing her country at the 2016 FIFA U-17 World Cup. However, it was early 2017 where she grabbed headlines, as she scored 9 goals in 6 games, which is considered a record for the U.S. youth women’s national teams. Because of that record, she caught the eye of then-USWNT head coach Jill Ellis, who called her into her first senior national team in March 2017.\nWhile she didn’t appear in the two matches against Russia, she was already on the USWNT radar, and all before she turned 17 years old. As a 17-year-old, she was a part of the U-20 squad that finished 2nd at the 2018 Concacaf U-20 Women’s Championship and then also competed at the 2018 U-20 Women’s World Cup. In her total time with the U-20s, she scored 21 goals in 25 matches.\nShe went to Stanford Cardinal in 2018, competing there for 2 seasons. There, her scoring prowess continued, hitting the back of the net 24 times in 33 matches. 17 of them came in her sophomore season. In 2019, she helped lead Stanford to the NCAA national championship by scoring a hat trick in the semifinal. After that title, she was called into a USWNT talent identification camp by current USWNT head coach Vlatko Andonovski.\nAt that point, Sophia Smith decided to move to the professional level, entering the 2020 NWSL Draft and being selected by the Portland Thorns with the #1 overall pick, the first teenager drafted into the league. She also was called in for the first USWNT camp of the year, however she still did not earn a camp for the team. Still, she continued to play and improve and honestly take any setbacks personally. She knew her time was coming, and she was going to make a statement when she did.\nShe helped the U-20s win the Concacaf U-20 Women’s Championship, and was on track to finally appear for the senior national team. However, due to the Covid shutdown, Smith did not earn her first USWNT cap until November 27, 2020, when she appeared in a match against the Netherlands. When she stepped foot onto the field, she became the first player born in the 2000s to appear for the USWNT.\nHer star continued to rise with the Portland Thorns as well, with her being a part of the team that won the 2021 NWSL Challenge Cup as well as the 2021 Women’s International Champions Cup. On the international level, she was with the USWNT essentially full time, winning the 2021 SheBelieves Cup and scoring her first goal in a friendly against Paraguay in September 2021.\nHowever, it was 2022 where she stepped up and asserted her dominance on the soccer world. She scored 18 goals across all competitions for the Thorns, as they won the NWSL Championship. On top of that, she was voted NWSL MVP, named to the NWSL Best XI, and also won the NWSL Championship Game MVP as she scored a dazzling goal to open up scoring in the final.\nOn the international level, she only led the USWNT in scoring with 11 goals on the year. For her successes, she was named U.S. Soccer’s 2022 Female Player of the Year.\nThe only thing left for the world to do is to recognize her brilliant talent by listing her among the best players on the planet. Yet, every time there’s a list of the best talent out there, Sophia’s name isn’t on there, which constantly leads to widespread frustration among fans and players alike.\nBut, Sophia isn’t planning to worry about it. She’s got her mind on getting healthy for another successful season on the club level, but her eyes are focused on the Women’s World Cup this summer, where she hopes to once again step up and do nothing but score goals at a record clip to lead the USWNT to another trophy. Sophia Smith is already shining, but it’s time the rest of the world recognizes that she’s the brightest star in the sky.\n——-\nFor more Black History Month stories, check out our Black History Month hub. We will be bringing stories throughout the month to highlight some of the biggest moments in Black American and world soccer history.",
  "word_count": 1089,
  "scraped_at": "2026-02-14T12:14:13.468901"
}