{
  "article_id": "657ba86df66f",
  "url": "https://www.businesstimes.com.sg/international/harris-accepts-historic-nomination-start-election-sprint",
  "title": "Harris accepts historic nomination to start election sprint",
  "date": "20240823T043000Z",
  "domain": "businesstimes.com.sg",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Harris accepts historic nomination to start US election sprint\nShe will need to convince voters she’s more than simply a younger, more capable alternative\nUS VICE-PRESIDENT Kamala Harris formally accepted the Democratic presidential nomination on Thursday (Aug 22) night in Chicago, in a historic step that kicks off a three-month dash to Election Day on Nov 5.\nThe 59-year-old’s challenge now is to harness the energy and excitement of a party reinvigorated by her rapid ascent. It amounts to an existential test for Harris, who remains undefined in the minds of many voters and has less than three months to build – and hold – a winning electoral coalition.\n“On behalf of everyone whose story could only be written on the greatest nation on Earth, I accept your nomination to be president of the United States of America,” Harris said.\n“I promise to be a president for all Americans. You can always trust me to put country above party and self, to hold sacred America’s fundamental principles, from the rule of law to free and fair elections to the peaceful transfer of power,” she added.\nDespite emerging from the ashes of President Joe Biden’s disastrous debate performance and unpopular post-pandemic economic recovery, the former prosecutor’s ascent has so far thrilled the party faithful and disaffected moderates alike.\nBut she will need to convince voters she’s more than simply a younger, more capable alternative than her 81-year-old boss and the 78-year-old Donald Trump, whom Republicans have nominated for a third consecutive presidential contest.\nNavigate Asia in\na new global order\nGet the insights delivered to your inbox.\nIn her speech, Harris pledged to “be a president who unites us around our highest aspirations, a president who leads and listens, who is realistic, practical and has common sense, and always fights for the American people”.\nShe delivered a sharp rebuke of Trump, urging voters to turn the page on the former president and warning that he would only seek to enrich himself if returned to power.\n“In many ways, Donald Trump is an unserious man. But the consequences of putting Donald Trump back in the White House are extremely serious,” Harris said. “Just imagine Donald Trump with no guardrails.”\nSEE ALSO\nHarris sought to contrast her agenda, as one which would prioritise the middle class while protecting reproductive and civil rights, with Trump.\n“My mother kept a strict budget. We lived within our means, yet we wanted for little. And she expected us to make the most of the opportunities we had and to be grateful for them,” she said. “That’s why we will create what I call an opportunity economy, an opportunity economy where everyone has the chance to compete and the chance to succeed.”\nThe Democratic nominee said she would pass a middle class tax cut that would benefit more than 100 million Americans, provide more access to capital for small business owners, boost the housing supply, take steps to lower the cost of healthcare and groceries and protect programmes such as Social Security and Medicare.\n“Compare that to Donald Trump,” she said. “He fights for himself and his billionaire friends. And he will give them another round of tax breaks that will add up to US$5 trillion to the national debt.”\nAnd she referenced Trump’s threat to raise tariffs on another nations, calling it a “Trump tax hike”.\nParty rebrand\nEach night of the convention – peppered with musical performances and celebrity cameos, including Oprah Winfrey’s first-ever convention appearance – built towards Harris’ big moment, while also serving as a microcosm of the rapid transformation of the Democratic Party in the new nominee’s image.\nOn Monday, a tearful Biden passed the torch. A day later, Barack and Michelle Obama hailed Harris as the inheritor of their groundbreaking political movement, thrilling the party faithful with a harsh indictment of Republican nominee Trump.\nHarris’ vice-presidential nominee Tim Walz capped the penultimate day on Wednesday with a football and freedom-soaked address targeted at the Rust Belt voters that will likely decide the election.\nHarris herself appeared on Tuesday at a rally at the same Milwaukee arena where Republicans held their own convention. That rally was partially livestreamed back to Chicago, flexing the enthusiasm around her bid.\nThursday’s list of speakers is designed to demonstrate the broad coalition Harris will need to stitch together to prevail on Election Day.\nShe was introduced by Roy Cooper of North Carolina, a Democrat who has cultivated a deep reservoir of support in his key battleground state and who heralded Harris as someone “who would never settle for less.”\n“We’ve got a lot of big fights ahead of us, and we’ve got one hell of a fighter ready to take them on,” he said.\nCooper’s placement in the evening emphasised the extent to which Harris has expanded Democrats’ path to electoral victory, rapidly regaining standing in Southern states.\nThe line-up also included Michigan governor Gretchen Whitmer, who painted Harris as a steady hand, needling Trump as out-of-touch and disdainful towards her home state.\n“One day when you are just trying to get everyone out the door, a news alert goes off – something’s happened, something’s hit the fan,” she said. “You’ll ask, ‘Is my family going to be ok?’ Then you’ll ask, ‘Who the hell is in charge?’”\nElizabeth Warren, the Massachusetts senator and progressive icon, teared up as the crowd gave her a standing ovation and then painted Harris as willing to take on corporate interests.\n“She’ll take on the Wall Street firms that buy up millions of houses and apartments and then jack up the rent. She’ll take on drug companies that charge an arm and leg for prescriptions,” Warren said. “She’ll take on corporate monopolies that rip off consumers and billionaires who don’t pay taxes.”\nSpeeches and music\nSenator Mark Kelly from battleground Arizona and his wife Gabby Giffords provided emotional heft to the gathering, with the former congresswoman detailing her attempted assassination in a call for gun safety measures. Kelly, a finalist for the vice-presidential job, touted Harris as a steady foreign policy hand.\n“The threats we face are too serious, the sacrifices our service members make are too sacred, the alliances we’ve spent decades building are too critical,” he said.\nMusical performances by The Chicks and Pink earned cheers, particularly from the Gen X and elder Millennial women at the heart of Harris’ base. But speculation had swirled around Chicago that a top-tier endorsement might be unveiled, leaving some in the crowd at least temporarily disappointed.\nDemocrats will balance that push against a broader effort at the convention to seize back the mantle of “freedom” in a bid to regain voters from Republicans, who for years claimed a monopoly on such messaging.\nThe Democratic version of “freedom” centred predominantly around reproductive rights but also touched on voting rights, the environment and economic mobility. Delegates waving signs with “USA” in red lettering and draped in Americana said Harris’ nomination had injected fresh patriotism into the party.\nDeep bench\nThe lineup embodies a concerted push by convention organisers to highlight a deepening Democratic bench.\nThe week’s proceedings gave prominent speaking slots to a slew of elected officials thought to have presidential ambitions of their own – including governors Wes Moore of Maryland, JB Pritzker of Illinois and Pennsylvania’s Josh Shapiro – underscoring the uncertainty over the party’s future despite Harris quickly seizing this year’s nomination.\nMany of the rising stars spent their mornings stopping at delegation breakfasts to schmooze with party insiders and donors and their evenings hosting parties.\nBut their attendance also underscored an at-least temporary unity. Ideological rivals like New York congresswoman Alexandria Ocasio-Cortez and Kentucky governor Andy Beshear both appeared at the Democratic proceedings.\nStill, divisions were apparent in Chicago. Outside the venue, protesters staged multiple demonstrations over Israel’s war in Gaza. Inside the perimeter, some delegates bristled at the decision not to include a Palestinian American as part of the programming.\nDecoding Asia newsletter: your guide to navigating Asia in a new global order. Sign up here to get Decoding Asia newsletter. Delivered to your inbox. Free.\nShare with us your feedback on BT's products and services",
  "word_count": 1357,
  "scraped_at": "2026-02-14T13:15:31.876511"
}