{
  "article_id": "657b02be32b1",
  "url": "https://www.womenshealthmag.com/fitness/a60175284/kansas-city-current-stadium/",
  "title": "Inside The Ground - Breaking New Stadium Built For Women Sports",
  "date": "20240314T144500Z",
  "domain": "womenshealthmag.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "I grew up in the 1980s in Kansas City, Missouri—a sporty kid who loved nothing more than playing striker for my elementary school soccer team, the Hot Shots. But my sports heroes? They were all men. Unless it was the Olympics, and Mia Hamm was scoring goals and leading the team to gold, then you rooted for the guys. Even the girls on my high school basketball team who went on to play in college understood that their dream ended after graduation.\nNow, young girls—and all children—will have a dramatically different experience. The Kansas City Current of the National Women’s Soccer League is part of that story. The team will play in CPKC Stadium, the first in the world built for women, beginning this month.\nTwo of the team’s four owners are women. The first is Brittany Mahomes, a former pro soccer player for a club in Iceland, who is married to NFL Chiefs quarterback Patrick Mahomes. The second, Angie Long, is a KC native and former All-American rugby player who co-owns a successful Kansas City–based mutual fund. (Her husband and business partner, Chris, is also a Current co-owner. So is Patrick.) In fact, most of the project leads—from general manager to head of construction—are women.\nThe newly appointed female president of the organization, Raven Jemison, climbed the corporate ranks of the NHL and NBA but was sold on the KC Current role after one conversation with the Longs, whom she calls visionaries. Jemison says she made the move to “build the legacy that we all want to have in our careers…knowing that we’ve made a difference.” She adds, “we want [the KC Current] to be the example of what happens when you invest in women, invest in women’s sports, and actually take a stand and say, ‘This is what’s possible.’”\nEvery female Current executive and player I spoke to while reporting this piece was an athlete growing up. And, like me, their memory banks overflow with major moments in men’s professional sports…while their female-specific memories stemmed from their own lives, centered on the courts and fields they played on with their teammates. When I asked them to identify their childhood sports heroes? They all named men.\n“The number of times [in high school] I wore hand-me-down jerseys from the men’s team,” says Angie, who was a star soccer player as a teen. “You love it, it’s your team, and you love to compete. But a stadium for women changes everything.” No more hand-me-down stadiums.\nConsider this: In 1985, the players on America’s first women’s national soccer team, the 85ers, were given a $10 daily stipend when they traveled to Italy for Mundialito, their first international tournament. As for their uniforms? The team cut up and sewed logos onto their “jerseys” (hand-me-down men’s practice shirts) the night before flying out.\nA lot has changed since then. In 2024, there is legitimate fan fervor around women’s sports. More people tuned in to watch American tennis star Coco Gauff win the US Open championship last September than watched the men’s finals. This year, University of Iowa basketball star Caitlin Clark smashed NCAA scoring records and filled arenas—and delighted pro sports fans when she declared for the WNBA draft. But it bears repeating that it wasn’t so long ago that things were different. Recently, one of Angie’s four children (her eldest daughter, a talented volleyball player) asked her mom if she’d dreamed of being a professional athlete when she grew up. Which…no, Angie replied, because “girls didn’t do that.”\nInvesting in 75 acres of land plus construction—at a cost of about $200 million—to build a stadium suggests that the recent swell of interest in women’s sports is not just a fad, but a movement. The emotional impact it will have on the women who played for the 85ers? For women like Angie? For women like me? Immeasurable. For young girls and boys like my 8- and 12-year-old sons, who attended the Current’s home opener with me on March 16? It will, I hope, feel normal that professional female athletes have a facility of their own.\n“The stadium is just going to continue to bring more visibility to [women’s sports] and bring more fans into those doors,” says Kristen Hamilton, a KC Current forward. “And it won’t even just be young girls, but also boys who are going to say we’re their heroes. That feels surreal to me.”\nBut all of this is bigger than simply breaking the status quo. “There is actual math behind it,” Angie says. “Which transcends anything to do with women’s sports.” In other words, this is no charity project. It’s both the right thing to do and a great way to make money for the team and for Kansas City.\nThe potential financial upside created by the stadium is huge.\nThe Current gets its name from the Missouri River, which runs along the state border between Kansas City, Missouri, and Kansas City, Kansas. The owners saw a unique opportunity for the team to own a stadium and took on personal financial risk to make it happen. (Construction was entirely privately financed by the owners.) The Longs traveled the world researching stadiums for inspiration and broke ground in the fall of 2022. The undertaking has moved at warp speed, rocketing from conception to completion in three years. (A nearby training facility, including weight rooms and two grass and one turf field, was also built.)\nAnd the owners thought of everything, from eco-conscious design to modern amenities and high-tech security. Every one of the 11,500 seats is within 100 feet of the pitch. There are best-in-class sustainability and accessibility features, views of the downtown KC skyline and Missouri River, and a cashless game-day purchasing experience.\nPreviously, the Current rented time on fields at high schools and universities and in the stadium of the men’s hometown MLS team, Sporting KC. The economics of owning your own facility—rather than renting time in another brand’s—creates tremendous potential upside for the team. Beyond saving rent money, “we will be able to generate $20 million [total] a year in revenue,” Angie says.\nThat big number is possible because myriad revenue streams are available when you own your own stadium. Sponsorship deals. Fan stores selling team gear and merchandise. Naming rights on the stadium gates. Parking revenue. And yes, ticket sales: The Current’s season tickets sold out months before opening day, a positive sign that the Longs’ calculus is spot-on. Plus, the team makes its own schedule, rather than puzzling their home games around another team’s, which means games can be played during primetime on weeknights and weekends. “We spent a lot of time on the economic model. Facilities are an incredible way to unlock so many revenue opportunities that benefit everybody,” says Chris. “They benefit the team, they benefit the players, they benefit the community.”\nThe owners plan to leverage the facility in the off-season too: high school championships, concerts, possibly even World Cup training workouts. This all means more inspiring events for Kansas Citians to enjoy…and more cash for the Current. Profits will be reinvested, helping with recruiting, stadium-related costs, and real-estate development adjacent to the facility. It will also fund leveled-up coaching and essential support for the players.\nNew investments in injury prevention will help keep the players healthy.\nLast season, the team endured numerous injuries, contributing to their standing near the bottom of the league. “We need everybody on the field; we need everybody available,” says Elizabeth Ball, a KC Current defender. “So when you’re called on, you’re ready to go.” Now, as of the 2024 preseason, the team has hired new staffers—heads of medical, nutrition, and rehabilitation, plus psychologists, trainers, and coaches for strength, conditioning and performance—and partnered with the University of Kansas Health System to monitor each player, keeping them healthy and preventing injuries.\nRather than a blanket regimen for the entire squad, individualized plans for training, recovery, and nutrition are created for each player. Recently, the players began wearing heart rate monitors while training to help medical staff flag any potential issues. They also complete a daily wellness questionnaire, providing holistic feedback on their mental, emotional, and physical status. And the players already feel the difference. “When we came in right before preseason, it was crazy how many staff members there were,” says Ball. “We’re standing out on the field, and I’m like, ‘There are more of them than us!’”\nThese upgrades are badly needed in women’s sports. Knee injuries (like the dreaded ACL tear), for one, disproportionately affect female athletes for various hormonal, anatomical, and biomechanical reasons. The owners have also invested in injury-prevention infrastructure, forgoing turf, which is correlated with higher incidence of injury, for more-expensive grass, and installing heaters underneath the field to keep the surface soft even on the coldest spring days.\n“While the investment in the infrastructure and the staff is the first of its kind, we all hope it’s not the last,” says Camille Ashton, the team’s general manager. “I think the new standard we’re setting in what these professional players experience and how they should be treated is truly monumental.”\nKansas City pride is on full display.\nAs a KC native, I can confirm that we love our tiny but mighty midwestern city. The people are kind, the culture is vibrant, the food is awesome. (Barbecue FTW!) And it will be front and center at the new stadium. There will also be vegan and gluten-free fare on offer, a boon for fans with special dietary needs. Nothing used for food service–beverage containers, plates, cutlery, etc.–will become trash. Instead, it will be collected, washed, and reused at future games. The owners have made energy-efficient decisions at every turn and are applying for LEED certification, the leading sustainability award.\nThe aesthetic and vibes will also reflect Kansas City’s history and culture, including its 1920s jazz-town roots. “Our main objective was that we did not want to create a design that could be picked up and placed anywhere,” says stadium design lead Christina Franklin, head of interior design at the local architecture firm Generator Studio. “We thought about what defines a lot of the architectural design and interior design of some of our oldest Kansas City buildings, and we integrated those elements within the stadium.” The result is art deco moments, such as checkerboard detailing, as well as fishtail patterns, plus artwork by local KC artists.\nFans will find other Easter eggs at the stadium too.\nLike the iconic Title IX installation. A wall embellished with the words of that historic legislation—which passed in 1972 as an addendum to the 14th Amendment to prevent sex-based discrimination at schools—is situated between the locker rooms and field. The teams will walk directly in front of it as they enter the field.\n“Every player who comes and plays in that stadium, every little kid, will have a completely different expectation now of what it means to be a professional female athlete,” says Angie. “Once something like this is built…you can’t unsee it.” She invited the 85ers to the Current’s home opener. Fifteen of the 17 attended and got to witness a new chapter in women’s athletics.\nEven the Current’s locker room is purpose-built. It is oval-shaped so every player has an equitable position within the space. The athletes will feel the gravitas when they walk inside and see their team logo, their names on the lockers, their red-and-teal colors.\nThe colors bring back memories of my favorite pair of Converse high-tops, which I daringly laced up back at my Catholic elementary school. The bright teal hue broke the rules of our strict dress code and landed me in the principal’s office. I still remember how hard it was to deal with the exhilaration, and subsequent anguish, of pushing the limits and then being told, No, you can’t do that. After school, I hustled my little heart out at soccer practice with my Hot Shots teammates because on the field, I felt as if anything and everything were possible. For me, those hues will forever represent passion and possibility. And soon, the same will be true for a new generation of kids.\nLiz Plosser is the editor-in-chief of Women's Health. She's been passionately reporting and editing health, fitness, nutrition, sexual health, and mental health content for her entire career. She has a 360-degree outlook on the wellness world, having worked across platforms at print tissues (Self, Cosmopolitan), with video (CosmoBody), overseeing content and strategy for brands (Canyon Ranch, SoulCycle) and as SVP of Content in the Digital Space (Well+Good).",
  "word_count": 2089,
  "scraped_at": "2026-02-14T12:17:16.261921"
}