{
  "article_id": "65c68507949b",
  "url": "https://www.aol.co.uk/articles/morocco-plans-hosting-afcon-springboard-120407036.html",
  "title": "How Morocco plans to use hosting Afcon as springboard to become a global football powerhouse",
  "date": "20251218T123000Z",
  "domain": "aol.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How Morocco plans to use hosting Afcon as springboard to become a global football powerhouse\nMorocco is poised to host the Africa Cup of Nations (Afcon) from Sunday, an event seen as a crucial stepping stone in its ambitious journey to become a global football powerhouse and a significant dress rehearsal for its co-hosting duties at the 2030 World Cup.\nThe North African nation, which famously reached the semi-finals of the 2022 World Cup, will welcome 24 teams from across the continent, utilising nine new or renovated stadiums in six cities.\nThis marks only the second time Morocco has staged the biennial tournament, yet it arrives amidst a period of intensified football engagement.\nThe country regularly hosts \"home\" games for other African nations during World Cup qualifiers and recently secured the rights to host five consecutive Under-17 Women’s World Cups, alongside the Women’s Africa Cup of Nations in July.\nOfficials openly frame this Afcon as a high-visibility dry run for the 2030 World Cup, where Morocco will serve as a primary co-host alongside Spain and Portugal, with Argentina, Uruguay, and Paraguay each hosting a single match.\nA cornerstone of Morocco's grand vision is the planned Hassan II Stadium, projected to be the world's largest football arena with a capacity of 115,000 upon its completion in 2028.\nThis new national stadium epitomises one of Africa's most aggressive infrastructure drives.\nBeyond sports, Morocco has pursued rapid development across various sectors, updating airports, expanding high-speed rail networks, and attracting major tourism investments to cities such as Marrakech and Tangier, all aimed at accommodating a surge in visitors.\nThe Royal Moroccan Football Federation has simultaneously invested heavily in youth development and coaching, aiming to elevate standards across the sport.\nA prime example is the lavish Mohammed VI Football Complex near Rabat, which serves as the training base for the senior national team during the Africa Cup. This commitment to nurturing young talent appears to be yielding results.\nMorocco's historic run to the 2022 World Cup semi-finals was a first for any African or Arab side, and the nation further cemented its rising status by winning the Under-20 World Cup in October.\nFouzi Lekjaa, president of the Royal Moroccan Football Federation, articulated this ambition to French sports paper L’Equipe in July, stating: \"It’s not dreaming, we have legitimate ambitions.\"\nLekjaa, who also manages budget affairs within the Moroccan prime minister's cabinet, views sport as a vital engine for economic development.\nHowever, these significant investments have not been without controversy, sparking heated debate regarding the nation's priorities.\nWhile thousands of visitors will encounter areas rich with hotels, restaurants, new roads, and other tourist infrastructure, vast swathes of the country present a stark contrast.\nIn rural regions, far removed from financial hubs, residents frequently voice complaints of neglect and a lack of investment, citing critical issues such as healthcare, literacy, and employment.\nDuring \"Gen Z\" demonstrations earlier this year, protesters notably chanted, \"Stadiums are here but where are the hospitals,\" directly linking the substantial football investments to broader societal inequalities.\nYoung people, in particular, express frustration over overcrowded schools, deteriorating hospitals, and inconsistent basic services.\nPrime Minister Aziz Akhannouch’s government has faced accusations of channelling billions into prestige projects like stadiums instead of addressing pressing social needs.\nSeveral members of Morocco's national team publicly supported these protests. In October, King Mohammed VI asserted that these two categories of development were not mutually exclusive or in competition.\nThe tournament also unfolds as Morocco actively works to solidify its position as a regional power.\nThrough its \"Atlantic Initiative,\" the country has sought to deepen ties with landlocked nations in West and Central Africa, expanding the reach of its banking and telecommunications industries and offering those without coastlines access to newly constructed ports.\nMorocco's normalisation of ties with Israel has strengthened its relationship with the United States, and it has also garnered support from most European Union members regarding its sovereignty over the disputed Western Sahara.\nThis issue, however, remains a source of tension with Algeria, despite a UN Security Council resolution this year that Morocco interpreted as a breakthrough.\nThe Polisario Front, based in southern Algeria, continues to advocate for the territory’s independence.\nFurthermore, while Morocco has offered tourist visas to spectators attending the Africa Cup, it has simultaneously moved in recent years to curb migration from some of the participating countries.\nFor instance, visa requirements for Ivorian citizens were reinstated last year, partly to deter irregular migration attempts.\nMorocco has long been perceived as a gateway to Europe, sharing a border with the EU via the Spanish territories of Ceuta and Melilla on the North African coast, and with Spain’s Canary Islands approximately 100 kilometres away.\nThe kingdom has drawn criticism from migrant rights groups for its aggressive enforcement measures, including clearing encampments and relocating migrants to remote areas far from European borders.\nThe Moroccan Association for Human Rights’ Rabat branch reported an increase in arbitrary arrests and forced expulsions of migrants in the run-up to the Africa Cup this week.\nThe Africa Cup of Nations final is scheduled for 18 January at Prince Moulay Abdellah Stadium in Rabat, which opened in September.",
  "word_count": 855,
  "scraped_at": "2026-02-14T12:37:36.412533"
}