{
  "article_id": "65c82ba994bb",
  "url": "https://www.thesixthaxis.com/2025/01/01/30-upcoming-pc-games-for-2025/",
  "title": "30 upcoming PC games for 2025 | TheSixthAxis",
  "date": "20250120T171500Z",
  "domain": "thesixthaxis.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "PC gaming is in an incredible place right now. The last few years have seen Japanese publishers in particular cotton on to the fact that PC gamers want to play Yakuza and Final Fantasy too, Microsoft and Sony are both bringing their first party games to the platform, and you still have all the hustling and bustling indies throwing games into Early Access.\nThe one thing that PC gamers are really going to be missing out on in 2025 is GTA 6, but Assassin’s Creed, Monster Hunter, Civilization, Elden Ring, Avowed, and Doom: The Dark Ages, are amongst the big budget releases. But there’s also early access launches like Subnautica 2, Slay the Spire 2 and more.\nAssetto Corsa EVO\nPC (Early Access) – 16th January 2025\nMuch like the name suggests Assetto Corsa EVO is an evolution for the racing simulation franchise, as it will have an open world. This open world is set in the region of the Eifel region of Germany, home to the world famous Nürburgring. The map will eventually grow to cover 1600 square kilometers, all of which laser scanned to recreate an accurate portrayal of the region.\nMuch like its predecessors, Assetto Corsa EVO will feature a range of cars, including road cars, classics, hypercars, and race cars. Each one of these have been recreated digitally using laser scans to make sure all of their details will be captured right down to the smallest.\nFinal Fantasy VII Rebirth\nPC – 23rd January 2025\nThe middle chapter in the Final Fantasy VII Remake saga is coming to PC right at the start of 2025, after its stint as a PS5 exclusive in 2024. It’s a fantastic continuation that builds out the first chapter into more open world areas with more things to see and do.\nOr glowing review scored the game a resounding 9/10, saying: “Final Fantasy VII Rebirth is a beautifully crafted experience that fans old and new will absolutely love. It almost goes too far in correcting the first game’s linearity with broad open areas stuffed with things to do, but there’s also key additions to the combat, and the story running through this middle chapter is masterfully retold. Really the biggest problem you’ll have once the credits roll is knowing that it will be far too many years before we can finish the trilogy.”\nEternal Strands\nPS5, XSX|S, PC – 28th January 2025\nEternal Strands has a huge and expansive open world that can all be explored, which is called the Enclave. Unfortunately, the Enclave has largely been invaded and taken over by a force known as the Surgeborn, an otherworldly enemy that has trapped the people in a smaller and smaller corner of it.\nEnter the Weaver, Brynn. She is on a mission to push back the Surgeborn, liberating the Enclave from their incursion. It will not be an easy fight as the Surgeborn consist of towering creatures that will prove a challenge to take down. However, Brynn has access to weapons and magical abilities to fight back, as well as being able to use the environment to help her. You can use enemy attacks against each other as well to even the odds. The world can be manipulated so new paths can be created showing hidden parts of the Enclave. Be careful though, as the world is dangerous and destructible.\nSniper Elite: Resistance\nPS5, XSX|S, PS4, XBO, PC – 30th January 2025\nYou know what you’re getting with Sniper Elite: Resistance, a spin-off story that puts Karl Fairburne’s longtime co-op buddy character, Harry Hawker, in the spotlight. You’ll be sneaking through large levels, silently taking down patrolling guards, sniping from hundreds of meters away (to trigger the series’ iconic X-Ray killcam), and working your way through a variety of missions behind enemy lines in Occupied France.\nWe went hands on with Sniper Elite: Resistance at last year, saying, “Sniper Elite has become a bit like stealth action comfort food over the past decade, having really settled into the sandbox levels and mission structure in the last few games. Sniper Elite: Resistance isn’t looking to revolutionise the series, but give a new campaign, a few new twists and tweaks to the formula, and just let you settle in with a nice glass of red – to go with all the red you spill in-game.”\nKingdom Come: Deliverance 2\nPS5, XSX|S, PC – 4th February 2025\nIt’s been a good seven years since the original Kingdom Come: Deliverance, and fans of this historical RPG have been waiting a long, long time for Henry and Sir Hans’ journey to continue. There’s less than a month to wait, you’ll be glad to hear, with our duo journeying through medieval Bohemia in the early 1400s to deliver a message at the start of Kingdom Come: Deliverance 2.\nThings…. don’t quite go to plan, and they’re swept up in the problems of kings and wars that are increasingly affecting the region. This grand sequel will feature two main areas, with the Bohemian paradise of the opening juxtaposed with the city of Kuttenberg and all of the political intrigue that that can bring. Don’t worry if you don’t remember or haven’t played the original, as Warhorse promise this will be a good starting point, even if it’s a direct narrative continuation.\nAhead of its February release, we’ve been able to dive into the opening hours of the game, sharing our initial thoughts on the road to review with our Kingdom Come: Deliverance 2 preview.\nCivilization VII\nPS5, XSX|S, PS4, XBO, NSW, PC – 11th February 2025\nThere’s been a good few pretenders to the throne emerging over the last few years, but Civilization VII is arriving to firmly put its stamp on the historical 4X genre once more.\nThis game will tackle the concept of shifting ages, just as the genre as a whole has been. Split into three distinct ages – Antiquity, Exploration and Modern – each civ is restricted to a particular time period and then has to grow and morph into another through a point of crisis. Rome will eventually fall, but that can provide the historical and gameplay foundations to become any number of medieval empires – the Holy Roman Empire, perhaps? – and from there lead into modern European nations.\nWe went hands on with Civ VII back at Gamescom 2024, as well as having the opportunity to speak with Creative Director Ed Beach about this major new direction for the series.\nAvowed\nXSX|S, PC – 18th February 2025\nWill you save the world or doom it? That’s the choice that runs through Avowed, as you gain more and more power on your journey as an envoy of the Aedyr Empire, tasked with investigating a spiritual plague that threatens the whole world.\nAvowed takes us back to the Living Lands, a mysterious islands in the fantasy world of Eora, which it shares with Obsidian’s previous Pillars of Eternity games. However, where those games were both top-down CRPGs and part of the genre’s revival over the past decade, Avowed is shifting back to one of Obsidian’s areas of expertise: first person action RPG adventuring. Avowed is not a fully open world game, but has several large open areas that you can explore and, in that regard, it might be comparable to one of Obsidian’s other acclaimed hits, The Outer Worlds.\nOriginally set for release at the end of 2024, Xbox decided to hold off on Avowed’s launch in a busy release window to try and find a little bit of breathing room in early 2025. That…. hasn’t necessarily worked out, but with more time to polish and the promise of a first party Xbox game, this is certainly one to watch.\nLike A Dragon: Pirate Yakuza in Hawaii\nPS5, XSX|S, PS4, XBO, PC – 21st February 2025\nThe Yakuza/Like A Dragon series is as much known for its leftfield side quests and spin offs, as it is for its more serious crime stories. Yet, Like A Dragon: Pirate Yakuza in Hawaii may just be the most out there for the series, and placing Goro Majima as a pirate captain with his own ship. It is bonkers and fits the character of Majima so well, who is probably only second to Kiryu when it comes to the franchise’s cast.\nLike A Dragon: Pirate Yakuza in Hawaii is a spin off set after the events of Like A Dragon: Infinite Wealth. In this spin off, Majima has lost all of his memories and wakes up on a desert island. Soon, after he is the captain of his own pirate ship, engaging in naval battles with other pirate captains, and setting foot on a pirate enclave known as Madlantis. Combat will be more of the classic action style of Yakuza, rather than the turn based of Like A Dragon, and we are expecting the story to be both bonkers and full of feeling when it drops anchor.\nMonster Hunter Wilds\nPS5, XSX|S, PC – 28th February 2025\nHaving transformed itself into one of the biggest video game franchises out there, Monster Hunter Wilds is looking to take the next step forward from the series, following on from Monster Hunter World and the Nintendo-centric Monster Hunter Rise. Wilds is set to feature the most open and most alive environments yet in a Monster Hunter game.\nThe fundamental gameplay loop will remain the same: find your target monster, attack them, chase them down, try not to die, capture or kill them, carve off pieces from the carcass, use those pieces to make better weapons and armour, find a bigger monster, repeat. It will also be better with friends, forming parties to go on hunts together and coordinating your resources. New for Wilds is that this can be crossplay for the first time.\nDune: Awakening\nPS5, XSX|S, PC – Early 2025 (PC)\nWith the success of the recent films, Dune video games are popping up left and right, with Dune: Awakening one of the most exciting and intriguing in development. Coming from Conan Exiles developer Funcom Oslo, this is a big open world survival MMO.\nIt definitely feels like survival will be quite tricky here, given the setting. Worms are just one unkillable threat to contend with, as sandstorms, the heat and sunlight, and just finding water in this desert all being particular challenges. Of course, you can band together with other players, sharing resources, building bases, going on raids and quests, and deciding which of the factions vying for control over the planet you wish to align with.\nThere’s no defined release date yet, but Dune: Awakening will have betas before launch. That launch will also be split, first coming to PC before consoles arrive at a later date.\nSplit Fiction\nPS5, XSX|S, PS4, XBO, PC – 6th March 2025\nComing from the makers of the excellent Brothers: A Tale of Two Sons, A Way Out and It Takes Two – and with an only lightly sweary introduction from Josef Fares at The Game Awards – Split Fiction has shot right to the top of our must-watch list as another splitscreen co-op experience that you’ll want to hunker down with a partner or friend to play.\nSplit Fiction sees Mio and Zoe – named after Fares two daughters – as two aspiring writers who are seemingly conned into feeding their stories into an evil AI machine. While AI stealing human beings content is worryingly close to reality, the game sees Mio and Zoe pulled into the machine, and their two stories, one fantasy and one sci-fi mixed and merged, with the duo jumping between the two from level to level. Each level will introduce new mechanics, blending fantasy and sci-fi tropes together in some intriguing ways. We can’t wait!\nAssassin’s Creed Shadows\nPS5, XSX|S, PC – 20th March 2025\nFans have been demanding an Assassin’s Creed set in Japan pretty much since 2007, and they’re finally going to get what they want with Assassin’s Creed Shadows – even if it’s been embroiled in a disappointingly inevitable amount of internet discourse, thanks in no small part to featuring a black immigrant samurai as one of the two playable characters. That’s something that Ubisoft has at times struggled to communicate well with fans and gamers around the world.\nAssassin’s Creed Shadows takes us back to 16th century Japan during the Azuchi-Momoyama era, featuring a female ninja and a male samurai for its lead characters. That man is a historical character based off Yasuke, a man of African origin who was one of the rare immigrants to Japan and who served Oda Nobunaga. The female ninja is named Naoe from Iga Province, who is inducted into the local Assassin’s order to battle all those persky Templars. Their stories will be intertwined, letting you master complimentary playstyles as both characters have contrasting abilities – Naoe for stealth, Yasuke for direct combat. This will be a fresh take on the twin protagonists that we’ve seen on occasion through the Assassin’s Creed series.\nAtomfall\nPS5, XSX|S, PS4, XBO, PC – 27th March 2025\nAtomfall spins us off into an alternate version of events following the Windscale Fire nuclear disaster in northern England, in which the surrounding area was rapidly locked down, the locals kept in line and monitored by the military group Protocol, and advanced retro-futuristic technology the order of the day. Can you unpick the mystery?\nIt might look like a very English Fallout, but this is a rather different style of game, where scarcity of resources plays a big factor in pushing you to melee – you get to fight roving bands of bandits dressed like Morris dancers – and investigating the story will be a bigger part of the experience.\nKilling Floor 3\nPS5, XSX|S, PC – March 2025\nKilling Floor 3 was announced in 2023, and it is coming nine years after Killing Floor 2. Much like the previous games, players will team up to take on an undead army of Zeds. Killing Floor 3 is set 70 years after Killing Floor 2, and the world is overrun by the Zeds. Players are part of the rebel group known as Nightfall.\nTeams of five will face the relentless waves of Zeds, unlocking skills and weapons to survive the dystopian setting. Some of the classes confirmed are the medic, the sharpshooter, and the ninja, There will be some closed beta tests ahead of Killing Floor 3’s full launch in March, and you can sign up for your chance to take part on the Killing Floor 3 website.\nFootball Manager 2025\nPC, PS5, XSX|S, NSW, iOS, Android – March 2025\nFootball Manager 2025 is a departure for the long running management for a couple of reasons. First, it is actually releasing in the same year as its title, purely down to delays. Second, it is the start of a new era as the series is moving to the Unity engine. That means there are a number of changes coming to the series as a result.\nFirst let’s talk about changes. The user interface is going to change to be more modern. Goodbye inbox and hello to more messaging instead.Women’s football is also being added to the game as well. Due to the change in engine, there are some features missing too. International management will not be part of the game, and touchline shouts have also gone, as well as create a club, challenge mode, and versus mode. The Premier League license has been acquired though.\nCommandos: Origins\nPS5, XSX|S, PS4, XBO, PC – March 2025\nA legendary tactical action game series returns with Commandos: Origins. It’s coming up on two decades since the series’ heyday in the late 90s and early 2000s, but the tough as nails missions that will have you quicksaving every few seconds and the tactical action have been restored in recent HD remasters and console ports. Now we’re stepping back to explore the origin stories of the Commandos and their very first missions together.\nOriginal studio Pyro is long gone, so Kalypso has instead handed the reigns over to Claymore Game Studios to develop what is effectively a series reboot.\nKingmakers\nPC (Early Access) – Q1 2025\nThe Medieval Era was a time of war of much warfare across the world, as different people vied for power and thrones. It would have been brutal and the only thing that would have made medieval warfare more brutal is guns. Kingmakers takes players back 500 years to medieval England, arming them with guns to change the course of history in attempt to stop the apocalypse in the future.\nKingmakers mixes the action with strategy, as you will have a medieval army at your back. You will control where units go to head off enemy forces. To help them you have access to vehicles too, including a truck and an attack helicopter. Kingmakers will also have solo and co-op play too, and it is due out in Q1 2025 for PC.\nThe Alters\nPS5, XSX|S, PC – Q1 2025\nWhat would it be like to live with yourself? It is a question you may have pondered? Would your copy be exactly like you, or look like you but have a different view of things. Enter The Alters, 11 Bit Studios new psychological survival horror in which that question is answered, though in a very stressful environment that will push anyone to their limits.\nYou are Jan and Jan and Jan and Jan and, well you get the idea. Jan is a space builder trapped on an alien planet. He wants to get home but to do that he has to survive and restore his ship. It is a job he cannot do alone, but he can create Alters of himself. They are clones but with their own personalities, wants, needs, and stress points. If you don’t manage each individual’s needs or meet their expectations things will get tense, and the Jans will turn on each other. Probably not wise to say something like “Sure, Jan” sarcastically.\nA The Alters demo is available now.\nRevenge of the Savage Planet\nPS5, XSX|S, PS4, XBO, PC – May 2025\nJourney to the Savage Planet was a fun time, pitting players on a hostile world and leaning right into the comedy. Revenge of the Savage Planet looks like it will continue right in that vein, but with one major change to the gameplay. Where Journey was a first person title, Revenge of the Savage Planet will be in third person.\nRevenge of the Savage Planet looks colourful and chaotic, but with plenty of danger to watch out for. You will need to shoot, scavenge, and upgrade to survive after being abandoned by Alta Interglobal. Interestingly, there is not just one savage planet to learn to survive on. There are four this time around, all enjoyable on your own or in co-op.\nMafia: The Old Country\nPS5, XSX|S, PC – Summer 2025\nThe Mafia series is going back to where it all began, with Mafia: The Old Country tracing its narrative steps back to the early 1900s and before the crime families of Sicily saw their influence spread through the emigration of Italians to the United States.\nYou’ll be cast as Enzo Favara, having to prove their worth to the Cosa Nostra, fighting to survive through the brutal underworld of organised crime. Enzo’s already survived labor in the sulphur mines, and now has a chance (in a twisted way) to find a better life for himself by working for Don Torrisi’s crime family, doing whatever it takes to gain and retain favour along the way.\nThe game looks fantastic from the snippets of action that we’ve seen, and this is absolutely one to keep an eye on in 2025.\nDoom: The Dark Ages\nPS5, XSX|S, PC – 2025\nAnother Bethesda game that’s avoiding Xbox exclusivity, Doom: The Dark Ages is a prequel to the 2016 series reboot, nipping back in time to the last time that the Doom Slayer was out and about for some demon bashing. You’ll go thoroughly medieval on those demons, which will include a mix of very familiar foes from the series as well as some all-new enemies.\nYou’ll be just as powerful as in the last couple of Doom games, but the weaponry in your hand will be just a little bit different. Now you couldn’t do without a Super Shotgun, even if you’re this far back in time, but alongside that you’ll be able to whip out a Flail to knock some heads in, or rev up a throwable chainsaw shield, like it’s some kind of Captain America – Warhammer 40,000 crossover. Oh, and you’ll also get to pilot a giant mech and fly a robot dragon. What’s not to like?\nSubnautica 2\nPC (Early Access) – 2025\nThe original Subnautica and its frigid sequel Subnautica: Below Zero both hold a very special place in the hearts of gamers, gaining an awful lot of success thanks to their popularity with streamers and their unique spin on the survival genre. Subnautica 2 will naturally look to take that to the next level.\nThe biggest change is that this game will have full co-op multiplayer, with teams of up to four players diving in to explore the mysterious underwater ruins, build bases together, and push to the limits of what your equipment will allow as you try to explore this world.\nStarting off in early access, much like its predecessors, Subnautica 2 will still have plenty to sink your teeth into. From day one it will have enough of the narrative to take players to multiple biomes, and there will also be the multiplayer mode for co-op adventuring.\nFable\nXSX|S, PC – 2025\nWe’re putting a bit of trust in Playground Games and Xbox with this one. It’s been years since the formal announcement of Fable in 2020, which had already been long-rumoured to be in the works, and every occasional reappearance at Xbox showcases has been heavily reliant on lusciously produced cinematics and an understated British sense of humour, rather than gameplay. Still, Fable is supposedly on track for release in 2025.\nTo be charitable, the most recent trailer from last June does state that it’s “in-game footage” and shift between clips that could be representative of in-game dialogue scenes and wandering through the environments, building up to some quick shots of combat. It does look very, very pretty, as the baton is passed from the now retired hero Humphry to a new hero.\nOne we want to see much, much more of, and which we’d expect is coming later, rather than sooner. There’s other big first party Xbox games expected before then!\nThe Outer Worlds 2\nPS5, XSX|S, PC – 2025\nThe Outer Worlds 2 has chucked Xbox exclusivity out the airlock, about as ceremoniously as you could yeet yourself into the nearest star in the original. The sequel promises to do all the usual sequelly things with more action, more weapons, more possibilities, and more better graphics.\nThe Outer Worlds 2 will very much follow in the tone and style of the original, but promises to go bigger and broader on pretty much every level. There’s the new colony to explore in Arcadia, which is the home of skip drive technology, and which you explore as a new Earth Directorate agent trying to figure out if it’s responsible for all the big and scary rifts that are threatening the whole galaxy.\nSlay The Spire 2\nPC (Early Access) – 2025\nSlay The Spire 2 has a lot of expectation behind it after the original was received so well. This is a sequel removing itself from any narrative connection to the first game by being set 1000 years later, introducing a new cast of slayers that are equipped with their own cards, as well as new archetypes to master.\nSlay The Spire 2 will change on every run, and you will have to deal with the foes and challenges that are thrown in front of you with the cards you have. You will need to build and rebuild your decks until you have a set that can master some of the tougher challenges ahead. Slay The Spire 2 is planned for Steam Early Access early this year.\nBorderlands 4\nPS5, XSX|S, PC – 2025\nWelcome to the planet Kairos, a world that’s dominated by a ruthless dictator known as the Timekeeper, with an army of synthetic followers known as the Order. You, of course, will play as a Vault Hunter searching for mythical alien treasures in a race against time against the Timekeeper to uncover it.\nYou pretty much know what to expect from Borderlands 4, with the procedurally generated loot pushing you on through each battle and mission, and a humour-filled script that will thankfully tone down the toilet humour of Borderlands 3. We’re yet to really be introduced to the Vault Hunters that will lead this adventure, but the gameplay first look showed an impressive sense of scale and slick snippets of action.\nSleight of Hand\nXSX|S, PC – TBC\nSleight of Hand has one of the best descriptions going for it, with developer RiffRaff Games calling it a third-person card-slinging occult noir stealth sim. What more could you want? You are Lady Luck, an occult detective and former witch, who is taking on one last job. A job that has her meeting her past head on as she is tasked with going to Steeple City and bringing down her former coven.\nThe card slinging element comes from one of the core game mechanics, which are Lady Luck’s cards. She has cards imbued with magical abilities that can be used for all sorts, like creating a smokescreen, use smoke based attacks, and set traps. There will be different cards to use, allowing you to customise your deck which in turn determines your playstyle? Will you favour stealth cards or more attack based cards. Sleight of Hand is coming to PC and Xbox Series X|S, and will be on Xbox Game Pass.\nSplitgate 2\nPS5, XSX|S, PS4, XBO, PC – 2025\nOne of the biggest surprises of 2021 was Splitgate, an indie arena shooter that immediately drew in millions of players with its blend of Halo-like multiplayer and Portal-like teleportation devices. But 1047 Studios just couldn’t keep up with the demands of building out this live service, eventually deciding to go dark and rebuild the game from scratch. That game is now Splitgate 2.\nThis is a big reboot that, while it retains the distinctive portal-based fragging and colourful arena shooter style has now adopted more modern trends with more abilities, power ups and character classes. It’s a deliberate push to court the competitive gamer scene, beyond how the original did.\nElden Ring Nightreign\nPS5, XSX|S, PS4, XBO, PC – 2025\nFromSoftware aren’t making an Elden Ring 2, but they are working on a spin-off from their smash hit. Elden Ring Nightreign is a more specifically co-op game than before, mixing up the visual style, combat and general setting of Elden Ring with a new format.\nWhile you can play Nightreign solo, it’s intended to be played with a group of three, working together across multiple in-game days to prepare for a final boss. There’s a little dash of battle royale thrown into this as well, with the playable area shrinking after players defeat a minor boss at the end of each day, limiting the second and third day as you get closer to that final encounter. An interesting twist on proceedings.\nMetal Gear Solid Delta: Snake Eater\nPS5, XSX|S, PC – 2025\nThe early 2000s and PS2 era is proving to be a fertile source for modern remakes, and Konami is the latest to try to get in on the action with Metal Gear Solid Delta: Snake Eater. Having been rumoured for years, this MGS3 remake was confirmed back in 2023, with 2024 giving us a couple of additional glimpses of cutscenes and story, and the game tentatively expected this year.\nVery little is really known about the remake, how much the gameplay is being tweaked and modernised, but you can see from the cutscene-heavy trailers that the game does look pretty fab with Unreal Engine 5 powering it, and they’ve kept a lot of that Kojima tone.\nThe PC Master Race has got a lot to look forward to this year, wouldn’t you agree?",
  "word_count": 4737,
  "scraped_at": "2026-02-14T13:41:59.095802"
}