{
  "article_id": "65d509e6e004",
  "url": "https://www.newcastleherald.com.au/story/8841542/newcastle-jets-fixture-woes-amid-poor-pitch-conditions/?cs=305",
  "title": "Newcastle Jet fixture woes amid poor pitch conditions | Newcastle Herald",
  "date": "20241209T061500Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Newcastle Jets are facing a fourth fixture change in six rounds due to poor grounds as they look to quickly move on from an underwhelming 2-0 loss to Adelaide in Adelaide on Sunday night.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Jets had their first two home games of the 2024-25 A-League Women's season shifted from an unplayable surface at No.2 Sportsground to Cessnock and Maitland.\nThe Cessnock surface consequently came under fire after it was under-prepared for the last-minute switch and also not in great condition.\nThe competition's Unite Round (November 22 to 24) was then moved from Leichhardt Oval to Kogarah's Netstrata Jubilee Stadium because of substandard pitch conditions.\nThe Jets' round-six showdown with defending champions Sydney FC was also scheduled for Leichhardt Oval but on Sunday but is expected to be moved to Allianz Stadium in Moore Park on Saturday night and played as the second match of a Sydney FC double-header. The Sky Blues men host Western United at 5pm.\n\"It looks like our game is going to change and we're Saturday night now, not Sunday,\" Jets coach Ryan Campbell told the Newcastle Herald after the Adelaide loss on Sunday night.\nProfessional Footballers Australia, the sport's players union, said in November poor pitches would give players more reasons to leave the A-League Women.\nWhile yet to be confirmed, another rescheduling would mean the Jets, who are ninth on five points after a win, two draws and two losses, faced a shorter six-day turnaround before taking on an equally desperate Sydney FC.\nThe Sky Blues are 10th on four points after one win, one draw and three losses in their first five outings.\nCampbell was frustrated the Jets had nothing to show for the bulk of possession and good field position in Adelaide on Sunday night.\nNewcastle had far more shots than the Reds, who scored through Fiona Worts with a goalmouth scramble in the 44th minute then on the counter-attack in the 63rd minute, but only a handful were on target.\nThey lacked a cutting edge or were denied by Adelaide shot-stopper Claudia Jenkins with the chances that were hitting the mark.\n\"We did more than enough to win the game,\" Campbell said.\n\"A lot of chances. A lot of field position. They had some good chances that they got from our mistakes but there wasn't many periods of the game where it wasn't us attacking.\n\"We've got to get the balance right of dominating the game and actually winning, and we've got to do that pretty quickly.\"\nThe Jets were in a similar position after five rounds last season, when they had started their campaign with one win, one draw and three losses.\nA four-game guest stint from home-grown Matildas star Emily van Egmond helped ignite their season, which ended in a semi-final loss to Melbourne City, as well as the acquisition of Philippines striker Sarina Bolden, who is now playing in Italy.\nThe return of newly capped Matildas centre-back Natasha Prior should provide a boost for the Jets against Sydney.\nThe 26-year-old was unavailable for the Adelaide exchange after another impressive 90-minute performance for the Matildas in Geelong on Saturday night.\nMeanwhile, following on from the Newcastle Herald's series of stories highlighting a wider issue with the state of sportsgrounds in the region, a motion is set to be put before Newcastle council on Tuesday night investigating opportunities for new and upgraded sporting facilities in the city's western suburbs.\nMany grounds across the region were left in poor states following an extremely wet winter, which forced an extraordinary amount of postponed sporting fixtures.\nThe motion notes that City of Newcastle staff and Ward 4 councillors recently met with Wallsend Football Club and Northern NSW Football regarding the need for more facilities in the western suburbs.\nIt also notes that representations have been made by the Jets about the potential to collaborate on new or upgraded sporting facilities in Ward 4 that could involve the construction of all-weather fields.",
  "word_count": 669,
  "scraped_at": "2026-02-14T12:49:03.813412"
}