{
  "article_id": "65f569787311",
  "url": "https://freerepublic.com/tag/*/index?more=4364094",
  "title": "Latest Articles",
  "date": "20260127T011500Z",
  "domain": "freerepublic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Search:\nKeywords\nUsers\nTitles\nYahoo\nHome·\nSettings·\nBreaking ·\nFrontPage ·\nExtended ·\nEditorial ·\nActivism ·\nNews\nPrayer PrayerRequest SCOTUS ProLife BangList Aliens HomosexualAgenda GlobalWarming Corruption Taxes Congress Fraud MediaBias GovtAbuse Tyranny Obama Biden Elections POLLS Debates TRUMP TalkRadio FreeperBookClub HTMLSandbox FReeperEd FReepathon CopyrightList Copyright/DMCA Notice\nMonthly Donors · Dollar-a-Day Donors · 300 Club Donors\nor by or by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\n-\nJUST IN: Controversial Border Patrol Commander Greg Bovino Reassigned Out of Minneapolis\nCNN reported Monday that controversial Border Patrol commander Gregory Bovino will be leaving Minneapolis, where he has been overseeing operations and vehemently defending officers following the shooting death of 37-year-old Alex Pretti. Anderson Cooper broke the news Monday afternoon, saying, “Sources tell CNN that top Border Patrol official Gregory Bovino and some of his agents are expected to leave Minneapolis tomorrow,” before tossing to reporter Priscilla Alvarez. “This really is a major shift in strategy here by the Trump administration,” Alvarez began. “Recall, Gregory Bovino has been a key player in the Trump administration’s immigration crackdown and became, in many... -\nAlex Pretti's killing was recorded on body-camera videos, DHS says\nInvestigators are reviewing body-camera videos from immigration agents in the fatal shooting of Alex Jeffrey Pretti, a Department of Homeland Security spokesperson confirmed to NBC News.Homeland Security investigators have videos recorded by cameras worn by multiple agents, department spokeswoman Tricia McLaughlin said. -\nJan. 25 Update on PJM Cold Weather Operations\nPJM has issued precautionary alerts and continues to operate through the wide arctic system that is bringing extreme cold temperatures, ice and snow through next weekend to the region PJM serves, spanning 13 states and the District of Columbia. Between Jan. 23 and 27, and possibly extending through Jan. 30, temperatures are expected to reach single digits throughout the RTO and below zero in PJM’s Western Region. Peak demand has the potential to exceed 130,000 MW for seven straight days, a winter streak that PJM has never experienced. U.S. Department of Energy OrderThe order allows PJM to run all electric... -\nIs It Time to Offer Spain's Jews Asylum?\nPresident Donald Trump’s personal lawyer made headlines last week when he floated the possibility of the administration granting asylum to Jews in the UK. While there are many other European countries where Jews increasingly feel unsafe, Spain, the site of a disturbing antisemitic attack on Jewish graves this weekend, should be at the top of the list. The Times of Israel reported that Trump’s lawyer, Robert Garson, a Jew from England, got the asylum idea after the 2025 Manchester synagogue terror attack. “I thought: Jews are being persecuted in the United Kingdom,” Garson said. An antisemitic act that is a... -\nMass deportations is a winning issue politically. Even CNN admits it.\nMass deportations is a winning issue politically. Even CNN admits it. Majorities between 55% to 64% want ALL illegals deported. No exceptions. 55% was less legal immigration also. There is ZERO reason to back down. Full speed ahead on deportations. And cancel legal pathways also. -\nPatel: Funders of Minneapolis Protests Identified by FBI\nFBI Director Kash Patel said Monday the bureau has identified people and groups who are funding leftist protests aimed at Immigration and Customs Enforcement officers in Minnesota. During an appearance on conservative commentator Benny Johnson's podcast, Patel confirmed that the FBI's investigation into the unrest is active and expanding. \"We've got … investigations ongoing into the funding of this,\" Patel told Johnson, stressing that the protests are \"not happening organically\" and that investigators have made \"substantial progress\" in uncovering groups and individuals financially backing them. Patel also asserted that federal authorities are examining encrypted left-wing chats connected to protest organizers... -\nAstronomy Picture of the Day - NGC 55: A Galaxy of Nebulas\nExplanation: Can you see nebulas in other galaxies? Yes, some nebulas shine brightly enough -- if you know how to look. Clouds of hydrogen and oxygen emit light at very specific colors, and by isolating them, astronomers and astrophotographers can reveal structures that would otherwise be too faint to notice. This deep, 50-hour exposure highlights glowing hydrogen (red) and oxygen (blue) across galaxy NGC 55, viewed nearly edge-on. Also known as the String of Pearls Galaxy, NGC 55 is often compared to our Milky Way's satellite galaxy the Large Magellanic Cloud (LMC), although NGC 55 lies much farther away at... -\n[Catholic Caucus] Chicago Cardinal Escalates Against Roman Rite: \"There Must Be Only One Rite\"\n[Catholic Caucus] Chicago Cardinal Escalates Against Roman Rite: \"There Must Be Only One Rite\"Ongoing reform is central to the liturgy because it has cultural elements that change over time and across places, pro-homosexual Cardinal Blase Cupich of Chicago - an ardent enemy of the Roman Rite and a good friend of Leo XIV - wrote on ChicagoCatholic.com (January 21).He repeated the historical misrepresentations which Cardinal Arthur Roche used at the January 7–8 consistory to polemise against the Mass of all ages.For Cupich, “with the passage of time and changes in the culture, there is always a need to reform the... -\nEx-Vikings Captain Says Minn. Dems Hate ICE Because ‘We’re Deporting Their Voters’\nFormer Minnesota Vikings captain and University of Minnesota football star Jack Brewer has accused Minneapolis authorities of protecting illegal migrant “thugs” in the city, and said Democrats in the state only opposed ICE’s actions because the agency was “deporting” their supporters. “There is something wrong in Minneapolis. We need a city-wide behavioral health assessment. People have completely lost reality,” the former Golden Gophers defensive back told Fox News Digital. “I hope President Trump sends in the National Guard. We need curfews. We need real consequences for attacking law enforcement. These men and women should be able to do their jobs... -\nCardinal Tobin: Pray, mourn and say 'no' to ICE funding\nCardinal Tobin: Pray, mourn and say 'no' to ICE fundingA high-ranking Catholic leader is ratcheting up criticism of the Trump administration's immigration crackdown and urging people of faith to be more vocal in calling out injustice.Responding to a sense of helplessness many people are feeling in the wake of violence at the hands of federal immigration officials, Cardinal Joseph Tobin of Newark, New Jersey, urged people of faith not to shy away from the news and to use their voices to say, \"No.\"In a reflection delivered Jan. 26 during an online interfaith prayer service hosted by Faith in Action, Tobin... -\nGreg Abbott says ICE needs to 'recalibrate' mission after deadly Minnesota shooting\nGov. Greg Abbott on Monday said the White House needs to “recalibrate” Immigration and Customs Enforcement's mission to rebuild public trust after immigration agents shot and killed a second protester in Minnesota over the weekend. Abbott said immigration officials should “get back to what they wanted to do to begin with — and that is to remove people from the country who are here illegally.” “In general, we need to have respect for law enforcement officers in the country. ICE, they are law enforcement officers,” the Texas Republican said on conservative radio host Mark Davis’ show Monday morning. “So they,... -\nChina Is Facing a Demographic Bomb— and it Could Handcuff Beijing’s Ambitions\nLast week, Beijing’s release of China’s national birth count for 2025 left demographers stunned. The national birth total plummeted by over 17% from 2024 to 2025, the PRC disclosed. That sort of precipitous drop is almost never seen in stable modern societies, where births tend to inch up or down from one year to the next. A decline of this magnitude qualifies as a demographic shock of the sort typically associated with dire calamities like famine or plague — a sign that a disaster or convulsion is taking place. And these are only the latest readings from the astonishing birth... -\nPolitico's Red Hot Trump Hate Illustrated by ALL Their Featured Magazine Stories\nFew things better illustrate the laughably absurd levels of Trump Derangement Syndrome that has infected Politico than the accompanying screenshot (as of this writing) of three Politico magazine stories featured on the front page of that biased periodical.The screenshot reveals a trifecta of magazine stories reflecting negatively on President Donald Trump, \"Trump’s Greenland Gambit Has Broken Brains Across Washington,\" \"Europe Could Kick Trump Where It Hurts: The World Cup,\" and \"‘They Have This Combination of Grandiosity, Narcissism and Sociopathy’.\"You don't have to go much further beyond the title of the first Politico Magazine story to see it is the work... -\nDespite Trump’s efforts, airline DEI programs are still risking people’s lives\nThree million Americans will board a plane today assuming the pilot earned that seat through merit. They shouldn’t. For decades, airlines have subordinated safety to diversity quotas. President Donald Trump rightly recognized this danger: Early on, he ordered the Federal Aviation Administration and Department of Transportation to rescind all DEI initiatives and return to merit-based hiring and promotions. But the FAA can, and must, do more. Federal law makes it illegal to run an airline “without an air carrier operating certificate. These certificates must “contain terms necessary to ensure safety” and can be revoked if the “public interest” requires it.... -\nA Domestic Insurgency Has Erupted – President Trump Sending Tom Homan to Minneapolis\nThe violence in Minneapolis erupted when the scale of financial fraud was discovered. The administration of President Trump has begun to highlight this non-pretending reality. On the surface it seems like ICE enforcement is the issue; however, in reality Governor Tim Walz and Mayor Jacob Frey have been leading a criminal syndicate, with the entire region engaged in money laundering and financial fraud. State political leadership are involved. The local Minneapolis police are involved; the Minneapolis municipal leaders are involved; a large and dedicated segment of the migrant population is involved; corrupt judges and officers of the courts are involved;... -\nAmericans Are Strapping Passports to Their Heads Over Fears of ICE (LOL)\nAmericans are sharing videos on social media with their passports strapped to their heads in response to growing concerns over Immigration and Customs Enforcement (ICE) operations. In viral videos, social media creators have said they are wearing the documents this way to ensure they have proof of American citizenship before they are asked for it, with one TikTok creator saying in a video: \"You cannot be too careful, you gotta move with purpose now.\" A Department of Homeland Security (DHS) spokesperson said in an email shared with Newsweek: \"REAL IDs are not immigration documents—they make identification harder to forge, thwarting... -\nDanish Rule Over Greenland Has Its Dark Side [semi-satire]\nThe notion that Greenland's population likes being governed by Denmark may not be correct. Native Greenlander Amarok Petersen was 27 years old when she learned that the reason she cannot have children. Danish doctors had implanted an IUD birth control device in her body it when she was 13 as part of a population control program for thousands of native Greenlandic girls and women. \"I will never have children,\" Petersen complained. \"That choice was taken from me.\" Prime Minister of Denmark Mette Frederiksen, impatiently pointed out, \"we have already officially apologized for the decades of forced sterilization of indigenous women... -\nJust How Easy Is It To Rip Off The Federal Gov’t?\nSome of us are old enough to remember Matthew Lesko, the lanky, fast-talking late-night TV pitchman who promised people free government money to those who bought his books. There are, Lesko said in one of his countless ads decades ago, “15,000 programs you can use to get a better job, get an education, or start your own business. Those who know about the programs are the ones who get the money!” Lesko was right about how easy it is to get taxpayer money. What Lesko didn’t say is that it’s easy to do even when it violates the law —... -\nRepublican Chris Madel exits Minnesota governor's race, calls federal \"retribution\" on state unconstitutional\nRepublican Chris Madel is ending his campaign for governor of Minnesota, saying that he cannot support the national members of his party and their \"retribution on the citizens of our state.\" Madel said he supported the original stated purpose of Operation Metro Surge — to detain the \"worst of the worst\" migrants who are in the country illegally — but said the operation has \"expanded far beyond its stated focus on true public safety threats.\" His decision comes two days after a Border Patrol agent shot and killed Alex Pretti, a 37-year-old U.S. citizen and ICU nurse. It was the... -\nVIDEO: Did Cam Higby's Signal Chat Infiltration EXPOSE MN Lt. Governor as Ringleader?\nVIDEOIs the Lt. Governor of Minnesota, the hijab wearing Peggy Flanagan, one of the ringleaders of the insurrection in Minneapolis? Signal Chat information released by Cam Higby indicates that Flanagan might be one of the signal administrators in the organized effort to impede ICE in their work. Hopefully an investigation into this matter will resolve whether or not she is guilty of insurrectionist activities. Keep in mind that Flanagan is currently a candidate for U.S. Senator from the Somali flag state of Minnesota.\nBrowse by Forum\nGet Connected! Join Free Republic Today!\nAlready a Member? Log into your Free Republic account.\nBreaking News (News/Activism)\n- Dear FRiends, our FReepathon has fallen way behind. Please get your donations in as soon as you can. Thank you and God bless.\n- Sunday Morning Talk Show Thread 8 February 2026\n- The MAGA/America 1st Memorandum ~~ February 2026 Edition\n- Senate strikes deal to avert partial shutdown\n- US Border agents shoot two people in Portland, city officials say\n- Minnesota Gov Tim Walz to suspend re-election campaign amid Somali fraud scandal: report\n- One in custody after incident at Ohio home of JD Vance\n- Caracas, VenezuelaJanuary 3, 2026 6:30 AMUpdated: January 3, 2026 1:12 PMU.S. captures Venezuela's leader and his wife in a stunning operation and plans to prosecute them\n- President Trump says Maduro and his wife have been captured. A news conference will be held at 11 A.M\n- The MAGA/America 1st Memorandum ~~ January 2026 Edition\n- More ...\nFront Page News (News/Activism)\n- 'You exposed him to real danger': Father goes nuclear on school board after teachers sent his son to ICE protest\n- House passes SAVE America Act, sending Trump-backed election bill to the Senate\n- Trump set to gut US climate change policy and environmental regulations: White House official\n- Less than 14% of those arrested by ICE in Trump's 1st year back in office had violent criminal records, document shows\n- Lawler: ‘Not Realistic’ to Kick Out Over 25 Million Undocumented People\n- Fact Sheet: President Donald J. Trump Ensures Affordable Beef for the American Consumer\n- Democrats fear body cameras could be ICE’s new mass surveillance tool\n- Migrant, 70, who told girl, 12, to 'cover her head' before sexually assaulting her on way home from school is spared jail\n- Associated Press Complains That Winter Olympics Teams Are ‘Overwhelmingly White’\n- Appeals court sides with Trump admin with mass detention ruling\n- More ...",
  "word_count": 2515,
  "scraped_at": "2026-02-14T12:38:38.239791"
}