{
  "article_id": "66120d8ee994",
  "url": "https://www.dailypress.com/2025/08/29/numerous-local-players-make-nfl-practice-squads/",
  "title": "Numerous local players make NFL practice squads",
  "date": "20250829T051500Z",
  "domain": "dailypress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NFL\nPractice squads include area players\nNFL practice squads are taking shape after Tuesday’s cut to 53-man active rosters, and those practice squads will include a host of players with local connections.\nWashington defensive end Jalyn Holmes, from Lake Taylor High and Ohio State, was released Tuesday but was signed to the Commanders’ practice squad Thursday.\nRookie linebacker Antwaun Powell-Ryland, who played for Norcom and Indian River before heading to the Florida Gators and Virginia Tech, was waived Tuesday by Philadelphia but signed to the Eagles’ practice squad.\nRookie cornerback LaMareon James, who was waived Tuesday by Cleveland, was signed to the Browns’ practice squad. He played for Indian River, Old Dominion and TCU).\nFormer Nansemond-Suffolk Academy and Army linebacker Cole Christiansen, released Tuesday by Kansas City, signed to the Chiefs’ practice squad Thursday.\nFormer Old Dominion long snapper Rick Lovato, an NFL veteran, signed Thursday to the Los Angeles Chargers’ practice squad.\nMeanwhile, the Pittsburgh Steelers re-signed defensive back Chuck Clark to their active roster after releasing him Tuesday. He starred for King’s Fork High and Virginia Tech before playing for the Baltimore Ravens and New York Jets.\nCOLLEGE FOOTBALL\nMonumental to carry 6 Hampton games\nSix Hampton football games this season will be aired on the Monumental Sports Network. The Pirates’ Aug. 30 opener at Jackson State will air via tape at noon Sunday.\nThe remaining five Hampton games will be aired live, with the Nov. 8 game against Maine on MNMT2. The contests on the main MNMT channel will be at Armstrong Stadium: 6 p.m. Sept. 6 vs. Elizabeth City State, 4 p.m. Oct. 4 against Norfolk State, 2 p.m. Oct. 25 against Monmouth and 1 p.m. Nov. 15 versus William & Mary.\nCOLLEGE MEN’S BASKETBALL\nTribe releases non-CAA schedule\nWilliam & Mary released a nonconference schedule with just four home games at Kaplan Arena: the Nov. 3 opener against Georgian Court, Nov. 21 versus Regent, Nov. 30 against Old Dominion and Dec. 18 versus Radford.\nThe Tribe’s first three road games should draw attention: Nov. 8 at Norfolk State, Nov. 11 at Richmond and Nov. 15 at St. John’s, coached by Rick Pitino. …\nJames Madison’s nonconference slate includes a Dec. 29 trip to Arkansas, which advanced to the Sweet 16 under the direction of John Calipari. He is one of JMU coach Preston Spradlin’s mentors; they worked together at Kentucky.\nCOLLEGE WOMEN’S BASKETBALL\nLongtime Liberty coach retires\nThe winningest coach in Liberty athletics history, Carey Green, announced his retirement. Longtime assistant coach Alexis Sherard will take over as the head coach.\nGreen spent 26 seasons as Liberty’s head coach, racking up 31 conference titles (15 regular-season, 16 tournament). He coached the Flames to 15 NCAA Tournament appearances, headlined by a trip to the Sweet 16 in 2005, and four WNITs.\nPRO BASKETBALL\nFormer Tribe guard Case to play in Portugal\nRecent William & Mary graduate Matteus Case signed a contract with Vitória SC in Portugal.\nCase was a fixture with the Tribe over his three seasons. The guard started 31 of his 90 appearances and averaged 6.6 points, 3.2 rebounds and 1.5 assists per game. As a senior, he averaged 8.2 points, 2.5 rebounds and 2.0 assists.\nTENNIS\nEx-ODU star, partner fall in Open doubles\nFormer Old Dominion standout Yuliia Starodubtseva played women’s doubles at the U.S. Open, but she and partner Oksana Kalashnikova, from the Republic of Georgia, lost 6-3, 3-6, 6-3 in the first round to Norway’s Ulrikke Eikeri and Japan’s Eri Hozumi.\nStarodubtseva, a 25-year-old Ukrainian who was a two-time Conference USA Player of the Year for the Monarchs, fell 6-3, 6-1 in the singles first round Sunday to Russia’s Anna Blinkova.\nCOLLEGE FOOTBALL\nJMU-Liberty tickets selling well\nLiberty said public single-game tickets for its 6 p.m. Sept. 20 home game against James Madison have sold out.\nCOLLEGE CROSS COUNTRY\nArea runners cited by Conference Carolinas\nAlexis Denham, a junior from Kecoughtan High in Hampton, was cited as one of Chowan’s three women’s runners to watch in a Conference Carolinas preview. Ferrum freshman Sarah Hudgins, from Norfolk’s Granby High, was cited as one of Ferrum’s three runners to watch.\nChowan was predicted 14th and Ferrum 15th in the 16-team conference.\nOn the men’s side, freshman Carlos Menendez from Portsmouth’s Manor High was named one of Ferrum’s three runners to watch. The Panthers were picked last among the 16 teams.\nCOLLEGE FIELD HOCKEY\nJMU, Liberty players make national list\nJames Madison’s Alice Roeper, last season’s Mid-American Conference Offensive Player of the Year, was one of 195 players from 64 schools named to the National Field Hockey Coaches Association Watchlist. It recognizes players with the strongest potential for consideration to NFHCA All-Region and All-American teams.\nSix Liberty players are on the list: senior Lou Combrinck, sophomore Dara Semmartin, freshman Paris-Gail Isaacs, junior Maite Altamirano, freshman Julieta Tornati and freshman Diane Saint Martin.\nCOLLEGE BASEBALL\nUVA reveals fall schedule\nVirginia will play exhibition games against Georgetown (Sept. 27) and Navy (Oct. 19) this fall at Disharoon Park in Charlottesville, both at 1 p.m. In addition, the Cavaliers will play the annual Fall World Series on Oct. 23-25.",
  "word_count": 852,
  "scraped_at": "2026-02-14T13:42:47.274671"
}