{
  "article_id": "662c2ea0f933",
  "url": "https://www.theguardian.com/fashion/2023/jun/14/armpit-confidential-why-men-are-now-shaving-and-women-are-doing-whatever-they-like",
  "title": "Armpit confidential : why men are now shaving – and women are doing whatever they like",
  "date": "20230614T094500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s an image that will go down in sporting history – or at least linger in many memories. Manchester City midfielder John Stones, crouched down on the pitch, in a torn shirt revealing his bare chest and … a freshly shaved armpit?\nThe ripped shirt was not intentional. It tore during the 80th minute of the Champions League final in Istanbul last Saturday, following an altercation with Inter Milan’s Robin Gosens. Stones’ Puma Ultraweave shirt was obviously not up to the strain. But as the camera lingered on his underarm stubble, Twitter lit up. Discussions crept across chat forums. Are men – some men asked – now shaving their armpits?\nYes, and no. “Men in sports have always shaved their bodies – particularly in swimming and cycling and even athletics. It helps with friction, helps them move faster and is probably slightly more hygienic,” says Rachael Gibson, a hair historian. Even in football, we know Cristiano Ronaldo waxes his body, and we can see from Mo Salah’s polished trunk on Instagram that he does, too, “It’s almost strange that it’s still a talking point”, says Gibson. But for some reason underarm hair has always seemed like the last bastion of “masculinity”. “It’s like, everything else can go, but don’t touch the armpits!”\nAccording to the research firm Mintel’s 2023 UK Shaving and Hair Removal Market report, 55% of UK consumers – so women and men – have removed body hair from their underarms in the previous 12 months. Women tend to bring the average up, with statistics that have barely changed in the past 50 years. An op-ed in the New York Times in 1974 reported that 98% of US women shaved their armpits and legs. Conservative estimates suggest that figure is largely unchanged.\nBut the rate of male hair removal is creeping up. According to Rebecca M Herzig in her 2015 book, Plucked: A History of Hair Removal, about 60% of men remove their body hair. That is quite a loose figure – “hair removal” refers to anything below the neck – but if we fast forward to 2019, a poll of Men’s Health readers found that 68% of men trimmed their armpit hair, 52% for aesthetic reasons and 16% because of sport. Friction, sweating, smell, therapeutic massages, not to mention opponents tugging your hair, all factor here. To those we can add the use of performance wear in professional sports, which includes those natty little crop tops worn by Lionel Messi that measure heart and acceleration rates, and which work better without body hair.\nGibson thinks habits shifted with David Beckham and his so-called metrosexuality. Mintel has a name for how this has evolved – the “skinification” of grooming products – that is, nice-smelling creams and fancy gadgets (the Mangroomer and the Razorba both have extendable handles for body trimming) to rival most beauty products. Some men – not Stones, who had most likely shaved – are even getting lasered. Lisa Mason-Poyner, the group director at Élan Laser Clinics, has seen an “explosion in popularity” comparable to that of women’s hair removal in the 90s, with no body part off-limits – though she says areas such as the buttocks and pubic areas might need a little building up to in terms of pain.\nWomen’s armpits, however, are a different matter. Gibson thinks that while we’re more relaxed about body image (something she puts down to the pandemic), not-shaving has become even more loaded. Today, it’s sometimes as much about demonstrating you have a carefree mindset as it is about being carefree.\n“Some women just don’t shave and that’s that,” she says. “The most important thing is choice.” But fashion marketing, for one, has taken note. In 2021, Adidas used photos of the dancer Leila Davis with hairy armpits; last year, Asos used a woman with visible armpit hair to model a tank top. Another shift has seen beauty brands, such as Billie, showing the very body hair they want you to remove using their products.\nDuring the 1960s, along with blue jeans and a little light drug use, women’s hairy underarms were markers of political consciousness and female liberation. They still make a statement. In 1985, Madonna posed for Playboy with hairy armpits. In 1999, Julia Roberts didn’t shave for the premiere of Notting Hill (she later said she “forgot”). On her Instagram account, Girls actor Jemima Kirke often shows an unshaved armpit.\nBut this will always be a thorny subject, says Gibson. “We have this idea that body hair removal is a new concept but it’s far older than we can imagine,” she says. Native Americans used a pinch, or a tweezer-like instrument, made from shells, to remove body hair. Other cultures used rocks. Equally unchanged is the culture around suffering for your hair removal. “Egyptians used a quicklime mixture which burned and probably really hurt,” she says. There are myriad factors as to why each culture removed their hair, but many were motivated by practicality. “Egyptians shaved their heads and wore wigs. Why? Lice, mainly. It was just cleaner.”\nStones was not wearing a performance crop top, and judging by the likely use of a shaver, it was probably a last-minute changing-room decision. But with temperatures creeping above 30C in Istanbul, he probably did it because of the heat. “In fact, it’s likely the whole team did,” says Gibson. “We just didn’t see their armpits.”",
  "word_count": 899,
  "scraped_at": "2026-02-14T12:45:48.457746"
}