{
  "article_id": "66600382e1e1",
  "url": "https://www.amny.com/entertainment/music/fall-music-releases-pop-country-hip-hop/",
  "title": "Fall music releases : Pop powerhouses , country classics , hip - hop heavyweights and beyond",
  "date": "20230909T144500Z",
  "domain": "amny.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Close\nNews, events, culture and more — delivered to you.\nThank you for subscribing!\nMarch 7, 11 am\nClose\nNews, events, culture and more — delivered to you.\nThank you for subscribing!\n- Bronx Zoo’s ‘Name a Roach’ returns for Valentine’s Day\n- Chopped Cheese undergoes ‘culinary explosion’ as NYC chefs reinvent the classic sandwich\n- ‘Standing on the shoulders of legends’: Harlem Globetrotters bring 100 year tour to Barclays Center\n- Things to do this weekend in NYC, Feb. 13-15\n- Things to do this weekend with the kids in New York\n- ‘Standing on the shoulders of legends’: Harlem Globetrotters bring 100 year tour to Barclays Center\n- 2026 Winter Olympics: Team USA hockey cruises past Latvia 5-1 in opener behind 2 Brock Nelson goals\n- Knicks signing Jeremy Sochan after being waived by Spurs\n- Islanders’ Bo Horvat scores in Canada’s 5-0 thrashing of Czechia\n- Mets notes: Clay Holmes already at 3 ups, 46 pitches; Bo Bichette’s transition to 3rd\n- Queens man shot by NYPD during mental health crisis indicted on assault charge\n- Woman found dead in Brooklyn NYCHA building likely crushed in accidental garbage chute fall, police say\n- Gunman behind fatal Bronx subway platform shooting fled to his apartment covered in blood and begged for girlfriend to order him a cab: cops\n- Manhattan muggers viciously beat victims with baseball bat and gun in separate street robberies: cops\n- Executed in the Bronx: Man shot dead in parked car in borough’s third deadly shooting this week",
  "word_count": 254,
  "scraped_at": "2026-02-14T13:37:16.591272"
}