{
  "article_id": "668237efccf1",
  "url": "https://freerepublic.com/tag/*/index?more=4356865",
  "title": "Latest Articles",
  "date": "20251211T080000Z",
  "domain": "freerepublic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Search:\nKeywords\nUsers\nTitles\nYahoo\nHome·\nSettings·\nBreaking ·\nFrontPage ·\nExtended ·\nEditorial ·\nActivism ·\nNews\nPrayer PrayerRequest SCOTUS ProLife BangList Aliens HomosexualAgenda GlobalWarming Corruption Taxes Congress Fraud MediaBias GovtAbuse Tyranny Obama Biden Elections POLLS Debates TRUMP TalkRadio FreeperBookClub HTMLSandbox FReeperEd FReepathon CopyrightList Copyright/DMCA Notice\nMonthly Donors · Dollar-a-Day Donors · 300 Club Donors\nor by or by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\n-\nSupplement trio shows promise in reversing autism-linked behaviors in mice (Zinc, serine, & BCAAs)\nResearchers report that a low-dose mixture of zinc, serine, and branch-chain amino acids can alleviate behavioral deficits in three different mouse models of autism. The study shows that when combined together, these three dietary supplements promote communication between neurons in the brain and improve social behaviors. Autism spectrum disorder (ASD) is known to result from abnormal neural development that affects how neurons are connected. Individually, zinc, serine, and branch-chain amino acids are all thought to have positive effects on neural connectivity. The authors hypothesized that a mixture of the three would be a more effective treatment than any individually and... -\n2028 U.S Presidential Election Odds Per @Kalshi\nJD Vance the favorite to win the 2028 presidential election, Donald Trump in 3rd 2028 U.S Presidential Election Odds Per @Kalshi 🔴 JD Vance: 30% 🔵 Newsom: 21% 🔴 Trump: 6% 🔵 AOC: 5% 🔴 Rubio: 5% 🔵 Harris: 4% -\nGolden Globe 2026 nominations: Full list of nominees announced ahead of January awards ceremony\nThe nominations for the 2026 Golden Globes are out, and One Battle After Another led the pack for what’s widely considered the kickoff to Hollywood’s awards season. The Paul Thomas Anderson film got nine nominations, including Best Picture, Best Director and Best Actor, followed by Sentimental Value with eight, Sinners with seven, Hamnet with six, and Frankenstein and Wicked: For Good with five each. On the television side, The White Lotus led with six nominations — including first-time nominees Carrie Coon, Aimee Lou Wood and Walton Goggins — followed by Adolescence with five, and Only Murders in the Building and... -\nGolden Globes nominates woke liberals for inaugural 'best podcast' award - while leaving out Joe Rogan and Megyn Kelly\nThe Golden Globes has snubbed popular right-leaning podcasters out of a nomination in its inaugural best podcast category. Leading up to its 83rd annual ceremony, the Golden Globes announced back in May that they would unveil the first ever podcast category. Since then, speculation about the potential nominees circulated, with right-wing host Ben Shapiro going as far as campaigning. In November, Shapiro plastered billboards in Times Square with ads that said 'For Your Golden Globes Consideration.' But the six nominees have sparked controversy across social media, leaving people questioning why the biggest MAGA firebrand podcasters have been left out. The... -\nMelania Trump Launches Her Own Film Production Company — What We Know\nThe first lady is coming for Hollywood. Melania Trump has announced her own production company, Muse Films, on social media. In a short clip on X, Melania, 55, revealed the firm’s logo as well as the release date of her new movie. The title of Melania’s new company perhaps calls back to her code name used by the Secret Service in her husband’s first term as U.S. president. Brett Ratner is directing the documentary, which will give audiences an exclusive look behind the scenes at Melania’s life in the weeks before the 2025 presidential inauguration, TMZ reports. Donald Trump is... -\nMaine whistleblower alleges Minnesota-like fraud in state’s Medicaid program\n(NewsNation) — Taxpayers in Maine have been bilked out of millions of dollars from the state’s Medicaid program, according to a whistleblower who in an interview with NewsNation likened the case to a burgeoning scandal in Minnesota, where people in the Somali community are accused of defrauding taxpayers of $1 billion meant for social services. The whistleblower, Christopher Bernardini, describes himself as a former “billing guru” of Gateway Community Services — a health services contractor that he says defrauded Maine’s Medicaid program. Bernardini worked for Gateway from May 2018 until April 2025 as a program coordinator. Bernardini alleges that Gateway... -\nMichigan marijuana businesses brace for 24% tax on Jan. 1 [2:21]\nThis week, a judge ruled Michigan’s new 24% wholesale marijuana excise tax can go into effect on Jan. 1. (Dec. 10, 2025) Michigan marijuana businesses brace for 24% tax on Jan. 1 | 2:21 WOOD TV8 | 261K subscribers | 1,181 views | December 10, 2025 -\nIran and Egypt - where homosexuality is illegal - complain to FIFA over World Cup 'Pride Match', as diplomatic row with Muslim nations intensifies\nIran and Egypt have complained to FIFA after Seattle designated their World Cup game as a ‘Pride Match’. The fixture, between two countries in which homosexuality is outlawed, is meant to honour the LGBTQ+ community in the liberal city and the clash was pencilled in before it was known which sides would be involved. Due to take place on June 26, it coincides with Seattle’s Pride Weekend. However, the federations of each Muslim country have now contacted FIFA to express their opposition, in what is a growing, diplomatic incident more than six months out from tournament kick-off. Iranian Football Federation... -\nTop secret war document reveals China would crush the US and 'destroy' the world's largest aircraft carrier\nThe United States would suffer a devasting defeat and lose its biggest aircraft carrier if it tried to stop China invading Taiwan, according to a top secret Pentagon report. War games showed the U.S. would be overwhelmed by China's arsenal of around 600 hypersonic weapons, along with missiles and nuclear submarines. The grim assessment, revealed by the New York Times, confirmed the conclusions of previous war games, but it also highlighted wider concerns about the future direction of the U.S. military and its continued reliance on outdated methods. *** Ships like the $13 billion USS Gerald R. Ford - the... -\nIntel pursued deals that boosted CEO Lip-Bu Tan's fortune, sources say\nWhen the chairman of AI chip startup Rivos wanted Intel to bid for the company, he had no need to phone the chip giant. That’s because the chairman of Rivos was also Intel’s CEO: Lip-Bu Tan. Reuters was unable to determine how much the Intel CEO profited personally as a Rivos shareholder because the financials are not public. But in a blog post on its website, Tan’s venture-capital firm, Walden Catalyst, touted how he had delivered a “successful outcome” for its investors and congratulated the Rivos team for their “remarkable achievement.” The events show one of at least three instances... -\n'It is the most exciting discovery in my 40-year career': Archaeologists uncover evidence that Neanderthals made fire 400,000 years ago in England\nArchaeologists have found the earliest evidence yet of fire technology — and it was created by Neanderthals in England more than 400,000 years ago. Neanderthals were the world's first innovators of fire technology, tiny specks of evidence in England suggest. Flecks of pyrite found at a more than 400,000-year-old archaeological site in Suffolk, in eastern England, push back archaeologists' evidence for controlled fire-making and suggest that key human brain developments began far earlier than previously thought. \"We're a species who've used fire to really shape the world around us,\" study co-author Rob Davis, a Paleolithic archaeologist at the British Museum,... -\nFReeper Canteen ~ Remembering Our Troops ~ 11 December 2025\n~ The FReeper Canteen Presents ~ ~ Remembering Our Troops!! ~ My Daddy Is Home!! In this courtesy photo, Steve Nielsen gives his daughter Kaylee Nielsen a ride upon his shoulders while celebrating his unit’s return to Nevada from Afghanistan. Nielsen was in the heart of a combat zone for more than one year while deployed as a Chinook helicopter pilot in Afghanistan. (Photo by Sgt. 1st Class Erick Studenicka) Canteen Mission StatementShowing support and boosting the morale ofour military and our allies' militaryand family members of the above.Honoring those who have served before. Congratulations On A Job Well... -\nIs Trump’s stark new security strategy the end of the liberal world order? Europeans will need convincing\nU.S. President Donald Trump’s new national security strategy appears to blow up some of the key principles behind 80 years of European collective defence, challenging the foundation of the continent’s relationship with the country. But on whether the White House will — or even can — follow through on many of its more radical or transformative demands, many European capitals will likely need more convincing. In a blistering attack, Trump’s new policy portrays Europe’s governments as weak and ineffective. Migration has destroyed the continent’s self-confidence, it claims, accusing the European Union of contributing to a loss of national sovereignty, weakened... -\nDisguised and in danger: How a Nobel Peace Prize winner escaped Venezuela\n“The Venezuelan opposition leader was trying to get to Norway by Wednesday in time to receive the Nobel Peace Prize that she won for challenging Venezuela’s authoritarian leader, Nicolás Maduro. First she had to get from the Caracas suburb where she has been in hiding for a year to a coastal fishing village, where a skiff awaited her.” -\nFormer Chargers CB Quentin Jammer Says He Played a Number of Games Drunk During 2011 Season\nJammer made a shocking admission on social media this weekFormer San Diego Chargers cornerback Quentin Jammer raised some eyebrows on Monday, when he took to social media to reveal that he played a number of games during the 2011 season while under the influence of alcohol. \"True story……. In 2011 I played completely **** faced drunk in at least 8 games,\" Jammer wrote. Jammer said that football players deal with real-life issues just like everyone else, no matter how much money you make or how famous you are. He also lamented the fact that his public revelation was shocking... -\nMichigan fires Sherrone Moore for cause amid 'inappropriate relationship' with staff member\nThe Wolverines will undergo their second coaching change in three years, releasing Moore after eight years with the organization, including two as head coachMichigan fired coach Sherrone Moore for cause at the conclusion of his second season leading the Wolverines football program. Athletic director Warde Manuel said Wednesday the termination was the result of an inappropriate relationship between Moore and a staff member. \"Sherrone Moore has been terminated, with cause, effective immediately,\" Manuel said in a statement. \"Following a university investigation, credible evidence was found that Coach Moore engaged in an inappropriate relationship with a staff member. This conduct constitutes... -\n‘Cancelled’ Christmas Song Defended as People Debate ‘Triggering’ Lyrics\nThe 1950s song was briefly taken off the air due to its lyricsChristmas is nearly here and that means old Xmas classics will be blasting on the radio soon. However, will this ‘cancelled’ one make an appearance this year? There has been a slew of controversial festive hits in the last few decades, and mostly, it’s down to changing times and social or political norms. For example, The Pogues and Kirsty MacColl’s1988 ‘Fairytale of New York’ hit is regularly censored as it includes a word which is used as a homophobic slur. There’s also Weird Al Yankovic’s ‘Christmas At... -\nKirk Cameron, Controversy, and the Reality of Hell\nA video clip from Kirk Cameron caused a firestorm over the weekend on social media in which he stated that he no longer believes that hell is a place of eternal conscious torment. He has embraced an alternative view called annihilationism or conditional mortality.Does the Bible teach that hell is indeed a literal place of eternal conscious torment?The parable of the Rich Man and Lazarus clearly teaches some truths about the reality of hell.Luke 16:19–31 “There was a rich man who was clothed in purple and fine linen and who feasted sumptuously every day. And at his gate was laid... -\nWorst Crooked Judge in the World: Crook County Judge Patricia Martin\nI’ve spent my life covering Chicago politics and Chicago political corruption. So, I guess you could say that I’ve seen some things: Many years ago, when I was first starting out in the newspapering business, the vaunted Chicago press corps—the corporate legacy media–was bowing and sniveling before a black “reform” mayor (not named Johnson) for fear of being branded as racists. This was just as the mayor’s top aide wearing a bad wig, collected rent in a city limousine from impoverished women living in his slum buildings full of rats. Or later, when Chicago politicians were terrified into silence when... -\n‘Jingle Bells’ Is Racist, Claims Video Shared by Joy Reid — sparking Christmas Culture War\nFired MSNBC host Joy Reid played Grinch on social media this week, sharing a video claiming beloved Christmas anthem “Jingle Bells” was written “to make fun of black people.” In the video she shared to her 1.3 million Instagram followers, a man in a Christmas sweater and Santa hat stands on the streets of Medford, Massachusetts near a plaque marks the site where James Lord Pierpont is believed to have penned the song in 1850. He takes off his hat disapprovingly and scowls at the plaque, the video caption reading “this is where a racist Confederate soldier wrote ‘Jingle Bells’...\nBrowse by Forum\nGet Connected! Join Free Republic Today!\nAlready a Member? Log into your Free Republic account.\nBreaking News (News/Activism)\n- Dear FRiends, our FReepathon has fallen way behind. Please get your donations in as soon as you can. Thank you and God bless.\n- Sunday Morning Talk Show Thread 8 February 2026\n- The MAGA/America 1st Memorandum ~~ February 2026 Edition\n- Senate strikes deal to avert partial shutdown\n- US Border agents shoot two people in Portland, city officials say\n- Minnesota Gov Tim Walz to suspend re-election campaign amid Somali fraud scandal: report\n- One in custody after incident at Ohio home of JD Vance\n- Caracas, VenezuelaJanuary 3, 2026 6:30 AMUpdated: January 3, 2026 1:12 PMU.S. captures Venezuela's leader and his wife in a stunning operation and plans to prosecute them\n- President Trump says Maduro and his wife have been captured. A news conference will be held at 11 A.M\n- The MAGA/America 1st Memorandum ~~ January 2026 Edition\n- More ...\nFront Page News (News/Activism)\n- 'You exposed him to real danger': Father goes nuclear on school board after teachers sent his son to ICE protest\n- House passes SAVE America Act, sending Trump-backed election bill to the Senate\n- Trump set to gut US climate change policy and environmental regulations: White House official\n- Less than 14% of those arrested by ICE in Trump's 1st year back in office had violent criminal records, document shows\n- Lawler: ‘Not Realistic’ to Kick Out Over 25 Million Undocumented People\n- Fact Sheet: President Donald J. Trump Ensures Affordable Beef for the American Consumer\n- Democrats fear body cameras could be ICE’s new mass surveillance tool\n- Migrant, 70, who told girl, 12, to 'cover her head' before sexually assaulting her on way home from school is spared jail\n- Associated Press Complains That Winter Olympics Teams Are ‘Overwhelmingly White’\n- Appeals court sides with Trump admin with mass detention ruling\n- More ...",
  "word_count": 2533,
  "scraped_at": "2026-02-14T12:12:56.514976"
}