{
  "article_id": "66a64535f898",
  "url": "https://www.nbcnews.com/news/sports/live-blog/premier-league-title-live-updates-rcna152497",
  "title": "Man City wins Premier League title for fourth consecutive year as Arsenal finishes second : Highlights",
  "date": "20240519T220000Z",
  "domain": "nbcnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Man City wins Premier League title for fourth consecutive year as Arsenal finishes second: Highlights\nPhil Foden scored twice to help Man City claim its eighth EPL championship in club history.\nManchester City has put its stamp on history.\nWith a 3-1 win at home against West Ham on Sunday, the club has earned an unprecedented fourth consecutive English Premier League title. It was its sixth championship in the past seven seasons, a feat never accomplished before.\nArsenal, despite its best season since “The Invincibles” went undefeated in 2003–04, fell just two points short in the table. The Gunners (28-5-5) won 2-1 at home against Everton on Sunday.\nPhil Foden, voted EPL Player of the Season earlier this week, notched the first two goals for Manchester City (28-7-3), at the 2nd and 18th minute, respectively.\n“I believe in scoring a bit too early,” said Foden of his early strike. He later added, “The second settled us a little bit.”\nWest Ham’s Mohammed Kudus’ incredible bicycle kick off a corner in the 42nd minute gave hope for Arsenal fans, but it wasn’t enough.\nManchester City put the game — and the season — away on Rodri’s goal in the 59th minute.\nThe result gives Manchester City eight EPL titles, the second most in history behind Manchester United’s 13.It was also Pep Guardiola’s 12th league championship in 15 seasons as manager. His six English top-flight titles rank second all time behind only Sir Alex Ferguson (13).\nKlopp gets winning send-off over 10-man Wolves\nAlexis Mac Allister and Jarell Quansah scored in Liverpool’s 2-1 win over Wolves at Anfield, as Jurgen Klopp presided over the final match of his legendary tenure as Liverpool boss on Championship Sunday.\nThe celebrated German manager announced his Liverpool departure earlier this season and has been bidding a long goodbye to the Reds since, and the final game was filled with emotion and tributes to Klopp.\nLiverpool finish third on the Premier League table with 82 points, nine points off champions Manchester City, as Klopp’s oft-injured team stuck in a three-team title race deep into the season.\nWhat has Man City won in the last 10 years?\nThe trophy cabinet at City has been very well stocked over the last decade. Here’s a look at the trophies City has won since the start of the 2013-14 season:\n- Seven Premier League titles\n- One Champions League title\n- Two FA Cups\n- Six League Cups\n- One Club World Cup\n- One UEFA Super Cup\n- Two FA Community Shields\nMateta’s hat-trick for Palace vs. Aston Villa\nRelive Jean-Philippe Mateta’s hat-trick for Crystal Palance against Aston Villa in a dominating 5-0 victory at Selhurst Park.\nPremier League clubs to vote on abolishing VAR on June 6\nDavid Ornstein joins Rebecca Lowe pitchside at the Emirates to discuss VAR’s future in the Premier League ahead of a crucial vote by the 20 clubs on June 6th.\nWilson nets Fulham’s fourth v. Luton Town\nHarry Wilson caps off Fulham’s offensive outburst with a well-placed strike to increase the lead to 4-2 over Luton Town.\nAnother trophy on the horizon for City?\nToday’s Premier League title might not be the last title Manchester City takes home this season. Earlier in the year, City took home the Fifa Club World Cup. In six days, the Citizens take on their cross-town rivals, Manchester United, in the FA Cup final at Wembley Stadium.\nWhich teams have been relegated from the Premier League? Burnley, Sheffield United, and Luton Town go down\nTry as they might, Luton Town could not conjure a big win over Fulham and it wouldn’t have mattered had they done it in Week 38 as Nottingham Forest handled its business at Burnley.\nThat means that all three promoted sides have been relegated to the Championship, as the Hatters join Burnley and Sheffield United in heading back to the Championship.\nThe Blades were the first and least surprising to go down, as Chris Wilder could not make notable improvements to their play aside from the January addition of Ben Brereton Diaz.\nBurnley joined Sheffield United in the drop in Week 37, the same week Luton all but officially sealed its fate.\n'There’s no better feeling,' Foden reacts to clinching the title\nManchester City’s star player, Phil Foden, reacted to catapulting his team to an unprecedented fourth straight Premier League title.\n“I never get bored of it. I want this feeling every time,” said Foden, who ends the game as the Player Of The Match. Foden’s two early goals put City in the driver’s seat, with his first coming just one minute and 18 seconds into the game.\n“I believe in scoring a bit too early,” said Foden of his early strike. “The second settled us a little bit,” he added about his brace.\nThe sky is the limit for the young Englishman, who’s only 23 years old and is contracted with City until 2027.\nPorro smashes in Tottenham’s second goal\nAfter a few chances in the box for Tottenham, Pedro Porro strikes it past the keeper to give Tottenham a 2-0 lead over Sheffield United.\nWorst Premier League finish for Man Utd.\nManchester United finished eighth in the table this season, their worst in Premier League history.\nManchester City win the Premier League title\nHistory is made by Manchester City, winning their fourth consecutive Premier League title with a dominant 3-1 win over West Ham.\nNo team has ever won the league four times in a row in the Premier League era, and the feat sends the City fans into ecstasy as they storm the field in celebration.\nFoden off, Kovačić on\nA defensive change for Manchester City sees Phil Foden come off and Mateo Kovačić come on. Foden’s two goals make him the difference maker in this match, as the young Englishman leaves the pitch with a strong case for Man Of The Match.\nKovačić’s introduction sees City adopt a slight change in formation, with the Croat occupying a more defensive position than Foden’s.\nSouček goal disallowed\nWest Ham’s Tomáš Souček has his goal disallowed after a VAR review revealed an obvious handball. The Czech Republic captain prodded the goal into Manchester City’s goal with his arm. He seemed to know the goal was never going to stand, as the usual jubilant celebration was replaced with laughter from the 29 year old midfielder.\nArsenal take 2-1 lead\nArsenal finally break through with a goal from Kai Havertz. Martin Odegaard dribbled into the box and passed to an open Havertz who tapped it in. It was reviewed by VAR for a possible hand ball earlier in the sequence but it wasn't ruled and the goal stands.\nHaaland still hungry\nThe Premier League’s top scorer, Erling Haaland, hasn’t been at his usual best today. A corner kick resulted in an awkward deflection off the Norwegian’s shoulder, as the 23 year old has so far failed to get off the mark. City still dominant, winning 3-1.\nKai Havertz header just wide\nHavertz's header near the goal off a Gabriel Martinelli cross went wide left. A good attempt but not enough...a common theme today in London.\nWest Ham subs: Antonio off, Earthy on\nWest Ham make a defensive change in the 80th minute, taking off talisman Michail Antonio and bringing on youngster George Earthy. Antonio was kept quiet by City this match, failing to register a single shot and only making five passes during his time on the pitch.\nGrealish warming up\nManchester City’s Jack Grealish is warming up on the sidelines. The 28-year-old Englishman, who can be deployed as both a winger or an attacking midfielder, hasn’t had his best season this campaign, only notching three goals and one assist.\nFor fans of the Apple TV series Ted Lasso, Grealish is said to be one of the inspirations for the show’s character Jamie Tartt.\nMan City find their mojo\nRodri’s goal has catalyzed Man City, with Pep Guardiola’s men back to their free-flowing best. While the second half started slowly for the Citizens, they’re now attacking relentlessly again.\nThe pressure has resulted in a barrage of shots and corner kicks from City, as David Moyes hopes his substitution, bringing in Mexican international Edson Álvarez, can change the dynamic of the game.\nGabriel Jesus on for Trossard\nIn hopes of a late goal, Mikel Arteta has brought on Gabriel Jesus to replace the tired Leondro Trossard.\nArsenal creating chances in second half\nArsenal has stepped up their offensive onslaught in recent minutes and had a fantastic chance to take the lead moments ago. Leandro Trossard got free inside the box and a wide open shot but Everton goalkeeper Jordan Pickford made a fantastic save.\nMac Allister heads Liverpool ahead of Wolves\nLiverpool take the lead thanks to Alexis Mac Allister’s glancing header to make it 1-0 over 10-men Wolves at Anfield.\nEze fires strike to extend Palace lead\nAfter the ball ricochets off an Aston Villa defender, Eberechi Eze finds an opening and nets Crystal Palace’s third goal of the match vs. Aston Villa at Selhurst Park.\nArsenal brings on Jurrien Timber, Emile Smith-Rowe\nTimber replaces Ben White while ESR on for Thomas Partey.\nThis is Timber's first appearance since tearing his ACL last August. The 22-year-old defender came over this past offseason from Ajax.\nJimenez gives Fulham lead v. Luton Town\nRaul Jimenez joins the scoring action before the halftime whistle with a clinical finish to put Fulham ahead 2-1 over Luton Town.\nKai Havertz nearly puts Arsenal ahead\nGabriel Martinelli's cross into the box resulted in a Kai Havertz header but the ball hit off the post. So close for the 2-1 lead in the 66th minutes.\nHuge save by Raya\nDominic Calvert-Lewin curled a rocket towards the upper right side of the goal but Arsenal keeper David Raya used a full extension dive to save it. Brilliant stop.\nArsenal 1, Everton 1 through 64 minutes.\nDe Bruyne’s last Premier League game for Man City?\nThis title-defining clash against West Ham could be Manchester City midfield magician Kevin De Bruyne’s last premier league match.\nThe 32-year-old Belgian international has just one year left on his contract and has been rumored to be joining MLS expansion team San Diego FC in recent days.\nRodri restores 2 goal lead, Man City 3, West Ham 1\n3-1 to Man City!\nThe Citizens have restored their two-goal lead thanks to defensive midfield Rodri. The Spanish defensive midfielder slots the ball past Areola for his eighth premier league goal of the season, an impressive goal tally for a player in his position.\nFarewell for Klopp\nIt’s a bittersweet day for Liverpool — and not just because they’re out of contention to win the league.\nToday marks the last day for Jürgen Klopp’s reign as manager of Liverpool Football Club, ending a nine-year run that included a Champions League title and the team’s first league title in three decades.\nIn addition to other trophies, Klopp will be remembered for putting the team back into contention with the world’s best and bringing a renewed sense of optimism and tenacity to the club.\nWith his “heavy metal football” — a high-intensity style of play complete with aggressive pressing and lighting counterattacks — and thousand-watt smile, Klopp quickly became a fan favorite, even sparking his own song among Liverpool supporters.\nLiverpool were in contention for another league title this year until some stumbles down the stretch. The team is locked into third place, bringing it back to Champions League competition next year, when Arne Slot takes over for Klopp.\nFor all the drama of the final weekend, Anfield will be worth keeping an eye on before and after the match as the fans are sure to give him a fond farewell and a ringing rendition of “You’ll Never Walk Alone.\nGabriel off for Arsenal\nAfter another hard foul, Gabriel is coming off for Arsenal. He was replaced by defender Oleksandr Zinchenko.\n1-1 through 59 minutes.\nIsak blasts Newcastle 3-0 ahead of Brentford\nAlexander Isak makes it 3-0 for the Magpies as Brentford continues to struggle defensively in the first half at the Gtech.\nGabriel writhing in pain\nYellow card given to Abdoulaye Doucoure, who grabbed the Arsenal defender's jersey and dragged him to the ground.\nCity start second half slowly\nManchester City have lost a bit of their mojo at the beginning of the second half.\nWhile midfield maestro Kevin De Bruyne and star player Phil Foden both got shots off, neither of them tested West Ham’s keeper Alphonse Aareola. While the Citizens have enjoyed healthy possession, Pep Guardiola’s men haven’t created the same clear-cut chances in the first five minutes of this half as they had at the beginning of the first half.\nSemedo sent off for Wolves against Liverpool\nWolves go down to 10 men following Nelson Semedo’s red card in the first half against Liverpool at Anfield.\nMurphy taps in Newcastle’s second v. Brentford\nJacob Muphy’s close-range effort is enough to put Newcastle two goals in front of the Bees in the first half at the Gtech.\nSecond half in both games kick off\nThere's 45 minutes left in the season as both Arsenal and Man City matches have resumed.\nSecond half of Arsenal-Everton underway\n1-1 through the first half. Arsenal need a goal + a miraculous West Ham comeback to take the Premier League title.\nFoden & Kudos are the difference makers\nManchester City’s star boy Phil Foden and West Ham’s young Ghanian winger Mohammed Kudus have made the difference for their respective teams in the first half.\nWhile City enjoyed sizzling attacking play at the beginning of the half, with Belgian striker Jérémy Doku repeatedly testing West Ham’s goal, it was 23-year-old Foden who scored twice for the Citizens, putting them in the driver’s seat.\nWest Ham struggled to deal with City’s pressure early on but managed two shots as the half went on, both of which came from Kudus. The second of which was a sumptuous bicycle kick goal, which puts Kudus in the Premier League history books regardless of the final score in Manchester.\nWood’s brace puts Forest 2-0 ahead of Burnley\nChris Wood doubles his tally as Nottingham Forest take a two-goal lead against Burnley at Turf Moor.\nBarnes heads Newcastle in front of Brentford\nHarvey Barnes’ header finds the back of the net to give Newcastle a 1-0 lead against Brentford at the Gtech.\nTraore’s strike puts Fulham ahead of Luton Town\nAdama Traore takes advantage of Luton Town’s slip with a strike to put Fulham up 1-0 at Kenilworth Road.\nHalftime: Arsenal 1, Everton 1\nArsenal has controlled the game with nearly 70% possession, 3 shots on goal (12 attempts) and 3 corner kicks but the game is tied after 45 minutes.\nThe Gunners in attendance have shown new life after news of West Ham's incredible bicycle goal. Man City leads 2-1 at halftime. Arsenal needs a win + a loss or tie by Man City to take the EPL title.\n2-1 Man City as halftime hits\nThere’s a reason they call 2-0 the most dangerous lead in football. Manchester City seemed in cruise control before a spectacular strike from West Ham’s Mohammed Kudus to make it 2-1.\nDespite City’s utter dominance, with 15 shots compared to West Ham’s 2, and a healthy 68% possession, the only statistic that matters shows a tight game.\nThe Hammers are just one goal in the second half away from putting the title race in Arsenal’s hands.\nMateta scores second goal to increase Palace lead\nJean-Philippe Mateta finds the back of the net for the second time to extend Crystal Palace’s lead to 2-0 vs. Aston Villa at Selhurst Park.\nArsenal responds to tie game, West Ham scores\nArsenal's Martin Odegaard crossed the ball into the box and defender Takehiro Tomiyasu drilled it home. Arsenal with the quick response to tie the game prior to halftime in the 44th minute.\nNews also just circulated around Emirates Stadium that West Ham has scored against Man City. Mohammed Kudus with a bicycle off a corner.\nThere is a chance for the Gunners.\nRare shot for West Ham\nWest Ham just registered their first shot on target against Manchester City, courtesy of Mohammed Kudus. The young Ghanian tested City’s backup keeper, Stefan Ortega, who’s playing in lieu of Brazilian Ederson, who suffered a fractured eye socket against Tottenham Hotspur earlier in the week.\nKulusevski drills Tottenham in front of Blades\nDejan Kulusevski’s left-footed strike deflects off the post and into the back of the net as Spurs take a 1-0 lead over Sheffield United in the first half at Bramall Lane.\nEverton takes 1-0 lead\nAfter a foul by Thomas Partey outside the left side of the box, Idrissa Gueye took a free kick. His shot deflected off Arsenal midfielder Declan Rice's head and into the goal.\nEverton leads Arsenal 1-0 through 40 minutes.\nCaicedo’s belter gives Chelsea lead v. Cherries\nMoises Caicedo lines up his effort beyond the center circle and unleashes a powerful effort that sails into the empty net to give Chelsea an early 1-0 lead over Bournemouth at Stamford Bridge.\nMoyes’ defensive strategy not paying dividends\nWest Ham have played almost the entirety of the match with 10 men behind the ball, with only Jamaican striker Michail Antonio free from defensive duties.\nManager David Moyes may be ruing his defensive strategy as, so far, it’s only invited pressure from Man City. City have enjoyed 77% possession, 13 shots, and two goals against the team from London.\nDominic Calvert-Lewin off the post\nEverton's Calvert-Lewin made a nice move for separation on the right side of the box and took a shot that hit off the left post. Everton nearly strikes first in this match.\nAmadou Onana down briefly, back up\nBrief stoppage in play for Arsenal-Everton as midfielder Amadou Onana went down. Slow to get up after training staff worked on him but seems fine and play resumes.\nCity relentless against West Ham\nMan City’s attack has been relentlessness against West Ham as they lead 2-0. West Ham’s keeper, Alphonse Areola, seems the busiest man on the pitch, facing nine shots, with seven on target, within the first 25 minutes of the match.\nNottingham Forest scores again\nThe squad takes a 2-0 lead with a pair of goals from Chris Wood, one in the second minute, the other coming in the 14th.\nForest was technically not safe from relegation today since they were potentially able to be tied with Luton Town on points but held a 12 goal lead in goal differential.\nFoden scores again\nThere’s a reason he was Premier League Player of the Season and the Football Writer Player of the Year.\nFoden, 23, scores his second of the day within the first 20 minutes. City’s attack has been relentless in the opening stages of the match as they inch closer to the Premier League title.\nCity dominates the ball against the Hammers\nWest Ham have barely touched the ball in the first 10 minutes of this match against Manchester City. Pep Guardiola’s signature possession style of play is on full display this Sunday, with many attacks coming from Jérémy Doku on the left flank of the field.\nCity’s dominance has resulted in 83% possession of the ball thus far, with three shots on target, while West Ham has yet to manage any shots at all.\nA couple of early goals around the league\nBesides Man City's early lead, Crystal Palace and Nottingham Forest both scored goals within the first 10 minutes.\nForest, who technically are facing relegation today, scored in the second-minute in their match against Burnley.\nAnd Crystal Palace took an early lead against Aston Villa with a goal in the ninth-minute by Jean-Philippe Mateta.\nHuge save by Jordan Pickford\nArsenal's Gabriel Martinelli was streaking down the right side of the field alone and let it rip just inside the box. The Everton keeper had to use a full extension to stop the Brazilian's shot.\nRemains 0-0 through 16 minutes.\nDeclan Rice shot stopped\nThe Arsenal midfielder had the ball bounce out to him just inside the box with nobody around him but his shot was right at goalkeeper Jordan Pickford and stopped. He won't get much better opportunities today.\n0-0 through 12 minutes.\nArsenal in control early\nFans at Emirates Stadium certainly aren't happy with the early 1-0 lead by Man City, but Arsenal is controlling their matchup with Everton so far.\nMikel Arteta's club has 80 percent possession with 3 shots on goal and a corner through 9 minutes.\nFoden scores within the first 2 minutes\nMan City wasted no time to get on the score sheet with their standout player this year, Phil Foden, banging in a screamer with less than 90 seconds on the clock.\nThe 23-year-old won the Premier League’s Player of the Year this season and continues his blazing form with a sumptuous strike into the top left corner of the goal. If the score stands, Man City will take the title.\nArsenal manager would make history with title\nMikel Arteta, who took over at the Emirates in Dec. 2019, is looking to become the youngest manager to win the Premier League title. He is 42 years, 54 days old.\nHe would also become the first manager to win the title having previously played for that club.\nPep Guardiola says title race will come down to mentality\nAsked what will decide the Premier League title this season, Man City gaffer Pep Guardiola said, “I would say our thoughts,” in a pre-match interview.\n“During the game, there are many, many things going to happen,” the Catalan added while tapping his head.\n“It’s the thoughts control yourself, or you control your thoughts.”\nGuardiola’s men are vying to become the first team to win four consecutive titles in the Premier League era. All three points against ninth-place West Ham, and the trophy is coming back to Manchester.\nHow to watch Championship Sunday\n11am ET: Arsenal v Everton — USA Network/Peacock — Watch live on NBC.com & Peacock Premium\n11am ET: Brentford v Newcastle — Watch live on Peacock Premium\n11am ET: Brighton v Man Utd — CNBC/Peacock — Watch live on NBC.com & Peacock Premium\n11am ET: Burnley v Nott’m Forest — Watch live on Peacock Premium\n11am ET: Chelsea v AFC Bournemouth — Golf/Peacock — Watch live on NBC.com & Peacock Premium\n11am ET: Crystal Palace v Aston Villa — Watch live on Peacock Premium\n11am ET: Liverpool v Wolves — Watch live on Peacock Premium\n11am ET: Luton Town v Fulham — Watch live on Peacock Premium\n11am ET: Man City v West Ham — NBC/Peacock — Watch live on NBC.com & Peacock Premium\n11am ET: Sheff Utd v Spurs — Watch live on Peacock Premium\nPST’s Premier League Awards for the 2023-24 season\nTwo of the most fun things in Premier League fandom are predicting who will thrive in an upcoming season and reviewing who actually did the thing at the end of the campaign.\nThe time is now for ProSoccerTalk to deliver the verdicts of editor Joe Prince-Wright and pals Nick Mendola and Andy Edwards.\nWho makes the Best XI? How about a Second XI? Who was the best signing of the year? What moment resonated the most?\nThe title race was three-strong for most of the year and the top-four fight a proper scrap, as storylines delivered all year long.\nMan City ‘vehemently deny’ breaches of financial rules\nDavid Ornstein joins Rebecca Lowe pitchside at the Emirates to report the latest news regarding the Premier League’s ongoing investigation into Manchester City’s 115 charges for breaching financial rules.\nGauging Arsenal’s chances to win Premier League\nJoe Prince-Wright, Andy Edwards and Nick Mendola preview Arsenal’s season finale against Everton, and discuss if the Gunners have any realistic shot at winning the title.\nWilliam Saliba is Arsenal's iron horse\nArsenal star center back William Saliba is starting again today for the Gunners. If he plays all 90 minutes today, he'll be the first Arsenal player to play every minute of every game in a Premier League season.\nMoyes makes changes against Man City\nWest Ham make key changes ahead of their title-altering clash with Manchester City.\nKonstantinos Mavropanos, a former Arsenal player, replaces Angelo Ogbonna, who’s dropped to the bench. The Hammer’s top scorer, Jarrod Bowen, is injured and replaced with a defender, veteran Aaron Cresswell, as Moyes’ men try to stop Man City from scoring.\nCity’s notched the most goals of any team in the Premier League this campaign, scoring 93 through the first 37 match days.\nCole Palmer's stunning season ends in an award\nChelsea’s Cole Palmer has been voted the Hublot Young Player of the Season in the Premier League.\nWith 22 goals (second in the Premier League) and 10 assists (second in the Premier League), the recently turned 22-year-old joins Ollie Watkins, Mo Salah and Anthony Gordon as one of only four players in the league to reach double digits in goals and assists.\nMan City's recent run of dominance\nThe squad has not lost any match since Dec. 6 at Aston Villa, when it lost 1-0. It is a club-record unbeaten in its last 34 matches in all competitions, with 28 wins.\nIt is unbeaten in its last 22 Premier League matches, including eight straight wins. And it hasn't lost at home in a year and a half, when it lost against Brentford on Nov. 12. 2022.\nChelsea's path to the Europa League\nIf Chelsea beats Bournemouth and Tottenham loses against Sheffield United or if it remains in sixth place and Man City wins the FA Cup, they'll qualify.\nManchester City admit nerves, focused on not repeating previous final day title drama\nLONDON — Kyle Walker revealed that Manchester City is feeling the nerves and emotion in the Premier League title race and reminded everyone “We are humans” ahead of the final day of the season.\nHeading into its home game against West Ham on Sunday, City knows if it wins the game, it wins a record fourth-straight Premier League title. No team in English history has won four straight top-flight titles. But if they slip up, then Arsenal can win the title.\nAfter mentioning the final-day drama against Aston Villa two seasons ago — City was 2-0 down at home knowing a win would seal the title, and it roared back to win 3-2 late on — Pro Soccer Talk asked Kyle Walker what lessons they’ve learned from that kind of situation they’ve been involved in a lot over the years, and how it can help them against West Ham on Sunday.\nCity's starting XI\nManchester City’s starting XI features some notable changes since the last time Pep Guardiola’s men lined up against Spurs. Stefan Ortega replaces the injured Ederson, and the young Belgian Jérémy Doku replaces Mateo Kovacic. Three points today, and the Citizens are guaranteed their fourth consecutive Premier League trophy.\nArsenal's final starting XI\nThe headline here is Bukayo Saka is out for the final game of the season, with Gabriel Martinelli taking his spot. The team says the star winger has a slight muscle injury.\nTakehiro Tomiyasu gets the nod at left back over Oleksandr Zinchenko and Jakub Kiwior and Jurrien Timber, who is in the squad for the first time since the opening game of the season, when he suffered a torn ACL.\nPremier League Preview: Championship Sunday\nWill Manchester City claim a fourth consecutive Premier League title when it hosts West Ham or will Arsenal earn its first league title in 20 years?\nRoberto De Zerbi to leave Brighton\nIt has been announced that Roberto De Zerbi will step down as Brighton manager following its final game of the season at home to Manchester United on Sunday.\nDe Zerbi, 44, has spent the past 20 months at Brighton, taking the Seagulls to their first-ever European campaign as they finished in sixth place last season, their highest-ever top-flight finish.\nThe Seagulls reached the last 16 of the Europa League this season, but injuries have affected them massively and they’ve had a very poor second half of the season as reports continued to swirl that De Zerbi could be leaving.\nNow it has been confirmed the Italian coach is moving on after their game against United, with the Seagulls knowing a win would basically guarantee a top 10 finish.\nTop scorers coming into today\nA look at the race for the Golden Boot:\n1. Erling Haaland (MC): 27\n2. Cole Palmer (CHE): 22\n3. Alexander Isak (NEW): 20\nT4. Dominic Solanke (BOU): 19\nT4. Ollie Watkins (AVL): 19\n6. Mohamed Salah (LIV): 18\nHow Premier League tiebreaker rules work\nEach position in the Premier League table is decided by the following tiebreakers if teams finish on the same number of points:\n- Goal difference\n- Goals scored\n- Team that collected the most points in head-to-head record\n- Who scored the most away goals in head-to-head\nIf teams cannot be separated by the above criteria and they are fighting for the title, European spots or relegation, a one-off playoff game at a neutral ground will be scheduled to decide who finishes higher.\nHow does the Premier League head-to-head tiebreaker work?\nThe team that collected the most points in head-to-head games will finish higher. If teams are level after that, the team that scored the most away goals in head-to-head games will finish higher. If teams are level after that, then a one-off playoff game will be needed.\nHas the Premier League title ever been decided by goal difference?\nYes. Once. The famous 2011-12 season, when Sergio Aguero scored a winner on the final day of the season for Manchester City in the 94th minute against QPR, was the only time the title has been decided on goal difference. Manchester City and Manchester United both finished the season on 89 points, but City had a goal difference of +64 and United were on +56.\nMost clean sheets so far\nA look at the standings for the Golden Glove\n1. David Raya (ARS): 16 (clinched)\n2. Jordan Pickford (EVE): 13\nT3. Bernd Leno (FUL): 10\nT3. Ederson (MC): 10\nT5. Emiliano Martinez (AVL): 8\nT5. Andre Onana (MU): 8\nChelsea won the Super League title\nYesterday, the women of Chelsea claimed another Super League title under Emma Hayes in her final season at Stamford Bridge.\nIt is the Blues' fifth consecutive title and seventh overall with Hayes at the helm. There will be little time to celebrate for Hayes as she takes over as manager of Team USA and will be on the sidelines in just two short weeks for a pair of friendlies against South Korea beginning June 1.\nWhat Newcastle and Man U need for the Europa League\nNewcastle needs to climb to sixth place in the final standings and needs a bit of help from there in Man City taking home the FA Cup.\nFor Newcastle to finish sixth, it needs to beat Brentford and for Chelsea to lose against Bournemouth.\nHow Tottenham can qualify for the Europa League\nThe current fifth-place team, the Spurs, can qualify for the Europa League if it either wins or draws against last-place Sheffield United.\nAnother path for Tottenham would be if Chelsea loses or draws against Bournemouth or if it falls to sixth place and Man City wins the FA Cup later this month.\nMan City is chasing history\n- Seeking 4th straight Premier League title: No English team has ever won four straight top-flight titles.\n• Seeking 6th Premier League title in last 7 seasons: No English team has ever won six top-flight titles in seven seasons.\n• Seeking 8th Premier League title and 10th top-flight title: Currently it has seven PL titles, the second-most in history behind Manchester United’s 13, and nine top-flight titles. It could become fourth English club to win 10-plus, after MU, LIV and ARS.\nWatch the table change over the season\nAs Arsenal tries to overtake City atop the Table on the final day of the season, here’s a look at just how the Table has changed since Matchweek 1.\nJurgen Klopp's last game at Liverpool\nAmong the storylines today, Jurgen Klopp will manage his final game with Liverpool.\nWidely regarded as one of the best managers in the world, Klopp was appointed manager of the Reds in 2015. His accomplishments include three Champions League finals with a championship in 2019 (Liverpool’s sixth).\nHe guided Liverpool back to the top of the Table in the Premiership (the club’s 19th) the following season. Klopp earned FIFA Coach of the Year honors in both of those seasons — 2019 and 2020.\nChampions League teams are set\nOne bit of drama that is lacking today is which English teams will be in the Champions League next season.\nMan City, Arsenal, Liverpool and Aston Villa are all guaranteed to finish in the top four.\nWhat else is at stake today\nIt's not just the champion that'll be decided today.\nThere are still teams vying for the chance to play against other European clubs next season in the Europa League and Europa Conference League.\nThe fifth-place finisher is guaranteed a spot in the Europa League. Only Tottenham and Chelsea can finish fifth. The team that finishes sixth may be eligible for the Europa League if Man City win the FA cup later this month, which opens the door for Newcastle and Man United.\nCurrently, the team that finishes sixth will earn the right to the Europa Conference League next season. The Europa Conference League place would drop to seventh place if the FA Cup winner (Man City or Man United) finishes inside the top six.\nCan West Ham spoil Man City’s title hopes?\nJoe Prince-Wright, Andy Edwards and Nick Mendola preview Manchester City’s final match of the season against West Ham, where the Premier League title can either be won or lost at the Etihad.\nArsenal hoping for unprecedented comeback\nNo team has ever won the Premier League title entering the final day of the season below first place.\nThe last time any team won the English top-flight title entering the last day of the season in second place was: Arsenal in 1989.\nThey entered the final day of that season facing Liverpool, which was holding on to first place. Arsenal took the title after winning 2-0.\nHow to watch Manchester City vs. West Ham live, stream link and start time\nKickoff: 11 a.m. ET Sunday\nTV Channel: NBC\nOnline: Watch live online via NBC.com & Premier League on Peacock\nHow to watch Arsenal vs. Everton live, stream link and start time\nKickoff: 11 a.m. ET Sunday\nTV Channel: USA Network\nOnline: Watch live online via NBC.com & Premier League on Peacock\nWe basically know which 3 teams are going down\nSheffield United and Burnley are guaranteed relegation to the lower-tier Championship. While Luton Town isn't mathematically relegated, realistically it has no chance to remain in the Premier League. Even if it draws even with Nottingham Forest on points, its goal differential is - 31 while Forest's is -19.\nThe simplest way for Luton Town to avoid relegation would be if it beat Fulham 6-0 and Nottingham Forest lost 6-0 at Burnley. This is far from the only score combination, but it’s the simplest. For example: A Luton 1-0 win and Nottingham Forest 11-0 loss would also keep Luton up and relegate Nottingham Forest on goals scored.\nWho is joining the Premier League next season?\nLeicester City and Ipswich Town clinched automatic promotion by finishing first and second in the Championship, respectively.\nLeeds United will play Southampton in the Championship Playoff Final on May 26, with the winner earning promotion. Leicester City and Leeds United were in the Premier League last season before being relegated.\nHow the champion will be decided\nTwo teams may be crowned champions at the end of the day: Manchester City and Arsenal.\nMan City enters the final day of matches up two points over Arsenal. If it wins over West Ham, it'll net its fourth consecutive Premier League title, which would be the first time one team has won four seasons in a row.\nIf Arsenal beats Everton and Man City loses or draws, Arsenal would take home the first title to North London in 20 seasons.\nThis is the 10th time the Premier League title will be decided on the final day of the season.",
  "word_count": 6072,
  "scraped_at": "2026-02-14T12:08:44.990221"
}