{
  "article_id": "66b893cfe1b1",
  "url": "https://www.the42.ie/stephen-mcguinness-on-gambling-match-fixing-6514267-Nov2024/",
  "title": "  I dont think sport helps itself by allowing betting companies to be part of it  ",
  "date": "20241109T120000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THERE IS significant evidence to suggest the issue of gambling in football is more pervasive than ever.\nA 2014 study concluded that footballers and cricketers are three times more likely to encounter problems than other young men.\nIt is worth noting too that research recently has indicated women and children have become increasingly vulnerable to this issue.\nGeneral Secretary at the Professional Footballers’ Association of Ireland Stephen McGuinness and his colleagues have worked extensively to educate players about the dangers of gambling, with support systems available if needed.\n“I think the advertising of gambling is a problem,” McGuinness tells The 42. “I think it should be banned from sport in general. I don’t think you should be allowed to have sponsors on the front of your shirt.\n“I don’t think gambling companies should be involved in football, and I don’t think they should be involved in any sport.\n“It makes me laugh today when we see the betting tax, how much of it goes into horse racing and greyhound racing, and how much is used as prize money and whatever else.\n“And then I see from Paddy Power that profits have increased on the back of a really strong Euros.\n“I look at all the money placed in football — none of it is coming back to the actual game, to invest in it, to make the game better, to educate people around gambling. There seems to be no work done in that area.”\nEx-players including Paul Merson, Peter Shilton and David Bentley have spoken about their struggles with addiction in the past, while more recently, there have been high-profile cases involving Ivan Toney, Sandro Tonali, Andros Townsend and Steven Caulker.\nIrish football is not immune from this problem either. Northern Ireland international Kyle Lafferty has been open about his gambling issues. And last September, Ireland U21 international Dylan Duffy was fined by the FA after admitting to the charge of alleged breaches of anti-betting rules.\nSome action is being taken to address this problem. Last year, the Premier League clubs collectively agreed to withdraw gambling sponsorship from the front of clubs’ matchday shirts, an initiative that will come into effect at the end of the 2025-26 season.\nRecent reports indicated the number of gambling ads on the opening weekend of the Premier League almost trebled compared to 2023.\nAccording to a March 2024 study, despite the Premier League’s 2026 commitment,” 40% of teams are sponsored by a betting company, with the next most popular category being financial services.\n“The FT estimates that the sponsorship deals of the eight Premier League clubs sponsored by a betting brand are valued at around £60m of annual revenue which the clubs would need to replace by the beginning of the 2026//27 season.”\nThe report continues: “Front-of-shirt presence for gambling businesses is less prolific in the EFL. 21% of teams in the Championship are sponsored by betting companies, while only one team in League One has a betting sponsor.”\nMcGuinness says the situation is “a constant worry” and feels the ubiquity of gambling advertising is exacerbating the problem.\n“I don’t think sport helps itself by allowing betting companies to be part of it, to be part of the sponsorship, and we’re lucky in our league that it’s not as bad as in the UK.\n“You look at Sky Television, Sky Bet are sponsoring it and betting is everywhere. And unless we get control of that, we’re going to find it very difficult to control people regarding how they bet.”\nHe continues: “Unfortunately, they are making so much money that it is a revenue stream that our league needs from a financial viewpoint, but it doesn’t need the link to gambling.\n“And as long as I’m running this union, we will never have a gambling company [involved]. And I’ve been offered it, I can assure you, especially when things were tight from a finance point of view, and over the years, a number of betting companies came to us. We’ve always resisted it.\n“I’ve seen how it’s destroyed some of our members over the years. Some of our most decorated players have ended up being bankrupt and broke on the back of having a gambling addiction.”\nIn the last two decades, sport has changed immeasurably. People are encouraged to speak openly about mental health, which previously had not been the case.\nYet there is still somewhat of a stigma attached to problem gambling, leaving some addicts — particularly those with a public profile — reluctant to speak about it.\n“Some people don’t see that they’ve got issues — that is a huge concern,” says McGuinness.\n“And I’ve heard horror stories of players trying to hide a gambling addiction and going to meet the postman before he comes to the house with the credit card bill, and suddenly all the betting account transactions are on it, and then one day, the player wakes up late, and suddenly the bill is on the floor.\n“The wife or partner is picking up the bill and seeing that he’s gambling every penny that he gets, and that’s the reason why they haven’t been able to pay the mortgage.\n“And that stuff is hard for us to listen to, and then for the player to deal with.”\nProfessional footballers are not allowed to bet on their leagues or anywhere else in the world, nor are they permitted to pass on information to outside parties on team selection, transfer developments, et cetera. They can still bet on other sports.\n“It used to be, you just couldn’t bet on your league,” he explains. “Now you can’t bet on football worldwide.\n“We’re strong with the members to ensure they are aware of [these issues].\n“The sanctions for that are heavy and can ruin their careers.”\nMatch-fixing is also a major concern. Earlier this month, a man was arrested as part of an investigation into the alleged bribery of a professional League of Ireland footballer.\nThe player in question contacted the PFAI. “That was his first phone call,” McGuinness explains, “so that does show you we’re getting our message across to the players. They know that it’s wrong.\n“But you can’t stop somebody from doing it. You can only point them in the direction of support and the pitfalls of it.\n“People will make their own choices. It’s the same with anti-doping. Ultimately, it’s their responsibility.”\nMcGuinness also suggests the problem of match-fixing is greater than some people might realise.\n“That’s the biggest issue facing world football — match-fixing. And particularly in leagues like ours, it’s a summer league, with low wages, potentially some clubs not paying wages and hitting financial trouble.\n“That’s normally the recipe that ends up being fatal for players’ careers when they start looking at ways of being able to manipulate results and external parties in their ears telling them to do X, Y and Z.\n“So gambling can [lead to match-fixing], that’s always been the fear in our office, was the both of them marrying up, and that is the perfect storm, and we’ve been working hard to ensure that that doesn’t happen.”",
  "word_count": 1184,
  "scraped_at": "2026-02-14T12:10:26.360512"
}