{
  "article_id": "66f895beade3",
  "url": "https://english.aawsat.com/sports/4465616-fie-discusses-preparations-2024-world-fencing-championship-juniors-and-youth-saudi",
  "title": "FIE Discusses Preparations for 2024 World Fencing Championship for Juniors and Youth in Saudi Arabia",
  "date": "20230802T061500Z",
  "domain": "english.aawsat.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Top seed Taylor Fritz captured the last five points in a deciding tie-breaker to defeat fellow American Sebastian Korda and advance to the ATP Dallas Open semi-finals on Friday.\nWorld number seven Fritz fought back to defeat 53rd-ranked Korda 6-7 (2/7), 6-4, 7-6 (7/5) and book a place against Croatian Marin Cilic, the 2014 US Open winner, in a Saturday semi-final.\nFritz, now 4-1 in matches against Korda, fired 22 aces and won all four break points he faced to conclude matters in two hours and 30 minutes.\n\"Just (proud of) the way I handled those big moments in that match,\" Fritz said.\n\"He was constantly putting a lot of pressure on my serve. He was playing really well.\"\nFritz also fought back after suffering a right elbow injury returning a Korda shot in the second set.\n\"I just instantly got this really sharp pain in my elbow, served one serve afterwards -- luckily I made it -- and knew right then I needed to get the physio there. It was pretty bad,\" AFP quoted Fritz as saying.\n\"I had a couple games where I was really scared to snap my serve because I feel that pain I'm going to lose that point, but then I got some painkillers, I started to feel better and then I started to just trust it and it wasn't even something I was thinking of most of the second and the full third (sets).\"\nUp 5-4 in the final tie-breaker, Korda sent two forehands long and Fritz blasted a service winner on the final point for the triumph.\nCilic advanced by beating British qualifier Jack Pinnington Jones 6-1, 6-4.\nFritz is 2-1 in ATP play against 37-year-old Cilic, winning on Monte Carlo clay in 2022 and at Indian Wells in 2017 but losing a 2021 final at St. Petersburg.\nCanada's Denis Shapovalov kept his title defense on track, beating third-seeded Alejandro Davidovich Fokina of Spain 5-7, 6-4, 6-3.\nShapovalov next faces second seeded American Ben Shelton, who rallied for a 5-7, 6-3, 6-4 victory over Serbian Miomir Kecmanovic.",
  "word_count": 344,
  "scraped_at": "2026-02-14T12:16:38.950849"
}