{
  "article_id": "670143f27963",
  "url": "https://www.gatestoneinstitute.org/20599/us-qatar-and-iran-release-the-hostages",
  "title": "U . S ., Qatar and Iran : Release the Hostages ! ",
  "date": "20240425T100000Z",
  "domain": "gatestoneinstitute.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This is not the first time that Muslims have launched attacks against non-Muslims and taken hostages.\nWe did not hear the President of the Cairo's Al-Azhar University, nor Egypt and Jordan, Muslim states that entered into a peace agreement with Israel, condemn Hamas for having taking Israeli, American, Chinese, French, German, Russian, Filipino and Thai hostages.\nThey could not condemn it: taking captives is authorized by the Qur'an (9:5; 23:1-5; and 70: 30-35), so long as the captives are not Muslims. ISIS accordingly justified transforming Yazidi hostages into sex slaves.\nBiden (USA), Cameron (GB), Macron (F), Scholz (D), Harris (IRL), Jakobsdóttir (IS), Sánchez (E), Meloni (IT), Golob (SLO), however, appeared surprised. They and their respective advisors were apparently not aware of that fact.\nInternational customary law, however, forbids the taking of hostages. Article 3 of the Geneva Conventions prohibits the taking of hostages (Geneva Conventions, common Article 3, 1). It is also prohibited by the Fourth Geneva Convention and is considered a grave breach thereof (Fourth Geneva Convention, Article 34 and Article 147).\n\"It is generally acknowledged by the international community that the taking of hostages is one of the most vile and reprehensible of acts. This crime violates fundamental individual rights—the right to life, to liberty and to security—that are protected by binding legal instruments such as the 1966 International Covenant on Civil and Political Rights on the worldwide level, and the 1969 American Convention on Human Rights and the 1950 European Convention for the Protection of Human Rights and Fundamental Freedoms on the regional level. The United Nations General Assembly has stated that the taking of hostages is an act which places innocent human lives in danger and violates human dignity.\"\nThe Rome Statute defines \"enslavement\" in its Article 7(2)(c) :\n\"Enslavement means the exercise of any or all of the powers attaching to the right of ownership over a person and includes the exercise of such power in the course of trafficking in persons, in particular women and children.\nArticle 7(1)(c), Crimes against humanity, of the Rome Statute considers enslavement as a crime against humanity:\n1. For the purpose of this Statute, \"crime against humanity\" means any of the following acts when committed as part of a widespread or systematic attack directed against any civilian population, with knowledge of the attack:\n(a) Murder;\n(b) Extermination;\n(c) Enslavement;\n(d) Deportation or forcible transfer of population;\n(e) Imprisonment or other severe deprivation of physical liberty in violation of fundamental rules of international law;\n(f) Torture;\n(g) Rape, sexual slavery, enforced prostitution, forced pregnancy, enforced sterilization, or any other form of sexual violence of comparable gravity;\nIt is not surprising, therefore, that several Muslim states (Bahrain, Egypt, Iran, Lebanon, Libya, Morocco, Oman, Saudi Arabia, Syria, Sudan, Turkey, United Arab Emirates, Yemen) are not parties to the Rome statute. Qatar voted against it.\nThe International Convention against the Taking of Hostages (1979) develops international cooperation between states in devising and adopting effective measures for the prevention, prosecution and punishment of all acts of taking hostages as manifestations of international terrorism.\nState parties of the International Convention against the Taking of Hostages (1979), pursuant to its Article 6 - Paragraph 1 must:\n\"When an alleged offender is present [this includes accomplices] in the territory of a Party, and it is 'satisfied that the circumstances so warrant', in accordance with its law, take the person into custody, or take such other measures to enable any criminal or extradition proceedings to be instituted. The limited discretion is common to the conventions, but must be exercised reasonably and in good faith\".\nEgypt has been a party to this Convention since October 2, 1981. Egypt did not arrest the Hamas officials who came to Cairo to discuss the hostage deal in February, March and April 2024.\nRussia has been a party to this convention since June 11, 1987. It did not arrest the Hamas officials who came to Moscow in October 2024.\nQatar has been a party to this convention since September 11, 2012. It did not arrest Hamas leaders Ismail Haniyeh, Moussa Abu Marzuk and Khaled Mashaal who are, under Article 1 (b) of the Convention, participants and accomplices of the hostage taking act.\nThese Hamas leaders are living with family members in Qatar's capital Doha, in its luxury hotels and villas, at the same time as Qatar hosts a vast American military presence in the Al-Udeid Air Base.\nTurkey, a party to this convention since August 15, 1989, also did not arrest any Hamas leaders in Turkey.\nAlthough France has been a party to this convention since June 9, 2000, and the United States since December 7, 1984, neither country requested of Egypt, Qatar and Turkey to arrest the leaders of Hamas living there, who may be accomplices or participants in the hostage-taking act.\nThe UN Special Representative of the Secretary-General on Sexual Violence in Conflict reported on March 4, 2024:\n\"Based on the information gathered by the mission team from multiple and independent sources, there are reasonable grounds to believe that conflict-related sexual violence occurred during the 7 October attacks in multiple locations across the Gaza periphery, including rape and gang rape, in at least three locations. Across the various locations of the 7 October attacks, the mission team found that several fully naked or partially naked bodies from the waist down were recovered – mostly women – with hands tied and shot multiple times, often in the head. Although circumstantial, such a pattern of undressing and restraining of victims may be indicative of some forms of sexual violence. [Paragraph 12]\nAt the Nova music festival and its surroundings, there are reasonable grounds to believe that multiple incidents of sexual violence took place with victims being subjected to rape and/or gang rape and then killed or killed while being raped. [Paragraph 13]\nWith respect to hostages, the mission team found clear and convincing information that some have been subjected to various forms of conflict-related sexual violence including rape and sexualized torture and sexualized cruel, inhuman and degrading treatment and it also has reasonable grounds to believe that such violence may be ongoing. [Paragraph 17]\nThe team mission also received clear and convincing information that sexual violence, including rape, sexualized torture, and cruel, inhuman and degrading treatment occurred against some women and children during their time in captivity and has reasonable grounds to believe that this violence may be ongoing.\" [Paragraph 71]\nBased on first-hand accounts of released hostages there are reasonable grounds to believe that female hostages were also subjected to other forms of sexual violence. [Paragraph 72]\nFor more, see the full report.\nTo this day, neither US President Joe Biden nor the above-mentioned European leaders have contested that Jewish men, women and children were taken hostage to the Gaza Strip, and that some women, men, boys and girls have been used as \"sex slaves\" there.\nThese are world leaders who care so much about international law and must certainly be anxious to prevent the occurrence of such practices on their non-Muslim citizens.\nThey could all diplomatically ask the governments of Bahrain, Egypt, Iran, Lebanon, Libya, Morocco, Oman, Saudi Arabia, Syria, Sudan, Turkey, United Arab Emirates, Yemen, all the Muslim States:\n- If the Qur'an and the sharia authorize Muslims to take non-Muslims hostage to serve as sex slaves. And, if so, is the international law that they profess in violation of the Qur'an?\n- If their respective states condemn the practice of taking non-Muslims hostage for abuse as sex slaves?\n- And if it is in conformity to international law?\nIf taking hostages and forcing them to serve as sex slaves are authorized by the Qur'an and the Sharia based on 7th Century practice, then \"international customary law\" on this subject is not so customary: 1.6 billion Muslims would be authorized to do so. Consequently, all non-Muslims, such as the rest of the world population, could be authorized to take as hostages Muslim women, men, boys and girls to serve as their sex slaves.\nPrecedents\nTaking hostages is hardly new. It was used in 1979 when 52 Americans were taken hostage in the US Embassy in Tehran during 444 days and only released in 1981. In 1990, Saddam Hussein held 100 Europeans. In 2002, 850 people were taken hostage in a Moscow theater by Chechen Muslims and then killed.\nCenturies ago, pirates captured merchant ships, took the crews and enslaved them. Some raided the European coasts. Between the years 1500 and 1800 more than a million Muslims were enslaved in Europe and another 2 million Christians suffered the same fate in North Africa and the Middle East.\nThe United States twice went to war against the Barbary States of Tripoli, Tunis and Algeria, between 1801 and 1805 and again in 1815. The Ottoman eastern Mediterranean was the scene of intense piracy. The second operation ended after a fleet of British and Dutch ships bombarded Algiers and its harbor defenses for nine hours. A treaty was signed in September 1815. The British Consul and 1,083 other Christian slaves were freed and the U.S. ransom money repaid.\nIn 1786, when the Ambassador of Tripoli in London was asked by a delegation of American Commissioners about \"their pretentions to make war upon Nations who had done them no Injury\":\n\"The Ambassador answered us that it was founded on the Laws of their Prophet, that it was written in their Koran, that all nations who should not have acknowledged their authority were sinners, that it was their right and duty to make war upon them wherever they could be found, and to make slaves of all they could take as Prisoners, and that every Musselman who should be slain in battle was sure to go to Paradise.\"\nHow the negotiations with Hamas were conducted\nHostages and sex slaves are still being held in Gaza by Hamas, Islamic Jihad and the Gazan population. In February, after long and difficult negotiations,112 hostages were released. There remain at least another 134 hostages.\nThis circumstance leads us to examine how the American, the French, the Germans, the Russians and the Argentinians who had nationals (dual) taken as hostages in Gaza negotiated their release.\nThe United States, France, Germany, Russia and Argentina, who had dual nationals taken hostage, did not try to bomb Hamas infrastructure and places where Hamas hid. Instead, they let Israel do it and then accused Israel of destroying the Gaza Strip.\nFrench President Emmanuel Macron initially asked for a European coalition, similar to the coalition that fought ISIS, then reneged and asked for a permanent ceasefire.\nMore than half the estimated 250 hostages taken to Gaza by Hamas had foreign nationality from 25 different countries, including 54 Thai nationals.\nThe conditions and payments made for the release of the non-Israeli hostages (from Thailand, Nepal, China, Sri Lanka, Tanzania, Philippine, etc.) remain a part of secret diplomacy.\n138 of the Israeli hostages also had foreign nationality, including 2 Argentinians, 6 Russians, 12 Americans, 12 Germans and 6 French.\nThe Argentinian, German, American, French leaders decided to do their own negotiations with Hamas through Qatar. Putin invited Hamas and Islamic Jihad to Moscow and three Russian hostages were thereafter released. Argentina's President Javier Milei went to the Western Wall in Jerusalem, prayed and cried there.\nCoincidence or miracle, the two Argentinians were then rescued by Israelis soldiers in a successful military operation in Rafah.\nIsrael negotiated the release of some hostages and released Palestinian terrorists in exchange. Since then, Hamas has continued to reject all proposals.\nTo analyze the negotiation process and the efficiency of the negotiation teams we must try to think (1) what Hamas wants, (2) what Hamas can give to the Israeli government, (3) what the Israeli government wants and (4) what the Israeli government can give in return.\n1. What Hamas wants:\na. The destruction of Israel and its Jewish population, or at least driving all Jews out of the Holy Land.\nb. To provoke a war of all Muslims against Israel.\nc. To divide Israel's population and the fall of the Israeli government hoping that this will lead the Muslim population of Judea and Samaria and the Muslim states to launch a general war against Israel.\nd. The release of terrorist Muslim prisoners held by Israel. Such a release would demonstrate that the Jews are humiliated and that the Hamas did what the Qur'an asks from any Muslim, namely, to humiliate the Jews.\ne. To preserve the last Hamas brigades in the Gaza strip.\nf. To frighten the Jews that what happened on October 7, 2023 will happen again and again.\ng. To reconstitute its terrorist power in Gaza and regain complete control of its population.\nh. To release some hostages one after the other over a very long period of time in order to lead the American and the European governments to put pressure on Israel for a cessation of the war and overthrow the present Israeli government and replace it with one that will presumably be more terrorist-friendly.\ni. To murder some hostages from time to time and to give some information that bodies of hostages are in certain places, for Israel to find them and to demonstrate to the world and the hostage families that the war was lost.\n2. What Hamas can give Israel:\na. Some hostages, by small groups, until the last hostage is released, alive or dead. The process could take years to humiliate the Jews and divide them.\n3. What Israel wants:\na. The release of all the hostages\nb. The destruction of all the remaining Hamas brigades.\nc. Control of the Philadelphi Corridor along Gaza's border with Egypt.\nd. The destruction of all the tunnels there that permitted Hamas, with the complicity of the Bedouin tribes, the Egyptian police and military and the United Nations, to seize all of Hamas's sophisticated armaments and munitions.\ne. To prevent the Hamas from continuing to control the Gaza Strip and be able to repeat the October 7, 2023 pogrom.\n4. What Israel can give Hamas:\na. The release of some more Muslim prisoners in exchange of hostages without being humiliated.\nb. To permit some Hamas leaders to leave Gaza safely without being humiliated\nc. To withdraw the Israeli army from part or all of the Gaza Strip and to permit some people to return to the north of the Gaza Strip.\nd. To prevent chaos in the Gaza strip.\nUntil now, about half the hostages have been released in exchange for some Muslim terrorist prisoners.\nAnyone having experience with the strategy of international negotiations will immediately conclude that the manner the Israeli government and the hostage families have conducted themselves raises serious questions.\nRather than putting any pressure on Qatar and demonstrating in front of Qatari-owned hotels in France, the United States and elsewhere in Europe, the families of the hostages have been putting pressure on the Israeli government, thereby doing exactly what Hamas would presumably like them to do. They are \"working\" for Hamas -- and against their own interests -- in the hope of seeing more hostages released. By their actions the value of the hostages only increases.\nWhen they put the focus on the Bibas children, the price of their release in Hamas's eyes only increases. It is not surprising that Hamas did not release them; instead they preferred to release lesser hostages of lesser value.\nFamilies of hostages are now asking the Israeli population to bring down the duly-elected government of Israel supposedly to obtain the release of all the hostages. They do not understand that they are unwittingly \"working for\" Hamas, who are ready for negotiations over the return of hostages (even dead) to take years.\nSome demonstrators in Israel are ready to disrupt the democratic process at almost any cost. The Knesset was elected for a five-year period. The demonstrators are doing what Hamas cannot do by itself: they are dividing Israel so that the unity government loses its strength in the negotiations, as well as any ability to bring the hostages home sooner -- a triumph that was successfully accomplished by the IDF, left unfettered.\nThe hostages are not the Israeli government's to deliver. They are unfortunately under the total the control of Hamas, Qatar and Iran --which is where the pressure should be applied, not on the government of Israel.\nHas the US applied any pressure at all on Qatar, Iran or Hamas? Rather, the US lifted sanctions on Iran and given its regime through grants, hostage exchange ransoms and non-enforcement of oil sanctions \"closer to $60 billion.\"\nThe only way a new Israeli government might negotiate the release of hostages would be by placing Israel's entire population in incalculable danger. Any new Israeli leader hand-picked and pushed through by the current US administration would most likely be expected to agree to a terrorist Palestinian state next to Israel -- meaning that the Israel would not be able to cross its border, if necessary, in \"hot pursuit\" of terrorists, and that the new state would soon be militarized, officially or not. Even if a new, sovereign Palestinian state were supposedly demilitarized, it would still be free to form alliances with any other entity it liked, including Iran, Al Qaeda or ISIS.\nInstead of showing unity, Israeli Minister-without-portfolio Benny Gantz went to Washington, where he was apparently invited to bring down Israel's elected government. Shortly after his visit, US Senate Majority Leader Chuck Schumer, perhaps imagining that Israel is a subservient vassal of the US, called, in the most insulting way imaginable , for new elections in Israel, in a clear effort to overthrow Israel's democratically-elected Prime Minister Benjamin Netanyahu and his government.\nTo no one's astonishment, Biden concurred.\nSome Israelis have been engaging riots to bring down their own government – a triumph of which Hamas could only have dreamed.\nTo divide Israeli society even further, Israel's Attorney General and the police did not even attempt to punish the rioters for their blocking of roads and highways.\nHow the allies of Israel became the allies of Hamas\nFrance\nHamas and Qatar certainly gained something during the negotiations for the release of dual-national hostages. On February 27, 2024, Macron received the Qatari Emir Sheikh Tamim bin Hamad, who came with a large ministerial and business delegation. It was a \"state visit\" with great pomp.\nMeanwhile, in February, France, apparently keen on bolstering its relations with Qatar and achieving greater influence in the Middle East, sealed a strategic partnership with the Emirate.\nIn turn, Hamas's great patron, Qatar, which has substantial investments in France, including the Paris Saint-Germain football club, pledged to invest up to ten billion euros in France.\nIn exchange, France, while repeating its \"opposition to an offensive against Rafah\" called for an \"immediate and permanent ceasefire\" between Israel and Hamas, to prevent Israel from destroying Hamas's remaining brigades and the tunnels between Egypt and Rafah that have permitted Hamas to increase its military force. Later, with President El-Sisi of Egypt and King Abdullah of Jordan, Macron demanded an immediate ceasefire.\nIn short, Qatar said it would invest in France 10 billion euros and in exchange France said it would be happy to try to save the terrorist group Hamas. France will sell some state properties to Qatar and will be able to reimburse a small part of its huge public debt that reached €3 trillion at the beginning of 2023. Everyone wins -- except the hostages held by Hamas.\nFrance knows that Qatar finances terrorists and promotes fundamentalist Muslim Brotherhood ideology. It is an Islamist ideology invites the Muslims to wage Jihad on all non-Muslims -- Jews, Christians, idolaters, polytheists, pantheists, non-believers, Hindus, and Buddhists -- but France ignores it.\nGermany\nTogether with his support for Israel, Chancellor Olaf Scholz met with the Emir of Qatar on October 12, 2023 in order to maintain good relations with the emirate. Indeed, an agreement was signed in March 2023 between Qatar and Germany, wherein Qatar committed to supply Germany with up to two million tons of liquefied natural gas (LNG) per year for 15 years, beginning in 2026.\nCoinciding with this visit, members of Scholz's ruling coalition criticized plans to import more LNG from Qatar. Four German hostages were released in November 2023. At least Germany did not forget them.\nSimple pressure made by the members of the Germany's ruling coalition induced Qatar to have these four hostages released. Nevertheless, Germany needed more gas from Qatar, so it jumped on the bandwagon, asked for the cessation of the war, opposed any operation in Rafah and suggested the recognition of a Palestinian state -- all evidently as a reward for terrorism.\nThe United States\nOn March 5, 2024, the US and Qatar announced \"several new milestones, including an amendment to the bilateral Defense Cooperation Agreement... the two sides emphasized the strategic significance of Al-Udeid Air Base in Qatar.... They also discussed future upgrades to the base to increase efficiency and sustainability.\"\nThis agreement extends the US military presence in Qatar for another 10 years. The base can house more than 10,000 troops. Qatar committed billions to upgrade the facilities for the US airmen at the base.\nWithout the US military base there, Qatar knows that it would be a rich, targetable oil-rig. America, \"in exchange,\" it seems, agreed to let Hamas continue its terrorist activities support the US quest for a Palestinian state. No remaining hostages were released; perhaps they were not even talked about.\nSome weeks before those discussions, the Biden administration asked for the cessation of the war and opposed any operation in Rafah, meaning that Israel would not be able to put an end to the remaining Hamas brigades. The Biden administration asked Israel to stop the ground war without having the hostages released. It issued not-very-veiled threats to Israel that the US would stop sending armaments to Israel even while Israel continued to be attacked by Hezbollah in the north. The US also launched the idea of recognizing a \"Palestinian state\" and bringing down the Israeli government.\nBiden and Secretary of State Antony Blinken falsely claimed that there was not enough humanitarian aid into Gaza, falsely implied that Israel deliberately inflicts on the Gazan population conditions of life calculated to bring about its physical destruction -- not Hamas, which was stealing most of the aid for its own use. According to Article 2(c) of the Convention on the Prevention and Punishment of the Crime of Genocide of 1948, it looked as if these heads of state were trying to pin a war crime on Israel.\nUS opposition to Israel entering Rafah was lifted in exchange for a soft Israeli retaliation against Iran for its massive drone and ballistic missile attack on Israel this month.\nThe hostages are still in the hands of Hamas. Girls and women, men and boys, can continue to be held as sex slaves in Gaza and raped, tortured or murdered.\nEven though American citizens are among those still held hostage in Gaza, the US appears to have sided with the Hamas and Hezbollah terrorist groups, and their terrorist-supporting patrons, Qatar and Iran.\nIn other parts of the world, \"More than 365 million Christians suffer high levels of persecution and discrimination for their faith\" with many facing genocide. No state so far has filed a case at the International Court of Justice (ICJ) about that. What prevents South Africa from filing a case at the ICJ?\nThe Islamic Republic of Iran will in all likelihood soon have nuclear bombs. It may well try to use them on Israel, the \"Little Satan\". The US administration still pretends that it is not aware that one Iranian nuclear bomb exploding high above the United States would be enough to send the \"Big Satan\", America, back to the Middle Ages.\nIn fairness, the US has been sending Israel truly impressive help but that could be erased by other \"priorities\" tomorrow.\nMuslims in New York, Illinois and Michigan are already calling for \"Death to America,\" and Biden, who wants their votes, seems to be trying to accommodate them. In the meantime, terrorists-in-waiting have been rioting on American university campuses, with only a few exceptional members of Congress willing to confront them.\n\"Never Again\" has been overtaken, at least for now, by \"Death to America\", \"Death to Israel\", \"Kill them all\".\nMichel Calvo was born in Tunis, Tunisia. An expert in international law, he was a member of the International Court of Arbitration representing Israel. He is the author of The Middle East and World War III: Why No Peace? with a preface by Col. Richard Kemp, CBE.",
  "word_count": 4097,
  "scraped_at": "2026-02-14T13:13:57.272962"
}