{
  "article_id": "670c45f8b729",
  "url": "https://www.mirror.co.uk/gaming/ea-fc-25-future-stars-34576565",
  "title": "EA FC 25 Future Stars – release date , leaks and expected content with huge Evolution update",
  "date": "20250129T170000Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EA FC 25 Future Stars – release date, leaks and expected content with huge Evolution update\nFuture Stars will be the next promo to enter EA FC 25 Ultimate Team packs, with the popular TOTY promo making way\nAfter two weeks of the EA FC 25 TOTY promo in Ultimate Team, the fan-favourite EA FC 25 Future Stars promo will be released later this week.\nEA FC 25 has been at its best the last few weeks, with a fantastic gameplay update going live alongside the popular TOTY promo in EA FC 25 Ultimate Team. From Evolutions to SBCs, Ultimate Team content has been great, and EA Sports is set to keep the good times coming, with the popular EA FC 25 Future Stars promo up next.\nEA FC 25 Future Stars honours the best youngsters in world football, with EA releasing promo squads of some of the brightest talents with huge stat boosts. In EA FC 24, Future Stars Team 1 and Team 2 were released, with the likes of Cole Palmer, Lauren James, and Warren Zaire-Emery headlining the squads.\nAnd, ahead of release, some EA FC 25 Future Stars information has been leaked, including some of the players set to feature and a huge change to Evolutions. Here's everything you need to know about the EA FC 25 Future Stars promo.\nREAD MORE: EA FC 25 TOTY Honourable Mentions and TOTY 12th players revealed as Cristiano Ronaldo wins voteREAD MORE: EA banks on FC 25 Gameplay Refresh update to rejuvenate game – as title financially 'underperforms'EA FC 25 Future Stars release date\nThe EA FC 25 Future Stars release date is Friday, January 31 at 6 pm GMT / 1pm EST / 10am PST. Based on past releases, we expect this to be a two-week promo, with a Team 2 squad being released on Friday, February 7 before being replaced by a new promo on Friday, February 14.\nEA FC 25 Future Stars leaks\n@AsyFutTrader has revealed that Icons are included in the Future Stars promo, just like in EA FC 24. The leaker has revealed that Dutch legend Johan Cruyff will be included, while @FutSheriff has revealed the full Future Stars Team 1 squad, along with official ratings.\nHere are all the Future Stars player leaks we know so far, along with the leaked ratings ratings:\n- CAM: Johan Cruyff (Future Stars Icon) - 95 OVR\n- CDM: Xabi Alonso (Future Stars Icon) - 90 OVR\n- RW: Lamine Yamal (Barcelona) - 94 OVR\n- ST: Endrick (Real Madrid) - 93 OVR\n- CB: Leny Yoro (Manchester United) - 91 OVR\n- ST: Benjamin Sesko (RB Leipzig) - 91 OVR\n- LM: Bynoe Gittens (Borrusia Dortmund) - 91 OVR\n- LM: Alex Baena (Villarreal) - 89 OVR\n- CB: Beraldo (Paris Saint-Germain) - 90 OVR\n- CM: Kenneth Taylor (Ajax) - 89 OVR\n- LB: Miguel Guitierrez (Girona) - 89 OVR\n- CDM: Romeo Lavia (Chelsea) - 89 OVR\n- CM: Joao Gomes (Wolves) - 88 OVR\n- RB: Conor Bradley (Liverpool) - 88 OVR\n- CB: Giorgio Scalvini (Atalanta) - 88 OVR\n- CDM: Kyra Cooney-Cross (Arsenal Women) - 88 OVR\n- CB: Malick Thiaw (Milan) - 87 OVR\n- LM: Kessya Bussy (Paris FC Women) - 87 OVR\n- CM: Hugo Larsson (Eintracht Frankfurt) - 87 OVR\nAs well as the players, @Fut_Scoreboard has revealed that when Future Stars is released, we can now complete two Evolutions at the same time, a feature that the Ultimate Team community has been screaming out for.\nEA FC 25 Future Stars predictions\nThese are our predictions for players who could feature in the EA FC 25 Future Stars promo across either Team 1 or Team 2, along with predicted ratings:\n- CM: Joao Neves (Paris Saint-Germain) - 90 OVR\n- ST: Endrick (Real Madrid) - 90 OVR\n- ST: Melchie Dumornay (Lyon Women) - 90 OVR\n- ST: Jhon Duran (Aston Villa) - 89 OVR\n- LM: Jamie Gittens (Borussia Dortmund) - 89 OVR\n- CB: Pau Cubarsi (Barcelona) - 89 OVR\n- CDM: Romeu Lavia (Chelsea) - 88 OVR\n- CM: Aleksandar Pavlovic (Bayern Munich) - 88 OVR\n- CAM: Vicky Lopez (Barcelona Women) - 88 OVR\n- RW: Maghnes Akilouche (Monaco) - 88 OVR\n- LW: Kenan Yildiz (Juventus) - 88 OVR\n- LB: Milos Kerkez (Bournemouth) - 87 OVR\n- CM: Lucas Bergvall (Tottenham) - 87 OVR\n- LM: Antonio Nusa (RB Leipzig) - 87 OVR\n- GK: Guillaume Restes (Toulouse) - 87 OVR\n- ST: Samu Omorodion (Porto) - 86 OVR\n- CB: Naomi Layzell (Manchester City Women) - 86 OVR\n- CM: Benjamin Cremaschi (Inter Miami) - 86 OVR\nEA FC 25 Future Stars expected content\nWith Future Stars based on young players developing into the world's best, there are set to be some huge Evolutions released during the promo's duration, which is likely the reason EA is increasing the number of Evolutions able to complete at once. These Evolutions should boost low-rated youngsters into world beaters, while there are more Future Stars players set to go live as SBCs.\nThere have always been cool Future Stars-themed Objectives available that we should see return in EA FC 25, as well as some Future Stars-themed Rush events.",
  "word_count": 873,
  "scraped_at": "2026-02-14T12:53:19.903310"
}