{
  "article_id": "671a4104cb8d",
  "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-women/2023/11/15/23961645/official-emma-hayes-appointed-new-uswnt-head-coach-on-record-breaking-deal",
  "title": "Official : Emma Hayes appointed new USWNT head coach on record - breaking deal",
  "date": "20231115T044500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The US Soccer Federation have confirmed the appointment of Emma Hayes as the next head coach of the US Women’s National Team, confirming rumors that have been swirling since Chelsea announced her impending departure.\nOfficial: Emma Hayes appointed new USWNT head coach on record-breaking deal\nCongrats!\nAs expected, Hayes will officially start in her new job at the conclusion of the Chelsea club season in May. Current interim manager Twila Kilgore will guide the USWNT until then, at which point she’s expected to remain on Hayes’ staff as assistant. (Hayes is expected to take some of her current Chelsea staff with her as well.)\nThe USWNT collective bargaining agreement guarantees equal pay between the men’s and women’s teams, and that extends to the coaching positions as well. That means Hayes’ salary will match USMNT head coach Gregg Berhalter’s (officially listed at $1.6m, annually, before his recent raise), and will thus be a record for women’s football.\nHayes has already talked about her personal reasons for leaving Chelsea and re-prioritizing her life in the process, but this position is undoubtedly one of the greatest honors in the women’s game, and a well deserved reward for all her successes with the Blues.\n“This is a huge honour to be given the opportunity to coach the most incredible team in world football history. The feelings and connection I have for this team and for this country run deep. I’ve dreamed about coaching the USA for a long time so to get this opportunity is a dream come true.\n“I know there is work to do to achieve our goals of winning consistently at the highest levels. To get there, it will require dedication, devotion and collaboration from the players, staff and everyone at the U.S. Soccer Federation.”\n-Emma Hayes; source: The Athletic\nHopefully we can add a few more trophies to our collection as well before her departure.\nCongrats, Emma!",
  "word_count": 317,
  "scraped_at": "2026-02-14T12:56:56.871160"
}