{
  "article_id": "6721d69f2bf6",
  "url": "https://theathletic.com/4644056/2023/07/18/womens-world-cup-2023-united-states-team-guide/",
  "title": "Women World Cup 2023 : United States team guide",
  "date": "20230718T051500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The United States are really good at winning the Women’s World Cup, having done so in half of the eight played so far — in 1991, 1999, 2015 and 2019 — and never finishing lower than third, which they have done three times (they were runners-up in the other one).\nThe 1999 tournament on home soil was a formative event in the U.S., making stars out of players such as Mia Hamm and Brandi Chastain. In the most recent edition, the USWNT made headlines for big scorelines and for suing their own football federation in pursuit of equal pay. No team — men’s or women’s — has won three World Cups in a row, and that’s the exact sort of challenge this group loves to embrace.\nGO DEEPER\nA guide to Group E at the Women's World Cup: The start of USWNT's toughest challenge yet?\nManager\nVlatko Andonovski took over as head coach in late 2019 after many successful years coaching in the NWSL, the top U.S. club competition. Managing the number one-ranked national team in the world means massive expectations, and Andonovski stumbled during his first major tournament (the Tokyo Olympics two years ago, where the USWNT won bronze after losing to eventual gold medallists Canada in the semi-finals). Can he silence the doubters by getting it right this summer?\nAdvertisement\nFormation\nLine-up graphics will show you a 4-3-3, but on the field it can look more like a 4-4-1-1 or 4-2-3-1, with Alex Morgan up top. Always expect overlapping runs on the wings.\nThree key players\nIf the Americans do end up winning it all again this summer, they’ll thank the young guns such as forward Sophia Smith and center-back Naomi Girma. Smith has been on an outrageous run of form with NWSL champions Portland Thorns, and Andonovski expects her to be a key figure in this forward line. Girma, voted both rookie of the year and defender of the year last season in the NWSL, has a chance to show she can lead this team defensively at the age of 23.\nGoalkeeper Alyssa Naeher was viewed as the weak link by opponents at the previous World Cup in France four years ago but came up with crucial saves at crucial moments. The team will need a repeat in Australia and New Zealand.\nNotable absences\nBecky Sauerbrunn, Mallory Swanson, Catarina Macario, Christen Press and Sam Mewis are only the start of the list of players who missed out on the final roster or even consideration entirely.\nStrength\nThe USWNT will have to rely on the two major strengths that have always distinguished their team: depth and mentality. Even with all the injuries, the talent is still there.\nQuestion mark\nWhat exactly is happening in the midfield? It’s an evergreen question, complicated by concerns over Rose Lavelle’s fitness levels after nursing a knee injury for the past few months. The ideal midfield combo is Julie Ertz, Lindsey Horan and Lavelle. Trouble is, of the three only Horan might be ready for a starting role initially this summer.\nGO DEEPER\nRose Lavelle breaks down her most famous goal, dribble, and some back-heel assists\nWildcard\nIn a completely different direction from most teams going to this World Cup, the U.S. wildcard is a veteran player and a famous one at that: Megan Rapinoe. Though she’s 38 now and has announced that she will retire at the end of the NWSL season, Rapinoe knows how to close out games.\nGO DEEPER\nA decade of Megan Rapinoe shows how far women's soccer has come\nQualification/recent form\nQualification came easily, but expect lots of talk about last fall’s three-game losing streak against England, Spain and Germany, devoid of the context of the NWSL abuse scandal surrounding those matches.\nAdvertisement\nGroup difficulty\nTrickier than first expected, especially after their opening opponents Vietnam were only narrowly beaten 2-1 by Germany in late June. The big must-win is against 2019 World Cup finalists the Netherlands in Wellington, a game likely to decide who advances as the group winner and therefore earns a theoretically ‘easier’ game in the round of 16. Andonovski might rotate for game two against Portugal, but the U.S. can’t take that one for granted either.\nTravel schedule\nNew Zealand will see quite a bit of the Americans, with their group matches bouncing between Auckland and Wellington, and their ideal run through the final bringing them back to those cities in the knockout phase. It’s definitely one of the easier travel schedules in the tournament.\nTo win the World Cup, they will need…\n…a little bit of everything — and a comprehensive team performance. We thought France 2019 was their biggest challenge yet, but that has nothing on being crowned world champions for a third consecutive time.\nDid you know?\nMidfielder Savannah DeMelo, 25, was the first uncapped player to make the USWNT World Cup roster since Shannon Boxx in 2003 — and only the third overall. DeMelo could make her full international debut at this World Cup, having come on as a substitute to play 27 minutes in the 2-0 win over Wales on 9 July.\nPossible starting XI\n(Top photos: Getty Images; design: Eamonn Dalton)",
  "word_count": 862,
  "scraped_at": "2026-02-14T13:27:12.256989"
}