{
  "article_id": "672748342084",
  "url": "https://www.eastvillagetimes.com/san-diego-wave-hosts-rivals-angel-city-for-first-time-in-2023-nwsl-season/",
  "title": "San Diego Wave host Angel City FC / San Diego Wave - EVT",
  "date": "20230617T050000Z",
  "domain": "eastvillagetimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "San Diego Wave host rivals Angel City for first time in 2023 NWSL season\nGame: San Diego Wave FC vs. Angel City FC\nWhere: Snapdragon Stadium, San Diego\nWhen: Saturday, June 17, 2023\nTime: 1:00 p.m. PST\nTV: CBS\nThis Saturday, June 17, San Diego Wave FC will host rivals Angel City FC at Snapdragon Stadium for the first time in the 2023 NWSL season. This will be the second meeting between both teams this season, as the Wave came away with a huge 2-0 win at BMO Stadium in their first clash of the season.\nSofia Jakobsson and Makenzy Doniak scored the two goals in that match off the bench, as both players have started more frequently since then. Jakobsson, especially, has become a consistent starter and has now earned a spot on the Sweden roster for the 2023 FIFA Women’s World Cup in Australia and New Zealand.\nIt was also announced this week that Naomi Girma signed a new contract through the 2026 season. The Wave had a busy week heading into this rivalry match at Snapdragon Stadium, coming in first place on the NWSL league table. San Diego is undefeated in five consecutive league games, coming off a scoreless draw against Racing Louisville away from home.\nUnfortunately, the Wave suffered a 3-0 loss to OL Reign in the Challenge Cup in their last game at home and will be looking to come back from that result. It was the worst home loss in San Diego Wave FC franchise history, as the team looks to please the home fans on Saturday afternoon.\nSan Diego has been excellent defensively all season but recently has been even more impressive, only allowing a maximum of a goal in each of their last five league games. The Wave has kept four clean sheets in this run, as Kailen Sheridan and Naomi Girma have been huge factors in this superb run of form.\nAlex Morgan unexpectedly was given a rest for the last game against Louisville by coach Casey Stoney but is set to be back for this match.\nAngel City has had a very rough season, currently in penultimate place on the NWSL league table with nine points. The Los Angeles team is winless in their last six games in all competitions, coming off a 2-1 loss against the Washington Spirit away from home. Angel City has been outscored 12-5 in these last six games and recently parted ways with Head Coach Freya Coombe, as former Assistant Coach Becki Tweed will act as interim head coach for this match.\nAngel City has allowed the second-most goals in the 2023 NWSL season so far but still has an intriguing squad with players like Julie Ertz and Alyssa Thompson. Scottish player Claire Emslie has also been a shining light in a lackluster season, currently with three goals and three assists in league play.\nA big and vibrant crowd is expected at Snapdragon Stadium for this match with the history the two teams have and the already present rivalry between the two Southern California cities. Despite the disparity between both teams currently, this has the potential to be a very entertaining match this Saturday at the Mission Valley fortress.\nFrancisco, 28, Chula Vista/Tijuana. I have been a Padres fan all my life, did most of the series previews and recaps in the Padres’ 2016 season for EVT. Now I focus more on the local soccer scene. Tijuana Xolos, San Diego FC, San Diego Wave. I have covered Liga MX, MLS, Mexico National Team, USWNT, Copa América and European clubs like Manchester United and Borussia Dortmund.",
  "word_count": 600,
  "scraped_at": "2026-02-14T12:14:39.892987"
}