{
  "article_id": "673a465c085c",
  "url": "https://www.cerescourier.com/news/local/looking-back-over-the-top-stories-of-2024/",
  "title": "Looking back over the top stories of 2024 - Ceres Courier",
  "date": "20241231T190000Z",
  "domain": "cerescourier.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Awards, community events, council decisions, major crashes and elections all were part of a memorable 2024 for the Ceres community.\nPicking the most significant news articles of any year is a subjective undertaking but we took our stab at it. The year 2024 left us with a number of memorable items to report about so here is a month-by-month look back at some noteworthy events we covered.\nJanuary\nThe new year started with a community flap over the murals painted on the walls of the VIP Smoke Shop at El Camino Avenue and Fifth Street in downtown Ceres. After seeing the new artwork, City Manager Doug Dunford said the standards for murals will be addressed. The images included the late Bob Marley taking a hit from a hookah, a cartoonish Cheech and Chong riding in a smoke-filled van and Bart Simpson spray-painting graffiti. The business later modified some of the artwork.\nA frightening scenario unfolded Jan. 15 when an RV became fully engulfed in flames near the gas pumps at the Herndon Road Chevron station. Firefighters responded and quickly extinguished the flames but the RV was totally destroyed while some gas pumps and canopy over the gas island were badly charred. Two occupants of the RV were treated and transported to a local emergency room after they tried unsuccessfully to put out the fire themselves.\nOn Jan. 16 the Ceres Planning Commission approved a Conditional Use Permit (CUP) to allow construction of a 92,248-square-foot Ceres Self Storage self-storage facility at 3418 Mitchell Road north of Westward-Ho Mobile Home Park. The project has not broken ground as of year’s end.\nTwo persons who were engaged in a Jan. 18 high-speed pursuit with a Ceres Police officer were killed in a crash at Keyes and Geer roads north of Turlock. Three others in the two vehicles sustained major injuries. Ceres officers were not involved in the collision and attempted to rendered medical aid to the victims.\nBrandy Meyer was named “Ceres Citizen of the Year” at the 55th annual Community Service Awards & Installation Dinner sponsored by the Ceres Chamber of Commerce. Meyer, who not only is president of the Ceres Chamber of Commerce and active in Soroptimist International of Ceres and serves on a myriad of committees, was chosen by past award recipients. Other awards doled out that night included:\n• “Distinguished Service award” – Project Yes;\n• “Young Citizen of the Year” – Tanveer Kaur;\n• “Volunteer of the Year” award – Daniel Martinez;\n• “Small Business of the Year” – Exit Realty;\n• “Large Business of the Year” – Ceres Partnership for Family Resource Center;\n• “Legacy Award” – Stanislaus County Farm Supply.\nFebruary\nThe city of Ceres terminated Christopher Hoem as its Community Development Director. Hoem was sharply criticized by Tamra Spade who was fired September 2023 as the city’s Economic Development manager. Spade believed that her criticisms of Hoem, her boss, led to her dismissal. Shortly after her dismissal, Spade described Hoem’s department as “toxic.”\nChris Perry became the new police chief of Ceres after a 4-1 vote of the Ceres City Council. He replaced Rick Collins who retired on Jan. 5. Councilman James Casey did not approve of the selection process, saying he expected the council to have some input on the hiring process of the police chief.\nMarch\nThree persons were arrested March 19 after wretched living conditions unfit for human habitation were discovered by authorities in the 1900 block of Hollister Street in Ceres. A total of 84 dogs were kept inside a home and the stench of feces and ammonia from urine in the unit brought oxygen levels to only 16 percent, caused Modesto firefighters to don hazmat suits.\nA minor and a senior were taken from the home and looked after while Ceres Police arrested three on charges of child abuse, elder abuse and animal cruelty. Booked into the Stanislaus County Public Safety Center were Lissette St. Denis, 43, Seth Badal, 43, and Freddy Vasquez, 22.\nApril\nA total of 276 volunteers, many from Ceres churches, turned out the morning of Saturday, April 27 to carry out 17 community service and work projects as part of “Love Ceres.”\nLea Simvoulakis was named the city’s new director of Community Development to replace Christopher Hoem, who was terminated on Feb. 26. Simvoulakis came to the city of Ceres as the deputy director for Manteca’s Development Services Department. She previously was Hughson’s Community Development Director.\nAbout 29 workers employed at the Hatch Road 99 Cents Only store lost their jobs after the April 5 announcement that the chain is closing all 371 nationwide locations.\nThe Ceres Planning Commission approved a Conditional Use Permit to allow Ceres’ first-ever “grub hub” to operate on a 0.75-acre parcel within the industrial park south of Service Road and east of Farm Supply Drive. By year’s end the 16,000-square-foot 18-vehicle food vendor court had yet to be open.\nCeres Mayor Javier Lopez delivered his annual “State of the City” address before a crowd of about 100 persons April18, highlighting accomplishments of the city and presenting glowing forecasts about Ceres’ future.\nMay\nThe first weekend in May brought another successful Street Faire to Ceres and its first-ever low rider show.\nClarissa Farinelli was named “Agribusiness Woman of the Year” at the Ceres Chamber of Commerce’s 37th annual Agribusiness Awards Luncheon held at the Diamond Bar Arena in rural Ceres. The event also paid homage to the late John G. Franzia, co-founder of Bronco Wine Company, with the posthumous “Agribusiness Man of the Year” award.\nThe Chamber also honored Brandi LoForti with the Grant & Mildred Lucas Memorial Award while Farmers Warehouse received the “Agribusiness of the Year” award.\nJune\nStrong winds grounded a number of hot air balloonists during the June 15 “Skies the Limit” festival at Ceres River Bluff Regional Park. But the disappointment was broken when one balloon got off the ground to please the crowd. Two balloons were inflated with hot air, dazzling thousands of spectators who were shooting photos with their cell phones and cameras.\nThe Ceres City Council dipped into reserves by $635,504 to balance the 2024-25 Fiscal Year budget and partially fill a $2.13 million gap. The city also froze 10 positions, five of them police officers.\nThe end of the school year saw Ceres Unified School District Supt. Dr. Denise Wickham retire and replaced by Amy Peterman who was Deputy Superintendent of Educational Services.\nKevin Wise was named fire chief of Modesto, which effectively made him fire chief of Ceres since the city of Ceres contracts for fire service from its neighbor to the north.\nIn 2019 Wise was tapped as chief of the Ceres Fire Department, a position he held for two years until leaving to become deputy fire chief for the city of Fremont. In short time he became deputy chief of Modesto Fire so when Ceres chose to contract for fire suppression services with Modesto, Wise was back overseeing operations in Ceres.\nJuly\nThree occupants of a Jeep SUV fleeing from a pursuing California Highway Patrol officer suffered major injuries on July 23 when they crashed on the Mitchell Road freeway off-ramp and had to be extricated from the burning wreckage. The driver was a 17-year-old Modesto boy who was arrested but taken to a local hospital for treatment of major injuries. The right front passenger, a 16-year-old boy from San Lorenzo, and the 20-year-old Hayward man sitting in the back seat both sustained major injuries and were rushed to the hospital.\nThe Ceres City Council made a controversial decision on July 22 to spend up to over a half-million dollars to build a new gazebo in Whitmore Park to replace the one built in 1988. The council approved a $491,649 contract with Sinclair General Engineering Construction Inc. of Oakdale. A 10% contingency of $49,164.90 means the total cost could reach $540,813. The city used federal ARPA funds and $208,214 from a grant from the State of California Department of Parks and Recreation.\nAugust\nPublic safety dispatchers and a variety of other city employees were given a 12 percent wage hike following the Ceres City Council’s August ratification of the Memorandum of Understanding (MOU) with their union. The pay increase consists of an 8 percent cost of living increase coupled with an additional 4 percent equity adjustment. The agreement applies to all public safety dispatchers, wastewater operators and water distribution operators. Late in 2023 the council began hearing a drumbeat of complaints from dispatchers that pay and long work hours were causing burnout and employees to abandon their important posts for better paying cities. City Manager Doug Dunford said that the equity increase is an effort to bring Ceres’ wages more in line with what other cities are offering and prevent the hemorrhaging of employees to other agencies.\nCeres city officials were red-faced after an ill-timed proposal that would have financially impacted the Ceres Youth Soccer Organization and raised the ire of its officials.\nAt the Aug. 12 Ceres City Council meeting, Lou Toste, president of Ceres Youth Soccer Organization (CYSO), protested the city’s plan to require it to pay $47 more per player for use of the soccer fields at Ceres River Bluff Regional Park. The city since backed off of the request. Approximately 1,000 youth play soccer annually in the league. They pay $100 to CYSO to play, of which $7 goes to the city of Ceres. City Manager Doug Dunford said he was unaware that sign-ups for the fall league began in May and acknowledged that “it was stupid to start that late” in negotiations.\nCeres High School’s aging football stadium was transformed into a state-of-the-art facility thanks to a $7.8-million project that began in spring. Upgrades include an AstroTurf Field, an all-weather track, a new electronic scoreboard and air conditioning in the snack bar and team rooms.\nSeptember\nSpeculation about what will fill the abandoned Walmart store building at Hatch and Mitchell roads ended in September when the Courier published that Vallarta Supermarket and Ross Dress For Less plan to occupy most of it. Vallarta Supermarkets signed a lease for 60,585 square feet of space, and plans to open in Ceres by the summer of 2026.\nThe city held a grand opening ceremony on Sept. 12 heralding the completion of improvements for Guillermo Ochoa Park in the Eastgate community of Ceres. The park was completed with an irrigation system, grass, picnic tables and two small picnic shelters, a Pickle ball court, volleyball sand pit, half court for basketball, a children’s play area, park benches and other amenities. The council had to juggle funds by using $2.1 million in federal ARPA funds – after reassigning the $650,000 initially designated to start Lions Park in north Ceres – coupled with $172,000 in neighborhood park development fees.\nIn September Ceres native Chad Condit filed suit against his former boss, California State Senator Marie Alvardo-Gil, making explosive accusations that she sexually abused him and exercised an “abuse of power” while he served as her chief of staff. Condit, who was fired by Alvarado-Gil effective Dec. 31, 2023, is seeking compensation for lost wages, loss of earning capacity, employee benefits and damages for emotional distress. In a complaint filed in Sacramento Superior Court, Condit’s attorneys claim that the senator began grooming Condit for sexual favors beginning in December 2022. That led to him occasionally performing oral sex on her until an encounter in which he injured his back, he alleges.\nAlvarado-Gil said Condit’s charges were lies, insisting that he had a drinking problem, became threatening to her and that his back injury occurred when he visited Disneyland.\nAt a special Ceres Police Department ceremony held Sept. 12 Ceres Police Chief Chris Perry promoted Matt Vierra and Aaron Pinion from officers to sergeants; Jeff Godfrey from sergeant to lieutenant; and Trenton Johnson from lieutenant to captain.\nChief Perry also honored Michael Vierra as “Sergeant of the Year”; Kiashira Ortiz as “Officer of the Year”; Jerry Kessler as “Reserve Officer of the Year”; Desirae Gutierrez as “Dispatcher of the Year”; and Jack Taylor as “Professional Staff of the Year.”\nOctober\nCeres Police Chief Chris Perry and the city of Ceres were named in a lawsuit filed on Oct. 2 by police detective Matthew Berlier who accused the chief of discrimination based on family and/or marital status, sexual harassment and creating a hostile workplace environment. Berlier claims that then Lt. Perry in July 2019 “began to systematically and pervasively make derogatory remarks” about his appearance. Berlier claims he was bypassed for a sergeant position even though he ranked the first among nine applicants on a promotional exam. The court filing noted that two presidents of the Ceres Police Officers Association addressed multiple concerns about Perry’s leadership on behalf of all members and that Perry stated his opinion that many of the police department’s problems were caused by Berlier being upset that he wasn’t promoted.\nCity officials heralded renewed interest to complete the unfinished Tuscany Village gated community project on Whitmore Avenue which was stalled in construction for two years since being approved by the Ceres Planning Commission in May 2006. The project will be finished about mid-year 2025 thanks to the bank’s decision to work in partnership with the Stanislaus County Regional Housing Authority and A&M Affordable housing developer.\nThe city’s crackdown on illegal carports raised hackles among some homeowners who erected them. They took their complaints to the Ceres City Council which seemed open to considering relaxing zoning standards. The Ceres Municipal Code does not allow carports and city officials have notified a number of residents to take theirs down.\nRuldip “R.J.” Jammu and Dr. Dorie Perez were appointed by the city council on Oct. 14 to join the Ceres Planning Commission. The two are replacing longtime commissioners Bob Kachel and Gary Del Nero who both retired in December.\nThe Ceres City Council voted 4-1 on Oct. 14 to unfreeze three police officer positions with the use of nearly $700,000 in general fund budget reserves. The action drops the city’s savings level from $6.1 million to $5.4 million, meaning the reserves will be at 18 percent of its general fund, the bare minimum established by prior city councils.\nAfter a year of operation, the Big Lots! store at 1611 E. Hatch Road closed in October. The Ohio-based retail chain filed for Chapter 11 bankruptcy protection and ordered the closing of 390 stores, including 48 in California.\nNovember\nCeres Mayor Javier Lopez was re-elected to another four-year term, defeating Gary M. Condit and Rosalina Vierra. Planning Commissioner Cerina Otero defeated Councilman and Vice Mayor Bret Silveira.\nVoters in the Ceres Unified School District approved Measure Y on Nov. 5 that will increase assessments on property tax bills to improve Ceres school campuses.\nThe bond measure passed with 64.34 percent approval to clear the way for CUSD to issue $114 million in bonds to repair or upgrade Ceres elementary, middle, and high schools; improve campus safety and security systems; repair or replace leaky roofs, upgrade outdated heating, cooling, plumbing, electrical systems; repair or replace deteriorating portable classrooms; and update classroom equipment and learning technology.\nThe Ceres Unified School District board gave a heartfelt sendoff to retiring board trustee Faye Lane at its Nov. 14 meeting, lauding her for 16 years of service. First elected to the School Board in 2007, Lane decided against a fifth term and was replaced by Alondra Reyes, the lone candidate for the Area 4 seat.\nAfter years of design work that cost millions of dollars, Ceres city officials now say a new Mitchell/Service freeway interchange is way too expensive to build and are now looking at a new and less costly design option.\nIn November City Engineer Michael Beltran delivered that shocking news to the Ceres City Council that plans for a new interchange at Service and Mitchell roads is now unfeasible due to costs. In 2017 when the council chose a diverging diamond design for a new Service Road overpass as the best to handle traffic volumes into 2040, cost estimates were pegged at $120 million to $135 million. In time the cost “blew up” to $220 million to $250 million, said Beltran, and by the time of construction could approach $300 million. A new conceptual design has been conceived that could reduce the costs to $85 million to $105 million simply by scrapping the idea of shifting Highway 99 some 80 feet to the east which would eliminate a “huge cost …and a lot of time.”\nOn Nov. 18, the Ceres Planning Commission approved a 5,951-square-foot Maverik convenience store and 24-pump fueling station to the “island” at the southeast corner of Mitchell and Rohde roads near the freeway. At least one business owner vowed to appeal.\nDecember\nIt took weeks for election officials to determine that Democrat Adam Gray, a former five-term Assemblyman unseated incumbent Rep. John Duarte (R-Modesto) in the closest House race — and the last to be called — in the nation. Duarte fell 187 votes short of retaining his seat in the 13th Congressional District.\nNick the Greek opened on Dec. 3 in the Ceres Gateway Center conjoined with the Union 76 station. The restaurant had planned to open on Nov. 6 but there was an issue with PG&E failing to provide gas needed. At 4213 Mitchell Road, the Ceres location of Nick the Greek is the first one in California with a drive-through lane.\nAs Nick the Greek opened, Pollo Campero announced it would not be coming to Ceres even though the Ceres Planning Commission unanimously approved a site plan to construct a 2,619-square-foot restaurant at 1355 E. Hatch Road. The chain did not disclose why they abandoned plans but some speculate it’s because Mayor Javier Lopez hinted that an appeal of the commission decision would be supported by the council. Lopez publicly criticized the project, opining that Hatch Road would have too many chicken restaurants.\nA new face joined the Ceres City Council on Dec. 9 with the installation of Cerina Otero to the District 3 seat, marking the second time in Ceres’ history that two women have simultaneously served on the council.\nOtero won the seat by defeating incumbent Councilman Bret Silveira in the Nov. 5 election. Also administered the oath of office, by City Clerk Fallon Martin, are returning members Mayor Javier Lopez and Councilman Daniel Martinez. All three were elected to four-year terms ending in 2028.\nSinclear Elementary School mourned the loss of teacher Jennifer Lourenco, 45, who was killed Dec. 15 with husband Daniel, son Matthew and daughter Madelynn Lourenco in a grinding crash on Lander Avenue south of Turlock. Uriel Guizar-Negrete, 22, driver of the other vehicle, was also killed.\nObituaries\nThe year was filled with significant losses of folks who either lived in Ceres currently or distantly or affected Ceres in some way. Here are some of the obituaries we printed in our pages in 2025.\nRichard “Dick” Jay Monteith, who served in the California State Assembly representing Ceres and a former Stanislaus County County Supervisor died on March 6 at the age of 92.\nCeres businessman Bill Ledbetter who owned Bill’s Drywall on Railroad Avenue died March 12 at age 84.\nThe community of Ceres mourned the death of Sally Estrada, a long-time Ceres Police and city employee who worked tirelessly through the decades. Estrada, 65, was recently diagnosed with a rare and aggressive form of lung cancer which quickly took her life in June.\nTruman Showen, who served the Ceres Fire Department for four decades and was the first paid fire chief in Ceres, passed away on Nov. 12 at the age of 90.\nCoach and Lions Club member Jimmy Scott “Scotty” Smith passed away on April 12.\nJohn Franzia who helped launch the successful Bronco Wine Company south of Ceres, died at his home in Modesto in April. He was 84.\nCurtis Hoover Holley, former owner of Ceres Video and member of the Ceres Lions Cub, died June 9.\nFormer Ceres Police reserve officer Irvin Park Sr. of Ceres passed away June 26 at age 88.\nHughson High School senior Abbegail Stoneham, 17, was killed in a Wednesday afternoon, Oct. 16 crash at Roberts Ferry east of Waterford, leaving her family, friends and the Hughson community in mourning.\nCeres native John Walter Hidahl who became an El Dorado County Supervisor died Nov. 2. He was the son of Joel and Margaret Hidahl for whom the Ceres school was named.",
  "word_count": 3405,
  "scraped_at": "2026-02-14T13:32:20.252963"
}