{
  "article_id": "674eb0b6ba46",
  "url": "https://www.voanews.com/a/7735163.html",
  "title": "The Inside Story TRANSCRIPT",
  "date": "20240808T211500Z",
  "domain": "voanews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Transcript:\nThe Inside Story: USA Votes 2024\nEpisode 156 – August 8, 2024\nShow Open:\nThis week on The Inside Story:\nThe pick is in.\nVice President Kamala Harris names Minnesota Governor Tim Walz as her running mate\nWe’ll introduce you to this former public school teacher… and examine what he brings to the Democratic ticket for the White House.\nAlso: how does he match up against former president Donald Trump’s running mate: the youngest vice-presidential candidate in history.\nSee what JD Vance’s fellow millennials are saying about his campaign… and meet his wife, the daughter of Indian immigrants.\nPlus, following the biggest prisoner swap since the Cold War... we speak with our colleague now that she’s out of Russian custody.\nNow on The Inside Story… USA VOTES 2024.\nThe Inside Story:\nJESSICA JERREAT, VOA Press Freedom Editor:\nHello and welcome to The Inside Story.\nI’m VOA Press Freedom Editor Jessica Jerreat.\nDemocratic …Presidential … nominee and current U.S. Vice President Kamala Harris announced her pick for running mate this week. Looking to maintain a wave of Democratic enthusiasm -- and an influx of cash -- into campaign coffers.\nHer pick? Tim Walz .... A popular governor of Minnesota who is also a National Guard Veteran, supporter of women’s reproductive rights, AND a former public-school teacher.\nHarris chose the swing state of Pennsylvania to introduce Walz to the nation.\nVOA’s Senior Washington Correspondent Carolyn Presutti was there, and she starts off this week’s show.\nCAROLYN PRESUTTI, VOA Correspondent:\nIn a town where the Founding Fathers declared independence -- Philadelphia on Tuesday, showing off the peaks of democracy, with both political parties.\nFor the first time, Vice President Kamala Harris, the presumptive Democratic presidential nominee, introduces her running mate, Minnesota Governor Tim Walz.\nKamala Harris, Vice President:\n“Tim and I have a message that we won’t turn back fundamental freedoms.”\nCAROLYN PRESUTTI:\nArmy soldier turned high school teacher turned football coach turned politician, Walz directly attacked the Republican ticket.\nTim Walz, Democratic Vice Presidential Pick\n“I’ll just say it: Donald Trump and JD Vance are creepy and, yes, as weird as hell.”\nCAROLYN PRESUTTI:\nSome democrats say Walz will bring back former Trump Democrats from swing states.\nDan Ladise, Harris Voter:\n“I think that’s a core demographic that the Harris campaign will have to win. And I think Tim Walz really speaks to those voters.”\nCAROLYN PRESUTTI:\nJust a few hours prior --- on the other side of town….\n…the other side.\nRepublican Vice Presidential Nominee JD Vance held his own rally with a unique twist – answering questions from the media.\nRepublican Vice Presidential Nominee JD Vance:\n“Let’s talk a little bit about foreign policy…”\nCAROLYN PRESUTTI:\nAnd with some sharp words for Harris’ running mate.\nRepublican Vice Presidential Nominee JD Vance:\n\"Tim Walz’s record is a joke. He's been one of the most far-left radicals in the entire United States government at any level.\"\nCAROLYN PRESUTTI:\nVance struck out at Democrats on immigration, fentanyl and the economy, calling the stock market drop “The Kamala Crash.”\nUndecided voter Wayne Eastman carried Vance’s memoir as he stood in line to see the rally.\nWayne Eastman, New Jersey Undecided Voter:\n“It’s unusual to have a politician who’s a writer, too, so I’m curious.”\nCAROLYN PRESUTTI:\nIn 90 days, U.S. voters will make the decision between a former president and a current vice president. But the Harris team is pushing a chant to avoid a Trump repeat.\nFrom here, the Harris/Walz team visits five more battleground states in the next five days: Wisconsin, Michigan, North Carolina, Arizona and Nevada.\nJESSICA JERREAT:\nWhen it comes to picking a running mate in the presidential elections, there’s a saying: “do no harm.”\nAnd now that we’ve met both parties’ nominees, the question is … how will either candidate help the person running for president?\nVeronica Balderas Iglesias looks at the historical relevance of VP’s … and what Tim Walz -- or JD Vance -- bring to their respective tickets.\nVeronica Balderas Iglesias:\nWith great confidence in her decision, Vice President Kamala Harris introduced Minnesota Governor Tim Walz as her running mate on Tuesday in Pennsylvania.\nKamala Harris, Democratic Presidential Nominee:\n“In his state he has been a model chief executive, and with his experience, I’m telling you, Tim Walz will be ready on day one.”\nVeronica Balderas Iglesias:\nRepublican presidential nominee Donald Trump also hails the political record of his running mate, Ohio Senator JD Vance.\nBut the former president recently downplayed the importance of vice presidential picks.\nDonald Trump, Republican Presidential Nominee:\n“I think this is well documented historically the vice president, in terms of the election, does not have any impact. I mean, virtually no impact.//It's all about the presidential pick.”\nVeronica Balderas Iglesias:\nScholars explain that because vice presidents operate in the shadow of the U.S. president, their role is often misunderstood and unappreciated.\nThey are however, the first in the line of succession when a president can no longer serve and key to advancing their party’s political agenda.\nJoel Goldstein, Vice Presidential Scholar:\n“Their role is really to act as a subordinate, to help promote and pursue the president’s policies and to expand the president’s ability to function as a national and international leader.”\nVeronica Balderas Iglesias:\nTo a certain extent, VP picks can boost presidential campaigns, Goldstein says.\nJoel Goldstein, Vice Presidential Scholar:\n“Bill Clinton's pick of Al Gore in 1992 was a very good pick. The combination of these two young southern centrist baby boomers really sent a message of generational change.”\nVeronica Balderas Iglesias:\nA “bad pick” is how the analyst described Republican Senator John McCain’s decision to have Governor Sarah Palin as his running mate in 2008.\nJoel Goldstein, Vice Presidential Scholar:\n“She really became a figure who was parodied during the campaign, and I think, ended up hurting the McCain ticket. It wasn't the reason that Senator McCain lost.”\nVeronica Balderas Iglesias:\nThis election cycle, Tim Walz’s credentials and his focus on pro-family economics is what the Harris campaign is betting on.\nElisabeth Clemens, Political Sociologist:\n“A version of being pro-family that is not about the control of reproduction but is about the economic support of families, be that education, health care, housing, job development.”\nVeronica Balderas Iglesias:\nJD Vance will help advance the Republican narrative, says analyst Peter Loge.\nPeter Loge, The George Washington University:\n“The narrative they’re telling that is, you know, there used to be an America where if you worked hard, played by the rules, middle-class hardworking family, you could succeed – and that that America is now gone and if you vote for them, that America will come back.”\nVeronica Balderas Iglesias:\nEven if vice presidential candidates rarely make a major difference in elections, analysts say U.S. voters will pay attention to how well the current VP picks listen to the electorate and channel their concerns.\nJESSICA JERREAT:\nA lot has been made over the age of candidates in this year’s election. And, with President Joe Biden announcing he’ll no longer seek reelection, that makes former president Donald Trump the oldest person ever to receive their party’s nomination.\nAnd his running mate, Ohio Senator Vance, is the youngest person –and first millennial--to ever receive the vice-presidential nomination.\nElizabeth Cherneff spoke to millennial voters to get their perspective.\nElizabeth Cherneff :\nJD Vance will be one of the youngest U.S. vice presidents if he wins election with Donald Trump in November.\nVance and his wife, Usha, are both members of the millennial generation – a demographic group the Pew Research Center says consists of people born between 1981 and 1996.\nMillennials in the U.S. face economic challenges, including high student loan debt and housing costs. They are known for quickly adapting to technology and being shaped by the September 11th, 2001, terror attack, which Vance says changed his life.\nJD Vance, Republican Vice-Presidential Nominee:\n“After 9/11, I did what thousands of other young men my age did in that time of soaring patriotism and love of country. I enlisted in the United States Marines.”\nElizabeth Cherneff :\nTexas millennial Sarah Gardner says Republicans are ready for Vance.\nSarah Gardner, Texas Millennial Voter:\n“We have a lot of older politicians in Washington, and some of them have been there for far too long, so it’s great to have somebody with new ideas that can bring a new perspective and really represent the younger voters.”\nElizabeth Cherneff :\nWith Kamala Harris now the Democratic Party’s likely presidential candidate, public opinion polls are showing a spike in support for her among younger voters.\nKamala Harris, US Vice President:\n\"In this election we know young voters will be key, and we know your vote cannot be taken for granted. It must be earned. And that is exactly what we will do.\"\nElizabeth Cherneff :\nIn California, millennial David Meraz says Harris is the best choice for younger voters.\nDavid Meraz, California Millennial Voter:\n“I think in this moment, to have a competitive race, I think she is a fresh face. I think she has the qualifications to assume the role, and I think she can take it to Trump.”\nElizabeth Cherneff :\nCombined, millennial voters and those from the younger Generation Z make for a powerful voting bloc, says DeNora Getachew, the CEO of DoSomething.org, a group that encourages young people to take part in activism and service.\nDeNora Getachew, DoSomething.org:\n“If they turn out to vote at the same level as they did in 2020, they'll make up 37% of the electorate. Right. So there’s step one: Actually register to vote. Step two: Turn out to vote or 'show up for what,' as we say.”\nElizabeth Cherneff :\nWhile millennial voters are politically diverse, they generally agree on the need for change.\nAshrqat Saleh, New York Millennial Voter:\n“We're seeing America crumble down to the ground. And that's because the people who are elected are not of our age. The next generation are people who are [in their] 20s and 30s and their 40s. Why do we have people in their 50s, 60s, 70s, 80s representing us?”\nElizabeth Cherneff :\nSeventy percent of millennial voters say inflation and cost of living are their top election issues, according to a U.S. News & World Report poll. Those economic concerns rank far ahead of reproductive rights, gun violence, and climate change.\nJESSICA JERREAT:\nMoving now to Israel, where the families of hostages marked 300 days since the Oct 7 Hamas terror attack. The families warn that time is running out. In Gaza, the death toll approaches 40-thousand, according to the Hamas-run Gaza Health Ministry. Local officials there warn of a crisis, as hepatitis cases surpass A hundred-thousand. Linda Gradstein reports from Jerusalem.\nLinda Gradstein:\nThousands of people marched through the streets of Jerusalem wearing labels with the number 300 on them. The march was organized by Rachel and Jon Goldberg-Polin, whose 23-year-old son Hersh was among those kidnapped from the Nova music festival October 7th. They have worked tirelessly for his release.\nRacheli Frenkel, whose 16-year-old son Naftali was kidnapped and killed by Hamas, explains why she and others are marching.\nRacheli Frenkel:\n“To be together; to express the fact that we’re never forgetting. We go to sleep with this at night, we wake up with this in the morning.”\nLinda Gradstein:\nIsraeli Prime Minister Benjamin Netanyahu says he is working to bring the hostages home. But hostage families, and more recently some in his military establishment, have accused him of acting slowly and adding new conditions for a deal with Hamas on a gradual cease-fire that would free the hostages.\nBenjamin Netanyahu, Israeli Prime Minister:\n\"Our long hand strikes in the Gaza Strip, in Yemen, in Beirut and wherever necessary... this hand of ours reaches out when the time comes for peace to those who want to establish peace with us.”\nLinda Gradstein:\nIn Gaza, the death toll is rising, with the Hamas-run Health Ministry saying nearly 40,000 Palestinians have been killed in close to ten months of fighting.\nPalestinian officials warn of a growing health crisis and are calling on the world to intervene.\nDr. Majed Abu Ramadan, Palestinian health minister:\n\"This catastrophe is the result of the spread of urgent diseases, of infectious diseases, whether through water or breathing. There are more than 100 thousand cases of hepatitis, noting that in the year preceding the aggression there were only 85 cases across the Gaza Strip.\"\nLinda Gradstein:\nPalestinian officials say hospitals have stopped functioning and are in urgent need of equipment.\nKhalil Al-Daqran, spokesperson for the Health ministry in Gaza:\n\"We need large quantities of beds, medicines, and medical supplies, as what has been sent is not enough to meet the hospital's needs.\"\nLinda Gradstein:\nMore than 90 percent of Gaza’s two million people have been displaced at least once and are spending the sweltering heat of the summer in tents with no air conditioning and few sanitation facilities.\nThe fighting is showing no signs of letting up, and people on both sides see no hope for an end anytime soon.\nJESSICA JERREAT:\nRepublican VP nominee Vance went to law school at Yale. There he met his wife, Ooh-Sha. She is a first-generation daughter of Indian immigrants. Dora Mekouar has more about Ooh-Sha …and how she figures into a ticket that’s vocally anti-immigration.\nDora Mekouar:\nThirty-eight-year-old Usha Vance entered the national spotlight when she introduced her husband, JD Vance, at the Republican National Convention.\nUsha Vance, Wife of JD Vance:\n\"I met JD in law school when he was fresh out of Ohio State.”\nDora Mekouar:\nThe daughter of Indian immigrants, Usha Chilukuri was born in California and raised Hindu. She and Vance married in an interfaith ceremony in 2014.\nUsha Vance, Wife of JD Vance:\n\"I grew up in San Diego in a middle-class community, with two loving parents, both immigrants from India.”\nDora Mekouar:\nUsha Vance’s parents are academics. As is her great aunt, a physics professor in India, where there is a lot of pride in Usha Vance’s accomplishments.\nC. Santhamma, Great Aunt:\n“I felt very proud of the situation because from my family such a great intellectual has risen. It is something.”\nP Srinivas Raju, Former Village Chief:\n“The news, we heard the news, we got the news and we're really happy.”\nDora Mekouar:\nHer former law firm profile says Usha Vance participated in a media freedom access clinic at Yale and worked at an Iraqi refugee assistance project there. She clerked for both Supreme Court Justice John Roberts and for Justice Brett Kavanaugh when he was at the Court of Appeals.\nAnita McBride, who once served as first lady Laura Bush’s chief of staff, says Usha Vance is well-regarded among Republicans.\nAnita McBride, American University:\n“Super smart, very collegial, got along with everyone and just is a hard worker and a nice person. And you want to hear things like that about people that are maybe in public life. You know, I think it says something about their character that they're well- liked.”\nDora Mekouar:\nUsha Vance’s status as the child of immigrants could help voters from marginalized groups to see her husband in a new light.\nUsha Vance, Wife of JD Vance:\n“He adapted to my vegetarian diet and learned to cook food for my mother. Indian food.”\nKelly Dittmar, Rutgers University:\n“She's validating, and serves as a validator for him, with different potentially different communities who might not think that JD Vance would understand them or perhaps, you know, support or advocate for them.”\nDora Mekouar:\nWhat can the mother of three expect now that she’s been thrust into the national spotlight?\nAnita McBride, American University:\n“Really picking apart your background, your heritage, your education, the jobs that you've chosen. It’s all now fair game.”\nDora Mekouar:\nJD Vance says his wife is “not a very political person.” She is out on the campaign trail with him after resigning from her law firm when her husband became Donald Trump’s running mate.\nJESSICA JERREAT:\nIt’s a story we’ve covered from the beginning. And last week, we were there as American journalists -- Evan Gershkovich and Alsu Kurm-a-sheva -- landed in Washington. President Biden and Vice President Harris were on hand to greet the freed Americans -- and their families.\nTheir ordeal over, Kurmasheva is now in Texas recovering from nine months in a Russian prison on baseless charges. She discussed the moment she was freed with VOA sister network Radio Free Europe / Radio Liberty, whom she works for in Prague.\nMike Eckel RFE/RL senior correspondent:\nAlsu. It's so wonderful to see you now. You're in Texas now, recovering after several long and pretty emotional days. Tell us how you're feeling now. What are you feeling now?\nAlsu Kurmasheva:\nThank you, Mike. I'm happy. I'm good. I'm finally in good hands. I'm getting basic professional medical care, I've been denied for months. I'm being treated as a human being. Finally, again, after this one year of detention and horrible, horrible ordeal, thank you. I'm good now.\nMike Eckel:\nWe've seen the videos of your arrival at Joint Base Andrews, outside of Washington,\n… you're welcomed by President Biden and Vice President Harris, and then, of course, your joyful reunion with Pavel and your two daughters.\nHonestly, it brought tears to my own eyes. Describe that moment what that meant to you as a mother, a parent, a wife.\nAlsu Kurmasheva:\nIt was the moment I've been fantasizing a lot for months. I exactly clearly could see in my dreams how it will be.\nIt exceeded my expectations, of course, but it was the happiest moment, and till that moment, Mike, I couldn't believe this was happening, because anything could have gone wrong, anything because the procedure itself, I was kept. Everything was kept in secret. So I really believed that this magic happened only when I hugged my husband and my children. And since then we can't stop hugging each other.\nPavel Butorin, Kurmasheva’s husband:\nThere was so much uncertainty in the days leading up to this trade. I stayed away from, you know, social media from unconfirmed reports, and, you know, even going into the White House on Thursday morning, you know, obviously, especially when I saw the other families entering the White House, and we all hugged and congratulated each other, but I wasn't sure that it was happening that same day.\nAnd then it was in the Oval Office when President Biden announced it to us. And, and I still found it hard to believe, and it was many things came as a surprise on what day, that day, and you know, including the phone call that was made from the President's desk in the Oval Office. So we were so happy to hear, finally, hear, Alsu's voice after so many months of no communication with Alsu.\nMike Eckel:\nAre there other things that you've been enjoying that perhaps you realized you hadn't you missed so much?\nAlsu Kurmasheva:\nYou know, it was my first clean water in a glass. I had it on a plane from Ankara to Andrews airport. I've been dreaming of a first glass of water, my first clean long shower in a hotel, my first sleep in a decent bed. I don't know every I'm still having my first, and it's been only a couple of days, right? Just I, I lost track, but I'm still having those first today. This morning I I had my first walk by myself without surveillance, without supervision, without anyone taking me anywhere.\nPavel Butorin:\nFor many months, Alsu was denied basic human dignity. It's all over. Now this nightmare is over. We're waking up from this nightmare. I'm glad it all worked out, and it will work out for the other journalists from radio for Europe who are held, unjustly held prisoner in Belarus and in Russia, occupied Crimea.\nMike Eckel:\nAlsu, I want to ask you about the moment when you had an inkling, a hint, that something was up, that you could be headed for release.\nAlsu Kurmasheva:\nSuddenly my trials were rushed, and this was the indication that something might be going on.\nAlso, I learned that Evan's trials were on the same day, and somehow I was thinking that that might be a sign. Then it was silence for some time again, and I was taken from from the prison in Kazan to a very difficult, different destination. I was told when they took me by this Stalipan Train, prison train, they told me they were taking me to an opposite destination from Moscow. But again, I mean, there was hope, but I was ready for anything.\nAnd then it took the journey to Moscow, took three days, and the last day, I learned that I was being taken to Moscow, and there was hope again.\nMike Eckel:\nDo you feel like you're angry that you've had nine months taken away from you, from your life, from your family, by the Russian state?\nAlsu Kurmasheva:\nIt's definitely not anger I feel right now. I'm not angry.\nYes, that time was stolen from me and nobody, nobody will bring back that year for me and my family. We will catch up. That made me stronger, that made our families stronger, and yes, no anger for sure, I don't hate anyone.\nJESSICA JERREAT:\nThat’s all for now. Thanks for watching.\nFor the latest news you can log on to VOA news dot com. Follow us on Instagram and Facebook at VOA News.\nTo get all the Press Freedom related content, follow me on X at Jessica Jerreat. Catch up on past episodes at our free streaming service, VOA Plus.\nI’m Jessica Jerreat. We will see you next week, for The Inside Story.",
  "word_count": 3630,
  "scraped_at": "2026-02-14T12:09:24.202760"
}