{
  "article_id": "67558e6495ae",
  "url": "https://www.smh.com.au/national/nsw/why-does-our-credit-rating-matter-if-the-planet-is-too-warm-20230821-p5dy42.html",
  "title": "Why does our credit rating matter if the planet is too warm ? ",
  "date": "20230821T090000Z",
  "domain": "smh.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This was published 2 years ago\nWhy does our credit rating matter if the planet is too warm?\nThe research paper “Rising Temperatures, Falling Ratings: The Effect of Climate Change on Sovereign Creditworthiness” included a scenario for 5 degrees of warming by 2100, and forecast major downgrades to creditworthiness for this and other governments (“Climate change a threat to credit”, August 21). Most climate experts regard anything over 3.5 degrees as verging on the breakdown of our modern civilisation and 5 degrees as complete breakdown. Sovereign risk of creditworthiness would be irrelevant in the chaos of wars for water, food and other scarce resources, and the masses of climate refugees. Lois Hudson, Thornleigh\nUnfortunately, the disasters that have occurred around the world due to climate change have not been sufficient to prod governments into doing more about reducing its causes. In Australia’s case, we can only hope that the warning that we will lose our triple A credit rating with an accompanying interest cost blowout will push our government into doing more to reduce our emissions. Over the last 4 months, our federal environment minister has approved 3 new coal mines or extensions which will produce 116 million tonnes of emissions over their lifetimes and there are another 25 such proposals awaiting approval. The answer to the question “when will we ever learn?” would sadly appear to be “never”. Peter Nash, Fairlight\nAs a former long-term supporter and campaigner I can no longer support stances taken under Albanese’s model of the ALP. Today’s article foreshadows impoverishment and suffering in direct correlation with insufficient abatement worldwide. Yet, Australia has a political leadership that doggedly refuses to disallow new fossil fuel deposits amid continuing massive subsidisation, while at the same time pretends it has a halfway believable “plan”. David James, North Narrabeen\nAs nations increasingly seek solutions to climate change, there are opportunities. Some may partially offset the threat of a credit rating downgrade. Australia, with its vast solar and wind resources, has the chance to become a major exporter of renewable energy in the forms of hydrogen and ammonia. This will take time, something that has shamefully been lost under the Coalition regime and its unstoppable support for coal and gas. However, if this development could occur with a concurrent reduction in fossil fuel exports, it would represent a win on two fronts, providing a green energy alternative and reducing consumption of carbon dioxide emitting fuels. Roger Epps, Armidale\nGlobal warming and environmental degradation have been a constant in my life. But as long as there was no financial incentive to the change nothing approach, I knew there would be no change. At last we can put a dollar figure on the do nothing approach:$140 million in increased interest payments, and rising. And the world at 5 degrees hotter is a very different world to the one we live in. No wonder a younger person I heard of wanted the TV off when the talk turned to climate change. David Neilson, Alice Springs (NT)\nNow that our credit rating is threatened, maybe those who approve the mining and export of fossil fuels, the resulting rise in global emissions and the damage to our planet may think again. The hip-pocket nerve could drive some real action! Penny Rosier, North Epping\nClimate crisis is above politics\nNo matter what opinion people have of Margaret Thatcher, her science background gave her knowledge and a scientific understanding of climate change (“Climate wars about to roar into view for UK politics”, August 21). Insurance companies understood in the 1970s, Thatcher spoke out in the 1980s, and the fossil fuel industry has known for decades; yet here, our conservatives are still harbouring deniers and refusing to accept the need for urgent climate change action, preferring to rely on “gut instinct” and safeguard the financial support they receive from the fossil fuel industry. Thatcher showed that climate change should not be a political issue but one of education, unequivocally backed by scientific proof. Instead of acting in the best interests of his country and the world, Rishi Sunak does everyone a disservice by choosing to politicise climate, as the Coalition has done here, for short-term political gain. Alan Marel, North Curl Curl\nGeorge Brandis rightly says that Margaret Thatcher’s environmental credentials were due to her science education and knowledge. So what happened to conservatives here? You guessed it. There are hardly any science and engineering MPs. Our federal parliament is full of lawyers, accountants and union hacks. When will our conservatives have the spine to find Margaret Thatcher here? Mukul Desai, Hunters Hill\nI’ve never understood why conservatives are often averse to addressing environmental and climate degradation. Isn’t conservation a core conservative principle? Surely safeguarding the natural world fits perfectly under that umbrella. Amy Hiller, Kew (Vic)\nBrandis might think he’s just commenting on the realpolitik of Britain, but am I alone in thinking that he’s not unhappy that the Tories have cynically made climate a wedge issue in Britain? Surely climate vandalism is a bridge too far for the politically like-minded? Probably not, sadly.\nHow they fear change, despite all the evidence that it is essential. Here, it’s laughable to hear our conservatives bang on about small modular nuclear reactors, despite the cost, unproven technology, time to implementation and community antipathy. Never mind that they did zero while in government to progress nuclear power as an issue. Gary Morgan, Chiswick\nBrandis smugly claims the environmental high ground for Britain’s Tories as it approaches its next election while the latest fallout from Australian conservatives sticking their heads in the sand on climate change for so long is that we’re now facing a bigger interest bill on our borrowings for being such global laggards. I hope the Coalition is reminded often of its selfish and costly short-sightedness. Adrian Connelly, Springwood\nWorkers harvest more than food\nNational mandatory farm duty sounds a little like Chairman Mao’s Cultural Revolution, when educated people were sent to villages for manual labor and “re-education” (“Answer the call-up, farmers want a workforce”, August 21). Not so attractive to most, particularly the young. However, there is an increasing cohort of potential workers who travel continuously and transport their own living quarters – grey nomads. The inducement would be financial reward, improved health and fitness due to manual labour and the conviviality of working with others. And the beneficial feeling of still contributing to the country which has given them much. Geoff Harding, Chatswood\nTaylor’s take on the rural workforce might have been mostly tongue-in-cheek, but there could be worse ideas about coping with the lack of labour on Australian farms. There seems to be merit in a scheme to encourage young Australians to do a stint of farm work as part of their education. They would improve their physical health as well as gain a better understanding of the farm sector. A commitment to temporary farm work can offer the opportunity for young Australians to learn new skills, make new friends and develop an understanding of their own country. Derrick Mason, Boorowa\nVAD verdicts\nAndrew Denton is an articulate and erudite man, a person of stature in our community (Letters, August 21). However, I would wish he used that force for better purposes than his last letter. His understandable passion for VAD leads him to two illusions that must be challenged. First: that compassion comes only in the form of killing people, which is demonstrably wrong. Also, the side-step from presenting alternatives to VAD to calling it harassment is a cheap shot. Chris Main, Campbelltown\nI can’t understand why some believers are so against VAD and seek to impose their views on everyone else. At the end of their lives, I’d have thought they would have been eagerly anticipating the beginning of eternity alongside their God and their departed loved ones. I’m not being disrespectful; I would be delighted if there was an afterlife. Eric Hunter, Cook (ACT)\nTilly we meet again\nWe must pick up and follow the Matildas with the same zeal as we did at every tournament. Don’t let this love, passion and fervour be a seasonal thing for them or even the Socceroos. This is what makes the greats great. Win or lose, Italy, Los Rojas, Germany or the Lionesses are followed religiously, no matter the match, from friendly to championship. They are our inspirational heroes through their honesty, dedication, hard work and downright joy – let’s keep this attitude up as our new national psyche. Alexander Elliott, Bilgola Plateau\nIt has only taken 435 years for the Spain to get its revenge against England for the defeat of the Spanish Armada in 1588. Alan Slade, Dover Heights\nHaving watched the performances of the Matildas in comparison to Sweden, England and Spain, it is clear we can certainly match them in skill. Where they left us behind was in size, assertiveness and physicality. England and Sweden overpowered the Matildas in this area and Spain similarly overpowered England this way. Clearly the new enthusiasm for women’s football might attract some players from other sports that will bolster our player stock. Mark Berg, Caringbah South\nArms truths\nBob Carr highlights the common problem Australia has had when buying expensive military technology from overseas: it’s invariably very late, very expensive and out of date (“Our allies’ Plan B if subs don’t show”, August 21). The growing fiasco around the submarines would suggest we may have to ask the Chinese to postpone any military hostilities until we’re ready in a decade or two. The alternative might be that we actually up our diplomatic efforts in our region to develop an Asia-wide commitment to peaceful relationships between nations. Colin Hesse, Marrickville\nCarr has a point. We are utterly unimportant to the US other than potentially gifting them a permanent strategic military base in the western Pacific for their troops and nuclear submarines. They are unlikely to care much about our sovereignty or our independent submarine capability. If the US can’t comply with Australia’s simple request to drop the charges against Julian Assange, what hope can we have that when we try to assert sovereignty, they’ll actually listen or care? Alison Stewart, Riverview\nAs detailed by Bob Carr, our AUKUS submarines could be a very expensive fantasy. The PM and defence minister seem content to brush aside concerns and potential problems raised by Carr and others, being primarily interested not to be wedged on national security. Also, due to the extended time frames, it is unlikely that either Albanese or Marles will be around to deal with any miscalculations or visionary blunders once they become manifest.\nAUKUS represents us buying into the US’s construct of power legitimacy and conflict risk in the Asia-Pacific. Carr identifies a range of significant unmanageable risks rightly worrying about an ultimate “shredding of sovereignty”. Ross Butler, Rodd Point\nCourage unrewarded\nTo all those decrying the timidity and conservatism of the Albanese government, can I remind you of a night in 2019 when a progressive party went to an election with hundreds of policies which had been rolled out well before the election (Letters, August 21)? We rejected that party because the leader didn’t have enough charisma for our liking. What party is going to put forward brave, progressive policies in the next 10 years? Well, it’s not the ALP. And while I can’t blame them – I blame the electorate – the challenges facing us call for very brave, very progressive action, now. Dave Goldberg, Wrights Beach\nNeedless angst\nThe hostilities being directed towards the government over the pay deal for teachers were totally avoidable (“Teacher pay offer ‘up for negotiation’: Car”, August 21). The education minister is now saying the 2.5 per cent for the subsequent years of their new deal is up for negotiation. If that is the case, the government should honour the deal and start negotiations in good faith. Margaret Allen, Bexley\nI don’t think. I know\nAttendees at CPAC saying “No” in response to the question “Are you a racist?” is on par with Richard Nixon stating “I am not a crook” (“Inside the conservative forum rallying troops against the Voice”, August 20). Do I think they are racist? Refer Emmanuel Macron. Barry Welch, Bridgeman Downs\nMen only\nA women problem (“Senior Libs battle for top Senate spot”, August 21)? Nah, it’s a men problem. Tim Schroder, Gordon\nPayouts pump premiums\nMedical practitioners already pay hefty medical indemnity insurance premiums (“‘Top of the range’ payout in negligence claim against Teo”, August 21). Payouts like the one to Charlie Teo’s patient are likely to increase these premiums with consequent increases in fees to patients. Better to avoid negligence in the first place. Stephanie Edwards, Roseville\nWhales in waste\nThere are downsides to putting more and more people in Sydney on smaller and smaller land areas with increasing dependence on existing infrastructure (“Extra social housing in new plan for Waterloo estate”, August 21). The sewer ocean outfalls are pushing enormous volumes of human waste water into one of the world’s most travelled whale migration corridors. This is happening right up and down the coast. Lance Dover, Pretty Beach\nThe digital view\nOnline comment from one of the stories that attracted the most reader feedback yesterday on smh.com.au\nWe won’t fix inflation while economists stay in denial about its causes\nFrom Dirk: “Demand is the problem in a capitalist economy. We need a society that restricts consumer demand and provides us with what we need not what we want. Need not greed is the answer.”\n- To submit a letter to The Sydney Morning Herald, email letters@smh.com.au. Click here for tips on how to submit letters.\n- The Opinion newsletter is a weekly wrap of views that will challenge, champion and inform. Sign up here.",
  "word_count": 2294,
  "scraped_at": "2026-02-14T12:05:11.882309"
}