{
  "article_id": "675e60e9c382",
  "url": "https://wildcatbluenation.com/who-is-going-to-be-the-most-exciting-kentucky-athlete-in-2025",
  "title": "Who is going to be the most exciting Kentucky athlete in 2025 ? ",
  "date": "20250810T184500Z",
  "domain": "wildcatbluenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Every new season brings fresh storylines, breakout stars, and that one athlete fans can’t wait to see in action. In 2025, Kentucky’s “big four” sports — women’s basketball, men’s basketball, baseball, and football — all have multiple contenders. But who will be the most exciting Wildcat of them all? We’re only picking two nominees per team and letting BBN make the call.\n8 candidates for Kentucky Athlete of the Year\nWomen’s Basketball\nClara Strack – After following Kenny Brooks from Virginia Tech, Strack wasted no time becoming a force. Averaging 15.4 points, 9.7 rebounds, and shooting nearly 49% from the floor, she was a do-it-all phenom. Her size, mobility, and ability to dominate both ends of the floor make her a must-watch in 2025.\nTonie Morgan – Losing Georgia Amoore hurt, but Morgan’s arrival softens the blow. The Georgia Tech transfer averaged 13.7 points, 5.6 assists, and 48.9% shooting last year. Her ability to control tempo and create offense should give Kentucky a steady floor general.\nMen’s basketball\nJasper Johnson – Fresh off a gold medal, the electric freshman is primed to put defenders on skates. Scoring will be his calling card, and while he may not lead the team in points, his highlights will keep fans buzzing.\nOtega Oweh – Returning after testing the NBA waters, Oweh is a proven scorer (16.2 ppg) with Player of the Year potential. Year two under Mark Pope could mean an even bigger jump.\nBaseball\nTyler Bell – Freshman All-American, USA Baseball Collegiate National Team member, and the owner of a .296 average with 10 homers in year one. Bell is the real deal and could be a national star by June.\nBen Cleaver – The “Slim Reaper” is UK’s ace-in-waiting. After a 6–3 season with a 3.25 ERA and 92 strikeouts, he’s set to lead a rotation that must improve for 2025 success.\nFootball\nSeth McGowan – A redemption story turned feature back. If he lives up to his blue-chip pedigree, he could transform Kentucky’s run game.\nZach Calzada – For Kentucky to contend, they need high-level QB play. Calzada’s journey from Incarnate Word to the SEC mirrors Cam Ward’s rise, and if he’s even close, the Wildcats could surprise.\nBBN, the floor is yours — who’s the can’t-miss athlete of 2025? Someone from this list, or maybe someone we missed? Let us know by giving your vote in the comment section.",
  "word_count": 400,
  "scraped_at": "2026-02-14T13:23:05.867589"
}