{
  "article_id": "677143608b35",
  "url": "https://www.meathchronicle.ie/2024/11/22/despite-final-setback-torro-can-reflect-on-fruitful-season/",
  "title": "Despite final setback Torro can reflect on fruitful season",
  "date": "20241122T150000Z",
  "domain": "meathchronicle.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Despite final setback Torro can reflect on fruitful season\nLosing a cup final is never a pleasant experience. In fact it's a lousy feeling because the prize is snatched away from you just when it is within touching distance.\nYet some consolation can be derived from knowing that at least, you gave it everything. That on the day you fought the good fight but were undone by the potent combination of talented opponents and ill-luck.\nCertainly in Saturday's Challenge Cup final at the MDL Torro Utd gave the proverbial 110 per cent - and a little bit more besides, only to end up the vanquished rather than the victors.\nThey just were unable to get the better of a slick, fast-paced Cootehill Harps side that went into the game as strong favourites and lived up to their pre-match billing.\nNot only did Torro look fired up by the fact that they were the underdogs, they had the audacity to take an early lead when Abby Matthews found the net with a long-distance, spectacular shot. It was then the much-vaunted Cavan side showed the kind of quality and class that made them odds-on to win.\nThey conjured up three super goals to take a commanding lead. It certainly looked like they would march, comfortably into the winners' enclosure but Torro Utd again demonstrated the spirit in the team by fashioning a late goal, brilliantly dispatched to the net by Megan de Souza-Wearan, who is otherwise known as flat jockey in the world of sport.\nIt meant the final furlong of Saturday's showdown was tense but the Harps held out to claim the silverware. In the dying seconds Matthews almost snatched an equaliser but her effort was inches wide. That's where Torro needed Lady Luck to smile on them.\nCertainly Torro Utd manager Derek Meehan was content, despite the defeat, that his team gave it everything - and that's all any mentor can ask from his or her charges; that they give it their all.\n\"The players never gave up and they went within a whisker of getting an equaliser,\" he said proudly.\nSaturday was the first time Torro appeared in the NEFL Challenge Cup final. Getting to the decider was something of a triumph in itself and a considerable achievement in a campaign that ended with United finishing fourth in the Premier Div. Not bad considering they only won promotion last season.\n\"We competed very well against the bigger teams in the Premier so it was very pleasing from that point of view. Women's football generally is flying in Meath at the moment and next year, hopefully, a few more teams might join the league, the more the merrier.\"\nMeehan also outlined about how, in his view, one of the most significant steps taken by his club this year was to field a second senior ladies side.\n\"That was a huge benefit in all sorts of ways from making certain young players emerging through the system got a taste of football at senior level, to ensuring that on training nights there were enough players available for a practice game, similar to what might be expected on match day. Small things like that can make a huge difference,\" he added.\nThe ongoing objective of Torro Utd FC, he asserted, was to ensure a second team remained part of the local soccer landscape. \"It's vital that we have a second team in Torro next year,\" he emphasised.\nOverall Meehan says the ladies section at the club \"is going very well\" with teams available from juvenile levels upwards. He stressed the importance of a club, any club, making available teams for players to perform at in the various levels.\n\"There can be a big falling off in the u-15, 16 and 17 levels but you're going to get that, the challenge is to ensure you have enough players who pass through those grades up to senior level. You just have to keep going and eventually you'll get players graduating onto the senior team and that's what you need,\" added Meehan like a man who has been there, done that.\nAssisted by coach Ken Finnegan, manager Meehan, watched his team perform with a spirit and determination on Saturday that augurs well for them going into the future.\nThe challenge for any soccer team is to keep their personnel when so many other sports are vying for their attentions - especially the GAA. Then there are the demands of jobs and college.\nLike the men, the ladies' season runs over the summer months when, of course, GAA games are also played. Despite such competition Meehan feels clubs like Torro Utd are more than capable of retaining their troops.\nOne of the highlights of the season for Meehan was his team's cup semi-final victory over Kinnegad. It was then the team, he suggests, played with a fluency and drive that was very pleasing. \"We were 4-0 up after 20 minutes and Kinnegad are a very good team.\"\nPeople like Meehan and Finnegan have been involved with Torro Utd for some time now as the club has developed its ladies section with a focus that is an example to others.\nTorro Utd can reflect on a 2024 season that brought them close to a precious piece of silverware - the Challenge Cup.\nNot that they are finished yet. There is still the Leinster Junior Cup where they again play Kinnegad in the second round this weekend.\n\"If you're still playing in a cup competition coming up to a few weeks before Christmas you must be doing something right,\" the Torro manager added.\nWho could argue against that viewpoint.",
  "word_count": 940,
  "scraped_at": "2026-02-14T12:42:42.467020"
}