{
  "article_id": "67871d8c6b90",
  "url": "https://www.nj.com/rutgers/2025/08/national-champion-headlines-rutgers-athletics-2025-hall-of-fame-class.html",
  "title": "National champion headlines Rutgers athletic 2025 Hall of Fame class",
  "date": "20250821T203000Z",
  "domain": "nj.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Six years after cementing his place in Rutgers athletics lore with a historic national title, Anthony Ashnault will officially join the school’s all-time greats.\nThe former Scarlet Knights wrestler (and current Princeton assistant coach) is one of the four inductees in the Rutgers Athletics Hall of Fame’s 2025 class, the school announced on Thursday.\nThe induction will take place on Friday, October 17, at Jersey Mike’s Arena, and the inductees will be recognized the following day at SHI Stadium during the football program’s Homecoming game against Oregon.\nAshnault became the second national champion in school history in 2019, defeating Ohio State’s Micah Jordan in the 149-pound final shortly after his teammate Nick Suriano won the 133-pound final in Pittsburgh.\nThe victory marked the end of a perfect 32-0 season to conclude his decorated collegiate career. Ashnault finished with a 123-18 record, good for the most victories of any wrestler in Rutgers history. He was also the program’s first four-time All-American and won three Big Ten individual titles.\nHere are the other inductees:\nMatee Ajavon (Women’s Basketball)\nThe 5-foot-8 guard was a key member of the 2006-07 team that reached the national championship game, the top moment of her storied career as a Scarlet Knight.\nAjavon ranks 10th in program history in career points (1,622), fourth in assists (556), fifth in steals (275) and seventh in games played (132). During her career “On the Banks,” she received Associated Press All-American Honorable Mention accolades (2007, 2008), was named a candidate for the Naismith National Player of the Year Award (2006, 2008), Wade Trophy (2006, 2007, 2008) and Nancy Liberman Award (2008) and earned BIG EAST Freshman of the Year (2005) and First Team All-BIG EAST (2006, 2008) honors.\nAjavon was the fifth overall pick by the Houston Comets in the 2008 WNBA Draft.\nGEORGE CASE and the 1950 COLLEGE WORLD SERIES TEAM (Baseball)\nGeorge Case was the head coach of the Rutgers Baseball team from 1950-1960, accumulating a record of 117-85 and leading the program to its only College World Series in his first season (1950). Case mentored a number of All-Americans in his 11 seasons at the helm of the Scarlet Knights, including four fellow Rutgers Hall of Fame inductees in Pete Hall, Ray Van Cleef, Harding “Pete” Peterson and Jim Monahan.\nCase and his 1950 Scarlet Knights own the distinction of winning the first College World Series game in Omaha, Nebraska, taking down defending national champion Texas with a 4-2 upset victory that featured a College World Series record seven stolen bases. RU would win the first game of what has now been 75 consecutive World Series played in Omaha.\nWhile the Scarlet Knights ultimately came up short, they posted a 3-2 record in Omaha and All-American outfielder Ray Van Cleef was named MVP of the College World Series, going 11-24 (.458) as RU was named Co-Runner-Up. In total, the 1950 team posted a 20-6-1 record and had three players who would be named All-Americans in their careers in Peterson, Van Cleef and Monahan.\nCase left Rutgers after being offered a position with the expansion Washington Senators to coach third base.\nCOLLEEN MCNAMARA (Softball)\nColleen McNamara guided Rutgers softball to two AIAW College World Series and was the program’s first all-american as one of the program’s most prolific hitters. During her four seasons “On The Banks”, McNamara helped Rutgers softball compile a 89-15 record for a .865 winning percentage across her four-year career.\nIn her freshman season in 1979, McNamara earned the starting position at first base as an integral part of a squad that produced a 24-0 regular season record and advanced to the AIAW World Series in Omaha, Nebraska. As a rookie, she hit .369, leading the team in home runs, triples and hits. Against Glassboro during the regular season, McNamara hit two grand slam home runs and a three-run home run to plate 11 runs in one inning.\nAs a sophomore in 1980, Rutgers finished 22-3 as McNamara and her squad returned to the EAIAW Regional Tournament, having suffered only one loss during the regular season.\nMcNamara became softball’s first-ever all-american when Rutgers returned to the AIAW College World Series behind a perfect 25-0 regular season record during her junior campaign in 1981. In addition to her national accolades, McNamara earned first team all-conference, all-tournament and all-region in addition to being selected as the team’s most valuable player.\nNamed team captain as a senior in 1982, McNamara hit .333 with 16 RBIs and a .989 fielding percentage, repeating as a first-team all-conference and all-tournament honoree.\nThank you for relying on us to provide the journalism you can trust. Please consider supporting us with a subscription.\nBrian Fonseca may be reached at bfonseca@njadvancemedia.com.",
  "word_count": 785,
  "scraped_at": "2026-02-14T14:18:30.954385"
}