{
  "article_id": "67a1180c559e",
  "url": "https://www.click2houston.com/news/local/2026/02/06/here-are-4-olympians-with-texas-ties-to-root-for-during-the-winter-olympics/",
  "title": "Here are 4 Olympians with Texas ties to root for during the Winter Olympics",
  "date": "20260206T213000Z",
  "domain": "click2houston.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "HOUSTON – From the Texas heat to the Olympic ice, a few Texas natives are competing in the 2026 Milan Cortina Olympics.\nHere are four Winter Olympians with Texas ties to follow over the next several weeks:\nRecommended Videos\nEmily Chan, pairs figure skating\nChan was born in Pasadena (Houston area) and also skated in North Texas, where she attended high school in McKinney.\nShe is making her Olympic debut in pairs with partner Spencer Akira Howe. Her journey combines gymnastics and dance foundations to elite figure skating success.\nAmber Glenn, women’s singles figure skating\nGlenn, from Plano, Texas, is another Texan headed to her first Olympics, having risen through U.S. competitions and international events to secure her Olympic berth.\nHannah Bilka, Women’s ice hockey\nBilka, from Coppell, Texas, said she grew up playing hockey in North Texas and went on to star collegiately, including an NCAA title, before earning her spot on the U.S. Olympic team.\nShe’s part of a U.S. squad expected to compete for medals in the women’s hockey tournament.\nBoone Niederhofer, bobsled (4-man)\nNiederhofer, grew up in San Antonio and excelled in sports through high school. He played wide receiver at Texas A&M University, where he walked on and later earned a scholarship to play football.\nAfter college, Niederhofer transitioned to bobsledding, attending a bobsled combine at Texas A&M in 2019 and joining USA Bobsled’s World Cup team in 2021.\nNiederhofer is one of the push athletes on the U.S. four-man bobsled team at the 2026 Milan Cortina Olympics. His crew finished fourth at the 2025 IBSF Bobsled World Championships, narrowly missing a medal, and now he’s making his Olympic debut in 2026.\nHe’s Texas A&M’s first Winter Olympian since at least 1980 and balances his athletic career with work as a petroleum engineer.",
  "word_count": 298,
  "scraped_at": "2026-02-14T12:38:16.896954"
}