{
  "article_id": "67f1ae5f589d",
  "url": "https://bankerandtradesman.com/wu-boston-cant-shoulder-stadium-overhaul-on-its-own/",
  "title": "Wu : Boston Cant Shoulder Stadium Overhaul on Its Own",
  "date": "20240313T170000Z",
  "domain": "bankerandtradesman.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "While Boston awaits a judge’s decision on whether the city can renovate a run-down stadium in a public park to host a professional women’s soccer team, Boston Mayor Michelle Wu defended the idea on Tuesday, claiming that the stadium would still be available for community use over 90 percent of the time.\nBoston and Boston Unity Soccer Partners hope to renovate White Stadium in Franklin Park to be home to a National Women’s Soccer League team. However, the Emerald Necklace Conservancy and 20 neighbors sued the city to halt the project which they claim would “illegally transfer the public trust lands” to “a private party.”\n“The City of Boston has already received bids to demolish portions of White Stadium and the existing athletic field and track as soon as this month, as part of a proposal by Boston Unity Soccer Partners LLC, a for-profit private company, to redevelop and privatize the stadium, its grounds, and surrounding public parkland,” according to the Emerald Necklace Conservancy, who sought an injunction on the project.\nThe injunction was granted last week, and a Suffolk County Superior Court judge said she would issue her ruling on March 22.\nWu appeared on GBH’s Boston Public Radio Tuesday, and said the city was “making really good progress” on the project.\nThe stadium belongs to Boston Public Schools, and without the professional soccer team’s contribution to the renovation, the city couldn’t afford it, Wu said.\n“This is a BPS facility. So with a hundred other buildings that are in much need of investment, we won’t be able to prioritize it — without the partnership to make the whole stadium possible we won’t be able to prioritize the stadium’s renovations instead of doing over another school that badly needs it,” Wu said.\nThe soccer team committed $30 million, and the city plans a $50 million investment to together fix up the dilapidated 10,000-plus seat stadium, which was built in 1945.\nSome neighbors of Franklin Park and members of the BPS community have said they are worried about the privatization taking away from the facility’s community use and as a home base for Boston high school sports teams.\n“White Stadium needs to be significantly renovated to improve access for BPS student-athletes and the local community. But we oppose turning control of the stadium over to a professional sports team at the expense of BPS students and the local community, and allowing for-profit investors to privatize and profit from a public resource in violation of the state’s constitution,” said Karen Mauney-Brodek, president of the Emerald Necklace Conservancy.\nWu said on GBH Tuesday that the professional soccer team would only use the facility less than 10 percent of the time.\nWith 20 games or less in a women’s professional soccer season, about half of them at home, there would only be one or two home games each month, Wu said. During other times, it would be open for community events and high school sports.\nShe added that Boston Latin School and Boston Latin Academy are the only two high schools that currently use the stadium for home games, and that they would likely still be able to use it for later-season football games after the soccer season was over.\n“We’re talking about five games for each of the teams that potentially are going to need to find a different home. And that’s it. I don’t even think it will be five, because the football season usually extends longer than the soccer season,” Wu said. “And then after those games, the city-wide championships and those kind of large final games, we’ll be able to get all the teams in to play some of those end-of-season games there.”\nShe said teams would have a better experience for games they play at White Stadium, with “brand new scoreboards and fields.”\n“The usage for BPS is going to more than triple in terms of the number of hours,” the mayor said. “Sometimes there’s this belief that it’s busy all the time and now the soccer team will be using it instead of our students. But the reality is that most of the time when you go by there, the stadium is chained and locked up. It’s not used that often. And football, soccer, track have been using it less and less and less frequently, because the facilities don’t even meet state competition standards anymore.”",
  "word_count": 728,
  "scraped_at": "2026-02-14T13:11:03.773758"
}