{
  "article_id": "68099a6b4204",
  "url": "https://punchng.com/olise-relishes-trabzonspor-win/",
  "title": "Olise relishes Trabzonspor win",
  "date": "20250311T004500Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Super Falcons midfielder Chioma Olise is thrilled to have won her second game in the colours of Trabzonspor Women in the Turkish Women’s topflight thanks to a 2-0 victory over Besiktas Women on Sunday.\nThe former Edo Queens midfielder made her second appearance for the club as they sealed the win with two second-half goals.\nOlise, who was introduced in the second half, shared her delight after the game, emphasising the team’s winning mentality.\n“I’m excited about the game. We fought hard for the points and got the result we wanted. We’ll keep up the momentum without relenting and approach our next game with full spirit,” she said.\nWith this victory, Trabzonspor Women sit fifth on the league table with 38 points. Their next fixture is an away clash against Fatih Vatan Spor, who are currently eighth with 24 points, on Sunday, March 16.\nOlise joined the Turkish Women’s Super Lig side, Trabzonspor, from Nigeria Women Football League champions Edo Queens.\nThe Falcons player signed a one-and-a-half-year contract with her new team and dons the jersey number 16.\nOlise started her topflight journey with Royal Queens when the team gained promotion to the NWFL Premiership.\nHer breakthrough came at Edo Queens, where she won the 2023/24 NWFL Premiership title with Moses Aduku’s side.\nShe also won the West Africa Zone Women’s Champions League title in Ivory Coast and captained the Benin City-based side to a fourth-place finish at the 2024 CAF Women’s Champions League in Morocco.\nAt the national team level, she represented Nigeria at the 2022 FIFA U-20 Women’s World Cup as the Falconets reached the quarter-finals.\nShe also made the roster for the 2024 FIFA U-20 Women’s World Cup in Colombia.\nIn 2024, Olise got an invitation to the Super Falcons and played against Algeria in a two-legged friendly match.",
  "word_count": 302,
  "scraped_at": "2026-02-14T12:35:06.242250"
}