{
  "article_id": "683aa1bd1103",
  "url": "https://www.abc.net.au/news/2023-07-02/how-the-matildas-helped-pave-the-way-for-lgbtqia-visibility-in-f/102318752",
  "title": "  We always play with pride : How the Matildas helped pave the way for LGBTQIA+ visibility in football",
  "date": "20230701T203000Z",
  "domain": "abc.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "'We always play with pride': How the Matildas helped pave the way for LGBTQIA+ visibility in football\nIn mid-February, as the Matildas lined up in the tunnel beneath Parramatta Stadium before their Cup Of Nations friendly against Spain, the 90 minutes that lay in front of them felt just like any other game.\nThe tactics and training sessions of the past few days had been memorised into their muscles. The buzz of the building crowd as they went through their warm-ups still hummed in their ears. The final words of head coach Tony Gustavsson in the dressing-room echoed in their heads.\nBut as they walked out onto the pitch, unveiling the secret rainbow numbers they wore on the backs of their jerseys, it was clear that this was not just another game to them.\nIt was the first time an Australian national team took part in a Pride initiative during an international match, organised to coincide with the start of 2023 Sydney WorldPride.\nFor the players, many of whom are part of the LGBTQIA+ community, it maybe didn't feel like such a big deal: inclusion is something they had always cherished and embraced as a team, building their culture over years so that everybody could feel safe and comfortable being themselves.\nBut for so many people watching, it felt like something else. It felt like finally being seen.\n\"To wear the Australian jersey is always a massive honour, but to wear the rainbow colours — something that I've always been really proud and passionate about - is really special,\" captain Sam Kerr said afterwards.\n\"We have such an inclusive team; always have and probably always will.\n\"It's always nice for the team to stand in unity and show that we're all together and stand with all these communities that maybe don't get seen as much as they should do.\"\nWomen's football has long been a space where LGBTQIA+ players, coaches, officials, and fans have been welcomed and accepted, with participants actively creating a sense of community that can be difficult to find in other areas of the world.\nExactly why women's football, and women's sport more widely, has become this safe haven is complex.\nPartly, it's due to the historic lack of media coverage and attention placed on their personal lives, which has meant they have rarely, if ever, had to navigate the kind of public scrutiny placed on male athletes who are suspected of being anything other than heterosexual.\nThe fact that women's football has only become a full-time professional endeavour in the past few years also means that, historically, women athletes have had more time to explore themselves and their identities beyond the confines of sport.\nCompared with male players, who are often funnelled into more restrictive, heteronormative spaces like academies and clubs from a younger age, women footballers have had more freedom to understand who they are as people by virtue of navigating the wider world through work, study, and other opportunities.\nSo when they arrive at football, they often bring their whole selves with them.\nThis shared sense of living life on the periphery for women's football and the LGBTQIA+ community - of being ignored and pushed into the shadows — is arguably why these two groups have gravitated towards each other over the decades, seeing themselves reflected in one another's marginalisation.\nIndeed, when women's football emerged from its global 'shadow ban' in the early 1970s, it was already seen as an act of rebellion to participate in something traditionally seen as a man's game.\nTaking part in an area of public life that had typically excluded you was part-and-parcel of queer people's experiences, so it's perhaps no surprise that two groups who already challenged the gender norms of their time developed this solidarity and connection with one another.\nThey had already overcome so many obstacles, so what was one more?\n\"Because of the bans in the 1920s, football was a highly unconventional sport for women to play; it was officially deemed 'unsuitable for ladies,'\" former Matildas vice-captain Moya Dodd told ABC.\n\"Over the years, the women who did play were by definition those who were willing to defy society's norms to be what they wanted to be: footballers.\n\"They were norm-busters — the kind of women who wouldn't be told what to do - and it turns out that many of them also identified as LGBTQIA+, despite the opprobrium they suffered.\n\"So the links were there from the beginning. Many of the game's stars in the early years lived lives that were regarded as unconventional, while being outstanding footballers. And good for them.\"\nOver the decades, this safe and inclusive culture on and off the pitch has acted as a magnet for queer people to gravitate towards, which is why it appears these days that women's football is over-represented when it comes to the LGBTQIA+ community compared to other areas of public life.\nIt is also why the metaphor \"football as family\" rings particularly true, because for some queer women in sport, their birth families are not sites of love or acceptance; their chosen families - their team-mates - are the people with whom they can truly be themselves.\nGrowing into themselves away from the spotlight is also potentially why so many queer players are now comfortable using their ever-growing platform in football to speak up about these bigger issues.\nIn Australia, former Matilda Michelle Heyman was the only 'out' Australian player at the 2015 Women's World Cup in Canada, as well as the only openly gay athlete to represent Australia at the Rio Olympics the following year (though what exactly constitutes being 'out', and who gets to decide, is another question entirely).\nHeyman was one of the players who spear-headed the first Pride initiative in Australia's top-flight domestic competition, then known as the W-League, when her club Canberra United wore rainbow socks and organised donations for a LGBTQIA+ charity in 2014.\nIn Brazil, legendary players like Sissi, Cristiane, and Marta have all become more vocal about their identities and relationships, standing up for queer women both within and outside of sport.\nAnd in the USA, in the wake of Abby Wambach's famous 2015 kiss, Megan Rapinoe publicly criticised then-president Donald Trump and flipped off his invitation to visit the White House after America won the Women's World Cup in 2019.\n\"Go gays!\" she famously told media after their quarter-final victory over France. \"You can't win a championship without gays on your team — it's never been done before, ever. That's science right there!\"\nRapinoe, along with many of her USA team-mates, have continued to use their profile to advocate for the queer community, and particularly trans and gender-diverse young people who are becoming increasingly marginalised and excluded from sport across the country.\nLoud and proud\nAs women's football has grown, so too has its long-standing culture of diversity and inclusion.\nIn the recent six-part Disney documentary series titled 'Matildas: World At Our Feet', queer identity, relationships, and families are not just common - they are normal.\nSam Kerr cooked eggs for her girlfriend, USWNT player Kristie Mewis. Tameka Yallop and her wife, former Football Fern Kirsty Yallop, took turns watching their daughter during a Matildas camp. Ellie Carpenter's partner, Danielle van de Donk, helps the injured defender hobble around her Lyon apartment following ACL surgery.\nWhat is so remarkable about the portrayal of these relationships is just how unremarkable they are.\nFor many young people watching the series, this kind of queer representation can be incredibly formative, showing queer women going about their lives and jobs just like everybody else. That they can be who they are and still achieve footballing success is a powerful message to send those grappling privately with their own identities, sexualities, and communities.\nThat is not to say that all is sunshine and rainbows when it comes to discrimination in women's football. For years, the game has grappled with the homophobic stereotype that all women athletes are lesbians, while also facing the fact that many of them are.\nThis tension has led to marketing campaign trends that attempted to \"feminise\" women athletes, including the infamous nude calendar published by the Matildas in 1999, or magazine shoots showing women footballers posing in ball gowns while wearing football boots.\n\"Our whole sport — and many other women's sports — suffered, and still suffer, from homophobia,\" Dodd said.\n\"If you played football or cricket or whatever then you must be one of those 'different and dangerous people.' It wasn't to be celebrated: everyone assumed it would drive away media coverage, sponsors, and potential new players.\n\"At the same time, the coverage we did get was weirdly heterosexualised. Of course, there were and are many straight players. Some would try to distance themselves; many others could see that not only was their sport suffering but also their team-mates, so they became allies.\n\"Some of our strongest allies and advocates are straight women and men who I've met through women's football. The game itself has become a beacon for inclusion and validation of the LGBTQIA+ community.\"\nRacism, transphobia, and homophobia continue to affect the women's game, with a number of nations competing at the 2023 Women's World Cup still having laws that criminalise homosexuality and queer relationships, while healthcare for and social acceptance of trans and gender non-conforming people remains a major barrier everywhere.\nAnd yet, despite these obstacles, women's football continues to persevere; to push back against socials norms and make progress in this space.\nAt the Tokyo Olympics, the first non-binary person to win a gold medal came from football: Canadian national team player Quinn, whose name and pronouns are now shared widely whenever they play (including at the upcoming World Cup) in order to platform footballers who sit outside the traditional male/female binary.\nAccording to Outsports, more than 40 LGBTQIA+ footballers took part in the women's competition in Tokyo as well as the 2019 Women's World Cup in France.\nIndeed, one of the most iconic moments from that tournament was a queer one: when Swedish defender Magdalena Eriksson kissed her partner, Danish captain Pernille Harder, in a photo that went around the world and made them some of the highest-profile spokespeople for the LGBTQIA+ community in sport.\nThe men's competitions, by contrast, had none. The reasons why are complicated, but a large part is because the environments created within men's sport — which is often described as \"the last closet\" — remain unsafe and unwelcome for those who do not conform to traditional norms of heterosexual masculinity.\nThe inclusive queer culture of women's football has become so powerful in football that it has not only created a buzzing online subculture where quips like \"they're lesbians, Stacey!\" become viral memes, but it is also starting to create genuine structural change in the sport itself.\nOpenly queer footballers like Rapinoe and Kerr have become some of the most marketable athletes in global sport, in part because of their openness in sharing this part of themselves with the public.\nThe media coverage and corporate investment these individuals generate go towards making women's football as a whole a bigger and better place, while their visibility also helps to normalise the presence of queer athletes in football generally.\nFurther, earlier this year, when FIFA tried to introduce a 'Visit Saudi' sponsorship to the tournament, public criticism from queer players, commentators, and fans that highlighted Saudi Arabia's anti-LGBTQIA+ laws saw the governing body backtrack on the deal.\nA few months afterwards, Football Australia announced they were working on a high-performance trans-inclusion policy that is expected to be one of the most progressive in professional Australian sport.\nWomen's football, then, has become its own sort of political space: an opportunity to not just platform and celebrate the achievements of queer people, but also to normalise their participation in everyday life and push back against forces that seek to silence or suffocate the inclusive cultural foundations of the women's game.\nInstead, players have been given the option of choosing from eight FIFA-approved armbands that include vague, corporatised slogans like \"United For Inclusion\" or \"Football Is Joy, Peace, Love and Passion\".\nIt follows from the governing body's decision to ban the \"One Love\" armband during the men's World Cup last year after the host nation Qatar expressed opposition, with players threatened with sanctions (including loss of points) if they wore them anyway.\nBut as research into Pride initiatives in sport has shown, ambiguous messaging and obscure goals can actually be counter-productive in the larger project of inclusion, diversity, and safety for the queer community in sport and society.\nFIFA's decision, then, exposes either a deep misunderstanding or a disregard for the culture and community that has built the women's game, from the fans in the stands to the players on the field, in addition to the larger purpose of these types of initiatives that support social causes or highlighting marginalised groups.\nIndeed, the ongoing appeal of women's football remains the interconnectedness of everybody involved: the knowledge that the game's biggest stars are not so different from us, not so isolated by fame and fortune that they do not remember what the real world is like.\nThey remember because many of them have been there themselves; they have suffered the same social pressures around gender and sexuality, and they know how powerful a moment of representation and connection can be to someone who feels the same way they did.\nWhich is why the Matildas' Pride initiative in February was so important.\nTheir gesture was not a watered-down message about \"Inclusion For All\" (including homophobes, presumably). It was not about trying to appease nations or cultures who deny queer people their safety and freedom. It was a specific nod to the community that has created the very sport that they are now the figureheads of.\n\"We just want everyone to feel included and have a wholesome experience here,\" Emily van Egmond said after the Spain game.\n\"With the Matildas, we want to engage with every single community possible and for everyone to come out and support us.\n\"But no matter what jersey we put on, we always play with pride.\"\nNo matter your gender identity or sexuality, sport is one of the world's great unifiers. And the fact that, in the context of the Matildas, so many openly queer women are now role models and heroes for so many Australians is proof of just how significant LGBTQIA+ visibility can be.\nThis Women's World Cup is the latest opportunity to draw this community together in a safe, shared space to celebrate the queer people on and off the pitch who have made the game what it is today.\nSo while only 11 Matildas walked out onto the field in Parramatta, they trod a path that countless women before them had walked, and which countless more will follow long after they are gone. FIFA-approved or otherwise.\n\"I felt very, very proud that the Matildas stood up on an issue that's important to so many of the team over the years,\" Dodd said.\n\"Everything I saw and heard growing up told me that it wasn't a safe world to be gay in, but football provided us with a space where everyone could be themselves.\n\"The rainbow Pride numbers — worn by all the players — said that in a team, no one gets left behind, and that every LGBTQIA+ person belongs in this world.\n\"I think it's fabulous that so many players can be out and adored, including many Matildas, and it's not their sexuality that defines them: it's their togetherness and inclusive spirit.\"",
  "word_count": 2599,
  "scraped_at": "2026-02-14T12:26:36.126398"
}