{
  "article_id": "684bfdc3080c",
  "url": "https://www.independent.ie/regionals/wexford/gorey-news/local-notes/around-the-districts-craanford-monaseed-to-tara-hill-42405280.html",
  "title": "Around the Districts : Craanford - Monaseed to Tara Hill",
  "date": "20230329T023000Z",
  "domain": "independent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Around the Districts: Craanford-Monaseed to Tara Hill\nCRAANFORD-MONASEED\nMonaseed ICA\nThe meeting of the Monaseed ICA took place In Craanford Hall on March 1. There were 13 members present. Mary Banville and Mary Fitzgerald from Federation were in attendance. The president introduced them as the meeting began.\nThe members discussed Enniscorthy Museum exhibition which runs till June. They also discussed the 10 per cent discount available to members in the various shops. The AGM will be held at the April meeting.\nThe competition winner was Kathleen Kelly the raffle winner was Gwen Stewart. The competition for April is ‘the nicest flower arrangement in a jug’. The hostesses for April are Winnie Doyle and Jane Gilbert.\nThe guest for April is Trish from Four Seasons florist, who will be doing a demonstration of Spring flowers. Would members please remember to bring the payment for the show in May in the Opera House in Wexford.\nFirst Responder Group\nCraanford-Monaseed First Responder Group are looking for new members Male and Female from the Craanford-Monaseed Hollyfort area to join their responder team. We respond to cardiac arrests and choking in our area. Training will be on May 2 and May 16 – you only need to attend one of the nights.\nThere is no on call rota just if you are available when a call comes in to respond and we always respond in pairs. It’s a really worthwhile group to get involved in, it’s your neighbours that you would be supporting If interested talk to any group member or phone group co-ordinator Noeleen Kenny, 087 4104707.\nCraanford-Monaseed Community Childcare Services AGM will be held on Tuesday, May 2, at 8 p.m. in Craanford Community Centre Anyone wishing to enrol their child in September must attend AGM.\nText Alert\nAnyone wishing to renew their Text Alert subscription can pick up forms in both Craanford and Monaseed churches, these can be dropped into Brian in the parish office or to Liz in the playschool or to Fiona Redmond at your convenience.\nBingo\nBingo is played in Craanford Community Centre every Friday night at 8 p.m. please come along and support.\nGAA club news\nClub lotto – The current jackpot €9,800 was not won. Numbers drawn were 1, 17, 22 and 30. Next week’s jackpot €9,900. Lucky-dip winners Paddy and Maeve Kavanagh, Lena Greene, James Doyle Ballydarragh, Michael Lancaster, Linda Blake c/o K & K Windows. Tickets available from Donal’s Gorey, John Bass Tyres, Cooney Communications Craanford, Lambert’s Camolin, you are most welcome to sign up for the year also, thank you for your support always, it is very welcome and appreciated.\nCraanford-Monaseed LGFA are again organising an Easter Line Draw this year which will take place at Craanford Bingo on April 7, there are loads of fantastic prizes on offer from Pettitt’s Food Hamper, Meat Hamper kindly sponsored by Irish Country Meat, Camolin, Logs for the Fire, Chocolates, Easter Eggs and more…3 Lines for €5 contact any club member.\nA reminder that membership is now due and must be paid on Foireann only.\nLeague games are in full swing both underage and adult in GAA and LGFA, well done to adult men and under-16 hurlers on their good wins over the Duffry, see Facebook for regular updates on matches.\nThe firewood draws in conjunction with all national club draw tickets that were sold took place at the lotto draw this week. Thanks to Ger for organising it. Buyer prize winners Sadie Doyle and Timmy Kirwan. Seller’s prize winners Aidan Doyle (coach) and Eoin Doyle.\nOur indoor nursery has returned and will start at 10 a.m. and every Saturday morning in the Craanford Indoor Sports Complex from 10 a.m. to 11 a.m. The aim of the nursery is to introduce all children (aged 4-6) to Gaelic games in a relaxed and fun way. All equipment is supplied so all you need to bring is some water. Contact Thomas Briscoe (087 4181196) – Mick Shortall (087 9916764) – James Byrne (087 1234957) from any weather mishaps, an ideal venue for indoor games etc. Ring 086 8228686.\nFor health and safety reasons all users of the walking track are kindly reminded that only guide dogs are allowed on the walking track or sports ground.\nChurch News\nThe choir rehearsals take place on Tuesday evenings. New members are always welcome. Please come along.\nMass Intentions – Saturday, April 1, 6 p.m. Patrick Finn, Ballygullen; Jane Murphy, Ballygullen; Martin Murphy, Ballygullen. Sunday, April 2, 10.30 a.m. Winifred Doyle, Boley.\nMass Times – Monaseed: Saturday 7.30 p.m. Sunday 9.30 a.m.; Daily Mass Mon to Fri 9.30 a.m. Craanford: Saturday 6 p.m. Sunday 10.30 a.m.; Daily Mass Mon Tuesday Wed Thur 6 p.m.\nRosary at Grotto – The Rosary is at 7 p.m. every Wednesday evening at Our Lady’s Grotto, Ballydarragh Craanford.\nUsed stamps for the Missions – Again a big thank you to the people in Craanford and Monaseed for their ongoing support for the Missions by putting their stamps in the boxes in the porches in both churches. A reminder to take off the stamps, leaving around 1.5cms around the stamp please, from their envelopes and put them in the box in the church porches.\nKILANERIN-BALLYFAD\nTractor Run\nA tractor road run in memory of Colm Donnelly Tinnock will take place on Sunday 23rd April starting at The Bunker Bar.\nColm was a farming and car fanatic. Unfortunately Colm had an accident whilst working on his car and sustained serious injuries and sadly passed away 6 days later. Colm has left a legacy behind him as he has given 5 people a chance of new life after donating his organs.\nColm’s sister Niamh along with his friends and family would love your help in raising money for four charities which played a big part in Colm’s life growing up and also caring for him after his accident. All donations will be gratefully received and shared between ICU St Vincent’s hospital, Friends of Gorey District Hospital, Kilanerin National School and Gorey Community School.\nA GoFundMe page has been set up and donations can also be made on the day. All help and support todate is greatly appreciated.\nPilates\nPilates continues in Shamrock Hall every Tuesday 7 p.m. Open to all ages and levels. The cost is €6, for more information contact Bernadette Colfer on 087 9407852\nMen’s Shed\nKilanerin Men’s Shed meets every Thursday at 11 a.m. each week in Kilanerin Community Centre and is open to new members.\nGAA club news\nThe lotto jackpot now stands at €2,400 as none matched the last drawn numbers of 2,4,16 and 19; next draw is on Monday 3rd April.\nThere are lots of matches both men women and youths coming up over the next few weeks, check the fixtures in the newspaper or get yourself added to the Fixtures and results app.\nKilanerin Church\nMorning mass on Tuesday Wednesday and Friday 9.30 a.m. Saturday night 6.30 p.m. anniversary mass William and Elizabeth Cosgrave Ballyconlore also remembering thir sons Tom and Pat Sunday 11 a.m. Eucharistic adoration on Tuesday 10 a.m. to 9 p.m. ending with Holy hour 8 to 9 p.m.\nBallyfad Church\nThe painters are working in Ballyfad Church so Church closed until Thursday 9 a.m (subject to change due to ongoing paint work) Saturday 7.30 p.m. Sunday 9 a.m. No adoration in Ballyfad Church this week.\nWhist\nWhist is played every Wednesday night at 8 p.m. in Shamrock Hall Kilanerin all welcome.\nKILMUCKRIDGE\nHoly Week Masses\nHoly Week ceremonies are as follows in Kilmuckridge St Mary’s Good Friday 3 p.m., Easter Vigil 8 p.m. and Easter Sunday 11 a.m.\nMonamolin, St Moling’s, Holy Thursday 7 p.m., Good Friday 7 p.m., Easter Vigil 6 p.m. and Easter Sunday 10 a.m.\nKilmuckridge Klean Up\nThis Saturday and Sunday, April 1, and two, Kilmuckridge Tidy Towns will hold a two-day Klean Up Event. Please join us at the village car park, collect your litter picking supplies, choose an area to Klean and see what a difference you can make, All help appreciated.\nThis event is part of the National Spring Clean which is Ireland’s most popular anti-litter initiative. The Campaign encourages every sector of society to actively participate and take responsibility for the environment by conducting Klean Ups in their own areas.\nThe National Spring Clean (NSC) has been operated by An Taisce since 1999 in partnership with the Department of the Environment, Heritage and Local Government and Local Authorities and is sponsored by Coca Cola Bottlers Ireland. It takes place annually throughout the month of April with the aim of raising awareness of the problem of litter nationally as we enter the summer months.\nKilmuckridge Drama Group\nMany congratulations to our local drama group who enjoyed much success on the circuit with their play Sive by John B Keane.\nSive, which was Keane’s second play, was first performed in Listowel Co Kerry in 1959. It is a heartbreaking story of how youth and innocence can be destroyed by the greed and cynicism of an older generation.\nThe group took part in eight festivals around the country as they travelled to Cavan, Roscommon, Ballyduff and beyond to name but a few. Results as follows.\nNew Ross: Best Play, Best Actress Margo Whelan, Best Producer Anthony O’Connor, Best Set.\nShercock Co Cavan: Runner-up second Place; Best Supporting Actress Kate Devereux.\nCarnew South Wicklow: Best Play; Best Actor, John Hearne; Best Actress, Margo Whelan; Best Director, Anthony O’Connor.\nThe group have now qualified for the RTÉ all-Ireland Drama festival 2023 under the auspices of the Amateur Drama Council of Ireland which will take place in the Dean Crowe Theatre Athlone from Thursday, April 27, to Friday, May 5.\nLotto\nThe numbers drawn in the parish lotto on March 20 were 12 19, 20 and 24. There was no jackpot winner. Congratulations to match three winners Bridget Bolger, Vera O’Sullivan and Matty Foley (Joint Ticket). Next draw will be on 27/3/23 in the Upton Court where the total of the jackpot is €6,900.\nBridge Club results\nThe results for Sean Ogs Bridge Club Kilmuckridge. Monday Evening 1st North/South Michael Whelan & Anne Kelly; 2nd North/South Margaret O’Connor & Mary C Murphy; 1st East/West Una Bolger & Mary G Murphy; 2nd East/ West Seamus Greenan & Mags Greenan. Thursday Morning: 1st Mary Brennan & Noreen Caufield; 2nd Mona Moynihan & Sadie Owens; 3rd Maria Sheridan & Kathleen McDonnell\nThe results for the 51 Bridge Club Gorey played Wednesday last: 1st place Mary Breen & Joan Reynolds; 2nd place Martin Ryan & Mary Ryan.\nMONAMOLIN\nEaster Ceremonies\nMonamolin: Holy Thursday 7 p.m. Good Friday 7 p.m..and Easter Sunday 10 a.m.\nLadies together\nWe are still looking for more ladies to come along to our Tuesday morning coffee morning from 12 p.m. to 1 p.m. in the Alley Bar. A great way to meet up have a cuppa and have a good old chat and make new friends, so make the effort and come along.\nCúl Camp 2023\nPlease put the dates July 10 to July 14 in your Diary for this year’s Kellogg’s Cúl Camp.\nTARA HILL\nGAA club news\nDinner Dance - The Castletown Liam Mellows GAA Dinner Dance will take place in the Arklow Bay Hotel on Friday March 31st at 7.30pm. The night will start with dinner, followed by a presentation to the 1973 County Final winning team and medal presentations to the 2022 Senior Football County champions, U19 County Football champions and Camogie Intermediate champions finishing with a DJ . All welcome . Tickets €35 available to buy now at www.castletownliammellowscoolgreanygaa.com/events\nYoga at Castletown GAA pitch - Chair Yoga every Wednesday at 11am. Slow Flow Yoga every Tuesday at 7.45pm. For details contact Aislinn on 085 2486782\nGaelic4 Mothers & Others - Gaelic4Mothers & Others returns this Monday at 8pm at Castletown GAA pitch. The Gaelic4Mothers&Others initiative sees women playing Ladies Gaelic Football in a fun, non-competitive and social environment. Gaelic4Mothers&Others provides an opportunity for women to get their recommended weekly exercise in a fun way while meeting other women in the area. All welcome , no experience necessary. For more details contact Deirdre Croke on 087 147 8964\nYour news\nAny notes for paper please forward to 087 9434090 or ck0802@gmail.com",
  "word_count": 2037,
  "scraped_at": "2026-02-14T12:44:49.804551"
}