{
  "article_id": "6854a88e3553",
  "url": "https://www.jamaicaobserver.com/latest-news/watch-khadija-shaw-signs-as-powerade-ambassador/",
  "title": "WATCH : Khadija Shaw signs as Powerade ambassador",
  "date": "20230920T194500Z",
  "domain": "jamaicaobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WATCH: Khadija Shaw signs as Powerade ambassador\nCaptain of the national senior women’s football team, Khadija “Bunny” Shaw has signed a two-year brand ambassador deal with sports drink brand Powerade.\nAt a signing ceremony at the ROK hotel in Kingston on Wednesday, Shaw said she hopes to collaborate with Powerade to inspire young boys and girls.\n“For me personally, as I continue to grow and evolve as a human being, I want to always bring awareness as well as motivate and inspire young girls and young boys to believe in themselves and their dreams, and know that with hard work anything is possible,” Shaw said.\n“I think… me partnering with Powerade, I truly believe that with a structured and organised plan, we can definitely help to inspire and motivate young boys and girls,” she added.\nJamaica’s all-time leading goal scorer, Shaw was recently shortlisted for this year’s women’s Ballon d’Or, football’s most prestigious individual award.\nShe is the first Jamaican, man or woman, ever to be nominated for the prize.\nThe powerful striker scored a club single-season record 31 times in 30 matches for her club Manchester City in the Barclays Women’s Super League last season, while also providing nine assists.\nAndrew Mahfood, CEO of Powerade distributor Wisynco Group, said the company has had an eye on Shaw since she was in high school.\n“At Wysynco, we have been following Bunny for years… and it is unbelievable to see Bunny’s dream unfold right before our eyes,” Mahfood said.\n“We are so excited to welcome Bunny to Wisynco through our partnership with Coca Cola,” he continued. “Bunny, we look forward to continue watching your impressive growth and stand ready to partner with you in any event you can think of to help our country Jamaica advance.”",
  "word_count": 295,
  "scraped_at": "2026-02-14T12:39:51.685932"
}