{
  "article_id": "687fba45e37e",
  "url": "https://www.easternriverinachronicle.com.au/story/8472918/wanderers-end-eight-year-alw-drought-against-victory/?cs=6364",
  "title": "Wanderers end eight - year ALW drought against Victory",
  "date": "20231230T104500Z",
  "domain": "easternriverinachronicle.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Western Sydney Wanderers have broken an eight-year A League Women drought against Melbourne Victory, scoring a 2-0 upset win at home.\nSubscribe now for unlimited access.\nor signup to continue reading\nGoals either side of half-time from captain Amy Harrison and 17-year-old Alexia Apostolakis were enough to secure the win at Wanderers Football Park.\nEven the return off the bench of reigning Julie Dolan Medal winner and Matildas World Cup midfielder Alex Chidiac, whose signing was announced earlier on Saturday, didn't help Victory, who started well but couldn't score.\nThe Wanderers' only win in 17 ALW matches against Victory had been 2967 days ago in November 2015, with the Melbourne team having won five and drawn six of the past 11 fixtures between the clubs.\nHarrison opened the scoring against the run of piay in the 38th minute when a corner found her unmarked at the far post and she drove the ball home for her first ALW goal of the season.\nApostolakis also netted for the first time in the current campaign.\nShe calmly beat Victory and Matildas goalkeeper Lydia Williams in the 51st minute, after the visitors' defence was torn apart by a perfectly delivered through ball from Holly Caspers.\nThe win moved the Wanderers up to seventh place on the table, while Victory stayed fourth.\nVictory made the early running and Wanderers' American goalkeeper Kylie Collins had to save from Lia Privitelli and McKenzie Wienert.\nThe home team became more assertive after hitting the front and ultimately had more shots than Victory.\nChidiac, who came back to Victory after a loan stint at Mexican side Tigres UANL from her parent club Racing Louisville in the US, entered the game just before the hour mark.\nShe has signed with Victory until the end of the 2025-26 ALW season.\nVictory's reserve goalkeeper Miranda Templeman was injured during the warm-up and was spotted on crutches after Saturday's match started.\nAustralian Associated Press",
  "word_count": 323,
  "scraped_at": "2026-02-14T12:30:25.759052"
}