{
  "article_id": "68810dd5dc79",
  "url": "https://www.thedailybeast.com/the-ultimate-sign-of-desantis-irrelevance-trumpworld-is-moving-on",
  "title": "The Ultimate Sign of DeSanti Irrelevance : Trumpworld Is Moving On",
  "date": "20230919T063000Z",
  "domain": "thedailybeast.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Two months ago, one of the leaders of the pro-Ron DeSantis PAC Never Back Down assessed what a really troubling scenario would look like for the candidate who was hyped as the GOP’s savior.\n“What would concern me,” Chris Jankowski, the PAC’s CEO, said in a July interview with The New York Times, “is if I woke up one day and Trump and his team were not attacking Never Back Down and Ron DeSantis.”\n“That would be concerning,” Jankowski continued. “Other than that, we’ve got them right where we want them.”\nIn just those two short months, that doomsday scenario is coming increasingly closer to reality for DeSantis.\nAs the Florida governor runs out of time to mount a serious challenge for the nomination, the biggest pro-Trump trolls have begun to look at him less as a threat and more as another grave in Donald Trump’s cemetery of GOP political rivals.\n“I’m gonna pull off a little bit and focus on the general [election],” Alex Bruesewitz, a Trump-aligned consultant—and self-described foot soldier “on the front lines of the influencer war, both online and in-person”—told The Daily Beast.\nBruesewitz is far from alone.\n“He still comes up in conversation, but the fire is gone because he’s already toast,” a Trump adviser said of DeSantis. “It was fun nuking him, though.”\nA second Trump adviser compared DeSantis to the former Arkansas governor in the race polling at an average of 0.4 percent.\n“It doesn’t take Einstein to see that DeSantis has shrunk so low in the polls, that at this point, he poses as much of a threat of winning the GOP nomination as Asa Hutchinson does,” this adviser said.\nWhen it comes to attacking DeSantis, Trump’s foot soldiers may be taking their cues from the general himself. In a Sunday interview with NBC’s Kristen Welker, Trump only mentioned DeSantis by name once. And more to the point, the most recent ad from the pro-Trump PAC is an entirely conventional commercial comparing the former president’s economic record to President Joe Biden’s.\n“He went down like an injured bird out of the sky,” Trump said at a recent speech in front of the Concerned Women for America Summit in D.C., an increasingly rare reference to the man who was once his biggest GOP threat.\nAt the beginning of the year, before he launched his campaign, DeSantis was neck-and-neck with Trump in some polls. Now, he trails by an average of more than 40 points, according to FiveThirtyEight’s poll tracker. The DeSantis campaign has instituted a series of “reboots,” laying off staff and struggling to raise the money needed to stay competitive.\nOf course, the Trump campaign hasn’t entirely given up on ridiculing DeSantis. Over a month ago, Jeff Roe, the top strategist for Never Back Down, said the Florida governor had “the next 60 days” to catch Trump in the polls, according to leaked audio obtained by The New York Times.\nSince then, the Trump campaign has sent out a daily “KISS OF DEATH COUNTDOWN” press email, a gleeful marking of each day DeSantis has left, by Roe’s own admission.\nWhile DeSantis’ poll and fundraising numbers may be the most directly threatening data points for his campaign, the disappearing interest that MAGA influencers like Bruesewitz have in attacking their hated rival captures how the primary has settled into a smooth Trump coronation.\n“A lot of people like me are looking at the primary as effectively over,” Bruesewitz said, “and are looking to pivot to the general already.”\nThe DeSantis campaign and Never Back Down did not respond to requests for comment.\nA GOP strategist told The Daily Beast it was noticeable that “the influencer crowd and the Trump campaign” had moved on from attacking DeSantis to “hitting Biden on the economy, hitting Biden on his age,” specifically pointing to the NBC interview as a notable departure from Trump’s approach just a few months ago.\n“There’s obviously a purposeful pivot to the general happening in Trumpworld, which is why you see an increased focus on Biden,” the second Trump adviser told The Daily Beast.\nStill, the adviser and occasional anti-DeSantis poster continued that “things got so personal in the primary that I don’t think Team Trump will ever fully take their boot off of Ron’s tiny neck until they feel like he’s not just dead on arrival in 2024, but also dead on arrival in 2028.\"\n“The memes,” the adviser added, “got out of control, though.”\nIndeed, the nasty broadsides between pro-Trump and pro-DeSantis figures began well before the governor launched his campaign.\nA boisterous pro-Trump instigator, Bruesewitz had spent much of the primary posting ruthlessly anti-DeSantis content and sparring with the governor’s influencers on social media—fights that occasionally boiled over into real life, as The Daily Beast reported in March.\nDeSantis’ campaign launch—a glitchy and distraction-filled conversation with Elon Musk and friends on the social media platform X—represented perhaps the peak of MAGA-world trolling, with Trump backers reveling in the schadenfreude.\nSince then, however, there have been few major moments—like a debate stage brawl—to add oxygen to the Trump-DeSantis feud, or feed the MAGA movement’s appetite for anti-DeSantis content.\n“You’re beating a team in the fourth quarter and you’re up 58 to 6,” the GOP strategist who wished to remain anonymous said of the pro-Trump trolls. “It’s the conference championship, and you wanna move on to the Super Bowl.”\nLongtime Florida pollster Brad Coker also borrowed a football metaphor to explain DeSantis’ predicament, with the governor now polling so far behind the former president.\n“It’s like being a rookie in the NFL,” Coker said of DeSantis, whose political prospects he argued aren’t finished just yet. “You go out in your first season, struggle to learn the playbook, and the second time around, you’re either better at it or out of the game.”\nIn a 2024 primary that’s already turned into somewhat of a snoozer by September, Trumpworld is starting to sound a lot more like a conventional GOP campaign, focusing on the economy and immigration despite the fact that their candidate is running under the unprecedented cloud of four criminal indictments.\nDespite Trump’s firm place atop the polls, with the exceptions of former New Jersey Gov. Chris Christie and Hutchinson, the rest of the field has taken a light touch to Trump in an effort to avoid incurring the wrath of his followers. There are also Republicans, including some on the Trump campaign, who think the former president’s criminal trials could lead to a brokered convention, incentivizing the rest of the field to hang around as long as possible while accumulating delegates.\nFor everyone else in the field, Coker said, the focus might as well be on 2028.\nCoker noted that, before Trump reshaped the GOP in his image, Republican voters reliably rewarded primary runners-up with the nomination the next time around, from 1976 to 2012. Whether DeSantis—or whoever the second-place finisher is—can continue the trend in 2028 could conform to a long “pecking order that’s pretty consistent,” Coker said.\nFor DeSantis, Coker continued that, at some point, that means a return to his day job as a “viable option” moving forward.\n“There’s no danger in going out there and touting your record,” Coker said. “You can disagree with Trump on some things as long as you don’t get terribly personal with him, and it’s kind of a dry run.”\nZachary Petrizzo contributed to this report.",
  "word_count": 1233,
  "scraped_at": "2026-02-14T13:51:01.445498"
}