{
  "article_id": "68861a477b14",
  "url": "https://www.sheknows.com/entertainment/articles/3000052/prince-william-first-social-media-post-kate-middleton-cancer/",
  "title": "Prince William Posts on Social Media After Kate Middleton Diagnosis",
  "date": "20240410T231500Z",
  "domain": "sheknows.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Prince William broke his social media silence after keeping quiet amid Kate Middleton’s ongoing cancer battle but the rare and personal message by no means gave supporters any insight into the couple’s past few months.\nPrince of Wales, 41, is currently taking time out of his public duties to be at home with Middleton, 42, and their three children — Prince George, 10, Princess Charlotte, 8, and Prince Louis, 5 — during the kids’ school break.\nHowever, William he did hop online to share a brief message of support after Rachel Daly, a star player on Aston Villa and the Lionesses, England’s women’s national soccer team, announced her retirement. “Thank you for so many unforgettable performances with @Lionesses, @RachelDaly3,” William wrote on the official Kensington Royal X account, which he shares with his wife.\nHe added, “Plenty more goals for Villa now!” Daly will continue to play at a club level for Aston Villa, a team William is known to be an avid support of and has even frequented games with son George.\nThe message was signed off with a “W” which, as royal supporters may know, indicates that the message came directly from William.\nThe Prince’s message of support isn’t a total surprise due to the fact that he is the president of the Football Association, the governing body of English soccer. However, it is a rare comment amid what is presumably a challenging time for the future king.\nWilliam has remained quiet amid speculation about Middleton’s health after she underwent an abdominal surgery in January and has even continued this silence after Middleton announced her cancer diagnosis publicly in March. It seems the Duke of Cambridge will only be commenting on things that pertain to his public duties for the foreseeable future!\nBefore you go, click here to see more photos of Prince William & Kate Middleton through the years.",
  "word_count": 312,
  "scraped_at": "2026-02-14T13:04:54.440673"
}