{
  "article_id": "68bbb7299400",
  "url": "https://www.wglt.org/local-news/2023-05-24/gender-enrollment-gap-is-wide-at-isu-bradley-heartland",
  "title": "Gender enrollment gap is wide at ISU , Bradley , Heartland",
  "date": "20230525T020000Z",
  "domain": "wglt.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "More women go to Illinois State University than men — a lot more. The same is true of Bradley University and Heartland Community College. It's part of a nationwide trend that began in the 1980s and has grown since then.\nIn 1972 the U.S. government passed landmark Title IX laws to promote gender equality in education. Back then, there was a 12-point gap in the proportion of bachelor's degrees going to men compared with women. The gap closed in 1982.\nSince then, it has widened the other way along with overall enrollment numbers. Total college enrollment has been falling since the Great Recession. But the drop also is disproportionate by gender. The male share of college enrollment fell each year from 2015 to 2020, and the pandemic made the gender gap bigger.\nGraduation rates amplify the gender gap. More men do not finish degrees than women who leave without a diploma.\n\"Essentially, you can say that the proximate cause is that girls do better in high school,\" said Sarah Reber, a Brookings Institute senior fellow and associate at the National Bureau of Economic Research.\nEnrollment numbers from 2022 show the national split is about 60% women and 40% men:\nIt's not that Title IX and access to higher education explains the gender gap. It's that Title IX revealed something that would have been happening all along, but for cultural norms that historically favored men. Other developed nations have similar gender trends in higher education.\n\"Women have been doing better in high school, like, as long as we have had data,\" said Reber.\nWhy are girls better than boys in K-12? There are several possibilities, including differences in brain development.\n\"Some hypotheses include differences in what economists sometimes call non-cognitive skills, behavioral stuff, everything from organization and executive function to things like acting out. There are significant gender gaps in all those things,\" said Reber.\nReber cautioned there's not enough work in the field yet to say how much of the difference is from brain development. Gender differences in course-taking choices and grades are more pronounced than they are in assessment test scores, she said.\nIt's not clear there should be policies that prop up a historically advantaged group, though Reber said the size of the gaps is concerning. She said society should want to use all its talents and make sure everyone is served. And on campuses where the balance gets too far out of whack, it can create less of a sense of belonging. Reber said strengthening supports for those who have weaker academic backgrounds is a good idea in general and could help men more than women, or maybe not.\n\"You do find some of the interventions we do in education don't work as much for boys as for girls,\" she said.\nSome experts have even suggested delaying the start of kindergarten by a year for all male students.\nIllinois State University\nIllinois State University pays attention to gender imbalances, but Associate Vice President for Enrollment Management Jana Albrecht said it's by professions and by colleges. For instance, there are significantly more men than women enrolled in the College of Business (COB) and the College of Applied Science and Technology (CAST). And women dominate the College of Education (COE) and the Mennonite College of Nursing (MCN). The largest area of the university, the College of Arts and Sciences (CAS), is closest to the national average.\n- COB — 64% male / 36% female\n- MCN — 13% male / 87% female\n- COE — 11% male / 88% female / 1% non-binary or not reported\n- CAS — 36% male / 63% female / 1% non-binary or not reported\n- CAST — 53% male / 46% female / 1% non-binary or not reported\n“Depending on the industry, we know we need more males in education. We know we need more males in nursing. But I think we still need more women in STEM fields. It’s our responsibility to pay attention to what industry is telling us they need, and if you do that, I think that balances out that 60-40 split,” said Albrecht.\nMen may skew more toward coming back to education sometime after age 25, she said, which speaks to the readiness and brain development issue.\n“Another big population are the adult learners. Do we need to call on that adult learner population and get them to come back and get a degree in the fields we have shortages. I think that’s something we could work on and facilitate as well,” said Albrecht.\nBecause girls do better than boys in K-12, there could be more men who go into the workforce after high school that could be attracted to something like nursing, she added.\nISU has only a limited number of adult learners and to make that be a part of the solution, Albrecht said they would need to find ways to attract more.\n“We would probably need to broaden our online options for adult learners, and we would have to have other services on campus for adult learners, but we’re certainly looking into the potential opportunity to serve that population,” she said.\nHeartland Community College\nThe pandemic affected the gender enrollment balance as well as total enrollment. That was particularly true for community colleges that tend to have more programs that prepare students for the workforce and programs in businesses that skew toward men. Those programs require more in-person learning and practical application settings.\nReber of the Brookings Institution said there's a risk that male enrollment will disappear forever, even if community colleges expand workforce readiness programs to relieve the pandemic bottleneck in the supply of students.\n\"I think if you disrupt the transition to college, that can be permanent,\" said Reber.\nHeartland Vice President for Enrollment Services Sarah Diel-Hunt said before the pandemic, Heartland also had a higher proportion of female students than peer institutions, but that is changing.\nHeartland gender balance (data from the Illinois Community College Board):\n- 2022 — 57% female / 43% male\n- 2021 — 62% female / 38% male\n- 2020 — 58% female / 42% male\n- 2019 — 56% female / 44% male\n“We are closing that gap between ourselves and other community colleges. We historically have been more transfer heavy than applied program heavy than many of the other community colleges in the state,” said Diel-Hunt.\nShe said Heartland has worked to expand more applied work-ready programs. As the needs of businesses have changed, so has Heartland workforce programs. In the past, Heartland workforce programs focused on female-centric professions such as nursing.\n“We’ve really been building out programs not because they attract males, but because (that is) what’s in demand in our local community. They are in areas of advanced manufacturing, HVAC, welding, renewable energy, electric vehicle energy storage, and agriculture,” said Diel-Hunt.\nWhen men enroll, they often do so later in the annual cycles. Diel-Hunt said Heartland has done marketing campaigns to get students to enroll earlier in the year, so they have more class choices. She said HCC general strategic enrollment efforts look at programs to help students complete degrees.\nAnd Diel-Hunt said even co-curricular programming might help convince male students to stick around: esports, a game club, and intramural activity for instance. She said other efforts to support identity-based organizations like the Black Student Union and a new association of Latin American students on campus could have a disproportionate effect on male student attraction and retention.\n“A lot of the things the college is doing generally to support enrollment should have the effect of supporting male enrollment as well,” said Diel-Hunt, adding collaborations with businesses for apprenticeships also can attract some of the men who have checked out of education.\nAnother broad trend for Heartland and most community colleges is growth in dual credit courses for high school kids. Diel-Hunt said students who get dual credit are more likely to go on to earn four-year degrees. That's particularly true for underserved communities.\nHeartland male enrollment in dual credit courses started at 34% in 2014. Male students were not early adopters. Now, the 44% male dual credit enrollment portion is about the same as the Heartland population as a whole. Diel-Hunt said it's a good sign that the dual credit growth in males comes in both transfers (gen ed classes) and applied (workforce) programs.\nLiberal arts schools\nTwo small liberal arts colleges in the region, Illinois Wesleyan University and Eureka College, cut against the nationwide trend with roughly balanced enrollment by gender.\n- IWU — 2022, 49% female / 51% male\n- IWU — 2021, 51% female / 49% male\n- Eureka — 2022, 49% female / 51% male\nReber said that doesn't surprise her.\n\"Probably some of, at least the selective private colleges, are doing essentially affirmative action for men because they want to have gender balance. They are very attentive to the on-campus experience, and I think students of both genders prefer a mix,\" she said.\nIllinois Wesleyan University has had a fairly even gender balance in recent years, according to Kasey Evans, dean of admissions and associate vice president for enrollment management. Evans said the IWU doesn't use gender as a factor in admissions, but the athletic program might explain some of the data.\n“In any given year, our athletic rosters run about 60% male and 40% female. We offer the same number of teams for both genders, but football and men’s lacrosse traditionally carry larger rosters than any female sport, which skews the number more (toward) male,” said Evans.\nAs student-athletes continue to make up a larger and larger percentage of the student body, it likely counters the national 60-40 balance that favors females, she said. IWU president Georgia Nugent said the competitiveness of the sports teams also may matter in gender balance enrollment choices.\n“We have national championship teams and I think that brings a number of young men to our campus and happily our student-athletes are also very good students. Their academics are serious,” said Nugent, adding IWU will double down on that: the school is adding men’s and women’s wrestling.\nOne thing that’s not a factor is family income. You might expect small liberal arts institutions to have an enrollment that skews wealthier than average, and could be expected to have more gender parity because of that.\nNugent said that's not the case.\n“When you compare us to the state universities, typically the economic quintiles of our students match up pretty closely.,” she said, noting about 30% of small liberal arts college students come from lower economic-bracket households.\nEven though college degrees provide more of a lifelong economic advantage over non-graduates than ever before, women aren't benefiting from the gender enrollment majority.\nThe Brookings Institution's Sarah Reber said even though women have more education in the labor market, the gender gap still tilts toward men. There are a lot of occupations that are heavily female and require a lot of education, but have low wages, she said.",
  "word_count": 1830,
  "scraped_at": "2026-02-14T13:09:07.412298"
}