{
  "article_id": "68c0c1762e73",
  "url": "https://www.manningrivertimes.com.au/story/8978004/european-clubs-eye-newcastle-jet-eli-adams-for-transfer/",
  "title": "European clubs eye Newcastle Jet Eli Adams for transfer | Manning River Times",
  "date": "20250528T081500Z",
  "domain": "manningrivertimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ELI Adams' breakout season for the Newcastle Jets has sparked interest in the striker from European clubs.\nSubscribe now for unlimited access.\nor signup to continue reading\nAustrian Bundesliga powerhouse Austria Vienna and English League Two club MK Dons have enquired about Adams.\nAdams' management Cove Agency confirmed it had been approached regarding the 22-year-old's availability but at this stage neither club has tabled an offer.\nThe European transfer window opens on Sunday.\nAdams has two seasons to run on his contract at the Jets. If offers materialise, a transfer fee would need to be negotiated.\nAustria Vienna finished third in the Bundesliga last season and have competed in the third-tier UEFA Conference League for the past five seasons.\nThe Violets qualified for the Europa League, which was won by Tottenham last weekend, in 2020 and last played in the UEFA Champions League in 2014.\nAdams is understood to be on a list of potential targers.\nFellow Australian, teenage Melbourne Victory academy product, George Mihailidis is on the books at Austria Vienna.\nMK Dons, which are owned by a Kuwait-based consortium, finished 19th in the four tier of English football last season and have a new manager in former Derby County boss Paul Warne.\nInterest in young Australian players from overseas clubs is at an all-time high.\nThe Jets sold Apostolos Stamatelopoulos to Scottish club Motherwell in 2024 for a reported $450,000 after the striker scored a club record 17 goals.\nAdams netted nine goals, including a finalists for the A-League goal of the year, in a breakthrough season.\nHe is set to be a major component in the rebuild under new coach Mark Milligan.\nUnlike, Stamatelopoulos, Adams has another two years on his contract.\nJets chief executive Tain Drinkwater, in a Q and A with the Newcastle Herald, made no secret of the club's desire to sell players overseas.\nA spokesperson said on Wednesday that the Jets were aware of the interest in Adams but the club had not been formally appoached.\nMeanwhile, Jets midfielder Sophie Hoban picked up the women's Playmaker of the Year accolade at the A-League awards ceremony on Tuesday night for the best assist of the season.\nThe 23-year-old earned the award for her driving run and silky pass to set up Sheridan Gallagher in injury-time against Melbourne Victory in Round 20.\nThe gomg capped a big year for Hoban who also won the Jets women's player of the year and the prestigious Cheryl Salsbury Medal.\nFormer Jets-now-Adaleide striker Archie Goodwin was named the A-League young player of the year.\nFellow Hunter product Angus Thurgate, who is at Western United, finished runner-up in the Johnny Warren Medal for the men's player of the year which was won by Nicolas Milanovic (Wanderers).\nClayton Taylor was the highest placed Jets player on 21 votes, seven behind Milanovic. Points were awareded on a 3-2-1 basis for each game.",
  "word_count": 480,
  "scraped_at": "2026-02-14T12:50:14.882525"
}