{
  "article_id": "68cd8f39c852",
  "url": "https://www.newcastleherald.com.au/story/8212002/olympic-azzurri-come-from-behind-to-seal-important-victories/",
  "title": "Newcastle Olympic , Charlestown Azzurri and Mid Coast seal wins in round 12 of NPLW NNSW | Newcastle Herald",
  "date": "20230528T123000Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Coach Neil Owens described is as a win \"we needed\" when Newcastle Olympic came from behind to beat New Lambton 2-1 at Lake Macquarie Regional Football Facility on Saturday night.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe NPLW Northern round-12 match was held at the Speers Point facility as a showpiece event of Female Football Week.\nOlympic, who went into the clash after losing two of three prior outings, trailed 1-0 at the break after Cassidy Davis scored from the top of the 18-yard box for New Lambton in the 16th minute.\nBut Olympic struck back through Alesha Clifford (50th minute) then Jemma House (61st) to kickstart a busy week in which they play three matches.\nClifford volleyed into the net from directly in front after good build-up play by Georgia Amess and House produced a piece of individual class to burn through the Eagles defence and score past a fast advancing Ally Boerje.\nNew Lambton hit the crossbar from a corner in the latter stages then had appeals for a handball in Olympic's 18-yard box fall on deaf ears.\nThe result elevated third-placed Olympic to 25 points while the sixth-placed Eagles (13 points) are facing a big effort to bridge the gap on the top four.\n\"It was a good second half, we were pretty dominant,\" Owens said. \"There was just a bit more belief and we got a bit higher. We just needed to get a bit higher up the park. Once they done that, it just looked so good.\n\"We needed that win a little bit. We got beat by Maitland then had a win against Mid Coast then got done by Magic, so you start to doubt yourself. That's why it was super important to get three points, knowing that you've got three games in seven days.\n\"To win that first game, that's a key, a really good confidence boost.\"\nOlympic play Azzurri in a Women's League Cup semi-final at Speers Point on Wednesday night before battling Adamstown (16) at the same venue next Saturday.\nOn Sunday, second-placed Charlestown (27) also came from 1-0 down to beat Adamstown 2-1 at Lisle Carr Oval and Mid Coast (6) were 4-0 winners over Warners Bay (0) at John Street Oval.\nJosie Morley scored from close range off a corner in the 25th minute for Rosebud but Cassie Corder equalised in the 34th minute.\nBoth goalkeepers repelled several chances before Lilly-Jane Babic produced the matchwinner after a free kick in the 82nd minute.\nLori Depczynski's free kick on halfway was nodded on by Brianna Williams to put Babic on goal and the striker did well to squeeze the ball past Olivia Sneddon and into the bottom right corner.\nAzzurri's Indianna Asimus had an early chance to score from the penalty spot but fired her shot in the third minute into the crossbar then Sneddon got a hand to it.\nZora Boskovski scored twice - the first from the penalty spot - then Sophie Gallagher and Beth Kauter also got on the scoresheet for Mid Coast, who led 3-0 at the break.\nThe clash between leaders Broadmeadow's (28) and fourth-placed Maitland (21) scheduled for Magic Park on Friday night was washed out.\nPoints: Magic 28, Azzurri 27, Olympic 25, Maitland 21, Adamstown 16, New Lambton 13, Mid Coast 6, Warners Bay 0.\nMORE IN SPORT:\nTo see more stories and read today's paper download the Newcastle Herald news app here.",
  "word_count": 574,
  "scraped_at": "2026-02-14T12:39:27.771958"
}