{
  "article_id": "68f00874ecaa",
  "url": "https://www.90min.com/matt-beard-insists-no-pressure-liverpool-top-four-wsl-finish",
  "title": "Matt Beard insists there is no pressure on Liverpool after top four finish",
  "date": "20240920T073000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Matt Beard insists there is no pressure on Liverpool after top four finish\n- Liverpool will hope to build on their top four finish last season\n- The Reds completed a stadium move this summer and will play more games at Anfield\n- Matt Beard discusses recruitment, pressure and his approach when facing top teams\nNobody, not even Matt Beard himself, expected Liverpool to achieve what they did last season.\nThe manager’' first spell at the club over a decade ago saw him lead Liverpool to back-to-back Women's Super League titles in 2013 and 2014. However, when he returned in May 2021, the expectations were far more tempered.\nBeard had two years to get Liverpool back into the WSL after their bitter relegation in 2020. He did it in just one.\nThe priority for their first campaign back in the top flight was survival - establishing themselves as a WSL side again and avoiding the frequent fate of newly-promoted teams finishing bottom and heading straight back down. A mid-table finish in 2022/23 was no small feat.\nBut last season was a different story. Liverpool won 12 of their 22 league matches, storming to a top-four finish. Along the way, they recorded historic wins against Arsenal, Manchester United and Chelsea, finishing just nine points off the European spots.\nHowever, Beard knows that repeating such achievements won't be easy. The WSL is becoming more competitive every year, and despite Liverpool's stature as one of football's most iconic clubs, their spending power in the women's game is far more limited than that of their rivals.\n\"It's going to be tough,\" Beard admitted at the Barclays WSL 2024/25 season launch media day earlier this month. \"I think we overachieved last year.\n\"I knew the players we were bringing in last year were good players, but I know the WSL is a tough league to settle into. I feel they surprised me, especially the younger ones.\n\"If we had a negative result, we went on a good run after that, so that part really did surprise me. I've been involved in teams where you've got young players, and if you get one [bad] result, it can turn into two or three. But, the girls responded really well last year.\n\"I think it's going to get tougher and tougher to break into the top three. If you look at the money they're spending, it's just ridiculous. We’ve got to be conservative and manage the budget we've got. We work really hard on our recruitment and I feel we've brought in some good players this summer. We'll see where it takes us.”\nOne of those recruits is Canada starlet Olivia Smith, signed for a club-record £210,000 after Liverpool triggered her release clause at Sporting CP. Swedish striker Cornelia Kapocs and Wales defender Gemma Evans rounded off a modest summer of recruitment, which pales in comparison to some of the league's big spenders.\nWhere Liverpool may lack in budget, they make up for it with shrewdness. Among last season's recruits, relatively unknown players like Marie Hobinger and Jenna Clark turned out to be some of the best signings in the league.\nBeard attributes this success to strong relationships with agents, his track record for developing talent, and a data-driven recruitment process. \"First of all, it's about having good relationships with agents,\" he stressed.\n\"If you look at every club I've been at, we've never been blessed with a big budget like your top teams, so you've got to work that little bit harder. Especially some of the younger elite level players, the agents trust me to help them develop and take them to the next level.\n\"When I signed Asisat Oshoala all those years ago, and some of the players that have come through, they've gone on to have fantastic careers. I'd even give Fara Williams as an example. When she came to Liverpool, she wasn't in the England team. It's not just the younger players.\n\"We work hard at it and we watch a lot of footage. We have specific stuff we look at and specific data to see whether they fit with our style and model. There's a lot of work that goes into it.\"\nThe use of data in recruitment has become more common in women's football, though it's still in its early stages compared to the men's game. \"It's getting there,\" Beard added.\n\"But the key thing for me when you're looking at data is you need to look at what league they're playing in. We looked at someone three years ago at Benfica and her goalscoring record was through the roof, and her stats were better than Ada Hegerberg who, at that time, was probably one of the best centre forwards in the world.\n\"But, when you look at some of the games they're winning 18-0. We use certain parts of data and certain tournaments. Let's say, in France, we'd maybe only look at the tough games and the international games. We look at it that way, but the data is getting there and it’s getting better and better every year.\"\nLiverpool's development off the pitch has been just as crucial. Last year, they vacated Tranmere's Solar Campus to move into the club's former historic training ground, now the AXA Melwood Training Centre. This summer, they also relocated from Prenton Park to St Helens, with the added commitment to playing three games at Anfield—a significant step up from the one-off Merseyside derby played there in recent seasons.\n\"We're in Merseyside now, not on the Wirral,\" Beard explained. \"Tranmere's ground is blue, we're a red club. St Helens is red.\n\"From listening to conversations when I've been on calls, that's some of the feedback from the fans. Blue stadium, red stadium - stuff like that. It's a modern stadium. I loved Tranmere, personally, because [opposition] teams hated going there. We have to make St Helens like Tranmere, so that's going to be our biggest challenge this year.\n\"[More games at Anfield] is also an important step. If you look at Arsenal and Aston Villa playing their games in the main stadiums, Arsenal proved it last season that there are people willing to come and watch the product and pay for tickets so you’re not giving them out.\n\"From my perspective, it's a massive step forward for us. The move to St Helens is a positive step, and if you look at [the move to] Melwood last year, the stadium this year, it shows the progress that we're making, which is pleasing.\"\nOn the pitch, Liverpool’s ability to secure big results against top sides was one of the most impressive elements of last season. They opened the campaign with a narrow 1-0 win at Arsenal, beat United home and away, and shocked Chelsea with a 4-3 win at the end of the season.\n\"If you show them too much respect, then they're just going to get a foothold in the game and you're struggling,\" Beard explained. \"It's the belief in the players. Sometimes, when you're playing these top sides, you're already beaten.\n\"If that's the mentality you have, then you're going to get beat. What I changed last season, we'd concentrated far more on them than ourselves, once we moved away from that we kicked on from there.\"\nWith success comes expectation, but Beard remains realistic about the challenges ahead. While last season's fourth-place finish raises external expectations, the manager is more focused on Liverpool's growth. \"Every year we look at what we've done and we look at how we can improve.\n\"We look at how we can evolve how we play, and we want an improvement on last year points wise. We don't spend anywhere near as much money as the top five or six. We're astute with the money we've got. From my perspective, I know what we're spending in relation to where we are.\n\"There's no pressure on us.\"\nREAD THE LATEST WOMEN’S FOOTBALL NEWS, OPINION & ANALYSIS",
  "word_count": 1326,
  "scraped_at": "2026-02-14T12:22:53.986142"
}