{
  "article_id": "6922c4e83690",
  "url": "https://thenet.ng/janine-anthony-global-influence-from-an-unlikely-start/",
  "title": "Inside Janine Anthony journey building global media influence from an unlikely start",
  "date": "20251229T204500Z",
  "domain": "thenet.ng",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "You probably do not know who Janine Anthony is, and that’s okay, as she likes to keep a low profile. Yet, in the dynamic, often chaotic, landscape of African media and sports, few people and even fewer women have the clout and attention that she commands quite like she does.\nI can describe Janine Anthony as a broadcaster or media expert, and it will not do her enough justice. How do you describe someone who grew up in the bustling neighbourhood of Okota, studied Marine Biology in Calabar, and made history in the Sports industry while helping big techs like TikTok and Snapchat penetrate the African market?\nOne report describes her as a disruptive force, a tech-savvy powerhouse who has seamlessly stitched together the worlds of sports, digital innovation, and social advocacy. Janine would take that. For the discerning audience, especially the women who dare to dream bigger, the football lovers who are upset that the authentic African narratives are not being told enough, and our entertainment community that appreciates a good hustle, Janine Anthony is the blueprint.\nJanine Anthony’s genius lies in her ability to identify a void and fill it with unapologetic excellence. Early in her career, she noticed the frustrating invisibility of African women’s football. Instead of waiting for the industry to grant her a seat, she did what every true entrepreneur does: she built her own table.\nShe founded LadiesMarch, a pioneering Pan-African digital network dedicated to women’s football and Janine would later go on to work as a Producer on the documentary, All Roads Lead Down Under, a 6-part FIFA+ series released for the FIFA Women’s World Cup 2023.\nThis same hunger and drive propelled her into the global media spotlight after her Business Administration degree in the UK. She made history, becoming the first African woman to lead football commentary at a major men’s tournament, the AFCON 2019 in Egypt, while working for the BBC. That moment, calling the shots pitchside, was more than a personal win; it was a powerful statement of representation, a moment of pride for every young African girl and woman watching. As she recalls, the experience was overwhelming, but the validation came later, cementing her status as a global authority. This led her in 2021 to create for CAF and FIFA the first-ever all-female commentary team for the Women’s Africa Cup of Nations, held in Morocco.\nHer stint at the BBC established her as an African sports and media expert, and she went on to feature on Sky Sports, and as a Presenter, Reporter and Producer for the Premier League is a testament to her relentless self-development. She has interviewed Arsenal’s Mikel Arteta, among others, while getting effusive praise from Ian Wright. That’s not all. She went on to work as the only Nigerian-born Matchday Reporter at the 2025 FIFA Club World Cup for DAZN. While Mikel Obi worked in the DAZN studios, she was pitchside with some of the legends like Lionel Messi and Sir David Beckham and interviewing some of the greats like Claude Makalele, Luis Enrique and Claudio Macherano.\nWhen I spoke with Janine earlier in the year, she reiterated that her story exceeds her work in Sports and the influence she wielded in the broadcast booth. She is a digital strategist who understands the pulse of the creator economy. As the Sports and Gaming Partnerships Lead for Sub-Saharan Africa at TikTok until 2024, she was passionate about the opportunities in the industry that Africans were not leveraging. Her stint coincided with the rise of in-game streaming on the app, which enabled some games to get global opportunities.\nTo her, the role was more than managing a portfolio; she localised a global product. She carved out Sports and Gaming as standalone verticals, providing monetisation frameworks and giving African creators the platform and recognition they deserved, including launching the platform’s first-ever African Sports and Gaming Creator of the Year awards.\nJanine’s commitment to equity is perhaps her most powerful legacy. She championed the Locker Room Bonus, as Head of PR and Communications at PawaTech (owners of betPawa and Mchezo), to foster a game-changing, equal-pay initiative that ensures both male and female players receive instant mobile money rewards for match wins. It’s a brilliant example of using technology and corporate influence to enforce financial parity in a sector notorious for gender pay gaps.\nIn her latest, most significant pivot, Janine is taking her expertise in scaling African digital ecosystems to the next level, partnering with Snap Inc. as the Consultant to lead their Creator Partnerships & Content Strategy efforts in Africa. Having mastered the creator and content ecosystem at TikTok, she is now thrilled to bring that experience to Snapchat, shaping their strategic investment in this key growth region.\nAs she puts it, “Empowering African storytellers on the global stage will always have my heart,” and the opportunity to shape conversations and build movements from the ground up in one of the world’s most dynamic markets is one she had to jump right into. Janine Anthony is a woman who understands that true power is measured by the tables you build for others.\nShe is a beacon of hope, a reminder that the Nigerian dream is not just alive—it’s global, tech-driven, and fiercely female. She is not just a trailblazer; she is a movement, and the world is finally catching up.",
  "word_count": 893,
  "scraped_at": "2026-02-14T12:13:36.407183"
}