{
  "article_id": "6925431ce4d0",
  "url": "https://963kklz.com/2023/03/02/las-vegas/",
  "title": "Two Las Vegas Stars Getting Married",
  "date": "20230303T010000Z",
  "domain": "963kklz.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Two Las Vegas Stars Getting Married\nFootballs aren’t the only thing in the air for one Las Vegas Raider. Love is flying all over the place for Tight End Darren Waller. He is trending today because…\nFootballs aren't the only thing in the air for one Las Vegas Raider. Love is flying all over the place for Tight End Darren Waller. He is trending today because the young star is getting hitched. And while that alone is enough to make headlines. It's WHO he is marrying that is the talk of the town.\nThere's about to be two sports stars in the same house.\nThe bride to be is another Las Vegas star. Waller's fiancé is Kelsey Plum. A guard for the Las Vegas Aces. The 28-year old basketball player will marry the 30-year old football player this weekend in Las Vegas. Plum, a native of California, started playing basketball in high school. She joined the Aces in 2018.\nWaller was born in Maryland and raised partly in Georgia. He played football for Georgia Tech until he was drafted in 2015 by the Baltimore Ravens. He has been with the Raiders since 2018.\nWaller won the 2020 Pro Bowl with the Raiders. Plum won the Gold Medal in Women’s 3×3 basketball at the 2020 Summer Olympics. And she was named the WNBA All-Star Game Most Valuable Player (MVP) in 2022. Needless to say, these two are the new power couple in sports.\nHow the two lovebirds met is a secret.\nWaller and Plum are very quiet about their private life. That's why you won't find any pics of Waller on Plum's Instagram account.\nWaller's Instagram account is devoid of the couple's pics as well.\nBecause of their desire to keep their private life private, nobody in the general public knows how the two met. But they were both new to the Las Vegas sports scene in 2018. And both had a big year of success in 2020. So they weren't lacking in things to talk about whenever their paths did first cross.\nA perfect Las Vegas wedding.\nIt only makes sense that the bride and groom will get married in Las Vegas. The location of the nuptials is being kept quiet, but it will happen this weekend. Congrats to the newlyweds!\n– Wendy Rush\nTom Brady Wants To Be A Stand Up Comedian?\nIs Tom Brady looking to be the next Seinfeld?\nAccording to RadarOnline.com, the seven-time Super Bowl champion quarterback is planning a career in stand-up comedy, but his inner circle is trying to talk him out of it. A source told RadarOnline.com that \"Tom was a terrific quarterback, but he needs to toss this idea before it's too late.\"\nI can't imagine this is true, but the report comes as Tom Brady announced that he will start his job at Fox Sports in the fall of 2024 despite announcing his retirement from the NFL in February.\nTom Brady has no stand-up comedy experience, but he did star in the sports-comedy movie 80 for Brady with Jane Fonda, Lily Tomlin, Sally Field and Rita Moreno. Some say when Fonda, Tomlin and Moreno began showing praise to Brady, it gave him the confidence to make the jump into comedy.\n\"The ladies were super nice to him and he did a nice job reading professionally written material in a small part — but stand-up comedy is a whole different league! Friends say \"he does a great impersonation of former teammate Rob Gronkowski — and his over-the-top Boston accent is hilarious.\"\nI swear, if I'm working with Tom Brady at any comedy club, and he's making more than me, I'll take him right down!\nHe spoke to FS1 host Colin Cowherd about the Fox Sports job, he said he wanted to be 100% prepared before getting in the booth. \"Decompression's important,\" Brady said. \"You're on this crazy treadmill/hamster wheel loving it at the same time. It's a daily fight… For me, I want to be great at what I do. \"Talking last week to the people at Fox Sports and the leadership there, they're going to allow me to start my Fox opportunity in the fall of 2024.\"\nTom Brady reportedly signed a 10-year contract with Fox that is worth as much as $375 million.\nWHY WOULD HE WANT TO BE AN OPENING ACT AT THE CHUCKLE HUT??!!\n-Carla Rea\n- Twitter: https://twitter.com/kklz963\n- Instagram: https://www.instagram.com/kklz963/\n- Facebook: https://www.facebook.com/kklz963/\nSome football jokes Tom Brady might want to try. Make sure you read them, and end the punchline with a \"Ba-dum-bum -tsss\" (rimshot).\nDid you hear about the football player who needed a new uniform?\nHe went to New Jersey!\nAnd then I said - you know what happens to football players who lose their eyesight, right?\nThey become referees!\nYou know why they don't play football in the jungle?\nToo many Cheetahs!\nI met a girl at a bar, and we didn't really hit it off, so I said -\nCatch you later!\nI'll tell you how you keep a Chicago Bears fan out of your yard -\nPut up a goal post!\nYou know what you call a Buccaneer?\nA good price for corn!\nWhat do you call a Detroit Lion with a Super Bowl ring?\nA Thief!\nWhy can’t a New York Jets player get into his own driveway?\nBecause someone painted an endzone on it!\nAnd then I said to the flight attendant -\nPut me in coach!!",
  "word_count": 909,
  "scraped_at": "2026-02-14T12:38:55.702949"
}