{
  "article_id": "694f783b0084",
  "url": "https://www.tuftsdaily.com/article/2023/09/tom-brady-invests-in-birmingham-city",
  "title": "Tom Brady invests in Birmingham City",
  "date": "20230905T044500Z",
  "domain": "tuftsdaily.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "From “Black Panther” (2018) and “Creed” (2015) star Michael B. Jordan investing in A.F.C. Bournemouth to the sensational takeover of Wrexham A.F.C. by Hollywood duo Ryan Reynolds and Robert McElhenney, American investments in English football have become increasingly common in the last decade. Such celebrity financing is not limited to elite clubs and can be transformative for those hoping to climb the footballing pyramid.\nSimilar to the Hollywood elite, American athletes have also shown interest in English teams. LeBron James currently owns 2% of Liverpool F.C., a club whose value has skyrocketed in the last decade, while J.J. Watt, American football star and former NFL defensive end, owns a minority stake in the recently promoted Burnley. Russell Westbrook recently joined golf star pair Jordan Spieth and Justin Thomas as investors in Leeds United.\nIn August, Tom Brady became the latest star-turned-investor as he partnered with Knighthead Capital Management LLC, which bought 45.64% of Birmingham City Football Club. The American investment firm also purchased the club’s iconic St. Andrew’s Stadium, with plans for major renovation in the works. Despite being England’s second biggest city, Birmingham has struggled to establish a formidable legacy for its namesake in the Premier League. Their intercity rivals Aston Villa, however, are enjoying their fifth consecutive season in the first division. Birmingham’s last season in the top flight was in 2011 and they have since struggled in the Championship League. In terms of youth development, Birmingham has produced several exciting Premier League players, including the likes of Burnley winger Nathan Redmond and Everton’s Demarai Gray. Despite such players, their greatest academy creation is none other than Real Madrid’s newly signed midfield anchor, Jude Bellingham. Bellingham leads La Liga with five goals in his first four games for Los Blancos, joining five-time Ballon d’Or winner Cristiano Ronaldo as the only player to score in the first four games in the Spanish first division season.\nSuch talent is proof of the healthy academy ecosystem that exists at the club. But producing one-off talent every few years does not guarantee promotion, especially when those players are often sold to raise transfer funds. Knighthead and Brady’s partnership will be focused on investing in academy facilities, funding high-caliber recruitment and generating media revenue for the club, the latter being Brady’s forte. The club stated that Brady’s role will allow him to “apply his extensive leadership experience” when working with “the sports science department to advise on health, nutrition, wellness, and recovery systems and programs.” His promotional value, however, cannot be overlooked.\nThe seven-time NFL champion is worshiped in the United States with his popularity slowly spreading through Europe and Asia in the last decade. On Instagram, Brady has 14.3 million followers. That might seem low in comparison to other global stars, but Birmingham City alone has 251 thousand. America is an attractive market for any soccer venture as it prepares itself to host the World Cup alongside Canada and Mexico in 2026. Lionel Messi’s recent arrival to the MLS at Inter Miami is another indicator of the nation slowly falling for the magic of the beautiful game. In his announcement video, Brady admitted that he has much to learn about English football but stated “I do know a few things about winning, and I think they may translate pretty well.” Brady also discussed being the underdog and how it motivates him more. Birmingham is in need of a vision and Brady seems to believe it.\nTom Wagner, co-founder of Knighthead Capital and new club chairman, said that by bringing Brady into the club, “we are setting the bar at world class,” further explaining how he will serve as a chair on the advisory board working to improve both the men’s and women’s programs.\nBirmingham City is currently fourth in the Championship and is still unbeaten. A late penalty from Lukas Jutkiewicz against recently relegated Leeds United stands out as the highlight of the campaign so far. Brady’s arrival and the vision set for the club has Birmingham buzzing again, as the Blues hope to bounce back to the Premier League.",
  "word_count": 678,
  "scraped_at": "2026-02-14T13:09:54.403586"
}