{
  "article_id": "69558a4d2d14",
  "url": "https://www.twtd.co.uk/ipswich-town-news/41202/cook-weve-got-really-good-options/onthisday",
  "title": "Cook : Weve Got Really Good Options - Ipswich Town News",
  "date": "20231008T190000Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Friday, 8th Oct 2021 12:46\nTown host second-bottom Shrewsbury at Portman Road on Saturday looking to put last weekend’s 2-1 defeat at Accrington behind them. The Blues will be without forward Bersant Celina as he is away with Kosovo but Cook says he knows the team he is going to field.\nThe Blues had appeared to have turned a corner after three games unbeaten, the third a 6-0 home walloping of Doncaster Rovers but were brought firmly back down to earth by the loss at the Wham Stadium last Saturday.\nBut on Tuesday a Town side featuring 11 changes from the team which started against Doncaster and Accrington comfortably won 2-0 at Gillingham in the Papa John’s Trophy and the Blues have now lost only one of their last five in all competitions, winning three.\nCook hints that he probably won’t stray too far from the XI which started the thrashing of Doncaster and the defeat at Accrington, although he is forced into one change with Bersant Celina away with Kosovo.\n“We’ve got really good options,” Cook said when asked whether he has decided who to field in the on-loan Dijon forward’s place.\n“I think after the disappointing performance at Accrington, it’s really hard to make changes because if you leave one or two out, it’s like you’re blaming one or two for the team performance.\n“Obviously with Bersant going on international duty, we have a clear option to make one change.\n“We know the team, the team’s already known and we’ll go and work as hard as we can. The brutal reality for us all is that the season is long for everyone and squad depth is so important.\n“Every time you get an opportunity to go on the pitch like Tuesday night, where Pigott and Chaplin both get good goals, we have a lot of good individual performances, [you have to stake a claim]. We never spoke about that after the West Ham defeat at home.\n“And all of a sudden as the club’s grown and built, the lads are learning that when your opportunity comes you must take it if you want to stake first-team claims.\n“Within that, if you’re playing in the first team, to hold your shirt, you’ve got to have a level of performance and unfortunately for a lot of us we all dropped below that at Accrington.\n“But that was off the back of probably a three-game run we were delighted with. By the time you want to make changes as a manager, you’ve also got to temper that with what’s the correct and proper decision.”\nShrewsbury have had a tough start to the season and are 23rd in the League One table on eight points, two points and four places behind the Blues.\nOne big positive, however, has been the return to the dugout of manager Steve Cotterill, who was hospitalised for 33 and then 16 days earlier this year due to Covid-pneumonia.\n“Great to see Steve back,” Cook said. “We played then up there at the end of the year and I had a really good chat with Steve [who watched that match from the directors’ box].\n“He’d really been knocked for six by the Covid, he really, really had and it’s great for Steve and his family that he’s back on the touchline, that he’s back up and running.\n“He’s a really good football guy, he’s had good success at football clubs where he’s been. His Shrewsbury team have been built now a little bit in the summer, similar to us. They’re probably finding their way still a little bit.\n“I’m sure Steve will be quite pleased with some of the performances and I’m sure he’s probably disappointed with one or two of the results. They’re certainly a big threat to us tomorrow.”\nCook, who will be looking to record back-to-back wins for the first time as Town manager, seems likely to field the same team which started against Doncaster and Accrington aside from Celina.\nThat would see Vaclav Hladky in goal, Janoi Donacien and Matt Penney at full-back and George Edmundson and Cameron Burgess at centre-half.\nIn midfielder, Sam Morsy will skipper alongside Lee Evans with Scott Fraser on the left and Wes Burns on the right.\nConor Chaplin seems likely to replace Celina in the number 10 role with Macauley Bonne out to add to his eight goals - seven in his last six matches - as the lone striker.\nKyle Edwards is likely to play a part from the bench, while Idris El Mizouni and Louie Barry will hope to have won a place among the subs with their displays at Gillingham.\nShrewsbury boss Cotterill says he thinks he knows the Town XI that will be facing his side.\n“I think we have an idea of their team and it won't change dramatically even though they have lots of players because Paul Cook has already been through that and made changes,” he told his club's official site.\n“We could probably guess eight or nine of their players and we have to work on the theory of what we think their team will be.\n“First and foremost, you have to work on strengths and weaknesses all around the pitch. The lads will know every player's strengths and weaknesses.\n“By the time we complete our preparation on Friday, everyone will know what they have to do. That's not just on the strikers, that's on the right-back, central midfield and everywhere else.\n“A few of our lads would have played against some of their lads before so they will have an idea of what they're coming up against.\n“Ipswich is a fantastic club and one of those places to go and play football. They have fantastic fans and it's one of those grounds where you expect a good atmosphere. It's good for our lads to go there and play, similar to Bolton last week.”\nCotterill is waiting on only one fitness concern ahead of the game: “The only other lad who has a knock is [left-back] George Nurse and we'll have to see how he is tomorrow morning. Other than that, everyone is OK.”\nDefender Elliott Bennett could miss out following the death of his father this week.\nHistorically, the Blues have had much the better of matches between the two sides, winning 14 games (11 in the league), losing three (one) and drawing 10 (seven).\nAway from home this season, Shrewsbury are without a win having lost four and drawn one.\nThey have lost their last two in the league, a 2-1 defeat at Bolton last weekend following a home reverse to Wycombe by the same scoreline, but beat the Wolves U21s 3-1 at home in the Papa John’s Trophy on Tuesday.\nThe Shropshire side have won one of their last six in the league, a 2-1 home victory over AFC Wimbledon late last month.\nTown are unbeaten against the Shrews in 10 games stretching back to an old Second Division match at Gay Meadow in January 1987 when Bobby Ferguson’s side were defeated 2-1.\nIn May, Town’s final away game of 2020/21 at Montgomery Waters Meadow - a fixture which had been postponed in an hour before its scheduled start due to a frozen pitch in February - ended in their ninth 0-0 draw of the season.\nClear-cut chances were rare at both ends with Troy Parrott forcing home keeper Harry Burgoyne into a couple of saves and the Irishman and Norwood both shot over for the Blues, while sub Dan Udoh looped a header onto the top of the Town cross-bar at the other.\nAt Portman Road in November last year, sub Jack Lankester netted a winner seven minutes into injury time to see the Blues to a fortunate 2-1 comeback victory over Shrewsbury.\nOliver Norburn’s fourth-minute penalty - the first goal conceded by Town at home in the league in 2020/21 - had given the Shrews a 1-0 half-time lead with the Blues very much under par.\nThe game appeared to going nowhere until Ethan Ebanks-Landell’s bizarre 75th-minute own goal, before Lankester’s close-range header grabbed an undeserved three points for Town.\nJon Nolan and Toto Nsiala followed their former Shrews manager Paul Hurst, his assistant Chris Doig and other members of his staff to Portman Road in the summer of 2018 having been part of the side which had reached the League One play-offs the previous season.\nNolan moved to the Shrews in June 2017 and made 55 starts in his one season there, scoring 10 goals.\nNsiala signed in January 2017 and made 79 starts in his 18 months with the Shrews, scoring four times.\nFormer Blues loan centre-half Matthew Pennington joined Shrewsbury on loan from Everton in January, a switch which was made permanent in the summer.\nPennington, 26, made 31 starts and scored one goal while with the Blues during the 2018/19 campaign.\nSaturday’s referee is Will Finnie from Luton, who has shown 13 yellow cards and one red in nine games so far this season.\nFinnie’s one previous Town match was the 3-0 Carabao Cup victory over Bristol Rovers at Portman Road on the opening day of last season in which he booked Luke Woolfenden, Andre Dozzell and one of the visitors.\nSquad from: Holy, Hladky, Donacien, Vincent-Young, Penney, Woolfenden, Nsiala, Edmundson, Burgess, Morsy, Harper, El Mizouni, Fraser, Burns, Chaplin, Aluko, Edwards, Bonne, Pigott, Barry, Norwood, Jackson.\nPhoto: TWTD\nPlease report offensive, libellous or inappropriate posts by using the links provided.\nI guess this is how Cook gets his kicks, his three minutes in the spotlight. Funny how Sir Bobby, an infinitely more successful manager than Cook will ever be never felt the need to embarrass himself this way nor for that matter any other manager I can think of world wide in football. So be there in time for his grand entrance tomorrow but even if you do feel the need to cheer him, please keep your Y - Fronts on\nPS I'm really pleased to Steve Cotterill back up and running again. I always liked him as manager and I'm sure he will just be grateful he is still able to do just that.\nWhen we have the ball we have four up top and two supporting full backs and two midfielders, effectively a 2 4 4. When we don't have the ball we drop to one up top but when you've not got the ball does that really matter?\nTired of reading the same ignorant negativity from people who don't know the job and couldn't find anything better to do with their lives than come on here and moan.\nCook has completely restructured the club, we all wanted Lambert and Evans out and we got our way. Talk of us getting promoted last season? FFS where do you think that side would be now? It failed us for 2 full years. Give the guys a chance over a season, and if you've really got all the ideas that make a difference, get a job and stop whingeing when you have no credentials to do so.\nYorkieblue nails it about Robson, it took him years but with patience he came good. And in our cup winning season we only finished a couple above the relegation zone too.\nCOYB\nAmazing how people still keep referring to Robson when he first started at Town and his slow start back in 69'...I think the football climate has quite radically changed since then with far more pressure put on managers simply due to the money involved, you just cannot compare.\nPot and kettle.....youve come on here to have a moan about the moaners lol\nYes I'm proudly moaning about the Moaners it's our job to get behind the team not to pretend we could run it better. And as fas as mills and Mathie are concerned, that sounds to me like you've been listening to BBC Suffolk and not even bothered to go yourself.\nIf you think having two big CF in the side and abandoning playing through the middle or down the wings with high balls thumped towards two big guys you should maybe get Whymark and Bellfitt back…..\nEnjoy The commentary tomorrow, I'll be at the game….\nYou need to login in order to post your comments",
  "word_count": 2045,
  "scraped_at": "2026-02-14T12:07:06.135299"
}