{
  "article_id": "69554a778feb",
  "url": "https://www.examiner.com.au/story/8523547/more-dedication-required-for-east-coast-swans-in-ntfaw/",
  "title": "  More dedication  required for East Coast Swans in NTFAW | The Examiner",
  "date": "20240216T041500Z",
  "domain": "examiner.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "East Coast's introduction to NTFAW football was far from smooth sailing.\nSubscribe now for unlimited access.\nor signup to continue reading\nTwice forfeiting last division one campaign, the Swans failed to score in five contests, were beaten by 100 or more in four and kicked just five goals for the year.\nBut for the Swans, a difficult first year was expected and it has been the norm for clubs entering the women's competition in years past.\nLongford, for example, won their first-ever women's match during their second season, which just happened to be against East Coast in round six.\nAnd there is proof of light at the end of the development tunnel for new teams in the form of last year's division one premiers, Deloraine.\nBuilding a strong culture and bringing in strong recruits, the Kangaroos quickly climbed the ladder and managed to claim the ultimate prize in just their third season.\nWhile a date at UTAS Stadium seems a long way off for the Swans at the moment, club president Stephen Walley said there are examples which provide encouragement so long as they stay the course.\n\"The experience of others is something one can draw upon, every club's a little bit different, but we know it takes several years because you are creating something pretty much from scratch,\" he said.\n\"We're just pretty determined to hang in there and build it and we'll be really excited when we see our junior program coming up pretty soon.\"\nThe program Walley speaks of is an enhanced girls' junior pathway in which the Swans have added an under-17 team to their existing under-14s.\n\"We'll come into our own once we've had under-14 and under-17 girls in for two or three years ... that's probably when our most exciting time will be for women's footy on the Coast.\"\nBut that is not to write-off the immediate future for the Swans, with Walley admitting plenty had been learned from the maiden season which they plan to address for 2024 under new coach Chelsea Wells.\n\"The women that played had lots of fun as well as the officials that helped out, but they will know that if we're going to sustain and find our place, there needs to be a bit more dedication and commitment to training and playing,\" he said.\n\"And to help the whole trajectory of ongoing development, certainly we need to build our volunteer base around that to be fairly autonomous as a women's team.\"\nWith the arrival of St Pats, East Coast will no longer have the association's newest women's team and will be entering into an eight-team league instead of seven.",
  "word_count": 441,
  "scraped_at": "2026-02-14T12:57:17.734683"
}