{
  "article_id": "695a408f7756",
  "url": "https://www.pakistantoday.com.pk/2026/01/28/no-military-operation-in-tirah-migration-routine-and-seasonal-centre-rejects-kp-claims/",
  "title": "No military operation in Tirah , migration routine and seasonal : Centre rejects KP claims",
  "date": "20260127T234500Z",
  "domain": "pakistantoday.com.pk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- Defence Minister Kh Asif denies any planned military action in Tirah, citing climate, topography, and changing snowfall patterns as reasons for migration\n- Stresses seasonal migration of Afridi and Akakhel tribes part of decades-old practice\n- Highlights IBOs, rather than large-scale military campaigns, preferred method to counter militancy in valley due to reduced collateral damage\n- Federal ministers emphasize voluntary movement, reject PTI allegations of forced evacuation, saying KP approved Rs4b package for relocating residents\n- KP CM Afridi accuses Centre of pushing region toward instability, displacement\n- Grand tribal jirga to assess whether Tirah residents left voluntarily or under pressure on Sunday\nISLAMABAD/PESHAWAR: Defence Minister Khawaja Asif and Information Minister Atta Tarar on Tuesday categorically denied any ongoing or planned military operation in Khyber Pakhtunkhwa’s Tirah Valley, asserting that the migration of residents from the area was a long-standing, routine practice driven by climate and topography.\nSpeaking at a press conference in Islamabad, flanked by Special Assistant to the Prime Minister for Information and Khyber Pakhtunkhwa Affairs Ikhtiar Wali Khan, the ministers stressed that the movement of Tirah residents was neither unusual nor an indication of a military action against militants.\n“It has even been mentioned in a gazette from the British era, and this transition takes place every year. This is nothing unusual, but the PTI government has tried to make it appear unusual,” Khawaja Asif said, holding up a notification issued by the Khyber Pakhtunkhwa government.\nKP government is blaming its failures on the army and so-called oppression that has no real existence.\n— Pakistan’s Defence Minister Khawaja Asif. pic.twitter.com/PWo5CdzEiN\n— Zardan Sangzi (@ZardanSi) January 27, 2026\nThe press conference came two days after federal and provincial authorities traded accusations over who had authorised the evacuation of hundreds of Tirah residents, who had reportedly vacated their homes ahead of a purported military action against terrorists. The displacement left many residents stranded in cold weather, with inadequate arrangements exacerbating the situation.\nHistorical Context and Government Stance\nKhawaja Asif explained that Tirah has been home to approximately 400-500 members of the banned Tehreek-i-Taliban Pakistan (TTP) along with their families. “They are around 400-500 in number,” he said.\nHe emphasised that the provincial government had approved a Rs4 billion package to assist the migrating population, and that the federal armed forces were not involved in the relocation. “This is an arrangement between the jirga and the provincial government, and as a result of that, this notification was issued,” the defence minister added.\nAsif clarified that the funds, released via the KP Relief, Rehabilitation and Resettlement Department, were intended for relief-related arrangements for those temporarily relocating from areas such as Bagh in Tirah. He stressed that neither the armed forces nor the federal government had issued any order for the “depopulation” of Tirah.\nThe defence minister highlighted that intelligence-based operations (IBOs), rather than large-scale military campaigns, had long been the preferred method to counter militancy in the valley due to reduced collateral damage. “This is why this practice has been ongoing there for many years, and that is why there is no question of any operation in Tirah,” Asif said.\nRoutine Migration and Administrative Gaps\nAsif described migration in the valley as a regular and historically entrenched practice. He also criticised the KP government’s performance, noting the lack of hospitals, schools, and police stations in the region. “There is a complete absence of civilian law enforcement agencies. There is no police station there,” he said.\nThe defence minister pointed out that hemp cultivation over 12,000 acres in Tirah generated profits of approximately Rs3–3.5 million per acre, contributing to the economic significance of the region.\n“Hemp is harvested there, and dividends earned either go to people involved in politics or to the TTP. We have initiated measures to ensure that the people of Tirah benefit from this harvest, and schools and hospitals are constructed,” Asif said, alleging that the interests of the provincial government aligned with those of the TTP in exploiting this resource.\nHe recalled meetings of the Tirah jirga on December 11, 21, and 31, stating that these discussions involved civilian government representatives and that the military was not a participant. He insisted that the KP government was using the controversy to deflect attention from its own administrative failures.\nFederal Ministers Reject Claims of Forced Evacuation\nInformation Minister Atta Tarar highlighted historical evidence of seasonal migration among the Afridi and Akakhel tribes, noting that this practice was documented in official gazetteers as far back as the 1880s.\n“This is an established fact,” he said. Tarar also attributed shifts in migration patterns to climate change, explaining that snowfall now occurs later than historically observed.\nIkhtiar Wali Khan, special assistant to the PM, questioned whether the full Rs4 billion package approved by the KP government had actually reached the displaced residents. He alleged that previous PTI administrations in the province had used similar programmes for political campaigns, including street protests.\nWali stressed that the movement of people from Tirah was voluntary, according to official notifications, and that the armed forces had no involvement. He further suggested that the relocation may have been timed to benefit opposition political activity, including protests planned for February 8.\nOn the matter of reported numbers, Asif confirmed that approximately 65 percent of the population migrates annually from Tirah to avoid harsh winter conditions. “People escape the snowfall in the area and relocate. More or less 65pc of the people migrate. There is historical evidence of this, and this will continue in the future as well,” he said, rejecting suggestions of forced displacement.\nHe stressed that military involvement in Tirah remained limited to IBOs targeting around 500 TTP members, underscoring that no large-scale operations were being conducted.\nKP CM Afridi Condemns Federal Claims, Warns of Instability\nIn a separate video statement, KP Chief Minister Sohail Afridi condemned what he termed a planned “military operation” in Tirah and accused the federal government of pushing the region toward instability and distrust. Afridi reiterated that decisions were being taken “behind closed doors” without public consent, forcing residents to leave their homes during harsh winter conditions.\nThe CM recalled that following the removal of PTI founder Imran Khan in 2022, warnings about potential terrorism and instability across Khyber, Hazara, Malakand, Dera Ismail Khan, and Waziristan were ignored by successive governments. He emphasised that areas where public warnings were heeded remained peaceful, while those ignored experienced a resurgence of militancy.\nAfridi questioned the rationale of launching another operation in Tirah, citing 22 major IBOs and over 14,000 smaller operations that had failed to eliminate terrorism in the region. He described a jirga held at the KP Assembly that finalised a 15-point agenda, which unanimously concluded that dialogue, not military intervention, was the solution.\nHe also alleged that the 24-member committee reportedly involved in planning the operation was headed by the corps commander and frontier corps inspector general, and that tribal elders were forced to vacate their homes under the pretext of militants operating from residential areas. “The world is witnessing elderly people, women, and children being displaced in freezing conditions while the operation cannot even be carried out due to snowfall,” Afridi said.\nThe KP CM accused the information ministry’s statements, asserting that residents left voluntarily, as attempts to create conflict between the province and federal institutions and to erode public trust in leadership.\nKP CM Calls Grand Tribal Jirga to Assess Displacement\nAfridi announced a grand jirga of all tribes in Khyber, scheduled for Sunday at 2 pm at Jamrud Football Stadium, where displaced residents will be asked whether they left voluntarily or were forced. “Then the world will see that injustice is being done,” he remarked. He added that the people of KP were “not subjects to be experimented upon, and their blood is not cheap.”\nوزیراعلی خیبرپختونخوا سہیل آفریدی کا عادی تیراہ آپریشن کے حوالے سے اہم ویڈیو پیغام! pic.twitter.com/oNfhXPKqhB\n— Khalid Khan Supari (@SupariKhan) January 27, 2026\nAfridi reaffirmed the provincial government’s commitment to its residents, noting that Rs4 billion had been released for displaced families. He also highlighted unfulfilled promises of compensation from previous military operations that had destroyed homes. The CM reiterated that his government would stand by the Pashtun people and defend their rights against any unilateral decisions.\nThe Tirah controversy has escalated into a multi-layered political and administrative dispute, highlighting the challenges of governance in the now merged tribal regions. While federal authorities insist that the relocations are routine and voluntary, KP provincial leadership views the measures as a politically-motivated attempt to destabilise the region and erode public trust. The outcome of the upcoming grand tribal jirga is expected to clarify whether residents left voluntarily or under pressure, potentially shaping the discourse on federal–provincial coordination, tribal governance, and counterterrorism strategies in the region.",
  "word_count": 1459,
  "scraped_at": "2026-02-14T14:22:00.554637"
}