{
  "article_id": "695cea41d097",
  "url": "https://www.bbc.co.uk/sport/football/63993302",
  "title": "World Cup 2022 : Why norms LGBTQ+ football fans took for granted have been shaken",
  "date": "20230114T181500Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "World Cup 2022: Why norms LGBTQ+ football fans took for granted have been shaken\n- Published\nIt was the summer of 2021, and I was talking to a senior Fifa official.\nHow, I asked, would the LGBTQ+ community be made to feel welcome at the upcoming World Cup in Qatar, a country in which homosexuality is illegal?\nThere was a pause before Joyce Cook - herself a gay woman - answered.\n\"If you go to places, you open up and shine a spotlight,\" she said.\n\"We're very clear that for our hosts, our tournaments have to be all-inclusive. In regards to LGBTQ+ rights, we have a time to go yet until we host the tournament - and I believe we will leave a legacy.\"\nLGBTQ+ fans and allies stopped and confronted\nIt's still too early to judge what mark this World Cup will leave on history.\nBut on one count, there can be no doubt.\nDespite the repeated pledges of both Fifa and the Qatari authorities to make 'everyone welcome', external, those who were from - or supporting - the LGBTQ+ community have not felt that way.\nThere was the former Wales captain told to remove a hat in Pride colours. And the LGBTQ+ ally detained briefly by the authorities for trying to enter a stadium wearing a rainbow T-shirt.\nA gay fan who took a greyscaled Pride flag to a game, external was made to throw it in the bin; another was forced to unfurl his Pride banners by guards who approached him on the metro.\nA BBC cameraman who wore a Pride watch strap was initially barred from entering a stadium, external - and was only able to gain entry after a phone call to the authorities.\nLGBTQ+ fans who chose not to travel to Qatar had to listen as Khalid Salman, one of the country's World Cup ambassadors, described homosexuality as \"damage in the mind\".\nThese were some of many stories of LGBTQ+ fans and allies being stopped or confronted.\nFifa and the Qatari authorities had given assurances that wouldn't be the case. But it happened anyway.\nFlying a flag - but threatening captains with yellow cards\nIt's important to say that what has happened in Qatar is not the usual experience for many LGBTQ+ football fans, either in the UK or a number of other competing nations.\nI've been covering the stories of LGBTQ+ people in sport for the best part of five years, and one of the most heartening changes I've seen is the way football has worked to make the community feel more welcome.\nFrom the Premier League's participation in the Rainbow Laces campaign, external to the rise of LGBTQ+ fan groups, the game has made huge strides in a relatively short period.\nThat progress has been warmly received at all levels of football - seen not only as a good thing, but an essential part of making the sport more inclusive.\nYet at this World Cup, the norms that LGBTQ+ people in football had come to rely on were put up for debate by some of the most powerful names in the game.\nThose OneLove armbands, external that European fans had got used to seeing at the Nations League?\nThey were not, according to Qatar's World Cup chief Hassan Al-Thawadi, a symbol of diversity and inclusion after all, but instead \"an effort to leave a divisive message\" in the Arab world.\nThe ability of football to \"change the world\" that Gianni Infantino spoke about in May?, external\nThat didn't extend to players who wanted to draw attention to alleged human rights abuses in Qatar - who were instead urged by Fifa in early November to \"focus on football\" and not get dragged into ideological or political \"battles\".\nAnd that \"symbolic and proud moment\" Fifa highlighted as it flew the Pride flag, external outside its headquarters in June?\nAll well and good - yet captains could not wear a rainbow of their own at the tournament without risking a booking.\nA right to exist becoming 'political' again\nAnd then there was Infantino's press conference.\nThe day before the World Cup's opening match, the Fifa president accused critics of Qatar's human rights record of \"hypocrisy\" and of delivering a \"one-sided moral lesson\" - and claimed he knew how people facing discrimination felt because he'd been bullied for his freckles as a child.\nHomosexuality is illegal in Qatar, and can be punishable by fines, imprisonment and even death., external\nAnd Infantino's comments were part of a wider pattern, in which significant football figures framed the conversation about the treatment of LGBTQ+ people in the host nation as one of cultural and political differences, rather than basic human rights.\nNo matter that gay Qataris had spoken out about their desire to live free from harassment, such as Aziz, who told BBC News in November: \"I would like reforms that would say I can be gay and not worry about being killed.\"\nNo matter the country's LGBTQ+ supporters organisation, the Proud Maroons, couldn't openly watch their national team because, in the group's own words,, external fans feared that \"joining would send them to jail\".\nThe conversation had changed. LGBTQ+ football fans assuming it was uncontroversial to say that no-one should be persecuted for their sexuality now stood accused of disrespecting the host nation's traditions.\n\"At Fifa, we try to respect all opinions and beliefs, without handing out moral lessons to the rest of the world,\" wrote football's world governing body in early November. \"No one people or culture or nation is 'better' than any other.\"\nYet senior Fifa official Arsene Wenger, the former Arsenal manager, suggested that teams who tried to draw attention to LGBTQ+ issues in Qatar had performed worse as a result.\nThe statement itself was debatable - with Australia's footballers defying expectations to reach the knockout stages, after releasing a video, external condemning human rights abuses in the country.\nBut that wasn't the point.\nAt this World Cup, all the norms that LGBTQ+ fans had come to know were being challenged.\nTo be authentic in football - to support the right of people to go to games with who they loved, wearing what they wanted, embracing every part of themselves - was no longer a given as a \"good thing\".\nIt had somehow become one side of a debate, to be balanced against the views of those who would rather the LGBTQ+ community did not have that right.\nRemarkably, in 2022 and on a global stage, the rights of LGBTQ+ people to exist as themselves in football had become 'political' again.\nSo what now?\nThe curtain has fallen on Qatar, and the rhythms of football as we know it are beginning to stir.\nThe Premier League resumes next Monday, and fans of England's top men's teams will soon be back in the stands, bodies hunched against the cold weather, breath hanging in the air.\nPitches will freeze. Points will be dropped.\nIt will all feel very 'normal'.\nBut for many LGBTQ+ people in football, there's no easy return to the way things were before.\nAfter a period where so many assumptions about their place in the game were challenged, too many questions remain.\nCan players wear the Pride colours at next year's Women's World Cup in New Zealand?\nWill countries that criminalise homosexuality be allowed to host future tournaments?\nAnd after some of the comments by football's leading power-brokers, how are gay people in the game really seen by those in control?\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nNo community is a monolith - but the overwhelming majority of LGBTQ+ people I've spoken to during this tournament have told me the same thing.\nThey feel angry.\nThey feel let down.\nThey feel anything but \"welcome\".\nAnd that, as much as anything, will be this World Cup's legacy.\nJack Murley is the presenter of the BBC's LGBT Sport Podcast. You can hear new episodes every Wednesday on BBC Sounds.",
  "word_count": 1368,
  "scraped_at": "2026-02-14T12:59:56.079338"
}