{
  "article_id": "696161d5a88d",
  "url": "https://www.bandt.com.au/spotlight-on-sponsors-liam-lawson-isack-hadjar-taps-airtasker-to-put-the-pit-crew-in-pole-position-with-new-helmet-design/",
  "title": "Spotlight On Sponsors : Airtasker Finds Itself On Liam Lawson & Isack Hadjar Heads",
  "date": "20250918T053000Z",
  "domain": "bandt.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s been an epic week of sports and sports sponsorship news. Over in Tokyo 17-year-old sprinting phenomenon Gout Gout has cruised his way into the semi finals in the 200 metres of the World Athletic Championships.\nHis lightning quick time of 20.23 seconds in the 200 metres of the World Athletics Championships in Tokyo has seen him do something that not even Usain Bolt could achieve, progressing to a semi final in his first ever World Championships.\nThe year 12 student will run in his semi final tonight.\nView this post on Instagram\nOvernight, the Australian women’s Cricket team suffered their heaviest defeat in ODI history losing to India by 102 runs. Annabel Sutherland top scored with the bat with 45. The loss comes at a less than desirable time for the Aussies who are prepping for the start if the Women’s ODI World Cup, which begins in two weeks.\nWelcome back to B&T’s Spotlight on Sponsors series, where we break down all the major sponsorship news from inside the sporting world.\nOn the sidelines, the action is heating up as well.\nThis week’s Spotlight on Sponsors features Formula 1 drivers Isack Hadjar and Liam Lawson teaming up with Airtasker, OnDeck Australia signs on as an official partner of the bp Adelaide Grand Final, Choice Hotels step onto the court in a new partnership with the NBL, Melbourne Storm partner with Homedics following their impressive 26-18 victory on the weekend and WatchGuard Technologies laces them up for Girona FC as the official cybersecurity partner.\nVisa Cash App Racing Bulls x Airtasker\nIsack Hadjar and Liam Lawson, drivers for the Visa Cash App Racing Bulls (VCARB) Formula 1 Team, have turned to local services platform Airtasker in search of a creative mind to design a “big, bold, and badass” helmet for their Pit Crew.\nThe task is being hailed as a once-in-a-lifetime opportunity for fans and creative minds alike, and VCARB drivers Isack Hadjar and Liam Lawson have stated, “The pit crew has been crushing it, and we want to find someone who can design a special edition helmet for them.“Something wild, unforgettable, and creative as a thank you gift they’ll never forget. They’re the heartbeat of everything we do, so we want to create something as legendary as they are.”\nLiam and Isack will personally review submissions from Taskers and choose their favourite concept, and the selected Tasker will be assigned to bring their winning idea to life.\nOnce completed, the helmets will be unveiled to the pit crew to wear during the 2025 Qatar Grand Prix in December.“It’s awesome to see VCARB Formula 1 drivers turning to Airtasker to find creative talent—it proves that anyone can get anything done on our platform,” said Tim Fung, founder and CEO of Airtasker.\n“This task captures what Airtasker is all about: celebrating skill and individuality that lead to amazing opportunities. It’s not every day that everyday people get the chance to leave their mark on the world of F1.\n“Motorsport is driven by passion and precision—just like the Airtasker community—so whether you’re a designer, a racing fan, or just someone with a wild idea, this is your moment.”\nThe task, titled ‘Need Crazy and Creative Ideas for F1 Helmet’ is now live on Airtasker with a $1,000 reward for the chosen concept.\nbp Adelaide Grand Final x OnDeck Australia\nOnline small business lender, OnDeck Australia, has signed on as an official partner of the bp Adelaide Grand Final, revving up its brand profile.\nThe sponsorship aligns OnDeck’s “Lightning Loans” with the high-octane action of Australia’s biggest motorsport finale, held November 27-30 at the Adelaide Parklands Street Circuit.\nAn estimated 259,400 attended the 2024 event, with millions more watching nationally via broadcast and digital channels. The partnership will put OnDeck’s branding in prime view through extensive broadcast integration and trackside signage, while connecting directly with its core customer base—small business owners and sole traders, who are well represented among attendees and viewers.\nThe 3.22 km Adelaide Parklands Street Circuit is celebrated for its blistering pace, with the current lap record of 1:18.6763 set by Chaz Mostert in 2022. OnDeck’s new median time to loan approval is 65 minutes for loans to $175,000, proving that in motorsport and small business, speed wins.\n“We are excited to align with one of the country’s most iconic motorsport events,” commented Cameron Poolman, CEO of OnDeck Australia.\n“As a small business lender, we know the value of putting our pedal to the metal. The bp Adelaide Grand Final is the perfect backdrop to showcase the speed and simplicity of OnDeck’s lending products including our Lightning Loans.\n“Much like motorsport competitors, small businesses need to be able to move fast and pivot swiftly to seize competitive advantages. OnDeck delivers the capital small businesses need, when they need it, to turn opportunities into winning leads.”\n“We’re thrilled to welcome OnDeck to the bp Adelaide Grand Final,” said Rebecca Lawson, commercial manager, South Australian Motor Sport Board.\n“OnDeck’s focus of backing small businesses aligns perfectly with the energy and drive of our event, and we’re proud to be the platform for their biggest brand campaign yet.”\nLights out from November 27-30, the 2025 bp Adelaide Grand Final will again transform the streets of Adelaide into a motorsport and entertainment destination, drawing hundreds of thousands of fans on the ground and reaching millions nationally via broadcast providing a launchpad for new commercial partners like OnDeck.\nNBL x Choice Hotels\nThe National Basketball League (NBL) has put pen to paper in a new partnership with Choice Hotels ahead of the Hungry Jack’s NBL26 Season.\nAs basketball continues its rapid growth across Australia and New Zealand, with record participation rates and more young people playing than ever before, the demand for accessible and reliable accommodation options has never been greater.\nChoice Hotels joins the league as an official partner, presenting the perfect opportunity for travelling fans and basketball families who follow their teams or take part in competitions around the country.\n“The NBL is experiencing unprecedented growth, not only at the professional level but also in grassroots participation, particularly among young players,” explained chief partnerships officer, Shenae Beus.\n“Partnering with Choice Hotels allows us to better support our fans, families and the wider basketball community by making travel to games and tournaments more convenient and comfortable. We’re thrilled to have them on board for NBL26 and beyond.”\n“This partnership is more than a branding move for us, it’s about aligning with a fastgrowing, high energy sport that shares our values of bold ambition, community connection and delivering unforgettable experiences,” said Kari Hunter, Choice Hotels Asia-Pac senior\ndirector, commercial and revenue management.\nThe partnership ensures that fans travelling to support their favourite teams will benefit from the accessibility and reach of Choice Hotels’ extensive network across Australia and New Zealand, while also aligning the NBL with an organisation that shares its values of community, connection and excellence.\nTogether, the NBL and Choice Hotels are committed to delivering an outstanding season on and off the court, making it easier than ever for basketball supporters to connect with the game they love.\nThe Hungry Jack’s NBL Season tips of September 18.\nMelbourne Storm x Homedics\nMelbourne Storm has brought on Homedics as the club’s official recovery and wellness partner. The news follows an impressive 26-18 victory on the weekend over the Canterbury Bankstown Bulldogs to book a place in the preliminary finals.\nA player in wellness and recovery technology, Homedics offers an extensive range of innovative products, including massage guns, compression massagers, and other recovery tools, designed to enhance physical wellbeing and performance.\nAs part of the partnership, Homedics will play a key role in supporting Storm’s on-field performance by providing elite recovery solutions to help players maintain peak condition throughout the season.\nMelbourne Storm CEO Justin Rodski said the partnership was a strong alignment with the club’s high-performance values.\n“Recovery is a critical part of elite sport, and having a trusted name like Homedics on board ensures our players have access to the best tools available,” he said.\n“We look forward to working with Homedics to enhance the recovery and wellness components of our performance program, driving excellence both on and off the field.”\nHomedics is also offering 25 per cent off its entire product range for Melbourne Storm members, available via the Storm Member Portal.\nMichael Tapp, Homedics general manager Australia and New Zealand, commented on the new partnership and added his excitement.\n“Homedics, a market leader in health, wellbeing, and sports recovery products, is proud to announce a new partnership with one of Australia’s most successful and professional sporting teams, Melbourne Storm.\n“This collaboration brings together two high-performance brands united by a shared commitment to excellence, innovation, and athlete wellbeing.\n“Through this partnership, Homedics will deliver on its brand promise by supporting the optimisation of player performance and recovery both on and off the field.\n“We’re excited to align with and support the incredible culture that exists across all areas of the Melbourne Storm organisation,” he concluded.\nGirona FC x WatchGuard Technologies\nWatchGuard Technologies, a player in unified cybersecurity for managed service providers (MSPs), has become the official cybersecurity supplier of Spanish football club Girona FC. This strategic partnership marks a significant step in the club’s ongoing commitment to strengthening its digital security.\nUnder the terms of the partnership, WatchGuard will apply its Unified Security Platform architecture to safeguard Girona FC’s digital environment across all key facilities, including its Montilivi stadium and training centre in Vilablareix, the Les Hortes academy player residence, and more.\nDelfí Geli, president of Girona FC, highlighted the importance of this strategic alliance: “This partnership with WatchGuard allows us to take a step forward in elevating our cybersecurity posture. Protecting the Club’s systems and data is key in an increasingly digital environment, and doing so alongside an industry leader like WatchGuard gives us peace of mind and confidence to continue growing.”\nThe implementation of WatchGuard’s cybersecurity platform will include WatchGuard Network Security, Endpoint Detection and Response (EDR), ThreatSync+ NDR, and WatchGuard MDR. These tools proactively identify and respond to threats in real time, minimising risks and ensuring the integrity of the club’s digital operations.\nParlem Telecom, Girona FC’s existing technology partner, serves as the club’s systems integrator and MSP, and will be responsible for deploying and managing these solutions.\n“The incorporation of WatchGuard’s security solutions represents an important milestone in our digital transformation journey,” said Marc Jordi, IT manager at Girona FC.\n“In an increasingly connected world, having a robust and unified cybersecurity platform is essential to ensure the club’s operational continuity and the protection of our digital assets. This step reinforces our commitment to a digital Girona FC that is secure and prepared today and tomorrow.”\n“WatchGuard is incredibly proud to become the official cybersecurity supplier of Girona FC,” added Michelle Welch, CMO and SVP of business strategy at WatchGuard. “We’re fully aligned with this exciting club’s commitment to growth and excellence, and we look forward to defending FC Girona’s digital environments against cyber threats, while the team stops attacks and wins matches on the pitch.”\nAs a part of this multi-year partnership, Girona FC will enjoy the precise and powerful security that comes with WatchGuard’s Unified Security Platform approach. Throughout the engagement, visitors will be exposed to the WatchGuard brand and become familiar with its mission to make enterprise-grade security accessible to all organizations, and deliver Real Security for the Real World.\nWatchGuard is also the official cybersecurity partner of the Seattle Kraken NHL hockey team and an official partner of Climate Pledge Arena.",
  "word_count": 1926,
  "scraped_at": "2026-02-14T12:36:51.729608"
}