{
  "article_id": "6961a6c304db",
  "url": "https://www.fourfourtwo.com/news/arsenal-agree-five-year-deal-with-viktor-gyokeres-with-salary-details-revealed-report",
  "title": "Arsenal agree five - year deal with Viktor Gyokeres , with salary details revealed : report",
  "date": "20250527T094500Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal agree five-year deal with Viktor Gyokeres, with salary details revealed: report\nArsenal have engaged in talks with Viktor Gyokeres, with a move on the cards for the Swedish hitman this summer\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nArsenal are reported to have agreed a 'five-year contract' with Sporting forward Viktor Gyokeres.\nThe Sweden international, who has smashed home 54 goals in all competitions this season, ended the campaign by helping his current side win the Portuguese league and cup double.\nGyokeres had been heavily linked with Manchester United, but it appears for now that the Red Devils are set to explore other options this summer, leaving Arsenal with a clear run.\nArsenal agree BUMPER contract with Viktor Gyokeres ahead of summer switch\nFormer Coventry man Gyokeres has risen to become one of Europe's most sought-after stars in recent years, with his goal tally for Sporting almost at the century mark.\nThe 26-year-old, ranked at no.6 in FourFourTwo's list of the best strikers in the world right now, is set to be available for just £60m, with Transfermarkt estimating his current price tag at £62m.\nTuesday’s edition of Correio da Manha as relayed by Sports Witness, says Arsenal's representatives met with Gyokeres' agent, Hasan Cetinkaya, with the Gunners' women's team in UEFA Champions League final action over the weekend in Lisbon.\nThe Gunners are reported to have presented an offer ‘worth around €70m (£58m), plus a target-based fee. The player is expected to receive a signing bonus of €12m (£10m), an annual salary of €7m (£5m) and a five-year contract.’\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nBayern Munich are still hoping they can have a late say in any potential deal, although Gyokeres' move to the Premier League now feels something of a certainty given his recent comments.\n“Let us see,\" said Gyokeres. \"It’s hard for me to say, because yeah it is football and you never know what’s going to happen in the summer. So for me to say anything else than that is impossible.”\nIn FourFourTwo's view, a move to England now seems a real possibility for Gyokeres, and we expect him to sign for Arsenal at some point this summer.\nPriced as low as 10/11 with some bookmakers, it seems the cat is already out of the bag and Arteta can now start planning for next season with a new number nine.\nMatthew Holt writes freelance for FourFourTwo, amongst others, and boasts previous experience at GOAL and SPORTBible. He now works with us alongside his time at Manchester United and Reach PLC, aiding with online content for the website. Career highs include working at the FA Cup final, as well as scoring at Old Trafford in front of the Stretford End. A long-term sufferer of his beloved Scunthorpe United, he is often seen on the padel court, as well as occasionally as a six-a-side call-up.",
  "word_count": 590,
  "scraped_at": "2026-02-14T12:50:17.281324"
}