{
  "article_id": "6968023aa031",
  "url": "https://www.arsenal.com/news/arsenal-diary-whats-store-week-64",
  "title": "Arsenal Diary : What in store this week | News",
  "date": "20250303T104500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Eindhoven and Manchester are the destinations as our men’s team face back-to-back away games this week.\nOur women’s team are also getting set for Adobe Women’s FA Cup action, while the under-18s prepare for a north London derby.\nHere’s some of what to look out for on Arsenal.com and the official app over the next seven days.\nMONDAY\n5.30pm (BST) - Mikel Arteta press conference\nShortly after touching down in Eindhoven, Mikel Arteta will be in front of the media at Philips Stadion for his pre-PSV Eindhoven press conference.\nOur manager will share the latest team news and look ahead to the knockout phase of the competition.\n7pm - Crystal Palace v Arsenal U21s\nBack on British soil, Mehmet Ali’s young Gunners travel to the Borough Sports Ground to take on Crystal Palace in Premier League 2.\nFollow the action live on X with @ArsenalAcademy, or on Instagram with ‘officialarsenalcademy’.\nTUESDAY\n8pm - PSV Eindhoven v Arsenal\nThe knockout phase of the Champions League begins as we face PSV Eindhoven away from home for the first leg of the round of 16.\nFor all the best build-up coverage, head to Arsenal.com and the official app, where we will have our matchday show Live From N5.\nPost-match interviews, highlights and a full match replay will be published after the game.\nThis match will be shown live on Amazon Prime Video.\nWEDNESDAY\nGoal of the Month revealed\nAfter counting up your votes, we’ll reveal the winner of February’s Emirates Goal of the Month, which encompassed strikes from our men’s, women’s and academy teams.\nTHURSDAY\nPlayers of the Month revealed\nFebruary’s Players of the Month for our men’s and women’s teams will be announced on Thursday as we find out who impressed you most over the last four weeks.\nFRIDAY\nTimes TBC - Mikel Arteta and Renee Slegers press conferences\nMikel Arteta and Renee Slegers will sit down for their pre-match press conferneces at Sobha Realty Training Centre ahead of games against Manchester United and Liverpool respectively.\nSATURDAY\n11am - Tottenham Hotspur v Arsenal U18s\nIt’s derby day for Adam Birchall’s young Gunners as they travel to the Tottenham Hotspur Academy for this weekend’s U18 Premier League South clash.\nOur under-18s will be looking to put last weekend's FA Youth Cup disappointment behind them and get back to winning ways.\nFollow the action live on X with @ArsenalAcademy, or on Instagram with ‘officialarsenalcademy’.\nSUNDAY\n2.30pm - Arsenal Women v Liverpool\nKnockout football returns to Mangata Pay UK Stadium as we host Liverpool in the quarter-finals of the Adobe Women’s FA Cup.\nWe reached this stage of the competition by beating Bristol City 5-0 in the fourth round, while Liverpool got the same result away to West Ham United.\nThis match will be shown live on the Women’s FA Cup YouTube channel.\n4.30pm - Manchester United v Arsenal\nThe next entry in this classic Premier League encounter takes place at Old Trafford on Sunday afternoon.\nFor all the best build-up coverage, head to Arsenal.com and the official app, where we will have our matchday show Live From N5.\nPost-match interviews, highlights and a full match replay will be published after the game.\nThis match will be shown live on Sky Sports.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 564,
  "scraped_at": "2026-02-14T12:49:36.347559"
}