{
  "article_id": "69b746c87b85",
  "url": "https://www.usatoday.com/story/news/2023/08/31/florida-idalia-hurricane-weather-mcconnell-south-africa-tennessee-gun-weed-strike-hollywood/70725353007/",
  "title": "Daily Briefing : Floridians emerge from Idalia destruction",
  "date": "20230831T110000Z",
  "domain": "usatoday.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Daily Briefing: Floridians emerge from Idalia's destruction\nIdalia was downgraded to a tropical storm after hitting Florida and Georgia, as residents woke up Thursday to continued power outages in some areas and widespread damage. Also in the news: What it says about us when we speculate over Mitch McConnell's health and the Venice Film Festival has kicked off amid continued strikes by Hollywood writers and actors.\n🙋🏼♀️ I'm Nicole Fallert, Daily Briefing author. Here's why Burger King must face whopper of a lawsuit.\nNow, here we go withhursday's news.\nHope for recovery in Florida following powerful hit by Idalia\nMany Florida residents whose homes and towns felt the brunt of Idalia's winds and storm surge saw tough evidence of the storm's power Thursday as they emerged to survey the damage and begin recovery efforts.\nIdalia arrived as a high-end Category 3 hurricane with maximum sustained winds near 125 mph, splitting trees in half, ripping roofs off hotels and turning small cars into boats before sweeping into Georgia and South Carolina.\n- Vulnerable areas, such as low-lying and coastal parts of Florida, were the hardest-hit by the hurricane. Florida Gov. Ron DeSantis reported that while properties had been severely damaged and areas were blanketed with debris, there were no immediate reports of fatalities.\n- Idalia weakened to a tropical storm while moving near the coasts of northeastern South Carolina and North Carolina Wednesday afternoon, while power outages blanketed parts of Northern Florida.\n- Officials are still assessing the storm's overall destruction. Idalia caused calamitous storm surge and flooding for hundreds of miles — and a lot of standing water is in the way of recovery efforts.\nIdalia text message updates:Sign up to receive updates on Hurricane Idalia and its aftermath from journalists across the USA TODAY network.\nMitch McConnell to consult doctor after freezing, struggling to speak for second time this summer\nIt's the question circulating all over social media (again): Did you hear what happened to Mitch McConnell? The Senate Minority Leader, 81, froze in front of reporters Wednesday shortly after being asked about his plans to run again for his senate seat in 2026. The senator also suddenly stopped speaking late last month at a press conference, leaving many – including fellow politicians – questioning whether the GOP senator had some kind of health episode. While his exact condition remains unknown – though we know he had polio as a child – many are theorizing and reporting on elements of his health. But is that such a good idea?\n- President Joe Biden, who learned about the incident shortly before making public remarks about the federal response to Hurricane Idalia, said he would reach out to McConnell.\nMore news to know now\n- Rudy Giuliani defamed Georgia election workers, a federal judge ruled.\n- Case closed? The Supreme Court is silent after Justice Clarence Thomas' luxury travel was raised in an ethics scandal.\n- Colorado's governor defended a ''Don't Tread on Me'' flag after a student was told to remove a patch.\n- A professor skirted background checks after harassing students with a ''clown fetish.''\n- On today's 5 Things podcast, questions of whether former President Donald Trump should be allowed on the 2024 ballot. Listen on Apple Podcasts, Spotify, or your smart speaker.\nWhat's the weather today? Check your local forecast here.\nAt least 58 dead after fire engulfed building in South Africa\nAt least 58 people died when a fire ripped through a multi-story building in Johannesburg that had been overtaken by homeless people, emergency services said Thursday. Spokesman Robert Mulaudzi said another 43 people were injured in the blaze that broke out in the predawn hours. He said the death toll was likely to still increase in what he described as effectively “an informal settlement.” Mulaudzi said homeless people had moved into the building without any formal lease agreements, complicating search and rescue efforts. Read more\nCovenant families disappointed in Tennessee special session\nParents of the children at the Covenant School, where three students and three school staff members were fatally shot in March, spoke of the horror they felt watching the Tennessee special session close with no significant outcomes. Large contingents of Covenant School families attended the nearly week and a half of legislative hearings. From chamber galleries to hallways and private offices, the families, wearing Covenant School red against the sea of state troopers and lawmakers — made their presence known, at times quietly holding signs and at times chanting with the gathered crowds. Despite the Republican governor's attempt to convince GOP lawmakers to pass a gun control legislation, no significant changes were made to the state's gun laws. Read more\nJust for subscribers:\n- They're off! The GOP debate launched the campaign. What's next? An arrest, for starters.\n- Young people needed a voice at the State Department.Here's why Abby Finkenauer raised her hand.\n- Pastors criticized a Baptist seminary for a ''hidden'' marker noting ties to slavery.\n- Green Bay Packers roster: Meet 19 new players on the 2023 team, from rookies to veterans.\nThese articles are for USA TODAY subscribers. You can sign up here.\nEasing restrictions on marijuana? HHS calls for classifying weed as less dangerous\nThe Department of Health and Human Services has moved to reclassify marijuana as less harmful than cocaine or heroin, a possible first step toward wider legalization, according to reports. It is currently a schedule one substance, which are drugs with no accepted medical use and have a “high potential of abuse,” according to the Drug Enforcement Administration. President Joe Biden had asked Health and Human Services Secretary Xavier Becerra and Attorney General Merrick Garland to review how marijuana is classified under federal law last year. Read more\nQuick hits\n- College Football Fix podcast: Here's an in-depth preview and our picks for Week 1's biggest Top 25 matchups.\n- Olympic medalist Lindsey Vonn addressed her struggles after retirement a knee replacement.\n- Opinion: USA Gymnastics must allow scrutiny. Denying reporter a credential was outrageous decision.\n- Return to office mandates pick up steam as Labor Day nears but many employees resist.\n- Attention Bachelor Nation!''The Golden Bachelor'' women are here.\n- ''Bottoms'' lets gay people be ''selfish and shallow.''Can straight moviegoers handle it?\nPhoto of the day: Venice Film Festival 2023 kicks off amid strikes\nThe 80th annual Venice International Film Festival's opening ceremony Wednesday took place amid continued strikes by unions representing Hollywood actors and writers. Jury members expressed solidarity with the strike, donning shirts that evoked the continued struggle for agreements over issues including residuals and AI regulation in the industry. Read more\nNicole Fallert is a newsletter writer at USA TODAY, sign up for the email here. Want to send Nicole a note? Shoot her an email at NFallert@usatoday.com or follow along with her musings on Twitter. Support journalism like this – subscribe to USA TODAY here.\nAssociated Press contributed reporting.",
  "word_count": 1150,
  "scraped_at": "2026-02-14T13:37:35.295105"
}