{
  "article_id": "69b8c4081f7e",
  "url": "https://punchng.com/fifa-announces-record-1bn-prize-for-club-world-cup/",
  "title": "FIFA announces record $1bn prize for club world cup",
  "date": "20250305T211500Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA on Wednesday announced it will pay total prize money of one billion dollars to participants in the Club World Cup taking place in the United States this year.\nThe figure is significantly more than the prize money offered for either the last men’s or women’s World Cups.\nWorld football’s governing body has given few details about the funding of the first edition of the 32-team tournament that will take place every four years but it has signed up a broadcaster and major sponsors in recent weeks.\nIn a statement confirming the prize money on offer, FIFA said it expected to generate $2 billion in revenues from the expanded Club World Cup. It also confirmed that a women’s edition will take place from 2028.\n“The FIFA Club World Cup will not only be the pinnacle of club football, but also a vivid demonstration of solidarity that will benefit clubs at large to a scale that no other competition has ever done,” said FIFA president Gianni Infantino.\n“All revenue generated by the tournament will be distributed to the participating clubs and via club solidarity across the world as FIFA will not keep a single dollar.”\nBritish streaming service DAZN was awarded the exclusive global rights to the June 14-July 13 tournament in December with a source close to the negotiations saying the contract was worth around one billion euros ($1.05 billion).\nFIFA has also signed sponsorship contracts with Coca-Cola, Bank of America, Chinese electronics brand Hisense and Belgian brewers AB InBev.\nBy comparison the total prize money for the 2022 men’s World Cup in Qatar was $440 million, while for the 2023 Women’s World Cup in New Zealand and Australia it was $110 million.\nThis season’s UEFA Champions League, with a new 36-club format, will pay a total 2.47 billion euros ($2.66 billion) to the clubs involved.\n– Widespread criticism over player welfare –\nFIFA’s expansion of the tournament has been met by widespread criticism, especially in Europe, largely due to concerns over player welfare.\nThe global footballers’ union FIFPro and the European Leagues association filed a complaint with the European Commission in October against FIFA, accused of abusing its dominant position by packing the calendar.\nThe Champions League was also expanded by UEFA this season and some players, including Ballon d’Or winner Rodri and Liverpool captain Virgil van Dijk, have raised the prospect of a strike.\n“I think we are close to that. I think if you ask any player he will say the same,” said Rodri when asked in September if there was a possibility of players going on strike, shortly before suffering a season-ending knee injury.\n“It is not the opinion of Rodri or whatever. I think it’s the general opinion of the players.”\nThe tournament will feature 12 teams from Europe, six from South America and four each from Asia, Africa and North and Central America.\nAuckland City and Lionel Messi’s Inter Miami complete the line-up.\nNot all the reaction has been negative, with Paris Saint-Germain coach Luis Enrique insisting “everyone” would want to play.\n“Once every four years there’s this new, extremely exciting competition. Everyone wants to go to the Club World Cup,” he said last year.\nThe tournament will be held at 12 venues across 11 cities in the United States, with the final at the MetLife Stadium, which will also host the 2026 World Cup final, in New Jersey.\nAFP",
  "word_count": 566,
  "scraped_at": "2026-02-14T12:49:32.831414"
}