{
  "article_id": "69c5d056089b",
  "url": "https://thepeoplesperson.com/2025/12/10/marc-skinner-launches-rallying-cry-ahead-of-crucial-champions-league-tie-302175/",
  "title": "Marc Skinner launches rallying cry ahead of crucial Champions League tie - Man United News And Transfer News",
  "date": "20251210T090000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United Women will welcome European giants Lyon to Manchester this evening in the Champions League.\nAhead of the match, manager Marc Skinner spoke to the press about the exhilarating match-up.\nIn comments carried by the club’s website, Skinner claimed United must stand up and be brave against the eight-time European champions.\nUnited must attack\nWhen asked how he was feeling before the game, he stated, “excited. Honestly, the whole reason to take on a team of this incredible talent is exactly why we’re here. We wanted to pitch ourselves against the best teams in the world, let alone in Europe. So, I think Lyon are one of those. So, really excited.”\nHe also claimed his team was “hungry” and ready for the challenge of facing one of the toughest teams in women’s football.\nSkinner highlighted Lyon’s pace in attack as something United will have to be very vigilant over, but also claimed his young side could bloody the nose of the giant.\nThe manager stated, “but also, the other thing is we must attack Lyon. You can’t just sit off them, you’ve got to be very respectful of that. We must attack. We’re at home and we look forward to actually trying to give ourselves that quality going forward too.”\nTop four target\nWhilst United have already secured qualification to the next stage, they are also in contention to consolidate a top-four place in the league, which would see them advance straight to the quarter-finals.\nA win over Lyon would go a long way to securing this, and Skinner added, “when you play at Man United, we’re different to everybody else. We have this just inner ability to believe in each other and that can create miracles. So, for us tomorrow, I think if we can just do that, we’ll be proud of what we put out on the field and then who knows, maybe that [being top of the league table] can be the reality after the game.”\nElisabeth Terland injury miss\nAfter scoring at the weekend, United will have to do without their Norwegian striker.\nSkinner claimed, “only Teri will be missing, [she] took a knock in the game [on Sunday], so Elisabeth Terland will be out for this one, but everybody else is fit and healthy and up for selection.”\nHe did confirm it was only a minor issue and that she would likely be back in action versus Tottenham Hotspur at the weekend.\nFans are vital\nSkinner also picked out the key role the home supporters will play in the match tonight. He praised their attitude in the victory over West Ham last weekend and heaped admiration on their loyalty to turn up in all conditions.\nHe asserted, “we’re playing the best team in Europe [on Wednesday] – I know Barca are up there as well, but Lyon have the capacity to be the best team in Europe – so we’re going to need them. What I want Lyon to feel tomorrow is the force that Man United are and will become. And if we can do that tomorrow, then we can create an incredible moment for our club. And I want our fans to be able to share that with us because they deserve it.”\nSkinner also pinpointed Jayde Riviere and Phallon Tullis-Joyce as key players for United’s success this season.\nHe referred to Tullis-Joyce as a “student of the game” and claimed Riviere can be the best right-back in the world.\nMan United Women CL results so far\nFeatured image Ben Roberts Photo via Getty Images\n–\nThe Peoples Person has been one of the world’s leading Man United news sites for over a decade. Follow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 617,
  "scraped_at": "2026-02-14T12:50:43.435306"
}