{
  "article_id": "69d25b546a53",
  "url": "https://decider.com/2024/02/11/nickelodeons-hilarious-super-bowl-broadcast-travis-kelce-leonardo-dicaprios-dating-history-firmly-grasp-it/",
  "title": "Nickelodeon Hilarious Super Bowl Broadcast Takes Shots At Travis Kelce , Leonardo DiCaprio  Dating History :  YOU HAVE TO FIRMLY GRASP IT  ",
  "date": "20240212T041500Z",
  "domain": "decider.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 2024 Super Bowl looks very different under the sea.\nFootball fans are realizing Nickelodeon’s broadcast of the Super Bowl “from the Bikini Bottom” has something for everyone, not just the kids.\nSpongeBob SquarePants (voiced by Tom Kenny) and Patrick Star (voiced by Bill Fagerbakke) have not been holding back in their live commentary of the game, taking shots at the 49ers and the Chiefs alike as the game enters overtime.\n“YOU HAVE TO FIRMLY GRASP IT,” Patrick explains as the players dogpiled during the 1st quarter.\nAt another point of the game, Spongebob cracks a joke about Leonardo DiCaprio‘s affinity for dating 25-year-old women. “Leonardo DiCaprio, 25! Hahaha,” he says. “That’s a joke about his dating history.”\nThe broadcast also introduced Chiefs tight end Travis Kelce as Taylor Swift’s boyfriend, with the fun fact that he’s “good at football.” Good to know!\nViewers at home seemed thoroughly impressed by the broadcast’s hijinks.\n“I’m watching this over the real broadcast. The commentary is making this Super Bowl worth it,” one user wrote on X.\n“The Nickelodeon Super Bowl has been insane,” a fan wrote, while another called it “a fever dream.”\nThe Nickelodeon broadcast also features Sandy Cheeks making her “debut” as a sideline reporter. And for the newcomers, Dora the Explorer is explaining the penalty calls.\nNFL Slimetime will recap the highlights – and the “Slimelights – later this week on Nickelodeon.",
  "word_count": 233,
  "scraped_at": "2026-02-14T14:22:55.215296"
}