{
  "article_id": "69d859362f43",
  "url": "https://www.civilserviceworld.com/in-depth/article/productivity-puzzle-corner-can-you-dig-it",
  "title": "Productivity puzzle corner : Can you dig it ? ",
  "date": "20240422T090000Z",
  "domain": "civilserviceworld.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Productivity puzzle corner: Can you dig it?\nThe idea of productivity is relatively simple and easy to understand.\nHow much human effort does it take to produce a product or service? And how can the relationship between the two be improved?\nLet’s take a simple example. For various reasons humans need to dig holes. With very limited technology – a shovel – it takes a great deal of human effort to dig a big hole.\nTo dig a really big hole takes either a lot of people over a short time or fewer people over a very long time. Which is why we gaze in awe and wonder at some of the massive earthworks constructed by our palaeolithic ancestors.\nThis is especially true when we are used to the idea that humans can achieve these feats so easily now with modern technology. A single mechanical digger driver could probably do what the women in the picture above are doing in a fraction of the time.\nSo it’s pretty obvious that the productivity of the digger driver would be much higher than the dozens of people toiling away with shovels.\nSo that’s the idea of productivity in a nutshell, or rather a hole.\nProductivity is the ratio between inputs and outputs.\nBut if we take the example above and, er, dig a little deeper (sorry) it starts to get a bit more complicated.\nThe metric used for ‘inputs’ in the hole-digging example was the amount of human labour used to dig the hole. You could measure that by something like ‘number of hours of human labour’ to produce the same sized hole. Obviously that would be a much smaller number with the digger – so higher productivity?\nWell, yes but there is more to it than immediate human effort. Someone had to build the mechanical digger (and make the shovels for that matter). That also involved human labour, and other resources like materials.\nAs a result of these complications for inputs alone – there are similar issues with outputs – there are many different ways of trying to measure productivity. The most common ones used do measure human effort (hours worked for example) compared to outputs of goods or services. But more complex ones include labour, capital (equipment like diggers and shovels) and resources consumed in producing the outputs.\nOther problematics of productivity\nThere are numerous other problematic issues with measuring productivity, even if the basic concept is easy to understand.\nFor example: what is the unit of analysis? A lot of high-level policy discussions focus on the whole country as a unit. Is Britain’s productivity going up (good) or down (bad)? How does it compare to other countries? Are we growing our productivity faster or slower than other similar countries?\nOther analyses focus on sectors of the economy rather than the whole thing. Or even on individual organisations. If you are interested in the many and varied ways of measuring and comparing productivity then the Office for National Statistics “Productivity Handbook” (2007) is a good place to start.\nIt’s not all technology\nOne of the consequences of this type of discussion is often a focus on levels of investment in technology and capital equipment (e.g. mechanical diggers) as the main way to boost productivity.\nBut as Philip Coggan demonstrates in his book “More – the 10,000-Year Rise of the World Economy” (2020) there has been much more at play than just technology in the phenomenal rise in human productivity, especially in the last 500 years or so.\nAnd as discussed in the last column the possibilities of technology and capital in improving productivity are very different depending on the type of work needed to produce goods or services.\nFor example, if you want to create a venue where humans can be present to watch other humans engage in real or sporting combat there are severe physical limitations on how you can do it.\nCompare the Arsenal stadium in London to the Colosseum in Rome and the design, size, and capacity aren’t that much different, even though they were built 2,000 years apart. There are some products or services that are hard to improve with technology alone.\nModern football (and other team sports) are also a good place to start thinking about “the human side of enterprise” or production, as Douglas McGregor famously called it (in his 1960 book of that title). But that’s for the next instalment.\nRead the most recent articles written by Colin Talbot - It's time government embraced the human side of productivity",
  "word_count": 756,
  "scraped_at": "2026-02-14T13:01:31.763533"
}