{
  "article_id": "69e0890a0fef",
  "url": "https://www.postindependent.com/news/x-games-ceo-jeremy-bloom-talks-about-the-future-amid-rebranding-campaign/",
  "title": "X Games CEO Jeremy Bloom talks about the future amid rebranding campaign",
  "date": "20250925T221500Z",
  "domain": "postindependent.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "X Games CEO Jeremy Bloom talks about the future amid rebranding campaign\nButtermilk will host Winter X Games from Jan. 23-25\nWhen X Games returns to Aspen this January for the 25th consecutive year, expect it to look a touch different than in recent winters.\nWith the action sports brand celebrating 30 years this summer — the first “Extreme Games” was held in 1995 — and under the guidance of still new CEO Jeremy Bloom, X Games decided it was ready for a makeover.\nOn Wednesday, X Games unveiled its new logo, part of a greater rebranding the company hopes will allow it to thrive for another three decades.\n“The folks in Aspen will feel a lot of these changes,” Bloom told The Aspen Times on Monday in a phone interview. “X Games has been around 30 years, as you know, and we are really heading into a new chapter of action sports with the league launching next year and some other big announcements forthcoming. We thought it was a good time to evolve the brand. Our top mission at X Games is to be an athlete-first brand. These are the athletes that built this brand. They are the ones that put everything on the line to do what they do.”\nBloom, the former star moguls skier and University of Colorado football player, was named CEO of X Games only last December, just weeks ahead of last winter’s competition in Aspen. That was hardly enough time to implement any major changes, but as the months have gone by, he has had the opportunity for conversation with the major players and feels he has a good vision for what the athletes want out of the brand going forward.\nTechnology — an industry he previously worked in — will be at the forefront.\n“By far the biggest priority of our athletes is to have the biggest platform for influence. They want the most amount of people watching what they do, so they can inspire the next generation of athletes,” he said.\n“All of the things we are doing, whether it be modernizing our technology, using whatever AI technology is out there to deepen the relationship with the fan and the athlete to create more objectivity and fairness across these events, then we are committed to at least exploring those types of things. But it is our job every day to give our athletes the biggest platform, which means we need to attract the most amount of fans.”\nAccording to a press release, the rebrand is “designed for the next era of sports: rebellious at its core, global in its reach, and made to evolve as fast as the athletes who push it forward.”\nThe centerpiece of the rebrand, outside of the new logo, will be the launch of the X Games League, a year-round, team-based concept that will get going in the summer of 2026. The league had 150 athletes sign on for the upcoming summer draft. The winter league won’t kickoff until 2027.\nOther key initiatives moving forward include AI-powered judging, a major push into sports betting and fantasy sports, year-round global events, festival-like events, an athlete-first model, and “explosive social growth.”\n“X Games is a really important platform to bring a lot of attention and energy to what our athletes do. But we are not the stars. Our athletes are the stars,” Bloom said. “As an industry as a whole, sports properties have gotten away from prioritizing that type of energy and that type of fandom. We really want the casual fans to come back to X Games and that starts with building stars. We have a lot of stars in action sports. It’s about telling their stories and getting fans of all different backgrounds to understand who they are and what they are all about.”\nAs far as the stars go, there is a high likelihood this will again include winter motorsports athletes as soon as this January. While nothing has officially been announced as there is still plenty of red tape to wade through, Bloom did say bringing back the snowmobilers is a high priority going forward.\nX Games Aspen has not hosted motorsports events since the 2020 contest, which was held only weeks before the world shutdown due to the coronavirus pandemic. The 2021 competition, held without fans, only included skiing and snowboarding, as have all the contests since.\n“That is obviously something that is top of mind for us,” Bloom said. “Once a motor starts up and you hear the roar of that engine, whether it be a dirt bike in the summer or snowmobile in the winter, it just sort of changes the energy and the vibe of that event. You can’t describe X Games and its brand without the motorsports.”\nBloom hopes X Games can lead the push in re-igniting the popularity of action sports in general, something he feels has really dropped off since its modern heyday of the late ’90s and early 2000s. Bringing back the “casual fan” is a top priority, and that push will start in earnest when X Games returns to Aspen this winter.\nThis season’s contest is scheduled for Jan. 23-25, 2026, at Buttermilk Ski Area. It is sandwiched between the Aspen Grand Prix and World Cup (Jan. 7-10), which will be an Olympic qualifier, and the Winter Olympics, scheduled to begin Feb. 6 in northern Italy. Shaun White’s The Snow League will also make its second appearance at Buttermilk at the end of February.\n“It is going to feel like a really big X Games. The footprint of the event, the hospitality, is going to be taken to a new level,” Bloom said.\n“We can’t wait to announce our Friday and Saturday night music. We are really excited about who we have set up,” he continued. “And we are also excited about some other, new announcements forthcoming in Aspen, which I think fans will be pretty fired up about. It will be the first X Games where our new look, our new branding, will be on full display. And we also have some big surprises up our sleeves, too, so we are excited.”\nSupport Local Journalism\nSupport Local Journalism\nReaders around Glenwood Springs and Garfield County make the Post Independent’s work possible. Your financial contribution supports our efforts to deliver quality, locally relevant journalism.\nNow more than ever, your support is critical to help us keep our community informed about the evolving coronavirus pandemic and the impact it is having locally. Every contribution, however large or small, will make a difference.\nEach donation will be used exclusively for the development and creation of increased news coverage.",
  "word_count": 1109,
  "scraped_at": "2026-02-14T12:36:19.213051"
}