{
  "article_id": "69f9d01f9d89",
  "url": "https://www.runnersworld.com/news/a64525830/keira-damato-hypothermia-2018-boston-marathon/",
  "title": "Keira DAmato Got Hypothermia Her Last Boston Marathon . Now She Back",
  "date": "20250419T040000Z",
  "domain": "runnersworld.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When Keira D’Amato lines up for the Boston Marathon on Monday, any experience will surely be better than last time.\nThe 40-year-old owns the fastest personal best of all the Americans in the women’s field, 2:19:12, and she comes into the weekend with a good shot to be in the top 10. But seven years ago in 2018—the last time she raced on Marathon Monday—she was just happy to be there.\nAnd by the time the race ended, she was just happy to be done.\nThe 2018 Boston Marathon had famously terrible conditions. The temperature hovered in the 30s, with wind and sleet pelting the runners, which helped Des Linden and Yuki Kawauchi slip away from their competitors and claim titles.\nAt that point in her career, D’Amato was still returning to competitive running after taking a seven-year break from the sport. Just like the masses, she had to run a Boston qualifying time to get entry to the race. She did so at the 2017 Shamrock Marathon (3:14:54) and improved on her time at the Richmond Marathon (2:47:00), which was enough to bump her into the elite field at Boston.\nIt was torturous weather the entire race.\nAround mile 18, D’Amato, running in a soaked salmon-colored rain jacket and white cap, started seeing stars. Literally. “My first thought was, ‘Oh, this is pretty,’” she said. “But I finished and I was so out of it I didn’t even know I finished.”\nAs she made it through the finishing chute with a time of 2:56:44, D’Amato said a volunteer had to tell her to stop running. “I looked around and then realized I had crossed the finish line,” D’Amato said. “I don’t even remember crossing the finish line.”\nHer delirium and concerningly low body temperature earned her a four-hour stay in the medical tent afterward. “I think I’m just thawing out from that experience,” she joked at the pre-race press conference on Friday.\nTwo months after Boston that year, D’Amato qualified for the 2020 Olympic Marathon Trials by running 2:44:03 at Grandma’s Marathon in Duluth, Minnesota. Since then, D’Amato has improved remarkably. She has broken the American records in the marathon (2:19:12 at the 2022 Houston Marathon) and half marathon (1:06:39 at the Gold Coast Half Marathon in 2023). Both have since been broken.\nD’Amato knows she’s come a long way from her previous Boston Marathon.\n“Last time, it was the very start of this roller coaster journey I’ve been on,” she said. “It’s cool to be back and just think how much has happened in the last seven years.”\nBoston this year will be D’Amato’s first marathon back after breaking her foot during the Chicago Marathon last October. She made past the 10K split before pulling off the course in pain. She found out later that she developed a stress injury in her left foot.\nIn the months following, D’Amato and her coach, Ed Eyestone, have emphasized strength work in the gym and hill training to prepare for Boston’s undulating course.\nShe said she’s healthy now and is excited—and maybe slightly nervous—for a return to Boston: “I feel like I have to hold my breath until I make it to the starting line, but it just feels like a gift to be healthy right now and to be able to compete at my best.”\nAt least she won’t have to battle a biblical Nor’easter this year. The weather is looking much better for Patriots’ Day. There’s no rain on the forecast for Monday and the temperature is predicted to be comfortable—if not warm—by the time the pros finish around mid-day.\nThe masochistic side of D’Amato, however, sometimes enjoys extreme weather, like in 2018.\n“It created a lot of chaos and a lot of randomizing,” she said. “It felt like anyone could win that day, so in a way, that makes it really exciting when the weather is crazy.”\nTheo Kahler is the news editor at Runner’s World. He’s a former all-conference collegiate runner at Winthrop University, and he received his master’s degree in liberal arts studies from Wake Forest University, where he was a member of one of the top distance-running teams in the NCAA. Kahler has reported on the ground at major events such as the Paris Olympics, U.S. Olympic Trials, New York City Marathon, and Boston Marathon. He’s run 14:20 in the 5K, 1:05:36 in the half marathon, and enjoys spotting tracks from the sky on airplanes. (Look for colorful ovals around football fields.)",
  "word_count": 747,
  "scraped_at": "2026-02-14T14:17:41.490822"
}