{
  "article_id": "69ffd274cfab",
  "url": "https://fullstopcom.com/2024/02/warm-ups-show-ufh-wont-be-super-league-pushovers/",
  "title": "Warm - ups show UFH wont be Super League pushovers - Full Stop Communications",
  "date": "20240320T104500Z",
  "domain": "fullstopcom.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After a positive pre-competition warm-up campaign, the members of the University of Fort Hare’s all-conquering women’s football team can sleep easier ahead of their historic Hollywoodbets Super League debut this weekend.\nDuring this time, UFH held their own against Super League mainstays and tasted some success in a mini-tournament in Durban just over a week ago.\nIn Alice, on Saturday, they had the better of the Northern Cape’s Richmond United Ladies FC in one of three 45-minute “halves” the clubs used to test different combinations.\nThe first ended in a 2-2 draw with Fort Hare winning the second 2-0 and losing the third 3-0 – good numbers against the team who placed seventh in the Super League last season.\nCoach Asanda Mnakaniso said their trip to Durban had done wonders for their confidence as their opening game against TUT Matsatsantsa Ladies FC at home on Saturday loomed.\nThe team did not make the best of starts in KwaZulu-Natal, suffering a 1-3 defeat to Durban Ladies (eighth in 2023).\nFrom that point onwards, however, they started playing the kind of football that saw them being crowned Sasol League champions.\nThey rallied to beat fellow newcomers Lindelani Ladies 3-2 while running Royal AM, fifth last year, close in a 1-2 defeat.\nMnakaniso said that while it was only natural to respect the Super League regulars, he was thrilled to see his charges getting “stronger and stronger” and leaving Durban “feeling a lot more confident”.\nTUT Matsatsantsa, 10th last year, will present a formidable challenge following the university’s ground-breaking merger with football colossus SuperSport United last June.\nEven though the task in 2024 is immense, the team’s progress, especially in respect of integrating their 14 new signings, augured well for the road ahead.\nMnakaniso was clear on their mandate as they prepared for their first rodeo among the country’s elite.\n“We are not expected to be among the top finishers, but are out to retain our position in the Super League.\n“And I believe the squad we have will take us through this first year. I think we will have some positive results.”\nThose who were part of last season’s triumphant Sasol League team have welcomed the newcomers on board in support of the coach’s efforts to beef up the squad with Super League experience.\n“They are making it easier for us as coaches,” an appreciative Mnakaniso said.\nIn addition to preparing the team, he has been commuting to Limpopo and back to attend classes for his B-licence, a requirement of all head coaches in South Africa’s professional ranks.\nAnd that has been going well, he said.",
  "word_count": 434,
  "scraped_at": "2026-02-14T12:47:07.006371"
}