{
  "article_id": "6a0bd52730dc",
  "url": "https://www.dailylocal.com/2024/08/06/paris-olympics-day-11-gabby-thomas-cole-hocker/",
  "title": "Paris Olympics Day 11 : Gabby Thomas leads Americans to 2 golds 5 overall at track and field",
  "date": "20240807T003000Z",
  "domain": "dailylocal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By JENNA FRYER\nPARIS (AP) — The United States had a big night in track and field at the Paris Olympics on Tuesday, winning two gold medals and five overall.\nGabby Thomas blazed her way to an easy win in the 200 meters — and beat 100-meter winner Julien Alfred, who earned silver and now owns the only two medals in her country’s history. American sprinter Brittany Brown was third.\nThomas finished in 21.83 seconds to add a gold to the bronze she took home in the event from Tokyo three years ago. The 27-year-old Harvard graduate, who has a Masters in public health, took the lead for good at the curve and was never challenged in the final stretch. She grabbed her head with both hands after winning.\nCole Hocker, meanwhile, pulled the upset of the track meet with a stunning victory in the 1,500 meters.\nHocker outraced favorites Jakob Ingebrigtsen and Josh Kerr to the finish line in an Olympic record 3 minutes 27.65 seconds. He pulled from fifth to first over the final 300 meters to beat his personal best by more than 3 seconds.\nHe beat Kerr by .14 seconds, while Ingebrigtsen, who set the pace through the first 1200 meters, ended up in fourth behind American Yared Nuguse.\nAnnette Nneka Echikunwoke won a silver in the women’s hammer throw.\nA look at other events from Day 11 of the Paris Olympics:\nUS women’s soccer team to play for gold\nThe United States women’s soccer team advanced to the gold-medal game and will make its sixth appearance in the Olympic final following a 1-0 win over Germany.\nSophia Smith broke a scoreless game in extra time by outmaneuvering defender Felicitas Rauch and German goalkeeper Ann-Katrin Berger. It was Smith’s third goal of the tournament.\nThe Americans are undefeated in France under new coach Emma Hayes and are vying for their fifth Olympic gold medal. They U.S. Women’s National Team missed out on the finals at the last two Olympic tournaments. They were eliminated in the quarterfinals in 2016 in Rio de Janeiro and relegated to the bronze-medal match at the Tokyo Games three years ago.\nUS women’s volleyball team advances\nThe reigning Olympic champion U.S. women’s volleyball team posted a straight-set victory against Poland to advance to the semifinals in Paris.\nThe Americans next play powerhouse Brazil on Thursday.\nThe Americans made a lineup change after the team’s five-set defeat to China on July 29 to open group stage play, moving veterans Jordan Larson and Kelsey Robinson Cook to reserve roles and bringing in Avery Skinner and Kathryn Plummer. The Americans bounced back to beat Serbia two days later.\nTeen wins skateboarding gold\nA 14-year-old won the women’s park skateboarding and knew she had a podium locked up as soon as she nailed her final run.\nArisa Trew of Australia scored a 93.18 on her final but still had an excruciating wait to see which step on the podium she’d stand on. Only when a 92.63 popped up for Japan’s Cocona Hiraki to end the competition did Trew knew she was taking home gold.\nAt 14 years and 88 days old, Trew became the youngest Australian to win a medal. The previous youngest was Sandra Morgan, who was 14 years and 184 days old when she won gold in the women’s 4×100 freestyle relay in 1956.\nWrestler goes out on top\nMijain Lopez concluded his career at the top, retiring after winning the 130-kilogram final for his fifth consecutive gold medal in Greco-Roman wrestling.\nThe 41-year-old Cuban defeated Yasmani Acosta Fernandez of Chile 6-0. It made him the first Olympian to win gold in an event in five straight Games.\nFollowing the match, he placed his shoes in the center of the mat, symbolizing his retirement.\nAt the last Olympics, Lopez became the first male wrestler to win four gold medals when he dominated in Tokyo, blowing through the field unscored upon in four matches.\nPerfect 10 in diving\nQuan Hongchan of China won her second gold medal in diving competition at these Games and did it by scoring a perfect 10 on the first of her five dives.\nThe dive was a forward 3 1/2 somersaults and hardly made a ripple as she set off wild cheers from Chinese fans as the seven judges all registered scores of 10.\nThe 17-year-old, a three-time world champion, said she has scored 10 three times before — including twice while winning gold in Tokyo.\nThe two Chinese women teamed up earlier to win the 10-meter synchronized.\nBrazil upset in beach volleyball\nTop-ranked David Ahman and Jonatan Hellvig of Sweden jump-set their way into the beach volleyball semifinals by beating Evandro and Arthur of Brazil at the Eiffel Tower Stadium.\nBrazil’s loss means the sport’s spiritual home will not win a men’s medal for the second straight Olympics. The Brazilian men took gold in Rio de Janeiro and Athens and three other medals in between.\nSeine River water concerns cancel marathon swim test\nA test run meant to allow athletes to familiarize themselves with the marathon swimming course in the Seine River was canceled over concerns about water quality in the Paris waterway.\nWorld Aquatics made the decision to cancel the exercise at an early morning meeting. Fluctuating bacteria levels in the long-polluted waterway have been a constant concern throughout the Games with the swimming portion of the triathlon and the marathon swimming events both planned in the river.\nAnother marathon swimming test event is scheduled for Wednesday, and organizers will decide early that morning whether it will go forward. The women’s marathon swim competition is set for Thursday, while the men are scheduled to race Friday.\nThe triathlon mixed relay event was held in the river this week. World Triathlon released data showing that when the triathletes swam, the levels of fecal bacteria E. coli and enterococci were within acceptable levels for the length of the triathlon relay course.",
  "word_count": 991,
  "scraped_at": "2026-02-14T13:02:35.466465"
}