{
  "article_id": "6a2bad0d710a",
  "url": "https://www.yahoo.com/news/wing-war-abortion-nothing-babies-110000631.html",
  "title": "The Right - Wing War on Abortion Has Nothing to Do With Babies",
  "date": "20240304T123000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Right-Wing War on Abortion Has Nothing to Do With Babies\nIn any American news cycle, there are certain inevitabilities, a kind of call-and-response between an event and its coverage that you can generally expect to see. When a trend crests on TikTok, a thousand explainers bloom in an effort to make it make sense to the offline masses. When literally anything happens at an Ivy League school, every desk at The New York Times goes on red alert, steeling itself for the customary two weeks of wraparound coverage. And when a dystopian law is passed restricting abortion access or limiting reproductive rights in any fashion in the United States, those who experience the extraordinary harm at the hands of those policies—or who would have been harmed had these policies been in place when they were pregnant or trying to conceive—share their stories with the world.\nIt is no surprise that in the wake of the latest assault on these freedoms—the Alabama Supreme Court ruling that frozen embryos can be considered children under state law—there has been a wave of poignant, moving, and sometimes terrifying reported features and first-person pieces on the effect of this policy. Last week, GQ published an essay by Zach Baron on the arduous, expensive, yearslong IVF journey he and his wife endured to conceive their son. The Washington Post’s Caroline Kitchener, who last year won a Pulitzer for her coverage of abortion in post-Roe America, reported on a Texas woman who wanted to have a baby with her boyfriend and was denied treatment for her life-threatening ectopic pregnancy.\nThere are plenty more where that came from, especially in Alabama, like this one about the married woman who cannot carry a pregnancy for health reasons and so was using a surrogate but whose embryo transfer was halted when the ruling came down, or this one about the 34-year-old woman who had been trying to conceive with her husband for over a year when her embryo transfer was also canceled.\nWhat person of conscience could read stories like these and not be moved by them? Anyone who has yet to grasp the horror that awaits us all under these policies is surely awakened to the threat of them by dispatches like these. Those who are already suffering under the yoke of a post-Dobbs world, or know such suffering is imminent and inescapable, can read these stories and feel less alone.\nBut something about the thread tying all this work together makes me want to scream. Ultimately all these stories, on some level, capitulate to the terms set out by the right: that these laws are about babies, and therefore, the most compelling and sympathetic stories to counter the harm of these laws must necessarily be about babies and put the stories of people whose pregnancies are wanted and who desire the babies that would result, if it were possible to bear them, at the center. Newsrooms across the country seem to have deemed this to be the correct and commensurate response.\nBut the insidious, vile truth is that the Alabama ruling—as well as all of the statutes and the language of the Alabama state Constitution, a plain reading of which really left the state Supreme Court no choice but to restrict IVF—has got nothing to do with babies. The anti-abortion movement is not about babies. It has never been about babies. It’s about control.\nThe force behind every anti-abortion policy is not concern for babies or the alleged humanity of unfertilized embryos; it is violent misogyny, plain and simple, with the obvious intent of stripping every person who can get pregnant of their basic human rights. These laws are a knife at the throat of every woman you know. And the real case against them is, and should be, that any policy that aims to restrict bodily autonomy is barbaric and cruel, a violation of constitutional—and human—rights.\nIt is heartbreaking that those who want to have babies have been made to suffer, needlessly and endlessly, on top of the ongoing pain and cost of whatever treatments they’ve endured. This is compelling testimony against what the right is aiming to do to the country, and it merits serious attention. But these stories are just a sliver of the larger brief that needs to be made against the forced birth movement. Hopeful parents are only one part of the picture. There is a vaster universe of people who will get ground up in the gears of this oppression—namely, people who aren’t parents and have no intention of becoming so. And having wanted a baby is not a more legitimate credential than having never wanted to be pregnant to begin with.\nThe point is not that everyone should get to safely have a baby. The point is that every person should have the right to determine when and whether they become or stay pregnant at all. The point is all people are deserving of bodily autonomy, and it is bodily autonomy, not babies, that these laws are designed to deny.\nWhile the harrowing stories of those aspiring to raise families have ostensibly been put forward in service of protecting rights that conservatives attack, much of this media coverage is framed in such a way as to focus on people who are exercising their bodily autonomy in the least threatening and most conservative-approved manner—in the interest of monogamy and parenthood.\nBut the case against these restrictions cannot be for this and this alone—for the Norman Rockwell family fantasy that even a Reaganite can get behind. It’s the lowest-hanging fruit on the pro-choice tree. It offers up the noncontroversial desire of child-rearing as a gentler stand-in for the apparently polarizing idea progressives are supposed to actually be fighting for: the right of every person to decide their own future, to have a body that is theirs and theirs alone, to do with what they like.\nThis is the crux of the whole damn thing: It doesn’t matter what a person wants the autonomy for! She can want to use her bodily autonomy to conceive through in vitro fertilization with her husband of 15 years, or she can want to use it to take Plan B after a one-night stand, or she can go on the Pill to have sex whenever she chooses, or to manage her acne, or just for peace of mind. Birth control pills can often have complex and cascading side effects, so she can want an IUD as an alternative, because getting your period is, at best, extremely annoying and is often worse than that, sometimes so painful as to be totally debilitating. She can use her bodily autonomy to get pregnant and give birth; she can use it to have an OnlyFans.\nMore in Lifestyle\nIt would be very cool to see just as many stories about single people who have no interest in having kids—or who want kids later but not right now, or who are done having kids and want the freedom to enjoy sex without the risk of pregnancy—as stories about people who are on their third round of IVF or who want children but whose lives are imperiled by doomed pregnancies. But media coverage rarely highlights these deemed-to-be-less-sympathetic characters, especially those who are so often the target of the right’s cruelty and vitriol: the women who do whatever they want, whose lives are not anchored to spouses or children.\nNot only does this suggest, rather cruelly, that people who don’t want children are not as deserving of compassion or freedom as people who do, but it also plays right into the right’s hands, allowing the entire argument to be conducted on their terms. The media’s fixation on babies is how it comes to pass that everyone gets caught off guard by something as predictable and inevitable as the Alabama ruling. Oh, wow, how could Republicans do this? I thought they cared about babies! Well, what do you know: They don’t! They never have! This has such incredible Charlie-Brown-trying-to-kick-the-football energy. Thinking the anti-abortion movement is about babies is like thinking the Civil War was about states’ rights.\nThe list of policies and actions the Republican Party would actually fight for if they gave a single solitary fuck about babies includes but is not limited to: supporting universal childcare and pre-K, addressing the nationwide lack of affordable housing that keeps so many parents and their young children on the streets (not to mention extending the federal eviction moratorium that would keep vulnerable people from being exiled from their homes), lowering horrifying maternal mortality rates, and raising the minimum wage.\nIf they cared at all about the future of these babies, they wouldn’t be so busy rolling back child labor laws. Instead they might feel some sense of urgency around our ongoing and rapidly escalating climate disaster; probably they would also want to make it harder to buy a gun.\nRemember the 2022 infant formula shortage? More than 90 percent of House Republicans voted against the emergency funding bill that saved those babies from starving. That same year, for the second year in a row, Republicans in Mississippi voted against postpartum Medicaid benefits, essentially ensuring that many low-income parents would lose health insurance just two months after giving birth. Their disdain for babies is both political and personal: The likely GOP presidential nominee brags about having never changed a single diaper for any of his five children.\nHere is what is actually on the Republican to-do list: a federal abortion ban, which inevitably leads to the criminalization of miscarriage—which is already happening; ongoing restrictions to IVF; bounty-hunter laws that incentivize suing anyone who helps someone get an abortion; bans on contraception and even recreational sex; the end of “no-fault” divorce.\nThis is also why triumphantly pointing to the supposed hypocrisy of the Republican Party is a pointless and idiotic exercise. Remember when a Covid-stricken Donald Trump was treated with Regeneron, a drug that was derived from fetal tissue cells? Former New Republic editor Katie McDonough recalled how many smug reactions amounted to “Wondering how conservatives feel about Donald Trump being saved by a therapy developed with stem cells from aborted fetuses?”\n“I can answer that question for you,” wrote McDonough, “They don’t give a shit.… It’s hypocrisy, but who cares when you’re getting what you want?” This is how you get a Republican lawmaker praising IVF for helping her start her family while simultaneously supporting the Life at Conception Act. She already got everything she wanted.\nThe only reason to consider the IVF ruling a hypocritical move by a self-proclaimed “pro-life” party is if you believe that “pro-life” is an accurate description of the movement. It isn’t. It has never been. Pro-life is a propaganda term, utterly devoid of meaning, with no substantive concern for babies at all. Here, no hypocrisy has been uncovered; rather, we just have more confirmation of what those who’ve been paying attention already know: This is a remarkably consistent movement that considers all women to be chattel and does not want them to enjoy full citizenship, full stop. It is actually that simple. This is not a plot twist. This is the plot.",
  "word_count": 1861,
  "scraped_at": "2026-02-14T13:11:09.786427"
}