{
  "article_id": "6a2c22e3bdb0",
  "url": "https://www.bbc.com/sport/football/articles/cr4z0g6e234o",
  "title": "Women World Cup to be expanded to 48 teams from 2031",
  "date": "20250510T001500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Women's World Cup to expand to 48 teams from 2031\n- Published\nFifa has announced that the Women's World Cup will be expanded from 32 to 48 teams from the 2031 tournament.\nThe Fifa Council voted unanimously for the changes that will be in place for 2035 edition, due to be hosted in the United Kingdom.\nAs a result of the increase in teams, the competition will adopt a 12-group format with an additional 40 matches, up from 64 to 104, that will extend the tournament by a week.\nFifa president Gianni Infantino said the changes would give more nations to \"the chance to benefit from the tournament to develop their women's football structures\".\nHe added: \"This decision ensures we are maintaining the momentum in terms of growing women's football globally.\"\nEngland reached the final of the most recent Women's World Cup in Australia and New Zealand in 2023 before losing to Spain.\nThe Lionesses, along with Scotland, Wales and Northern Ireland, are set to have a chance to compete on home soil in 2035 with the UK seen as the only \"valid\" bidder for the tournament.\nNone of the home nations have lifted the trophy since its inception in 1991.\nWill 48-team Women's World Cup be good for the game?\n- Published10 May 2025\nFifpro calls for 'improved labour conditions'\nPlayers' union Fifpro welcomed the expansion \"in principle\" but called for a number of issues in the women's game to be addressed.\n\"[The World Cup expansion] reflects the global growth of the women's game,\" Fifpro said.\n\"However, the support of players depends on inclusive decision-making and cooperative planning that respects all stakeholders.\n\"It is critical that the global development of women's competitions goes hand in hand with improved labour conditions and the advancement of players, as well as development further down the pyramid.\n\"This is the only path to true sustainability, expansion, and progress.\"\nCreation of Afghanistan refugee team approved\nFifa has also approved the creation of an Afghanistan women's refugee team in what Infantino called a \"landmark\" moment.\nThe team made up of female Afghan players who have obtained refugee status abroad will compete in matches supervised by the world governing body.\nAfter an initial one-year pilot phase, Fifa will decide whether the programme is viable long-term.\nThe Afghan Football Federation has not acknowledged its women's teams with women's sports banned across the country under Taliban law.\nThe last official match played by the Afghanistan women's team was in 2018.\nFifa also announced a revised disciplinary code to fight racism that sees the maximum fine for racist abuse increased to £4.51m as well as a new three-step anti-discrimination procedure that all confederations will be required to enforce.\nRelated topics\n- Published3 April 2025",
  "word_count": 455,
  "scraped_at": "2026-02-14T13:06:15.290673"
}