{
  "article_id": "6a7bb656f8d7",
  "url": "https://clemsontigers.com/clemson-athletics-records-96-percent-graduation-success-rate/",
  "title": "Clemson Athletics Records 96 Percent Graduation Success Rate",
  "date": "20241120T223000Z",
  "domain": "clemsontigers.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Clemson Athletic Department is again tied for best in the NCAA among public Power Five institutions in Graduation Success Rate (GSR) with a 96 percent mark for the 2014-17 cohort in data released by the NCAA. Clemson’s overall mark trails only private institutions Notre Dame (99), Northwestern (98), Boston College (98), Duke (97) and Stanford (97). Clemson is tied with Alabama, Louisville, Michigan and Virginia among public Power Fives.\nNine Clemson programs earned perfect 100 percent scores for the cohort, one shy of the school record – baseball, men’s basketball, men’s golf, men’s tennis, women’s golf, women’s soccer, women’s cross country/track, softball, and volleyball.\nIt’s the 11th consecutive cohort in which Clemson’s department-wide GSR was at 91 percent or higher, and fourth in a row at 95 percent or higher, one of three public Power Five schools nationally to make that claim. Nine Clemson programs set or tied program records for GSR.\nAdditional Notables on Clemson’s GSR:\nClemson’s department rate of 96 percent leads the nation among public Power Five institutions and is sixth in the nation among all Power Five programs.\nFootball reached a 99 percent mark for the second year in a row, again tying the highest GSR score for any Power Five football program, and tying the highest ever recorded among public Power Five football programs in the 20 years the NCAA has tracked the metric. Football trailed only Air Force and LIU (100 percent) in this release, and tied Columbia, Harvard and Northwestern.\nVolleyball maintained its streak of 20 consecutive cohorts at 100 percent\nThe softball program hit 100 percent in each of its first two counting cohorts since beginning play in 2020.\nThe men’s soccer program’s 96 percent mark tied its second-best on record, trailing a 100 in the 2014 release.\nMen’s Basketball reached 100 percent for the seventh consecutive cohort. Clemson is one of five ACC programs in this cohort to reach 100 percent and the only ACC program with a streak of five years or more.\nBaseball reached 100 percent for the eighth consecutive cohort.\nOverall Department Rate: 96\n*tie/set program record\nWomen’s Sports\nBasketball: 95\nCross Country/Track: 100*\nRowing: 95\nGolf: 100*\nSoccer: 100*\nSoftball: 100\nTennis: 88\nVolleyball : 100*\nMen’s Sports\nBaseball: 100*\nBasketball: 100*\nCross Country/Track: 84\nFootball: 99*\nGolf: 100*\nSoccer: 96\nTennis: 100*\nA note on GSR:\nThe student-athlete graduation rate calculated directly based on IPEDS-GRS (which is the methodology the U.S. Department of Education requires) is the proportion of first-year, full-time student-athletes who entered a school on athletics aid and graduated from that institution within six years. The federal rate does not account for students who transfer from their original institution and graduate elsewhere. The NCAA GSR differs from the federal calculation in two important ways. First, the GSR holds colleges accountable for those student-athletes who transfer into their school. Second, the GSR does not penalize colleges whose student-athletes transfer in good academic standing.",
  "word_count": 489,
  "scraped_at": "2026-02-14T13:17:59.025932"
}