{
  "article_id": "6a8bb1e13a53",
  "url": "https://www.canberratimes.com.au/story/8785777/canberra-united-a-league-women-clash-for-michelle-heyman/?cs=14329",
  "title": "Canberra United , A - League Women clash for Michelle Heyman | The Canberra Times",
  "date": "20241010T224500Z",
  "domain": "canberratimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Canberra United is bracing to be without superstar striker Michelle Heyman for the bulk of the pre-season and the possibility of her missing the season-opener as the Matildas prepare to go back to the future.\nSubscribe now for unlimited access.\nor signup to continue reading\nHeyman is set to be named in the Matildas squad on Friday morning as the team braces for a fresh start under interim coach Tom Sermanni, who is back in the role after a 12-year absence.\nSermanni has replaced Tony Gustavsson, who was sacked after the Paris campaign, and the new coach has settled on his squad for games against Switzerland and Germany in Europe at the end of October.\nFormer Canberra goalkeeper Chloe Lincoln has bolted into the squad after Lydia Williams retired from international duties, while Sermanni is keen to call Sam Kerr into camp despite her injury.\nThe timing of those games is the problem for Canberra United. The Matildas play against Germany on October 29, just four days before Canberra's season-opener against Brisbane on November 2.\nHeyman would likely only arrive back in Canberra two days before the start of the A-League Women's competition on top of missing a large chunk of pre-season training for the new-look United squad.\nThe 36-year-old will be a linchpin for Canberra again this season and new coach Antoni Jagarinec will likely turn to the greatest goal-scorer in A-League Women's history to be his captain.\nBut the 24 hours or more of travel after the Matildas game - irrespective of the amount of game time Heyman gets - will likely see Canberra take a cautious approach with her start to the season.\nAs expected, Sermanni mostly turned to experienced players based in Europe for friendlies against Switzerland in Zurich on October 25 and Germany in Duisburg on October 28, with few shocks.\nHe described the window as a \"reset\", preparing for the 2026 home Asian Cup while also attempting to get his players refocused and back to their best football.\nExciting playmaker Daniela Galic, 18, earned her first full call-up off the back of form with Melbourne City, then FC Twente.\nLiverpool shot-stopper Teagan Micah (ankle) is unavailable while Sermanni confirmed Cortnee Vine wanted to remain with North Carolina Courage as she attempts to establish herself at the NWSL club.\nThere is only room for four A-League players: Heyman, Tameka Yallop, Sharn Freier and untested goalkeeper Lincoln.\nFootball Australia named former Western Sydney Wanderers men's coach Jean-Paul de Marigny and Young Matildas coach Leah Blayney to work as Sermanni's assistants, with Mel Andreatta on maternity leave.\nSermanni said de Marigny shared his football philosophies but would also bring in \"a fresh set of eyes and fresh views on the players and on the team\".\nMATILDAS SQUAD\nGoalkeepers: Mackenzie Arnold, Chloe Lincoln*, Jada Whyman*\nDefenders: Ellie Carpenter, Steph Catley, Charli Grant, Winonah Heatley*, Clare Hunt, Alanna Kennedy, Courtney Nevin, Clare Polkinghorne\nMidfielders: Kyra Cooney-Cross, Daniela Galic*, Katrina Gorry, Emily van Egmond, Clare Wheeler, Tameka Yallop\nForwards: Caitlin Foord, Mary Fowler, Sharn Freier, Michelle Heyman, Hayley Raso, Kaitlyn Torpey\n* denotes uncapped players\nSO SALLY CAN WAIT FOR HER RETURN\nFans will get their first chance to see the revamped squad in action when they play a Canberra National Premier League all stars team at McKellar on Saturday afternoon.\nSally James is keen to slip back into Canberra green four years after she left the club to test herself in Sydney, Melbourne and Perth.\nThe former Young Matildas goalkeeper was on the verge of quitting soccer before linking with Jagarinec when he was the Belconnen United coach.\nShe said his tutelage helped her rediscover her love for the game, and when she left Canberra to move to Sydney she told Jagarinec she would come back the day he became the A-League Women's coach.\nJagarinec reached out to James within 48 hours of being appointed Canberra's new coach earlier this year, and the deal to get James back to the team was sealed in three weeks.\n\"When I left I was 17 or 18 years old - I was quite young, quite shy,\" James said.\n\"I like to think I've come out of my shell a little bit more now. I've learned a lot of lessons from the different places that I've been, and that's something I'm super excited to bring into the season.\n\"I want to play football with my friends. When you over complicate [goals] you can get yourself in a bit of trouble because it can feel like you're falling short if you don't reach them.\"\nJames considered making the switch to Australian football before she combined with Jagarinec.\nMORE CANBERRA SPORT\n\"I had a suspicion [she wanted to quit] ... From memory [we spoke about it] on a Thursday or Friday. She came to a session the next Tuesday and that was the last time we ever spoke about AFL,\" Jagarinec said.\n\"I knew I wanted Sally to be a part of my goalkeeping team. She went to some big clubs in Australia and flirted with some opportunities overseas ... I appreciate her work rate, level of commitment and professionalism.\n\"She's got ambitions and I want to be a part of that process. I know how to push her buttons a little bit as well to get the best out of her.\"\nMake us full-time athletes: Canberra United players among calls for better funding\nThe majority of A-League Women's players want to be full-time professionals within the next two years and have called on clubs to improve the match-day experience and overall standards at their teams.\nProfessional Footballers Australia have published the findings of an annual player survey, which saw Canberra United ranked outside the top four in key club satisfaction categories as its long-term future continues to hang in the balance.\nThe rise of the Matildas and the support generated off the back of hosting the World Cup last year is fuelling the push for major improvements to the women's competition.\nMore than half of the players in each squad took part in the survey and 96 per cent said the league needed to become a full-time competition by the start of the 2026-27 season.\nThe salary cap is currently set at $600,000 and all clubs must spend at least $500,000 on player wages. The minimum salary for 35 weeks is $26,500, or $757 per week.\nCanberra United has spent the full salary cap allocation this season as well as including a marquee contract for Michelle Heyman despite the club's off-field uncertainty.\nThere were fears Canberra United - the only team operated by a state association - would cease to exist at the end of last season. But Capital Football is trying to reinvigorate the program, although their continued involvement beyond this season remains unclear.\n\"In this report, the players are clear about what steps are required to propel the domestic game toward these goals,\" said PFA co-chief executives Kate Gill and Beau Busch.\n\"Full-time professionalism must be delivered by 2026, enabling clubs to attract and retain the best talent, and supporting players to reach their full potential as athletes.\n\"We need elite workplace environments, match-day infrastructure, and broadcast quality, if we're going to tell players, fans, investors, and partners that this is an elite product.\n\"The players accept that these developments will not (and should not) be achieved amid business as usual.\n\"League and club leadership must join the players to craft an ambitious vision in which professionalism, commercialisation, product quality, and investment all evolve in parallel.\n\"Looking at the progress of the Matildas and other leagues, this will be a leap based more on evidence than faith.\"\nThe report delivered four key recommendations: being full-time athletes by 2026, promote the A-League Women's competition during the 2026 Asian Cup, redefining match-day expectations for players and fans to \"reflect the elite product\" and foster better environments at individual clubs.\n\"The global growth of women's football presents both a challenge and an opportunity for the A-League Women,\" Gil said.\n\"Our players recognise that the league must embrace full-time professionalism by 2026 to remain competitive on the global stage.\"\nA-League Women's crowd numbers jumped by 72 per cent off the back of the Matildas' World Cup campaign, including records for Canberra at McKellar Park.\nPlayers from across the competition gave the McKellar Park surface a three-out-of-five stars rating, while they said the atmosphere was four-out-of-five.\nA new-look Canberra United squad has started training ahead of the start of the season next month, with Antoni Jagarinec taking the coaching reins and building a new roster.\nNew Zealand international Elizabeth Anton and former Melbourne Victory and Western United midfielder Emma Robers have been recruited to help strengthen Canberra's defensive line.\nThe team boasts the greatest goal-scorer in A-League Women's history - Heyman - but they had the second worst defensive record last season after conceding 47 goals in 22 games.\n\"It just seems like there's such a family and community feel here,\" Robers said.\n\"I felt that straight away and I'm just really excited to get going. At the end of the day it was an easy decision to come [to Canberra]. I hope I can make my stamp and help guide the [young players] through the season. [Hopefully I can be ] a bit of a steady character in the middle.\"\nUnable to support themselves on club wages\nA-League Women players are unable to play football full-time as \"club wage was not close to being able to support [themselves], particularly in the current cost of living crisis.\"\nFifty-nine per cent of players said they might leave football early due to low club salaries, and 49 per cent worked over 20 hours a week.\nNatasha Rigby, a retiring 31-year-old Perth Glory player, reportedly worked over 55 hours a week balancing football and her full-time job for six out of her eight years in the A-League.\nRigby said low club wages \"hindered\" her ability to buy a home.\nPlayers felt that higher wages would allow players to fully commit to football, allowing the league to improve as \"the best leagues have the best players.\"\nPlayers balancing football with work or studies struggled with sleep, mental health and their work performance. This \"tug-of-war\" between football and their responsibilities has impacted their performance and undercuts the league's value.\nRigby's mental health and relationships suffered in the final two years of her career, leading her to seek psychological help to manage her anxiety and stress from the unbalanced lifestyle.\nA-League's ability to retain players is under threat\n\"Strong leagues are built around clubs who create a high-performance environment purposefully made for women's football,\" said Matildas great Moya Dodd, who is also the secretary of the board of the women's leagues forum.\nThe A-League Women's competition is now ranked as the third most desirable league for players in the competition. They would prefer to play in the England or the United States if opportunities were available.\nAccording to the Professional Footballers Australia survey, the A-League Women are losing players early due to unsustainable career dynamics.\nLeading overseas competitions offer far greater remuneration, year-round elite environments and longer contracts.\nFormer Canberra United, Brisbane and Newcastle player Cannon Clough recently left Australia to play in the new USL competition in the United States.\nClough said longer contracts, health insurance plans and more screen time during broadcasts are some of the reasons behind her departure.\nREAD MORE SPORT:\n\"Our owner comes to training occasionally and is on first-name basis with the girls and doesn't fail to let us know he backs us. I've not been in an environment like that before,\" Clough said.\nThe report also said players were suffering from extreme conditions during the summer season. After the warmest August on record, Australia is likely to see a very warm spring and extreme heat in summer.\n\"Playing a winter sport in summer impacts the brand of football in Australia but more importantly, player health and welfare,\" said former Canberra United player Emma Ilijoski.\n\"There are risks of skin cancer and heat stroke, on top of needing to recover from the higher physical demands.\"\nThe smaller suburban venues where ALW is often held often lack the shade and cooling systems larger stadiums have. Players even feel hotter indoors than out in the elements.",
  "word_count": 2047,
  "scraped_at": "2026-02-14T12:42:56.616964"
}