{
  "article_id": "6a96cef84b1a",
  "url": "https://www.fcbarcelona.com/en/club/news/4286291/walkers-celebrate-fc-barcelonas-125th-anniversary",
  "title": "Walkers celebrate FC Barcelona 125th anniversary",
  "date": "20250614T163000Z",
  "domain": "fcbarcelona.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Walkers celebrate FC Barcelona's 125th anniversary\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link\nA memorable day for Barça supporters. 14 June 2025 will go down as the day of the Marxa Culer (Culer Walk), a mass hike to Montserrat to celebrate FC Barcelona’s 125th anniversary. Hundreds of members, penyistes and fans trekked together to the Montserrat Abbey, moved by their love of Barça, which has once again proved to be 'Més que un Club'.\nMore than half the walkers set off the previous night from the Estadi Johan Cruyff at the Ciutat Esportiva. After covering almost 47 km, they were welcomed this morning at iconic 'serrated mountain', where they met up with those who had opted for the shorter, 6-km route that began at Collbató at first light.\nUnder a sunny sky, the Abbey Museum square hosted music, dancing by the Comparsa Blaugrana and a parade of stick-dancers. Directors Elena Fort and Josep-Ignasi Macià, together with 125th-anniversary commissioner David Carabén, presented a commemorative medal to every participant, and the season’s trophies won by the men’s and women’s first football teams were put on display.\nFellowship\nMid-morning, Barça president Joan Laporta and the Reverend Abbot Manel Gasch presided over the welcoming ceremony, which opened with a video highlighting the historic kinship between Barça and Montserrat. In his address Laporta stressed that link: “The Marxa Culer symbolises the brotherhood of two institutions committed to Catalan identity, culture, language, and to the rights and freedoms of Catalonia, while also sharing an open, global, and inclusive outlook.”\nThe Abbot, for his part, rejoiced that Barça’s trophies had once again reached the holy mountain: “May these cups keep finding their way to Montserrat. And may the one that missed the path this year find it next time.”\nAlso speaking was Jordi Merino, president of the Catalan Hiking Federation (FEEC), and a tribute was paid to the Penya Blaugrana de Manresa in memory of the first worldwide supporters-club gathering held at Montserrat in 1972.\nNext, the sardana troupe Mirant al Cel performed, and the Board members and dignitaries moved inside the Basilica. After a brief homily during the conventual mass, Laporta presented a floral offering to Our Lady of Montserrat, along with a symbolic offering of the titles won by the men’s and women’s first teams in the 2024/25 season.\nBarça and Montserrat, forever together\nSpeaking to the club’s media afterwards, Laporta summed up the day: \"Today shows once again that Barça is More than a Club. We have experienced a day of fellowship with this Marxa Culer. The walkers will have nourished both body and soul. We wanted to bring the trophies from this hugely successful 125th-anniversary season. Barça and Montserrat will always stand together in defending Catalan identity, culture, language, our rights and freedoms, and our traditions.”\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link",
  "word_count": 496,
  "scraped_at": "2026-02-14T12:53:35.436302"
}