{
  "article_id": "6ae3a0ba66ec",
  "url": "https://www.frontpagemag.com/harrison-butker-culture-warrior/",
  "title": "Harrison Butker , Culture Warrior | Frontpage Mag",
  "date": "20240520T000000Z",
  "domain": "frontpagemag.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "[Order David Horowitz’s new book, America Betrayed, HERE.]\nOvernight, Kansas City Chiefs kicker Harrison Butker has become an unexpected flashpoint in the culture wars. The 28-year-old devout Catholic was catapulted onto frontpage news last week after giving what, in saner times, would have been considered a largely innocuous commencement speech at Benedictine College, a Kansas Catholic school. In it he championed old-fashioned values like faith and family that fearlessly shot down all the left’s sacred cows, from abortion to DEI to trans ideology.\nAsserting that “we see that in the complete surrender to self and in turning towards Christ, you will find happiness,” Butker exhorted the Catholic students to let their lives be led by traditional values, telling them it is a “reminder to us all that when you embrace tradition, success, worldly and spiritual, will follow.” He warned that “abortion, IVF, surrogacy, euthanasia, as well as a growing support for degenerate cultural values in media, all stem from the pervasiveness of disorder,” and along the way he sideswiped the LGBTQ movement:\nI am certain the reporters at the AP could not have imagined that their attempt to rebuke and embarrass places and people like those here at Benedictine wouldn’t be met with anger but instead met with excitement and pride. Not the deadly sin sort of pride that has an entire month dedicated to it, but the true God-centered pride that is cooperating with the Holy Ghost to glorify Him.\nArguably his most important and controversial points came when he separately addressed the men and women in his audience, offering advice that runs directly counter to the destructive messaging in the culture about the nature of masculinity and femininity:\nTo the gentleman here today, part of what plagues our society is this lie that has been told to you that men are not necessary in the home or in our communities. As men, we set the tone of the culture. And when that is absent disorder, dysfunction and chaos set in this absence of men in the home is what plays a large role in the violence we see all around the nation.\n“Be unapologetic in your masculinity,” he added. “Do hard things. Never settle for what is easy.”\nHe urged the women to embrace marriage and motherhood instead of sacrificing everything for a career:\nI think it is you, the women, who have had the most diabolical lies told to you, how many of you are sitting here now about to cross the stage, and are thinking about all the promotions and titles you’re going to get in your career. Some of you may go on to lead successful careers in the world. But I would venture to guess that the majority of you are most excited about your marriage and the children you will bring into this world. I can tell you that my beautiful wife Isabelle would be the first to say that her life truly started when she began living her vocation as a wife and as a mother.\nNowhere did he say women should be relegated to being stay-at-home moms, but feminists naturally lost their minds over the notion that their greatest vocation lies in motherhood. If feminism were truly about “choice” for women, then choosing to be a homemaker would be as valued and respected as choosing to be a corporate executive. But we all know that feminists idolize the world-beating ambition of the latter and display open contempt or pity for the former.\nButker went on to denounce the “bad policies and poor leadership” of the current regime, which is destroying the country with its “tyranny of diversity, equity, and inclusion.” As for Biden himself, Butker said,\nOur own nation is led by a man who publicly and proudly proclaims his Catholic faith, but at the same time is delusional enough to make the sign of the cross during a pro-abortion rally. He has been so vocal in his support for the murder of innocent babies, that I’m sure to many people, it appears that you can be both Catholic and pro-choice.\nThe woke backlash against Butker was predictably loud and immediate. The disapproving news media trotted out all the usual terms such as “polarizing” and “controversial” which signal that someone has dared to challenge left-wing orthodoxy. The GLAAD bullies naturally (and falsely) dismissed Butker’s speech as being “woefully out of step with Americans about Pride, LGBTQ people and women.” In fact, the speech was out of step only with the cultural elites, who are the ones that are out of step. The majority of Americans are demonstrably fed up with the celebration of queer lunacy being mandated by no less than the White House regime itself.\nThe usual hysteria prevailed in the media. A Kansas City female sports anchor unloaded with an on-air monologue in which she linked Butker to the Nazis, urged that he be “blacklisted” for “espousing the greatest hits of bigotry, antisemitism, misogyny, homophobia [and] anti-diversity,” and claimed hilariously that he “isn’t nearly the talent or the star Colin Kaepernick once was” (Butker is a 3-time Super Bowl champion, the NFL’s leading scorer in 2019, and the league’s all-time #2 in career field goal percentage; Kaepernick is a GQ cover model).\nThe left-wing The Nation published a piece titled, “Harrison Butker Is a Jerk, a Bigot, and a True Representative of the NFL.” HuffPost opinion editor Stephen A. Crockett huffed illiterately, “WTF is wrong with this guy? No, seriously, WTF is wrong with him?” Crockett then took the expected racist jab, calling Butker “a White man who is afraid of losing.” Sounds like it’s the HuffPost editor who is the one afraid of losing.\nCancel culture hall monitors also signaled their pearl-clutching umbrage with a Change.org petition calling on the Chiefs to “dismiss” Butker for “making several dehumanizing remarks” which “reinforce harmful stereotypes that threaten social progress.” The petition painting Butker as a serious obstacle to the evolution of our species has garnered over 215,000 signatures so far.\nAs you would expect, the miserable propagandists of ABC’s daytime chatfest The View slammed Butker, although to be fair, co-hostess Whoopi Goldberg at least defended his freedom of speech: “Listen, I like when people say what they need to say. He’s at a Catholic college. He’s a staunch Catholic. These are his beliefs and he’s welcome to ’em.”\nThe usual social media outrage included even an attempted doxing. The official X (formerly Twitter) account for the city of Kansas City posted a tweet which read, “Just a reminder that Harrison Butker lives in the City of [redacted].” What is the purpose of such a message if not to send a dog whistle to progressive shock troops to target Butker and his family at home with harassment and worse? This totalitarian tactic – using social media to organize the cancel culture mob to swarm and threaten political opponents into silence – is standard in leftist political activism.\nMissouri Attorney General Andrew Bailey announced an investigation under the Missouri Human Rights Act into the doxing. “My office is demanding accountability after Kansas City doxxed Harrison Butker last night for daring to express his religious beliefs,” Bailey declared, issuing a formal demand to the K.C. mayor for the immediate release of all documents and communications related to the tweet. “I will enforce the Missouri Human Rights Act to ensure Missourians are not targeted for their free exercise of religion.”\nIn the face of all this left-wing noise, the NFL could have made a principled stand of the right sort, but its cowardly woke leadership instead felt compelled to issue a statement distancing itself from Butker’s “dehumanizing” rhetoric. NFL Senior Vice President and Chief Diversity and Inclusion Officer Jonathan Beane sniffed that Butker’s views “are not those of the NFL as an organization. The NFL is steadfast in our commitment to inclusion, which only makes our league stronger.”\nTo be clear, the NFL’s actual commitment is to merit, not inclusion for the sake of diversity. Not a single person’s job in the National Football League (except perhaps Chief Diversity and Inclusion Officer, a position that shouldn’t even exist) is safe if he doesn’t demonstrate winning excellence under pressure.\nThis is the same NFL, you will recall, that never issued a statement distancing itself from cop-smearing, communist revolutionary, national anthem kneeler, and professional race hustler Colin Kaepernick, whose adverse impact on the league’s ratings was substantial as American football fans quit the game in disgust over his anti-American politicizing of the sport.\nCatholic League President Bill Donohue responded with both barrels to the NFL statement. “Make no mistake,” he wrote online, “the war on Butker is driven by anti-Catholicism.” He added, “Had [Butker] endorsed transgenderism, or Hamas, he would now be praised to high heaven.” We all know that Donohue speaks the truth about that.\nIn a subsequent letter to NFL Commissioner Roger Goodell regarding the controversy, Donohue wrote,\nYour credibility has long been shot…There is no question that you would veto any decision to give a platform to a group that celebrates gay bashing. But when it comes to allowing a group that bashes Catholics, you are okay with it.\nHarrison Butker speaks for millions of Americans, not all of whom are Catholic. The contempt you have shown for him, Benedictine College and Catholicism is repugnant.\nDonohue signed off by calling Goodell “a classic phony.”\nSo the cultural elites and their whiny minions made their displeasure about Butker’s speech heard. But defenders were legion, including female college graduates and working women. Tavia Hunt, wife of the Chiefs’ CEO, said, “Affirming motherhood and praising your wife, as well as highlighting the sacrifice and dedication it takes to be a mother, is not bigoted.”\nCrisis, an online Catholic magazine, put its proud defense of the Chiefs kicker right there in a headline: “Harrison Butker for President.”\nThere has been a swelling tide of grassroots support for Butker. His #7 jersey, for example, has become the highest-selling Chiefs jersey – topping even those of superstar teammates Patrick Mahomes and Travis Kelce – and reaching #7 (ironically) in the entire NFL. (Specific sales numbers aren’t available as of this writing, but the jersey’s popularity is no small expression of support – it sells for $130 on the NFL’s online shop.) Significantly, his is the top-selling women’s jersey, suggesting that the only women offended by his “polarizing” speech are the usual minority of very vocal feminists, including this unhinged former Chiefs cheerleader.\nEven Real Time host Bill Maher said he couldn’t see “what the big crime is”: “I can’t express how much this guy is not like me. He’s religious. He loves marriage. He loves kids … And he’s now history’s greatest monster. Again, I don’t agree with much with this guy, but I don’t get the thing.”\nThe uproar over Harrison Butker is evidence that tradition, morality, family, values, and common sense are all making a comeback in America, despite what the cultural elites want you to believe. Progressive madness – from the communist racism of Diversity, Equity, and Inclusion programs to the science denial and child abuse of gender ideology – is on the panicked defensive. All it takes to reverse the death grip progressives have on our culture is for enough Americans to take a stand like Harrison Butker and speak truth to the left’s cultural and political power.\nFollow Mark Tapson at Culture Warrior",
  "word_count": 1899,
  "scraped_at": "2026-02-14T12:41:46.627098"
}