{
  "article_id": "6ae92ce9c5a2",
  "url": "https://thenationonlineng.net/winners/",
  "title": "Winners - The Nation Newspaper",
  "date": "20241227T033000Z",
  "domain": "thenationonlineng.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Editorial\nDecember 27, 2024 by Editorial\nWinners\n- Football brings glory\nTriple awards for Nigerians at the 2024 Confederation of African Football (CAF) Awards in Marrakech, Morocco made a statement about individual performance and teamwork. Ademola Lookman, 27, was named CAF Men’s Player of the Year. Chiamaka Nnadozie, 24, won CAF Women’s Goalkeeper of the Year award for the second consecutive year. Nigeria’s Super Falcons won the CAF Women’s National Team of the Year award, also for the second year running.\nLookman, according to CAF, deserved the honour following “a sensational 12 months with Italian side Atalanta and Nigeria’s Super Eagles.” CAF said it was the first time Nigeria had back-to-back winners in the men’s award since Nwankwo Kanu (1996) and Victor Ikpeba (1997) were honoured almost three decades ago.\nHe is the sixth Nigerian international to win the award, and succeeded fellow Nigerian Victor Osimhen, winner of the award in 2023. Also, he is the first Nigerian player born outside the country to win the award. He said on stage when collecting his award: “Four years ago my career felt down but now I’m here as the best player in Africa.” He added: “Don’t let your failures stop your dreams.” This was a powerfully inspiring message, particularly to Nigerian youths.\nHe described his award as “an incredible achievement,” saying, “It’s not just me but we have a lot of talent, not just in the men’s game but also in the women’s game, and for us to be able to give motivation to the young kids who want to aspire to be like us is the most important, because if we can set a good example, they have good footsteps to walk into.”\nBorn in England to Nigerian parents, he had represented England at under-19 and under-21 levels before switching to Nigeria, making his senior debut for the country in 2022. This was a laudable demonstration of love for his roots. He was in the Nigerian team that were runners-up at the 2023 Africa Cup of Nations. He had played for English sides Charlton Athletic, Everton, Fulham and Leicester City, and German club RP Leipzig before joining Atalanta in 2022.\nRead Also: Families flock Agodi Garden, Ventural Mall, UI Zoo, others to celebrate Boxing Day\nHe won the UEFA Europa League with Atalanta in May, spectacularly scoring a hat-trick in the final against German club Bayer Leverkusen. All eyes have been on him since that magical performance. Significantly, he was the only African on the 2024 Ballon d’Or list and finished 14th in the race to be crowned the world’s best player. Described as a creative, versatile and explosive winger with a keen eye for goal, he is at the top of his game.\nNnadozie, goalkeeper for French club Paris FC and Nigeria women’s national team Super Falcons, had a superlative season for her club, and was named Premiere Ligue Goalkeeper of the Season 2023-24. She joined the French side in 2020, after playing for Rivers Angels in the Nigerian league. Her impressive performances at the FIFA Women’s World Cup 2023, particularly in the Super Falcons’ match against Canada, which ended in a goalless draw and earned her a Player of the Match award, raised her profile at the international level.\nThe record of Nigeria’s Super Falcons makes it Africa’s most successful women’s national football team. It has won an unequaled 11 Women’s Africa Cup of Nations titles; and it is the only African women’s national team that had reached the quarterfinals at both the FIFA Women’s World Cup and the Summer Olympics. Also, it is the only African team that has qualified for every edition of the FIFA Women’s World Cup.\nGlory for the country at the 2024 CAF Awards should inspire the Nigeria Football Federation (NFF), the country’s football governing body, to raise its game. Regrettably, the organisation remains below par, which does not help the advancement of the sport in Nigeria.",
  "word_count": 654,
  "scraped_at": "2026-02-14T12:33:41.106642"
}