{
  "article_id": "6aed77967820",
  "url": "https://www.theguardian.com/politics/2025/mar/08/nigel-farage-feels-real-why-young-british-men-are-drawn-to-reform",
  "title": "  Nigel Farage feels real : why young British men are drawn to Reform | Reform united kingdom ",
  "date": "20250308T073000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Josh is 24 years old and works as a carer. It’s not easy work, but he prefers it to his old job in a supermarket: most of his clients are elderly and “just want someone there with them, because they’re lonely”. In his spare time Josh used to be into boxing. But lately he’s got into politics instead.\nLike many of his gen Z contemporaries, he’s thoroughly disillusioned with the mainstream kind. “The two parties that have been in power for 100-plus years have done nothing. The economy’s a mess,” he scoffs. But if he sounds like the kind of anti-establishment young person who once rallied to the radical left, Josh’s frustration has taken him in another direction. An ardent leaver in his teens, who backed Boris Johnson in 2019, he now belongs to Nigel Farage’s Reform UK.\nWe meet in the packed bar of the Athena theatre in Leicester, alongside about 900 people who have paid £15 and dodged a noisy counterprotest to see their hero in the flesh at Reform’s East Midlands rally. Their reward is nearly three hours of speakers attacking small boat crossings, “woke” ideology and grooming gangs raping and trafficking young girls.\n“If you don’t want to respect our history, our heritage, our way of life, our laws, then clear off,” barks Reform MP Lee Anderson, as burly men ferry pints from the bar. Andrea Jenkyns, the ex-Tory MP who defected to Reform, says her seven-year-old wants to join, and implores parents to sign their adult children up. Throughout the night, someone keeps heckling “Listen to Tommy Robinson!” (the jailed far-right thug Stephen Yaxley-Lennon, whom Farage has consistently frozen out).\nSpeeches are high on energy and emotion, switching in tone from end-of-the-pier-show jokes to rabble-rousing: by the time Farage himself begins glad-handing his way through the crowd, the adrenaline is pumping. Pyrotechnics explode at his feet and the bass is turned up chest-poundingly high. Like Donald Trump, he’s learned to dish up politics as entertainment.\nWhat attracted Josh, he explains, is that Reform have never been in power, so they haven’t been tried and seen to fail. But he also thinks they’re “the only party standing up for British values”, criticising what he sees as mainstream parties’ attitude to British history and tradition. He didn’t go to university, but seems suspicious of what might have happened there: “There need to be more safeguards to stop lecturers from putting their own worldview on to students.”\nJosh is articulate, polite and unusually formally dressed for his age, in suit and tie: he’s interested in becoming an MP. But he’s perhaps less confident than he sounds. “I’m quite an introverted person,” he concedes. When I ask what his friends think about Reform, Josh says he’s “hovered around a few friendship circles” lately. Most of his mates are either leftwing or not interested, but he’s found a new community on TikTok. Josh flips open his iPad to show me the account he runs for his local Reform branch, with 125,000 followers – more than the Conservative party’s official national account, though less than the 1.2 million following Nigel Farage’s chirpy, laddish feed. “The Conservatives or Labour feel like they’re reading from a script. They feel like AI almost,” he explains. “Nigel Farage feels like a normal person. He feels real.”\nJosh’s peers are still significantly more likely to vote Labour, Green or Liberal Democrat than Reform (only the Tories did worse among this age group at the last general election). In Leicester, there were more young people outside waving pro-refugee placards at the protest than inside listening to Farage denounce immigration numbers. But the erstwhile party of grumpy old men is seemingly catching gen Z’s imagination. Young men were twice as likely as young women to vote Reform at the general election, according to the pollsters YouGov (young women were more likely to go Green). Though this is a fickle and wildly volatile demographic, and so small it’s hard for pollsters to capture its views accurately, Reform’s vote share among under-24s of both sexes swung from 9% last summer to 19% at its peak in January, mirroring a global swing to the populist right.\nIn last summer’s European elections, almost a third of French voters under 34 backed the far-right National Rally, whose 29-year-old president, Jordan Bardella, looks like a boyband member and is big on TikTok. Germany’s recent election saw young voters continuing to move to the political fringes: in the 18-24 bracket, the far-right AfD came out second with 21%, after Die Linke with 26%. Most striking of all, last November over half of American men under 29 chose Donald Trump over Kamala Harris. The hard right seems to be profiting not just from frustration with economic stagnation but from a male backlash against the socially conscious, overtly feminist culture in which gen Z grew up.\n“There’s an awakening in a younger generation who have had enough of being dictated to,” Farage declared last year. Society was stopping young men being young men, he said, and “if no other politician is willing to reach out to this group of people, then I will.” But is that really what young men want?\nMike Nicholson has learned to expect sullen faces and folded arms when he enters a classroom. “They’re like, well, this is all going to be woke rubbish,” he says, ruefully. A former English teacher, Nicholson now runs Progressive Masculinity, which organises workshops for teenage boys in British secondary schools exploring positive ways to be a man. Teenagers so rarely hear the word “masculinity” without “toxic” attached, he explains, that they’re expecting a lecture. Once they realise they can talk freely, they barely stop.\n“Every week we hear boys saying they’re unseen, not heard, frustrated. One really articulate 13-year-old, a white working-class boy, said to me that almost every social group has a movement, like Black Lives Matter or #MeToo or LGBTQ+. And he said it was good they had it, but that ‘we don’t see anything like that for us’.”\nThe boys he meets often seem immature for their age, he says, possibly reflecting the impact of lockdown on their social skills; they’re also increasingly conscious that they can’t afford the expensive trainers and other status markers modelled by their favourite YouTubers. Nicholson says most havemoved on from Andrew Tate, the misogynistic influencer facing charges of rape and trafficking in Romania. (Farage once called Tate “a very important voice” for men, while conceding some of his content was over the top.) But Tate has spawned endless imitators online, preaching the “manosphere” gospel that being a real man means getting rich, pumping iron, parking your Bugatti outside your penthouse and treating women like property. It’s a far cry from what awaits boys in real life, where youth unemployment is rising, over a quarter of 24- to 29-year-olds still live with their parents, and girls have minds of their own.\nBoys often complain, Nicholson says, about getting suspended from school for saying “what you really think”. But in the workshops they’re encouraged to voice their worst thoughts, which facilitators can then unpick.\nThough Nicholson notes “a shift towards rightwing views”, mostly he finds boys switching off from politics completely. When they’re asked to rank a selection of men by perceived status, Rishi Sunak (when prime minister) and now Keir Starmer get shoved to the bottom. “We’ll say, ‘If masculinity is defined by power, he’s the most powerful man in the country!’ But they’re really disillusioned with the political process.” It’s a reminder that far more young men don’t vote at all than vote Reform.\nGeoff Norcott, the right-leaning comedian and host of the political podcast What Most People Think, argues that turning to Farage, Tate or Trump is a symptom of deeper problems in boys’ lives. He’s frustrated that it’s taken a populist backlash for issues such as male suicide rates or boys’ educational underachievement to get attention: “It seems so nakedly transactional – ‘I give a shit because you might vote for this thing I don’t like.’”\nYoung men, he thinks, are struggling to find their feet in a world in which the girls who have long outstripped them in exam results are now in some cases out-earning them. (Among under-30s, the pay gap is only 2.25%, though it rises in age groups associated with having children.) Boys fear being unable to acquire the trappings they think will make them attractive and some are, he thinks, channelling that anxiety into unhealthy body images, bulking and shredding to fit some punishing social media-inspired aesthetic. “I know a lot of mates with teenage sons and the amount of time they spend on their physiques is a concern.”\nBut talking about male vulnerability, he argues, too often invites counterarguments about how tough girls still have it, as if both things couldn’t simultaneously be true. “There’s a feeling that if women have problems, it’s because of something society does to them, but if boys have problems, it’s something they do to themselves.”\nAs a middle-aged man who grew up in an era of more entrenched chauvinism, the idea of male privilege makes some sense to Norcott. “I can look at moments in my life and see it has existed,” he says. “But young males haven’t grown up with this stuff, so it doesn’t make sense to them.”\nOn the face of it, Reform simply offers angry young men someone to blame. Can’t afford to move out of home? Blame competition from immigrants, supposedly pushing up rents. Can’t get into a good university, or graduate job? Blame competition from foreign students. Can’t get a girlfriend? Blame feminism. But the young men I meet in Leicester seem less angry than nostalgic for a past they’re too young to remember. Above all, they’re desperate for something to feel good about.\nEighteen-year-old Ryan came to the rally because he thinks Reform are “for the younger generation, like me”. His parents were Labour voters but are leaning to Reform and so, he says, are lots of his friends. “Reform is the only party that’s bold enough to make the changes, to turn the country around.” What changes? “It’s a plethora of things but I think the main thing is having a national identity, a real sense of being British – I feel like we’re slowly losing that, with time. At school I especially notice that there’s kind of a bitter taste in the air, in the way the teachers talk.”\nOn the other side of the auditorium I meet Ethan (not his real name), earnest in his blazer and spectacles, who is hoping Reform can reverse what he sees as national decline. “I’m a great history lover. I can look back over the past – the great voices in the second world war – and see a Great Britain. Today when I look around, I don’t.” What distinguishes this from any other conversation with a middle-aged Farage fan is that he’s only 16, and worried he’ll never be able to buy a house.\nIf it seems counterintuitive to hear young people talking like this, then that’s because the “woke youth” stereotype was never accurate, says Paula Surridge, a professor of political sociology at the University of Bristol who has tracked the rise of rightwing populism among the young. “People find it surprising because they think all young people are on the liberal left, but that’s never been true,” she says, pointing out that in every generation some instinctively lean right. “In 2024, if you were a person on the right, you had the Conservatives, who were desperately unpopular, or you had Reform – I don’t think we should be surprised that these young voters who were on the right were more likely to go to Reform.” If anything, Surridge is amazed more didn’t, given young voters’ evident hunger for something more radical than the two big parties – one reason the Greens did even better among this demographic.\nLike every political scientist I speak to for this piece, Surridge warns that the data we have on young male Reformers is still sketchy and prone to error: these are people who are often reluctant to engage in surveys. But it’s not inevitable, she warns, that each new generation of young people will be more progressive than the last. “We have tended to see that, as education levels have risen,” she says, noting that going to university is associated with more liberal views and that student numbers have shot up in the past 40 years. “But the expansion in higher education is largely settled now, so we can’t necessarily expect that change to continue.” And while, for now, young women remain noticeably more liberal, that may not be guaranteed.\nAva is 23, unemployed and exercised about immigration and trans women entering women-only spaces. She spent a lot of last year online, mostly on YouTube, Facebook, Trump’s Truth Social platform and in private groups for far-right women on the messaging app Telegram. In her chosen bubble, Ava was bombarded with news stories about ethnic minority men raping and grooming girls, seemingly designed to trigger her emotions – if she’d had any, for Ava isn’t real. She is an online persona constructed to see “where the algorithm would take” a right-leaning young woman, by 29-year-old British writer Lois Shearing, whose new book, Pink-Pilled, examines women’s involvement in the “alt-right” movement. The results convinced Shearing – who in real life uses they/them pronouns and doesn’t share Ava’s imaginary politics – that Reform could get a hearing from young women, too.\n“I wouldn’t be shocked to see an increase in young women voting for parties like that. I’ve seen even this year a change in how women are talking and communicating online, and I think it’s accelerating,” Shearing says. “This shift we’ve seen where women are getting more liberal is not necessarily going to stick around.” In Europe, Surridge points out, female far-right leaders are actively wooing female voters.\nSo far, however, Reform remains uncompromisingly laddish in tone. “Lovely melons,” Farage smirks to camera as he approaches a fruit stall, in one of his most-viewed pre-election TikToks. It was his 2023 stint on the reality show I’m A Celebrity … that first introduced Farage to a young audience. (He was a surprisingly early adopter of social media, having learned years ago as an MEP that the quickest route to press coverage was saying something calculated to go viral on YouTube.) His team seem to have quickly realised that posts about football, drinking challenges or lip-syncing to Eminem did far better on TikTok than ones attacking the European Convention on Human Rights.\nBut mostly teenagers just seemed fascinated by the incongruity of a 60-year-old politician appearing in their world, like a pensioner bursting into a nightclub. When they realised he did Cameos – video messages recorded by celebrities for money, from a script dictated by customers – a craze developed for getting Farage to deliver birthday greetings peppered with teenage slang, just to watch him say “big chungus”. (If you have to ask, you’re not the target audience.) Before long, Reform was winning school mock elections, while schoolgirls complained about boys cheering and saluting when Farage was mentioned in politics A-level classes.\nFor some of his new fans, the ideological implications of all this were clearly hazy at best. (After one video Farage posted of himself bantering with members of a teenage guitar band led to the boys being abused online, they wrote plaintively on Instagram that “we’re 15, we don’t know anything about politics”.) Even now, his appeal remains hard to separate from teenagers’ love of anything edgy, or of winding teachers up.\n“I think there’s that sense of it being a bit of a laugh, not taking it too seriously – certainly not thinking about it in ideological terms,” says Surridge, who has two teenage sons herself and compares it to previous generations shocking their parents by embracing punk. “For that age group, my experience is everything has to be a joke at some level.”\nBut the one consistent message Farage sends boys is that he’s on their side. When Sunak threatened to bring back national service – which many teens interpreted as being sent to die in some looming world war with Russia – or stop teenagers ever smoking, Farage took the opposite approach. “My advice is completely ignore what you’re being told: have a drink, have fun, have a sense of humour – obviously within reason,” he posted after football fans were warned against getting too boisterous at the Euros. “We’re only here once.” He offers young men a permission to be themselves that is eerily familiar to Trump-watchers.\nRichard Reeves is a British-born former aide to the then British deputy prime minister Nick Clegg, and now runs the Washington-based American Institute for Boys and Men. Three years ago, he was still struggling to find a publisher for his book Of Boys and Men, which warned that young men’s struggles risked being exploited for political gain by the far right. (Though Reeves is a card-carrying liberal feminist, whose book stresses that women still face numerous hurdles in life, he thinks editors were nervous of a book about male disadvantage sparking a backlash.) Then came a string of election results worldwide that made his thesis look uncomfortably prescient, and lately his phone is ringing off the hook.\n“It’s often said elections come down to who would you like to go for a beer with. Well, I think this one was more like who would like to go for a beer with you,” he says of Trump’s victory. While leading Democrats lectured young men on the need to “step up” by electing a female president, Trump’s campaign signalled that men were fine as they were. He surrounded himself with wrestlers and martial arts stars, Twitch streamers and podcasters popular with young men – some reportedly picked by the president’s 18-year-old son Barron. (Farage has similarly popped up on the entrepreneur-friendly Strike It Big podcast, and on the Disruptors with Rob Moore, an eclectic mix of get-rich-quick tips and fringe politics with past guests including Andrew Tate and the conspiracy theorist David Icke.)\nBut the clincher, Reeves says, was Trump’s unfiltered manner. “I think a lot of young men responded to a kind of freedom about it. In the UK you’ve got that great word blokeish; we don’t really have that here in the US.” It’s the same quality Josh described in Farage’s social media post, and it appeals, Reeves thinks, to young men who envy Trump’s willingness to take risks. “A lot of young men are reacting against the idea that they’ve been having to tread on eggshells, they can’t joke, that all this stuff has gone too far. Of course we can have a long argument about whether that’s true … but a lot of them have felt quite tightly wound and fearful.”\nWhen I ask whether he thinks Farage could pull off a Trump-style uprising among British young men in 2029, Reeves says the British left has avoided leaving him an open goal, citing as an example “the fact that [health secretary] Wes Streeting has done a men’s health strategy”. Still, he rattles off a list of what any party keen to attract young men could do: more high-quality apprenticeships because “mainstream education doesn’t seem to work for everybody”, more male teachers to provide good role models and better-paid paternity leave to show fatherhood is valued.\nBut how politicians pitch it matters, he argues. Reeves suspects Trump’s campaign particularly resonated with under-25s raised on lectures about toxic masculinity. “They’re not against gender equality – but they’re over it. They’re over being seen not as having problems, but as being the problem.” Like Norcott, he thinks men’s struggles are too often framed as things that need tackling in order to protect society from them, not for men’s own benefit. “If the best we can offer young men is a way for them not to be poisonous, we shouldn’t be surprised if that’s not a very inspiring message.” And that’s the vacuum into which both Trump and Farage have moved.\nOn stage in Leicester, Farage announces that it’s time to stop talking to the young about four-day weeks, and start talking about getting rich. “We’ve got to encourage young people to work hard – no one succeeds in life without working hard. We’ve got to tell young people we want them to go and make money, to succeed.”\nIt’s a Thatcherite message recast for a modern era of hustle and grind, pitched at young men whose social media feeds are full of crypto bros bragging about making a killing from digital currency and get-rich-quick influencers posting #5amclub selfies from pre-dawn workouts. It’s what the National Rally’s Bardella, who grew up in a tough Parisian suburb, means when he says his life story shows “if you work hard, if you believe in your dreams” they can come true, and what Trump tapped into by launching his own crypto memecoin. It’s selling a fairytale about how to succeed, to a generation that can’t even remember what an economic boom felt like.\nJoseph Boam tells me he is a property developer, who runs two other businesses on the side. He is also only 22, very nervous, and accompanied by his mum, proudly clutching a copy of his speech. Boam only joined Reform last summer, and when he chaired his first branch meeting in December, it was the first time he’d spoken publicly in front of 20 people. Now he’s on stage addressing a packed Leicester auditorium, and will stand as a local election candidate this spring. As a startup party attempting to scale fast from nowhere, Reform offers the ambitious a dizzying rise.\nOn stage Boam is businesslike, praising Reform’s “practical solutions to the issues that matter most” and “values that resonate with the challenges young people face today”. He used to be a Tory, he tells me, but that didn’t work out: “I got treated as if I was just someone to throw away. With Reform, I feel more of an equal.” In the Conservative party, he explains, it could have been years before they let him do much. But “with Reform, they want the youth”.\nHis story fits a clear pattern. Nicholas Lissack is one of the more vocal young Reformers on X, his feed a mix of demands to deport illegal immigrants, pub selfies with his mates and claims to be living through “one of those rare, seismic moments in history where a once-woke generation is finally waking up”. He has said he posted his first pro-Farage video last June, aged 22, and a week later was meeting the leader backstage at a rally.\nThis open-door policy has helped Reform grow a small but noisy online army of influencers tweeting, vlogging, pontificating on GB News and generally ensuring that young right-leaning men (whose political identities are increasingly formed online, not via family and friends) see Reform’s brand first, embodied by someone who looks and sounds like them. (Although maybe not quite like them: for all his talk about backing the “salt of the earth” party, Lissack’s LinkedIn account suggests he attended a fee-paying sixth form college overseas followed by a degree at Durham, a master’s at St Andrews and working as a researcher for journalist Isabel Oakeshott, partner of Reform MP Richard Tice.)\nYet there are risks for Reform in taking punts on young men in a hurry, including that of attracting some for whom they don’t go nearly far-right enough. By last autumn, the first glimmerings of intergenerational tensions were emerging. After October’s big Reform party conference in Birmingham, a young hard-right activist called Connor Tomlinson posted on X that it had “felt like someone trying to start a Trump rally during bingo night at Butlin’s”, complaining that the audience was “boomercore”. Tomlinson, who claims to have been suspended from the Conservative party, posted a video of himself apparently on a fringe meeting panel, demanding “mass deportations” – something Farage had ruled out – to loud applause.\nIs this very volatile, very online demographic – who are used to seeing trends come and go very fast – interested in Reform for the long haul, or, as with Tate, are they already moving on? Even if they have, perhaps their energy and ability to generate attention have already served Reform’s purpose.\nBy the beginning of February, Josh’s branch TikTok account is on a roll, gaining another 12,000 followers. Joseph Boam has made his television debut, on the BBC regional news. Nigel Farage is back to posting on TikTok mostly about immigration, not his Adidas trainers, and views have fallen accordingly. And, after weeks of wildly yo-yoing polling, Reform was averaging around 12% with under-24s, according to YouGov, broadly neck and neck with the Tories again. None of which had stopped the Reform party itself – whose real powerbase (as Surridge keeps reminding me) remains among the middle-aged, not the young – from moving inexorably on up regardless.",
  "word_count": 4176,
  "scraped_at": "2026-02-14T14:15:27.679821"
}