{
  "article_id": "6af19cb0d1e9",
  "url": "https://www.portstephensexaminer.com.au/story/8874137/emergency-services-medal-christine-speers-of-lake-macquarie-ses/?cs=305",
  "title": "Emergency Services Medal : Christine Speers of Lake Macquarie SES | Port Stephens Examiner",
  "date": "20250125T203000Z",
  "domain": "portstephensexaminer.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "They include an SES commander, a disability advocate, a late historian, a Girl Guides manager, an old school referee and more. One of them is a paralympian, another helped build the Stockton bridge. These are the stories behind the people in our community who have are the recipients of this year's Australia Day honours.\nSubscribe now for unlimited access.\nor signup to continue reading\nHow 43 years with the SES has challenged and rewarded Christine Speer\nCHRISTINE Speer has had boots on the ground for some of the worst weather events to hit the state in the past four decades.\nThe NSW State Emergency Service (SES) Lake Macquarie cluster commander has seen firsthand how fires, floods and fierce storms can devastate communities.\nChief Inspector Speer has been challenged by everything from distressing calls during flooding in Lismore to facing her flying fears in a helicopter, but she's also been rewarded with lifelong mates and the knowledge that she's doing good for the community.\nNow, the SES veteran of 43 years has been awarded the Emergency Services Medal in the Australia Day Honours 2025.\nShe told the Newcastle Herald she was surprised but proud.\n\"I was shocked to think that somebody would nominate me because I don't consider that I do anything out of the normal,\" she said.\n\"I've been in the SES for 43 years, and you just do basically what you're trained to do.\"\nChief Inspector Speer and her husband bought a property in Holmesville and had to choose between joining the Rural Fire Service (RFS) or SES.\nHer husband's asthma made the decision obvious, and they signed up with the Lake Macquarie City SES unit.\nChief Inspector Speer has held multiple roles through the decades and is now the local commander of the Lake Macquarie cluster, made up of the Swansea, Cooranbong and Lake Macquarie City units.\nShe's travelled all over the state responding to out-of-area emergencies like the horror 2019-2020 bushfire season, and major events closer to home.\nShe was on the tools during the 2007 storm, which went down in history as the Pasha Bulker storm, and when another terrifying east coast low hit the region in 2015.\nWhen asked what jobs stand out to her, she responds: \"They all do.\"\nChief Inspector Speer didn't love flying when she was asked to jump in a helicopter to be flown from Dubbo into Goodooga to respond to major flooding in 2012.\nShe arrived to find the local SES unit had only opened a week earlier with seven members, and she ended up working as second-in-charge of the air base.\n\"It's always interesting,\" she said.\n\"They don't put you into something they don't think you can handle ... some people have more faith in me than I do.\"\nChief Inspector Speer arrived in Lismore ahead of devastating flooding in 2022 and was on night shift when it hit.\n\"I can't remember how many nights in, but looking at some of the calls got to be a bit distressing,\" she said.\nChief Inspector Speer's prestigious award acknowledges her distinguished service in an emergency field in Australia since September 1981.\n\"I liken it to going to the gym - you get used to going and it's just a habit,\" she said.\n\"There's a lot of camaraderie within each of the units, within the cluster, within the zone, within the state.\n\"It has its ups and downs like everything, but it's something good for the community.\"\nLeading Australian historian who uncovered uncomfortable truth honoured\nSHE was a pioneer of Indigenous history, colonisation and women's studies, a globally eminent scholar with an academic career that spanned six decades and produced a \"nation defining\" digital massacre map that changed the way many Australians think about their history.\nAnd now the late Emerita Professor Lyndall Ryan AM is joining an elite group after being posthumously appointed an Officer of the Order of Australia (AO) as part of the 2025 Australia Day Honours.\nA renowned University of Newcastle academic, a Conjoint Professor at the Centre for the Study of Violence and the project leader for Colonial Frontier Massacres in Australia 1788-1930, Professor Ryan had a commitment to truth-telling, no matter how uncomfortable or inconvenient.\nAnd, after being a target of the Australian history wars, during which critics downplayed the role of colonial violence in Australian history, this commitment included world-leading research into colonial frontier massacres in Australia, which was concentrated into an online \"massacre map\".\nThe map helped show that rather than being rare, massacre was a key tool of colonisation and far more extensive than historians had previously realised.\nProfessor Ryan, who died last year at the age of 81, was in 2019 awarded the Member of the Order of Australia for significant services to higher education, particularly to Indigenous history and women's studies.\nAt the time, she described it as a \"major moment in my life\".\nMeanwhile, this year's Australia Day honour focuses on her work on the interactive digital \"massacre map\" and is for distinguished service to tertiary education, particularly Indigenous history and colonial settlement through research and publications.\nBorn in Sydney during World War II, Professor Ryan spent her teenage years on the family poultry farm in the western suburbs.\nHer mother, Edna Ryan, was a prominent feminist who sought equal pay for women.\nProfessor Ryan studied politics and history and was a teacher before she took a job as a research assistant for prolific historian Professor Manning Clark in Canberra from 1966 to 1968.\nShe received a post graduate scholarship and wrote a thesis on the history of Tasmanian Aboriginal people.\nShe then returned to Canberra as a public servant in the Department of Prime Minister and Cabinet's first women's affairs branch.\nFrom there, she joined Griffith University and helped to develop women's studies and Australian studies as majors in the Bachelor of Arts.\nShe moved to Flinders University as one of the first permanent women's studies appointments and stayed to 1998, when she joined Newcastle.\nAs well as being a leading Australian Indigenous historian, Professor Ryan's early research ran in parallel with her involvement in second wave feminism.\nAnd in this arena, she was a founding member of the first Sydney Women's Liberation Group in 1970 and a contributor to feminist publications.\nCoal, water and community - Geoff Sharrock's extraordinary contribution recognised\nGeoff Sharrock has dedicated almost half a century to the Hunter Valley's economic, environmental and social development.\nThe 80-year-old Fordwich resident has been made a Member of the Order of Australia for service to the mining industry and the community.\nAfter completing degrees in geology and economics in Sydney, the Hunter's rapidly expanding mining industry was a natural fit.\nMr Sharrock led some of the region's largest mining projects during the 1980s and 90s, including the former Bayswater Colliery near Muswellbrook.\nThe mine was quickly running out of coal when he arrived in 1981.\nUnder his leadership, a new exploration licence was granted, and by the time he left a decade later, the mine was evolving into what would become Mt Arthur Coal.\n\"It was a great place to work. In the time that I was general manager we didn't have one strike,\" Mr Sharrock Recalled.\nHe was also instrumental in having coal research funding managed by the industry rather than the government.\nThis involved establishing the Australian Coal Industry Research Program. Since its establishment in 1991, the program has helped allocate $447 million to research across Australian universities and research organisations.\n\"It has shown the wisdom of pooling funds rather than distributing them from government. It has achieved wonderful things for the industry,\" Mr Sharrock said.\nAnother standout achievement in a career that boasts many has been Mr Sharrock's involvement in the Australasian Institute of Mining and Metallurgy.\nSince joining as a student in 1968, Mr Sharrock has held almost every role in the prestigious professional association including as president between 2013 and 2014.\nHe continues to be an assessor for professionals seeking admission to the institute.\n\"It is definitely one of the most rewarding things I have ever done,\" he said.\n\"To be elected by your peers to lead the organisation was a real honour.\n\"There's 15,000 members and a lot of them are overseas. I visited every branch in Australia as well as some of the overseas ones.\"\nAway from mining Mr Sharrock served as a Singleton councillor from 2004 and 2008. He has also been a Rotary Club member, Rural Fire Service firefighter and chair of Singleton Tourism to name a few of the organisations he has been involved with.\n\"Of course, you can't call yourself a local unless you are born here,\" he joked.\n\"But I love the Hunter and it's been an honour to have been involved in the community in so many ways,\" he said.\nHe became involved in the Broke-Forwich Private Irrigation District in the early 2000s and has been chair since 2015.\nOne of two private irrigation districts in the region, the community initiative funded and constructed the irrigation water distribution system that serves more than 200 vineyards, olive groves, dairy and grazing properties and tourism facilities in the Broke, Fordwich, Bulga and Milbrodale districts.\n\"When there were water cut-backs during the last drought we were able to keep 70 per cent,\" he said.\n\"It's been extremely satisfying to help the price of water down for people who rely on it.\"\nWhile he feels satisfied with his contributions, Mr Sharrock is equally enthusiastic about the region's future.\nHe has no trouble envisaging a post-mining future and the opportunities that it will present.\n\"The mines will definitely close but they won't all close at once because we will need coal mining for decades\" he said.\n\"Eventually, we will have a lot of land that will be mostly rehabilitated that can be turned back to cattle or solar farms, but it will happen over a long period.\"\nAustralia Day award winner helped build Stockton Bridge and the M1 Motorway\nIan Marler worked until he was 80 \"because I bloody enjoyed it\".\nNow 85, Mr Marler said retirement was \"bloody busy\".\n\"We live on three acres and the yard needs maintaining,\" the Maryland resident said.\n\"We do a bit of caravaning, have done a few cruises and I have a big shed with lots of toys.\"\nIn the Australia Day honours, Mr Marler was awarded a Member of the Order of Australia (AM) \"for significant service to surveying, conveyancing and the community\".\n\"I always had an interest in outdoor activities and mathematics, so I became a surveyor,\" Mr Marler said.\nHe started his career with the then Department of Main Roads in Grafton in 1958.\nHe moved to Sydney and worked on the first stage of the M1 Motorway from Hawkesbury River to Mount White. He was required to mark out the route's centrelines before design and construction.\nAfter moving to Newcastle, he worked as supervising surveyor on the Stockton Bridge.\n\"They couldn't pour concrete for the bridge until I checked its position,\" he said.\n\"Occupational health and safety were not a big feature back then. A hard hat was the only safety requirement.\"\nHe didn't like heights and had never worked on a project that size before.\nAfter a short period in Parkes, he resigned from the department and went into private practice in Newcastle.\nIn 1986, he read a news article on conveyancing and thought it sounded interesting.\n\"I believed surveyors could do that,\" he said.\nHe worked with family to establish Conveyancing Services in Newcastle. His wife, sister and brother-in-law joined him in becoming licensed conveyancers.\nHe said conveyancing was \"essentially the process of transferring title from one entity to another\".\nThe surveyors' move into conveyancing attracted opposition from the legal sector, as solicitors had traditionally done this role.\nIn response, Mr Marler joined a group that \"fought tooth and nail to get legislation through parliament\".\nThey paved the way for big change in the sector.\nMr Marler served on various boards and committees in the surveying and conveyancing sector for decades, taking on leadership roles.\n\"A lot of common sense and decency comes into play,\" he said.\n\"At the same time, you've got to have a bit of a firm hand.\"\nIn the community, he was involved with Highfield Group Scouts in the 1980s.\n\"We used to go away on camps and would run discos to raise funds,\" he said.\n\"Working bees to maintain the hall were part of the activities.\"\nMr Marler and his wife were married in 1960. They have three children, six grandchildren and a much-loved kelpie named Lexie.\nA life of helping people with disabilities rewarded for Associate Professor\nJill Duncan's achievements read like a grocery list, but when asked about the highlights, crediting her colleagues and making meaningful change were two of the first things she mentioned.\nAssociate Professor Duncan has been awarded the Medal of the Order of Australia (OAM) for service to tertiary education and to people with disability.\n\"It really is exciting,\" she said. \"Of course, it's an honour, but the thing I think about is so many people have worked with me right through my career.\n\"Although it's a privilege and an honour to have this award, I think about the communities of people that facilitated the work. I could never do any of this on my own.\"\nAssociate Professor Duncan started at the University of Newcastle as a conjoint professor in 2004 before taking a permanent position in 2018. She has been the university's equity, diversity and inclusion lead since 2020 and won an award for that work the same year.\n\"My role is really to ensure all students and staff feel like there's a place for them here,\" she said. \"The university executive has been very supportive in implementing change.\"\nOne change she was particularly proud of was the university's introduction of a chosen name policy.\n\"For people who are transgender and have a previous name associated with a previous gender, sometimes it's difficult for them to change their name,\" she said.\n\"It can be expensive, particularly for students, so we implemented a chosen name policy where people can choose the name on their ID cards. That will cascade down to enrollment and attendance.\"\nAssociate Professor Duncan has experienced hearing loss since adolescence and uses an implant, so digital communication improvements such as video captions have been another positive change.\n\"We're also working on audio descriptions because we have a number of people here at the uni who are blind,\" she said.\nMany of Associate Professor Duncan's achievements relate to her work helping deaf people. She has been a non-executive director with Aussie Deaf Kids since 2013, was a senior lecturer at Royal Institute for Deaf and Blind Children from 2005 to 2014 and co-founded the Australasian Newborn Hearing Screening Committee.\n\"We implemented a committee that investigated universal newborn hearing screening,\" she said. \"That is where every baby is screened at birth for hearing loss. I was the chair of that committee for the first five years and now every state and territory has universal newborn screening.\"\nBut Associate Professor Duncan's work extends beyond deafness. She has helped people with disabilities since her mother suffered a brain injury when she was 13.\n\"My siblings and I became her carers, so I was very much surrounded by disability,\" she said.\n\"I had never heard the word disability before my mother had her brain injury. That put it into my radar and then I developed middle ear pathology which caused the hearing loss.\"\nThe first part of Associate Professor Duncan's career was focused on deafness before she took a role in Victoria reviewing funding for students with disabilities.\n\"That put me in schools and in contact with parents,\" she said. \"It was a very long intensive review of students with disabilities and I became quite fascinated with much broader than deafness.\n\"I love what we call 'wicked problems' and disabilities can have many wicked problems. Not because of the people, they're wonderful, but because of policy and legislation and who has control over those.\"\nShe has been deputy chair of the Disability Council NSW since 2020, a member of the NSW Women's Advisory Council since 2023, an advisory council member of the National Disability Advisory Council from 2001-2003 and a respite foster carer since 2018.\n'Best of the best' referee Gustard honoured for service to rugby league\nThomas Gustard was an old-school rugby league referee who made it clear who was in charge on the football field.\nAnd when Mr Gustard was holding the whistle, it was very much his domain.\nIn 2021, the Country Rugby League Referees Association (CRLRA) described the long-time Newcastle whistleblower as \"the best of the best,\" courtsey of his 16 straight appointments for the CRL Championship final between 1968 and 1983.\nThis weekend, Mr Gustard will receive a Medal of the Order of Australia (OAM) for his 36-year service to rugby league as a referee.\nAfter beginning his involvement in rugby league as a junior player with Waratah-Mayfield, Mr Gustard found his true calling in the ranks of referees.\nHe was a member of the Newcastle Rugby League Referees Association from 1957 to 1988, and during that time he officiated 14 grand finals, and in 1973 he became the first CRLRA member to be appointed to a NSW versus Queensland interstate match at the SCG.\nMr Gustard also served as CRLRA deputy chairman (1982-1993) and vice president (1979-1981) and was made a life member in 1980.\nIn 1971, he became a life member of the Newcastle Rugby League Referees Association and served as president (1985-1988) and vice president (1971-1981).\nWhen the Newcastle Rugby League chose its Team of the Century in 2008, Mr Gustard was named the referee.\nThese days, the 89-year-old watches the National Rugby League on TV at home in Eleebana and admits he's not a fan of modern officiating and the emergence of the video referee.\n\"The players have taken over the game, as far as I'm concerned,\" Mr Gustard said.\n\"All the referees are concerned about limiting penalties, and the players play the ball any way they like.\"\nMr Gustard officiated during arguably the strongest era of the Newcastle Rugby League in the '60s and '70s, when Immortal Johnny Raper and fellow Australian internationals Brian Moore, John Cootes and Alan Thomson played in the competition.\nMr Gustard rated three-time Maitland premiership-winner Terry Pannowitz and Lakes United's Thomson as the best players he refereed.\n\"I've never seen a better tackler than Alan Thomson,\" he said.\nAway from rugby league, Mr Gustard served in the Australian Royal Navy in 1954 in Japan and worked as a motor mechanic, foreman and bus operator with the Department of Road Transport and Tramways for 68 years.\nDisability advocate Samantha Connor awarded AM\nSocial justice and human rights advocate Samantha Connor's decades of service to people with disabilities has been recognised in this year's Australia Day honours list.\nThe Thornton resident has been named a member of the Order of Australia (AM) for significant service to people with disability.\nMs Connor has been a human rights advocate for much of her life, and has held president and vice president roles at People with Disability Australia.\nShe has represented Australia as a delegate at the United Nations, and was involved in getting the Royal Commission into Violence, Abuse, Neglect and Exploitation of People with Disability.\nOriginally from Western Australia, in 2019 when Ms Connor's local MP said some things against having a royal commission into deaths of people with disabilities, she and dozens of other people with disabilities flew to Canberra to demand change.\nThey met with Bill Shorten and Ms Connor said within a day there was a commitment for the royal commission.\n\"It was really one of those really powerful moments in disability rights where people came in and made this huge change,\" she said.\n\"We had disabled people flying all over Parliament House.\n\"It's those sorts of moments that take a really long time to make that kind of change, and I don't know how much we've gotten out of the disability royal commission to be honest but there will be something that's worthwhile and a chance of change.\"\nA proudly 'difficult' woman, Ms Connor said she's no stranger to ruffling some feathers.\n\"Sometimes we're talking about things which are life and death for people with disability, especially around disability care and support, so yeah unapologetically difficult,\" she said.\nMs Connor is a wheelchair user and has muscular dystrophy.\nShe was diagnosed early on in life, but didn't become a wheelchair user until about 40-years-old and has experienced first-hand how people with disabilities can be treated.\n\"I was diagnosed very early but I was a walker until I was about 40, and so I had the experience of being a person who wasn't a wheelchair user, and then as my disability kind of progressed and degenerated then I had this different experience,\" she said.\n\"It's a very strange thing that people look at you differently because of how you move or the way you talk or the way you think, so that changed for me and I think made me more shouty and more difficult because of that.\"\nMs Connor said her advocacy work is about giving a voice to people who don't have one.\n\"It's kind of about having a seat at the table and if they don't give you a seat at the table then we bring our own, or we force our way in,\" she said.\n\"Sometimes you just need to do that to have more of a voice for people who don't have one.\"\nMs Connor is currently a board liaison officer at People with Disability Australia and is on a number of government committees.\nHer subject matter specialty is in prevention of violence against people with disability, neglect and abuse.\nCarol's service to Girl Guides recognised with OAM\nCarol Peterson has empowered hundreds of girls and young women to discover their potential in her role at Girl Guides.\nNow, her decades of service to the organisation has been recognised with a Medal of the Order of Australia (OAM) in the 2025 Australia Day Honours for service to youth, particularly through Girl Guides.\nThe East Maitland resident said she's honoured to be even nominated for the award.\n\"I feel valued by members of the organisation I have happily given a lot of my time to,\" she said.\nMs Peterson was a Brownie Guide and Girl Guide in her youth, and became reacquainted with the organisation as an adult when her daughter joined up.\nShe has now been involved for 32 years as an adult, and has held many roles from unit leader to state board member.\nMs Peterson has been the Coastal Valley Region guide shop manager for the past six years, and has been a leader and district manager at Beresfield-Thornton unit since 2019.\n\"I enjoy providing opportunities for girls and young women that without guides they would not normally have,\" she said.\n\"I have made lifelong friendships, too many experiences to list from unit leader to region events, and national and international jamboree.\"\nFor four years Ms Peterson was the leader in charge of the zoo sleepout which was held at Taronga Zoo, with 1200 girls under her care one year.\nShe has also been the leader in charge of many snow trips to Perisher.\n\"Girl Guides empower girls and young women to discover their potential as leaders of their world, we also provide girls with opportunities to develop leadership skills and to advocate to make their world a better place,\" she said.\nMs Peterson has recently received a Girl Guides Australia Emu Award for her contributions to state projects, and the Flowering Gum award for mentoring adult members. She has also been recognised by The Centre of Volunteering for her work with Girl Guides.",
  "word_count": 3978,
  "scraped_at": "2026-02-14T13:32:07.356372"
}