{
  "article_id": "6afb631dcd18",
  "url": "https://www.atlantamagazine.com/news-culture-articles/2026-atlanta-500-business/",
  "title": "Atlanta 500 Most Powerful Leaders in 2026 : Business",
  "date": "20260201T071500Z",
  "domain": "atlantamagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Banking & Finance | Investment Advisors & Funds | Private Companies | Public Companies | Retail | Technology | Legends\nBANKING & FINANCE\nKevin Blair\nChairman, CEO, and President\nSynovus\nKevin Blair joined Synovus in August 2016 as executive vice president and chief financial officer. He was appointed senior executive vice president and chief operating officer in December 2018 and was named president in December 2019. Blair was elected to the board of directors in December 2020 and became president and CEO on April 22, 2021. He was appointed chairman of the board on January 1, 2023. His financial services career began at Signet Bank in Richmond, Virginia, in 1995 and has included leadership in such areas as corporate strategy, line management, strategic finance, and credit risk management.\nEDUCATION James Madison University, George Washington University (MBA)\nNOTABLE ACHIEVEMENTS Becoming CEO of Synovus Bank, the largest bank headquartered in Georgia. Father of four amazing children, ages 6 to 22. Led $7.2 million United Way annual fundraising campaign in 2020, a record for the Chattahoochee Valley region.\nWHY I CHOSE THIS WORK Banking is a noble profession. We have the opportunity each day to help our clients achieve their financial goals and objectives.\nRaphael W. Bostic\nPresident and CEO\nFederal Reserve Bank of Atlanta\nRaphael W. Bostic is the 15th president and chief executive officer of the Federal Reserve Bank of Atlanta and a member of the Federal Open Market Committee, the monetary policymaking body of the Federal Reserve System. In 2017, he was recognized as a Planning Pioneer by the American Planning Association’s Los Angeles section, and he received an Urban Leadership Award from the Penn Institute for Urban Research in 2011. Bostic serves on many boards and advisory committees, including Georgia’s Partnership for Inclusive Innovation. He previously served as the chair of the board of directors of the United Way of Greater Atlanta and chair of the Metro Atlanta Chamber. Bostic is a native of Delran, New Jersey.\nEDUCATION Harvard University, Stanford University (PhD)\nHOBBIES Birdwatching, sports\nNONPROFITS Affordable housing, Audubon Society, Nature Conservancy, Human Rights Campaign\nBUCKET LIST Visiting the state capitol in Honolulu to complete goal of visiting the state capitol buildings in all 50 states\nMary Beth Coke\nAtlanta Market Executive\nRegions Bank\nMary Beth Coke joined Regions Bank in 2023 and serves as Atlanta market executive and Commercial Banking district director for Georgia and the Carolinas. Regions is a leading regional financial institution serving people and businesses throughout the Southeast, the Midwest, and Texas. Prior to joining Regions, Coke was the head of Georgia Middle Market Banking at Truist. Deeply committed to the Atlanta community, Coke serves as board chair for the Georgia Council on Economic Education, an organization promoting financial literacy and economic education to K-12 teachers and students across Georgia. She also serves on the Woodruff Arts Center board of trustees and the executive committees of the Metro Atlanta Chamber and Georgia Chamber of Commerce among other community roles.\nEDUCATION Georgia Tech\nHOMETOWN Madison, Georgia\nFEW PEOPLE KNOW I’m a ninth-generation Georgian.\nFAVORITE GEORGIA COLLEGE SPORTS TEAM Georgia Tech Yellow Jackets\nFAVORITE ATLANTA PLACE TO VISIT Lullwater Preserve\nCynthia N. Day\nPresident and CEO\nCitizens Bancshares Corporation and Citizens Trust Bank\nCynthia Day provides the vision and strategic direction for Citizens Trust Bank as well as serving on the board of directors of Citizens Bancshares Corporation, the parent company for Citizens Trust Bank. During her tenure, the bank continues to reach milestones including achieving record-level earnings since the inception of the institution. These achievements continue to receive recognition as Citizens Trust Bank has been consistently named one of the top African American–owned commercial banks in the country. In February 2025, the Georgia Historical Society and Citizens Trust Bank unveiled a new historical marker detailing the opening of the bank at the bank’s first branch location. On August 16, 1921, businessmen Heman E. Perry, James A. Robinson, Thomas J. Ferguson, W.H. King, and Henry Dugas (known as the “Fervent Five”), opened Citizens Trust Bank on Auburn Avenue to serve Black Atlantans. Prior to her banking career, Day was an audit manager at KPMG and is a certified public accountant with over 35 years of experience and leadership in the banking and financial sectors.\nEDUCATION University of Alabama\nNOTABLE ACHIEVEMENTS Federal Reserve Bank of Atlanta board of directors (2023)\nKathy S. Farrell\nHead, Commercial Real Estate\nTruist Financial Corporation\nKathy Farrell has more than 25 years of experience in real estate finance and banking, including origination, underwriting, capital markets, workout strategies, and risk management. Farrell has served as head of commercial real estate since 2019, and her responsibilities expanded to include premium finance and structured credit in 2024. Farrell has also served at SunTrust as chief risk officer for commercial real estate, head of the REIT banking group, and REIT senior credit officer. Previously, she was executive vice president and credit executive of commercial real estate for PNC Bank. Active in the community, Farrell currently serves as board chair of the Truist Foundation. While board chair of The Atlanta BeltLine Partnership from 2023 to 2024, philanthropic investments in BeltLine implementation led by Atlanta BeltLine Inc. accelerated, resulting in 85 percent of the BeltLine mainline trail corridor being completed or under construction.\nEDUCATION College of the Holy Cross\nHOMETOWN Bridgeport, Connecticut\nWHAT I’D TELL A RECENT GRADUATE Be patient and work hard at your current job. Careers are a marathon and not a sprint.\nBerwyn James “BJ” Green\nState President, Atlanta Division\nSouthState Bank\nIn 2024, BJ Green joined SouthState Bank as group president for the Atlanta division to oversee the strategic development, growth, and profitability of banking activities in the region. Prior to this position, Green was executive vice president at Cadence Bank. The Greensboro, North Carolina, native has over 30 years of experience in the banking industry (Banc of America Securities, SunTrust Robinson Humphrey, Wachovia). Green is an alumnus of Leadership Georgia’s class of 2012, and is either an active or past board member of the Buckhead Coalition, Rotary Club of Atlanta, Trees Atlanta, Woodruff Arts Center, Georgia Chamber of Commerce, Metro Atlanta Chamber, Kenan-Flagler Business School Alumni Council, and St. Vincent de Paul (SVdP Georgia – Poverty Alleviation).\nEDUCATION University of North Carolina at Chapel Hill, Emory University (MBA)\nFIRST JOB Mowing yards in my neighborhood for $10\nLESSON LEARNED Every time you get promoted it gets harder, not easier.\nFAVORITE PLACE TO VISIT Lake Rabun\nThomas P. Hackett\nChairman and CEO\nTruist Securities\nThomas (Tom) P. Hackett serves as chairman and CEO of Truist Securities, Truist’s full-service corporate and investment bank. Based in Atlanta, he joined Truist Securities in 2008 and has more than 30 years of corporate and investment banking experience. He has been one of the primary architects of a growth strategy that has led Truist Securities to establish itself as a leading player in corporate and investment banking. Hackett has served many leadership roles at Truist Securities and, from 2020 to 2023, was president and chief operating officer, responsible for the Investment Banking, Corporate Banking, M&A, Capital Markets, and Asset Finance organizations. Before Truist, he was managing director of Healthcare at Citi and head of the London office for Prudential Capital Group and held various roles at First Union. He now serves on the Georgia Research Alliance Board of Trustees.\nEDUCATION Auburn University, Emory University (MBA)\nHOMETOWN Minneola, New York\nMOST INSPIRING PERSON Paul Liedberg (maternal grandfather)\nFAVORITE MOVIE The Last Samurai\nHank Halter\nCEO\nDelta Community Credit Union\nHank Halter is an accounting and finance professional with more than 30 years of experience overseeing finance and accounting operations at Fortune 100 companies. Since 2013, he’s served as CEO of Delta Community Credit Union, Georgia’s largest credit union, which was originally established by eight Delta Airlines employees who wanted to ensure their co-workers and neighbors had access to fairly priced credit and celebrated its 85th anniversary in 2025. Halter, a CPA, came to the credit union from Delta Airlines, where he held a variety of roles retiring as its chief financial officer. Previously he worked at American Airlines and Ernst & Young. Additionally, Halter serves on the board of directors of The League of Credit Unions & Affiliates.\nEDUCATION Villanova University, Duke University (MBA)\nREASON FOR CHOOSING THIS WORK I was drawn to the credit union mission. It is deeply rewarding to lead an organization committed to improving people’s financial well-being and strengthening communities.\nTOUGHEST CHALLENGE Leading the credit union through the Covid-19 pandemic, and navigating the consequential economic conditions that challenged the financial markets\nSamantha W. Jones\nRegional President of Georgia\nPNC Bank\nSamantha W. Jones was named regional president of Georgia at PNC Bank after the retirement of Eddie Meyers following a successful 25-year career with the bank. Jones brings to PNC nearly 30 years of experience and impact as a successful financial service executive. She was most recently executive vice president and credit executive for the Commercial Banking Credit Execution team at Wells Fargo, where from her Atlanta home base she oversaw a team of more than 1,000 global employees in support of clients with annual revenues of $10 million to $2 billion. Prior to achieving success in this executive role of global reach, Jones managed the Southern California division for Commercial Banking at Wells Fargo. During her 22 years at the bank, she also served as regional vice president, loan team manager, and relationship manager.\nEDUCATION Spelman College, Wharton School of the University of Pennsylvania (MBA)\nLaura King\nPresident\nGeorgia United Credit Union\nCurrently serving as president alongside longtime CEO Debbie Smith, who is retiring effective Dec. 31, 2025, Laura King is poised to assume the dual role of president and CEO on Jan. 1, 2026. This planned transition reflects Georgia United’s confidence in her visionary leadership and ensures continuity as the organization enters its next chapter. Under the direction of King, who joined Georgia United in 2021, the credit union has achieved double-digit growth in member engagement and launched award-winning digital solutions that streamline access to financial services. Previously, King held pivotal roles at Georgia’s Own Credit Union as senior vice president of Retail, Sales and Digital Delivery and spent 19 years at LGE Community Credit Union, rising to executive vice president and serving as both chief operating officer and chief information officer.\nEDUCATION University of Georgia\nHIDDEN TALENT Organizing chaos. Whether it’s a messy closet or a packed schedule, I’ve got a knack for bringing order.\nWHAT I’D TELL MY 18-YEAR-OLD SELF How we spend our days is ultimately how we spend our lives. Spend them wisely.\nRandy Koporc\nPresident and CEO\nFifth Third Bank Georgia\nRandy Koporc serves as president and CEO of Fifth Third Bank in Georgia, responsible for the growth and strategic alignment of the bank’s commercial, wealth and asset management, and consumer businesses. Under his leadership, the bank has accelerated its growth in the region and worked with many local organizations to strengthen communities in metro Atlanta and beyond. In 2025, Fifth Third Bank celebrated 166.7 years of serving customers. That designation is unique because its name, often displayed as the fraction 5/3, is equal to 166.7 percent. Koporc has been with Fifth Third Bank since 2010; before joining the company, he worked for Wells Fargo. He serves on many boards including the Metro Atlanta Chamber, the Atlanta Sports Council, and the Urban League of Greater Atlanta.\nEDUCATION University of Florida, University of Central Florida (MBA)\nHOMETOWN Orlando, Florida\nFIRST JOB Runway flight crew member for Delta Air Lines in Orlando\nHOBBIES Coaching my kids in baseball, golf, traveling\nFAVORITE ATLANTA PLACE TO VISIT Chattahoochee River\nHodges Markwalter\nCofounder and Chief Revenue Officer\nVIVA Finance\nHodges Markwalter is the cofounder and chief revenue officer of VIVA Finance, a mission-driven fintech company reshaping access to credit for working Americans. Since cofounding the company in 2019, Markwalter has led VIVA’s revenue strategy and played a key role in scaling the business from a concept into a national platform. Before VIVA, Markwalter began his career in investment banking at SunTrust Robinson Humphrey, where he worked in equity capital markets. There, he supported capital raises for public companies and developed a strong foundation in financial structuring, strategic execution, and investor relations. In 2022, Markwalter was included on the Forbes 30 Under 30 list. A born and raised Atlantan and one of five brothers, Markwalter is deeply rooted in the city he now helps serve through VIVA’s mission.\nEDUCATION University of Notre Dame Mendoza College of Business\nREASON FOR CHOOSING THIS WORK I am an entrepreneur at heart and have always dreamed of starting a company. Building VIVA has been a dream not only because of the impact that we have on customers, but also because it is fulfilling to take an idea and turn it into a viable business that employs over 60 people.\nJack Markwalter\nCEO\nVIVA Finance\nAs CEO of VIVA Finance, Jack Markwalter oversees the performance of the portfolio, comanages the product roadmap, and works directly with the finance team to establish and update reporting policies. He built VIVA’s underwriting model from scratch and is experienced in using data analytics platforms such as Tableau and AWS QuickSight in decision making along with a competency in coding languages such as Javascript, Swift, SQL, and React. Markwalter previously worked as the lead analyst managing Third Lake Capital’s consumer finance portfolio. There, he led the growth of TLC’s loan portfolio from $40 million to over $105 million in receivables in a two-year period.\nEDUCATION University of Notre Dame\nNOTABLE ACHIEVEMENTS Forbes 30 under 30; Deloitte Fast 500; Inc. 5000; Inc. Regionals\nHIDDEN TALENT I won a middle school state chess championship.\nFAVORITE GEORGIA PRO SPORTS TEAM Atlanta Hawks\nFAVORITE POWER LUNCH RESTAURANT gusto!\nAlfred L. McRae Jr.\nPresident\nBank of America Atlanta\nAlfred “Al” L. McRae Jr. serves as Bank of America’s leader in the local market, responsible for delivering growth for shareholders, clients, and communities. His leadership includes driving business integration and local market share growth by connecting Bank of America’s capabilities across its eight lines of business to people and companies while deploying Bank of America’s resources to build strong communities. Additionally, McRae serves as managing director and Diverse Segments Business Development executive for Bank of America’s Private Bank. Active in the community, he serves on boards for the Woodruff Arts Center, the Russell Innovation Center for Entrepreneurs, the Georgia State University Foundation, the Georgia Chamber of Commerce, the Children’s Healthcare of Atlanta Foundation, and Central Atlanta Progress. A member of Leadership Atlanta class of 2023, he’s also a member of the Rotary Club of Atlanta, the Metro Atlanta Chamber, and 100 Black Men of Atlanta.\nEDUCATION Georgia State University\nHOMETOWN Dublin, Georgia\nBEST ADVICE RECEIVED Proactively seek out those situations and positions that make you most uncomfortable; that’s where the opportunity for growth and development will reside.\nCharles E. Potts\nExecutive Vice President and Chief Innovation Officer\nIndependent Community Bankers of America\nAs executive vice president and chief innovation officer for the Independent Community Bankers of America, Charles E. Potts drives ICBA’s innovation initiatives and financial technology strategies, working with ICBA leadership to develop impactful, value-added solutions that help community banks seize new market opportunities to meet customers’ evolving financial services needs. Potts previously served as executive managing director at First Performance Global, where he led international business and corporate development activities for its card-control and fraud alert platform. Before that, he served as CEO for NetClarity, a start-up in the University of Florida’s Business Incubation Hub.\nEDUCATION Georgia Tech, Georgia State University, Graduate School of Banking at Louisiana State University\nFIRST JOB My first job was working on my uncle’s farm in Alabama. I spent the summers working with cattle and harvesting crops.\nFEW PEOPLE KNOW I’m an extroverted introvert.\nWHAT YOU’D TELL YOUR 18-YEAR-OLD SELF Buy Apple stock.\nWHO’D PLAY ME IN A BIOPIC David Hyde Pierce\nDavid Preter\nPresident and CEO\nGeorgia’s Own Credit Union\nDavid Preter is president and CEO of Georgia’s Own Credit Union, a $4.3 billion financial services institution. Before assuming his current role in 2011, Preter facilitated growth in the credit union industry by bolstering and executing the strategic plans of several organizations in the Midwest and Southeast. Under his leadership, Georgia’s Own has seen membership grow by 24 percent and assets nearly double. Georgia’s Own Foundation, which Preter created, amplifies the organization’s commitment to the community by empowering local youth.\nEDUCATION University of Missouri\nFEW PEOPLE KNOW Delivering papers at age 13, I learned that if you work harder and longer than others, you get more opportunities and better pay. That worked for my next three student jobs: caddie, fast food cook, and exterminator. It worked in my professional career too.\nFAVORITE MOVIE The Marvel movies\nFAVORITE ATLANTA PLACE TO VISIT The Varsity\nJai Rogers-Thomas\nVice President, Business and Community Development\nDelta Community Credit Union\nJai Rogers-Thomas joined Delta Community Credit Union in 2012 as vice president of business and community development and leads a team responsible for developing business strategies with metro Atlanta companies and executing a comprehensive community engagement strategy to strengthen civic and educational collaborations. Active in the community, Rogers-Thomas serves as board chair for Trees Atlanta and the City Springs Theatre Company and sits on boards for the Greater North Fulton Chamber of Commerce, and Kennesaw State University’s Bagwell College of Education. She is also the recipient of the 2023 Atlanta Business Chronicle Corporate Citizenship Award.\nEDUCATION California State University, Long Beach\nFAVORITE TRAVEL DESTINATION African holiday to Botswana, Mauritius, South Africa, and Zimbabwe\nINSPIRING PERSON My mother always encouraged me to pursue my love of travel by FEW PEOPLE KNOW My twin sister and I have the same first name.\nKatie Saez\nExecutive Vice President and Georgia Regional President\nTruist Financial Corporation\nAs executive vice president and Georgia regional president for Truist Financial Corporation, Saez serves as the senior leader in the Georgia Market, responsible for direction and integrating client management business development efforts with privately-held companies operating in business banking, commercial, middle market, and commercial real estate, as well as nonprofit and governmental entities. A 25-year veteran of the financial services industry, Saez joined Truist (formerly SunTrust) in 2000. Saez is a member of Leadership Atlanta’s class of 2024.\nEDUCATION University of Florida, Georgia State University (MBA)\nFEW PEOPLE KNOW As a child, I earned a black belt in karate.\nINSPIRING PERSON My grandfather who immigrated from Cuba and graduated from the University of Florida\nWHY I CHOSE THIS WORK I was always the banker playing Monopoly as a child.\nJack Sawyer\nChair Emeritus\nCresset Capital\nChair emeritus of Cresset Capital in the Atlanta region, Jack Sawyer is a fiduciary attorney, specializing in trust and estate management, charitable planning, private foundation administration, and family office services. Sawyer, who serves as board chair for Andee’s Army, has served on the boards of several private foundations and nonprofits, including the nsoro Foundation, the Atlanta Jewish Foundation, Open Hand, the Georgia Museum of Art, and the High Museum of Art. He received the American Jewish Committee’s National Human Relations Award in 2011 and has been honored by the Atlanta History Center Swan House Ball, the National Black Arts Festival, Children’s Healthcare of Atlanta, the United Negro College Fund Mayors’ Masked Ball, Tiffany’s Blue Angels, and more.\nEDUCATION University of Georgia, Mercer University School of Law (JD)\nBEST ADVICE RECEIVED Ruth Bader Ginsburg said, “If you want to be a true professional, you will do something outside yourself; something to make life a little better for people less fortunate than you.”\nWendy Stewart\nPresident, Global Commercial Banking\nBank of America\nWendy Stewart is president of global commercial banking for Bank of America and a member of the company’s executive management team. In this role, Stewart oversees one of the firm’s eight lines of business, which delivers integrated financial solutions to public and private companies with annual revenues of $50 million to over $2 billion across middle market banking; real estate; healthcare, education and nonprofits; and dealer financial services. Stewart serves on the board of directors and executive committee for the Metro Atlanta Chamber, the board of directors for Grove Park Foundation, as a director of the Buckhead Coalition, and is a member of the Atlanta Committee for Progress. Stewart was included on Barron’s 2025 list of the 100 Most Influential Women in U.S. Finance.\nEDUCATION Presbyterian College (BS, BA)\nHOMETOWN Raleigh, North Carolina\nFIRST JOB Accessory Lady, also known as a sales associate, at Perimeter Mall\nFAVORITE SPECIAL OCCASION RESTAURANT Le Colonial\nBUCKET LIST Trip to Montenegro and Bosnia\nJustin A. Sullivan\nSenior Vice President and Market Leader\nPNC Private Bank and Hawthorn Family OfficeJustin A. Sullivan helps ensure that clients benefit from a full complement of investment, trust, financial planning, and private banking services to help them achieve their financial goals. He has regularly been featured on local television, national radio, and multiple written publications sharing advice on investments and financial planning and has been recognized and awarded by PNC for consecutive years as a top-performing investment professional. In 2018, he was recognized by InvestmentNews magazine as one of the top 40 financial professionals under 40 years old across the country. He currently serves on boards for the Midtown Alliance and the National Center for Civil and Human Rights.\nEDUCATION University of Pittsburgh\nHOMETOWN Philadelphia\nFAVORITE BOOK Born a Crime: Stories from a South African Childhood by Trevor Noah\nFAVORITE TRAVEL DESTINATION Oktoberfest in Munich, Germany\nFAVORITE ATLANTA PLACE TO VISIT Center for Civil and Human Rights\nTodd Tautfest\nPartner, Managing Director, and Wealth Advisor\nCresset\nTodd Tautfest is a partner, managing director, and wealth advisor for Cresset’s multi-family office in Atlanta. Tautfest has over 30 years of experience in wealth management focused on the unique needs of high-net-worth families and individuals. Prior to Cresset, Tautfest was managing director, Southeast region for Wilmington Trust, where he worked with high-net-worth clients, business owners, foundations, and endowments. He is a member of the Atlanta Estate Planning Council and the advisory board for Open Hand Atlanta. He previously served on boards of the Alliance Theatre, the Atlanta Botanical Garden, and the Museum of Contemporary Art of Georgia.\nEDUCATION The University of Oklahoma\nHOMETOWN Weatherford, Oklahoma\nFIRST JOB Sweeping the floor at Tautfest Furniture & Appliance in Weatherford, Oklahoma\nFAVORITE BOOK The Tipping Point: How Little Things Can Make a Big Difference by Malcolm Gladwell\nBEST ADVICE RECEIVED From my dad: “You spend your life building your reputation and you can destroy it in five minutes.”\nINVESTMENT ADVISORS & FUNDS\nCharles Andros\nPresident and Chief Investment Officer\nBay Point Advisors\nCharles Andros is a founding partner, president, and chief investment officer of Bay Point Advisors, a leading hedge fund specializing in asset-based direct lending, which has deployed over $1.6 billion since its inception in 2012. In his roles, Andros focuses on complex transactions and sectors of the economy that mainstream lenders ignore, and under his leadership, Bay Point has expanded into entertainment financing as Bay Point Media with the growth of production facilities in metro Atlanta. In partnership with Trilith Studios, among pivotal projects to come is the construction and development of the United States Soccer Federation’s new national training center and headquarters, now known as the Arthur M. Blank U.S. Soccer National Training Center, which is expected to open in 2026. Additionally, Bay Point, Trilith, and Four Stones Real Estate partnered to form the Trilith Land Fund to develop more partners and projects in the Fayetteville area. Andros began his career working as a clerk on the floor at the Chicago Mercantile Exchange for an S&P futures pit trader.\nEDUCATION University of Georgia\nHOMETOWN Dalton, Georgia\nNeal Aronson\nFounder and Managing Partner\nRoark Capital Group\nNeal Aronson is founder and managing partner of Roark Capital Group, an Atlanta-based private equity firm that focuses on consumer and business service companies, with a specialization in franchised and multiunit business models in the restaurant, consumer and business services, and health, wellness and fitness, and education and youth sectors. Roark brands generate approximately $94 billion in annual system revenues from 107,500 locations in 50 states and 118 countries. Prior to founding Roark, Aronson was cofounder and chief financial officer of U.S. Franchise Systems. Previously, he was a principal of Odyssey Partners, a principal and general partner at Acadia Partners (now Oak Hill Partners), and subsequently a managing director of a successor company, Rosecliff. He began his career in the corporate finance department at Drexel Burnham Lambert.\nEDUCATION Lehigh University\nAndy Berg\nChairman\nHB Wealth\nIn 1989, Andy Berg and David Homrich cofounded the wealth management firm HB Wealth with the belief that high-net-worth individuals need access to conflict-free financial planning and investment advice. Today, HB Wealth manages over $29 billion for more than 4,600 family relationships nationwide. Serving on several boards including boards for the Atlanta Police Foundation, the Georgia GOAL Scholarship Program, Inc., and the Atlanta Tipoff Club, Berg is also a contributor to financial media and has been quoted in The Wall Street Journal, The New York Times, and elsewhere.\nEDUCATION Purdue University\nHOMETOWN Milwaukee, Wisconsin\nNOTABLE ACHIEVEMENTS Barron’s top independent advisor and Hall of Fame advisor and Forbes Best-In-State Wealth Advisors for high net worth for Atlanta\nHOBBY Golf\nMichael Fierman\nManaging Partner and Co-CEO\nAngel Oak Companies\nMichael Fierman is the managing partner and co-CEO of Angel Oak Companies, a leading firm specializing in mortgage lending and asset management. Under the Atlanta native’s leadership, Angel Oak has become one of the nation’s top nonbank wholesale and correspondent lenders of non-qualified mortgage loans, operating in 46 states and the District of Columbia. Angel Oak Capital Advisors, the firm’s asset management division, manages over $17 billion in assets and has securitized more than $18 billion in non-qualified mortgages. With Fierman’s guidance, Angel Oak Capital Advisors launched a rapidly growing ETF (exchange-traded fund) platform, which has amassed over $1 billion in assets in under two years, with plans to surpass $2 billion by the end of 2025. Fierman also serves as a member of the UGA Terry College of Business Dean’s Advisory Council and the Buckhead Coalition.\nEDUCATION University of Georgia\nINSPIRING PERSON My mother\nHidden talent: I am an instrument-rated pilot.\nWHAT I’D TELL MY 18-YEAR-OLD SELF Don’t chase money. Find your passion and surround yourself with the smartest people you can find. Good things will happen.\nAziz Hashim\nFounder and Managing Partner\nNRD Capital\nAziz Hashim is the managing partner of NRD Capital, a private investment firm he founded in 2014 that invests in companies that offer compelling unit-level economics, as well as in technologies that improve the profitability of operators. Its portfolio includes Experiential Brands, Altitude Trampoline Parks, The Pickle Pad, Harri, and Qu POS.\nEDUCATION University of California, Irvine\nNOTABLE ACHIEVEMENTS UCI Samueli School of Engineering Hall of Fame (2020), Nation’s Restaurant News Power List (2018), Restaurant Business Magazine Power 20 (2018)\nFIRST JOB Burger King\nLESSON LEARNED Have a clear vision of what contribution you want to make in this world, ideally based on your unique skill sets, and then pursue that path with patience, perseverance, and passion.\nDonte Miller\nCofounder and President\nVillage Micro Fund\nDonte Miller is president of the nonprofit Village Micro Fund, which he founded in 2014 with Nathan Jones and Robin McKinnie. The organization offers support and classes to entrepreneurs in underserved communities and uses crowdfunding to invest in small businesses. VMF also created a Worker’s Equity Fund that uses equity investments to turn small businesses into worker-owned cooperatives by selling shares back to employees. Previously, Miller has had work experience at Goldman Sachs, Google, and the Atlanta Micro Fund, and he’s been featured on WABE and in The Bitter Southerner. In 2022, Miller was included on the Forbes 30 Under 30 list.\nEDUCATION Morehouse College\nREASON FOR CHOOSING THIS WORK My late grandmother fed whole neighborhoods. Brilliant hands that could have worn a chef’s whites, earned stars, and commanded kitchens. Instead, she made sandwiches at Subway, one of countless souls whose genius never found its stage, whose gifts were buried in ordinary days. I chose this work to honor all the grandmothers who died as sandwich artists when they were born to be so much more.\nINSPIRING PERSON Ryan Coogler\nDavid Nicholas\nCEO and Founder\nNicholas Wealth Management\nDavid Nicholas is the CEO and founder of Nicholas Wealth Management, a private wealth management firm that helps clients—from families to corporations—navigate the world of financial markets and economics. A sought-after commentator on financial and economic matters, Nicholas has been featured on CNN, CNBC, Fox Business, Fox & Friends, and CBS News.\nEDUCATION Kennesaw State University, University of Georgia (MS)\nHOMETOWN Kennesaw\nREASON FOR CHOOSING THIS WORK My mom was a single mom and raised me and my two sisters. She got very bad financial advice from a financial advisor who didn’t take the time to recommend what was in her best interest. She lost almost all of her retirement savings. I made a promise that what happened to her would never happen to any of my clients regardless of how much they had to invest.\nNOTABLE ACHIEVEMENT Rang the Opening Bell on the New York Stock Exchange to celebrate the listing of our Nicholas Fixed Income Alternative ETF (NYSE: FIAX)\nNONPROFITS My wife and I feel called to help support orphanages in Uganda and Indonesia. Our Hope International takes in disabled orphans in Uganda and cares and provides for them. Mercy Indonesia cares for orphans in extreme poverty and gives them hope.\nDavid Panton\nManaging Partner\nNavigation Capital Partners\nDavid Panton is managing partner of Navigation Capital Partners’ SPAC Operations Group, which is focused on building a diversified portfolio of investments in special-purpose acquisitions companies using three strategies: providing sponsor capital, leading investments in SPAC initial public offerings, and investing in and pricing private investments in public entities for SPACs. Panton is also a cofounder of Navigation Capital Partners and the chair of Panton Equity Partners, a private family office he founded in 2012. A former member of Jamaica’s Senate, Panton is also senior advisor–private equity for CEA Group and an adjunct professor of finance at Emory University’s Goizueta Business School.\nEDUCATION Princeton University, Oxford University (PhD), Harvard Law School (JD)\nHOMETOWN Mandeville, Jamaica\nFAVORITE ATLANTA PLACE TO VISIT Chef Rob’s Cafe & Bar\nRashaun Williams\nFounder and Chief Investment Officer\nHarbinger Sports Partners\nLimited Partner\nAtlanta Falcons\nGuest Shark\nABC’s Shark Tank\nRashaun Williams is the founder and CIO of Harbinger Sports Partners and a guest shark on ABC’s Shark Tank. He is also a limited partner with the Atlanta Falcons and has over 170 investments under his belt with over 50 exits. Williams is the founder of his family office Value Investment Group, and was a general partner in the MVP All-Star Fund. He cofounded venture capital fund Queensbridge Venture Partners where he was an early investor in companies including Robinhood, Coinbase, Casper, Ring, PillPack, Lyft, and Dropbox. Williams started his career at Wall Street firms such as Goldman Sachs, Wachovia Securities, and Deutsche Bank. A member of Kappa Alpha Psi Fraternity, Inc., Williams also serves on the board of directors for The Atlanta Opera.\nEDUCATION Morehouse College\nFAVORITE SPECIAL OCCASION RESTAURANT La Grotta Ristorante Italiano\nGREATEST ACCOMPISHMENT Changing the trajectory of my family in one generation, with my children\nJohn Wright II\nCEO and Managing Partner\nNorthwestern Mutual Goodwin, Wright\nJohn Wright II is CEO and managing partner of Northwestern Mutual Goodwin, Wright, a premier financial planning security firm known for its strong culture and top-tier talent development. Under Wright’s leadership, the firm stewards over $63 billion in life insurance protection and has expanded its investment arm nearly 20 times since 2005. Earning meaningful awards including Most Admired CEO, Best Places to Work, Atlanta’s Healthiest Employers, Wright is also committed to a culture of respect. Giving back is another core value of Wright and his team. Their generosity has supported countless charities, from funding childhood cancer research to supporting veterans. They also founded IMPACT Day, an annual day of service on Martin Luther King Jr. Day honoring his legacy. To date, this day of service has led to thousands of volunteer hours, $250,000 in donations for students and families in need, and dozens of scholarships – creating a lasting community impact.\nPRIVATE COMPANIES\nPaul Brown\nCofounder and CEO\nInspire Brands\nPaul Brown is cofounder and CEO of Inspire Brands, a multi-brand restaurant company whose portfolio includes more than 33,000 Arby’s, Baskin-Robbins, Buffalo Wild Wings, Dunkin’, Jimmy John’s, and Sonic locations worldwide. In 2024, its brands achieved more than $32.6 billion in global system sales. Inspire is supported by 650,000 company and franchise team employees. Active in the community, Brown was named chair of the Children’s Healthcare of Atlanta board of trustees, having served on the board since 2019.\nEDUCATION Georgia Tech, Northwestern University Kellogg School of Management (MBA), Northwestern University McCormick School of Engineering and Applied Science (MA)\nNOTABLE ACHIEVEMENTS International Foodservice Manufacturers Association Silver Plate Award (2018 ), Restaurant Business Restaurant Leader of the Year (2017), Ernst & Young Entrepreneur of the Year Award Southeast (2016)\nCHARITIES Children’s Healthcare of Atlanta, Georgia Tech Foundation, Metro Atlanta Chamber\nAndrew T. Cathy\nCEO\nChick-fil-A Inc.\nAndrew T. Cathy became the third CEO in the history of Chick-fil-A, Inc. in 2021, following in the footsteps of his father, current chairman Dan T. Cathy, and his late grandfather, founder S. Truett Cathy. With extensive experience working in Chick-fil-A restaurants and serving in multiple support center roles, Cathy is committed to ensuring the future of Chick-fil-A as a healthy, purpose-driven, global organization devoted to making a lasting, positive impact on the people and communities it serves. He is a member of Leadership Atlanta’s class of 2020.\nEDUCATION University of Georgia\nMOST INSPIRING PERSON My high school track coach. He made a significant impact on many lives including mine.\nFAVORITE BOOK The Snowball: Warren Buffet and the Business of Life by Alice Schroeder\nSusana Chavez\nExecutive Vice President and Partner\nPark Place\nSusana Chavez is executive vice president and partner at Park Place, a national transportation and real estate company with a strong presence in 18 markets across the United States. At Park Place, which celebrated its 50th anniversary in 2024, Chavez spearheaded a corporate initiative to update the technology of the urban markets and become an industry leader in innovative technology. Her strategic approach resulted in a 50 percent increase in revenues within her sector. Formerly, as general manager of parking operations, Chavez managed teams of up to 550 employees at Hartsfield-Jackson Atlanta International Airport. Parking revenue is the single largest revenue generator at the airport. Over a 29-year period, revenues increased from $12 million to $112 million, with over seven million annual transactions.\nEDUCATION University of California, Berkeley\nNONPROFITS Latin American Association, Atlanta Women’s Foundation, and Families First. Additionally, in 2020, I began picking up trash and cleaning up our neighborhoods, inspired by Ted Turner and others who started the trend. My husband and I pick up trash for one hour daily during our morning walk. I’m also working with Central Atlanta Progress and other organizations, cleaning up trash and planting flowers in an effort to beautify downtown and get to know our neighbors.\nRené M. Diaz\nPresident and CEO\nDiaz Foods\nRené Diaz is president and CEO of Atlanta-based Diaz Foods, a specialty-foods distributor to restaurants and grocers in 28 states, with over 400 employees and sales of $200 million. Diaz Foods was founded in 1980 and is a privately owned company. Diaz has served on the boards of Atlanta Ronald McDonald House Charities, United Way of Greater Atlanta, Leadership Atlanta, and Emory Center for Ethics, among others. Born in Cuba, he came to the U.S. at age six.\nEDUCATION Georgia State University\nNOTABLE ACHIEVEMENTS Georgia Hispanic Chamber of Commerce 50 Most Influential Latinos in Georgia (2018), Big Brothers Big Sisters of Metro Atlanta Legacy Award (2003), Leadership Atlanta class of 1994\nFAVORITE TRAVEL DESTINATION Paris\nHOBBIES Art collecting\nFEW PEOPLE KNOW I used to ride Harley-Davidson motorcycles.\nChristian Fischer\nPresident and CEO\nGeorgia-Pacific\nBorn and educated in Germany, Christian Fischer became president and CEO of Georgia-Pacific in 2017. He previously served as executive vice president of the packaging and cellulose segment, responsible for GP’s containerboard and kraft paper, corrugated packaging, bleached board, and cellulose businesses. He began his career with the company in 1989 as a market pulp sales manager in Europe. Fischer, who serves on boards for the American Forest & Paper Association, the Metro Atlanta Chamber, and The Carter Center, recently announced that Georgia-Pacific is embarking on transforming its iconic 51-story world headquarters and the surrounding city block into a mix of residential living, modern office spaces, retail, restaurants, and a landscaped central plaza for gathering. The proposed development is scheduled for completion in 2027.\nEDUCATION University of Hamburg, University of Düsseldorf\nHIDDEN TALENT I once wanted to become a writer.\nHOBBIES Listening to music, reading, watching movies, traveling, food\nS. Taylor Glover\nPresident and CEO\nTurner Enterprises\nTaylor Glover is president and CEO of Turner Enterprises, a private company that manages Ted Turner’s business affairs. Glover has oversight of Turner Enterprises’ landholdings, financial investments, and business interests, and works closely with Turner’s philanthropic and charitable organizations, serving as an adviser to the boards of the UN Foundation, Nuclear Threat Initiative, and Turner Foundation. Previously Glover, a native of Newnan, was a senior vice president at Merrill Lynch, where he retired after nearly 30 years.\nEDUCATION University of Georgia\nHOBBIES Hunting, fishing, golf\nCHARITIES Chattahoochee Riverkeeper, Woodruff Arts Center, Nature Conservancy of Georgia\nJim Hannan\nPresident and CEO\nKoch Industries Inc.\nJim Hannan was named president and CEO of Koch Industries, Inc. in 2023. Hannan serves on the boards of Koch Industries and several other Koch subsidiaries. Previously, Hannan served as executive vice president and CEO of Enterprises for Koch Industries, overseeing Georgia-Pacific, Infor, Molex, Koch Engineered Solutions, and Koch Investment Group as well as Koch Communications and Marketing, Koch Logistics, and Koch Public Affairs. His career with Koch began in 1998 in Koch Mineral Services where he was chief financial officer prior to being named president of INVISTA Intermediates in 2004. He joined Georgia-Pacific in 2005 as chief administrative officer and was promoted to CEO and president in 2007. In that role, he led one of the world’s leading manufacturers and marketers of tissue, packaging, pulp, paper, cellulose, nonwovens, building products and related chemicals.\nEDUCATION California State University, East Bay\nNOTABLE ACHIEVEMENTS American Jewish Committee National Human Relations Award (2016), Technical Association of the Pulp and Paper Industry PIMA Executive of the Year Award (2015)\nDoug Hertz\nChairman and CEO\nUnited Distributors\nDoug Hertz has been CEO of United Distributors since 1984. Under his leadership, the beverage distribution business has grown to be listed as one of the top 25 private companies in Atlanta. Hertz has demonstrated his commitment to community, having served on many boards including Atlantic Capital Bank, Camp Twin Lakes, Georgia Power, Georgia Ports Authority, Holly Lane Foundation, and the Marcus Foundation. In 2022, Morehouse College elected Hertz to its board of trustees. He has also served as chairman of Children’s Healthcare of Atlanta and is a minority owner of the Atlanta Falcons. A native Atlantan, Hertz began his career with KPMG in New Orleans, working in the accounting and consulting services area.\nEDUCATION Tulane University (MBA)\nNOTABLE ACHIEVEMENT Hertz is chairman of Camp Twin Lakes, a facility he founded in 1989 for chronically ill and disadvantaged children. He also helped engineer the merger of Scottish Rite and Egleston pediatric hospitals to establish Children’s Healthcare of Atlanta, now one of the largest pediatric healthcare systems in the country.\nNatalie Morhous\nCEO\nRaceTrac\nFormerly president of RaceTrac, Natalie Morhous, a third-generation leader in a 92-year-old family-owned business, was named CEO in 2024. Founded in 1934 by Morhous’s grandfather Carl Bolch Sr., RaceTrac is one of the largest family-owned and operated convenience-and-fuel retail businesses in the South. Morhous joined the company in 2012, serving in a variety of roles including vice president of energy dispatch before becoming president in 2019. Previously, she worked as a strategy and management consultant in Washington, D.C.\nEDUCATION Connecticut College, Wharton School of the University of Pennsylvania (MBA)\nHOMETOWN Atlanta\nNOTABLE ACHIEVEMENT Convenience Store Products Retail Leader of the Year (2023)\nFIRST JOB Camp counselor at Westminster Summer Camps in Atlanta\nFarooq B. Mughal\nChairman and Managing Partner\nMughal Strategies Global Partners\nAs chairman and managing partner of Mughal Strategies Global Partners, Farooq Mughal focuses his practice on global public policy, economic development, and international trade negotiations. Since founding the firm in 2008, Mughal has built it into a government relations powerhouse that has come to be regarded as one of the state’s best. As a successful government affairs strategist, Mughal has represented over $950 million in public-private economic development projects. His clients include real estate developers, technology firms, global investors, and world leaders seeking business expansion, investment, and regulatory guidance. In 2022, Mughal, who is a member of Leadership Gwinnett’s class of 2021, was elected to represent District 105 in the Georgia House of Representatives, becoming the first Muslim man to be elected to the state House. Additionally, in 2025, Mughal was appointed to the Gwinnett County Airport Authority.\nEDUCATION Mercer University, Harvard University (Executive Education)\nBEST ADVICE One thing I’ve learned is to stick to your values, always act with integrity, and work on building resilience. It really makes a difference in your life.\nGregg Paradies\nPresident and CEO\nParadies Lagardère\nGregg Paradies is president and CEO of Paradies Lagardère, a leading airport travel retailer and restaurateur in North America with over 700 stores and restaurants in more than 90 airports. With expertise in international, national, and local brands, Paradies Lagardère works with airport, brand, and supplier partners to create memorable and positive experiences for travelers. Paradies is responsible for the company’s overall business and ensuring that it continues its strong tradition of providing exceptional customer service, superior design, and award-winning store and restaurant operations and management.\nEDUCATION University of Texas at Austin\nBEST ADVICE RECEIVED You cannot do wrong by doing right.\nHOBBIES Outdoor sports\nDonata Russell Ross\nCEO\nConcessions International\nDonata Russell Ross is the CEO of Concessions International, a national food and beverage concessionaire that operates and manages facilities in eight major airports across the country. Russell Ross, who has been an integral part of Concessions International’s management team for 42 years and previously served as president, announced her retirement in 2025. She’s also president of the Herman J. Russell Foundation—a family foundation named for Russell Ross’s father, the legendary Atlanta builder—which supports community initiatives and programs focusing on entrepreneurship, youth development, and mentoring. Russell Ross, who was inducted into the Atlanta Convention & Visitors Bureau Hall of Fame, currently serves on the boards of Early Learning Property Management, Russell Innovation Center for Entrepreneurs (RICE), and H. J. Russell & Company.\nEDUCATION University of Pennsylvania\nNOTABLE ACHIEVEMENT One of a handful of African American women leading a food and beverage company\nTyler Scriven\nCofounder and CEO\nSaltbox\nTyler Scriven is cofounder and CEO of Saltbox, an end-to-end logistics enablement network for small businesses. Some of Saltbox’s core offerings include a growing network of modern co-warehousing facilities and a broad range of small to medium-sized business friendly logistics services. Saltbox opened its first co-warehousing facility in December 2019 and now has 11 facilities across the country. Prior to founding Saltbox, Scriven served as the founding managing director of Techstars Atlanta, a global early-stage venture capital investment fund and chief of staff at Palantir Technologies, a big data analytics software provider. In 2024, the Atlanta Business Chronicle recognized Scriven as a Most Admired CEO. Additionally, Scriven is a member of the board of directors of Serenbe Land Corporation.\nEDUCATION University of Virginia\nHOMETOWN Jacksonville, Florida\nFEW PEOPLE KNOW I’m an amateur interior designer.\nFAVORITE POWER LUNCH RESTAURANT The Perlant\nFAVORITE TRAVEL DESTINATION Jamaica\nAlexander C. Taylor\nChairman and CEO\nCox Enterprises\nAlex Taylor is chairman and CEO of Cox Enterprises, a company with 50,000 employees worldwide. Taylor is the great-grandson of former Ohio governor James M. Cox, who founded the company in 1898. As Taylor is charged with guiding the company through some of the most transformative times in its history, core businesses Cox Communications and Cox Automotive lead in the communications and automotive industries. Additionally, Cox Enterprises is a leading investment platform with strategic positions in emerging technologies driving the future of agriculture, renewable energy, healthtech, and public sector software. The private, family-owned company has already invested more than $2 billion in sustainable businesses and technologies.\nEDUCATION Vanderbilt University\nFIRST JOB Reporter for the Grand Junction Daily Sentinel in Colorado\nPUBLIC COMPANIES\nMark Begor\nCEO\nEquifax\nMark W. Begor was named CEO of Equifax and a member of its board of directors in April 2018. During Begor’s tenure as CEO, annual revenue has grown from $3.4 billion in 2018 to a record $5.7 billion in 2024. Also, since 2018, the company has become an industry leader in security, is driving AI innovation, and with its North American Equifax Cloud transformation substantially completed in 2024, is on track to become the only global cloud-native data, analytics, and technology company of its kind. Begor served previously as a managing director in the industrial and business services group at Warburg Pincus. Begor also spent 35 years at GE, most recently as president and CEO of GE Energy Management, and prior to that as president and CEO of GE Capital Real Estate\nEDUCATION Syracuse University, Rensselaer Polytechnic Institute (MBA)\nINSPIRING PERSON I was lucky enough to join GE right out of college as Jack Welch took the helm. My years working for Jack were some of the most incredible learning experiences – both about business and life.\nAdam Chamberlain\nHead of Marketing and Sales North America and CEO\nMercedes-Benz USA\nEffective July 1, 2025, Adam Chamberlain became CEO of Mercedes-Benz USA as well as head of Marketing and Sales, North America. He succeeds Dimitris Psillakis, who transitioned into the role of senior strategic adviser. Chamberlain rejoins Mercedes-Benz with extensive leadership experience across the automotive value chain. Most recently, he served as executive vice president and chief operating officer at one of North America’s largest dealership groups, Lithia & Driveway, where he was responsible for the operational performance of over 300 dealerships across the U.S., overseeing more than $30 billion in revenue. Prior to that, he was president of Aston Martin The Americas. From 2016 to 2021, Chamberlain served at Mercedes-Benz USA as vice president of Sales and Product Management, helping to lead the brand’s retail and product strategy in the dynamic U.S. market.\nTed Decker\nChair, President, and CEO\nThe Home Depot\nTed Decker is chair, president, and CEO of The Home Depot, the world’s largest home improvement retailer with more than 2,300 stores and approximately 475,000 associates. He is also a member of the company’s board of directors. From 2020 to 2022, Decker served as president and chief operating officer and was responsible for global store operations, global supply chain, outside sales and service, and real estate, as well as merchandising, marketing, and online strategy. While he was in this role, the company enhanced capabilities to blend the online and in-store worlds. Decker joined The Home Depot in 2000 as director of business valuation and has held several strategic positions across the company. Previously, Decker worked in business development, strategic planning, and finance at Kimberly-Clark Corp. and Scott Paper Co. and held various corporate finance, lending, and credit positions at PNC Bank. He has extensive international experience, having lived and worked in England and Australia. He currently sits on the Atlanta Committee for Progress board.\nEDUCATION The College of William and Mary, Carnegie Mellon University (MBA)\nEric Hansotia\nChairman, President, and CEO\nAGCO\nEric Hansotia is chairman, president, and CEO of AGCO, the world’s largest pure-play farm equipment manufacturer. Headquartered in Duluth, AGCO is a global leader in the design, manufacture, and distribution of agricultural machinery and precision ag technology, delivering customer value through its brands including leading brands Fendt, Massey Ferguson, PTx, and Valtra. Before his current role, he served as senior vice president and COO. Prior to joining AGCO in 2013, Hansotia had a successful 20-year career working for Deere & Company, where he served in a number of global leadership roles, including a tenure in Mannheim, Germany.\nEDUCATION University of Wisconsin–Madison (MS). The University of Iowa (MBA)\nNOTABLE ACHIEVEMENTS Since becoming CEO in 2021, Hansotia launched a new Farmer-First strategy and has led AGCO’s technology transformation to be the investment of choice for shareholders, partner of choice for farmers, and employer of choice for employees. His results-driven leadership has boosted AGCO’s revenue from approximately $9 billion in 2020 to record results in 2021, 2022, and 2023, before an industry contraction led to lower sales of $11.7 billion in 2024.\nFEW PEOPLE KNOW My graduate school project went to space in the space shuttle.\nJennifer Mann\nPresident, North America\nThe Coca-Cola Company\nIn January 2023, Jennifer Mann became the first woman to serve as president of The Coca-Cola Company’s North America operating unit. In her role, Mann also serves as corporate senior vice president. Mann formerly served as president of Global Ventures, responsible for globally scaling acquisitions and brands, including Costa Coffee and Coca-Cola’s investment in Monster Beverage Corp. Mann has held a variety of leadership and operational roles, having joined Coca-Cola in 1997 as a manager in the National Customer Support division of North America.\nEDUCATION Georgia State University\nHOMETOWN Atlanta\nFIRST JOB Chick-fil-A\nFAVORITE TRAVEL DESTINATION The Bahamas\nFAVORITE ATLANTA PLACE TO VISIT Fox Theatre\nChris Peterson\nPresident and CEO\nNewell Brands\nChris Peterson is president and CEO of Newell Brands and a member of its board of directors. With an extensive background in corporate strategy, financial planning, operations and management, and a deep understanding of the consumer goods industry, Peterson joined Newell in December 2018 as chief financial officer. He was named CFO and president, Business Operations in February 2020 and president and CFO in May 2022. He assumed the position of president and CEO in May 2023. Since joining Newell, Peterson has played an integral role in the company’s turnaround by strengthening financial performance, building operational excellence and a culture of productivity, reducing complexity and transforming Newell’s supply chain capabilities. Before Newell, Peterson was the chief operating officer of Operations at Revlon Inc.\nEDUCATION Cornell University\nHOMETOWN Cincinnati, Ohio\nNOTABLE ACHIEVEMENTS Recognizing Atlanta’s thriving business environment, talent pipeline, and affordable quality of life, I relocated Newell’s headquarters from Hoboken, New Jersey to Atlanta in 2019. I approved an investment in our local communities of $1 million in grants and over $50 million in product donations by 2025. Newell was recognized by Forbes on its list of Best Employers for Women 2023.\nJames Quincey\nChairman and CEO\nThe Coca-Cola Co.\nJames Quincey is chairman and CEO of The Coca-Cola Company. Before becoming CEO in 2017, he led the company’s worldwide operating units as president and chief operating officer. Previously, Quincey was president of Coca-Cola’s Europe Group, comprising 38 countries including the EU, the European Free Trade Association countries, and the Balkans. The United Kingdom native also played a leading role in the merger that formed Coca-Cola European Partners, now the world’s largest independent Coca-Cola bottler based on net revenues.\nEDUCATION University of Liverpool\nHOBBIES I love skiing. My family and I have been going to Colorado for over 25 years.\nFAVORITE MOVIE The Matrix\nFAVORITE ATLANTA PLACE TO VISIT Atlanta BeltLine\nJeffrey Sprecher\nChairman and CEO\nIntercontinental Exchange\nJeff Sprecher is founder, chair, and CEO of Intercontinental Exchange Inc. (NYSE: ICE) and a pioneer of digital networks and the electronification of trading and marketplaces. Reflecting Sprecher’s vision and leadership, ICE, co-headquartered in Atlanta and New York, has grown from a startup in 2000, purely focused on making energy trading transparent, to a diversified, subscription-driven Fortune 500 company with nearly 14,000 employees. From its humble beginnings, a string of innovations and acquisitions quickly followed, beginning with buying the International Petroleum Exchange in 2001, the New York Board of Trade in 2007, Creditex in 2008, the Clearing Corporation in 2009. the Climate Exchange in 2010 and the NYSE itself in 2013. Sprecher became chair of the NYSE following ICE’s acquisition, overseeing a complete overhaul of the Exchange, serving in that role for eight years through 2021. Now in its third decade, the company that Sprecher and his team have built, through organic growth and acquisitions, delivers over $9 billion in annual revenue with market capitalization of $100 billion.\nEDUCATION University of Wisconsin-Madison, Pepperdine University (MBA)\nWill Stengel\nPresident and CEO\nGenuine Parts Company\nWill Stengel has served as president and CEO of Genuine Parts Company since June 2024. He previously held the roles of executive vice president and chief transformation officer, as well as COO, after joining GPC in November 2019. As president and COO, Stengel was responsible for the company’s transformation, operations and strategy as well as all GPC corporate functions. He developed and advanced GPC’s strategic priorities and executed the company’s growth and productivity initiatives. As CTO, he established and led the company’s Transformation Office. Since 2019, GPC simplified its portfolio by selling non-core businesses, attracting and developing talent, accelerating priority growth investments and executing over 300 strategic global acquisitions, including the transformational acquisition of KDG. Prior to joining GPC, Stengel held various roles over his 15-year tenure at HD Supply, an Atlanta-based B2B industrial distributor serving diversified end markets.\nEDUCATION Trinity College, Vanderbilt University Owen Graduate School of Management (MBA)\nCarol Tomé\nCEO\nUPS\nCarol Tomé was named CEO of UPS in 2020, becoming the 12th chief executive in the company’s century-plus history as well as the first woman to hold the top job. Previously, Tomé was executive vice president and chief financial officer of The Home Depot, which she joined in 1995 as vice president and treasurer. A native of Jackson, Wyoming, Tomé began her career as a commercial lender with United Bank of Denver (now Wells Fargo) and then spent several years as director of banking for the Johns Manville corporation. In 2024, Governor Brian Kemp and the Georgia Historical Society inducted Tomé as a modern-day Georgia Trustee, the state’s highest honor recognizing Georgians whose accomplishments and community service reflect the ideals of the founding body of Trustees.\nEDUCATION University of Wyoming, University of Denver (MBA)\nNOTABLE ACHIEVEMENTS At The Home Depot, Tomé helped increase sales almost eightfold to more than $110 billion, and delivered a 450 percent increase in shareholder value.\nRETAIL\nAnn Mashburn\nChief Creative Officer\nMashburn\nAnn Mashburn, chief creative officer of Mashburn LLC, began her career in New York in 1984 as an assistant to Vogue fashion editor and stylist Polly Mellen. She subsequently served as an editor and stylist for Glamour, then as a stylist for J.Crew—where she met her husband, Sid. The couple moved to Atlanta in 2007 and opened the Sid Mashburn men’s shop. Ann served as chief financial officer and chief operating officer during the first three years, and in 2010 she opened the Ann Mashburn shop as a women’s counterpoint. Ann and Sid shops are also in Houston, Dallas, New York City, Washington, D.C., Nashville, and a forthcoming location in Charlotte.\nEDUCATION University of Colorado Boulder\nSid Mashburn\nExecutive Chairman and Designer\nMashburn\nSid Mashburn serves as executive chairman and designer of Mashburn LLC. He began his career in New York as the first men’s designer at J.Crew, and was subsequently recruited to Polo Ralph Lauren. Mashburn went on to serve as vice president of design at Tommy Hilfiger and senior vice president of design at Lands’ End. In 2007 Mashburn and his wife, Ann, moved to Atlanta, where they opened the men’s shop Sid Mashburn. In 2010, they expanded the business with Ann Mashburn, a women’s line and shop, followed by the launch of e-commerce sites in 2011 to serve the brand’s expanding customer base outside of Atlanta. Ann and Sid shops are also in Houston, Dallas, New York City, Washington, D.C., Nashville, Los Angeles, and a forthcoming location in Charlotte.\nEDUCATION University of Mississippi\nTECHNOLOGY\nKabir Barday\nFounder, President, and CEO\nOneTrust\nKabir Barday is the founder, president, and CEO of OneTrust, the AI-ready governance platform utilized by more than 14,000 companies around the globe. Headquartered in Atlanta, OneTrust employs over 2,000 people in 13 offices throughout the world. Since its founding, the company has been awarded over 300 patents. OneTrust has also been recognized in the Forbes Cloud 100 list. Barday sits on the advisory boards for the Future of Privacy Forum, the Center for Information Policy Leadership, the International Association of Privacy Professionals, and Georgia Tech. Additionally, Barday was named to the Aspen Institute’s 2023 class of Henry Crown Fellows.\nEDUCATION Georgia Tech\nMark Buffington\nCEO\nBIP Capital\nManaging Partner\nBIP Ventures\nMark Buffington is the cofounder and CEO of BIP Capital and the managing partner of BIP Ventures. Since its founding in 2006, Mark Buffington has led the venture capital firm to its position as the region’s most active venture capital firm and one of the most recognized brands in venture capital outside of Silicon Valley. He has led investment rounds in more than 80 companies in numerous industries: healthcare, digital media, ed tech, enterprise SaaS, fintech, and advanced computing. Notable investments include Vendormate, Ingenious Med, QA Symphony/Tricentis, PlayOn! Sports, Huddle Tickets, Tropical Smoothie Café, Cypress.io, ConnexPay, REACH Health, Trella Health, Shareholder InSite, and Aspirion Health Resources.\nEDUCATION Georgia Tech Scheller College of Business, Tulane University (MBA)\nLESSON LEARNED In the late 1990s and the early part of the millennium, only a handful of people were talking about “fat tails” – a distribution of stock prices with a higher-than-normal probability of extreme events. Here was the problem: I was putting all my effort into identifying scenarios that were likely to go wrong. I focused on “left side” tails. I shifted my focus and tried to identify “right side” fat tails – extreme positive events. All the work we do at BIP Capital is intended to increase the likelihood of extreme positive events.\nEddie Capel\nExecutive Vice-Chairman of the Board\nManhattan Associates\nEddie Capel serves as the executive vice-chairman of the board at Manhattan Associates. Before stepping into this role in February 2025, he served as president and CEO. Capel also helped lead the company as president and chief operating officer, and previously as COO and executive vice president. Before joining Manhattan Associates in 2000, he held various positions at Real Time Solutions, leading teams that supported the supply chain strategies of companies such as Walmart, Amazon, and J.C. Penney.\nFIRST JOB Pumping gas\nTOUGHEST CHALLENGE Managing through the Covid-19 pandemic\nINSPIRING PERSON Bill Dixon, A former boss\nBUCKET LIST Learning to pole-vault\nWHO’D PLAY ME IN A BIOPIC Bruce Willis\nDavid Cummings\nPartner\nAtlanta Ventures\nDavid Cummings is an Atlanta-based tech entrepreneur who has founded 10 companies collectively valued at nearly $1 billion, including Pardot, SalesLoft, and Terminus. He’s also the founder of the Atlanta Tech Village—the U.S.’s fourth-largest tech hub—and the largest investor in Calendly, the world’s most popular scheduling app. After selling Pardot, he was named Ernst & Young Entrepreneur of the Year and one of the 100 Most Influential Atlantans by the Atlanta Business Chronicle. Cummings is a partner in Atlanta Ventures, which invests in subscription companies in the Southeast. In late 2023, Atlanta Ventures announced the creation of SoDo Atlanta to revitalize South Downtown Atlanta, reimagining more than 50 buildings across at least 16 acres to create a safe, walkable, and livable neighborhood in time for the FIFA World Cup in Atlanta in 2026.\nEDUCATION Duke University\nHOMETOWN Tallahassee, Florida\nFIRST JOB Mowing yards\nLESSON LEARNED The importance of corporate culture and building a great team\nHIDDEN TALENT Wakeboarding and wakesurfing\nAllyson Eman\nCEO\nVenture Atlanta\nAllyson Eman has more than 30 years of experience in marketing, communications, sales leadership, and business development. In 2007, she became executive director for the newly created Venture Atlanta annual conference, and was promoted to CEO in January 2020. Eman has worked with key business leaders across the country and founding organizations—the Metro Atlanta Chamber, the Atlanta CEO Council, and the Technology Association of Georgia—to build Venture Atlanta, which is now the largest venture capital conference in the Southeast, with over 1,500 attendees including venture capitalists, entrepreneurs, and senior business executives. Previously, Eman was senior vice president of marketing and communications for SouthStar Funding, an Atlanta-based wholesale mortgage lender.\nEDUCATION University of Florida\nFAVORITE MOVIE Legally Blonde\nFAVORITE ATLANTA PLACE TO VISIT Ponce City Market\nWHO’D PLAY ME IN A BIOPIC Julia Roberts. People say I look like her—I wish!\nJustin Ferrero\nPresident and Chief Financial Officer\nSharecare\nAtlanta native Justin Ferrero has led financial operations at digital health company Sharecare since its founding in 2010. He’s responsible for technology, finance, corporate development, and strategic partnerships. In 2021, he co-led the execution of the company’s public offering, resulting in its Nasdaq debut with a valuation of nearly $4 billion. Since 2000, Ferrero has worked closely with serial entrepreneur Jeff Arnold, Sharecare’s former chairman and CEO and current executive chairman, overseeing all matters related to finance and corporate development for Arnold’s businesses. During that time, Ferrero raised an estimated $2 billion and has bought, integrated, and built approximately 30 businesses.\nEDUCATION University of North Carolina at Chapel Hill\nFIRST JOB Dishwasher at OK Cafe\nHOBBIES Spending time with my kids, Finn and Banks\nNONPROFIT Casa de Amor, an amazing charity that supports those affected by child abuse and neglect\nJP James\nChairman and Founder\nHive Financial Systems\nJP James is the chairman and founder of the financial technology company Hive Financial Systems. Since its founding in 2017, Hive has achieved exponential growth in profitable enterprise value through proprietary AI risk management of more than $150 million in private lending assets for six lenders and 250,000 microfinance loans and created nearly 400 jobs in Atlanta and internationally. A Senior Fellow at the National War College, James also holds patents, is an author, and lectures on AI at Georgia Tech.\nEDUCATION Georgia Tech\nHOMETOWN Pittsburgh, Pennsylvania\nTOUGHEST CHALLENGE Choosing to stay on the entrepreneurial path after repeated early failures while watching classmates advance quickly in their careers\nFAVORITE ATLANTA PLACE TO VISIT The bamboo forest—tucked away and a bit hard to find—but the calm hits you the moment you arrive.\nGREATEST ACCOMPLISHMENT Weekly one-on-one dates with my five children, plus three annual trips with just me and the older kids.\nPaul Judge\nChairman and Managing Partner\nOpen Opportunity Fund\nPaul Judge is chairman and managing partner of Open Opportunity Fund, a technology venture capital fund focused on investing in and partnering with outstanding overlooked founders. A technology entrepreneur and investor, Judge is cofounder of Pindrop, a provider of voice security for some of the world’s largest banks and enterprises which has received over $200 million of venture capital funding, He is also a cofounder of Greenwood, a fintech company providing banking services for minorities. He previously co-led Panoramic Ventures and TechSquare Labs. He has cofounded three companies that were acquired. He cofounded Purewire which was acquired by Barracuda Networks in 2008. Prior to this, he was the chief technology officer at CipherTrust, which was acquired by Secure Computing in 2006.\nEDUCATION Morehouse College, Georgia Tech (MS, PhD)\nNOTABLE ACHIEVEMENTS Lead inventor of over 30 patents, member of the 2016 class of Henry Crown Fellows and the Aspen Global Leadership Network at the Aspen Institute, Fortune 40 Under 40, MIT Technology Review Magazine Top 100 Innovators Under 35, Black Enterprise 50 Most Powerful Players Under 40, InfoWorld Top 25 CTOs\nLynne Laube\nVenture Partner\nTotal Technology Ventures\nLynne Laube is a founder and CEO with over 30 years of experience building and scaling businesses. She is currently a venture partner at Total Technology Ventures (TTV). Laube is best known as the cofounder and former CEO of Cardlytics, an advertising platform in banks’ digital channels. After taking the company public in 2018, Laube led Cardlytics through numerous accomplishments, including scaling Cardlytics to $300 million in revenue and expanding its reach to over 180 million monthly users, transforming how financial institutions connect with their customers. Before cofounding Cardlytics in 2008 with Scott Grimes, Laube held many positions with Capital One.\nEDUCATION University of Cincinnati, University of Virginia Darden School of Business\nStephen Pair\nCofounder and CEO\nBitPay\nStephen Pair is the CEO of BitPay, the world’s leading provider of bitcoin payment technology. In 2011, Pair cofounded BitPay with Tony Gallippi because he saw bitcoin’s potential to transform payments for businesses and consumers. As CEO, he directs the day-to-day operations as well as the long-term vision of BitPay, from research and engineering to product development and information technology. Pair has over 20 years of experience building software systems in the financial and telecommunications industries. Before founding BitPay, he held various roles including entrepreneur, architect, manager, team lead, and developer. He holds two patents in the field of streaming analytics.\nEDUCATION Georgia Tech\nHOMETOWN Cumming, Georgia\nFIRST JOB Fry cook at Captain D’s\nHIDDEN TALENT Wake-surfing\nFAVORITE MOVIES Star Wars\nFAVORITE ATLANTA PLACE TO VISIT Georgia Aquarium\nHeather Rocker\nPresident and CEO\nWomen in Technology\nHeather Rocker served as the organization’s first executive director from 2007 to 2011. Since then, she has served as CEO of Girls Inc. of Greater Atlanta, where she significantly expanded volunteer recruitment and fundraising. She later transitioned to corporate leadership as managing principal at SEI-ATLANTA. And in 2019, she returned to the nonprofit sector as executive director of the Drupal Association. Most recently, she served as the Global Head of Operations for Amazon’s Alexa Prize program, an AI competition for universities. She returned to WIT as president and CEO in 2023.\nEDUCATION Georgia Tech\nNOTABLE ACHIEVEMENTS Board president, Georgia FIRST Robotics; board member, Tech Association of Georgia Diversity & Inclusion Council, TAG Education Collaborative, and Georgia Tech Alumni Association; Leadership Atlanta class of 2019; Inspirator Category Winner, Turknett Leadership Character Awards\nJustin E. Samuels\nFounder and CEO\nRender-Atlanta\nJustin E. Samuels is a technologist and influencer of all things software engineering and underrepresented groups in technology. Having started one of the fastest growing multicultural conferences in the country, Render-Atlanta (RenderATL), Samuels amplifies the presence of technology in the southern United States while emphasizing culture and inclusion. Launched in 2021, RenderATL is described as a software engineering experience featuring good vibes, great music, and expert speakers on tech, leadership, inclusion, and accessibility. Samuels, who was named as a Black Enterprise magazine 40 Under 40 honoree in 2025, is also a full-time senior engineer and tech lead at Intuit Mailchimp, where he helps empower small and medium-sized enterprises on their marketing platform.\nEDUCATION Mississippi State University\nNOTABLE ACHIEVEMENT RenderATL, an Inc. 5000 company, has become North America’s largest developer-focused technology conference as the company and Atlanta Tech Week recently welcomed 15,000 attendees.\nINSPIRING PERSON Ben Chestnut. Working at Mailchimp with him before the acquisition allowed me to gain valuable insights into what it would require to build a bootstrap juggernaut.\nFEW PEOPLE KNOW I’m a first-generation immigrant by way of my father who is from Montego Bay, Jamaica.\nSanjay Sehgal\nFounder, Chairman, and CEO\nMSys Technologies\nSanjay Sehgal is the founder, chairman and CEO of MSys Technologies—which designs, develops, and manages modern distributed systems and complex ecosystem integrations. An entrepreneur, start-up adviser, and motivational speaker with more than three decades of tech experience, Sehgal also cofounded Pramana, Scentric, iVivity, and acquired tech companies, including Clogeny, Mobinius, and DigiFutura. Recognized as a top CEO in Georgia Titan 100, Sehgal, who is a member of Forbes Business Council, has also received a TiE Atlanta Top Entrepreneur Award.\nEDUCATION University of Delhi\nHOMETOWN New Delhi, India\nHOBBIES Exploring nature and beaches\nHIDDEN TALENT Being an artist—I enjoy singing and dancing.\nFAVORITE BOOK Spiritual Anatomy, Meditation, Chakras, and the Journey to the Center by Kamlesh D. Patel\nNashlie Sephus\nPrincipal AI Tech Evangelist\nAmazon\nNashlie Sephus is the tech evangelist for Amazon Artificial Intelligence (AI) focusing on fairness and identifying biases at Amazon Web Services AI. She formerly led the Amazon Visual Search team as an applied scientist in Atlanta, which launched visual search for replacement parts on the Amazon shopping app in June 2018. This technology was a result of former Atlanta startup Partpic, for which she was the chief technology officer, being acquired by Amazon. Prior to working at Partpic, she worked for Exponent, an engineering and scientific consulting firm, in New York City. Her core research areas were digital signal processing, machine learning, and computer engineering.\nEDUCATION Mississippi State University, Georgia Tech (MS, PhD)\nHOMETOWN Jackson, Mississippi\nFIRST JOB Playing the piano for my church\nFAVORITE ATLANTA PLACE TO VISIT Piedmont Park\nRania Succar\nChief Executive Officer\nIntuit Mailchimp\nRania Succar is Intuit Mailchimp’s chief executive officer and senior vice president of the QuickBooks Money Platform. A strategic leader with a proven track record in driving growth, Succar came to Intuit to build and grow the QuickBooks Capital business, leading the successful launch in November 2017. Today, Succar leads a comprehensive portfolio of money movement businesses at Intuit, including QuickBooks Payments and Mailchimp. In 2021, Intuit acquired Mailchimp, and in 2022, Succar was named CEO after Mailchimp cofounder Ben Chestnut decided to step back from his role. Prior to joining Intuit, Succar oversaw product commercialization and go-to-market strategy for YouTube’s multibillion-dollar advertising business in North America. Succar began her career as an investment banker with Merrill Lynch advising technology companies.\nEDUCATION Harvard University (MBA, MPA)\nNOTABLE ACHIEVEMENT In 2011, a few friends and I cofounded Jusoor. It means bridges in Arabic. The mission is to invest in Syrian youth for a brighter tomorrow. We have provided the gift of education to over 10,000 young Syrians since we established the organization and deployed over $15 million toward the effort.\nMichael E. Tabb\nDirector, Real Estate Services, Americas\nGoogle\nTabb is responsible for Google’s real estate services in the Americas. Before Google, Tabb founded Red Rock Global, making it one of the most creative and successful full-service commercial real estate firms in the United States. Previously, Tabb served as director of real estate asset services for The Coca-Cola Company, where he was responsible for the company’s real estate activities worldwide. Prior to entering commercial real estate, Tabb proudly served the country in the United States Navy as a lieutenant commander in public affairs, and as a surface warfare officer. He deployed to the Mediterranean twice, supporting Operation Desert Storm and serving as an assault boat group commander.\nEDUCATION United States Naval Academy, Wharton School of the University of Pennsylvania (MBA)\nHOMETOWN Oxon Hill, Maryland\nFEW PEOPLE KNOW I am a Lake Charles-trained gumbo maker and lover\nDawn Whaley\nPresident and Chief Marketing Officer\nSharecare\nDawn Whaley has been at digital health company Sharecare since its founding. She participates in the development of the overall corporate strategy and is directly responsible for marketing, strategic partnerships, and business development. In 2021, she helped take the company public at a valuation of nearly $4 billion. Previously, Whaley was executive vice president of marketing and strategic relationships for the website HowStuffWorks, where she helped manage operations and corporate development efforts, including business development and creation and execution of the marketing strategy. Selected as an Atlanta Business Chronicle Women of Influence honoree in 2022, Whaley currently serves on the boards of Forbes Travel Guide and the American Heart Association’s Metro Atlanta Division.\nEDUCATION University of Georgia\nTOUGHEST CHALLENGE Raising my wonderful daughter, Spencer\nFAVORITE ATLANTA PLACES TO VISIT Atlanta BeltLine, Stone Mountain\nLarry Williams\nPresident and CEO\nTechnology Association of Georgia\nLarry Williams is president and CEO of the Technology Association of Georgia, bringing to the job more than 25 years of experience in global branding, international trade and finance, public and industrial policy, and administration and management. As former president and CEO of the Beacon Council, Miami-Dade County’s official economic development partnership, Williams led the creation and execution of a new development framework to help the area grow and secure investments in today’s innovation economy, resulting in $687 million in new investment, 119 company relocations or expansions, and more than 4,500 new jobs. From 2011 to 2014, Williams helped shape Atlanta’s tech sector as vice president of technology development at the Metro Atlanta Chamber.\nEDUCATION North Carolina State University\nFIRST JOB I had a paper route. I learned that I was an independent contractor and had to manage my expenses (costs of the newspapers, rubber bands, plastic bags, etc.), revenue including collections, prompt delivery of service, and customer service.\nJoey Womack\nFounder and CEO\nGoodie Nation\nJoey Womack is the founder and CEO of Goodie Nation, a nonprofit that accelerates relationships for social entrepreneurs and diverse founders, and the founder and CEO of Amplify 4 Good, a mission-driven agency that helps large companies, nonprofits, and government agencies create social impact. With a goal to positively affect 1 billion people by 2039, Womack has worked with clients including Google, Coca-Cola, Hartsfield-Jackson Atlanta International Airport, and Ford Motor Co. He is also the cofounder of the Atlanta Black Tech initiative, serving as colead for the start-ups and K-12 divisions. In 2023, Mayor Andre Dickens presented the TEDx speaker with the Community Icon Award from Google For Startups. The first recipient of this award, Womack also received $100,000 to further his work to support Atlanta’s community of entrepreneurs.\nEDUCATION Florida A&M University (MBA)\nFEW PEOPLE KNOW Both of my parents are from historic neighborhoods in Alabama. My father is from Africatown in Mobile, where the last slaves settled, and my mother is from [Montgomery’s] Centennial Hill, where Martin Luther King Jr. lived while he was at Dexter Avenue Baptist Church.\nJason W. Young\nCEO\nMindBlown Labs Innovation Partners\nJason W. Young is the cofounder and CEO of MindBlown Labs, an Atlanta-based financial wellness innovation lab whose mission is to empower Americans to make better financial decisions and achieve enduring financial wellness as a result. The company partners with financial institutions to develop digital solutions that connect with users on an emotional level, driving positive saving and investing behaviors. The 2024 chair of the board of trustees of the National Endowment for Financial Education, Young was appointed by Barack Obama in 2014 to serve on the newly created President’s Advisory Council on Financial Capability for Young Americans.\nEDUCATION Harvard College\nHOMETOWN Inglewood, California\nWHY I CHOSE THIS WORK My family struggled with money. During my sophomore year in college, those struggles came to a head when, the day after Christmas, my family was evicted. That experience impressed upon me the need to make better financial decisions and help others do the same.\nFIRST JOB I was nine. I assisted a local plumber.\nLEGENDS\nJeff Arnold\nArnold founded WebMD and grew it into a $1 billion revenue company. Next came the Convex Group, a media and internet investment organization that acquired HowStuffWorks, then sold it to Discovery Communications, which helped launch his next venture, Sharecare. In 2021, the company went public. Today, he is Sharecare’s executive chairman and chairman of Forbes Travel Guide. Brent Layton, formerly of Centene Corporation, replaced him as Sharecare CEO in 2024.\nJ. Veronica Biggins\nBiggins is the managing partner of the Atlanta office of Diversified Search. Previously, she served as director of presidential personnel and assistant to President Bill Clinton. She was also vice chair of the U.S. delegation to the United Nations Fourth World Conference on Women in Beijing.\nArthur Blank\nThe cofounder of Home Depot has become an iconic figure in Atlanta since retiring in 2001. The Arthur M. Blank Family of Businesses portfolio includes the Atlanta Falcons, Atlanta United, the Mountain Sky Guest Ranch, West Creek Ranch, and Mercedes-Benz Stadium. In addition, the Arthur Blank Foundation, along with his family’s personal giving, has granted more than $1 billion to charities, primarily in Georgia and Montana.\nDan T. Cathy\nNow the chairman of Chick-fil-A Inc, Cathy was the company’s CEO from 2013 until 2021. The son of Chick-fil-A founder S. Truett Cathy, he cofounded the Same House Inc., which hosts the annual Beloved Benefit in Atlanta to foster greater economic mobility in communities across Atlanta.\nMichael J. Coles\nAfter a career in the clothing business, Coles founded the Great American Cookie Co. with Arthur Karp in 1977. They grew an initial $8,000 investment into the nation’s largest cookie store franchise. He has chaired the Georgia Film Commission and served on the University System of Georgia Board of Regents, the Kennesaw State University Foundation Board, and the Walker School Board.\nLonnie G. Johnson\nJohnson earned his master’s degree in nuclear engineering from Tuskegee University and went on to work for the U.S. Air Force and the NASA space program. Experimenting with high-powered water guns, he invented the bestselling Super Soaker.\nBill Linginfelter\nPrior to his retirement in 2024, Linginfelter was president of Regions Bank. Prior to joining Regions in 2008, the Saint Simons Island native served as Georgia CEO for Wachovia. He is a past chair of the Metro Atlanta Chamber of Commerce, the Georgia Chamber of Commerce, and the Georgia Research Alliance.\nSig Mosley\nAs president of Imlay Investments and then managing partner of Mosley Ventures, Mosley has invested in 120 start-ups since 1990—making him one of Atlanta’s most active angel investors. He helped nurture the city’s technology industry.\nTripp Rackley\nRackley is an accomplished technology entrepreneur. He’s founded multiple successful companies, including nFront, Firethorn, Experience, and Clutch Technologies. He has been inducted into the Bank Technology News Innovators Hall of Fame, the Technology Hall of Fame of Georgia, and the Technology Association of Georgia’s FinTech Hall of Fame.",
  "word_count": 12947,
  "scraped_at": "2026-02-14T12:21:07.057654"
}