{
  "article_id": "6b397d31b413",
  "url": "https://www.rotowire.com/mma/article/draftkings-mma-ufc-314-dfs-preview-91832",
  "title": "DraftKings UFC Picks : UFC 314 DFS Preview & Predictions",
  "date": "20250408T213000Z",
  "domain": "rotowire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UFC 314 DraftKings DFS Preview and Picks\nUFC 314 DFS picks are set for Saturday, April 5, with breakdowns of the top fights on DraftKings and predictions for the key matchups on the card.\nIf you're hoping to turn the event into an opportunity to build your DFS bankroll, DraftKings.com has you covered with a full slate of contests, including a $600k UFC 314 Special with $200k to first place. Players get a $50,000 budget to select six fighters, and the scoring rules are noted at the bottom of the column. Let's get to the action...\nMain Event - Featherweight Championship\nAlexander Volkanovski (26-4-0) v. Diego Lopes (26-6-0)\nDK Salaries: Volkanovski ($8,200), Lopes ($8,000)\nVegas Odds: Volkanovski (-120), Lopes (+100)\nDeciding to move up to lightweight, Ilia Topuria elected to vacate his 145-pound title, opening the door for either Volkanovski or Lopes to claim the belt here.\nVolkanovski will be getting another title shot here despite the fact he's 1-3 in his past four bouts and has just a single win dating back to July 2022. Now, one of those setbacks was a knockout against Topuria, and the other two came against Islam Makhachev -- the best pound-for-pound fighter in the world -- at lightweight, so it's easy to see why the company elected to give Volk the opportunity. He also remains one of the more popular fighters on the roster.\nLopes' ride to the top has been a strange one. He lost to Joanderson Brito on Dana White's Contender Series in August 2021 and dropped a unanimous decision to Movsar Evloev in a Fight of the Night effort in his official company debut in May 2023. He's been extremely active of late, fighting five times since August 2023 and winning each. He two best victories are over Brian Ortega and Dan Ige, but both of them came via decision. He had stopped his prior three opponents. It should be noted that the Ige bout was contested at 165 pounds because Ige literally got off the couch at his home in Vegas and came to the arena to fight.\nI've had a difficulty times deciding just how much upside Lopes truly has. He has an excellent frame for the division at 5-foot-11. He also has legitimate power. Yet, his stoppages have come against lesser opposition, and he has no grappling game to speak of despite getting both Ige and Ortega to the mat once.\nHis defensive grappling in particular is a big concern. He hasn't allowed a takedown in his last four fights, but he gave up four to Evloev -- no shame in that -- and three to Brito on DWCS. Volk isn't that guy, but I'm wondering if opponents that spam takedown attempts against Lopes will have success.\nThe question regarding Alex is this time is whether or not his durability is starting to become a serious issue. He's been knocked out in two straight fights, but he probably shouldn't have been in there with Islam, particularly the second time, and Topuria may very well be all-time good. You can make excuses for both of those performances.\nRecent struggles aside, Volkanovski keeps himself in great shape at age 36 and has always had excellent cardio. Lopes, on the other hand, faded big time late in the Ige fight, dropping the third round on all three scorecards to a guy fresh off the couch. How his he going to look in a five-round fight against a former champion with a full training camp under his belt?\nThe youth and size of Lopes is a concern, and this could very well all blow up in an instant if Volk's durability is shot, but I ultimately think the former title holder can outwork the Brazilian in the championship rounds in what seems to destined to be a close, back-and-forth fight. I like Alex is a tight one.\nUFC 314 DFS PICK: Volkanovski\nInterested in backing this or other selections on sites like PrizePicks? Check out the Best MMA Picks & Prop Bets by comparing lines to our projections using the RotoWire Picks & Props tool.\nCo-Main Event - Lightweight\nMichael Chandler (23-9-0) v. Paddy Pimblett (22-3-0)\nDK Salaries: Chandler ($7,800), Pimblett ($8,400)\nVegas Odds: Chandler (+125), Pimblett (-150)\nSet to turn 39 years old 12 days after this event takes place and the loser of four of his last five fights, Chandler is done in terms of impacting the title picture in a loaded lightweight division. He's lost to Charles Oliveira (twice), Dustin Poirier and Justin Gaethje during that stretch, with the lone win being a knockout over what was left of Tony Ferguson back in May 2022. Now, the first Oliveira fight was for UFC gold and he's earned a $50,000 post-fight bonus in each of his last four bouts (three Fight of the Nights, one Performance of the Night) , so Chandler is still plenty capable of going in there and hanging with the best.\nI still don't think much of Paddy, but he's clearly better than I originally gave him credit for. Pimblett is 6-0 in the UFC (he lost the Jared Gordon fight, but that's a story for another day), with four stoppage wins (three submissions, one knockout) on his ledger. His best victories are over Ferguson and King Green his last time out. Of course, Ferguson was totally finished, and Green gift wrapped the finish for Pimblett a little over three minutes in. Still, Paddy took advantage and did so in impressive fashion.\nPimblett's striking is improving, but Chandler should still have a big edge on the feet, particularly in terms of power. We've never seen any opponent put it on Paddy in terms of stand-up volume. The most significant strikes has absorbed with the UFC was 62 against Ferguson, and Tony couldn't knock out anyone in the latter stages of his career. If Chandler can avoid mistakes and push the pace, I think he can win that way.\nThe issue is that I don't trust Chandler in the slightest to go out and execute a smart game plan. He's overly reckless, and I only expect that to get worse given his advanced age and the fact he's not really in title contention anymore. I think he wants to put on a show just as badly as he wants to win, and that's a dangerous place to be from a betting perspective. I could easily see Chandler doing something dumb and Paddy choking him out, similar to the Green fight.\nAll that said, I don't think I've picked Pimblett a single time, and I'm not changing my tune now. The plus money and discounted price on Chandler was really the difference for me. Based on physical gifts alone, Mike should win, even at his advanced age. I'm hoping for one more mistake-free performance in a big spot.\nUFC 314 DFS PICK: Chandler\nLike this underdog suggestion? Try it out with different lineup combinations on our DraftKings UFC Lineup Optimizer.\nFeatherweight\nBryce Mitchell (17-3-0) v. Jean Silva (15-2-0)\nDK Salaries: Mitchell ($7,100), Silva ($9,100)\nVegas Odds: Mitchell (+225), Silva (-280)\nPart of The Fighting Nerds group that has quickly become the best team in Brazil, Silva will be making his fifth UFC appearance. He's a perfect 4-0 to date, with knockouts over Melsik Baghdasaryan, Drew Dober, Charles Jourdai, and Westin Wilson. Silva has competed at both featherweight and lightweight. His most recent win came over Baghdasaryan in late-February, at which point he immediately called out Mitchell following Bryce's stupid and insensitive remarks on a recent podcast.\nMitchell texted UFC President Dana White that he wanted the fight, and here we are.\nBryce has quietly been really good since arriving on the scene in July 2018. He's won eight of 10 UFC bouts, with the defeats coming against Topuria and a one-punch knockout at the hands of Josh Emmett. His skill set is limited, but he's really good at what he does well.\nMitchell knows where his bread is buttered. He offers next to nothing on the feet, particularly in terms of power, and is entirely reliant on his grappling game for success. Theoretically, he has the type of style I mentioned earlier I think could give Lopes problems if he is able to avoid getting eaten alive in the stand-up.\nBryce is averaging 3.39 takedowns per 15 minutes. He wins with positional advantage, as he averages just 2.31 significant strikes landed per minute and has poor ground-and-pound despite often being on top. If he is unable to get Silva to the mat early and often, he's finished.\nSilva has not been immune to the takedown. Charles Jourdain got him three times on seven attempts in their June 2024 bout, but Jean still won via knockout early in Round 2.\nI keep coming back to the same thing. The Fighting Nerds team has legitimately turned into one of the best camps in the world. Silva is getting elite training every single day with a bunch of stone-cold killers.\nMitchell, on the other hand, doesn't have a team. I'm not joking. He does his own thing in his native Arkansas, training with a few close friends and his cousin, fellow UFC fighter AJ Cunningham.\nWhen push comes to shove, I'm fairly confident the Nerds will have Silva well prepared for Mitchell's grappling-oriented attack. The price tag is too high, but I think there's a better chance of Silva knocking Mitchell out than the latter wrestling his way to a decision.\nUFC 314 DFS PICK: Silva\nFeatherweight\nYair Rodriguez (20-6-0, 1NC) v. Patricio Freire (36-7-0)\nDK Salaries: Rodriguez ($8,700), Freire ($7,500)\nVegas Odds: Rodriguez (-200), Freire (+165)\nThis is an excellent fight and one that will receive extra recognition, as it marks the UFC debut of Freire (aka Pitbull)\nPitbull is a former three-time Bellator Featherweight Champion and former Bellator Lightweight Champion. He's probably the most decorated fighter in the history of that organization, and while it would have been nice to see him join the UFC earlier in his career and not at age 37, there should still be some gas left in the tank.\nFresh off back-to-back stoppage losses to Volkanovski (knockout) and Ortega (submission), Rodriguez needs to find a win here by any means necessary. The Ortega loss in particular was crushing. Yair scored a Round 1 knockdown in that fight but he couldn't get Ortega out of there, and he ended up getting submitted in Round 3 after being dominated the entirety of Round 2. The margin for error here is none.\nPitbull is, and always has been, a remarkably well-rounded mixed martial artist. In fact, of his 36 career wins, he has 12 via knockout, 12 via submission, and 12 via decision. Talk about consistency. He's very much a generalist, but that's not a bad thing, particularly as you age. The power has largely dried up over the past several years, but he's giving up so much size to Rodriguez that he has to be careful with his entries regardless.\nThe size is probably the biggest thing Yair has going for him in this fight. He will enter with a six-inch edge in both height and reach, both extremely notable numbers given Rodriguez's creativity on the feet. He's long and unorthodox and very difficult to train for because there are so few fighters that employ a similar style.\nWe've seen multiple big-name fighters come over from both Bellator and PFL to join the UFC in recent years. Some have had success and others have struggled. In general, I've tried to stay away until we get a better read on their potential at this level. There is a gap between the top tier in the UFC and the top in other organizations.\nRodriguez is the pick simply because of his size advantage and the unknowns surrounding Pitbull, but the latter is talented enough to pull the upset.\nUFC 314 DFS PICK: Rodriguez\nLight Heavyweight\nNikita Krylov (30-9-0) v. Dominick Reyes (14-4-0)\nDK Salaries: Krylov ($8,800), Reyes ($7,400)\nVegas Odds: Krylov (-185), Reyes (+155)\nReyes' career appeared to be over following a four-fight losing streak from February 2020 to November 2022, but the UFC decided to give him another opportunity, and after more than a year and a half on the sidelines, Reyes returned in June 2024 and picked up knockout wins over Dustin Jacoby and Anthony Smith in a span of less than six months. I'm far from confident that this success will continue, but his roster shot is now plenty secure.\nKrylov is in much better shape, having won three straight including two via stoppage, but he's been on the sidelines since March 2023, and even that was a 215-pound catch weight bout. He hasn't had a true fight at light heavyweight since October 2022, a win over Volkan Oezdemir via unanimous decision. Krylov has been with the UFC for two separate stints and has fought multiple current or former UFC champions (Magomed Ankalaev, Glover Teixeira, Jan Blachowicz). He's excellent depth for the 205-pound division.\nA former collegiate football player at Stony Brook University, Reyes is an excellent athlete. He's a fluid striker and moves well. He's one-dimensional offensively in terms of his kickboxing, however, and his chin is a major, major concern. Of those four previously mentioned defeats, the final three were all via knockout. I don't trust his durability in the least.\nKrylov is remarkably well rounded and has multiple ways to win a fight in his arsenal. Of his 30 career wins, a dozen are via knockout and 16 are via submission. He can match the size of Reyes and he has a massive edge in terms of grappling.\nI expect Krylov to try to wrestle. He's averaging 2.29 takedowns per 15 minutes, a reasonable number. That said, Reyes' takedown defense has always been good. He's up at 82 percent, and the only time he's been taken down more than once in a fight was against Jon Jones. I don't expect Krylov to have a ton of success in that area, but one good attempt could be the difference between winning and losing.\nI don't like the price tag in the least, but I don't trust the durability of Reyes, and I expect Krylov to land a few big blows. I'm not sure Dom can handle it. Toss in the grappling edge, and Nikita is the pick. Knockout wins over Jacoby and a soon-to-be-retired Smith don't move the needle for me.\nUFC 314 DFS PICK: Krylov\nOTHER BOUTS\nFeatherweight\nDan Ige (18-9-0) v. Sean Woodson (13-1-1)\nDK Salaries: Ige ($7,700), Woodson ($8,500)\nVegas Odds: Ige (+140), Woodson (-170)\nTHE PICK: Woodson\nWomen's Strawweight\nYan Xiaonan (19-4-0, 1NC) v. Virna Jandiroba (21-3-0)\nDK Salaries: Yan ($7,900), Jandiroba ($8,300)\nVegas Odds: Yan (+125), Jandiroba (-150)\nTHE PICK: Jandiroba\nLightweight\nJim Miller (38-18-0, 1NC) v. Chase Hooper (15-3-1)\nDK Salaries: Miller ($6,600), Hooper ($9,600)\nVegas Odds: Miller (+550), Hooper (-800)\nTHE PICK: Hooper\nFeatherweight\nDarren Elkins (29-11-0) v. Julian Erosa (30-12-0)\nDK Salaries: Elkins ($6,900), Erosa ($9,300)\nVegas Odds: Elkins (+280), Erosa (-355)\nTHE PICK: Elkins\nMiddleweight\nSedriques Dumas (10-2-0) v. Michal Oleksiejczuk (19-9-0, 1NC)\nDK Salaries: Dumas ($7,200), Oleksiejczuk ($9,000)\nVegas Odds: Dumas (+160), Oleksiejczuk (-190)\nTHE PICK: Dumas\nFlyweight\nSu Mudaerji (16-7-0) v. Mitch Raposo (9-2-0)\nDK Salaries: Su ($8,900), Raposo ($7,300)\nVegas Odds: Su (-185), Raposo (+155)\nTHE PICK: Su\nMiddleweight\nTresean Gore (6-2-0) v. Marco Tulio (13-1-0)\nDK Salaries: Gore ($7,000), Tulio ($9,200)\nVegas Odds: Gore (+280), Tulio (-355)\nTHE PICK: Tulio\nWomen's Bantamweight\nNora Cornolle (8-2-0) v. Hailey Cowan (7-3-0)\nDK Salaries: Cornolle ($8,600), Cowan ($7,600)\nVegas Odds: Cornolle (-165), Cowan (+140)\nTHE PICK: Cowan\nNote: All odds accurate as of time of posting, and taken from the DraftKings Sportsbook, if available. Check out DraftKings to bet on MMA Odds and use the DraftKings promo code for a great welcome offer.\nIn search of a new, legal sportsbook? Get in on the action with our best sportsbook promo codes, as well as these selections for the best sports betting sites and sports betting apps.\nDraftKings MMA Scoring\nNote: Scoring has been updated as of early-2021! Please review the scoring changes below.\nMoves Scoring\nStrikes: +0.2 PTS\nSignificant Strikes (SS): +0.2 PTS\nControl Time: +0.03 PTS/SECOND\nTakedown (TD): +5 PTS\nReversal/Sweep (REV): +5 PTS\nKnockdown (KD): +10 PTS\nFight Conclusion Bonuses\n1st Round Win (1rW+): +90 PTS\n2nd Round Win (2rW+): +70 PTS\n3rd Round Win (3rW+): +45 PTS\n4th Round Win (4rW+): +40 PTS\n5th Round Win (5rW+): +40 PTS\nDecision Win (WBD+): +30 PTS\nQuick Win Bonus: +25 PTS\n(fight is finished in 60 seconds or less)\nScoring Notes\n- Significant Strikes are any Distance Strike or Clinch/Ground Strikes that are considered \"Power Strikes\" by official scorers.\n- A Significant Strike will count as both a strike and a significant strike and will be worth a total of 0.4 Pts\n- Control Time is the time spent in the dominant position on the ground or in the clinch. +0.03 points are awarded per second.\n- A Knockdown is awarded to a fighter who knocks his/her opponent down due to debilitation for what the official scorers consider an appreciable amount of time.\n- A Quick Win Bonus is awarded to the winning fighter if they win in the first round in 60 seconds or less.",
  "word_count": 2885,
  "scraped_at": "2026-02-14T13:42:22.960551"
}