{
  "article_id": "6b4d3a0ef93d",
  "url": "https://www.bbc.com/sport/football/articles/cdxrw2vyveeo",
  "title": "What changed for the Lionesses since Euro 2022 final ? ",
  "date": "20241024T101500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "What has changed for England since Euros triumph?\n- Published\nIt has been 817 days since Leah Williamson and Millie Bright lifted England's first major women's trophy together.\nThe Lionesses scored an extra-time winner to beat Germany 2-1 and win the Women's European Championship in front of a sold-out Wembley.\nOn Friday, the two teams will meet again at the same stadium for the first time since that historic victory.\nBBC Sport looks at how much Sarina Wiegman's England squad has changed.\nWho's missing?\nJill Scott and Ellen White decided to end their playing careers on a high, with the pair both retiring less than a month after England lifted the European trophy.\nAston Villa striker Rachel Daly, who started every game as left-back in the Lionesses' victory run, is another absentee after she retired from international football in April.\nWhile Daly was still getting regular call-ups before hanging up her boots for England, others have been less fortunate.\nBrighton's Nikita Parris, who was the top-scorer for Manchester United last season, has made just five England appearances since coming on as a sub in the last minute of the Euros final and she hasn't been called up since November 2022.\nDespite never being a regular starter under Wiegman, Tottenham forward Bethany England has also fallen behind upcoming younger players in the pecking order and has not featured for the Lionesses since last year's World Cup final defeat by Spain.\nWho are England's new stars?\nOne player whose star rose very quickly after the Euros was Lauren James, 23, who went from not having made her senior international debut to being the Lionesses' standout player during the 2023 World Cup in the space of 12 months.\nHowever, she will not be able to make her mark in this international break after she had to withdraw from the squad with a calf injury - the latest injury setback for a player who hasn't been fit to play for England since April.\nAggie Beever-Jones, 21, is another member of Chelsea's title-winning squad that has impressed Wiegman, scoring 11 goals in 17 WSL appearances for the Blues last season.\nShe and Tottenham's Jessica Naz, 24, have both recently jumped up from England's Under-23s and each earned their first senior caps in July's win over the Republic of Ireland.\nGrace Clinton, 21, meanwhile, could start to stake a claim for a starting place in the Lionesses' midfield after a stellar beginning to the season with Manchester United, while midfielder Jess Park, 23, continues to impress for Manchester City.\nWhose stock has fallen since the Euros?\nChloe Kelly was the hero on that historic day at Wembley, scoring an extra-time winner to help crown England as European champions.\nHowever, since then she has fallen out of favour at Manchester City and struggled for playing time, starting just once in their five WSL matches so far this season.\nThere were doubts over her selection for England's upcoming friendlies, but Wiegman said the 26-year-old had \"built credit\" with the Lionesses.\nElla Toone, who set England on their way to European glory with the opening goal in the 2022 final, has also seen a dip in form.\nWhile the midfielder has remained a permanent fixture in Manchester United's starting line-up, her prowess in front of goal has faltered for both club and country.\nFran Kirby was a certain starter back in 2022 but two years hit by injury and illness mean she is no longer a mainstay in the team.\nThe 31-year-old will hope a summer move to Brighton, where she has started every WSL game this season, will boost her chances of more game time.\nWho does Wiegman favour?\nWhile there has been plenty of chopping and changing in terms of the overall squad, Wiegman has largely stuck with the same names - although injury has sometimes forced her hand.\nCaptain Leah Williamson and Millie Bright have both had their own injury woes but still seem to be the Dutchwoman's first choice centre-back pairing when fully fit, although Alex Greenwood and Jess Carter are both trusted replacements.\nCarter has also been used at left-back along with Niamh Charles, while Lucy Bronze is unchallenged at right-back.\nIn recent European qualifiers, Lauren Hemp and Beth Mead have flanked each wing like they did in the last Euros.\nAlessia Russo has replaced Ellen White to lead England's frontline and, although she has had an indifferent start to the season for Arsenal and is yet to find the net in the league, only Mead has scored more goals for the Lionesses in the latest squad.\nRespective moves abroad to Barcelona and Bayern Munich have paid off for Keira Walsh and Georgia Stanway, who remain regular starters in the England midfield.\nThe biggest question mark hangs over the goalkeeper position, with Chelsea's Hannah Hampton starting the last three England games instead of Mary Earps.\nEarps was Wiegman's top choice during the Euros and last year's World Cup, but the 2023 BBC Sports Personality of the Year winner has had fitness issues and struggled for game time since her move to Paris St-Germain in the summer.",
  "word_count": 852,
  "scraped_at": "2026-02-14T12:23:04.102167"
}