{
  "article_id": "6b590f6dc0e7",
  "url": "https://www.bbc.com/sport/football/articles/ckgnwgnge4yo",
  "title": "Teenage footballer banned for transgender comment wants apology from Football Association",
  "date": "20250510T121500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Footballer banned for trans comment wants FA apology\n- Published\nA teenage amateur footballer who was banned by the Football Association over remarks she made to a transgender woman opponent has demanded an apology from the governing body, claiming the case has \"impacted\" her life.\nLast year, Cerys Vaughan, then aged 17, was sanctioned by an FA disciplinary commission for improper conduct after she asked the rival player if they were a man during a friendly match.\nHaving been told the player was transgender, Vaughan says she then raised the matter with the referee over concerns she had about fairness and safety.\nFollowing a complaint, she was charged with a breach of FA rules, and after a hearing she was handed a six-match ban, four of which were suspended.\nThe case sparked a protest by women's rights campaigners outside Wembley, and scrutiny of the FA's gender eligibility policy.\nHowever, it can now be revealed that in February, an FA appeal board found that Vaughan had received an \"unfair\" hearing, saying it was \"concerned about fundamental aspects of this case\".\nIt quashed the original ruling, and ordered a new process to take place.\nThe case has since been dropped after the complainant withdrew from the process.\nVaughan, now 18, has chosen to reveal her identity and in her first broadcast interview told BBC Sport: \"It was stressful. It's definitely impacted my normal life a lot.\n\"In the end it was pointless, and there was no reason for the FA to put me through all this.\n\"They said I wasn't guilty anymore and they dropped my charges and cleared my record.\"\nIn a statement, the FA said: \"We can confirm that this disciplinary case has now been closed, as the complainant has chosen to withdraw from the process due to personal reasons.\n\"All relevant parties have been informed of this outcome and no further action will be taken.\n\"To protect the players involved, and to respect the confidential details included, we are not in a position to publish further details about this case.\"\nFA bars transgender women from women's football\n- Published1 May 2025\nWhat does the 'definition of a woman' ruling mean for sport?\n- Published16 April 2025\nWhat is the background?\nThe case began in July 2024 when Vaughan was playing a pre-season friendly for her local women's team in Lancashire.\nShe said: \"Just before the game kicked off I saw that one of the players [was] what I thought was a man, so I went and I asked, 'Are you a man?\"\nShe says her opponent clarified they were transgender and asked to speak about it at the end of the match, but Vaughan then asked the referee about it.\n\"I assumed it would be a women's game, and that's why I was confused because I thought they'd brought a mixed team with them,\" said Vaughan.\n\"I said, 'Is this player allowed to play in the match today?'\n\"The ref said, 'I'm not sure, but because it's a friendly I'm going to let it slide'.\n\"Their captain must have heard me ask, because she came up and she told me it wasn't an appropriate question, it wasn't a nice thing to say, and I needed to keep my transphobia off the pitch. I didn't understand why she was saying that.\"\nVaughan says she is currently being assessed for possible autism, and that this may explain why she \"wasn't afraid to ask the question\".\nFor several years, the FA has allowed transgender women to play in women's matches if they reduce their testosterone level, insisting they have a responsibility to make the game as accessible and inclusive as possible.\nHowever, earlier this month the FA announced it was introducing a ban from 1 June in the wake of a UK Supreme Court ruling that the legal definition of a woman is based on biological sex.\n'Shocked' about being reported\nVaughan said days after the match she was informed by her club that she needed to provide a statement because she had been reported by a member of the opposition club, via football anti-discrimination body Kick It Out, to her local county FA.\n\"I was confused because I didn't think I'd done anything wrong,\" she said.\n\"I was shocked that they would report me but at that point I wasn't worried because I thought the FA would have some common sense and not go through with [it].\"\nBut Vaughan was then charged by Lancashire FA with \"using abusive and/or indecent and/or insulting words or behaviour\".\nIt was further alleged it was an aggravated breach of FA rules because it included a reference to gender reassignment. According to documents seen by the BBC, Vaughan was alleged to have said, \"that's a man\", \"are you a man\" and \"don't come here again\", or similar.\nVaughan denied the charges, insisting that she did not intend to be offensive to her opponent or to challenge their chosen identity, but wanted to understand if the rules were being followed.\nHowever, after a hearing, the disciplinary commission upheld both charges, finding that by raising the issue with the referee, Vaughan had showed a \"continual action which indicated more than a casual question of curiosity.\"\nShe was banned from all football for six matches, four of which were suspended for a period of one year, and was ordered to complete an online equality and diversity course.\n\"I was really upset,\" said Vaughan. \"It got put on my record that I'd been accused of misconduct, and I didn't want that to stay there, and I knew I wasn't guilty so I appealed it.\"\nIn November, with her identity remaining a secret, the matter was raised in parliament by former FA chairman Lord Triesman. He criticised the governing body's handling of the case, saying Vaughan \"seems to me to have been treated in a shabby way\", and her appeal was supported by campaign group the Free Speech Union.\nThe controversy also led to a protest by women's rights campaigners outside Wembley before an England men's fixture.\n\"It was really nice to see other people weren't afraid to speak up,\" said Vaughan.\nAppeal board found hearing 'unfair'\nThe BBC has learned that in February an FA appeal board stated it was \"concerned about fundamental aspects\" of the case, noting that Vaughan became upset while being questioned during the original hearing.\nIt said that \"maybe for the best of intentions, it led the Commission to truncate her evidence,\" adding: \"That appears to have prevented her from completing her account.\"\nIt said that the commission should have considered measures to enable Vaughan \"to her give best account in this important case. This appears not to have been done or offered. That was unfair to Cerys\".\nThe appeal body also said it was \"also concerned about a core aspect of the commission's reasoning,\" disagreeing that Vaughan had admitted the aggravated breach, and concluding \"there appears to have been no consideration of her explanation\".\nIt added that this was \"sufficient for us to allow the appeal and quash the commission's decision, which we do\".\nIt said: \"Since Cerys did not receive a fair hearing, the correct approach is to remit this case to a differently constituted commission… there should be a resolution of this important case on the merits after a fair hearing.\"\nVaughan seeking FA apology\nVaughan says she is \"happy\" that the case has now been dropped, and welcomed the FA's ban on transgender women from playing in women's football, falling in line with several other sports.\n\"They've basically admitted that I was right in what I did,\" she said. \"If the new ruling was in place when I asked the original question I never would have been punished for anything.\n\"I'd like the FA to apologise for the way that they treated me… it was a very long, drawn-out case and there was no reason for it to be.\"\nThe FA's U-turn in policy pleased those concerned about transgender women retaining physiological advantages from male puberty and the risks to fairness and safety.\nBut it has also drawn criticism from those who fear it will exclude the 28 registered transgender women in English football from the sport, and marginalise the trans community. There are currently no transgender women playing in professional football.\nNatalie Washington, campaign lead for Football v Transphobia, told BBC Sport that the FA rule change is because of \"a lot of attention on a very small number of people who aren't causing a problem, and are just going about their lives. It is a de facto ban for transgender women from football more generally, realistically, particularly people who have been playing in women's football for decades.\"\nWhen asked if she has sympathy for transgender women who may now not play, Vaughan said: \"No... I also have a love for the game. I compete with other women. I love football, and if biological males get involved that makes the experience worse for everyone else because then it's not an even game… I don't think the women's game has to be inclusive. It should be women only.\"\nAsked what she would say to those who believe transgender women should still be able to play in women's football if they reduce their testosterone, Vaughan said: \"With the height advantage, the difference in bone density, that's there from the beginning, and I think it's unfair.\n\"I'm at a greater risk of injury, and if you've gone through male puberty you'll always have the biological advantage.\"\nLast week, the FA chief executive Mark Bullingham said the amendment of the FA's rules had been a \"difficult decision\" based on legal advice, and that it understands \"how difficult this decision will be for people who want to play football in the gender by which they identify, and we are aware of the significant impact this will have on them\".",
  "word_count": 1643,
  "scraped_at": "2026-02-14T12:11:34.146922"
}