{
  "article_id": "6b60d7ed1105",
  "url": "http://www.tribune242.com/news/2024/may/23/stateside-naacp-calls-doj-show-commitment-racial-e/",
  "title": "STATESIDE : NAACP calls for DOJ to show commitment to racial equity by pardoning Marilyn Mosby",
  "date": "20240523T234500Z",
  "domain": "tribune242.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FORMER American football star O J Simpson’s death seven weeks ago reminded observers of a significant aspect of his 1994 trial on murder charges.\nOne of the things about Simpson’s eventual acquittal by a Los Angeles jury that really resonated within the black community in the US was the fact that this prominent African-American man was able to ‘beat the justice system’ in a way that had been previously largely reserved for white Americans.\nMost Americans believed that Simpson was guilty. But he had money, connections, and was able to befriend and hire several prominent defense attorneys – including Kim Kardashian’s father Robert, by the way – and defeat the prosecutors.\nWe are now witnessing a drama that also involves manipulation of the American criminal justice to benefit an African-American, via a presidential pardon, which is also more often granted to influential white people.\nThe principal character in this particular drama is former Baltimore prosecutor Marilyn Mosby. Mosby, whose then-husband Nick Mosby was the chair of the Baltimore city council when she served as state’s attorney, was part of perhaps the most powerful political couple in the state of Maryland. And both partners were African-American.\nMarilyn Mosby, now out of office, was convicted last November of perjury and in February of making a false statement to a mortgage lender in connection with her purchase of vacation homes several years ago in Florida.\nFederal prosecutors appointed by Trump had brought the charges against Mosby, who fought the Trump administration over various police-related issues in Baltimore that emerged in the wake of the murder of George Floyd in Minneapolis four years ago.\nProminent African-American politicians, including the Congressional Black Caucus, are now pressing Biden to pardon Mosby, alleging that Mosby’s prosecution was politically motivated.\n“We expect more from this current US Department of Justice and would hope that a Trump-era witch hunt would have no place in the Biden administration,” the congressional group wrote to the president.\n“Marilyn Mosby’s case is not the only politically-motivated one,” they continued, “but it is, however, the latest and one of the most egregious cases.”\nNAACP president Derrick Johnson issued the following statement: “The sad reality is that, as black women take their rightful places in positions of power, dark forces seek to tear down both their progress and that of our African-American community,” he said.\n“The NAACP refuses to stand idly by as injustice takes the wheel, driving us down a path of further disparity. We are proud to stand by our (congressional) partners in calling on President Biden and his Department of Justice to reemphasise their commitment to racial equity by pardoning Marilyn Mosby.”\nThe appeals for clemency for Mosby recall the dozens of pardons issued by Trump, particularly as he was leaving the White House in early 2021, to various people who had aided him politically or were important to key supporters.\nIn using the term “witch hunt,” the Congressional Black Caucus is clearly and intentionally imitating the charge levelled daily by Trump at his numerous Democratic-appointed prosecutors in three states and a federal courtroom. The former president constantly implies that the numerous indictments against him for various crimes and misdemeanors are all politically motivated.\nThe Black Caucus and NAACP are returning fire as they seek clemency for a prominent African-American whose prosecution they also allege was politically motivated.\nThere hasn’t been any decision or even comment from the White House so far. But Biden needs all the black votes he can inspire in November.\nThere will be pundits who will see all of this as further evidence of increased black access to legal privilege in the US, via the political system. Maybe they are right.\n• • •\nDemocrats' hopes hang on public fury at Supreme Court's abortion decision\nIT’S fair to wonder if anyone would give Democrats a real chance of holding the White House and Senate and recapturing control of the House of Representatives in November if not for the US Supreme Court’s Dobbs decision two years ago that eliminated federal protection for a woman’s right to terminate a pregnancy via abortion.\nThis decision, that every poll shows is unpopular with at least two-thirds of Americans, is just the political gift that keeps on giving for Democrats. And zealous Republican legislators and governors seemingly cannot help themselves. They keep digging their legislative hole deeper.\nLast week the state legislature in Louisiana manoeuvered to list as controlled dangerous substances two drugs commonly used to terminate a pregnancy. That could put mifepristone and misoprostol in a category similar to heroin and opium. Under this scenario, anyone, but a licensed physician, aiding a woman in acquiring these drugs would face criminal charges.\nThere are further nuances to the Louisiana case. But it’s emblematic of the GOP’s continuing, politically self-defeating zeal to limit women’s reproductive rights.\nAbortion is basically illegal now in 17 states, from Florida to Idaho and from West Virginia to Texas. Legislative attempts to ban the procedure are pending court challenges in three other states, and there are partial bans in effect in three more states. That’s 23 states altogether, representing almost half of the US.\nBut it’s also true that only one of the 17 states that ban abortion is regarded as a \"swing state\" in the upcoming election. That state is Georgia, and many observers still feel that the Peach State’s critical swing to Biden and to Democratic Senate candidates in 2020 was an outlier unlikely to be repeated this November.\nDemocrats are hoping that abortion will be decisive for Biden and others in the key northern swing states of Michigan, Pennsylvania and Wisconsin, and that the issue will also put Arizona in the blue column later this year.\nThat’s where the real effects of the high court’s Dobbs decision are most likely to be felt.\n• • •\nChief's Butker's embarassing remarks\nThe two-time defending NFL champion Kansas City Chiefs are back in the headlines again for two reasons unrelated to their dominance on the football field.\nFirst, the romance between all-star tight end Travis Kelce and pop superstar Taylor Swift is still going strong as far as anyone knows, though we are cautioned by Swift’s well-known use of former boyfriends as inspirations for her sensationally popular songs. Kelce supposedly is the subject of at least one of the songs on her most recent album that was released as her worldwide Eras tour continues.\nAs soon as the 2024 NFL schedule came out last week, fans rushed to the Chiefs’ website to see when Swift might be spotted at a stadium near them.\nBut Kansas City’s football champions were also notorious for a less sunny reason. That’s because their talented field goal kicker, Harrison Butker, rocked the NFL with his sentiments while delivering the commencement speech at a small midwestern church-affiliated college.\nButker, whose hair style and reddish beard remind some of past images of American men who might practice polygamy, had much to say about gays and women and their role in contemporary America.\nAccording to the New Republic magazine’s website, the Kansas City Chiefs kicker referred to Gay Pride Month as one of the “deadly sins”, declared that “things like abortion, IVF, surrogacy, euthanasia, as well as a growing support for degenerate cultural values in media, all stem from the pervasiveness of disorder, implored men to be “unapologetic in your masculinity”, and, addressing the graduating women specifically, said “I would venture to guess that the majority of you are most excited about your marriage and the children you will bring into this world\".\nNumerous pundits expressed shock and surprise that any university commencement speaker could replace protestors against Israeli actions in occupied Gaza in the headlines. But Butker did just that.\nThis 28-year-old, who was educated at Atlanta’s posh and exclusive Westminster School and at prestigious Georgia Tech, clearly caught the NFL’s executives on Fifth Avenue in New York City off guard just as they succeeded once again in enlarging the release of this season’s schedule to the status of headline news.\nThe league responded quickly, noting that “Harrison Butker gave a speech in his personal capacity. His views are not those of the NFL as an organisation,” said a league vice president.\nBut we likely won’t see Butker cut or traded by Kansas City for his embarrassing remarks. He’s one of the top clutch kickers in the league, and won February’s Super Bowl for the Chiefs in overtime.\nComments\nUse the comment form below to begin a discussion about this content.",
  "word_count": 1416,
  "scraped_at": "2026-02-14T12:41:45.383379"
}