{
  "article_id": "6b6aacbc6a77",
  "url": "https://www.cardchronicle.com/cardinal-news-and-notes/98856/wednesday-afternoon-cardinal-news-and-notes",
  "title": "Wednesday afternoon Cardinal news and notes",
  "date": "20251105T220000Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "We’d be remiss if we didn’t start today with an acknowledgement of what transpired in the city last night. Seeing UPS planes on a daily basis and taking pride in a global shipping company residing in our city is in the DNA of each and every Louisvillian. Virtually everyone in this city has spent time either working for UPS or knows someone who has or does.\nWednesday afternoon Cardinal news and notes\nL’s up from Lisbon.\nMy thoughts continue to be with all those affected by yesterday’s tragic events. Hopefully Cardinal sports can be a positive escape for at least some of them.\n—Spread check (football): Louisville by 20.5.\n—The first in-season Bracketology from CBS has Louisville as a 2-seed in St. John’s region.\n—The first CFP rankings did nothing to diminish the belief that only one team from the ACC will ultimately make the Playoff.\n—This is very cool.\n—The first CFP rankings seemed to be low on actual data usage and high on … vibes?\n—The Field of 68 has Louisville up to No. 6 in its daily college hoops rankings.\n—David Cobb ranks the 50 best quarterbacks in college football and does not have Miller Moss on his list.\n—Good essay here on the start of the 2025-26 college basketball season.\n—Are we buying the Khani sophomore leap hype?\n—CT Insider discusses what they learned from UConn’s season-opening win over Louisville last night.\n—It’s ACC Tournament game day for the U of L men’s soccer team, which will look to keep its season alive with an upset of third-seeded NC State. Here’s a preview.\n—The U of L football redshirt tracker has been updated.\n—Pretty terrifying photo from Trager Stadium yesterday.\n—Cardinal Authority has some updated bowl projections for U of L.\n—Louisville may have gotten handled by top-ranked UConn, but Laura Ziegler was awfully impressive for the Cards in defeat.\n—Eric Crawford writes about sports taking a backseat on days like Tuesday.\n—I’ll never look at Wake Forest field hockey the same way again.\nThe weirdest and most unwarranted rivalry in the ACC rolls on.\n—The Louisville men’s and women’s swim and dive teams are set to host Kentucky and Notre Dame.\n—Pat Forde writes what everyone here already knows: Notre Dame being five spots ahead of Louisville makes zero sense.\nNow consider who is ranked five spots behind the Irish. Louisville (7–1) has a better record than Notre Dame and beat the Miami team that defeated the Irish. To repeat: better record, better result against a common ranked opponent, five spots lower.\n“When we look at the tape, we think Notre Dame is a really solid football team, both sides of the ball,” said selection committee chairman Mack Rhoades, the athletic director at Baylor. He’s the latest luckless spokesman with a thankless task on the weekly TV show. In this case, the message seems to be that turning on the tape matters more than the game results.\nOr, it’s almost like brand name matters in college football.\nThe two teams also have both played Boston College, with almost identical results. The Eagles lost by 15 to Notre Dame and 14 to Louisville. They were outgained by 177 yards by the Irish and 144 yards by the Cardinals. Louisville led by 49 minutes and 49 seconds; Notre Dame led for 44:52.\nHow about the rest of the résumés?\nLouisville defeated Pitt, and did so on the road. Its lone loss was in overtime against a Virginia team that the committee ranked No. 13. A victory over James Madison (7–1) has gained some currency as the season has gone on. Wins over FCS Eastern Kentucky and Bowling Green are empty calories. All conference road wins are good wins, but beating Virginia Tech in Blacksburg, Va., doesn’t move the needle much.\nNotre Dame has three victories over last-place power-conference teams: Purdue of the Big Ten; Arkansas of the SEC; and BC of the ACC. The two other teams the Irish have defeated, Boise State and North Carolina State, are both ranked lower in the Sagarin Ratings (56th and 47th, respectively) than James Madison (38th).\nThe potential saving grace for the Cardinals is this: Even if the committee doesn’t like them or their conference, they can force their way into the field. Make the ACC championship game and win it, and they’re locked in. The Irish have no such automatic path.\nBut they do have Notre Dame aura, Notre Dame fan backing and Notre Dame ratings cache. If you’re putting together a bracket for maximum TV impact, you want the Irish in it.\nI’m not saying that was a deciding factor. But I am saying that the highest-ranked two-loss team Tuesday was the Irish. And they were ahead of three one-loss teams from the ACC.\n—Louisville swept the ACC men’s and women’s Swimmer of the Week awards.\n—While Louisville has eyes on the Playoff, Cal has eyes on getting bowl eligible this weekend.\n—Second Stride has a raffle for 2026 Kentucky Derby and Oaks tickets that you can enter here.\n—And finally, go Cards, go UPS, go Louisville.",
  "word_count": 849,
  "scraped_at": "2026-02-14T13:43:27.762014"
}