{
  "article_id": "6b867c32567e",
  "url": "https://www.winnipegfreepress.com/canada/2026/01/01/year-in-review-a-look-at-events-in-may-2025-2",
  "title": "Year in review : A look at events in May 2025 – Winnipeg Free Press",
  "date": "20260101T090000Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Year in review: A look at events in May 2025\nAdvertisement\nA look at news events in May 2025:\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nA look at news events in May 2025:\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nA look at news events in May 2025:\n1 – The Supreme Court of Canada said won’t hear the province’s appeal in a youth-led Ontario climate case. The decision from Canada’s top court means the challenge will instead be revived in an Ontario court. Legal experts said the case brought on by seven young people could clarify whether governments in Canada have any constitutional obligation to protect Canadians from climate change. The group is asking for a court to order that the Ontario government come up with a science-based target in line with Canada’s international climate commitments.\n1 – President Donald Trump nominated national security adviser Mike Waltz as United Nations ambassador. Trump announced the major shakeup of his national security team shortly after news broke that Waltz and his deputy were leaving the administration. Waltz had been under scrutiny for weeks after reporting from The Atlantic that he had mistakenly added the magazine’s editor-in-chief to a Signal chat being used to discuss military plans. Secretary of State Marco Rubio will take over Waltz’s duties on an interim role..\n2 – B.C.’s premier said the provincial day of remembrance and mourning for the victims of the Lapu Lapu Day Festival attack would give British Columbians a chance to reflect and show their solidarity with the Filipino community.\n2 – An Alberta MP was set to step aside to allow Conservative Leader Pierre Poilievre to run for a seat in Parliament. Damien Kurek said he’s temporarily stepping aside as MP for the Battle River-Crowfoot riding. Kurek will need to be sworn in before he resigns his seat. Prime Minister Mark Carney has said he would call a byelection “as soon as possible” if the Conservatives had a member resign their seat so that Poilievre could run again.\n2 – An international fugitive and one of Canada’s most wanted was back behind bars in British Columbia. Cody Casey was arrested by police in Oman on Oct. 5, 2024, and has been returned to Canada after a six-month extradition process from the Middle East. Vancouver police allege Casey slipped off his ankle bracelet in April 2022, while he was on bail before his trial on fentanyl and firearms charges. The national BOLO program had named Casey Canada’s third-most-wanted person and announced a $100,000 reward.\n3 – Australian Prime Minister Anthony Albanese became the first Aussie leader to win a second consecutive three-year term in 21 years. Opposition leader Peter Dutton conceded defeat saying his party did not do well enough and that he accepted full responsibility for it.\n3 – Newfoundland and Labrador has a new premier. John Hogan won the provincial Liberal leadership contest, giving him the new title after a vote was released at the party’s convention in St. John’s. The former health minister picked up 77 per cent of the points needed under the party’s voting system and beat out rival John Abbott. Hogan takes over from Andrew Furey, who announced in February he would step down as premier and return to working in medicine.\n4 – Brazilian police said they thwarted a plot to set off a bomb at a recent Lady Gaga concert in Rio de Janeiro. Last night’s show, believed to be the biggest of her career, drew some two-million fans to Copacabana Beach. State police said they had worked with the Justice Ministry to disrupt an attack allegedly planned by a group that was spreading hate speech against the LGBTQ community. Authorities said they arrested two people in relation to the planned attack, the alleged ringleader and a teenager.\n5 – The last girl set to face trial in the death of a homeless Toronto man pleaded guilty to manslaughter. The girl, one of eight teens accused in the death of Kenneth Lee, was set to go on trial on a charge of second-degree murder this week. Lee died after he was swarmed by a group of teens in a downtown Toronto parkette in December 2022. Police arrested eight girls between the ages of 13 and 15 in the hours that followed his death and charged them all with second-degree murder.\n5 – Nell Fortner was named head coach of Canada’s senior women’s national basketball team. The former U.S. head coach takes over from Victor Lapena as the program looks to rebound from a winless showing at the 2024 Paris Olympics. Fortner guided the United States to gold at the 1998 FIBA World Championship and the 2000 Olympic Games in Sydney.\n5 – B.C. MP Don Davies was chosen by the party’s national council to be the interim leader for the New Democratic Party of Canada. He’ll take over for former leader Jagmeet Singh, who announced his resignation after losing his own Burnaby Central seat in the April 28 election. Davies led the NDP negotiations with the Liberal government to advance dental care and pharmacare legislation while serving as health critic in the last session of Parliament.\n6 – Conservative leader Friedrich Merz succeeded in becoming Germany’s next chancellor, drawing applause and a palpable sense of relief in the parliament chamber after a historic loss in the first round of voting threatened the new government’s promises of stability. No other postwar candidate for German chancellor has failed to win on the first ballot. The stunning but short-lived defeat sent shock waves throughout Europe and dragged down the stock market.\n6 – Former Conservative top man Andrew Scheer was set to become the interim opposition leader in Parliament with Pierre Poilievre’s absence. The Saskatchewan MP-elect will assume the duty when the House of Commons begins sitting on May 26.\n7 – With all the pomp, drama and solemnity that the Catholic Church can muster, 133 Catholic cardinals were set to begin the secretive, centuries-old ritual to elect the 267th pope, the successor to the late Pope Francis. Cardinals, from 70 countries, have been sequestered from the outside world until a majority two-thirds vote finds a new leader for the 1.4-billion-member church.\n7 – Yukon Premier Ranj Pillai announced he was stepping down and won’t run in the next territorial election. Pillai said being premier since 2023 has been the greatest honour of his life and he is proud of what the government accomplished. He’s asked the Yukon Liberal party to immediately begin the process of selecting a new leader. The Liberals hold a minority government and the next territorial election has to be held on or before Nov. 3.\n8 – Residents were fleeing their homes as wildfires have forced evacuations and destroyed about a dozen homes in a clutch of rural communities in eastern Newfoundland. Local resident Gerry Rogers said a fire began a day prior and advanced quickly toward nearby homes along the western shore of Conception Bay.\n8 – The United States and Britain announced a trade deal that will lower the burden of President Donald Trump’s sweeping tariffs. Trump said the deal would increase access for U.S. beef, ethanol, and other agricultural products. It would also fast track American goods through the U.K.’s customs process. Britain said the new trade deal will cut tariffs on U.K. cars from 27.5 per cent to 10 per cent and eliminates levies on steel and aluminum.\n8 – Robert Prevost was elected the first American pope in history. Provost, 69, spent his career ministering in Peru. He takes the name of Leo XIV. He secured at least 89 votes of the 133 cardinals participating in the conclave to elect him as the successor to Pope Francis. A crowd in St. Peter’s Square erupted in cheers when white smoke poured out of the Sistine Chapel chimney earlier today to signal that a new pope had been elected to lead the Catholic Church..\n9 – John Hogan was sworn in as Newfoundland and Labrador’s 15th premier. His new cabinet was also sworn in today during a ceremony at Government House in St. John’s.\n9 – Sidney Crosby was named captain of Canada’s team at the world hockey championship. The announcement from Hockey Canada comes 10 years after Crosby’s last world championship appearance — when he captained Canada to a gold medal in Czechia. Canada opens the tournament tomorrow against Slovenia in Stockholm, Sweden.\n10 – Researchers in Ontario said they have achieved a significant milestone in the search for a treatment for ALS. Sunnybrook Health Sciences Centre in Toronto said it is using focused ultrasound to deliver immunoglobulin — an antibody therapy — past the blood-brain barrier and directly into the motor cortex. That’s the part of the brain that controls movement and where the devastating neurodegenerative disease starts.\n11 – The co-founder of specialty tea provider DavidsTea died in Montreal. Herschel Segal also launched the Canadian fashion retailer Le Chateau in the late 1950s. The clothing brand became a mall staple and a hit with young shoppers in the 1980s and ’90s before foreign retailers like H&M and Zara entered the Canadian market.\n11 – Star female pitcher Ayami Sato made history as the first woman to play in a Canadian men’s professional baseball league. Sato struck out one batter without allowing anyone on base in the first two innings of an eventual 6-5 loss to the Kitchener Panthers. Widely considered the top female pitcher in baseball, the 35-year-old from Japan signed with the Maple Leafs in December to become the IBL’s first female player.\n12 – An Israeli-American soldier held hostage for more than 19 months in the Gaza Strip was back with the Israeli military. Edan Alexander was turned over to the Red Cross before being brought to a military base in southern Israel. His mother flew to Israel for his release and television footage showed her arriving at the base where he was being brought. Hamas released Alexander as a goodwill gesture toward the Trump administration that could lay the groundwork for a new ceasefire with Israel.\n12 – A judicial recount got underway in the rural Newfoundland riding of Terra Nova-The Peninsulas, where the Liberals finished with a 12-vote lead. Officials will recount every vote cast in the riding. The recount in central Newfoundland is one of four ordered after the election last month by the federal elections agency. In all four, the margins between the winner and the runner-up were fewer than 80 votes.\n13 – Prime Minister Mark Carney gave his cabinet a major shakeup during a swearing-in ceremony at Rideau Hall, moving several key players involved in Canada-U.S. relations into new positions and promoting some newly elected MPs to the front bench. His cabinet is made up of 28 full ministers and 10 secretaries of state. The shuffle creates a new Artificial Intelligence Ministry, swearing in former journalist Evan Solomon as its minister, and for the first time an Indigenous person, Mandy Gull-Masty, is chosen to lead Indigenous services. The biggest moves involved Anita Anand, who became Canada’s new foreign affairs minister, replacing Melanie Joly, who pivoted to industry minister and economic development for Quebec.\n13 – A Federal Court judge tossed out a challenge that would have stopped the killing of about 400 ostriches on a British Columbia farm that suffered an outbreak of avian flu. The Canadian Food Inspection Agency ordered the cull late last year, but a court granted a stay in January pending a judicial review. The farm’s family has said the birds should be saved because they have developed herd immunity and could contribute to the fight against avian flu.\n14 – U.S. President Donald Trump met with Syrian President Ahmad al-Sharaa in the first such encounter between leaders of those two nations in 25 years. Trump had a brief face-to-face with the one-time insurgent leader who spent years imprisoned by U.S. forces after being captured in Iraq. The White House said Trump had agreed to “say hello” today to al-Sharaa on the sidelines of sitting with the leaders of the Gulf Co-operation Council before Trump wraps up his visit to Saudi Arabia and moves on to Qatar\n14 – The premiers of Ontario and Manitoba signed a memorandum of understanding today to boost the movement of goods and labour between the provinces. It includes direct-to-consumer alcohol sales as part of increasing trade.\n14 – Elections Canada said the result of a recount in the federal riding of Terrebonne was final, despite a misprint that led to one special ballot being returned to sender. The agency says there was an error on the envelope used to mail a special ballot from the Quebec riding the Liberals won by a single vote after a recount. CBC News had reported that a Bloc voter saw her mail-in ballot returned to her. Elections Canada says an analysis confirmed that the last three characters of the postal code on the letter were incorrect.\n14 – The CBC’s board of directors said the Crown corporation would no longer pay individual bonuses to employees. The board said in a statement it will discontinue what CBC refers to as “performance pay” and adjust salaries of affected staff to compensate them. It also comes after the public broadcaster was criticized for paying out millions in bonuses after eliminating hundreds of jobs.\n15 – Manitoba declared a state of emergency in Whiteshell Provincial Park because of wildfires. Premier Wab Kinew said officials were taking the danger seriously after two people died yesterday in a fire in the eastern part of the province. He says they want additional powers to enforce evacuation orders. Officials say there are 21 active blazes burning in the province and the fire in the Rural Municipality of Lac du Bonnet remains out of control.\n15 – Hudson’s Bay said it would sell its brands to Canadian Tire in a $30-million deal. The agreement between Canadian Tire and Canada’s oldest company included the Bay name as well as its famed stripes motif and several of its other brands. The sale was expected to close this summer but still required court approval. The 355-year-old department store’s assets hit the sales block after Hudson’s Bay filed for creditor protection earlier this year.\n15 – Three-time Tony Award winner Charles Strouse, who composed the music for classic musical theatre hits such as “Annie,” “Bye Birdie” and “Applause,” died at his home in New York at the age of 96. Strouse’s career spanned more than 50 years, writing more than a dozen Broadway musicals, as well as film scores and “Those Were the Days,” the theme song for the sitcom “All in the Family.’ He also churned out show tunes such as “Tomorrow” from “Annie,” and the equally cheerful “Put on a Happy Face” from “Bye Bye Birdie.”\n16 – In a major update in the sexual-assault trial of five former members of Canada’s world junior hockey team in London, Ont., an Ontario Superior Court Justice dismissed the jury. The trial continued with a judge alone. The Ontario Superior Court Justice dismissed jurors after one of them submitted a note to her saying some panel members felt defence lawyers for one of the accused were making fun of them.\n16 – Alberta Premier Danielle Smith’s former chief of staff sued the fired CEO of the province’s front-line health agency and the newspaper that first reported allegations of corruption in multimillion-dollar health contracts. Marshall Smith filed a statement of claim alleging defamation against former Alberta Health Services head Athana Mentzelopoulos, The Globe and Mail and an unidentified person believed to be a former AHS board member. Mentzelopoulos alleged in her own lawsuit that high-ranking Health Ministry staff, as well as Marshall Smith, pressured her to sign off on contracts for private surgical facilities despite concerns over costs and who was benefiting.\n16 – Elections Canada confirmed an NDP win in the riding of Nunavut. The federal agency posted the results of a vote validation process after double checking the numbers reported on the night of the April 28 federal election. The results confirm NDP incumbent Lori Idlout has won the riding of Nunavut over Liberal challenger Kilikvak Kabloona.\n17 – A massive Nanaimo bar was certified as the world’s largest during at event in the British Columbia city bearing the sweet treat’s name. Students at Vancouver Island University baked the massive bar, whose recipe called for butter equivalent to the weight of a baby elephant. Weighing in at a record-setting 21.3 metres long, 0.9 metres wide and nearly 500 kilograms. The previous Guinness World Record for the largest Nanaimo bar was set in 2020 by a chocolatier from Levack, Ontario with a 240-kilogram bar.\n18 – Two people died after a Mexican navy training ship struck the Brooklyn Bridge in New York. The crash snapped all three wooden masts, fatally injuring two crew members and injuring 19 others. The Cuauhtémoc was on a global goodwill tour with 277 people aboard during the crash. New York Mayor Eric Adams says the bridge wasn’t seriously damaged, but the cause of the crash is still under investigation.\n18 – Prime Minister Mark Carney said the Liberal government plans to table a full federal budget this fall. Speaking to reporters in Rome, Carney defended his decision not to present a budget this spring, saying there is little value in rushing the process.\n18 – The office of former U.S. president Joe Biden announced that he had been diagnosed with prostate cancer. Doctors discovered a prostate nodule last week and his office says the cancer cells have spread to the bone, noting it appears to be hormone-sensitive, allowing for effective management. The 82-year-old is said to be reviewing treatment options with his family and physicians.\n18 – The U.S. Food and Drug Administration approved the first blood test to help diagnose Alzheimer’s disease. Maimonides Medical Center neurologist Doctor Leah Croll said the test will be to those over the age of 55 and will significantly speed things up which is key to treating the symptoms of Alzheimer’s.\n19 – Streaming service Netflix throws “Sesame Street” a safety net that offers the popular children’s staple broad reach while keeping it on its long-standing home. Starting later this year, new episodes will run on Netflix, PBS and the PBS Kids app on the same day. No specific première date was immediately announced. Select past episodes will be available on Netflix worldwide.\n19 – Canada, France and the United Kingdom threatened “concrete actions” against Israel for its activities in the Gaza Strip and West Bank. A joint statement sharply criticized Israel’s decision to allow a basic amount of aid into Gaza after nearly three months of an Israeli blockade, calling it “wholly inadequate.” The three countries said while they’ve always supported Israel’s right to defend itself against terrorism, the latest escalation in Gaza is disproportionate and should stop.\n19 – Canada Post said it received strike notices from the union representing some 55,000 postal workers, with operations poised to shut down within days. A work stoppage would affect millions of residents and businesses in Canada, as typically more than two billion letters and roughly 300 million parcels are received via the service each year.\n20 – Actor George Wendt, who played “Cheers” barfly Norm, died peacefully in his sleep while at home at the age of 76, his family said. Despite a long career of roles onstage and on TV, he was best known for his gentle and henpecked Norm Peterson on “Cheers.” The role earned Wendt six straight Emmy Award nominations for best supporting actor in a comedy series from 1984 to 1989.\n20 – Two Indigenous organizations issued eviction notices to a number of Quebec forestry companies. They sent the notices to 11 companies, ordering them to immediately remove their workers and equipment from unceded Indigenous territory. The letters are a response to the Quebec government’s proposed forestry reform, which has drawn opposition from environmentalists and First Nations. The Indigenous organizations say the bill threatens ancestral rights and was tabled without Indigenous consent.\n20 – U.S. President Donald Trump unveiled plans for a new missile defence shield, insisting Canada’s involvement “automatically makes sense.” The Trump administration revealed the Golden Dome, which will use space-based projectiles against advanced missiles from Russia and China. The president claims the complex multilayered system will cost $175 billion and will be completed during his term in office. He added that his administration will work with Canada on “pricing” and that the nation will “pay their fair share.”\n21 – The G7 finance meeting – a prelude to the G7 leaders’ summit in June – began in Banff, Alta., with top economic officials from some of the world’s richest economies gathering for closed-door discussions on such topics as the global economy and the war in Ukraine. Canadian Finance Minister Francois-Philippe Champagne was hosting his counterparts from the U.S., France, Germany, Italy, Japan, the U.K. and the European Union as a “non-enumerated member,” along with Ukraine’s finance minister as a guest.\n21 – A major landslide swept away an empty home and a road in Quebec. Officials say no one was hurt, but three surrounding homes northeast of Montreal were evacuated out of caution. They said the landslide left a hole estimated at more than 300 metres long and 100 metres wide – and it is expected to grow. There has been heavy rain in recent days.\n21 – Agreements were reached for a $15-million settlement over historic sexual abuse involving two Montreal-area dioceses representing the suburbs of Longueuil and St-Hyacinthe. A Quebec law firm said victims should be compensated quickly once legal fees and other costs are factored in. The class actions so far include a total of 70 victims in Quebec.\n21 – The U.S. defence secretary accepted a gifted plane from Qatar for President Donald Trump to use as Air Force One. The Pentagon said it will work to ensure proper security measures on the Boeing 747 to make it safe for Trump’s use, and that the plane had been accepted “in accordance with all federal rules and regulations.” While Trump has defended the gift, others have raised concerns about the aircraft being a violation of the Constitution’s prohibition on foreign donations.\n21 – Foreign Affairs Minister Anita Anand summoned the Israeli ambassador to explain why soldiers fired warning shots near a diplomatic tour in the West Bank. Anand confirmed four Canadians were part of the delegation touring the city of Jenin and said all of them are safe.\n21 – A Saskatchewan man was sentenced to 17 years for child sexual abuse in multiple communities. Richard Dyke will serve just over 14 years, after taking into account the time he has already spent in custody. The 48-year-old pleaded guilty to 10 offences, with an agreed statement of facts saying he abused 33 victims – some of them as young as 18 months old. RCMP say Dyke came into contact with some of the children through his wife’s home-based daycare.\n21 – A bipartisan resolution was introduced in the U.S. Senate to recognize that country’s partnership with Canada. The relationship has been badly strained by U.S. President Donald Trump’s tariffs and his repeated threats of annexation. The resolution came as some U.S. states and organizations shared concerns about a drop in their numbers of Canadian visitors.\n22 – Prime Minister Mark Carney was sworn in as MP for the Ottawa riding of Nepean. The ceremony took place this morning on Parliament Hill. Voters elected Carney to his first-ever seat in Parliament during last month’s general election that saw the Liberals win a minority government.\n22 – The Toronto Maple Leafs turfed Brendan Shanahan. The team said it won’t renew Shanahan’s contract as president and alternate governor after more than a decade on the job. Toronto has only had two post-season series victories during Shanahan’s tenure despite an embarrassment of high-priced offensive talent. Shanahan took over in April 2014 after being poached from the N-H-L offices where he was a senior vice-president.\n22 – Canada was eliminated from the world hockey championship by host nation Denmark. Canada was eliminated despite having a team with several players from its championship roster at this year’s 4 Nations Face-Off, including team captain Sidney Crosby.\n23 – A 12-metre-long prehistoric marine reptile, named British Columbia’s official fossil emblem two years ago, was recognized as a new genus, never identified before. Researchers who published their peer-reviewed findings in the Journal of Systematic Paleontology described the fossils as the remains of “a very odd new genus” of the plesiosaur family. The long-necked creature is now named Traskasaura sandrae after Mike Trask and his daughter Heather, who found the first example on Vancouver Island in 1988.\n23 – A major prisoner exchange between Russia and Ukraine began. Ukraine’s President Volodymyr Zelenskyy said the first phase of the exchange is bringing home 390 Ukrainians, with further releases expected. This is one of the few signs of progress from the countries’ direct talks last week in Istanbul.\n23 – A delegation of U.S. senators visited Canada to make the case for a partnership between the neighbouring countries. The delegation of four Democrats and one Republican met with Prime Minister Mark Carney, as well as the ministers of foreign affairs, national defence and industry in Ottawa.\n23 – Hudson’s Bay said it plans to sell up to 28 of its store leases to a B.C. mall owner who wants to launch “a new modern department store.” Canada’s oldest company said it will seek court permission for Ruby Liu to take over some properties the department store and Saks leased in Alberta, B.C. and Ontario. The company did not say how much Liu offered for the properties nor which locations or addresses she wants.\n24 – Russia and Ukraine exchanged hundreds more prisoners today, hours after a massive attack on Kyiv that left at least 15 people injured. Ukrainian President Volodymyr Zelenskyy and Russia’s defence ministry says each side brought home 307 more soldiers today, one day after each side released a total of 390 people.\n25 – A new video released by the U.S. Coast Guard contains a sound investigators believe is the moment the Titan submersible imploded. The implosion on June 18, 2023, claimed the lives of five people, including OceanGate Expeditions CEO Stockton Rush, who was the pilot of the submersible. Shortly into the video, a noise can be heard, prompting Wendy Rush to turn to Gary Foss, both members of the submersible’s tracking team, to say, “What was that bang?” The video, first reported by BBC was posted on a U.S. Defense Department website.\n25 – Canadian teen Victoria Mboko earned her first career Grand Slam victory. The 18-year-old’s win over the 2024 Wimbledon quarter-finalist at the French Open means Mboko claimed all eight sets she’d played over the past week-plus on the red clay at Roland-Garros. That includes six in a trio of triumphs in the qualifying rounds.\n26 – A judge approved a $500-million settlement in a class-action lawsuit that accused Loblaw Companies and its parent company George Weston of engaging in a bread-fixing scheme. Records show 78 per cent of the settlement funds will be allocated to residents in Canada outside Quebec and more than 20 per cent will wind up with people in that province.\n26 – The federal NDP will not be granted official party status, Government House leader Steven MacKinnon announced. He noted that it’s because the Parliament of Canada Act says a party needs at least 12 seats to be recognized. The NDP was reduced to just seven seats in last month’s federal election that saw Prime Minister Mark Carney’s Liberals win a minority government.\n26 – Francis Scarpaleggia was named the next Speaker of the House of Commons. MPs elected him in a secret ballot following a brief but dramatic race that saw the only Conservative contenders drop out of the running at the last minute.\n26 – King Charles and Queen Camilla touched down in the nation’s capital as they begun a two-day royal tour. It was their first visit to Canada since the King’s coronation two years ago. They were to travel to Landsdowne Park to meet with community members and then head to Rideau Hall to meet with Prime Minister Mark Carney. The King was asked to read the throne speech — setting out the government’s priorities for the legislative session.\n27 – King Charles formally opened Parliament by reading the speech from the throne in a rare event for Canada’s monarch. After inspecting a 100-person honour guard and receiving a 21-gun salute, King Charles entered the Senate building as the crowd cheered. He then read the throne speech — setting out Prime Minister Mark Carney’s priorities for the current session and his vision for nation-building and economic growth. The King says Canada is facing unprecedented challenges in what he sees as a more dangerous world since the Second World War. It comes as Canada copes with U-S President Donald Trump’s attempts to upend global trade with tariffs and his repeated calls for Canada’s annexation.\n27 – Prime Minister Mark Carney’s government confirmed it was joining Europe’s massive new rearmament plan. The throne speech laid out Ottawa’s plans to protect Canada’s sovereignty by building up the military and engaging with ReArm Europe. It’s a move that could reduce Canada’s reliance on the U.S. as a source of military equipment at a time when U.S. President Donald Trump has called for Canada’s annexation.\n27 – King Charles and Queen Camilla wrapped up their historic two-day visit to Canada. They heading back to England after the King delivered a throne speech in Ottawa. After the speech, the royal couple visited the National War Memorial where a trumpeter played Last Post and a band played the national anthems of Canada and the U-K. The King laid a wreath at the Tomb of the Unknown Soldier, while the Queen placed flowers on top.\n28 – Parliament got back to work with plenty of new faces in the House of Commons. Speaker Francis Scarpaleggia was presiding over the House of Commons for the first time. His office confirmed that all 343 members of Parliament had been sworn in.\n28 – Federal Defence Minister David McGuinty said Ottawa will take “immediate and decisive action” to rebuild Canada’s military. McGuinty delivered a state-of-the-union style speech at a military equipment trade show in Ottawa. The address to defence contractors at the CANSEC trade show came a day after the Liberal government confirmed plans to join a major European defence procurement pact.\n28 – All 5,000 residents of Flin Flon, Manitoba, were ordered to evacuate their community because of an out-of-control wildfire. The fire began in the Saskatchewan town of Creighton and crossed the Manitoba boundary. Manitoba Premier Wab Kinew ordered a provincewide state of emergency because of a series of crippling wildfires.\n28 – Elon Musk announced he was leaving his government role as U.S. President Donald Trump’s top adviser after spearheading efforts to reduce and overhaul the federal bureaucracy. The billionaire entrepreneur posted on X that his scheduled time as a Special Government Employee has ended. Musk’s departure comes one day after he criticized Trump’s legislative agenda and his big beautiful bill, including tax cuts and enhanced immigration enforcement..\n29 – Prime Minister Mark Carney agreed to send in the military to help evacuation efforts in Manitoba as wildfires rage on. Some 17,000 people have been evacuated from several communities and First Nations as the entire province is under a state of emergency. Three First Nations in northern Saskatchewan also declared a joint state of emergency in response to escalating wildfires.\n29 – Members of Ontario’s legislature gave themselves a big pay hike and access to a pension plan. The bill took about 13 minutes to make it through the legislative process. Ontario MPPs’ pay has been frozen for the past 16 years and they lost their previous pension plan in the 1990s under Premier Mike Harris. Finance Minister Peter Bethlenfalvy noted the pay will be 75 per cent of the compensation federal MPs receive.\n29 – Saskatchewan Premier Scott Moe declared a provincewide state of emergency as rampaging wildfires force thousands of residents to flee. Moe said the lack of rain in the forecast meant the fires could worsen. Saskatchewan was the second province to declare a state of emergency after Manitoba made the call a day prior.\n29 – The Emmy-winning composer who provided music for “The Simpsons” died at the age of 84 after struggling with Parkinson’s disease for about a decade. Clausen was nominated for 30 Emmy Awards during his career, 21 of them for “The Simpsons.”\n30 – Former Sinn Fein leader Gerry Adams won a libel lawsuit against the BBC. Adams launched Britain’s public broadcaster over a claim in a documentary and an online article that he sanctioned the killing of an informant. A jury at the High Court in Dublin ruled in Adams’s favour, awarding him damages of more than $156,000 Cdn. Adams is one of the most influential figures of Northern Ireland’s decades of conflict and its peace process, and has called the allegation a “grievous smear.”\n30 – Fire crews worked to contain an out-of-control blaze threatening Flin Flon, Manitoba, while the city’s mayor said powerful and shifting winds were the only thing keeping the fire from raging into the city. George Fontaine said his city has been begging for air support to help douse the fire, with current projections suggesting the fire will take chunks out of the town and surrounding areas if more isn’t done. All 5,000 residents were ordered to leave this week after the wildfire leapt over the boundary in Saskatchewan. Cottages and homes outside Flin Flon were also ordered to evacuate.\n30 – Canada Post said it was calling on the jobs minister to force a union vote on the proposals the Crown corporation presented to members. Canada Post presented its “final offers” to the union representing 55,000 workers, with concessions that end compulsory overtime and introduce a signing bonus.\n30 – The National Centre for Truth and Reconciliation said the names of 140 priests or brothers who worked in residential schools will be released soon. The centre said, along with names, it would also post personnel files and the names of the schools where they served. The centre said the records are a “vital” resource for families and communities – adding the list of names would be “updated on an ongoing basis.”\n30 – Quebec said it will push to lower interprovincial trade barriers alongside the other provinces and territories. It comes as the federal government works to increase domestic trade in response to U.S. President Donald Trump’s tariffs. Economy Minister Christopher Skeete tabled a bill that aims to remove all restrictions on the use and sale of products from other provinces. Skeete said the bill sends a message – the province is ready to drop barriers and stimulate trade between regions.\n30 – U.S. President Donald Trump said he will double the tariffs on steel imports to 50 per cent. During a rally with steelworkers in Pittsburgh, the leader boasted the increased levies would double from the current rate of 25 per cent. A post on social media from the White House said the boosted duties would go into place next week. The president has said his sweeping tariffs will bring manufacturing back to the United States.\n30 – A judge decided a teen girl accused in the fatal 2022 swarming attack on a homeless Toronto man was guilty of manslaughter. An Ontario Superior Court justice said the Crown’s case wasn’t proven beyond a reasonable doubt that the girl who dealt the fatal blow to Kenneth Lee had the state of mind required for murder. The girl — who was 14 at the time of the attack — was one of eight girls between the ages of 13 and 16 who were arrested and charged with second-degree murder.\n30 – Emmy Award-winning actress Loretta Swit died at the age of 87. Her publicist said the “M.A.S.H” star died from natural causes. Swit won both of her Emmys for playing Major Margaret “Hot Lips” Houlihan, a demanding nurse with a behind-the lines surgical unit during the Korean War on the pioneering hit TV series that ran for 11 seasons on CBS from 1972 to 1983.\n30 – Stage, film, and television actress Valerie Mahaffey died at the age of 71 after a battle with cancer. Mahaffey’s work included the soap opera “The Doctors” more than 45 years ago and roles in the TV series “Young Sheldon” and “Desperate Housewives.” She won an Emmy award for outstanding supporting actress in a drama series for her portrayal of hypochondriac Eve on “Northern Exposure.”\n31 – A B.C. ostrich farm was handed a $20,000 fine from the Canadian Food Inspection Agency after it failed to co-operate with anti-avian flu measures, as the owners continued to resist a cull order. The agency said the farm has not disclosed claims of scientific research on the birds, and that the agency’s planning of a cull of the birds continues as protesters gather in an “apparent attempt” to block the killings.\n31 – Longtime Canadian women’s soccer midfielder Desiree Scott hung up her international cleats. Known as ‘The Destroyer,’ Scott had been on the team since 2010 and won gold at the 2020 Olympics, after Olympic bronze in 2016 and 2012. She was one of only three players, including Christine Sinclair and Sophie Schmidt, to win three straight Olympic medals. The 37-year-old Scott took to the international pitch for the last time with a win against Haiti, her 188th cap, in her hometown of Winnipeg. She will continue to play club football for the Northern Super League’s Ottawa Rapid.",
  "word_count": 6504,
  "scraped_at": "2026-02-14T12:21:13.186082"
}