{
  "article_id": "6b9f5b66b553",
  "url": "https://theathletic.com/5378301/2024/03/29/spanish-federation-fifa-meeting/",
  "title": "Spanish federation set for FIFA talks over organisational changes after recent scandals",
  "date": "20240329T213000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The acting head of the Spanish football federation, Pedro Rocha, will travel to FIFA headquarters in Zurich, Switzerland, next week to reassure the world governing body of changes his organisation is making after a number of recent scandals.\nRocha and FIFA president Gianni Infantino already met recently in London to speak about the federation’s situation, but more discussions are set to be held. According to federation (RFEF) sources — who, like all those cited in this article, asked to remain anonymous as they did not have permission to comment — Rocha’s managing committee will formally call elections to choose the next permanent president of the federation next week.\nAdvertisement\nFIFA sent a letter to the federation asking for explanations over how it is dealing with the recent scandals. RFEF sources said this consisted of five questions that centred on this month’s raid of its headquarters as part of an investigation into alleged corruption among other potential crimes. The search took place hours before Rocha and his committee were due to meet to formally announce a date for the presidential vote.\nSpain’s Superior Sports Council (the CSD) has also held talks with FIFA to express concerns over the state of the federation. Sources from the council say it offered to help FIFA if it wanted to intervene in the RFEF ahead of the 2030 World Cup, which Spain is set to co-host with Portugal and Morocco.\nThose with knowledge of the situation on both sides believe a FIFA intervention is highly unlikely.\nLast week, RFEF headquarters and the home of its former president Luis Rubiales were searched as part of an investigation into alleged corruption during his five years in charge.\nGO DEEPER\nSpanish football's fresh crisis: Rubiales latest and the RFEF raids explained\nInvestigators have confirmed they are looking at potential crimes including corruption, money laundering and misuse of federation funds between 2018 and 2023, potentially including the deal that took the Supercopa de Espana (Spain’s equivalent of England’s Community Shield) to Saudi Arabia and the construction work at Seville’s Estadio de la Cartuja. The stadium occasionally hosts the Spanish national team and has staged the Copa del Rey final since 2021.\nRubiales resigned in September after being initially suspended by FIFA following an allegedly non-consensual kiss on Spain player Jenni Hermoso after last year’s Women’s World Cup final.\nThe Athletic reported this week that Spanish prosecutors are seeking a two-and-a-half year prison sentence for Rubiales, consisting of one year for the charge of alleged sexual assault and one and a half years for alleged coercion.\nAdvertisement\nThe second charge also applies to the former head coach of the women’s team, Jorge Vilda, the federation’s former marketing manager Ruben Rivera and their former national team director Albert Luque — the ex-Newcastle United striker. On Wednesday, the RFEF announced it had suspended Rivera and Luque from their positions until “the legal case is clarified”.\nRubiales has always maintained the kiss on Hermoso was consensual; Hermoso has testified the kiss was not consensual. Meanwhile, Spanish media have previously reported that Vilda, Rivera and Luque have denied the charge of coercion in court testimonies.\nThis week, the RFEF said that its managing committee would be conducting a “forensic audit” of the organisation. It said the federation “disassociates itself from the actions of its ex-president and all those who could have been involved” and added that it guaranteed the “stability of this institution” to “FIFA, UEFA, the CSD and all fans”.\nRubiales handpicked Rocha as his successor after the incidents the former was involved in at the World Cup final, but before he was suspended by FIFA.\nBefore the raids on the RFEF headquarters, the Spanish government was asked to suspend Rocha immediately from all duties after a legal challenge from Miguel Galan, the president of the National Football Coaches Union. He argued Rocha had not followed the federation’s statutes by failing to call elections for Rubiales’ successor and had carried out a number of actions beyond his responsibilities as acting president.\nThe investigation by the Guardia Civil — one of Spain’s two national police forces — into the awarding of the Supercopa to Saudi Arabia also stemmed from a legal complaint made by Galan in 2022.\n(Jonathan Nackstrand/AFP via Getty Images)",
  "word_count": 708,
  "scraped_at": "2026-02-14T12:31:35.025163"
}