{
  "article_id": "6ba1885a8f90",
  "url": "https://www.yahoo.com/news/articles/7-changes-trump-made-planning-212315947.html",
  "title": "7 Changes Trump Has Made ( Or Is Planning To Make ) To The White House In Just A Few Short Months",
  "date": "20250819T230000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Trump Is Spending Over $200 Million Redecorating The White House, And The Photos Are Wild\nRenovating the White House while in office is hardly a new sentiment. As The Architect’s Newspaper points out: Barack Obama converted a tennis court into a basketball court. Jimmy Carter added solar panels to the roof. Jacqueline Kennedy meticulously restored state rooms for a nationally televised tour. And Harry Truman rebuilt the place from the inside out to keep it from collapsing. So it’s no surprise that, amid a busy second-term agenda, President Trump has made some changes of his own to the White House.\nHowever, while past presidents’ projects leaned toward preservation or practicality, Trump’s tend to lean toward his own personal brand of opulence. Many design choices resemble those of his other properties — most notably Mar-a-Lago, pictured below — inspired by Louis XIV’s Versailles and the Gilded Age aesthetic.\nSome touches, like swapping in a Reagan-era rug or surrounding the Oval Office with military branch flags, are more cosmetic than consequential. Others are built to last. Here are seven notable changes from his first few months in office so far:\n1.A repaved Rose Garden:\nThis month marked the completion of Trump’s renovated Rose Garden. The president first announced plans to pave over the Rose Garden — or, more specifically, the grassy lawn in its center — back in March, citing it as an inconvenience, especially for women in high heels. “When we had a press conference, you’d sink into the mud,” Trump recently told reporters. “It was grass and it was very wet — always wet and damp and wet. And if it rained, it would take three, four, five days to dry out, and we couldn’t use it really for the intended purpose.”\nWhile the flowers along the perimeter remain, photos of the garden mid-renovation went viral last month, sparking criticism after workers tore up the grass to lay pavement for a new patio. The design, modeled after the one at Mar-a-Lago — Trump’s self-styled “Winter White House” — features drainage and the White House emblem stamped around its perimeter.\nFirst lady Edith Roosevelt established the “colonial garden” in 1902, and by 1913, first lady Ellen Axson Wilson added its hedges and roses. However, it was John F. Kennedy who later transformed it into the modern-day Rose Garden in 1962. In the years since, the Rose Garden has hosted countless moments, from Tricia Nixon’s wedding to annual turkey pardons.\nDuring Trump’s first presidency, first lady Melania Trump oversaw modest updates to the iconic garden — a 3-foot-wide limestone walking path to improve accessibility, better drainage, and technical fixes. This time, Trump floated ideas like limestone or interchangeable hardwood floors for dancing before settling on the final design: a white stone patio, complete with white tables and chairs.\n“It’s a beautiful white stone, and it’s a stone that’s the same color as the White House itself,\" Trump announced. “And because it’s very white, it’s going to reflect the heat, and it’s not going to be very hot. Yeah, we’ve got great reviews of the Rose Garden.”\n2.Two towering flagpoles:\nOn June 18, Trump watched for nearly an hour as construction workers installed two flagpoles on the White House lawn. True to form, Trump told reporters — who were present on what was the fifth day of the Israel-Iran conflict to ask the president if he would order a US military strike on nuclear facilities in Iran — “These are the best poles anywhere in the country or in the world.” According to the president, each pole is 88 feet tall and costs “like $50,000.” For reference, the White House is 70 feet tall on the south side and 60 feet tall on the north side.\nThe president went on to explain: “They put sand inside, and if they use dirt or anything else other than sand, it rots out the pole over a period of years. But sand, for some reason, chemically just works. It gives you flexibility and it doesn’t do anything to the cask.” After the installation of the poles, five men had to work together to hoist up proportionately large American flags.\nThe “very exciting project,” as described by Trump, has been on his mind for “a long time.” “In the first term I had it,” he revealed to reporters, “but, you know, you guys were after me. I said I had to focus. I was the hunted. And now I’m the hunter. There’s a big difference.” In 2006, Trump sued the town of Palm Beach for $10 million and then $25 million after violating town ordinances by putting up an 80-foot flagpole on the grounds of Mar-a-Lago. While the town began fining Trump $1,250 per day in 2007, it eventually settled and allowed Trump to install a 70-foot flagpole farther inland.\n“I love construction,” Trump told reporters outside the White House, “I love it, I know it better than anybody.” A few hours later, Trump and others saluted an American flag on one of the newly erected flagpoles for the swearing-in of Charles Kushner — a real estate developer, convicted felon who was disbarred in three states, and father-in-law of Ivanka Trump — as the new French ambassador.\nVisitors can now see the new flagpoles on the north and south sides of the White House.\n3.A $200 million ballroom:\nAccording to its official website, despite being “one of the most beautiful and historic buildings in the world,” the White House “is currently unable to host major functions honoring world leaders and other countries without having to install a large and unsightly tent approximately 100 yards away from the main building entrance.” Unfortunately, the White House’s East Room only has a 200-person seated capacity.\nFortunately, President Trump “has expressed his commitment to solving this problem on behalf of future Administrations and the American people.” In a phone interview with NBC News, he explained that it’s a disaster when it rains or snows, as guests must be shuttled “a football field away from the White House.” Therefore, as per whitehouse.gov, the White House will be taking down the East Wing to build a state ballroom, “a much-needed and exquisite addition of approximately 90,000 total square feet of ornately designed and carefully crafted space, with a seated capacity of 650 people.”\nThe site goes on to address the $200 million cost of renovations by noting the generous commitment of Trump and other patriot donors to donate the funds for the structure, as well as security enhancements and modifications. Trump has called the state ballroom “his gift to the country” and “a great legacy project.”\nThe brief also includes renderings of the 90,000-square-foot ballroom, including an interior shot depicting gold chandeliers, inlays, and lamps. The style seems to emulate Mar-a-Lago’s Louis XIV-style main event room. At a meeting with the European Commission president at his Turnberry golf resort in Scotland last month, Trump commented: “No president knew how to build a ballroom. I could take this one, drop it right down there, and it would be beautiful.”\nRelated: People Are Roasting \"MAGA Makeup\" On TikTok, And It Might Be The Shadiest Thing I've Seen All Year\nMcCrery Architects, a firm that has specialized in religious architecture, has been chosen as lead architect. The firm’s CEO, Jim McCrery, studied under prominent American architectural theorist Peter Eisenman — a member of the “New York Five” whose works include the City of Culture of Galicia in Spain and the Memorial to the Murdered Jews of Europe in Germany — in the 1980s. Eisenman called McCrery’s ballroom design “bonkers,” according to Punch List Architecture Newsletter.\nConstruction is set to begin in September and, according to the White House, will be completed “long before the end of President Trump’s term.”\n4.A gold Oval Office:\nIn theme with his gilded style, Trump has introduced a relentless parade of gold pieces and accents throughout the Oval Office. The mantle is now covered in gold — gold medallions, gold vermeil figurines, gold accents on the fireplace panels. Gold trim now traces the wall molding. Gilded Rococo mirrors hang over the doors. Even the TV remote has been covered in gold.\nOn the Resolute Desk sits a gold drink coaster box — “TRUMP” emblazoned on the sides and the presidential seal on its faces — next to a golden urn. Gold eagles perch on each side table. Gold cherubs, shipped from Mar-a-Lago, gaze down from atop the doorways. “It’s angels,” Trump told Fox News host Laura Ingraham during an exclusive tour. “They say angels bring good luck, and we need a lot of luck in this country with what they’ve done over the last four years.”\nLike all US presidents, Trump has selected certain portraits of historic American figures to hang on the walls — but his are framed in gold. George Washington and Ronald Reagan now hold the most prominent spots. The frames are thick, ornate, and closely spaced, leaving little negative space between them. Unable to acquire the original from its display in the National Archives Building, Trump settled for a replica of the Declaration of Independence, framed in gold and shielded from sunlight by blue drapery.\nPerhaps a more personal touch, a gold-plated replica of the FIFA World Cup trophy sits alongside framed photos of Trump and his family.\n5.The Framed Mugshot Display\nVisible to world leaders and visitors alike, Trump has hung a gold-framed copy of the New York Post cover featuring his mugshot right outside the Oval Office. Taken at the Fulton County Jail, the photo comes from a 2023 Georgia racketeering case in which Trump and 18 codefendants pleaded not guilty to charges tied to efforts to overturn the state’s 2020 election results. It hangs in the hallway leading to the Cabinet Room.\nAt a 2024 campaign rally, Trump asked supporters if they liked his mugshot. “It’s the No. 1 selling mug shot in history! It beat Elvis, and it beat Frank Sinatra. Did you know that?” he said. “I’m proud to admit, and I’m proud to tell you: You have made mine bigger than both of them — by a lot.”\nRelated: Gavin Newsom Is Going Viral For Shutting Down JD Vance With One Single Map\nAccording to reports, the framed mugshot has been on display since early in Trump’s second term. On February 4, it appeared in a photo of Trump meeting with Israeli Prime Minister Benjamin Netanyahu to discuss tariffs and Israel’s ongoing military offensive in Gaza, which multiple international bodies have condemned as genocidal. That same day, White House Deputy Chief of Staff Dan Scavino posted a video of the framed mugshot on X with the caption: “HAPPY VALENTINE’S DAY!!! WELCOME TO THE BEAUTIFUL OVAL OFFICE.”\nHAPPY VALENTINE’S DAY!WELCOME TO THE BEAUTIFUL OVAL OFFICE @WHITEHOUSE❤️… pic.twitter.com/XGrW3Uu9H0\n— Dan Scavino (@Scavino47) February 14, 2025\n6.A re-remodeled Lincoln Bathroom:\nWhile offering little detail, Trump has said he plans to replace a “terribly” remodeled bathroom in the Lincoln Bedroom. He has described the new version as truer to the style of Lincoln’s era — mid-19th-century American interior design. For the 1860s White House, that means Victorian décor with American influence: heavy dark woods, ornate carved furniture, and decorative details such as cornices, ceiling medallions, and — in keeping with Trump’s other changes — gilded moldings.\nAccording to historical documentation, Lincoln’s White House favored the American Empire style, which was shifting toward Victorian Rococo Revival — a blend of neoclassical influence and heavier ornamentation fashionable during the Civil War years. In 1865, Lincoln led the Union to victory over the Confederacy, after Southern states — many of which now form the core of Trump’s political base — seceded over the institution of slavery, described by Mississippi in 1861 as “the greatest material interest of the world.”\n7.And, lastly, a Diet Coke button:\nPerhaps the most low-key change, Trump has reinstated the Diet Coke button on the Resolute Desk in the Oval Office, which summons a valet who serves the president a Diet Coke on a silver platter. The button initially appeared during Trump’s first term but was reportedly removed — or at least repurposed — during Biden’s presidency.\nIn 2017, when Financial Times reporter Demetri Sevastopulo interviewed Trump in the Oval Office, he joked that it was the nuclear button. “No, no, everyone thinks it is,” Trump replied. “Everyone does get a little nervous when I press that button.” He then pressed the button, and a Diet Coke appeared.\nIn a statement commenting on these changes, White House Chief of Staff Susie Wiles said, “President Trump is a builder at heart and has an extraordinary eye for detail.\" She also commented: “The president and the Trump White House are fully committed to working with the appropriate organizations to preserve the special history of the White House while building a beautiful ballroom that can be enjoyed by future administrations and generations of Americans to come.”\nWell, what do you think of these changes and/or Trump’s “eye?” Let us know in the comments below.\nAlso in In the News: Trump Thought Alaska Was Russia, And The Internet Is Having An Absolute Field Day With It\nAlso in In the News: 14 Happy News Stories From This Week That Won't Cure Your Depression, But Might Lighten The Mental Load\nAlso in In the News: Gavin Newsom Has Been Roasting MAGA Left And Right, And WOW, Is It Entertaining",
  "word_count": 2230,
  "scraped_at": "2026-02-14T14:18:33.472076"
}