{
  "article_id": "6ba888e3a285",
  "url": "https://www.kpbs.org/podcasts/san-diego-news-now/new-program-fast-tracks-housing-permits",
  "title": "New program fast - tracks housing permits",
  "date": "20240318T150000Z",
  "domain": "kpbs.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New program fast-tracks housing permits\nGood Morning, I’m Debbie Cruz….it’s Monday, March 18th.\nThe city of San Diego is launching a program to fast-track housing permits.More on that next. But first... let’s do the headlines….\n######\nMayor Todd Gloria will face San Diego police officer Larry Turner in the November runoff for the city of San Diego’s mayor seat.\nGloria received half the primary votes, and Turner nearly a quarter.\nThe three remaining candidates, including attorney Geneviéve Jones-Wright, did not receive enough votes to move forward.\n########\nMore people moved out of, than into, the county last year – almost 31,000 more, according to new census data.\nAside from the early pandemic, that’s the largest exit in nearly three decades.\nThe county’s population declined as a result, despite births and international immigration.\nThe nonprofit, United Way of San Diego, points to cost of living as the main reason why.\n\"36 percent of our residents are unable to make enough money to even barely survive here. So it's no wonder that people are looking for some other places to live where they can do more, afford more, provide for their families in ways that are not so stressful.\"\n########\nThe county might be facing an unexpected 28 million dollar bill.\nThey spent it housing homeless people during the pandemic, expecting the federal government to pay them back.\nBut FEMA announced it’s limiting reimbursements.\nThat could challenge the county budget, already strained by flood relief efforts.\nOfficials are urging FEMA to reconsider.\n#########\nFrom KPBS, you’re listening to San Diego News Now.Stay with me for more of the local news you need.\n##########\nA new program aims to speed up housing construction in San Diego.\nIt requires proposed housing projects under the Complete Communities Program to be reviewed within 30 days.\nThat program prioritizes building housing near public transit.\nDrew Orenstein (oren-steen) is the CEO of the real estate developer, Impact Housing.\nHe praised the new program.\nWith Complete Communities Now, we expect to have more projects coming to San Diego to be able to deliver those units even faster than we've delivered them now and provide deeper affordability for the San Diegans that really do need this housing to have a good quality of life.\nLast year, the city issued permits for nearly 10-thousand new homes.\nThat’s an increase of roughly 82 percent over the prior year, and the highest total since at least 2005.\nBut, according to the state, the city needs roughly 13,500 new homes built each year, to meet demand.\n##########\nVeterans Affairs announced last week, it wants to find housing for more than 40,000 veterans nationwide by the end of this fiscal year, including almost 900 in San Diego.\nMilitary and veterans reporter Andrew Dyer has more on how it plans to do it.\nThe VA has community partnerships and purpose-built programs like the Aspire Center in Old Town to address veteran homelessness. One of its other key tools is the HUD-VASH program, which connects veterans with housing vouchers and rental units. Jonathan Flood manages the program at the San Diego VA. He says the tight housing market presents a particular challenge for local formerly homeless veterans. “So that right now is really our greatest need because we know, once we have the housing, we can, we can lease the veteran in that unit.” The VA says it’s found housing for more than 300 San Diego veterans since October and is on-track to meet – or almost meet – its goal this year. More than 21,000 homeless veterans found housing through the HUD-VASH program nationwide last year. Andrew Dyer, KPBS News\n##########\nSan Diego Gas and Electric bills will be a bit higher in March.\nEnvironment reporter Erik Anderson says the utility is raising rates a month after reporting profits.\nSan Diego Gas and Electric delivery charges are going up nearly nine percent this month. SDG&E’s Anthony Wagner says that’s about eight dollars for the average customer. This also comes after the utility unexpectedly cut rates in January, but the March increase clawed back most of the savings. The Utility Reform Network’s Mark Toney says it’s too much. “A lot of people are questioning why is it, that SDG&E needs more money. Their shareholders seem to be doing just fine. It’s the customers that are hurting. It’s the customers that are feeling the pain.” The move comes after the investor-owned utility recently posted record profits of 936 million dollars. Erik Anderson KPBS News\n##########\nComing up . . . hundreds of elementary school students assist the pros to bring a symphony to Rady Shell next month. We’ll have that story and more, just after the break.\n######\nThe San Diego Wave has been sold for 113 million dollars – a record team value for the national women’s soccer league.\nReporter Thomas Fudge tells us what this means for women’s sports.\nThe Wave begin their 2024 season, following a very successful one last year when they were the highest scoring team in the NWSL. The price paid for the Wave, by the Levine Leichtman family, was close to two times the 63 million dollars paid for the Portland Thorns about two months ago. KPBS business commentator and co-founder of Bottom line Marketing, Miro Copic, says this indicates the rising value of women’s sports franchises. He says business analyst Deloitte estimates women’s sports revenues this year will exceed 1.2 billion dollars. “That’s 300 percent higher than they projected in 2021. So just in a couple of years, the value of women’s sports franchises has exploded.” The Wave played Gotham FC Friday in the Challenge Cup. They play their first regular season game against the Kansas City Current, in Snapdragon Stadium, on Saturday. Thomas Fudge, KPBS News\n######\nThere is a special San Diego Symphony concert coming to the Rady Shell next month.\nIt will include two performances by professional musicians with some help from hundreds of elementary school students.\nEducation Reporter M.G. Perez has more on the interactive music program providing lessons in sound and silence.\nThis is music to the ears of students at Sandburg Elementary in Mira Mesa. For the past several weeks, third, fourth, and fifth graders …have been learning music vocabulary and getting an education in how orchestras and instruments work together. The bassoon..compliments the flute.. This collaboration is created by musicians from the San Diego Symphony’s woodwind quintet. Max Opferkuch (offer-cook) is the clarinetist…who admits he stumbled into playing this particular instrument. “I thought it looked cool…and I was able to get a sound out of it right away…which is not the case for most of the other instruments.” 2-hundred 15 students from Sandburg Elementary enjoyed the quintet’s concert at their school…it’s a bonus to the curriculum they’ve been learning with Sound and Silence. The Symphony’s Stephan Salts .. “Sound and Silence are these two characters who meet in their universe..Sound is really energetic..he can sing high pitches and low pitches…Silence’s character is kind of shocked by all this new knowledge.” Together the cartoonish Sound and Silence join professional musicians to teach students about music concepts like pitch….melody…and tempo. “I learned that the tempo can be fast…like…really fast…” 9-year old Dexter Dang is a 4th-grade student who’s already played some piano….but it’s the cello he’s working with now…the Sound and Silence lessons have inspired him to keep on learning “try out other instruments and then maybe go back to the cello..or stay with whatever I like…and maybe be a musician WHAT DO YOU WANT TO BE WHEN YOU GROW UP, Dexter? …I don’t know actually.” “The song I’m currently learning is Whole Lot of Love by Led Zepplin…” His classmate Aziza DeNevares is more certain about her future in music…she’s tried the flute…but her creative heart is elsewhere.. “My big passion is guitar. I really love it…so I want to be a guitarist or an artist when I grow up.” There are nine weeks of curriculum …culminating with a special concert at the Rady Shell on April 19th…where students will join the San Diego Symphony using their new knowledge and their bodies as percussion instruments…Stephan Salts says its the ultimate in interactive learning. “that’s this whole pattern claps, snaps, and drum rolls on the lap..and it occurs on a very rhythmic piece that the symphony will open with.” Sound and Silence working with professionals to make sure students can hear the music and the message. Riza Eusebio is one of the Sandburg Elementary teachers.. “it’s important for them to know in the creative arts it’s a profession and it’s definitely something to consider.” “it’s little opportunities like this ..might seem like they don’t mean much …but they do plant a seed in the kid’s heads.”…and Stephan Salts…with the grand finish…“if they already play an instrument at their school or if their school even has a music program at all…or if this is just something that’s brand new to them for instance …maybe they’ve never even heard a recording of a symphony orchestra before” They have now.. MGP KPBS News\n######\nSan Diego Theatre Month is offering theater, comedy and dance shows at discount prices.\nThe annual tradition was started by the San Diego Performing Arts League.\nBoard President Jay Hensley says they hope it will draw audiences back in.\nWe don't want the price of theater to be a hindrance for people to experience that magic of live performance. And so theater week was born as a way to highlight what we have here, but also create more accessibility for the performing arts.\nFor the discount code and more information, visit San Diego Theatre Month dot com.\nThat’s it for the podcast today. As always you can find more San Diego news online at KPBS dot org. Join us again tomorrow for the day’s top stories. I’m Debbie Cruz. Thanks for listening and have a great Monday.",
  "word_count": 1643,
  "scraped_at": "2026-02-14T12:17:16.809622"
}