{
  "article_id": "6ba823d680fa",
  "url": "https://www.walesonline.co.uk/news/wales-news/hollywood-star-blake-lively-fans-26564487",
  "title": "Hollywood star Blake Lively has fans in stitches with pitchside quip at second Wrexham game in two days",
  "date": "20230326T184500Z",
  "domain": "walesonline.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hollywood star Blake Lively has fans in stitches with pitchside quip at second Wrexham game in two days\n\"Did I say that?”\nAt Wrexham, it’s co-owner Ryan Reynolds known for his witty craic, but his Hollywood actress wife Blake Lively left Wrexham fans in stitches with her show of wit on Sunday. Reynolds and co-owner Rob McElhenney were in Wrexham at the weekend taking in the Racecourse Ground’s double-header of high-stakes Wrexham drama, with both the men’s and women’s teams claiming league victories in front of record crowds.\nAnd while completing a lap of honour to a standing ovation of Wrexham fans after Wrexham Women’s 2-1 win over Connah’s Quay Nomads on Sunday, Lively was implored by a supporter to say hi to his girlfriend Stephanie. The Gossip Girl actress duly obliged, before adding the cheeky instruction: “You should leave him!\" and adding with faux shock: \"Did I say that?”\nSupporters were left in hysterics at the pitchside exchange, with Stephanie apparently “over the moon” at receiving the video message, which has also been posted onto social media. Wrexham Women rounded off a sensational league season with a 12th win from 12 as Rosie Hughes’ 84th-minute winner clinched all three points in front of a record Welsh domestic crowd of 9,511.\nRead more: Gorgeous interview with Wrexham goal-scoring hero has Hollywood owners in awe\nThe Adran North champions will next face Adran South champions Briton Ferry on April 16 in the play-off final. Win that and Wrexham will progress to the top flight of Welsh domestic women's football next season, the Adran Premier, alongside the likes of Cardiff City Women and Swansea City Ladies.\nShould that happen, Wrexham have already committed to turn their women's team into a semi-professional outfit. It would become the first football club in the Welsh pyramid to have a semi-professional women's team.\nThe club, owned by Ryan Reynolds and Rob McElhenney, wants its team to become \"the best women's team in Wales, in the shortest period practically possible.\" While her Deadpool actor husband is a co-owner of the club, Blake is directly involved with sponsorship of Wrexham Women. In July 2022, her company 'Betty Buzz' became sleeve sponsor for the team. The non-alcoholic drink mixer company was founded in the same year.\nRead more:\nWales Six Nations star dedicates try to late mam and number one fan who died two months ago\nJoyful chaos among Wales fans in stadium captured by epic photo\nWRU vote results announced as clubs back radical changes at EGM\nA farewell from Helen Ward, the Welsh fighter left sobbing at never playing for Wales again",
  "word_count": 435,
  "scraped_at": "2026-02-14T12:44:53.752561"
}