{
  "article_id": "6baaec764ebb",
  "url": "https://www.ems1.com:443/medical-treatment/articles/knee-dislocation-lessons-for-ems-vrKdzC8JLjcQslpD/",
  "title": "Knee dislocation : Lessons for EMS",
  "date": "20230617T081500Z",
  "domain": "ems1.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "One of my sons is an avid baseball fan. He played little league, high school baseball (until he tore his ACL getting to first base) and watched every movie that came along that remotely related to baseball, and there were many of them.\n“Sandlot,” “The Rookie,” and an intriguing, historically based movie about young women recruited into professional baseball during World War II called “A League of Their Own.” It starred some famous names like Geena Davis, Madonna, and Tom Hanks.\nIf you haven’t watched this movie you might enjoy it. These were ambitious, tough women who, like many other women during WWII, filled in the gaps left in the professional world by men who were absent.\nI’ve sat at many of my son’s baseball games with the girl’s softball diamond just behind us. Staring at a hard fastball coming at your face means the guys are no slouches, but the girls!! Like the women in “A League of Their Own” (who did it in skirts), these girls are sliding into 2nd base with shorts on! The guys get to wear long pants.\nAdditionally, the girls are in constant verbal motion — clapping in rhythm, cheering and loudly encouraging their teammates. The boy’s baseball is a relatively quiet experience.\nGot the picture? Are you there yet – sitting at a girl’s softball game on a balmy summer evening, watching the action?\nA “dislocated knee”\nIn the Central Valley of California we have a “league of our own.” It is comprised of middle aged (and younger) people who didn’t quite get on the train to the Show, and the weekend athletes are getting injured in droves with their death defying maneuvers.\nSpeaking of death defying sports maneuvers, I did one of those myself in college during a soccer game, with a resultant decimation of my knee joint, damage to several ligaments, and a later surgery.\nWith the days getting longer and the sky a beautiful blue, this last Saturday was no exception, and my shift in the ED unfolded this way.\nA call over the radio announced the impending arrival of an athlete. A female softball player (not Geena Davis unfortunately!), mid 30s, had been racing for second base.\nThe second baseman (basewoman?) had different ideas and, when the dust settled, the runner was on the ground, yelling and holding her knee. 911 was called, the medic (a new graduate) assessed the patient, put some padding around the knee, and transported the patient. The radio call mentioned a “dislocated knee,” and soon the patient was in my ED.\nWhen I approached my patient I could tell she was scared and in pain. Using my best soothing voice, I told her that everything would be okay and that I would make her pain better. I was true to my word, and several micrograms of fentanyl later, when she actually smiled, I was able to examine the knee more closely. Once again, better living through chemistry!\nThe knee was slightly flexed, with an obvious bulge pushing out on the anterio-lateral aspect of the knee. After I checked the remainder of the knee, I gave some more fentanyl, and applied a gentle push on the bulge as I straightened the leg. Voila! the bulge went away, and the knee looked better.\nAfter some x-rays and an additional re-exam, I was able to send the patient home with a knee immobilizer in place, a pain prescription and an appointment to see an orthopedist.\nThe novice medic came to me later, and we talked the case over. Here are some of the things we discussed.\nLessons for EMS\nThe patient had actually suffered a dislocation of the patella, and not a true “knee dislocation.” I’d like to quickly review the knee, and help you understand the difference between knee dislocations and patellar dislocations.\nThe knee is one of the more amazing joints of the body. It makes one of the strongest, and most mobile joints. It is comprised of three basic elements: bone, ligaments and cartilage, with some nerve innervation. Here’s a quick description of the structures and their functions.\nKnee joint: The femur and the tibia meet to form a joint.\nPatella: The “kneecap” – a mobile bone that protects the front of the knee.\nLigaments: These connect bone to bone and help to stabilize the knee.\nCollateral ligaments: Run along the sides of the knee and limit sideways motion:\n- Medial collateral ligament (inside aspect of the knee joint) connects the tibia to the femur\n- Ateral collateral ligament (outside aspect of the knee joint) connects the tibia and fibula to the femur\nCruciate ligaments: Connect the tibia to the femur at the center of the knee. Together, they function to limit rotation, forward, and backward motion of the tibia:\n- Anterior cruciate ligament (ACL)\n- Posterior cruciate ligament (PCL)\nMeniscus: Cartilage that acts like a shock absorber\n- Medial meniscus: located on the inside aspect of the knee joint\n- Ateral meniscus: located on the outside aspect of the knee joint\nHowever, the knee joint is much more than a simple hinge. In addition to flexing and extending (like a hinge), the normal knee also glides and rotates. As you extend your leg, the tibia rotates externally.\nWe are only really beginning to understand the static and dynamic forces that occur when we take a step. What is clear is that this orchestration of motion provides for dynamic stabilization of the joint. The fact that robotics is beginning to replicate the orthotic actions of the knee is nothing short of amazing!\nWe have the use of our knees from the very first day of our earthly existence. We take it for granted, but it is such a paradox — complex and dynamic in its function, yet simplicity itself in its anatomy.\nGetting back to the kneecap, or patella. The patella is an interesting structure. The patella is actually part of the tendon of the quadriceps muscle that straightens the knee. The outer surface of the patella, the one that we can feel with our hand, is smooth with rounded edges.\nUnderneath, it is a different story. A V-shaped ridge extends from the top to the bottom of the patella, and this ridge is designed to slide inside a grooved space formed by the condyle at the end of the femur. This configuration helps keep the patella sliding correctly in the groove with flexion and extension.\nA patellar dislocation is simply where the patella has slipped out of the groove. You can see in the x-ray above, why there would be an an anterio-lateral bulge in my patient’s knee. In contrast, in a knee dislocation the knee joint itself has been disrupted, and all the ligaments that hold the tibia and femur together have been torn. (See x-ray below).\nFacts about patellar dislocations\n- More common in teenage girls and young women.\n- Usually caused by forceful deceleration with concurrent knee rotation.\n- This results in the patella being displaced laterally out of groove, and there it stays.\nKey Points\n- Most people who tell me they “dislocated their knee,” but who are not in tears, probably just dislocated their patella. A true knee dislocation is extremely painful and more extensive.\n- Sometimes, the process of stabilizing the knee might reduce a patellar dislocation. If that happens, your patient will thank you!\n- Always check and document the N-V status before and after your stabilization process.\nA\"True” Knee Dislocation\nThe knee is a very stable joint, and it requires high-energy trauma to produce dislocation. (Think car vs. pedestrian; high-speed MVA; professional football tackles.) Some of the major ligaments are always ruptured for a knee dislocation to occur.\nIn a “true” knee dislocation, you will see a gross deformity of the knee with swelling and immobility, but up to half of knee dislocations are reduced by the time they arrive in the ED and may not be obvious.\nTrue knee dislocations have a high incidence of vascular injury, even if they are “reduced.” Normal distal pulses won’t rule out a vascular injury however.\nA careful vascular examination is required. The major artery that runs behind the knee is the popliteal (POP-la-teel) artery, and it may get inured in true dislocations. Artery injury has been reported in a broad range from 7-64% of dislocations. Obviously, an absent or diminished pulse in the foot spells trouble, but a “normal” pulse doesn’t rule out an injury.\nIn addition to arterial injuries, nerves are at even greater risk of injury with dislocations. The peroneal (puh-ROE-nee-uhl) nerve travels down and wraps around the fibula on the lateral aspect of the knee. This nerve innervates the muscles that lift the foot and toes, and it can get injured in 25-35% of patients with knee dislocations. Foot drop may be a permanent result from injury of this nerve.\nExamination of a knee injury\n- Reassure: Speak reassuringly to the patient. They are scared and hurt and want to make sure you aren’t going to hurt them further.\n- Be gentle: Be gentle in your approach to the knee. No sudden moves!\n- Ask: Ask the patient where it hurts, and have them point to the place.\n- Palpate: Start gently palpating any place that you expect to find absolutely NO pain — choose somewhere far away from injury.\nFor a knee injury I may start off palpating their foot, or even the other leg!! I don’t want them to feel any pain (and to get them to trust me). It reassures them, and you can show that you are gentle and slow, asking them over and over “does this hurt” as you get closer to the real injury.\nSo in closing, thanks for taking care of all of the weekend athletes (including me), and remember this checklist:\n- Check (and document!) the pulses in the feet\n- Check for strength in the toes and feet\n- Check for sensation, and look for numbness between the big toe and the next\n- Splint the leg and don’t forget pain meds!\nBy the way, my son recovered from his ACL injury and still loves baseball, and I recovered from my knee injury, but have given up downhill skiing and showy soccer moves.\nThis article, originally published in 2011, has been updated.",
  "word_count": 1717,
  "scraped_at": "2026-02-14T12:14:39.619351"
}