{
  "article_id": "6bab1e2ce24b",
  "url": "https://www.afaqs.com/news/advertising/shahid-kapoors-new-ad-for-khiladi-official-shines-a-light-on-advertising-from-betting-brands",
  "title": "Shahid Kapoor new ad for Khiladi Official shines a light on advertising from betting brands",
  "date": "20230216T021500Z",
  "domain": "afaqs.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A GOI advisory, in 2022, asked print, electronic, and digital media to refrain from publishing online betting platform ads.\nActor Shahid Kapoor’s new ad for Khiladi Official is noteworthy. The 23-second ad, a brainchild of ArtE Mediatech, focusses on the actor haggling for a higher raise because, as Kapoor puts it, a player knows his value.\nInnocuous? Almost.\nA glance at Khiladi Official’s Instagram account reveals that it’s a betting platform. ‘Unlock India’s Biggest Betting Exchange & Reap the Highest Bonuses!’ reads the account’s bio.\nA visit to its website backs up the bio, because one can bet on sports such as cricket, tennis, soccer, horse racing and basketball, and also indulge in games like Teen Patti, Lucky7, Poker, Roulette, among others.\nBetting is illegal in most parts of India. In 2022, the Information and Broadcasting Ministry issued an advisory to print and electronic media, asking them to refrain from publishing ads of online betting platforms.\nThe ad, starring Kapoor is, as of now, available for viewing on the actor’s Instagram handle.\nQuestions sent to the Khiladi Official on where it plans to run its ads, haven’t elicited any response till now.\nAlso Read: Is ‘news’ the surrogate advertising route for betting platforms?\nThis government advisory may lead such platforms to resort to surrogate advertising. In the case of betting platforms, most, if not all, have resorted to launching news platforms.\nKhiladi Official owns KhiladiX, a sports news site and a principal sponsor of the Abu Dhabi Knight Riders, a cricket team of Dubai's T20 league.\nThe government, in June 2022, banned surrogate ads under the provisions of the Consumer Protection Act (CPA). As a result, a TAM AdEx report in November of the same year revealed betting ads on TV and digital media platforms dropped by 65% and 56% respectively in October, as compared to September.\nIt’s important to note that Kapoor became the face of Pokerbaazi, a poker platform, in July 2022. It is billed as a skill-based game.\nTo ensure that players don’t get addicted, the Advertising Standards Council of India (ASCI), adland’s watchdog, issued guidelines for real-money online gaming that ask brands to make users aware of the financial risks involved with such games.\nRecently, the BCCI issued a directive to the Women's Premier League (WPL) franchises, stating that they are not allowed to form any commercial partnerships or associations with businesses involved in cryptocurrencies, betting, gambling, real money, or tobacco.",
  "word_count": 405,
  "scraped_at": "2026-02-14T12:14:04.729667"
}