{
  "article_id": "6bb892df3742",
  "url": "https://www.politico.eu/newsletter/brussels-playbook/eu-enlargement-on-the-menu/",
  "title": "EU enlargement on the menu",
  "date": "20230821T063000Z",
  "domain": "politico.eu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By JAKOB HANKE VELA\nwith ZOYA SHEFTALOVICH\nSend tips here | Tweet @HankeVela | Listen to Playbook and view in your browser\nDRIVING THE DAY: EU ENLARGEMENT DINNER IN ATHENS\nOWLS TO ATHENS: Most of Brussels is still out of office, but the political machine is slowly picking up pace again. European Commission President Ursula von der Leyen and Council President Charles Michel are in Athens today for yet another dinner on EU enlargement.\nAppetizer: The meeting comes before the Commission’s regular enlargement update due in October, when the EU executive is expected to report on progress in negotiations with countries including Ukraine and Moldova, before leaders decide on opening full-on accession negotiations — a decision they are expected to take at their summit in December.\nDecades-long quest: Today’s meeting comes more than 20 years after then-EU leaders declared in Thessaloniki that “the future of the Balkans is within the European Union” and decided to hold periodical Western Balkan summits to keep the ball rolling.\nWho’s coming: Greek Prime Minister Kyriakos Mitsotakis is hosting the EU presidents, along with leaders from the Western Balkans and other aspirants — Ukraine’s President Volodymyr Zelenskyy has not yet confirmed whether he’s coming, but Athens was rife with rumors.\nWho’s not coming: Albania was invited but is not expected to attend, as Athens and Tirana are embroiled in a diplomatic fight over the continued imprisonment of Fredi Beleri, an ethnic Greek mayor of the town of Himare.\nSymbolism vs. action: Greece’s main opposition Syriza party accused the government of “hypocrisy,” pointing out Mitsotakis publicly calls for enlargement, but has frozen ratification of three technical cooperation agreements with neighboring North Macedonia, a candidate for EU accession. When he was in opposition, Mitsotakis strongly opposed an agreement signed in 2018 between Greece and North Macedonia that resolved a decades-long diplomatic dispute and unblocked the path for the Balkan country’s NATO and potential EU membership.\nSummer love-in: According to the Greek newspaper Kathimerini, von der Leyen and Mitsotakis agreed on her attendance at the meeting during her holiday at Mitsotakis’ summer house in Crete.\nHoliday drama: That private vacation raised eyebrows in Brussels (as reported by Playbook), with MEP Sophie in ‘t Veld warning that von der Leyen’s coziness with an EU leader “risks affecting the neutrality and objectivity of the Commission” — reminding her that Brussels is in charge of watching over EU countries and must be able take decisions (banning subsidies or launching infringement procedures, for instance) that could make such summer jaunts rather uncomfortable.\nNot over yet: In ‘t Veld called for a European Parliament debate and for the EU Ombudsman to determine whether the private trip was just that — or if it risked undermining the executive’s independence.\nMitsotakis for EUCO president? Greek daily Estia reported that von der Leyen discussed with Mitsotakis the possibility of him taking over the presidency of the European Council after the European election in 2024, my colleague Nektaria Stamouli writes in to report.\nReality check: That’s not von der Leyen’s decision to make, and it would be unusual for both presidents to be from the EPP. But it’s no surprise the Commission chief would like someone on the other side of Rue de la Loi with whom she actually gets along.\nENERGY POLITICS\nORBÁN’S GAS GAMBIT: As part of a bid to secure cheap supplies of natural gas, Hungarian Prime Minister Viktor Orbán held talks on Sunday with Ilham Aliyev, the president of fossil-fuel rich Azerbaijan, as Hungary celebrated its State Foundation Day.\nMutual benefit, worst timing: “Azerbaijan will provide 100 million cubic meters of gas this year and establish a gas transport link with Hungary,” Budapest said. Meanwhile, Azerbaijani media reported the high-level talks show Baku is “increasingly garnering interest as an appealing partner among its European counterparts.” Indeed, the EU has also courted Azerbaijan — von der Leyen flew there last summer to sign a gas deal with Aliyev.\nBut but but … Orbán’s deal comes just weeks after the EU’s top diplomat, Josep Borrell, said the bloc is “deeply concerned” about the burgeoning humanitarian crisis in Nagorno-Karabakh.\nEthnic cleansing fears: The breakaway region, inside Azerbaijan’s internationally recognized borders but controlled by its ethnic Armenian population, has been under a near-total blockade for more than two months, with aid organizations unable to deliver food or fuel and warnings that a “genocide” could be underway. The European Parliament even voted in favor of sanctions on Azerbaijani elites.\n**Join us on September 19 for POLITICO Live’s high-level panel discussion “Open Finance: the battle for data”. Organized in partnership with Payments Europe, this event will convene a frank discussion between experts and policy-makers about the protection of consumer data and the Commission’s Open Finance initiative. Register today.**\nRUSSIA’S WAR\nJETS FOR UKRAINE: The Netherlands and Denmark confirmed they will supply F-16 fighter jets to Kyiv around the new year, Reuters reports. In a visit to the Netherlands on Sunday, Volodymyr Zelenskyy hailed the move as a “breakthrough agreement,” Antoaneta Roussi writes.\nThe details: Denmark will deliver six F-16s to Ukraine around New Year, followed by eight later in 2024 and five more in 2025. The Netherlands has over 40 of the jets available but has yet to confirm how many Kyiv will receive.\nGRAIN INSURANCE: Ukraine is finalizing a scheme with global insurers to cover grain ships traveling to and from its Black Sea ports, the FT reports. Russia withdrew from the U.N.-brokered Black Sea Grain Initiative last month, leaving ships at risk of attack in the region. The new insurance scheme could be in place as early as next month.\nKULEBA ON COUNTEROFFENSIVE: Ukrainian Foreign Minister Dmytro Kuleba on Saturday pushed back against growing doubts about the prospects for the counteroffensive that Kyiv is waging against Russia. Speaking to Axel Springer, POLITICO’s parent company, Kuleba said “analysts should be more cautious in their projections” about the counteroffensive, and that Kyiv needs “more long-range capabilities to achieve more short-term results.” Read more here.\nZELENSKYY VOWS REVENGE FOR RUSSIAN STRIKES: Ukraine’s president promised retaliation after a Russian missile attack on Saturday killed seven people, including a 6-year-old girl, and injured 144. The missile hit the city center of Chernihiv, 150 kilometers north of Kyiv, on the day of an Orthodox festival. More from Antoaneta here.\nFOCUS ON RIGHT-WINGERS\nSPRINGTIME FOR EUROPE’S FASCISTS: Far-right parties are on the rise — but anyone who dismisses the trend as a seen-this-movie-before moment should be cautious, because Germany’s at the center of this storm. It’s one thing for Finland or Belgium to veer onto a far-right rail, writes POLITICO’s Matt Karnitschnig, “when it begins to happen in Germany, however, it’s time to start plotting an escape route.”\nNo leader: Unlike most far-right parties in Europe, Germany’s AfD lacks a charismatic leader such as Giorgia Meloni or Marine Le Pen. But that could change: Björn Höcke, one of the party’s most extreme figures whose views on race and migration recall Nazi and fascist theories of the 1930s, is gaining momentum.\nWAR ON BANKS COMING TO EU: Nigel Farage is back. The man who helped bring about Brexit has new a playbook for Europe’s populists, this time targeting supposedly “woke” banks, reports POLITICO’s Hannah Brenton.\nIN CASE YOU MISSED IT\nKURZ CHARGED: Former Austrian Chancellor Sebastian Kurz was indicted in Vienna on Friday for allegedly making false statements to a parliamentary inquiry in 2020. If convicted — a trial is set for October — Kurz, who denies the allegations, could face up to three years in prison. More from Matt Karnitschnig here.\nTHERE’S NO COUP IN SLOVAKIA! President Zuzana Čaputová said Slovakia’s police were not carrying out a coup, after several spy chiefs were arrested and charged with “establishing, forming and supporting a criminal group” last week. More from Claudia Chiappa here.\nMOSCOW’S SPACE RACE HOPES DASHED: Russia’s Luna-25 mission crash-landed on the moon after a malfunction.\nSPAIN MAKES FOOTBALL HISTORY: Spain on Sunday won the most-watched women’s football World Cup in history, beating England 1-0. FIFA has hailed the tournament as a smashing success, saying it broke ticket sales and TV viewership records.\nWhere were Sunak and Sánchez? Neither country’s leader traveled to Sydney to watch the game in person, as my colleague Karl Mathiesen reports.\nWhat the world is talking about this morning: The president of the Spanish football federation, Luis Rubiales, kissing forward Jenni Hermoso on the lips during the post-match ceremony, prompting outcry.\n**Have you heard? POLITICO Live’s Future of Food and Farming is back on September 28 and this year we are coming back with an offer you cannot refuse! Two passes tailored to what you need. Which one will you choose? Discover them now!**\nFOREIGN AFFAIRS\nNIGER UPDATE: Niger’s coup leader Abdourahamane Tchiani claimed he intends to return the country to civilian rule in three years, the BBC reports. Meanwhile, disagreements over how to respond to the coup are injecting fresh tension into the France-U.S. alliance, Nahal Toosi and Clea Caulcutt report.\nCHINA IS COMING FOR THE METAVERSE: Beijing wants to assert state control over the metaverse — and proposals reviewed by POLITICO show an eerie resemblance to the country’s controversial social credit systems, Gian Volpicelli reports.\nAnd speaking of China: British firms are being asked about their investments in a swathe of “sensitive” Chinese sectors as the U.K. seeks to move closer to Joe Biden’s clampdown on trade with Beijing, reports my colleague Graham Lanktree.\nAGENDA\n— High Representative Josep Borrell in Santander, Spain. Attends the Quo Vadis Europa? event at the Menéndez Pelayo International University.\n— Commission President Ursula von der Leyen participates in an informal dinner with leaders of the Western Balkans and other leaders from the area, at the invitation of Greece’s Prime Minister Kyriakos Mitsotakis.\nBRUSSELS CORNER\nITALIAN TRAIN GROUP WANTS TO LAUNCH HIGH-SPEED LINKS ACROSS EUROPE: Italy’s state-owned FS wants to extend high-speed services connecting Brussels and Amsterdam to Berlin, Paris and all the way to Barcelona — finally taking some competition to some of those routes, which have been monopolized for decades by legacy state-owned operators. The group wants to take advantage of EU rules that force countries to open up their train networks to competition. Read more in the FT.\nGOOD NEWS FOR TRAVELERS TO ANTWERP: Four IC trains per hour will run from Brussels to Antwerp as of September 4. SNCB cut the service back to three trains per hour at the beginning of 2022 due to staff shortages.\nTACKLING PROBLEMS AT BRUSSELS-MIDI: Belgian rail operator SNCB has sent a letter to the federal, regional and local authorities asking for more help in tackling the homelessness and drug-use problems at Brussels-Midi.\nThe letter: “The safety of passengers and staff is SNCB’s top priority, which requires each partner to assume its responsibilities … SNCB has neither the means nor the skills to tackle it alone,” writes SNCB’s CEO Sophie Dutordoir, adding that the situation is “dramatic.” She is calling for the creation of a single body to coordinate cleanliness and safety on site, and for a police station to be located near or inside the station.\nNEW PEDESTRIAN AND CYCLE ZONE: A 3-kilometer section of the busy motorway in the north of Brussels, between Avenue Van Praet and Avenue des Croix du Feu running near the Parc de Laeken, will be transformed into a pedestrian and cyclist-friendly zone. The project recently received an urban development permit.\nSPOTTED: An Apple Maps car was seen in Brussels crossing Rue de la Loi, along Rue de la Commerce, on Friday at around 1 p.m. Its cars are criss-crossing Brussels, Flanders and Wallonia until August 28, Apple says. H/t Pieter Haeck\nNEW GIGS: Farewell to Susanne Körber, who is leaving Brussels to take up a role at Germany’s Federal Foreign Office HQ in Berlin. Julian Fricke will take up the role as the new Coreper II spokesperson for Germany, starting today.\nJOB ADS: POLITICO is hiring! Our London newsroom is looking for a finance editor, finance reporters and a host for our Westminster Insider podcast.\nBIRTHDAYS: MEPs Ondřej Kovařík, Loucas Fourlas and Giuseppe Milazzo; Former MEP Esteban González Pons; Cédric de Meeûs from Holcim; Margaret Chan, former director-general of the WHO; Laura Dubois from the Financial Times.\nTHANKS to Nektaria Stamouli, Gabriel Gavin, Pieter Haeck, Playbook reporter Ketrin Jochecová, editor Jack Lahart and producer Seb Starcevic.\nSUBSCRIBE to the POLITICO newsletter family: Brussels Playbook | London Playbook | London Playbook PM | Playbook Paris | POLITICO Confidential | Sunday Crunch | EU Influence | London Influence | Digital Bridge | China Watcher | Berlin Bulletin | D.C. Playbook | D.C. Influence | Global Insider | All our POLITICO Pro policy morning newsletters",
  "word_count": 2107,
  "scraped_at": "2026-02-14T12:05:13.894213"
}