{
  "article_id": "6bf582739f61",
  "url": "https://www.islingtontribune.co.uk/article/red-wall-arsenal-stars-get-first-look-at-new-stadium-artwork",
  "title": "Red wall : Arsenal stars get first look at new stadium artwork",
  "date": "20230113T143000Z",
  "domain": "islingtontribune.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Red wall: Arsenal stars get first look at new stadium artwork\nGoal legend Ian Wright among those at glitzy opening\nFriday, 13th January 2023 — By Anna Lamche\nIan Wright\nARSENAL stars past and present got an early look at the new artwork set to adorn the stadium’s walls in a glitzy opening evening celebrating the club’s history, ethos and fan culture.\nGoal legend Ian Wright, club captain Martin Ødegaard and former Arsenal forward turned broadcaster Lianne Sanderson were among the great and the good to arrive at the Candid Arts Trust gallery in Angel to see the new banners on Wednesday night.\nThe eight new pieces of work, which will appear on stadium walls over the coming month, were designed by Turner prize- winning artist and Holloway Road resident Jeremy Deller, artist and “lifelong Gooner” Reuben Dangoor and graphic designer David Rudnick in collaboration with “over 100” supporters.\nFormer Arsenal striker Lianne Sanderson is on the wall\n“I insisted we had to start with the supporters and just take it from there,” Mr Deller told the Tribune. “I live on Holloway Road – I’m super local, so my experience of the Arsenal is really the fans, and that’s what I wanted to centre. There’s a lot of depictions of footballers, but it’s the fan culture that interests me.”\nRadio presenter and Arsenal fan Roman Kemp kicked off proceedings lauding the “incredible” new designs. “The best thing about it is that it proves that north London is red,” he said.\nClub supporters Jo Denham and Soner Hassan\nArsenal CEO Vinai Venkatesham thanked the “Arsenal family” for their contributions to the work. “We started with a complete blank canvas, and it was all about the heart, dedication, energy, the passion and the knowledge of our fans,” he said.\nThe design process began with a meeting at the Tollington Arms last spring, where supporters were asked to list the club’s biggest achievements, the quotes that “epitomise” the club and what Arsenal “means to you”, among other things.\nFrom there the artists developed a series of concepts – a variety of illustrations, flag-based designs and collages – that will go up on the stadium. They include famous victories and an image of the old Higbury stadium.\nThe success of the women’s team is included, having not been part of the old wrapround mural of male players put up when the stadium first opened.\nFormer Arsenal forward and broadcaster Lianne Sanderson, who appears in three of the designs, said: “To see my picture here… I think it won’t really sink in until later on.\n“It is a massive honour to be recognised along with the men. We were always ahead of the game, the men’s team has always supported us. We were the best team – the only team to ever win the Champions League in the women’s game in this country. Young girls now want to be Beth Mead or Leah Williamson. I think it’s important to have role models.”\nRoman Kemp on the mic\nThe grandson of striker Reg Lewis (1920-1997), Lewis Radstone-Stubbs, said he had contributed to the design process and said he was happy with the “end result”.\n“To be honest, at the start it felt a little bit like the process was going to be a bit artificial, kind of corporate…but they’ve actually smashed it,” he said.\n“I think what attracts me to football isn’t football, but the fan culture.\n“I don’t care about how many assists your right wingers got. I like playing football and I like being part of football.”",
  "word_count": 593,
  "scraped_at": "2026-02-14T12:59:56.911656"
}