{
  "article_id": "6bfe9e753b04",
  "url": "https://youthjournalism.org/judges-wowed-by-student-journalism-in-annual-yji-contest/",
  "title": "Judges wowed by student journalism in annual YJI contest - Youth Journalism International",
  "date": "20230508T213000Z",
  "domain": "youthjournalism.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In an era when journalists wonder if their profession will survive corporate cutbacks and political chaos, we have some good news: It will.\n“There were so many fantastic entries this year,” said Philadelphia artist and teacher Katie Haire, a YJI judge.\nFor its 14th annual contest, Youth Journalism International’s two dozen judges had the opportunity to read, watch and listen to an incredible range of stories, photographs and illustrations produced by students during 2022.\n“I think all of these young journalists have a bright future,” said judge Chris Ocamringa, a television journalist in the Democratic Republic of Congo..\nWe noted a definite uptick in students writing about events beyond the borders of their own countries, with both the war in Ukraine and the death of Mahsa Amini by Iran’s religious police often cited by young reporters.\nThis year’s Student Journalist of the Year is the paper’s editor, Caroline Steidley, who “brings a sense of purpose and intensity” to her work that inspired her talented peers, according to its advisor, Mitch Eden.\nEden has been providing leadership for students, too, and for many years. So it did not surprise us when judges picked him as this year’s Journalism Educator of the Year.\n“I am humbled and thankful for the incredible recognition and honor from YJI,” Eden said. “I am very lucky to have an amazing administration at Kirkwood and incredible, brave student who push scholastic journalism forward.”\nWe’ll be sending two of YJI’s six crystal trophies for our top categories to a single school. That’s more than have ever been awarded in the same year to the same school, an amazing achievement that says everything about the skill and depth on display at The Kirkwood Call.\nKirkwood High School has a long, proud legacy of outstanding student journalism. We’re glad YJI is able to highlight that achievement. What an amazing paper. Congratulations to everyone whose dedication makes it shine not just this year, but every year.\nAs if winning two categories wasn’t enough, both Steidley and The Kirkwood Call were also finalists in two other categories. And we can assure everyone that finalists are terrific.\nA new First Amendment Award, cosponsored by YJI and the First Amendment Museum in Augusta, Maine, went to The Rock, the student newspaper at Rock Canyon High School in Highlands Ranch, Colorado. Kirkwood’s paper was a finalist.\nThe Rock’s staff took full advantage of the law to write about tough issues that included the firing of a superintendent and the resulting protests by teachers and students.\nIn the Courage in Journalism category, where Kirkwood was also a finalist, judges chose as their top pick Tanya Tkachenko, a 17-year-old student from Lozova, Ukraine who wrote about Russia’s invasion of her country, her brother’s capture by the invading troops and what it is like to live under fire.\nShe wrote stories about the world she saw around her – and she also told them to anyone willing to listen, because she understood that what takes bravery in war isn’t just to pick up a gun and face the enemy. It’s also to tell the truth about what it’s all about, to speak up and give a voice to the many thousands of young, worried Ukrainians who don’t have the skill or the courage to take the stage.\nIn a time of crisis, Tkachenko stood strong, using her words to help save her country.\nTkachenko, now a first year student at Georgetown University, said she was “deeply honored” to receive the award.\n“This recognition holds tremendous value for me,” Tkachenko said, “as it underscores not only the importance of my work but also the work being done by thousands of journalists worldwide, shedding light on events in conflict zones, including my beloved Ukraine.\nTkachenko said she was grateful to YJI’s judges for the support, but added, “I would like to dedicate this award first and foremost to those journalists who are currently alongside our soldiers on the front lines or have already sacrificed their lives, so that the world may have the opportunity to know the truth.”\nThe Jacinta Marie Bunnell Award for Commentary was given to Sreehitha Gandluri of Our Lady of Good Counsel High School in Olney, Maryland, for an opinion piece she wrote about the problems with perfectionism.\nShe gives voice to that gnawing doubt by many hard-working young women about the cost of trying so hard and doing so well.\n“Today, girls like me live in a pressure cooker, constantly being simmered in messages to get into a top tier university, become a varsity athlete and bring home assignments with big red ‘A’s’ on them,” Gandluri wrote. “Being us isn’t enough anymore. We have to be the best, even if we lose ourselves along the way. The grades, medals, and accolades are all more important than the teenage girl cowering behind them.”\nThe winner in the Frank Keegan Award for News category is Vanessa Moreno of McHenry High School in Illinois, who saw something interesting in a story done by The Chicago Tribune and ProPublica and then plunged in to find out how it impacted her school.\nMoreno did not let administrators block her and just kept digging until she had a solid, well-researched piece about how officials had sidestepped a state law aimed at keeping students out of trouble by shifting enforcement of rules from the school to the local police.\nIt’s that kind of dogged determination that we saw from many student entries in this year’s, some of them honored with an award and some simply read with satisfaction. Everyone can’t win, but everything we saw was a winner.\nThose earning awards for work done in English during 2022 hailed from 15 countries and 18 states within the United States.\nThe nonprofit Youth Journalism International has been educating the next generation of news professionals since 1994. It is a 501(c)(3) educational public charity. Its website can be found at youthjournalism.org.\nA complete list of winners – with comments by judges in italics – is below.\nStudent Journalist of the Year\nWINNER\nCaroline Steidley of Kirkwood High School, Kirkwood, Missouri\nHere’s something that her adviser said about Caroline Steidley: “She is openly joyful about learning and awed by the privileges and riches available to her” at Kirkwood High. Think about what that says: She is “joyful about learning” and keenly aware of the incredible opportunities she has. That perception, that maturity, is no doubt why Steidley’s work is so solid. We already mentioned her piece on a local murderer, but she’s done a lot more. She’s an excellent, all-round journalist. Adviser Mitch Eden said she “brings a sense of purpose and intensity” that inspires her peers. He also said she “is one of those truly rare gems who creates magic in everything she does, and who brings a positive energy to every place and situation she inhabits.” We’re glad to be able to honor her as YJI’s Student Journalist of the Year.\nFINALISTS\nAllison Mi of Huron High School, Ann Arbor, Michigan\nWhat a wonderful journalist! Allison, who’s done some great work, said she sticks with journalism because she has unconditional love for it: “a melting pot of service, ambition and most importantly the work that I do for everyone around me.”\nKatie Murphy of Shawnee Mission East High School, Prairie Village, Kansas\nKatie has a nose for news. Consider just one great example: She noticed that many students were staying up until 2 a.m. scrambling to keep up with homework for up to seven AP classes. So she asked the attendance secretary about oversleeping and found it’s becoming a serious problem. One senior, she said, had 87 tardies. Another napped in his car after school so he wouldn’t fall asleep driving homie. Yet another smoked marijuana to stay awake in the morning. In short, she found “an epidemic of sleep deprivation” that nobody was talking about. Until she wrote about it. Spotting a story like that is a rare skill. Bravo!\nChristina Chang of Saratoga High School, Saratoga, California\nKellen Browning, a New York Times reporter, hailed Christina as a natural with rare skill. So we read her work carefully. And, yes, it’s true. She’s done a lot of terrific work. And we love, by the way, that she said journalism has inspired her “to be an active world citizen.”\nEshaan Mani of The Kinkaid School, Houston, Texas\nDescribing Eshaan’s impressive range of work, his adviser, Kimetris Baltrip, pointed out his “ability to cover heady, newsy subjects as well as those that are more lightweight and historical. He remains eager to embrace different ideas and to show the acumen to lead.” That’s right on.\nJacinta Marie Bunnell Award for Commentary\nWINNER\nSreehitha Gandluri, Our Lady of Good Counsel High School, Olney, Maryland, for “Perfectionism: a sure path to self-destruction.”\nWe suspect there are a whole lot of young women around the world who would find that Sreehitha Gandluri’s essay on perfectionism hits home. She gives voice to that gnawing doubt about the cost of trying so hard and doing so well. Just read part of it to see why Gandluri won:\n“I go to school every day and hear my classmates try to one-up each other, deciding who got the least sleep. Being tired has become something to brag about.\n“There’s this unsung expectation of teenage girls to be amazing. Maybe it comes from my uber-competitive DC suburb. Maybe it comes from my college-focused high school. But I think it stems from something larger – our overall societal idea of what a girl should be.\n“Today, girls like me live in a pressure cooker, constantly being simmered in messages to get into a top tier university, become a varsity athlete and bring home assignments with big red ‘A’s’ on them.\n“Being us isn’t enough anymore.\n“We have to be the best, even if we lose ourselves along the way. The grades, medals, and accolades are all more important than the teenage girl cowering behind them.”\nThank you for saying it, Sreehitha, but we’re not sorry to add another accolade to your no-doubt growing list.\nFINALISTS\nUsraat Fahmida of Rajuk Uttara Model College, Uttara, Bangladesh, for “Mahsa Amini: it wasn’t about her clothes.”\nUsraat’s is one of several pieces that focused on the awful murder of a young Iranian woman, Mahsa Amini, killed by police for neglecting to cover her hair properly. Usraat does a nice job of tying the ugly incident to the worldwide necessity of ensuring freedom of choice for young women.\nLaura Zhang of Thomas Jefferson High School for Science and Technology, Alexandria, Virginia, for “The ‘Jefferson experience’: stereotype or reality?”\nLaura Zhang attends a super-achieving high school in Northern Virginia with a reputation for, she wrote, “an overwhelming course load, sleepless nights spent cramming for exams, constant stress and the grueling class known as AP Physics.”\nThe horror stories that students hear ahead of time instill “a sense of fear and discouragement,” Zhang wrote. “We come into Jefferson prepared for the worst, and as a result, it becomes much easier to find it.”\n“It feels like if we aren’t pushing ourselves to the breaking point every single day, we must not be working hard enough,” Zhang said. “If we aren’t constantly struggling, we must be doing something wrong.”\nZhang’s piece rightly pleads for relief.\nMcKenzie Andersen of Acellus Academy, Albany, Oregon, for “’The world is not made for me.’ Disabled youth face toxic expectations.”\nMcKenzie’s piece addresses an issue few ever think about: what’s it like for young people who rely on wheelchairs for mobility? It turns out they get a stream of patronizing or insulting comments and that even doctors – who ought to know better – often won’t listen to patients trying to advocate for themselves or explain their own conditions.\n“It’s incredibly dehumanizing,” she wrote, and lonely, too.\nHer piece opens eyes, a first step to a change that’s clearly needed.\nOrli Rabbani of Ramaz Upper School, New York City, for “Women, Life, Freedom! A Message to the Iranian Government from a Young Woman of Iranian Descent.”\nAs the granddaughter of an Iranian immigrant, Orli said the news from Iran last year of a young woman killed for failing to wear her hijab hit “very close to my heart, because if not for my grandfather, I would have been in the same situation as these young women fighting for their rights” against an oppressive, woman-hating regime. Her column is a cri de coeur for a free Iran. She told Iran’s president in her essay, “You can take away our human rights, our lives, but no matter how hard you try, our cries for freedom will drown you. No matter how hard you try to put us down, we will never stop fighting.”\nIzabella Marinho of Cape Tech Regional High School, Harwich, Massachusetts, for “Providing the American Dream for All.”\nIzabella, an immigrant, reminds us all that our immigration system needs an overhaul. She wrote that slipping into the country without permission “is not a good idea, nor is it safe or legal. But for some people, it is about more than just crossing a border; it is about life or death.”\nIzabella said the system is too difficult and too restrictive. “Ultimately, immigration involves people seeking a better life for themselves and their families,” she wrote, and that’s something we ought to encourage.\nAina Marzia of Young Women’s STEAM Research and Preparatory Academy, El Paso, Texas, for “The Leadership Pipeline for Women.”\nAina Marzia’s piece on “The Leadership Pipeline for Women” for The City Magazine in El Paso, Texas takes an important and sometimes personal look at the different standards applied for leadership to men and women. She makes it clear that bias holds women back, to the detriment of all. She encourages women to have faith in themselves and to worry less about failing. Exactly so, Aina!\nFrank Keegan Award for News\nWINNER\nVanessa Moreno, McHenry High School, McHenry, Illinois, for “This is fine.”\nVanessa Moreno read a news story done by The Chicago Tribune and ProPublica that mentioned her high school was among those where students had been issued tickets for criminal violations. It spurred her to dig deeper.\nHer “This is fine” delved into the issue at McHenry High School in Illinois and explained exactly what was going on and why.\n“Reporting took around three weeks, and honestly, most of the time, I thought it wouldn’t come together and wondered if I should stop pursuing the story,” Vanessa wrote. “As it turns out, schools don’t like it when you try to call them out on things.”\n“I wouldn’t say I faced outright opposition; it was more like passive aggressiveness and discouragement from those in power. Most notably, my school’s two deans kept dismissing the issue as ‘just the media spinning an unfair and untrue narrative.’”\nVanessa did what any good reporter does when those in power try to get in the way: she bulldozed her way forward until she got the story.\nThat’s exactly the spirit that Frank Keegan exemplifies.\nAnd lucky for her, people recognized it.\nShe said the day the story appeared was “the best day of my life — no exaggeration” because everyone talked about it. Stressful as it was, she said, it made her realize “that journalism is my thing. It was pretty great.”\nFINALISTS\nChuying Huo of London Central Secondary School, London, Ontario, Canada, for “Stanford professors back proposed law restricting sale of weight loss supplements to kids,” “Weight loss and muscle-building supplements can contribute to disordered eating in young people,” and “Professors and students support California bill prohibiting the sale of diet pills to adolescents.”\nChuying’s coverage of the way the diet industry preys on youth, and a bill in California that aimed to limit the practice, was comprehensive, informative and wide-ranging. She’s a terrific reporter.\nNicole Luna of Colégio Estadual Alfredo Moisés Maluf, Maringá, Paraná, Brazil, for “Brazilian youth discuss election hopes and fears.”\nFor her story, Nicole talked with young people in Brazil divided about a hotly contested presidential election between the incumbent, Jair Messias Bolsonaro, and challenger Luiz Inácio Lula da Silva. She managed to tell it well, with solid reporting – no easy task when emotions were running high.\nSreehitha Gandluri of Our Lady of Good Counsel High School, Olney, Maryland, for “After prison, the formerly incarcerated embrace freedom through reading and writing.”\nIn a well-written piece, Sreehitha explored the success of a Washington, DC nonprofit called Free Minds that that “uses literature to help incarcerated and formerly incarcerated people reintegrate into society” and brought it home via the personal story of Gary Jaggers, who spent four decades in prison before reading and writing helped him walk free again.\nCourage in Journalism Award\nWINNER\nTanya Tkachenko, Lozova, Ukraine\nMost 17-year-olds are worried mostly about grades, friends and what to do after high school. But for Tanya Tkachenko, a Ukrainian, Russia’s invasion of Ukraine produced more serious concerns: her brother on the front lines, her parents called to duty and her country facing a barrage of rockets and bombs.\nTanya could, like so many others, have kept her head down and hoped for the best. Instead, she started telling the world what was happening: about her long journey to Spain as a refugee, as the sister of a soldier imprisoned by the Russians, as a young woman returning to Ukraine.\nShe wrote stories about the world she saw around her – and she also told them to anyone willing to listen, because she understood that what takes bravery in war isn’t just to pick up a gun and face the enemy. It’s also to tell the truth about what it’s all about, to speak up and give a voice to the many thousands of young, worried Ukrainians who don’t have the skill or the courage to take the stage.\nIn a time of crisis, Tkachenko stood strong, using her words to help save her country. We are proud to name her as this year’s recipient of YJI’s courage in journalism award.\nFINALIST\nCaroline Steidley, Kirkwood High School, Kirkwood, Missouri\nCaroline Steidley showed a noteworthy kind of courage when she took on the kind of story that rankles people, where emotions run high and the chances of satisfying everyone involved are virtually nil.\nIt’s the sort of story it takes guts to go after – and skill to complete.\nHers was a tale of a former student at Kirkwood High convicted of murdering a police officer and sentenced to die. As Steidley said, the Kevin Johnson story was “the most delicate topic” she’d ever covered as she tried to present the background of a touchy case fairly and thoroughly.\n“ As a journalist this was my most challenging reporting and writing piece to date,” she said. “Getting emotional interviews with people who were severely affected by the situation made it difficult to shine a light on both sides of the topic. It made me question my ethics, and I learned that as a journalist, while there might be personal biases, it’s crucial to highlight all the perspectives in order to be a reliable source.”\nShe did a great job, by the way.\nFirst Amendment Award\nWINNER\nThe Rock online newspaper at Rock Canyon High School, Highlands Ranch, Colorado, and in particular, students Grace Uhrain, Claire Bauer, Kira Zizzo, Abigail Wood, Andi Mack, Eila Liu and Daniel Zilligen, for “Student Freedom of Expression in Colorado at The Rock Online.”\nDetermined to “take full advantage of the right we are given to deliver comprehensive coverage to our audience,” The Rock plunged into the news about the firing of a school superintendent and the resulting protests by teachers and students. It didn’t shy away from a tough issue and it kept its focus on the issue at hand, providing solid reporting not just for its high school but for its entire community. And that’s just one issue of many where The Rock seized the opportunity a free press offers to dig deep and stretch wide.\nWell done, Grace Uhrain, Claire Bauer, Kira Zizzo, Abigail Wood, Andi Mack, Eila Liu and Daniel Zilligen!\nFINALISTS\nThe Kirkwood Call, Kirkwood High School, Kirkwood, Missouri, for “Kirkwood High School Journalism.”\nThe Kirkwood Call is a stellar high school newspaper with a long, honorable history. But students constantly change and need to learn again the value of a free press. Ian Reno, its news editor, said that in the past year, the paper has “covered book banning, mask policies, adding turf fields, the addition of another school resource officer to the district and more. A lot of those things would have gone uncovered had it not been for us being there to watch, listen and report.” He’s not exaggerating. What a great paper. This is a paper that’s had Mary Beth Tinker, plaintiff in one of the most important student press cases to reach the Supreme Court, talk to its students. That’s a school that understands a student paper needs to flourish for the good of all. The Kirkwood Call brings honor to Kirkwood High School and exemplifies the value of the First Amendment in action, year after year, story after story. May it ever be so.\nJoanne Chi Wan Yau, Hong Kong, for “When press freedom died in Hong Kong – Remembering the Apple Daily.”\nOne of the seminal moments in China’s clampdown on Hong Kong came in 2020 when authorities shut down Jimmy Lai’s popular Apple Daily, a valiant news site that kept millions of readers engaged in ongoing events and the fight for liberty. Joanne’s piece, from Hong Kong, explored what it all meant from the perspective of a local. Her courage in honoring its bravery is impressive and noteworthy.\nJournalism Educator of the Year\nWINNER\nMitch Eden, The Kirkwood Call, Kirkwood High School, Kirkwood, Missouri\nFor 17 years, Mitch Eden has served as an adviser for journalism students at Missouri’s Kirkwood High School and as a model educator.\nWe’ve read The Kirkwood Call for years and been consistently wowed by the quality and breadth of its work. Students obviously deserve much of the credit. But we know that it takes a great teacher to make it happen year after year after year.\nMr. Eden ensures that students learn the basics of journalism and, just as important, the ongoing struggle to preserve and expand press freedom, from his classroom to the world stage.\nHe is involved in more journalism groups than we knew existed. He hosts camps, works with other schools, takes students to conferences and so much more..\nIt’s no wonder that The Kirkwood Call has won or been a finalist for the National Scholastic Press Association’s National Pacemaker Award annually for the past 16 years.\nMr. Eden more than deserves to be this year’s Journalism Educator of the Year.\nFINALISTS\nLauren Mancini, The Wingspan, Centennial High School, Ellicott City, Maryland\nLauren Mancini, a journalism teacher at Centennial High School in Ellicott City, Maryland, stood out as well.\nJoanne Yoon, the student who nominated her, said Ms. Mancini is “a relentless and inspirational role model who has taught me more than just how to write an article.”\nNaomi Chao, one of her students, said she “is exciting, inspiring, productive, and is a direct reflection of Ms. Mancini’s character. She works hard to foster an encouraging relationship among the journalism students and ensures that the classroom is inclusive.”\nAbby Conrad, another of her students, called Ms. Mancini “one of those rare teachers that comes around once in a blue moon, and I know that she will be by my side long after I stop walking the high school hallways. I hope everyone is lucky enough to have an adult in their life who is as thoughtful, passionate, and honest as Ms. Mancini is; her impact cannot be measured and I truly am so fortunate to have been reached by it.”\nDavid Flanary, The Sequoyah Scribe, Sevier Stories, John Sevier Middle School, Kingsport, Tennessee\nDavid Flanary, who oversees the amazing journalism program at John Sevier Middle School in Kingsport, Tennessee, won the Journalism Educator of the Year award in 2016. He’s still doing a great job.\nBut don’t take our word for it. Here’s what one of his students, Sydney Gentry, told us this year: “He works so hard to make everything perfect for us and gives us every opportunity to become great student journalists. Even though it takes a lot of time before and after school, he doesn’t mind. He keeps pushing us to be the very best we can be. Although we are middle school students, he always takes us and our writing seriously.”\nNews Categories\nEnterprise Individual\nFirst Place: Vanessa Chen of Stuyvesant High School, New York City, for “Chinatown Faces an Uncertain Future as Businesses Struggle to Find Workers.”\nThe article is well-written and explains how Chinatown in New York is a facing labor shortage because of a change in immigration patterns, an aging workforce and the coronavirus pandemic. Besides a brilliant opening and relevant quotes, the author makes use of available data, making it a clearly researched piece.\nHonorable Mention: Usraat Fahmidah of Rajuk Uttara Model College, Uttara, Bangladesh, for “Preserving memories of the 1947 partition that divided India and Pakistan into separate nations.”\nA timely interview on partition, the most significant event in 20th century South Asia. Preserving non-tampered oral histories of the time provides an alternative perspective to historical literature on the subject.\nEnterprise reporting by a team\nFirst place: Zoe Harris, Danielle Shumar, Jeffrey Dreyer, Madchen Fox, Raelynn Hughes, Anaiah Bacon of Ben Davis High School, Indianapolis, Indiana, for “Then and Now – a look at technology and education.”\nAll the articles were well written, engaging and included fantastic, candid interviews.\nSecond place: Brayden Caldwell, Gaurish Lakhanpal and Lillian Zhou of Adlai E. Stevenson High School, Lincolnshire, Illinois, for “Getting Down to Business.”\nSpotlighted a couple of high school students with small businesses and showed how they balance work and school.\nHonorable mention\nEvelyn Wang and Lindsey Steel of Homestead High School, Cupertino, California, for “Building a Stronger team.”\nDetailed reporting and writing about how the FBLA and other groups improved.\nLexi Bordenkecher, Zoe Harris, Brooklynn Sharp, Yanelis Rivera, Raelynn Hughes, Jalen Flowers and Nadia Rivera of Ben Davis High School, Indianapolis, Indiana, for “Scandals, conspiracies, controversies – who done it?”\nVery interesting, fun and informative.\nFeature writing, individual\nFirst Place: Clementine Cunningham of Carlmont High School, Belmont, California, for “Dyslexia: Defeating misreading.”\nThis was a superbly crafted and informative article. We learned so much! Clementine demonstrated excellent use of research and did it by avoiding technical jargon. Anyone who reads this will gain a clear understanding of dyslexia and what is being done to help the victims of it. The graphics added a great deal to the reader’s understanding. Congratulations!\nSecond Place: Sophie Lindberg of Shawnee Mission East High School, Prairie Village, Kansas, for “Their New Missions.”\nOne mark of excellence in feature writing is to provide multiple sources and diversity of subjects. Sophie hit the jackpot for both and much more. Her sensitive and insightful portrayal of these patriots went way beyond simply recording what they said – she highlighted their motivations for heroism. Thank you for a wonderful read!\nHonorable mention:\nUsraat Fahmidah of Rajuk Uttara Model College, Uttara, Bangladesh, for “Eco-Kpop: The New K-pop Movement.”\nUsraat introduced the reader to a cultural universe that many are unfamiliar with. She showed how this musical form helps to raise awareness of a global consciousness that is far from typical in contemporary popular music. By describing the ways in which the themes of ecology and love of the natural world pervade the music, you showed us, Usraat, something many of us didn’t know before. That is what the best of features can do. You rock!\nAnnabel Chia of Carlmont High School, Belmont, California, for “The streets of the city: a rising residence for youth.”\nThis article cast a big spotlight on a modern-day epidemic. It was expertly crafted and Annabel did an excellent job exploring the various issues through the eyes of her interviewee, Dewes. The writing was polished and the accompanying infographics were very attractive and well-utilized. Bravo!\nLinda Lin of Carlmont High School, Belmont, California, for “American off the Boat.”\nThis was a timely piece containing an insightful analysis of Chinese identity in America. We liked that you examined not only the personal experiences of your interviewees, but that you also delved into the historical and psychosocial aspects of the topic. Well done!\nFeature story, team reporting\nFirst place: Nick Corso, Dayna Roberts, Aayushi Wadhawan of Adlai E. Stevenson High School, Lincolnshire, Illinois, for “Decisive Diversity.”\nThe team did an impressive job of exploring a complicated topic from different perspectives. They did a great job balancing the different viewpoints and used effective quotes to make their positions clear. Great work!\nSecond place: Christina Chang and Atrey Desai of Saratoga High School, Saratoga, California, for “Community mourns death of 23-year veteran teacher Todd Dwyer.”\nChristina and Atrey did a wonderful job of painting a moving picture of the life of a beloved teacher. Great use of details that really make the reader feel like they, too, have known Todd Dwyer.\nHonorable Mention:\nAnanya Pinnamaneni and Sylvia Ho of Dougherty Valley High School, San Ramon, California, for “DVHS Black Student Union calls for unity of black community during Black History Month.”\nGood job profiling something that is happening at your school and tying it to events that are happening in the outside world. Great work!\nIn-Depth Reporting:\nFirst place: Raj Jaladi of Parkway West High School, Ballwin, Missouri, for “Eight things students find surprising on the November 2022 Ballot.”\nHe took a boring subject, unless you are a political junkie, and formatted it in a unique and fun way, but more importantly, a way that educated his fellow students without beating them over the head with too many stats. Using the “eight things” concept shows a vision beyond his years, his writing was crisp, judicious, engaging and flowed brilliantly. It was an easy read and that means it was well written. It’s the writer’s job to create a story that is not a struggle but instead is a journey that feels like it’s over before it begins and leaves them wanting more. Any story, regardless of the topic, is a journey and the writer is the tour guide. You take the person by the hand and take them on a journey that is so enjoyable they don’t want it to end. Every word, every paragraph is a step along that journey. Raj intuitively knows this, and it shows in his writing. Well done, sir.\nSecond place: Nathan Sweeney of Kirkwood High School, Kirkwood, Missouri, for “The gateway to gun violence.”\nBrilliant piece that grabs the reader by the heart strings in the first two graphs. Building the story around Isabella and her loss to gun violence is exactly how the pros do it. The quote about her aunt dancing at the birthday party and Isabella sitting in the corner crying will stay with me for a long time. Recognizing a powerful quote is a skill, and Nathan has that skill. Journalists can be made and they can be born, Nathan is a born journalist and we look forward to reading more of his work as he develops into a seasoned pro.\nHonorable mention:\nChristina Chang of Saratoga High School, Saratoga, California, for “Stanford professor’s findings help explain why so many young people feel so miserable.”\nHer story did a great job explaining to readers that there are complicated reasons why students struggle to stay awake. Great sources.\nKatie Murphy of Shawnee Mission East High School in Prairie Village, Kansas, for “Can’t Unwind.”\nKatie is a talented writer who has a natural understanding of color and can really turn a phrase. This is a skill that many working journalists never figure out\nCharles Cox of John Sevier Middle School, Kingsport, Tennessee, for “KCS superintendent announces retirement.”\nA really nice job with the perennial cat-stuck-in-the-tree sort of story.\nChuying Huo of London Central Secondary School, London, Ontario, Canada, for “Professors and students support California bill prohibiting the sale of diet pills to adolescents.”\nA great job of putting a complicated issue into context.\nSasan Kour Jasneh of Carlmont High School, Belmont, California, for “9/11 still terrorizes Sikhs.”\nWell written and put together story about a culture that is constantly victimized.\nKylie Madden of Kirkwood High School, Kirkwood, Missouri, for “The road to diversity.”\nA strong piece that reminds us that the road to diversity has been under construction for many decades and we keep losing our way only to start the journey all over again.\nSasan Jasneh of Carlmont High School, Belmont, California, for “Americans must prepare for a tumultuous 2023.”\nSasan’s understanding of the political world and analysis of it is far, far beyond her years. She is a political correspondent in waiting.\nIn-Depth Reporting by a Team\nFirst place: Fiona Jin, Anika Krishnaswamy, Kelly Liu, Shannon Moser and Aaroh Tak of Adlai E. Stevenson High School, Lincolnshire, Illinois, for “Engineering Change.”\nWhen in our time a professor can say,”Girls don’t do science,” and promising students are blocked because of race, ethnicity or sexual orientation, it means this story must be told again and again until humans wake up. This piece covers a lot of territory on a huge complex issue concisely. Voices, writing, statistics and graphics excellent.\nSecond place: Owen Spiegel and Mason Heller of Kirkwood High School, Kirkwood, Missouri, for “’It comes down to class’.”\nWhat a tragic story. It focuses a laser light on the intractable, self-feeding death spiral of public education.\nHonorable Mention\nRachel Bui, Collin Fan, Angela Guo and Shannon Moser of Adlai E. Stevenson High School, Lincolnshire, Illinois, for “The Full Spectrum.”\nGreat writing, graphics, photos, data and sourcing. Could use more extensive list of resources, especially for teachers.\nKatya Dubinin, Gaurish Lakhanpal, Lance Locker, Dayna Roberts, Ananya Tak and Nicole Yao of Adlai E. Stevenson High School, Lincolnshire, Illinois, for “On The Safe Side.”\nThey did a great job taking this horror beyond the Thoughts and Prayers sham. A photo of the alum murdered in Highland would have been great, and probably was available from an old yearbook. Also, on all of these stories journalists should do a sidebar on what America’s Founders meant by the 2nd Amendment, what the pro-gun lobby offers as a solution and what mental health professionals say about what has changed since a recent past with no gun laws, plenty of guns everywhere, and no mass shootings.\nMya Copeland and Kain Stobbe of Kirkwood High School, Kirkwood, Missouri, for “In-depth: A test-optional future.”\nExcellent information on the new reality and its ramifications. We would like to have read a sidebar with historical context on these tests, why they were implemented and what preceded them, if anything.\nAmber Birrell, Anderson Picone and Annabelle Yip of Homestead High School, Cupertino, California, for “Creating Cultural Connections.”\nReally beautiful.\nMulti-Media Feature:\nFirst Place: Arielle Kouyoumdjian of Potomac School, McLean, Virginia, for “Andre Peterson lost his home while attending Potomac, but was able to transform his life through music inspired by his daughter.”\nWe liked the topic Arielle chose. It’s a problem that many young African Americans are going through. She reported it very clearly and her choice of words was great. The story raises hope to people facing difficulties.\nSecond Place: Linda Lin of Carlmont High School, Belmont, California, for “Street Fruit: Peeling back the layers to the street vendor phenomenon.”\nLinda’s topic was great. It highlights the challenges that poor people struggling to earn a living go through in the U.S. She told the story well and interviewed an expert who helped shed light on the issue of human trafficking.\nHonorable Mention:\nEshaan Mani of The Kinkaid School, Houston, Texas, for “Hidden headlines: the founding of student journalism at Kinkaid.\nMani did a great job telling the story of the first school paper. We really liked the first line: “The youngest minds can bring about the greatest changes.”\nGreyson Imm of Shawnee Mission East High School, Prairie Village, Kansas, for “The Voice Behind the Choice.”\nImm told the story in a very captivating manner.\nMahkai Hunt of Archbishop Riordan High School, San Francisco, California, for “Did they make it? After 60 years, Alcatraz escape mystery endures.”\nHunt did a great job telling a story that happened decades ago. He mentioned very interesting stuff that could only be told by one who did some good research.\nSydney Tao of Carlmont High School, Belmont, California, for “High school jazz band connects communities for greater good.”\nSydney did a great job telling a story about a jazz band whose mission is to get social justice and help musicians without health insurance access healthcare.\nMulti-Media Feature, team reporting\nFirst Place: Annabel Chia, Oliver Fichte, Emma Yin, Evan Leong and Ujala Chauhan of Carlmont High School, Belmont, California, for “Mahsa Amini: The fight for change.”\nVery touching story about the killing of Mahsa Amini – the Kurdish-Iranian woman who died at the hands of Iran’s ‘morality police.’ The way the team told the story was clear and concise. The team included a chart to show the number of incidents committed by the Iranian government which gives readers a pretty clear picture of the human rights situation there. Very good journalism! Keep it up, team.\nSecond Place: Jonah Cooper and Nicole Lee of Adlai Stevenson High School, Lincolnshire, Illinois, for “Community Features: Security at Stevenson.”\nNice topic and great interviews with the security officials.\nHonorable Mention:\nKelly Liu, Kyla Smith, Ansh Aggarwal and Samantha Lerner of Adali Stevenson High School, Lincolnshire, Illinois, for “Community Features: Taiwanese Club.”\nAanya Bansal, Maggie Kissick, Larkin Brundige and Gracie Takacs of Shawnee Mission East High School, Prairie Village, Kansas, for “Back to Their Roots.”\nMultimedia news, individual reporting\nFirst Place: Katie Murphy of Shawnee Mission East High School, Prairie Village, Kansas, for “Local Climate Change Package.”\nEffective story telling through a mix of audio, visual and text formats. The story explains in depth the issue of climate change in Prairie Village, Kansas and how students and administration alike are involved in sustainable practices to combat the negative affects of the climate crisis.\nHonorable Mention:\nRaj Jaladi of Parkway West High School, Ballwin, Missouri, for “Exclusive Highlights of the Senior VS Faculty Game.”\nNanaka Takahashi of Miyagi University of Education Junior High School, Miyagi, Japan, for “Enjoying Sushi in Japan.”\nSydney Tao of Carlmont High School, Belmont, California, for “Redwood City celebrates culture and diversity for Lunar New Year.”\nMultimedia news story by a team\nFirst place: Naz Mergen of Çevre College, Istanbul, Türkiye and Sreehitha Gandluri of Our Lady of Good Counsel High School, Olney, Maryland, for “The sweet scoop, from an island ice cream vendor.”\nThis engaging profile of a Turkish ice cream vendor highlighted the intricacies of a local ice-cream flipping practice in a way that was fun and informative – a hard balance to strike. We got a “behind the scenes” view of a practice that entices tourists, and appreciated the fact the vendor was the center of the piece’s focus.\nSecond Place\nAnderson Picone, Evelyn Wang, Veronica Zhao and Mackie Vu of Homestead High School, Cupertino, California, for “Tour of the A-Building.”\nNews story by an individual\nFirst Place: Clementine Cunningham of Carlmont High School, Belmont, California, for “Breaking News: Woman beheaded on a San Carlos street.”\nGreat interviews! A professional quality example of the dying art of police reporter, where the journalist doesn’t just take the cops’ word for it. Well done.\nSecond Place: Renata Pernegrová of Gymnázium Václava Hraběte, Hořovice, Czech Republic, for “Small Czech town absorbs Ukrainian refugees.”\nAn eye-opening look at how the humanitarian crisis of the Ukrainian War is having wide-reaching effects. Well-sourced.\nHonorable Mention:\nKatie Heitmann of Shawnee Mission East High School, Prairie Village, Kansas, for “Death in Disguise: Rising overdoses due to fentanyl-laced drugs impacts the East community, causing students to reconsider taking illegal drugs.”\nA very important topic handled gingerly. Excellent explainer piece.\nJonathan Kim of Culver City High School, Culver City, California, for “Masure VY: Vote 16’s Movement to Lower Voting Age Fall 16 Votes Short.”\nSolid election coverage, with good depth of history and use of data.\nNews story by a team\nFirst place: Nicole Kim, Erin Loh and Lia Klebanov of Homestead High School, Cupertino, California, for “Evolving discipline policy prompts conversation.”\nOf all the entries, this was the one where you could best see the work of multiple teammates tackling an important issue for their peers. We thought it was pretty cool that students took a long view of how the disciplinary system at their school has changed and were impressed by the interviews of teachers and students.\nSecond place: Jackson Sneeringer and Zara Hai of Carlmont High School, Belmont, California, for “Fatal car crash renews concerns about safe teenage driving.”\nAnother good story that hits home at an important issue for high school students. The facts behind the car crash are terrible, but the Scot Scoop realizes that there are lessons to be learned for its young readers. This can be the hardest but most important type of reporting.\nHonorable mention:\nKate Ridgway and Milena Hanson of Carlmont High School, Belmont, California, for “Senate Bill 893 makes community college free for San Mateo County residents.”\nWe really like a newsroom that recognizes stories that may be useful to their readers. Many of them may be in position to take advantage of free or reduced price college-level courses. Giving classmates the details could help change their lives.\nProfile\nFirst place: Kannika Boot-In of Cape Tech Regional High School, Harwich, Massachusetts, for “Johnson is the Voice.”\nWe loved this profile; the subject came alive on the page through his engaging quotes, and the writer really gave us a glimpse not just into the subject, but into the culture of the school and its staff. We loved the way “muy bueno” was a thread throughout the story, with the wonderful payoff at the end explaining the story behind the quote. Wonderful work.\nSecond place: Paizley Swaney of Southwest Career and Technical Academy, Las Vegas, Nevada, for “Tallest Person on Campus.”\nThis writer impressed us with both of their profiles, and this one stood out just a little bit more because the opening line really grabbed us. We thought the writer clearly demonstrated Staton’s personality through his sense of humor, and allowed him the full spectrum of human emotion, from the benefits of his height for athletic purposes to the challenges of struggling with body image and fitting in. We loved the closing sentence. What a powerful visual; it’s funny but also poignant, summarizing the tone of the entire profile. Great work.\nHonorable mention:\nPaizley Swaney of Southwest Career and Technical Academy, Las Vegas, Nevada, for “Beginning Contortionist: Meet Lex Boyd.”\nThe opening paragraph pulled us in immediately: who is this person who can contort their body like this, and who would commit to learning contortionism after just a week of introduction? Fascinating subject, and this writer successfully demonstrated Boyd’s dedication to their passion while keeping us reading. We wanted to know everything about this person, and the author did not disappoint. Before reading the profile we had never heard of Lex Boyd; after finishing it, we’re rooting for them to make it to Cirque Du Soleil.\nMarina Duarte of Cape Tech Regional High School, Harwich, Massachusetts, for “Tavano Says She’s Ready.”\nFantastic opening paragraph; the 5-inch splinter unexpected and immediately grabbed our attention. This writer helped make Mrs. Tavano stand out on the page. In addition to the quotes from students, Tavano’s own quotes helped us really feel her bright, sparkling personality and enthusiasm for the new position. Excellent work.\nAddison Hwang of Archbishop Riordan High School, San Francisco, California, for “Teacher’s Pet: Whipple & Winston win hearts.“\nWhat a fun way to get to know a teacher: through his service dog! We loved the way this piece gave readers background into both this new teacher and his service dog. It must have been difficult to balance time on the page for Mr. Whipple as well as Winston, but the writer did a great job balancing the two. We would have loved to have known a little more about Winston’s “job” on campus earlier in the piece.\nArielle Kouyoumdjian of The Potomac School, McLean, Virginia, for “An interview with Mrs. Joleen Hyde on growing up in South Africa during the Apartheid era.”\nWonderful production value; this podcast impressed us with its thoughtful research, expressive and clear tone, and compelling interview.\nMultimedia Profile\nFirst place: Eshaan Mani of The Kinkaid School, Houston, Texas, for “Ascent.”\nAn interesting topic and great use of interview to show the dancer’s journey. Engaging visuals that amplify the narrative. Wonderful work!\nSecond Place: Sydney Tao of Carlmont High School, Belmont, California, for “Viral TikTok kickstarts lip gloss business.”\nA fascinating look at a teen running a business. Sydney really takes the viewer on a journey to understand the person in the profile. Very cool!\nHonorable Mention:\nMae Richardson of Homestead High School, Cupertino, California, for “Q&A with Alice Yu: Working part-time as a high school student.”\nA great topic choice that is very relevant to teens. Mae asks good questions and the video is very high quality. Nice work!\nProfile, team entry\nFirst Place: Anu Nagarajan, Brevin Reed and Emma Yu of Homestead High School, Cupertino, California, for “Inside the helmet: Senior discusses football, hobbies outside of sport.”\nSecond Place: Nick Corso, Kashvi Nagpal and Alex Xie of Adlai E. Stevenson High School, Lincolnshire, Illinois, for “Committed.”\nTech Journalism, individual entry\nFirst Place: Kelsey Baker of Cape Tech Regional High School, Harwich, Massachusetts, for “How Young is Too Young.”\nThe article raised awareness about an important topic through on-point interviews.\nSecond Place: Beren Deniz Öcek of Çevre College, Istanbul, Türkiye, for “Try Help Steps to support charity.”\nWe had not heard of this app that appears to be a win for all sides and the video by the young reporter demonstrated her passion for it.\nHonorable Mention:\nMark Coleman of Cape Tech Regional High School, Harwich, Massachusetts, for “Another Kind of Virus.”\nInformative reporting regarding cybersecurity in schools.\nTech Journalism, team entry\nFirst Place: Rajiv Venkatesh, David Lin and Brian Ling of Homestead High School, Cupertino, California, for “Rejuvenating the robotics team.”\nSolid reporting that detailed clearly how the robotics team improved.\nSecond Place: Collin Fan and Tej Kosaraju of Adlai E. Stevenson High School, Lincolnshire, Illinois, for “School Board Confirms New Virtual Reality Course.”\nGood reporting that demonstrated how virtual reality skills are valuable.\nHonorable Mention:\nDavid Lin and Rajiv Venkatesh of Homestead High School, Cupertino, California, for “Robotics brings home the win.”\nInteresting and informative.\nTravel Writing\nFirst Place: Usraat Fahmidah of Rajuk Uttara Model College, Uttara, Bangladesh, for “What could have been, or how I missed out on Istanbul.”\nAn interesting reflection on a very important issue. Emotional but balanced, and makes the audience reflect on their own privileges and learnings from life’s disappointments.\nSecond Place: Holly Hostettler-Davies of Cardiff University, South Wales, UK, for “Visiting religious sites as a non-believer.”\nA reflective, insightful piece, showing the possibilities that travel gives us.\nHonorable Mention:\nAna Fadul of Colegio San Jorge de Inglaterra, Bogotá, Colombia, for “Fascinating Cartagena offers rich history and gorgeous Caribbean scenes.”\nRich in evocative writing, great pictures.\nNorah Springborn, Pekin High School, Pekin, Illinois, for “Digging into WWII history at Pearl Harbor.”\nAn informative and polished piece. We particularly liked the use of video to showcase the highlights.\nNicole Luna, Colégio Estadual Alfredo Moisés Maluf, Maringa, Brazil, for “My green hometown of Maringa, Brazil.”\nInformative, fun and enjoyable. An interesting read.\nTravel writing, team entry:\nFirst place: Regina López of Liceo Mexicano Japonés of Mexico City and Ana Fadul of Colegio San Jorge de Inglaterra in Bogotá, Colombia for “The breathtaking beauty of Topkapi Palace.”\nGreat travel writing transports the reader to a new place, making the unknown feel familiar. This piece and its accompanying photos drew us in and transported us to the Topkapi Palace in Turkey. We really got a sense of its scale and beauty.\nSecond place: Lina Köksal of Çevre College, Istanbul, Türkiye and Nargis Babar of Stokholm, Sweden, for “For cool ancient history, step into a cistern.”\nPacking a punch with several facts, this piece was informative without reading like a textbook. We learned a lot about the history and importance of Türkiye cisterns. The images conveyed the cool dampness of these subterranean wonders.\nHonorable mention:\nHope Saena, Joss Broward and Erin Loh of Homestead High School, Cupertino, California, for “A landmark of life.”\nThe concept was innovative and the layout, beautiful. Quotes from students were mapped to images of various global landmarks. This would be a fun recurring feature.\nCommentary\nColumns\nFirst place – Ethan Bull of Southwest Career and Technical Academy, Las Vegas, Nevada, for “What we should learn from HOCO this year.”\nHeartfelt and heartbreakingly funny, Bull captures the angst of Homecoming at his high school with honesty and understanding. “When has anything without a real risk ever been exciting?” Really gets into your head!\nSecond place – Ayma Malik of Southwest Career and Technical Academy, Las Vegas, Nevada, for “Iran’s oppressive regime cannot suppress courage.”\nImportant and history-changing news written with top-notch sources and personal passion. The high school audience will appreciate the 16-year-old heroine – and perhaps get closer to changing the world, too.\nHonorable Mention:\nGreyson Imm of Shawnee Mission East High School, Prairie Village, Kansas, for “Fair Play.”\nPowerful thoughts and excellent writing about the debate over trans kids playing on the gender team they identify with. Very well argued – from a medical, psychological and young-real-world perspective.\nChristina Chang of Saratoga High School, Saratoga, California, for “Top 10: ways for fake having friends.”\nTotal click-bait, but the best kind – the kind that gives you a lift! Who wouldn’t laugh at (and possibly store for future reference) “Stand next to a group of people and face them.” Well written, fun, and just what you need for high school!\nClaire Mooney of John Sevier Middle School, Kingsport, Tennessee, for “Teachers should not humiliate students.”\nHit home for this teacher. Well written, powerful\nMcKenzie Andersen of Albany, Oregon, for “Mahsa Amini should not have died.”\nHuge topic, well handled\nIzabella Marinho of Cape Tech Regional High School, Harwich, Massachusetts, for “Providing the American Dream.”\nPersonal and persuasive.\nEditorials\nFirst place: The Pathfinder, Parkway West High School, Ballwin, Missouri, for “Capable, curious, caring, corrupted.”\nThis is an unforgettable editorial that touches on something every student likely thinks about and may discuss among friends, but rarely the topic gets such a spotlight. Loved the writing, loved the research that went into it, loved the graphics to help support the viewpoint. Really outstanding.\nSecond place: The Harbinger, Shawnee Mission East High School, Prairie Village, Kansas, for “Actually, East Isn’t Beast.”\nThis editorial stands out in an extremely talented pool of entries this year as it takes on the “soul” of the school’s students in what could be an unpopular opinion about school spirit/pride. The writing is crisp and clear, the supporting argument is strong. We can imagine the many conversations among the students that this editorial started.\nHonorable Mention:\nStatesman, Adlai E. Stevenson High School, Lincolnshire, Illinois, for “Stigmatized to Sensationalized.”\nLoved this one. Great topic. The strong writing is enhanced by the eye-catching design.\nThe Kirkwood Call, Kirkwood High School, Kirkwood, Missouri, for “Call Ed: Mom and Dad don’t know what’s best.”\nThe viewpoint is well researched, the writing is outstanding.\nSouthwest Shadow, Southwest Career and Technical Academy, Las Vegas, Nevada, for “Bus Drivers Need to Be Treated Like People, Too.”\nThis editorial doesn’t shy away from criticizing fellow students’ behavior and calling for changes.\nThe Epitaph, Homestead High School, Cupertino, California, for “Direct intervention is necessary to combat educational disparities.”\nThis editorial offers simple, student-inspired solutions to the failure rate of Algebra 2 that should spur the school to at least try.\nFirst Person Essay\nFirst Place Jordyn Jones of Ben Davis High School, Indianapolis, Indiana, for “The Black Woman is the Angriest Person in America.”\nAn incredibly powerful and sharp piece. Jordyn, never stop being angry, and never stop writing.\nSecond Place Baylee Krulewitz of Hall High School, West Hartford, Connecticut, for “Adults vowed ‘never again’ after Sandy Hook. What happened?\nA necessary and heartfelt reflection on one of America’s greatest problems.\nHonorable mention\nKinley Bokermann of Kirkwood High School, Kirkwood, Missouri, for “Division done.”\nA bittersweet piece that reflects how it is difficult to grow up and make choices. Great style.\nNorah Springborn of Pekin High School, Pekin, Illinois, for “Learning a thing or two at the Pride Festival.”\nA good reflection on how we can change our beliefs, if we are ready to overcome our biases.\nArielle Kouyoumdjian of Potomac School, McLean, Virginia, for “The Current’s intrepid multimedia editor spends a lot of her summer gasping for breath.”\nIt’s a fact: entries to this category aren’t often funny. Instead, Arielle managed to write a truly funny piece, with a witty style and enough cynicism to make you giggle. Well done!\nOpinion Writing, individual entry\nFirst Place: Sabia Irfan of Colonel By Secondary School, Gloucester, Ontario, Canada, for “Why Ottawa schools should implement a ‘grade freeze.’”\nTextbook opinion writing: States the issue in question in the lede. Stakes a clear position in the second paragraph. Unfolds strong factual and anecdotal (numerous quotes) evidence for the author’s position. Strong conclusion on why and how the school’s administrators need to act. Regardless of the reader’s opinion on the topic, it is hard to argue against this well-constructed piece’s conclusion.\nSecond Place: Christina Chang of Saratoga High School, Saratoga, California, for “Schools should offer more humanities courses.”\nVery well-written and conversational – a pleasure to read. Extra points for challenging prevailing conventional wisdom and offering a concrete call to action (more humanities classes) that people in authority can act on quickly, plus an idea for individual action – proactively searching for learning opportunities on her own.\nHonorable Mention:\nTalia Bumanglag of Archbishop Riordan High School, San Francisco, California, for “Schools should start cycle of free feminine care products.”\nAn important and overlooked topic that is rhetorically well-supported, with a simple call to action.\nAlexis Aryeequaye of Rosemont High School, Rosemont, Minnesota, for “Has the World Abandoned Ukraine?”\nHigh marks for its robust list of actions individuals can take in their daily lives to make a difference on a global stage.\nRaj Jaladi of Parkway West High School, Ballwin, Missouri, for “Congress must reauthorize READ Act,” and “Sponsor senate version of S.2965.”\nSuccinct, to the point, well-supported, clear and simple call to action.\nLucas Cohen d’Arbeloff of Harvard-Westlake School, Los Angeles, California, for “Make Election Day a Flex Day.”\nA smart and to-the-point piece on an essential topic for our day, with guidance for school officials on where they can begin making important changes that will help participation in the political process.\nKatherine Heitmann of Shawnee Mission East High School, Prairie Village, Kansas, for “Useless: Amazon ‘essentials’ are not as essential as they are made to seem.”\nA timely piece that ultimately explains how individuals can take action to simplify their own lives. In that sense, it’s accessible and practical for all readers.\nJonathan Kim of Culver City High School, Culver City, California, for “Individual action is not enough, but necessary to end the climate crisis.”\nA well-supported opinion piece that takes on a bit of conventional wisdom about climate action.\nEshaan Mani of The Kinkaid School, Houston, Texas, for “Student voice: Why social media is like Gorilla Glue for youth.”\nSolid support with data and strongly argued points.\nAnanya Pinnamaneni of Dougherty Valley High School, San Ramon, California, for “High School foreign language classes should be reformed to better prepare students for the real world.”\nInteresting take on a topic many of us have experienced but few of us have thought of how to fix.\nOpinion Writing, team entry\nFirst place: The Kirkwood Call staff, Kirkwood High School, Kirkwood, Missouri, for “Call Ed: Mind over matter.”\nThoroughly researched, plenty of human interest, and clear call to action. Very well done.\nSecond place: Ananya Pinnamaneni and Ekroop Kaur of Doughterty Valley High School, San Ramon, California, for “Banning of flavored tobacco products in California with Proposition 31 is a step towards protecting youth.”\nInteresting, well-researched and clear opinions. A political slant, well explained.\nHonorable Mention:\nAnanya Pinnamaneni, Anaisha Das and Jennifer Sheng of Doughterty Valley High School, San Ramon, California, for “Misleading depictions of mental illness in TV shows prove dangerous to youth.”\nSensitive exploration of an important topic, interesting and informed viewpoints.\nGaby Cristancho and Chloe Wong of Homestead High School, Cupertino, California, for “Speaking against conditional healthcare.”\nCompelling and pacy. Would have expanded references and explained some statements more, but an interesting view on an important topic.\nReviews\nBook reviews\nFirst Place: Eshaan Mani of The Kinkaid School, Houston, Texas, for “Student Recommends: Tahereh Mafi’s novel ‘An Emotion of Great Delight.’”\nSecond Place: Rebecca Von Tersch of Carlmont High School, Belmont, California, for “’Crying in H Mart’ will make you cry.”\nHonorable Mention:\nEmma Yu of Homestead High School, Cupertino, California, for “Little Weirds’ enchants readers.”\nAnton Barrera of John Sevier Middle School, Kingsport, Tennessee, for “Bookworm Corner: The Angel Experiment.”\nGeneral reviews\nFirst Place: Lyda Cosgrove of Shawnee Mission East High School, Prairie Village, Kansas, for “Cafes with a Cause.”\nBesides painting a vivid picture in this review, we thought the angle of reviewing cause-focused eateries was unique, giving it greater depth.\nSecond Place: Sim Khanuja of Kirkwood High School, Kirkwood, Missouri, for “Tis the season … for pumpkin spice.”\nPithy and funny. We look forward to reading more from this writer in the future!\nHonorable mention:\nSerena Urbina of Cape Tech Regional High School, Harwich, Massachusetts, for “El Mariachi.”\nVenice Jingco of Southwest Career and Technical Academy, Las Vegas, Nevada, for Convert your followers in ‘Cult of the Lamb.’\nGeneral reviews by a team\nFirst place: Nicole Pimenta Innecco and Aiko Charon of Homestead High School in Cupertino, California, for “Heartstopper paves the way for LGBTQ representation in media.”\nAn eloquent point of view where the writers come out sounding convincingly authoritative.\nSecond Place: Maya Kim and Rachel Finan of Kirkwood High School, Kirkwood, Missouri, for “Kirkwood boba review.”\nMaya and Rachel put the legwork in and show they can find varied ways to describe one subject.\nMusic reviews\nFirst place: Corbin Young of Cape Tech Regional High School, Harwich, Massachusetts, for “worm food.”\nCorbin makes great use of the allotted space on the page with illustrative writing and critical objectivity, quoting lyrics to reinforce the thematic analysis, and describing the production and instrumentation well.\nSecond place: Jasmine Zhen of International Community School in Kirkland, Washington, for “With ‘Harry’s House’, Styles offers his perspective on love.”\nJasmine exhibits a strong vocabulary — musically and otherwise — and unpacks metaphors convincingly.\nTheater and film reviews:\nFirst Place: Eshaan Mani of The Kinkaid School, Houston, Texas, for multiple reviews.\nEshaan is back! Having won in this category last year, we were hesitant to grant him the gold medal again. Yet, here we are putting him in the winner’s circle for 2023 and it is well-deserved. As in 2022, he offered a number of reviews for consideration. All of Eshaan’s reviews include super-smart assessments of acting, screenwriting, cinematography, and more. We may not entirely agree with his assessment of Andor (boring!) or his rave for Blacklight (an 11% “rotten” rating on RottenTomatoes), but there is no faulting his passion for film, his intellectually-stimulating reviews, and his on-screen professionalism. We give Eshaan five stars out of five.\nSecond Place: Allison Xu of Walter Johnson High School, Bethesda, Maryland, for “’Sad Beauty’: Consolation in wake of human demise.”\nWhat a pleasant surprise to find Allison reviewing an animated short feature! We had never heard of this 10-minute film and it is clear from Allison’s insightful review that she spent much longer than the film’s brief run time cogitating on its bleak assessment of humanity’s environmental neglect. Well-written and thoughtfully crafted, Allison’s review should have us all running to YouTube where ‘Sad Beauty’ is available to watch for free.\nHonorable Mentions:\nStephen Frazee of Cape Tech Regional High School, Harwich, Massachusetts, for “Western Front.”\nStephen’s review of the Oscar-winning film adaptation of ‘All Quiet on the Western Front’ intelligently places the movie in a continuum of other films that remind us of the horrors of war. He manages to look beyond just the acting to consider the direction and script itself. A little more attention to the production elements (particularly the cinematography, score and production design, which all scored Oscars) could be desired, but overall a great review about a difficult subject.\nCarter Lincoln of Cape Tech Regional High School, Harwich, Massachusetts, for “Wakanda Forever.”\nCarter’s review sensitively assesses the challenges the filmmakers and cast had to address after the unfortunate and untimely death of Chadwick Boseman. He rightly praises the performances and tone of this superhero epic without getting too bogged down in the intricate plotting of the movie. Carter makes a case for ‘Wakanda Forever’ being more than a simple superhero epic.\nJoss Broward of Homestead High School, Cupertino, California, for “Dahmer: Remembrance or romanticization?”\nJoss’s piece comes off as a bit more of a think/opinion piece than a review. Although there are some review elements, the majority of the feature focuses on the insensitivity on the part of Netflix and the filmmakers to consider the added trauma that the series creates for the families of Dahmer’s victims. Joss’s writing evidences an awareness of not only the news coverage over the miniseries’ callousness, but also the crass echo chamber that social media created around the program. This is a deft piece of writing that highlights the importance of victim advocacy.\nPhotography\nFeature photo:\nFirst place: Macy Crosser of Shawnee Mission East High School in Prairie Village, Kansas, for “Graduating Emotions.”\nExcellent emotional picture with great composition and timing.\nSecond place: Evan Johnson of Shawnee Mission Northwest High School, Shawnee, Kansas, for “Senior Erin Moody.”\nHonorable mentions:\nKannika Boot-In of Cape Tech Regional High School, Harwich, Mass., for “World Cup.”\nAshley Broils of Shawnee Mission Northwest High School, Shawnee, Kansas, for “Reignighting the Flame.”\nEvan Johnson of Shawnee Mission Northwest High School, Shawnee, Kansas, for “Wood Design 1” and “Mucky, Mucky Mess.”\nLiv Madden of Shawnee Mission East High School in Prairie Village, Kansas, for “Cheer Clinic.”\nRiley Eck of Shawnee Mission East High School in Prairie Village, Kansas, for “Tireless Fun.”\nFeature Photo, team entry:\nLaila Taraporevala and Leila Meilman of The American School in London, London, UK for “Eighth-grade students trip experience memorable trip.”\nNews photo:\nFirst place: Tanya Tkachenko of Lozova, Ukraine for “Train station in Lviv.”\nPowerful and moving image reflecting an urgent time of survival. Technically excellent with lighting and scope.\nSecond Place: Nanaka Takahashi of Miyagi University of Education Junior High School, for “In Japan, Cherry Blossom Trees Are in Full Bloom.”\nBeautiful imagery of fascinating time in Japan\nHonorable Mention:\nLaila Taraporevala of The American School in London, London, UK for “Hot chocolate comforts students on cold day.”\nFun and comforting\nJoss Broward of Homestead High School, Cupertino, California, for “‘It is like war’: Protests against injustice in Iran impact families.”\nMoving portrait\nGina Ko of Ann Arbor Huron High School, Ann Arbor, Michigan, for “Congresswoman Debbie Dingell.”\nReflective of the intensity of our times and politics\nSports photography\nFirst Place: Seoyoung Hwang of Homestead High School, Cupertino, California, for “Bell Game.”\nThis is more than a good sports photo. This photograph shows that the photographer looks for a different type of image. After seeing this picture we feel that Seoyoung has the potential to become a real good photojournalist, much more than just focusing on sports. It might have been better if it had been cropped a little bit tighter but the image is image is strong enough to stand by itself.\nSecond Place: Gina Ko of Ann Arbor Huron High School, Ann Arbor, Michigan, for “Home Opener.”\nThe photographer catches a good expression in this image. Sure, timing is important, but Gina waited out the action and is paid off with an excellent picture. Nice job.\nHonorable Mention:\nMacy Crosser of Shawnee Mission East High School, Prairie Village, Kansas, for “All About Drive.”\nGood facial expression. This photographer deserves to be mentioned for the perfect timing that the photograph shows.\nClaire Mooney of John Sevier Middle School, Kingsport, Tennessee, for “Beat Competition.”\nThis photograph was timed nicely, but may have told the story better with a tighter crop.\nRiley Eck of Shawnee Mission East High School, Prairie Village, Kansas, for “Trampled.”\nAnother well-timed image. The photographer kept the camera going while recording the image. Nice job.\nPhoto essay\nFirst Place: Regina López of Universidad Iberoamericana of Santa Fe, Mexico for “Mexico City celebrates El Día de los Muertos.”\nThe quality of the images was impressive, and the color and energy of the celebration came across. A great mix of parade and attendees, costumes and heritage as well as the emotional side of the event.\nSecond Place: Ana Fadul of Colegio San Jorge de Inglaterra in Bogotá, Colombia, for “Fascinating Cartegena offers rich history and gorgeous Caribbean scenes.”\nAna’s familiarity with the area is clear, the images are lovely and inviting. They are colorful and varied, and show the beauty of the area as well as the people. Good range of historical sites and modern activities.\nHonorable Mention:\nTess Hubbard of Kirkwood High School, Kirkwood, Missouri, for “Turkey Day Game Nov. 24, 2022.”\nGreat action shots and emotion!\nRenata Pernegrová of Gymnázium Václava Hraběte, Jiráskova, Czech Republic, for “The beauty of Advent in the Czech Republic.”\nInviting and beautiful. We loved the inclusion of the forest and the cookies.\nKayla Chan, Macau, for “Macau: a multicultural gem tucked in a corner of China.”\nExcellent images, especially the angle and lighting of the temple. An excellent overview of the city.\nHolly Hostettler-Davies of Cardiff University, Cardiff, South Wales, for “A summer escape to the Greek island of Corfu.”\nJust lovely, the images were lovely and inviting and it looks colorful and delicious!\nPhoto Essay by a team\nFirst Place: Joss Broward and Macy Li of Homestead High School, Cupertino, California, for “HHS swim senior night.”\nThe images captured the event, and the emotional feeling of the swimmers. The inclusion of the faces of the swimmers as they dove, action shots, behind the scenes and other expressions helped give a feeling of being there. The photos were clear and bright.\nSecond Place: Angelina Ning, Sean Reyes, Julia Yamsuan and Nick Nye of Archbishop Riordan High School, San Francisco, California, for “Crusaders clash against SHC on Senior Day, Hall of Fame induction.”\nA good sampling of the day’s activities, this essay captured the emotion of the event.\nHonorable Mention:\nNaomi Lin and Angelina Ning of Archbishop Riordan High School, San Francisco, California, for “Farewell to the Class of 2022.”\nWhile images showed the emotion of the day, the inclusion of 181 left the viewer with the impression that they weren’t edited down to the best of the best.\nSports\nSports Feature Story, individual reporting\nFirst place: Brooklynn Sharp of Ben Davis High School, Indianapolis, Indiana, for “The art of rebounding.”\nSecond place: Katie Murphy of Shawnee Mission East High School, Prairie Village, Kansas, for “Lucky Number.”\nHonorable mention:\nTalia Bumanglag of Archbishop Riordan High School, San Francisco, California, for “Female baseball player creates a league of her own.”\nSports Feature, team reporting\nFirst Place: Shannon Moser and Kelly Liu, Adlai E. Stevenson High School, Lincolnshire, Illinois, for “Embodying Perfection.”\nPowerful quotes do a nice job supporting the storyline. Nice artistic photo layout – it’s very eye catching! The flow and word choices are both very strong. The words used to describe the scene help readers clearly “see” the written picture you are painting.\nReally smart to include comments from the wrestling coach, which provides added context. Consider a more defined transition from the ballet to wrestling quotes.\nSecond Place: Eshaam Bhattad, Gaurish Lakhanpal and Shannon Moser of Adlai E. Stevenson High School, Lincolnshire, Illinois, for “Striding Forward.”\nReally strong, descriptive language helps paint the scene for the reader. Job well done in terms of providing specific examples and challenges the LGBTQ+ community faces. Nice use of statistics and studies to paint a more complete picture and the graphics also help tell the story. Important yet sensitive topic handled with skill and care. It may be worthwhile to give readers a bit of a basic tutorial on the key terminology and the differences such as the meanings and differences of sexual orientation and gender identity. Consider introducing relevant examples of LGBTQ+ athletes, like Lia Thomas, who have faced challenges on the national stage to bring more context to your local story.\nHonorable Mention:\nMary Oswigo and Jeffrey Dreyer of Ben Davis High School, Indianapolis, Indiana, for “Growing up … on the courts.”\nNice set up for both halves of the story. The girls basketball story sets the stage for the rest of the piece, while the boys half brings the reader into the scene. Loved the use of quotes from several different players on the girls team. The reader really gets a great sense of the themes you are outlining like friendship and camaraderie. We would have liked to hear a quote or two from the coach to round out the themes that the players discussed. Loved the throwback picture for the girls team in 6th grade – consider adding a present day picture of the same group so the reader can see the “before/after.” On the boys story, you did a really nice job giving the reader the chance to hear from and get to know different players. Watch out for typos and repetition, though.\nVeronica Zhao and Manya Girivasan of Homestead High School, Cupertino, California, for “Pleasing the crowd.”\nA really nice look at a sport that many readers may not be familiar with, yet will know more about after reading your piece.\nYou did a good job layering different quotes from multiple participants. Consider adding how those in the story got involved with color guard and why. We would have also liked some detail on the competitive aspect. How is it scored? How do you win?\nSports News Story\nFirst place: Caden Gaither of Ritenour High School, St. Louis, Missouri, for “Russian sports teams banned from international competition.”\nThe second-year staff reporter follows a factual lead with, “War is a malevolent, churning machine…” and concludes with “The government of Russia has stolen the joy and purpose of competition from their people in their invasion, destroying the very same unity they so desperately sought before.” In between he cites seven international sports organizations, provides statements from three, and balances the strong piece with an opposing view, by providing about 10% of the report to his high school soccer player who feels the banning of Russian and Belarusian athletes is unfair. Impressive.\nSecond Place: Maxx Ball of John Sevier Middle School, Kingsport, Tennessee, for “Structural problems close Buck Van Huss Dome.”\nA well-rounded news story through the use of facts, hypotheticals and quotes. The reader is left with the impression of being alongside the decision makers, and alongside those whose decisions they affect. And this from a middle school sixth grader!\nHonorable Mention:\nJain Niyatee of Homestead High School, Cupertino, California, for “Varsity baseball to cut returners.”\nA complicated topic to fully flesh-out in seven paragraphs, but concludes with a strikingly strong quote from her team’s senior shortstop. The senior sports editor’s real strength may be in entertainment journalism where she’s written authoritatively on topics like “Swifties” vs. Ticketmaster, nepotism in the entertainment business, and how music is a mechanism for sparking meaningful conversation on important issues.\nSports News by a team\nFirst Place: Nathan Gu, Erin Loh and Evelyn Wang of Homestead High School, Cupertino, California, for “Cross country competes at CCS.”\nA good use of quotes brought the story to life.\nMultimedia Sports News, individual reporting\nFirst Place: Sydney Tao, Carlmont High School, Belmont, California, for “Closing the gender gap for womens basketball.”\nLeading a report with a viral TikTok piece today may not evoke much credibility in what’s to follow. But Tao, a varsity basketball player herself, getting a teammate and a also former AAU girls basketball coach to talk about the difference between the NCAA’s allotted resources for the men’s and women’s 2001 tournaments, was a good start. While much of the research which appeared graphically was either too quick or too small totally digest, Tao did concede that pieces like her’s have “motivated the NCAA to implement changes towards equality.”\nMultimedia Sports News, team reporting\nFirst place: Karuna Chandran, Lia Klebanov, Chloe Wong, Ningnig O’Brien and Nicole Pimenta Innecco of Homestead High School, Cupertino, California, for “Track and Field Guide.”\nThis is as advertised: a “Guide.” It’s a Track & Field 101 that is fun to scroll through, yet clever enough to keep even enthusiasts engaged. Highlight was the “High Jump” brief with three photos fading into and out of one another.\nSecond Place: Manya Girivasan and Veronica Zhao of Homestead High School, Cupertino, California, for “Life Lessons of Soccer.”\nSports Opinion\nFirst Place: Anna Newland of Kirkwood High School, Kirkwood, Missouri, for “ ‘Man’ made uniforms.”\nReally well-thought-out piece that incorporates historical anecdotes, including some high-profile examples to support the theme. Anna makes it easy for readers to relate to her opinions and empathize with her point of view. The closing argument in the last graph is direct, clear and relatable. Consider incorporating some of the national rhetoric on this issue. You have the French tennis official quote, yet the reader could learn from an understanding about what the established positions have been in general by leading voices on both sides.\nSecond place: Hayden Davidson of Kirkwood High School, Kirkwood, Missouri, for “Baseball’s hall of shame.”\nFirst graph sets up things nicely – your use of the term “purports” is a subtle yet powerful vehicle to introduce your opinion. This is a well-written piece with a delightful level of snark and a memorable closing graph.\nHayden provides helpful detail on a basic level for all readers to understand in terms of how the Hall of Fame process works and weaves in exceptional historical and statistical analysis to back up the argument.\nConsider including a previously stated opinion (there have been many) from a voter who explained why they didn’t vote for Clemens/Bonds. That would round things out.\nHonorable mention:\nZeinab Rakhshandehroo of Homestead High School, Cupertino, California, for “Neutrality or injustice?”\nReally liked how Zeinab laid out the central issue in the opening graph. It “set the table” for the whole piece. Including some historical examples to show how this is an unsettling trend was helpful to the reader. Zeinab’s opinion is clearly stated throughout, backed up with insight and personal reflection. Careful with typos.\nRhamil Taguba of Southwest Career and Technical Academy, Las Vegas, Nevada, for “Brady’s Fall From Grace.”\nNice powerful ending with clearly-stated opinions and conclusion. The reader will appreciate how Rhamil laid out the storyline, timeline and series of events that help shape the opinion. We liked the supporting graphic to enhance the overall points. We would have liked to have had the author’s opinion be known sooner. Even if it was teased in the first graph, the timeline could then be laid out and the piece closed in the same strong way. It took us awhile to know what Rhamil’s take was on the issue, but once we got there, Rhamil closed it out strong.\nJack Weakley of John Sevier Middle School, Kingsport, Tennessee, for “North needs renovations.”\nNice job laying out a list of examples of things that need work to support the premise. Jack is a strong writer, in terms of crafting sentences and paragraphs. A quote or two from an athlete about the sub-par facilities could have enhanced the piece. Consider stating your opinion in a stronger fashion up top and at the end to add some passion.\nArt\nPhoto Illustration by an individual\nFirst place: Evan Johnson of Shawnee Mission Northwest High School, Shawnee, Kansas, for “Checking the Balance.”\nA powerful image, technically perfect.\nSecond place: Ashley Broils of Shawnee Mission Northwest High School, Shawnee, Kansas, for “Would I Be More Beautiful.”\nThis image is so spot on in illustrating comparisons, especially regarding beauty. Very strong!\nHonorable mention:\nSariah Dehenaut of John Sevier Middle School, Kingsport, Tennessee, for “A curious action.”\nFaith Watters of Homestead High School, Cupertino, California, for “Staff discuss A-Building.”\nEvan Johnson of Shawnee Mission Northwest High School, Shawnee, Kansas, for “Month in Photos #1, Bo Black.”\nPhoto Illustration by a team\nFirst place: Jennifer Huang and Shannon Moser of Adlai E. Stevenson High School, Lincolnshire, Illinois, for “Handle With Care.”\nPerfectly executed both technically and illustratively.\nCartoons\nFirst place: Elizabeth Yuan of Adlai E. Stevenson High School, Lincolnshire, Illinois, for “Challenging the Court of Law.”\nExcellent symbolism, placement on page, and color usage. This was the most visually striking of all the cartoons entered.\nSecond place: Andrew Shu of Carlmont High School, Belmont, California, for “Overdoses come in many shades.”\nAn illustration that conveys the point of the article with the correct tone and interesting composition. We are impressed by the character design of the pill pusher in particular. A stand-out illustration! It should also be mentioned that this student’s other cartoon/article – “The Jaws of the Supreme Court” was a fantastic entry and the first one we saw and pulled aside. Excellent digital painting technique on both.\nHonorable mention:\nTimothy Bui of Adlai E. Stevenson High School, Lincolnshire, Illinois, for “Louder than Words.”\nThe idea and colors of the article/cartoon illustrate the point with a clever concept. The style is timeless but the concept is better!\nJennifer Huang of Adlai E. Stevenson High School, Lincolnshire, Illinois, for “Man Down.”\nExcellent concept and execution. Really clean piece and strong color scheme.\nIllustration\nFirst Place: Kai Murguz of Archbishop Riordan High School, San Francisco, California, for “National Suicide Prevention Hotline rolls out new number: 988.”\nEvocative mood and execution of content, while also informative of the information being broadcasted. It’s also nice to see traditional art entered that is really realized with a good sense of light and space! Excellent use of foreground, middle ground, and background.\nSecond Place: Emilia Miller of Ben Davis High School, Indianapolis, Indiana, for “Conspiracies.”\nLarge-scale multi-portraiture is really a huge swing- well executed, clean, and each character has their own story. Really interesting illustration to get lost in and imagine each story the characters correspond to. Well done!\nHonorable Mention:\nVee Chen of Archbishop Riordan High School, San Francisco, California, for “Everyone’s favorite web-slinger smashes box office records.”\nThe illustration is jam-packed with nods to comics and artists, as well as a well-rendered Spiderman figure with motion and bravado as it jumps off the page. The illustration could be improved with one color scheme rather than multiple, but well done, and lovely sense of energy and movement through the piece.",
  "word_count": 13215,
  "scraped_at": "2026-02-14T12:15:05.579269"
}