{
  "article_id": "6c156ed3cb8a",
  "url": "https://www.techradar.com/streaming/entertainment/watch-ufc-295-live-stream-prochazka-vs-pereira",
  "title": "How to watch UFC 295 live stream Prochazka vs Pereira , start time , odds , full card , full fights",
  "date": "20231111T074500Z",
  "domain": "techradar.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How to watch UFC 295 live stream —Prochazka vs Pereira, start time, odds, full card, full fights\nThe Octagon action heads to back to New York's MSG\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nYou are now subscribed\nYour newsletter sign-up was successful\nWatch a UFC 295 live stream\nUFC celebrates its 30th anniversary at the iconic Madison Square Garden on Saturday, when former middleweight title holder Alex Pereira takes on Jiri Prochazka in a bid to become a two-weight world champion.\nThe vacant light heavyweight belt is up for grabs in the main event after Jamahal Hill was forced to vacate through injury, opening up the possibility of Prochazka reclaiming the title he previously held last year.\nSaturday's bill is a rearranged affair after the scheduled headline fight between heavyweight champ Jon Jones and two-time champ Stipe Miocic was cancelled after Jones was laid low with a pectoral injury that looks set to sideline the fighter well into next year.\nDrafted onto the bill as co-main event is tasty looking showdown that sees Britain's Tom Aspinall take on Sergei Pavlovich in an interim heavyweight title fight.\nYou can watch the UFC 295 mixed martial arts on ESPN Plus for $79.99 with a PPV pass. In the UK, Prochazka vs Pereira is not a PPV and will be part of the regular TNT Sports subscription. It's the usual Kayo Sports PPV in Australia. Full details on how to watch a UFC 295 live stream online and on TV where you are just below.\nWatch UFC 295 live stream: preview and prediction\nPrelims for UFC 295 begin at 8pm ET / 1am GMT, followed by the main card at 10pm ET / 3am GMT, while the Prochazka vs Pereira ring walks are expected at around 12am ET / 5am GMT.\nFollow our guide below as we explain how to watch a UFC 295 live stream, so you can catch Prochazka vs Pereira and the rest in the Octagon, from anywhere.\nUFC 295 live stream: watch Prochazka vs. Pereira in the US without cable\nSee UFC 295 exclusively on ESPN+ PPV\nExclusive US coverage can be found on UFC on ESPN Plus. The main card starts at the earlier time of 10pm ET / 7pm PT, with Prochazka and Pereira expected to enter the Octagon sometime from 12 midnight ET / 9pm PT – depending on the duration of the other fights.\nThere are three options on cost, which depend on whether you already subscribe to the service.\n1. Existing ESPN Plus subscribers\nIf you already subscribe to ESPN Plus, then it's very straightforward. It's a classic pay-per-view scenario, and you'll need to spend $79.99 to watch UFC 295.\n2. UFC 295 + ESPN Plus\nIf you don't yet subscribe to ESPN Plus, you can take advantage of the value offer. You'll need to go for the UFC Bundle, costing you $134.98. That gets you both the UFC 295 PPV and a year-long subscription to ESPN+ that would normally cost $109.99 alone.\n3. UFC 295 + Disney Plus/ESPN Plus/ Hulu bundle\nYour final option is to buy access to UFC 295 and with it, get one month of access to the Disney Plus Bundle. So, that's 30 days of everything on Disney Plus - Marvel, Pixar, The Simpsons, Star Wars, etc. - the full catalog of live sports and documentaries on ESPN+, and the hundreds of box sets and films on Hulu. It's $94.98. That's $79.99 for the PPV and $14.99 for the Disney Bundle.\nUFC 295 live stream with the Disney Plus bundle\nUFC 295 plus one month of the Disney Bundle $94.98\nGet UFC 295 plus a month of sports and entertainment with the Disney Bundle. So, that's your UFC 295 PPV plus a month's access to ESPN+, Hulu and Disney Plus streaming services. It's $14.99 per month (with ads) thereafter if you'd like to continue. No contract. Cancel at any time.\nUFC 295 live stream without a PPV in Europe\nAs we say, you're kind of stuck if you're in the US. It's PPV or bust. Not so in Europe! Instead, it's sports streaming specialist DAZN that has the rights to the UFC 295 live stream.\nSo if you're a UFC fan in any of Austria, Italy, Germany or Spain, then get yourself over to the DAZN website.\nDepending on your region, DAZN offers Serie A and La Liga football, NFL and a whole host of other top-rank live sporting content.\nHow to watch Prochazka and Pereira: live stream UFC 295 in the UK\nTNT Sports, (formerly BT Sport) has exclusive broadcast rights to UFC events in the UK right now.\nThe great news is that UFC 295 is not a PPV event, so all you need is a standard TNT Sports subscription.\nLive coverage begins at 1am GMT in the early hours of Sunday morning on TNT Sport 1, and the main card action is set to start at 3am. Expect the Prochazka and Pereira ringwalks around 5am.\nTNT Sports currently costs £29.99 a month as part of Discovery+, or you can take it through your BT, Sky or Virgin Media TV package.\nProchazka and Pereira: live stream UFC 295 in Canada\nThere are a host of pay-per-view providers offering a UFC 295 live stream in Canada.\nYou can head to the likes of Shaw, Bell, Rogers, SaskTel, Videotron, Telus, Eastlink or YouTube. It's also available on the UFC Fight Pass PPV.\nTune into the main card from 10pm ET / 7pm on Saturday. Prochazka and Pereira is expected to start at around 12 midnight ET / 9pm PT.\nUFC 295 live stream: how to watch Prochazka vs. Pereira online in Australia\nAs per usual, you'll find UFC 295 and Jiri Prochazka vs. Alex Pereiraavailable on PPV in Australia, setting you back AU$59.95.\nThe main card is set to kick off at 2pm AEST on Sunday afternoon. Prochazka vs. Pereira are expected to make their way toward the Octagon at around 4pm AEDT.\nSo to watch the fight, you'll need to sign up via the Foxtel site or Kayo Sports Main Event. You can live stream the whole event via your web browser and devices like Android, iOS, Samsung TV, Apple TV, Android TV, Telstra TV and Chromecast.\nYou can also catch all the prelims and the main card using UFC Fight Pass.\nProchazka vs. Pereira live stream: how to watch UFC 295 in New Zealand\nSky Arena is offering UFC 295 in New Zealand a Prochazka vs. Pereira live stream – with the PPV priced at NZ$39.95 for all the main card action.\nYou'll want to make sure you're watching from at least the 4pm NZDT main card start time on Sunday to catch all the action.\nThe headline Prochazka vs. Pereira fight is expected any time from around 10am NZDT, depending on how the rest of the card plays out.\nWho is Jiri Prochazka?\nThis fight will be only the fourth UFC fight for Jiri Prochazka in what has already been an eventful ride since joining the promotion.\nHaving turned pro in 2012, Prochazka enjoyed a solid career in the Gladiator Fighting Championship, the biggest promotion in his native Czech Republic, before shifting over to the Rizin Fighting Federation in 2015 where he became Light Heavyweight champ.\nThe 31-year-old finally moved to UFC in 2020, with two eye-catchingly explosive knockout wins against Volkan Oezdemir and Dominick Reyes\nThose impressive displays earned him a fast-tracked route to a title fight against veteran Brazilian Glover Teixeira, with Prochazka claiming the Light Heavyweight belt at UFC 275 in June last year after a dramatic fifth round submission stoppage.\nA rematch was scheduled last November, but a shoulder injury forced Prochazka to pull out and vacate the title.\nWho is Alex Pereira?\nA former two-time kickboxing champion, Alex Pereira was comparatively inexperienced at UFC level when he was crowned middleweight champ last November following his blockbuster victory over Israel Adesanya in what was just his fourth fight for the promotion at UFC 281.\nThat unbeaten run would soon come to an end however, with the 36-year-old Brazilian star going on to lose the eventual rematch with The Last Stylebender at UFC 287.\nPereira would return at Light Heavyweight level, making his debut at the weight at UFC 291 back in July, with a match up against Jan Błachowicz that ended in a split decision victory.\nJiri Prochazka vs. Alex Pereira: who is favorite to win?\nPereira marginally out as favourite with the bookies to end the showdown in New York victorious, with the Brazilian fighter hovering around the 4/5 mark to win, while Prochazka's odds of victory are currently in at Evens.\nProchazka vs. Pereira: recent results\nProchazka hasn't entered the ring since stunning Glover Teixeira with a victory via submission with just 28 seconds left in the fifth round at UFC 275 back in June 2022 to claim the UFC light heavyweight title.\nPereira meanwhile bounced back from losing his middleweight crown to Israel Adesanya, by claiming a notable points win over Jan Błachowicz in his first fight at light heavyweight level back in July this year.\nUFC 295 full card and highlights\nBeyond the headline fight, the revamped UFC 295 card boasts a huge co-main event as Britain's Tom Aspinall clashes with Sergei Pavlovich for the interim heavyweight title.\nMain card\nJiri Prochazka vs Alex Pereira (vacant light-heavyweight title)\nSergei Pavlovich vs Tom Aspinall (interim heavyweight title)\nJessica Andrade vs Mackenzie Dern (women’s strawweight)\nMatt Frevola vs Benoit Saint-Denis (lightweight)\nDiego Lopes vs Pat Sabatini (featherweight)\nPrelims\nSteve Erceg vs Alessandro Costa (flyweight)\nTabatha Ricci vs Loopy Godinez (women’s strawweight)\nMateusz Rebecki vs Nurullo Aliev (lightweight)\nNadim Sadykhov vs Viacheslav Borschchev (lightweight)\nEarly prelims\nJared Gordon vs Mark Madsen (lightweight)\nJohn Castaneda vs Kyung Ho Kang (bantamweight)\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nKevin Lynch is a London-born, Dublin-based writer and journalist. The author of Steve Jobs: A Biographic Portrait, Kevin is a regular feature writer for a number of tech sites and the former Technology Editor for the Daily Mirror. He has also served as editor of GuinnessWorldRecords.com and has been a member of the judging panel for the BAFTA British Academy Video Game Awards. Alongside reviewing the latest AV gear, smartphones and computers, Kevin also specialises in music tech and can often be found putting the latest DAWs, MIDI controllers and guitar modellers through their paces. Born within the sound of Bow Bells, Kevin is also a lifelong West Ham fan for his troubles.",
  "word_count": 1759,
  "scraped_at": "2026-02-14T13:38:42.770442"
}