{
  "article_id": "6c3216932da9",
  "url": "https://www.westmeathindependent.ie/2024/03/12/gary-neville-hits-out-at-premier-league-over-lack-of-new-efl-funding-agreement/",
  "title": "Gary Neville hits out at Premier League over lack of new EFL funding agreement",
  "date": "20240312T193000Z",
  "domain": "westmeathindependent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gary Neville hits out at Premier League over lack of new EFL funding agreement\nBy PA Sport Staff\nSalford co-owner Gary Neville has accused the Premier League of negligence towards the rest of English football and branded the failure to agree a new funding deal for the EFL as an “absolute disgrace”.\nMonday’s shareholders’ meeting in London ended without an offer being made as top flight clubs feel the priority is to thrash out a new financial system to replace the current profitability and sustainability rules (PSR).\nA six-year deal granting the EFL 14.75 per cent of net media revenue with the Premier League – projected to be worth in the region of £900million – has been mooted but clubs are focused on getting their own house in order first.\n“I am more interested in the vote they didn’t have, which was to support the rest of the Football League which they keep bumping down the road and it’s an absolute disgrace,” the former Manchester United defender-turned-pundit told Sky Sports.\n“It is about the welfare of the game and the sustainability of the whole league.\n“The Premier League at this moment in time are negligent in their dismissive nature, just pushing it down the road, thinking ‘maybe a regulator will sort it, maybe we’ll sort it’ and not doing anything.\n“That’s not good governance, it just demonstrates to me that they are not looking after the whole game like they should be.\n“It angers me every time I see they have a Premier League meeting and seem to look after themselves but not look after the rest of football.”\nThe Premier League, which earlier outlined its stance in a statement, made no comment when contacted by the PA news agency for a response to Neville’s remarks.\nThe Government has repeatedly said it wants the football authorities to agree a new financial settlement among themselves, but has warned that one could be imposed upon them by ‘backstop’ powers set to be given to the new independent regulator.\nA Premier League spokesperson said on Monday: “At a Premier League shareholders’ meeting today clubs agreed to prioritise the swift development and implementation of a new league-wide financial system.\n“This will provide certainty for clubs in relation to their future financial plans and will ensure the Premier League is able to retain its existing world-leading investment to all levels of the game.\n“Alongside this, Premier League clubs also reconfirmed their commitment to securing a sustainably-funded financial agreement with the EFL, subject to the new financial system being formally approved by clubs.\n“The league and clubs also reaffirmed their ongoing and longstanding commitment to the wider game which includes £1.6 billion distributed to all levels of football across the current three-year cycle. The Premier League’s significant funding contributions cover all EFL clubs and National League clubs, as well as women and girls’ football, and the grassroots of the game.”\nThe EFL has declined to comment, and is expected to discuss the issue at a board meeting later this week.\nOne source with close knowledge of the situation in Government told the Daily Telegraph the situation is “absolutely shambolic given they briefed over the weekend that it would definitely go to a vote, and they have been ‘quietly confident’ it would pass for the last 10 days”.\nThe Department for Digital, Culture, Media and Sport has also been contacted for comment.\nThe Premier League is looking at a system more closely aligned with the squad cost to revenue ratio contained within UEFA’s Financial Sustainability Regulations.\nThose regulations will eventually limit clubs participating in European competitions to only spend 70 per cent of revenue on transfer fees, player wages and so on.\nThe Premier League has been looking at a model enabling clubs to spend up to 85 per cent of revenue on squad cost, with a sliding scale of penalties in place where clubs exceed that ratio.\nHowever, there is no guarantee that the new financial model will even be signed off at the league’s annual general meeting in June.",
  "word_count": 674,
  "scraped_at": "2026-02-14T13:11:03.479725"
}