{
  "article_id": "6c57f247875d",
  "url": "https://www.newcastleherald.com.au/story/8135220/magic-olympic-draw-in-dramatic-derby-while-azzurri-seize-nplw-nnsw-outright-lead/",
  "title": "Broadmeadow Magic , Newcastle Olympic draw in dramatic derby while Charlestown Azzurri seize NPLW NNSW outright lead : Round 4 | Newcastle Herald",
  "date": "20230326T101500Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It is always a highly anticipated match-up, and the round-four showdown between NPL Women Northern NSW big guns Broadmeadow and Newcastle Olympic at Magic Park on Sunday did not disappoint.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe drama-charged affair ended in a 3-3 draw, secured with an Adriana Konjarski free kick deep in stoppage time which was then followed by Magic teammate Kirstyn Antoni being red-carded for a second yellow card offence.\nIt was one of several yellow cards handed out throughout the fiercely contested encounter.\nThe result left the two sides unbeaten on 10 points while Charlestown Azzurri took the competition's outright lead on 12 points after beating Mid Coast 6-3 at Lisle Carr Oval.\nEmily Diaz continued her impressive scoring form with a five-goal haul for Azzurri, who led 3-1 at the break.\nThey were, however, tied 1-1 until the 37th-minute mark. Diaz opened the scoring in the seventh minute for Charlestown but Sophie Gallagher produced the first of a match brace in the 16th minute before Diaz found the back of the net a second time in the 37th minute then Lilly-Jane Babic extended Azzurri's lead two minutes later.\nDiaz scored again in the 65th, 78th and 83rd minutes to have the hosts up 6-1 before Gallagher and Sophie King netted late goals for Mid Coast.\nAt Magic Park, Broadmeadow took a 1-0 lead from the penalty spot in the 17th minute through Konjarski, who ended up with a match treble.\nThe spot kick was awarded when midfielder Kobie Ferguson, in her return from a knee injury which sidelined her for the whole of last season, was felled in the box by Olympic defender Jess Evans. Konjarski buried the ball into the left corner of the net.\nThe game was end to end with opposing keepers Ruby Jones (Magic) and Jayla Murphy (Olympic) making saves before Georgia Cook equalised with a left-footed shot from the top of the 18-yard box in the 38th minute.\nA leaping Murphy denied a long-range effort from Ferguson early in the second half then Jemma House got in behind Magic's defence on the counter attack and slotted past Jones in the 65th to give Olympic a 2-1 advantage.\nThe lead only lasted five minutes, however. Konjarski scored with a long-range free kick in the 70th minute which sailed over the head of substitute shot-stopper Alex Tagaroulias, who looked to have misjudged the ball's flight.\nThe game, and drama, was far from done.\nOlympic went 3-2 up with three minutes of regulation time remaining when House cut the ball across the face of goal and Magic defender Jannali Hunter booted it into her own net while trying to make a goal-line clearance.\nBut Konjarski ensured a share of the points when she scored with a carbon copy of her first free kick in the 96th minute.\nMaitland downed Warners Bay 19-0 at John Street Oval in the other game on Sunday.\nChelsea Greguric produced a five-goal haul, Maddy Howard and Ainsley Childs scored four each, Indianna Auddino bagged two and Madison Gallegos, Amy Parkinson, Sophia Laurie and Trinity Smith also got on the scoresheet for the Magpies.\nNew Lambton registered their first point of the season in a scoreless draw with Adamstown at Lake Macquarie Regional Football Facility on Saturday night.\nPoints: Azzurri 12, Olympic 10, Magic 10, Adamstown 7, Maitland 6, New Lambton 1, Mid Coast 0, Warners Bay 0.\nIN THE NEWS:\n- Sinkhole opens at Wallsend, forcing club to close and cutting off utilities for residents\n- RED LETTER DAY: Labor celebrating as Liberals take stock of dismal election night\n- Full potential untapped in female craft beer revolution\n- Explosive airshow wows spectators in the Hunter Valley\n- Off-duty police senior constable charged with drink-driving\nTo see more stories and read today's paper download the Newcastle Herald news app here.",
  "word_count": 645,
  "scraped_at": "2026-02-14T12:53:54.765442"
}