{
  "article_id": "6c77c25bccc2",
  "url": "https://metro.co.uk/2023/06/19/premier-league-refuse-new-chelsea-shirt-sponsorship-deal-with-paramount-plus-18973571/",
  "title": "Premier League refuse new Chelsea shirt sponsorship deal",
  "date": "20230619T101500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea have been refused permission by the Premier League for a new shirt sponsorship deal with Paramount Plus.\nChelsea’s current sponsorship deal with mobile network Three, which has been on the front of their shirts for the past three seasons, expires this summer.\nChelsea were aiming to reach an agreement with Paramount Plus, a streaming service based in the United States, but the Premier League has stepped in due to concerns with current broadcast partners.\nParamount Plus does not broadcast Premier League football in the United States but has Champions League, Serie A and National Women’s Soccer League (NWSL) coverage.\nIn the UK, the Premier League has Sky Sports, BT Sport and Amazon Prime as its three broadcast partners.\nChelsea are now in talks with Stake.com, a gambling website, as an alternative to Paramount Plus.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nHowever, Premier League clubs voted in April to ban all gambling-related sponsors on the front of their shirts from the start of the 2026-27 season.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Arsenal join Chelsea and Liverpool in race for £50m Championship star\nMORE: Three Chelsea players could agree to leave next week amid talks with Saudi clubs\nMORE: Mauricio Pochettino ready to sell Chelsea defender as Newcastle prepare £30m bid",
  "word_count": 275,
  "scraped_at": "2026-02-14T12:45:40.367336"
}