{
  "article_id": "6caf8ccdb5cc",
  "url": "https://www.theguardian.com/books/article/2024/jun/22/summer-reading-50-new-books-to-dive-into",
  "title": "Summer reading : 50 new books to dive into",
  "date": "20240622T083000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Fiction\nJames by Percival Everett\nIn this retelling of Mark Twain’s 1884 Huckleberry Finn, narrated by escaped slave Jim, the reader is pulled along on a journey of picaresque adventures as helplessly as the two runaways on the Mississippi River – and for them it’s a matter of life and death. “My name is James,” the protagonist writes with a stub of stolen pencil. “I wrote myself into being.” This angry, exhilarating, entertaining novel has been hailed as a masterpiece to equal the original.\nThe Ministry of Time by Kaliane Bradley\nBradley’s debut is a time-travel romance between 19th-century polar explorer Graham Gore and a Cambodian-British young woman in 21st-century London. Fizzing with sharp one-liners about everything from Tinder to e-scooters, the novel is also a thoughtful meditation on imperialism and immigration.\nLong Island by Colm Tóibín\nAnyone who wept at the end of Tóibín’s much-loved 2009 novel Brooklyn will rejoice at the news of a sequel. In Long Island, Eilis is now in her 40s, settled with Italian-American Tony and their two children, until a knock on the door one day changes everything. The novel returns to Enniscorthy, the small coastal Irish town of many of Tóibín’s novels, and the possibility of rekindling the romance with local landlord Jim Farrell. The will-they-won’t-they love story will have you entranced all over again.\nYou Are Here by David Nicholls\nHot on the heels of the hit TV series of Nicholls’s twentysomething romance One Day comes You Are Here, a Gore-Tex-clad romcom joining mid-lifers Marnie and Michael as they walk the costal path through the Lake District and the Pennines. Always on the cusp of laughter and tears, the reader is with them every step of the way. Make sure it’s in your backpack.\nLong Island Compromise by Taffy Brodesser-Akner\nAfter polystyrene factory owner Carl Fletcher is kidnapped in a well-heeled Long Island suburb, life for the wealthy Fletcher family will never be the same. A follow-up to one of the most riotously enjoyable novels of recent years, Fleishman Is in Trouble, this family epic is a page-turning foray into the American dream, inherited trauma and, most importantly, the effects of money. Out in early July, it’s written with the same comic brio and Botox needle-sharp observations that made Fleishman such a blast.\nEnlightenment by Sarah Perry\nFans of Perry’s bestselling 2016 novel The Essex Serpent will be delighted to see her return to home territory in Enlightenment. Set in the fictional riverside town of Aldleigh, a version of Chelmsford in Essex, where Perry grew up, and drawing on her strict Baptist upbringing, the novel brings together astronomy, religion and ghosts in a tale of unrequited love spanning decades.\nMy Favourite Mistake by Marian Keyes\nThe Queen of popular fiction is back with another story about the Walsh sisters. This time it is younger sister Anna, now 48, who has jacked in her high-flying PR job in New York, along with her relationship, to return to Dublin, where she finds herself living with her parents. Enter old flame Joey Armstrong (now post-therapy and into classical music) and the stage is set for a satisfying romance.\nWild Houses by Colin Barrett\nSet over a single weekend in the author’s native County Mayo, Wild Houses marries a thriller-ish plot about a kidnapping with the excellent prose for which he has become known. Barrett’s first novel is set amid the territory of his acclaimed short stories – small-time crooks, violence and fatalism – as we root for Nicky to escape the claustrophobia of a town where everyone knows everything about you.\nAll Fours by Miranda July\nPossibly one not to read on public transport, All Fours follows its 45-year-old protagonist as she leaves her child and husband behind for a road trip from her home in LA to New York. Barely 20 miles in, she catches sight of a hot young guy on a garage forecourt and books into a shabby roadside motel, where she embarks on a very different kind of journey. Like much of July’s often strongly autobiographical work as a writer, film-maker and performance artist, All Fours is outrageous, erotic, witty and moving.\nThe Lodgers by Holly Pester\nFollowing an unnamed narrator as she moves into a shared flat and remembers, or imagines, an alternative living arrangement with a single mother and her child, poet Pester’s debut novel explores the dislocation and loneliness of the housing crisis with sharply comic prose.\nMona of the Manor by Armistead Maupin\nWhat happens when the sexually and socially liberated characters of Tales of the City find themselves having cream teas in the Cotswolds? Maupin, who recently quit San Francisco for London, has fun with bucolic tropes and English manners in this unexpected coda to his much-loved series.\nSandwich by Catherine Newman\nNewman follows her bestselling debut, We All Want Impossible Things, with a deceptively light tale of a family’s annual pilgrimage to Cape Cod for one golden week in the sun. Only now the children, and grandparents, are getting older – and Rocky finds herself sandwiched between them. Poignant and laugh-out-loud funny, this is a perfect beach read.\nHeadshot by Rita Bullwinkel\nThis explosive debut novel takes us inside the Daughters of America Cup, a fictional amateur boxing tournament for girls aged 18 and under. Though the facilities are poor and the crowds small, the characters we follow are the eight best teenage female boxers in the US. Bullwinkel jumps between past, present and future to bring these powerful, brilliant, messy young women vividly to life.\nThe Kellerby Code by Jonny Sweet\nThere are shades of Saltburn in this blood-soaked black comedy about ambition, privilege and unrequited love. Socially awkward and strapped for cash, Edward will do anything for his best friends Robert and Stanza, but when the gilded pair test the limits of his loyalty, his helpfulness takes a sinister turn. Mixing Patricia Highsmith and PG Wodehouse, comedian Jonny Sweet’s contemporary take on the country house mystery is a darkly funny page-turner.\nThe Safekeep by Yael van der Wouden\nIn a 1960s Netherlands still haunted by the second world war, buttoned-up Isabel and tempestuous, vibrant Eva are thrown together one summer in a provincial house. Part love story, part mystery, this sensuous, tautly paced novel explores repression and desire, suspicion and complicity as it builds towards its emotionally devastating twist.\nThe Sleepwalkers by Scarlett Thomas\nA couple arrive for their honeymoon on an idyllic Greek island. They are staying in a grand stone villa with wooden shutters and cool terracotta tiles, where guests are told to leave their rooms unlocked. But the marriage is already on the rocks and, as the season comes to a close, a storm is rolling in. Violence, corruption and sexual secrets swelter just beneath the surface in this atmospheric thriller.\nThe Heart in Winter by Kevin Barry\nSet in 1890s America, this darkly comic western sees Irish dope fiend Tom Rourke and mail-order bride Polly Gillespie go on the run from Butte, Montana, with a stolen palomino horse and a saddlebag of money that isn’t theirs. As they fly west, these “hoodlums of love” are pursued by Polly’s God-bothering husband Long Anthony Harrington. Barry’s richly drawn cast of comic characters includes a Norwegian bounty hunter with a “calamitously outsized rear-end” and a tequila-worshipping reverend. Epic entertainment in compact form – what better to slip into your suitcase?\nYou Like It Darker by Stephen King\nRattlesnakes, ghostly children, rabid dogs, aliens, giant alligators, psychic dreams, clear air turbulence at 30,000 ft, serial killers and dark secrets lurking in the woods: nothing says summer like a Stephen King story. The 12 collected here offer his trademark mix of horror, suspense and dark humour while reflecting on everything from fate to grief.\nFrench Windows by Antoine Laurain\nRear Window in Paris. When photographer Natalie accidentally snaps a murder she sinks into depressed inertia, unable to work. In therapy, her doctor tells her to overcome her creative block by writing stories about the residents of the next door apartment. Starting at the ground floor, she tells the doctor all about an actor turned YouTuber, a songwriter, a disaffected trader – but as she works her way up, things start to get strange. A stylish and intriguing suspense.\nMy Friends by Hisham Matar\nA moving meditation on friendship and exile from the Booker-shortlisted novelist. Over the course of a two-hour walk across London, middle-aged Khaled looks back on the last 30 years of his life. As a teenager at Edinburgh university, Khaled travels to London with some other Libyan students to attend an anti-Gaddafi demonstration outside the Libyan embassy. When machine guns are fired into the crowd their larky trip turns to horror, changing the course of all their lives – and leaving Khaled forever longing for a homeland to which he can never return.\nPrivate Rites by Julia Armfield\nThe rain never stops. Ferries sail where trains once ran and anyone with money has retreated to higher ground. Faced with the “final stages” of climate collapse, sisters Isla, Irene and Agnes are also preoccupied with all the usual stuff: annoying commutes, crap relationships and toxic sibling rivalry. After the death of their famous father – a visionary but cruel architect – they come together in his imposing glass house, where his malign influence seems to live on. An evocative mystery set at the end of the world by the author of Our Wives Under the Sea.\nGreen Dot by Madeleine Gray\nPeppered with pop cultural references to The Wire, Rupi Kaur and Buffy the Vampire Slayer, this razor-sharp novel recounts the destructive affair between a disaffected millennial and her older married boss. It’s narrated by droll 24-year-old Hera who, after several arts degrees, has finally succumbed to corporate drudgery, working as an online community moderator in a large, cold office she fears she will never leave. It’s here that she meets Arthur, who quickly becomes the object of her obsession.\nOnly Here, Only Now by Tom Newlands\nA blistering debut driven by the vivid voice of its teenage protagonist. Cora, the narrator, lives on a council estate with her Mum and her Mum’s new boyfriend – shaven-headed shoplifter Gunner – in 1990s Fife: “a manky wee hellhole” of shuttered shops, old folks, seagulls and billowing litter. This bleak but funny coming-of-age story follows her struggle to break free from the post-industrial backwater and become her own woman, and builds an incisive portrait of life with ADHD.\nThe Husbands by Holly Gramazio\nWhen single thirtysomething Lauren gets back from a hen do to find a man in her London flat behaving as though he’s her husband, she’s too drunk to make sense of it. But he’s still there the next morning, and when he goes up to the loft, a different husband comes down. And then another. Games designer Gramazio has great fun with this high concept debut romcom.\nCaledonian Road by Andrew O’Hagan\nDickensian social novel meets airport blockbuster: weighing in at more than 600 pages, O’Hagan’s seventh novel is a rollicking, addictively readable slice of contemporary London life, from the great and not-so-good to the dispossessed youth hustling to survive. At its heart is the downfall of celebrity art historian Campbell Flynn, in an excoriating portrait of the smugness of the metropolitan elite.\nNonfiction\nKeir Starmer: The Biography by Tom Baldwin\nThe former journalist and Labour strategist delves into Keir Starmer’s family background, core beliefs and attitude to politics. The likely future prime minister will never be an open book – but becomes perhaps less of a mystery than before.\nHits, Flops, and Other Illusions: My Fortysomething Years in Hollywood by Ed Zwick\nThe director of Legends of the Fall and producer of Shakespeare in Love offers a guide for would-be film-makers trying to make it in Tinseltown and a gossipy romp for everyone else: he’s surprisingly candid about the travails of handling diva-like behaviour from stars such as Al Pacino and Julia Roberts.\nMy Family: The Memoir by David Baddiel\nAs hilarious as it is poignant, the writer and comedian’s account of growing up in a very ordinary and yet rather extraordinary family in north London in the 1970s and 80s details his mother’s not-so-secret affair, a difficult relationship with his father and being parented by his loving older brother.\nMaurice and Maralyn: A Whale, a Shipwreck, a Love Story by Sophie Elmhirst\nThe extraordinary story of the couple who blew up their comfortable suburban lives by deciding to sail across the world in a homemade boat. Their dream turned into a nightmare when they collided with a whale off the coast of Ecuador, spending the next 118 days adrift.\nNot the End of the World: How We Can Be the First Generation to Build a Sustainable Planet by Hannah Ritchie\nData scientist Ritchie uses facts and figures to debunk some surprising environmental myths and shows what a difference human beings can make when they put their minds to a problem. A hopeful climate read.\nThe Trading Game: A Confession by Gary Stevenson\n“There are many, many young, hungry, ambitious boys kicking broken footballs around lamp-posts in the shadows of east London’s skyscrapers,” writes Stevenson, but vanishingly few make it, as he does, into a banking world more commonly populated with the expensively educated offspring of aristocrats and oligarchs. A rags-to-riches story for the modern age, Stevenson’s account of his journey from poverty in east London to the bonus-driven, burn-out world of high finance lays bare the toll that the pursuit of profit takes both on individuals and society.\nRevolutionary Acts: Love & Brotherhood in Black Gay Britain by Jason Okundaye\nThe tender, radical, rebellious and, until now, largely unheard voices of a cohort of black gay men who came of age during the Aids crisis are brought to life in this vivid work of social history.\nA Very Private School by Charles Spencer\nThe brother of Diana, Princess of Wales, reveals the physical, emotional and sexual abuse he suffered at the hands of staff at Maidwell Hall, his first boarding school. The experience left him, and others like him, “with demons sewn into the seams of our souls”, he says, while writing the book became a form of therapy.\nKnife: Meditations After an Attempted Murder by Salman Rushdie\nOn 12 August 2022, the author of The Satanic Verses was speaking at an event in Chautauqua, New York, when a man rushed up on stage and stabbed him 15 times. For days, his life hung in the balance. This is his account of a terrifying episode and the slow road to recovery.\nCloistered: My Years As a Nun by Catherine Coldstream\nDevastated by the loss of her father in her 20s, Coldstream enters an austere order of nuns, spending her days in contemplation at a monastery in rural Northumberland. An atmosphere of petty rivalry and bullying gradually intensifies and she is forced to flee. A moving study of faith and personal discovery.\nNo Judgement: On Being Critical by Lauren Oyler\nThe US critic and author known for her bracing takedowns here turns her scalpel to, among other things, Ted Talks, Berlin, autofiction and the wild west of literary criticism that is Goodreads.\nCrypt: Life, Death and Disease in the Middle Ages and Beyond by Professor Alice Roberts\nRoberts shows how cutting-edge science is forcing us to rewrite familiar history in a series of fascinating case studies involving human remains.\nThe Anxious Generation: How the Great Rewiring of Childhood Is Causing an Epidemic of Mental Illness by Jonathan Haidt\nSocial psychologist Haidt believes there’s a simple explanation for the apparent rise in anxiety among children: their phones. “Phone-based” rather than “play-based” childhoods are exposing young people to bullying, harassment and graphic content, leaving an indelible mark on their brains and behaviour.\nBald: How I Slowly Learned to Not Hate Having No Hair (And You Can Too) by Stuart Heritage\nIt took a long time for Heritage to come to terms with the fact he was going bald, cycling through denial, anger, bargaining (for which, read: a comb-over) before finally accepting his fate. This darkly funny account of the process is the result.\nThe Garden Against Time: In Search of a Common Paradise by Olivia Laing\nA radical history of gardens as instruments of both oppression and liberation, threaded through with the author’s account of bringing her own patch of earth back to life.\nMy Family and Other Rock Stars by Tiffany Murray\nMurray grew up surrounded by rock stars, from Queen to David Bowie. But she wasn’t some privileged nepo baby – her mum was the cook at the legendary Rockfield Studios. Recollections, interspersed with recipes from the time, combine in a unique take on the music memoir.\nThe Secret Public: How LGBTQ Resistance Shaped Popular Culture (1955–1979) by Jon Savage\nQueer singers, producers and impresarios have had an outsize influence on culture, driving social and political progress as well as making great music. Savage’s meticulously researched but joyous history traces a line from Little Richard to Bowie and beyond.\nCatland: Feline Enchantment and the Making of the Modern World by Kathryn Hughes\nBefore they were beloved pets, cats were merely rough-and-ready mousers. Then along came the artist Louis Wain, setting in train a cultural transformation. Hughes’s deft history shows how dramatically feline fortunes have changed.\nUnder a Rock: A Memoir by Chris Stein\nThe Blondie guitarist’s first memoir charts his early years in Brooklyn, his romance with Debbie Harry, their rise to new wave stardom and its aftermath. Replete with tales of heroin, hairdos and hijinks on tour.\nNaked Portrait: A Memoir of Lucian Freud by Rose Boyt\nThe daughter of Lucian Freud and Suzy Boyt’s raw and complex account of sitting for her father and the chaotic, colourful and sometimes dangerous milieu in which she grew up.\nScattered: The Making and Unmaking of a Refugee by Aamna Mohdin\nGuardian journalist Mohdin reflects on her parents’ escape from war-torn Mogadishu, and how her experience as a child refugee continues to shape her life and work.\nEmpireworld: How British Imperialism Has Shaped the Globe by Sathnam Sanghera\nThe follow-up to 2021’s Empireland, which examined imperialism’s influence on British culture, explores the ways in which the legacy of empire still influences societies elsewhere, from Barbados to India.\nAll That Glitters: A Story of Friendship, Fraud and Fine Art by Orlando Whitfield\nIn the largely unregulated art market, sharp practices and scams can go under the radar – but only for so long. This is Whitfield’s account of how his charismatic friend and business partner ended up in federal prison for a multimillion-dollar fraud.\nThe Friday Afternoon Club: A Family Memoir by Griffin Dunne\nDunne, the charming never-quite-leading-man from a family of entertainment royalty – his father was a movie producer; his aunt was Joan Didion – has written a frank memoir full of gossip and incident. But it takes a dark turn when his sister is killed at the hands of her ex-boyfriend, and the account becomes a meditation on grief and justice.\nBroken Threads: My Family from Empire to Independence by Mishal Husain\nThe Today programme presenter uses the reminiscences and journals of her grandparents to paint a unique and personal portrait of the partition era.\nPaperbacks\nDoppelganger: A Trip Into the Mirror World by Naomi Klein\nThe author of No Logo often finds herself mistaken for Naomi Wolf, a writer with a very different worldview, and uses this as a jumping-off point for an exploration of truth and conspiracy in the digital age. A subtle, introspective book that won the first Women’s prize for nonfiction.\nHow to Say Babylon: A Jamaican Memoir by Safiya Sinclair\nSinclair was brought up in a strict Rastafarian family with a moody, abusive father who placed enormous restrictions on her personal freedom. Poetry was a form of escape for her – first metaphorical, via Poe and Dylan Thomas, and then literal, as she had her own work published to acclaim.\nGetting Better: Life Lessons on Going Under, Getting Over It, and Getting Through It by Michael Rosen\nComing round from a 40-day coma after a devastating Covid infection, the children’s author and poet reflects on what it takes to survive life’s inevitable losses and transformations.\nPolitics on the Edge by Rory Stewart\nAn indictment of the Cameron and Johnson governments, but also of our political system more broadly, from a former cabinet minister and Tory leadership contender. A serious study of government as well as a fly-on-the-wall account of ministerial life, full of hair-raising anecdotes.\nAll That She Carried: The Journey of Ashley’s Sack, a Black Family Keepsake by Tiya Miles\nAn embroidered sack passed down through generations helps Harvard historian Miles tell a brutal story of slavery and separation, but also of the enduring power of love.\nKairos by Jenny Erpenbeck\nSet in East Berlin between 1988 and 92, Kairos is both a love story and an allegory of the disintegration of the German communist dream. The affair between 19-year-old Katherina and Hans, a married writer 34 years her senior, begins passionately but descends into cruelty and surveillance. Written in a spare, urgent present tense, elegantly translated by the acclaimed German poet Michael Hoffmann, it won this year’s International Booker prize.\nThe Bee Sting by Paul Murray\nThe Barnes family are in meltdown: dad Dickie is struggling to keep the family business afloat; mum Imelda is eBaying like mad, but can never offload the baggage of a violent childhood; teenager Cass is worrying about getting into university; and 12-year-old PJ is trying – and failing – to keep out of trouble. Meanwhile, a doomsday prepper is building a bunker in the woods nearby. The financial crash and climate crisis hover over past and future, but this is a timeless family saga of secrets and lies.\nThe Fraud by Zadie Smith\nBased on the notorious 19th-century Tichborne trial and set on her home turf of Willesden, Smith’s first foray into historical fiction takes on slavery, while keeping one eye on current events. Ambitious in both style and subject matter, and bursting with Smith’s trademark sprightly dialogue, The Fraud is also very funny.\nThe Wren, the Wren by Anne Enright\nNell writes travel blogs about places she hasn’t visited and spends her days sobbing at YouTube videos. Her no-nonsense single mother Carmel has empty nest syndrome; Carmel’s father Phil, a pitch-perfect parody of the tweedy, self-important Irish poet – “long-dead, not terribly famous” – ran off when she was a girl and her mother was recovering from breast cancer. His desertion reverberates through the generations as the novel replays the drama of separation and connection.\nBrotherless Night by VV Ganeshananthan\n“I met the first terrorist I knew when he was deciding to become one,” confides 16-year-old Sashi at the start of this powerful novel, which follows her from 1981 through Sri Lanka’s brutal civil war. Intimate in tone, yet epic in scope, the book captures the devastating losses and moral complexities of living through a period of political turmoil. It is a worthy winner of the Women’s prize, doing for the Sri Lankan civil war what Chimamanda Ngozi Adichie did for the Biafran war with Half of a Yellow Sun.\nChildren and teenagers\nRecommended by Imogen Russell Williams\nMouse on the River by Alice Melvin, text by William Snow\nA transporting picture book for 3-6, this dreamy rowboat journey down a meandering river has enticing lift-the-flap details and a Wind in the Willows feel.\nBeti and the Little Round House by Atinuke, illustrated by Emily Hughes\nBeti lives in a little house in the woods with Mam, Tad and Baby Jac, and every season brings small, wondrous adventures: a birthday party and a tiny goat, splashing in streams or sheltering from storms. These richly absorbing 6+ stories are illustrated with great charm.\nTaking Shelter by Guy Bass, illustrated by Lee Cosgrove\nWho ate the maths homework? Hugh Dunnit, schoolboy detective, is on the case. The obvious suspect might be new dog Shelter, but Hugh has other ideas. Boasting outrageous puns and comic-style artwork, this hilarious hardboiled crime caper is ideal for 7+ readers who like shorter, highly illustrated fiction.\nCowgirls & Dinosaurs by Lucie Ebrey\nIn an alternative wild west where cowboys and dinosaurs coexist, Abigail, a vigilante crime fighter, lives just outside Little Spittle with her dino steed Rootbeer. Desperate to become a sheriff’s deputy, Abigail clashes with actual deputy Clementine, the Sheriff’s daughter – but when the Bandit Queen threatens their town, the two girls must join forces. A riotously comic graphic novel, perfect for 8+ Hilda fans.\nWild Languages of Mother Nature by Gabby Dawnay, illustrated by Margaux Samson Abadie\nFrom blustering black bears to mind-controlling fungi and the chemical messages of cut grass, this beautifully illustrated book for 8+ nature lovers is crammed with fascinating facts about animal (and plant) communication.\nNora and the Map of Mayhem by Joseph Elliott, illustrated by Nici Gregory\nWhen unconventional pensioner Nora is lumbered with great-grandkids Atticus and Autumn – just before a threatening note appears on her door – there’s only one thing for it. Nora and the kids set out on a fearsome quest involving snot, sea-monsters and industrial quantities of poo. A snort-out-loud, anarchic 8+ farce, with deft illustrations and an unforgettable octogenarian narrator.\nNush and the Stolen Emerald by Jasbinder Bilan\nAnushka is enraged by the British East India Company’s depredations in her father’s kingdom, especially the theft of a sacred emerald – so when the Maharajah sails to England to visit Queen Victoria, Nush accompanies him, determined to win the jewel back. A thrilling, atmospheric historical mystery for 9+.\nSomething to Be Proud Of by Anna Zoe Quirke\nWhen autistic, bisexual Imogen Quinn decides to organise a truly accessible Pride festival, she enlists the help of Ollie Armstrong, popular gay football captain (and Amelia, annoyingly perfect head girl). But when their fundraising efforts fall foul of school authorities, will their dream ever be realised? Adroitly balanced between dry humour and campaigning zeal, this witty, passionate YA debut will appeal to Ciara Smyth fans.\nOf Jade and Dragons by Amber Chen\nAfter her beloved father’s murder, Aihui Ying leaves home to infiltrate the Engineers Guild, home to her father’s past – and perhaps his secrets. But threatened with discovery at every step, can Ying find answers and escape with her own life? Intricately detailed, instantly gripping, this Chinese‑legend inspired fantasy will suit 14+ fans of Chloe Gong.",
  "word_count": 4404,
  "scraped_at": "2026-02-14T12:32:28.672019"
}