{
  "article_id": "6cca04cc7257",
  "url": "https://www.independent.ie/regionals/sligo/news/the-top-ten-things-to-do-in-sligo-this-week-june-28th-july-4th/a1943810422.html",
  "title": "The top ten things to do in Sligo this week : June 28th – July 4th",
  "date": "20230627T030000Z",
  "domain": "independent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The top ten things to do in Sligo this week: June 28th – July 4th\nThe festival season is well underway, and the events calendar in Sligo is jam-packed for the coming weeks.\nHere’s The Sligo Champion’s top picks for the coming week.\nSTEVE EARLE\nSligo Live presents a special solo-acoustic fully seated concert with Steve Earle on Wednesday, 28th June 2023 in the Knocknarea Arena at ATU Sligo. Special Guest is Roseanne Reid. Tickets are on sale now from sligolive.ie and Ticketmaster. Steve Earle is one of the most acclaimed singer-songwriters of his generation, writer of huge hits such as, ‘Galway Girl’ and ‘Copperhead Road’, this is a performance you don’t want to miss.\nPLUIRIN NA MBAN\nExperience the captivating beauty of traditional Irish folk songs fused with contemporary influences for this special album launch event, Plúirín na mBan, at The Hawk’s Well as part of the Cairde Sligo Arts Festival on Sat 1st July, 8pm. Join Hawk’s Well Theatre for an unforgettable performance with Cathy Jordan, Claudia Schwab (and Irene Buckley as they present the release of Plúirín na mBan.\nCAIRDE FESTIVAL\nCairde Sligo Arts Festival takes place from July 1st-9th with events to suit all interests. From music, visual arts, talks, theatre, the programme is jam packed with events, indoors and outdoors, in various locations across the county. Check out cairdefestival.com for full programme of events.\nUNDER MILK WOOD\nBlue Raincoat Theatre Company will perform Dylan Thomas’ ‘Under Milk Wood’ in The Factory Performance Space on Wednesday 28th, Thursday 29th and Friday June 30th at 8pm. When the production opens this week in The Factory Performance Space, it will not be delivered through the medium of radio. Instead the show will be a staged adaptation.\nOLÉ\nThe Hawk’s Well Theatre presents Olé, an evening of football talk and music to celebrate a historic moment for women’s football in Ireland in advance of the Women’s World Cup 2023, at the theatre on Thursday June 29th. Special guests will be joining hosts Jessica Farry and Donal Ryan to look at Ireland’s chances in the upcoming tournament and discussing what an exciting moment this is for women’s football locally, nationally and internationally.\nTHE HIGH KINGS\nThe Sligo Park Hotel hosts The High Kings on Friday, June 30th. The High Kings are currently on a nationwide tour of the country to celebrate 15 years of their amazing success, touring the world and sell-out gigs. Tickets are available from Ticketmaster.\nBEAN SÍ\nThe Model has commissioned Spilt Milk for the second of two exciting summer events, this time presenting Bean Sí with guest support Julia Louise Knifefist on Friday June 30th at 9pm. The gig is part of The Model’s ongoing partnership with Spilt Milk to showcase emerging sounds and off beat music from around Ireland.\nIN MEMORY OF SEAN\nA charity event is taking place in memory of the late Sean Dwyer, lifelong Sligo Rovers’ fan and former Treasurer who was a very popular and much loved character and was also founding member of the Heads Golf Society. The Heads Golf Society are organising an outing to Strandhill Golf Club to remember their dear friend publican and musician Sean, who was from Riverstown. A golf outing will be held at Strandhill Golf Club on Thursday, June 29th.\nThis will be followed by a night of music and memories in the Harp Tavern. All proceeds on the night from the raffle will be donated to the Northwest Hospice.\nTRAD@LUNCH\nWeek eight for the Trad@lunch 2023 series the Hawk’s Well is delighted to welcome Rick Epping, Ruth Clinton and Cormac McDiarmada playing Wednesday 28th June at 1:10pm. Always highly enjoyable, and ever popular, these events are free to attend and do not require a ticket.\nCHARITY HAT SALE\nA charity sale of Poppy’s high quality pre-loved hat collection will take place at the Riverside Hotel on Sunday, July 2nd. There will be lots of styles to compliment your outfit for upcoming weddings, events and the of course Ladies Day at the Races. All funds raised at the event will be donated to two of Poppy’s chosen charity’s. Focus Ireland CHY 7220 and St. Joseph’s School Sligo CHY 20140618. No admission charge.",
  "word_count": 698,
  "scraped_at": "2026-02-14T12:29:33.151414"
}