{
  "article_id": "6ccb33bf28d3",
  "url": "https://www.thenationalnews.com/magazine/2026/01/06/key-fashion-show-dates-to-look-forward-to-in-2026/",
  "title": "Key fashion show dates to look forward to in 2026",
  "date": "20260106T110000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New Year, new you, so the saying goes. Well, in fashion, 2026 has a lot to live up to, given that 2025 was one of the most impactful years when it came to raising the style stakes.\nThe fashion calendar can be a confusing place, with the schedule jumping from season to season. Haute couture, for example, caters to a wealthy audience looking for clothes to see them through the next six months of events – meaning that the shows in January offer ideas for spring and summer, while those in June will be far more autumnal and wintry. Couture is for the elite, and there is a growing number of regional names able to speak its precise language, including Elie Saab, Zuhair Murad, Georges Hobeika, Saudi's Ashi Studio and Dubai-based Syrian designer Rami Al Ali, who made his haute couture debut in July 2025.\nReady-to-wear, meanwhile, is tied to complex production timetabling, working in advance to showcase looks that will hit stores six months later. In real terms, this means the upcoming round of menswear collections in January unveil collections for September onwards, as too the women's shows in February and March. The men's and women's shows in June and September/October respectively, present collections that will be in the shops from March 2027.\nCruise (also called Resort) shows, which this year are slated to kick off in June, follow a different schedule, delivering lighter, more holiday-focused collections that will hit stores in October and November.\nAmid all of this, we can expect some high-profile debuts, as the musical chairs of 2025 continue apace. Ex-Dior creative director Maria Grazia Chiuri will deliver her first show for Fendi at Milan Fashion Week in February 2026. At Versace, following the recent exit of creative head, Dario Vitale and subsequent sale to Prada Group, the industry waits to see who will be appointed to replace him, and deliver the autumn/winter collection, also set for Milan in February.\nCloser to home, Riyadh Fashion Week has not announced any dates at the time of writing, with only the more generic Saudi Lifestyle Week so far slated for October. If this is a replacement event for RFW, or will be running alongside a yet-unannounced return of the successful Riyadh event, remains to be seen.\nIn the UAE, and building on its ability to draw major-name designers, Dubai Fashion Week will have Italian label Alberta Ferretti as the latest international brand to join its ranks, scheduled as the finale of the February round of shows.\nHere are some dates to know.\nJanuary\n- Pitti Uomo (men), autumn/winter 2026, Florence: January 13-16\n- Milan Fashion Week (men), autumn/winter 2026: January 16-20\n- Paris Fashion Week (men), autumn/winter 2026: January 20-25\n- Paris Haute Couture Week, spring 2026: January 26-29\n- Copenhagen Fashion Week, autumn/winter 2026: January 27-30\nFebruary\n- Dubai Fashion Week, autumn/winter 2026: February 1-6\n- New York Fashion Week (women), autumn/winter 2026: February 11-16\n- London Fashion Week (men and women), autumn/winter 2026: February 19-23\n- Milan Fashion Week (women), autumn/winter 2026: February 24-March 2\nMarch\n- Paris Fashion Week (women), autumn/winter 2026: March 2-10\nApril\n- Chanel Cruise collection, Biarritz, France: April 28\nMay\n- Dior Cruise collection, Los Angeles: May 13\n- Gucci Cruise collection, New York: May 16\n- Louis Vuitton Cruise collection, New York: May 20\nJune\n- Max Mara Cruise collection, Shanghai: June 16\n- London Fashion Week (men and women), spring/summer 2026-27: June 11-14\n- Pitti Uomo, spring/summer 2026-27, Florence: June 16-19\n- Milan Fashion Week (men) spring/summer 2026-27: June 19-23\n- Paris Fashion Week (men) spring/summer 2027: June 23-28\nJuly\n- Paris Haute Couture, autumn/winter 2026: July 6-9\nAugust\n- Copenhagen Fashion Week, spring/summer 2026-27: August 3-7\nSeptember\n- Dubai Fashion Week, spring/summer 2026-27: September 1-7\n- New York Fashion Week, spring/summer 2026-27: September 9-14 (expected dates)\n- Milan Fashion Week, spring/summer 2026-27: September 22-28 (expected dates)\n- Paris Fashion Week, spring/summer 2026-27: September 28-October 6 (expected dates)\nOctober\n- Saudi Lifestyle Week: October 5-7",
  "word_count": 666,
  "scraped_at": "2026-02-14T12:21:11.360895"
}