{
  "article_id": "6d0710419dbf",
  "url": "https://www.dailylocal.com/2025/08/10/bernie-driscoll-retires-after-guiding-kutztown-men-to-unprecedented-success/",
  "title": "Bernie Driscoll retires after guiding Kutztown men to unprecedented success",
  "date": "20250810T201500Z",
  "domain": "dailylocal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Bernie Driscoll, who guided the Kutztown University men’s basketball team to unprecedented heights, has retired after coaching the Golden Bears since 2000.\nThe 70-year-old Driscoll has informed director of athletics Renee Hellert that he will step down after 24 seasons, effective Aug. 22.\nHe led Kutztown to six Pennsylvania State Athletic Conference East championships, four PSAC title games and four NCAA Division II Tournament appearances despite the program ranking in the bottom half of the PSAC in athletic scholarships.\n“It was just time,” Driscoll said. “Coaching college sports has changed so much. The climate is different. If kids don’t like something, they’re transferring. And you know I’m kind of demanding. You gotta go to class. You gotta be a team player. You gotta do things.\n“I’m not sure that style is what’s needed today for our college athletes.”He finished with a 366-315 record, including Kutztown’s only four NCAA Tournament wins. He ranks fourth in career victories in PSAC East history and seventh in the PSAC overall.\nHe led the Bears to three 25-win seasons, in 2008-09, 2009-10 and 2016-17, and to 10 consecutive winning seasons in one stretch.\nDriscoll was hired after Kutztown had posted 12 straight losing seasons and just one 20-win season in its history. The Bears had six 20-win seasons under him.\n“I’m proud that we took over a program that wasn’t very good and made it good without bending rules,” he said. “I believe we did it the right way. My kids worked hard and graduated.”\nDriscoll, though, finished his career with five consecutive losing seasons, his worst stretch by far.\n“About five years ago we made a conscious effort to recruit high school kids because we couldn’t afford kids in the transfer portal,” he said. “It kind of backfired. That’s my responsibility.\n“I think the team we have right now is a pretty good basketball team.”\nIn his resignation letter, Driscoll “strongly” recommended that longtime assistant coach Tom York be hired to succeed him. York, an accomplished former KU player, coached the Golden Bears women’s team from 1987-94 and the Wilson High School girls team from 1996-2000.\n“Tom’s a hell of a coach,” Driscoll said. “He’d do a great job. To me, the transition should be smooth, seamless and easy.”\nSix of Driscoll’s players were voted the PSAC East Player of the Year: Bilal Salaam (2004-05), Bruce Hall (2005-06), Dave Ben (2008-09), Stephen Dennis (2009-10), Josh Johnson (2015-16) and Anthony Lee (2018-19).\nDennis, the NCAA Division II Player of the Year in 2009-10, ranks third in PSAC history with 2,406 points, Lee is fourth with 2,292 and Ben is 13th with 2,017. Salaam, who was an assistant coach for several seasons, ranks first in blocked shots with 408 and Ethan Ridgeway is third in assists with 687.\nUnder Driscoll, a four-time PSAC East Coach of the Year, the Bears won PSAC East titles in 2008, ’09, ’10, ’12, ’16 and ’17 and reached the NCAA Atlantic Regional final in ’09 and ’16.\nIn PSAC East history, only Bloomsburg’s Charles Chronister (559), East Stroudsburg’s Jeff Wilson (427) and West Chester’s Dick Delaney (370) have more coaching wins than Driscoll.\nHe was inducted earlier this year into the Berks County chapter of the Pennsylvania Sports Hall of Fame.\nDriscoll was an assistant coach at West Chester University for 13 seasons and graduated from Dickinson College in 1977 with a degree in biology. He played football and basketball in college and still holds several Dickinson receiving records.\nHe has been a coach for 48 years.\n“I still love to coach,” he said. “That adjustment is going to be awful.”\nDriscoll lives in the West Chester area and will be able to spend more time with his wife, Liz, their three children and their three grandchildren after finding a professional home at Kutztown.\n“I’m proud of our graduation rate,” he said, “and the relationships we developed with the players, professors, staff and some of the people in town. I’ll miss Kutztown. It’s a great school with great people.\n“I love it dearly, but it was just time.”",
  "word_count": 678,
  "scraped_at": "2026-02-14T13:23:00.885705"
}