{
  "article_id": "6d0b499bfe62",
  "url": "https://www.thelocal.it/20230613/trump-30-years-earlier-how-italys-berlusconi-invented-populist-politics",
  "title": "  Trump , 30 years earlier : How Italy Berlusconi invented populist politics",
  "date": "20230613T184500Z",
  "domain": "thelocal.it",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "\"He's the first. He invented everything,\" John Foot, modern Italian history professor at Bristol University, told AFP following Berlusconi's death on Monday aged 86.\n\"Everything revolved around him, his life, his success as a businessman, the simple slogans, the use of television,\" he said.\nREAD ALSO: Silvio Berlusconi: The scandal-hit ‘knight’ who divided Italians\nThese were \"all the tricks that other populists would copy\", from the United States' Donald Trump to Britain's Nigel Farage, Hungary's Viktor Orban and Brazil's Jair Bolsonaro, he added.\nAfter making his fortune in the construction industry and then the media, Berlusconi ran for election for the first time in 1994, with a video message in which he painted himself as a fresh start - an essential step for today's budding populists.\n\"The country... needs people with their heads on their shoulders... new men\" to replace the corrupt \"orphans of communism\", he said.\nHe positioned himself as a \"worker-Prime Minister\" who would end the \"policy of incomprehensible chatter, stupid bickering, and politicians without real jobs\".\nHis timing was impeccable, making his entrance in the middle of the tangentopoli, a vast anti-corruption operation which decapitated the political class.\nOnce in power, he protected himself from a series of legal woes by changing the laws on fraud, corruption and financial crimes.\nMany Italians saw themselves in Berlusconi: they too were not fans of the taxman, they liked scantily dressed women, they adored football.\nThey thought they paid too much tax while toiling for modest pay packets. It was to them that Berlusconi justified slashing public funds for research, undermining expertise when he asked \"why should we pay a scientist when we manufacture the best shoes in the world?\".\n\"Berlusconi tells the story of a self-made man capable of doing without the state thanks to a 'liberal revolution' which will allow all Italians who want to, to become entrepreneurs\", philosopher Anna Bonalume told AFP.\nREAD ALSO: What will happen to Italy’s government without Berlusconi?\n\"This promise - I'm one of you, you can become what I am - is the very essence of populism,\" said Bonalume, who wrote an essay on another of Italy's strongmen, Matteo Salvini, called \"A month with a populist\".\nBerlusconi painted himself as the defender of the people, a man who made a fortune despite the shackles of the state.\nHe used accessible rather than high-flying language, controlled much of the media, and shrugged off sexist and misogynistic behaviour as harmless fun.\n\"Trumpism bears the imprint\" of Berlusconism, the Repubblica newspaper wrote on Tuesday, calling Berlusconi \"The first populist\".\nBerlusconi is \"Trump, 30 years earlier\", said Surrey University politics professor Daniele Albertazzi.\nThe message is the same: \"The political elite have tricked you, but here I am, I've made billions through my cleverness, my hard work, and I want to do for the country what I did for myself.\"\nAnd like the former US president, Berlusconi constantly portrayed himself as a victim to justify his political or legal setbacks: \"A victim of the judges, of the political system, of the 'establishment', of the referees,\" said Foot.\nREAD ALSO: 'I got away with it!': Berlusconi’s most outrageous quotes\nThere was one notable difference between the two men though, he said. Berlusconi \"doesn't want to change politics for ideological reasons, it's just about himself and his business interests\".\nThat never stopped him from playing the religious card - a strong marker of identity for right-wing populists on both sides of the Atlantic.\nIt was an astonishingly brazen move, Albertazzi said, \"when you think of Berlusconi's extra-marital relations, including with very young people when he was in his 80s\".\nBut such contradictions did little to slow a man who - like Trump after him - used gratuitously offensive language borrowed from the \"people\".\nAt a Christmas party last year, he promised players at his Monza football club \"a busful of hookers\" if they beat the top teams, in just one of a very long line of outrageous comments - which did little to dent his popularity.",
  "word_count": 668,
  "scraped_at": "2026-02-14T12:45:51.616741"
}