{
  "article_id": "6d12035bc3ca",
  "url": "https://bestmediainfo.com/insights/from-anant-ambani-wedding-to-india-at-paris-olympics-starcom-july-culture-report-6936763",
  "title": "From Anant Ambani wedding to India at Paris Olympics : Starcom July Culture Report",
  "date": "20240830T073000Z",
  "domain": "bestmediainfo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New Delhi: Starcom has unveiled the Trend Report for July 2024. This comprehensive report offers a deep dive into various realms, from sports and entertainment to the world of reels and beyond. The Culture report is powered by BUZ AI.\nThe report covers trends across 4 major platforms –\n1.Google and X (formerly called Twitter)\n1.1.Cricket & Olympics & Sports\n1.2.Movies, Music and Entertainment\n1.3.Politics, International, Finance and Incidents\n2.Spotify\n3.Instagram\n3.1. Reels\n3.2. Memes\nIndia vs Zimbabwe T20 Series\nIndia clinched the T20 series against Zimbabwe with standout performances from Shubman Gill and Yashasvi Jaiswal. The series saw India dominate with both bat and ball. Notably, Yashasvi Jaiswal scripted history by smashing 13 runs in the very first ball of the Indian innings during the fifth T20I encounter against Zimbabwe on Sunday.\nMetrics: Twitter - #INDvsZIM (28,600 tweets), Jaiswal 18K+ tweets, Google - 5M+ searches\nTerms: Twitter: #INDvsZIM, #ShubmanGill, #YashasviJaiswal; Google: IND vs ZIM, india vs zimbabwe live, india vs zimbabwe 3rd t20; News: Shubman Gill, Yashasvi Jaiswal, series win\nWomen's Asia Cup\nIndia Beats Pakistan\nIndia's women's cricket team defeated Pakistan in the Women's Asia Cup 2024. The match saw stellar performances from Deepti Sharma and skipper Harmanpreet Kaur.\nMetrics:Google – Women’s Asia Cup 200K+ searches\nIndia beats UAE\nIndia's women's cricket team defeated UAE. Earlier Half centuries from Richa Ghosh and Harmanpreet Kaur took India to 201/5 in the first innings after UAE skipper Esha won the toss and opted to bowl first on a good batting pitch.\nMetrics: Google – India Women vs UAE Women 500K+ searches\nSemi Final Win\nThe Indian Women's Cricket Team defeated Bangladesh by 10 wickets in the semi-final of the Women's Asia Cup 2024, securing a spot in the final.\nMetrics: Google Searches - 'India vs Bangladesh Women’: 1M\nDefeat in Finals\nThe Indian cricket team was stunned by Sri Lanka in the final of the Women’s Asia Cup T20 2024 on Sunday as the hosts won the match in Dambulla by eight wickets. The Indian women’s cricket team won the Asia Cup seven times in eight editions previously. For Sri Lanka, it won their maiden title having lost the final five times previously to India.\nMetrics: Twitter - #INDvsSL 34K+ tweets; Google Searches - 200K+ searches\nJames Anderson Retires\nJames Anderson, the English fast bowler, announced his retirement from international cricket. Anderson's career spanned over two decades, making him one of the greatest bowlers in cricket history.\nMetrics: Twitter - #JamesAnderson: 7637 tweets, #Cricket: 111K tweets, #Retirement: 4777 tweets; Google - 'James Anderson retirement': 20K+ searches, 'Cricket news': 10K+ searches; News - 50+ articles\nTerms: Twitter: #JamesAnderson, #Cricket, #Retirement; Google: James Anderson retirement, Cricket news, England cricket; News\nSports\nEuro Semis\nEngland Vs Netherlands\nEngland faced off against the Netherlands in the Euro 2024 semifinals. The match was held in Dortmund, Germany, and saw England advance to the final after a thrilling encounter, with Ollie Watkins scoring the winner\nMetrics:Twitter - #EURO2024: 531K tweets, #ENGNED: 224K tweets, #Eurocopa2024: 204K tweets; Google - 'England vs Netherlands': 20K+ searches, 'Euro 2024 semifinal': 10K+ searches; News - 50+ articles\nTerms: Twitter: #EURO2024, #ENGNED, #Eurocopa2024; Google: England vs Netherlands, Euro 2024 semifinal, Euro 2024 final; News: England, Netherlands, Euro 2024\nSpain vs France\nSpain clashed with France in the Euro 2024 semifinals. The match took place in Munich, Germany, and saw Spain emerge victorious, with Lamine Yamal the stand out performer along with Rodri and Dani Olmo.\nMetrics: Twitter - #EURO2024: 531K tweets, #ESPFRA: 129K tweets, #Eurocopa2024: 204K tweets; Google - 'Spain vs France': 50K+ searches, 'Euro 2024 semifinal': 10K+ searches; News - 50+ articles\nTerms: Twitter: #EURO2024, #ESPFRA, #Eurocopa2024; Google: Spain vs France, Euro 2024 semifinal, Euro 2024 final; News: Spain, France, Euro 2024\nEuro Finals\nSpain vs England\nSpain and England faced off in the Euro 2024 final at the OlympiaStadion in Berlin. Spain aimed for their fourth title, while England sought their first Euro championship. The thrilling affair culminated with Spain winning Euro’24 with the score 2 - 1 Standout performances from Nico Wlliams, Lamine Yamal, Cucurella & Mikel Oyarzabal from Spain and Cole Palmer and Jude Bellingham from England.\nMetrics: Twitter - #EURO2024: 531K tweets, #ESPENG: 312K tweets, #EuroFinal: 146K tweets; Google - 'Spain vs England': 50K+ searches, 'Euro 2024 final': 10K+ searches; News - 50+ articles\nTerms:Twitter: #EURO2024, #ESPENG, #EuroFinal; Google: Spain vs England, Euro 2024 final, Euro 2024 winner; News: Spain, England, Euro 202\nCopa Amerića\nArgentina vs Colombia\nArgentina faced Colombia in the Copa America 2024 final. The match was highly anticipated, with Lionel Messi leading Argentina to victory.\nMetrics: Twitter - #CopaAmerica: 500K tweets, #ARGCOL: 20K tweets, #Messi: 50K tweets; Google - 'Argentina vs Colombia': 20K+ searches, 'Copa America final': 10K+ searches; News - 50+ articles\nTerms: Twitter: #CopaAmerica, #ARGCOL, #Messi; Google: Argentina vs Colombia, Copa America final, Copa America 2024; News: Argentina, Colombia, Copa America\nUruguay vs Canada\nUruguay and Canada faced off in a crucial match culminating in Uruguay finishing third at the Copa America after a 4-3 penalty shootout victory over Canada following Luis Suarez's dramatic injury-time equaliser.\nMetrics: Twitter - #Uruguay: 20K tweets, #Canada: 20K tweets, #Football: 111K tweets; Google - 'Uruguay vs Canada': 5K+ searches, 'Football match': 5K+ searches; News - 20+ articles\nTerms: Twitter: #Uruguay, #Canada, #Football; Google: Uruguay vs Canada, Football match, International football; News: Uruguay, Canada, Football\nWimbledon\nAlcaraz over Djokovic\nCarlos Alcaraz defeated Novak Djokovic in the Wimbledon 2024 final, securing his second consecutive Wimbledon title. The match was a thrilling encounter, showcasing Alcaraz's exceptional talent.\nMetrics: Twitter - #Wimbledon: 312K tweets, #Alcaraz: 317K tweets, #Djokovic: 155K tweets; Google - 'Alcaraz vs Djokovic': 20K+ searches, 'Wimbledon final': 10K+ searches; News - 50+ articles\nTerms: Twitter: #Wimbledon, #Alcaraz, #Djokovic; Google: Alcaraz vs Djokovic, Wimbledon final, Wimbledon 2024; News: Alcaraz, Djokovic, Wimbledon\nBarbara Krejcikova\nBarbara Krejcikova's performance in the tennis circuit has been noteworthy, she poses with the Ladies' Singles Trophy following victory against Jasmine Paolini of Italy during her Ladies' Singles Final match during day thirteen of The Championships Wimbledon 2024 at All England Lawn Tennis and Croquet Club on July 13, 2024 in London, England.\nMetrics: Twitter - #Krejcikova: 50K tweets, #Tennis: 111K tweets; Google - 'Barbara Krejcikova': 10K+ searches, 'Tennis results': 5K+ searches; News - 20+ articles\nTerms: Twitter: #Krejcikova, #Tennis, #WTA; Google: Barbara Krejcikova, Tennis results, WTA rankings; News: Krejcikova, Tennis, WT\nParis Olympics 2024\nOpening Ceremony\nThe Paris 2024 Olympics kicked off with a dazzling opening ceremony featuring a pre-recorded performance by Lady Gaga. The event was held on the banks of the River Seine and included a mix of cultural displays and athlete parades.\nMetrics: Twitter - #Paris2024: 2M tweets, #ParisOlympics2024: 133K tweets; Google Searches - Olympic related terms >200K+ across multiple days\nPerformances\nLady Gaga delivered a performance at the Paris 2024 Olympics Opening Ceremony, which was plagued by sound issues and a dancer falling off the stage. Despite these issues, the performance was well-received. Apart from her, Celine Dion also performed on the opening day.\nMetrics: Google Searches - 'Lady Gaga’: 50K+, Celine Dion 50K\nHS Prannoy's Olympic Debut\nIndian shuttler HS Prannoy began his Olympic campaign with a convincing victory against Germany's Fabian Roth in straight games.\nMetrics: Google Searches - 'HS Prannoy Olympics’: 10K Terms: Google - HS Prannoy Olympics\nIndia Mens Hockey Olympic Highlight\nIndia's men's hockey team started their campaign at the Paris 2024 Olympics with a thrilling 3-2 victory over New Zealand. Harmanpreet Singh converted a late penalty stroke to secure the win for India.\nMetrics: Twitter - #Hockey: 12,000 tweets; Google Searches - India at the Olympics 50K+ searches Terms: Google - 'India vs New Zealand hockey', 'India hockey Olympics2024'\nLakshya Sen's Winning Start at Paris Olympics\nIndian badminton player Lakshya Sen secured a victory over Guatemala's Kevin Cordon in his first outing at the Paris Olympics.\nMetrics: Google Searches - 'Lakshya Sen’: 50K+ searches Terms: Google - Lakshya Sen, Kevin Cordon, Badminton\nIndia's First Medal at Paris Olympics\nManu Bhaker won a bronze medal in the women's 10m air pistol event, opening India's medal account at the Paris Olympics.\nMetrics:Twitter - #ManuBhaker: 92K+ tweets, #Bronze with 158000 tweets; Terms: Twitter - #ManuBhaker, #Olympics2024\nMovies Music and Entertainment\nMajor Releases\nIndian 2\n'Indian 2', directed by Shankar and starring Kamal Haasan, has received mixed reactions. While many praised Kamal's powerful performance, the film's plot and direction have been criticized. The movie is a sequel to the 1996 film 'Indian' and deals with themes of corruption and justice.\nMetrics: Google: 500K+ searches, Twitter: #Indian2 trending with 123K+ tweets\nTerms: Google: Kamal Haasan, Shankar, Indian 2 review; Twitter: #Indian2, #KamalHaasan, #Shankar; Meta: Kamal Haasan, Shankar, Indian\nStree 2\nThe trailer for 'Stree 2' has been released, featuring Rajkummar Rao and Shraddha Kapoor. The film hit the screens on August 15, 2024.\nMetrics: Twitter - #Stree2 7K+ tweets, Google - 50K+ searches\nTerms: Twitter: #Stree2, #RajkummarRao, #ShraddhaKapoor; Google: Stree 2 trailer, Stree 2 release date, Stree 2 cas\nBigg Boss OTT\nBigg Boss OTT Season 3 was packed with drama as social media giants and rivals Elvish Yadav and Mr. Faisu, also known as Faisal Shaikh, came face-to-face. They appeared on the show to support their friends Lovekesh Kataria and Adnaan Shaikh, respectively. During one of the segments, Faisu and Elvish were placed in a witness box where they had to defend their friends Adnaan Shaikh and Lovekesh Kataria against a series of allegations.\nMetrics: Twitter - ~200K+ tweets relating to Elvish’s appearance on BBOTT3.\nDeadpool & Wolverine\nThe movie 'Deadpool & Wolverine' has been a major topic of discussion. It has received mixed reviews, with some praising the chemistry between Ryan Reynolds and Hugh Jackman, while others criticize it for being a self-cannibalizing slog. The movie has already broken box office records, with a worldwide opening weekend of around $438.3 million.\nMetrics:Google Searches - 200K+ searches\nTerms: Google: Deadpool and Wolverine, Wolverine Deadpool, Deadpool & Wolverine review\nRaayan Movie\nDhanush's 50th movie 'Raayan' has been released and is receiving a lot of attention. The movie is described as a 'monster of a film' by viewers, though it has received mixed reviews for its intense elements and emotional depth.\nMetrics: Twitter - 101000 tweets, Google Searches - 100K+ searches\nTerms: Twitter: #Raayan, #Dhanush, #RaayanReview; Google: Raayan movie review, Dhanush Raayan, Raayan review\nRobert Downey Jr. as Doctor Doom\nRobert Downey Jr.'s casting as Doctor Doom in the upcoming Avengers movie has sparked a lot of excitement from fans.\nMetrics:Twitter – ‘Robert Downey Jr.’ 11000 tweets, Google Searches - 200K+ searches Terms: Twitter: #RobertDowneyJr, #DoctorDoom, #Avengers; Google: Robert Downey Jr Doctor Doom, Doctor Doom casting, Avengers Doomsday\nCartoon Network Shutdown Rumours\nRumors about Cartoon Network shutting down have caused a frenzy among fans. The channel has clarified that it is not shutting down.\nMetrics:Twitter - #RIPCartoonNetwork (132,000 tweets), Google - 20K+ searches\nPodcast Chart\nCELEBRATION\nKargil Vijay Diwas\nKargil Vijay Diwas is celebrated annually on July 26 to commemorate India's victory in the Kargil War. This year, a special stamp was released to honor the martyrs.\nMetrics: Twitter - #KargilVijayDiwas: 4299 tweets, Google Searches - 'Kargil Vijay Diwas': 50K+ searches\nTerms: Twitter: #KargilVijayDiwas; Google: Kargil Vijay Diwas, Kargil War heroes, Kargil Vijay Diwas stamp\nGuru Purnima\nGuru Purnima, a day dedicated to spiritual and academic teachers, is being celebrated with various rituals and prayers across India.\nMetrics:Twitter - ~250K+ cumulative tweets for related terms, Google - 50K+ searches, Guru Purnima Quotes in Hindi 100K+ searches\nTerms:Twitter: #GuruPurnima, #GuruPurnima2024; Google: Guru Purnima, Guru Purnima 2024, Guru Purnima quote\nMuharram\nMuharram, the first month of the Islamic calendar, is being observed with various religious activities and public holidays in different regions.\nMetrics: Twitter - ~120K+ tweets cumulative tweets for related terms, Google - 30K+ searches\nTerms: Twitter: #Muharram, #IslamicNewYear; Google: Muharram, Muharram 2024, Ashura\nPolitics\nBudget 2024\nAngel Tax Abolished Union Finance Minister Nirmala Sitharaman presented her seventh Budget, proposing to abolish the Angel Tax to support innovation and entrepreneurship in the startup ecosystem. The Section 56 (II) (viib) of the Income Tax Act, known as angel tax, is applicable on any consideration of issue of shares that exceed the fair market value.\nMetrics: Google Trends: 200K+ searches, Twitter: #Budget2024 trending with 479K tweets, #NirmalaSitharaman >120K tweets, Finance Minister 92.8K tweets, #IncomeTax 23200 tweets\nImpact on Markets\nThe Indian stock market benchmarks plummeted nearly 2 per cent during the session in a knee-jerk reaction to Budget 2024. Sensex and Nifty plummet after Finance Minister Nirmala Sitharaman raises STT on F&O securities in Budget 2024-25.\nMetrics: Google Trends - 'Nifty': 200K+ searches\nBudget Tweets Analysis\nText Analytics\nThe Word Cloud indicates that the main focus of the tweets was on the finance minister, Nirmala Sitharaman, the Union Budget, and specific regional references like Andhra Pradesh.\nThe high usage of the lightning bolt emoji indicates strong reactions, possibly suggesting the impact or importance of the budget. Positive emojis like the tick symbol and the heart suggest approval or satisfaction among some users.\nThe Hashtags highlight the primary topics of discussion and suggest that the budget and its implications for development (Viksit Bharat) were central themes\nText Analytics LDA Topic Modeling:\nLDA (Latent Dirichlet Allocation) topic modeling identifies underlying themes in the text data. Key topics extracted include:\nAndhra Pradesh Support: Discussing support for Andhra Pradesh. Budget State: Conversations about the state of the budget.\nDemand for Bihar and Andhra Pradesh: Demand-related discussions involving Bihar and Andhra Pradesh.\nUnion Budget 2024: Specific references to the Union Budget 2024. Tax and New Income: Topics related to taxes and new income.\nMinister and Budget: References to Nirmala Sitharaman and the budget. • Schemes and Development: Discussion about schemes and development, particularly in financial terms.\nNirmala Sitharaman: Focus on the finance minister herself.\nFinance Minister and Middle Class: Discussions about the finance minister and implications for the middle class.\nBudget 2024-25: Specific references to the upcoming financial year budget\nPrabhat Jha Passes Away\nSenior BJP leader Prabhat Jha passed away at the age of 67 in Delhi's Medanta Hospital. The Prime Minister recalled his organizational acumen and also remembered his contribution in the field of journalism.\nMetrics: Google Trends - 'Prabhat Jha’: 20K+ searches Terms: Google: Prabhat Jha, BJP leader, Medanta Hospital\nINTERNATIONAL\nTrump assassination attempt\nFormer US President Donald Trump was injured during a campaign rally in Pennsylvania in what the FBI says was an assassination attempt. The shooter, Thomas Matthew Crooks, was found with bomb-making materials in his vehicle. Trump was shot in the ear but is safe. Worth noting that Twitter was filled with conspiracy theories with Staged trending\nMetrics: Twitter - #TrumpAssassinationAttempt 36000 tweets, #Trump 592000 tweets, #Trump 2.8M+ tweets, #President Trump 1.1M+ tweets; Google - Trump shot 500K+ searches; News - 50+ articles Terms: Twitter: #TrumpAssassinationAttempt, #Trump, #TrumpShot; Google: Trump shot, Donald Trump news, Trump shooting, FBI, SecretService\nFrench Elections\nThe recent French elections have resulted in a political turmoil with no single party or alliance gaining a clear majority. President Emmanuel Macron has refused the resignation of the Prime Minister to maintain stability.\nMetrics: Twitter - Google - France election results 50K+ searches; News - 40+ articles Terms: Google: France election results, French elections, Macro\nCrowdstrike – Microsoft Outage\nA faulty Crowdstrike software update caused a global IT outage, leading to widespread disruptions in systems with the Microsoft Operating Systems. The issue was identified, and a fix was deployed. Notably - CrowdStrike IT outage affected 8.5 million Windows devices, Microsoft says.\nMetrics: Twitter - #Crowdstrike (1M+ tweets) and #Microsoft (1M+ tweets) across multiple days, Google - 1M+ searches\nTerms:Twitter: #Crowdstrike, #MicrosoftOutage, #BlueScreen; Google: Crowdstrike, Microsoft outage, Blue Screen of Death\nCrowdstrike Virus Update Outage related Tweets Analysis\nThe word cloud prominently features terms such as \"Microsoft,\" \"CrowdStrike,\" \"Klaus Schwab,” (chairman WEF) \"entire globe,\" and \"cyberattack.\" These terms reflect the widespread impact and the major entities involved in the incident. Keywords like \"worldwide,\" \"planning,\" \"telling,\" and \"America\" highlight the global scale and the significant planning and coordination challenges posed by the outage.\nTop hashtags include #microsoft, #crowdstrike, #cyberattack, #india, #russia, #america, #germany, and #japan. This distribution shows the key topics of discussion and the geographical spread of interest or impact. Notably, \"microsoft\" and \"crowdstrike\" dominate, indicating these entities' central role in the discourse\nInsights\nThe most frequent bigrams include \"microsoft crowdstrike,\" \"germany japan,\" and \"world wide.\" This points to discussions about the involved companies and the international impact of the outage. Common unigrams are \"microsoft,\" \"world,\" \"crowdstrike,\" \"india,\" and \"cyberattack.\" These words further emphasize the focus on Microsoft, CrowdStrike, the global nature of the incident, and the allegations of a cyberattack.\nTopic Modeling:\nLDA identified the below underlying themes in the text data. Key topics extracted include:\nTopic 1: Focus on news and updates about the outage, a more generic cluster.\nTopic 2: Conversations about video reports on the entire incident, highlighting CrowdStrike and Microsoft.\nTopic 3: Specific updates from Microsoft, responses, and mentions of India.\nTopic 4: Technical advice or discussions about resolving issues, like using \"safe mode\nUS Presidential Election\nKamala Harris US Vice President\nKamala Harris is widely seen as the front runner for the Democratic nomination after President Joe Biden withdrew from the 2024 presidential race.\nMetrics: Google Trends: 200K+ searches, Twitter: #KamalaHarris trending with 4.74M tweets\nJoe Biden Withdraws US President\nJoe Biden ended his re-election campaign, leading to Kamala Harris becoming the front runner for the Democratic nomination.\nMetrics: Google Trends: 200K+ searches\nIncidents\nHardik Pandya Divorce\nIndian cricketer Hardik Pandya and his wife Natasa Stankovic have announced their divorce. The couple will continue to co-parent their son Agastya.\nMetrics: Metrics: Twitter - #HardikPandya ~100K+ tweets across multiple days, Google - 100K+ searches\nMumbai and Pune Rain Highlights\nHeavy and incessant rains have wreaked havoc in Mumbai and Pune, causing significant disruptions. In Mumbai, the Regional Meteorological Centre issued a red alert, leading to school and college closures. Pune experienced severe waterlogging, resulting in traffic disruptions and the opening of dam gates in Khadakwasla.\nMetrics: Twitter - #MumbaiRains: 16600+ tweets, #PuneRains: 7872 tweets; Google Searches - 'Mumbai rain news': 50K+ searches, 'Pune rain news': 100K+ searches\nTerms: Twitter - #MumbaiRains, #PuneRains, #RedAlert; Google - 'Mumbai rain news', 'Pune rain', 'Pune waterlogging'\nRajendra Nagar Accident in Delhi\nThe Rajendra Nagar area in Delhi faced severe flooding due to heavy rains, leading to a tragic accident at a UPSC coaching center. The basement of the Rau's IAS Study Circle was flooded, resulting in the death of three students. The incident has sparked significant outrage and calls for accountability.\nMetrics: Twitter - #RajendraNagar: 31K+ tweets, #Delhi: 131K+ tweets, Google: Rau’s IAS 5K+ searches\nTerms: Twitter - #RajendraNagar, #DelhiRains, #UPSC; Google - 'Rajendra Nagar accident', 'Delhi rain news', 'Rau's IAS Study Circle\nNEET Revised Result\nThe National Testing Agency (NTA) has released the revised results for NEET-UG 2024 following a Supreme Court directive. This has impacted the rankings and admissions for medical aspirants.\nMetrics: Twitter - #NEET_परीक्षा: 23200 tweets, Google Searches - NTA 50K+ searches, NEET Result 2024 20K+ searches\nGoogle: NEET revised result 2024, NEET UG result, NEET scorecard\nAditya Birla Group Enters Jewellery Market\nThe Aditya Birla Group launched its new jewellery retail brand 'Indriya', aiming to become one of the top three national players in the jewellery market within five years.\nMetrics: Twitter: Google Searches: 20K+ searches\nTerms: Google: Aditya Birla Group jewellery, Indriya launch, jewellery market\nPuja Khedkar\nTrainee IAS officer Puja Khedkar is embroiled in controversy over alleged false disability and caste claims. A panel led by DoPT additional secretary Manoj Dwivedi is investigating the matter. Additionally, her mother is facing an Arms Act case for brandishing a gun at farmers.\nMetrics: Google: ‘Pune IAS officer Pooja Khedkar’ 50K+ searches, ‘Trainee IAS officer Pooja Khedkar’ 20K+ searches\nTerms: Google: IAS officer, disability claims, caste claims; Twitter: #PujaKhedkar, #IASControversy, #ArmsAct\nAnant Ambani wedding\nThe wedding of Anant Ambani and Radhika Merchant was a star-studded affair attended by celebrities like Mahesh Babu, Priyanka Chopra, the Kardashians, Bollywood royalty and John Cena. The event was held at the Nita Mukesh Ambani Cultural Centre in Mumbai.\nMetrics: Google: 100K+ searches, Twitter: #AmbaniWedding trending with 44,400 tweets, #Ambani 230K tweets\nTerms: Google: Ambani wedding, Anant Ambani, Radhika Merchant; Twitter: #AmbaniWedding, #JohnCena, #PriyankaChopra\nFinance\nRVNL Share Price Surge\nRVNL shares hit 52-week high on LoA for project worth Rs 132.6 cr from Central Railway\nMetrics: Google: 100K+ searches\nRaymond Share Price Movement\nRaymond shares showed fluctuations due to the demerger of its lifestyle business.\nMetrics: Google: 50K+ searches\nSahaj Solar IPO\nSahaj Solar IPO received over 471x subscription on the final bidding day.\nMetrics: Google: 10K+ searches\nOthers\nAmazon Prime Day\nAmazon Prime Day 2024 is offering significant discounts on a wide range of products including electronics, fashion, and home appliances.\nMetrics: Google - 20K+ searches\nTerms: Google: Amazon Prime Day, Prime Day deals, Amazon sale\nOnePlus Nord 4\nOnePlus has launched the Nord 4, featuring a metallic unibody design and AI tools for media editing. The phone is priced starting at Rs 29,999.\nMetrics: Twitter - #OnePlusNord4 1454 tweets, Google - 50K+ searches\nTerms: Twitter: #OnePlusNord4; Google: OnePlus Nord 4, OnePlus launch, Nord 4 price\nRoyal Enfield Guerilla 450\nRoyal Enfield has launched the new Guerilla 450, a premium roadster built on the Sherpa 450 platform. The bike features a 452cc engine and multiple riding modes.\nMetrics: Twitter - #Guerrilla450 4058 tweets, Google - 50K+ searches\nTerms: Twitter: #RoyalEnfield, #Guerilla450, #Motorcycle; Google: Royal Enfield Guerilla 450, Royal Enfield launch, Guerilla 45\nTata Curvv\nTata Motors has unveiled the Tata Curvv, a new SUV coupe available in both ICE and EV variants. The vehicle is expected to launch on August 7, 2024.\nMetrics: Google - 20K+ searches\nTerms: Twitter: #TataCurvv, #TataMotors, #SUV; Google: Tata Curvv, Tata Curvv launch, Tata Curvv EV\nMemes and Posts\nViral posts",
  "word_count": 3625,
  "scraped_at": "2026-02-14T12:09:11.072620"
}