{
  "article_id": "6d2c5eca538f",
  "url": "https://www.5280.com/colorados-greatest-athletes-of-all-time/",
  "title": "The 12 Greatest Colorado Athletes of All Time Are ... ",
  "date": "20250601T204500Z",
  "domain": "5280.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Local newsletter is your free, daily guide to life in Colorado. For locals, by locals.\nLike literally, gaslighting, and synergy, we acknowledge that the term GOAT has become so overused in our vernacular, it’s nearly meaningless. (Please, before you speak, think to yourself: Is your co-worker truly the greatest co-worker of all time because they managed to file the report it’s their job to create by the deadline?)\nStill, as we watched Nuggets center Nikola Jokić endure yet another MVP snub—the man averaged a triple-double, becoming the first player to finish in the top three for scoring, rebounding, and assists in a single season—it got us thinking about all the athletes with Colorado ties who are literally GOATs (or well on their way to deserving the designation) in their respective sports. Here, we make our case for nine of them and honor four legends of eras past.\nJump Ahead:\n- Nikola Jokić\n- Anna Hall\n- Courtney Dauwalter\n- David Roche\n- Mikaela Shiffrin\n- Tommy Caldwell\n- Christian McCaffrey\n- Taylor Knibb\n- Lynn Hill\n- Joe Sakic\n- Chauncey Billups\n- John Elway\n1. Nikola Jokić\nIt’s Gotta Be the Shoes\nCould a day in Nikola Jokić’s Joker 1s transform a 48-year-old writer into a GOAT? I decided to find out.\nThirty-five years ago, my best friend showed up at my house wearing the Holy Grail of basketball sneakers: Nike Air Jordan 5s. The shoes were an athletic and aesthetic marvel—their reflective tongues glowing in the late-afternoon sun. They obviously possessed a mystical power, at least to a middle schooler immersed in the “Be Like Mike” era. My friend wanted to hoop in the driveway. With his new Jordans, he promised to kick my ass.\nThat he’d never played organized basketball didn’t matter. My friend blew past me for a layup. He sunk a dagger from 30 feet. My only defense was a physical threat: For every shot attempt, I’d step on his Jordans.\nI recalled that moment earlier this year when the Chinese brand 361 Degrees debuted Nikola Jokić’s first signature shoe, the Joker 1. The high-top was chunky, yet sleek—like the Serbian himself. It advertised something called Qu!kCQTECH that promised “more energy for jumping higher.” The undersole was resplendent in “Serbian ethnic patterns.” I was intrigued. For $130, perhaps I—like my friend all those years ago—could experience my own Greatest Of All Time moment.\nMy sneakers arrived a couple of weeks later. They were powder blue and white, with golden accents near the heel—and a size smaller than the ones I ordered. I gave a Joker-like shoulder shrug and decided this was my first lesson in greatness: A GOAT always adapts to adversity.\nStill, jumping on the court right away seemed too ambitious. If I wanted to become Jokić, to find out what it takes to rise from second-round pick to three-time NBA MVP, I needed to understand the Denver Nuggets’ big man.\nI stuffed my feet into my high-tops and drove to Virginia Village’s European Gusto Market & Café, where I ate ćevapi (a dish of flatbread and minced-meat finger sausages) while Serbian pop music played overhead. An elderly man smoked a Marlboro near the open door. I left 20 minutes later with a feeling of national pride (and a hint of indigestion).\nMy next stop was Christy Angerhofer’s Northeast Park Hill backyard. Angerhofer runs Denver Love Goats, an organization that uses goat therapy to support mental well-being. What better place to understand the GOAT mentality? Angerhofer introduced me to Marigold, her show goat. This GOAT goat’s deadeye stare evoked LeBron James’ during the Nuggets’ 2023 title run and reminded me that every GOAT needs a nemesis. “You’re going down,” I told Marigold.\nObviously, I was too keyed up. A GOAT must convey calm, and I needed something to relax me.\nJokić loves harness racing (a sport in which a horse pulls a driver in a two-wheeled cart) and owns a stable in Serbia. The closest thing I could find for live harness racing was at Havana Park, an off-track betting site in Aurora. I dropped $10 on Polly My Dolly to win the eighth race at Saratoga. She didn’t. Watching desperate men scream at grainy, closed-circuit televisions, I felt a sudden kinship with Jokić as he faced down a hostile road crowd.\nFinally, I was ready.\nI went to my town’s recreation center that night, where teenagers were playing four-on-four inside the gym. Hoping to get an invitation to their game, I grabbed a loose basketball and started firing at an adjacent hoop: air ball.\nThen it happened. My first make was a jumper from the free-throw line. I nailed another from the elbow. I took a three-pointer from the baseline—good! I hit a lefty hook. My final shot was a half-court heave that bounced off the rim. I must have made an impression, because the high schoolers were staring at me.\nOne of them approached. I played it cool, wiping imaginary dust from the soles of my Joker 1s. I heard the teen’s voice from a few feet away, looked at him, and smiled.\n“Hey,” he said, “can we have our ball back?” —Robert Sanchez\nRead More: Unraveling Our Reluctant MVP\n2. Anna Hall\nEverything but…\nHow’s it feel to win on every stage except the one the whole world watches? Anna Hall can tell you.\nAnna Hall won two individual track-and-field national titles in college. She owns the second-highest score ever recorded by an American heptathlete, behind only Jackie Joyner-Kersee. And she is one of only two U.S. women to win two medals—a bronze in 2022 and a silver in 2023—in the two-day, seven-event competition (100-meter hurdles, high jump, shot put, 200-meter dash, long jump, javelin throw, and 800-meter run) at the World Championships.\nThere’s just one place Hall hasn’t excelled: the Olympics. A hurdle crash that resulted in a broken foot thwarted her at the 2021 Olympic Trials and a herculean effort to come back from knee surgery ahead of the 2024 Olympics stalled in Paris, where she finished fifth. Here, the 24-year-old Greenwood Village native talks records, resilience, and her next shot at Olympic gold.\nEditor’s note: The following conversation has been edited for length and clarity.\n5280: How do you define “GOAT”?\nAnna Hall: I definitely wouldn’t consider myself a GOAT—yet. The indisputable GOAT in heptathlon is Jackie Joyner-Kersee. She holds the world record. I’m in a very measurable sport, so that’s what I have to chase.\nThat bar hasn’t budged in 37 years—and now Jackie is mentoring you.\nShe told me, “You have a shot at breaking the record,” and she encourages me in that. She was one of the last really great Americans. Traditionally, our event was dominated by Europeans. It’s almost like we [Americans] have a collective chip on our shoulder: We have the actual GOAT in this event, so we need to bring back the medals.\nYou had knee surgery five months before the 2024 Olympic Trials. How did you keep your mental game strong?\nIt’s almost impossible—I don’t think I did. On the tight timeline we were on, we worked closely with my surgeon at the Steadman Clinic [in Vail] to create an aggressive plan that bordered on risky. It was as much as we could push it. I was on the ground running 14 weeks after my surgery. There were definitely a lot of days I didn’t think I could do it, but I knew I would never forgive myself if I didn’t try.\nYet you won those Olympic Trials. Is resilience your superpower?\nMy initial marks early in the season were horrible. “She’s not going to make the team”—that was the consensus. That was really scary. [My competitors] smelled blood in the water, but I thought, No, we’re going to figure this out.\nYou didn’t medal in Paris. How are you dealing with that hole in your hardware collection?\nLast year was really the first time in my career I had put [a goal] on a piece of paper and I wasn’t close. That was very jarring for me. I hadn’t really considered that as a possibility. I had to do a lot of reflecting and acknowledging that I did go into [Paris] very banged up. I have to learn to make peace with that.\nIn 2028, the Olympics come to Los Angeles. Is that your time?\nIt makes me excited for the LA Olympics because now I know how to do this. In our event, you peak in your late 20s, early 30s. For me, LA lines up, and I think all of this is just going to help prepare me mentally. Nothing is going to shake me by the time 2028 comes around.\n3. Courtney Dauwalter & 4. David Roche\nGo Your Own Way\nFor anyone paying attention to the ultrarunning world, Leadville-based Courtney Dauwalter is a household name. Boulder’s David Roche, meanwhile, set a swift pace toward GOAT status by breaking the course record at the Leadville 100 this past August. The ultrarunners share the same goal: pushing the limits of what the human body can do. Their approaches, however, are pointedly different.\nTraining Strategy\nDauwalter: No coach, no plan, no problem.\nRoche: He curates his workouts based on the four S’s: speedwork, strength, silliness, and science.\nGo-To Gear\nDauwalter: The Shortney, a Salomon collab that brought the long-inseam shorts she’s famously donned throughout her career to the masses\nRoche: Running belt (he prefers the Naked brand) to store a bottle and gels\nPower Breakfast\nDauwalter: Homemade pizzas made with Kodiak Power Waffles; on race mornings, coffee (no food)\nRoche: Quaker Instant Oatmeal (with protein)\nStrava\nDauwalter: Nah.\nRoche: How else will Roche’s 26,411 followers know how fast he ran this week—and how, exactly, he did it?\nFavorite Training Partner\nDauwalter: Her feet (and sometimes hubby Kevin Schmidt)\nRoche: Megan, his wife and co-coach for Some Work All Play (SWAP), the Roches’ coaching business\nMantra\nDauwalter: You’re fine. This is fine. Everything is fine. It’s now printed on merch, along with a slew of Dauwalter’s rotating mantras, like Believe.\nRoche: H-O-T-T-O-G-O\nRead More: Finding Runner’s High, Facing Failure, and Other Trail Running Tips\nMust-Have Playlist Song\nDauwalter: “Don’t Stop Me Now” by Queen\nRoche: “Free” by Florence & the Machine\nHallucinations on the Trail\nDauwalter: Giraffes, flying eels, a leopard in a hammock, Mickey Mouse, a man playing the cello…\nRoche: None\nFirst Thing Consumed After Crossing the Finish Line\nDauwalter: Nachos and beer\nRoche: Nada right after a 100, but the next day, ice cream\nRace-day Essential\nDauwalter: A coin-size peace-sign token—a gift from her mom—that lives in her running pack\nRoche: Nipple Band-Aids\nGnarly Moment\nDauwalter: At the Hardrock 100, “I climbed aboard the puke train and just stayed on that for the rest of the race,” she recounted on the Freetrail Podcast.\nRoche: “At the Leadville 100, I chafed on a very sensitive area, and it was visible through my shorts.”\nLogistical Skills\nDauwalter: Her husband, who heads up her race crews, once compared her “tie-dye brain” to his “spreadsheet brain” in an Outside article. True to form, once when she was crewing one of his races, she forgot to put batteries in his headlamp.\nRoche: Roche runs a coaching business, produces the Some Work All Play running podcast with Megan, and is filming a YouTube series while training for Western States—oh, and he has a toddler and newborn at home.\nRead More: Is Leadville’s Courtney Dauwalter the GOAT of Ultrarunning?\n5. Mikaela Shiffrin\nMind Games\nFor the greatest skier of all time, it’s OK to not be OK—and to talk about it.\n“It’s like everything just feels darker.”\nMikaela Shiffrin was sitting in her hotel room in Austria. The day before, on February 11, the winningest alpine skier in history had grabbed gold in the team combined event (slalom and downhill) at the World Championships. However, she’d made the painful decision to sit out the giant slalom, due to what her psychologist would go on to diagnose as post-traumatic stress disorder.\nIn November 2024, the Edwards-based phenom, then 29, had crashed in the giant slalom in Killington, Vermont, sustaining a serious abdominal puncture. Many thought it was a season-ending injury. She not only returned to the World Cup circuit just two months later, but she also made history on February 23 when she earned her 100th World Cup victory.\nCelebration ensued, but as Shiffrin describes in a recent episode of her Moving Right Along YouTube series, it was also a period when she had to do the hard work of getting mentally well. “These visions that I have skiing,” she explains, “…these flashes. They’re called intrusive thoughts…. Every turn that I ski, I get a flash of myself crashing…blowing through the fencing…crashing into the trees. That really has forced me to pull back.”\nIt was an honest disclosure, not unlike others that have punctuated Shiffrin’s career in recent years. In 2020, her father died suddenly, leaving her to reconcile her all-consuming grief with her love for skiing. At the following Olympics, in 2022, many expected her to take gold in three events and possibly become the first athlete in history to win five golds. Instead, she crashed three times and left Beijing without stepping onto the podium. That’s when she began seeing a psychologist and opened up to the media about the toll that lingering grief and suffocating pressure were taking on her mental well-being.\nHistorically, that level of vulnerability hasn’t been the norm for elite athletes, who are often lionized for exuding confidence and chastised for admitting doubt. But Shiffrin—along with Simone Biles and Naomi Osaka, who both withdrew from their sports temporarily at the heights of their careers due to mental health issues—is helping to change that perception. “The more that these public, notable athletes…are sharing, the more it is destigmatizing,” says Jessica Bartley, senior director of psychological services for the U.S. Olympic and Paralympic Committee. “These athletes have the power to change the world.”\nIn some ways, they already have. At the 2022 Beijing Games, the International Olympic Committee experimented for the first time with reserving credentials for licensed mental health providers. The organization expanded the program in Paris two years later, “with the athletes really being at the forefront,” Bartley says.\nAlthough athletes are becoming more comfortable talking about their mental health, airing them publicly doesn’t necessarily fast-track recovery. “A lot of it is trust that with time and practice and exposure, that clarity will come back,” Shiffrin says in Moving Right Along. “I haven’t gotten there entirely yet, but I have improved drastically. Most days, the fog has lifted.” She hopes she can help others who are fighting their own battles, publicly or otherwise, en route to greatness. “We’re all just out there trying to improve and ski faster,” she says. “Unfortunately, psychological barriers have a much greater impact on more athletes than we even realize.”\nRead More: Mikaela Shiffrin Is the G.O.A.T.—And Also One of the Humblest Athletes of All Time\n4 Local Spots for Athletes To Improve Their Mental Health\n- Walker Psychological Services, Arvada\n- Performance Shift, Greenwood Village\n- Center for Performance Excellence, University of Denver\n- CBT Denver, Denver\n6. Tommy Caldwell\nFeeling the Flow\nTommy Caldwell isn’t scared of heights, but the view from down here spurs some second thoughts.\nWith one cheek pressed flat against a 3,000-foot vertical granite face, Tommy Caldwell’s chalked, chapped fingers danced insistently on the sheer surface of a monolith that has claimed more than 30 lives. The Colorado native was trying to lock in the perfect grip on El Capitan’s Dawn Wall in Yosemite. To the untrained eye, there was nothing to grab onto—and 1,300 feet of air beneath him. It was an impossible move.\nExcept that for Caldwell, it wasn’t. Engaging the most infinitesimal muscles to transfer his weight from one millimeters-thick wisp of a hold to the next, Caldwell methodically scaled one of the most unforgiving routes in the world without the aid of ropes, bolts, or other gear (he was only attached to a safety line). In this way, Caldwell and partner Kevin Jorgeson completed the first free-climb of the iconic wall in 2015.\nIt’s tricky to dole out superlatives in climbing, given its many disciplines and the warp-speed progression of the sport, but most agree that Caldwell’s cumulative accomplishments in big-wall climbing land him in a different stratosphere. That (very long) list includes the first ascent of Patagonia’s iconic Fitz Traverse; a sub-two-hour speed record of the Nose, El Capitan’s most notorious route, which takes most climbers three to four days; and, in 2023, the first ascent of Alaska’s Devil’s Climb via the Diablo Traverse (a massive, 9,000-foot effort) in one day.\nThe danger inherent in his sport isn’t lost on Caldwell, now 46 and living in South Lake Tahoe, California, who’s acknowledged that his relationship with risk has slowly changed since he had children. In a video for the American Alpine Club’s Climbing Grief Fund, he calls it an addiction of sorts. “In some ways, it’s positive,” he says. “When I’m pursuing risky things and transcending and finding ways to make them feel safe, it’s what brings me great emotional joy, which is healthy. But when I sit back and really think about the risk I’m taking and…the worst-case scenario…I experience regret for taking the risk.”\nSo how is Caldwell able to excel when he knows the fatal perils of big-wall climbing? It’s at least partly due to his atypical ability to achieve “flow,” says Jeff Elison, a psychology professor at Adams State University in Alamosa and the co-author of Vertical Mind, a book about the mental aspects of climbing. Flow comes from an automaticity gained through expertise and repetition. “All you’re aware of is the task at hand, typically when the challenge is really high, so you have no cognitive ability left over,” says Elison, who’s also a climber. “Your short-term memory and attention are fully engaged, so nothing else exists.”\nRead More: Local Climbing Phenom Releases Memoir\n7. Christian McCaffrey\nBig GOAT on Campus\nBefore he was an All-Pro in the NFL, Christian McCaffrey was just a sixth grader who could hurdle people.\nIn April, Valor Christian High School retired the jersey of its most famous alumnus, San Francisco 49ers running back Christian McCaffrey. The ceremony took place more than a decade after the Castle Rock native graduated, in 2014, which makes you wonder: What took so long?\nMcCaffrey ranks second in Colorado high school history for career points and all-purpose yards and is third in touchdowns. He also led the Eagles to four state titles. But while those stats are impressive, the only people who really understand how dominant McCaffrey was in high school are those who experienced his legendary feats firsthand. We asked a few of them to recount McCaffrey’s miracles. —Spencer Campbell\nOrigin Stories\nA.J. Cecil, Valor starting quarterback (2012–13): We played against each other in the sixth grade, and he returned the opening kickoff for a touchdown. We got the ball, stalled, punted, and he returned the punt for a touchdown. He scored the first or second time he touched the ball on offense. And he hurdled a kid—as a sixth grader. Yeah. He was a freak.\nBrent Vieselmeyer, Valor coach (2007–12): When Christian was a freshman, we played Grandview High School, which had a linebacker who went on to play in the NFL. We decided to give Christian the ball to get him some reps, but the coaches wanted to keep him on the edge of the defense because he was small back then. Well, the ball got fumbled and bounced up to Christian, and he was one-on-one with this linebacker. Christian shook him out of his shoes. It was one of those moments where you go, ‘No, no, no—oh, yeah!’\nStone Watson, Valor running back (2013–14): I transferred to Valor my junior year, Christian’s senior year, and watched a practice before joining the team. I’m thinking, I’ll be good enough to start here. Then I see this 205-pound white dude stiff-arming kids, running them over. It was like, OK, this kid is legit.\nFeats of Strength\nVieselmeyer: The unnoticed thing was how good he was on special teams. I think he had about six punt blocks his first year.\nWatson: He ran a post over the middle, and the safety had a bead on him. There’s no way he could have seen the safety. But as soon as he caught it, he spun past the safety and then ran 40 yards for a touchdown. You watch this guy and think, How does he do this?\nCecil: If I pitched it to him, he’d score. So sometimes I would run it myself or pass it just to keep the game interesting.\nThe Man Behind the Myth\nWatson: In the state championship game his senior year, we were beating Fairview High School 42-8 at halftime, which meant I got to play the second half. It was really cool. We played at Mile High Stadium. I scored a touchdown, and he was the first person who congratulated me.\nVieselmeyer: He never, never asked for the ball—except for one time. Some people on the other team were saying some terrible things about his family. He said, “Give me the ball,” and he went off and scored.\nCecil: He was the most humble person, even with those abilities. But if some dude talked smack, he’d run the guy over and glance back. He knew what he could do.\nNext in Line? Maybe Travis Hunter?\nBefore Travis Hunter, the University of Colorado Boulder’s most versatile athlete was Byron White. In the 1930s, the Whizzer was an All-American halfback, hit .400 in baseball, and started for the basketball team. He then really showed his range by serving on the U.S. Supreme Court from 1962 to 1993. It’s unlikely Hunter will ever compete in that arena. Then again, plenty of people criticized him after the five-star recruit committed to tiny Jacksonville State University.\nWhen he transferred to CU, they said he’d never be able to play receiver and cornerback full time against Division 1 competition. Amid fevered pearl-clutching over the transfer portal’s role in killing the “student-athlete,” Hunter posted a 3.8 GPA in Boulder. So, yes, keep doubting him. Perhaps that’s all the motivation Hunter needs to someday play ball in the nation’s highest court. —SC\n8. Taylor Knibb\nAll in a Day’s Work\nThree-time (and counting) world champion triathlete Taylor Knibb pushes herself to extremes during training—then wakes up and does it again.\nTaylor Knibb qualified for the 2024 Paris Olympics in the cycling time-trial event, an achievement that would mark the high point of most athletes’ careers. But that’s not even her best sport. The 27-year-old Boulderite and dual-sport Olympian is currently the world’s No. 1 ranked triathlete, according to the Professional Triathletes Organisation, having won the past three Ironman 70.3 World Championships (half the length of a standard triathlon) and gold in nine of her 14 races on the T100 Triathlon World Tour since 2022.\nSo what does it take to swim 1.2 miles, bike 56 miles, and run 13.1 miles faster than any other woman on the planet? Consistency, routine, and the unusual blend of a sunny disposition and a no-nonsense outlook. We caught up with Knibb to dig into some of the numbers behind her tri-training regimen.\n360\nDays per year she has oatmeal with yogurt (Fage Total, five percent milkfat) and black coffee for breakfast. “It’s really simple, and I never have to think about it. That’s the epitome of what I do—a lot of the same things every day. If someone lived my life for a year, at about six weeks, they’d be like, ‘OK, and now what?’ ”\n5 p.m.\nKnibb’s dinnertime. “My friends make fun of me, but when I finish my training for the day, I like to eat. And when I eat earlier, I sleep better. I know some of the best happy hour deals in Boulder! It’s not perfect—with that comes challenges—but I’m pretty clear about how I want to live my life.”\n100,000+\nMiles Knibb flew last year to compete in various races. “I have great status on United Airlines. Everyone thinks, Wow, it’s so great that Taylor gets to see the world. Well, I’ve been to Japan six times in the past five years, but I haven’t really seen Japan.”\n1.5/4\nHours of running and riding, respectively, that constitute her typical Sunday. “It’s not very glamorous.”\n80/60\nMinutes of swimming and strength training, respectively, Knibb logs on Mondays, Wednesdays, and Fridays. “Those are my easy days.”\n2\nWeeks she takes off at the end of each season. “The last thing I want to do is travel. My friends are very understanding of what I do. I don’t have a lot of friends who aren’t in this sport or a sport, because this is my lifestyle. I choose it, and I love it.”\n40-60\nPairs of running shoes she receives from Hoka, her sponsor, every year. “I use a new pair of shoes every race, but then I train in them after. I like to wear things into the ground.”\n3-5\nFavorite restaurants in Boulder. “I don’t go to the restaurant for the menu; I go for one dish. Maybe that’s a strange thing: the idea of taking the same walk every day and trying to see what’s different. But that’s the epitome of what I do. I find a lot of joy and peace in it.”\n9. Lynn Hill, 10. Joe Sakic, 11. Chauncey Billups & 12. John Elway\nLegends Never Die\nWelcome to Mt. GOATmore: four athletes carved into Colorado history.\nLynn Hill, Rock climber\nCareer: Hill’s accomplishments on the wall forever changed the perception of women in climbing. In 1993, she became the first person—man or woman—to free-climb El Capitan’s the Nose, a record that remained unbroken for more than a decade. Today, she and Tommy Caldwell are the only climbers who have done it in under a day. The 64-year-old Boulderite finished her career with more than 30 international climbing competition titles and a list of firsts too long to enumerate (highlights include being the first woman to send 5.12b, 5.13a, and 5.14a routes and the first free-climb ascents of two 5.12 big walls in Kyrgyzstan).\nFun fact: In her Boulder backyard, Hill installed a detailed replica climbing wall—down to the texture of the material chosen for the holds—of the infamous Changing Corners, a 5.14a pitch on the Nose known for tiny holds and requiring superprecise maneuvers.\nJoe Sakic, Center, Colorado Avalanche\nCareer: Sakic’s trophy case includes two Stanley Cups, an Olympic gold medal, and a World Cup of Hockey gold. Over two decades with the Avs, the Hall of Famer and 16-year team captain, known as much for his quiet leadership as for his universally feared wrist shot, was tapped for 13 All-Star Games, won an MVP trophy (2004), and retired in 2009 as the franchise leader in goals, assists, and points.\nFun fact: We can thank Harrison Ford for keeping Sakic in Denver when the New York Rangers tried to snap him up in 1997. The Avs, then owned by the struggling Ascent Entertainment company, had a week to match the Rangers’ offer. Fortuitously, Ascent had just released a little flick called Air Force One that became its first major blockbuster, drummed up confidence in the company’s solvency, and spurred its bigwigs to pony up the cash to keep Sakic—and build a new stadium now called Ball Arena.\nChauncey Billups, Point guard, Denver Nuggets\nCareer: They don’t come more homegrown than NBA Hall of Famer Chauncey Billups. The five-time NBA All-Star dominated hoops in Park Hill as a kid, led George Washington High School to two state championships, and turned down a plethora of collegiate heavyweights to play for the CU Buffs, where the All-American led his team to its first NCAA tournament appearance in 28 years. He was named the 2004 NBA Finals MVP during his time with the Pistons, then led the Nuggets to the Western Conference finals in 2009.\nFun fact: Though now the head coach of the Portland Trail Blazers, Mr. Big Shot has earned a permanent place in our hearts for his ongoing contributions to the Denver community. He created the Chauncey Billups Foundation to raise money for underprivileged families and the Porter-Billups Leadership Academy at Regis University to help at-risk students.\nJohn Elway, Quarterback, Denver Broncos\nCareer: When Elway retired in 1999, the nine-time Pro Bowler, now 64, was the winningest quarterback in NFL history and the first QB to have started five Super Bowls (and was voted its MVP in 1999). The Hall of Famer, known for his game-saving drives, was the NFL MVP pick in 1987 and the AFC Offensive Player of the Year in 1993. He returned to the Broncos in 2011 as a front office exec for the next dozen years. Sports Illustrated once called him the “Duke of Denver.”\nFun fact: Elway almost played right field for the New York Yankees instead of joining the NFL. He was the Colts’ No. 1 pick in 1983 but was put off by the organization’s lackluster record and coaching style. Before the season started, he used his option with the Yankees, where he’d already played a minor league season, as leverage to orchestrate a trade to the Broncos, where he spent his entire 16 years in the NFL.",
  "word_count": 4913,
  "scraped_at": "2026-02-14T12:11:28.931296"
}