{
  "article_id": "6d5526b22907",
  "url": "https://www.newcastleherald.com.au/story/8953508/newcastle-jets-secure-mizunuma-for-2025-26-season/?cs=305",
  "title": "Newcastle Jets secure Mizunuma for 2025 - 26 season | Newcastle Herald",
  "date": "20250429T071500Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NEWCASTLE Jets general manager of football Ken Schembri has confirmed that fan favourite Kota Mizunuma will return for a second season and said plans for the 2025-26 A-League campaign were well underway.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Jets bring the curtain down on 2024-25 against Melbourne Victory at AAMI park on Sunday.\nCoach Rob Stanton and his assistant Damir Prodanovic will finish up.\nMark Milligan is expected to be officially appointed as Stanton's replacement after the club's awards ceremony on May 9.\nThe former Socceroo will put together his own football staff.\nMizunuma was among 10 players whose future was uncertain.\nHowever, Schembri told the Newcastle Herald on Tuesday that the Japanese international had taken up an option for a second season in Newcastle.\nMizunuma, 35, has been a revaltion since his arrival during the January transfer, netting two goals and supplying four assists to help spark a late push for the finals.\nMidfielder Cal Timmins has been linked to Perth, where his family is based.\nBrazilian Wellissol is expected to return home.\nMatt Scarcella's loan deal is up and he will return to Sydney.\nJacob Dowse, who hasn't played in two seasons due to a chronic knee injury, will officially be released.\nRyan Scott, Dane Ingham, Daniel Wilmering, Charles M'monbwa and scholarship-holder Zac Bowling, who is on loan at Blacktown City, are expected to meet with the new coach in the next fortnight.\nHome-grown youngsters Will Dobson, Alex Nunes and Ben van Dorssen have a season to run on their scholarship deals.\nSchembri also confirmed that the club had rejected a request from Clayton Taylor to be released from the final year of his contract.\n\"I have formally advised Clayton's management that he is a contracted player for another 12 months and our expectation at this point is that he will stay on,\" Schembri said.\nThe Jets men are locked in ninth spot and automatically qualify for the main draw of the 2026 Australian Cup - avoiding a four-way play-off for two positions in the round of 32.\nNew chief executive Tain Drinkwater starts on Thursday but Schembri and the new coach will be responsible for shaping the roster.\nSchembri has completed a review of the men's program and is undertaklng the same process with the women's team.\nWomen's coach Ryan Campbell and a host of players are off contract.\nThe men's squad will assemble for pre-season training in early July. The women begin preparations in September.\n\"In between next week and the end of May, I would think that all new staffing appointments in the male space would be complete,\" Schembri said. \"The review of the women's program would be completed by then and with the board for implementation.\n\"That would allow the CEO five weeks to get across the business.\"\nAustralian Professional Leagues executive chairman Stephen Conroy announced changes to the A-League salary cap concessions earlier this month.\nFrom 2025/26 onwards, there will be just one marquee player per squad eligible to be exempt from a salary cap of $3million per club that will have all other concessions removed entirely.\nThe Jets don't have a marquee player and operate on a budget of about $3miillion.\n\"When you have been one of the bottom spending clubs, that impacts on us less than other clubs,\" Schembri said.\nThere had been speculation that Schembri would not continue beyond this season.\n\"I am looking to continue, subject to the board wanting me around,\" he said.",
  "word_count": 580,
  "scraped_at": "2026-02-14T13:21:05.197048"
}