{
  "article_id": "6d66eb3f6ace",
  "url": "https://www.counterpunch.org/2023/02/10/the-super-bowl-after-the-big-hit/",
  "title": "The Super Bowl After the Big Hit",
  "date": "20230210T074500Z",
  "domain": "counterpunch.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The echoes still linger from that national sigh of relief last month when Buffalo Bills safety Damar Hamlin, slammed into cardiac arrest during a game on January 2nd, was declared out of danger. It was a justified sigh. A vibrant young life had been spared.\nBut was that really what the nation was relieved about? If football fans had been so invested in the health and safety of the players, why were some 23.8 million of them watching that game in the first place?\nBy now, everybody should be aware of the incremental deadly damage inflicted on players’ brains in any game, so why will 200 million or more of us be watching the Super Bowl on February 12th?\nThat may be one of those unanswerable “Why do fools fall in love?” questions, but just thinking about it seems like a worthwhile exercise in everyday sociology. So here are my questions in response: Is it because we’ve evolved into people indifferent to the pain of others? Or maybe because many of us, as part of an evolutionary survival response, are hardwired to enjoy violence?\nAnd while I’m at it, let me ask you one other question: Should we do something about it — like cancelling football?\nJacked Up\nI think most of those who saw the Hamlin hit and heard the news about his recovery were sighing with relief not for him but for themselves, given the guilty pleasure of watching someone “jacked up” — an old ESPN phrase all but banned these days but still descriptive of one of football’s major thrills and horrors. I doubt anyone was rooting for an actual kill shot. Still, I suspect that, however unwittingly, many viewers were longing for the sensation that might accompany one, followed quickly by the usual cathartic release of a player lurching back onto his feet and being helped off the field, while giving his teammates a thumbs-up. (I’m okay, bros, so you’re okay, too!)\nBut is everyone really okay, especially us spectators? And what, if anything, happens next? A day after the Hamlin hit, a talk-show host asked me what I thought might result from Americans viewing the prospect of death in such an up-close-and-personal fashion on their favorite TV show.\nJust more talk, I replied, and then added, perhaps a little too quickly and glibly, “Ask me again after the next school shooting.”\nI heard a reproving grunt, but there was no time left to unpack that remark. Now, weeks later, it seems obvious to me what I meant. As with mass shootings, whose aftermaths are similarly riveting to TV viewers — by the time you read this, there will have been more than 50 of them since Hamlin went down that day — nothing meaningful is ever proposed to truly diminish the violence.\nAnd I do wonder what erosion of the spirit takes place when nothing is done time after time after time, whether we’re talking about those never-ending all-American slaughters (and the guns that go with them in the most weaponized country on the planet) or football’s endlessly commercialized brutality. I also can’t help wondering what normal has come to mean to us? Little surprise, then, that the war in Ukraine is beginning to seem like a distant geopolitical video game rather than an immense human tragedy.\nWhatever righteous chatter went on after the Hamlin hit, it mostly had to do with chastising the sportscasters of that Monday Night Football game between the Bills and the Cincinnati Bengals because they kept wondering aloud whether it would resume or be rescheduled. Granted, they weren’t exactly sensitive to the immediate crisis, but beating up on those particular barkers seems unfair. After all, what message has the National Football League (NFL) ever broadcast other than the game uber alles, whether it came to assassinations or brain injuries?\nIt took NFL Commissioner Roger Goodell an hour even to announce that he was postponing that game (which was, in fact, never resumed). By that time, it seemed obvious that the players and coaches had made their own decisions: they were too gutted to keep playing.\nTurning Point?\nI’ve also wondered if that specter of sudden death could become a turning point in the history of what’s arguably America’s most popular and perilous pastime. Might it serve as a “wake-up call” that could lead the game toward safer conditions or, as we head into the latest Super Bowl, will it simply confirm three already existing lines of thought: that we accept football as inherently dangerous; that its danger actually enhances its reality as more than a game (and the thrill of it all); and that we need to embrace that danger or risk the loss of football’s importance in a society in which so many men increasingly feel they’re losing ground to women.\nThe obvious fact that few women play on male high school or college teams and none in the NFL is critically important to its allure. Count on one thing: there will be female Seal team snipers before a woman will be allowed to take a televised Hamlin hit on a football field.\nThat the Hamlin hit itself was not spectacular only added to the aftershock. In fact, it looked all too routine. The 24-year-old safety had just positioned himself to stop Tee Higgins, the Bengals ball carrier, when Higgins ran into him, ramming his helmet into Hamlin’s chest. That hard hit, doctors have since speculated, triggered commotio cordis, a rare event in which the heartbeat cycle is knocked off rhythm. Oddly enough, such a result would be more likely in baseball or lacrosse if a struck ball directly impacted someone’s chest wall. Commotio cordis can indeed be fatal in rare cases if the blow lands precisely in the vulnerable instant between heartbeats, which is what seems to have happened here.\nHamlin fell backward, got up, then collapsed like a broken toy.\nMedical personnel quickly swarmed onto the field and started administering CPR. His Bills teammates and then the Bengals, too, began to close ranks, embrace, hold hands, pray, even cry. They knew it was serious and were undoubtedly reminded that it could have happened to any of them. It surely brought their worst fears to the surface, the ones they normally are in denial about.\nAs Sally Jenkins of the Washington Post pointed out soon after that hit, such violence is, in fact, baked into the game in a way that’s almost too routine to pay much attention to most of the time. As she vividly described it:\n“You want to feel what NFL players do on an average play? Run full speed into a wall mirror.\n“And while you’re lying on your back trying to regain your senses, consider the following math problem: Two large NFL players, who cover 40 yards in less than 4.5 seconds, collide, causing each to decelerate to zero. Roughly how much force do they — their skin, their bones, and their organs — endure on just a single such play?”\nThe college and professional players willing to endure such regular pain and damage for love and/or money, understand that possible injury or even death underpins the very reality of football. In fact, in some gruesome fashion, that’s what makes football seem authentic. It transforms players into valiant avatars of manhood instead of glorified stuntmen or, as in most sports other than the martial arts, merely entertainers who might still get hurt if they didn’t watch out.\nDoes Football Equal Manhood?\nIn fact, that very connection of football to manhood, whether you’re talking about the toxic masculinity critics decry after every varsity-related rape allegation or the mythical traditional heroism trumpeted by the sport’s boosters, has been critical to its success. The NFL sells the sport as a symbolic, vicarious version of warfare, something particularly significant for a male population that no longer faces obligatory military service (at a time when that same military has become at least slightly more welcoming to women). And don’t forget the way the sport helps contain the nuclear energy of millions of teenage boys. The image of them running loose through the slums and small towns of America has surely helped facilitate the approval of so many high-school football budgets. In later years, those tamed youths never seem to lose their sentimental attachment to the father figures who taught them obedience to authority and the supposed values of inflicting and absorbing pain on the field.\nSuch feelings were evident among the millions of fans who followed Hamlin into intensive care and thrilled to his first reported words to his doctors when he regained consciousness (written because he was intubated): “Did we win?” And they were no less satisfied when he could again speak to his teammates, even if from his hospital bed. “Love you, boys,” was what he said — the perfect words for the hero of the story. It was a week before he could be moved from Cincinnati back to a hospital in Buffalo, nine days before he could go home with internal damage that will require a long rehab. In the weeks that followed, his popularity became monetized and his personal charity, which reportedly had raised only modest thousands of dollars, soared into the millions in a few weeks.\nToo bad that money wasn’t for him. Like many players who get seriously injured in their first years in the NFL, Hamlin’s contract undoubtedly isn’t set up to cover long-term benefits or a pension, which means he may be way underinsured for what could lie ahead.\nThe Inspirational Narrative\nDamar Hamlin had been a fringe second-year player on the Bills who blossomed when he suddenly replaced an injured starter. His emergence coincided with the team’s spectacular season. It ended three weeks after that hit with the spectral presence of Hamlin waving and making a heart with his hands from a snow-dusted luxury box window as the Bengals beat the Bills in the playoffs, sinking their Super Bowl dreams.\nNevertheless, the narrative remained inspirational, focusing on the NFL’s quick medical response and Hamlin’s “miraculous” recovery.\nAs the Nation‘s Dave Zirin noted in his Edge of Sports column, however, this is anything but\n“a feelgood story. It should be an opportunity to discuss how players are often treated as expendable extensions of equipment and not as human beings. It should be an opportunity to debate the sport of football itself and whether it is safe for human beings to participate in it… Instead, they want us to discuss how inspirational Damar Hamlin is for his teammates and for fans across the country. But a near-death experience should never be seen as joyous, and it is a revelation of the NFL’s nihilism that this is the product they are expectorating back at us.”\nOkay, so where do we go from here? Has the time finally come to make a choice, as you should have done with your other indulgences? You’ve quit tobacco and probably should quit alcohol. Now, as the Super Bowl looms, is it time to turn your back on football? Or would you prefer to “man up” and leave any qualms about its violence in the dust of (all too recent) history. Will you embrace it as who you are and what you want?\nI know which way I’m heading — I’ve been heading there for a long while. In all honesty, I think there’s no middle way, no way to keep watching the game as a witness with reservations or to pretend to be a concerned sociologist rather than one of its enthusiasts. Sorry, it really is time to either get over it or get out.\nThese will, of course, be individual decisions because there’s simply too much money involved in the sport to expect positive public-health decisions by the government (local, state, or federal). After all, entire cities are held hostage by stadium deals; international media companies are under contract for years to come; and the interlocking business and personal relationships of several dozen billionaire Republican team owners rule the roost. Perhaps the most telling proof of football’s long-term power is the way it’s made its financial peace with the gambling industry. Sixty years ago, several of the league’s biggest stars were suspended simply for betting on games. How quaint that now seems, as the NFL has bedded down with that industry to the tune of hundreds of millions of dollars in revenue.\nSo, calls for the banning of football would be a distinctly quixotic gesture designed to make us feel righteous and nothing more. Skip it. Even demanding radical reform by softening the game through rule tweaking to turn it into the equivalent of flag or touch football is now unimaginable. Besides, the NFL is ahead of you on that. In its support for the no-tackle game of flag football lies the same capitalist foresight that alcohol and tobacco brands showed when investing in the marijuana industry.\nBut all is not lost. If we’ve learned anything from football, it’s that trying harder, playing hurt, and never giving up is the essence of the sport. The game, they like to say, is never over till it’s over. Beyond turning your back on football, the single most significant thing you can do is to keep your kids from playing the game, not just to protect them but also to pinch off the pipeline of more fungible bodies, even as the far safer alternative of soccer waits on the sidelines. (Forty years ago, I wouldn’t allow my son to play high-school football and he’s still not happy about that. Tough.)\nOtherwise, you can just accept the seeming consensus that football reflects American values of aggressive domination as surely as America refracts football into a model of muscular Christianity — and (as indeed I will) without significant shame or guilt enjoy the Super Bowl, sometimes a great game, but never one to die for.\nThis column is distributed by TomDispatch.",
  "word_count": 2322,
  "scraped_at": "2026-02-14T12:14:09.022416"
}