{
  "article_id": "6d84ee63a2c9",
  "url": "https://www.justarsenal.com/match-review-dominant-arsenal-women-avoid-first-half-scare-to-seal-all-three-points-v-everton/388573",
  "title": "Match Review : Dominant Arsenal Women avoid first half scare to seal all three points v Everton",
  "date": "20250316T121500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal Women delivered a commanding performance on Friday night, overcoming a first-half scare to secure a 3-1 victory over Everton in the Women’s Super League. The win propelled Arsenal to second place in the league table and showcased their resilience following last week’s FA Cup disappointment.\nThe match began with both teams showing intent but struggling to find rhythm. Arsenal welcomed the return of goalkeeper Manuela Zinsberger, whose early nerves were evident as Everton created a few dangerous opportunities. Honoka Hayashi tested Zinsberger with a fierce strike, but the Arsenal keeper responded well. On the other end, Arsenal’s attacking efforts were initially stifled by Everton’s organized defense.\nThe breakthrough came in the 24th minute when Arsenal’s marquee summer-signing, Mariona Caldentey’s, incisive pass found Kim Little, who delivered a precise low ball across the box. Alessia Russo, ever clinical, tapped it home for her 14th goal of the season. However, Everton responded just 12 minutes later. A misplaced pass from Lia Walti led to a chaotic scramble in Arsenal’s penalty area, allowing Toni Payne to slot in the equalizer—her first goal for Everton.\nThe first half ended level, but Arsenal emerged from the break with renewed determination. Despite dominating possession and creating chances, they struggled to convert as Everton’s defense held firm. Manager Renée Slegers made decisive changes at the hour mark, introducing Caitlin Foord, Beth Mead, Stina Blackstenius, and Kyra Cooney-Cross. The substitutions paid off almost immediately. In the 63rd minute, Emily Fox’s low cross caused panic in Everton’s defense, leading to an own goal by Maren Mjelde under pressure from Foord.\nArsenal maintained their dominance throughout the second half, with Steph Catley striking the woodwork twice and Courtney Brosnan making crucial saves to keep Everton in contention. However, Russo sealed the victory in the 89th minute. A perfectly weighted through ball from Mead allowed her to round Brosnan and calmly finish for her second goal of the night.\nThe result marked Arsenal’s fourth consecutive league win and moved them level on points with Manchester United in third place, while Arsenal slot into 2nd in the WSL on goal difference. Russo now boasts 15 goals this season and continues to be a pivotal figure for the Gunners. Russo moved two goals behind Khadija Shaw in the battle for this season’s WSL Golden Boot.\nWith their league campaign back on track, Arsenal now turn their attention to the UEFA Women’s Champions League quarter-finals against Real Madrid on March 18. While this season may not yield silverware domestically, Arsenal’s form under Renée Slegers suggests brighter prospects ahead as they aim to re-establish themselves as a dominant force in women’s football.\nShenel Osman @sh3n3l_\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 472,
  "scraped_at": "2026-02-14T12:43:01.958764"
}