{
  "article_id": "6d9106e10f90",
  "url": "https://www.thenorthernecho.co.uk/news/24078515.final-whistle-blows-helen-pioneering-female-referee/",
  "title": "The final whistle blows for Helen , a pioneering female referee",
  "date": "20240130T111500Z",
  "domain": "thenorthernecho.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ANY football fan, of any age, male or female, who ever kicked a ball, watched a match, or read a football book, will have dreamed of playing at Wembley, walking out of the famous Wembley tunnel and then on to that vast Wembley carpet of lush, green grass.\nTalent, plus a sprinkling of good luck, can get you there, but sometimes just a love of the game is enough.\nLocal girl Helen Conley, now coming to the end of a glorious career as a referee, had the Wembley experience when she was chosen to referee the 2021 Vitality Women's FA Cup final between Chelsea and Arsenal.\nHelen recently came along to our Sporting Memories group at Heritage Park in Bishop Auckland and told us of her time as a top whistleblower.\nHelen, who grew up in Ferryhill and now lives in Bishop Auckland, would admit that she wasn't a great footballer but there was a lack of girls’ football teams in her south Durham neighbourhood when she was young.\nHowever, she spotted an opportunity to get involved in the game she loved when she attended a County Cup final at Ferens Park, Durham.\nShe said: \"I went to the game with my dad, and we were stood right behind the assistant referee, who was running up and down the line. ‘I could do that,’ I announced to my dad. 'Well actually…you can, if you want?\" he declared.\n\"So being someone who had grown increasingly frustrated at referee performances that I'd seen on Match of the Day, who also believed that if you want a job doing well, you should do it yourself, I agreed to take a referee’s course with Durham FA.\nHelen Conley, first woman ref in the Over 40s league, pictured at Trimdon Community College refereeing the match between Trimdon and Darsley Park in 2010\n\"In the early part of my career, I refereed girls’ football matches and ended up going regularly to a village club near where I lived. It was Sunday morning stuff where I might referee the Under 11s one week, the Under 13s the next.\n“I remember distinctly after one game that the club were not happy with my performance, and when the secretary came over to pay me at the end, she pretty much threw the money at me and told me not to come back again because I was disheartening the kids.\n“They obviously weren't concerned about disheartening me.\"\nShe added: \"There is also a senior non-league club in Northumberland where I am not that popular.\"\nDespite those negative experiences, she said: \"The biggest thing that I have taken from refereeing is friendship. I have met some of the absolute best people through being a referee, people who will be friends for life. The camaraderie and support from fellow referees is second to none.\nAn all female referee team at Coxhoe v Redcar in the Wearside League in 2010. Helen Conley is with her assistants Rebecca Welsh and Lynn Brown\nSince 2013, she has run the North East Women’s Referee Development Group which allows fellow referees from Durham, North Riding and Northumberland to meet up during the season to receive in-service training while also networking with other female match officials in the area.\n\"I have been lucky enough to officiate in eight different countries and experience different cultures and international teams while working with other match officials from across Europe,” said Helen. “Refereeing has helped my confidence and made me better equipped to deal with challenging situations in my everyday life.\n“Furthermore, refereeing is a great way of keeping fit. I regularly train with a group of referees in Durham from Football League to grassroots level. We follow a specific referee training plan and encourage and support each other throughout the season, especially in the lead up to our Fitness Test.”\nBesides the Wembley Cup final in 2021, one other game which has stayed in Helen's memory is a local derby between North Shields and South Shields in November 2016 in the Northern League Division 1.\n\"It was the first time that the two clubs had met for a couple of years and there was history between them as the management teams and some players had switched clubs in the past. The bragging rights were there to be won.\n“Former Sunderland player Julio Arca was the South Shields captain and there were 2,651 spectators.\n“It was a fantastic game, and as match referee, I had a front row seat at one of the biggest derby matches in the North East.\"\nOf her Wembley experience in 2021, Helen said: \"I travelled down to Wembley the day before, but prepared for the match in the same way that I would for any other. The game was very competitive with Chelsea and Arsenal being first and second in the Women’s Super League. It was a really proud moment for me, and it was great to have my dad, brothers and friends in attendance amongst the 40,942 spectators.\"\n- Thanks to Helen for her help this week.\nREAD NEXT: WHO WAS THE FIRST DARLINGTON FC PLAYER EVER TO BE SENT OFF?",
  "word_count": 855,
  "scraped_at": "2026-02-14T12:57:22.583900"
}