{
  "article_id": "6daeb1607816",
  "url": "https://www.westernpeople.ie/your-community/local-notes-kilts-and-bagpipes-bring-burns-night-to-kiltimagh_arid-86108.html",
  "title": "Local Notes : Kilts and bagpipes bring Burns Night to Kiltimagh  - Community",
  "date": "20260204T123000Z",
  "domain": "westernpeople.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kiltimagh residents were treated to an unusual and atmospheric sight on a recent misty evening when the sound of bagpipes echoed through the town’s streets. Those who followed the music discovered award-winning piper Anthony Kelly of Castlerea, dressed in full tartan kilt, marking a special Scottish celebration.\nKelly, a recent prize-winner at the National Piping Centre in Glasgow, was in town to perform at a Burns Night organised jointly by Pen and Ink Writers and The Folk Café. The event celebrated the life and work of Scotland’s national poet, Robert Burns, whose songs and poems remain popular worldwide more than two centuries after his death.\nThe Folk Café was decorated in Burns Night and Scottish style, with tartan much in evidence among the crowd. Guests enjoyed many of the traditional elements of a Burns Supper, including haggis, neeps and tatties, with alternative options also available. The haggis was piped in to much applause before Burns’ 'Address to a Haggis' and the Selkirk Grace were recited.\nEntertainment came from those attending, with songs, poems, stories and trivia, many inspired by Burns or by Scotland. The audience selected Graham Mace as winner of the prize for the Most Appropriate Contribution for his poem and song. He was presented with a Folk Café voucher by Anthony Kelly, who then led the room in a rousing rendition of\n.The sell-out event also raised funds for LauraLynn Children’s Hospice, with €455 collected through the supper, raffle and donations.\nThe next joint Pen and Ink Writers and Folk Café event will be a St David’s Day Welsh celebration on March 1st, 2026, starting at 8pm.\nKiltimagh GAA Club has launched its Fundraising Raffle 2026, with a top prize of €1,000, and a wide range of other attractive prizes on offer. The draw will take place on this Saturday, February 7th, at the Kiltimagh GAA Club Gathering in the Oxford Arms, Camden, London.\nAmong the main prizes are two tickets for the 2026 All-Ireland Football Final, two tickets for the 2026 All-Ireland Hurling Final, two corporate tickets for an Arsenal home game, and a two-night bed and breakfast with dinner for two at the Cill Aodain Court Hotel. Also included are a two-night bed and breakfast for two at the Park Hotel, a four-ball at the K Club in Co Kildare sponsored by Garry and Carmel Bigley, a four-ball at Foxhills Golf Club in Surrey sponsored by Bjorn and Alice Bigley, and a four-ball at Enniscrone Golf Club’s Dunes course in Sligo.\nOther prizes include two Connacht quarter-final tickets for London v Mayo in Ruislip, a one-year entry to the Kiltimagh GAA weekly 50/50 draw, and a Mayo County Board Development Draw entry worth €100.\nTickets cost €10 each, with a book of three available for €20.\nClann Machua Drama Group has confirmed that tickets are now on sale for its next production,\n, which will be staged in Kiltimagh Town Hall Theatre on February 12th, 13th and 14th, with performances each night at 8pm. The acclaimed comedy-drama promises plenty of laughs alongside moments of real warmth and emotion, making it an evening of theatre not to be missed. Tickets can be booked online through Eventbrite.Written by celebrated playwright Frank McGuinness, the play is set in Donegal in 1967, a time when Irish society is on the brink of major change. It centres on two couples whose relationships are under strain, a mother determined to keep her family together, and a young girl fighting to protect her future. Hovering over it all is the mysterious presence of Greta Garbo, whose influence quietly shapes the fate of the characters, bringing both upheaval and insight.\nThe full-length production features a cast of seven and has earned praise for its sharp humour, emotional depth and strong storytelling since its original premiere in 2010. The Clann Machua cast includes Maura Murphy, Elaine Reagan, Paul Kelly, Finola Mellett, Rory Quinn and Séamus Corry, with Colette McGinty taking on the title role of Greta Garbo. The production is directed by Rebecca Farrington.\nClann Machua Drama Group is looking forward to welcoming audiences to Kiltimagh Town Hall Theatre for what promises to be a lively, entertaining and memorable run from February 12th to 14th.\nKiltimagh is gearing up for its annual St Patrick’s Day celebrations, with the announcement of this year’s parade theme, ‘Heroes & Legends’. The parade will take place on March 17th, beginning promptly at 2pm, as residents and visitors alike prepare to showcase their pride and creativity.\nThis year’s theme invites participants to celebrate the rich tapestry of Irish mythology, folklore, and the remarkable individuals who have left an indelible mark on history. From legendary heroes and sporting icons to everyday champions and beloved local figures, the parade aims to highlight stories that inspire and unite the community.\nOrganisers encourage schools, clubs, businesses, families, and community groups to start planning their floats and costumes now. This is a fantastic opportunity to craft bold, proud, and legendary displays that will captivate the crowds and bring the streets of Kiltimagh to life.\nFurther details regarding registration and parade arrangements will be announced soon.\nThe line-up for the final of the Winter Poker League in Teach O’Hora was confirmed last week when Pat Boyle and Enda Ruane secured the two remaining seats by winning the league play-off tournament. They now join the twelve automatic qualifiers to compete for a prize pool of over €3,000 in the season-ending Grand Final.\nOn the same night, the regular weekly game was also decided, with Derry O’Sullivan taking first place. Dylan Coleman finished as runner-up, while John Reynolds claimed third and Gerry Groarke took fourth.\nThe next meeting of the Kiltimagh Women’s Group will take place in the library today, Tuesday, February 3rd at 7pm. Siobhan Phillips will give a presentation on EFT Tapping and Acupressure, for aches and pains and stressful situations. The group will also be discussing plans for trips and classes in the year ahead, and all ladies are very welcome to attend.\nA special Mass will be held in Knock Basilica on Sunday, February 22nd, at 12 noon to mark European Day for Victims of Crime and Trauma. The event is being organised by Victim Assistance, the national charity based in Kiltimagh, which supports victims of crime across Ireland.\nRepresentatives from the emergency services, along with victims of crime and their families, are invited to attend the Mass, which will be celebrated as part of a wider programme of events taking place across Europe in the lead-up to European Day for Crime Victims. Refreshments will be served afterwards in St John’s Rest and Care Centre.\nEuropean Day for Crime Victims has grown into a week-long series of events across many countries, with organisations hosting commemorations, discussions and support initiatives aimed at raising awareness of the impact of crime and the importance of victim support services.\nLast year’s special Mass in Knock drew an attendance of approximately 1,000 people, with participants travelling from across the country. The ceremony was organised by the Kiltimagh-based charity and was celebrated by Fr Richard Gibbons, Parish Priest and Rector of Knock Shrine.\nOrganisers say this year’s Mass will once again provide an opportunity for reflection, remembrance and solidarity with victims of crime, while also recognising the vital work carried out by frontline and voluntary services throughout the country.\nTwo young Kiltimagh students are celebrating major sporting achievements this week, bringing pride to both their school and local clubs.\nSt Louis Community School has congratulated Lily Slattery, who was crowned National Champion 2025 at the National Pony Awards in Mullingar at the weekend. Lily’s success as a young jockey has been warmly welcomed by staff and students, who described her as a talented and dedicated athlete and said they are extremely proud of her latest achievement.\nMeanwhile, Kiltimagh GAA Club has also been marking an important milestone for one of its young players, with Sadhbh Mooney being named on the Mayo LGFA Minor Panel for 2026. The club extended its congratulations to Sadhbh and wishes her every success as she prepares for the season ahead at inter-county level.\nBoth achievements have been hailed locally as outstanding examples of the talent and commitment being shown by young sportspeople in the Kiltimagh area.\nThere was another well supported and competitive evening at the weekly 25 Card Drive, with several close games and plenty of familiar faces among the prize winners.\nFirst place on the night went to Aidan McDonagh and Denis Regan, who finished strongly to claim top honours. Joint second place was shared between John Clancy and Paddy Carney, and the pairing of Ciaran McDonnell and Jack Ryan after an evenly matched contest.\nThe Last Ten prize was won by Mary and Liam Moran, while the spot prize went to Mary and John Ward. Raffle winners on the night were Tom Begley, Mary Ward, Joe Corry and Ciaran McDonnell.\nBrendan Feerick was the winner of Kiltimagh GAA’s 50/50 draw last week, taking home €605. The club congratulated Brendan on his success and expressed its thanks to everyone who continues to support the weekly draw.\nProceeds from ticket sales help fund team development and ongoing improvements at Gilmartin Park. Tickets remain available online, in local shops and pubs, and from club sellers throughout Kiltimagh.\nMary O’Brien from Bohola was the winner of Kiltimagh Knock United’s 50/50 draw last week, receiving €253. Laura Teatum from Ennis was the winner the previous week. Laura took home €310.\nThe club congratulated Mary and Laura on their wins and expressed its thanks to everyone who continues to support the weekly draw. Proceeds from ticket sales help fund youth teams and maintain club facilities. Tickets remain available online and from local shops, pubs and club sellers in the area.\nThe death has occurred of P. (James Patrick) Roughneen of Treenkeel, Kiltimagh. P. died peacefully on January 27th, 2026, surrounded by his loving family.\nP. was predeceased by his parents Jim and Maggie, and his brothers John and Joseph. He will be sadly missed by his loving wife Eileen, sons James, Jonathan and Peter, daughters Dawn-Marie, Claire-Ann and Renae, grandchildren Ewan, Caitlin, Cameron, Carter, Cayden, Isaac, Laurence, Eoin, Zoe, Fiadh, Meadbh and Ryan, great-grandchild Rian, sister Mary, brother-in-law Frank, sister-in-law Marie, his daughters and sons-in-law, extended family, relatives, neighbours and friends.\nHis remains reposed at O’Hora’s Funeral Home, Main Street, Kiltimagh on Thursday evening last, with removal on Friday morning to the Church of the Holy Family, Kiltimagh. Funeral Mass was held at 12 noon, followed by burial in Kilkinure Cemetery.\nMay he rest in peace.",
  "word_count": 1758,
  "scraped_at": "2026-02-14T12:51:08.035228"
}