{
  "article_id": "6db42a9bc0dc",
  "url": "https://www.aljazeera.com/news/2024/3/22/in-steak-mad-argentina-womens-work-is-increasingly-butchering-the-meat",
  "title": "In steak - mad Argentina , women work is increasingly butchering the meat . | News",
  "date": "20240322T193000Z",
  "domain": "aljazeera.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In steak-mad Argentina, women’s work is increasingly butchering the meat.\nThe meat industry is a source of national pride. It has also been a space historically inhospitable to women.\nCordoba, Argentina – It takes only a brisk walk through Mercado Norte, a nearly century-old food market hall in this city, to discern that in this most carnivorous of countries, meat is the domain of men. Behind the glass counters of the carnicerias, or butcher shops, that make up most of the market’s food stalls, male butchers hold court, knives in hand, while women, if there are any to be seen, are relegated to the cash register.\nThe gorily stained apron that hangs from her neck identifies Maru Diaz as the exception to the rule.\nOn a recent Tuesday, Diaz worked alongside two other butchers, both men, to sculpt from goat carcasses recognizable retail cuts: racks of ribs, tenderloins and bone-in legs, whose meat has become a popular filling for empanadas. This is not a task for the faint-hearted. It begins by hoisting the 23kg (50-pound) animal on a hook, chopping off its head and hacking a knife along its backbone to cut the carcass in half.\n“I work in a man’s world,” Diaz said matter-of-factly with goat heads piled up around her feet in what almost appears to be a religious ritual. Some men, after seeing her wield a knife or cleaver, have expressed their surprise in condescending comments that rankle her: “Be careful. You’ll hurt yourself,” or warnings to beware the “armed woman”.\n“I like what I do,” said the 36-year-old, her black hair tied up in a bun. “But you have to really want it.”\nAnd it seems more and more women are wanting it.\nThe butcher’s shop, like ‘Disneyland’\nWomen like Diaz are increasingly making their mark in the industry, raising their profile while working behind meat counters, and a few are even opening carnicerias of their own. At the same time, new training opportunities aim to further democratize the workplace and spread butchering know-how, creating more on-ramps for women and other outsiders.\nIt’s a shift that carries outsized symbolic weight in meat-loving Argentina, where the asado, or barbecue, is king, where carnicerias dot nearly every city block and where locals are defying a crippling economic crisis and triple-digit inflation to retain their title as the world’s biggest steak consumers per capita. More even than the tango or Malbec wine or Borges or the legend of Maradona – well, maybe not Maradona – steak is the centrepiece of Argentinians’ identity.\nMacarena Zarza, 29, understands this all too well. She got her first job at a butcher shop as a teenager, a product of chance and necessity. She had dreamed of a career in law enforcement but dropped out of high school to help support her family after her father died of cancer. She responded to an ad for a cleaner at her neighborhood carniceria in the sprawling Buenos Aires metro area.\nMonths passed, then years. When a co-worker who was responsible for making milanesas, or breaded cutlets, was out sick, she filled in for him. Later, the bosses tasked her with grinding beef, pressing hamburgers and deboning some cuts of meat. Before long, she was spending her lunch breaks and evening hours shadowing other butchers and learning to carve from her boss.\n“It took me two years to get to the counter,” Zarza said.\nThe more Zarza learned, the more her passion grew. She now speaks of the need to “respect” carcasses when butchering and compares her passion for the trade to most Argentinians’ fervor for the national football team. She opened her own carniceria, where she singlehandedly butchers 15 head of cattle per week, and travelled to France to refine her skills with master artisans. More satisfyingly, she won over customers who initially told her a butcher shop was no place for women or that they’d rather wait for a male butcher to clock in before they put in their order. Nowadays, Zarza manages a meat processing plant that supplies area carnicerias.\n“I never got a degree or a diploma,” she said. “But I show people what I can do with my knives.”\nVictoria Vago’s path to becoming a butcher hinged on a career turnaround. A political science graduate, she said she always felt “like at Disneyland” whenever she found herself surrounded by meat at a butcher shop. In 2018, she quit her office job in the Buenos Aires city government to apprentice at a local carniceria.\nShe never looked back.\nGood technique better than sheer strength\nVago and Zarza said people who can’t countenance female butchers tend to see muscle and brawn as job prerequisites. But that’s a misconception, and a tired one at that. With training and a solid grasp on carving techniques, women can run a carniceria just as well as any male counterpart. In fact, an overreliance on physical strength during the butchering process could be a sign that something is awry, they said. In Vago and Zarza’s telling, butchering at its best is a kind of art form with butcher knives closer in spirit to a sculptor’s chisel than a miner’s pickaxe.\n“Strength is just one part of it. If you’re working in a place that’s properly equipped, if you have good knife technique and you know where to cut, you’ll be fine,” said Vago, who at 157cm (5ft 2 inches) weighs less than half a typical side of beef.\n“Technique is what makes this not … just a man’s job any more,” Zarza added.\nWhile there’s no official data tracking the gender gap in Argentina’s meat industry, women last year reached their highest level of overall workforce participation in the country’s history, according to government reports.\nConversations about the Argentinian meat industry tend to spotlight the word “herencia”, or inheritance. That’s because, for all the national fervor around meat and despite the ubiquity of carnicerias across the country, becoming a butcher is still a haphazard process with no formal pipeline or vocational training programmes for aspiring butchering talent.\nThat informality tends to reinforce the male structure of the industry. Male butchers tap their sons, nephews or friends to work at – and one day take over – their businesses, and they also inherit their appreciation for the vocation.\n“Butchering knowledge is based around family,” Zarza said.\nLuis Barcos is trying to change that.\nTraining Argentina’s next generation of butchers\nA veterinarian by training, Barcos is known for introducing the wagyu breed of beef cattle to Argentina in the late 1990s. He has presided over the national food safety agency and currently serves as the sole Argentinian member of the French Academy of Meat. His most recent venture is the Buenos Aires-based Institute of Meat Sciences and Trades, which will later this year debut a butchering course, a mix of classroom education and hands-on workshops.\n“A school to train butchers never existed in Argentina,” Barcos said. “Passing on the trade from a father to his son or from a boss to his employee is a type of knowledge transfer that is very valid, and it has created a big labour force, but I thought we could make something more standardised, more professionalised.”\nA shift towards standardisation “would without a doubt really boost the participation of women in the industry” he said.\nThe Institute of Meat Sciences and Trades boasts support from heavy hitters like the University of Buenos Aires, multiple federal agencies, a leading meat industry publication and the French embassy in Argentina. (Barcos’s dream is for Argentinian butchers to command the same reverence and respect in Argentina as French food artisans do in their country.) But other, more homespun training initiatives are also taking off.\nIn the sparsely populated province of La Rioja, located in the mountainous Argentinian northeast, Soledad Andreoli co-owns a slaughterhouse and a local chain of carnicerias. This month, she launched a free “school for women butchers” by turning part of the slaughterhouse floor into a training facility.\nAndreoli’s ambition is to give local working-class women better job prospects because most struggle to find opportunities outside domestic work, a field in which slightly more than 97 percent of workers are female. She also hopes to help accelerate change inside a “machista” industry that she says has systematically excluded women.\n“Cultural changes, cultural revolutions don’t take place all of a sudden. They’re gradual. … To break down barriers, you need to find that starting point, contribute your grain of sand.”\nWomen working in carnicerias is “a change that is … here to stay”, she said.\n“We are in another era now.”",
  "word_count": 1433,
  "scraped_at": "2026-02-14T13:10:58.736138"
}