{
  "article_id": "6dc9171af85c",
  "url": "https://www.westmeathexaminer.ie/2023/09/18/daniel-levy-to-face-questions-from-supporters-at-tottenham-fans-forum/",
  "title": "Daniel Levy to face questions from supporters at Tottenham Fans Forum",
  "date": "20230918T133000Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Daniel Levy to face questions from supporters at Tottenham Fans Forum\nBy George Sessions, PA\nTottenham chairman Daniel Levy will face questions from supporters at a Fans Forum at the club’s stadium on Tuesday night.\nIt will be a rare public appearance from Levy with this set to be the first Fans Forum hosted by Spurs since Mauricio Pochettino’s tenure with Jose Mourinho, Nuno Espirito Santo, Antonio Conte and now Ange Postecoglou all sitting in the managerial hotseat since.\nPostecoglou will be alongside Levy as part of a panel that includes new captain Son Heung-min, women’s head coach Robert Vilahamn and newly appointed women’s captain Bethany England, who helped the Lionesses reach the World Cup final last month.\nWhile Levy took part in a Q&A session at The Cambridge Union Society earlier this year, this will be an opportunity for Tottenham supporters to quiz the club’s long-serving chairman following a tumultuous 12-month period.\nSpurs have enjoyed an excellent start to life under new boss Postecoglou this season, but Levy was forced to part company with Conte in March while several fan protests occurred during the latter stages of the 2022-23 campaign with repeated chants at matches for the chairman to leave.\nA demonstration over increased match day ticket prices occurred before last month’s win at home to Manchester United and Tottenham remain without a director of football following Fabio Paratici’s resignation in April after he was given a worldwide ban for allegations of false accounting at Juventus.\nLevy also sanctioned the sale of record goal-scorer Harry Kane in August, but he did attend a Fan Advisory Board meeting with members from Tottenham Hotspur Supporters’ Trust, Spurs REACH and Proud Lilywhites earlier this month at Lilywhite House.\nIt was revealed during the two-hour long meeting on September 5 that Spurs were set to replace Paratici with the appointment of a technical director while Scott Munn, the club’s chief football officer, will start later in September.\nLevy was asked during the meeting by THST representative Steve Cavalier what does success look like for the club and how is it measured?\n“This changes over time, but the most important thing for the club is to be a highly competitive team that wins and, importantly, entertains fans,” Levy replied according to minutes of the meeting.\nLevy later expanded: “The strategy to date has been to invest in the playing squads, build a new training centre and increased stadium capacity.\n“The focus now is to optimize those investments – both tangible and intangible – and drive revenues that enable the club to reinvest in players and create a winning club.”\nMeanwhile, Levy provided an insight into potential plans for the women’s team this season with scope to host more matches at Tottenham Hotspur Stadium due to the men’s side only having Premier League commitments between now and January.\n“With no European fixtures this season, more women’s first team fixtures could be held at Tottenham Hotspur Stadium,” Levy told the FAB meeting.\nOn the women’s team, Levy stated “it is a long-term project” and “while it currently loses a lot of money is a way of engaging a new fanbase” with an initial goal to challenge for the top-six in the Women’s Super League.\nAhead of Tuesday’s Fans Forum, which will be a 90-minute Q&A session in front of 250 Tottenham supporters selected by a ballot, it was revealed by Spurs director Donna Marie-Cullen that a “full ticketing review” was in hand.",
  "word_count": 576,
  "scraped_at": "2026-02-14T12:39:50.274575"
}