{
  "article_id": "6dcb372c258f",
  "url": "https://www.sbs.com.au/news/podcast-episode/morning-news-bulletin-13-november-2023/rkgnsf873",
  "title": "Morning News Bulletin 13 November 2023",
  "date": "20231112T210000Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\nTRANSCRIPT\n- Gaza hospitals face an increasingly critical situation\n- Foreign Minister Penny Wong says Australia's support for the Philippines will not interfere with its relations with China\n- Sam Kerr ends a quiet spell at Chelsea with a goal against Everton in the Women's Super League.\n**\nThe Palestinian Red Crescent Society has declared the al-Quds hospital in Gaza \"is no longer functioning\".\nThe document states \"the interruption of services is due to the depletion of available fuel and the lack of power\".\nAt the Al-Shifa hospital, where Israel believes Hamas’ main headquarters are located, the World Health Organization says they have lost communication with their contacts in the hospital.\nThe facility is under fire and appears to be surrounded by Israeli forces.\nMore than 1.6 million people have been displaced in Gaza, and the Hamas-controlled Health Ministry claims more than 11,000 have been killed.\nIn Israel, 1,200 people lost their lives in the Hamas attack on October the 7th, and 239 people are still being held hostage in the Gaza Strip.\n**\nThe Zionist Federation of Australia and the Executive Council of Australian Jewry have responded to Foreign Minister Penny Wong's statements on the need for \"steps towards\" a ceasefire between Israel and Hamas.\nIn a joint statement, they say they are \"highly concerned\" by Foreign Minister Penny Wong's comments, and that unless and until Hamas is removed from power, a ceasefire will inevitably put Israel in danger.\nAmong the measures proposed by Minister Wong are greater Israeli restrictions on medical facilities and for Hamas to release Israeli hostages.\nDoctors Without Borders says hostilities around al-Shifa hospital in Gaza, where Israel believes Hamas’s main headquarters are located, have not ceased and urgently calls for an end to attacks on hospitals.\nThe Coalition's defence spokesman, Andrew Hastie, says Israel is doing everything possible to avoid civilian casualties.\n\"They've had people from across the globe calling on them for restraint and they've sent millions of warnings to people living in Gaza to evacuate, reminding them that there might be an attack imminent, they've given people the opportunity to get out of the danger zone.\"\nAustralia has recently abstained from a non-binding UN resolution calling for an immediate humanitarian truce, saying it did not mention Hamas as the perpetrator of the October 7 attack on Israel.\n**\nForeign Minister Penny Wong says Australia's support for the Philippines in the South China Sea, and new security deals with Pacific nations, will not stop the government pursuing its \"strategic partnership\" with China.\nMs Wong says Australians live in an increasingly contested region, and the government aims to create balance, where international law is followed and each country's sovereignty is protected.\nHer comments come after Australia struck a deal with the Pacific nation Tuvalu, which will allow 280 of their residents to resettle in Australia each year in exchange for veto over Tuvalu's security arrangements with other countries, including China.\nMs Wong has told the ABC China and Australia both seek more stability in their relationship - but there is still room for disagreement.\n\"We know that there are areas where we can cooperate and we should - we want to. There are areas where we disagree and we should do so, clearly and consistently and calmly. And we should continue to engage, because China is a consequential country in our region, so it matters for Australia's security - whether it's its economic security, or national security more broadly - for us to engage.\"\n**\nPeople in New South Wales can now be fined up to $100,000 if they religiously vilify someone, after the government amended existing anti-discrimination laws.\nThe changes make it illegal to incite hatred or serious contempt or to severely ridicule a person or group because of their religious belief, affiliation or activity.\nPremier Chris Minns says it was an important election promise to fulfil to ensure a \"peaceful, multicultural society\" with no room for hatred.\n**\nThe father of Liverpool soccer player Luis Diaz has said he has no plans to leave Colombia, after enduring nearly two weeks in the hands of leftist guerillas who kidnapped him.\nThe National Liberation Army [[E-L-N]] released Mr Diaz on Thursday [[9 Nov]] after he was taken hostage 12 days earlier in his hometown of Barrancas in the country's north.\nHis capture stoked criticism of ongoing peace talks between the guerillas and the government, which is trying to put an end to Colombia's six-decade internal conflict, that has left more than 450,000 people dead.\nMr Diaz says even his captors could not explain why he was abducted.\n\"Everyone knows me as a fighter, a hard worker, a person of effort, sacrifice, faith, hope, and a beautiful future. There is no reason for my abduction. I don't know the reason for my abduction because there is no reason for it.\"\n**\nIn football, Sam Kerr has ended a quiet spell for Chelsea with a second goal of the Women's Super League season in their win at Everton.\nWith injury concerns and a trip back home for Olympic qualifiers having made it a largely unproductive start to the English campaign for the two-time Golden Boot winner, Kerr struck on Sunday to help the champions to a 3-0 stroll.\nIt proved a good day for Emma Hayes' side as they strengthened their position at the top of the league, with Manchester City losing 1-0 at home to Brighton.\nKerr has not been at her brilliant best yet for Chelsea this season, with her only goal for them in her first three matches having come against West Ham and she was rested last weekend after a trip back to Australia for the Matildas' Olympic qualifiers.",
  "word_count": 961,
  "scraped_at": "2026-02-14T12:40:40.725963"
}