{
  "article_id": "6dd14b5652f3",
  "url": "https://www.abc.net.au/news/2024-04-29/a-league-women-semi-final-round-up-melbourne-city-sydney-fc/103779146",
  "title": "A - League Women Semifinal Round - Up : Melbourne City flex their muscles as Mackenzie Hawkesby rescues Sydney FC",
  "date": "20240429T053000Z",
  "domain": "abc.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "analysis\nA-League Women Semifinal Round-Up: Melbourne City flex their muscles as Mackenzie Hawkesby rescues Sydney FC\nThe second and final stage of the A-League Women's inaugural two-legged semi-final is now done and dusted.\nRegular-season Premiers Melbourne City cruised past a feisty Newcastle Jets side to return to the grand final for the first time since 2020, while perennial finalists Sydney FC had to squeak past a motivated Central Coast Mariners to keep their Championship defence alive.\nHere are the four main talking-points from across the two games.\n1. Are Melbourne City favourites to do the double once again?\nWhen Melbourne City won the Premiership-Championship double in 2020, it signalled that a new dynasty had been formed in the A-League Women.\nBursting at the seams with international players, including several Matildas such as Ellie Carpenter, Steph Catley, Aivi Luik, Emily Van Egmond and Lydia Williams, the club had staked its claim as the most successful team in the history of the competition, winning six trophies in their first six seasons.\nBut then, something shifted. The bulk of the squad who had taken City to such great heights left the league en masse, attracted by the full-time football offered overseas, leaving the club with the task of effectively rebuilding their entire team from scratch.\nThe following season was their worst in history, missing finals entirely after finishing 7th as they tried to fill the void that their double-winning team had left behind. The next season, in 2021-22, was better: finishing second behind Sydney FC, only to get bundled out in the preliminary final to cross-town rivals Melbourne Victory.\nBut they stayed committed to the rebuild, identifying a few key players around which they could develop a title-contending team once again.\nThis season, that longer-term plan is paying dividends: players such as Daniela Galic, Rhianna Pollicina, Kaitlyn Torpey, Holly McNamara, Leticia McKenna, Naomi Thomas-Chinnama, Bryleeh Henry, Leah Davidson, Karly Roestbakken, Julia Grosso and Hannah Wilkinson were all carried over from the previous season, and each has played a crucial role in getting City to their first grand final since that star-studded 2020 side.\nThe benefit of multi-year contracts has been clear to see with the way this City team have played from the very start of the season: the chemistry and understanding between players, and the familiarity with head coach Dario Vidosic's system and style.\nThe ease with which they were able to solve problems that their opponents threw at them was a testament to the investment that the club have put into the women's program over the past three seasons.\nThis Saturday will be their biggest test yet, and the opportunity to recapture the glories created by the last generation of City stars.\nIt won't be easy, though: they face a Sydney FC team that appear to be the underdogs in this contest, but who should never be counted out when it matters most.\nAs the current reigning Champions, having secured the title double last season, the Sky Blues know what it takes to go all the way to the end of this league, and having watched the Premiership slip through their fingers on the final day, will not want to see it happen to the Championship trophy that they've fought so hard to try and defend.\nTwo different kinds of dynasties are on a collision course in the 2023-24 grand final. Saturday will determine which one rises and which one falls.\n2. Mackenzie Hawkesby rescues Sydney from themselves\nNobody could blame Mackenzie Hawkesby for wanting to broaden her horizons by pursuing club football overseas last year. The midfielder had just come off her best ever season with Sydney FC, which resulted in her first senior Matildas call-up, and knew she had other ceilings to crash through.\nSo she signed for Brighton & Hove Albion in England's Women's Super League, alongside team-mate Charlize Rule. But what started as an exciting opportunity ended in a lot more time on the bench than she expected, and a feeling that maybe this wasn't the right moment after all.\nSo Hawkesby, who was discovered by Sydney boss Ante Juric playing in the NSW state league just a few years ago, returned to the Sky Blues in late December — right when the team needed her.\nHaving also lost Sarah Hunter and Rachel Lowe from the midfield, as well as Madison Haley and Remy Siemsen up front, the Sky Blues were struggling in the middle of the park. They needed someone to be able to stitch all the areas of the field together: to progress the ball, to connect players, and to provide leadership after an ACL injury took captain Nat Tobin out of the side.\nThis is where Hawkesby stepped in, and stepped up. As a box-to-box midfielder, as well as a creative weapon from set pieces, the 23-year-old immediately helped turn Sydney's momentum around.\nCoinciding with the reinvigoration of Cortnee Vine, the Sky Blues went from two losses and two draws in the first nine games to just one loss and four draws in the next 13, taking them back to the top of the ladder until the season's final two rounds, where they were pipped at the post by Melbourne City on the last day.\nNot only would Sydney not be in the top four without Hawkesby, but they wouldn't be in the grand final without her, either, having scored both of the Sky Blues' goals in their 2-1 aggregate win over the Central Coast Mariners.\n\"The heartbeat, the engine-room, the ultimate competitor,\" Channel Ten commentator Grace Gill said of Hawkesby after she opened the scoring this past weekend, \"and surely her most important yet.\"\nShe now faces the ultimate challenge in a City side that Sydney have not beaten all season, but if this campaign has been anything to go by, one thing is for certain: the Sky Blues won't be able to win their fifth Championship without her.\n3. Why Mariners coach Emily Husband deserves Coach of the Year\nIt's one thing to embark on your first ever A-League Women season as a head coach and make the semi-finals.\nIt's another thing to do it with a brand new team, filled with peripheral players — most of whom have been cast off from other clubs — with one of the slimmest budgets and resource pools in the league.\nAnd it's quite another to have got them playing a style of football that pushed heavyweights and reigning champions Sydney FC all the way to the edge, losing a two-legged tie by just a single scrappy goal, but which could have easily gone their way multiple times over the 180 minutes.\nCentral Coast Mariners head coach Emily Husband has been a revelation this season, recruited from a successful Sydney University SC program in the NSW National Premier Leagues to make the jump up to the professional tier of the domestic game.\nNot all head coaches who make this jump have done it successfully: Perth Glory's Alex Epakis, Husband's predecessor at Sydney Uni, has yet to make waves in the A-League Women. Heather Garriock struggled with Canberra United, Garrath McPherson couldn't return Brisbane Roar to its former glories, while the Western Sydney Wanderers have cycled through several coaches without much to show for it.\nBut sometimes, like when Mark Torcaso took Western United to the grand final in his first season, it works. Emily Husband is the latest example of the coaching talent that has been developed in Australia, and a testament to what an expanded A-League Women can do in giving opportunities to NPL coaches to develop themselves and their players.\nHusband's familiarity with the local game in NSW, by virtue of her stints with Sydney Uni as well as Canberra United during the 2020/21 season, allowed her to identify several players who have ended up forming a key part of her side, such as defenders Ashley Irwin and Annabel Martin, centre-backs Taren King and Natasha Prior, midfielders Isabel Gomez and Bianca Galic, and wingers Rola Badawiya and Peta Trimis.\nAdditionally, some key international recruits such as American central defender Jazmin Wardlow, Chinese striker Wurigumula, and English full-back Faye Bryson have complemented this exciting local-driven side, whose return to the league after dissolving in 2010 has coincided with renewed investment in the wider club, the success of their senior men's program, and a re-engaged local community on the Central Coast of NSW.\nThe Mariners won't win a trophy this A-League Women season, but that does not mean it hasn't been a success. And Emily Husband deserves a whole lot of credit for that.\n4. A brighter future for Newcastle Jets\nThey may have lost their first ever semi-final 6-0 on aggregate to the Melbourne City machine, but the Newcastle Jets were no push-overs across these two games.\nThe 3-0 score-line after the first leg flattered to deceive, with the Jets actually registering more total shots than City did, as well as twice as many corners and a fairly even amount of possession and passes.\nBut it was their clinical finishing that let them down, with just two shots on target across the whole 90 minutes, compared with City's 6.\nSunday afternoon's second leg began in much the same way, with the Jets storming out of the gates from the opening whistle, immediately putting City under pressure, suffocating their midfield and shutting down their counter-attacks before pouncing the other way.\nThe Jets registered 10 shots to two in the first 20 minutes, including a volley from Lauren Allen that hit the crossbar and two point-blank strikes from Sarina Bolden that required some desperate (and, in some cases, lucky) saves from Brazilian goalkeeper Barbara.\nBut sometimes the football gods have other plans, and after that 25-minute flourish to open the game, it was City who would find the back of the net first after a slicing through-ball from Daniela Galic found an open Rhianna Pollicina, who rocketed the ball into the top corner to make it 4-0 on aggregate.\nAnd while two more goals in the second half to Hannah Wilkinson and Leticia McKenna ended the Jets' grand final hopes, it does not take the shine off their most successful season ever, and in some of the most difficult off-field circumstances facing any club in the league.\nA break-out season for star striker Sarina Bolden, the rejuvenation of veteran players like Natasha Prior and MelindaJ Barbieri, the discovery of two bright goalkeepers in Isabella Nino and Tiahna Robertson, the steady perseverance of Cass Davis and Libby Copus-Brown, and the emergence of a handful of young stars like Lara Gooch, Emma Dundas, Sophie Hoban, and Milan Hammond have shown that the club is capable of great things, so long as the right people are in the right place at the right time.\nWith rumours swirling that Newcastle are on the verge of finally being sold to a private owner, the sky really is the limit for the Jets in future seasons.",
  "word_count": 1824,
  "scraped_at": "2026-02-14T12:41:54.120310"
}