{
  "article_id": "6dd5b4a9ba27",
  "url": "https://www.meathchronicle.ie/2025/01/26/chelsea-splash-the-cash-to-sign-naomi-girma-for-reported-world-record-fee/",
  "title": "Chelsea splash the cash to sign Naomi Girma for reported world - record fee",
  "date": "20250126T164500Z",
  "domain": "meathchronicle.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea splash the cash to sign Naomi Girma for reported world-record fee\nBy Robert O'Connor, PA\nChelsea have confirmed the signing of United States defender Naomi Girma for a reported world-record fee.\nThe 24-year-old was unveiled on the pitch by the Women’s Super League champions ahead of Sunday’s game against Arsenal at Stamford Bridge.\nShe arrives from San Diego Wave for a reported £900,000, eclipsing the current record – paid by Bay FC in February 2024 for Racheal Kundananji – by £215,000.\nAt 1.1million US dollars it makes Girma the first million-dollar transfer in the women’s game after the Blues fended off competition from French side Lyon.\nShe told Chelsea’s website: “I’m so happy and really excited to be here. It doesn’t feel real.\n“There are a lot of things about Chelsea that made me want to come here – the culture, the winning mentality, staff and players. It’s a top environment to learn and grow in.”\nGirma becomes Sonia Bompastor’s first signing of the January transfer window and joins after defender Kadeisha Buchanan was ruled out, likely for the rest of the season, with an anterior cruciate ligament injury.\nThe fee is almost treble the previous British record set when Chelsea signed striker Mayra Ramirez from Levante for £384,000 a year ago.\nChelsea head of women’s football Paul Green said: “Naomi is a world-class defender who is now coming into the prime years of her career.\n“Naomi has showcased her talent in the NWSL winning various individual awards and delivered on the international stage for the USA, including this summer winning a gold medal at the Olympics.\n“She is undoubtedly ready for this next step in her career and we are delighted it will be with Chelsea.”\nFirst coming to international attention during the 2023 World Cup, at which the US exited in the last 16, Girma played every minute of her country’s victorious Olympic campaign in Paris having been named US Soccer’s female player of the year.",
  "word_count": 329,
  "scraped_at": "2026-02-14T13:20:02.500209"
}