{
  "article_id": "6de9862ca692",
  "url": "https://www.poynter.org/commentary/2023/fox-news-might-win-dominion-lawsuit-bad-press/",
  "title": "Why Fox News might prevail in court but lose in the court of public opinion",
  "date": "20230301T140000Z",
  "domain": "poynter.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The media world is still buzzing following Monday’s explosive news.\nMedia mogul Rupert Murdoch, the ultimate big boss over Fox News, said in a sworn deposition that he knew some on-air Fox News personalities were endorsing false claims about the 2020 presidential election, that he could have stopped them, and that he didn’t. In fact, Murdoch admitted the network should have done more to stop the spread of the lies being spewed by Donald Trump and his advisers.\n“I would have liked us to be stronger in denouncing it in hindsight,” Murdoch said in a deposition taken last month and made public on Monday. Murdoch’s remarks came as a part of Dominion Voting Systems’ $1.6 billion lawsuit against Fox News.\nAre Murdoch’s comments — as well as other messages and texts from Fox News executives and on-air personalities made public last week — enough to doom Fox in this suit? The Washington Post’s Erik Wemple writes, “Rupert Murdoch isn’t sinking the Fox News legal case. Here’s why.”\nWemple writes, “U.S. defamation law requires a lot more than an embarrassing post hoc admission by a network mogul.”\nAppearing on CNN on Monday night, First Amendment lawyer Lee Levine said the latest revelations are “helpful” to Dominion, but not a “smoking gun.”\nLevine told host Anderson Cooper, “I have not seen, in the deposition excerpts at least, evidence that Murdoch believed that the specific statements in the specific broadcasts that are being sued about were endorsed by the hosts. He’s speaking more generally about whether the hosts were endorsing the idea of a stolen or a fraudulent election, and that’s certainly helpful to Dominion, but it doesn’t get them all the way to the finish line.”\nMurdoch’s claim, as well as Fox News’ claim all along, has been that the network was merely covering the allegations made by the former president and his advisers.\nUltimately, Fox News might prevail in court, but in the court of public opinion, this lawsuit has raised accusations from some that Fox News isn’t really a news organization at all.\nIn a Q&A with readers, Washington Post columnist Eugene Robinson was asked what he thought about Fox News and its battle with Dominion.\nRobinson didn’t hold back, saying, “The latest filing in the Dominion suit against Fox is absolutely incredible. I’ve been a journalist all my life and I normally side with the media in defamation or libel suits, but I think Dominion has come really close to meeting the very high ‘actual malice’ standard needed to win this case. Top executives at Fox clearly knew that all the stolen-election nonsense from Giuliani, Powell and the rest was just that — nonsense — but they kept putting them on the air. If Dominion wins, it seems to me that there could be an award of punitive damages, too. The way Fox operated is not the way news organizations work, period.”\nThat’s a criticism many are leveling at Fox News.\nIn a column over the weekend, New York Times opinion columnist David French wrote, “Fox News became a juggernaut not simply by being Republican or conservative but by offering its audience something it craved even more deeply: representation. And journalism centered on representation ultimately isn’t journalism at all.”\nHe added, “But there is a difference between coming from a community and speaking for a community. In journalism, the former can be valuable, but the latter can be corrupt. It can result in audience capture (writing to please your audience, not challenge it) and in fear and timidity in reporting facts that contradict popular narratives. And in extreme instances — such as what we witnessed from Fox News after the 2020 presidential election — it can result in almost cartoonish villainy.”\nCNN media reporter Oliver Darcy was highly critical of Fox News during an appearance on CNN with Cooper on Monday. Now, it should be pointed out that Darcy works at CNN, a direct rival of Fox News. But his reaction is not unique among many of those who observe and write about the media.\nDarcy told Cooper, “I think this really actually exposes that Fox is not, at its core, a news network. News networks deliver the truth as they know it to viewers.”\nIn a lengthy Twitter thread, New York University journalism professor and media observer Jay Rosen wrote, “Fox is not a news organization. It’s something else.”\nHe went on to write, “When I use the term ‘Fox,’ I mean the commercial arm of a political movement that has taken control of the Republican Party. The product is resentment news. Current ways to resent. Success in that market makes for political power. That’s the Fox I know. A kind of machine.”\nDuring an appearance with Stephanie Ruhle on MSNBC, Rosen talked about how calling the state of Arizona for Joe Biden in 2020 caused a major backlash among many Fox News viewers and others. Rosen said, “If responsible journalism by a handful of Fox people resulted in a company crisis, that means the company is not a news company — because giving truthful news actually was a big problem.”\nAppearing on Ruhle’s show Monday night, The New York Times’ Peter Baker said, “To have this represent what journalism is about is dangerous as well. It’s not journalism to propagate things that you know are not true.”\nThere’s plenty of criticism of Fox News, particularly in light of the latest revelations coming out of the Dominion lawsuit, but here’s a question that cuts to the heart of the matter:\nDo Fox News viewers even care?\nTrump bashes Murdoch\nFormer President Donald Trump lashed out at Murdoch on social media Tuesday — a day after Murdoch’s deposition became public.\nOn Truth Social, Trump wrote, “Why is Rupert Murdoch throwing his anchors under the table, which also happens to be killing his case and infuriating his viewers, who will again be leaving in droves — they already are.”\nTrump then went on to repeat his lies about a stolen 2020 election.\nOh, one more thing: Did Trump mean to say “under the table?” Shouldn’t he have said “under the bus?”\nMcCarthy pressed on handing over Jan. 6 tapes to Carlson\nFox News’ Tucker Carlson has downplayed what happened on Jan. 6, 2021, at the U.S. Capitol. Yet House Speaker Kevin McCarthy thought Carlson was the best person to get the first look at more than 40,000 hours of video footage from that day. McCarthy has given Carlson exclusive access to the video.\nOn Tuesday, CNN’s Manu Raju asked McCarthy if he was concerned about giving all the tapes to someone who has consistently downplayed that day.\nAfter calling Jan. 6 a “very serious attack,” McCarthy said, “Because I think sunshine matters. I don’t care what side of the issue you are on. That’s why I think putting it all out to the American public, you can see the truth, you can see exactly what transpired that day and everyone can see the exact same (footage).”\nIf McCarthy actually feels that way, why not hand the video over to all major media outlets, including the major networks and other cable news outlets? McCarthy seemed to indicate that he would eventually allow the general public to have access to it, but he didn’t specify when.\nThe Hill’s Emily Brooks and Mike Lillis wrote that McCarthy and other Republicans made it clear that “no information would be released to Carlson’s team — let alone broadcast publicly — before the footage is screened to ensure it doesn’t compromise the security of the Capitol complex.”\nAxios scoop on the Washington Post\nAxios’ Sara Fischer reported Tuesday that Jonathan Capehart has quit the Washington Post editorial board in a dispute over an editorial about 2024 politics. Fischer went on to write that his departure leaves the Post with an all-white editorial board in a city where nearly half of the population is Black.\nFischer reported that Capehart actually left the board last December following a disagreement over a Dec. 6. editorial about the Georgia runoff for Senate between Sen. Raphael Warnock and Herschel Walker. However, Capehart, who also hosts a show on MSNBC, remains a Post columnist. He had been on the editorial board since 2007.\nA Post spokesperson told Fischer that the Post’s opinion section “is committed to diverse representation in all its pages” and that the section “plans to further expand the range of voices in the months to come.”\nThe spokesperson added, “Writers like Keith Richburg and Mili Mitra regularly contribute editorials. In recent months, the section also announced the addition of several contributing columnists including Theodore Johnson, Natasha Sarin and Bina Venkataraman, among several others.”\nGuthrie tests positive for COVID-19 … again\nNBC “Today” show co-host Savannah Guthrie started the show on Tuesday. But she didn’t finish it. Feeling under the weather, Guthrie took a COVID-19 test and it came back positive. She immediately left the set and returned home. She was on for only the first half hour of “Today.”\nSheinelle Jones gave an update during the show, telling viewers, “By the way, it has been an interesting morning for us. As we said, Savannah left early, she wasn’t feeling great, so she took a COVID test. It came back positive. So, as soon as we found out, she rushed home to rest up. So Savannah, we love you, wishing you a speedy recovery.”\nNBC News’ Scott Stump reports this is Guthrie’s third time with COVID-19. She also tested positive in January 2022 and again in May 2022. NBC added that Guthrie is vaccinated and has received a booster.\nMeanwhile, the Los Angeles Times’ Christi Carras notes that “Today” show co-anchor Hoda Kotb hasn’t been on the show for more than a week. In addition, Kotb’s weekly podcast, “Making Space,” did not release a new episode on Monday per usual.\nNBC has not responded to requests for comment from various news outlets as to why Kotb has not been on the air.\nWhy journalism matters\nThe New York Times published a heartbreaking story from Hannah Dreier over the weekend. Dreier traveled to Alabama, Florida, Georgia, Michigan, Minnesota, South Dakota and Virginia and spoke to more than 100 migrant child workers for “Alone and Exploited, Migrant Children Work Brutal Jobs Across the U.S.”\nThe story is deep with details of children, essentially alone, working grueling hours in factories of companies that we all know.\nDreier wrote, “These workers are part of a new economy of exploitation: Migrant children, who have been coming into the United States without their parents in record numbers, are ending up in some of the most punishing jobs in the country, a New York Times investigation found. This shadow work force extends across industries in every state, flouting child labor laws that have been in place for nearly a century. Twelve-year-old roofers in Florida and Tennessee. Underage slaughterhouse workers in Delaware, Mississippi and North Carolina. Children sawing planks of wood on overnight shifts in South Dakota.”\nOne story after another is just heart-wrenching.\nNow Dreier has a follow-up: “Biden Administration Plans Crackdown on Migrant Child Labor.” Dreier wrote, “The Biden administration on Monday announced a wide crackdown on the labor exploitation of migrant children around the United States, including more aggressive investigations of companies benefiting from their work. The development came days after The New York Times published an investigation into the explosive growth of migrant child labor throughout the United States. Children, who have been crossing the southern border without their parents in record numbers, are ending up in punishing jobs that flout child labor laws, The Times found.”\nWhite House press secretary Karine Jean-Pierre called the revelations in Dreier’s original story “heartbreaking” and “completely unacceptable.” The White House has announced that it will have new initiatives to investigate child labor violations, among other plans to address this horrible situation.\nA ratings disaster\nThe Saudi-backed professional golf tour called LIV Golf has a slogan: Golf But Louder. But does it make any noise if no one is watching?\nTelevision ratings for the LIV tour were embarrassingly abysmal this past weekend. The tour, just starting its second season, had trouble finding a TV deal and ended up landing one with the CW. Affiliates in several major cities decided to not show LIV Golf on Saturday and Sunday, which helped keep the numbers down.\nStill, the numbers were pathetic. The average viewership on Sunday was a mere 291,000. On Sunday, it was only 286,000. While it is a little like comparing apples to oranges, the PGA Tour on NBC averaged 2.86 million viewers on Sunday.\nAwful Announcing’s Andrew Bucholtz wrote that the LIV television numbers were “below most of the sports that aired anywhere this weekend, including Golf Channel early-day Honda Classic coverage Saturday and Sunday (555,000 and 631,000 viewers respectively), two XFL games, five different women’s college basketball games (and 32 men’s college basketball games), and every soccer match except a Friday Premier League one. So that’s not exactly a great result for them.”\nGolf Digest’s Joel Beall noted that another CW program, “World’s Funniest Animals,” had better ratings than LIV Golf.\nMedia tidbits\n- Greg Borowski has been named as executive editor of the Milwaukee Journal Sentinel. He takes over for George Stanley, who retired at the end of last year. Borowski is a native of Milwaukee and has been at the Journal Sentinel since 1998, starting off as a reporter and then becoming an editor. The Journal Sentinel’s Bill Glauber has more.\n- The Wall Street Journal’s Bojan Pancevski with “Axel Springer to Restructure Its German Business as It Shifts Focus to U.S.”\n- More charges have been filed against shooting suspect Keith Melvin Moses, who is accused of killing three people including a 9-year-old girl and Spectrum News 13 reporter Dylan Lyons. Spectrum News’ Ashleigh Mills has more.\nHot type\n- Sharp reporting from ESPN senior writer Don Van Natta Jr. in “How a disputed $55M loan plays into feds’ probe of Commanders.”\n- An excerpt of her book “Blood Money,” Kathleen McLaughlin in Teen Vogue with “Blood Plasma Sales By College Students Are Being Used to Cover Education Costs.”\n- The Los Angeles Times’ Randee Dawn with “Sometimes singular moments stand out from Oscar-nominated performances. Here are 10.”\nMore resources for journalists\n- Spend “An Evening with NBC News’ Kerry Sanders: Reflections of a Fearless Broadcast Journalist,” March 23.\n- Early-career journalists: Apply for the Poynter/Koch Fellowship for the coaching, networking and skills handy for a lasting career in journalism. Due March 10.\n- Poynter’s Beat Academy (March-Oct.) (Webinar series) — Enroll now.\n- Lead With Influence (July 2023) (Seminar) — Apply by June 2.\nHave feedback or a tip? Email Poynter senior media writer Tom Jones at tjones@poynter.org.\nThe Poynter Report is our daily media newsletter. To have it delivered to your inbox Monday-Friday, sign up here.",
  "word_count": 2475,
  "scraped_at": "2026-02-14T12:13:51.191955"
}