{
  "article_id": "6dfc9c4b3bd6",
  "url": "https://www.thisisoxfordshire.co.uk/news/24018447.christian-horner-recognised-new-year-honours-list/",
  "title": "Christian Horner recognised in New Year Honours list",
  "date": "20231229T233000Z",
  "domain": "thisisoxfordshire.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Oxfordshire’s Christian Horner is among the famous sporting faces whose achievements in 2023 have been marked in the latest New Year Honours list.\nChristian Horner, the team principal and chief executive of Red Bull Racing, received a CBE in a year when his team won Formula One’s Constructors’ Championship and Max Verstappen won the drivers’ title.\nMr Horner owns a Grade II-listed estate near Banbury with his wife, the former spice girl Geri Horner, who was known as Ginger Spice in her popstar days.\nThe honours recognition comes after Mr Horner was previously involved in a planning dispute with Oxfordshire neighbours after putting up a barn on the couple's land without planning permission in 2020.\nThe celebrity couple angered locals by building stables for Ms Horner's 14 horses and then attempting to gain retrospective approval.\nThey also own a home in Hertfordshire and it is not known where Mr Horner will be toasting the announcement of his CBE.\nMr Horner is not the only famous sporting name to be honoured in the latest honours list.\nThe charity work of Kevin Sinfield and Rob Burrow has also been recognised, alongside three of England’s Women’s World Cup football stars.\nMr Sinfield and Mr Burrow, who were Leeds Rhinos team-mates during trophy-laden rugby league careers, received CBEs for services to motor neurone disease awareness.\nMillie Bright, Mary Earps and Lauren Hemp have also been honoured for their part in helping the Lionesses reach the World Cup final in the summer.\nMs Bright, who captained the team in the absence of fellow defender Leah Williamson, received an OBE while goalkeeper Ms Earps and forward Ms Hemp are made MBEs.\nEngland came up just short, losing 1-0 to Spain in the World Cup final in Sydney having won the European Championship in 2022.\nMr Sinfield has raised over £15 million since his friend Mr Burrow was diagnosed with MND, an incurable and life-limiting condition, in December 2019.\nEarlier this month Mr Sinfield, 43, completed the ‘7 in 7 in 7’ challenge by completing seven ultramarathons in seven cities in as many days.\nMr Sinfield said: “I think it is really special that Rob has been recognised again. The bravery and courage that Rob and his amazing family have shown as he is fighting MND is wonderful - to open the front door and to show the world what it’s like to live with it, he’s been incredible.”\nMr Burrow said: “I am particularly pleased that my good friend Kevin Sinfield is also receiving a CBE. I hope Kevin and I can go to the palace together in the new year to enjoy another special occasion together again.”",
  "word_count": 442,
  "scraped_at": "2026-02-14T12:30:40.202744"
}