{
  "article_id": "6e01dda969b8",
  "url": "https://www.texasmonthly.com/interactive/final-flight-captain-forrester/",
  "title": "How a Marine Captain Shot Down Over Vietnam Was Finally Found",
  "date": "20250523T170000Z",
  "domain": "texasmonthly.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Marines were solemn in their dress blues.\nOn this spring day in 1979, at Arlington National Cemetery, a couple dozen of them stood in perfect rows, their rifles resting against their shoulders.\nBehind them, also standing in straight, perfect rows, white marble headstones covered the gently sloping hill. Another six Marines stood over a plot, each gripping the edge of an outstretched American flag, consecrating the spot where a new marker would be planted.\nSeated nearby, looking on, were about a dozen people, including an eight-year-old girl named Karoni (pronounced “Karen-ee”) Forrester, who wore a powder-blue dress and whose feet barely reached the ground. She hated that dress; jeans stained with dirt from a baseball diamond were more her speed. But there had been no use arguing with her mother, who’d had to just about force Karoni into it, along with knee-high white stockings and a pair of Mary Janes.\nTM Out Loud: Behind the Story of a West Texas Pilot Missing in Vietnam\nKaroni may have been a child, but she knew even before leaving her home in Odessa that something wasn’t right. Ever since she could form words, she’d been asking where her father was, and the replies were always the same.\nWe don’t know.\nYour daddy was flying a plane in Vietnam, but something happened, and he didn’t come back. They’re looking for him.\nMaybe he’ll turn up.\nSay a prayer for him.\nKaroni had known only a life in which she was the daughter of a man she didn’t remember meeting, though she had faint memories of hearing his voice over the phone, calling from some place she couldn’t picture. But her father wasn’t dead—or, at least, no one said he was. She talked about him in the present tense, as if he were simply late coming home from work. Is Daddy coming back? She, like the rest of her family, kept a space for him in her heart, like an empty dinner setting in the middle of a crowded table. Then, suddenly, there was a funeral to attend. She was shuffled onto a plane, stuffed into that prissy dress, and guided into a chapel that felt cold and cavernous, with barely two pews’ worth of attendees—among them her uncles and grandparents—who sat silently while a military chaplain waded through a short, cobbled-together eulogy. Captain Ronald Wayne Forrester . . . raised in Odessa, Texas . . . graduate of Texas A&M University . . . lost December 27, 1972 . . . son of Neva and Wayne . . . older brother to Don and Larry . . . loving father to Karoni. After he finished, no one in the family spoke.\nAnd now she sat next to her father’s grave. Except it wasn’t really a grave. There wasn’t a rectangular hole in the earth. There wasn’t even a casket. The flag the Marines were holding was floating over . . . nothing. To a passerby, the entire ceremony might have looked like a dress rehearsal for a funeral.\nThe Marines folded the flag into a tight triangle, and the chaplain took it and held it out to Karoni, who looked down at it with a furrowed brow. On behalf of a grateful nation, please accept this flag as a symbol of our appreciation of your loved one’s honorable and faithful service . . .\nBut the flag, the whole pageant, symbolized something else entirely to Karoni and the rest of her family. They were being asked to accept the unacceptable: a burial not of a body but of any uncertainty about Ron Forrester’s fate. A son, a brother, and a father transmuted into a disembodied name carved into stone.\nKaroni left her father’s funeral still asking where he was. It was a question she’d dedicate her life to answering.\nInto the Fight\nRonald Forrester was born fifteen minutes before his twin brother, Donald, on March 15, 1947. Three years later, they were joined by another brother, Larry. The boys grew up on the south side of Odessa, a part of town Larry describes as “the wrong side of the tracks.” They weren’t poor, exactly—“probably lower middle class,” he says. Their mother was a homemaker, and their father was a truck driver and an Army veteran who’d served in World War II. “Dad never talked about his experience in the war,” Larry says. He didn’t even like to go hunting—he’d seen enough guns, he would say—but whenever there was a movie about the war, he’d drive the kids to see it. Films featuring Audie Murphy, a Medal of Honor recipient turned movie star, were among their favorites.\nPerhaps inspired by his dad’s service in a heroic war, Ron had his eye on a military career pretty much as soon as he could march around. “We would dig foxholes in the backyard, and Ronnie was always the general,” Don says. But Ron didn’t want to be in the trenches. He wanted to be airborne, in a cockpit. One time, he climbed onto the roof of the house with a blanket, saying he was going to parachute down, but Don hollered for their parents, and they put a stop to it.\nRon was a competitive kid who loved sports. He and Don played doubles tennis in junior high, and Ron loved playing football for Ector High School, though he was a little too small to be a starter. He was shy around girls. Don says Ron would ask him to call Ron’s crushes, pretend to be him, and ask them out on dates. But he wasn’t shy about his ultimate goal: Ron Forrester wanted to be a pilot in the U.S. military.\nIt seemed to him that the most direct path to the tarmac was to attend the United States Air Force Academy. He wasn’t the best student, but he was diligent and excelled at math; he was a member of Ector High’s slide rule club. When the academy declined to offer him an appointment, he was devastated. One of Ron’s mentors, a teacher, helped him pick himself back up. “He put his arm around Ronnie and told him, ‘You can go to Texas A&M and accomplish everything that you could accomplish at the Air Force Academy,’” Larry says.\nRon went to A&M and joined the Corps of Cadets, an ROTC-style student military organization that offers cadets commissions in the U.S. military. He again tried to join the Air Force to be a pilot, but his hopes were finally dashed when he failed a vision test. It was then that he discovered he might still be able to fly, as a copilot in the Marine Corps.\nHis brothers noticed a change in Ron as he made his way through A&M and Marines training. He became increasingly confident and spoke up more frequently. He also wasn’t afraid to ask girls out on dates. Right after graduating and receiving his commission as a Marine officer, he married Jana Hamilton, whom he had met in Odessa. From there, life moved very fast for the young Marine. He and his new bride moved to Pensacola, Florida, where Ron attended flight school and trained as a bombardier navigator for the A-6 Intruder. Karoni was born there, in October 1970. Shortly afterward, the family moved to Marine Corps Air Station Cherry Point, in North Carolina. The couple separated soon after the transfer, and Karoni and her mother returned to Odessa.\nRon completed his training, and in 1972 he received his orders to deploy in late August. He visited his family in Odessa before he left. Karoni was only 22 months old when he shipped out. “But I know what he sounds like,” she says. Her father’s voice is imprinted in her memory because of those calls home during his deployment when he would ask to talk to her, a two-year-old sitting silently, holding the old rotary phone to her ear, taking in the only words she would hear her father speak.\nRon was assigned to Marine All Weather Attack Squadron 533, known as the Hawks; they were stationed at an air base in Thailand that the Marines jokingly called the Rose Garden. The base was little more than a 10,000-foot runway in the middle of a snake-infested jungle. Ron wrote in his first letter home from the base that “they just got electricity in the tents two days before I arrived. There is no hot water, but we do, at least, have a shower now.”\nThe Marines were flying combat missions: providing air support to men on the ground, hunting enemy aircraft, and undertaking search-and-destroy missions targeting enemy convoys. And Ron’s squadron was seeing a lot of action. By 1972 the U.S. had already suffered its worst losses, and the greatest scandals of the war—the My Lai massacre, the Pentagon Papers—had come to light and turned a disillusioned country sharply against the conflict. The U.S. and North Vietnam had been negotiating off and on since 1968, but the U.S. was in a weak position when Ron arrived in Thailand. The Nixon administration wanted out but was concerned that North Vietnamese forces would easily overrun South Vietnam as soon as the Americans left, making a mockery of the monumental losses the U.S. had suffered in the war. The North knew it had the upper hand and was unwilling to grant concessions. So to slow the increasingly bold incursions by the North Vietnamese Army, in early May, Nixon ordered a massive bombing campaign over North Vietnam called Operation Linebacker.\nThe Hawks lost their first plane on a daytime mission the month before Ron arrived. But A-6 aircraft also flew at night, thanks to a radar imaging system that gave navigators and pilots a sense of the terrain and ground targets ahead. Those trips were flown solo, for the simple reason that if planes flew in pairs at night, the pilots wouldn’t be able to see each other and could easily collide while trying to avoid terrain or enemy gunfire. In October, an A-6 in Ron’s squadron took off at night and never returned.\nWhen Ron arrived, he was put into the fight immediately. “I’ve averaged about one combat sortie a day so far,” he wrote to his parents. He flew almost all his missions with Jim Chipman, a 29-year-old pilot from Utah. “I’ve only been flying missions for two weeks. Already I know what it feels like to be doing a 45-degree dive toward the ground and having 37mm rounds exploding right in front of the aircraft. The missions are tense to say the least.” That was the first and last time Ron shared details about what he was doing. “If I wrote you about them, you’d only worry more than you already do,” he explained in another letter.\n“Mother was concerned,” Larry says. “She was a nervous wreck. But my dad was a quiet man, and for the most part, he carried all that in his heart.” The whole family worried. Once they heard the vivid details of the combat Ron was experiencing, it was hard to think of anything else. As Don says, “There was always that reminder that this could be a story without a happy ending.”\nEvery letter Ron wrote home ended with some version of “Give Karoni a kiss for me.” He sent her $20 for her birthday. “I can’t believe that Karoni is already two years old. Jana sent me a picture of her talking on the phone. I can’t believe how grown up she looks.”\nHe kept a close eye on the news about peace negotiations. “I read in the papers that Kissinger went back to Paris last night,” he wrote on October 19. “Although we’ve been trying not to, everyone really has their hopes up that the war will be over before the election.” Expectations back home were building that it might end even sooner. In a letter dated October 28, Ron wrote, “It’s hard to make yourself want to fly when it looks like the war might be over tomorrow.”\nBut peace negotiations stalled again, and by late December, Nixon had ordered another massive bombing campaign, dubbed Operation Linebacker II—the “Christmas bombings,” as the campaign would become known. It was clear that the war wasn’t ending anytime soon, which seemed to bring Ron a measure of relief. Certainty is better than uncertainty. In a Christmas letter home, he wrote, “My morale is a lot higher now, knowing that the war is going to go on for a while, than it was when it looked like it could end the next day . . . . I flew number forty-six on Christmas eve. I shouldn’t have any trouble getting a hundred missions before this thing is over.”\nIt would be Ron’s last letter home. On the evening of December 27, 1972, he took off on his forty-seventh mission. Jim Chipman was the pilot. Their call sign was Tiny 05. The weather that night was typical for the subtropical region: Clouds hung heavy and low at about two thousand feet, and there were intermittent squalls. But the A-6, the world’s first all-weather attack jet, was designed for exactly those conditions.\nTheir assignment was to attack enemy trucks and convoys on a stretch of road that ran north-south in the province of Quảng Bình, which was just north of the seventeenth parallel, the line and demilitarized zone separating North and South Vietnam. The road was just a few miles inland from the Gulf of Tonkin, and at the northernmost point was the Long Đại ferry crossing—a major staging area for accessing the Ho Chi Minh Trail, the main supply artery that connected North and South Vietnam through neighboring Laos and Cambodia. The North Vietnamese used the trail to deliver troops, weapons, and supplies to guerrilla forces in the South that would then attack South Vietnamese and American troops. Given their strategic location, the ferry and the roads leading to it were heavily defended by the North Vietnamese Army and antiaircraft positions.\nAfter taking off from Thailand at 7:43 p.m., two hours after sunset, Tiny 05 headed east, flew over Laos, entered South Vietnamese airspace, and then, about twenty kilometers before reaching Vietnam’s coast, turned north. Ron, looking out to his right, might’ve been able to see the lights of Hue and the black expanse of the sea beyond the city. Straight ahead was North Vietnam. At 8:20 p.m. Ron radioed Moonbeam, an EC-130 whose crew was coordinating combat missions in the area, that he and Chipman had crossed the DMZ and would reestablish contact after completing the mission.\nThat would be their last communication.\nA couple of days later, a Marine casualty officer was dispatched to Ron’s parents’ house in Odessa. Don happened to pull up to the home just after the officer had left. “Mom was crying,” Don says. The officer had told them Ron was missing in action. Larry, who was in Fort Worth, rushed home when he got the news. He remembers his father already believing the worst. “My dad said, ‘He’s gone.’ I tried to give him some hope, but he said, ‘I know what happened.’”\nThe officer emphasized two things to the family: The best thing they could do was keep hope that Ron was alive, and they shouldn’t talk to anyone about it. The days crawled by as they prayed for further news. It also occurred to them that Ron could be a prisoner of war. It had already been well established that American POWs, especially pilots, faced harsh treatment, including torture, in North Vietnamese camps. At times, the thought of Ron suffering felt worse than the thought of his death. On January 27, 1973, exactly one month after Ron had disappeared, representatives from the United States, North Vietnam, and South Vietnam signed the Paris Peace Accords. The war was over. The North Vietnamese released their American POWs that February and March. Jim Chipman and Ron Forrester weren’t among them.\nKaroni was living in her mother’s parents’ house in Odessa. “One day my grandparents noticed strange charges showing up on their phone bill,” she says. “They soon discovered that I had been picking up the receiver when no one was looking and dialing random numbers, hoping my dad would answer.”\nFrom the Podcast\nHear Karoni on her earliest memories of her father.\nWhere's My Father?\nIn downtown Odessa, standing just outside the Ector County courthouse, is a small stone monument dedicated to county residents who served in Vietnam. Ron’s name is engraved on it, along with the names of 49 others . . . those who made it back, those who were killed, and, as the epitaph reads, “those POW/MIAs still there.”\nThat wording seems odd today. Prisoners of war still in Vietnam? But in 1987, when the memorial was erected, most Americans thought there were POWs who’d been left behind and that the Vietnamese and U.S. governments were hiding the truth about them. As late as 1991, 69 percent of Americans believed this. The MIA issue was a major preoccupation in American culture and politics through the eighties and early nineties. Rambo: First Blood Part II, in which Sylvester Stallone rampages through Vietnam and rescues American POWs, was the second-highest-grossing film released in 1985. Chuck Norris roundhouse kicked his way to box office riches with two movies in which he does the same thing. In July 1991, Newsweek even ran a cover photograph purporting to show three American POWs still being held in Vietnam. (The photo turned out to be a fake.)\nAfter President Jimmy Carter reclassified MIAs as dead, which led to casketless funerals like the one Karoni and her family attended at Arlington, Ronald Reagan harnessed the outrage Carter’s move had provoked. He made a sturdy constituency out of MIA families and kept the issue alive throughout his presidency, at one point calling it “the highest national priority.” Texas billionaire Ross Perot reportedly financed private “forays” into Laos led by self-styled Rambos in search of POWs. Even after nothing came of these, Perot insisted that POWs were there. When he ran for president in 1992, he selected a former POW as his running mate.\nPOW/MIA culture was the air Karoni breathed when she was growing up in Odessa. As a kid, she didn’t consciously think about it, but it was always there.\nLike Ron, Karoni was an active child. She loved gymnastics and dance, and after her mom remarried, when she was four, she played baseball with her two stepbrothers on a team her stepdad coached. “It was a somewhat normal kid’s life. It’s just that I still didn’t know where my dad was and when he was coming home. For a long time, it wasn’t an if,” she says.\nBut on Memorial Day 1984, when she was thirteen, she decided that waiting for Ron’s return wouldn’t be enough. That day, President Reagan delivered a televised address at the Tomb of the Unknown Soldier and presided over the interment of the unidentified remains of a U.S. service member killed in Vietnam. The tomb holds the unidentified remains of Americans killed in every war since World War I, but President Carter had broken with tradition and not interred remains from Vietnam. There were understandable reasons for that—with new scientific advances, it seemed likely that all anonymous remains recovered in Vietnam would eventually be identified and returned to their families for burial. But veterans’ groups and MIA families took Carter’s decision as a slight, and Reagan timed a ceremony to honor the unknown dead from Vietnam for the spring of his reelection year. (As it turned out, the military had an inkling of whose remains it was interring—those of an Air Force pilot named Michael J. Blassie—but quashed any further inquiry by its scientists. In 1998 the remains were exhumed and Blassie was identified.)\n“They soon discovered that I had been picking up the receiver when no one was looking and dialing random numbers, hoping my dad would answer.”\nIn his speech, Reagan vowed that “an end to America’s involvement in Vietnam cannot come before we have achieved the fullest possible accounting of those missing in action.” Yet despite what Reagan said, to some families, it looked as if the government was closing the book on the war—and on its search for missing Americans.\nThat was exactly how it appeared to Karoni. “Here was this unknown soldier from Vietnam, always on the news, and I’m hearing, ‘This is the end of the Vietnam War.’ And I’m thirteen and hormonal, and I was pissed. ‘What do you mean it’s the end of the Vietnam War? Where’s my dad?’” For Karoni, it was a catalyzing moment. She decided to act, and she wanted to find others who were determined to do the same. So she attended a meeting of an organization called the National League of Families of American Prisoners and Missing in Southeast Asia, or, as it is more simply known, the League.\nMaybe you haven’t heard of the League, but you’ve almost certainly seen its symbol: a black and white flag with the silhouettes of a soldier and a prison watchtower and the words “POW/MIA, you are not forgotten.” The organization was founded during the Vietnam War by a small group of women, many of them wives of pilots who had gone missing or were imprisoned in Vietnam. They were frustrated by the government’s secrecy about their loved ones and the culture of silence the military imposed on families like theirs.\nWhat started in a few living rooms very quickly became a well-organized, well-funded national network, with thousands of members demanding that the government account for all missing and imprisoned service members. The United States of America had compelled them to go to war; it was the very minimum that could be expected in return.\nPoliticians were quick to at least appear to be responsive. By 1972, League leaders were meeting with President Nixon in the Oval Office. Reagan spoke at the League’s annual meeting and began the custom of flying the POW/MIA flag over the White House underneath the Stars and Stripes. It became ubiquitous, flying over post offices and VFW buildings all over the country. Congress displayed it in the Capitol Rotunda, the only flag accorded such an honor.\nKaroni joined the League at the peak of its influence. She attended her first meeting in Dallas—her mom drove her—and when she was sixteen, she traveled to Washington, D.C., for her first annual meeting, an event she would attend for decades to come. Every year she met other MIA families, many of whom also still believed their missing loved ones were alive. Karoni went to her first few League events on a mission: to learn as much as she could about how to get information from the government about her father. He’d been gone for fifteen years—time was of the essence. What she really wanted was to find someone, anyone, who could tell her what had happened to him. And in January 1988, she found a man who claimed to have the answers.\n“That Grew Me Up Real Fast...”\nKaroni was seventeen and had just come home from watching a basketball game at Odessa High School when her mom showed her a story in that day’s edition of the Odessa American. On page 9A was a photo of a man with a buzz cut and a big head walking past the Vietnam memorial at the county courthouse. The man’s name was Thomas Clift. The story reported that Clift was a former POW who’d been imprisoned with 227 others who he said were alive when he was sent home by his captors. Clift was in the middle of an epic four-year journey on foot from Portland, Oregon, all the way to the East Coast and back to call public attention to his claims. He called it his last patrol, and along the way, he had begun to generate media coverage from local newspapers and television stations.\nMight Clift know something about her father? Excited, Karoni knew she had to meet this man. She grabbed her dad’s cruise book, a kind of yearbook that included headshots of all the guys in his unit, and her mom drove her to a restaurant downtown. “We go meet him, and he picks my dad’s picture out, saying, ‘Yeah, that’s him. I was held in prison with him.’” Clift went into detail, telling Karoni that her father had sustained third-degree burns from the crash and that Clift had packed his wounds with mud. “He told me how gung-ho my dad was and that absolutely, he was still alive,” Karoni says. “I’d never thought about my dad being that injured. And oh, I cried and cried and cried.” But for the first time, Karoni felt a surge of hope. “He was alive. Now I had a chance of getting him home.”\nBut she harbored doubts about Clift. And now she had some new friends to lean on. She called the Texas state coordinator for the League. “And she said, ‘Hang on, I need to do some research.’” The man’s real name was William George Clift. (For whatever reason, he’d been using his brother’s name.) And while his brother told the paper in a later interview that Clift was a Vietnam vet, he’d never been captured. All along his “last patrol,” he had duped who knows how many people with his story. It was said that he had also been soliciting money. Karoni thinks it was just a lucky guess that he’d pointed to her dad’s photo in the book. He had made the whole story up.\n“That grew me up real fast when I was seventeen, and it was absolutely heartbreaking,” she says. In a rage, she threw on her dad’s flight jacket, jumped into her car, and went searching for Clift, but she never found him. Nor did the police, after learning of the cruelty he had committed. The episode was terribly painful for Karoni, but she came out of it more determined than ever to find her father. She felt closer to him through all the stories her uncles and grandparents told her, stories about how proud he was to be a Marine and, especially, an Aggie. When it came time for Karoni to go to college, there was little doubt where she would end up. Attending A&M would be a new way for her to connect with him.\nBut another international conflict would soon come between her and her father. In January 1991, during her second year in College Station, America found itself in a war again, this time in Iraq, and it began its largest air campaign since Vietnam. On the first night of Operation Desert Storm, as American and allied planes flew thousands of bombing sorties over Iraq, something happened that shook Karoni. As she watched the news, she heard Dan Rather’s voice say, “The first missing in action named by the Pentagon: F/A-18 Navy Lieutenant Commander Michael Speicher, from Jacksonville, Florida.”\nSpeicher was a fighter pilot. His F/A-18 Hornet had been shot down a hundred miles west of Baghdad, in the desert of the province of Al Anbar, and his fate was unknown. Karoni couldn’t pull herself away from the coverage. With no information on whether he’d survived, journalists turned to telling his life story. He had a wife and two young children, including a three-year-old daughter. Karoni felt a wave of dread that would’ve been familiar to her uncles and grandparents. What if he was alive and had been taken prisoner? The Iraqi military under Saddam Hussein gleefully tortured its prisoners. Every day, she watched the news, roiled with fear for Speicher and anxiety that others would go missing. She thought every day about Speicher’s young daughter, another little girl who would grow up asking where her father was. Karoni wanted the war to end immediately. It was all she could think about. Her family back in Odessa worried she would crack and turn into an anti-war protester, which brought back sour memories from the Vietnam War era. Karoni’s grandmother sent her a paper Ron had written when he was a student at A&M. She had never seen it before. In it, he denigrates anti-war activists, going so far as to call them communist sympathizers and traitors. Karoni’s grandmother had meant it to inspire Karoni to support the new war. Instead, it made her fear that her father would feel contempt for her too. It was a side of her dad she hadn’t known: critical, even a bit angry. She questioned why she was at Texas A&M—why she was retracing the footsteps of someone who, were he alive, might reject her.\nAmerican ground forces didn’t make it to Speicher’s crash site before Iraq agreed to a ceasefire in exchange for the U.S.’s withdrawal from Kuwait. Just months later, the Pentagon would declare Speicher dead, though it had no hard evidence that he had been killed. In a macabre replay of her traumatic experience, Karoni’s worst fears for Speicher’s family had come true. (Eighteen years later, in 2009, U.S. Marines found his remains near his crash site.)\nVillagers recalled finding aircraft debris, but the sites were mostly in rice paddies and couldn’t be excavated because they were under as much as two meters of water.\nOver the days and weeks after Speicher’s disappearance, Karoni spiraled into a dark state and was unable to function at school. She left College Station and moved to Denton, thinking she would transfer to the University of North Texas. Her family worried but didn’t know how to help.\nKaroni moved in with some friends while she pieced herself back together. It took a year, but she emerged from a difficult place with a new perspective. She realized that while she was mourning Speicher, she was also mad at herself that it took seeing another man go missing for her to look beyond her own pain. She had been exclusively, even selfishly, focused on her father. Now she felt that every other MIA mattered too. She knew where she belonged, and she knew that her father, even if he might have disagreed with her on some things, would have still loved her. She went back to College Station to complete her political science degree, and she threw whatever energy she had left into volunteering for the League.\nIn late 1992, just as she was settling into her new role as an activist, Karoni received a package in the mail. It was from the Department of Defense, and inside was a thick report containing everything the government knew about her father’s disappearance. The Pentagon was sending these reports to families in response to pressure from Congress to be more transparent with MIA relatives about any actions the government was taking to find those who were still missing. Vietnam had only recently granted U.S. government investigators access to the country to search for missing Americans.\nWhat Karoni read was hard to follow. It was full of dense, bureaucratic jargon—and horrifying details.\nIn the summer of 1992, Department of Defense investigators had traveled to Quảng Bình. The report said this was where Tiny 05 had been heading the night it disappeared. The Vietnamese government had shared a registry of graves for pilots who’d been shot down there, and listed on the document was “Ronald Wayne Forrester.”\nOfficials interviewed several people in one particular village, An Thủy, who reported seeing a plane get shot down. They even said they had helped bury remains recovered from the wreckage. According to those witnesses, it had been a catastrophic explosion. The plane and body parts—the back of a skull with hair still attached, part of a torso, a leg—were scattered all over a rice paddy just outside An Thủy.\nBut witness accounts differed. Some insisted the incident happened in 1967, five years before Tiny 05’s mission. Some said they saw a parachute deploy. And some quietly told investigators that Vietnamese officials had coached them on what to say. It wasn’t at all clear whether the remains the witnesses described were Ron’s or Jim Chipman’s, or whether they belonged to neither. Several villagers produced pieces of wreckage—scraps of metal and other parts—they said had come from the plane. One had converted a speed-brake panel into the floor of a shed. But the Americans were unable to connect any of the pieces to a particular kind of aircraft.\nThe report’s conclusion was deeply unsatisfying: Yes, a plane probably crashed somewhere near An Thủy. But there was no telling if it was Ron Forrester’s plane. And if it had been, it was impossible to know whether he had been killed in the crash or had managed to parachute out.\nAs Karoni absorbed the conflicting information and the raw, graphic eyewitness testimony, she felt the report was not an act of transparency. She saw it as an attempt by the government to get MIA families off its back. “You’re going to gross us out so bad that we’re not going to ask any more questions. Is that what you’re doing?” she says.\nIf that had been the intended result, the report had a very different effect on Karoni Forrester. She had been raised in a void of unknowing, and unless and until she found definitive proof of what had happened to her father, she simply would never stop her quest to find him. Those whose lives are not defined from the outset by mystery and loss might not understand the compulsion that fueled her, and that was fine with Karoni.\nU.S. investigators would return to Quảng Bình in 1993, 1994, and 1995, but they made little headway. They interviewed the same eyewitnesses and were shown additional areas where villagers recalled finding aircraft debris, but the sites were mostly in rice paddies and couldn’t be excavated because they were under as much as two meters of water. If there had been human remains in the paddies, they were by now likely part of the soil, which in Vietnam tends to be acidic, accelerating decomposition and breaking down anything that could yield DNA.\nThe pattern of mostly fruitless investigations would repeat itself for years. At one point, Karoni just stopped paying attention to the “scrub sheets,” as these reports are known. She poured more of her energy into the League and steadily climbed its ranks, becoming the Texas state coordinator in 1999. She never stopped demanding that the federal government continue investigating her father’s fate, but most of her attention went to helping other families. The case of Ron Forrester had gone cold.\nKaroni’s family supported her through the years, but her path was her own. Her uncles processed the loss of their brother differently. “I hesitate to say this, but I felt like early one morning that God was telling me, ‘Your brother’s with me, and someday you will be reunited,’” Larry says. “It seemed very real. At that point, I felt fairly confident he was not coming back. It had been twenty years.” For Don, it was a more gradual process. “I can’t tell you what year, but at some point you realize the likelihood is nonexistent. But you still don’t give up hope. Without certainty, you’re never really done with it,” he says. Don stayed in Texas and worked with children and families in the foster system; he also served as a Baptist pastor. He’s written books about his journey to making peace with the loss of his brother.\nFrom the Podcast\nHear more from Don and Larry Forrester about their brother.\nJesus Flipped Tables Too\nIn Western history, repatriating the bodies or remains of those killed in war dates back at least as far as the time of the ancient Greeks. Athenian soldiers brought home the bones of their fallen comrades and placed them inside cypress coffins, which were then held aloft on platforms and paraded through the city before being entombed in a sepulchre dedicated to war dead. Among the procession would be one empty platform without a coffin, in honor of those whose bodies could not be recovered.\nThe United States has historically made efforts to account for its missing, with varying degrees of commitment and with differing results. At the end of the Civil War, Clara Barton, the Union Army nurse who went on to found the Red Cross, opened at her expense the Missing Soldiers Office in Washington. Over four years, she and a small team of clerks accounted for 20,000 missing Union soldiers. After World Wars I and II and the Korean War, the U.S. Army searched for MIAs from those conflicts, disinterring isolated graves in former battlefields and locating aircraft crash sites.\nIt wasn’t until the post-Vietnam era that accounting for all missing service members became a matter of widespread public concern. A lot of that had to do with the League. It spurred and harnessed public energy around the issue, lobbying the government to establish a permanent agency dedicated to accounting for every MIA. Today, after bureaucratic shuffling and several name changes over the decades, that office is called the Defense POW/MIA Accounting Agency, which was founded in 1993. The DPAA’s mission is straightforward: Find out what happened to all MIA personnel and, when possible, recover and identify their remains. The DPAA is also required to regularly update MIA families about its investigations. It today works on cases for all wars since World War II (in which roughly 72,000 servicemen remain missing or unidentified), but Vietnam is the highest priority, primarily because it’s the war with the most unaccounted-for troops whose immediate relatives are still alive and waiting for answers.\nThe agency has a staff of about seven hundred military and civilian employees. Many of them are stationed at Joint Base Pearl Harbor–Hickam, in Honolulu. Inside the base is the crown jewel of the DPAA, a sleek three-story complex that houses part of the world’s largest forensic-anthropology laboratory. About half the space inside is made up of labs in which scientists in white coats do the work of assigning names and life stories to remains that have been recovered from sites all over Southeast Asia. Heavy air locks separate the hallways from rooms containing remains that are being analyzed.\nThe other half of the headquarters is made up of cubicles and offices. Some of the cubicles are filled with weather-beaten, mud-caked hiking gear and well-worn spades with snapped and splintered handles. These cubicles belong to members of dig teams—archaeologists of a sort—who go into the field and excavate sites suspected of containing remains. The broken shovels are considered trophies, reminders of how strenuous the labor can be. In other cubicles are stacks of books and documents. These belong to analysts—you might call them detectives—who work the cases of the missing, including 1,572 from the Vietnam War.\nSitting hunched in one of these cubicles, surrounded by haphazard stacks of paper, is Bob Maves, a short, white-haired man wearing wire-rimmed glasses and a baseball cap. Every day, a different cap. One of the agency’s longest-serving analysts, Maves heads the Vietnam-focused department. He worked on the Forrester case for years and served in the Army for two decades before that. One day last fall, I spent time with him at his office in Honolulu, discussing the case of the missing Marine from Odessa.\n“I remember the day when I met Karoni very well,” he says. It was 2009, and Maves was attending his first League meeting, which was held at a hotel near the Pentagon. “I was the new guy, and we were socializing at the bar, and I’m kind of a loud guy, but then there were these ladies who were louder than I was.” Almost immediately, Bob Maves and Karoni Forrester became friends.\nAnd it’s easy to see why. Maves is a hilarious, no-bullshit kind of guy, and he saw the same in Karoni. “She’s a very assertive person. That’s always been her personality, I suspect,” he says. “She’s loud, but that’s okay. Our job is not to take any of this personally. If you did, you’d have a nervous breakdown and be sent to an institution somewhere. So you just have to be able to suck it up when they’re yelling, screaming, crying, whatever it is.”\nFor many years, Karoni did her fair share of yelling and crying when meeting with DPAA officials. “I’ll flip tables if I have to. My preacher told me it’s okay. Jesus flipped tables,” she says. I’m sitting with Karoni at her dining room table. Her house is in a quiet neighborhood atop one of the hills west of Austin. She lives here with her husband, Chris, her 21-year-old daughter, Lilian, and the family’s three dogs. Karoni’s petite frame is slightly incongruous with her voice, which is equal parts West Texas drawl and husky gravel. She has dark, curly hair, as well as brown eyes and a button nose that look exactly like her father’s. His portrait hangs on the wall immediately inside her front door, inside a case with an American flag folded into a tight triangle.\nKaroni explains to me that every family’s goal is to have their case scheduled on the DPAA’s Master Excavation List, or MEL. The agency organizes digs in order of priority, but getting on the MEL isn’t always straightforward. Sometimes cases move up the list when new evidence emerges that points to a spot where remains might be found; at other times, it’s because the host country has notified the DPAA that a potential dig site is about to be disturbed by new construction, like the building of a road or other piece of infrastructure. How the DPAA determines who gets priority is a bit opaque, and getting added to the list doesn’t necessarily mean something substantive will happen. “You go into that case-review meeting with anxiety,” Karoni says. “‘Have we finally made it above the line to where we’re on the schedule?’ Then you find out you’re on the schedule and that a team is going out in October, but then you don’t hear back until December, when you get a report that says it was raining and the field was flooded, so they didn’t dig.”\nKaroni can recite a litany of frustrating stories about working with the DPAA. She gets agitated just thinking back on some of them, like the time it took her five years of pushing to get the agency to take a magnetometer—basically a metal detector—out to the rice paddies near An Thủy to search for more aircraft wreckage. When it was finally put into the field, the operator used it in a nearby canal but not in the rice paddies. And then the case-review officer in charge at the time didn’t file a report for two years. The waiting could get intolerable. Every year, the family would observe Ron’s birthday. They’d remember him at Christmastime. They would observe his “shootdown date” each year. “And we’re waiting on a frigging guy to write a report that may not even be relevant anymore,” Karoni says.\nThat was why the League was so important. “There’s no textbook for what we’re up against. The League didn’t provide, necessarily, the instruction manual, but being with other people and learning from their experiences was how we picked up essential information,” Karoni says. She earned a reputation for being the social glue of the organization, always willing to give other families the benefit of her experience, always good company at happy hour, always the go-to person for new families just starting to learn how to navigate the bureaucracy. In 2009 she was elected to the League’s board of directors.\nDespite her frustrations with the DPAA, Karoni is strongly supportive of its mission and, through the League, has lobbied the government to allocate additional resources to the agency. It is, ultimately, MIA families’ only hope. But as the 2000s rolled into the 2010s, there was scant progress on her father’s case.\nAnd then, in 2015, everything changed.\nAn X on the Ground\nIn late June of that year, Karoni was sitting at the bar at the Crystal City Hilton, near the Pentagon. The annual League meeting and family conferences with the DPAA had just wrapped up. Jay Veith, a former Army officer turned Vietnam War historian, had been attending League meetings since the nineties, lending his expertise to help relatives make heads or tails of their scrub sheets. Veith has a professorial air to him. He’s the author of six books, all of them about the Vietnam War, with three focusing on the POW/MIA issue. But he also talks like a gruff, seasoned detective who isn’t shy about calling others out for work he finds less than stellar. For the families, Veith’s deep immersion in the subject that consumed them made him good company and a comfort to be around.\n“Jay and I had become good friends, and also the kind of buddies that you can just commiserate with,” Karoni says. So if things weren’t going well, “we were just, ‘Yeah, let’s hang out and have a drink and bitch about this together.’”\nThat year, Veith had come to the annual meeting with new information he thought could be relevant to some cases. He and his friend Merle Pribbenow, who served in Vietnam for five years as a translator for the Central Intelligence Agency, had been collecting Vietnamese-language books about the war, and Pribbenow had been working on translating them. “One of the things people don’t realize is that the Vietnamese are, naturally, very proud of their victory,” Veith told me. “And they’ve published an enormous amount of material on the war, far more than Western scholars are aware. There are literally thousands of books.”\nVeith and Pribbenow had been accumulating histories of the North Vietnamese general staff—the equivalent of the U.S. Joint Chiefs of Staff. Pribbenow had discovered that the general staff had issued directives, particularly during the U.S.’s bombing campaigns of 1972, instructing that the remains of any American pilots who were killed should be buried and the locations of their graves recorded.\nVeith knew Karoni’s father had disappeared toward the end of the war. One evening, after a day of sessions, he walked up to her at the bar and asked to see her scrub sheet. He was deeply unimpressed by what he saw in the DPAA’s accounting of her father’s disappearance. “I realized that it’s just a list of ‘We went here on this day. We went here on this day. We went here on this day,’” Veith says. “There was no effort within the scrub sheet to analyze the material collected from the very first time they’d gone out there. Nor was there any review of People’s Army of Vietnam publications on her dad’s case. It didn’t make any sense. They likely crashed near a village, in a very populated area. This wasn’t like a plane that was shot down in Bumf—, Laos.”\nVeith tapped out an email to Pribbenow on his phone with some of the details of Ron’s case: the date of the disappearance and the area the investigators had been searching. “Within twenty minutes, my cell buzzes, and it’s Merle emailing me back,” Veith says. He had found a short reference in a Vietnamese history book—an account of the shootdown of an A-6 on December 27, 1972, including the specific units credited with the shootdown. This information had been nowhere in the records of the DPAA investigation of Ron’s disappearance.\nThen there were the rice paddies the villagers had pointed out to investigators and from which fragments of an aircraft had been extracted, though they were not easily identifiable as belonging to an A-6. Veith knew the U.S. government had started declassifying satellite imagery of Vietnam taken during the war. He wanted to know if there were any images that could confirm where, exactly, the plane might have crashed. He got in touch with Lou Shwetzer, who at the time was a Defense Department analyst specializing in aerial imagery.\nAs Tiny 05 came in from the east, the sound of its engines gave the villagers time to point the barrels of their 37mm cannons and 12.7mm machine guns in its general direction.\nShwetzer agreed to volunteer his time to work the case, and during the next several months, he drove back and forth between his home in Virginia and the National Archives’ Cartographic Research Room, in College Park, Maryland. He committed himself to the painstaking process of finding relevant imagery—which may or may not have existed—inside hundreds of old tin canisters of film. Then he sent an email to Veith, who was once again posted up at a bar. “I’ll never forget it,” Veith says. “My cell goes off, and Lou had written a report saying he found an image of the crash site about three months after the shootdown.” A photo from March 1973 showed a large impact crater in a rice paddy. Shwetzer thought it came from a bomb, but he couldn’t know for sure. Still, Veith felt they were adding vital information to the case that the government’s investigation had not.\nHe wanted to continue working with Pribbenow and Shwetzer, and he proposed to the League that their efforts be officially incorporated into the work of the organization. This was new territory for the League, which had historically been more interested in influencing government policy on the MIA issue than creating a unit to engage in the forensic investigation of one specific case. But the team became a part of the League, and soon one more member, Joseph Mortati, a former Air Force pilot turned professor at American University, joined. With that, the group, which called itself the Archival Research Committee, was assembled.\nOver the next year, the four men dug into the Forrester case. More often than not, they found dead ends that made them wonder whether the DPAA was even looking in the right place. The crater Shwetzer had seen from March 1973 ended up being a bomb crater; another photograph taken a few months before Ron’s mission showed the same cavity. The exhausting loop of hope followed by disappointment followed by more months spooling off the calendar, ad infinitum, was enough for Karoni to also start doubting that the DPAA was searching in the right place. “There was something in that rice paddy before Dad and Jim’s plane went down, and I think the worst behaved I ever was was in a one-on-one briefing with the government when I showed them these photos and tried to get them to look elsewhere,” she says.\nMortati made some tantalizing discoveries. The first U.S. investigators, who had visited An Thủy in the early nineties, had taken close-up photos of what appeared to be shreds of a tire, which a villager claimed to have taken from the crash site near the village. Those investigators said they believed the pieces could not have belonged to an A-6, because the sizing numbers, which were still legible, had the tire’s diameter at 50 inches and width at 22 inches. That led them to believe it belonged to a much larger aircraft. “We’d be talking, like, a 747,” Mortati told me. But also legible on the shreds was the name of the tire’s manufacturer, a firm based in Baltimore. Mortati made two calls—he called that company, and then he got in touch with a man in Arizona who managed a boneyard, a storage area for decommissioned planes, that happened to have a vintage A-6 in its lot. The tire manufacturer dug into its records and found that it had never made a tire of that description. Then the boneyard manager reported back, solving the mystery. The numbers were wrong—the tire was not 50 but 20 inches in diameter, and its width was 5.5 inches, meaning that the pieces found at An Thủy could be a perfect match for the nose-gear tire from an A-6. Additionally, Mortati found that the speed-brake panel that a villager had turned into the floor of a shed, which investigators had described but not analyzed, could have belonged only to an A-6.\nThis was the most compelling evidence yet that the team had found the resting place of Jim Chipman and Ron Forrester’s plane, but there was still no definitive proof that the discovered pieces were from Tiny 05. “The thing we were trying to do was put an X on the ground for the government to go dig,” Veith told me. The team members couldn’t do that, but they had enough material to share their findings with Karoni and the League, which they did in a 14,000-word report in February 2017. Through the murk of decades, and against staggering odds, a picture of what had happened to Tiny 05 was slowly coming into focus.\nFrom the Podcast\nHear Joseph Mortati tell the story of his discovery.\nThe Fate of Tiny 05\nAfter entering North Vietnamese airspace and going radio silent, Tiny 05 likely began executing a series of northbound S-turns over the highway leading up to the Long Đại ferry: The plane would approach the road at 90 degrees, swooping down to as low as 1,800 feet, fire on any targets, and then climb up and execute a wide, 180-degree turn and swoop down farther north on the road. Just before 8:45 p.m., Tiny 05 started lining up its attack run on the ferry.\nDespite its name, the Long Đại ferry was made up of pontoon bridges—buoyant slabs supporting a wooden deck wide enough for trucks—that crossed the Long Đại River. The North Vietnamese antiaircraft units relied on simple sight and sound to detect an approaching jet and would launch a barrage of lead—from cannons, machine guns, even small arms—into the sky, hoping for a strike or, more likely, to drive the enemy off target.\nThat’s almost certainly what brought down Tiny 05. A Vietnamese report said units at the ferry detected the jet approaching from the west and sprayed 2,410 rounds, which from the cockpit would appear as a huge, widening constellation of fiery metal coming up from the ground below. The Vietnamese did not report that Tiny 05 had fired any of its weapons at the ferry, which may mean that the barrage was enough to force Chipman to abandon the line of attack before Forrester could release any bombs. Whatever the reason, Tiny 05 continued heading east past the ferry and out over the ocean, then began its first southbound S-turn.\nAbout nine miles southeast of the ferry and five miles from the coast lies An Thủy—a rural village where locals were expected to fight. According to a history of Vietnamese air defense, the Communist government had relieved the people of An Thủy “of all obligations to perform daily productive work” so that they might be “on duty full time to engage enemy aircraft.” It’s more than likely that the units were already on high alert. As Tiny 05 came in from the east, off the Gulf of Tonkin, the sound of its engines gave the villagers time to point the barrels of their 37mm cannons and 12.7mm machine guns in the general direction of the aircraft and start firing.\nA report from the state-run Vietnam News Agency described what happened next: The plane “exploded in a ball of flames. Many pieces of the plane were scattered across the fields while the main part of the aircraft crashed into a newly plowed water-filled rice paddy.” Some villagers would later tell investigators that the plane was hit, caught fire, and then exploded in midair, scattering debris across rice paddies southwest of An Thủy. Photos of the wreckage and the later discovery of aircraft parts by investigators show that what the villagers described was likely accurate. The DPAA believes Chipman and Forrester would have been killed instantly, their bodies disintegrating with the plane.\nIn the hours after the crash, locals and Vietnamese soldiers scavenged the detritus, found partial remains of the two men, and buried what they found in a grave. In interviews years later, villagers said the remains were moved to another nearby site before they were dug up again by officials from the central government and transported to an undisclosed location. The Vietnamese government has to this day never acknowledged to investigators that it exhumed the remains or said where they were taken.\nThe Four Horsemen\nJay Veith and his team presented their findings at the 2017 and 2018 League meetings. Bob Maves, from the DPAA, was there for both presentations. He and Veith are something akin to friendly rivals, although that’s not a characterization Veith would use. “Bob is one of the few people at DPAA who recognizes the value that we brought and tried to help us. We’re both trying to accomplish the same thing,” he says.\nMaves also admires Veith’s team, after a fashion. “I call them the four horsemen,” he says. Veith and his crew implored the DPAA to press the Vietnamese for more information. “And I sat there twice just taking my licks,” Maves says. “I told them, ‘Yeah, we’ll see. We’ll see.’”\nThe DPAA may not have officially acknowledged the work of Veith’s squad, but soon after Veith and the others started presenting their findings to the public, the agency moved Ron Forrester up its priority list and approved an excavation in those rice paddies just southwest of An Thủy. Maves told me the case was prioritized because the Vietnamese had notified the DPAA that an electrical tower was being built on one of the rice paddies and that the construction might make the site inaccessible. Veith thinks it was too much of a coincidence. “I think it mattered that Karoni was a board member of the League, and she was a very well-known and vocal person. Then we write this long report that’s highly detailed. And suddenly the government decides to put her case on the MEL?”\nA dig team arrived on-site in February 2020 but was forced to suspend operations a month later because of the COVID-19 pandemic. The excavation resumed in the summer of 2021. More than 150 people participated, including about 50 service members, contractors, and scientists working for the DPAA and around 100 locals who were employed as laborers. Draining and excavating rice paddies is hard, repetitive, dirty work, and it was made even more difficult by the triple-digit summer temperatures. Between thunderous deluges and stifling, sticky heat, the whole endeavor began to feel like a punishment. Janet Finlayson, a DPAA archaeological anthropologist who was on the dig, says it was the same thing every day for the team. “We called it Groundhog Day,” she says. Pumping water out of the dig site. Sifting pounds of heavy, wet mud through mesh screens, like panning for gold. Heat exhaustion and eye infections from spraying the mud were common.\nOn top of all that, the Vietnamese government permits DPAA dig teams access to sites for only limited durations, typically 45 days. That’s not a lot of time; team members often work twelve hours a day, six days a week.\nAfter about a month of slogging through the mud, a worker sifting through the wet screen raised his hand and called out . . . .“I think this is a tooth.”\nMost days, the workers looking for Tiny 05 found nothing, and every day began the same way. William Ryan, an Army captain, would have the whole team gather in the morning, and he’d tell a story about Ron Forrester or Jim Chipman. Stories about their childhoods. Stories about their lives leading up to the crash. Ryan read letters Ron had written while he was deployed in which he spoke of his longing for home, for his family, for his little daughter. The goal of an archaeological dig—especially one that may well yield nothing—can, through the careful and rigorous routines of science, be easily reduced to mere abstraction. Ryan’s morning messages were designed to make real these two Marines, men who lived as we live, dreamed of the future just as we dream, and loved their families just as we do. Through the exhausting work, Ryan’s evocations of their words and the memories of those they left behind took on the air of prayer and suffused the project with emotion and purpose.\nThe summer 2021 dig yielded no remains. There was a growing anxiety that if evidence didn’t turn up soon, the DPAA would deprioritize finding the two men, possibly for good. A dig in Vietnam costs more than $400,000, according to Maves. That’s a princely sum for an agency with an annual budget of around $150 million and a list of competing priorities that must be resolved now or risk disappearing into the muck of Southeast Asia forever.\nMeanwhile, Karoni’s time as a member of the League’s board came to an acrimonious end. For years, her frustration with the organization’s leadership had been building. She was troubled by how the finances were managed. Fundamentally, she felt that the League was stuck in the eighties—it didn’t prioritize building a decent website. Its aging management wasn’t interested in the ideas Karoni or others of her generation brought to its workings. She resigned in September 2021.\nWithout the sense of community the League offered, 2022 was a nadir for Karoni. The dig team hadn’t come up with any remains. Another dig was scheduled for 2023. After a lifetime of disappointment, she had no reason to believe this time would be any different.\n“We Got a Match”\nThe DPAA team returned to the rice paddies in February 2023. After about a month of slogging through the mud, a worker sifting through his wet screen raised his hand and called out to Finlayson, who came over. “I think this is a tooth,” the man said. It was, and the weight of the discovery hit Finlayson immediately. “It’s one of those moments where you’re not really sure whether to believe it or not, because we, as an agency, have been investigating this case since 1991,” she says. “We had investigated the site more than a dozen times before, and excavated the site two times before that day. Until that moment, it felt like another mission where we might never find anything. And then, all of a sudden, here’s a complete tooth.” Then two more teeth. All three were sent back to the DPAA’s forensic laboratory in Honolulu.\nAnother team continued digging through May and June. Small bone fragments started showing up in the screens, though it was unclear whether they were human. Ultimately, eleven pieces, each about the size of a fingernail, were collected and sent to Honolulu for testing.\nThen one day, about midway into the mission, Ryan was working next to a young sergeant, Madison Cook. They were power-washing blocks of mud through screens. It was another long, oppressively hot day. The team knew about the teeth from the previous dig and had gone into this one with high spirits, but nothing besides those unremarkable bone fragments had shown up so far. The days were starting to blur together. Then Cook stopped. She tapped Ryan on the shoulder. He saw that she was peering closely at something she held in her fingertips, and she was shaking. It was a white plastic shard, its edges jagged and discolored. It was a fragment of a credit card issued by Humble Oil & Refining Company, and part of a name printed in blue block letters was clearly legible: O-R-R-E-S-T-E-R. Ryan, elated, passed word down the line. Finally, certainty that at long last, someone had found the resting place of the young Marine from Odessa.\nBut the team didn’t pause to celebrate. Time was not on its side. Cook’s discovery boosted everyone’s spirits, and they plunged back into the work at an even more feverish pace. Then one afternoon, just as time in the field was running out, another discovery, this time by Ryan: a dog tag in a plastic sleeve. Dog tags are purposely made of corrosion-resistant metal, and after he washed off the mud, the stamped name on the tag was clear: R. J. Chipman. “It looked like it fell off his neck yesterday,” Ryan says.\nKaroni was in Washington for the annual MIA family conferences as the DPAA team was completing its work. She had heard about the teeth and bone fragments. Just as the conferences were ending, the DPAA shared that it had found Chipman’s dog tag—and Ron’s credit card. She now knew the agency was digging in the right place. But still, the news carried a slight edge: If the teeth and bones that had been recovered couldn’t be matched to Jim Chipman or Ron Forrester, the DPAA would have to go back and continue excavating the paddy. And if the entire paddy was excavated and nothing else was found, the dog tag and credit card alone would make it possible for the DPAA to decide that there was enough evidence that Ron and Jim had died there. But no trace of either man would have been recovered. Ron’s case could move to what’s called deferred status.\n“You proved where they’re at, right?” Maves explains. “I can’t say ‘accounted for,’ because there wasn’t [DNA] identification, but we proved that they died in that crash site. So unless somebody finds evidence of remains somewhere outside of where we previously dug, basically, that’s it. There’s nothing else we can do.”\nAs Karoni waited for the teeth and bone fragments to be analyzed, it was hard for her to think about anything else, and hard to manage her expectations. Was this the breakthrough she had been waiting for her whole life? Or would she get this close and no closer? In vain, she tried to immerse herself in normal routines. In Honolulu, a team of forensic scientists searched for DNA that they might compare with samples from Chipman’s and Forrester’s close relatives, which they had on file. Each of the fragments was examined, but only one was clearly human and had enough material to undergo a DNA test at a separate lab in Delaware. It was tubular in shape, about 2.5 centimeters long, with jagged curves on either end, and it appeared to be charred from exposure to fire. The anthropologist overseeing the analysis, Hugh Tuller, says that given the shape of the bone, it was possibly a part of a hand or foot.\nTo yield useful data, everything must go perfectly—the smallest contaminant ruins the result. The scientists cut off about half of the fragment and ground it into a fine powder, then incubated it in a solvent that demineralized the powder—calcium is a contaminant—and released the DNA matter. Next, the liquid was put into a centrifuge to separate the DNA, which was then extracted for sequencing.\nIn August, the DPAA confirmed that the teeth belonged to Chipman. A few months later, on Veterans Day, his remains were delivered to his hometown of American Fork, Utah. A casket containing what was left of him was draped in an American flag and accompanied by a full military detail, which led a procession through town while hundreds of residents, veterans, and mourners looked on. The military organized a flyby before Chipman’s widow and two sons, who had been four years old and twenty months old when their father died, buried him. Jim Chipman was home.\nOn December 5, 2023, about a month after Chipman was laid to rest, Karoni Forrester was at home when she noticed that she had missed a phone call from her Marine casualty officer, Michael Ryba. He’d sent a text saying that he had “some positive news to report.”\n“I just knew,” Karoni says.\n“As God intended it,” she says, her daughter and husband were at home too. All three gathered around Karoni’s phone as she called Ryba back. “We got a match,” he said. The bone fragment from the rice paddy in An Thủy belonged to her father. “We all just looked at each other,” Karoni says. Then the weight of it all crashed down, and she collapsed in tears. After 51 years, the search for Ron Forrester was over.\n“Little Things...”\nIn late September 2024, I joined Karoni in Honolulu for a father-daughter reunion.\nIt was a Friday, the twentieth, when her husband, Chris, and a few close friends accompanied her to the DPAA lab, where two of its top scientists, Greg Berg and Denise To, met them at the entrance. There was no schedule and only one item on the itinerary: viewing her father’s remains. But first, she had questions. Her hosts were kind and patient, and Karoni was invited to ask for as many answers as she wanted. For the next four hours, she peppered Berg and To with every conceivable question about the excavations and how the science behind identification works, so she could share that information with other MIA families that were still waiting or were confused by the process.\nOnly after she’d exhausted her questions, and very nearly her guides, did she grow quiet. It was finally time to see her father. “I’m ready,” she said, suddenly pensive. She was led to an oval-shaped room with heavy curtains. In the middle of the room was a conference table. Lying on the table was what appeared to be a small, jagged stone no bigger than a fingernail. It had yielded the DNA match. She asked to see the rest. Soon the other bone fragments were before her, though these had not been definitively proven to belong to her father. Karoni delicately picked up the fragment that had been positively identified, the darkened, tubular piece of bone. She rolled it between her fingers, looking at it in silent wonder. She furrowed her brow, studying the piece intently, and then her face softened and the tears came.\nShe was shocked by how small the remains were. “Little things,” she said, her voice faltering, “make such a difference in an entire family’s life.” All those years of hoping and searching, all those months of hard labor by the dig teams had come to this, this small piece of what might have been the hand that once held her hand. This trace of the life that had given her life. Ron Forrester had been found. Karoni’s father was going home.\nCaptain Forrester’s final flight was on October 4, 2024, Karoni’s fifty-fourth birthday. He flew from Honolulu to Baltimore inside a wooden casket strapped into the cargo hold of a Delta Air Lines commercial flight, for what the Department of Defense calls the “dignified transfer” of his remains back to his family for burial. As the plane approached the gate, two airport fire trucks parked on opposite sides triggered their water cannons, forming an arc over the plane. Karoni stood on the tarmac next to the gate. She was joined by her husband and Don, a few friends, and about fifty others, including the members of a Transportation Security Administration color guard, a few jacketed FBI agents checking their radios, and about twenty older guys, many of them veterans in biker vests, representing the Patriot Guard Riders, a volunteer group that attends military funerals at invitations from decedents’ families. Standing next to a hearse were six Marines in formal dress blues.\nCurious onlookers had gathered along the windows of the terminal, looking down at the scene. The flight’s pilot had announced that the passengers could not disembark until a somber procession had escorted Captain Forrester off the plane and to the hearse. Word spread through the terminal. The curious paused on their ways to places, turned and looked. A few older men stood at attention.\nAirport staff opened the cargo hold and carefully unloaded the flag-draped casket onto a conveyor belt as Karoni watched in silence, wiping away tears. Slowly, she and Chris walked to the casket, and as she approached, she reached out her hand to gently touch it. For a moment, nothing moved except the color guard’s flags, fluttering in the wind.\nAfter caravanning with the hearse to a funeral home in Baltimore, Karoni, exhausted and euphoric, traveled to Washington, D.C., for a celebratory dinner with her family and friends. After the plates were cleared, a dessert with a candle came out. Karoni breathed deep to blow it out, then caught herself. Her daughter, Lilian, looked across the table at her and said, “Mom, pick a new wish now.”\nReleasing Karoni Forrester\nA 21-gun salute cracked the air over Section 47 of Arlington National Cemetery. The United States Marine Band played taps. There were homilies about the hallowed ground where Captain Forrester would spend eternity with so many of the honored dead since the Civil War. His daughter would receive another tightly folded flag on behalf of a grateful nation. The headline on the DOD news blog would read: “Missing Vet Found After 51 Years Laid to Rest by Family Who Never Gave Up.”\nOn October 7, Karoni had returned to this familiar place for her father’s second funeral service. She was joined by two hundred people, family and friends from different stages of her life—childhood friends from Odessa, Texas A&M folks, people she knew from her MIA activism, Run for the Wall bikers—and there were some graying Aggie and Marine buddies of Ron’s. Bob Maves flew in from Hawaii along with a member of one of the dig teams. They were joined by the director of the DPAA. Many of the attendees wore metal bracelets with Ron’s name engraved on them. Some had worn those bracelets for decades.\nMost of the crowd members had never known Ron. They were there for Karoni. After her decades working on behalf of other MIA families and watching other daughters and sons bury their fathers, it was her turn. “I’ve had multiple people tell me they don’t know whether to say ‘I’m sorry for your loss’ or ‘Congratulations,’” she told me. “Well, it’s really both!”\nThe Marines put on a hell of a show. The Marine Band members, dressed in bright red uniforms, plus about a hundred Marines in ceremonial blues, accompanied the casket, marching perfectly to the pattering beat of a snare drum. It was a gorgeous day, with hardly a cloud in the sky. As the casket approached the grave site, on a gently sloping hill with rows of white headstones leading down to a grove of towering oak trees, a pair of Ospreys roared overhead.\nAll those years of hoping and searching, all those months of hard labor by the dig teams had come to this, this small piece of what might have been the hand that once held her hand.\nSix Marines stretched out an American flag, and where there had once been a void, there was now a casket containing the earthly remains of Ron Forrester. The sad, confused child in the powder-blue dress was gone. A small, frayed part of our national fabric had been mended. The United States of America, fractious and loud as it has become—and maybe always has been—had at long last, with quiet fidelity to duty, delivered on an important promise, releasing Karoni Forrester from her purgatory in the process.\nShe had lived her life assuming that this moment would never come. Her grandparents had died not knowing what had happened to their oldest son, praying for the mercy of a reunion on the other side. Karoni had abided in the unknowing. For a time after her mother remarried, her stepfather, who was a kind man, tried his best to fill the space for her, but he faced a paradox: Fully embracing her as a daughter meant dashing a little girl’s yearning for her father’s return. At her stepfather’s funeral a few years ago, Karoni’s stepbrother told her something that made her heart skip a beat. “He said that my stepdad wished that he had told me he loved me more. He was trying to give me a home and a family with my stepbrothers. But he was also saving that space in case Dad came home.”\nLater that night, Karoni and a small group of friends and family members made their way to the Vietnam Veterans Memorial wall. They found the panel bearing Ron’s name—it’s easy to find because he was among the last casualties of the war—and saw the change. The small cross next to his name, a symbol inscribed next to every missing service member, had now been chiseled into a diamond, the memorial’s way of signifying the dead. Karoni and the others removed their metal bracelets, snapped them, and placed them carefully under Ron’s name. They hugged, said their goodbyes, and walked off into the night.\nThis article originally appeared in the June 2025 issue of Texas Monthly with the headline “The Final Flight of Captain Forrester.” Subscribe today.",
  "word_count": 12794,
  "scraped_at": "2026-02-14T12:11:28.923345"
}