{
  "article_id": "6e0be20f2209",
  "url": "https://news.sky.com/story/euro-2024-bukayo-saka-helps-keep-englands-dream-of-winning-silverware-overseas-alive-13174458",
  "title": "Euro 2024 : Bukayo Saka helps keep England dream of winning silverware overseas alive",
  "date": "20240707T023000Z",
  "domain": "news.sky.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Euro 2024: Bukayo Saka helps keep England's dream of winning silverware overseas alive\nAn 80th-minute equaliser delivered by Bukayo Saka rescued England's quarter-final against Switzerland, before he stepped up to the penalty area to take on the toughest task in football.\nSunday 7 July 2024 12:02, UK\nBukayo Saka didn't need any redemption.\nThere was never any doubt about his value to the England team.\nBut it was a sign of determination, character and strength that the winger stepped up to take another penalty when called on at Euro 2024.\nIt would be easy to understand if he had not after the torrent of racist abuse he received on social media - along with fellow black players Marcus Rashford and Jadon Sancho - after spot kick misses in the last Euros final defeat to Italy.\nLast night Saka had already been England's saviour in Dusseldorf when they looked to be going out to Switzerland.\nAn 80th-minute equaliser, instead, rescued the quarter-final. And a stalemate in extra time was followed by penalties.\nSaka, with a place in the Euros semi-finals on the line, was in no doubt he would undertake perhaps the toughest task in football.\nPenalties are hard enough for fans to watch. Just imagine the pressure on the players running up and shooting from 12 yards in the intensity of an atmosphere like here in Dusseldorf.\nWhen Saka's moment came, it was only Switzerland goalkeeper Yann Sommer in his sights. No memories of Wembley in 2021.\n\"I'm not going to be focusing on the past. That's done. I can only focus on now,\" the 22-year-old said.\n\"And taking the penalty, of course, I know there's a lot of nervous people watching, my family included in the crowd. But, I kept my cool and I scored.\"\nBe the first to get Breaking News\nInstall the Sky News app for free\nHelping to win the 5-3 shootout and the only gift Gareth Southgate wanted to mark 100 matches in charge.\n\"He's a special boy - he's a dream to work with,\" the England manager said. \"Wonderful family. And of course, you're pleased for everybody, but him especially when his went in.\n\"Yeah, that takes courage, but we have belief in him. We had belief in him previously. He's now got a lot more experience of those pressure moments. And his all-round performance - exceptional.\"\nAll five penalties were successfully taken with Cole Palmer, Jude Bellingham, Ivan Toney and Trent Alexander-Arnold also getting one past Sommer.\n\"We have some of the best takers in the Premier League and in the world,\" Saka said.\n\"So, we've talked about it before. If it did come to penalties we would be pretty confident. And yeah, I'm happy we showed that today. We scored five out of five and we're through to the next round.\"\nSancho, who did not make this England squad, wrote on Instagram above a photo of Saka with his player of the match trophy: \"I'm so proud of this guy... you did it for me and Marcus brother!\"\nThere was also admiration from anti-discrimination activists after a shootout that saw all the England penalties scored by players with Black heritage.\nKick It Out posted online to Sake: \"The starboy whose strength of character and brilliance on the pitch continues to inspire us all.\"\nThere will be no underestimating the Netherlands on Wednesday night in Dortmund.\nRead more from Sky News:\nPrince William's project to be focus of new documentary\nPM to visit all four nations of UK\nAndy Murray's Wimbledon career over\nBut a third semi-final in four tournaments under Southgate has Saka dreaming.\n\"There's two more games until we can change our lives and make some history that's never been made before,\" Saka said.\n\"We're really focused on that.\"\nEngland have never won silverware overseas - both the men's and women's teams only winning their titles at Wembley.\nFor the Three Lions, it is the Lionesses at Euro 2022 they seek to emulate to lift a first trophy since the 1966 World Cup.\nAnd it is Saka's name in the reworking of ABBA's Voulez-Vous that has been the soundtrack of this Euros journey for fans long planning their trips to the final: \"Saka, hear the England sing. Saka, we're all going to Berlin!\"",
  "word_count": 712,
  "scraped_at": "2026-02-14T13:05:11.598335"
}