{
  "article_id": "6e2377e88f39",
  "url": "https://www.palatinate.org.uk/floodlit-finals-who-will-prevail/",
  "title": "Floodlit finals : who will prevail ? ",
  "date": "20230313T141500Z",
  "domain": "palatinate.org.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Floodlit finals: who will prevail?\nBy Sanjay Suri\nNext Wednesday represents one of the most anticipated days of the year for college sport in Durham: the football Floodlit Cup finals. Both the men’s and the women’s matches will take place at Maiden Castle, as well as being streamed live on PalTV.\nIn the men’s final, Collingwood, aiming for their third successive Floodlit win, take on South, who have reached the final in only their second ever entry into the tournament. They did not even exist as a college the last time Collingwood lost a Floodlit tie. It is a true David vs Goliath story, yet South are far from underdogs in this bout.\nIn the women’s match, Collingwood once again feature, but here they will be taking on postgraduate college Ustinov. Ustinov are featuring in their first ever final, whereas Collingwood are in their first since the Covid-19 pandemic. These two teams have battled at the top of the league, with Collingwood just winning out, adding to the pre-match hype.\nResilience or dominance?\nBoth Collingwood and Ustinov received byes in the first round and have shown impressive form throughout. Collingwood have had to show resilience to edge past Van Mildert and Josephine Butler, requiring penalties against the former, and securing a tight 2-0 win against the latter, who knocked them out at the same stage last year. Ustinov have showcased dominance throughout the tournament, breezing to the final.\nIf Collingwood are to win this final, midfielder Ciara Byrne will surely play a large part. Her distribution and defensive prowess have made her one of the star players of the tournament so far and has been pivotal in both of Collingwood’s victories so far.\nUp top, Rachel Young will hope to maintain the form that she has had so far this year. She is undoubtably a very well-rounded player, who has a lethal finish as well as being able to provide key passes to her teammates to set them up for chances and goals. Her composure will be key and, should the match go to penalties, her experience of scoring the winning spot-kick could be the turning point.\nUstinov, on the other hand, have dominated their opponents, putting five past the joint Trevelyan and South team, and four against Castle in the semis. They are also yet to concede a goal. This defensive security surely points to a tight match where chances for the attackers will come at a premium.\nHowever, they cannot afford to be complacent. Collingwood will be by far their toughest test and will punish any errors, however minor. Their league performance indicates that they are strong at the back and going forward. Do they risk pushing players forward, when the Collingwood counterattack is so potent?\nWhen these two met in the league last month, it was Collingwood who got the win — a win that turned the title race in their favour. However, league form rarely carries over to a cup match. Although Collingwood will have the psychological edge, Ustinov are mature enough to not let that get to them.\nThis match is very much a battle between a team who have swatted aside every opponent they have faced with ease and a team who have had to fight tooth-and-nail for every victory. Does adversity make you stronger, or is it better to be the dominant force in the tournament? We will only know the answer at the full-time whistle.\nDavid vs Goliath\nThose who are more casual college football fans would take one look at this fixture and immediately assume that it will be yet another Collingwood walkover. By far the most successful college in terms of sport, Collingwood tend to be favourites in every competition they enter.\nHowever, if you take a look at the form book, one might assume that South have the slight edge. Having dispatched Ustinov, Castle, Stephenson and Trevelyan en route to the final, the Owls certainly have momentum. They have looked like the better team in each of those fixtures and tight scorelines, including the penalty shoot-out win over Trevs in the semi-final, can be misleading.\nCollingwood, on the other hand, have not been the swashbuckling superpower of years gone by. What was expected to be a routine match against Josephine Butler in the first round turned into a nail-biting 1-0 win due to an early red card. They needed penalties to get past Van Mildert, a common theme when these two meet in Floodlit, and their 4-3 win against St John’s in the semis could have been very different, had John’s scored their late penalty.\nFor Collingwood, players such as Jack Camarda, Matt Keogh, Freddie Merrett, Rob White and Tom Hizzett have all starred for DUAFC M1s this season and, despite missing the semi finals due to a fixture clash, should be available for the final. This could explain why they struggled so much against a John’s team who were enjoying a fairytale run in the cup.\nSouth, meanwhile, can call upon the services of Reuben Bull, Morgan Lant, Jack Gibbons and Yuta Osawa. Gibbons and Osawa especially were instrumental in their win against Trevs last week, providing vital support in attack and defence respectively. Collingwood will need to manage Gibbons carefully. Mark him too aggressively, and you will give up space to other players who are perfectly capable of taking advantage. If you sit back, he will try and take you on and will be a thorn in your side.\nBoth sides have earned their place in this final. They have had tight wins, gritty wins and chaotic wins throughout the tournament, and wins like those shape champions. It would be a surprise to see one of these teams run away with the match and penalties is very much on the cards.\nOne mistake, or one world-class moment could swing this match. For Collingwood, they would love to add to their legacy, especially after what has been a difficult league campaign where none of their four premiership teams have mounted a title challenge. For South, it would represent a huge underdog story in their college’s infancy, and really put the college on the map.\nThis fixture is really on a knife-edge, and impossible to call. It is certainly not one to miss.\nImage: Joe Harston",
  "word_count": 1047,
  "scraped_at": "2026-02-14T12:45:12.775469"
}