{
  "article_id": "6e59a10faf61",
  "url": "https://www.counterpunch.org/2023/01/27/kill-capitalism-before-it-kills-us/",
  "title": "Kill Capitalism Before It Kills Us",
  "date": "20230127T091500Z",
  "domain": "counterpunch.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "“It seems to be easier for us today to imagine the thoroughgoing deterioration of the earth and then of nature than the breakdown of late capitalism”\n– Fredric Jameson, The Seeds of Time, 1994\nWhat kind of culture is it which pushes distraction, in its ordinary selection even of news, to the point where there is hardly any sustained discussion of the central and interlocking issues of human survival?\n– Raymond Williams, The Year 2000, 1983\nRadicals seek to go to the root of current problems, taking on the main currents beneath the melting ice brought to us by capitalist “modernity.” Liberals and progressives prefer to skate around on the liquifying surface.\nTake the (just-suggested) topic of climate change, arguably the biggest issue of our or any time (there’s no democracy, common good, equality and social justice on a dead planet).\nTurning the Planet into a Giant Greenhouse Gas Chamber\nA recent episode of the archetypal progressive media outlet Democracy Now (DN) was dedicated to arguing the obviously accurate fact that recent extreme and lethal weather — more frequent and extreme storms, rainfalls, floods, snowfalls, heat, drought — are the result of anthropogenic (human-caused) climate change and most especially from the excessive burning of fossil fuels (coal, oil, and gas). Reflecting on recent deadly flooding in California, a UCLA climate scientist explained to DN what has long been well known in his field:\n“All weather events {today} are evolving in the context of a changed climate… The question is, really, to what extent is climate change influencing certain kinds of events, not really whether it is in the first place….in this case, we know that the primary link between climate change and extreme precipitation events is through a fairly basic fundamental principle of atmospheric thermodynamics. That sounds complicated, but it just comes down to the fact that the atmosphere has a much higher capacity to hold water vapor when it’s warmer. In fact, the increase in the water vapor-holding capacity of the atmosphere is exponential, even for a linear or an incremental warming.”\nClimate warming is clearly behind the recent record-setting winter heat-wave in Europe, the rising heat that has sparked drought and rampant wildfires in the US-American West, and numerous other forms and symptoms of extreme weather at home and abroad. It is also behind the deep freeze “polar vortexes” that have chilled much of the US has experienced in recent years. These are a result of the meandering northern jet streams produced by the accelerated warming of the Arctic that has resulted from “modern civilization’s” massive carbon emissions. As the Buffalo meteorologist Don Paul explained to the “P”BS NewsHour three days after last Christmas, reflecting on an epic winter storm that had killed 38 people in his city by the time he spoke:\n“The Arctic, which is warming two to three times faster than the rest of the globe, by warming up has caused the polar jet stream episodically to weaken. A strong polar vortex keeps most of the polar air bottled up over the polar region. But when that polar jet weakens, it can allow episodic stretching of the polar vortex far to the south, generally east of the Rockies. And this can happen in the midst of an otherwise milder-than-average winter. It sounds counterintuitive, especially to nonscientist denialists, but we can see some of the most extreme winter weather events for short periods. And, as you may have heard by now, we’re going to — most of the eastern two-thirds of the country are going to go back to well-above-average temperatures over the next three or four days into next week. A lot of the snow will melt, but it’s not going to erase the tragedy…. these episodes not only will be happening more often, but they already have been happening more often than prior to the accelerated warming… we have also seen some tropical events that appear to be related to the change in the jet stream.”\nExtreme weather is coming harder and faster than the climate scientists originally thought, suggesting rather forcefully that the climate catastrophe – “crisis” doesn’t do the problem justice – is already underway. It’s not just something for “our grandchildren” to deal with. Consider some crucial findings. And it’s going to get worse in the coming years. According to Nature:\n“Arctic permafrost stores nearly 1,700 billion metric tons of frozen and thawing carbon. Anthropogenic warming threatens to release an unknown quantity of this carbon into the atmosphere.… Carbon dioxide emissions are proportionally larger than other greenhouse gas emissions in the Arctic, but expansion of anoxic conditions within thawed permafrost and soils stands to increase the proportion of future methane emissions. Increasingly frequent wildfires in the Arctic will also lead to a notable but unpredictable carbon flux.”\nIt is terrible to learn, that, as DN reports, citing research by Media Matters, “national TV news is largely ignoring the link between climate change and the deluge devastating California. [Media Matters] looked at 60 segments that aired on national TV news networks between December 31st and January 4th. Only one mentioned climate change.”\nThat’s awful, but typical of the dominant US media, which is dedicated by its very capitalist and commercial nature to pre-emptively cancel deep critical thinking on the origins and nature of the many tragedies produced by racist, sexist, and eco-cidal capitalism-imperialism. (When’s the last time you heard a nightly news anchor link the inner-city violence that typically leads US city’s local six and ten o’clock news broadcasts to the savage race-class segregation that characterizes imperial America? When’s the last time you heard a national news anchor connect the southern border migrant crisis to US imperialist policy in Latin America or indeed to US-led climate change.)\nBut let’s go deeper on the climate. Extreme weather is just the tip of the cataclysmic. iceberg. The number of people directly killed in and by floods, tornados, bomb cyclones, wildfires, hurricanes, derechos, and the like is nothing compared to the millions upon millions — nay, billions — who will perish from famine, water-shortage, heat stress, war, economic collapse, disease, and “civilizational collapse” resulting from and intimately related to “humanity’s” carbon-emitting charge past ecological tipping points. Human extinction is a real possibility in some serious scientific scenarios.\n“Today, at just 1.2 degrees [Celsius],” David Wallace-Wells wrote last October:\n“The planet is already warmer than it has been in the entire history of human civilization, already beyond the range of temperatures that gave rise to everything we have ever known as a species. Passing 1.5 and then two degrees of warming will plot a course through a truly foreign climate, bringing a level of environmental disruption that scientists have called ‘dangerous’ when they are being restrained. Island nations of the world have called it ‘genocide,’ and African diplomats have called it ‘certain death.’ It is that level that the world’s scientists had in mind when they warned, in the latest I.P.C.C. report, published in February, that ‘any further delay in concerted global action will miss a brief and rapidly closing window to secure a livable future’”.\nIt is already well understood by climate scientists that Earth will pass the long-dreaded dreaded 1.5 Celsius benchmark in this century, likely falling closer to 3 degrees. This is a gruesome experiment that has never been run: “civilization” is turning the entire planet into a giant Greenhouse Gas Chamber, a crime that would have horrified Adolph Hitler.\nWelcome to the Capitalocene: Nobody Gets Out Alive\nWhat’s the cause? What is the solution?\nYou may have noticed something in what I wrote above – I put the word “humanity” in quote-marks while typing the words “ ‘humanity’s’ carbon-emitting charge past ecological tipping points.” (I also just put quote marks around the word “civilization.”)\nIs it really humanity that has created the climate catastrophe? Is it really “anthropogenic climate change?”\nThe eco-Marxist world systems geographer/sociologist/historian Jason W. Moore rightly prefers to put the focus on capital and, more to the point, capitalism. Moore explains on why he prefers the term “Capitalocene” over “Anthropocene” when it comes to naming the era in which human activities have altered Earth systems in ways that pose dire challenges to livable ecology: “It was not humanity as a whole that created large-scale industry and the massive textile factories of Manchester in the 19th century or Detroit in the last century or Shenzhen today. It was capital.”\nIt’s an important point. It is not all homo sapiens that has warmed and otherwise polluted the planet to the point where a “livable future” (Welles) is at severe risk. It is not all of humanity but rather executives at Exxon Mobil who suppressed their own firm’s earth scientists’ findings on how the burning of fossil fuels would warm the planet. It is not homo-sapiens as such but rather Fossil Capital and its political allies who have conducted a deadly anti-scientific propaganda campaign to obfuscate the findings, projections, and increasingly dire warnings of respectable climate science.\nIf you must blame “humanity,” than at least say “humanity under the command of capital.” Or humanity subjected to the inhumanity of capital.\nBut let’s go deeper. What drives capital to destroy the planet is not some inner demonic pathology on the part of individual capitalists and managers but rather the underlying dynamics of the profits system. It’s not just capital or capitalists that have caused this mess. It is capitalism, with its endless pursuit of surplus value and “cheap nature” – chiefly cheap raw materials, cheap energy sources, and cheap labor power – to buoy up its holy rate of profit.\nCompetition between capitals compels investors to constantly seek new profitable markets, raw materials, energy sources, labor power, transport routes, political environments, and technologies in every corner of the world. Livable ecology be damned: gas and oil must be extracted; forests must be razed; pipelines must be built; labor supplies must be tapped; new forms of built-in-obsolescence must be designed; lakes and rivers must be poisoned; barriers between humans and zoonotic viruses must be collapsed; sustainable local agriculture must be trumped by mass chemical farming to feed animals for slaughter; fertile soil must be raped to make way for carbon-spewing trucks, cars, and airports and soulless real estate developments; Indigenous people must be removed and defeated to carry out toxic mining and drilling operations; politicians must be bought to prevent government interference with the endless commodification of the planet and its species (people included); melting Arctic ice must be seen as an opportunity for new shipping lanes instead of an existential warning to cease and desist from the relentlless capitalist war on “a livable future.”\nThe anarchy of capital in the material base undermines any effort by the political and state superstructure to impose adequate decent environmental rules. The state and its regulatory agencies and the overall politico-ideological and media culture are captured by profit-mad capitalists whose superior wealth translates into superior political and (anti-)intellectual power. The needs and demands of workers and the broader populace subjected to class rule and exploitation compel constant quantitative expansion – “growth” – for capital and its political operatives to provide the “solution” to structural unemployment and poverty (both of which are built into the capitalist system). Growth, the holy expansion of GDP, is capitalism’s timeworn deadly answer to mass complaints over the economic insecurity that is built into its chaotic system. Politicians take up the cry, citing statistics and the pursuit of quantitative expansion — job growth, income growth, stock market growth — as the basis for their legitimacy and power even as poisoned quantity leads to the qualitative degradation of air, water, and soil and the Earth’s rising self-protective determination to burn the human race off its face.\nThere is also the anarchy and conflict of competing nations. The disorderly multiplicity of nation states in the world capitalist system as it has evolved for half a millennium militates against the establishment of the central political and regulatory authority required for humanity to overcome the planet-wide collapse of “a livable future.”\n“Accelerating the Race to the Abyss”\nWhen leading military powers atop that world state system come into violent conflict each other (as they recurrently and inevitably do), moreover, the prospects of common global action to stop “the thoroughgoing deterioration of earth and nature” (Jameson) are badly damaged. Perhaps some skilled researchers will calculate the carbon footprint of the current inter-imperialist US-Russia proxy war underway in Ukraine before Washington and Moscow solve the problem of global warming with planetary nuclear winter. The investigators will want to factor in how the conflict has accelerated the extraction and burning of fossil fuels outside Russia. As Noam Chomsky observed with his usual eloquent brilliance last fall:\n“The Ukraine war finds its natural place in [our] collective [eco-cidal] madness. One outcome of Putin’s criminal aggression and the consequent sanctions regime is to restrict the fossil fuel flow from Russia on which Europe relies, particularly the German-based system that is its economic powerhouse. Economic consequences for Europe are severe, though not for the U.S., which is largely immune; or for that matter for Russia, which at least for now is profiting handsomely from rising oil prices and has many eager customers outside of Europe. Europe is seeking alternative sources of oil and gas, a bonanza for the U.S. fossil fuel industry, rewarded with new markets and expansive drilling opportunities to enable it to destroy life on Earth more effectively. And the military industry could hardly be more ecstatic as the killing and destruction mount….One can think of other reasons to bring the horrors to a quick end, but the fate of organized human society is surely one. The Ukraine war has reversed the limited efforts to address the mounting crisis of environmental destruction. While it should have accelerated efforts to move rapidly towards sustainable energy, that was not the path chosen by the political leadership. Rather, the choice has been to accelerate the race to the abyss.”\n(The giant US capitalist global military Empire — with “roughly 750 military spread across 80 nations!” [so boasts the imperialist Soldiers’ Project] — certainly has the largest carbon footprint of any single institution on Earth. Under the direction of either of the nation’s two capitalist-imperialist parties, it may soon be setting new carbon emissions records in a deadly war over Taiwan with state-capitalist China, itself no carbon-spewing slouch despite its heavy investment in wind and solar.)\nThanks to how the war in Ukraine has deepened the dangers of both nuclear war and climate catastrophe, the Bulletin of Atomic Scientists has just moved its Doomsday Clock to 90 seconds to Midnight, its highest level in history.\nThen there’s the endless diversion and flight from historical-material reality provided by a corporate media that fascinates millions with the sex lives and consumption patterns of mediocre celebrities and that – yes, Amy Goodman – commonly reports an endless and accelerating number of extreme weather events without mentioning the climatological context for those events, much less the capitalist context behind the climate calamity. Many more USAers could tell you the name of Gisele Bundchen’s possible new boyfriend (personal trainer Joaquim Valente) than could tell you what a Greenhouse Gas is.\n“What kind of culture is it,” the Marxist cultural critic Raymond Williams asked forty years ago, “when some serious analysis (of environmental menace — PS) appears and is almost at once placed as another installment of ‘doom and gloom’? What kind of culture is it which pushes distraction, in its ordinary selection even of news, to the point where there is hardly any sustained discussion of the central and interlocking issues of human survival? There are times, in the depth of the current crisis, when the image materialises of a cluttered room in which somebody is trying to think while there is a fan dance going on in one corner and a military band blasting away in the other corner. It is not the ordinary enjoyments of life that are diverting serious concern, as at times, in a natural human rhythm, they must and should. It is a systematic cacophony which may indeed not be bright enough to know that it is jamming and drowning the important signals, but which is nevertheless, and so far successfully, doing just that” (Raymond Williams, The Year 2000 [New York: Pantheon, 1983], p. 18).\nWhat kind of culture does that? A capitalist culture.\nGreta’s Right: Revolution, Nothing Less\nDavid Wallace Wells’ October 2022 New York Times essay, “Beyond Catastrophe,” is surprisingly and excessively impressed by the prospects for “decarbonization” short of eco-socialist revolution in this century? Is he right to suggest that environmental catastrophe can be avoided under capitalism, as numerous other progressive thinkers seems to think? No. We’d do better to take counsel from the 19-year old climate justice icon Greta Thunberg, who recently told an audience in London that climate activists and others must overthrow “the whole capitalist system.”\nShe’s right. That system is far too deeply invested in fossil fuels to give them up before final tipping points are breached (and there are more than enough such fuels still in the ground for capitalism to extract and burn to the point of no return). It is far too anarchic, competitive, exploitation-based, authoritarian, plutocratic, and decentralized, and too attached to nation states, imperialism, and war to be seriously reigned-in by environmental considerations.\nI’m not sure Ms. Thunberg has worked all of this out yet but she’s on the right track: it really does come down to the title of the U.S. Revolutionary Communist Party’s (RCP) weekly YouTube television show: “Revolution Nothing Less.”\nThe leading left intellectual Chomsky has recently been suggesting that the main problem is “savage capitalism,” not capitalism as such. My guess is that he knows better than this (he’s too smart not to) — that livable ecology is simply impossible under the class dictatorship of capital — but sees the prospect of eco-socialist transformation as so remote and the climate catastrophe as so urgent that we have no choice but to place our hopes in reversing climate destruction under the profits system.\nI get it but I don’t. The only thing crazier than calling for global socialist/eco-socialist people’s revolution now is not doing so. Many older, white, and male left-identified people I know reflexively roll their eyes in response to me when I voice this opinion. To them, “saying that we need a socialist revolution is required to save chances for a decent future is to say that we are doomed. That’s not going to happen.” This judgement typically comes my way without any disagreement over my diagnosis that capitalism is killing us – without any Wellsyian or Chomskyan pretense that the environmental crisis could maybe be solved under bourgeois rule. But, to paraphrase Gramsci, the pessimism of my despairing correspondents’ minds has gotten the better of the “optimism of their will (as recent mind and body research would predict, incidentally). They find it easier to imagine the end of life itself than to envision the end of capitalism. They find it more comfortable to surrender and fade away before capitalist eco-cide than to rise up with others against the system that cancels a livable environment – and they project this surrender on to younger and future generations cursed with trying to survive under the conditions imposed by the planet-poisoning bourgeois regime their predecessors failed to properly confront.\nEnough with the idiotic and self-fulfilling cynicism, nihilism, and hopelessness. Of course we can make a revolution. Or die trying. Because it’s not about the crystal ball, is it? Are the odds bad? Change them with human agency – yours and that of others with whom you join against a lethal system wired to destroy life on Earth. Make no mistake: capitalism isn’t done until it has made “a livable future” impossible. We have an existential duty to kill it before it kills humanity along with the giant mass of other species it has already wiped out.",
  "word_count": 3326,
  "scraped_at": "2026-02-14T13:43:58.863547"
}