{
  "article_id": "6e800dae05f3",
  "url": "https://www.nzherald.co.nz/nz/taurangas-events-calendar-set-to-boost-economy/WRQOOQHW5BFJZLJ3ZCAC5TUSII/",
  "title": "Tauranga events calendar set to boost economy",
  "date": "20230626T044500Z",
  "domain": "nzherald.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Zespri AIMS Games is set to be a record-breaker in 2023. Photo / Jamie Troughton / Dscribe Media Services\nTauranga stands to make millions of dollars from events in the second half of 2023 as the summer event calendar starts to take shape.\nRecord entries in a premier intermediate-aged sporting tournament, world squash championships and an arts festival returning to its full offering are part of the line-up setto boost the region’s economy.\nTourism and city leaders said events generated much-needed cashflow for local businesses and the city was ready to capitalise on “pent-up demand”.\nTauranga City Council venues and events manager Nelita Byrne said Tauranga said planning was well under way for the 2023/2024 summer season.\n“The events calendar is starting to take shape, with all signs pointing to a fantastic year of events in Tauranga.\nNathan said event organisers were able to plan larger events now the “tough” Covid-19 restrictions were behind them, which would “generate vibrancy and excitement throughout our community”.\nWhile the economy was tightening, people were still willing to spend money on travel and accommodation.\n“This bodes well for the rest of our regional economy because these visitors will utilise hospitality, retail and tourism products and services while they are here.”\nTauranga City Council commission chairwoman Anne Tolley said it was “fantastic” to see this year’s events calendar was “as busy as ever”.\n“We know events are a big contributor to community wellbeing, as well as driving our region’s economy by supporting employment and generating much-needed cashflow for a wide range of local businesses.”\nMore than 900 gymnasts from 15 provinces nationwide were expected in Tauranga for the 2023 New Zealand Gymnastics Championships at Mercury Baypark Arena next month.\nManager of Tauranga’s Impact Gymsport Academy Shar Matthews said she anticipated a surge of interest in the sport as a result of the championships.\nA spokeswoman for the event said while it did not have data on the exact economic benefits, at least 800 of the 900 athletes plus coaches, supporters and family coming from out of town would spend at least four nights in Tauranga. Each would spend money on meals and activities while in the city, she said.\nCome September, a record 11,733 competitors were expected to take part in the Zespri AIMS Games, with 373 schools registered for the week-long intermediate-aged sporting tournament.\nTournament director Kelly Schischka said last year’s tournament had “brought the buzz back” to Tauranga after a two-year hiatus. This year’s tournament would feature international competitors for the first time since 2019.\nThe 2023 tournament would include 31 badminton, tennis and rugby players from Saint Peter Chanel Community Primary School in Samoa, Gospel Primary in Fiji and players from the Cook Islands.\n“Our Pacific neighbours bring such amazing enthusiasm and appreciation to the tournament, as they - more than anyone - were affected by isolation and limited opportunities during Covid-19.”\nTauranga City Council said 23,775 athletes, supporters, officials and volunteers attended the 2022 games, with a little more than 20,000 visitors spending nearly $6.2 million in the city.\nSchischka said they were conscious of the rising cost of living, as well as the natural disasters many school communities had to deal with this year.\n“Given the sharp rise in athlete entries this year - up significantly from 2019 - and the increased costs many suppliers are having to pass on, we can only speculate it will again be a huge boost to the local business community in Tauranga.”\nTauranga Arts Festival general manager Nikki Hansen said 30,000 were expected to attend this year’s festival, which will run from October 19 - 29.\nHansen said about 80 per cent of this year’s attendees were local, with its local artists and out-of-town contractors alone taking up about 400 room nights during the festival.\n“We bring artists to Tauranga, all of whom stay in the CBD,” she said. “We see the economic benefits as significant as our community returns to the CBD and re-engages and experiences the arts.”\nArtistic director Shane Bosher said while it navigated Omicron last year by delivering its literary festival Escape, the 2023 arts festival was the first full programme it had presented since 2019.\n“We will be staging some out-of-the-box experiences, including an interactive work for families, which we are super-excited about.”\nThe 2023 World Squash Federation (WSF) Men’s World Team Championship was expected to pump more than $1.5 million into the city from December 11 - 17.\nThe biennial tournament would feature about 100 of the world’s best squash athletes, part of 25 four-man squads competing at Mercury Baypark Arena and the Devoy Squash & Fitness Centre.\nAn event spokesman said this year’s event marked a welcome return for the championship, which was returning to New Zealand for the first time since 1983.\nJoining New Zealand teams would be defending champions Egypt, Australia, England, Philippines, Brazil, Japan and the Netherlands.\nWorld number five Paul Coll said it was “pretty special” for New Zealand - and Tauranga - to host some of the world’s top players.\n“It is a tough week for me playing, but it makes for good viewing. Every country has a good number one, so there are no easy matches.”\nMeanwhile, the Bay Oval was transforming its cricket pitch into a football pitch as it prepared to host the Netherlands women’s football team ahead of the Fifa Women’s World Cup 2023 in July and August.\nTauranga City Council has been granted $240,000 from the Department of Internal Affairs’ Hine te Hiringa fund to celebrate and empower women alongside the world cup. The city was eligible to apply to the fund as a team base camp to host the team.\nBay Oval general manager Kelvin Jones said transforming the pitch was not something they had done before, and while the matches would be played outside of Tauranga, “it was nice to be part of it even in a small way”.\n“It is one of the biggest sporting events New Zealand will host this year.”\nSummer concerts and festivals planned from December to January typically brought in between $600,000 and $1m.\nAlso in the pipeline to pump up Tauranga’s coffers was the New Zealand Squash Championships 2023, which will bring 64 athletes from across the country to the Devoy Squash & Fitness Centre from June 30 to July 2.\nThe New Zealand Amateur Boxing Championships 2023 was planned for Tauranga Boys’ College from July 4 - 8, while the 2023 National B Grade Snooker Championships and New Zealand Snooker Championships 2023 were scheduled from August 21 - 26 at Mount Maunganui RSA.\nAbout 750 people were expected in town for the New Zealand National Bridge Congress from September 23 - 30, and about 7333 for HoopNation’s major basketball tournament The Classic in Tauranga from October 20 - 23.\nZoe Hunter is an assistant news director covering business and property news for the Bay of Plenty Times and Rotorua Daily Post. She also writes for NZME’s regional business publication Money. Zoe has worked for NZME since 2017.",
  "word_count": 1170,
  "scraped_at": "2026-02-14T12:29:38.038530"
}