{
  "article_id": "6ed19c7c0bb5",
  "url": "https://www.thenationalnews.com/news/mena/2025/07/27/uae-and-jordan-air-drop-aid-into-gaza/",
  "title": "UAE and Jordanian planes drop food and humanitarian aid into Gaza",
  "date": "20250727T194500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The UAE and Jordan carried out three air missions to drop humanitarian aid into the Gaza Strip, after Israel said it will begin a limited pause in fighting in three areas of the enclave and allow new aid corridors.\nThe UAE said it carried out the 54th humanitarian and relief air drop over the Gaza Strip on Sunday, its official news agency Wam said.\nIt added that the move comes as part of “the UAE's continuing efforts to support civilians in isolated areas of the Strip that are inaccessible by land.\nJordan earlier said it carried out three air drops on the Gaza Strip carrying humanitarian and food aid, one of which was with the UAE, Petra news agency said.\nThe missions involved C-130 aircraft from the UAE Air Force and the Royal Jordanian Air Force, carrying 25 tonnes of food and humanitarian supplies Petra added.\nThe Israeli military on Sunday initiated a limited pause in fighting in three populated areas of Gaza for 10 hours a day, part of a series of steps taken as concerns over surging hunger in the territory mount and as Israel faces a wave of international criticism over its conduct in the 21-month war.\nThe military said it would begin a daily “tactical pause” in Gaza city, Deir Al Balah and Al Mawasi, three areas of the territory with large populations, to “increase the scale of humanitarian aid” entering the territory.\nThe pause begins daily from 10am to 8pm local time until further notice, starting on Sunday July 27.\nIsrael has been facing growing international criticism, which the government rejects, over the humanitarian crisis in Gaza and indirect ceasefire talks in Doha between Israel and the Palestinian militant group Hamas have broken off with no deal in sight.\nDozens of Gazans have died of malnutrition in recent weeks, according to the Gaza Health Ministry in the Hamas-run enclave.\nThe ministry reported six new deaths over the past 24 hours due to malnutrition, bringing the total number of deaths from malnutrition and hunger to 133 including 87 children.\nOn Saturday, a five-month-old baby, Zainab Abu Haleeb, died of malnutrition at Nasser Hospital in Khan Younis, health workers said.\nThe Egyptian Red Crescent said it was sending more than 100 lorries carrying more than 1,200 metric tonnes of food to southern Gaza through the Karam Abu Salem crossing on Sunday.\nAid groups warned last week of mass hunger among Gaza's 2.3 million people and international alarm over the humanitarian situation has increased, driving French President Emmanuel Macron's decision to recognise a Palestinian state in September.\nA group of 25 states including Britain, France and Canada last week condemned the “drip feeding of aid” and said Israel's denial of essential humanitarian aid was unacceptable.\nIsrael, which cut off aid to Gaza from the start of March and reopened it with new restrictions in May, says it is committed to allowing in aid but must control it to prevent it from being diverted by militants.\nIt says it has let enough food into Gaza during the war and blames Hamas for the suffering of Gaza's people.\nIsrael and the US appeared on Friday to abandon ceasefire negotiations with Hamas, saying it had become clear that the militants did not want a deal.\nThe UN said it would use a new window of humanitarian pauses to reach as many starving people as possible in Gaza.\nUN emergency relief co-ordinator Tom Fletcher said on X he welcomed Israel’s announcement and that teams on the ground were prepared to move quickly.\n“In contact with our teams on the ground who will do all we can to reach as many starving people as we can in this window,” Mr Fletcher said.\nHe warned on Friday that conditions in the enclave were “already catastrophic” and worsening daily.\nHis office said UN teams were in a position to increase deliveries once permitted.\n“If Israel opens the crossings, lets fuel and equipment in, and allows humanitarian staff to operate safely, the UN will accelerate the delivery of food aid, health services, clean water and waste management, nutrition supplies, and shelter materials,” it said.",
  "word_count": 688,
  "scraped_at": "2026-02-14T12:43:56.265649"
}