{
  "article_id": "6ef0db3d5cf5",
  "url": "https://www.attitude.co.uk/news/brock-mcgillis-feature-469506/",
  "title": "Brock McGillis : The former hockey pro on a mission",
  "date": "20240711T181500Z",
  "domain": "attitude.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Brock McGillis: The former hockey pro making the sport more inclusive\nExclusive: Brock McGillis discusses coming out, homophobia, and how inclusive hockey is\nGrowing up in Northern Ontario, life for Brock McGillis was all about hockey. Likening it to football in the UK, he explains for Attitude, “It’s a way of life. It’s a part of our culture and our history.” Brock was obsessed. “I lived down the street from an arena and every day after school I’d go hoping I could go on the ice. On weekends, my parents would drop off all my meals at the arena, I just lived there. I loved it.”\nAt 6, Brock realised he was gay. It dawned on him as he sat and watched a movie with his parents. Watching a gay character on screen he commented, “What a fine guy.” His parents’ response was beautiful: “If you’re gay, you’re gay. You’re Brock, we love you.” However, the culture that Brock grew up in made him feel it was impossible to be a proud gay man and a pro hockey player. “I struggled a lot with hearing homophobic language daily. So, I suppressed it.”\nBrock jests he’s a good actor having kept up the facade as overwhelming as it was. The ice rink provided relief from the fire raging internally. He continues, “Once I left the locker room and I could be the goalie nothing else mattered. Everything went away, it was my way to not deal with who I was. But everything leading up to it, bus trips, locker rooms, or team dinners I hated because I sat there wishing I wasn’t alive. There were points where I couldn’t put on the character, and I know that people knew I wasn’t me. That was tough.”\n“I wasn’t sleeping, I was depressed, I was suicidal, and my career started to derail”\nA talented hockey player Brock played for the Windsor Spitfires and the Sault Ste. Marie Greyhounds in the Ontario Hockey League. He later played for the Kalamazoo Wings in the United Hockey League. Soon he was on the National Hockey League’s draft list. Throughout this, Brock assimilated into the group. “All the stereotypes of what a hockey player is, I took them to an extreme. I’m ashamed to admit this, but I was a womanizer. I walked into a room like I was a gift to the world. I would be walking through malls signing autographs. Everyone thought I had this cool life, but they didn’t realise I’d go home and cry. I hated myself. I wanted to die and on more than one occasion I tried to.\n“By the time I was 18, I started drinking heavily. From 18 to 23, I drank every single day, I had season-ending injuries every year. I wasn’t sleeping, I was depressed, I was suicidal, and my career started to derail. I was supposed to have this linear trajectory. By the time I was 23, I was still suppressing my sexuality and I sat myself down.” At the time he was playing for the Duindam Wolves in Europe. “I knew two things were going to happen. One, my career was going to end, it was already going sideways. And two, and most importantly, if I didn’t figure out who I was, I was going to end up dead. So, I came back to Toronto after that season and went on a date with a guy to figure it out.”\nBrock eventually came out publicly in 2016 via Yahoo Sports. He came out to his family around seven years before that. The inspiration there came from Brendan, the son of former Toronto Maple Leafs general manager and current Executive Director of the Professional Women’s Hockey League Players Association, Brian Burke. Brendan came out as gay publicly in 2009. “I reached out to Brendan, and we instantly became friends. When he came out publicly on television, I was watching a hockey game, and all of a sudden there’s somebody talking about being gay. And I’d never heard that before.”\nThe two young men formed a firm friendship speaking almost daily. For Brock, who hadn’t had anyone to talk to about this, it was a huge relief. “One day, he sent me a message and it said, ‘I can’t wait for the day that you’re out to your family like I am to mine.’ I ignored it.” Not because he thought his family wouldn’t be supportive, they had already proved they were. But with Brock’s family also being deeply involved in hockey, his dad then a junior hockey coach and his brother playing professionally, Brock was afraid of how their actions could impact him. If he came out to them, they would likely become more sensitive to the homophobic nature of hockey culture at the time and counter it, which could out Brock.\nReturning to Brendan’s text Brock then deals a devastating blow that hits me like a punch in the gut. “Those ended up being the last words he ever said to me. Two days later, he passed away in a car accident.” Brendan died on 5 February 2010. “I felt like I needed to honour him in some way,” says Brock. “I decided I was going to tell my family.”\nHaving retired from playing in 2010, Brock was training players in Sudbury, Ontario. Out to those closest to him, and now living with a partner, he lived in fear that were his secret revealed everyone would distance themselves from him. “For about 5 years I hid it, and I thought I was doing an incredible job.” Then one day a hockey mum called him. He estimates he worked with about 100 players, so calls from mums weren’t unusual.\n“All these hockey bros know I’m gay and choose to work with me. How cool is that?”\nHowever, “this one felt different.” The mum called because she wanted to set Brock up on a date. As he thought of an excuse he wondered what she thought his type was so asked for the woman’s name. “Steve” the mum responded much to Brock’s surprise. As panic set in the mum revealed that her 15-year-old son had told her and that everyone had known for a while. The panic grew. Brock employed other people. What would happen to them now if his coaching business dried up?\n“And then I thought about it. All these hockey bros know I’m gay and choose to work with me. How cool is that?” After that, he studied his players like a researcher might study the behaviour of wild animals. “Anytime they said something homophobic they’d freeze up and apologise. I’d shrug and we’d continue on,” he shares of his experiment. It seemed a change in the culture was happening before his very eyes.\nBut he also wondered – do the same players call people f**s when he’s not around? When a sprint coach covered a session for him the answer became evident. At the end of a two-hour workout, the coach got players to do 10 more 200-metre sprints. A young player reportedly said, “This is so gay.” He was admonished by an older player and ordered “Give me fifty pushups.” It turns out this was how players were holding themselves accountable. “Before I knew it, people I didn’t even know were doing push-ups,” says Brock. “One night another young player was on FaceTime with his girlfriend. His girlfriend says, ‘Let’s hang out tonight.’ He says, ‘I can’t I have practice,’ and she says, ‘That’s so gay.’ He says, ‘Give me 50 pushups or we’re breaking up.’ And they both dropped down and did 50 push-ups.”\nTectonic shifts were happening. Months later Brock’s businesses were blackballed by a leading hockey association without explanation. “My dad saw the president of the association one night and true to form asked, ‘Is it because Brock’s gay?’ The president denied knowing. But that hockey mom had just finished telling me months prior that people were finding out. It was suspicious timing. I guess the president went and called some coaches whose teams I was volunteering with. The next day I showed up to a rink for practice and the head coach of the team I’d been working with for about five years kicked me off his coaching staff. Two or three other teams did the same thing.”\nThe same summer, in 2016, the Pulse massacre happened. The next week a friend of Brock’s was due to host a charity event in Toronto. His friend told Brock he’d been told he was on a terrorist’s hit list. Still, both men decided to attend. “That Friday night, we got into an Uber and we looked at each other like we’re going to die tonight.” Security was amped up, with everyone frisked and scanners galore. Brock and his friend had a team of undercover security as well. Tensions were understandably high.\n“At one point I went to the bar, and I was watching people get frisked. I thought to myself, ‘Is this really happening?’ And then I got angry, and I started to wonder when is this going to change? But then I started questioning myself, when are you going to do something about it? The next day, I phoned a friend who’s a journalist and said I’m coming out.” Brock became the first out gay male professional hockey player.\n“I think it’s becoming more inclusive”\nBrock has become an outspoken advocate in the years since. In late 2023-early 2024, he visited 101 minor hockey teams (1,149 players) in 100 days to speak on inclusivity in sport on his ‘Culture Shift Tour‘. In an impact report from the tour, 95% of player participants in the sessions said the session made them think about the importance of welcoming others. Nearly 97% of coaches said the same. Similarly, 94% said it made them aware of the impact of words (93% for coaches). 89% said they’d be less likely to use offensive language after hearing from Brock.\n“It’s the best thing I’ve done in my life,” he says with a smile returning to his face. “It’s empowering. I received an e-mail when I was in Vancouver from a mom and one of her son’s friends came over I had just finished speaking to his team. He told the mother I may have changed his life. This is coming from a 15- or 16-year-old kid. That’s wild to me.”In Calgary, a player spoke to Brock about an incident from the weekend prior where other players had thrown his clothes in the shower and put offensive things on a mirror for him to see. While it was already being investigated Brock facilitated for the player to speak in front of the rest of the team.\n“It’s funny, they all talk about women, video games, and sports in locker rooms. My family knows more about me than that. So, in sessions I get people to share something they typically wouldn’t tell teammates they enjoy as a means of breaking down the conformity. Two of the players said that they bake in their free time. They heard I was coming back in and baked me cookies. So, not only were we able to help this one player, but these other players also completely broke the barriers of conformity in the culture and brought in cookies for the gay guy. There’s some impact there,” marvels Brock.\nIn a previous interview, Brock said he wouldn’t recommend queer youth play hockey because of the culture. Sadly, he still stands by that. “In men’s and boy’s hockey, yes. I still don’t think we’re there. In women’s, it’s far more inclusive but there are still issues with trans folks being able to play.”\nThe answer is to be more proactive. “If somebody says something, we’ll give them a penalty or a suspension. We could teach them about impact, and maybe they’ll evolve. I don’t think 95% of these people are bad people, maybe even 99%. They don’t know any better and they’re part of a culture that tells them this is the way you’re supposed to talk, act, dress, and walk. They all conform fully. Can you tell a football player if you’re walking into a shop in London?” I reply, “Sometimes.” Brock nods and continues, “I can tell a hockey player everywhere I go. I can speak at a corporation and tell you who used to play hockey. There’s so much conformity. They’re just a product of an environment and I wouldn’t want to expose queer youth to that environment just yet.”\nBut there is hope. “I think it’s becoming more inclusive,” Brock opines. “Teenagers today are basically adults. I think where the disconnect is that their language and behaviors don’t match their thoughts. In theory, they’re super inclusive but they’re still using language that doesn’t match their thoughts.” Referencing instances of players refusing to wear Pride jerseys Brock says it’s demonstrative of how the sport thinks it’s made more progress than it has. “I look back at the roots of Pride and it’s not what it is today. We still have a way to go. To have these celebratory nights and jerseys when we don’t have rights feels like we’re doing it backward. I don’t want faux inclusion. We have a long way to go.”",
  "word_count": 2215,
  "scraped_at": "2026-02-14T12:09:48.464369"
}