{
  "article_id": "6f43491e0b70",
  "url": "https://menafn.com/1108324027/Multichoice-Reports-Resilient-Performance-While-Expanding-Its-Platform",
  "title": "Multichoice Reports Resilient Performance While Expanding Its Platform",
  "date": "20240612T134500Z",
  "domain": "menafn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Multichoice Reports Resilient Performance While Expanding Its Platform\nMultiChoice Group ( ) demonstrated resilient operational performance for the year ended March 2024 (FY24), delivering a 26% trading profit margin in South Africa, while increasing trading profit in the Rest of Africa by 48%, despite very challenging macro-economic conditions. Clear strategic milestones were reached, with the group successfully launching Showmax 2.0, SuperSportBet and Moment, all of which are now revenue-generating and supporting the group's future growth prospects.\nDownload document:\n“Four years after setting out a clear strategy of building Africa's entertainment platform of choice and investing in services to support a broader ecosystem, our three core segments are now fully operational: video entertainment, interactive entertainment and fintech. Our focus now shifts to building on these solid foundations to drive growth in these new areas, and on further enhancing business efficiency across our operations.\nWhile we are not alone in feeling the challenges of a weak consumer environment, I am proud of the speed and effectiveness of the team in implementing strategic actions to retain customers, safeguard cash generation and drive costs savings which surpassed our targets. It is the strength of this team, the quality of the underlying business and the clarity of our strategy which underpins my confidence in delivering on our potential,” said Calvo Mawela, MultiChoice Group CEO.\nSome key points for the past financial year:\n-\nSubscriber base: Given the challenging consumer environment, overall active subscribers declined by 9%. This was mainly due to a 13% decline in the Rest of Africa business, with Nigeria, Angola and Zambia most affected, while the South African business was more resilient, declining by only 5%.\nGroup revenue: increased by 3% on an organic basis. However, due to weaker local currencies and consumer pressure, reported Group revenue declined by 5% to ZAR56.0bn. Subscription revenues: grew by 2% on an organic basis. However, on a reported basis, subscription revenues declined by 7% due to a weaker Naira. Group trading profit: increased 24% on an organic basis, despite the additional ZAR1.4bn investment in Showmax to drive future growth. After factoring in the ZAR4.5bn impact related to foreign exchange weakness, reported trading profit declined by 21% to ZAR7.9bn. Positive operating leverage: Given the positive impact of the lower expenditure (including ZAR1.9bn in cost savings and ZAR1.5bn in reduced decoder subsidies), the group achieved positive operating leverage of 4.3% (i.e. a 3.3% organic revenue increase against a 1% organic reduction in operating expenses). Adjusted core headline earnings: Higher realised hedging gains and benefits from a narrower gap between official and parallel Naira rate, was more than offset by the weaker trading profitability, resulting in adjusted core headline earnings (which now includes losses on cash remittances after tax and minorities) decreasing by 20% to ZAR1.3bn. Free cash flow: amounted to ZAR589m, impacted by lower profitability and the\nZAR1.7bn in Showmax platform payments. Retained cash and cash equivalents: ZAR7.3bn in cash (before short-term commitments) and access to ZAR4.1bn in undrawn borrowing facilities provides significant headroom and flexibility to fund opportunities.\nMultiChoice is by far the largest producer of original content on the African continent. In FY24, the group again produced over 6 500 hours of local content and its local content library now has more than 84,000 hours of content, a 12% increase YoY.\nThe highlight for the year was Shaka Ilembe, which launched on Mzansi Magic in June to become Africa's biggest TV series. Filmed entirely on location in South Africa, it was created through the skills and contributions of over 8 000 people. The premiere episode attracted over four million viewers and was the top-performing show with an audience share of over 45% in its time slot.\nOther content highlights of the year was Reyka (season 2), Devil's Peak and White Lies on linear (co-produced with Fremantle, Canal +, Abacus Distribution and BBC Studios-owned Lookout Point) and Spinners, Original Sin: My Son The Killer, and Catch Me a Killer, on streaming. Across Africa, the group launched 3 new proprietary channels - in Ethiopia (Maaddii Abol), Uganda (Pearl Magic Loko) and Mozambique (Maningue Magic Kool) while also producing content in Africa's 4th most spoken language, Oromo.\nSuperSport broadcast 34 490 live events during the year – arguably more live sport than any other broadcaster in the world. Highlights included the Rugby World Cup in France, the Cricket World Cup in India, a second\nSA20 season in South Africa, AFCON, FIFA Women's World Cup in New Zealand and Australia, as well as the Netball World Cup in Cape Town.\nSuperSport Schools more than doubled its registered user base during the year. The fast-growing platform displayed more than 49 000 hours of live programming across 43 different sports codes, covering 900 school sport festivals and events, featuring more than 1 100 schools, and over 14 500 teams.\nSEGMENTAL REVIEW\nSouth Africa Pay-TV (MultiChoice South Africa)\nDue to a strong focus on retention initiatives, the decline in active subscribers in South Africa was limited to 5%, despite the challenging environment. The base now stands at 7.6 million households.\nPower outages experienced on 275 days of the year further discouraged potential subscribers without backup power.\nAlthough the Premium bouquet is trending toward a stable base given the targeted retention efforts, the premium customer tier (which includes the Premium and Compact Plus bouquets) declined by 8%. The mid-market Compact base, which is most exposed to the macro-economic challenges, was down 9%, while the mass-market tier was 2% lower due to pressure in the Family base, the impact of loadshedding, and reduced decoder subsidies.\nA consequent 3% decline in subscription revenues and softer advertising income weighed on the segment's total revenues (-2% to ZAR33.6bn), but was partially offset by strong traction from new revenue streams, especially the insurance business (NMSIS) which reported a 35% increase in premium revenue to almost ZAR1bn. Several interventions to reduce costs enabled the SA business to achieve a trading margin of over 26%.\nRest of Africa Pay-TV (MultiChoice Africa)\nThe business in the Rest of Africa faced the toughest macro-economic conditions in its core markets with high, double-digit inflation and extreme depreciation of local currencies, (especially in Nigeria, Angola, Kenya and Zambia) which impacted USD revenues by 32%.\nThe active subscriber base declined to 8.1m, but effective retention efforts contributed to an improved subscriber mix.\nDue to the challenging market dynamics, the short-term focus of this business shifted from subscriber growth to safeguard profitability and cash flows. Several cost-saving initiatives were implemented, including scaling back significantly on decoder subsidies (-46% YoY or ZAR1.3bn), and reducing SG&A costs by ZAR500m. These interventions enabled the Rest of Africa business to increase trading profit by 48% YoY to ZAR1.3bn.\nSub-Saharan Africa SVOD (Showmax)\nFY24 was a pivotal year for Showmax as it relaunched across 44 markets in sub-Saharan Africa on Peacock's world-class platform, which is 4K/HDR and ATMOS ready. Almost 100% of the eligible customer base was migrated to the new Showmax platform, and 88% of those migrated had reactivated their accounts in the seven weeks to year-end.\nAlongside local content from M-Net, Mzansi Magic, Africa Magic and Maisha Magic, Showmax ramped up its local content, releasing 59 original movies and series in SA, Nigeria, Kenya and Ghana (FY23: 48). Popular shows that drove viewership included Tracking Thabo Bester, Koek, The Mommy Club, Youngins, Red Ink, Adulting, Outlaws and Real Housewives of Durban in South Africa, Cheta'm, Real Housewives of Lagos, Dead Serious, Wura and Flawsome in Nigeria, and Single Kiasi and Second Family in Kenya.\nShowmax revenues for the year grew by 22% (+22% organic) to ZAR1.0bn, while trading losses increased to ZAR2.6bn. These losses came in below the expected range of ZAR3-4.0bn. As noted before, due to the partnership agreement signed in 2023, 30% of Showmax's funding requirements is contributed by Comcast.\nTechnology (Irdeto)\nIrdeto's strong execution, enabled it to become the market leader in managed security services for video with a 22% market share. It also saw significant success in combatting piracy, taking down some 30 000 streaming piracy services during the year. Revenue increased by 17% (7% organic) driven by external customers across video entertainment, gaming and connected transport, with some additional uplift from a weaker ZAR against the USD. Disciplined cost management supported a 23% trading margin.\nIrdeto shipped its first keyless solutions to leading customers, including one of the largest fleet operators in the US market. This resulted in a revenue increase of 119% YoY in the connected transport division, with revenue from new services now representing a combined 35.7% of total revenues.\nSports betting and interactive entertainment (KingMakers)\nKingMakers reported strong growth in the online business in Nigeria, with monthly active users up 37% YoY and online gross gaming revenues up 26% YoY in constant currency. New products were also launched, including BetKing Casino and BetKing FootballGO, a virtual football sportsbook service.\nRevenue of USD147m was affected by the weak Naira, while the business reported a positive EBITDA of USD2m. At the end of its December year-end the business had a retained cash balance USD113m to fully fund its growth initiatives.\nKingMakers launched the SuperSportBet business in South Africa in January 2024. Its pre-game shows and live feed integration with SuperPicks, as well as the Playbook preview show were key drivers of uptake, further supported by SuperSportBet becoming the official betting partner of local soccer clubs, Kaizer Chiefs and Orlando Pirates.\nFin-tech (Moment)\nAfter being founded during FY23, Moment officially launched in FY24. The business played a vital role in the Showmax relaunch stepping up to fill a critical payments gap. In January this year, Moment also began processing MultiChoice's payments for DStv, reaching a milestone of processing USD85m in payments in early March 2024.\nTo-date, Moment has processed local and cross-border card payments in 44 Showmax markets and is already accounting for more than 20% of Group's payment volumes. It also joined real-time payment networks in 18 countries, including South Africa, and is currently piloting instant payment and account activation for DStv.\nThe business raised an additional USD22m of funding, with MultiChoice contributing USD8m. As a result, Moment is now valued at USD82m and MultiChoice owns a 26% stake.\nFUTURE PROSPECTS\nThe linear video-entertainment business remains the mainstay of the group's operations and provides a valuable base from which to expand its service offerings. The new streaming, interactive entertainment, fintech and connectivity services are having a positive impact on the business, and more importantly, on the lives of its customers. Going forward, the group will focus its efforts on scaling Showmax, Moment, SuperSportBet, as well as on driving growth in insurance (NMSIS), DStv Internet and DStv Stream.\nTo counter the challenges around an uncertain economic recovery globally and across the group's operating footprint, the group will continue to drive business efficiency and cost optimisation, with an increased cost savings target of ZAR2bn.\nNot only should this mitigate the ongoing impact of currency volatility and consumer weakness on performance, but together with the company's strategic plans to continue adapting its platforms to cater to customers' evolving needs, it positions the group well to prosper once currencies stabilize and economies rebound.\nDistributed by APO Group on behalf of MultiChoice Group. MultiChoice Group Contact Details:\nLitlhare Moteetee\nSenior Manager: Corporate Communications\n...\nMeloy Horn, Head of Investor Relations\nMobile: +27 82 772 7123\n...\nAbout MultiChoice Group:\nMultiChoice Group (MCG), listed on the Johannesburg Stock Exchange (JSE), is a leading provider of entertainment and related consumer services, with an expanding ecosystem, underpinned by scalable technologies, and a track record now spanning almost 40 years.\nMCG provides video entertainment products and services through its linear and streaming platforms to 23.5m households across 50 countries on the African continent and continues to grow by producing and acquiring the best local, sport and international content and offering tiered subscription packages and aggregated streaming services to its customer base. MCG's superior technology capabilities enables it to continue innovating around distribution, digital and payment solutions and content security to offer the best customer experience across the continent. Reaching up to 100 million individuals on a daily basis, the MultiChoice Group is using its scale and distribution to expand its platform to include sports betting and interactive entertainment, fin-tech services, household services (focused on internet connectivity and emergency response services) and ed-tech. Irdeto, MCG's technology business, provides platform cybersecurity services which protect over 6bn devices and applications globally for some of the world's best media and technology brands, as well as clients in the connected industries sector.\nMedia files --br- src=\"\" alt=\"MultiChoice Group\" style=\"max-width:500px;\"/>\nDownload logo\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 2140,
  "scraped_at": "2026-02-14T13:39:34.137465"
}