{
  "article_id": "6f551e548cf2",
  "url": "https://www.bleedingheartland.com/2024/08/25/top-ten-moments-from-the-2024-democratic-national-convention/",
  "title": "Top ten moments from the 2024 Democratic National Convention",
  "date": "20240825T134500Z",
  "domain": "bleedingheartland.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "I doubt either party has had a more successful convention in my lifetime than last week’s Democratic National Convention in Chicago.\nI envisioned finishing this post on Friday, but it was so hard to choose my favorite moments that I ended up watching many DNC speeches a second time. My two biggest takeaways:\nFor the first time in many years, the Democratic ticket has better bumper-sticker slogans than Republicans.\n- “Mind your own damn business.”\n- “We’re not going back.”\n- “Do something.”\n- “When we fight, we win.”\nAll of those slogans are calls to action, and they encompass a wide range of aspirations and concerns about a second Donald Trump presidency.\nSecond big takeaway: The Democratic Party has a deeper bench today than I can remember. So many great speeches didn’t make the cut. Honorable mentions include the remarks by U.S. Representatives Alexandria Ocasio-Cortez and Maxwell Frost, U.S. Senators Raphael Warnock and Cory Booker, Transportation Secretary Pete Buttigieg, Michigan Governor Gretchen Whitmer, and Michigan Attorney General Dana Nessel.\nI couldn’t have written this kind of piece after last month’s Republican National Convention in Milwaukee. As longtime GOP strategist Stuart Stevens and Democratic political commentator James Fallows both observed recently, the Trump takeover has produced an enormous talent gap between the two major parties. Republicans have chased away many with experience, skills, and crossover appeal, because only loyalty to Trump matters.\nAny top ten list is subjective. I was guided not only by speeches that moved me, but also by those that seemed most effective in accomplishing one or more of the Democratic National Convention’s main objectives: firing up the party base, introducing the ticket to a national audience, and appealing to swing voters.\n10. Ceremonial roll call\nIt pushed Tuesday night’s top speakers past prime time, and it wasn’t technically necessary, since DNC delegates had already nominated Harris for president in early August. But I loved the ceremonial roll call, a nice twist on a usually boring ritual.\nDJ Cassidy put a lot of thought into the playlist (you can find the full list of songs here). The spectacle was fun and conveyed the sense of joy so many Democrats have been feeling since President Joe Biden stepped aside as the candidate.\nVideo, for those who missed it:\n9. Adam Kinzinger\nI was impressed by all of the Republicans who spoke at the convention, including Mesa Mayor John Giles, former Trump press secretary Stephanie Grisham, and Olivia Troye, a former aide to Vice President Mike Pence. (It’s no surprise that Fox News “didn’t air a second of any of their speeches.”) Although I’m not part of their target audience, I feel a connection to these speakers, having been raised by a moderate Republican who would not feel at home in today’s GOP.\nFormer U.S. Representative Adam Kinzinger, who served on the House Select Committee on January 6, made the most of his mission “to defend truth, defend democracy and decency” during prime time on Thursday.\n“I want to let Republicans in on a secret,” Kinzinger said. “The Democrats are as patriotic as us. They love this country just as much as we do.” When the camera cut to crowd shots, the visuals of people chanting “USA!” while waving flags and holding “USA” signs were fantastic. What a contrast to the Republican convention, where delegates went wild for exclusionary messages, such as “MASS DEPORTATION NOW.”\nOne of the best passages:\nThe Republican Party is no longer conservative. It has switched its allegiance from the principles that gave it purpose to a man whose only purpose is himself. Donald Trump is a weak man pretending to be strong. He is a small man pretending to be big. He’s a faithless man pretending to be righteous. He’s a perpetrator who can’t stop playing the victim.\nTo appeal to the Reagan conservatives who still harbor negative feelings about Russia, Kinzinger highlighted how Trump is “weirdly obsessed with [Russian President Vladimir] Putin,” while his running mate, Senator JD Vance of Ohio, has said he doesn’t care what happens in Ukraine.\nKinzinger recalled his grandfather who served in World War II, risking his life behind enemy lines. “To preserve American democracy, his generation found the courage to face down armies. Listen, all we’re asked to do is to summon the courage to stand up to one weak man.”\nVideo, for those who missed it:\n8. Doug Emhoff\nPolitical spouses have one job at a Republican or Democratic National Convention: help voters see a candidate’s personal qualities. The “second gentleman” did that, and more.\nEmhoff began by greeting “my big, beautiful blended family,” and shared stories about how Harris has interacted with his children from his first marriage. (His ex-wife Kerstin Emhoff attended the DNC and helped produce a biographical video shown on Tuesday.) Most blended families aren’t that harmonious. Cole Emhoff even asked his stepmother to officiate at his wedding.\nThe obligatory “how we met” story was funny. After a client offered to fix him up with California’s attorney general, Emhoff left Harris a “rambling” voicemail at 8:30 am. (“I remember I was trying to grab the words out of the air and just put them back in my mouth.”) Harris saved the voicemail and makes him listen to it on every anniversary.\nWithout mentioning Trump by name, Emhoff alluded to the Republican nominee’s attacks on his wife. “You know that laugh. I love that laugh!” He told the audience Harris “stands up to bullies” and “never runs from a fight, and she knows the best way to deal with a coward is to take him head on. Because we all know cowards are weak, and Kamala Harris can smell weakness. She doesn’t tolerate any BS.”\nAs a Jew, I was struck by how relatable Emhoff was. He made a gentle joke about stereotypical Jewish mothers: “My mother is the only person in the whole world who thinks Kamala is the lucky one for marrying me.” He recalled taking the bus to Hebrew school in the New Jersey suburbs.\nHe said Harris has connected him more deeply to his faith, joining him at high holiday services (Rosh Hashanah and Yom Kippur). She “makes a mean brisket for Passover” that reminds him of his grandmother’s apartment in Brooklyn, with the plastic-covered couches. He mentioned that as vice president, his wife encouraged him to use his position to combat rising antisemitism across the U.S.\nJewish voters tend to prefer Democrats anyway, but this speech made clear to me that Emhoff could be a very effective surrogate with Jewish communities. Bringing the vote for Harris up from, say, 65 or 70 percent to nearly 80 percent could translate into thousands of votes in key states. Here are some Jewish population estimates from 2023:\n- Wisconsin (33,455)\n- North Carolina (48,935)\n- Nevada (79,800)\n- Michigan (119,905)\n- Arizona (123,750)\n- Georgia (141,020)\n- Pennsylvania (433,660)\nVideo, for those who missed it:\n7. The Milwaukee rally\nWhen I saw this event on the schedule, I was confused. Why would Democrats counter-program the second night of their own convention by holding a rally in Milwaukee at the same time?\nAs I watched on live television, I understood. As other commenters have noted, it was a show of force to sell out the same arena where Republicans held their convention. Minnesota Governor Tim Walz gave a solid stump speech, including one of his best lines: “Mind your own damn business.” Producers live-streamed the ceremonial roll call in Chicago into the Milwaukee venue, and then Harris addressed the crowd, live-streamed back to the DNC.\nOn Tuesday, Harris framed the election as a contest between the past and the future, using a different tone from her acceptance speech on Thursday. She got the crowd going with two other key slogans from this campaign: “We’re not going back,” and “When we fight, we win!”\nVideo, for those who missed it:\n6. Geoff Duncan\n“I am a Republican, but tonight I stand here as an American.”\nFew Americans outside Georgia would recognize that state’s former lieutenant governor. But after watching Duncan’s remarks several times, I am convinced Democratic groups should cut 30- or 60-second ads from this speech and run them in every swing state.\nIf you’re looking for “normal Republican,” this guy is straight from central casting. He nailed both the message and delivery. The crowd shots with “USA” signs and chants were a bonus.\nLike Kinzinger, Duncan was a rising star who might have had many years ahead of him in politics. He made a real sacrifice by standing up to Trump after the last presidential election. That’s when he saw Trump “was willing to lie, cheat, and steal to try to overturn the 2020 election. I realized Trump was a direct threat to democracy, and his actions disqualified him from ever, ever, ever stepping foot into the Oval Office again.”\nDuring the “lowest of lows,” armed officers guarded Duncan’s home, protecting his family from other Republicans, because Trump had targeted him.\nDuncan focused his remarks toward “the millions of Republicans and independents that are at home that are sick and tired of making excuses for Donald Trump.”\nIf Republicans are being intellectually honest with ourselves, our party is not civil or conservative. It’s chaotic and crazy, and the only thing left to do is dump Trump.\nThese days our party acts more like a cult. A cult worshiping a felonious thug.\nDuncan reassured fellow Republicans, “If you vote for Kamala Harris in 2024, you’re not a Democrat. You’re a patriot.” He finished strong: “To my fellow Republicans at home that want to pivot back towards policy, empathy and tone, you know the right thing to do. Now let’s have the courage to do it in November.”\nVideo, for those who missed it:\n5. Abortion storytellers\nEvery night, the Democratic National Convention featured some “ordinary people” on stage as well as political leaders. Those speeches were sometimes difficult to watch, especially on Thursday, when we heard Americans who have lost loved ones to gun violence.\nReproductive rights will be a central issue in the first presidential election after the U.S. Supreme Court’s Dobbs decision. On Monday night, the Democratic Party put a spotlight on Amanda and Josh Zurawski of Texas and Kaitlyn Joshua of Louisiana. They talked about the nightmare of experiencing pregnancy complications in a state with an abortion ban.\nHadley Duvall of Kentucky survived horrific sexual abuse from her stepfather, culminating in a positive pregnancy test at age 12. She appeared in a 2023 television commercial for Kentucky Governor Andy Beshear, which was one of the most powerful political ads I’ve ever seen. She also had the most memorable line from this segment:\nI can’t imagine not having a choice. But today, that’s the reality for many women and girls across the country, because of Donald Trump’s abortion bans.\nHe calls it a “beautiful thing.” What is so beautiful about a child having to carry her parent’s child?\nVideo, for those who missed it:\n4. Barack Obama\nAlthough it was late by the time he walked on stage, the 44th president kept the audience engaged. His speech had lighthearted moments: “I am feeling hopeful because this convention has always been pretty good to kids with funny names who believe in a country where anything is possible.”\nObama paid tribute to his own running mate, Joe Biden. He threw some devastating shade at Trump.\nHere’s a 78-year-old billionaire who has not stopped whining about his problems since he rode down his golden escalator nine years ago. It has been a constant stream of gripes and grievances that’s actually been getting worse now that he is afraid of losing to Kamala. There’s the childish nicknames, the crazy conspiracy theories, this weird obsession with crowd sizes.\nIncidentally, the joke about Trump’s “weird obsession with crowd sizes” was scripted, but Obama’s “leave-nothing-to-the-imagination hand gesture was a surprise,” even to his speechwriters.\nObama highlighted how Trump “killed a bipartisan immigration deal” because “he thought trying to actually solve the problem would hurt his campaign.” When the crowed erupted in boos, the former president brought out his well-known line: “Do not boo. Vote.”\nAfter dispensing with “a guy whose act has—let’s face it—gotten pretty stale,” Obama argued that “America’s ready for a new chapter” and a “better story” with Harris. He ticked off some of her professional accomplishments. He vouched for her plans on housing, health care, education, and better wages and working conditions.\nHis praise for Minnesota Governor Walz resonated.\nLet me tell you something. Let me tell you something. I love this guy. Tim is the kind of person who should be in politics: born in a small town, served his country, taught kids, coached football, took care of his neighbors. He knows who he is, and he knows what’s important. You can tell those flannel shirts he wears don’t come from some political consultant. They come from his closet, and they have been through some stuff. They have been through some stuff. That’s right.\nObama reminded the audience that this election “does not just matter to the people in this country. The rest of the world is watching to see if we can actually pull this off. No nation, no society has ever tried to build a democracy as big and as diverse as ours before.”\nWe shouldn’t be the world’s policeman and we can’t eradicate every cruelty and injustice in the world. But America can be and must be a force for good: discouraging conflict, fighting disease, promoting human rights, protecting the planet from climate change, defending freedom, brokering peace. That’s what Kamala Harris believes and so do most Americans.\nNear the end, Obama talked about his beloved mother-in-law, Marian Robinson, who recently passed away. She reminded him of his grandmother, who raised him. They came from very different backgrounds, but shared many values.\nWhether you are a Democrat or a Republican or somewhere in between, we have all had people like that in our lives. People like Kamala’s parents, who crossed oceans because they believed in the promise of America. People like Tim’s parents, who taught him about the importance of service.\nGood, hardworking people, who weren’t famous or powerful but who managed in countless ways to leave this country just a little bit better than they found it.\nAs much as any policy or program, I believe that’s what we yearn for: a return to an America where we work together and look out for each other.\nHe closed with a call to “each do our part over the next 77 days”: knock doors, make phone calls, talk to our friends, listen to our neighbors. If Democrats do that, we will elect Harris and Walz, and “elect leaders up and down the ballot who will fight for the hopeful, forward-looking America we all believe in. And together, we too will build a country that is more secure and more just, more equal, and more free. So let’s get to work.”\nVideo, for those who missed it:\n3. Kamala Harris\nBoston Globe columnist Michael A. Cohen posted immediately after Harris spoke on Thursday, “I wrote a book on campaign speeches and this speech was one of the best I’ve ever heard. An absolute tour de force.”\nHarris covered a lot of ground in a relatively concise way. According to C-SPAN, it was the third-shortest presidential nominee’s acceptance speech of the past 40 years—not even half as long as Donald Trump’s rambling, mind-numbing monologue at the RNC.\nHarris shared stories about her childhood and the “trusted circle” who helped her working mom, Shyamala Harris, raise her and her sister.\nI loved how she wove stories about her mother throughout the speech. “She taught us to never complain about injustice. But do something about it. Do something about it. That was my mother. And she taught us—and she also taught us, never do anything half-assed. And that is a direct quote.”\nHarris laid out an inclusive vision, “on behalf of every American, regardless of party, race, gender, or the language your grandmother speaks.” She offered a unifying message:\nWith this election, our nation has a precious, fleeting opportunity to move past the bitterness, cynicism, and divisive battles of the past. A chance to chart a new way forward. Not as members of any one party or faction, but as Americans.\nAnd let me say, I know there are people of various political views watching tonight. And I want you to know: I promise to be a president for all Americans. You can always trust me to put country above party and self.\nTo hold sacred America’s fundamental principles. From the rule of law. To free and fair elections. To the peaceful transfer of power.\nI will be a president who unites us around our highest aspirations. A president who leads. And listens. Who is realistic, practical, and has common sense. And always fights for the American people.\nHarris talked about her work as a prosecutor and California attorney general to represent the public interest. She then turned to her opponent. “In many ways, Donald Trump is an unserious man. But the consequences of putting Donald Trump back in the White House are extremely serious.”\nShe described “the chaos and calamity when he was in office,” and how he reacted after he lost the last election. If he returns to power, he has promised to set free the extremists who attacked the Capitol on January 6. He would jail journalists, political opponents, and “deploy our active-duty military against our own citizens.”\nConsider, consider the power he will have—especially after the United States Supreme Court just ruled that he would be immune from criminal prosecution.\nJust imagine Donald Trump with no guardrails. And how he would use the immense powers of the presidency of the United States. Not to improve your life. Not to strengthen our national security. But to serve the only client he has ever had: himself.\nTrump’s agenda for a second term is laid out in Project 2025, “written by his closest advisors. And its sum total is to pull our country back into the past. But America, we are not going back.”\nAs the crowd chanted “We are not going back,” Harris reminded the audience of Trump’s efforts to cut Social Security and Medicare and repeal the Affordable Care Act. She contrasted her “new way forward,” benefiting the middle class, with Trump’s policies that benefit the wealthy.\nShe then transitioned to how Trump’s U.S. Supreme Court appointees ended abortion rights. She promised to work to restore reproductive freedom, whereas Trump and his allies would ban abortion nationwide. “And get this, he plans to create a national anti-abortion coordinator, and force states to report on women’s miscarriages and abortions. Simply put, they are out of their minds.“\nHarris also spoke of “many other fundamental freedoms” at stake this year: “The freedom to live safe from gun violence—in our schools, communities, and places of worship. The freedom to love who you love openly and with pride. The freedom to breathe clean air, and drink clean water, and live free from the pollution that fuels the climate crisis. And the freedom that unlocks all the others. The freedom to vote.”\nTrump and other Republicans are campaigning against the Biden administration’s supposedly “open border.” Harris recalled how Trump killed the bipartisan border deal, and promised to sign it into law if elected president.\nHarris spoke of her foreign policy work and pledged that as commander-in-chief, “I will ensure America always has the strongest, most lethal fighting force in the world. I will fulfill our sacred obligation to care for our troops and their families. And I will always honor, and never disparage, their service and their sacrifice.”\nShe promised to “stand strong with Ukraine and our NATO allies,” and said she and President Biden are working to end the war in Gaza. On that front, Harris expressed support for both “Israel’s right to defend itself” and the Palestinian people’s “right to dignity, security, freedom, and self-determination.”\nHarris then attacked Trump for his approach to foreign affairs:\nI will not cozy up to tyrants and dictators like Kim-Jong-Un, who are rooting for Trump. Who are rooting for Trump. Because you know, they know he is easy to manipulate with flattery and favors. They know Trump won’t hold autocrats accountable, because he wants to be an autocrat himself.\nAnd as president, I will never waver in defense of America’s security and ideals. Because in the enduring struggle between democracy and tyranny, I know where I stand—and where the United States belongs.\nNear the end, Harris returned to a lesson she learned from her mother, and again drew a contrast between herself and the alternative:\nYou know, our opponents in this race are out there every day, denigrating America. Talking about how terrible everything is. Well, my mother had another lesson she used to teach: Never let anyone tell you who you are. You show them who you are.\nAmerica, let us show each other—and the world—who we are. And what we stand for: freedom, opportunity, compassion, dignity, fairness, and endless possibilities.\nVideo, for those who missed it:\n2. Tim Walz\nI kept changing my mind on whether to rank Harris or Walz second on this list. I gave the edge to the vice presidential nominee because he went into the DNC as a lesser-known quantity, yet managed to introduce himself, land solid punches on Republicans, and lay out a vision for the future in less than sixteen minutes.\nIf his speech had started during prime time, it would have been perfect.\nThe Minnesota governor is the ultimate “happy warrior,” and he began by thanking Harris, Biden, and everyone watching for their passion, determination, and “for bringing the joy to this fight.”\nHe talked about his childhood in a Nebraska town of 400 people, with a high school graduating class of 24. “Growing up in a small town like that, you learn how to take care of each other. That family down the road, they may not think like you do, they may not pray like you do, they may not love like you do—but they’re your neighbors, and you look out for them, and they look out for you.”\nHe enlisted in the National Guard at age 17, and two years later, his father died of lung cancer. “He left behind a mountain of medical debt. Thank God for Social Security survivor benefits. And thank God for the G.I. Bill that allowed my dad and me to go to college and millions of other Americans.”\nWalz described his work teaching social studies and coaching football at Mankato West High School. (A group of former players had previously come on stage in their jerseys.) He ran for Congress as “a 40-something high school teacher with little kids, zero political experience, and no money, running in a deep-red district. But you know what? Never underestimate a public school teacher. Never.”\nDuring twelve years in Congress, Walz said, “I learned how to work across the aisle on issues like growing the rural economies and taking care of veterans. And I learned how to compromise without compromising my values.”\nThen I came back to serve as governor, and we got right to work making a difference in our neighbors’ lives.\nWe cut taxes for the middle class. We passed paid family and medical leave. We invested in fighting crime and affordable housing. We cut the cost of prescription drugs and helped people escape the kind of medical debt that nearly sank my family. And we made sure that every kid in our state gets breakfast and lunch every day. So while other states were banning books from their schools, we were banishing hunger from ours.\nWalz repeated a riff that gets the crowd going at every rally: “We also protected reproductive freedom, because, in Minnesota, we respect our neighbors and the personal choices they make. And even if we wouldn’t make those same choices for ourselves, we’ve got a golden rule: Mind your own damn business.”\nHe recalled the years of “agony” and fertility treatments he and his wife endured to have their kids. (That produced the most viral moment of the convention: Walz’s son in tears, standing up, pointing, and shouting, “That’s my dad!”)\n“I’m letting you in on how we started a family,” the governor went on, “because this is a big part of what this election is about: Freedom.”\nWhen Republicans use the word “freedom,” they mean that the government should be free to invade your doctor’s office. Corporations—free to pollute your air and water. And banks—free to take advantage of customers.\nBut when we Democrats talk about freedom, we mean the freedom to make a better life for yourself and the people that you love. Freedom to make your own health care decisions. And yeah, your kids’ freedom to go to school without worrying about being shot dead in the hall.\nLook, I know guns. I’m a veteran. I’m a hunter. And I was a better shot than most Republicans in Congress, and I got the trophies to prove it. But I’m also a dad. I believe in the Second Amendment, but I also believe our first responsibility is to keep our kids safe.\nThat’s what this is all about: the responsibility we have to our kids, to each other, and to the future that we’re building together—in which everyone is free to build the kind of life they want.\nWalz then turned to the running mate’s traditional attack dog role. He dinged Trump and Vance for the plans in Project 2025.\nHere’s the thing: It’s an agenda nobody asked for. It’s an agenda that serves nobody except the richest and the most extreme amongst us. And it’s an agenda that does nothing for our neighbors in need.\nIs it weird? Absolutely. Absolutely. But it’s also wrong, and it’s dangerous.\nIt’s not just me saying so—it’s Trump’s own people. They were with him for four years. They’re warning us that the next four years will be much, much worse.\nWalz suggested that the student body presidents in his former high school could teach Trump a lot about being a leader. “So I don’t know about you, I’m ready to turn the page on these guys. So go ahead, say it with me: We’re not going back.” The crowd joined in.\nThen Walz outlined some of Harris’ accomplishments and some of her plans on taxes, prescription drugs, affordable housing, and people’s freedom to live their own lives.\nReturning to his football experience, Walz gave the crowd a “pep talk” to get this done for Harris: “Our job—our job for everyone watching—is to get in the trenches and do the blocking and tackling: one inch at a time. One yard at a time, one phone call at a time, one door knock at a time, one $5 donation at a time. Look, we got 76 days. That’s nothing. There’ll be time to sleep when you’re dead. We’re going to leave it on the field.”\nWalz finished by building up to a loud call and response:\nThat’s how we’ll keep moving forward. That’s how we’ll turn the page on Donald Trump. That’s how we’ll build a country where workers come first, health care and housing are human rights, and the government stays the hell out of your bedroom. That’s how we make America a place where no child is left hungry, where no community is left behind, where nobody gets told they don’t belong.\nThat’s how we’re going to fight, and as the next president of the United States always says, “When we fight—” (Crowd: We win!”) “When we fight—” (“We win!”) “When we fight?” (“We win!”)\nVideo, for those who missed it:\n1. Michelle Obama\nThe former first lady hasn’t given many political speeches lately, so I forgot how good she is at it. Everyone watching on Tuesday night knew this line was an instant classic: “Wait—I want to know. I want to know. Who’s gonna tell him that the job he’s currently seeking might just be one of those Black jobs?”\nBut there was so much more to her speech than that zinger.\nShe paid tribute to her mother, Marian Robinson, and the values her mother instilled in her. “Kamala Harris and I built our lives on those same foundational values. Even though our mothers grew up an ocean apart, they shared the same belief in the promise of this country. […] She’d often tell her daughter, ‘Don’t sit around and complain about things. Do something.'”\nObama vouched for the nominee: “Kamala Harris is more than ready for this moment. She is one of the most qualified people ever to seek the office of the presidency. And she is one of the most dignified—a tribute to her mother, to my mother, and to your mother too.”\nWhen I heard this passage, I thought Trump must be losing his mind.\nShe [Harris] understands that most of us will never be afforded the grace of failing forward. We will never benefit from the affirmative action of generational wealth.\nIf we bankrupt a business, or choke in a crisis, we don’t get a second, third, or fourth chance. If things don’t go our way, we don’t have the luxury of whining or cheating others to get further ahead—no!\nWe don’t get to change the rules so we always win. If we see a mountain in front of us, we don’t expect there to be an escalator waiting to take us to the top. No.\nWe put our heads down. We get to work. In America, we do something.\nAlluding to Trump’s “Make America Great Again” tagline, Obama said, “Of the two major candidates in this race, only Kamala Harris truly understands the unseen labor and unwavering commitment that has always made America great.”\nBut, she warned, “folks are going to do everything they can to distort her truth.” The Obamas know this firsthand: “For years, Donald Trump did everything in his power to try to make people fear us. See, his limited, narrow view of the world made him feel threatened by the existence of two hardworking, highly educated, successful people who happen to be Black.”\nThen she dropped the epic line about “Black jobs.”\nObama described Trump’s plans as “his same old con: doubling down on ugly, misogynistic, racist lies as a substitute for real ideas and solutions that will actually make people’s lives better.” Those ideas won’t improve anyone’s lives. “Instead, it only makes us small. And let me tell you this: going small is never the answer. Going small is the opposite of what we teach our kids. Going small is petty, it’s unhealthy, and quite frankly, it’s unpresidential.”\nDemocrats have been on a bit of a sugar high for the last month, and the former first lady cautioned that “no matter how good we feel tonight or tomorrow or the next day, this is going to be an uphill battle.”\nSo folks, we cannot be our own worst enemies. No. See, because the minute something goes wrong, the minute a lie takes hold, folks, we cannot start wringing our hands. We cannot get a Goldilocks complex about whether everything is just right. And we cannot indulge our anxieties about whether this country will elect someone like Kamala instead of doing everything we can to get someone like Kamala elected.\nHarris and Walz are not perfect, Obama said. They will make mistakes. “But luckily y’all, this is not just on them. No, uh-uh. This is up to us, all of us, to be the solution that we seek.”\nThen came the masterful call to action:\nIt’s up to us to remember what Kamala’s mother told her: Don’t just sit around and complain, do something!\nSo, if they lie about her—and they will—we’ve got to do something.\nIf we see a bad poll—and we will—we’ve got to put down that phone and do something.\nIf we start feeling tired, if we start feeling that dread creeping back in, we’ve got to pick ourselves up, throw water on our face, and what? (Crowd shouts: Do something!)\nCandidates and campaign staffers everywhere must have rejoiced when Obama told Democrats to take initiative, because we can’t afford for anyone to “sit on their hands and wait to be called.”\nDon’t complain if no one from the campaign has specifically reached out to you to ask you for your support. There is simply no time for that kind of foolishness. You know what you need to do!\nSo consider this to be your official ask: Michelle Obama is asking you—no, I’m telling y’all to do something. (Crowd chants “Do something! Do something!”)\nVideo, for those who missed it:\nFeel free to share your own favorite Democratic National Convention moments in the comments.\nTop photo of Vice President Kamala Harris and Minnesota Governor Tim Walz at an August 20 rally in Milwaukee was first published on the Harris campaign’s Facebook page.",
  "word_count": 5507,
  "scraped_at": "2026-02-14T13:15:11.703519"
}