{
  "article_id": "6f6635f538e8",
  "url": "https://www.prokerala.com/news/articles/a1565431.html",
  "title": "India all dressed up for title defence in SAFF U17 Championship",
  "date": "20240919T121500Z",
  "domain": "prokerala.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Thimpu : , Sep 19 (IANS) India will begin their SAFF U17 Championship title defence against Bangladesh in the first game of Group A at the Changlimithang Stadium in Thimphu, Bhutan on Friday.\nMaldives are the other side in the three-team Group A, against whom India will play on September 24. Group B consists of hosts Bhutan, Nepal, Sri Lanka and Pakistan. The top two teams from each group will progress to the semi-finals on September 28, followed by the final on September 30. India were the champions in 2022, which was the previous occasion the tournament was held for the U17 age group.\nLast year's edition was held for the U16 age group, and head coach Ishfaq Ahmed has retained 16 of the 23 from that squad which lifted the trophy at the very same Changlimithang Stadium, wreathed with traditional Bhutanese architecture and easily one of the most beautiful places to play football in the world.\nLike 12 months ago, India faced Bangladesh in the opening match, winning 1-0 thanks to Thoungamba Usham Singh's winner. The final was against Bangladesh again and India triumphed 2-0. Hence, the repeat of the 2023 final promises to be another close battle, with India aiming to maintain the upper hand over their eastern neighbours.\n\"We expect a tough match against Bangladesh. We're happy to face them. I want our players to be tested and we know that Bangladesh is not an easy team to play. But we are confident of making a positive start. Let's hope that everybody enjoys good football tomorrow,\" said Ishfaq Ahmed at the pre-tournament press conference.\nMidfielder Ngamgouhou Mate, who started all four matches in last year's tournament and captained India in the Indonesia tour last month, doesn't feel the pressure of being the defending champions. \"We're back here after a year. Tomorrow, against Bangladesh, we want to get going right off the bat. We're hoping for a positive result,\" said the 16-year-old.\nAhmed feels his players have matured a lot over the course of the year. From debuting on the international stage in 2023, now the Blue Colts are starting to take gradual steps to take their budding careers ahead. The focus is, of course, also on the upcoming AFC U17 Asian Cup Qualifiers in Thailand in October after the conclusion of the SAFF U17 Championship.\n\"Although some of our current players are completely new to international football since we made some additions to the squad, but after last year's SAFF, the Indonesia tour and with our time training together, I'd definitely say we have matured. They are more experienced as compared to last time,\" said Ahmed.\n\"After this, we have important Asian qualifiers coming up also and we want to succeed in both tournaments. We have prepared accordingly. SAFF comes first, so our focus is completely on that at the moment,\" he added.\nAt the helm of the Bangladesh team is head coach Saiful Bari Titu, who led his nation to the SAFF U19 and U16 Women's Championship title earlier this year (U19 jointly with India). Ahead of his first age-group tournament with the Bangladesh men's team, Titu said, \"These tournaments provide a good opportunity for young players to show their technical skills and it's always good to get that experience. We will try to show ourselves as a strong contender. We want to go step by step, first match first. Our focus is how to compete with India, who are the defending champions. We hope to put on a show and get points tomorrow.\"",
  "word_count": 588,
  "scraped_at": "2026-02-14T12:33:16.208545"
}