{
  "article_id": "6f74c1b55f94",
  "url": "https://awfulannouncing.com/espn/alex-morgan-ai-generated-recap-mention.html",
  "title": "ESPN AI recap of Alex Morgan final pro match fails to mention her",
  "date": "20240909T073000Z",
  "domain": "awfulannouncing.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Update: ESPN updated its recap of the match to include a mention of Alex Morgan at 8:59 a.m. ET on Monday, Sept. 9.\nOriginal: U.S. soccer legend Alex Morgan played her final professional match on Sunday, a 4-1 loss by her San Diego Wave to the North Carolina Courage.\nThe match, which was simulcast across various networks and streaming services, included a beautiful moment in which Morgan removed her cleats at midfield and tearfully waved to a Snapdragon Stadium crowd that chanted her name while players surrounded and applauded her. After the match, in which she played 15 minutes and took a penalty kick, she thanked the crowd for their support and said goodbye.\nYou’d never know any of that from the post-match report by ESPN Generative AI Services, which began providing recaps of National Women’s Soccer League (NWSL) and the Premier Lacrosse League (PLL) games this week.\nThe recap, which was posted to ESPN’s website and apps at 8:52 pm ET, provides a standard rundown of the outcome before going into who scored goals and how the action played out. Nowhere in the 215-word recap is Morgan mentioned, let alone the fact that this was the two-time World Cup winner and Olympic gold medalist’s final pro match.\nNo mention of Alex Morgan at all in ESPN’s AI-generated recap of the final game of her professional career.\nThe article did provide analysis on the performance of her teammate Kennedy Wesley, noting that she contributed “defensively as well as on offense” in Sunday’s game. pic.twitter.com/bKpuGmfaSK\n— Sports TV News & Updates (@TVSportsUpdates) September 9, 2024\nThe recap did note that “[San Diego’s Kennedy] Wesley was the standout player, contributing defensively as well as on offense.”\nIn their announcement of the service, ESPN made a point to note that “each AI-generated recap will be reviewed by a human editor to ensure quality and accuracy.” It’s unclear if the human editor failed to notice Morgan’s absence or also decided it was not worth mentioning.\nYou could certainly make the case that everything in the recap is accurate from a factual perspective. However, the fact that it doesn’t include any information about Morgan and how important this night was for her, the NWSL, and U.S. women’s soccer speaks to how these kinds of services can’t replicate human writers who can see an event from a 360-degree perspective.\nESPN did post a separate article on their outlets from writer Jeff Kassouf that is all about Morgan and the emotional night. However, that article is located on the side menu of the AI-generated recap and is easy to miss.\nESPN says that the “AI-generated recaps aim to enhance coverage of under-served sports, providing fans with content that was previously unavailable.”\nThat begs the question. If you’re going to provide fans of underserved sports with poorly written recaps that don’t tell the full story, what value are you really providing them?",
  "word_count": 484,
  "scraped_at": "2026-02-14T12:24:02.332884"
}