{
  "article_id": "6fc4bec1a937",
  "url": "https://www.thenational.scot/news/24812328.ian-murray-urged-back-campaign-free-to-air-scotland-games/",
  "title": "Ian Murray urged to back campaign for free - to - air Scotland games",
  "date": "20241222T091500Z",
  "domain": "thenational.scot",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE Greens have urged the Scottish Secretary to “give Scotland the gift of football” this Christmas and back the party’s campaign to have national games on free-to-view TV.\nGillian Mackay has written to Ian Murray urging him to meet with campaigners, broadcasters and the Scottish Football Association to make it happen.\nThe Central Scotland MSP called for an end to the reliance on subscription streaming services and pay-to-view channels.\nREAD MORE: Jeremy Corbyn: UK Government will face Chilcot-style Gaza inquiry\nMackay said making the matches free would allow more Scots to watch national games, including those who cannot afford to pay to watch them.\nThe SNP have backed calls to make the games free to watch. In June, depute leader Keith Brown claimed Westminster had “failed” Scotland fans who had to pay to watch the nation play during many of the Euros matches.\nThe Scottish Government also announced a consultation in April into whether the games should be free to view.\nAlthough sport is devolved, broadcasting is reserved so any changes to the rules would have to be made at Westminster.\nMackay said: “Increasingly, fans are being priced out of our game. From the extortionate ticket prices on the gate to the endless costly streaming services to watch at home. Something needs to change.\n“I am glad that so many people have joined me in calling for Scotland’s international games to be shown live on free-to-view TV. Sport is meant to be for everyone, and this is the most effective way to ensure Scotland’s next generation of footballers can feel inspired to dream of playing for their country.\n“We have seen that in the rise of women’s football. The regular TV slots have helped to make it a regular fixture for lots of women, girls and families, and has encouraged them to take up the sport, and support their local teams.\n“By listing Scotland national team games as ‘national events’ in the same way that we do with the Euros and Scottish Cup Final, we could allow public broadcasters to share the rights alongside private companies such as Sky, TNT and Premier Sport.\n“I hope that the Secretary of State will join this campaign and use the power and influence he has to give Scottish fans the gift of football, and make our most iconic game accessible for all, not just for those that can afford it.”\nA UK Government spokesperson said: “The UK Government is keen to ensure the biggest sporting events are made available to the public throughout the UK which is why we have the listed events regime.\n“While we have no current plans to review the listed events regime, the UK Government is keen to ensure sport can be accessed, played and enjoyed by as many people as possible.”\nA Scottish Government spokesperson said: “While broadcasting policy is reserved to the UK Government, the Scottish Government’s view is that national sporting events, such as Scotland’s men’s and women’s football qualifiers for the World Cup and European Championships, should be included in the list of matches protected for free-to-air broadcast so that more fans can enjoy these games.”",
  "word_count": 521,
  "scraped_at": "2026-02-14T12:34:08.339240"
}