{
  "article_id": "6fc7ff75263d",
  "url": "https://www.prokerala.com/news/articles/a1654187.html",
  "title": "Arsenal sign Olivia Smith for world - record women transfer fee",
  "date": "20250717T124500Z",
  "domain": "prokerala.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "London, July 17 : Canada forward Olivia Smith has become the most expensive signing in women's football history by completing a one million pound move to Arsenal from Liverpool.\nOlivia joins the Arsenal on a long-term contract and will wear the number 15 jersey. \"It's a privilege and an honour to sign for Arsenal. It's my dream to compete for the biggest titles here in England and in Europe and I'm excited to get started and contribute to doing that here with Arsenal. The atmosphere the supporters create at Emirates Stadium is incredible and I can't wait to have that behind me now,\" she said in a statement.\nShe started her youth career in her homeland before spending time in the US college system. Her strong progress was soon recognised and she signed a first professional contract with Sporting Clube in Portugal in July 2023.\nOlivia announced her arrival in Lisbon with a goal and an assist on her debut for the club, scoring a total of 16 goals in 28 appearances for Sporting during the 2023/24 season.\nThe 20-year-old ended the 2023/24 campaign as the Player of the Season and Young Player of the Season, with her reputation cemented as one of the most highly rated young players in the game.\nA move to the UK and the Women's Super League followed as Olivia completed a switch to Liverpool in July 2024, scoring nine goals in 25 appearances in all competitions for the Merseyside club last season.\nThere was more personal recognition for Olivia at the end of the campaign, as she was voted Liverpool's Player of the Season and received a nomination for the Women's Super League Rising Star award.\nAt international level, Olivia became Canada's youngest-ever player when she won her first cap at the age of 15 in 2019. To date, she has made 18 appearances and scored four goals for Canada, representing her country at the 2023 FIFA World Cup and the 2024 CONCACAF W Gold Cup, where she was named Best Young Player. Olivia also won Canada's Young Player of the Year award in 2024.\nDirector of Women's Football Clare Wheatley added, \"We're thrilled to bring Olivia to Arsenal. She's one of the most talented young players in the game and has huge potential for further development here at the club. On behalf of everyone at Arsenal, I'd like to welcome Olivia to Arsenal and congratulate her on this special moment.\"\n\"Olivia is an exciting young player and we believe she can make a big contribution here at Arsenal. We've been impressed by her mentality and character, excelling in two European leagues at such a young age. I know she has a level of ambition that matches our own and we're looking forward to working with her as she continues to grow at the club,\" Arsenal Women head coach Renee Slegers said.",
  "word_count": 478,
  "scraped_at": "2026-02-14T12:44:00.170653"
}