{
  "article_id": "6fef8de8a834",
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-12883485/Where-Australias-famous-former-WAGs-revenge-makeovers-marrying-one-Hollywoods-richest-men-meet-footy-stars-exes-laugh.html",
  "title": "Where are Australia most famous former WAGs now ? ",
  "date": "20231224T220000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Where are Australia's most famous former WAGs now? From revenge makeovers to marrying one of Hollywood's richest men meet the footy star's exes who had the last laugh\nIt's the status given to only the select few lucky enough snag a sporting star.\nBut what happens when a WAG loses her title?\nFrom glamorous makeovers to rebuilding their lives with new relationships, we take a look at how some of Australia's most iconic ex-WAGs recovered from their very public breakups.\nAmie Rohan\nAmie Rohan, the ex-wife of Geelong Cats player Gary Rohan, was left devastated in 2020 after splitting from her husband at the height of the Covid pandemic.\nShe was dealt a further blow when Gary hooked up with his now-wife Madi Bennett shortly after the marriage breakdown.\nProving her resilience, Maddie has since rebuilt her life as a single mother-of-two, and has even found new love with boyfriend Jaison Todd.\nAmie Rohan, the ex-wife of Geelong Cats player Gary Rohan, was left devastated in 2020 after splitting from her husband at the height of the Covid pandemic. (The former couple are pictured before their split)\nShe and Jaison began dating in February 2022, and went Instagram official with their romance in October the same year.\nEarlier this month, Amie announced the happy news she is expecting her third child by sharing a photo of herself trying on 'bump-friendly' outfits.\nSpeaking to The Herald Sun shortly after going public with Jaison, Amie said her new boyfriend had rebuilt her confidence following her devastating divorce.\n'It's made me realise I'm normal and I'm not a broken soul that's not loveable. It's exciting,' she said of her new romance.\nProving her resilience, Maddie has since rebuilt her life as a single mother-of-two, and has even found new love with boyfriend Jaison Todd (right)\nGary and Amie were high school sweethearts who were married for four years before splitting in 2020.\nThe split occurred when Gary travelled with his Geelong teammates to Queensland to join the AFL Covid hub, while Amie stayed in Victoria with their children, Bella, four, and Sadie, three.\nWhile Gary was in the AFL hub, he hooked up with his now-wife Madi Bennett after his marriage broke down - just months after Sadie was born.\nEarlier this month, Amie announced the happy news that she is expecting her third child by sharing a photo of herself trying on 'bump-friendly' outfits\nThe footy star went public with Geelong physio Madi in 2021, and the happy couple officially tied the knot in December of 2022.\nThe Rohans had suffered unimaginable grief in 2018 when Willow, Bella's twin, died five hours after birth due to a defect causing babies to be born without parts of the brain.\nIn 2021, Amie said that the breakdown of her marriage was even worse than losing Willow.\nGary and Amie (both pictured in happier times) split in 2020 when he travelled with his Geelong teammates to Queensland to join the AFL Covid hub, while Amie stayed in Victoria with their children, Bella, three, and Sadie, two\n'The days after my marriage breakdown were some of the hardest days of my life, harder than when we lost Willow,' Amie told the Move Your Mind podcast at the time.\n'But I still got out of bed every day and faced whatever the day brought.'\nTania Minnici\nFormer AFL glamour couple Tania Minnici and Nathan Buckley shocked the sporting world in 2020 when they announced their split after 18 years of marriage.\nThe couple split in January but did not confirm the breakup until December, confirming their separation in a statement posted on social media.\nFormer AFL glamour couple Tania Minnici and Nathan Buckley shocked the sporting world in 2020 when they announced their split after 18 years of marriage (Both pictured in 2017)\nWhile ex Collingwood coach Nathan went on to enjoy a very public romance with cosmetic nurse Alex Pike before his dating current girlfriend Brodie Ryan, Tania has kept her love life out of the public eye.\nShe has also undergone a stunning transformation as a single woman by updating her fashion style and deleting any evidence of Nathan from her Instagram profile.\nWhile she's changed her look, Tania has kept the last name 'Buckley' on her Instagram handle.\nNathan and Tania got married in December 2002 and announced their separation in December 2020, almost 18 years to the day they wed.\nTania has undergone a stunning transformation as a single woman by updating her fashion style and deleting any evidence of Nathan from her Instagram profile. Tania is pictured with a friend after her split\nWhile she's changed her look, Tania has kept the last name 'Buckley' on her Instagram handle\nIn a statement posted to Tania's Instagram at the time, the Buckleys confirmed they'd broken up and had been co-parenting their two sons, Ayce, 15 and Jett, 17.\n'We remain dedicated parents and in the interests of our boys, we ask for our family to be given the privacy that is needed,' it read.\n'We thank everyone in advance for understanding our request and for the unconditional love and support we have received throughout our marriage.'\nNathan moved out of the family home around that time, and was reportedly staying at at an apartment in South Yarra which was owned by his friend Paul Roberts, a TLA sports executive.\nMel Waring\nMel Waring was left heartbroken in 2017 when her cricket star partner Nathan Lyon left her to be with glamorous real estate agent Emma McCarthy.\nBut time appears to have healed all wounds for the former WAG, 35, who has been looking happier than ever after finding new love with a handsome new man.\nMel went Instagram official with her boyfriend in April last year, sharing several photos of the couple together on Instagram.\nMel Waring was left heartbroken in 2017 when her cricket star partner Nathan Lyon left her to be with glamorous real estate agent Emma McCarthy. (The former couple are pictured together before their split)\n'The best things are worth the wait!' she wrote in the caption, adding a heart emoji and the hashtags #foundhim and #hardlaunch.\nMel's friends and followers sent congratulatory messages on her page at the time, with one commenting: 'Well-deserved happiness after how you were treated #betterman.'\n'So happy for you, Mel,' another added, while a third wrote: 'So pleased for you.'\nBut time appears to have healed all wounds for the former WAG, 35, who has been looking happier than ever after finding new love with a handsome new man (left)\nMost recently, Mel flaunted her idyllic new life on Instagram on Monday, sharing photos of herself enjoying a backyard pool party with her beau and a group of friends.\nThe former WAG's relationship with Nathan imploded in late 2017 when he was spotted kissing Emma McCarthy in Perth.\nMel, who had been in a relationship with the spin bowler for a decade, was left 'devastated'. The former couple share two daughters, Harper and Milla.\nMost recently, Mel flaunted her idyllic new life on Instagram on Monday, sharing photos of herself enjoying a backyard pool party with her beau and a group of friends. One photo shows the mother-of-two posing in a plunging swimsuit holding a trio of fruity cocktails\nShe detailed their heartbreaking split in a blog post in March 2018, recounting nights when she would lie in bed with her children and cry.\n'I didn't ask for this, this wasn't the way my life was supposed to be. He was my forever, he was my whole world,' she wrote.\nSince then, Emma and Nathan have attempted to keep their relationship under wraps.\nThey strived to keep their engagement a secret before getting married in July last year, and even managed to hide Emma's recent pregnancy with strategic outfit choices.\nThe former WAG's relationship with Nathan imploded in late 2017 when he was spotted kissing Emma McCarthy (left) in Perth\nSally McMahon\nWayne Carey's ex-wife Sally McMahon has all but vanished from the public eye since her split from the AFL star in 2006.\nThe former couple tied the knot in 2001 after meeting at a party in Wagga Wagga, when he had just turned 20 and she was 17.\nBut the couple's relationship soon hit the headlines for all the wrong reasons. Just one year after tying the knot, the North Melbourne captain was involved in a sordid affair with his former teammate Antony Stevens' wife, Kelli.\nWayne Carey's ex-wife Sally McMahon has all but vanished from the public eye since her split from the AFL star in 2006. (The former couple are pictured in 2005)\nThe former couple tied the knot in 2001 after meeting at a party in Wagga Wagga, when he had just turned 20 and she was 17\nTo make matters worse, Stevens was by Carey's side as a groomsman at his wedding.\nCarey and Sally did manage to mend their relationship and had a daughter, Ella, now 17, before parting ways in 2006 - only months after her birth.\nSally has since kept a low profile on social media but appears to have found happiness with a strapping gentleman who she uses as her cover photo on Facebook.\nNowadays, Sally keeps a low profile on social media but appears to have found happiness with a strapping gentleman (left) who she uses as her cover photo on Facebook. Pictured in 2016\nSally she spoke out in defense of Carey in 2016 after he was hit with rumours he'd cheated on his then-partner, Stephanie Edwards, with whom he shares daughter Charlotte, 7. Pictured: Sally in 2015\nSally she spoke out in defense of Carey in 2016 after he was hit with rumours he'd cheated on his then-partner, Stephanie Edwards, with whom he shares daughter Charlotte, 7.\n'Over the past five years in particular, Wayne has been a very dedicated, loving father to both Ella and Charlotte,' Sally said at the time.\n'We often spend time with them both and I think it's lovely for the girls to have the relationship they do.'\nHome And Away star Pia Miller has come quite a way since her failed marriage to AFL star Brad Miller in 2016.\nThese days, the ex-model, 39, is maried to millionaire Hollywood agent Patrick Whitesel, 58, and enjoys a high-flying lifestyle in the US.\nPatrick is the Executive Chairman of William Morris Endeavor, who is believed to have a net worth of around USD $600 million.\nHome And Away star Pia Miller has come quite a way since her failed marriage to AFL star Brad Miller in 2016. (The former couple are pictured in 2010)\nHe is the ex-husband of journalist Lauren Sánchez, who is now engaged to the world's richest man, Amazon founder Jeff Bezos.\nSince marrying Patrick, the former soap star has turned her back on acting and instead focusses her effort son promoting her small skincare brand Macabalm.\nPia is also regularly seen at high-profile LA events including at the Oscars Party in March this year.\nThese days, the ex-model, 39, is maried to millionaire Hollywood agent Patrick Whitesell, 58, (right) and enjoys a high-flying lifestyle in the US\nShe is also an influencer, often promoting luxury products and documenting her opulent lifestyle on Instagram.\nPia started dating football pinup Brad back in 2005, and the couple welcomed their son Lennox a year later. She also shares a 20-year-old son named Isiah with a former partner.\nThe couple married in December 2007, and were known for frequenting red carpets together.\nSince marrying Patrick, the former soap star has turned her back on acting and instead focusses her effort son promoting her small skincare brand Macabalm\nPia's career took off in 2014, when she landed the role of Kat Chapman on Home and Away.\nThe pair began battling split rumours soon after, and finally confirmed their separation in 2016.\nPrior to their split, Pia had told Marie Claire Australia that she was struggling to balance her family life and filming commitments for Home And Away.\n'I'd shoot all day, jump on a plane, race home and make dinner - it was like I was working full-time in both places,' she told the publication.\nShe is also an influencer, often promoting luxury products and documenting her opulent lifestyle on Instagram\n'I was trying to do everything and it took a toll on me physically, I think it took its toll on everything.'\nFollowing her split from Brad, she went on to date producer Tyson Mullane. That union lasted from November 2017 to April 2019.\nThe beauty confirmed she was dating Patrick in December 2019. The pair were secretly wed in 2021, and she then moved to Los Angeles.\nLara Bingle\nSupermodel Lara Bingle was once Australia's hottest cricket WAG thanks to her whirlwind romance with Michael Clarke in the early 2000s.\nFast forward to 2023, however, and the 36-year-old is living a very different lifestyle.\nThe former skincare mogul married actor Sam Worthington in 2014, and splits her time between Australia and New York where she works as a model and influencer.\nSupermodel Lara Bingle was once Australia's hottest cricket WAG thanks to her whirlwind romance with Michael Clarke in the early 2000s. (The former couple are pictured in 2009)\nWhile Lara was the subject of many salacious tabloid articles during her romance with Michael, she now tends to evade the spotlight.\nInstead, she now focuses on her modelling career and raising her three sons - Rocket, seven, Racer, six, and River, two.\nShe has also completely overhauled her sense of style in recent years, transforming her look from Bondi beach babe to red carpet icon.\nThe former skincare mogul married actor Sam Worthington (left) in 2014, and splits her time between Australia and New York where she works as a model and influencer. (Pictured in January 2023)\nIn 2014, she famously cut her hair into a dramatic bob, spurring a fashion trend among Australian women hoping to emulate Lara's chic new look.\nLara and Michael began dating in 2007, after meeting on the set of Channel Nine's now-defunct reality TV show Torvill and Dean's Dancing on Ice.\nIn March the following year, the glamour couple became engaged during a romantic trip to New York.\nShe has also completely overhauled her sense of style in recent years, transforming her look from Bondi beach babe to red carpet icon. (Pictured in November 2023)\nUpon their return to Australia, the lovebirds celebrated their engagement with 300 of their closest friends and family at a function centre at Sydney's Luna Park.\nDuring their relationship, the smitten sportsman had Lara's initials tattooed on his shoulder and spoiled her with gifts such as a $300,000 Aston Martin.\nIn March 2010, Clarke famously left his teammates halfway through a New Zealand tour to return to Australia for 'personal reasons'.\nIn a late-night press conference two days later, he confirmed his two-year engagement to the former Tourism Australia spokesmodel was over.\nTheir split came just months after a photo of Lara in the shower - taken years earlier by AFL star Brendan Fevola during their brief relationship - was publicly leaked and went viral.\nLara and Michael began dating in 2007, after meeting on the set of Channel Nine's now-defunct reality TV show Torvill and Dean's Dancing on Ice. (Pictured in 2008)\nFollowing their split, there were rumours Bingle's $200,000 engagement ring was flushed down the toilet in their $6million Bondi beachside pad.\nPlumbers even appeared at the complex, but it was unclear whether they were just trying to hijack a saucy media story with a canny marketing stunt.\nClarke finally addressed the rumours six years later in an interview with 60 Minutes, describing them as 'complete made-up 100 percent bulls**t'.\n'I'd like to say I'm a very silly man. But I'm not that silly. I'm not throwing any diamond ring down a toilet,' he said in 2016.\nFollowing their split, there were rumours Lara's $200,000 engagement ring was flushed down the toilet in their $6million Bondi beachside pad\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Astonishing moment a street is swallowed by a sinkhole\n- Israeli hostage reveals how she survived being tortured\n- Deepak Chopra confronted over his relationship to Epstein\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- New video shows man with backpack similar to Guthrie kidnapper\n- Toddler opens car door in traffic and sends biker flying",
  "word_count": 2802,
  "scraped_at": "2026-02-14T14:08:03.883741"
}