{
  "article_id": "6ff640c5e6ea",
  "url": "https://www.the42.ie/stephen-kenny-75-6157156-Aug2023/",
  "title": "Ireland left worryingly depleted at wing - back and up front ahead of daunting French test",
  "date": "20230831T180000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "TIME TO SHARPEN minds, then. This day week Ireland will be in Paris to take on France in Euro 2024 qualifying, before the Netherlands come to Dublin on Sunday in what is Ireland’s toughest double-header of qualifiers since the Portugal/Dutch series more than 20 years ago.\nThe first game has been moved to the Parc des Princes with the Rugby World Cup pitching up at the Stade de France, but while the French football team may be overshadowed, they will be not understrength. Didier Deschamps has no injury worries and has thus named a squad gleaming with stars. Stephen Kenny announced his squad today and Ireland, regrettably, are not so lucky.\nSeamus Coleman is still out with the knee injury he suffered for Everton at the end of last season, meaning he will not be able to reprise his outstanding man-marking job on Kylian Mbappe from March. More troubling still is the fact Matt Doherty is suspended, having picked up a two-game ban for his straight red card at the end of June’s damaging defeat to Greece. Kenny wanted the FAI to appeal the ban, but following consultation with the Association’s legal team, it was decided no appeal would be lodged. Doherty has been included as he is available to play against the Dutch.\n“To me it’s a yellow card, looking at the video evidence he has gone over and nudged him with his shoulder, the player has hit the deck like he absolutely collapsed”, said Kenny about Doherty’s sending off in Athens. “Other players have actually grabbed Matt, he could have collapsed on the deck and the Greek player would have been sent off. But he didn’t do that. There was no need for the player to hit the deck, number one. And the second thing is that, how it’s two matches, I’ll just never know.\n“I asked the FAI to contact Uefa, and it was delay delay delay [from Uefa], there was no subsequent meeting. Ultimately we heard a couple of weeks ago that he got the two matches. I had a meeting with our legal team, we had a load of video evidence. We viewed it and under the rules they felt there wasn’t a case for an appeal. The fact that the two sets of players were involved after that exacerbates the actual incident. That’s what led to the two matches.” Doherty’s post-game review of the referee – “arrogant” - played no part in his suspension.\nIreland will therefore have to get creative at right wing-back. Alan Browne and Jason Knight are in the Irish squad and have played there before, but the player with most experience in the role is the uncapped Festy Ebosele of Udinese. But…\n“Yeah we are [short of] orthodox players in that position for sure”, said Kenny. “He is in contention. Ultimately we see Festy as an attacking player, who has sort of been relocated to right wing back. Obviously he played 58 minutes against Juventus [at the start of the Serie A season] and made a late introduction in the second game.”\nThere are absentees elsewhere. Callum O’Dowda is out with a groin problem, but fellow left wing-backs Enda Stevens and Ryan Manning are fit to return. James McClean is included too, having shaken off a knee problem and appeared for Wrexham last night. Kenny admitted that McClean’s dropping down to League Two is “not ideal in the long term”, but the difference in playing three or four early-season games in the fourth tier as opposed to the third tier was deemed minimal for this window. It may count for more when Ireland assemble in October and November.\nThe forward line is depleted too. Callum Robinson and Michael Obafemi are injured, and Troy Parrott has just recovered from a groin operation and wasn’t deemed ready to be included, and so returning from the margins is Aaron Connolly, who has scored three times from the substitute’s bench for Hull City this season. Connolly won’t start against France or the Netherlands, but he may be a wildcard from the bench.\n“It’s unusual to pick someone who is not starting, he’s not been starting for Hull”, admitted Kenny, “But everyone knows it’s not been a straightforward journey for Aaron. But he showed great humility and great determination going back to the U21 team in Israel and playing in the play-offs. He’s got a manager there [at Hull] in Liam Rosenior there who he has a very good relationship with and has been very good for him, and a very good manager.\n“He hasn’t been starting for Hull so it’s not realistic to start for us. But he’s shown his capacity to come on and get goals in the last couple of weeks. That’s why he’s included.”\nThe week has thus far been dominated by the news of Vera Pauw’s exit as women’s manager, and Kenny revealed he spoke to her this morning.\n“Vera’s legacy is that Ireland qualified for the World Cup and it’s a great achievement and she did a terrific job as Ireland manager in our time”, said Kenny. “I had a good relationship, I spoke to her after she came back from Australia, she actually rang me this morning and I spoke to her this morning. It wasn’t the ending she wanted, she can be very proud of her achievements as manager of the women’s team and she did a terrific job.”",
  "word_count": 902,
  "scraped_at": "2026-02-14T13:26:04.208730"
}