{
  "article_id": "701028324bb2",
  "url": "https://www.hillingdontimes.co.uk/news/23399069.kellys-euros-winner-inspired-generation-says-chloe-morgan/",
  "title": "Kelly Euros winner has inspired a generation , says Chloe Morgan",
  "date": "20230320T160000Z",
  "domain": "hillingdontimes.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chloe Kelly's dramatic Euro 2022 winner was the inspiration behind a new wave of fans in the women's game, according to former teammate Chloe Morgan.\nManchester City forward Kelly, 25, came off the bench to score the Lioness' winning goal in extra-time against Germany in front of a sold-out Wembley Stadium last summer.\nAnd an emotional Morgan was watching on from the crowd as her former Arsenal teammate wrote herself into football folklore and made history.\nShe said: \"Coming to Wembley to watch that final was super emotional and since then, we've seen people enter the women's game because it is such an inclusive sport.\n\"That's all happened and has been able to happen from watching the Lionesses in that final.\n💭 @Morgie_89: \"These women are athletes but they're not just athletes; they're incredibly smart as well. They're not just players - they're doctors, lawyers and so much more.\"#WIFBeInspired https://t.co/lpRVVJUUTE\n— Women in Football (@WomeninFootball) March 16, 2023\n\"I had a brief stint at Arsenal some years ago and at the time I was playing with Chloe Kelly, who must've been around 16 at the time.\n\"She was a fantastic player back then but you never know the trajectory of where the players will go.\n\"But then coming out to the European final here at Wembley and seeing Chloe, who I have followed for years, was so emotional.\n\"As well as her scoring worldies in front of thousands of people at the best stadium in world.\n\"Looking forward now, it's such an exciting Lionesses squad.\nHow fun was that! 🤩\n— Women in Football (@WomeninFootball) March 15, 2023\nHear more inspirational stories at Day Two of #WIFBeInspired tomorrow. #WomenInFootball pic.twitter.com/p6a4QQazT5\n\"A few of the older players have retired now but now you will see the likes of Kelly, Alessio Russo and Ella Toone continue to inspire a new generation of young girls.\n\"It's just brilliant how we will now have another amazing tournament off the back of the Euros, then the Olympics and another Euros again.\n\"You couldn't ask for a better four years spin for women's football.\"\nMorgan, who worked as a personal injury lawyer alongside her football career, was one of the first players to receive a professional contract for Tottenham Hotspur following their promotion to the FA Women's Super League in 2019.\nAnd the current Crystal Palace coach recently returned to the famed Wembley arches as part of the Women In Football Be Inspired Conference, in partnership with Barclays.\nMorgan was part of the 'Influencing and Navigating the Culture of Football, and the Impact on the Women’s Game' panel hosted by Clare Balding, and enjoyed being able to discuss how she has seen the game grow over her career.\nThree things we learnt from Day One of the #WIFBeInspired Conference:\n— Women in Football (@WomeninFootball) March 15, 2023\n⭐️ Believe in yourself\n⭐️ Confidence is key\n⭐️ Don’t let anyone stop you from following your passion#WomeninFootball pic.twitter.com/aPVNHsJReg\n\"It was amazing being a part of the conference,\" she said.\n\"We spoke about the new culture that's been created in the women's game and the lessons that we can learn.\n\"I've had a challenging but amazing career in football. For my generation we had careers both on and off the pitch so I've seen the women's game transition quite a bit.\n\"When I was first at Spurs we had just a man and his dog coming to the games, and we were bringing our own oranges for half time.\n\"Whereas now you have Spurs playing at the Tottenham Hotspurs Stadium on Sky Sports and in front of record-breaking crowds.\n\"So I really want to provide my experiences and hopefully make it easier for the next generation coming through.\n\"The only way is up for the game.\"\nThe Women in Football Be Inspired Conference in partnership with Barclays is a unique convergence of women who are blazing a trail in the game, and their allies in the pursuit of gender equality. The event offers invaluable insights and encouragement to women pursuing careers on and off the pitch, opening access to professional networks and development resources",
  "word_count": 685,
  "scraped_at": "2026-02-14T12:38:45.204635"
}