{
  "article_id": "7020ce29c313",
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-12871959/Wagatha-Christie-postponed-Jamie-Vardys-Leicester-Wayne-Rooneys-Birmingham-City-Coleen-Rebekah.html",
  "title": "Wagatha Christie showdown is postponed ! Jamie Vardy Leicester take on Wayne Rooney Birmingham City on Monday night - but here why Coleen and Rebekah WONT be going head - to - head",
  "date": "20231216T190000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Wagatha Christie showdown is postponed! Jamie Vardy's Leicester take on Wayne Rooney's Birmingham City on Monday night - but here's why Coleen and Rebekah WON'T be going head-to-head\nIt was the clash that was not only set to be gloriously fascinating for football fans, but for anyone who had been following the enthralling Wagatha Christie trial.\nFor the first time since Jamie Vardy and Wayne Rooney came face to face in the High Court where they were supporting their warring wives, the two football stars were due to meet as Birmingham City welcome Leicester City to their St Andrew's stadium tomorrow night.\nWhile admittedly it would not have been as exciting as if Wayne was still playing, for weeks there has much chatter amongst both sides on how they would deal with the face-off.\nOf course, every movement would be documented. Every single look, word (if any) and gesture would be discussed by television pundits and on social media for days afterwards. Likely too, would be fashion critics ready to compare the WAGs' designer outfits.\nBoth Team Vardy and Team Rooney were even anticipating both lip reading and body language experts to be in full throttle, analysing every teeny aspect of the meeting. Wayne and Coleen, especially, feared the column inches would not only overshadow the game but also revisit Wagatha, something both of them say had a hugely detrimental effect on their lives — even their marriages.\nFor the first time since Jamie Vardy and Wayne Rooney (pictured in 2016) came face to face in the High Court where they were supporting their warring wives, the two football stars were due to meet as Birmingham City welcome Leicester City to their St Andrew's stadium tomorrow night\nBoth Team Vardy and Team Rooney were even anticipating both lip reading and body language experts to be in full throttle, analysing every teeny aspect of the meeting\nWayne and Coleen, especially, feared the column inches would not only overshadow the game but also revisit Wagatha, something both of them say had a hugely detrimental effect on their lives — even their marriages\nThose close to Coleen, 37, say that she was always intending to stay away. While she does, on occasion, make the trip down the M6 from the couple's £10 million Cheshire mansion to Birmingham to support Wayne now he is managing the Championship side, she was keen to avoid being the star of the show.\n'She would rather leave her husband to get on with this job,' says a friend of the WAG. 'She's not stupid, she knows what a circus it would have been and she is very much trying to move on from it all now.'\nRebekah, meanwhile, who out of the two wives is much happier in the limelight, was tempted to be there. 'She loves to watch Jamie, so do the kids and it isn't that far from where she lives. There were of course discussions over whether she would go.'\nThankfully, she didn't need to make a decision because, rather handily, her husband went and injured his knee which has ruled him out of the game and put an end to the circus.\nOf course, the question still remains, will Jamie travel with the team? The chances are slim, apparently.\nThe showdown would have come jut a little over four years after Coleen took to social media in October 2019 to accuse Rebekah of leaking stories about her private life to The Sun newspaper.\nRebekah, 41, responded by suing Coleen for libel, culminating in a gripping two-week trial in May 2022 which was littered with tantalising details including an article in which Rebekah once described singer Peter Andre's manhood as the size of a 'chipolata.'\nRebekah lost the case against and was ordered to pay her rival's £1.8 million legal bill — as well as her own costs which were thought to have been around £2 million.\nRebekah, meanwhile, who out of the two wives is much happier in the limelight, was tempted to be there. 'She loves to watch Jamie, so do the kids and it isn't that far from where she lives. There were of course discussions over whether she would go' - pictured in the south of France back in 2008\nColeen and Rebekah pictured together in 2016 - The showdown would have come jut a little over four years after Coleen took to social media in October 2019 to accuse Rebekah of leaking stories about her private life to The Sun newspaper\nRebekah sensationally lost the 'Wagatha Christie' libel case with Coleen in July 2022\nWhile the High Court showdown last spring was very much about the WAGs, their husbands did find themselves being dragged into the row after Rooney took to the stand to tell judge Mrs Justice Karen Steyn about an 'awkward' moment former England manager Roy Hodgson asked him to have a word with team-mate Jamie Vardy at the Euro 2016 tournament to tell his wife to 'calm down.'\nOutside the court, Vardy hit back in a statement where said Rooney was 'talking nonsense,' adding: 'He must be confused because he never spoke to me about issues concerning Becky's media work at Euro 2016. There was nothing to speak about. I know this because I discuss everything with Becky.'\nWhile Vardy was yet to publicly address the battle, Rooney went to great lengths to explain that he was keen to focus on the football — and appealed to others to leave Wagatha Christie at the front door of St Andrew's.\nWhen asked about the reunion in a press conference on Friday, Wayne said: 'My job is to focus on Birmingham trying to win the game.\n'I played with him for England, the same as I played with many players for England.\n'He is not someone who I have ever had a relationship with, outside of being away on a training camp or being in games with him.\n'I respect Jamie Vardy a lot, I think he is a fantastic player — he still has a lot to offer Leicester.\n'In my opinion, Jamie Vardy is a fantastic player and has been for many years, a great servant for Leicester. Ultimately, the game is about Birmingham going to try and win the game. Anything else, there is nothing really to talk about.'\nWhile both have been granted a reprieve for now, Birmingham will be travelling to Leicester City's King Power Stadium on April 6 next year.\nAnd with the Vardys being on home turf, there is little doubt that Rebekah will be ready and awaiting the action. Clutching her best Birkin handbag, of course.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Astonishing moment a street is swallowed by a sinkhole\n- Israeli hostage reveals how she survived being tortured\n- Deepak Chopra confronted over his relationship to Epstein\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- New video shows man with backpack similar to Guthrie kidnapper\n- Toddler opens car door in traffic and sends biker flying",
  "word_count": 1231,
  "scraped_at": "2026-02-14T14:08:11.507419"
}