{
  "article_id": "7050cba39d3d",
  "url": "https://www.bbc.co.uk/sport/football/68562288",
  "title": "WSL managers say player - coach relationships in women football are  unacceptable  ",
  "date": "20240314T190000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WSL managers say player-coach relationships in women's football are 'unacceptable'\n- Published\nAston Villa manager Carla Ward says players and coaches being in relationships is \"crossing that line\" and \"unacceptable\".\nLeicester City boss Willie Kirk is being investigated by the club following an allegation of a player-coach relationship.\nA spokesperson for the Foxes said the 45-year-old was \"assisting the club with an internal process\".\nBBC Sport has approached Kirk for comment regarding the allegation.\nKirk was not on the touchline for Leicester's 2-0 win against Liverpool in the Women's FA Cup quarter-finals on Saturday.\nBBC Sport understands a complaint has been lodged with the club about an alleged current relationship between Kirk and a player.\nA spokesperson for Leicester said a decision \"will be determined in due course\".\nIn 2022, Ward said player-coach relationships could \"create a power imbalance\" that often came from an \"unconscious bias\".\nSpeaking on Thursday, Ward said: \"I feel even stronger than I did two years ago because the game is going at a rapid rate.\n\"Our job and our duty is to protect players, first and foremost. So to cross that line is unacceptable and it can't happen.\n\"It makes me very angry because we're here to set an environment, a comfortable place that people come to work, where they feel safe, where they feel backed, where they feel looked after.\"\nAsked if a player-coach relationship should become a sackable offence, Ward said: \"Yeah, 100%.\"\nTottenham boss Robert Vilahamn, who joined the club in July from Swedish club BK Hacken, added: \"I think it's totally not acceptable. As a coach, I am in a power position with players and staff.\n\"I don't think it should be a question we raise here, I think it's crazy. For me, it's unacceptable and shouldn't be like that.\"\nKirk took over as manager of Women's Super League club Leicester in 2022.\nHe initially joined the club that summer as director of football before succeeding Lydia Bedford as boss in November of the same year.\nHis career in women's football has seen him manage Hibernian and Bristol City, before spending time on Manchester United's coaching staff.\nThe Scot then took charge of Everton in December 2018 and in just under three years with the Toffees helped them reach the Women's FA Cup final in 2020.\nLast season he guided Leicester from the bottom of the WSL to safety and they are currently seventh in the table.\nWhy player-coach relationships in women's football remain an issue\nPlayer-coach relationships are not illegal - as long as no minors are involved - albeit they can breach codes of conduct.\nCodes of conduct among players and managers are a condition of clubs getting a WSL licence, and every club must have a safeguarding officer in place.\n\"The game is professionalised. When you talk about where does the line get drawn, I think it's very simple, when the game got professionalised, you can't cross that line,\" Ward said.\n\"When I was a player, it was a very social aspect but now we're talking about levels that it's parent-teacher, in my opinion. You can't do it.\n\"There are a lot of unwritten rules in life that people don't cross. Given where we're at now and given some people still don't understand that unwritten rule, maybe put it in black and white so then it's clear.\"\nFootball Association director of women's football Baroness Campbell said in 2018 that she regarded player-coach personal relationships as \"a concern\".\nPersonal relationships between players and coaches in women's football have been criticised for potentially creating a power imbalance in a squad.\nIt also contributed to Mark Sampson's sacking as England manager in 2017. He lost his job after what the FA described as \"inappropriate and unacceptable behaviour\" with players in a previous role at Bristol Academy.\nSame-sex player relationships are common in the game, where the WSL only turned professional in 2011.\n'Unacceptable and inappropriate' - what other WSL managers said\nBBC Sport asked a number of managers during their news conferences on Thursday about player-coach relationships.\nBristol City head coach Lauren Smith: \"My view is that there's no grey area. It's unacceptable and it shouldn't happen.\n\"Is it a problem within the women's game? I think the fact we're having the conversation shows it is an issue on something that needs to be looked at, dealt with sooner rather than later. We've seen other instances across the world where things get ignored and pushed under the carpet. It's not time for that, it's time for action and consequences.\n\"Clubs should be responsible for what goes on within their clubs. We've seen in the past that if clubs don't know how to or can't, support from the FA or governing body, LMA [League Managers Association] or PFA [Professional Footballers' Association], it's important everyone has a voice. If clubs don't know what to do then they need to ask for help.\"\nArsenal manager Jonas Eidevall: \"I think it's very inappropriate for a number of reasons. It's a clear no with relationships between player and manager.\n\"When you look in the past there is no doubt if you look and read in NWSL [the United States' National Women's Soccer League], for example, there is major issues within the game and there have been major issues in the past as well, which probably unfortunately tells you there still are issues at some places.\n\"That concerns me from a player welfare perspective and I absolutely think that governing bodies, leagues, clubs, associations need to be strong on that. I do think it's very inappropriate.\"\nChelsea manager Emma Hayes: \"One of the important things to talk about is the women's game is shifting from an amateur game into a professional game. With that, the reality is that in almost all areas of our game, we have to make sure there is a minimum standard in place. We need to have safeguarding.\n\"Player-coach relationships are inappropriate, player-to-player relationships are inappropriate. We have to look it at in the context of where the game has come from. We're in a professional era now where the expectation in place for players and coaches is such that all of our focus and attention has got to be on having the top standards.\n\"Women's football as we know has been a very amateur game for a long period of time. I say this for player-to-player relationships as well. There's challenges that we are moving to a point where we should be moving past those places.\n\"I think there's a bigger conversation to be had about it, but I don't think we can have the conversation without the historical context and what we want to continue to create for safe spaces in our football environment.\"",
  "word_count": 1123,
  "scraped_at": "2026-02-14T12:22:20.318497"
}