{
  "article_id": "7060a856b6d3",
  "url": "https://easyreadernews.com/baywatch-community-calendar-1-12-23/",
  "title": "Baywatch Community Calendar 1 - 12 - 23",
  "date": "20230112T231500Z",
  "domain": "easyreadernews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Spotlight: Redondo MLK Jr. Day March and Day of Service Community members are invited to honor Martin Luther King, Jr. by taking part in a service project and march in Redondo Beach. The program is presented by the Redondo Beach Police Department’s Community Engagement Board. The march is scheduled for 10 a.m. on Monday, Jan. 16, Martin Luther King Jr. Day. Participants will walk from 101 W. Torrance Blvd., Redondo Beach (the Police Pier Substation) to the RBPD Main Police Station. The following donations can be made at the march or prior at the RBPD: a gallon Ziplock bag containing one mini shampoo, and conditioner, one mini deodorant, toothbrush and toothpaste, brush or comb, one mini body wash, one mini bottle of lotion, one package of wet wipes and one pair of adult or children’s socks. The bags will be donated to the RBPD’s domestic violence program. Photo by Kevin Cody\nOngoing:\nArt exhibit\nAn art exhibit of famous rockers in acrylic portraits, LED guitars and neon lights is on display at Cherry Co in Redondo Beach through Feb. 12. The featured artists are Jayime Jean and Miho Hiramatsu. The gallery, located at 211 Avenida del Norte, is free and open daily from 11 a.m.-6 p.m. Contact: cherrycollc@gmail.com,\n310-921-8074, cherryco.art, Instagram @cherryco.art.\nLive musical theater\nThe Aerospace Players present the musical, “1776,”at the James Armstrong Theater on Jan. 27, 28 and 29 and Feb. 2, 3 and 4. The theater is located at 3330 Civic Center Drive, Torrance. For tickets, go to torr-internet.choicecrm.net.\nThursday, Jan. 12\nFarmers Market 90277\nThe Redondo Beach Certified Farmers Market is every Thursday, 8 a.m.-1 p.m. at George Freeth Way and Veterans Park West. For more information, call (310) 372-1171, ext. 2252.\nFriday, Jan. 13\nSports luncheon\nEl Camino College football coach Gifford Lindheim will be the speaker at the South Bay Athletic Club meeting, noon at H.T. Grill, 1701 S. Catalina Ave., Redondo Beach. The public is invited; lunch is $30.\nFarmers Market 90254\nHermosa Beach Rotary hosts a Certified Farmers Market every Friday, noon to 4 p.m., at 1035 Valley Drive.\nSaturday, Jan. 14\nLive improv\nThe April’s Fools Comedy Improv Troupe will present “2023 and Foolish Me!” at the Pier Avenue Second Story Theater, located inside the Community Center at 710 Pier Ave., Hermosa Beach. Show time is 7:30 p.m. Tickets are $10 general admission and $8 for seniors. For tickets, call 310-318-1705 or go to aprilsfoolsimprov.com.\nSunday, Jan. 15\nFarmers Market 90277\nThe Riviera Village Certified Farmers Market in Redondo Beach is open 9 a.m.-2 p.m. on Sundays. For more information, go to rivieravillagefarmersmarket.com.\nSlack Key Festival\nThe Southern California Slack Key Festival returns for a sixteenth year to the Redondo Beach Performing Arts Center, 1935 Manhattan Beach Blvd. George Kuo, The Mākaha Sons, Sonny Lim, Kamuela Kimokeo, Jeff Peterson, Jim “Kimo” West, Bryan Tolentino, Ka’ihi Kimokeo and Kainani Kahaunaele will perform. The festival is the biggest Hawaiian music event on the U.S. mainland. There will also be a marketplace from 11 a.m. — 4 p.m. The marketplace features a variety of island themed gifts, home decor, accessories, clothing, Hawaiian plate lunches, authentic island-style shaved ice, and outdoor entertainment. For tickets to the Slack Key Festival and more information, go to slackkeyfest.com.\nChamber concert\nPrize-winning pianist Claire Huangci will join the Chamber Orchestra of the South Bay for a concert at Armstrong Theatre, 3330 Civic Center Drive, Torrance. Parking is free. There will be a concert preview at 6:15 p.m., followed by the concert at 7 p.m. Tickets are $63 and can be purchased in person by calling (310) 781-7171 and at arts.torranceca.gov.\nMonday, Jan. 16\nMLK Jr. Day of Service\nJoin the Palos Verdes Peninsula Land Conservancy from 9 a.m.-noon at the White Point Nature Preserve. Participants will help care for the White Point Native Plant Demonstration Garden by removing invasive weeds. Sign up at https://pvplc.volunteerhub.com/.\nTuesday, Jan. 17\nFarmers Market 90266\nThe Manhattan Beach Certified Farmers Market is from 11 a.m.-3 p.m. every Tuesday at Metlox Plaza. For more information, go to downtownmanhattanbeach.com.\nThursday, Jan. 19\nLove Medicine and Miracles\nCancer Support Community South Bay offers this free workshop led by Erin Sommerville, a consultant and coach on mind body spirit medicine. Participants will learn how love and joy activate the body’s natural ability to produce medicine for healing. The workshop is from 11 a.m.-noon on Zoom. To join the workshop, visit cscsouthbay.org and select the online calendar. For more information, email Rebecca Sul at Rebecca@CSCSouthBay.org.\nRibbon cutting\nThere will be a ribbon cutting at 5:30 p.m. at CBD Comfort Zone. The business is located at 1200 E. Pacific Coast Highway, Hermosa Beach.\nLive theater\nTwelve women will share their (mostly) true stories on stage for a live audience in “un-told,” a storytelling show that will run two nights at The Grand Annex, 434 W. 6th St. in San Pedro. Showtimes are Jan. 19 and Jan. 20 at 7:30 p.m. Follow the show on Instagram @untold_theshow. For tickets, go to un-told.ticketleap.com.\nUpcoming:\nLive musical theater\n“Day After Day — The Life and Music of Doris Day” opens Jan. 20 at the Second Story Theater, located inside the Community Center at 710 Pier Ave., Hermosa Beach. The curtain goes up at 7 p.m. Presented by P3 Theatre Company, the musical will be at the Second Story Theater through Feb. 5. Showtimes are 3 p.m. and 7 p.m. on Saturdays and 3 p.m. on Sundays. For tickets, go to P3Theatre.biz.\nLunch and Learn: Train Your Brain to End Pain\nCancer Support Community South Bay is offering this free workshop led by Duncan Tooley, a medical hypnotist, artist and author. Participants will learn several techniques for ending pain by using the mind. The workshop is from 12:30-2:30 p.m. on Jan. 20 at 2601 Airport Drive, Suite 100, Torrance. Lunch will be provided at 12:30 p.m., followed by the program at 1 p.m. To register for the workshop, visit cscsouthbay.org and select the online calendar. For more information, email Rebecca Sul at Rebecca@CSCSouthBay.org. Participants are asked to register by Jan. 17.\nNature walk\nEnjoy a guided nature walk at White Point Nature Preserve with the Palos Verdes Peninsula Land Conservancy on Jan. 21, 10:30 a.m. Naturalists will guide you along a trail to discover a unique variety of wildlife in their coastal sage scrub habitat with amazing views across to the ocean. Meet in front of the Nature Center. Reservations not required. Preserve parking available at the end of the street in a gravel lot at 1600 West Paseo del Mar, San Pedro.\nHistory program\nLearn what life was like in Redondo Beach during WWI and the influenza epidemic of 1918-19 on Jan. 21 at the Main Library, 303 N. Pacific Coast Highway. Redondo Beach reference librarians Ed Martinez and Douglas Thompson will lead the program, which will be held from 11 a.m.-12:30 p.m. in the 2nd floor meeting room.\nGuided nature hike\nEnjoy a free guided tour of Abalone Cove in Rancho Palos Verdes at 2 p.m. on Jan. 22. Los Serenos docents will lead the hike. Participants will walk past unique flora and fauna and explore tide pools teeming with marine life. Moderate to strenuous. This is a kid-friendly hike but the trails and rocky beach are unsuitable for baby strollers. No dogs allowed on the beach. Rain cancels. Parking at Abalone Cove is extremely limited; carpooling is highly recommended. For more information, go to losserenos.org.\nEndless Summer talk\nJohn Van Hamersveld, designer of the iconic “Endless Summer” movie poster, as well as Rolling Stones and Beatles album covers, will be the Happy Hour with History speaker at the Hermosa Beach Historical Museum on Jan. 26. The Palos Verdes native also designed the “History of Surfing” mural on the side of The Underground Pub & Grill at 14th Street and Hermosa Avenue. $5. For tickets, go to eventbrite.com and search “John Van Hamersveld.”\nMemorial game\nThe annual Brett Mendoza Peninsula Alumni baseball game will be held on Jan. 28 at Palos Verdes Peninsula High School, 27118 Silver Spur Road, Rolling Hills Estates. Pre-game activities begin at 10 a.m. Game time is noon. The game honors Brett Mendoza, a former Peninsula and Loyola Marymount University catcher who died in a car accident in 2018.\nFilmmakers Q&A\nThe Palos Verdes Peninsula Land Conservancy will present a virtual discussion with local South Bay filmmakers Douglass M. Stewart, Jr. and Timothy Branning about their documentary film, “Chesley Bonestell: A Brush with the Future,” at 4 p.m. on Jan. 29. A pioneer in space art, Bonestell helped popularize manned space travel. Also joining the discussion will be renowned space artist Ron Miller, a co-producer of the film, and local rocket engineer Rocco Lardiere. Tickets to the discussion are $30. For tickets, go to pvplc.org/event/chesleybonestell.\nEducators to be honored\nPalos Verdes Peninsula Rotary is preparing to honor nine outstanding educators from public and private schools on the Peninsula. Now in its 42nd year, “Educator of the Year” will take place on Feb. 9 at Palos Verdes Golf Club. There will be a pre-event reception at 5:45 p.m., followed by dinner and the program. Send ticket orders and checks ($90 each, payable to PVP Rotary Foundation) to Julia Parton, Malaga Bank, 27450 Hawthorne Blvd., Rolling Hills Estates, CA 90274. Information: rotarypvp.org",
  "word_count": 1543,
  "scraped_at": "2026-02-14T13:35:01.003891"
}