{
  "article_id": "7087abbae757",
  "url": "https://saharareporters.com/2026/01/19/caf-says-morocco-favourite-competitions-other-countries-claim-they-lack-resources-host",
  "title": "CAF Says Morocco Is Favourite For Competitions As Other Countries Claim They Lack Resources To Host Tournaments",
  "date": "20260119T164500Z",
  "domain": "saharareporters.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Speaking in a video seen by SaharaReporters while addressing journalists, the CAF President, Patrice Motsepe, said most countries shy away from hosting continental competitions because they consider them financially unviable.\nThe Confederation of African Football (CAF) has said that Morocco’s frequent emergence as host of major African football tournaments is largely due to the inability of many other African countries to finance and organise such events.\nSpeaking in a video seen by SaharaReporters while addressing journalists, the CAF President, Patrice Motsepe, said most countries shy away from hosting continental competitions because they consider them financially unviable.\n“Let me give you an example. I ask in CAF, we’ve got Futsal. I open a bid for six months and nobody submits an offer because they lose money,” he said.\nAccording to him, a similar situation occurred with the CAF Women’s Champions League, where no country initially showed interest in hosting the tournament.\n“I open a bid for the Women’s Champions League, nobody puts a bid because they lose money. And what happens? Morocco comes and says, ‘I’ll help you.’ And sometimes another country comes and says, ‘I will help you,’” he added.\nThe CAF president noted that this recurring pattern has resulted in the same countries, particularly Morocco, repeatedly hosting CAF competitions, not necessarily because of favouritism but due to the lack of alternatives.\n“And what that leads to is that we’ve got lots of competitions where it’s often the same countries,” he said.\nHe explained that many governments across the continent openly admit they lack the financial capacity and infrastructure required to host such tournaments.\n“Partly it’s because the others don’t — the government say, ‘We don’t have the money, we don’t have the resources,’” he said.\nDespite the challenges, the CAF president insisted that the football body remains committed to developing the game across Africa and encouraging more countries to invest in sports infrastructure.\n“We have to move on and develop African football and encourage those others as well to build their infrastructure because we’ll get there,” he said, expressing optimism that more countries would eventually begin to bid to host CAF competitions.\nMeanwhile, African Legend and Super Falcons sensation, Asisat Oshoala a few days ago publicly criticised CAF for its perceived over-reliance on Morocco as a host nation for major tournaments and awards ceremonies.\nThe prolific striker passionately advocated for a more equitable distribution of hosting opportunities across the African continent, urging other nations to step forward.\nOshoala took to social media platform X to voice her concerns regarding the concentration of African football events in the North African country.\n“The big question here is when will this whole @CAF_Online compensation to Morocco end? Awards, tournaments and all… it’s getting boring now,” she posted. “We need other countries to step up. Everything concerning African football happens in Morocco; it feels like that’s the new HQ.”\nThe six-time African Women’s Footballer of the Year went further, proposing that Nigeria possesses the capability to successfully stage the prestigious Africa Cup of Nations (AFCON) through a collaborative effort with its neighbouring countries.\nShe highlighted the geographical proximity of nations such as Cameroon, Ghana, Benin, and Togo, suggesting that a co-hosting arrangement is a viable option, provided there is sufficient commitment.\n“We can co-host with our neighbours if we are serious,” Oshoala asserted. “Cameroon, Ghana, Benin, Togo are all next door… you can’t tell me two of these five neighbouring countries can’t co-host AFCON.”\nOshoala’s pointed remarks come amidst Morocco’s escalating influence within African football.\nThe nation is currently hosting the 35th edition of the TotalEnergies CAF Africa Cup of Nations, with CAF frequently commending its modern infrastructure and organisational prowess as pivotal factors in its selection.",
  "word_count": 614,
  "scraped_at": "2026-02-14T12:51:34.075293"
}