{
  "article_id": "70d2c5247399",
  "url": "https://www.twtd.co.uk/ipswich-town-news/46752/ashton-announcements-on-training-ground-and-cobbold-stand-in-next-few-weeks",
  "title": "Ashton : Announcements on Training Ground and Cobbold Stand in Next Few Weeks - Ipswich Town News",
  "date": "20240302T004500Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Friday, 1st Mar 2024 21:19\nTown CEO Mark Ashton, speaking in a wide-ranging interview with Blues legend Matt Holland for TownTV along with manager Kieran McKenna, has revealed that the club will make announcements regarding the planned training ground developments and the longer-term aim of replacing the Cobbold Stand in the next few weeks.\nAshton said earlier in the season that the training ground would be the next big project for the club with planning permission for an extension to the gym recently granted but with much more significant work to come.\n“There’ll be infrastructure programmes, we’ve got some work to do on the West Stand, potentially complete the [executive] box level to give us some more space,” the CEO said.\n“But I think over the next two or three weeks, you’re going to see some additional announcements coming out of the football club, particularly in relation to the training ground. That is probably the next biggest project that we’ve got.\n“We’ve got initial designs now in place. Kieran’s had a quick look at those and we’ll be presenting those to the players probably in the next seven to 10 days. Kieran then gets to get his hands on the design and tweak and turn and play with it.\n“And then we’ll go into a planning process and we’ll look to progress. That’s going to be a huge programme of development.\n“Timescale? If everything went well, I’d like to be on site as soon as we’re through planning and I’d like to get through planning this summer.\n“The three pitches are up and running, so that’s an advantage, we haven’t got to wait for the pitches to be built. They will get better this summer and be better again for next season.\n“But the building is key because we need to give Kieran and the staff a professional environment.\n“That will allow us to alter the facilities that we’ve got and enhance the facilities for our academy and enhance our facilities for [manager] Joe [Sheehan] and the women’s team. So it’s a major redevelopment at the training ground.”\nRegarding the redevelopment of the more-than-50-years-old Cobbold Stand, he added: “It’s on the agenda. There will be information coming out of the club probably in the next two or three weeks in relation to that. That is not the next project, for sure. Let me just manage expectations on that.\n“We are working with architects, we’re working with the local authority on a scale and bulk on what that stand will need to look like and we’re pretty much down the line on that.\n“But that would not be an imminent build project. We’ve got other projects that sit well ahead of that. But it’s something that’s on our horizon and there’s a lot of work going into that.”\nReflecting on the January transfer window, Ashton added: “I think [Financial Fair Play] had an impact across the board. We were really focused on what we wanted to do from the summer window.\n“That changes when George Hirst gets injured, but I think if you look at it nationally across all the divisions it was a dry window.\n“That’s not necessarily clubs not having the cash but them being up against Financial Fair Play limits, whether that’s P&S [profit and sustainability in the Championship] or SCNP [Salary Cost Management Protocol] in Leagues One and Two, so you didn’t see much movement.\n“You didn’t see much movement in the Premier League and [therefore] that didn’t cascade down into the Championship.\n“It meant that the markets weren’t there that are normally there to trade into.\n“There were players that you would enquire about that we’d been looking for a while and it wasn’t that you couldn’t do a deal on those players, but because that club couldn’t necessarily get a replacement in, which again affected to food chain, so you couldn’t conclude the deals.\n“I think it was a challenge but I think everything that we’ve done since we took over the club has been brave and bold, we’ve tried to be front-footed, we’ve tried to attack everything that we’ve done, whether that’s on the pitch or off the pitch, and I think we ended up in a fairly good place. I think it was another solid window that helped us progress.”\nMeanwhile, Ashton says the club’s US owners are delighted with the club’s on-field progress this season.\n“Really, really pleased,” he said. “We’re in communication all the time. I’m doing a lot more travelling, I’m backwards and forwards to the US.\n“They’re fantastic, Ed Schwarz plays a real lead role in this, ORG representing Mark Steed and the pension fund [Arizona’s Public Safety Personnel Retirement System].\n“Brett [Johnson], Berkay [Bakay] and Mark Detmer, the Three Lions, are consistently in touch and they’ll be here again for the Sheffield Wednesday game.\n“They’re the first people on the phone directly after the game. Fantastically supportive.”\nPhoto: ITFC\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nVery exciting news.\nYou can tell how hard they have been working to turn the club around. Yes, they are getting well paid; however, we shouldn't lose sight of the big sacrifices they are making (in terms of very long hours being committed to the cause) to help turn the ITFC ship around. So it's a very big thank you from me for all their efforts.\nYou've (all the staff and players) made my son finally proud to support Town (and that means a lot!),and bear in mind he's the only Ipswich fan in his entire school living here out on a limb in Norfolk! He's working on bringing more over from the dark side! He's had several school friends ask if they can come and watch the games, but it's so hard to get tickets now (which is obviously a good thing!), especially in the same area as where we already sit. But it's a good sign that some are asking to come instead of wanting to go and watch Norwich.\nIndiana Jones and the Last Crusade.\nOn the new Cobbold Stand side of things, I would love to see another tier of 6k or 7k\nBuilt over the present one with a roof that links up with the North and South Stands.\nBuild that over a season then remove the old roof in the close season, same as Liverpool have done and which has just been finished.\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 1090,
  "scraped_at": "2026-02-14T13:11:09.741495"
}