{
  "article_id": "70dd75584933",
  "url": "https://www.mediapost.com/publications/article/412735/why-bad-bunny-review-was-bad-tv-blog.html",
  "title": "Why Bad Bunny Review Was Bad  TV Blog  ",
  "date": "20260212T010000Z",
  "domain": "mediapost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Part 3: Speech & \"Die With A Smile\" (English Song)\n\"[Music from Puerto Rico, from the neighborhoods, the housing projects...] She comes around there. She never arrives alone. She never arrives alone. All the bandits who are the... hey, hey. Tonight what there is... Perreo, baby. ...baby. Castrated [likely mis-transcription of 'Bellacoso'/lustful] baby, down to the floor baby. Don't quit baby. In the disco baby. Hey, hey, perreo baby... baby. The Latinos baby... Good afternoon California. My name is Benito Antonio Martínez Ocasio. And if I am here today at Super Bowl 60 it is because I never, never stopped believing in myself. You should also... you should also believe in yourself. You are worth more than I think. Believe me. By the power vested in me, I pronounce you husband and wife. You may kiss the bride. [Singing in English]: Lost in the word that we... I don't even want to do this anymore 'cause you know what you mean to me and I love the only fighting for wherever you go that's where... Nobody promised... So I love you every night like it's the last night. Like it's the last night. If the world was ending I'd want to be next to you. The party was over and our time on earth was true. I want to hold you just for a while and die with a smile.\"\n\"While one is alive one must love as much as possible. I can't forget you. No, I can't erase you. You taught me to love, you taught me to dance. And I had many girlfriends but none like you. I don't have my sun, I spend my time on the moon. If you think of yourself, I'll jump right away. Hey my devil... drives me crazy. Hey my devil... drives me crazy. Oh. Dance, dance, dance without fear. Love without fear. New York. Okay. If you want to have fun... you just have to live. Where to? A summer in New York, New York. If you want to have fun with the... But what is this San Francisco? Enjoy that this is just for a little while. Hey, hey, hey. 4th of July hanging with my drunk cousin... in the Bronx. Right? There is... by the big notch/night. There is Willy Colón, they call me the bad one. Hey, why do the years pass and I keep having hits ('dando palo')? Selling records like a cold painting... Yes, yes... pink. Eh, eh, don't get confused. No, no... Hey, a shot of cognac... She feels close. I have the championship, no one takes it from me.\"\nPart 6: Finale & Roll Call",
  "word_count": 441,
  "scraped_at": "2026-02-14T12:53:49.488982"
}