{
  "article_id": "71043f64a4f7",
  "url": "https://www.aol.co.uk/articles/idris-elba-torvill-dean-lionesses-223000264.html",
  "title": "Idris Elba , Torvill and Dean , Lionesses and Red Roses lead honours list",
  "date": "20251229T233000Z",
  "domain": "aol.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Idris Elba, Torvill and Dean, Lionesses and Red Roses lead honours list\nIdris Elba and ice dancers Jayne Torvill and Christopher Dean lead the New Year Honours list while England’s victorious women’s football and rugby teams are also recognised.\nSir Idris, 53, known for his roles in The Wire and Luther, is knighted for services to young people, having founded the Elba Hope Foundation, which supports community empowerment, education, youth advocacy and sustainable development.\nHe said: “I receive this honour on behalf of the many young people whose talent, ambition and resilience has driven the work of the Elba Hope Foundation.\n“I hope we can do more to draw attention to the importance of sustained, practical support for young people and to the responsibility we all share to help them find an alternative to violence.”\nDame Jayne and Sir Christopher, who took home the Olympic gold at the 1984 Winter Games and saw success at the World, European and British Championships, are made a Dame and Sir for services to ice skating and to voluntary service.\nThe pair, who later became the faces of celebrity competition show Dancing On Ice, said the honour is “wonderful and humbling at the same time”.\nSir Christopher, 67, said: “It’s been mentioned by fans and supporters, but it’s something that we never realised might happen.\n“If it did, that would be wonderful, but if it didn’t, there’s so many other people in the country that are deserving as well.”\nDame Jayne, 68, said the timing of the honours seemed “perfect” after the pair danced on the ice for the last time this year.\nShe said: “We had such a great time, we were so happy with the tour and the fact that we got through it.\n“It was a big thing for us to mark our career before retirement, and then receiving this award at the end of the year, it’s just finished everything. It’s perfect.”\nThey join other stars who rose to fame in notable partnerships, such as Paul Elliott, one half of the Chuckle Brothers, who is made a Member of the Order of the British Empire (MBE), and Matt Lucas, half of the comedic Little Britain duo with David Walliams, who becomes an Officer of the Order of the British Empire (OBE).\nEngland’s Lionesses feature heavily on the list after their Euros win in the summer – with captain Leah Williamson made a Commander of the Order of the British Empire (CBE).\nAlex Greenwood, Keira Walsh, Georgia Stanway and Ella Toone, who were all part of the side that beat Spain in the final in Basel, Switzerland, in July, become MBEs.\nAnd the team’s Dutch manager Sarina Wiegman, who has won the Euros twice with England, and once with the Netherlands, is awarded an honorary damehood, the Cabinet Office said.\nWiegman said: “I would like to express my sincere gratitude for this honour. When I first arrived in England, I could never have imagined the respect and warmth I’ve experienced from the English people. I deeply thank the fans for their support.”\nMembers of England Women’s Rugby World Cup winning squad are also strongly represented, with Marlie Packer and Zoe Aldcroft becoming OBEs, along with coach John Mitchell.\nMitchell said: “I am incredibly honoured to receive this recognition, but I want to be clear that it reflects the work of the Red Roses World Cup-winning squad and the outstanding staff around them.”\nAldcroft said: “The recognition isn’t mine alone. This year I have felt nothing but love and support from so many people and I am extremely grateful.\n“My family’s belief in me on this journey has been unrivalled, and I am also fortunate to have been surrounded by an unbelievable group of players and staff who have given everything to the Red Roses.”\nTeammates Ellie Kildunne, Sadia Kabeya, and Megan Jones are made MBEs after the Red Roses defeated Canada in the final in September.\nPaula Radcliffe, a three-time London Marathon winner who held the women’s marathon world record for 16 years, is made an OBE.\nElsewhere, The Kumars At No 42 actress Meera Syal, 64, becomes a Dame and broadcaster Gabby Logan, actor Warwick Davis and presenter and author Richard Osman are made OBEs.\nOsman, 55, who writes The Thursday Murder Club book series, said he was “absolutely thrilled” with the honour.\nWicked star Cynthia Erivo is made an MBE for services to music and drama, while football commentator Clive Tyldesley, known for his “Solskjaer has won it” line as Manchester United claimed the 1999 Champions League, becomes an OBE for services to sports broadcasting and to charity.\nWriter Roy Clarke, creator of sitcoms Last Of The Summer Wine, Open All Hours and Keeping Up Appearances, becomes a knight.\nA woman thought to be the oldest victim of the Horizon IT scandal, 92-year-old Betty Brown, said it was a “shocker” to have been made an OBE for seeking justice for subpostmasters.\nD-Day veteran Mervyn Kersh, 101, said it is a “wonderful thing” to be awarded a British Empire Medal (BEM) for services to Holocaust remembrance and education.\nPrime Minister Sir Keir Starmer said: “This year’s honours list celebrates the very best of Britain – people who put the common good ahead of themselves to strengthen communities and change lives.\n“Their quiet dedication speaks to the decent, compassionate country we are proud to be. On behalf of the whole nation, thank you – and congratulations to everyone recognised today.”\nThis year’s honours list includes 1,157 recipients, with 67% living outside London and the South East.\nHalf of all recipients at CBE level and above are women, marking the strongest representation since 2020, the Cabinet Office said.\nAcross the list, 10% come from ethnic minority backgrounds — including 5% Asian, 3% Black, 2% mixed and 1% other.\nIn addition, 5% identify as LGBT+, 15% report a disability or long-term health condition and 36% come from lower socio-economic backgrounds.\nThe oldest on the list is 102-year-old John Hearn, one of four centenarians included, who receives a BEM for services to Judo and to the community in north-east England.\nAt 20, the youngest recipient this year is Olympic gold medal-winning sports climber Toby Roberts from Elstead in Surrey, who becomes an MBE.",
  "word_count": 1039,
  "scraped_at": "2026-02-14T13:07:14.174364"
}