{
  "article_id": "7106a649dfd8",
  "url": "https://www.twtd.co.uk/ipswich-town-news/27466/the-ex-files-craig-forrest/onthisday",
  "title": "The Ex - Files : Craig Forrest - Ipswich Town News",
  "date": "20240520T210000Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Wednesday, 20th May 2015 12:46 by Blair Ferguson\nIn the 18th part of our regular series, The Ex-Files, Blair Ferguson caught up with giant Town and Canada goalkeeping legend Craig Forrest.\nCraig Forrest is one of those players you look at and wonder how he ever managed to make his way into professional football.\nBorn in British Columbia, Canada, where the main sports were ice hockey and lacrosse, it seemed unlikely that he would make such an impact at a football club so far away from the place of his birth.\nIt was indirectly through playing lacrosse that the chance came for his first foray into football and the start of his journey to England.\n“I was playing in the U13 Canadian Championship lacrosse tournament in Ontario and four or five of the lacrosse guys played in the football team which was a pretty strong side at that age,” he explained.\n“One of the players — he wasn’t a goalkeeper in lacrosse but an outfield player — was the keeper for the football team. He couldn’t get back for this tournament because his family was going to do an RV trip across Canada.\n“So the team was short and they asked me if I was willing to give it a try even though I’d never done it before. And I did and I was terrible!\n“But I enjoyed it at the same time and was intrigued by it and wanted to stay with it and they were happy to keep me on as a back-up when the other guy eventually came back.\n“So I worked specifically with a goalkeeper trainer from that age quite heavily and things went well, to the point that when I was 15 I was in the provincial team, and when I was 16 I moved to England.”\nUntil that time Forrest’s only other sport was judo, which he thinks helped with “throwing himself about and hitting the deck”, and it was the fortuitous meeting with a one-time Town youth player which saw football take him to England.\n“I got really good advice from people in British Columbia, primarily a guy called Phil Trenter, who was actually from Ipswich and had moved over to Vancouver,” Forrest recalled.\n“Phil was great in saying that you need to get over there when you’re 16 because you have potential and you want to be signed on potential, because if you go later then you have to be the finished deal which you probably won’t be if you stay in Canada.\n“So I left school a year early and moved to England and had a trial at Ipswich. I had a trial with West Brom set up and a trial with Dundee United, but I went to Ipswich first and after a couple of weeks they signed me.”\nDespite speaking the same language, his 1984 move to England was still a culture shock for Forrest, who paid his own way to Ipswich in accordance with the agreement with Town chief scout Ron Gray who set up his trial.\nOnce signed by Town a period of adjustment began. With communications technology not what they are now, Forrest’s mum had to get a job just to pay for the $2 a minute phone calls to her son.\nSomething which struck the aspirant goalkeeper was the difference in attitude towards young players in England compared to how they were treated in Canada.\nThe man known as ‘Stacks’ said: “It was just the way at that age you are playing because it’s fun and although you still enjoyed it and it was fun it was also very serious.\n“It was a business, you needed to perform, you needed to show up, you needed to be punctual, you needed to be disciplined and all of these things that went along with it.\n“Unlike in England where people are generally more honest to the youngsters, here they are always very positive and blowing smoke up people and as a decent athlete everyone is always fairly complimentary.\n“You get to that position where you probably aren’t the best in town and you’re going to get told straight up in England that if you screw around you’re gone fairly quickly.\n“I think the first time I was ever told that was by Charlie Woods,” he said laughing before preparing his finest impression for the former Town coach.\n“‘Lads you’re going to be on the next plane home if you don’t get it together!’ So it became very serious and that was a little scary at 16.”\nForrest heeded Woods’s warnings and started to make his way towards the first team via a short loan spell at Colchester in the 1987/88 season where he achieved his goal of playing professional football in England, eventually going on to make 11 appearances for the U’s.\nNext, at the start of the 1988/89 campaign, came the opportunity to become Ipswich’s number one ahead of previous incumbent Jon Hallworth, who was sold to Oldham later in the season. Forrest explains his reaction to finding out the news whilst back in Canada.\n“I was feeling pretty good about myself and went home in the summer and got a call from Ipswich when I was in Vancouver that they intended to start me at the start of the season so to be ready.\n“So I basically shit myself all summer long, which was fine! But when the Stoke game came along [on the first day of the season] it went really well, not so much the game but the preparation for it in the dressing and the great atmosphere and getting to play at that level, it was terrific.\n“You’re anticipating it and you’re quite nervous, they’ve made a big decision, so you don’t want to let anybody down and these sorts of things are going through your mind.”\nEven before making that first appearance at Stoke, which ended in a 1-1 draw, Forrest was aware he was stepping into a team that was coming off the back of a glorious era for Town and he outlines the pressure he felt at the club.\n“When I arrived at Ipswich they were in the First Division and not many years off winning the UEFA Cup and the FA Cup,” he said.\n“I came in at a time after the golden generation and Ipswich fans had really high expectations and those expectations were very difficult to live up to because the players had been sold off.\n“So those were tough times and it was a tough club to go to at that time because when I got in the first team we were in the second tier with the expectation that we should always be winning and be in the top flight.\n“It was different than going to a club that had no history of winning major tournaments, Ipswich were the real deal.”\nThat debut at the Victoria Ground was handed to him by then-boss John Duncan, who he says was “very supportive” and gave him “a lot of belief”, but it was his successor John Lyall who he considers to be the best manager he ever worked under.\nThe former West Ham boss led the Blues to the old Second Division championship in 1991/92 with Forrest ever-present in goal.\nHe said: “To get back in the top flight where Ipswich deserved to be as a club was great. I would say he was the best manager I ever had. He read the game better than anyone I’d ever seen before.\n“Just the way he saw the game as it developed, John Lyall was so far ahead of his day in the way he achieved success with what he had to work with. He just found a way.\n“Sometimes he would come in the dressing room and guys would be like ‘We should be doing this, why aren’t we doing this?’ and he would calmly come in, pour his cup of tea and then tell us how we were going to win the game and often he would find a way.\n“Even when we went to Manchester United, we drew 1-1 and 0-0. I’m fairly sure in the 0-0 game we didn’t even play a striker, he knew that they attacked from the flanks.\n“He played Chris Kiwomya in a wide position so we had no strikers and we just stifled them and they ran out of ideas.\n“It was amazing that he would come up with ideas and tactics that would actually work and it was the first time I’d seen someone try different things, because it was pretty static at the time with everyone playing 4-4-2, but he changed things round and confused some teams.\n“He was terrific and was the major reason that we were promoted. We stayed in the Premier League for three years and they should of never let him go because he managed to keep us up.”\nForrest’s final boss at Ipswich was George Burley, a manager he thinks learnt a lot at the start of his time in charge as the Blues crashed out of the Premier League.\nTalking about this stage of his Town career meant the inevitable discussion of the March 1995 9-0 defeat at Manchester United with some surprising relief on the day for Forrest.\n“I enjoyed working under George Burley too, obviously a legendary player at Ipswich, but when he first arrived as manager I think he learnt a lot when he was there with us.\n“Going down the road I think he learnt so much and became a great manager. But when he first came to us, like the Man U 9-0, the pre-match talk was ‘They wont expect us to attack’. Well yeah, I guess they didn’t!\n“But after a few years I don’t think he would get beaten 9-0 again, he just learned a lot over that period of time as anybody would.\n“That game was tough, it keeps coming up especially when the day comes round. I did actually think when the game was being played that it was 10! So I was actually pretty happy they didn’t hit double figures.\n“It was difficult but as a goalkeeper if you play long enough you’re going to get games like that and it’s very humbling.”\nDespite the record-breaking defeat Forrest is adamant that given the opportunity he would go through it all again just to play in the top flight.\n“I loved playing in the Premier League and if I had the chance tomorrow to go back to Old Trafford and get beaten 9-0 I would absolutely take that opportunity.\n“The stadiums and the atmospheres were amazing and playing at that top level was always my goal, to play in arguably the best league in the world.”\nLate in his time at Town Forrest had the pleasure of witnessing the rise of a young Richard Wright. You get the impression that Forrest always knew Wright would be the man to replace him.\n“A problem for me was going to play international football because somebody comes in, like Richard for instance. I was off playing for Canada and Richard comes in and I get back and they say ‘The kid’s done well, so we’re leaving him in’.\n“I understand that, it’s a risk that I took and it can cost you and it’s just how things work out sometimes.\n“I had a really good relationship with Richard, I knew him when he was around 12-years-old and first started showing up at the club. He was the best 12-year-old goalkeeper I’d ever seen!\n“I think he could have played in the first team and got through it quite easily at 13-years-old, he was unbelievable, unbelievable.\n“I said at the time that this kid will play for England, no question about it and I’m just surprised that he didn’t play more. He was a great kid and has a great family now.”\nWith Forrest by now consigned to the bench, in March 1997 the opportunity came for him to join a star-studded Chelsea on loan and he got to experience a feeling he thinks all top keepers have when playing behind a team of stars.\n“Mick McGiven — John Lyall’s right-hand man — was at Chelsea at the time working as a coach and they had a couple of injuries and they needed some cover.\n“Richard Wright was in the first team and Ipswich said that if I wanted to go there on loan then I could.\n“It was great, it was amazing. In the first five-a-side I had Vialli was playing, Zola, Franck Leboeuf, player-manager Ruud Gullit, they were a real international team, it was insane and incredibly memorable.\n“I would say that playing with that team was the only time in my career when I was behind a team and thought ‘How can we possibly lose!’.\n“That was the only time I felt that, I thought ‘Now I know what it’s like to be Iker Casillas or Peter Schmeichel!’. It’s a totally different feeling.\n“How can we possible lose this game!?” he laughed “Really? We are unbelievably good so we shouldn’t lose!”\nWhile he says that he would have stayed at Ipswich for his entire career if he could have, he enjoyed playing for his other clubs.\nThe opportunity to move to Chelsea on a permanent basis was offered, but the Ipswich board priced Forrest out of a move.\nHe explains: “Just at the end of my loan spell at Chelsea I had to go to Jamaica to play for Canada and the keepers were still injured and the week after I was coming back they had the FA Cup final.\n“Gullit said ‘We’ll play you in that game and then talk to Ipswich and get the deal done and you can play in the FA Cup final against Middlesbrough’. There was no transfer window back then.\n“But Ipswich tried to play hard ball and held them to ransom and Chelsea said ‘We won’t be held to ransom over the FA Cup final’ and I didn’t get to play in it.\n“Not that I deserved to play in because I didn’t play any of the other rounds, but after 13 years at Ipswich I thought ‘Really guys? You could have helped me out there a little bit’.\n“I spoke to Gullit after the FA Cup final and it was still their intention to bring me in and then one of his countrymen Ed de Goey became available and he saw him in South Africa or something like that and next thing you know I’d missed the boat.”\nLondon was still Forrest’s destination despite the switch to Chelsea breaking down with the 6ft 5in tall keeper joining West Ham the following July.\n“I was disappointed because of how well it went at Chelsea,” he added. “But that’s the way it works out.\n“West Ham was a different opportunity and a club with a different feel from Ipswich because it was in London, it was just different.\n“It was a great five years and I really enjoyed it, we had a great run and finished in the top 10 every year so there were no issues there and Upton Park was a fortress for us.\n“We didn’t have to worry about driving past the Boleyn pub on the corner of Green Street where they would jump on players’ cars very often. That was the biggest worry!\n“We had terrific characters like John Moncur, Neil Ruddock, Stuart Pearce, Nigel Winterburn, John Hartson, Rio Ferdinand, Frank Lampard, Michael Carrick, Glen Johnson, Joe Cole, it was unbelievable the young talent that club had.\n“If they could only have kept them together, it would have been something special.”\nHe continued: “Harry Redknapp had a great eye for players. He had no problem bringing in Paolo Di Canio, Neil Ruddock, Julian Dicks, John Hartson and the list goes on of tough characters to deal with.\n“He had a knack of doing that which was very interesting, just be able to put a team together and knowing the pieces he needed to put them together.”\nForrest enjoyed his time at West Ham but in 2001, while he was negotiating a contract extension, he discovered he had testicular cancer, which would ultimately end his career.\n“It was a difficult time, I’m not going to lie,” he said. “From a footballing point of view at least I was 35 and I’d been playing for a long time, I didn’t want to retire and was sort of forced into it a little bit.\n“Prior to getting testicular cancer I was negotiating a one-year extension at West Ham and me and my agent thought we could get a two-year deal because I was only 35.\n“This was ongoing and there was no pressure or hurry but then I got testicular cancer and went away.\n“When I came back we said that under the circumstances we wanted a two-year deal but I’d accept a one-year deal and prove I can play again and take it from there.\n“But they said ‘No, the deal isn’t on the table any more, we’re going to release you’.”\nThis news came as a shock to Forrest who still thought he had more to offer and he felt let down by West Ham because they made it difficult for him to go anywhere else, as he explains.\n“I felt disappointed because they backed me into a corner where all of a sudden I was damaged goods.\n“Managers wanted to take a chance on me but nobody really wanted to because if something went wrong the warning signs were there and the chairman would go ‘You brought in this guy, he just had cancer, what are you doing?’ .\n“So it put everybody in a difficult position so I wasn’t feeling particularly great and I still hadn’t gotten over the chemo treatment and the effects of that so I decided to retire.”\nHaving returned to Canada there was an opportunity to make a comeback aged 39 with the fledgling Toronto FC MLS franchise in 2007, and although he attended a trial it was only to see if he could play at a professional level with no real intention of signing for the club.\nIn addition to his club career, Forrest featured and was named the tournament’s Most Valuable Player in Canadian football’s greatest success when he and future Town skipper Jason De Vos lifted — with a small amount of struggle — the 2000 CONCACAF Gold Cup, which also got them an invitation to the Copa America.\n“It’s a big trophy!” he said laughing. “All cups should be massive and weigh about 200lbs!”\n“In the programme they had us ranked 12th out of the twelve teams! We thought that was pretty funny and we didn’t care.\n“That was a great tournament and that also got us in the Confederations Cup in Japan, which was amazing.\n“It also got us invited to the Copa America which was unbelievable and I was really looking forward to that, but it was in Columbia and at that time there was a lot of violence and drug cartels threatening to kill everybody and threatening to kill players.\n“So our government withdrew us from that tournament so we didn’t get to play in that.\n“At that time I wasn’t sure if we should go because it was really bad. I’d been in South and Central America before and been in positions where I didn’t feel the authorities were completely in control of what was going on and I understood why we didn’t go.\n“But Honduras jumped in our spot, they were like ‘It’s worse in Honduras than it is there!’. I think they did quite well actually!”\nAs one of Canada’s greatest ever footballers Forrest - he won 56 full caps - it was recently announced that he is to be inducted into the Canada Sports Hall of Fame, making him one of only five footballers ever to have been afforded the honour, which is a source of immense pride for a man who loved playing for his country.\n“I heard they’d been talking about it and there are only five footballers in the Canada Sports Hall of Fame, two of them are women, so football doesn’t get a lot of talk here.\n“It was an honour because people recognised me in a culture where football isn’t as important as ice hockey.\n“I think it was because I played in arguably the best league in the world in a world sport and they saw a lot of value in that. Probably winning the Gold Cup had an effect because there was some exposure. It was a really great honour and I’m very proud of that.”\nThe former keeper, now 47, is a pundit on Canadian television, a role he started preparing for during the 1998 World Cup, and one he is grateful to have because it keeps him in the game he loves.\n“I knew there were some opportunities over here to do television and I was preparing myself years before when I did the 1998 World Cup and Euro 2000, so I got into it a little bit to see if I was any good at it and if I liked it and they liked me.\n“Because I had that experience they were open to giving me a full-time position and I took it.\n“I really do enjoy it, it’s not the same buzz as playing, but there is something about doing live television that keeps you on edge because you don’t know what’s going to happen next and mistakes are going to happen and you have to do things on the fly. So I enjoy that side of things and it gives me a bit of a buzz that way.\n“There are a lot of the professionals that get depression from having their umbilical cord cut from football completely because it’s all they know.\n“I can understand that and why they get really low. I’ve never had that happen to me because I’ve always had a connection to the sport and that has made retiring a lot easier because I’m still involved in the game.”\nYou can read all the previous Ex-Files here.\nPhoto: Action Images via Reuters\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nI always liked Craig. His save from Andy Thompson at Molyneux in the '94 Cup Game is one of the best I've seen, bullet header into the top corner and he somehow got there.\nSuperb goalie and proud we had him at Ipswich. Sounds like a great bloke too.\nAnd Forrest was always going to be better than Woods, more trees and everything :-D\nIn the context of wider debates about player power, this article is also a reminder that even if players have too much power now they certainly had too little pre-Bosman. I guess it's a cruel twist of fate that when there was little money in the the game, the players had little power, and now, when arguably they need the power less, as there is so much more money in the game they actually have more power.\nNeither the actions of Ipswich nor West Ham show the clubs in the best light, at least with hindsight.\nNorwich are not the real deal for that very reason.\nYea it does bring back memories of that 9-0 defeat at man utd, but from memory we beat them at our place that season.\nSo the next time a man utd fan mentions it, just say it finished even that season 3 points each!\nAnyone else remember how Norwich treated our heavy defeat at Old Trafford? They put the score on their scoreboard as Manchester United 9 Scum 0 and the person responsible was sacked more or less straight away.\nRegarding the 3-2 Man Utd result, I was there (Man Utd had Ince, Giggs, Cantona so a strong team). My sister joined me and my Dad (which was weird) because a certain Ryan Gigs was playing. I remember Giggs running onto the pitch with my sister screaming \"Ryan!\" at the top of her lungs and at a pitch only dogs can hear. She stopped once she saw he had shaved his hair and the \"curtains\" hairstyle was no more. Paul Mason scored the first for Town and another Canadian star, Frank Yallop, blasted in the third from 30 yards out. Portman Road went ballistic! Ferguson was so upset at full time when Man Utd walked in he sat them down, turned off the light and shut the door. Ferguson wouldn't speak to the press and sat on the Man Utd bus for the next half hour playing cards.\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 4139,
  "scraped_at": "2026-02-14T12:08:44.384562"
}