{
  "article_id": "711213567156",
  "url": "https://screenrant.com/bend-it-like-beckham-sequel-casting-details/",
  "title": "Keira Knightley Iconic Sports Movie Is Getting A Sequel 23 Years Later",
  "date": "20250727T124500Z",
  "domain": "screenrant.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A sequel is officially in the works for Bend It Like Beckham, the British cult sports hit starring Parminder Nagra and Keira Knightley. The original movie, which debuted in the UK in 2002 and in the US in 2003, followed Nagra's Jess and Knightley's Jules as they played for a small amateur women's team in London and pursued their dream of a soccer career in the States.\nNow, 23 years later, director and writer Gurinder Chadha has confirmed to Deadline that she's working on a sequel. The BAFTA-nominated filmmaker has teamed up with the current head coach of the US women's national soccer team and her husband and co-writer, Paul Mayeda Berges, to develop the concept and script.\nChadha told Deadline that she'd finally come up with an idea for the sequel \"last month,\" 23 years after the movie's original premiere.\n“I didn’t want to do anything because I didn’t have a story. And then I came up with a great story, really super-cool story. So now I’m inspired. Literally came up with it just about a month ago. It’s my very clear wish to bring the characters back very, very soon. Women’s football is more competitive, more exciting, and more global than ever. It is an honor for me to be a small part of it.”\nChadha also revealed that the film's stars, including Naga, Knightley, Archie Panjabi, who played Jess's sister Pinky, and Juliet Stevenson, who played Jules's mother, Paula, have all been informed of the sequel's development, as have other former cast members. Whether they'll sign on depends on the script, Chadha said.\n“Everything hinges on the script and if the original cast likes it. I am working really hard to make sure every character I bring back has a decent arc and scenes.”\nThis Is The Perfect Time For A Bend It Like Beckham Sequel\nWomen's Soccer Is More Popular Than Ever\nAs Chadha told Deadline, women's professional soccer has become a global phenomenon, with national leagues, the UEFA Women's Euros, the South American Copa América Femenina, and the FIFA Women's World Cup receiving more funding, exposure, and viewership than ever before. In the UK, for instance, ITV earned its biggest ratings night of the year earlier this week with the Euros' semi-final match between England and Italy (via RadioTimes.com)\nThere's still a long way to go before women's soccer reaches the financial heights of the men's game, but the leap from 2002 has been astonishing. That success has bled into pop culture. Now, even Apple TV+'s massive streaming hit Ted Lasso will feature Jason Sudeikis' return to AFC Richmond to coach its newly formed second-division women's team in season 4.\nOur Take On Bend It Like Beckham 2\nWhat Happened After Jess And Jules Went To America?\nGiven the break between installments, there's a lot Bend It Like Beckham 2 could do with its story. How did Jules and Jess fare in America after they received their soccer scholarships? Did Jess ever end up playing for England, like her hero David Beckham? Did she and Joe (Jonathan Rhys Meyers) work out long-distance? Did Jules stay in America to play for a league club?\nWith women's soccer's boosted popularity, it'll be interesting to showcase how they fit into this new world. If Nagra and Knightley reprise their roles, and if their characters enjoyed semi-professional or professional careers, they'll likely have retired by now. It'd be great to see them return to their roots and coach other young hopeful girls, training the next generation of players.\nHopefully, everything clicks for Bend It Like Beckham's sequel, and Chadha can achieve her goal of getting the movie into cinemas in 2027, 25 years after the original's premiere and the same year as the next FIFA Women's World Cup in Brazil.\nSource: Deadline\n- Release Date\n- April 12, 2002\n- Runtime\n- 112 min\n- Director\n- Gurinder Chadha\nCast\n-\nParminder Nagra\n-\nJonathan Rhys Meyers\n-\nAnupam Kher",
  "word_count": 661,
  "scraped_at": "2026-02-14T12:43:56.975758"
}