{
  "article_id": "712a93da7e7b",
  "url": "https://dailytrust.com/dembele-bonmati-crowned-at-2025-ballon-dor-awards/",
  "title": "Dembele , Bonmatí crowned at 2025 Ballon dOr awards – Daily Trust",
  "date": "20250923T021500Z",
  "domain": "dailytrust.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Paris Saint-Germain and France star Ousmane Dembélé has been named the world’s best player, clinching the prestigious 2025 Men’s Ballon d’Or after a stellar season for club and country.\nDembélé, instrumental in PSG’s historic treble-winning campaign last season—the first ever by a French club—edged out Barcelona’s teenage sensation Lamine Yamal to secure the men’s crown.\nIn Ligue 1, Dembélé plundered 21 goals and eight assists in 29 appearances, sharing the division’s top scorer award and earning a spot in the Team of the Year, but it was his performances in the Champions League which really boosted his push for the Ballon d’Or.\nOn the women’s side, Spain’s midfield maestro Aitana Bonmatí made history by winning her third consecutive Ballon d’Or. At just 27, the World Cup winner and three-time Champions League champion continues to redefine excellence, becoming one of the few players ever to achieve such dominance on the global stage.\n- FG urged to set up mobile soil testing labs\n- Constitution review, security top agenda as N/Assembly resumes\nHer latest triumph cements her status as not only the best in the world today but also as a trailblazer in women’s football history.\nParis Saint-Germain goalkeeper Gianluigi Donnarumma has been crowned the 2025 Men’s Yachine Trophy winner, following his outstanding performances during PSG’s exceptional 2024/25 season. On the women’s side, England shot-stopper Hannah Hampton claimed the Women’s Yachine Trophy.\nIn the coaching category, Luis Enrique of PSG secured the Men’s Johan Cruyff Trophy, while England manager Sarina Wiegman earned the Women’s Johan Cruyff Trophy for her continued success with the Lionesses.\nSpanish and Barcelona teenage sensation Lamine Yamal made history by winning the Men’s Kopa Trophy for the second consecutive year, becoming the first player ever to achieve back-to-back victories. Fellow Spaniard Vicky Lopez took home the Women’s Kopa Trophy, underlining Barcelona’s bright future.\nIn the scoring category, Barcelona striker Ewa Pajor was honoured with the Women’s Gerd Müller Trophy, while Arsenal’s prolific forward Viktor Gyökeres claimed the Men’s Gerd Müller Trophy, recognizing their incredible goal-scoring feats over the past season.\nArsenal have been crowned Women’s Club of the Year, while Paris Saint-Germain claimed the Men’s Club of the Year title at the 2025 Ballon d’Or ceremony, celebrating their outstanding performances over the past season.\nThe prestigious Socrates Award was presented to the Xana Foundation, an organization dedicated to supporting children and young people battling life-threatening illnesses. The foundation was established by PSG coach Luis Enrique in memory of his daughter, Xana, who passed away at the age of nine in 2019 after a rare form of bone cancer.\nIn the same vein, in a proud moment for Nigeria, Super Falcons goalkeeper Chiamaka Nnadozie earned global recognition after being ranked the fourth-best goalkeeper in the world. Currently starring for Paris FC in France, Nnadozie continues to cement her place among the elite.\nThe 24-year-old first rose to worldwide prominence at the 2023 FIFA Women’s World Cup, where she was named Player of the Match in Nigeria’s stunning victory over hosts Australia. Her consistent brilliance between the posts has since made her a regular in global award conversations.\nUPDATE NEWS:\nNigerians can now invest ₦2.5 million on premium domains and profit about ₦17-₦25 million. All earnings paid in US Dollars. Rather than wonder, click here to find out how it works.",
  "word_count": 551,
  "scraped_at": "2026-02-14T12:36:36.166246"
}