{
  "article_id": "712c621d7da1",
  "url": "https://menafn.com/1107599682/Messi-Mbappe-Haaland-Finalists-For-Fifa-Best-Mens-Player-Award",
  "title": "Messi , Mbappe , Haaland Finalists For Fifa Best Men Player Award",
  "date": "20231214T201500Z",
  "domain": "menafn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Messi, Mbappe, Haaland Finalists For Fifa Best Men's Player Award\nLionel Messi and Aitana Bonmati were named as finalists for the FIFA best players of the year awards by world football's governing body on Thursday.\nErling Haaland and Kylian Mbappe are the other nominees for the FIFA men's best player award, with Bonmati's Spain teammate Jenni Hermoso and Colombian teenage sensation Linda Caicedo also named on the women's shortlist.\nMessi was awarded a record-extending eighth Ballon d'Or crown in October in Paris, while Bonmati took the women's prize after starring for Spain in their Women's World Cup triumph.\nThe awards ceremony will take place in London on January 15.\nThe men's finalists were named based on performances from December 19, 2022 until August 20 this year, with the women's decided by achievements between August 1, 2022 and August 20, 2023, the day of the World Cup final.\nMessi won his second FIFA best player trophy last year after helping Argentina win the World Cup.\nHaaland, who finished second to Messi in the Ballon d'Or voting, scored 52 goals in his first season at Manchester City last term to help the English club to a treble of Premier League, FA Cup and Champions League titles.\nFrance striker Mbappe scored 41 goals in all competitions to help Paris Saint-Germain win Ligue 1.\nBonmati and Hermoso both scored three goals in the tournament as Spain lifted the Women's World Cup for the first time, while Bonmati also won the Women's Champions League with Barcelona last season.\nHermoso was forcibly kissed by then-Spanish football federation president Luis Rubiales following Spain's 1-0 final win over England, sparking a huge controversy and his eventual resignation.\nCaicedo, 18, starred in Colombia's run to the World Cup quarter-finals and has since signed for Real Madrid.\nALSO READ:\n- Howe wants 'magical European night' as Newcastle bid to stay in Champions League\n- Only bleak reality in Theatre of Dreams as Man United hit devastating new low\n- Al-Ittihad cruise to 3-0 win over Auckland City at Club World Cup\n- Man City chase full house of trophies at Club World Cup in Saudi Arabia\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 412,
  "scraped_at": "2026-02-14T12:46:51.201159"
}