{
  "article_id": "717a0f98a62a",
  "url": "https://www.miragenews.com/galic-way-you-play-is-way-you-are-1188380/",
  "title": "Galic : Way You Play , Is Way You Are",
  "date": "20240306T033000Z",
  "domain": "miragenews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "17-year-old Daniela Galic has continued to impress since bursting into Australian football consciousness at the FIFA U20 Women's World Cup Costa Rica 2022™.\nShe has nearly two years of senior club football for Melbourne City under her belt, with an impressive 10-goal contribution - six goals and four assists - in 17 games this season. She was called up as a train-on by Tony Gustavsson in the most recent CommBank Matildas camp.\nGalic is playing a key role at the AFC U20 Women's Asian Cup Uzbekistan 2024™ and, if qualification is secured, the FIFA U20 Women's World Cup Colombia 2024™ as well.\nWhen watching Galic play, it can seem as if time stops when she has the ball at her feet. Her relaxed running style when matched with her superb technical ability makes it seem like she glides along the pitch, leaving defenders in her wake.\nIt is no surprise, given those attributes, that she models her game off Dutch international and Arsenal forward Vivianne Miedema.\n\"I think I'm a creative footballer,\" she mused. \"I like to dribble and go forward a lot, score goals and shoot.\"\n\"[I'm] Just trying to create a chance every time I get the ball. Even if it doesn't seem possible, I try to find a way to create a goalscoring opportunity for myself or my teammates.\"\nTo the midfielder, football is an \"escape,\" and a way to express herself.\n\"When I go on the pitch, I just forget about everything else,\" she explained. \"It's just you and the ball, and the team obviously. It's an escape and another way to express yourself and your personality. I think the way you play, is the way you are, in a way.\n\"From a really young age, I always knew I loved it [football]. I still have the same love for it now. I think it's always just been there, and I've always loved it. I've never really dreaded it, so I think that just shows that it is my type of game.\"\nDespite her obvious drive on the pitch, the softly-spoken, self-described, \"chill\" youngster values her time away from football as well.\n\"I like spending time with my friends, having a chat and a laugh,\" she said. \"Those are the best times, I think.\n\"Alexia [Apostalakis], my roommate, we hang out a lot… we laugh a lot about random things. So that's good.\"\nIt was her family who inspired her to first get involved in the game. Both her parents played - her mother as a defensive midfielder, and her father as a striker. As an attacking midfielder, she happily credits both her parents for her playing style.\nHer family continues to be a pillar of support.\n\"They get really into the games, sometimes more than me!\" she joked. \"I think everyone in the family just loves it and loves watching me play,\" she said.\n\"After games, I see videos of my family coming together to watch my games. I wish I was there with them! If I was, it wouldn't happen, so I have to be out on the pitch, but I think it's really nice to see that connection because of football.\"\nGalic understands the connections and growth football offers off the pitch and speaks with nothing but gratefulness for the opportunities that the game has given her in her 17 years so far.\nHowever, she spoke with clear-minded clarity when asked about her footballing dreams.\n\"Hopefully one day, to play professionally in a team overseas. To play in a World Cup. Win trophies. Play in the Champions League, and win trophies.\"\nSo, she didn't hope for much? \"Nah, not much,\" she laughed.\nDaniela Galic and the Young Matildas are currently competing at the AFC U20 Women's Asian Cup Uzbekistan 2024™. Australian audiences can catch all of the games live and free on 10 Play.\nAustralia v Uzbekistan\nDate: Wednesday, 6 March 2024\nKick-off: 4.00pm (local) / 10.00pm AEDT\nVenue: JAR Stadium, Tashkent\nBroadcast: 10 Play\nAustralia v Chinese Taipei\nDate: Saturday, 9 March 2024\nKick-off: 1.00pm (local) / 7.00pm AEDT\nVenue: DO'Stilk Stadium, Tashkent\nBroadcast: 10 Play",
  "word_count": 684,
  "scraped_at": "2026-02-14T12:47:26.384080"
}