{
  "article_id": "717ebab0c94e",
  "url": "https://www.observertoday.com/life/community-calendar/2023/11/coming-up-545/",
  "title": "Coming up … | News , Sports , Jobs - Observer Today",
  "date": "20231110T100000Z",
  "domain": "observertoday.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Coming up…\nFRIDAY, NOV. 10\nLake Erie Wine Country Harvest Weekend\n20 member wineries, starts at 10 a.m. Various price packages.\nMary Louise White Visiting Writer Dr. Hugh Martin talk and reading\nSUNY Fredonia, Veterans Lounge, Nixon Hall, 12 p.m. The author is an Iraq war veteran and Assistant Professor of English at the United States Air Force Academy. Free event, open to the public.\nGerry Senior Citizens luncheon and program Gerry Methodist Church, 4441 Route 60, noon. Bring a dish of food for the serving table and personal table service.\nRoger Tory Peterson Institute of Natural History Guided Gallery Walk\n311 Curtis St., Jamestown, 2 p.m. Call 716 665-2473 for reservations. Museum admission must be purchased.\nVeterans Remembrance Ceremony\nSUNY Fredonia, Williams Center Multipurpose room, 3:30 p.m. Free event, public welcome. Posting and retiring of the colors by the Dunkirk/Fredonia Veterans Council, moment of silence in recognition of American veterans for their service and sacrifice. Presentation of the annual Fredonia Veterans scholarship. Attendees are encouraged to bring a donation for care packages for the Holiday Care Package Fund Drive for military service members.\nWestfield Academy and Central School dinner theater production of Disney’s “Lion King Jr.”\nWACS, Route 20, 6 p.m. features 60-plus young performers. Reservations for dinner must be made by Nov. 3. Call 716 326-2151 ext. And leave a voice mail. Tickets for the show only are also available.\nOpera favorites program featuring local soprano Kimberly Merrill and pianist Dr. Alison d’Amato\nGowanda Historic Hollywood Theater, 39 W. Main St., 7 p.m. Tickets $10, concessions available.\nHillman Opera: Die Fledermaus\nSUNY Fredonia, Rockefeller Arts Center, King Concert Hall, 7:30 p.m. Set in Vienna. Tickets: General public $25, students $10, at the door $15. Operetta by Strauss. Producer: Donald Marrazzo; Music Director/Conductor: Emily Schadd; Stage director: Paul W. Mockovac.\nSomething Rotten at the Scharmann Theater at Jamestown Community College\nJCC, Sheldon Center, Scharmann Theatre, 525 Falconer St., Jamestown, 7:30 p.m. A hilarious mashup of Shakespearean England and 21st century Broadway. General admission $20, students, senior citizens (60+)/JCC FSA members, JCC students with ID $10.\nMedieval Feast Dinner Theater\nPeek ‘n Peak, 1405 Olde Main Road, Clymer, 7:30 p.m. $85.\nSATURDAY NOV. 11 Veterans Day\nWarrior Relief Fund fund-raiser\nSheridan VFW, 2556 Route 20, details TBA.\nGowanda Loyal Order of the Moose holiday craft and vendor show and basket raffle 201 Aldrich St., 9 a.m. to 3 p.m. Food, 30+ vendors including quilts, towels, candles, soaps, homemade crafts, jewelry, aromatherapy, vintage gifts, clothing and more, 50/50, basket raffle.\nJamestown Fall Craft Festival\nKinetic Retail Store, 201 E. Fourth St., Jamestown, 9 a.m. to 2 p.m. Shop with local crafters and artists. Free admission. Accepting donations for the Humane Society of Chautauqua County.\nPet Pantry’s Holiday Craft Fair Chautauqua County Fairgrounds, Ag & Expo Building, 1089 Central Ave., Dunkirk, 10 a.m. to 5 p.m. Free parking. $1 admission is a donation to The Pet Pantry. 50 handmade only crafters. Items include jewelry to crochet and knit, soaps, lotions and candles, ceramics, textiles, candy, baked goods and fudge and holiday decorations. In addition to shopping, door prizes are featured and lunch will be available.\nVeteran’s Day 5K\nrun/walk\nJamestown Community College, Campus gym parking lot, Curtis Street, Jamestown, registration at 10 a.m., race starts at 11 a.m. prizes for male and female 1st through 3rd place finishers. Registration: $10 for students and veterans, $15 for community members. This JCC Veterans Club fundraiser supports veteran and military aligned students.\nLake Erie Wine Country Harvest Weekend\n20 member wineries, starts at 10 a.m. Various price packages.\nVets Finding Vets Fenton Canteen\nFenton History Center, 67 Washington St., Jamestown, 10 a.m. to noon. All vets welcome to stop in for coffee and to meet other vets. For details, call 716 664-5256.\nFredonia Farmers’ Market\nFredonia Masonic Lodge, 321 E. Main St., 10 a.m. to 1 p.m. It features a variety of food vendors, crafts, artisans and prepared foods for sale. The market welcomes cash, credit cards, SNAP benefits.\nAudubon Community Nature Center Little Explorers: Fur, feathers and scales\n1600 Riverside Road, Jamestown, 10 to 11:30 a.m. Ages 3 to 8 with adult. Adults $12, Nature Center members $9, children 3 to 8 $9. Indoors and outdoors. Paid reservations by previous Thursday. Call 716 569-2345.\nThe Barn at Farrington Hollow Bridal Show\n7495 Farrington Hollow Road, entrance B, Cherry Creek, 11 a.m. to 3 p.m. Contact farringtonhollow@gmail.com for details and to register.\nSinclairville Free Library presents: Zentangle class\n15 Main St., 11:30 a.m. Instructor: Brenda Nickerson. All materials for this drawing method will be provided.\nLakeshore Humane Society Saturday open adoption hours\nThe Lakeshore Humane Society, 431 E. Chestnut St., Dunkirk, will hold open adoption hours from noon to 3 p.m. The public is welcome to see the dogs and cats in need of loving homes. Tours of the facility will not be given. Individual appointments are available throughout the week by leaving a message at 716 672-1991; press “1” for dogs or “2” for cats. One must be 21 years of age or older to adopt a pet. The Cat’s Meow Boutique will be open for purchases by the public. For details, call 716 672-1991.\nThanksgiving food drive to benefit Chautauqua County Rural Ministry\nPomfret Town Hall, 9 Day St., Fredonia, noon to 3 p.m. Volunteers will unload drive-up donations. Seeking frozen turkeys, hams, chickens, non-perishable foods and/or monetary donations.\nSons of the American Revolution (SAR) luncheon and program\nStockton Hotel, 2 S. Main St., 12:30 p.m. Order lunch from the menu. Election of officers. Guest speaker Cassadaga Historian and Town of Stockton Historian John Sipos will present the history of the first Thanksgiving. Anyone interested in the War for Independence welcome to attend. Spouses welcome.\nStage on Screen: “Titanic – the Musical”\n1891 Fredonia Opera House, 9 Church St., 1 p.m. Music and lyrics by Maury Yeston, book by Peter Stone. Adults $15, students $10.\nWestfield Academy and Central School matinee production of Disney’s “Lion King Jr.”\nWACS, Route 20, 1 p.m. features 60-plus young performers. No dinner option at this performance.\nCelebration of Life/Benefit for Chuck (Peanut) Perry\nPost 62 American Legion, 211 Central Ave., Dunkirk, 2 to 6 p.m. Goulash dinner, $12, presale only. Also basket raffles, 50/50, karaoke 7 to 10 p.m. For dinner tickets, call Judi Perry at 716 467-3581.\nDarwin R. Library presents: Book Club\n7 Day St., Fredonia, 2 p.m. This month’s selection: “Howard’s End,” by E.M. Forster.\nWarrior Relief Fund Veterans Day benefit\nSheridan V.F.W. Post 6390, 2556 Route 20, Sheridan, 3 to 9 p.m. Free admission. Live music from The Freeze 4 to 9 p.m. Chinese auction, drawing 6 p.m. Raffle drawing over $6000 in prizes at 6 p.m. 50/50, drinks, cash bar, buffet $10 donation. 100% of proceeds benefit veterans. All staff volunteers. Wounded Warrior Project, DAV, 22 Kill, local veterans organizations.\nTrinity United Church of Christ free community meal\nErie Avenue and Park Street, Gowanda, take-out only, 4 to 6 p.m. or gone. The menu is Italian meatball casserole, mixed vegetables, bread and a cookie. Free will donations appreciated but not necessary.\nWestfield Academy and Central School dinner theater production of Disney’s “Lion King Jr.”\nWACS, Route 20, 6 p.m. features 60-plus young performers. Reservations for dinner must be made by Nov. 3. Call 716 326-2151 ext. And leave a voice mail. Tickets for the show only are also available.\nSecond Saturday Ukulele Jam Session\nDomus Fare Restaurant, 41 W. Main St., Fredonia, 6 to 8 p.m. No registration required.\nSouth Dayton Fire Dept. turkey, ham and basket party\nSouth Dayton Fire Co. activities hall, 34 Maple St., doors open at 6:15 p.m., spins start at 7 p.m. Family fun event, free refreshments, door prizes, 50/50, large basket raffle.\nOpera favorites program featuring local soprano Kimberly Merrill and pianist Dr. Alison d’Amato\nGowanda Historic Hollywood Theater, 39 W. Main St., 7 p.m. Tickets $10, concessions available.\nEast Dunkirk turkey party\nEast Dunkirk Firehall, 10949 S. Roberts Road, 7 p.m. Free refreshments.\nDom Polski meat raffle\n179 Lake Shore Drive E., Dunkirk. Call 716 366-4443 for details.\nCassadaga Volunteer Fire Department turkey raffle\n22 Mill St., 7 p.m. Free food and refreshments. Other hunters’ raffles.\nHillman Opera: Die Fledermaus\nSUNY Fredonia, Rockefeller Arts Center, King Concert Hall, 7:30 p.m. Set in Vienna. Tickets: General public $25, students $10, at the door $15. Operetta by Strauss. Producer: Donald Marrazzo; Music Director/Conductor: Emily Schadd; Stage director: Paul W. Mockovac.\nSomething Rotten at the Scharmann Theater at Jamestown Community College\nJCC, Sheldon Center, Scharmann Theatre, 525 Falconer St., Jamestown, 7:30 p.m. A hilarious mashup of Shakespearean England and 21st century Broadway. General admission $20, students, senior citizens (60+)/JCC FSA members, JCC students with ID $10.\nThe Magic of Motown\nReg Lenna, 116 E. Third St., Jamestown, 7:30 p.m. 15 powerhouse vocalists backed by a six-piece band perform songs and choreography to embody Aretha Franklin, the Four Tops, The Supremes and more. $81, $71, $61 plus fees.\nErie Philharmonic Symphonic Series: “George Li Plays Rachmaninoff”\nWarner Theatre, 811 State St., Erie, 8 p.m. For tickets see eriephil.org\nSUNDAY, NOV. 12\nLake Erie Wine Country Harvest Weekend\n20 member wineries, starts at 10 a.m. Various price packages.\nThanksgiving food drive to benefit Chautauqua County Rural Ministry\nPomfret Town Hall, 9 Day St., Fredonia, noon to 3 p.m. Volunteers will unload drive-up donations. Seeking frozen turkeys, hams, chickens, non-perishable foods and/or monetary donations.\nSpaghetti dinner fund-raiser for John Smith\nSheridan VFW, 2556 Main Road, Silver Creek, 1 to 5 p.m. Proceeds will help Smith and his family with expenses incurred through his cancer treatments. $10 presale or $12 at the door. Call 716 467-2601. Dinner, DJ, Chinese auction including a Sabres autographed hockey stick, 50/50 raffle.\nOpera favorites program featuring local soprano Kimberly Merrill and pianist Dr. Alison d’Amato\nGowanda Historic Hollywood Theater, 39 W. Main St., 2 p.m. Tickets $10, concessions available.\nSomething Rotten at the Scharmann Theater at Jamestown Community College\nJCC, Sheldon Center, Scharmann Theatre, 525 Falconer St., Jamestown, 7:30 p.m. A hilarious mashup of Shakespearean England and 21st century Broadway. General admission $20, students, senior citizens (60+)/JCC FSA members, JCC students with ID $10.\nMedieval Feast Dinner Theater\nPeek ‘n Peak, 1405 Olde Main Road, Clymer, 2 p.m. $85.\nFredonia Flute and Bassoon Ensembles\nSUNY Fredonia, Mason Hall, Rosch Recital Hall, 5 p.m.\nFolk in Fredonia presents: From China to Appalachia\n1891 Fredonia Opera House, 9 Church St., 7 p.m. Grammy-award winning American Roots artists Cathy Fink and Marcy Marxer combine with Chinese classical hammered dulcimer player Chao Tian. $20 adults, $18 members, $10 students.\nMONDAY, NOV. 13\nDarwin R. Library presents: Preschool storytime\n7 Day St., Fredonia, 10:30 a.m. Stories, movies, crafts, play. All children welcome. No registration necessary.\nUnited Seniors luncheon meeting\nKosciuszko Club, 252 Nevins St., Dunkirk, 11 a.m. gathering, luncheon at noon. Send $12 per meal to Linda Riley, 264 King St., Dunkirk. Membership is $5 per senior (ages 55+)\nWestfield Village Planning Board meeting\nEason Hall, 3 to 5 p.m. Updating and rezoning of the B2 District with the newly formed Community Gateway Overlay District within the B2 District boundary. Public welcome.\nFredonia Guitar Quartets and Ensemble\nSUNY Fredonia, Mason Hall, Rosch Recital Hall, 8 p.m.\nTUESDAY, NOV. 14\nDunkirk Public Library presents: Story time and take-home craft kit\n536 Central Ave., 11 a.m. to noon. For ages 2 to 5.\nSinclairville Senior Citizens luncheon and program\nSinclairville Firehall dining room, 30 Main St., noon. Turkey, stuffing, dressing provided. Bring a dish of food to complement the meal and personal table service.\nChautauqua County Chamber of Commerce Business After Hours\nSouthern Tier Brewing Company, 2072 Stoneman Circle, Lakewood, 5 to 6:30 p.m. Appetizers, cash bar, brief program. Bring business cards for networking. Chamber members can send two people at no charge. Over the two person limit or non-members $10. Registration appreciated at www.chqchamber.org.\nSt. Joseph’s bingo\nBingo will take place at St. Joseph’s parish, 145 E. Main St., Fredonia. Doors open at 5 p.m.; bingo begins at 7.\nAnderson-Lee Library presents: “History of the Cayuga Nation”\n43 Main St., Silver Creek, 6 p.m. Presenter: Rich Sasala, Cayuga, Turtle Clan. Register at 716 934-3468.\nDunkirk Memorial American Legion Auxiliary Unit 62 meeting\nPost 62, 211 Central Ave., Dunkirk, 7 p.m. Membership renewals for 2024 are being accepted. New members welcome.\nChildren in the Stream/4H Youth Fly Fishing program class\nSUNY Fredonia, Rockefeller Arts Center, Costello Room, 7 to 8:30 p.m. Open to children over 12 (younger if accompanied by an adult), faculty, staff and community members of all ages. Classes and supplies provided at no cost. No long-term commitment is needed.\nFredonia Wind Symphony\nSUNY Fredonia, Rockefeller Arts Center, King Concert Hall, 8 p.m.\nWEDNESDAY, NOV. 15\nTOPS NY No. 890 meeting\nFirst United Presbyterian Church, 35 Park Place, Silver Creek. Weigh-ins begin at 8:45 a.m., meeting starts at 9:35 a.m. All are welcome. Use the Main Street entrance. For details, call 716 680-0313.\nThe Resource Center 34th Ability Awareness Awards celebration\nChautauqua Harbor Hotel, 10 Dunham Ave., Celoron, 11:30 a.m. The awards recognize people with disabilities who have made significant accomplishments and area residents and businesses that have improved the lives of people with disabilities.\nTOPS NY #1094 meeting\nFellowship Church, 148 W. Main St., Brocton. All are welcome. Weigh-ins at 2 p.m., meeting at 2:30 p.m. All are welcome. For details, call 716 792-4226.\nLakeshore Humane Society Wednesday open adoption hours\nThe Lakeshore Humane Society, 431 E. Chestnut St., Dunkirk, will hold open adoption hours from 6 to 8 p.m. The public is welcome to see the dogs and cats in need of loving homes. Tours of the facility will not be given. Individual appointments are available throughout the week by leaving a message at 716 672-1991; press “1” for dogs or “2” for cats. One must be 21 years of age or older to adopt a pet. The Cat’s Meow Boutique will be open for purchases by the public. For details, call 716 672-1991.\nFredonia Student Keyboard Association piano recital\nSUNY Fredonia, Mason Hall, Rosch Recital Hall, 6 p.m.\nChautauqua County Genealogical Society meeting\nCassadaga American Legion, 228 Maple Ave., 6:30 p.m.\nMovies at the Reg: “Rudy”\n116 E. Third St., Jamestown, 7 p.m. 30th anniversary screening. Stars Sean Astin in the classic about a boy’s sacrifices to play football for Notre Dame. $5 plus $1 restoration fee.\nFredonia Wind Ensemble\nSUNY Fredonia, Rockefeller Arts Center, King Concert Hall, 8 p.m.\nTHURSDAY, NOV. 16\nThursday Knitting Group\nSt. Joseph’ Roman Catholic Church, 145 E. Main St., Fredonia, 9:15 to 11:30 a.m. Many of the creations are donated to local charities, or attendees can work on their own projects. For details or to donate unused yarn, call 716 785-6039.\nDunkirk Public Library presents: Story time and take-home craft kit\n536 Central Ave., 11 a.m. to noon. For ages 2 to 5.\nAnderson-Lee Library presents: School-age storytime with Miss Amy\n43 Main St., Silver Creek, 10:30 a.m. For children ages 6 to 12. Stories, crafts, games and other activities.\nAnderson-Lee Library presents: Preschool storytime with Miss Jill\n43 Main St., SIlver Creek, 10:30 a.m. For children ages 2 to 5. Reading, singing, rhymes and fun crafts.\nDarwin R. Barker Library presents: Master Builders\n7 Day St., Fredonia, 4 p.m. Build with LEGOs, Magformers, Marble Runs, ZOOB, TRIO and more. All children welcome. No registration required. Caregivers must remain in building.\nDarwin R. Library presents: Library Catalog Search\n7 Day St., Fredonia, 4:30 to 5:30 p.m. Learn how to navigate the Chautauqua-Cattaraugus Library System catalog to search for physical books, books on CD, DVDs and more. Bring own smart-device laptop or borrow one from the library. Registration required. Call 716 672-8051. Free of charge.\nDunkirk Elks bingo\nDunkirk Elks Lodge bingo will be held at 428 Central Ave. Doors open at 5 p.m. Admission sales begin at 6 p.m. Games start at 7 p.m.\nRosary for Peace in the World\nThis recurring Rosary takes place on the third Thursday of each month from 5:30 to 6 p.m. at St. Elizabeth Ann Seton, 328 Washington Ave., Dunkirk.\nSinclairville Free Library presents: Holiday greeting card-making\n15 Main St., 5:30 p.m. Ages 10 and up. $5 fee covers materials to make 3 different cards with instructions provided by Amanda Verlini. Call 716 9622-5885.\nAnderson-Lee Library presents: ” Cayuga Nation Oral History Project”\n43 Main St., Silver Creek, 6 p.m. Presenter: Rich Sasala, Cayuga, Turtle Clan. Register at 716 934-3468.\nSteps to Serenity Al-Anon Group\nHarvest Chapel Free Methodist Church, 39 Matteson St., Fredonia, conference room 6, 6 to 7:15 p.m. Enter from the canopy and ramp door entrances. For details, call 716 969-2395.\nAhira Hall Memorial Library’s Write Focus presents: Diwali, the Indian Festival of Light\n37 W. Main St., 6:30 p.m. Program presenter: Lucy Andrus, LARC Art and Culture Educator.\nWRFA presents: “Arts on Fire LIVE! – The Assembly”\nReg Lenna Medium Arts Studio, 116 E. Third St., Jamestown, doors open at 6:45, performance at 7 p.m. $13 including fees.\nSomething Rotten at the Scharmann Theater at Jamestown Community College\nJCC, Sheldon Center, Scharmann Theatre, 525 Falconer St., Jamestown, 7:30 p.m. A hilarious mashup of Shakespearean England and 21st century Broadway. General admission $20, students, senior citizens (60+)/JCC FSA members, JCC students with ID $10.\nNarcotics Anonymous meeting\n219 Central Ave., Fredonia, 8 to 9 p.m. Free to attend. The only requirement is the desire to stop using. All are welcome regardless of age, race, sexual identity, creed, religion or lack of religion. For details, visit https://nawny.nny-na.org/.\nFredonia Concert Band SUNY Fredonia, Rockefeller Arts Center, King Concert Hall, 8 p.m.\nFRIDAY, NOV. 17\nHunters’ breakfast opening day\nStockton Volunteer Fire Co., 28 S. Main St., 4:30 to 9 a.m.\nParent Discussion Group\nThe Mental Health Association, 31 Water St., #7, Jamestown or via Zoom.10 a.m. to noon. Email aubrey@preventionworks.us . Free event. This week: Developing Good Bedtime Routines.\nAnderson-Lee Library presents: The Secret Society of the Twisted Stitchers\n43 Main St., Silver Creek, 12 to 2 p.m. For all who love handiwork, ages 10 and up. Bring own supplies. For knitting, bring 10/10.5 bamboo needles colored worsted weight yarn (#4). For crochet, bring a size H hook and light-colored worsted weight yarn (#4). Come and learn or come and work on a project with others who love to knit, crochet, embroider, etc.\nGowanda High School Thespian Society presents: “Almost, Maine” senior preview\n10674 Prospect St., 1 p.m. Free admission..\nAnderson-Lee Library presents: Chess Club\n43 Main St., Silver Creek, 2 to 3 p.m. For ages 10 and up. No registration required. For all skill levels.\nRoger Tory Peterson Institute of Natural History Guided Gallery Walk\n311 Curtis St., Jamestown, 2 p.m. Call 716 665-2473 for reservations. Museum admission must be purchased.\nDunkirk Public Library presents: Dungeon and Dragons\n536 Central Ave., 2:45 to 5 p.m. Teens and YA patrons welcome to join for role-playing adventures. Contact the library director at 716 366-2511.\nChristmas in the Village of Westfield children’s night\nPatterson Library, 40 S. Portage St., 5 p.m. Pygmy Goat Visitors from Sun Dance Kids Farm. Moore Park at 6:30, Santa and Mrs. Claus come to town to light the park Christmas tree. Celebration continues at the YWCA, 58 S. Portage St., with treats, visits and pictures with Santa.\nSinclairville Volunteer Fire Co. annual turkey party\nFire Hall, Main Street, additional parking on Lester Street. Doors open at 6:30 p.m. Hot dogs, beverages, chips provided. A variety of meat packages as well as turkey will be raffled.\nDueling Pianos at Chautauqua Harbor Hotel\n10 Dunham Ave., Celoron, 6:30 p.m. Call 716 489-2800 for tickets.\nDunkirk Intermediate School presents: “Matilda Jr.”\nIntermediate School Auditorium, 525 Eagle St., 7 p.m. See the school website for tickets. Limited number of tickets available at the door. Concessions and fundraisers at the show to help support future musicals.\nGowanda High School Thespian Society presents: “Almost, Maine” by John Cariani\n10674 Prospect St., 7 p.m. Free admission, open to the public..\nTaylor Swift: The Eras Tour Concert Film\nReg Lenna Center for the Arts, 116 E. Third St., Jamestown, 7 p.m. Cinematic view of the history-making Taylor Swift tour. Taylor Swift Eras attire and friendship bracelets strongly encouraged. Adults $19.89, children under 12; seniors 65 and older; veterans/military: $13.33. See reglenna.com for online tickets.\nSomething Rotten at the Scharmann Theater at Jamestown Community College\nJCC, Sheldon Center, Scharmann Theatre, 525 Falconer St., Jamestown, 7:30 p.m. A hilarious mashup of Shakespearean England and 21st century Broadway. General admission $20, students, senior citizens (60+)/JCC FSA members, JCC students with ID $10.\nMedieval Feast Dinner Theater\nPeek ‘n Peak, 1405 Olde Main Road, Clymer, 7:30 p.m. $85.\nSATURDAY, NOV. 18\nChristmas in the Village of Westfield\n10 a.m. Eason Hall, 23 Elm St, Hall of Christmas Holiday Artisans Market and O Holy Night, a unique homemade collection of manger scenes. 11 a.m . to 4 p.m., free horse-drawn carriage rides around Westfield’s Historic District, load at Eason Hall. Hot Toddy Crawl from 11 a.m. to 4 p.m. Visit with Santa and Mrs. Claus at the Patterson Library, 40 S. Portage St, see the Hall of Trees, complete make and take activities. Lakeshore Center for the Arts, 49 S. Portage St., 11 a.m. to 4 p.m., hot toddies, art gallery open; Carolers in the village. Grape Discovery Center, 8305 W. Main Road, parade “Holiday Wine Tea” 11:30 a.m. to 2 p.m. ($25). “Let There Be Light” moving festival of lights on Main Street begins at 5 p.m..\nFenton Holiday Craft Fair\n67 Washington St., Jamestown, 10 a.m. to 4 p.m. Variety of vendors. $3 admission adults.\nFredonia Farmers’ Market\nFredonia Masonic Lodge, 321 E. Main St., 10 a.m. to 1 p.m. It features a variety of food vendors, crafts, artisans and prepared foods for sale. The market welcomes cash, credit cards, SNAP benefits.\nFalconer Holiday Expo and Santa Parade\nFalconer Fire Department, 10 a.m. to 4 p.m., parade begins at 5 p.m. and proceeds to the Santa House located in Coleson Park. Petting zoo, 3-C’s Catering Food Truck.\nFredonia Food Pantry\nFredonia Presbyterian Church, 219 Central Ave., 10 a.m. to noon. Serves the needs of residents of Fredonia, ZIP code 14063, Pomfret, Sheridan and Laona. All guests receive one or more bags of non-perishable food. Number of bags given out depends on family size.\nVeterans 4 Christ monthly breakfast\nTri-Church Parish, 35 E. Main St., Brocton, 10 a.m. Free breakfast for veterans plus one as well as active-duty service members.\nLakeshore Humane Society’s “Picture Your Pet With Santa” fund-raiser\n431 Chestnut St., Dunkirk, 11 a.m. to 3 p.m. Pets, children, and/or family photos with Santa Claus will be taken by a photographer and available for purchase to benefit LHS. $15 for one pose; $20 for three poses. The digital photo(s) will be sent via email. Payments accepted in the form of cash or check only. Pets must be vaccinated, friendly and on a leash or in a carrier. Multiple pets and children are welcome. (No sick, aggressive, or exotic animals).For details, call 716 672-1991.\nEmpty Bowls Fundraiser\nWheelock School, 75 Chestnut St., Fredonia, 11 a.m. to 2 p.m. Make a donation for ceramic bowls. Music by Tom Gestwicki. Soups will be prepared by culinary arts students from BOCES to be served in compostable bowls with compostable spoons, which will be composted onsite at Wheelock. All proceeds go to food pantries in Chautauqua County.\nSUNY Fredonia students Community Fall Sweep\nWilliams Center Multipurpose Room, 11 a.m., opening remarks, refreshments and raffles, followed by students raking lawns of Fredonia residents interested in the help who live in the Temple Street to Birchwood Street area.\nThanksgiving with the Birds – Adventures in Bird Banding\nAudubon Community Nature Center, 1600 Riverside Road, Jamestown, 11:30 a.m. to 2:30 p.m. Adults $8, $6 Nature Center members and children 3 to 15. Bring a broth-based soup and dish to pass. Dinner will be indoors, followed by a program by Sara Hatfield describing ACNC’s long history of banding birds.\nAnderson-Lee Library presents: “Make a Corn Husk Doll”\n43 Main St., Silver Creek, 12 p.m. Instructors: artists Marcie Kane and Bernadette Scott, mother and daughter, Seneca, Deer Clan. Register at 716 934-3468.\nLakeshore Humane Society Saturday open adoption hours\nThe Lakeshore Humane Society, 431 E. Chestnut St., Dunkirk, will hold open adoption hours from noon to 3 p.m. The public is welcome to see the dogs and cats in need of loving homes. Tours of the facility will not be given. Individual appointments are available throughout the week by leaving a message at 716 672-1991; press “1” for dogs or “2” for cats. One must be 21 years of age or older to adopt a pet. The Cat’s Meow Boutique will be open for purchases by the public. For details, call 716 672-1991.\nNYSSMA Area All-State Concert Jazz Ensemble\nSUNY Fredonia, Mason Hall, Rosch Recital Hall, 12:30 p.m.\nLive at the Met: “X: The Life and Times of Malcolm X”\n1891 Fredonia Opera House, 9 Church St., 1 p.m. Anthony Davis, libretto by Thulanny Davis.\n$20 adults, $18 members, $10 students.\nPulled pork dinner and benefit for Lori Kozlowski\nDom Polski Club, 179 Lakeshore Drive E., Dunkirk, noon to 5 p.m. Tickets $15, pre-sale only. Leave a message with name and number at 716 366-4443. Also basket raffles..\nNYSSMA Area All State Concert Treble Choir, Mixed Choir\nSUNY Fredonia, Rockefeller Arts Center, King Concert Hall, 1:30 p.m. $13 advance; $15 door.\nNYSSMA Area All State Concert, Symphony Orchestra, String Orchestra\nSUNY Fredonia, Rockefeller Arts Center, King Concert Hall, 3:30 p.m. $13 advance, $15 door.\nSheridan Volunteer Fire Department turkey and ham party\n2800 Route 20, Sheridan, 7 p.m. Raffle, door prizes, refreshments.\nDunkirk Intermediate School presents: “Matilda Jr.”\nIntermediate School Auditorium, 525 Eagle St., 7 p.m. See the school website for tickets. Limited number of tickets available at the door. Concessions and fundraisers at the show to help support future musicals.\nGowanda High School Thespian Society presents: “Almost, Maine” by John Cariani\n10674 Prospect St., 7 p.m. Free admission, open to the public..\nStockton Volunteer Fire Co., annual turkey party\nStockton Volunteer Fire Co., 28 S. Main St., 7 p.m., young fresh turkeys (never frozen), also ham and prime rib. Door prize, free refreshments.\nSomething Rotten at the Scharmann Theater at Jamestown Community College\nJCC, Sheldon Center, Scharmann Theatre, 525 Falconer St., Jamestown, 7:30 p.m. A hilarious mashup of Shakespearean England and 21st century Broadway. General admission $20, students, senior citizens (60+)/JCC FSA members, JCC students with ID $10.\nTaylor Swift: The Eras Tour Concert Film\nReg Lenna Center for the Arts, 116 E. Third St., Jamestown, 7 p.m. Cinematic view of the history-making Taylor Swift tour. Taylor Swift Eras attire and friendship bracelets strongly encouraged. Adults $19.89, children under 12; seniors 65 and older; veterans/military: $13.33. See reglenna.com for online tickets.\nMedieval Feast Dinner Theater\nPeek ‘n Peak, 1405 Olde Main Road, Clymer, 7:30 p.m. $85.\nSUNDAY, NOV. 19\nChristmas in the Village of Westfield Eason Hall, 23 Elm St, Hall of Christmas Holiday Artisans Market and O Holy Night, a unique homemade collection of manger scenes. 11 a.m . to 4 p.m., free horse-drawn carriage rides around Westfield’s Historic District, load at Eason Hall. McClurg Museum Holiday Open House 2 to 4 p.m.Enjoy a complimentary sweet treat.\nNorthern Chautauqua County Club Associates meeting\nFredonia Beaver Club, 64 Prospect St., 10:30 a.m. Any club member may attend these meetings.\nGowanda Loyal Order of the Moose towel bingo raffle party\n201 Aldrich St., 1 p.m. Food available for purchase, win towels, 25 cent raffle, 50/50, basket raffle.\nDunkirk Intermediate School presents: “Matilda Jr.”\nIntermediate School Auditorium, 525 Eagle St., 7 p.m. See the school website for tickets. Limited number of tickets available at the door. Concessions and fundraisers at the show to help support future musicals.\nSomething Rotten at the Scharmann Theater at Jamestown Community College\nJCC, Sheldon Center, Scharmann Theatre, 525 Falconer St., Jamestown, 2 p.m. A hilarious mashup of Shakespearean England and 21st century Broadway. General admission $20, students, senior citizens (60+)/JCC FSA members, JCC students with ID $10.\nMedieval Feast Dinner Theater\nPeek ‘n Peak, 1405 Olde Main Road, Clymer, 2 p.m. $85.\nMONDAY, NOV. 20\nDarwin R. Library presents: Preschool storytime\n7 Day St., Fredonia, 10:30 a.m. Stories, movies, crafts, play. All children welcome. No registration necessary.\nHOPE meeting (Healing our Pain with Empathy)\nGeneral Physician, PC Dunkirk Office, 3898 Vineyard Drive, 6 to 8 p.m. All parents who have experienced the death of a child are invited to participate in this free support group. For details, call 716 338-0033 ext. 212.\nTUESDAY, NOV. 21\nDunkirk Public Library presents: Story time and take-home craft kit\n536 Central Ave., 11 a.m. to noon. For ages 2 to 5.\nDarwin R. Library presents: After-school all-ages storytime\n7 Day St., Fredonia, 4:15 p.m. Stories, movies, crafts, play. All children are welcome. No registration is necessary.\nSt. Joseph’s bingo\nBingo will take place at St. Joseph’s parish, 145 E. Main St., Fredonia. Doors open at 5 p.m.; bingo begins at 7.\nLake Shore Center for the Arts free classic movie: “Casablanca”\n49 S. Portage St., Westfield, 7 p.m. 1942 film starring Humphrey Bogart, Ingrid Bergman and Paul Henreid.\nWEDNESDAY, NOV. 22\nTOPS NY No. 890 meeting\nFirst United Presbyterian Church, 35 Park Place, Silver Creek. Weigh-ins begin at 8:45 a.m., meeting starts at 9:35 a.m. All are welcome. Use the Main Street entrance. For details, call 716 680-0313.\nTOPS NY #1094 meeting\nFellowship Church, 148 W. Main St., Brocton. All are welcome. Weigh-ins at 2 p.m., meeting at 2:30 p.m. All are welcome. For details, call 716 792-4226.\nFirst Ward Falcon Club celebration\n341 Lake Shore Drive E., Dunkirk. Music by Ion Sky..\nCassadaga Village Board meeting\nCassadaga Village Hall, 22 Mill St., 7 p.m.\nTHURSDAY, NOV. 23 Happy Thanksgiving\nFRIDAY, NOV. 24\nRoger Tory Peterson Institute of Natural History Guided Gallery Walk\n311 Curtis St., Jamestown, 2 p.m. Call 716 665-2473 for reservations. Museum admission must be purchased.\nSATURDAY, NOV. 25\nFredonia Farmers’ Market\nFredonia Masonic Lodge, 321 E. Main St., 10 a.m. to 1 p.m. It features a variety of food vendors, crafts, artisans and prepared foods for sale. The market welcomes cash, credit cards, SNAP benefits.\nAudubon Community Nature Center Natural Investigators: Animal Signs and Game Cameras\n1600 Riverside Road, Jamestown, 10 to 11:30 a.m. $12 adults, $9 Nature Center members, $9 children 8 to 12 with an adult. Indoors and outdoors. Call 716 569-2345 for reservations, must be paid by previous Thursday.\nChristmas on Central Small Business Saturday Holiday Market and Annual Tree Lighting\nDowntown Dunkirk, 11 a.m. to 6 p.m. Indoor and outdoor pop-up shopping at Northern Chautauqua Catholic School, Stearns Building, former P & G grocery store, P*dubs and other locations along with holiday elements outside on Central Ave. Live music at City Hall: DJ Joe Gould 11 a.m.; Slim & Red 1 p.m., Footsteps 3 p.m. Holiday dancers from the McKenna Academy of Dance 5 p.m.; Danza! Performing Arts Academy 5:15 p.m. in front of City Hall. Also complimentary hot cocoa and food available for purchase at Central Station Restaurant, complimentary horse drawn carriage rides by Laff ‘N Lyon Rahnc noon to 4, children’s holiday craft-making and cookie frost, visits with Santa, rs. Claus, Rudolph and elves 11:30 to 55. Ice carving demos at 11 a.m. Shopping map and deals.\nMeet local artist/author Trenton Lutes\nThe Next Chapter Bookstore, 12 Park Place, Fredonia, 11 a.m. to 1 p.m. Lutes has written two books of young adult dystopian fiction and will offer readings and book signings at this event.\nLakeshore Humane Society Saturday open adoption hours\nThe Lakeshore Humane Society, 431 E. Chestnut St., Dunkirk, will hold open adoption hours from noon to 3 p.m. The public is welcome to see the dogs and cats in need of loving homes. Tours of the facility will not be given. Individual appointments are available throughout the week by leaving a message at 716 672-1991; press “1” for dogs or “2” for cats. One must be 21 years of age or older to adopt a pet. The Cat’s Meow Boutique will be open for purchases by the public. For details, call 716 672-1991.\nChristmas on Central Small Business Saturday\nDunkirk\nMONDAY, NOV. 27\nDarwin R. Library presents: Preschool storytime\n7 Day St., Fredonia, 10:30 a.m. Stories, movies, crafts, play. All children welcome. No registration necessary.\nTUESDAY, NOV. 28\nDunkirk Public Library presents: Story time and take-home craft kit\n536 Central Ave., 11 a.m. to noon. For ages 2 to 5.\nDarwin R. Library presents: After-school all-ages storytime\n7 Day St., Fredonia, 4:15 p.m. Stories, movies, crafts, play. All children are welcome. No registration is necessary.\nSt. Joseph’s bingo\nBingo will take place at St. Joseph’s parish, 145 E. Main St., Fredonia. Doors open at 5 p.m.; bingo begins at 7.\nAnderson-Lee Library presents: “Three Short FIlms, Corn Soup and Fry Bread! ”\n43 Main St., Silver Creek, 6 p.m. Terry Jones, Seneca, Wolf Clan, shares 3 of his films of the Haudenosaunee (Iroquois) history and culture and native food. Register at 716 934-3468.\nJamestown Coin Club meeting\nHerman Kent Post 777, (Celoron Legion), 26 Jackson Ave., Jamestown, Doors open at 6 p.m., meeting begins at 7. Door prizes, raffles, coin auction. Guests welcome at no charge. Annual membership $10. For details, call 716 720-1591.\nSons of the American Legion Squadron 59 meeting\nPost 59, 156 E. Main St., Fredonia, 7 p.m.\nChildren in the Stream/4H Youth Fly Fishing program class\nSUNY Fredonia, Rockefeller Arts Center, Costello Room, 7 to 8:30 p.m. Open to children over 12 (younger if accompanied by an adult), faculty, staff and community members of all ages. Classes and supplies provided at no cost. No long-term commitment is needed.\nFredonia New Jazz Ensemble\nSUNY Fredonia, Mason Hall, Rosch Recital Hall, 8 p.m.\nWEDNESDAY, NOV. 29\nTOPS NY No. 890 meeting\nFirst United Presbyterian Church, 35 Park Place, Silver Creek. Weigh-ins begin at 8:45 a.m., meeting starts at 9:35 a.m. All are welcome. Use the Main Street entrance. For details, call 716 680-0313.\nTOPS NY #1094 meeting\nFellowship Church, 148 W. Main St., Brocton. All are welcome. Weigh-ins at 2 p.m., meeting at 2:30 p.m. All are welcome. For details, call 716 792-4226.\nLakeshore Humane Society Wednesday open adoption hours\nThe Lakeshore Humane Society, 431 E. Chestnut St., Dunkirk, will hold open adoption hours from 6 to 8 p.m. The public is welcome to see the dogs and cats in need of loving homes. Tours of the facility will not be given. Individual appointments are available throughout the week by leaving a message at 716 672-1991; press “1” for dogs or “2” for cats. One must be 21 years of age or older to adopt a pet. The Cat’s Meow Boutique will be open for purchases by the public. For details, call 716 672-1991.\nGenealogy Support Group: Brickwalls\nFenton History Center, 67 Washington St., Jamestown, 6 p.m.\nFaculty Recital: Ekstasis Duo and Fredaissance Trio\nSUNY Fredonia, Mason Hall, Rosch Recital Hall, 8 p.m.\nFredonia University Chorus\nSUNY Fredonia, Rockefeller Arts Center, King Concert Hall, 8 p.m.\nTHURSDAY, NOV. 30\nThursday Knitting Group\nSt. Joseph’ Roman Catholic Church, 145 E. Main St., Fredonia, 9:15 to 11:30 a.m. Many of the creations are donated to local charities, or attendees can work on their own projects. For details or to donate unused yarn, call 716 785-6039.\nAnderson-Lee Library presents: School-age storytime with Miss Amy\n43 Main St., Silver Creek, 10:30 a.m. For children ages 6 to 12. Stories, crafts, games and other activities.\nAnderson-Lee Library presents: Preschool storytime with Miss Jill\n43 Main St., Silver Creek, 10:30 a.m. For children ages 2 to 5. Reading, singing, rhymes and fun crafts.\nDunkirk Public Library presents: Story time and take-home craft kit\n536 Central Ave., 11 a.m. to noon. For ages 2 to 5.\nDarwin R. Barker Library presents: Master Builders\n7 Day St., Fredonia, 4 p.m. Build with LEGOs, Magformers, Marble Runs, ZOOB, TRIO and more. All children welcome. No registration required. Caregivers must remain in building.\nDunkirk Elks bingo\nDunkirk Elks Lodge bingo will be held at 428 Central Ave. Doors open at 5 p.m. Admission sales begin at 6 p.m. Games start at 7 p.m.\nSteps to Serenity Al-Anon Group\nHarvest Chapel Free Methodist Church, 39 Matteson St., Fredonia, conference room 6, 6 to 7:15 p.m. Enter from the canopy and ramp door entrances. For details, call 716 969-2395.\nDanza Performing Arts Academy presents; “Frozen in Fredonia”\n1891 Fredonia Opera House. Details TBA.\nThe Department of Theatre and Dance presents: “Mason Wright is Not a Mother” by Ashley Giaccio\nSUNY Fredonia, Rockefeller Arts Center, Bartlett Theatre, 7:30 p.m. General seating. General public $20 in advance, $25 at the door; students $5 in advance, $10 at the door. Through the use of hyper-theatricality and puppetry, it explores consent, trauma and medical malpractice against women.\nNarcotics Anonymous meeting\n219 Central Ave., Fredonia, 8 to 9 p.m. Free to attend. The only requirement is the desire to stop using. All are welcome regardless of age, race, sexual identity, creed, religion or lack of religion. For details, visit https://nawny.nny-na.org/.\nFredonia Jazz Orchestra\nSUNY Fredonia, Mason Hall, Rosch Recital Hall, 8 p.m.",
  "word_count": 6187,
  "scraped_at": "2026-02-14T13:38:38.773493"
}