{
  "article_id": "7180b4de617b",
  "url": "https://theathletic.com/4686761/2023/07/20/england-haiti-starting-xi/",
  "title": "Women World Cup : Who should start for England vs Haiti ? Our writer verdicts",
  "date": "20230720T044500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England begin their pursuit of a first Women’s World Cup trophy when they kick off their campaign against Haiti on Saturday.\nManager Sarina Wiegman has had a more difficult build-up than she might have expected, losing captain Leah Williamson and key players Beth Mead and Fran Kirby to injury.\nWhile she loved a settled selection at last summer’s Euros, this time there are genuine selection dilemmas. Our writers pick their XIs and explain their thinking…\nMichael Cox, tactics expert\nWithout being disrespectful to Haiti, it’s not unreasonable to think England could play their second XI and still win comfortably, so the question is really what Wiegman is trying to achieve in key positions. Is she planning on keeping things the same throughout the tournament, as in the European Championship a year ago, or can she treat this as something of a free hit and give a runout to those who might not start against Denmark?\nAdvertisement\nI would, perhaps controversially, hold back Lauren James and use her as a substitute. I think England’s opponents will struggle to match their levels of fitness and introducing James early in the second half would terrify them. Chloe Kelly, who holds width well and is England’s best crosser, would begin on the right. James could be introduced in place of her, or Ella Toone in the No 10 role.\nGO DEEPER\nThe Radar - The Athletic’s 2023 Women's World Cup scouting guide\nAlex Greenwood and Jess Carter have both been used as left-back and left-sided centre-back. They could play either way around. I think Greenwood’s left-footedness will be more useful out wide in this game, with Haiti likely to defend deep and narrow. Carter is better for guarding against counters through the middle, which should be Haiti’s main route of attack.\nCharlotte Harpur, women’s football reporter\nWe know Wiegman likes to stick to her starting XI and I reckon she will play her strongest team against Haiti.\nI think Rachel Daly should start as No 9 over Alessia Russo. The Women’s Super League Golden Boot winner (22 goals) sniffs out any opportunity and will be key to triggering England’s press. I would not start James just yet. First major tournament means big expectations and she needs to build consistency in her performances as the tournament goes on. James has the potential to set the world alight. She will have more of an impact coming off the bench as a No 10 for Toone or on the wing for Kelly who, as a starter, can inflict serious damage with her multifaceted game.\nIt’s a toss-up who plays at left-back or centre-back: Greenwood or Carter. Ahead of the Euros, when Wiegman pushed Williamson up to midfield, Greenwood played left-sided centre-back alongside Millie Bright. For the 0-0 friendly draw against Portugal at the beginning of July, however, Wiegman put Greenwood out wide and Carter in central defence. Greenwood at left-back is my preferred choice.\nAdvertisement\nFollow the Women’s World Cup on The Athletic…\n- Who will win? Who will disappoint? Who takes the Golden Boot? Writers’ predictions\n- The stories and stars that could define the tournament\n- Guide to the 10 top-ranked teams\nChloe Morgan, women’s football editor\nThis was Wiegman’s starting XI for the Lionesses’ friendly against Portugal. She is a stickler for consistency and planning, so I don’t think she will deviate from this against Haiti.\nI’m not convinced Bright will start given her knee injury has meant she hasn’t played competitively since March and she didn’t make an appearance against Portugal. Esme Morgan has been Wiegman’s go-to replacement centre-half and despite her youth, there is enough international defensive experience in Greenwood, Lucy Bronze and Earps to feel solid.\nUp front, the firm favourite has got to be WSL Golden Boot winner Daly. Despite Russo having a stellar season (as joint-top Manchester United goalscorer and securing a big transfer to Arsenal), Daly has the edge with her experience and form.\nAs a throwback to the Lionesses’ successful Euros campaign, this still leaves Wiegman to use Kelly and Russo as super-subs. The pair will undoubtedly inject energy, attacking firepower and a big dose of optimism that we’ll get to see some of those magic tournament-winning moments we witnessed last year.\nJacob Whitehead, England reporter at the Women’s World Cup\nI understand the argument that James should be given the opportunity to bed into her first major tournament — but equally, facing the weakest team in the group is an opportunity to build confidence through actual minutes. This team’s ceiling is highest with an in-form James — here is an early chance to establish herself. It is harsh on European Championship hero Kelly, but she will still play significant minutes, and can slot seamlessly into the starting XI in later matches.\nDaly is the most in-form English goalscorer, and that should be enough to see her start over Russo and Bethany England.\nAdvertisement\nThe final question mark is at left-back — and Greenwood’s attacking ability and club partnership with Lauren Hemp means it makes most sense to start her there, with Carter as the left-sided centre-back. There is an argument Bright should be introduced off the bench, having played no football since her injury in March, with Morgan starting. However, if Wiegman is certain Bright is 100 per cent fit, England’s captain should start.\nCaoimhe O’Neill, football reporter\nNo Bronze. No Georgia Stanway. No Hemp. You are probably wondering what the heck I’m doing. Just hear me out.\nWhat do we know about Wiegman? The boss prefers to stick more than twist in major tournaments. I wanted to do the opposite and have some fun against Haiti.\nMy birthday twin Mary Earps is, of course, starting in goal. Pisces forever. In less shocking news, Bootle’s own Greenwood is paired with Bright. What is the record for the most headers at a World Cup?\nNow to full-backs. Morgan of Manchester City fame starts at right-back. Morgan is one of my favourite players and not just because during her Everton loan she scored a Panenka penalty against my friend and former Liverpool Echo colleague Sam Carroll while he was out on assignment at Finch Farm. Of course that helped. I want to see that confidence on the world stage from Morgan and Niamh Charles on the other side. Charles has the potential to be a star.\nKeira Walsh will be on the pitch frying up passes with a Catalan recipe. Imagine how nonchalant she will be with a year at Barcelona in her boots. Walsh will be in a double pivot with Katie Zelem, who brings Leigh Sports Village realness to Suncorp Stadium. Let the clattering commence.\nAnd finally, it is Daly’s rodeo and Russo doesn’t miss out. Arsenal’s new hero could false-nine her way to a Golden Boot with support from Toone, who now runs free on the left wing. James will own the right. See, I told you this would be fun.\nAdvertisement\nFlorence Lloyd-Hughes, women’s football reporter\nThere is a fine balance between trying to predict what Wiegman might do and what fans, journalists and pundits think she might do. Wiegman doesn’t often listen to outside noise — there’s a stubbornness and formulaic nature to everything she does. For that reason, I think she will play a starting line-up that is close to what we saw in England’s 0-0 draw against Portugal and also in the April international games.\nIt’s really hard to gauge whether she prefers Russo or Daly in the No 9 role. Daly has the form, numbers and confidence going into this tournament but England tend to look better and more versatile with Russo in that position.\nThe absence of Bright in the lead-up to the World Cup also makes the back line a little bit unpredictable. Wiegman has liked the look of Carter at left-back when she has had to step in and fill Greenwood’s place after she’s moved to left-sided centre-back. That back four feels like the one we could see for the majority of this World Cup unless Carter slots in next to Bright and Greenwood comes back out to left-back.\nThe next dilemma is whether Toone or James should fill the gap left by Kirby in the No 10 role. James can drift inside as well as play as more of a right-sided forward, so I would opt to start her in the middle of a three featuring Kelly and Hemp, all in front of Stanway and Keira Walsh. That also gives flexibility for Toone to come off the bench and England to stay in a 4-2-3-1 or switch to a 4-3-3. Russo will sit as the lone striker.\nMichelle Owen, host of The Athletic Women’s Football Podcast: World Cup Edition\nAfter the Euros England have to be one of the favourites, even if injuries to key players might mean expectations have become more measured.\nBut injuries and retirements mean opportunity knocks for plenty of players. Daly has demonstrated at Aston Villa what a prolific forward she can be and if she’s deployed in this way for the Lionesses, I fully expect her to shine. Hemp and James are still so young and with that youthful exuberance comes a freedom of expression. It’s naive to say they might not feel the pressure, but they will view it as a chance to prove themselves on the world stage.\nThere was huge pressure last summer at a home tournament, with some of the players knowing it was their last chance. There might be a bit of concern with England’s results before the tournament, losing to hosts Australia and the goalless draw against Portugal, but there have been surprises elsewhere too. USWNT were held for much of the game against Wales recently and Zambia beat Germany 3-2.\nEngland should certainly get out of their group. I’d be surprised if they didn’t make the semi-finals.\n(Top photo: Getty Images: design: Eamonn Dalton)",
  "word_count": 1650,
  "scraped_at": "2026-02-14T13:27:03.974713"
}