{
  "article_id": "7184d3d82398",
  "url": "https://theathletic.com/4864754/2023/09/17/chelsea-fans-cst-coach/",
  "title": "Chelsea and the  penny - pinching  measures exposing tensions with their legacy support",
  "date": "20230917T051500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The matchday mood on the coaches that depart Stamford Bridge for Bournemouth this morning is expected to be more sombre than usual.\nSome of the supporters who will be on board are already wondering whether they will be able to afford to travel to Burnley on October 7. Chelsea announced late last month that they were scrapping the coach subsidy that had, for more than a decade, offered a small group of fans road transport for £10 return on away trips within the United Kingdom.\nAdvertisement\nThis decision, made despite appeals to maintain the service during a lengthy consultation with the club’s fan advisory board, supporter groups and users of the coaches, drew swift condemnation from the Chelsea Supporters’ Trust (CST). “It appears that during a cost-of-living crisis, Chelsea FC are happy to increase the financial burden on many supporters by penny-pinching,” their stinging final line in a punchy statement read.\nCST are funding the coach subsidy themselves for the Bournemouth game — partly to cushion the impact on affected supporters, partly in an attempt to shame the club into reversing their decision — but the fortnight since Chelsea’s announcement has yielded no sign that will happen.\nHaving ridden out the initial storm, it would be a surprise if Chelsea changed course now.\nIt is also worth noting that removing the coach subsidy is only one of a number of unpopular financial decisions taken since the appointment of Chris Jurasek as Chelsea’s new chief executive officer by the club’s ownership, led by Todd Boehly and Clearlake Capital, in May.\nMost relate to the matchday experience, where prices have gone up between five and 15 per cent across the board. The cost of a burger inside Stamford Bridge has risen by £1.50, chips are 45p more expensive and a pint of beer is around £1 more than it was last season. Official match programmes now cost £4, up from £3.50, despite being reduced by around 30 pages.\nTickets to watch Chelsea Women now start at £10 for adults and £5 for juniors at Kingsmeadow and £10 for adults and £6.50 for juniors at Stamford Bridge, rising to as much as £60 for adults and £30 for juniors in the premium West View seats. Watching the development squad is also a couple of pounds more expensive now than it was in 2022-23. A basic Chelsea shirt from the Stamford Bridge megastore or online shop now costs just under £80, an increase on last season’s price of around £75.\nAdvertisement\nThe club say their decision to raise kit prices is a response to increases in the cost of materials and manufacturing. Similarly, the rises in food and drink prices are attributed to rising supplier costs being passed on to fans. Changes to the programme are explained as an attempt to make what is a loss-making venture for many clubs more financially sustainable, and it is stressed that many of the pages cut carried adverts rather than content.\nOn the subject of Chelsea Women, club officials point to Emma Hayes last year publicly calling for ticket prices to be increased in order to help fund the game’s continued growth — particularly for showpiece matches like those staged at Stamford Bridge. “We have to be more ambitious for ourselves,” she insisted. “Is it too cheap to watch women’s football? I think it is, especially the top games.” There is hope that increasing ticket prices will help raise the commercial value of the women’s game, as well as better reflect Chelsea Women’s status as the best team in England and one of the best in Europe.\nIn the round, Chelsea regard these changes as unavoidable steps on the path to running the club more like a business than in the Roman Abramovich era, when a multitude of losses — big and small — were regularly underwritten by a billionaire benefactor not moved by conventional financial forces. Many of the club’s long-standing local supporters believe they are increasingly being treated as customers, and squeezed at a time of economic difficulty in the UK.\nThe reality is that both of these convictions are true.\nAccording to football finance expert Kieran Maguire, Chelsea lost an average of over £900,000 per week in the 19 years of Abramovich’s ownership. Financial sustainability was never a serious priority at Stamford Bridge from 2003 to 2022, and only frequent profits on player trading courtesy of significant sales kept the club narrowly on the right side of UEFA’s financial fair play (FFP) regulations.\nIt was always clear that, unless the club were bought by a Gulf state, Chelsea’s post-Abramovich existence would need to make more sense on a balance sheet. Boehly and Clearlake’s public credibility on this front has been undermined by the sum close to £1billion ($1.2bn) they have committed to transfer fees in the first year of their ownership — though they maintain, despite a sea of scepticism outside Stamford Bridge, that it is all part of a sustainable, long-term business plan.\nAdvertisement\nJurasek is a critical figure at Chelsea now. A highly regarded Clearlake executive for almost 10 years whose history with co-founder Behdad Eghbali goes back further than that, he is the man tasked with transforming the club from a loss-making machine into a revenue generator.\nPart of that involves massively improving Chelsea’s commercial performance; more than 20 new partnerships are under discussion beyond the shirt sponsor deal with Infinite Athlete that is awaiting Premier League approval. Another part of it involves making unpopular decisions like the matchday ones detailed above, which the club insist are more about limiting losses than maximising profits.\nSignificant changes have also been made on the content side. Club legend Pat Nevin, a long-serving columnist across the club’s digital platforms as well as the programme, is no longer being used, while the pre- and post-match studio show that bookended Chelsea’s own match coverage has also been jettisoned. A contract with Gravity Media worth around £500,000 annually to edit video highlights of first-team matches for the official club app has also been terminated, and production brought in-house.\nThese off-field austerity measures sit very awkwardly with the historically lavish transfer spend that has almost totally overhauled Chelsea’s first-team squad over the past 12 months. Here the only argument against cognitive dissonance is Boehly and Clearlake’s firm belief they have made targeted long-term investments in elite younger talent rather than simply thrown money away, even if fans may find it hard to agree when they look at the underwhelming early returns on huge signings like Mykhailo Mudryk and Marc Cucurella.\nIn many ways, the removal of the coach subsidy is a small but perfect representation of the bigger tensions at play.\nCST’s statement pointed out that the fans who would be worst affected included the young, the old, the disabled and the vulnerable among the club’s away support. Chelsea found that fewer than 200 people used the coaches, and that newly promoted Luton Town were the only other Premier League club to subsidise fan travel to away games.\nFrom a pure business perspective, maintaining the subsidy makes no sense and the pure business perspective has been the prevailing dogma of the Premier League since its inception in 1993. Why should Chelsea, now majority-owned by a U.S. investment firm, be any different?\nAdvertisement\nThe thing is that for 19 years, Chelsea were different: simultaneously a key driver of the financial forces that transformed English football’s top flight while also standing curiously apart from the American investors and sovereign wealth funds that subsequently joined Abramovich at the owners’ table. His relentless spending allowed match-going fans to realise their trophy dreams and yet remain somewhat insulated from the full force of Premier League capitalism.\nFor evidence of this, look no further than the fact that adult general admission season ticket prices have been frozen at Stamford Bridge since the 2011-12 season. Boehly and Clearlake opted to maintain the freeze for 2023-24, well aware of the hostility any hike would provoke in the midst of a cost-of-living crisis in the UK and after finishing 12th in the Premier League in the first season of their ownership.\nBut their announcement also pointed out that the freeze had meant Stamford Bridge adult general admission season ticket prices had actually fallen in real terms by 32 per cent since 2005, while Chelsea’s stadium and matchday operating costs had risen 31 per cent since 2018. It also included this warning: “The club needs to grow all our revenue streams — including matchday — to ensure we operate on a sustainable basis.”\nChelsea insist no firm decisions have been made regarding season ticket prices in 2024-25, and that fan groups will be consulted as part of the process. But many supporters are braced for significant rises to be announced in the spring — as well as the introduction of “dynamic pricing” to take advantage of greater demand for seats in more desirable areas of Stamford Bridge.\nSuch changes could spark the most significant shift in Chelsea’s season ticket-holder demographic — one of the oldest in the Premier League — for a generation. They could also be met with loud protests from those who stand to lose out, further exposing the tensions that are already bubbling just beneath the surface between the club and those often referred to as its “legacy supporters”.\nBoehly and Clearlake have been proactive in making cosmetic changes to Stamford Bridge, primarily in the form of new signage and video displays. Earlier this month a planning application was submitted to construct two large lion sculptures outside the ground; club officials insist they will cost less than the “£2million” ($2.5m) figure submitted on the official paperwork.\nThe ownership’s bigger idea is to make Stamford Bridge a more appealing, attractive place in the short term while they wrestle with the much bigger and more complicated issue of stadium redevelopment. That is unlikely to carry much weight with a match-going supporter base whose collective goodwill has been extinguished by price rises and cost-cutting measures.\nThe reality of Chelsea’s re-imagining as a business rather than a billionaire’s passion project is beginning to bite, and there are almost certain to be more flashpoints in the months ahead.\nGO DEEPER\nChelsea squad audit: Youthful potential, a midfield revamp but lack of bite remains\n(Top photo: Henry Nicholls/AFP via Getty Images)",
  "word_count": 1720,
  "scraped_at": "2026-02-14T12:56:08.112512"
}