{
  "article_id": "7187816b4892",
  "url": "https://www.aol.co.uk/articles/ousmane-dembele-named-player-fifa-182704082.html",
  "title": "Ousmane Dembele named player of the year at Fifa awards as Sarina Wiegman wins big",
  "date": "20251216T201500Z",
  "domain": "aol.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ousmane Dembele named player of the year at Fifa awards as Sarina Wiegman wins big\nOusmane Dembele has been named the men’s player of the year at Fifa’s The Best Awards, while Lionesses coach Sarina Wiegman won big as women’s coach of the year after back-to-back Euro titles.\nDembele was instrumental in Paris Saint-Germain’s first Champions League triumph when they beat Inter Milan 5-0 in the final and scored 35 goals last season across all competitions, including 21 in Ligue 1 to finish as top scorer.\nThe 28-year-old, who claimed this year’s Ballon d’Or in September, was part of the PSG team which also swept all before them on the domestic front last season and reached the final of the Club World Cup. They were coached by Luis Enrique, who also triumphed at the awards as men’s coach of the year.\nBarcelona Aitana Bonmati, who similarly won the women’s Ballon d’Or for the third time in a row this year, was also crowned as the women’s player of the year by Fifa.\nThe Champions League player of the season, Bonmati helped Barcelona win the domestic treble along with reaching the Champions League final.\nThe 27-year-old also reached the Euro 2025 final with Spain, with Bonmati named the player of the tournament.\nHer side were pipped to the Euros title by England in Switzerland, with Lionesses head coach Wiegman also victorious in the awards as she was was named the female coach of the year for the fifth time.\nWiegman wasn’t in attendance to accept the award in person but appeared on screen with a pre-recorded speech.\n\"It’s an absolute honour to receive this award again,” she said. “I’d like to thank Fifa and everyone who voted.\n\"Thank you to the FA for their continued support for me and the team. This award is actually for players and staff. We’ve showed so much conviction, belief and togetherness that led us to our second Euro win.\n“Moving into 2026, let’s keep pushing the women’s game forward together and. create an environment for every play, so they can reach their full potential.\"\nThe best women’s goalkeeper award went to England and Chelsea’s Hannah Hampton who played a major role in the Lionesses’ Euro 2025 win with her penalty shootout saves and also won the domestic treble with her club.\nItaly’s Gianluigi Donnarumma, who now plays for Manchester City, won the men’s keeper award for his role in PSG’s treble win.\nMexico’s Lizbeth Ovalle won the Marta Award, for the best goal in women’s football, for her scorpion kick for Tigres against Guadalajara in March.\nSantiago Montiel won the Puskas Award for the best men’s goal for his overhead strike for Independiente against Independiente Rivadavia during an Argentine Primera match in May.\nChelsea star Cole Palmer and Liverpool centre-back Virgil Van Dijk were among the Premier League contingent in the men’s team of the year, while Lionesses stars Hampton, Lucy Bronze, Leah Williamson and Alessia Russo were in a women’s team of the year dominated by Spanish and English players.",
  "word_count": 506,
  "scraped_at": "2026-02-14T12:50:34.825071"
}