{
  "article_id": "718eef72e263",
  "url": "https://www.prweb.com/releases/2023/03/prweb19225625.htm",
  "title": "GEN Agency  Athletes Turned Creators  NIL Education Workshop Joins  Secure the Bag  Financial Literacy Tour Stop at Savannah State University",
  "date": "20230316T170000Z",
  "domain": "prweb.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Begin Your School's or Agency's Name, Image, and Likeness Education at https://course.genagency.co/\nLOS ANGELES, March 16, 2023 /PRNewswire-PRWeb/ -- GEN Agency, a creator-focused marketing agency specializing in influencer management, brand campaigns, and event production showcased its expanded name, image, and likeness (NIL) education workshop – \"Athletes Turned Creators\" partnered with Beacons – at a recent \"Secure the Bag\" financial literacy tour stop at Savannah State University, in partnership with HBCU Heroes and the Southern Regional Press Institute. GEN Agency's \"Athletes Turned Creators\" education curriculum was developed by creators for student-athletes to better understand the growing creator economy. To learn more about how to create sustainable marketing campaigns that allow athletes an opportunity to monetize their NIL in their local community, visit https://course.genagency.co/.\nSavannah State University partnered with HBCU Heroes, a non-profit organization that connects corporate America to historically Black colleges and universities for recruitment with a goal to amplify the importance of financial literacy with interactive experiences, such as workshops and leadership panels with C-suite executives. The Secure the Bag Financial Literacy Tour & Career Fair Series is currently on a multi-HBCU trek to engage with student-athletes across all sports.\n\"A lot of Big Ten and Pac-12 schools are hiring general managers and other full-time consultants to handle the newly regulated market, while HBCU's are underrepresented and underfunded without the proper resources to have staff members dedicated to helping these student-athletes with their NIL, marketing, or branding,\" says Rachel Maeng Brown, NIL consultant and athletic influencer marketing expert; CEO and Founder of GEN Agency. \"Our team takes pride in spotlighting how to create organic marketable content, educating on NIL rules per state, sharing what brands or agents will not tell you, and using Beacons to set athlete's per post/appearance rate.\"\nThe hybrid event taught Savannah State University student-athletes, SIAC conference attendees, and students interested in the new NIL landscape how they can build and monetize their social media and manage their money.\nComprised of a multi-channel network with more than 66M+ followers across social media platforms, GEN Agency's goal is to democratize the creator economy with opportunities for networking and growth along with industry education. During the \"Athletes Turned Creators\" workshop portion of the HBCU Heroes tour, attendees experienced a surprise virtual appearance from @Jonquall, a social media influencer with 2M+ followers. He answered questions on how to make viral videos, time management on a tight college athlete's schedule, and provided tips on talking to brands. The event concluded with attendees taking part in recording TikTok videos and gaining insight on TikTok trends.\n\"At Savannah State University, we strive to create and maintain an inclusive culture that fosters participation for student-athletes from diverse and underrepresented backgrounds,\" says Horace Broadnax, Savannah State Men's Basketball Head Coach and 1984 NCAA Division I Champion with Georgetown. \"It was a joy to watch in real-time how the team of experts were able to set a proper rate for a member of the women's basketball club. After a live evaluation, it was revealed that she was being severely underpaid and did not know. This type of education is paramount to the new age success of student-athletes at HBCU's across the country.\"\nTo learn more about GEN Agency's \"Athletes Turned Creators\" NIL education workshop, visit https://course.genagency.co/.\nABOUT GEN AGENCY:\nGEN Agency is a full-service creator-focused marketing agency specializing in influencer management and brand campaigns, event and media production, along with NIL education and consulting. Comprised of a multi-channel network with more than 66M+ followers across our social media platforms, GEN Agency's goal is to democratize the creator economy by protecting its creators, providing on-time payments, opportunities for networking and growth, and industry education. GEN Agency's \"Athletes Turned Creators'' name, image, and likeness (NIL) education program offer's separate custom plans to athletic departments, athletic organizations, and businesses across the country, to help create sustainable marketing campaigns that allow athletes an opportunity to monetize their NIL in their local community. Website: https://genagency.co/; Instagram: @genagencyco\nABOUT RACHEL MAENG BROWN:\nRachel Maeng Brown is the CEO and Founder of GEN Agency and full-time marketing and strategy consultant. Awarded \"NYC 20 in their 20s\" in Entrepreneurship and Sports by Crain's New York Business in 2021, Rachel is a former Big Ten collegiate-athlete, Official TikTok Partner, and front-office sports staff member. She has partnered with brands like Amazon, Turbo Tax, Netflix, and Meta, and worked in the front offices of The NY Mets, Rutgers Football, Main Events - Boxing, The PGA Tour, and USRowing (Team USA). Instagram: @rachelmaeng\nABOUT BEACONS:\nBeacons is a platform of connected tools for creators to monetize their work and grow their following. Creators can share all important links with fans in one easy place, promote their personal brand, get paid partnerships, sell products, and get paid for their content. The suite offers tools for creator businesses, including: link-in-bio pages, media kits, invoicing tools, and storefronts.\nThe Beacons link-in-bio allows creators to build a free personal landing page with multiple links to their other socials, promote live events, videos, Spotify music or podcast embeds, Shopify links, even digital products. From here, creators can set up multiple income streams through Beacons. By building a media kit (digital resume) and using AI-driven message generation, users can pitch themselves to brands and secure paid sponsorships. By setting up a storefront and selling digital products through their link in bio and integrated emails, Beacons creators directly monetize their own fanbase through sales. Multiple income streams are tracked and managed with invoicing tools, an income dashboard, and tax preparation tools. Everything creators need to grow and make money is connected in one easy-to-use hub. Website: https://beacons.ai/\n# # #\nMedia Contact\nAlvin Woods, GEN Agency, 1 3479498172, [email protected]\nSOURCE GEN Agency",
  "word_count": 949,
  "scraped_at": "2026-02-14T13:45:16.730917"
}