{
  "article_id": "7192d9469689",
  "url": "https://nymag.com/intelligencer/article/the-future-may-be-march-madness-with-no-cinderella-stories.html",
  "title": "The Future May Be March Madness With No Cinderella Stories",
  "date": "20240320T113000Z",
  "domain": "nymag.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s difficult to choose a defining villain in the world of college athletics; there are just so many candidates deserving of the title. But if you love college basketball and the NCAA Tournament, which kicks off on Thursday, SEC commissioner Greg Sankey has to be awfully high on anyone’s list.\nSankey, who is paid $3.7 million a year by the league he runs — exactly $3.7 million more than that league pays any of its players — is less a commissioner and more of a high-powered lobbyist. The only thing he’s in charge of is making more money for the men who pay him. (Which, come to think of it, is exactly what being a commissioner means now in general.) Sankey isn’t just the most powerful person in the SEC; he’s the most powerful person in college athletics.\nHis standing is the result of recent seismic changes. As college sports — college football, really, which dominates everything else — has grown into a television-ratings Goliath, it has essentially consolidated itself into just two primary conferences: the SEC and the Big Ten. The rest of the sport now scrambles for whatever scraps are left. With the NCAA no longer in charge, Sankey has ascended to the throne as the unofficial leader of college athletics, or at least the guy with the most power to throw around. Which is a serious problem, because Sankey isn’t interested in what’s good for college athletics; he only wants to protect the SEC.\nSo it was very, very ominous last week when Sankey, while discussing college basketball’s NCAA Tournament, which is still a huge moneymaker and still responsible for the four most purely entertaining days on the sports calendar, made it clear that he wants the tournament to change. A lot.\n“Nothing remains static,” he told ESPN’s Pete Thamel, who is increasingly distinguishing himself as the reporter most likely to happily float trial balloons for college sports’ most craven power brokers, as evidenced by his recent “no, no, private equity is good for college sports” piece. “I think we have to think about the dynamics around Division I and the tournament … We are giving away highly competitive opportunities for automatic qualifiers [from smaller leagues], and I think that pressure is going to rise as we have more competitive basketball leagues at the top end because of expansion.” That is corporate speak for “we need more SEC teams in the tournament so I can make more money.” And the “automatic qualifiers from [smaller leagues]” bit? That translates to Sankey wanting to gut the reason people love the NCAA Tournament in the first place.\nRemember St. Peter’s, the tiny school from Jersey City that came out of nowhere to reach the Elite Eight in 2022, the one with that goofy mustachioed kid named Doug? That St. Peter’s team briefly became the best sports story on the planet when they beat juggernaut Kentucky despite having an entire athletic budget less than John Calipari’s annual salary. They were egalitarian champions, proof that on any given day, any given team can beat a bigger, richer opponent. St. Peter’s was precisely why people love the NCAA Tournament, why the tourney has remained a casual sports-fan staple for decades, and why it makes so much money in the first place. What could be a better advertisement for sports at their best?\nSankey would like to disinvite them, and teams like them (Fairleigh Dickinson, the team from Teaneck that upset No. 1 Purdue in the first round last year, comes to mind) from the tournament entirely. To him, St. Peter’s and the tourney underdogs — again, the best thing about the tournament — aren’t inspiring stories; they’re simply schools he’s never heard of taking money out of his pocket. He’d rather see a bad LSU team make the tournament than some Jersey Jesuit school fulfilling the lifelong dream of its players and alumni and getting half the country rooting for it in the process. After widespread backlash, Sankey attempted to clean up his comments by claiming he only wants a larger tournament, which is also a terrible idea, and which also feels increasingly inevitable. But he couldn’t even make it through a full damage-control interview without threatening the underdogs of the college-basketball world, saying, “There are great stories and we certainly want to respect those great stories, but things continue to change.”\nAnd remember, this is not a theoretical conversation: Sankey is the most powerful man in college sports right now. If he wants change to happen, it will happen. And he can look to the NIT Invitational, the consolation tournament for those who missed the NCAAs, as a model. This year, for the first time, it stopped inviting the champions of smaller conferences who didn’t reach the Big Dance and replaced them with middling major-conference teams like Georgia and Ohio State, simply because they might do better TV ratings and thus please the league’s corporate partners more. That tweak didn’t get much attention because no one cares about the NIT, but it’s a clear test run for how a Sankey-designed NCAA Tournament might look.\nThis is particularly alarming because it’s happening at a moment of historical weakness for college basketball, a sport that has become an afterthought in the eyes of people like Sankey and television executives and thus ends up constantly reshuffling itself in college football’s wake. While women’s college basketball is thriving in a way the men’s game isn’t, they’re both minnows compared to the whale that is college football, which means all the emotional arguments one makes for keeping the tournament as is end up just thrown in the same zero-sum, what-makes-a-random-gambler-in-suburban-Pennsylvania happy bucket, just something else that must be squeezed for maximum profit, actual fandom be damned. And as the quality of play in men’s college basketball has undeniably declined in recent years — thanks largely to roster instability and the industry-wide insistence on aping the three-point-obsessive style of the pro game without the NBA-level talent that makes it aesthetically pleasing — it makes the game an easy, vulnerable target for opportunists like Sankey. If it’s not college football, after all, then who cares? All that matters is the SEC’s profit margins.\nLook, I’m constantly worried about bad things happening to the NCAA Tournament; I articulated my existential fears about it in this space only two years ago. But my concerns back then feel downright naïve today. Then, I was only anxious about the powers that be expanding the tournament. Now, that feels like the best-case scenario, something I’ll accept if it means they don’t start evicting low-revenue schools — a scenario I couldn’t have even imagined in 2022. An NCAA Tournament with no St. Peter’s is no NCAA Tournament at all.\nIt remains to be seen if Sankey will get his way, but the fact that someone with as much power as he has is so willing to float ideas that would garrote March Madness — the event that much of America will be entranced by all week — for his own benefit is extremely alarming. If he really wants to, there is no one in charge who can stop him. The NCAA Tournament is my favorite sporting event on the planet. Like so many things these days, I find myself trying to appreciate it, while I can, while it’s here, before it’s gone. Because it may well be, and soon.",
  "word_count": 1234,
  "scraped_at": "2026-02-14T12:47:06.599073"
}