{
  "article_id": "719577012f25",
  "url": "https://www.richlandsource.com/2024/08/18/deep-brain-stimulation-easing-symptoms-for-essential-tremor-patients/",
  "title": "Deep brain stimulation easing symptoms for essential tremor patients",
  "date": "20240819T001500Z",
  "domain": "richlandsource.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "MANSFIELD — Essential tremor can make completing daily tasks feel impossible.\nTying shoes, fastening a button, using a fork, all tasks done without thinking for most of us, can become issues without a resolution for those suffering from essential tremors.\nAccording to Dr. Yagna Pathak, a medical science manager in Abbott’s Neuromodulation business, essential tremor is the most common type of movement disorder — with an estimated 7 to 10 million people affected in the United States, about 10 times more than Parkinson’s disease — including a number of people throughout north central Ohio.\n“It (ET) can affect men and women at any time of their life, but it most often manifests in middle age,” Pathak said.\n“People with essential tremor may experience uncontrollable rhythmic shaking usually affecting the hands, but can also involve head, voice and other body parts.”\nPathak said ET diagnosis is based on a patient’s medical history, clinical observation and a skilled physical examination.\nNo laboratory test can confirm an ET diagnosis, Pathak said, so neurologists often rely on a combination of criteria, including type of tremor, duration of symptoms and supporting tests.\nThe most effective treatment for tremor is a procedure known as deep brain stimulation, according to the International Essential Tremor Foundation.\nDuring the procedure, a pulse generator or battery is implanted under the skin of the patient’s chest, Pathak said.\n“This battery is then connected to thin wires, called leads, which are placed in a precise area of the brain,” she said.\n“Once everything is in place, connected and turned on, the battery produces painless electrical impulses that are delivered to the brain to correct abnormal brain activity caused by movement disorders, such as essential tremor or Parkinson’s disease.”\nDBS procedure, seeking diagnosis\nDeep brain stimulation is typically done over the course of two visits, Pathak said.\nLeads are implanted during the patient’s first visit — after which most people stay in the hospital, at least overnight, she said. The battery is implanted during the second visit and most patients are able to return home the same day.\n“Ultimately, each person is different, so the road to recovery will look a bit different for every patient,” Pathak said. “Their doctor will be in the best position to guide them on what to expect from the recovery process.”\nAdditionally, Abbott’s NeuroSphere™ Virtual Clinic is one way care can be extended to DBS patients for virtual programming beyond clinic walls.\nIf someone believes they are suffering from essential tremor, she said they should speak to a neurologist who specializes in movement disorders — suggesting patients can maintain a journal to summarize symptoms and how they impact quality of life.\n“A movement disorders specialist will conduct a physical examination to eliminate other movement disorders and confirm an ET diagnosis based on observations and medical history,” Pathak said.\n“Additionally, the specialist can recommend next steps for the best course of therapy.”\nVideo courtesy of Abbott.\nRehring’s injury inspired healthcare career\nFormer Ohio State football player Steve Rehring, who started on the 2006 and 2007 Buckeye offensive lines that each reached the national championship game, is now a territory manager in Abbott’s Neuromodulation business.\nHe provides technical support to surgeons and medical around the use of Abbott DBS products.\nAs the territory manager for Abbott’s brain therapies in the State of Ohio, Rehring’s job is to educate patients about DBS therapy as a treatment option for Parkinson’s disease or essential tremor.\nThe opportunity to see patients regain their ability to control areas affected by essential tremor never ceases to amaze Rehring.\n“Having the opportunity to see patients and their families post-procedure makes my job so enjoyable and motivates me daily,” he said. “Quite frankly, it is the best part of my day.”\nLooking back, the former Buckeye originally dreamed of having a chance to play in the National Football League — an idea in the back of Rehring’s mind each game he played.\n“I ended up having a serious medical incident during my career that required extensive physician and medical staff intervention to even get out of a hospital bed,” he said.\n“Fortunately, with their help I was able to get back to playing. From that point on, I was fascinated with working in healthcare.\n“Playing football as a Buckeye, along with my coaches, staff and teammates, showed me what it was like to be surrounded by the best team of people working together towards a goal.\n“All of the people who supported me early on inspired me to surround myself with a similar group of people in my career.”\nArea hospitals share local ET insights\nRichland Source spoke with doctors from area hospital networks, including Avita Health System, OhioHealth Mansfield and University Hospitals, about essential tremor and treatment options in Richland and Ashland counties.\nKnox Community Hospital was unable to provide comments due to a current lack of neurologists.\nDr. Omar Ahmad, board certified in neurology and neurophysiology, sees patients at Avita Health System locations in Ontario and Galion. He treats all neurologic disorders, with a special interest in treating movement disorders.\nAhmad said referrals are made to Avita’s clinic when ET symptoms do not respond to initial therapy, or if a patient’s provider is doubtful of the diagnosis and would like a second opinion.\n“As a result, I see many patients with essential tremor at our Ontario and Galion locations,” he said. “I also work closely with a nurse practitioner who sees ET patients in Ontario and Bucyrus.”\nMedical therapy is considered when the tremor interferes with everyday activities — such as eating, drinking or signing one’s name — or causes embarrassment, Ahmad said.\nHe said approximately 75 to 80 percent of ET patients experience some benefit with medication.\nA minority of patients seek surgical treatment because the tremor “is disabling and they are resistant to medical therapy.”\n“There are two primary surgical treatments available — Deep Brain Stimulation and Focused Ultrasound Thalamotomy,” Ahmad said. “While these do not offer a cure, they can be quite effective therapies.”\nAvita Health Systems doesn’t offer either procedure, but refers to The Ohio State University Medical Center and the Cleveland Clinic, based on patient preference.\nOnce a patient undergoes their procedure and initial treatment at a tertiary center, they can be followed locally at Avita locations if they wish, said Ahmad — who offers follow-up DBS programming for patients after surgery.\nUniversity Hospitals offers virtual programming\nDr. Aasef Shaikh, Penni and Stephen Weinberg chair in brain health and vice-chair for research at University Hospitals Neurological Institute, said increased awareness of essential tremor is beneficial for the community.\nIf patients don’t respond to a variety of medications, he said UH offers a robust deep brain stimulation program — including neurologists dedicated to practicing treatment of movement disorders.\nShaikh comes to Ashland’s UH Samaritan Medical Center once a month to see patients.\nOnce he considers them as a potential candidate for DBS, patients typically travel to UH Cleveland Medical Center for possibly two to three visits; which include meeting with a neurosurgeon and the surgical procedure itself.\n“Many other things we can do virtually,” he said. “I can do the initial programming in Ashland, in-person, but then the remaining programming we can actually do virtually.”\nShaikh still likes to see patients one to two times a year in person after surgery.\n“We can minimize the travel for the surgical procedure … but after that they don’t have to go anywhere so much,” he said. “So maybe two or three trips to Cleveland total, for the whole thing, and 95 percent of the things we can do in Ashland.”\nOhioHealth continues to expand neurology program\nDr. Gubert Tan, neurologist and stroke medical director at OhioHealth Mansfield, said about 8 to 10 patients afflicted with ET are seen per month at the Mansfield hospital.\nTan said treatment usually begins with medication as an attempt to reduce the tremor, as well as non-medical practices, such as using weighted utensils when eating.\nWhile DBS isn’t available at its Mansfield hospital, OhioHealth does offer the procedure — as well as high intensity focused ultrasounds — at its Riverside Methodist Hospital in Columbus.\nHesitancy to DBS among patients isn’t uncommon, Tan said.\n“But even during the (patient’s) first visit, I would offer them ‘These are the available options, these are the medications we will use and these are the possibilities,'” he said.\nAlong with Mansfield patients, Tan said the Mansfield hospital has also treated patients from surrounding communities, including Ashland, Mount Vernon, Mount Gilead and the Knox County area.\nHe said OhioHealth Mansfield is continuing to expand its neurology program, which currently includes three neurologists, two nurse practitioners and two neurosurgeons.",
  "word_count": 1444,
  "scraped_at": "2026-02-14T13:30:49.087638"
}