{
  "article_id": "71a93ccb73b8",
  "url": "https://news.yahoo.com/high-school-lacrosse-starting-l-130019330.html",
  "title": "High school lacrosse is starting to have an L . A . moment . Here why",
  "date": "20230320T140000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "High school lacrosse is starting to have an L.A. moment. Here's why\nThe coastal divide in the United States may be best defined not by arguments over bagels and pizza, but by attitudes toward a sport played with a ball and stick.\nLoyola boys’ lacrosse coach Jimmy Borrell is from northern Virginia, an East Coast lifer through and through. His teammates at the University of Maryland had dads who played there, and granddads, and great-great granddads. The sport is in the region’s very blood. So coaching in Southern California was culture shock.\nOnce, Borrell impersonated, a player told him he missed practice because “the waaaves were too good.” Another kid once skipped because he had a “glass-blowing club.”\n“I’m like, ‘You have a glass-blowing club — you guys making bongs over there?’” Borrell recalled, joking. “What’s going on in California?”\nLacrosse culture in the greater Los Angeles area, though, is starting to shift as more East Coast products have settled roots out west. A total of 6,670 high school athletes played Southern Section lacrosse in 2021-22, according to CIF participation census data, up from 5,870 in 2016-17. And the number of Division I prospects in the Southland, coaches say, has grown from a handful to a platoon.\nAs the sport continues to search for a wider audience, here’s a guide to the ins and outs of high school lacrosse in the Los Angeles area and beyond.\nWhat attracts athletes to the sport?\nSimple.\n“You can whack someone with a metal stick,” Borrell said. “It’s not a tough sell.”\nWell, that’s in the boys’ game — the girls’ game is much different, with a shorter field, less padding and less physicality. But both are sports of constant motion, coaches say, where dominance comes from stick skills and hand-eye coordination rather than a built frame and speed.\nProfessional lacrosse is a less-than-lucrative business, but solid recruits have the potential to earn scholarships to top academic schools on the East Coast. Take Loyola graduate Owen Gaffney, now playing at Harvard, or Brad Sharp of Palos Verdes, now starting at Yale.\n“You might be a low-level Division I football player that goes to some obscure school,” Borrell said, “but on a lacrosse field, man, you might be able to go to an Ivy League.”\nThe Southern California game\nWhen lacrosse first began as a Southern Section sport, Foothill girls coach Cristina Rodriguez said, there was about “one good player per team.”\nBut fundamentals have improved as a generation of East Coast players have settled in the area to helm some of the top programs in Southern California. Rodriguez, a native of Baltimore, has shaped Foothill into the top dog in Southern Section girls’ lacrosse: 6-0 to start 2022-23 after a Division 1 title last year. Corona Del Mar and Loyola, coached by former East Coast college players G.W. Mix and Borrell, were respectively the last two Division 1 champions in boys’ lacrosse.\n“That East Coast passion for always playing, always having a stick in your hand, has helped grow the game,” Rodriguez said.\nThe keys to winning in Southern California are depth and fundamentals, coaches say. Under rules of the National Federation of State High School Assns., the high school game doesn’t have a shot clock, meaning a wide range of teams prefer to play grind-it-out lacrosse. Individual players who can pull off complicated moves and shoot on the run stand out.\n“Making sure the stick is an extension of your body — that is what separates the best lacrosse players from the good lacrosse players,” Agoura coach Sean Lindsay said.\nContinued growth\nOn a tiny patch of turf on Inner City Education Foundation Public Schools’ home campus, a group of six combined View Park girls and boys giggled as they tried to knock the ball out of one another's sticks in a Thursday practice.\nThey shot on a tiny net, because their only full-size one — lent by a now-graduated Pacific Palisades player — was broken. The sticks in their hands were either left over by an old camp run by youth nonprofit Harlem Lacrosse or bought via aggressive Facebook Marketplace maneuvering by coach Elizabeth Waterman.\n“The aspect of funding,” first-year coach Waterman said, “has been difficult.”\nIt is a microcosm of the promise and obstacles high school lacrosse programs face in Los Angeles. Individual sticks can cost up to $150, gloves $200, helmets up to $300 — an “expensive start-up,” as Borrell put it.\nThe City Section, which covers more teams from underfunded areas, has just 12 schools that field a lacrosse team. The class disparity has corresponded to a racial disparity at the collegiate level. Despite modest improvement during the last decade, 83% of women’s and men’s lacrosse teams in 2022 were white.\n“If you go around saying you play lacrosse, you got people saying, ‘Oh, that’s that white people s—,’” said Ayomide Aborisade, a member of the View Park girls’ lacrosse team.\nYouth programs like Harlem Lacrosse, which has made roots at Compton High, are key to the growth of the game in lower-income communities, coaches said. View Park has forfeited every game on its schedule this season, not fielding enough students to play. But more will come after the school’s rugby season finishes, Waterman hopes, and the sport’s effect on a joyous bunch Thursday was clear.\n“I think it’s a pretty unique sport,” Aborisade said. “We also want to make it more known, for not just white kids, for Black kids.”\nThis story originally appeared in Los Angeles Times.",
  "word_count": 920,
  "scraped_at": "2026-02-14T12:45:01.802012"
}