{
  "article_id": "71daaa0f4c78",
  "url": "https://www.cityam.com/drinking-in-stands-hailed-as-success-as-more-clubs-join-wsl-pilot-scheme/",
  "title": "Drinking in stands hailed as success as more clubs join WSL pilot scheme",
  "date": "20260123T193000Z",
  "domain": "cityam.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Drinking in stands hailed as success as more clubs join WSL pilot scheme\nWomen’s Super League chiefs have hailed its trialling of allowing football fans to drink alcohol in the stands as a major success as more clubs take advantage.\nThe Fan Choice pilot was rolled out across 14 clubs in the WSL and WSL2 this season after a small-scale experiment in the second half of last term proved to be well received.\nAston Villa jumped on the bandwagon earlier this season, and in recent weeks Tottenham Hotspur, Nottingham Forest and Leicester City have taken the tally of participating clubs to 18 out of 24 in the top two divisions.\nThe WSL says there have been no reported incidents or ejections related to the pilot, while a survey of fans who have been part of the trial rated their feeling of safety 9.4 out of 10.\nSeven in 10 supporters now back alcohol being available in the stadium bowl at women’s games, up from 58 per cent last summer, and only one in 10 is against it.\nFans report that matches remain as family-friendly as before, while scores given for atmosphere have increased slightly following the pilot.\n“We have been trusted by our clubs and fans to take the leap with piloting Fan Choice, and it’s so pleasing to see such positive feedback in the first half of the season,” said WSL head of infrastructure, safety and sustainability Hannah Buckley.\n“As a league, when it comes to having a different approach to the norm, we are not scared to test and learn, and the pilot so far has shown the value in doing that.\n“Fan Choice has also seen some fantastic innovation from our clubs, and we’re thrilled that three more have joined for the second half of the campaign.\n“We will continue to work with our clubs over the coming months and look forward to seeing how the pilot develops over the rest of the season.”\nAlcohol ban lifted for Women’s League Cup\nThe WSL teams taking part in the trial are Arsenal, Aston Villa, Chelsea, Everton, Liverpool, London City Lionesses, Manchester City and Manchester United.\nIn the WSL2, Birmingham City, Bristol City, Crystal Palace, Leicester, Newcastle United, Nottingham Forest, Sheffield United, Sunderland, Southampton have also joined.\nFans will also be able to drink in the stands at the Women’s League Cup final for the first time when it takes place on 15 March at Bristol City’s Ashton Gate Stadium.\nDrinking alcohol in view of the pitch is banned in men’s football under a 30-year-old law dating back to the hooligan era, but that rule does not apply in the women’s game.\nThe success of the WSL’s trial is likely to increase calls for restrictions to be loosened at Premier League and Championship stadiums, which are now all-seater.\nMany of the clubs in the women’s pilot have designated sections of their grounds as alcohol-free zones, to give supporters a choice.",
  "word_count": 491,
  "scraped_at": "2026-02-14T12:13:26.158203"
}