{
  "article_id": "722085289e38",
  "url": "https://www.bbc.com/news/articles/c9qlen17zp9o",
  "title": "Lionesses become TfL station announcers for  historic  weekend",
  "date": "20241116T054500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lionesses become station announcers for weekend\nFootball fans will hear some of their favourite Lionesses make special station announcements as they travel across London for a \"historic weekend\" in the women's game.\nThe announcements will come from England Women’s footballers Alex Greenwood, Bethany England, Lotte Wubben-Moy and Lucy Bronze.\nThey will be played at Fulham Broadway, Seven Sisters and White Hart Lane stations to mark the first time all games in the Barclays Women’s Super League and Barclays Women’s Championship will be played in main stadiums.\nDeputy Mayor for Transport, Seb Dance, said: “I hope fans enjoy this special weekend and reflect on how women’s football continues to thrive, inspire and unite communities.”\nDance added that he was \"thrilled\" Transport for London (TfL) had partnered with Barclays Women’s Super League \"to celebrate this historic weekend for women’s football\".\nOn Saturday, Tottenham Hotspur will take on local rivals Arsenal at White Hart Lane while Chelsea host Manchester City at Stamford Bridge stadiums.\nWhiteboard messages on the TfL network will also highlight the games and the upcoming launch of the London Overground Lioness line, which runs between Watford Junction and Euston.\nThe line runs through Wembley and pays homage to the most successful senior England football team since 1966.\nThe Lionesses were crowned Euro 2022 champions and reached the Women's World Cup final in Australia last year.\nListen to the best of BBC Radio London on Sounds and follow BBC London on Facebook, X and Instagram. Send your story ideas to hello.bbclondon@bbc.co.uk",
  "word_count": 250,
  "scraped_at": "2026-02-14T13:05:18.879172"
}