{
  "article_id": "7251d42e3c67",
  "url": "https://www.nytimes.com/athletic/6477625/2025/07/07/usmnt-mexico-gold-cup-arsenal-gyokeres/",
  "title": "USMNT fail again – what now ? Plus : Arsenal eye Gyokeres , and Jimenez touching Jota tribute",
  "date": "20250707T190000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Athletic FC ⚽ is The Athletic’s daily football (or soccer, if you prefer) newsletter. Sign up to receive it directly to your inbox.\nHello! The Gold Cup got away from him. It’s a strong World Cup or bust for Mauricio Pochettino now.\nOn the way:\n- Mexico outclass the USMNT\n- Arsenal close in on Gyokeres\n- Partey rape charges explained\n- Jimenez’s Jota tribute\nFinal fallout: What have we learnt after USMNT loss to Mexico in Gold Cup?\nThe next time the United States men’s national team step out for a competitive match, we’ll be talking about the 2026 World Cup. Depending on your point of view, that’s either a long old wait with a lot of thumb-twiddling, or it’s a run-in that will disappear in a flash.\nAfter losing against Mexico in the Concacaf Gold Cup final last night, it’s hard to know if an extended period without jeopardy is what the doctor ordered for Mauricio Pochettino. There’s something to be said for a period away from all-or-nothing fixtures, but somehow, he has to get the U.S. into cut-throat mode. It’s literally years since they looked fully competition-ready.\nAdvertisement\nTheir 2024 Copa America campaign went so badly it cost Gregg Berhalter his job as head coach and brought Pochettino to the fore. Their participation in March’s Nations League finals was a washout, and for all that they ran Mexico close in Houston yesterday, what to make of their run to the trophy match, really?\nThe group stage was a cinch. They needed penalties to see off Costa Rica in the quarter-finals and then in the semis, they faced Guatemala, ranked outside FIFA’s top 100. The final itself was an encapsulation of the USMNT under Pochettino: a flicker of promise burning out and rendering them second best. Mexico had their number.\nAnd so, the most expensive and high-profile coach U.S. Soccer has ever hired goes back to the drawing board. At the World Cup next summer, he should have a stronger squad and more players to work with, Christian Pulisic for one. Every friendly from here on is a building block, but we’re still no closer to saying this will be a successful appointment.\n‘I’m not going to cry’\nIn mitigation, Pochettino was down on numbers at the Gold Cup, and Pulisic’s absence created an unhelpful narrative going into the tournament. It should also be said that the penalty decision that went against the U.S. at 1-1 last night — an unpunished handball from Mexico’s Jorge Sanchez — was unreal. Judge for yourselves.\n“I’m not going to cry,” Pochettino said afterwards. “If that happened in the opposite (box), for sure it’s a penalty.” He implied that a predominantly Mexican crowd swayed the officials, but there in itself is another issue: games like these are still battling to draw majority American audiences. Their semi-final against Guatemala was similar.\nNonetheless, the USMNT had an early lead to protect after Chris Richards’ header bounced down off the crossbar and over the goal line in the fourth minute. What happened next highlighted Pochettino’s biggest problem — his squad aren’t resilient enough and their game management requires work. Mexico cleared their heads and patiently turned the screw.\nAdvertisement\nIt always feels like enough pressure applied in the right areas will cause the U.S. to crack. Raul Jimenez equalised, because of course he did. He’s a clutch player for Mexico who delivers again and again. Edson Alvarez’s winner on 77 minutes was allowed to stand on review, despite Cesar Montes appearing to block Richards from an offside position. Truly, Pochettino could do with something going his way.\nThe contentious decisions aside, he wasn’t dispirited at full time. “This is the way we want to build our journey into the World Cup,” he said. “I have no doubt that we’re going to be really, really competitive and very difficult for the opponent.” The public need to hear that confidence. I’m just not sure they’ll share it.\nTransfer talk\nNo rest for the wicked in the transfer market over the weekend. Let’s get to it:\n- Arsenal’s patience in pursuing Martin Zubimendi paid off. They’ve signed him from Real Sociedad for £55m ($76.5m), which is higher than his release clause but lets them pay the midfielder’s fee in instalments, rather than one lump sum.\n- Viktor Gyokeres could be next. Talks to take the prolific Sporting CP striker to the Emirates are at an advanced stage. Without question, the 27-year-old is different to Arsenal’s other attacking assets.\n- We can’t rule out Mikel Arteta bringing in Chelsea’s Noni Madueke either. That one is progressing quietly as Jamie Gittens arrives at Stamford Bridge from Borussia Dortmund for £48.5m.\n- Tottenham Hotspur failed with an initial £50m bid for West Ham United forward Mohammed Kudus. We’ll see if they have another go at the 24-year-old.\n- Fresh from the Club World Cup, Igor Jesus’ transfer from Botafogo to Nottingham Forest is complete. It’s a giant leap for the 24-year-old forward.\n- Burnley paying £5m for experienced right-back Kyle Walker from Manchester City could be a smart bit of business. The fee won’t bankrupt them, and at 35, he is not cooked yet.\n- Jhon Duran is a rolling stone. Having left Aston Villa for Saudi Arabia, he has packed up again to join Jose Mourinho’s Fenerbahce on loan. It is his fifth different national league, at the age of 21.\n- Canada international Jonathan David finalised a five-year contract at Juventus late on Friday. He should do well there.\nPartey case: Why did it take three years to bring rape charges?\nLast September, TAFC covered the story of the unnamed Premier League footballer who was under investigation by police over allegations of sexual assault stretching back to 2021.\nWe knew who he was, but he remained anonymous in published articles because privacy law in the UK prevents a criminal suspect from being named until they are charged with an offence. The length of time taken to investigate — we’re talking three years since he was first arrested — reflects how allegations of rape are particularly difficult to deal with.\nOn Friday, the footballer at the centre of the case was identified as Thomas Partey, the Ghanaian midfielder who spent five seasons with Arsenal until his contract expired last week. The 32-year-old has been formally charged with five counts of rape and one of sexual assault against three separate women in 2021 and 2022. He denies the allegations and is due to make a first court appearance in London on August 5.\nAdvertisement\nArsenal, you’ll remember, tried to extend Partey’s contract but failed to reach an agreement with him. They also continued to field him throughout the long period when police were questioning him. The Athletic’s Sarah Shephard published a thought-provoking column over the weekend, questioning the club’s conduct in standing by Partey despite the serious nature of the claims against him. Arsenal say they are unable to comment while legal proceedings are live, but the concerns Sarah raises will have to be addressed.\nMusiala pain: Bayern star fractures fibula as PSG secure semi-final spot\nBayern Munich are out of the Club World Cup, but they’re flying home with a nice wedge of cash. They’re also flying home with a seriously injured Jamal Musiala, proving that nothing comes for free.\nMusiala was hurt in Saturday’s quarter-final defeat against Paris Saint-Germain during an incident that turned some unfair fire on Gianluigi Donnarumma. The PSG goalkeeper’s challenge on Musiala — a dive at the midfielder’s feet (above) — inflicted a fractured fibula, but in real time, he was entitled to go for the ball and only did what the average goalkeeper would have done.\nThe goalkeeping union tends to be tight, so it was a surprise to hear Bayern’s Manuel Neuer digging out Donnarumma, saying: “You don’t have to go in like that. He takes the risk of injuring his opponent.” I guess the frustration is understandable. Musiala is one of Bayern’s biggest talents and he is unlikely to be back until the end of the year.\nAs a whole, PSG’s 2-0 win had a feisty flavour, ending with them reduced to nine players. Real Madrid’s 3-2 victory against Borussia Dortmund was equally lively, the show stolen by another goalkeeper, Thibaut Courtois (despite Kylian Mbappe’s best efforts). This stoppage-time strike from Marcel Sabitzer, below, was in, right until Courtois stretched his arm that improbable inch further. If you’re ever trying to define a world-class save, that’s it.\nAround TAFC\n- If you bought a ticket for the Club World Cup’s first semi-final (between Chelsea and Fluminense), the price last Wednesday was $473.90. By Saturday, it was $13.40. Those who went early must be a bit miffed, to say the least.\n- There was a time when England Women’s coach, Sarina Wiegman, could do no wrong, but pressure is mounting after they lost their opening Euro 2025 game to France and fell foul of the tightest offside decision you’ll ever see.\n- A bit of humour for your Monday morning: a club in China have been fined for placing “feudal superstitious items” in an opposition dressing room. Changchun Xidu FC, of China League Two, were the guilty party. But hell, they won the game.\n- Most clicked in Friday’s TAFC: Nico Williams’ shock decision to turn down Barcelona.\nCatch a match\nUEFA Women’s European Championship: Group B: Spain vs Belgium, 12pm/5pm; Portugal vs Italy, 3pm/8pm — both Fox Sports/ITV.\nA friend’s farewell…\nDiogo Jota and his brother, Andre Silva, were laid to rest on Saturday in their hometown of Gondomar in Portugal. The reaction to their deaths has been so telling. Two of Jota’s Portugal team-mates, Joao Cancelo and Ruben Neves, made it to the funeral despite playing at the Club World Cup in America the previous night.\nJust to show how many people Jota affected, Raul Jimenez, a former colleague of the 28-year-old’s at Wolverhampton Wanderers, marked his Gold Cup goal last night by holding up a shirt with Jota’s name and number on it, and pretending to play a games console — a nod to Jota’s supreme esports ability. A touching tribute on the other side of the world.\n(Top photo: Robbie Jay Barratt – AMA/Getty Images)",
  "word_count": 1707,
  "scraped_at": "2026-02-14T12:58:51.579981"
}