{
  "article_id": "7273d2ed16b2",
  "url": "https://abc30.com/post/olympic-boxer-imane-khelifs-gender-center-ioc-iba-controversy/15137823/",
  "title": "Olympic boxer Imane Khelif gender at center of IOC , IBA controversy",
  "date": "20240802T231500Z",
  "domain": "abc30.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Docs show Khelif was assigned female at birth, according to IOC.\nByKiara Alfonseca\nSaturday, August 3, 2024\nAlgerian boxer Imane Khelif is the target of controversy over her gender and sex after Italian boxer Angela Carini abandoned their Olympics bout on Thursday after only 46 seconds.\nShortly after the match, reports falsely surfaced saying that Khelif is a transgender woman, however, she is not and was assigned female at birth, according to the IOC.\n\"The Algerian boxer was born female, was registered female, lived her life as a female, has a female passport,\" the International Olympic Committee (IOC) said in a press conference on Friday.\nNow, the Algerian Olympic and Sports Committee (COA) and the IOC are speaking out about the misinformation on Khelif's gender and sex.\nThe COA denounced what it called \"malicious\" and \"unethical\" attacks directed at Khelif.\n\"These attempts at defamation, based on lies, are totally unfair, especially at a crucial time when she is preparing for the Olympic Games, the peak of her career,\" said the COA in a translated statement.\nAt the center of controversy around her participation in Paris is her disqualification from the International Boxing Association's (IBA) 2023 Women's World Boxing Championships in New Delhi.\nIn a new statement, the IBA claims she failed to meet the unspecified eligibility criteria for participating in the women's competition and was disqualified while in the midst of the international contest.\nThis disqualification has sparked false rumors that she is transgender, or assigned male at birth.\nAccording to the IBA, Khelif did not undergo a testosterone examination, but was instead subject to \"a separate and recognized test, whereby the specifics remain confidential.\"\nThe IBA does not state the nature of the test and why they were concerned. However, the IBA stated that Khelif and one other boxer from Taiwan, Lin Yu-ting, \"were found to have competitive advantages over other female competitors.\"\nAccording to the IBA, neither athlete successfully appealed their disqualification and the decisions are legally binding.\nAt the time of the decisions, Khelif told Algerian Ennahar TV: \"This is a conspiracy and a big conspiracy, and we will not be silent about it.\"\nBoth Khelif and Lin had previously competed in a host of IBA championships and tournaments in the years prior to the disqualification. They also competed in the 2020 Tokyo Olympic Games.\nNeither Khelif nor Lin took home a medal. According to the COA, Khelif has 50 fights under her belt, including 37 wins and nine losses.\nAccording to the meeting minutes in which the test results were discussed, the two failed to meet \"one of the eligibility criteria.\" The organization's president, Umar Kremlev, told the Russian state-owned news agency Tass that the two women had XY chromosomes, however, ABC News has not independently confirmed this.\nIt is possible for women to have XY chromosomes, according to major medical and health organizations. For example, people with differences in sexual development (DSD) - sometimes referred to as intersex - often have atypical genes, hormones, and reproductive organs \"that differ from expectations generally associated with male and female bodies,\" according to the NHS and the CDC.\nIt is unknown whether a chromosomal test was the basis for the disqualifications or if either Khelif or Lin has this condition.\nAn example of DSD noted by the NHS states: \"You or your child may have sex chromosomes (bundles of genes) usually associated with being female (XX chromosomes) or usually associated with being male (XY chromosomes), but reproductive organs and genitals that may look different from usual.\"\nThis means even though someone may genetically be born with the \"XY\" typical male chromosomes, their body may not produce or respond to testosterone and they would develop more closely to a typical \"XX\" female.\nEstimates show that there may be up to 1.7% of people who are born with intersex traits, according to the Office of the United Nations High Commissioner for Human Rights.\nBoth Khelif and Lin had previously competed in a host of IBA championships and tournaments in the years prior to the disqualification. They also competed in the 2020 Tokyo Olympic Games. Neither Khelif nor Lin took home a medal.\n\"Every person has the right to practice sport without discrimination,\" the IOC said in a Thursday statement on the controversy surrounding the athletes. \"The IOC is saddened by the abuse that the two athletes are currently receiving.\"\nThe IOC slammed the IBA's 2023 decision in its recent statement. The organization argued that eligibility rules should not be changed during competition and rules should be based on scientific evidence.\n\"These two athletes were the victims of a sudden and arbitrary decision by the IBA,\" the statement read. \"The current aggression against these two athletes is based entirely on this arbitrary decision, which was taken without any proper procedure - especially considering that these athletes had been competing in top-level competition for many years.\"\nAs with previous Olympic boxing competitions, the IOC states that the gender and age of the athletes are based on their passports.\nAccording to the IOC, Olympic athletes must comply with the competition's eligibility and entry regulations, as well as all applicable medical regulations set by the Paris 2024 Boxing Unit.\nThe same rules have been applied at the boxing tournaments of the 2023 European Games, Asian Games, Pan American Games and Pacific Games, the ad hoc 2023 African qualifying tournaments in Dakar and two world qualifying tournaments held in Busto Arsizio and Bangkok in 2024 among others.\nThe IBA criticized the IOC for allowing the two athletes to play and defended its position, asserting that Khelif and Lin do not belong in the women's category.\n\"The IBA will never support any boxing bouts between the genders, as the organization puts the safety and well-being of our athletes first,\" said the IBA. \"We are protecting our women and their rights to compete in the ring against equal rivals, and we will defend and support them in all instances.\"\nAfter Italian boxer Angela Carini and Khelif exchanged a few punches on Thursday in this year's Paris games, Carini quit the competition due to pain in her nose within 50 seconds in the ring, according to a report from NBC News - sparking further concerns about Khelif's participation.\n\"I am not here to judge or pass judgment,\" Carini told reporters after the match, according to NBC. \"If an athlete is this way, and in that sense it's not right or it is right, it's not up to me to decide.\"\nThe IBA and IOC have been at odds since roughly 2019, when the IOC suspended the IBA over concerns about financial transparency, the integrity of its policies for referees and judges, and the organizational culture.\nRecognition of the group was officially withdrawn in 2023, meaning that the IOC took over the management of boxing at the Olympic level and is currently looking for a different international federation to represent and host boxing at the 2028 Los Angeles Games.\nThe IBA condemned the move, claiming that the IBA had ended the \"toxic and corrupt culture that was allowed to fester under the IOC for far too long.\"\n\"We have made the International Boxing Association new, transparent, clean, and our successes were publicly acknowledged by international independent experts and there is only one organization that has no interest in recognizing our tremendous progress,\" said Kremlev, the IBA's president. \"We accepted the process and the rules, but in the end, we were not assessed fairly. Now, we are left with no chance but to demand a fair assessment from a competent court.\"\nIn a March 2024 profile by UNICEF, Khelif recalled being bullied by boys for excelling at football in her rural village in Tiaret in western Algeria when she was a teen. The article notes that dodging punches from the local boys led her to boxing.\nHowever, her father didn't approve of boxing for girls so Khelif and her mother reportedly sold scrap metal for recycling and her mother sold couscous to pay for bus tickets to get to boxing lessons in a nearby village.\nABC News has reached out to both Khelif and Lin's Olympic teams for comment.\nHer next match is Aug. 3 at 11:22 a.m. ET.\nCopyright © 2026 ABC News Internet Ventures.",
  "word_count": 1376,
  "scraped_at": "2026-02-14T12:09:28.386648"
}