{
  "article_id": "7285d0f44e74",
  "url": "https://www.bbc.co.uk/sport/africa/66374427",
  "title": "England v Nigeria - key battles that may decide World Cup last - 16 match in Brisbane",
  "date": "20230805T073000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England v Nigeria - key battles that may decide World Cup last-16 match in Brisbane\n- Published\nEngland and Nigeria meet in the last 16 of the Women's World Cup on Monday in a game likely to hinge on key battles across the pitch at Brisbane's Suncorp Stadium.\nGoalkeepers Mary Earps and Chiamaka Nnadozie have kept four clean sheets in their six combined appearances at the 2023 tournament, while the likes of Barcelona's two-time Champions League winner Asisat Oshoala and in-form Lauren James are targeting more goals.\nBBC Sport Africa takes a look at which individual contests could prove pivotal.\nAsisat Oshoala vs Millie Bright\nThe Super Falcons will be desperate for star striker Asisat Oshoala to score her second goal of the tournament and end an unwanted record of never netting more than once at a World Cup.\nThe five-time African Women's Footballer of the Year hit 26 goals in all competitions on her way to European glory and a fourth Spanish title with Barcelona last season, but she did not have a shot on target during Nigeria's goalless draws with Canada and the Republic of Ireland during the group stage.\nIn between, Africa's first and only female Ballon d'Or nominee made herself the first player from the continent to score at three finals with the third goal in her country's 3-2 win against co-hosts Australia.\nThe 28-year-old pounced on the chance to open her account from a tight angle following the kind of defensive mix-up that Bright is unlikely to afford her, although the England captain produced an uncharacteristically shaky performance as the Lionesses laboured to beat Haiti in their opener.\nBright, 29, returned from a four-month injury absence for the start of the tournament but the rustiness she continued to show against Denmark in England's second game was made more forgivable by her place at the centre of a defence that kept two-time European Women's Player of the Year Pernille Harder from scoring.\nBright's four interceptions in England's 6-1 thrashing of China were more than her total from her first two games combined, while her 145 successful passes against the former runners-up were the most on record for a player in a Women's World Cup match.\nBright was also involved in England's second goal, winning possession and driving forward before finding scorer James, and finished the game with a combined total of five more clearances and interceptions than any of her team-mates.\nOshoala's pace and finishing ability could show up any lingering shortcomings in Bright's athleticism and sharpness following her injury. But she failed to score from positions classed as big chances by analytics experts Opta against Canada and the Republic of Ireland.\nThe former Liverpool and Arsenal forward surely cannot afford any more wastefulness against opponents who have conceded just once in open play in competitive games since winning the Euro 2022 final more than a year ago.\nChiamaka Nnadozie vs Mary Earps\nAs they have done since the very start of their teams' campaigns, both goalkeepers may have to continue adding to their reputations.\nHaving become the youngest goalkeeper to keep a clean sheet at the World Cup in 2019, Nnadozie returned four years later at the relatively ancient age of 22 to captain her team against Olympic champions Canada in the Super Falcons' opening game.\nThe Paris FC goalkeeper kept out a penalty by a player 18 years her senior when she stopped Christine Sinclair scoring at a record sixth World Cup tournament, leading Nigeria coach Randy Waldrum to laud the player of the match and praise a save that he said \"really lit the fire and made us realise there's still something to play for.\"\nIt means England cannot take scoring from the spot for granted against the player responsible for saving three successive penalties in a shootout against Cameroon in the 2019 African Games final.\nEarps has more freedom to advance forward in a team that kept more than 70% of possession in all of their group games, taking a total of 20 touches outside of her penalty area to Nnadozie's seven.\nIn England's opener, against a Haiti team who had been deceptively wayward with their shooting, Earps produced two excellent saves to preserve three points. The 30-year-old subsequently called on England to raise their standards, but Nigeria's historic struggle to score means they are likely to be more dependent on their goalkeeper keeping a clean sheet.\nThe African team's equaliser against Australia ended a wait of more than six hours for a goal at the finals and since the turn of the century they have gone without a goal in 14 of their 19 World Cup matches - only two of which have ended in victories.\nNnadozie's saves, then, are more likely to be crucial.\nChristy Ucheibe vs Lauren James\nAll-action Ucheibe could be key to limiting England's at-times irresistible flow through the centre of the pitch.\nThe Benfica midfielder has done most of her busy work from midway inside Nigeria's half, taking on 16 more duels than anyone else.\nFrom 49 such challenges, the 22-year-old has won 11 more than any other Nigeria player, tending to stay closest to Sinclair in the opening match to snuff out the threat of Canada's dangerwoman.\nUcheibe's total of 18 tackles is twice as many as any of her team-mates, and she is one of only four Nigeria players to have found a team-mate more than 20 times in opposition territory.\nBut in-form James will take some stopping and must be brimming with confidence. Against China, the 21-year-old scored twice and provided three assists as she became the youngest player on record to directly contribute to at least four goals during a single World Cup match, while her shot conversion rate currently sits at 60%.\nEngland had the squad depth to start James on the bench against Haiti but she has been described as \"very special\" by coach Wiegman.\nWith 19-year-old Deborah Abiodun suspended for two games as a result of her dismissal against Canada, Nigeria have started Halimatu Ayinde in a defensive midfield pairing with Ucheibe.\nAyinde had by far the highest passing accuracy of any Nigeria player against Australia, while no player eclipsed the number of times she won possession against the Republic of Ireland.\nWhether Ucheibe lines up alongside Ayinde or Abiodun, the Super Falcons' defensive midfielders will have to be at the top of their game to deal with James.\nOsinachi Ohale vs Alessia Russo\nNigeria took the lead at the finals for the first time courtesy of centre-back Ohale's bravery, going ahead against Australia after the defender bundled the ball in while taking a boot to the ribs.\nSeveral minutes of treatment followed for the 31-year-old, and her reward for helping her country through to the knockout stage is a likely tussle with new Arsenal signing Russo.\nOhale has been here before - starting Nigeria's 3-0 defeat to Germany in the last 16 in 2019 - and her aerial ability is one of her team's strengths in their quest for a first ever knockout stage win, underlined by the nine headed clearances she has made - four more than any other player who could take to the field in the last-16 tie.\nPart of Ohale and Nigeria's challenge will be judging where Russo is playing. The 24-year-old can act as something of a throwback centre-forward, with the physicality and poacher's instinct to match, but she spurned one big chance and did not score from six shots from inside the box against Haiti.\nThings were different against China, when a deft fourth-minute strike ended Russo's wait of more than five months for an international goal.\nAnother issue for Ohale is Russo's potential to drag her out of position and leave space for the likes of Chloe Kelly, Lauren Hemp and Georgia Stanway to find space in dangerous areas.\nOhale has spent all but six minutes of the tournament in a central defensive partnership with 21-year-old Reims defender Oluwatosin Demehin. Should they continue together against England, the understanding they have formed is in for its sternest test yet.\nBlur: Radio 2 in Concert: Enjoy a selection of classic songs and new tunes from the iconic band\nWhy would you want to avoid red ropes? Take a journey back to Ancient Greece to find out...",
  "word_count": 1383,
  "scraped_at": "2026-02-14T13:01:04.223167"
}