{
  "article_id": "72a50495c7e2",
  "url": "https://arsenalnews.co.uk/2025/07/17/arsenal-make-record-signing-with-olivia-smith-deal/",
  "title": "Arsenal make record signing with Olivia Smith deal",
  "date": "20250718T004500Z",
  "domain": "arsenalnews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal Women have completed the signing of Canadian international Olivia Smith from Liverpool.\nRenée Slegers and her coaching staff have been busy strengthening the squad as they aim to challenge seriously for the Women’s Super League title next season.\nSmith is the fourth player to arrive at the club this summer, following the earlier signings of Anneke Borbe, Taylor Hinds and Chloe Kelly.\nThe 20-year-old attacker has signed a four-year contract with Arsenal, who are the current Women’s Champions League holders.\nHer transfer, valued at £1 million, has set a new world record in women’s football, overtaking the previous £900,000 fee Chelsea paid for Naomi Girma in January.\nFrom Canada to Portugal and England\nSmith began her football journey in her native Canada before moving to the United States to play in the college system.\nShe signed her first professional contract with Sporting CP in Portugal in 2023. She made an immediate impression there.\nSmith bagged one goal and one assist on her debut. She went on to score 16 times in 28 matches during the 2023/24 campaign.\nHer outstanding displays earned her both the Liga BPI Player of the Season and the Young Player of the Season awards.\nSmith then joined Liverpool in July 2024 and quickly adapted to life in England’s top flight. She scored nine goals in 25 games across all competitions.\nHer performances helped her win Liverpool’s Player of the Season award, and she also received a nomination for the PFA Young Player of the Season.\nSmith made her debut for Canada in 2019 at the age of 15, becoming the youngest player to represent the country.\nShe has earned 18 caps and scored four goals for Canada. She featured at the 2023 FIFA Women’s World Cup and the 2024 CONCACAF Women’s Gold Cup.\nShe was named the Best Young Player at the latter tournament, further showing her potential as one of football’s brightest young stars.",
  "word_count": 320,
  "scraped_at": "2026-02-14T12:44:00.368576"
}