{
  "article_id": "72ab3809351a",
  "url": "https://www.marieclaire.com/culture/news/g5011/fall-movies/",
  "title": "The 31 Best Fall Movies of All Time",
  "date": "20240920T224500Z",
  "domain": "marieclaire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "35 of the Best Fall Movies to Cozy Up To\nFrom Nora Ephron classics to spooky season favorites.\nSelect the newsletters you’d like to receive. Then, add your email to sign up.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nDelivered daily\nMarie Claire Daily\nGet exclusive access to fashion and beauty trends, hot-off-the-press celebrity news, and more.\nSent weekly on Saturday\nMarie Claire Self Checkout\nExclusive access to expert shopping and styling advice from Nikki Ogunnaike, Marie Claire's editor-in-chief.\nOnce a week\nMaire Claire Face Forward\nInsider tips and recommendations for skin, hair, makeup, nails and more from Hannah Baxter, Marie Claire's beauty director.\nOnce a week\nLivingetc\nYour shortcut to the now and the next in contemporary home decoration, from designing a fashion-forward kitchen to decoding color schemes, and the latest interiors trends.\nDelivered Daily\nHomes & Gardens\nThe ultimate interior design resource from the world's leading experts - discover inspiring decorating ideas, color scheming know-how, garden inspiration and shopping expertise.\nAh, fall—that time of year when the air is so crisp, you wish you could bottle it, dropping just low enough for sweaters, pumpkin spice lattes, and the possibility of not sweating when taking out the trash. First up on our greet-the-new-season agenda? Curling up with one of the best fall movies.\nFall movies can range in genre, from classic horror to spooky films even scaredy cats can watch to rom-coms; they're more about the feeling. We’ve taken the liberty of rounding up all the films that remind us of our favorite season for their fall-themed holidays, breathtaking autumnal scenery, and collegiate vibes that will take you right back to your first September day on campus. So whether you’re a Halloween fan with a penchant for all things spooky or you wait all year long for the changing of the leaves, there’s a movie on this list you’re sure to love. Below, find the best fall films of all time—to be enjoyed under a duvet or before gallivanting in some foliage, of course.\nThe Best Fall Comedies\n'Big Daddy' (1999)\nOn the surface, Big Daddy is a lighthearted comedy starring Adam Sandler as an ill-equipped caretaker for his roommate’s son, Julian (Dylan and Cole Sprouse), who shows up unexpectedly while his roommate is overseas. At its heart, however, it’s a story about love, as Sonny (Sandler) develops an unbreakable bond with Julian. In short? It’s the perfect Thanksgiving flick since it reminds you of what’s important. The fact that it also showcases Central Park in its prime fall form only adds to its charms. Besides, who can resist the adorableness that is Dylan and Cole Sprouse as a 5-year-old Julian Frankenstein?\n'Death Becomes Her' (1992)\nMeryl Streep and Goldie Hawn duke it out for the most beautiful undead creature as Madeline Ashton (Streep), an aging Broadway actress, and author Helen Sharp (Hawn). Their vicious rivalry over their philandering lover, Ernest (an unrecognizable Bruce Willis), gets them more than they bargained for when they're coaxed into drinking a mysterious potion that not only restores their youth but makes it impossible for them to die, leading to some hilariously creepy results.\n'The Outside Story' (2020)\nFor an introvert, there’s nothing worse than being forced out into the real world against your will, which is exactly what happens when Charles (Brian Tyree Henry) locks himself out of his house. The upside? It’s autumn in New York, a.k.a. the pinnacle of beauty, and the streets are strewn with fallen leaves aplenty.\nGet exclusive access to fashion and beauty trends, hot-off-the-press celebrity news, and more.\n'Son in Law' (1993)\nThanksgiving is typically a time to acknowledge the blessings in your life, but the Warners’s holiday isn’t exactly going as planned. Rebecca (Carla Gugino), who has just returned home from college in L.A. for the first time since she left her small hometown in South Dakota, has fooled her family into believing she has a new fiancé, Crawl (Pauly Shore), and he’s not exactly farm material. On top of that, the turkey that’s meant to be dinner is flying around the kitchen, Rebecca’s weaseling ex-boyfriend is suddenly everywhere she turns, and her high school frenemy Tracy (Tiffani Thiessen) seems to have designs on her would-be new man. By the end of this family’s turkey dinner, you’ll crave a sit-down with your fam—and some serious \"grindage.\" (That’s Crawl speak for food, if you're not yet fluent.)\nThe Best Fall Dramas\n'Autumn in New York' (2000)\nWith a name like Autumn in New York, this 2000s romance lets you know you’re bound to see a little leaf action before it even begins, and it certainly doesn’t disappoint. Will (Richard Gere) and Charlotte (Winona Ryder) fall in love amongst the trees even though their relationship has no future; He’s a serial cheater and she’s terminally ill. Still, they manage to forge something special in their too-short time together, leaving behind some sweet autumn memories.\n'The Blind Side' (2009)\nIf your idea of fall involves sweats, a cold one, and your favorite football team on the tube, The Blind Side is for you. As the biographical tale of NFL Superbowl champ Michael Oher (played in the movie by Quinton Aaron), who overcame his impoverished upbringing with the help of a local family to go on to play for several league teams, it’s got plenty of satisfying plays. There’s also a particularly heartwarming Thanksgiving dinner scene in which Oher brings the Tuohy family together at the dinner table, plus a knockout performance by Sandy Bullock, who won an Oscar for her role as Leigh Anne Tuohy.\n'Dead Poets Society' (1989)\nTaylor Swift referenced this movie in one of her music videos, so it's bound to be good. At its heart, this 1989 classic is a coming-of-age flick about change in the most pivotal moments of one’s life and the transition into adulthood—two themes fall is known to represent. Taking place at the start of a new school year, its storyline is also quite literally set in the throes of fall as John Keating (Robin Williams) inspires his students to embrace their lives through poetry.\n'Far From Heaven' (2002)\nIf we’re talking autumnal scenery, Far From Heaven might be the only one on this list equipped to give When Harry Met Sally a true run for its seasonal money. And considering that it’s set in 1950s Hartford, Connecticut, where the turning of the leaves is practically a sporting event, it’s not hard to figure out why. It’s an idyllic backdrop for heroine Cathy Whitaker's (Julianne Moore) less-than-idyllic world, which involves a failing marriage, racism, and town gossip.\n'Good Will Hunting' (1998)\nBoston, in all its autumnal grandeur, is an unspoken character in Good Will Hunting. Starring Matt Damon as a mathematical genius with untapped potential and Robin Williams as the professor who wants to help him realize it, the film predictably includes plenty of gratuitous campus shots. The setting also expands into the city, with the Boston Public Garden presenting particularly lovely this time of year.\n'Legends of the Fall' (1994)\nTechnically, this period western traverses many years and seasons—it is 2 hours and 13 minutes long. But autumn is its clear star (besides Brad Pitt, Anthony Hopkins, and Julia Ormond). Filmed in parts of Montana, California, and Canada, its scenery takes our breath away almost as much as the romantic square that forms between Susannah (Ormond) and the three Ludlow brothers (Pitt, Henry Thomas, and Aidan Quinn) who love her.\n'Mermaids' (1990)\nThis 1990 classic starring the cinematic trifecta of Cher, Winona Ryder, and Christina Ricci gifts us with plenty of fall shots as Charlotte (Ryder) and Kate (Ricci) explore their surroundings in the New England town their mother (Cher) has recently relocated them to. It also features one hell of a Halloween costume courtesy of Mrs. Flax. We’ll give you one guess as to what it is based on the film’s title…\n'Mona Lisa Smile' (2003)\nMona Lisa Smile sees a liberal teacher named Katherine Watson (Julia Roberts) bringing a free-spirited way of thinking to a group of conservative students played by Kirsten Dunst, Maggie Gyllenhaal, and Julia Stiles (to name a few). Filmed across several iconic college campuses, including Wellesley College in Massachusetts, the outdoor shots are stunning. The gals also bring their fall fashion A-game. (Those plaids, though!)\n'St. Elmo's Fire' (1985)\nIt doesn’t get more fall than a college campus with leaves strewn across the ground—a familiar scene from the University of Maryland, where St. Elmo’s Fire was filmed in part. Starring the Brat Pack (Demi Moore, Rob Lowe, Emilio Estevez, Andrew McCarthy, Ally Sheedy, and Judd Nelson, for the uninitiated), the movie follows a group of recent Georgetown grads navigating life and love on shaky ground as they begin their trepid journey into adulthood.\nThe Best Fall Family Movies\n'The Addams Family' (1991)\nJust one look at the gothic architecture of the Addams Family mansion is enough to put us in a fall mood, but the family lurking inside—and their eccentric habits—truly cement it. Between the séances, the grave-digging, the swordplay, and the less-than-cheery ensembles, there’s plenty of Halloween fodder, which is perfect, considering the film’s finale takes place on the spooky holiday.\n'Casper' (1995)\nWhat do you get when you pair a sinister old mansion with a friendly ghost resident and a 13-year-old Christina Ricci? Fall movie magic. Not only are Kat (Ricci) and her father, Dr. James Harvey (Bill Pullman), surrounded by ghosts—Kat has made fast friends with their house ghost Casper and James attempts to make paranormal contact with Kat’s late mother Amelia—there’s a swinging Halloween party in store that has the power to make or break Kat’s social standing at school. (And maybe also nab her first kiss.)\n'Coco' (2017)\nHalloween and Thanksgiving aren’t the only holidays that fall has to offer. As depicted in 2017’s Coco, there’s also Día de los Muertos, celebrated in Mexico and parts of Latin America every Nov. 1 and 2, honoring the lives of the loved ones who have passed before us. It's a time to respect your roots, just like Coco’s central character Miguel, who sets out on a mission to find the grandfather who inspired his love of music. (A word to the wise? This one is a tearjerker, so have your tissues ready.)\n'Coraline' (2009)\nThis animated flick/grass-is-greener tale sees 11-year-old Coraline Jones (voiced by Dakota Fanning) transported to another world with a seemingly perfect family. In truth, they're far more sinister and unforgiving than the loving mother and father she already had at home. This film also features secret doors leading to a magically evil world, rats that dance, and a talking black cat that makes it decidedly spooky.\n'Corpse Bride' (2005)\nIf scary movies aren’t your thing, but you still want to get in on the Halloween vibes, Corpse Bride is a sure bet. This Tim Burton classic is a love story wrapped up in a macabre bow: Even being dragged to the land of the dead by a scorned ghostly bride can’t keep Victor (Johnny Depp) apart from his beloved Victoria (Emily Watson)!\n'Harry Potter and the Sorcerer’s Stone' (2001)\nSet at the start of a new school year at the Hogwarts School of Witchcraft & Wizardry, Harry Potter and the Sorcerer’s Stone recalls all the splendors of discovering a brand new campus and attending your first fall classes. Granted, 11-year-old Harry is a bit younger than we were when we first went to college, but the themes of meeting new friends, discovering new activities (Quidditch, anyone?), and learning still feel like magic—quite literally, in Potter’s case.\n'Hocus Pocus' (1993)\nPicture this: There’s a chill in the air. The leaves are gently falling outside. You’re wearing your favorite sweater and drinking a cup of warm cider. Quick: What movie are you watching? (Hint: If your answer isn’t Hocus Pocus, you’ve got time to change it.) This cult classic centered on a coven of Salem witches known as the Sanderson Sisters who desire to steal the souls of the town’s children more or less epitomizes fall with its Halloween lore. (It’s also one of Sara Jessica Parker’s most iconic pre Carrie Bradshaw roles.)\n'It's The Great Pumpkin, Charlie Brown' (1980)\nYou’re never too old for cartoons, especially when the cartoon is It’s the Great Pumpkin, Charlie Brown. The unofficial kickoff film for fall, Linus and the gang will put you in the Halloween spirit in a hurry as they partake in all the seasons’ greatest activities, from trick-or-treating (never mind that Charlie Brown gets nothing but rocks) to checking out a pumpkin patch—er, falling asleep in one while waiting for the mythical “Great Pumpkin” to show. (Think: the Santa Claus of October.) They even spend some time playing ball, if you can call it that—it ends with Charlie Brown on his back after Lucy steals his kick out from under him.\n'Teen Witch' (1989)\nLong before Blake Lively was weaving her onscreen magic as Serena van der Woodsen, her big sis Robyn Lively navigated a little paranormal power of her own in Teen Witch. This supernatural flick sees the then-teen grappling with a magical amulet that allows her to turn her brother into a dog, become the most popular girl in school, and make her crush fall in love with her, only to discover that what she wants the most is just to be herself.\n'The Witches' (2020)\nIn 2020, Anne Hathaway took on Anjelica Huston’s iconic 1990 role as the Grand High Witch in an updated film adaptation of The Witches. As big as the shoes were to fill, Hathaway managed to ace her turn as the supreme leader of all the world’s sorceresses with an evil plan to turn children everywhere into mice with a powerful potion. She delivers a delightfully creepy performance just right for getting into the spooky spirit.\nBest Fall Horror Movies\n'The Craft' (1996)\nIs that a chill in the air we detect or just a shiver of fear thanks to the ultra-creepy performance of Fairuza Balk as outcast teen-turned-vengeful witch Nancy Downs in The Craft? It starts innocently enough, with the new girl in town, Sarah (Robin Tunney), befriending a group of girls (Balk, Neve Campbell, and Rachel True) experimenting with witchcraft to right the wrongs in their lives. Before they know it, however, they’re in over their heads, getting back whatever they send out in spell form times three.\n'Dark Shadows' (2012)\nFall is practically synonymous with Tim Burton: His films are spooky but not too spooky, making them the perfect soft launch before watching full-blown Halloween scares. This one is led by Johnny Depp, Helena Bonham Carter, Eva Green, Michelle Pfeiffer, and Chloë Grace Moretz, and features curses, vampires, witches, and ghosts galore. There’s also a sweet love story at its center as 18th-century vampire Barnabas (Depp) tries to fit into a 1970s world, McDonald’s and all, and meets a newfound living love, Victoria (Bella Heathcote).\n‘Donnie Darko’ (2001)\nLong before Jake Gyllenhaal was providing the inspo for Taylor Swift’s 10-minute long “All Too Well” video, he was giving us all the spooky vibes in the 2001 autumn film Donnie Darko. A psychological thriller about a teenager (Gyllenhaal) who begins getting visits from a humanoid rabbit with a questionable agenda, it’s weird, it’s creepy, and it’s just the type of flick we’re looking to get into ahead of All Hallows’s Eve—which, incidentally, is when the film’s big ending takes place.\n'Practical Magic' (1998)\nWe’d watch Practical Magic at any time of the year for the wild aunts’s midnight margaritas alone, but it’s particularly satisfying in autumn when you can practically feel the cool Massachusetts air of the Owens estate through the screen. It also enhances the slow creep of dread that builds when sisters Sally (Sandra Bullock) and Gillian (Nicole Kidman) use a forbidden spell to bring a dangerous man Sally has accidentally killed back to life, only to realize that it may have done more harm than good.\n'Sleepy Hollow' (1999)\nSleepy Hollow may be set in 1799, but autumn is unmistakable in any era: the fallen leaves, the gray skies, the...headless horseman riding through the fog? Tim Burton’s take on Washington Irving’s spooky short story doesn’t quite classify as a horror film in our books, but it’s definitely a gothic moment that will have you ready for the season of ghouls and goblins. It also doesn’t hurt that one of our definitive Queens of Halloween, a.k.a. Christina Ricci, plays the female lead.\n'The Witches of Eastwick' (1987)\nCher, Susan Sarandon, and Michelle Pfeiffer together as three badass babes who take their revenge on the warlock (Jack Nicholson) who’s been doing them wrong? Sign us up! While we should warn you, you may never want to eat cherries again after watching this film, it’s worth it to see these three reclaim their womanly powers.\nThe Best Fall Rom-Coms\n'Runaway Bride' (1999)\nThe only thing more peak fall than a beautiful backdrop of colorful leaves? Julia Roberts and Richard Gere exchanging wedding vows amid a backdrop of colorful leaves before riding off into the sunset on horseback. Roberts plays formerly skittish bride Maggie Carpenter to Gere's hard-nosed reporter Ike Graham. Sure, it takes them a while to get to the altar (it wouldn’t be called The Runaway Bride if she said, “I do,” right away), but trust us—the payoff is worth it.\n'Dan in Real Life' (2007)\nFall is such a central character in Dan in Real Life, writer and director Peter Hedges changed the script to accommodate its splendor. \"In the original script, the gathering occurs between Christmas and New Year's, but I wanted to shoot in the fall; I wanted to be outdoors,” he told Playbill. We’ve gotta hand it to him: The golden yellows and browns of Rhode Island in peak autumn are the perfect backdrop for newspaper columnist Dan (Steve Carell) to fall head over heels for his brother's (Dane Cook) new GF (Juliette Binoche)—awkward!\n'Stuck In Love' (2012)\nBefore becoming Emily in Paris, Lily Collins played Sam Borgens: a woman Stuck in Love with Lou (Logan Lerman), the boy who helps her mend her fractured relationship with her mother (Jennifer Connelly) from one fictional Thanksgiving to the next. With a heartwarming Turkey Day surprise at the end, this seasonal flick is a great reminder of holiday magic.\n'Sweet Home Alabama' (2002)\nEven if you’ve seen Sweet Home Alabama a time or two or 100, you’ve probably been too focused on the love story between Melanie Smooter (Reese Witherspoon) and her stubborn ex Jake Perry (Josh Lucas) to notice the scenery. (Or the fashion, and honestly, we get it—it’s fab.) But take it from us: For your next watch, zero in on the background as the pair bicker in front of Jake’s home and the townsfolk reenact a war. Between the fallen foliage, the golden yellow grass of the “battlefields,” and the (über-chic) transitional dressing, it’s basically a love letter to autumn.\n'When Harry Met Sally...' (1989)\nWhile some may argue that When Harry Met Sally is a winter film since its most pivotal love scenes occur on New Year’s Eve, we’re here to say it belongs to fall. And honestly? The vibrant colors seen in the leaves during Harry (Billy Crystal) and Sally's (Meg Ryan) epic Central Park walk to discuss their wildest dreams speak for themselves. We’re willing to bet writer Nora Ephron would agree with us: Autumn made the cover of the DVD over winter, okay?\n'You've Got Mail' (1998)\nNora Ephron doesn't just know good romantic comedies; she knows the magic of fall. This '90s favorite stars Tom Hanks and Meg Ryan as two bookworms with opposing viewpoints on capitalism who unwittingly enter an online relationship—and it could be an ad from the New York Tourism Board for autumn in the big city. It’s filmed in the two weeks between Manhattan’s hot garbage and gray slush seasons when the town is most gorgeous. As Joe Fox (Hanks) says, “Don’t you love New York in the fall?” We do, Joe. We really, really do.\nNicole Briese is a Florida-based editor, writer and content creator who has been writing about all things culture-related since the O.G. Gossip Girl was still on the air. (Read: A lifetime ago.) She is a regular contributor to Marie Claire, covering books, films, and TV shows. In her spare time, when she's not obsessing over her cat, she's devouring all things fashion, beauty, and shopping-related. Check out her blog at Nicolebjean.com.\n- Bianca RodriguezAudience Development Manager\n- Bridget Burns",
  "word_count": 3427,
  "scraped_at": "2026-02-14T12:33:12.861508"
}