{
  "article_id": "72b652aba3e8",
  "url": "https://news.yahoo.com/dfb-prepared-anything-search-womens-151202645.html",
  "title": "DFB  prepared for anything  in search for new women coach",
  "date": "20240221T154500Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "DFB 'prepared for anything' in search for new women's coach\nThe German Football Federation (DFB) is prapared for the scenario of having to appoint a women's national team coach on short notice to take over from caretaker Horst Hrubesch.\nGermany play France in the Nations League semi-finals on Friday and either the final or third place match next Wednesday.\nThey will qualify for the Paris Olympics if they reach the final or finish third. But they will miss the Games if they come fourth which could end Hrubesch's term.\n\"If the two games go differently, which I don't like to talk about two days before a very, very important game, then we will have done our job and be able to act,\" women's team sporting director Nia Künzer said on Wednesday.\n\"When the time comes we will comment on it. The scenarios are clear and we are prepared for anything.\"\nHrubesch has said he would coach the team until the Olympics if they qualify, but only be available for a transitional period at best if they miss the Games.\nThe next matches after the Nations League Finals are in April, the start of Euro 2025 qualifying.\nThe German women are without a head coach since the DFB parted ways with Martina Voss-Tecklenburg in November. Hrubesch started the caretaker job in October, when Voss-Tecklenburg was on sick leave, and led them to the Nations League Finals.\nThe list of potential candidates is small, especially from within women's football.\nI don't currently see a German-speaking woman in the coaching position who is so obvious that you can't get past her,\" former DFB national teams director Joti Chatzialexiou told news portal t-online.\nHe said that Chelsea coach Emma Hayes would have been a candidate but she will now take over the US women's team. Swede Pia Sundhage is now in Switzerland.\nThe Frankfurter Rundschau daily said that the DFB has met with Jills Ellis who led the US to World Cup titles in 2015 and 2019.\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\nThe team has always had a German coach up to now, and mostly a woman.\nBut apart from Marie-Louise Eta, assistant at men's Bundesliga side Union Berlin, there no real candidates.\nChristian Wück has made a name for himself within the DFB but a transition from the men to the women is rare.\n\"Only competence counts. That's why I would still say: it doesn't really matter - but then my mind says: okay, we basically want to put women in positions and push them,\" former German international Kim Kulig told dpa. \"So it's always a dichotomy.\"",
  "word_count": 441,
  "scraped_at": "2026-02-14T12:57:18.400867"
}