{
  "article_id": "72c9855c09c3",
  "url": "https://www.christianpost.com/news/travis-kelce-defends-harrison-butker-i-cherish-him.html",
  "title": "Travis Kelce defends Harrison Butker :  I cherish him  ",
  "date": "20240524T191500Z",
  "domain": "christianpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Travis Kelce defends Harrison Butker amid backlash: 'I cherish him'\nKansas City Chiefs tight end Travis Kelce has offered his thoughts on teammate Harrison Butker's recent Catholic college commencement speech, which created a national media firestorm.\nKelce addressed Butker's remarks at Benedictine College two weeks ago in an episode of the \"New Heights with Jason and Travis Kelce\" podcast he hosted with his brother Friday.\n\"I cherish him as a teammate,\" Kelce, who has received his own international media attention in the last year for dating popstar Taylor Swift, said.\nReferring to comments made by their teammate Patrick Mahomes, Kelce said he has known Butker for seven or eight years and expressed agreement that Butker is \"every bit of a great person and a great teammate.\"\n\"He has treated friends and family that I've introduced to him with nothing but respect and kindness and that's how he treats everyone,\" Kelce, 34, said.\n\"When it comes down to his views and what he said at [Benedictine's] commencement speech … those are his,\" Kelce added. \"I can't say I agree with the majority of it or just about any of it outside of just him loving his family and his kids and I don't think that I should judge him by his views, especially his religious views, of how to go about life. That's just not who I am.\"\nAddressing graduates at the Catholic college in Kansas earlier this month, Butker condemned President Joe Biden for supporting abortion in spite of his status as a practicing Catholic and the Church's firm opposition to abortion. He warned that Biden \"has been so vocal in his support for the murder of innocent babies that I'm sure to many people, it appears that you can be both Catholic and pro-choice.\"\nButker also decried the societal embrace of in-vitro fertilization, surrogacy, and euthanasia, as well as what he referred to as \"degenerate cultural values\" and \"dangerous gender ideologies.\" His comments to women in the audience suggesting that \"the majority of you are most excited about your marriage and the children you will bring into this world\" instead of any career developments drew particular outrage.\nThe football player described how his wife gave up her career to become a stay-at-home mom and assured the graduates that she would respond \"heck no\" if anyone asked whether or not she regretted her decision.\nFollowing Butker's commencement address, a petition began circulating calling for his removal from the National Football League team over what it characterized as his \"sexist, homophobic, anti-trans, anti-abortion and racist\" views that \"reinforce harmful stereotypes that threaten social progress.\"\nAs of Friday, the petition garnered nearly 225,000 supporters. So far, several individuals affiliated with the Chiefs and the NFL, including head coach Andy Reid, Mahomes, and now Kelce, have indicated that they stand by Butker even if they do not agree with the substance of what he said.\nNFL Commissioner Roger Goodell weighed in on Butker's comments earlier this week.\n\"We have over 3,000 players. We have executives around the league. They have diversity of opinions and thoughts just like America does. That's something we treasure,\" he insisted.\nLast week, NFL Senior Vice President and Chief Diversity and Inclusion Officer Jonathan Beane released a statement attempting to assure critics that \"Butker gave a speech in his personal capacity\" and that \"his views are not those of the NFL as an organization.\" Beane insisted that \"the NFL is steadfast in its commitment to inclusion, which only makes our league stronger.\"\nTavia Hunt, the wife of Chiefs owner Clark Hunt, and their daughter, Gracie, have also shared their views on the matter.\nTavia Hunt maintained that \"[a]ffirming motherhood and praising your wife, as well as highlighting the sacrifice and dedication it takes to be a mother, is not bigoted.\"\n\"It is empowering to acknowledge that a woman's hard work in raising children is not in vain,\" she wrote in an Instagram post. \"Countless highly educated women devote their lives to nurturing and guiding their children.\"\nGracie Hunt offered a similar defense, praising Butker's \"Christian faith and what he's accomplished on and off the field.\" She pointed to her experience being raised by \"the most incredible mom who had the ability to stay home and be with us as kids growing up\" as \"really formative ... in shaping me and my siblings into who we are.\"\nWhile Butker's commencement address has generated backlash, he has also seen a wave of support from the American public.\nJersey sales for the Chiefs player have skyrocketed, surpassing those of his teammates Mahomes and Kelce.\nRyan Foley is a reporter for The Christian Post. He can be reached at: ryan.foley@christianpost.com",
  "word_count": 777,
  "scraped_at": "2026-02-14T12:41:44.202434"
}