{
  "article_id": "72e4ed760c68",
  "url": "https://www.90min.com/posts/complex-issue-surrounding-england-vs-scotland-womens-nations-league",
  "title": "The complex issue surrounding England vs Scotland in Women Nations League",
  "date": "20230918T161500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The complex issue surrounding England vs Scotland in Women's Nations League\n- Great Britain's Olympics qualification rests on England's shoulders\n- Lionesses face Scotland in the Nations League group stage\n- Strained history between the four FAs and playing in the Olympics\nBy Emily Keogh\nEngland are set to kick off their UEFA Women's Nations League campaign against Scotland on Friday. But with the tournament also serving as qualifying for the 2024 Olympics in Paris, there are complicated issues with two British nations being drawn into the same group.\nJust over a month after the 2023 World Cup final was played, the Lionesses return to international action to begin the inaugural Nations League.\nThe Nations League, is its own competition with a real trophy up for grabs at the four-team finals in February. To qualify for the next stage, England need to win their League A group ahead of Scotland, Netherlands and Belgium. Similarly, they will want to avoid finishing last because it means automatic relegation to League B, or third because that results in a relegation playoff.\nBut there is another incentive too. The two teams that reach the Nations League final will qualify for the Olympics next year - excluding France as they are already in as hosts.\nEngland don't directly compete at the Olympics, but the English FA has overseen the Great Britain setup - for whom England, Scotland, Wales and Northern Ireland players are eligible - since 2012 when the team first entered. Qualification therefore depends on what England do, but the fact that they are now to face Scotland in the qualifying tournament presents some uncomfortable issues.\nThe history of Great Britain in the Olympics\nThere has been a troubled history of Great Britain at the Olympics, not just in women's football, with the four football associations from each member nation (England, Scotland, Wales and Northern Ireland) struggling to see eye to eye on how to operate as one team for quadrennial tournament.\nThe national football associations for each were formed separately, without a collective FA for the United Kingdom as a whole, meaning that all four together is always going to cause problems.\nEngland reached the quarter-finals of the 2007 World Cup, which equated to qualification for the 2008 Olympics. But 'England' isn't an Olympic nation.\nWith London awarded the 2012 Olympics in 2005, Britian had the right to enter a football team as host nation. The British Olympic Association (BOA) stated it would. However, the Scottish FA refused to attend meetings, and the Welsh FA withdrew from negotiations. The FA in Northern Ireland also determined they would not take part in a unified team, leaving only England's FA willing.\nThese negotiations predated the 2008 Olympics and Great Britain, having earned a place in China through England's World Cup performance, were eventually replaced by Sweden for the summer tournament due to the four national associations failing to reach an agreement.\nIn 2009, a compromise was reached in which the FA in England would select a team of only English players for 2012. That later morphed in 2011 into the option to select players from across the British nations, although it divided the players.\nDespite putting together a team in 2012, Great Britain once again defaulted in participating in the 2016 Olympics after the four home nations once again failed to agree on the terms of a collective team - England's top three finish in the 2015 World Cup would have given them a place.\nTo try and straighten things out ahead of the 2020 Olympics, the decision was made that the highest-ranked team of the four would be elected to compete for Olympic qualification. That fell on England and Great Britain reached the quarter-finals at the tournament eventually played in 2021.\nThis agreement is still in place now, but it causes issues with England's qualification process.\nThe problem with the new format\nThe ruling ahead of the 2020 Olympics, that the highest ranked team would compete for qualification, has remained in place for the 2024 Games, meaning England, and only England could seek a place on behalf of Great Britain as a whole.\nHowever, with UEFA changing the qualifying format, introducing the Nations League, new issues sprung up regarding potential conflict.\nEngland, Scotland, and Wales are all members of League A, the top 16 teams in Europe. Using the pot system that UEFA adopted to draw their groups, there was no possible way for the three GB nations not to draw one another. This is also being emphasised by the top four teams, which included England being seeded and, therefore guaranteed to face those who weren't.\nBecause of this, England went into the same group as Scotland and the pair will play each other in the group opener. This creates a lot of conflict as no matter how well Scotland do in the Nations League, only England can qualify for the Olympics on behalf of Great Britain.\nResults in the Nations League also have a knock-on effect for Euro 2025 qualifying, which means there is plenty at stake for Scotland beyond just the Nations League and the Olympics. But doing well against England could directly hurt the chance of Scottish players going to the Olympics.\nFor the likes of Caroline Weir, Erin Cuthbert and other Scottish players, they will hope England reach the Olympics so they are in with a chance of representing Great Britain however, the conflict of interest this poses is one that will have to likely be reconsidered ahead of the 2028 Olymics in LA.",
  "word_count": 924,
  "scraped_at": "2026-02-14T13:03:52.878534"
}