{
  "article_id": "72f69b07bd49",
  "url": "https://www.arsenal.com/news/our-lionesses-womens-world-cup-final-preview-russo-wubben-moy",
  "title": "Our Lionesse journey to the World Cup Final",
  "date": "20230819T161500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This Sunday, Alessia Russo and Lotte Wubben-Moy will be seeking World Cup glory just 13 months after the Lionesses captured the hearts of a nation with a European Championship win.\nAfter a record-breaking tournament in Australia and New Zealand, a brand new World Cup winner is assured as England and Spain clash for the chance to bring the trophy back home for the first time.\nPath to Sydney\nEngland have faced a myriad of tests in their journey to the World Cup final. Qualifying as Group D leaders with the maximum 9 points, the Lionesses hit a stumbling block against Nigeria in the round of 16, requiring penalty shootout heroics to see them through to the quarter-finals.\nDespite briefly falling behind to Colombia, they managed to overcome the tournament's dark horse and went on to their most comfortable knockout stage win against co-hosts Australia in the semi-final.\nAfter a breakout tournament at last summer's Euros, Alessia Russo has shown zero signs of stopping as leads the Lionesses' line.\nWith three World Cup goals to her name so far, our new signing has started every game, comfortably stepping into the shoes of England’s legendary striker, Ellen White, who retired last year. Russo is also the tournament leader in terms of shots on target with 12.\n“This is the biggest game - the one you dream about, the one that means the most,” she said, in England's pre-match press conference. “I feel like it’ll hit when we’re in the tunnel and we’re ready to walk out.”\n“It's an incredible occasion, it's been an unbelievable tournament and this is it - this is exactly where we want to be. We can't wait.\"\nFellow Lionesses Beth Mead and Leah Williamson were devastatingly ruled out of the tournament due to respective knee injuries, but captain Williamson has flown over to Sydney to support from the sidelines.\nA first-ever final\nSunday marks the first time the Lionesses have reached the World Cup Final and it's only the second-ever final for a senior England team - men's or women's.\nRegardless of the result, this will also be the best-ever World Cup finish for Spain, who qualified for the tournament for the very first time in 2015.\nWe don't have to look far to find the last meeting between these two teams. England dismissed Spain 2-1 on their way to the Euros 2022 trophy lift, but the quarter-final wasn't without drama.\nThe Spaniards led in the second half through Esther Gonzalez but an 84th minute equaliser from Ella Toone sent the game to extra-time. It was then time for Georgia Stanway to provide a dash of magic to win the game for the Lionesses with a beautiful strike from outside the area.\nWhen it comes to recent head-to-heads, England have the edge with four wins out of seven meetings. Spain have beaten England just twice in the past ten years - once in a 2020 friendly and once in Euro 2013.\nThis is England manager Sarina Wiegman's second-successive World Cup Final, having led her native Netherlands there in 2019 only to fall to the United States.\nLong-lasting bonds\nAlessia Russo may have just joined the Arsenal ranks a month ago, but she's known international teammate Lotte for over a decade.\n\"We went to uni together, so we've got a really good relationship,\" said Alessia in her first club interview.\n\"I always say that Lotte's my big sister. She's got a very wise head on her shoulders and someone that I probably wouldn't have gotten through college without.\n\"Lotte's amazing. A leader on and off the pitch and someone that I can't wait to be with every day and create more memories with.\"\nLotte's World Cup doodle diary\nSpecial memories captured 😍\n— Lionesses (@Lionesses) August 18, 2023\nA check-in with @lottewubbenmoy's World Cup doodle diary ahead of the final 🖌🎨 pic.twitter.com/7GOc3pOjjI\nOur centre-back has also been showing her creativity off the pitch with a World Cup doodle diary.\nA project first started during England’s victorious European Championships run, Lotte has continued bringing her team's tournament progress to life on the page.\nSpeaking on an episode of Lionesses: Down Under, Lotte explained why this creative outlet means so much to her: “My approach to art and doodling is that anyone can do it. You can probably just doodle on a napkin and it would be something exciting, something cool.\n“I would like to remove barriers to art and creativity as much as possible. It’s the same with football, take all the red tape away and enjoy the games.\n\"As much as we can remove barriers to entry, particularly in football, is a good thing. The games are free to watch in England, people can wake up early and catch a cracking game of football.\nhere we go again.. 2023 World Cup Doodle Diary 💙🧡❤️💛🖤💚 pic.twitter.com/DLoKYuZW8v\n— Lotte (@lottewubbenmoy) July 21, 2023\n“Some people learn visually and some learn through reading books. When you look at following a football game, kids might not sit down for 90 minutes but they might interact with a picture of someone scoring a goal, or a picture of a captain's armband.\n“That’s my take on getting kids involved and making it easy for them to engage with football in any way possible.”\nPunditry from the boss\nBoss Jonas Eidevall will once again be on pundit duty for Sunday’s final, joining former Gunners Alex Scott, Ellen White and Fara Williams in Australia.\nAhead of the tournament, Eidevall managed to predict both World Cup finalists and he's backing the Lionesses to ultimately lift the trophy on Sunday - although he expects a game of very fine margins.\nSpeaking on the BBC, our manager was also full of praise for England's opponents: \"We have a nation here in Spain that in the last decade have produced U19 Euros winners, U20 World Cup winners over and over again. It is incredible really when you see the talent factory that Spanish football is.\"\nHow to watch\nA sell-out crowd of over 80,000 people awaits both sides on Sunday at Stadium Australia. Kick-off is at 11am GMT (8pm local).\nIn the UK, the match will be broadcast on both BBC 1 and ITV 1, with the BBC's coverage beginning at 9.45am (UK). ITV's World Cup Final programme starts at 9.25am - 90 minutes before kick-off.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1082,
  "scraped_at": "2026-02-14T13:00:25.061336"
}