{
  "article_id": "7304f4bf444b",
  "url": "https://www.manchestereveningnews.co.uk/news/showbiz-news/celebrity-kings-birthday-honours-2025-31855296",
  "title": "Celebrities in King Birthday Honours list 2025 with David Beckham , Strictly Come Dancing stars and sporting heroes",
  "date": "20250613T230000Z",
  "domain": "manchestereveningnews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Celebrities in King's Birthday Honours list 2025 with David Beckham, Strictly Come Dancing stars and sporting heroes\nKing Charles III is again honouring a number of famous faces in the King's Birthday Honours list for 2025\nDavid Beckham leads the celebrities who have been recognised by King Charles III in his latest Birthday Honours.\nThe Monarch is again honouring those who have made a difference in many different areas of the country, with those getting the nods being revealed on Friday night (June 13).\nHonours including MBEs, OBEs, and CBEs will be handed out to everyone from local community heroes and fundraising champions to stars of the stage, screen, and sporting field.\nAmong the famous faces on the King's Birthday Honours list for 2025 is, as already mentioned, David Beckham, who has been awarded a knighthood for services to sport and to charity.\nThe former England football is a winner of league titles in four countries and of 115 national team caps. He also won the Champions League as part of Manchester United’s treble-winning team in 1999, and since retiring as a player has become a founder and co-owner of American team Inter Miami.\nHe has worked as an ambassador for the worldwide charity UNICEF since 2005 and since last year has been an ambassador for the King’s Foundation.\nSticking in the sporting arena and Luke Littler, who earlier this year became the youngest ever world darts champion at the age of 17 years and 347 days, has been made an MBE.\nLuke Humphries, who beat Littler in the 2024 PDC World Championship final, has also been made an MBE while Deta Hedman, who has won world-ranked darts titles in each of the last five decades and became the first black woman to play at the PDC World Championship in 2020, has become an OBE.\nMeanwhile, reality TV star Georgia Harrison has said she is “completely blown away” at being made a Member of the Order of the British Empire (MBE) for services to tackling online privacy and cybercrime awareness.\nOver the past couple of years the 30-year-old, who has starred in reality TV shows including The Only Way Is Essex and Love Island, has turned her hand to campaigning on violence against women and girls after becoming a victim of revenge porn.\nAlso in the showbiz realm, Tess Daly and Claudia Winkleman have been recognised for services to Broadcasting. The pair are best known for presenting Strictly Come Dancing together.\nTess said she shed tears when she opened the letter telling her she was to be made an MBE, describing it coming as the \"greatest surprise of my life\". Claudia also said she was \"incredibly grateful\".\nBafta-winning actress Samantha Morton has been made an OBE in the King’s Birthday Honours.\nThe 48-year old English star, known for her roles in Longford and The Serpent Queen, is being honoured for her services to drama and charity.\nWest End performer Elaine Paige said she is still in “complete disbelief” that she has been given a Damehood in the King’s Birthday Honours for services to music and to charity.\nThe music star was born Elaine Bickerstaff in north London 1948 and became an overnight star with her portrayal of Eva Peron in Lord Andrew Lloyd Webber’s hit musical Evita.\nAfter the show debuted in 1978, Dame Elaine, who had been nominated alongside her co-star David Essex, won the Olivier Award for performance of the year in a musical.\nIn muisc, The Who frontman Sir Roger Daltrey has said he is “very humbled” to be made a knight bachelor in the King’s Birthday Honours for services to charity and music.\nSir Roger, 81, who launched and curated the Teenage Cancer Trust’s Royal Albert Hall concerts from 2000 to 2025, told the PA news agency he would be celebrating with “a bottle of plonk”.\nGary Oldman has also been knighted For services to Drama. The English actor and filmmaker has received various accolades, including an Academy Award, a Golden Globe Award, three British Academy Film Awards and nominations for two Primetime Emmy Awards.\nOther sports stars to be recognised include 1977 Wimbledon champion Virginia Wade, who has been made a CBE, while two-time Olympic triathlon champion Alistair Brownlee has become an OBE.\nRachel Daly, one of the stars of the England women’s football team which won the European Championship on home soil in 2022, has been made an MBE.\nThe Harrogate-born star, 33, plays for Aston Villa in the Women’s Super League but retired from international football last year.\nIn cricket, former England pace bowler Devon Malcolm has been made an OBE while Steven Davies, who in 2011 became the first international cricketer to come out as gay, has been made an MBE.\nFormer Gloucestershire bowler David Lawrence, who took 625 wickets for the county, has also been made an MBE.",
  "word_count": 807,
  "scraped_at": "2026-02-14T12:49:52.635312"
}