{
  "article_id": "731c86f7903f",
  "url": "https://theathletic.com/4697531/2023/07/18/wsl-fixtures-2023-24-schedule/",
  "title": "Women Super League fixtures 2023 - 24 : Full schedule released",
  "date": "20230718T101500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Women’s Super League fixtures for the 2023-24 season have been released, with champions Chelsea hosting London rivals Tottenham Hotspur at Stamford Bridge on the opening weekend.\nThe last day of the campaign will see a repeat of the 2021-22 final day, with Manchester United facing Chelsea.\nWhile the Women’s World Cup in Australia and New Zealand, which begins on Thursday, takes centre stage for the next month, the return of domestic football in England comes on October 1.\nAdvertisement\nFour of the weekend’s opening six matches will be played at main stadia. As well as Chelsea’s match against Spurs, Aston Villa will host Manchester United at Villa Park in the first game of the season in the early kick-off, Arsenal will welcome Liverpool to the Emirates Stadium and newly-promoted Bristol City will host Leicester City at Ashton Gate — the club’s new permanent home for next season.\nChelsea will play four WSL games and all their Champions League home games at Stamford Bridge next season, while Arsenal will play five WSL games at the Emirates during the 2023-24 campaign, having set a new league attendance record against Tottenham last term.\nThe WSL and Women’s Championship are set to be the most represented leagues at this summer’s World Cup, with nearly 100 players from England’s top two divisions poised to be in action in Australia and New Zealand.\n- Women’s World Cup 2023: Group guides\n- Women’s World Cup fixtures, results, tables\n- Women’s World Cup 2023: Everything you need to know\nWSL opening weekend fixtures\nSunday, October 1 (all times BST)\n- Aston Villa vs Manchester United — 12.30pm\n- Everton vs Brighton — 1.30pm\n- Arsenal vs Liverpool — 2pm\n- Bristol City vs Leicester City — 2pm\n- West Ham United vs Manchester City — 3pm\n- Chelsea vs Tottenham Hotspur — 5.30pm\nWhich matches are on TV?\nAston Villa will host Manchester United at Villa Park in the early kick-off on the opening day, with the match broadcast in the UK live on BBC Two.\nThen later that day, Stamford Bridge will host champions Chelsea against Tottenham. The game, which kicks off at 5.30pm BST will be shown live on Sky Sports.\nIn the UK, fans will be able to watch WSL matches through Sky Sports and the BBC with matches not selected for live broadcast being streamed on The FA Player.\nGO DEEPER\nChelsea Women supporters' groups raise concerns over season ticket prices\nKey derby dates\n- Liverpool vs Everton — October 15\n- Manchester United vs Manchester City — November 19\n- Tottenham Hotspur vs Arsenal — December 17\n- Arsenal vs Tottenham Hotspur — March 3\n- Everton vs Liverpool — March 24\n- Manchester City vs Manchester United — March 24\nWSL final day fixtures\nSaturday, May 18, 2pm (BST)\n- Arsenal vs Brighton\n- Aston Villa vs Manchester City\n- Bristol City vs Everton\n- Leicester City vs Liverpool\n- Manchester United vs Chelsea\n- Tottenham Hotspur vs West Ham\nGO DEEPER\nThe Radar - The Athletic’s 2023 Women's World Cup scouting guide\n(Photo: Nigel French/PA Images via Getty Images)",
  "word_count": 519,
  "scraped_at": "2026-02-14T12:22:08.577678"
}