{
  "article_id": "73302f53b409",
  "url": "https://theathletic.com/4839183/2023/09/07/antony-attack-allegations-manchester-united/",
  "title": "Antony allegations : What happened and what now for Manchester United forward ? ",
  "date": "20230907T043000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Editor’s note: This article has been updated to reflect Antony’s return to training and his public response to allegations made by three women.\nManchester United forward Antony is returning to training with the club after a leave of absence following accusations he attacked his former partner Gabriela Cavallin, as well as two other women.\nAdvertisement\nThe 23-year-old — who strongly denies the allegations — returned to the UK this week after being allowed to leave Brazil, having been under investigation by Brazilian authorities. Since returning to the UK, he has met with Greater Manchester Police after Cavallin alleged Antony assaulted her on separate occasions between June 2022 and May this year. Two more women came forward in the Brazilian media with accusations against the winger.\nAntony, who was removed from the Brazil squad, gave a television interview on September 8 in his homeland in which he vowed to clear his name.\nUnited say they will keep an eye on the situation. They had previously faced calls to suspend Antony, just weeks after the Old Trafford club’s internal investigation into Mason Greenwood concluded.\nThe decision over Antony’s leave of absence was described as a “mutual” one with the player, who said he would “fully cooperate with the police to help them reach the truth”.\nAntony received full pay during his period of absence and at no point was he suspended. In theory, he is now available for selection again.\nWho is Antony?\nThe player joined United in a €100million (£85.9m; $107.1m) deal from Ajax in August 2022 as one of Erik ten Hag’s first signings following his appointment as manager.\nAntony, who had previously played under Ten Hag at Ajax, made 44 appearances during his first season at Old Trafford, scoring eight goals.\nBorn in Sao Paolo, he has played 16 times for Brazil, scoring twice, and was selected as part of their squad for the 2022 World Cup in Qatar.\nHe started the four opening games of the new Premier League season for United.\nWhat’s the background?\nIn early June, it was reported by Ge and TV Globo in Brazil that Antony’s ex-girlfriend, the DJ and influencer Gabriela Cavallin, had filed a police report alleging the United player had attacked her four times.\nAdvertisement\nCavallin claimed that, in June 2022, she had ended their relationship and he forced her out of a nightclub in Brazil, helped by security guards, and pushed her into a car. She was pregnant and later suffered a miscarriage.\nShe said the couple got back together and she moved to Amsterdam, where he was playing for Ajax, and then to Manchester after he joined United a year ago.\nCavallin said that, in January 2023, Antony attacked her in a Manchester hotel room, cited two more alleged physical attacks in England and claimed the player had called her after she had returned to Brazil in May and threatened to kill her if he saw her with someone else.\nOn June 19, in an interview with Record TV, Cavallin said she planned to report Antony to police in England for “aggression, failure to provide assistance, false imprisonment, psychological abuse. Everything that he did to me… I will report him formally.”\nShe also said that a United employee called “Daniele” was “responsible for sending the two doctors to treat me” after the alleged incident at the Manchester hotel.\nUnited confirmed this relates to Daniele Bertoli, the first-team player care officer, and that arranging a doctor for partners and family members of players is a common and standard task performed by the club’s player welfare team.\n“Any suggestion that the club covered up these allegations is categorically false,” the club said.\nAntony responded to Cavallin’s claims on June 28, calling them “a false accusation of aggression”. United did not issue a statement at that time before the forward travelled to the U.S. for the club’s pre-season tour in late July.\nOn Monday, September 4, the Brazilian website UOL reported further details of the alleged attacks on Cavallin, supported by WhatsApp messages, images and testimony supplied by Antony’s former girlfriend.\nAdvertisement\nShe said of the alleged Brazilian nightclub attack that he “put her in the car, repeatedly assaulted her and threatened to throw her out of the car at high speed”. She claimed he punched her in the breast on January 15, 2023, at Manchester’s Hyatt Regency Hotel, causing her silicon implant to flip over. She also claimed she suffered a head wound that night.\nUOL’s report said Cavallin claimed Antony also “tried to attack her face with a glass” during an argument in May, which left her with a wound to a finger on her right hand.\nShe showed the website a message she insisted she had sent to a travel agent, as she tried to book a flight to Brazil, that read: “I need to get out of here before he kills me.”\nAntony said in a statement that “the accusations are false” and accused Cavallin of changing her story. The player said he had provided “the due clarifications to the police authority” in Brazil.\nThe 23-year-old was dropped from the Brazil squad for September’s World Cup qualifiers against Bolivia and Peru. According to Vanessa Araujo, described by the BBC’s North West Tonight as Cavallin’s UK lawyer, Cavallin made a formal complaint to Greater Manchester Police on Friday, September 1.\nAraujo told the TV programme: “I believe the club will investigate because now we have the formal complaint with Greater Manchester Police. Gabriela gave her own statement last Friday and I believe the club will take some action now.”\nGreater Manchester Police said at the time it was “aware of the allegations made and inquiries remain ongoing to establish the circumstances surrounding this report”. It met with Antony on Thursday, September 28 to discuss the allegations.\nSportswear company Puma, which sponsors Antony and released a two-part documentary about the player on August 28, declined to comment when approached by The Athletic.\nAdvertisement\nWhat happened on Thursday, September 7?\nTwo more women came forward alleging they had been assaulted by Antony, according to reports in Brazil.\nExtra reported that a woman called Rayssa de Freitas filed a police complaint against him on May 20 2022, claiming she needed hospital treatment after being in the former Ajax player’s car with another woman and a hairdresser following a visit to a nightclub in Sao Paulo, Brazil.\nA third woman, banker Ingrid Lana, 33, also alleged Antony pushed her against a wall and tried to have sex with her when she visited his house in England last October on business.\nIn an interview with Record TV, which was later broadcast in full on Sunday, September 10, Lana said: “He tried to have (sexual) relations with me and I didn’t want to.”\nAntony responded to that allegation in a statement that was read out on Record TV. He said that he had an “intimate, consensual encounter” with Lana” and promised to make messages between the pair “available to the authorities if that’s what is required to prove my innocence”.\nWhat has Gabriela Cavallin said?\n“Today, he’s the total opposite of the person I first met,” she said about Antony on Record TV. “An extremely aggressive person. Extremely impatient. Extremely selfish.\n“From the start, (there was) always a lot of insecurity when it came to me going out alone or spending time with my friends. Sometimes I slept, for example, and left my phone on silent. When I woke up there would be 30 missed calls, a million messages asking where I was, what I was doing. It was annoying but I put up with it because I tried to understand it from the other side. I thought, ‘He likes me, he’s in love,’ and so on.\n“I saw the love but I was worried that it was not just love, but possession, obsession, everything that comes with that excessive jealousy and the excessive control he tried to have over me. Excessive control in all aspects.”\nAdvertisement\nWhat has Antony said?\nOn June 28, a statement was posted on Antony’s Instagram account: “To the friends, fans and followers. For you, after having given my statement at the police station where the investigation involving my name is being conducted, I wanted to speak publicly for the first time since I was falsely accused of assault.\n“I kept quiet until the moment so that nothing could interfere with the investigative process, but during all these days I and my family have suffered in silence. Even though I was born and raised in a very poor community, I had never been through a situation similar to this one, in which a false accusation of aggression generated a prior unfair public judgement by some people.\n“After the closure of the investigation, my innocence will be proved, and it is certain that justice will prevail and the damage initially caused to my image will be left in the past. I thank you for the countless messages of support received during this very difficult moment.”\nFollowing Cavallin’s interview, another statement released on Antony’s social media accounts read: “Out of respect for my fans, friends and family I feel obligated to speak publicly about the false accusations I have been a victim of.\n“From the beginning, I have handled this issue seriously and respectfully, providing the due clarifications to the police authority. The police inquest is under cover of justice, and therefore I cannot make its content public.\n“However, I can say with confidence that the accusations are false and that the evidence already produced and more to be produced show that I am innocent of the accusations made. My relationship with Ms. Gabriela was tumultuous, with verbal offenses from both sides, but I never practiced (sic) any physical aggression.\n“Every time, whether in testimony or in interview, she presents a different version of the accusations.”\nAdvertisement\nAntony then gave an extensive interview to Brazilian TV channel SBT on Friday, September 8, during which he further denied all allegations of assault and vowed to clear his name.\nWhile admitting that his relationship with Cavallin was “turbulent” and that there was “jealousy from both parties,” he told the Fofocalizando programme that he “never touched her”.\nAsked about the alleged hotel room attack, Antony said: “I left training in the morning, got my car and went to the hotel where she was staying.\n“We had lunch together, like normal. We chatted, like normal. All calm. Something that annoyed and irritated her was when I would say, ‘I need to go, because I have things to do as well.’ I told her I needed to go and, at that point, there was an argument.\n“I was sat on the bed. She grabbed my face. She flipped. She smashed a cup, smashed a plate… she came at me. At that moment, I held her. I didn’t squeeze her, didn’t do anything. I told her, ‘Calm down, calm down, calm down.’”\nAsked about the alleged headbutt, he said: “No, I didn’t headbutt her. At no point did I headbutt her.”\nAsked about the alleged car incident in June 2022, Antony claimed Cavallin had verbally abused him for going to a nightclub, but that he had “never” threatened her. “I would never say that I was going to kill her and the baby,” he said. “A lot of the things she is saying are not true.”\nReferring to an alleged punch in the breast, the Manchester United player said that Cavallin “told me the implant fell out of place in the bathroom”. He said the claims he had injured her with a glass were a “lie”, adding that his mother had “helped her, washed her finger and called my physiotherapist”.\nDescribing the “jealousy” that meant “we were always insulting each other,” Antony responded to a claim he had been annoyed that Cavallin liked a social post from Brazil team-mate Neymar. “There was an occasion when she took my phone and sent a message saying that, as if it was me,” he said. “I didn’t really understand it. And I have a very good relationship with Neymar.”\nAdvertisement\nAsked later in the interview about Lana’s accusation, Antony said: “I’m 100 per cent certain that I never touched any woman. One hundred per cent. I am certain. I will produce the proof and people will understand. They will see the truth.”\nWhat else did Antony say in the TV interview?\nAntony appeared tearful when asked later in the interview if he thought his career was over.\n“Definitely not,” he said. “This is one of the most difficult moments in my life — being accused of something I didn’t do. It’s not easy when you’re being crucified. Do you think I didn’t want to speak, to defend myself? To show the public who I really am? I wanted to.\n“I know the truth and the truth will come out. I know that a lot of people are massacring me. But the truth always comes out. United know about the inquiry. They’re following everything and will continue to do so.”\nHe added: “I will never flee. I would never do that. I’m going (back to England) because I have a job and responsibilities. I have a family.”\nWhat has the Brazilian Football Confederation said?\nA statement by the Brazilian Football Confederation (CBF) following Antony’s omission from the Brazil squad read: “Due to the facts that became public this Monday (04/09), involving striker Antony, from Manchester United, and which need to be investigated, and in order to preserve the alleged victim, the player, the Brazilian team and the CBF, the entity informs that the athlete has been withdrawn from the Brazilian team.”\nWhat have Manchester United said?\nUnited, who have faced calls to suspend Antony, initially released a statement insisting they were taking the matter “seriously”, though they stopped short of confirming whether the former Ajax winger would be made unavailable for selection.\nClub statement.\n— Manchester United (@ManUtd) September 6, 2023\nThe statement read: “Manchester United acknowledges the allegations made against Antony and notes that the police are conducting enquiries. Pending further information, the club will be making no further comments.\nAdvertisement\n“As a club we are taking this matter seriously, with consideration of the impact of these allegations and subsequent reporting will have on survivors of abuse.”\nThis was the club’s first public acknowledgement of the accusations against Antony, having previously referred back to the player’s statements.\nOn August 25, United manager Ten Hag was asked whether the allegations against Antony that had been made in Brazil were a concern.\nHe said: “No. The outcome in Brazil was clear, he is doing a good pre-season, he is also scoring some goals. He is more often in the situations where he is a threat for the opposition. Not only a threat but also in the key moments, he is there where he should have been. Now he has to finish.\n“In pre-season, he scored two goals, also one assist. He is (in) a good direction, now he has to speed up, because for us good is not good enough. Don’t get distracted, focus on football and performing.”\nUnited did not offer fresh comment when approached by The Athletic about Antony’s interview, but they issued an update on Sunday, September 10, to confirm the player would not return to Carrington on Monday, September 11.\nThat statement read: “Manchester United acknowledges the allegations made against Antony. Players who have not participated in international matches are due back in training on Monday. However, it has been agreed with Antony that he will delay his return until further notice in order to address the allegations.\n“As a club we condemn acts of violence and abuse. We recognise the importance of safeguarding all those involved in this situation, and acknowledge the impact these allegations have on survivors of abuse.”\nA new statement from Antony issued simultaneously said: “I have agreed with Manchester United to take a period of absence while I address the allegations made against me. This was a mutual decision to avoid distraction to my team-mates and unnecessary controversy for the club.\nAdvertisement\n“I want to reiterate my innocence of the things I have been accused of, and I will fully cooperate with the police to help them reach the truth. I look forward to returning to play as soon as possible.”\nThat United statement is understood to have been signed off by chief executive officer Richard Arnold following consultation with Ten Hag.\nOn Friday, September 29 United confirmed Antony would return to training.\nWhat are United’s options?\nUnited say they have listened and taken learnings from criticism of their handling of the Greenwood case, including external expert advice from Women’s Aid and the Professional Footballers’ Association (PFA).\nWomen’s Aid, a charity that supports women who have suffered domestic or sexual abuse, has been speaking to United over the past few weeks and met with representatives from the club after The Athletic revealed United had told executives of their plan to bring back Greenwood.\nTeresa Parker, who developed the Football United Against Domestic Violence campaign for the charity, said: “Domestic abuse is prevalent in our society and all employers, including football clubs, need clear policies and procedures about what to do when allegations are made against an employee. In every alleged domestic abuse case, safeguarding is vital, to ensure the safety of everyone involved while proceedings are ongoing.\n“When the alleged perpetrator is a high-profile footballer, we know from survivors of domestic abuse that this has an impact on both football fans and wider society, who can see them playing and celebrated on the pitch as a sign that the issue is not being taken seriously.”\nIn Greenwood’s case, United announced he would not be eligible for selection after images and audio emerged on social media on January 30, 2022. The forward was arrested later that day on suspicion of rape and assault and has not played for the club since — although he continued to receive his £75,000-a-week wages.\nAdvertisement\nWhen all charges against him — all of which Greenwood denied — were dropped in February 2023, United began an internal investigation. They announced this had concluded on August 21 and it had “been mutually agreed that it would be most appropriate” for the 21-year-old to resume his career “away from Old Trafford”. Greenwood joined Spanish side Getafe on a season-long loan on transfer deadline day.\nGreenwood’s case reminds us there is no precedent for United here, and no governing body — be that the English Football Association or the Premier League — to intervene. Unlike in many U.S. professional sports, there is no policy or strict rules that organisers have to be informed if an allegation is made against a player.\nGO DEEPER\nThe day Mason Greenwood was welcomed back to football by Getafe\nMaheta Molango, chief executive of the PFA, met with United officials to discuss Antony’s situation. It is standard practice for the players’ union to offer help in such circumstances.\nUnited sought to establish the facts around the case after the initial allegations were made by Cavallin in Brazilian media in June, which included speaking to Antony, but did not set up a formal inquiry and stepped back to allow the judicial process to take place.\nThe club believe the leave of absence would allow Antony to focus on defending himself and say they will keep an eye on developments now he has returned to training.\nWhat happens now?\nPolice in Sao Paulo and Greater Manchester are investigating the claims, all of which Antony has denied.\nUnited’s next match, at home in the Premier League against Crystal Palace, is tomorrow (Saturday, September 30). Antony will not feature in this game because he did not train on Friday.\nUnder the terms of the standard Premier League contract, which has been in place since a collective bargaining agreement was reached with the PFA in 2003, clubs can only suspend players for a maximum of 14 days. But they can decide not to consider players eligible for selection — and continue to pay their wages — if they wish.\nAdvertisement\nAt this stage, while Antony has not been arrested or charged, he remains innocent until proven guilty in United’s eyes.\nThe club believe the leave of absence reflected the seriousness with which they view the situation.\nUnited previously declined to comment when asked if their position would change if Antony were to be arrested.\nTen Hag is due to speak to the media today (Friday afternoon) and is expected to be asked about Antony’s situation and availability.\nAdditional reporting: Adam Crafton and Laurie Whitwell\n(Photo: Ash Donelon/Manchester United via Getty Images)",
  "word_count": 3448,
  "scraped_at": "2026-02-14T12:04:26.876731"
}