{
  "article_id": "7362cf88ccf3",
  "url": "https://www.winnipegfreepress.com/arts-and-life/entertainment/celebrities/2023/05/02/wrexham-party-goes-on-in-wales-and-maybe-las-vegas-too",
  "title": "Wrexham party goes on in Wales and maybe Las Vegas , too – Winnipeg Free Press",
  "date": "20230502T140000Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Wrexham party goes on in Wales and maybe Las Vegas, too\nAdvertisement\nWREXHAM, Wales (AP) — The party continued for Wrexham on Tuesday as Hollywood owners Ryan Reynolds and Rob McElhenney joined an open-top bus parade to celebrate the Welsh soccer team's promotion.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nWREXHAM, Wales (AP) — The party continued for Wrexham on Tuesday as Hollywood owners Ryan Reynolds and Rob McElhenney joined an open-top bus parade to celebrate the Welsh soccer team's promotion.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 02/05/2023 (1019 days ago), so information in it may no longer be current.\nWREXHAM, Wales (AP) — The party continued for Wrexham on Tuesday as Hollywood owners Ryan Reynolds and Rob McElhenney joined an open-top bus parade to celebrate the Welsh soccer team’s promotion.\nThe actors reveled with players and fans, as crowds came out to mark the club’s return to the English Football League after a 15-year absence.\nThe team will also jet off to Las Vegas as reward for winning the National League with a record total of 111 points.\nStriker Paul Mullin revealed the plans during an interview with the Footballers’ Football podcast last week.\n“(We’re) Off to Vegas,” Mullins said. “Get the plane fired up and all off to Vegas, which will be unbelievable.”\nGoalkeeper Ben Foster had hinted Reynolds and McElhenney had more celebrations in store after a dramatic win against closest rival Notts County last month.\n“They promised us a big deal at the end of the season,” he told CBS Sports last month. “They promised us a monster one (party) at the end of the season, (that) if we get promoted then they are going to take us away somewhere with a lot of flashing lights.”\nReynolds and McElhenney have become regular visitors to Wrexham after completing their $2.5 million takeover of the down-on-its-luck team in 2021.\nThey were at the Racecourse Ground to join the wild celebrations when promotion was clinched with a 3-1 win over Boreham Wood last month.\nAnd they were back again Tuesday as the city came out to commemorate the team’s achievements.\nWrexham’s women’s team, which also won promotion this season, was part of the parade as well.\nWrexham has garnered global interest since Reynolds and McElhenney took over. The documentary “Welcome to Wrexham” is streamed around the world and has made household names of players like Mullin and manager Phil Parkinson.\nBut the drama on the field has also demanded attention, with Wrexham involved in some thrilling matches on the way to promotion, including the 3-2 win over Notts County, which saw Foster pull off a penalty save in added time.\n“It’s been a huge effort by everybody, on the pitch and off it, and this is a great opportunity for us to thank for the community of Wrexham for their incredible support,” Wrexham CEO Fleur Robinson said ahead of the parade. “We are looking forward to commemorating a truly memorable and record-breaking season together.”\nWrexham has announced it will play the LA Galaxy II at Dignity Health Sports Park on July 22 as part of a summer tour in the United States. Games against Premier League teams Manchester United and Chelsea have also been scheduled.\n___\nMore AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports",
  "word_count": 739,
  "scraped_at": "2026-02-14T12:55:32.703821"
}