{
  "article_id": "736c081d8ae4",
  "url": "https://www.cardchronicle.com/2023/2/9/23592848/thursday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Thursday afternoon Cardinal news and notes",
  "date": "20230209T213000Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "—The U of L women’s basketball team returns to the court tonight for a 7 p.m. road game against Virginia. Here’s a preview.\nThursday afternoon Cardinal news and notes\nThe Duverge fam still loves the Cards.\n—A total of five Louisville players — Malik Cunningham, Yasir Abdullah, YaYa Diaby, Kei’Trel Clark and Tiyon Evans — have now received invites to the 2023 NFL Scouting Combing.\n—The ESPN college football crew make some “wild predictions” for the upcoming season, and Bill Connelly is picking Louisville to win the ACC.\nConnelly: Louisville wins the ACC! OK, it’ll probably be FSU or Clemson (and “FSU lives up to increasingly lofty hype” is another prediction that I seriously considered), but you asked for a WILD prediction! In their first division-free ACC schedule, the Cardinals avoided both Florida State and Clemson, and their toughest conference road game is probably either NC State or Miami. If Jeff Brohm enjoys any of the first-year effects that he saw at Purdue, when he immediately bumped the Boilermakers from 3-9 to 7-6, he could have a surprisingly awesome first season.\n—The New England Patriots have interest in Malik Cunningham as a potential day three pick.\n—A new Card Chronicle Podcast episode is out.\n—Georgia Tech beating Notre Dame at the buzzer last night means we’re back alone in last place in the ACC standings.\n—Down year for the sport.\n—The 23rd-ranked U of L men’s tennis team will host No. 2 Kentucky (and others) this weekend.\n—Nice to see Jawhar Jordan getting some Buff City Soap NIL love.\n—The Louisville softball team will open its 2023 season tomorrow in Clearwater, Fla. The Cards take on South Alabama at 11 a.m. followed by a 1:30 p.m. matchup against No. 17 Kentucky.\n—High school basketball needs a shot clock.\n—U of L lacrosse will host a pair of top 25 opponents this weekend to open their season.\n—Jeff Brohm has offered a pair of four-star prospects from the 2024 class.\n—Get your Mykasa Robinson Senior Day t-shirts here.\n—Jeff Goodman and Doug Gottlieb both say Louisville hasn’t looked well-coached this season and that Kenny Payne is better in a role as an assistant, but also say that you have to give him a second season.\n—The Kentucky Humane Society has rescued 30 cats from a “large-scale neglect situation” in Mississippi.\n—Florida State head football coach Mike Norvell has signed a contract extension through the 2029 season.\n—Jeff Greer’s latest U of L hoops newsletter focuses on a new rock bottom for the worst season in program history.\nSometime during Tuesday’s game, I found myself having flashes of deja vu. The disparate performances, highlighted by Pitt’s destruction of a win, reminded me of six years ago when Louisville absolutely pulverized Pitt, 106-51, in the very same building in what was the most lopsided conference win for a road team in ACC history.\nWandering that night into the visitors’ locker room — which, like most visitors’ locker rooms, is a compact space that feels like a living room with 15 cubbies in a U-shape — the shock among Louisville’s players was evident. They flat-out could not believe what they’d just done, to the point of giggling because they didn’t know what else to do.\nI leaned onto Anas Mahmoud’s locker and said to him and Deng Adel, “You guys didn’t have to do my alma mater like that.” Of course I was joking. “You went here?” Adel asked. Yes, I confirmed. Their response? A collective wide-eyed expression that really only means “oof” and everyone knows it.\nOn Tuesday night, I thought again about that game — about how Louisville just made everything, how Pitt looked completely lost, how the two programs felt like they were in completely different universes. That was rock bottom for Pitt basketball, a sign of the misery that would ensue through the rest of Kevin Stallings’s brutal two-year spell at a once-proud program.\nI believed Louisville was past the rock-bottom moments, even after going 1-3 through a four-game stretch of winnable matchups. I was wrong. And we all let out a collective oof at the end. What else can we do at this point?\n—Cardinal Authority is out with a new U of L women’s basketball notebook.\n—Duke Basketball Report says that Louisville is taking losing in the NCAA to a whole new level.\n—This would seem to indicate that Nochta doesn’t think TJ Capers is going to pull a DeAndre Moore or Rueben Owens next winter.\n—Pat Forde tells the wild story of North Carolina — the most dominant program in field hockey — hiring a 22-year-old six weeks out from graduation to be its new head coach.\n—College basketball’s anti-flopping rules seem to be working, as offensive fouls are as low as they’ve been in a long, long time.\n—We’ve been highlighting plays like this since the very first exhibition game back in late October. Nothing has changed.\n—One gambling site likes Miami over Louisville by 23 on Saturday night.\n—Carlik Jones has been selected to play in the “Next Up” game, which features the top 24 G League players. The game will take place Feb. 19 on NBA TV at 3 p.m. ET.\n—Louisville spent a grand total of $344,000 on “buy games” that they lost this season.\n—At least the social media team is still thriving.\n—Louisville has offered Texas QB Deuce Adams (2024).\n—The NBA’s all-time leading scorer is pretty much a Louisville Cardinal.\n—Three stats tell the full story of Pitt’s dominance of Louisville from Tuesday night.\n—And finally, beat Virginia.",
  "word_count": 928,
  "scraped_at": "2026-02-14T13:34:06.684265"
}