{
  "article_id": "736c3d94a102",
  "url": "https://www.thefa.com/news/2025/apr/02/hilton-and-fa-announce-three-year-partnership-20250204",
  "title": "Hilton have signed a three - year agreement to become the official partner of the England teams",
  "date": "20250402T103000Z",
  "domain": "thefa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Today, the FA and Hilton have announced a three-year partnership, with Hilton becoming Official Hotel Partner of the England football teams.\nThis includes Wembley Stadium connected by EE and St. George’s Park and will see Hilton support the Three Lions and Lionesses at every home and away match.\nHilton will also be the official partner of the England Supporters Travel Club, offering loyal fans Hilton Honors perks on hotel stays when they travel to support the teams at home and abroad.\nAs a partner of St. George’s Park, Hilton will join forces to showcase Hilton St. George's Park as a destination and place to stay for football fans. The hotel already provides a home away from home to the England women’s and men’s squads during international camps.\nHilton Honors members will be able to turn their hotel stays into some of 2025’s most sought-after tickets at Wembley Stadium connected by EE. This includes major sold out gigs, Emirates FA Cup and Adobe Women’s FA Cup Finals, and other high-stake matches.\nPackages will be available via the Hilton Honors Experiences platform, and could include matchday experiences with stays at Hilton London Wembley, ‘meet and greets’ with women’s and men’s England legends and tickets for the biggest games and music events around, from the comfort of Wembley Stadium’s One Twenty Club.\nJames Gray, FA commercial director, said: “We’re delighted to have Hilton on board as a partner across our England teams, Wembley Stadium connected by EE and St. George’s Park.\n“With our national teams competing for the biggest trophies over the next three years, Hilton can play an important role in supporting our squads on and off the pitch. We are building on a long and successful association with Hilton, especially with our hotel at the national football centre and this agreement will take our relationship to a new level.\n“Our England fans and visitors to Wembley will also feel the benefit of the Hilton partnership with the opportunity to enjoy major matches and countless memorable moments. Wembley continues to stage some of the biggest domestic and international matches on the planet, and regularly welcomes world-leading music acts to perform sell-out shows under the Arch. We’re delighted Hilton will join us on this journey.”\nStijn Bastiaens, vice president marketing and loyalty, EMEA, Hilton, added “At Hilton, we believe that it matters where you stay. From Formula 1, to golf and tennis, Hilton has a long history of providing unforgettable stays to elite sports athletes and teams as they travel across the world.\n“Through this new partnership with the FA, we can’t wait to welcome the England teams with our signature hospitality.\n“With 2025 set to be a monumental year for music and football at Wembley Stadium, we’re excited to also offer our Hilton Honors members the chance to turn their stays into unrivalled access to some of this year’s most highly coveted events.”\nHilton Honors is the free-to-join, award-winning guest loyalty programme, in which members can benefit from greater discounts and unlock exclusive perks and once-in-a-lifetime experiences, which now proudly includes a host of events at Wembley Stadium connected by EE and with the FA.\nBy booking directly at Hilton.com or through the Hilton Honors app, members can access a whole host of instant benefits designed to elevate their stay.",
  "word_count": 548,
  "scraped_at": "2026-02-14T13:06:39.929524"
}