{
  "article_id": "737b42d88087",
  "url": "https://english.elpais.com/culture/2025-11-24/wicked-the-phenomenon-that-even-its-stars-didnt-expect-we-all-feel-at-some-point-in-our-lives-like-we-dont-belong.html",
  "title": "  Wicked , the phenomenon that even its stars didnt expect :  We all feel at some point in our lives like we dont belong  | Culture",
  "date": "20251124T183000Z",
  "domain": "english.elpais.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "‘Wicked,’ the phenomenon that even its stars didn’t expect: ‘We all feel at some point in our lives like we don’t belong’\nEL PAÍS speaks with Cynthia Erivo and Ariana Grande about the second part of a project that achieved overwhelming success in the US but was not replicated abroad\nThe battle lines have been drawn in the United States. No one is safe; everyone has to choose a side. And the decision is incredibly close. The question is simple and direct: pink or green? Glinda or Elphaba? The good blond witch or the wicked (or not so wicked) green Wicked Witch of the West? The debate is spreading through cities and towns. The tie was real in Halloween costumes, the great unofficial American national holiday. The colors are appearing on hundreds of merchandise items, from specially customized luxury cars to pots, clogs, cosmetics, sweatshirts, and (seriously) pre-cooked macaroni and cheese. Wicked fever is an unstoppable invasion. The U.S. premiere took place at a Lincoln Center decorated in pink and green, filled with flowers and photographs, with lines stretching for hours beforehand, in a New York where even its famous Christmas ice rink was sponsored courtesy of Wicked, and a sea of flags. Yes. Pink and green. Its American popularity is explosive, but what about the rest of the world?\nWicked, and now Wicked: For Good, is a hit in the United States. However, it hasn’t quite reached the same level of success in the rest of the world. The numbers speak for themselves. The first installment, released in November 2024, was a box office smash, grossing $760 million, but these blockbusters are usually successful beyond Hollywood. Wicked, however, was not. In the U.S., it grossed $475 million; abroad, $285 million. In fact, in the U.S., it recouped its $150 million budget in just five days. The way the film has permeated popular culture and become ubiquitous in conversation is undeniable. And not even its stars or its director, Jon M. Chu, fully understand the reasons for this success.\nCynthia Erivo is the co-lead of the film, around whom the plot revolves, which is even more the case in the second instalment. With a slightly hoarse voice due to the extensive promotional tour, she speaks to EL PAÍS for a few minutes via video conference. The 38-year-old British actress says she doesn’t think she, or anyone else, could have predicted what Wicked has become. ”I think it came as a massive surprise to us to see how globally accepted it became. But I’m really proud of that. I’m proud that people have sort of welcomed us in this way and that they are seeing themselves in these characters and connecting with this movie and the story and the characters and who they are. I think it’s such a special thing to be a part of. To do something like that and to sort of shake the world in its way, you know, it’s lovely.\"\nSpecifically, for her, Elphaba’s story resonates deeply with so many people because so many feel — like the green witch — that they don’t belong, that they’re not in the right place. “I think a lot of us, if not all of us, feel at some point in our lives like we don’t belong, like we don’t fit, like we’re different and that we were misunderstood and I think that that Elphaba is the representation for all of those things,” the actress and singer reflects. “To be able to see it on screen, to see something that properly describes what we’re feeling on the inside, I think is a really special thing and it’s something that we can sort of cling to.” Chatting on the day of the film’s release, Erivo admits to feeling incredibly proud of a project she doesn’t know if she’ll ever be able to say goodbye to. “I think it will be a part of me for the rest of my life; it’s more of a ‘see you soon’ kind of thing,” she acknowledges. “But it’s beautiful to finally be able to share it with everyone. You know, we’ve lived with it for so long, just us, and now that we can share it with the world, it’s wonderful.”\n“No, we had no idea,” Ariana Grande explains regarding the movie’s overwhelming popularity. “I mean, we loved Wicked so much, of course, like there’s nothing bigger or better or more beautiful than Wicked to us, we were superfans coming into this. But of course you can never expect that from the whole, you know, being able to share it in this way and receive the response that we have, there’s no way to really prepare yourself for that,” the singer acknowledges at a press conference in response to a question from EL PAÍS.\n“I think also when it comes to doing the work, I couldn’t even let my mind think about how it was going to be received, perceived, I just kind of wanted to bury myself in the work, and not even think about that. So we had no way to gauge or prepare for what was on the other side of this, and it’s been really overwhelming and so beautiful. I mean, look, we get to share this with the fans, and the way that they love us, and embrace these characters...” explained Grande, who is already being touted by specialized media as one of the most likely Oscar contenders. “I hope that their love and forgiveness that they share, and their empathy for one another, even at the most heartbreaking moments, I don’t know, can just stay with people. I hope they’re able to take that and apply it to their own sisterhoods and friendships, and loves.”\nThe film’s director, Jon M. Chu, also didn’t expect this overwhelming success. “I mean, who could? You can aspire to it, you can hope it does that, because you want people to care in the work that we’re doing,” he acknowledges. “We knew Wicked was Wicked, so there’s going to be some sort of fanbase. But could it go beyond that? Could we touch culture in a way?” reflected the director, who finished filming the project almost two years ago. “It was beautiful to see that people cared, it was beautiful to see that people were being touched by this, and giving them some sort of hope in these hard times. But we also knew we had a second one coming, that was actually the meat. The whole point of making Wicked. So part of us was like, ‘well I can’t wait for them to see the second part.’ Because once you see the second part, you can’t go back.”\nThat soaring popularity, however, has been difficult to replicate outside the United States. The reasons aren’t entirely clear; in fact, perhaps there aren’t any, or at least none that are obvious. Perhaps it’s simply a cultural phenomenon that isn’t as easy to export as others like Barbie, which grossed $1.4 billion, $800 million of which came from outside the United States; or Avatar, which earned $2.1 billion worldwide and $800 million in the U.S. The pair of singing witches has certain elements that aren’t easy to export, one of them being precisely that they sing. And the music, however much it can be translated into Spanish, isn’t as catchy as when it’s created by the talented Stephen Schwartz, a nine-time Oscar nominee (and winner of three statuettes). Matt Jordan, the professor in charge of film and media studies at Penn State University, compares the phenomenon to American football: no matter how much it’s exported, it’s so inherently American that it fails to resonate. Furthermore, he believes that the film’s two-part format doesn’t help foster a connection.\nPerhaps it’s the story; ultimately, the heart of the film. Some suggest it’s a film about the triumph of individualism over friendship — even though the latter endures — about characters who pursue different goals and do so above all else; therefore, a very “American-style” story. In the end, it’s also about two women (white and Black, or blond and green) confronting a white, charlatan, dictatorial man. Something the U.S. can easily identify with. And it’s also, forever, the basis of The Wizard of Oz, a quintessentially American story with immense cultural impact. “Undoubtedly, the inclusion of a fascist and repressive government in Oz in the plot could have an impact on the film’s target audience: young women,” the professor opines. “The public seeks escapism in blockbusters. That the reality that saturates our media — where we are daily inundated with news about a charlatan who destroys the social fabric by ignoring the law, attacking scapegoats, and harassing the vulnerable — sews into Wicked might be excessive.”\n“Wicked resonates with American audiences because the Wizard of Oz character universe has been around since 1900 and has had multiple musical adaptations,” Professor Jordan adds. “Wicked, the musical, took the villain of the 1939 movie and offered a new perspective on her development. Audiences have made it a New York cultural institution since 2003. So when the movie came out with a new cast and more technicolor special effects were added, it took off. It is certainly a story of female friendship in the face of a group misled by a powerful charlatan leader who uses smoke and mirrors and deceit to appear powerful rather than relying on merit. This idea resonates in our current cultural context where our media system makes it hard to know what is real and our politics is dominated by a charlatan huckster. Its blockbuster status was also aided by the market magic of a massive international advertising blitz.\"\nHe’s not wrong. The impact of Wicked is felt at the box office, yes, but also on the street. The marketing strategies have been vast, with spectacular premieres all over the world. Furthermore, NBC (part of Universal, the studio behind Wicked) aired a special in November, recorded live in September at the Dolby Theatre in Hollywood, with a production worthy of the Oscars held at the same venue. It drew almost four million viewers, becoming the second most-watched special of the year on American television, second only to the Super Bowl.\nThe phenomenon has also meant maximum exploitation of the image and social media presence of its stars, Grande and Erivo, who are so closely linked that, for some, it borders on unsettling. In Singapore, Grande was attacked by a supposed fan, and Erivo rushed to her defense even before her bodyguards, in an image that went viral. The popularity of both has also skyrocketed with this project, leading to Grande joining the cast of American Horror Story and the next installment of the comedy saga Meet the Parents. Erivo, a Tony, Emmy, and Grammy winner, has half a dozen projects lined up and has graced the stage in Los Angeles, for Jesus Christ Superstar (as Jesus), and in London, single-handedly performing some 20 roles in Dracula. Wicked has boosted their careers, and although it’s about to become history, they still have one last push: awards season. Nominations are expected, and maybe even awards. Although neither they nor a good part of the world quite understand it.\nSign up for our weekly newsletter to get more English-language news coverage from EL PAÍS USA Edition\nTu suscripción se está usando en otro dispositivo\n¿Quieres añadir otro usuario a tu suscripción?\nSi continúas leyendo en este dispositivo, no se podrá leer en el otro.\nFlechaTu suscripción se está usando en otro dispositivo y solo puedes acceder a EL PAÍS desde un dispositivo a la vez.\nSi quieres compartir tu cuenta, cambia tu suscripción a la modalidad Premium, así podrás añadir otro usuario. Cada uno accederá con su propia cuenta de email, lo que os permitirá personalizar vuestra experiencia en EL PAÍS.\n¿Tienes una suscripción de empresa? Accede aquí para contratar más cuentas.\nEn el caso de no saber quién está usando tu cuenta, te recomendamos cambiar tu contraseña aquí.\nSi decides continuar compartiendo tu cuenta, este mensaje se mostrará en tu dispositivo y en el de la otra persona que está usando tu cuenta de forma indefinida, afectando a tu experiencia de lectura. Puedes consultar aquí los términos y condiciones de la suscripción digital.",
  "word_count": 2047,
  "scraped_at": "2026-02-14T14:20:46.260774"
}