{
  "article_id": "7382152c9e1f",
  "url": "https://www.ok.co.uk/celebrity-news/david-beckham-snubbed-once-again-31773478",
  "title": "David Beckham snubbed once again in New Year Honours as furious emails re - emerge",
  "date": "20231230T161500Z",
  "domain": "ok.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "David Beckham snubbed once again in New Year's Honours as furious emails re-emerge\nThe King's New Year's Honours list has been revealed but David Beckham hasn't made the cut once again and has been overlooked for a knighthood amid leaked emails\nIt's not David Beckham's year once again, as he has been overlooked for a knighthood in the King's New Year's Honours list.\nThe former England FC captain captured the hearts of the nation as a young footballer and has gone on to gain popularity since retiring from the sport.\nThe 48-year-old previously received an OBE in the Queen's Birthday Honours List in 2003, after he had racked up countless trophies at Manchester United.\nBut ever since, the legend has been snubbed for a knighthood.\nHis former mentor Manchester United's Sir Alex Ferguson has been knighted, however no football players have received one for decades, including anyone from the successful women's team that won the UEFA Women's European Championship final in 2022.\nDespite this, recent sporting knighthoods include the likes of Jason Kenny and Lewis Hamilton.\nWhile a knighthood could be ion the cards for Beckham at some point, some post-retirement antics may be to blame for him missing the list in previous years.\nHe was caught up in the Ingenious tax avoidance scheme in 2013, although later cleared of wrongdoing and added back to the official recommendations list two years ago.\nHis chances of receiving an honour then took another blow in 2017, after damning emails were allegedly leaked.\nIn those emails, Beckham took aim at the honours committee for omitting him. He allegedly called them \"unappreciative c***s\" and insisted that he didn't \"care about being knighted\".\nHe was also alleged to have written: \"I expected nothing less. It's a disgrace to be honest and if I was American I would of [sic] got something like this 10 years ago.\"\nBeckham appeared to take aim at the previous decision to hand singer Katherine Jenkins an OBE.\nHe is said to have written: \"For what? Singing at the rugby and going to see the troops.\"\nHe later claimed that some of the emails had been doctored and as a result were fake.\nLast year he caused yet more controversy as he opted to take up an ambassador role for Qatar ahead of the World Cup, for which he is thought to be paid £150million over 10 years.\nHe was a major advocate of the gulf state hosting the tournament despite their record of humans rights issues and stance on homosexuality.\nWhile he hasn't mentioned his desire to be knighted publicly of late, he did show his respect for the monarch when he queued up alongside the public for more than 13 hours to see Queen Elizabeth II lying in state just over a year ago.",
  "word_count": 465,
  "scraped_at": "2026-02-14T12:30:22.811422"
}