{
  "article_id": "73a1fd13a203",
  "url": "https://www.90min.com/posts/gareth-taylor-reacts-man-city-womens-champions-league",
  "title": "Gareth Taylor reacts to Man City missing out on Women Champions League",
  "date": "20230522T104500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gareth Taylor reacts to Man City missing out on Women's Champions League\nGareth Taylor described it as a \"big blow\" for Manchester City to miss out on next season's Women's Champions League, yet he remains confident that his team aren't far away from being able to get to the latter stages of the competition in the future.\nCity's stoppage defeat to local rivals Manchester United ensured that only a miraculous goal difference swing on the final day of the WSL season next weekend will allow them to leapfrog Arsenal into third place – the Gunners have a three-point lead and a goal difference 11 better.\nAlthough City have been knocked out of the Champions League in the qualifying stages by Real Madrid in each of the last two seasons, the 2023/24 campaign will best the club's first with no European football whatsoever since 2015.\nTaylor called the Manchester derby defeat 'frustrating' given that Arsenal had lost to Chelsea earlier the same day, opening the door for City to close the gap.\n\"It's a big blow. We love being in the Champions League and that situation,\" Taylor said of the near certainty that City will finish fourth in the final WSL table and miss out. \"It's so tough, the margins are so tight and four good teams have really gone at it this season to compete for three places.\nRead the latest Man City Women news here\n\"The hardest part is getting into the Champions League and then the qualification process, certainly for us, playing Real Madrid twice. But I feel if we could get into the group stage, we could do what Arsenal and Chelsea have done [by reaching the semi-finals this season], potentially with this group of players in the next two or three years,\" he added.\nTaylor, a former City player during his own career who has been at the club in various coaching capacities since hanging up his boots in 2011, is determined to stay and oversee the development, despite questions over his future that wil arise from the setback.\n\"I love the club and I work hard. I love working with the players and don't see that changing,\" he said.",
  "word_count": 364,
  "scraped_at": "2026-02-14T12:21:49.195224"
}