{
  "article_id": "73b434e049f0",
  "url": "https://www.braidwoodtimes.com.au/story/8660401/locker-room-manuka-oval-upgrade-to-boost-canberras-big-bash-bid/?cs=14329",
  "title": "Locker room : Manuka Oval upgrade to boost Canberra Big Bash bid | Braidwood Times",
  "date": "20240613T213000Z",
  "domain": "braidwoodtimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- Read on for the latest news and gossip from around the grounds in Canberra sport. This week we've got Manuka upgrade plans, why a Brumbies player dreaded giving away his jersey and an Olympic-sized update.\nForget a new rectangular stadium. Manuka Oval might be the first major sporting venue in Canberra to get a significant facelift after the ACT government committed to design work for a new eastern grandstand.\nSubscribe now for unlimited access.\nor signup to continue reading\nIn news that will boost Cricket ACT chairman Greg Boorer's bid for a men's Big Bash team, it can be revealed the government will fund a study as part of the budget later this month.\nThe exact financial commitment is unclear because it's tied up in other infrastructure elements, but the idea is to do all the work so Manuka's plans become a \"ready to build\" project for federal government investment.\nBuilding facilities on the eastern side of the ground is considered the last part of a three-phase plan to increase capacity, improve spectator amenities and attract more content to the historic venue, which will celebrate its centenary in 2029.\nIt's a massive boost for Boorer's hopes of winning a Big Bash licence, and having the backing of Chief Minister Andrew Barr will push Manuka's redevelopment and cricket's grand plans closer to reality.\n\"As Manuka Oval celebrates its centenary, significant improvements to access, safety and the spectator experience will ensure the oval continues to be one of the best boutique venues for cricket and AFL in the country,\" Barr said.\n\"The ACT government is continuing to plan for the next progressive improvements to further improve Manuka Oval, ensuring that the ACT can continue to attract elite sporting content.\n\"Funding will be provided in the 2024-25 budget to continue technical due diligence and design for a new eastern grandstand at Manuka Oval. A new grandstand will improve the experience of attendees.\n\"This work will include consulting with Manuka's resident sporting codes and also residents in the surrounding areas.\"\nThe venue capacity for Australian football matches will increase from about 14,000 to 20,000, and cricket will jump from about 11,000 to 18,000 when the construction is complete.\nThe changes have been in the works for more than a decade after staged upgrades were flagged in 2013.\nPhase one of that plan was to upgrade the pitch and get the venue ready for the cricket World Cup in 2015, and phases 2a and 2b were to upgrade the western and southern facilities.\nThe eastern upgrade was the final step, and was expected to cost at least $24 million. Given construction costs have increased significantly, that figure is expected to at least double.\nThe challenge for the government will be trying to keep some of the old-school charm that makes Manuka Oval so great. Sitting on the hill to watch cricket or the GWS Giants - particularly in the warmer months of the AFL season - is a treat for sporting fans.\nBarr has already flagged his intention to seek a 50-50 funding partnership with the federal government. The eastern stand was mentioned in both the ACT government and Cricket ACT's submission to a federal government inquiry into better promoting the capital last year.\nIt's understood Cricket Australia is seriously considering Canberra's prospects of Big Bash expansion. But officials were concerned about the limited capacity at Manuka Oval, and upgrading the eastern grandstand has been viewed as a potential way to seal the deal.\nCricket ACT is also pushing for a new $25 million centre of excellence, separate from the base at Phillip Oval, to strengthen pathways and become an attractive destination for players.\n\"Whilst the boutique nature of Manuka does set it apart from other sporting venues in Australia and abroad, the evolution of this facility is of critical importance, particularly in terms of being able to deliver brilliant experiences for cricket fans and participants,\" Cricket ACT said in its federal government submission last year.\n\"Developments could include the redevelopment of the eastern grandstand to enable more fans to watch cricket (and AFL), upgraded spectator amenities, greater parking provisions, enhanced training and preparation facilities and the transition to a more eco-friendly, environmentally sustainable venue.\"\nHIS NAME'S BILLY AND SILLY?\nHow good was it to see the Brumbies wear their heritage jerseys for the quarter-final last week. The collars - for both teams - looked superb. And the good news is ... the 2004 throwback jumper is here to stay for the semi-finals and, hopefully, a grand final.\nWell, it's good news for everyone except hooker Billy Pollard. The young rake thought he was just making a fan's day when he pulled off his match-worn jersey and gave it away after last week's quarter-final win.\nThen he got back into the Canberra Stadium change rooms and sat in silence, too scared to tell Brumbies staff what he had done.\nHe'd given away his jersey with a GPS unit still tucked inside a pocket beneath the collar.\nThe spur of the moment decision sent high performance staff into a spin and had other officials stressing about needing to order another jersey - because the Brumbies are wearing those same jerseys throughout the entire Super Rugby finals series.\nThe lucky fan soon found a Brumbies official and handed over the GPS unit, while the club managed to secure another jersey in time for the flight to Auckland.\n\"I knew I forgot it about five minutes before but I didn't say anything, I was too scared,\" Pollard said. \"I got in a fair bit of trouble for that, so I won't be doing that again.\"\nIf the Brumbies can defy history and beat the Blues at Eden Park on Friday, you can bet Pollard will be keeping his jersey on - with the GPS unit tucked away - until he gets back into the sheds.\nBut that's not to say it wasn't worth seeing a kid's face light up when he handed over a jersey.\n\"It's pretty special. You don't really understand the impact unless you kind of think about when you were a kid,\" Pollard said.\n\"Getting a jersey is pretty cool. A jersey, boots, whatever it may be. A lot of the time we can't do it but I was lucky I was able to on the weekend. Hopefully he enjoys it and keeps it for a while.\"\nPAPA DON'T PREACH\nYou might recall our story about Josh Papali'i's son Noa wowing the adoring crowds at Canberra Stadium a few weeks ago, signing autographs and chatting to fans like he was already an NRL star.\nAs it turns out, Noa's fame extends beyond the lines on a rugby league field and even when he's not wearing Canberra Raiders lime green.\nNoa's teachers saw the cute story in Locker Room and gushed over his newfound fame. Noa went home and told his parents, and the legend continues to grow.\n\"Not Canberra Times feeding Noa's delulu,\" mum Salesa said.\n\"He came home saying he's famous [and] kept going on about his teacher saying she saw him in the newspaper so, I googled his name and there it was, the wannabe NRL U7 Raider Noa-Reign.\n\"A memory to save for his 21st birthday. The funniest part about it is his dad didn't even play this game because he was suspended.\"\nJADE'S PARIS PITCH\nCanberra Capitals star Jade Melbourne is making a massive push for inclusion in Australia's Olympic campaign, lighting up the WNBA and announcing herself as an international superstar.\nMelbourne is on the fringes of the Australian Opals squad and is using the best league in the world to impress national coach Sandy Brondello.\nMelbourne is the youngest player in the WNBA but stunned opponents and teammates when she put up a career-high 21 points earlier this week. It was a perfectly timed purple patch for the 21-year-old given Brondello was coaching the opposition - the New York Liberty.\n\"I think she was trying to impress the coach [to] try to make the Olympic team,\" Brondello said after the game. \"She did that, two games in a row.\"\nMelbourne has been left out of the Opals squad to tour Japan next week, with game time in the WNBA viewed as a crucial step in her development.\nFormer Capitals skipper Marianna Tolo, however, has returned from Europe and will join the Opals for the two-game trip. Veteran superstar Lauren Jackson continues to firm in her bid for an Olympic comeback, but she will also miss the games in Japan.\nCAPITAL OLYMPIANS\nSpeaking of Olympic and Paralympic hopefuls, 34 Paris hopefuls got a handy bank account injection from ACT Sport Minister Yvette Berry.\nBerry set aside $100,000 to help athletes chase their goals this year, splitting the money between those identified as potential Paris competitors. So far three Canberra athletes have officially booked their ticket to the Olympics - Michelle Heyman, Brett Robinson and Monique Suraci.\nSwim veteran Bronte Campbell was on the list after making the move to Canberra for a chance to extend her career, while young skateboarder Ethan Copeland also made the cut.\n\"With only two months to go until the Paris Olympics, it won't be long until we will be able to watch our local heroes go for gold. I know all of Canberra will get behind the team,\" Berry said.\nTOWER TO THE STADIUM\nThere are plenty of planning deals being handed from room to room at the ACT Legislative Assembly. On top of the new Manuka plan, and a $10 million detailed business case for a Bruce precinct, we've not got an agreement to work on a revamp of Telstra Tower.\nWe can help Barr and his team connect the dots on this one. How about a gondola from the top of Black Mountain down to the new stadium at Bruce (or Civic for the dreamers who still want it there)? Wouldn't need to worry about light rail when you can zip down straight from the rotating restaurant to your stadium seat.\nIf it's not part of the official plan the government and Telstra are drawing up, we don't want to know about it.\nWOMEN'S CHALLENGE CUP\nThe ACT's women's rugby competition has an answer to the Bob Hitchcock Territory Shield with a challenge cup set to be introduced in a Premier XVs clash this weekend.\nThe trophy is designed to reward home ground dominance, with the winner of Saturday's clash between the Gungahlin Eagles and Wests Lionesses at Nicholls Enclosed Oval set to keep the silverware until they are beaten at home.\nWhichever team holds the trophy at the end of the regular season will be declared the challenge cup winners for 2024 and earn their club a $500 cash prize.\nThe challenge model is based on the John I Dent Cup's Bob Hitchcock Territory Shield, which will be defended by Tuggeranong against the Queanbeyan Whites at Viking Park on Saturday.\nLOLESIO FIRMS FOR WALLABIES\nCarter Gordon who? Wallabies coach Joe Schmidt might soon be repeating the line Noah Lolesio once blurted out in the heat of battle after the Melbourne flyhalf announced a shock switch to rugby league.\nGordon has signed a two-year deal to join the Gold Coast Titans in the NRL with the Melbourne Rebels being axed from Super Rugby, leaving ACT Brumbies playmaker Lolesio in the box seat to claim the Wallabies' No.10 jersey for upcoming Tests against Wales and Georgia.\nSchmidt has already left NRL-bound flyer Mark Nawaqanitawase and England-bound Izaia Perese out of his train-on squad, suggesting players who won't be around for next year's British and Irish Lions tour won't be in the new Wallabies coach's plans.\nLolesio fell out of favour with then-Wallabies coach Eddie Jones last year, but the 24-year-old has signed a one-year extension to stay at the Brumbies and hopes to force his way back into a gold jersey.\n\"There's a new coach up in the Wallabies set-up, I've heard nothing but good things about him,\" Lolesio said.\n\"Last year with the Wallabies stuff didn't go my way, but I believe everything happens for a reason. If I did make the Wallabies last year, I probably wouldn't have gone to France and Toulon. My experience over there was awesome, it put a real perspective on footy. I've tried to take my approach in France back to here at the Brums.\"\nHave your say\n- Have you heard something and want to get in touch?\n- caden.helmers@canberratimes.com.au, Chris.dutton@canberratimes.com.au",
  "word_count": 2076,
  "scraped_at": "2026-02-14T13:04:38.153698"
}