{
  "article_id": "73e3e8910fe2",
  "url": "https://www.firstpost.com/health/use-of-white-snus-is-growing-in-sweden-uk-why-this-tobacco-free-product-is-still-risky-13876056.html",
  "title": "What is white snus ? What health risks does it pose ? – Firstpost",
  "date": "20250407T054500Z",
  "domain": "firstpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A habit that is worrying health authorities in Sweden where increasing numbers of teenagers are taking what’s known as “snus” is also concerning football authorities in England where one-fifth of professional players are regularly indulging because they say it improves their game.\nWhat is white snus?\nWhite snus consists of small, tobacco-free pouches containing nicotine, plant-based fibres and flavourings. These pouches look a like a cross between a tea bag and a tablet of chewing gum, and they’re put between the lip and the gum to give users a burst of nicotine without some of the drawbacks of tobacco. Nicotine strength varies widely between different white snus products.\nTraditional snus, a moist brown tobacco product, is almost exclusive to Sweden. However, the introduction of white snus – also known as nicotine pouches – has led to rapid global expansion.\nThe rise in popularity of white snus around the world can be attributed to aggressive social media marketing campaigns where “Zynfluencers” are sponsored to promote white snus in their lifestyle content and the product is advertised across social media. While marketing for cigarettes and vapes is strictly regulated in the EU, the rules for white snus are up to the individual countries to decide. Many countries don’t regulate white snus so consumers – even very young ones – can order the nicotine pouches easily.\nIt’s not just English male professional footballers who’re fans of white snus. In Sweden, 15 per cent of young women aged 16-29 use white snus daily, while only 2.5 per cent smoke cigarettes daily in the same age group.\nSome commercials target women by suggesting that white snus offers a discreet “clean” way to feel the benefits of a nicotine hit. They highlight that users report a rush of endorphins that can relieve stress and pain and improve mood and memory – without the smell of cigarette smoke and the inconvenience of smoking or vaping breaks.\nThe marketing of white snus often\nstresses that they are “tobacco-free” because the pouches do not contain tobacco leaf. But that label can be misleading – the nicotine in these products is usually derived from tobacco leaves.\nSome also\nconfuse tobacco-free with nicotine-free. Both these misconceptions can make consumers\nthink that the pouches are safe.\nAdvertisements often emphasise how white snus can be used anywhere and enhance social situations, while offering a variety of flavours from coffee to spearmint and black cherry, and serving as an alternative to cigarettes, vapes and traditional forms of tobacco.\nDespite their growing popularity – and marketing attempts to associate white snus with healthier nicotine use – little is known about the specific health risks of white snus. But a lack of research into the effects of nicotine pouches does not mean they are safe.\nA healthy alternative?\nThe nicotine pouch was originally developed by a nicotine replacement therapy company in the early 2000s – but they didn’t gain traction until 2016 when the tobacco snus company Swedish Match introduced their product Zyn, which became a leading nicotine pouch brand in the US. Zyn is now owned by Philip Morris International, one of the world’s largest tobacco companies White snus is not an approved nicotine replacement therapy, which means that it is not recommended as an aid to quit smoking.\nWhile nicotine-free white snus exists, most products on the market contain nicotine. Nicotine is highly addictive, so many of those who try a nicotine product – no matter which one – will find it hard to stop using it. Nicotine has several effects on the body, including increased heart rate and activation of the brain’s reward system, which contributes to its appeal.\nYoung people are especially sensitive to the addictive properties of nicotine. The wide range of white snus flavours available, often fruit, menthol or candy, may further lower the threshold for use.\nBut research suggests that nicotine may also have a negative impact on brain development. Other potential risks include a negative effects on cardiovascular and oral health. But long-term effects specific to white snus remain unclear. Few studies have been conducted, and many of the existing ones have been sponsored by the tobacco industry. There is a need for large, independent, high-quality studies to assess long-term health risks.\nWith many young people using white snus, the unanswered questions about its health effects become more pressing. Until more research is available, it’s important to stay cautious: “tobacco-free” does not mean risk free.\nAlma Larsdotter Zweygberg, Doctoral Researcher, Department of Global Public Health, Karolinska Institutet and Rosaria Galanti, Professor Emerita, Department of Global Public Health, Karolinska Institutet\nThis article is republished from The Conversation under a Creative Commons license. Read the original article.",
  "word_count": 777,
  "scraped_at": "2026-02-14T12:11:53.036555"
}