{
  "article_id": "7403a4b810aa",
  "url": "https://www.fcbarcelona.com/en/club/news/4178567/fc-barcelona-celebrates-125th-anniversary-in-style-at-the-gran-teatre-del-liceu",
  "title": "FC Barcelona celebrates 125th Anniversary in style at the Gran Teatre del Liceu",
  "date": "20241130T010000Z",
  "domain": "fcbarcelona.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FC Barcelona celebrates 125th Anniversary in style at the Gran Teatre del Liceu\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link\nIt's party-time at FC Barcelona as the club celebrates 125 years of history. Such occasions warrant big things, and the club pulled out all the stops at Friday's Anniversary Gala at the Gran Teatre del Liceu, the city's iconic opera house that dates all the way back to 1837 and wouldn't even let two fires get in the way of its survival. Today it hosted a football club that has had plenty of difficulties of its own to deal with over the years, but still keeps aiming higher and even higher.\nIn such a magnificent setting, nearly 2,000 guests, including representatives from various institutions, athletes, and famous personalities, all gathered to express their love for this unique club. They walked the red carpet, lit by dozens of camera flashes, on a night that so perfectly blended history and sporting fellowship.\nJoan Gamper remembered\nThe red carpet led the attendees to their seats, where everything was set for a spectacular show. And it certainly more than lived up to expectations! David Carabén, Commissioner of the 125th Anniversary, opened the evening with an emotional manifesto brimming with blaugrana spirit. And from the voice of the man who is also the lead singer of Mishima, the band that also provided much of the evening's music, we moved to another voice that Barça fans are more than familiar with, that of Aleix Santacana, the announcer at Spotify Camp Nou and at the Estadi Olímpic for now too. Santacana officially welcomed everyone to the gala and took them on a journey back in time to 29 November 1899, to introduce none other than Joan Gamper.\nMoving speech by Laporta\nThe club's founder took to the stage to recount how the club he founded that day went on to become More than a Club. From the creator, we moved on to the current president, Joan Laporta, who talked us through the century and a quarter of the club's remarkable history, emphasizing its multi-sport identity, commitment to Catalonia and Catalan culture, and leadership in defending rights and freedoms worldwide. His speech concluded the introductory section, before handing over to our comperes for the rest of the gala, Llorenç Tarrés and Sandra Sabatés.\nEmotion and laughter\nThe duo guided the nearly two-hour celebration, which featured surprises, historical highlights, and a blend of emotions with doses of typical culer humor. Actors Jordi Ríos and Toni Albà reprised their iconic duo that local fans will all fondly remember, their impersonations of Johan Cruyff and Carles Rexach from the TV show Crackòvia. They appeared no fewer than three times, and each time had the audience crying with laughter.\nImpersonator Pep Plaza also showcased his vast repertoire of figures like Jordi Pujol, Ferran Adrià, Matías Prats, Luis Enrique, and Joaquim Maria Puyal. It was a lighthearted way to remember some of the many people from inside and outside of the club who have each contributed in some way or other to 125 mostly wonderful years.\nMany voices\nWe then got to hear from figures like Leo Messi, who also had something to say along with other greats like Carles Puyol, Andrés Iniesta, Jordi Alba and Evaristo in a tribute video.\nNew mascot\nAnother surprise at the gala was the unveiling of the new mascot, CAT, specially created by the Grangel Brothers for the 125th anniversary. CAT stole the spotlight, and pretty much the whole show, as he leapt onto the stage to take a selfie with the president Laporta, Gavi, and Lamine Yamal, bringing even more energy to the stage. The mascot will debut at the Barça v Las Palmas match this Saturday, and we can't wait to see it again!\nWinning song\nBut there were more highlights to come, and one of the most eagerly waited moments of the evening was the announcement of the new Barça anthem. In recent weeks, members have been voting for the three finalist tunes, and the winner, with 63% of the votes, is \"L'Escut al Pit,\" a song that so brilliantly represents Barça unity and pride. We got to hear it tonight, and we'll be hearing it again during tomorrow's match against Las Palmas.\nBut Barça is not just about football, and tonight's gala also honoured legends from the club's basketball, handball, roller hockey, and futsal sections, represented by Juan Carlos Navarro, Enric Masip, Gaby Cairo and Jordi Torras, four men who between them have helped to bring a staggering amount of silverware into the club museum.\nThe decades of the Foundation\nThe event also highlighted Barça's commitment to social causes through its Foundation, which this year is celebrating 30 years of its own. Writer and director Albert Espinosa, and the director general of the Foundation, Dr Marta Segú, spoke about the charity work done since 1994, the importance of the partnership with UNICEF and how the club ended up bearing the organisation's name on its chest, and the work it does with the United Nations High Commissioner for Refugees (UNHCR). There was also a teaser for the upcoming Blaugrana Wristbands project, supported by Espinosa himself, the details of which will be announced very shortly.\nAll of the above, and such a magnificent night at the Gran Teatre del Liceu, warranted a spectacular ending. And that is precisely what we got. An exclusive screening of a film by director Leigh Powis, who has taken everything that such an iconic club as FC Barcelona has done for the world to the silver screen.\nAnd what is a party without a cake? We like a bit of sweetness too at FC Barcelona, and out came the most spectacular blaugrana cake you ever saw! And that brought an end to one of the most special evenings ever at this amazing club. It honoured its history, its amazing present, and a future that has yet to be written.\nHere's to another 125 years. May they be as brilliant as the first. None of us will be around to see all of those years, but the blaugrana spirit is sure to be burning just as brightly.\nHappy Birthday, Barça fans, wherever you are!\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link",
  "word_count": 1066,
  "scraped_at": "2026-02-14T12:52:50.229174"
}