{
  "article_id": "7409af2b8cee",
  "url": "https://www.sbs.com.au/news/podcast-episode/evening-news-bulletin-26-may-2024/kokb6aa3v",
  "title": "Evening News Bulletin 26 May 2024",
  "date": "20240526T091500Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\nTRANSCRIPT\nA magnitude 6.3 earthquake hit Pacific nation Vanuatu, but is not expected to generate a tsunami.\nThe United States Geological Survey says the earthquake [[occurred at 9:23 am local time]] struck at a depth of about 29 kilometres, centred in a patch of ocean about 83 kilometres northwest of Vanuatu's capital Port Vila.\nThere were no immediate reports of damage in Vanuatu.\nThe Pacific Tsunami Warning Centre says the earthquake is not expected to generate a tsunami.\nEarthquakes are common in Vanuatu, due to it being on a very active tectonic plate boundary known as the Pacific \"Ring of Fire\".\n[--]\nSocial Services Minister Amanda Rishworth says the federal government's sexual awareness campaign is set to clear up a lot of confusion around consent.\nThe government has announced a $40 million campaign that will be launched across all mass media platforms in an attempt to educate children and put an end to gender-based violence.\nMs Rishworth says research has shown there are still great misconceptions in the community surrounding the importance of consent.\n\"The research we conducted to inform this campaign – which involved more than 2000 people aged 10 and over – showed that people are unsure about whether consent can be withdrawn, whether it is easy to say ‘no’, whether the absence of a ‘yes’ is a lack of consent and whether asking for consent spoils the mood.\"\nThe Opposition has welcomed this move by the government, with Nationals M-P David Littleproud telling Channel Nine it should be reviewed if necessary.\n\"This is a great initiative by the government. We support it. But I think it does come down to the execution. And governments do try to get that right of all persuasions. I don't think we should cast dispersions on the government trying this. I know that they've consulted with young people. One of the young people in the design of this feels that it is touching that message and I think that's important. But we shouldn't be afraid to go back and pivot if we haven't got that message right and refine it. Money is there and we should spend it wisely.\"\n[---]\nThree bodies have pulled from the rubble left by a disastrous landslide that destroyed a remote village in Papua New Guinea.\nUnited Nations rescue teams are continuing their efforts in Kaokalam village, in the Enga Province, which was struck by the landslide early on Friday ((May 24)).\nThe UN says about 50-60 homes have been partially or completely destroyed by the landslide, with almost 4,000 people affected.\nSix people, including a child, were found with injuries and given medical assistance.\nThe search for survivors continues as the area has been declared in a state of emergency.\n[---]\nGreens leader Adam Bandt has criticised the federal government for their continued reliance on coal and gas energy.\nThe government announced last week that the Eraring Power Station, the country's largest coal-powered facility, would be receiving a two-year operation extension.\nThe federal government also recently said that gas would continue to be a part of the Australian energy grid beyond 2050.\nSpeaking to A-B-C's Insiders program, Greens leader Adam Bandt says Labor is backpedaling on its own commitments.\n\"Labor could've spent the last two years getting solar panels on people's roofs and batteries in people's homes, especially renters. Ina a way that would cut power bills and make the grid more reliable. Instead, they've spent their time opening 13 new coal and gas projects. And we're seeing increasingly here that if you have your foot on the accelerator and the break at the same time, you go nowhere.\"\n[---]\nThe Opposition has accused the federal government of overwhelming the housing system with its high migration numbers.\nThe federal government has flagged its intent to slash net migration figures to half of this year's record high 510,000 within the next couple of years.\nHowever, the Opposition says that isn't enough and claim they will go even further if they return to power.\nSpeaking to Sky News, Opposition Treasurer Angus Taylor says they will cut figures down by 37 per cent in their first year, which will be then moved up to 25 per cent later on.\nHe says the move is necessary to increase housing supply.\n\"This government has lost control of its immigration policy. We've seen extraordinary numbers coming in. They are numbers that our housing supply simply can't cope with. And we do need heavier cuts in the initial years, which is why, those numbers are what they are, and then balancing out over time to a level we think is sustainable over the longer term. And that, we think is sensible policy. That gives some time for our housing supply to catch up.\"\\\n[---]\nIn football,\nEllie Carpenter has been left disappointed in her bid to add a third Women's Champions League trophy to her collection.\nThe right-back couldn't help her team Lyon avoid a 2-0 defeat at the hands of Barcelona in the final that was held at the San Mames stadium in Spain.\nThe two goals of the encounter were scored by current and former Ballon d'Or holders Aitana Bonmati and Alexia Putellas in a game where the Catalans dominated possession.\nBarcelona have now become the second club after Lyon to win the trophy two times in a row.\nEnglish player Lucy Bronze says she is proud of her team's accomplishment.\n\"We knew that that's what we needed, to be a club that really made history. It's not easy, it's hard to win it once. But to win it back-toback, Lyon showed how difficult it is and this team's finally done that and I think we go down in history as one of the best teams in Europe.\"",
  "word_count": 971,
  "scraped_at": "2026-02-14T12:52:22.662352"
}