{
  "article_id": "740963a0386b",
  "url": "https://www.summitdaily.com/news/top-5-most-read-stories-last-week-responsibility-code-changes-postal-woes-river-compacts-hospital-reproductive-policies-and-deion-sanders/",
  "title": "Top 5 most - read stories last week : Responsibility Code changes , postal woes , river compacts , hospital reproductive policies and Deion Sanders",
  "date": "20230205T194500Z",
  "domain": "summitdaily.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Top 5 most-read stories last week: Responsibility Code changes, postal woes, river compacts, hospital reproductive policies and Deion Sanders\nEditor’s note: Stories in this list received the most page views on SummitDaily.com from Jan. 29 to Feb. 4.\n1. Head’s up Summit County skiers and snowboarders: Your responsibility code for on the mountain just got two new rules\nThe 60-year-old Your Responsibility Code for skiers and riders was expanded at the beginning of this ski season to include two new safety measures related to avoiding skiing and riding while impaired by alcohol or drugs as well as sharing contact information after a collision.\nThe Skier Responsibility Code that began in 1962, now called Your Responsibility Code, was expanded in the fall from seven to 10 points. One of the seven original measures was split into two in the update. Newly added measures nine and 10 now include: “Do not use lifts or terrain when impaired by alcohol or drugs,” and “If you are involved in a collision or incident, share your contact information with each other and a ski area employee.”\n— Steamboat Pilot & Today\n2. ‘Holding our mail hostage’: As issues with the US Postal Service persist, Summit County residents report problems accessing prescriptions and important mail\nFor years, many Summit County residents, especially those in Dillon and Silverthorne, have complained about a lack of reliable mail service from the U.S. Postal Service. Those issues became especially acute in Dillon in December, after acts of vandalism led the post office to restricted access to P.O. boxes, which had previously been open 24/7.\nFor many, waiting an extra couple of days or weeks for holiday letters or in a long line for packages may have caused some annoyance, but for those who rely on the Postal Service for prescriptions or important documents, the situation has had serious consequences.\nSilverthorne resident, Ernest Frey said he has USPS Informed Delivery — a free service that emails users preview images of incoming mail. As of Jan. 1, he said that service showed 53 incoming items, of which he has received only 21. Still out there, undelivered, are tax statements, his property tax notice from the county, medical notices, medicare documents, health insurance papers and more, he said.\n3. New Colorado River agreement will have headwaters impacts in Eagle County\nA century-old agreement to divide the Colorado River’s water is no longer sufficient to govern the river’s use. After years of work to divide up a diminishing resource, officials Monday announced that six of the seven states governed by the compact had created a model for the U.S. Bureau of Reclamation to possibly incorporate into its own management plan.\nSix of the seven signatory states to the compact — Colorado, Wyoming, Utah, New Mexico, Arizona and Nevada — signed the new agreement. The only non-participant is California.\nThe Northwest Colorado Council of Governments is made up of virtually all the counties in the river’s headwaters. Council Director Jon Stavney said the compact, completed in 1922, was good in theory, but the amount of water divided up in that compact was based on river flows from the 10 wettest years on record. That doesn’t work in a region plagued by a drought that is now more than two decades old.\nThat’s been reflected in the continual emptying of Lake Powell in Utah and Lake Mead in Nevada.\n— Vail Daily\n4. Another Colorado hospital stops letting women get their tubes tied, renewing questions about reproductive rights\nWhen the only hospital in Durango with a maternity ward decided that it would no longer let women get their tubes tied, there was no public announcement.\nMercy Hospital’s website doesn’t spell it out, either.\nInstead, a read-between-the-lines statement added to the Centura Health hospital’s website in September noted that Mercy is “responsible for conducting itself in a manner consistent with the ethical principles of the Catholic church ministry.” The hospital had recently completed a “reeducation” of hospital staff and board members regarding the church’s ethical and religious directives, it said, adding that “patients are fully informed of all treatment options.”\nDoctors who deliver babies at Mercy said they were told that beginning April 15, they can no longer provide post-cesarean-section tubal ligations, a sterilization procedure in which the fallopian tubes are cut. Women who have decided not to have more children often have their tubes tied immediately after a C-section, when they are already under spinal anesthesia, sparing them from having to schedule a separate surgery.\n— The Colorado Sun\n5. Deion ‘Coach Prime’ Sanders, head football coach for the University of Colorado Boulder, calls trip to Vail a life-changing experience\nCoach Prime caught Vail in the prime of the winter season, and he appears to have left town transformed by its magic.\nIn a social media post, Sanders said his recent visit to Vail with Tracey Edmonds was “unbelievable.”\n“Vail, Colorado, changed my life, I’ll never be the same,” Sanders said.\nSage Outdoor Adventures says their “silent treatment” snowmobiling tour is exactly what they recommend for someone who is visiting from the city and has a stressful job, like the head football coach for the University of Colorado, Boulder, for example.\n“On tours, we try to take 2 minutes to just appreciate the silence,” said Brit Goldman with Sage Outdoor Adventures. “It’s so silent and tranquil, and the peace and rejuvenation that comes from even just 2 minutes of silence can be very grounding.”\n— Vail Daily\nSupport Local Journalism\nSupport Local Journalism\nAs a Summit Daily News reader, you make our work possible.\nSummit Daily is embarking on a multiyear project to digitize its archives going back to 1989 and make them available to the public in partnership with the Colorado Historic Newspapers Collection. The full project is expected to cost about $165,000. All donations made in 2023 will go directly toward this project.\nEvery contribution, no matter the size, will make a difference.",
  "word_count": 989,
  "scraped_at": "2026-02-14T13:34:29.093709"
}