{
  "article_id": "7418a7afbc9a",
  "url": "https://www.rockmnation.com/2024/12/29/24323748/rock-m-digest-vol-2-issue-16-best-of-edition",
  "title": "Missouri Tigers Rock M Digest : Vol . 2 , Issue 16",
  "date": "20241229T114500Z",
  "domain": "rockmnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome to Rock M Digest, a weekly column where I, Madame Editor, typically share with you my must-read picks for the Rock M Nation content of the week. But not this time, dear readers! This week, as its the end of 2024, is writer’s choice! That means, I’ve tasked our staff to select their favorites from the academic year 2024-25 thus far (you’ll see that a few missed this directive, but ¯_(ツ)_/¯ ). Some have shared their reasoning for selecting said article and some have shared a paragraph or quote they liked most. If they have included this info, I have also included it.\nRock M Digest: Vol. 2, Issue 16 (BEST OF EDITION)\nBecause the end of 2024 is upon us, I had our writers select their best stories for this special year-end edition.\nBecause our photo staff is equally awesome, I’ve asked them for their 10 favorite shots as well for the Hot Shots section.\nLet’s get started, and HAPPY NEW YEAR! May 2025 bring just as many incredible stories from the crew at Rock M Nation.\nRock M Recs\nMalnati’s underdog story is another example of why sports equals the best.\nBy Chad Moller | Published March 25\nThe Tigers have excelled at forcing turnovers and blocking shots, but not without painful tradeoffs. At first glance, this offseason’s overhaul might strike a balance.\nBy Matthew Harris | Published July 11\nIs this the end of Olympic sports as we know it? LA 2028 could look much different for the USA.\nBy Karen Steger | Published August 11\nFormer Big 12 Commissioner Bob Bowlsby said during a panel discussion hosted by the Iowa City Area Sports Commission, “First, you will see the decline of the men’s Olympic sports along funding lines. And then eventually — once the men’s side is cleared out and we have 12 sports on the women’s side and four sports on the men’s side — you’ll see the decline of women’s Olympic sports, too.” [stops to take deep breaths]\nWhat happens if there’s no gymnastics pipeline? No wrestling? No volleyball? No swimming & diving? This would have a massive impact on the United States’ Olympic performance, which is something that this country cares deeply about. What if a country that cares so much about being “the best” suddenly can’t claim that on the athletic field?\nThe Tigers rolled to a comfortable victory behind tough football from Brady Cook and Corey Batoon’s defense\nBy Adeen Rao | Published September 7\nCook showed that the kitchen was somewhat cleaner this week in the air coupled with two touchdowns on the ground, headlined by a rumbling 31-yard run where he flipped (literally) into the endzone.\nA story about soccer, family and burritos\nBy Dylan Heinrich | Published September 12\nIt was a dream start in Durham as Golan was WAY ahead of schedule, earning starts early into her freshman season. I’d like to credit her complete and balanced diet filled with a Durham special: the Cosmic Cantina burritos.\nBack in ye olden days of the late 90s, not all athletes were roomed together in the same dorm and didn’t have their own dining halls. So when Golan was situated on the COMPLETE opposite side from the eateries, she had to get creative. One of the places near Golan was the Cosmic Cantina. The Cantina is a hole-in-the-wall restaurant with their menu written in chalk, plus some of the steepest stairs around. Yet it is a college student’s best dream, with its late hours and cheap prices. Plus, they claim to have the best burritos in the world; Golan agrees.\nAnd BOY was this a clunker.\nBy Nate Edwards | Published September 24\nNate says he selected this story because his assessment of the Vandy game had some forward-thinking observations.\nThe streak of Homecoming wins dating back to 2016 was kept alive by a cold-blooded comeback from Eli Drinkwitz’s crew.\nBy Quentin Corpuel | Published October 19\nThe 78-yard completion — most of which came after the catch — reignited a home crowd whose volume rivaled a library for most of Saturday afternoon. Brady Cook had just re-entered the game after an ankle injury sidelined him for most of it, and his throw to Cooper at the end of the third quarter proved to be the spark that fueled an epic 21-17 comeback victory on Homecoming.\nSome notes, thoughts, and observations from the other side of the country, as Brady Cook breaks the collective hearts of another SEC fanbase.\nBy Dan Keegan | Published October 21\nThis game was not a lightning clap of disaster and pain like some Mizzou losses – this was not Tyus Edney, or Matt Davison, or a bizarre roughing the punter against Kentucky. This was a slow burn, a drawn-out feeling of dismay, like the Connor Shaw game, or the Kyle O’Quinn game, or the Sean Chambers game, or the Tre Mason game...\nBut on Saturday, this story had a different ending. Brady Cook returned under the most improbable circumstances, shrugging off a mid-game trip to the hospital, to lead two scoring drives and a season-saving comeback on homecoming. If Disney made this movie, it would be considered too happy of an ending.\nDo you know what doctors put in Brady Cook’s ankle? Neither do we, but it’s gotta be the good stuff.\nBy Josh Matejka | Published October 22\nYou’re cruising along, nice and easy, getting ready to make some waves in your mediocre season when BAM a big white boy barrels into the picture to mess up your shit.\nRegardless of the stakes in Week 11, this game has always been the highlight of Mizzou’s schedule.\nBy Nathan Hurst | Published November 6\nAfter a year of extensive travel and personal reflection, Helen Hu is back with nothing left to prove... Though she’d really love that 10.\nBy Karen Steger | Published November 6\n“Surfing was so hard. I went in thinking, you know, I’m an athlete. I can do this; it’ll be easy. You know, give me a week. I’ll figure this out. And for four straight weeks, I was just face planting into the water, getting absolutely wrecked by these waves. And it was really humbling. I was like, ‘Okay, wow, you still suck at a lot of things, Helen, you have a lot to learn in this world.’ And it was really such a challenge.” — Hu on the challenges of learning to surf\nWhat a nutso game.\nBy Nate Edwards | Published November 9 (written in a manic state, per the author)\nThere are many lessons to be learned from watching the best of the best compete.\nBy Abigail Klapatauskas | Published November 24\nMissouri finished the regular season with a record of 9-3 after a 28-21 win over Arkansas. Let’s get to some takeaways.\nBy Sammy Stava | Published November 30\nThis is the team’s first Sweet Sixteen appearance since 2017\nBy Matthew Gustafson | Published December 6\nThe Tigers just finished a “mini SEC’s” in Georgia and have great strides to make before the end of the season, but there’s also lots to be proud of.\nBy Rory Whetstone | Published December 7\nDestiny is calling me, open up your eager eyes, cause I’m Mr. Brightside.\nBy Sam Snelling | Published December 9 (selected by me)\nI know this is a statistical analysis post. I’m a fan of analytics, quite obviously. But I don’t watch sports, and in particular, basketball, because of the numbers. I love this game. Numbers can tell part of the story, but they don’t account for Tamar Bates, Mark Mitchell, and Aidan Shaw being KCK kids facing off against their actual home state school. They don’t account for 15,000 people screaming their heads off when a skinny kid from Florida tips a pass into the air and ends up hanging on the rim after finishing a dunk. There’s no statistic for watching Dennis Gates call a timeout so Kansas players could exit safely knowing the court was about to be stormed.\nQuotables\nIf if ain’t broke, don’t fix it. These were some of my favorite quotables from the past 15 issues of Rock M Digest, which kicked off its second volume in early September. As always, the stories are linked.\n“The unusual part was that it only took them 319 seconds of game time to score 21. In over 120 years of football, Mizzou had never scored 21 points that fast.” —Quentin Corpuel, E-Race-d: Mizzou Bulldozes Murray State\n“Again, Missouri had total domination of almost every facet of the game you could think of, including “The Little Things”. Congratulations on winning net kickoff yards, Buffalo. What did it get you? Nothing. NOTHING.” —Nate Edwards, Beyond the Box Score: Boring is Good\n“It’s appropriate that Mizzou’s goodbye message to Burden on social media was captioned, “We called and you answered... every time.” That’s who Luther Burden III was; he was the guy who delivered when you needed him, and also when you really needed him.” —Josh Matejka, Luther Burden III was everything Mizzou needed him to be\n“Twas the night-ish before the Gans Creek Classic, and all throughout the Tigers’ course at home, Not a person was striding, except me, taking notes for this poem. At their last race, Missouri’s returners helped the men’s team take bronze at Penn State, While Rahel Broemmel paced the women again, toward a 21st finish and a seventh place team fate.” —Abigail Klapatauskas, Missouri XC Gans Creek Classic: A poetic preview\n“But the story of this match was Marina Crownover, Mizzou’s starting setter, who is an Austin native and transferred in from Texas this offseason. She recorded 51 assists and 10 digs for a double-double alongside two aces and two blocks. The stat which sticks out for Crownover, though, is kills. She finished with six kills, a career high, hitting .857 on her seven attempts.” —Matthew Gustafson, Mizzou Volleyball takes down defending champs Texas in Austin\n“The 21st night of September was one of those games, but it was far from the peachiness of the Earth, Wind and Fire song. The clouds couldn’t be chased away. The souls that were singing sent more jeers than cheers. The stars did not steal the night; instead, Mizzou stole a victory that’d been exchanged like holiday presents all game.” —Quentin Corpuel, When Goliath Survives David\n“It was a good ol’ fashioned whompin’. Like a molasses leak consuming a town. A whale devouring thousands of lifeforms by simply swimming with its mouth open. A supermassive black hole devouring a star. It ain’t fast and it ain’t pretty but it is inevitable. And it was very funny to watch Bulldog defenders be incapable of doing anything about it.” —Nate Edwards, Beyond the Box Score: Whompin’ MS State\n“Call me a romantic, but I just don’t see how Brady Cook could possibly lose his last game on Faurot Field. Mizzou means too much to him, and vice-versa.” —Chad Moller, Pregamin’ Arkansas\n“Abbey Schreacke has opened up her sophomore campaign on fire, averaging 12.2 points on 48.7% from three, punishing teams from beyond the arc. She’s coming off a career-high 26 points and 8-made threes during the team’s last win against Western Illinois. I’ve started referring to Schreacke as Mizzou’s Klay Thompson; her main success is off-the-ball as a catch-and-shoot weapon that keeps the defense honest and prevent doubles. Throwing her out there with Slaughter to start the game keeps defenses honest and gives two real three-point threats for Pingeton’s squad. If the decision were mine, Abbey Schreacke would be starting by Wednesday.” —Dylan Heinrich, Hoopin’ & Hollerin: SLU & Arkansas-Little Rock Edition\n“I’ve spent the last few years during the renewal of this series doing everything I can to explain to our readership that I do not like kU, and their head coach is perhaps the person in college sports I like the least. As much as Eric Musselman made a run at taking the title, him backstabbing his way off to USC was enough to avoid overtaking Bill Self in the way that he’s now out of sight, out of mind.” —Sam Snelling, Non-Con Preview: kansas jayhawks (FKU)\n“When Mychael came in over the summer, we were like, ‘Whoa, she’s nasty, doing some great things,” Colleen Finney said. —Matthew Gustafson, Mizzou Volleyball exhibition recap (Editor’s note: How true we would find this statement to be is amazing)\n“As far as what went wrong in the first half goes, that piece could be 2000 words or higher if need be. The real pressing question is just how detrimental a half like that can be to a team’s odds to win a game. While the saying “it isn’t over till the clock hits zeroes” is prevalent in the sport, it’s hard to hold true in a half like the one seen on Saturday. This season, teams down 24 or more after the half are winless.” —Adeen Rao, Texas A&M sidebar\n“Best Prospective NIL Deal— Forget Sugarfire. Forget Imo’s. The National Department of Health and Human Services needs Brady Cook to endorse whatever medicine it is they shot him up with. “Hi I’m Brady Cook, Mizzou Football starting quarterback. Have you ever been in a bad accident at work? In your car? Working around the house? Try [censored medicine] for fast-acting relief, a mild sense of euphoria, and the temporary power of the Grecian Titans.” —Josh Matejka, The Revue: Auburn\n“Visions of dancing joyously into the 12-playoff at 10-2 or 11-1 have gone up in flames. The warning signs from weeks 3 and 4 are now full-blown emergencies, and the Tigers will have to rally to meet their goals... It was a complete and total system failure. The preparation was poor, despite a bye week, as shown by Texas A&M’s ruthless execution on offense. The team’s motivation and mindset were lacking, evidenced by a few humiliating moments. Execution was completely missing; not one unit of the team had a good day (except for punting).” —Dan Keegan, A Fan’s Notes: It’s Now or Never\n“Helllllllllo, Mizzou viral floor routine. Last season, it was Kennedy Griffin with her Destiny’s Child mash-up that wowed audiences and caused quite the stir amongst the gymternet, but she’s got competition this year because fellow sophomore Hannah Horton and the King of Pop himself, Michael Jackson, would like a word.” —Karen Steger, New look Tigers read to make some noise in the SEC, nationally\n“A standard isn’t something that can be held. But like air, its presence is boundless. It extends beyond the walls of its genesis and affects everyone both inside and outside of the workplace. Many of the players who helped set that tone aren’t with Mizzou anymore, but their efforts have been seared into the program.” —Quentin Corpuel, Anticipation aplenty, Mizzou football enters 2024 season built on positive culture\n“I remember watching the game in a variety of postures — standing, kneeling, sitting cross-legged, laying face down with my head in my hands. The only logical reason I can muster for this eccentric behavior is that my brain was in fight-or-flight mode. I can’t really think of another reason why I was having such an outwardly bizarre response to what was likely the worst football game I’ve ever seen.” —Josh Matejka, The Revue: Vanderbilt (side note: if you don’t read the captions of the Disrespectful Play Index, you are TRULY missing out)\nHot Shots\nI asked Cal & Mike, our resident photogs, to share with the audience their five to ten best photos of the year thus far. ENJOY.\nListen Up!\nHere’s some faves from the year thus far from your favorite podcasters. Some were selected by me, some by the podcasters themselves. Enjoy.\nBeyond the Box Score\nA game that will go down in Mizzou history was just witnessed by us all. Brady Cook goes down early in the first quarter, visits a hospital, checks out, warms up, and rises Missouri’s offense from the dead to come back and beat Auburn after an historic fourth quarter 11-point deficit. Listen to what Nate and Nathan had to say about the incredible victory for your Mizzou Tigers. (I called this one the single greatest episode of BTBS and really, any podcast we’ve ever released) [warning: explicit content]\nNate and Nathan recap the INCREDIBLE win over Oklahoma. An inspiring performance from Drew Pyne. A thrashing game from the defense. And so much more. Join us as we relive one of the most memorable Mizzou games ever.\nDive Cuts\nSam brings in Mizzou Basketball Assistant Coach, Matt Cline, to talk about how the Tigers use analytics to improve as well as discuss the current roster.\nOver the Net\nIn this episode, Matthew brings on Mizzou Setter, Marina Crownover. Marina discusses her decision and experience transferring from Texas to Missouri and how it’s been going for her. Matthew and Marina also have a conversation about Mizzou’s season and their current, 2nd place SEC standing.\nMajority Rules\nIn Episode Seven of MY podcast, we’re talking soccer senior night, their big Florida win, volleyball’s one good (LSU) and one disappointing (A&M) game, softball’s big Fall Ball opener win, women’s hoops exhibitions, golf’s promising performance at the Blessings Invitational, baseball needs better communication regarding fall ball, gymnastics oath keeping, men’s cross country dominance and fan journalism (fanalism). This was a fun one with everyone here together.\nIn this extra special edition of Majority Rules, Karen and guest Maneater Gymnastics writer Nate Salsman break down the massive Mizzou Gym news that Helen Hu is returning for the 2024-25 season. They chat about how they came to know this info before everyone else and the gymternet reaction at large before getting into what it means and looking at beam & bars lineup iterations. It’s a Mizzou Gym fan’s paradise, and they can’t wait to see this team in action.\nThe Verdict\nMatt Watkins’ favorite episode of The Verdict was free and glorious, breaking down Mizzou’s win over kU on 12/8/24, a day which shall live in infamy.\nRock M Radio Special Episode\nLevi chatted with former Mizzou Athletics creative, Robert Trombley, who created the incredible Mizzou mini movies that dazzled us all last season, in a special Rock M Radio episode.\nMizzou Sports this Week:\n- Sun, Dec. 29: WBB vs. Jackson State, 2pm\n- Mon, Dec. 30: Music City Bowl vs. Iowa, 2:30pm | MBB vs. AL State, 6:30pm\n- Thur, Jan 2: WBB vs. South Carolina, 6pm (SEC Opener)\n- Fri, Jan. 3: Beauty & the Beast (WR/GYM), 6pm | S&D vs. Louisville, 11am\n- Sat, Jan. 4: MBB AT Auburn, 3pm\n- Sun, Jan. 5: WBB AT Alabama, 2pm",
  "word_count": 3105,
  "scraped_at": "2026-02-14T13:42:04.605415"
}