{
  "article_id": "7465ca620cc4",
  "url": "https://www.theguardian.com/tv-and-radio/2023/dec/05/tv-tonight-the-violent-gangs-stealing-watches-from-people-on-the-street",
  "title": "TV tonight : the violent gangs stealing watches from people on the street",
  "date": "20231205T073000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hunting the Rolex Rippers\n9pm, BBC Three\nJournalist Tir Dhondy is fearless in this disturbing investigation as she sits down to quiz a masked gang leader who has a machete in the back of his car. He and his fellow gang members talk to her about their crimes – violently stealing expensive watches from people on the street. (“This game has no rules,” one replies when she asks whether he targets grandmas.) Hollie Richardson\nSecrets of the Aquarium\n8pm, BBC Two\nIt’s feeding time for the rays in this week’s visit to the aquarium, which is fascinating to watch, especially when they shoot spouts of water at the very people who feed them. Then Jill the 86-year-old “ray whisperer” – who doesn’t get water to the face – is called in by the CEO. HR\nLouis Theroux Interviews\n9pm, BBC Two\nTheroux interviews the most famous military whistleblower in US history, Chelsea Manning. “I’ve got a high tolerance for awkwardness, but yours is off the charts,” he comments (things get particularly bristly when Julian Assange is mentioned). But she does open up about her upbringing, WikiLeaks and life after prison. HR\nWonderland: Gothic\n9pm, Sky Arts\nAnd the most niche TV show of the year award goes to … This week’s profile of classic gothic stories looks at the concept of the “gothic outsider”, by poring over The Girl With the Dragon Tattoo and Stephen King’s novels. The movies of Tim Burton, Guillermo del Toro and George A Romero also come under the microscope. Will it prompt fevered watercooler debate? Possibly not. Graeme Virtue\nBerlin 1933\n9.05pm, BBC Four\n“Where will it end?” This sobering documentary series, imported from Germany, tracks the year everything changed in Berlin. Episode two picks up in March as Hitler prepares to circumvent the constitution while continuing to purge political dissenters and foment anti-Jewish sentiment. GV\nKin\n10.40pm, BBC One\nThe Irish gangster saga continues, with Eric in his prison cell like a caged wild animal. Frank (Aidan Gillen) and Jimmy (Emmett J Scanlan) hope to persuade Bren (Francis Magee) to look out for his wayward jailed nephew, but Bren doesn’t seem the caring type. Meanwhile Amanda is going rogue, in more ways than one. Ellen E Jones\nFilm choice\nShaun of the Dead (Edgar Wright, 2004), 6.05pm, Sky Cinema Greats\nWith Hot Fuzz and The World’s End to follow, here’s a chance to catch all of the Cornetto trilogy. The first of director Edgar Wright’s big-screen threesome starring Simon Pegg and Nick Frost is the best, a zombie spoof set in suburban London that expands on the movie nerd angle of their TV comedy Spaced. Bored – and boring – mates Shaun (Pegg) and Ed (Frost) find hidden depths when the undead invade their semi-detached existence. Naturally, it all ends up in the pub. Simon Wardell\nJust Mercy (Destin Daniel Cretton, 2020), 9.30pm, BBC Three\nThe racial inequities embedded in the US justice system are shown in stark relief in Destin Daniel Cretton’s enraging, fact-based legal drama. Michael B Jordan is the film’s moral centre as Harvard-educated lawyer Bryan Stevenson, whose youthful ideals are tested in the case of Walter McMillian (Jamie Foxx), a Black forester in Alabama falsely sentenced to death for the murder of an 18-year-old white girl. Police intimidation, witness lies and deep-seated bigotry play their part in his campaign’s advances and setbacks, while adding up to a convincing case against capital punishment. SW\nThe Wicker Man (Robin Hardy, 1973), 10pm, BBC Four\nFifty years ago this month, Robin Hardy’s soon-to-be-cult movie was released as the B-picture on a double bill with Don’t Look Now. It has taken decades for it to be recognised as the equal of Nicolas Roeg’s masterpiece, but there’s no doubt now about its status as the pinnacle of British folk horror. It’s a chilling, sensual clash between Christian and pagan values on a Hebridean island, personified on the one hand in Edward Woodward’s policeman – there to investigate a young girl’s disappearance – and on the other by Christopher Lee’s lord of the isle, where daylight offers no respite from the darkness. SW\nLive sport\nWomen’s International football: Scotland v England 7.30pm, BBC One. Rachel Corsie captains the home side at Hampden Park in the final match in Group A1 of the Uefa Nations League.\nPremier League football: Wolves v Burnley 7.30pm, Prime Video. Luton v Arsenal is at 8.15pm. The rest of the top-flight games are on from 7.30pm on Wednesday and Thursday.",
  "word_count": 748,
  "scraped_at": "2026-02-14T12:56:48.315987"
}