{
  "article_id": "7475fb00ad04",
  "url": "https://www.thenationalnews.com/magazine/2025/09/19/taylor-swift-youssef-chahine-la-mamounia-flow-japanese-funk-pop/",
  "title": "From Taylor Swift vinyl to Youssef Chahine classic on DVD , our pick of physical collectibles in September",
  "date": "20250919T124500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In a culture increasingly defined by streams and scrolls, there’s a quiet pleasure in returning to objects you can hold, display, and revisit at will. Physical media carries with it not just the work itself, but the care of curation, design and permanence.\nFor this selection, The National's team have chosen items that remind us why collecting still matters. There’s the grandeur of La Mamounia Marrakesh, a richly photographed tribute to one of the world’s most storied hotels, the surreal tenderness of Oscar-winning animated feature Flow, arriving on DVD in Criterion’s meticulous packaging, and the fevered anticipation of Taylor Swift’s 12th album, released across formats destined to be treasured as much as listened to.\nAdd to that a taut new sci-fi novel, the breezy optimism of a Japanese city pop reissue and the restoration of Youssef Chahine’s Cairo Station, a cornerstone of Arab cinema, and what emerges is a cabinet of cultural curiosities.\nLa Mamounia Marrakesh by Laurence Benaim (Assouline)\n“La Mamounia is the perfect blend of sunshine, kindness, good taste and calm,” the late French singer-songwriter Charles Aznavour once said. Since opening in 1923, the famed Marrakech hotel has hosted royalty, presidents and celebrities such as Juliette Binoche to Salma Hayek and Jennifer Aniston, and has often been named among the world’s most beautiful hotels.\nLuxury publisher Assouline is now releasing a book in homage to its history “and its relationship to artisans and artists”. The title has been authored by French journalist and writer Laurence Benaim, whose work includes a biography of Yves Saint Laurent. Named for its gardens, once the site of lavish 18th-century parties thrown by Prince Mamoun, the hotel remains both a cultural landmark and a tourist draw. The book features evocative new photography alongside rare archival images, including a 1935 portrait of Winston Churchill painting in the gardens. “I must be with you when you see the sunset on the snows of the Atlas Mountains,” Churchill famously told Franklin Roosevelt after the Casablanca Conference in 1943 – words that naturally led them both to La Mamounia.\nDavid Tusing, assistant features editor\nFlow (The Criterion Collection)\nOscar-winning film Flow is coming to DVD on September 23. Told entirely without dialogue, it explores friendship and survival through the journey of a courageous black cat, whose home is swept away by a great flood. As the cat joins forces with a capybara, a lemur, a bird and a dog aboard a makeshift boat, the unlikely crew need to rely on trust, courage and quick thinking to navigate a water-covered world and search for dry land. The animated feature made history at the 97th Academy Awards, becoming the first film from Latvia to win an Oscar. I originally watched Flow on a flight, and was struck by the beauty of both the story and the animation. I imagine viewing it again on a larger screen in 4K will only enhance the experience.\nEvelyn Lau, assistant features editor\nThe Life of a Showgirl by Taylor Swift (Republic Records)\nWhat’s that sound? A new era, of course, as Taylor Swift returns with her 12th album. As an unapologetic Swiftie, I was preordering the moment it was announced on August 12 – limited-edition CD (despite not owning a player) and vinyl included. Swift has gone all out this time. There’s the Tiny Bubble in Champagne collection, Baby, That’s Show Business collection and the Shiny Bug collection – each comprising two LPs, already sold out. Add to that the It’s Beautiful, It’s Rapturous, and It’s Frightening CD releases, plus the standard LP, CD and cassette. The vinyl and cassette come in “sweat and vanilla perfume Portofino orange vinyl”. My own stash – a standard LP and the It’s Rapturous CD. So, come October 3, I’ll be dissecting its 12 tracks – already hailed as “unbelievable” by Swift’s new fiance Travis Kelce, with the promise: “This album is going to make you dance”.\nFarah Andrews, head of features\nExiles by Mason Coile (GP Putnam’s Sons)\nThere’s something unnervingly familiar about the terror in Mason Coile’s Exiles. The book is set on Mars, but it might as well be an attic, a cellar or a locked hotel room. A place where the air feels wrong and the silence watches you back. The premise is elegantly simple – a crew of astronauts arrives to establish the first human colony, only to find their outpost half-destroyed and the robots sent to prepare it behaving like wayward children who have read too much philosophy. They have taken names, forged alliances and cultivated beliefs. One has disappeared altogether. What unfolds is less a whodunit than an act of collective interrogation – of the machines, of the landscape, of themselves. Coile, whose earlier noir novel William became a word-of-mouth cult hit, once again uses the scaffolding of science fiction to stage a psychological horror. In the thin air of Mars, even machines develop nightmares; but it is the astronauts’ own stories that prove most disturbing. Taut and propulsive, Exiles reminds us that the greatest alien environment isn’t a barren planet, but the recesses of our own minds.\nNasri Atallah, editor, TN Magazine\nJunk Scape by Junk Fujiyama (Lawson Entertainment)\nOn my travels to Japan, I’ve often lingered in shops, half-listening to the music drifting from the speakers. Once, a song caught me so strongly, I pulled out my phone to identify it. It was Ano Sora no Mukougawa e, the opening track of Japanese city pop artist Junk Fujiyama’s 2013 album Junk Scape. I’d long been a fan of city pop, especially from its 1980s and 1990s heyday, but Fujiyama’s music felt different – bright, hopeful and effortlessly uplifting. Even though I did not understand the lyrics, his melodies and voice carried the feeling across. Junk Scape is being re-released on vinyl on September 5, complete with a striking cover of a seaside pool framed by palm trees – a perfect visual echo of the album’s breezy, sun-lit sound.\nFaisal Al Zaabi, gaming journalist\nCairo Station by Youssef Chahine (The Criterion Collection)\nAsk anyone – myself included – what’s the first film you should watch from the golden age of Egyptian cinema, and they will invariably answer Youssef Chahine’s masterpiece Cairo Station. And don’t fear – this isn’t some lugubrious, laborious epic. In fact, it’s a surprisingly racy neorealist melodrama that is still as entertaining as it was in 1958, if not more so. Starring Chahine as a disabled newspaper hawker who becomes obsessed with a drink seller (Hind Rostom), this window into another era is unforgettable, restored to its former glory in ultra-high definition along with the director’s 1991 documentary, Cairo as Seen by Chahine.\nWilliam Mullally, arts editor",
  "word_count": 1111,
  "scraped_at": "2026-02-14T12:12:08.512895"
}