{
  "article_id": "747ab786ba67",
  "url": "https://english.news.cn/20241231/ccbbee9ec7f2466e817d3bfb132da5fd/c.html",
  "title": "Duplantis , Biles named AIPS Athletes of the Year - Xinhua",
  "date": "20241231T034500Z",
  "domain": "english.news.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LAUSANNE, Dec. 30 (Xinhua) -- The International Sports Press Association (AIPS) on Monday announced that American gymnast Simone Biles and Swedish pole vaulter Armand Duplantis are the AIPS Athletes of the Year 2024, as voted by 518 journalists from 111 countries and regions.\nBiles, who won three Olympic gold medals and one silver at Paris 2024, garnered 703 points to win the Best Female Athlete of the Year award for the fifth time, ahead of Spain and Barcelona footballer Aitana Bonmati, who was recently named the Best FIFA Women's Player for a second consecutive year. Julien Alfred of Saint Lucia, the nation's first-ever Olympic gold medalist in the 100m and silver medalist in the 200m, rounded out the top three with 263 points.\nDuplantis dominated the Best Male Athlete of the Year category with 603 points. The Swede, who had finished second in the 2022 and 2023 editions of the AIPS poll, finally secured the top prize for the first time. Serbian tennis icon Novak Djokovic, who at 37 became the oldest Olympic gold medalist in men's singles and just the fifth tennis player to achieve a career Golden Slam, finished second with 368 points, while Slovenia's Tadej Pogacar, who became the first male cyclist since 1987 to win the 'Triple Crown' of the men's Tour de France, Giro d'Italia and world title in the same year, finished third.\nHaving defended its Copa America title, Argentina's men's football team was voted the AIPS Best Team of the Year 2024, while the Paris 2024 Olympic Games scooped the AIPS Best Press Facilities award. ■",
  "word_count": 263,
  "scraped_at": "2026-02-14T12:53:24.293382"
}