{
  "article_id": "748cdba596c8",
  "url": "https://kowb1290.com/ixp/1004/p/breaking-wyoming-toledo-to-meet-in-2023-arizona-bowl/",
  "title": "BREAKING : Wyoming , Toledo to Meet in 2023 Arizona Bowl",
  "date": "20231204T170000Z",
  "domain": "kowb1290.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "BREAKING: Wyoming, Toledo to Meet in 2023 Arizona Bowl\nLARAMIE -- Snowbirds, rejoice.\nWyoming is heading back to the desert, accepting its second straight bid to the Barstool Sports Arizona Bowl in Tucson. The Cowboys will take on the Toledo Rockets Saturday Dec. 30 inside Arizona Stadium. Kickoff is scheduled for 2:30 p.m. Mountain Time.\nThe game will be televised on The CW Network.\nThis will be the Cowboys’ 19th postseason appearance and the sixth in the Craig Bohl era. Wyoming is 9-9 all-time in bowl games and won three straight before falling in overtime to Ohio 30-27 in last December’s Arizona Bowl.\nThis will be the program's fifth bowl game in Tucson.\nWyoming (8-4, 5-3) fell in the Copper Bowl back in 1990 and '93, and knocked off Georgia State, 38-17, in 2019.\nMORE UW FOOTBALL NEWS VIA 7220SPORTS:\n* Mountain West announces scheduling agreement with OSU, Wazzu\n* Hey, Mountain West, you missed a few Cowboy football players\n* Four Cowboys named to Mountain West's 25th season football team\n* Wyoming Cowboys in the NFL: Week 12\n* Wyoming Cowboys Football: 2023 Season in Photos\n* Crum, Gibbs Land All-Mountain West First Team Honors\n* UW safety Wyett Ekeler named Mountain West Defensive Player of the Week\n* Wyoming's Kolbey Taylor Tweets Monday: 'Recruitment Open'\nToledo enters this one 11-2 overall and fresh off a 23-14 upset loss to Miami (Ohio) in the Mid-American Conference Championship game. Its only other loss came in the season opener at Illinois. That was a 30-28 setback. The Rockets, led by eighth year head coach Jason Candle, reeled off 11 straight wins.\nThis is the 21st postseason appearance for Toledo. The program is 11-9 overall in the postseason and knocked off Liberty 21-19 in last season's Boca Raton Bowl.\nThese teams have met only twice, the latest coming back in 2012 when the Rockets knocked off the Pokes 34-31 in Laramie. Two years prior, Dave Christensen's team pulled off a 20-15 victory inside the Glass Bowl.\n“Both the Toledo and Wyoming football programs are known to be fan-fueled, and we look forward to welcoming their alumni and broad fan bases to Tucson with our signature Sonoran warmth and hospitality,” Barstool Sports Arizona Bowl Executive Director Kym Adair said in a release. “When coupled with the Southern Arizona community’s strong support of our game and associated bowl events, this promises to be an epic showdown in the desert on December 30.”\nBARSTOOL SPORTS ARIZONA BOWL EVENTS:\nRockets and Cowboys fans will have the opportunity to experience Tucson’s hospitality beginning on Dec. 29 at 5:00 pm MST at the Downtown Pep Rally at 5th and Toole Avenues. The event will feature both football programs’ bands, cheerleaders, and mascots in a friendly rivalry.\nOn Dec. 30, the gameday schedule starts at 10:00 am MST on the University of Arizona Mall with the Barstool Sports Tailgate Festival. The event will include food and beer vendors, a dynamic car show, cornhole, alumni parties, a stage with DJ entertainment, a Battle of the Bands competition between both teams’ marching bands, and a live broadcast of the “Barstool College Football Show.”\nThe Heroes Tribute Pre-Game Show inside Arizona Stadium will commence at 2:00 pm MST as A-10 jets from Davis Monthan Air Force Base fly overhead and the legendary Wings of Blue skydivers descend into Arizona Stadium to honor the men and women who serve on our behalf.\nThe celebrations will continue on Dec. 31 at the Taco Bowl New Year’s Eve Downtown Bowl Bash, Tucson’s take on Times Square, beginning at 6:00 pm MST at the Mural Lot at 41 E. Congress Street. Live music will be performed throughout the evening, including a headline performance from glam metal band Warrant. The Bash-worthy lineup will also include a Silent Disco presented by Tucson Federal Credit Union, food trucks and beer stations, and the world-renowned taco drop at midnight followed by a spectacular firework show presented by O’Rielly Chevrolet.\nWYOMING BOWL HISTORY:\n* Gator Bowl - 20-7 over Washington & Lee - 1951\n* Sun Bowl - 21-14 over Texas Tech - 1956\n* Sun Bowl - 14-6 over Hardin Simmons - 1958\n* Sun Bowl - 28-20 over Florida State - 1966\n* Sugar Bowl - 20-13 loss to LSU - 1968\n* Fiesta Bowl - 41-7 loss to Oklahoma - 1976\n* Holiday Bowl - 20-19 loss to Iowa - 1987\n* Holiday Bowl - 62-14 loss to Oklahoma State - 1988\n* Copper Bowl - 17-15 loss to Cal - 1990\n* Copper Bowl - 52-17 loss to Kansas State - 1993\n* Las Vegas Bowl - 24-21 over UCLA - 2004\n* New Mexico Bowl - 35-28 over Fresno State - 2009\n* New Mexico Bowl - 37-15 loss to Temple - 2011\n* Poinsettia Bowl - 24-21 loss to BYU - 2016\n* Potato Bowl - 37-14 over Central Michigan - 2017\n* Arizona Bowl - 38-17 over Georgia State - 2019\n* Potato Bowl - 52-38 over Kent State - 2021\n* Arizona Bowl - 30-27 loss to Ohio - 2022\nA Barstool Arizona Bowl press release contributed to this report\nWyoming Cowboys Football: 2023 Season in Photos\nGallery Credit: DJ Johnson photos",
  "word_count": 869,
  "scraped_at": "2026-02-14T14:08:40.020523"
}