{
  "article_id": "749d649e5b6c",
  "url": "https://www.mlb.com/braves/news/2024-mlb-draft-prospects-famous-family-ties",
  "title": "2024 MLB Draft prospect famous family ties",
  "date": "20240711T160000Z",
  "domain": "mlb.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The MLB Draft typically features some very recognizable last names among its selections, and the 2023 edition was no exception. In fact, within the first 40 overall picks of last summer’s Draft, the Athletics alone selected Jacob Wilson -- son of former Pirates All-Star shortstop Jack -- and Myles Naylor -- younger brother of current Guardians players Bo and Josh.\nWho will be next to hop aboard the nostalgia train this year? Here’s a look at just some of the 2024 Draft-eligible players with famous relatives, in baseball and elsewhere. It’s worth noting here that being eligible for the Draft in no way guarantees that a player will be selected, but we’re starting our list with those ranked by MLB Pipeline as among this year’s Top 250 Draft Prospects.\nThe 2024 Draft will be broadcast live from Fort Worth, Texas, with a pregame show at 6 p.m. ET on MLB Network and ESPN (as well as MLB.TV, MLB.com and in the MLB App) and the Draft at 7 p.m. ET. Every pick on Day 2 (Monday) and Day 3 (Tuesday) can be seen starting at 2 p.m. ET both days on MLB.TV, MLB.com and in the MLB App.\nTOP 250 PROSPECTS\nCam Caminiti, LHP, Saguaro HS (Ariz.) (No. 15 prospect)\nRelative: Ken Caminiti (cousin, 15 MLB seasons)\nAfter playing both football and baseball at San Jose State, Ken proceeded to have a 15-season MLB career as a third baseman, primarily coming with the Astros. He earned three All-Star selections and three Gold Glove awards, and his best season was in 1996 with the Padres, when he had career highs in home runs (40) and RBIs (130) en route to NL MVP honors. Ken passed away in 2004, before Cam was born.\nBilly Amick, 3B, Tennessee (No. 32 prospect)\nRelative: Lyndon Amick (father, former NASCAR driver)\nLyndon was a NASCAR driver from 1996-2003, primarily competing in NASCAR’s second-tier circuit which was then known as the Busch Series (currently the Xfinity Series). After retiring from racing, Lyndon enlisted in the South Carolina Army National Guard, which took him to Afghanistan before he completed his service in 2011.\nWyatt Sanford, SS, Independence HS (Texas) (No. 35 prospect)\nRelative: Chance Sanford (father, 2 MLB seasons)\nChance was drafted by the Pirates in both 1991 and 1992, and he appeared in 19 MLB games as a utility man, with 14 coming for the Pirates in 1998 and five for the Dodgers in 1999. He hit 6-for-36 in his MLB career.\nRyan Johnson, RHP, Dallas Baptist (No. 47 prospect)\nRelative: M.D. Johnson (brother, current Marlins prospect)\nM.D. (short for Michael David) is also a pitcher, and he also played for Dallas Baptist. M.D. was drafted by the Marlins in the sixth round in 2019, and he is currently with the franchise’s Double-A affiliate.\nDante Nori, OF, Northville HS (Mich.) (No. 48 prospect)\nRelatives: Micah Nori (father, NBA assistant coach), Fred Nori (former baseball player and coach)\nMicah played college baseball at Indiana, but his career has blossomed in basketball, where he’s currently an assistant coach for the reigning Western Conference finalist Minnesota Timberwolves. Dante’s grandfather, Fred, also spent time as an assistant baseball coach at Indiana, where he helped recruit and coach Kyle Schwarber.\nMike Sirota, OF, Northeastern (No. 50 prospect)\nRelative: Whitey Ford (great-uncle, 16 MLB seasons)\nThe Hall of Famer needs no introduction. He was a 10-time All-Star and six-time World Series champion in addition to winning the 1961 AL Cy Young Award.\nBryce Meccage, RHP, The Pennington School (N.J.) (No. 51 prospect)\nRelatives: Justin Meccage (uncle, Pirates bullpen coach), Jeremy Meccage (father, former baseball player and coach)\nJustin, who had a brief Minor League career with the Yankees, has served in multiple roles on the Pirates’ staff since 2018. Bryce’s father, Jeremy, is a coach at Princeton after being drafted twice by the Dodgers.\nKavares Tears, OF, Tennessee (No. 66 prospect)\nRelatives: Dont’a Hightower (former NFL player); Jason Maxwell (3 MLB seasons)\nAfter a dominant career at Alabama that included two national championships, Hightower was a mainstay on the New England Patriots defenses of the 2010s, winning three Super Bowls and earning two Pro Bowl selections as a linebacker. Maxwell played in 110 games across three MLB seasons as a utility man, suiting up for both the Cubs and Twins. It’s not known exactly how either is related to Tears.\nTerrence Kiel II, OF, Pace Academy (Ga.) (No. 120 prospect)\nRelative: Terrence Kiel (father, former NFL player)\nThe elder Terrence played four seasons as a safety with the franchise that was then called the San Diego Chargers, starting 51 games from 2003-06. He died in 2008 following a car crash.\nNick McLain, OF, Arizona State (No. 129 prospect)\nRelatives: Matt McLain and Sean McLain (brothers, active pro baseball players)\nMatt, a 2021 first-round pick by the Reds out of UCLA, had an extremely strong rookie season with Cincinnati in 2023, putting up an .864 OPS and finishing fifth in NL Rookie of the Year voting. He has not yet played in 2024 due to injury. Sean was a fifth-round pick by the Dodgers out of Arizona State in 2022, and he is currently with the Dodgers’ Single-A affiliate.\nBurke-Lee Mabeus, C, Bishop Gorman (Nev.) (No. 159 prospect)\nRelatives: Chris Mabeus (father, 1 MLB season), Boston Mabeus (fellow 2024 MLB Draft prospect)\nChris wasn’t quite like the famed “Moonlight” Graham from the movie “Field of Dreams,” but he wasn’t far off. Chris appeared in one game in his MLB career, allowing four earned runs in 1 2/3 innings pitched with the Brewers on May 29, 2006. Burke-Lee’s brother, a BYU left-handed pitcher named Boston, is also a Draft-eligible prospect this year.\nDane Moehler, RHP, Walton HS (Ga.) (No. 167 prospect)\nRelative: Brian Moehler (father, 14 MLB seasons)\nBrian pitched from 1996-2010, including seven seasons with the Tigers. He finished his career with an 84-107 record and a 4.81 ERA.\nKonnor Eaton, LHP, George Mason (No. 180 prospect)\nRelative: Nate Eaton (cousin, current Minor Leaguer)\nNate was a 21st-round pick as an outfielder by the Royals out of VMI in 2018. He appeared in 72 games with Kansas City from 2022-23, hitting .201 in that span. He currently is at Triple-A Omaha.\nCade Obermueller, LHP, Iowa (No. 214 prospect)\nRelative: Wes Obermueller (father, 5 MLB seasons)\nWes was a second-round pick by the Royals out of Iowa in 1999 and also pitched for the Brewers and Marlins. He finished his career with an 11-22 record and a 5.82 ERA.\nClark Candiotti, RHP, Arizona (No. 232 prospect)\nRelative: Tom Candiotti (father, 16 MLB seasons)\nTom wasn’t drafted after a four-year career at St. Mary’s, but he nonetheless managed to carve out a lengthy career as a knuckleball pitcher from 1983-99, mostly with Cleveland and the Dodgers. He went 151-164 record and a 3.73 ERA, and led the AL with 17 complete games in 1986. He now serves as a radio analyst for the D-backs.\nOTHER DRAFT-ELIGIBLE PLAYERS\nBig names in baseball history\nBraden Halladay, RHP, High Point\nRelative: Roy Halladay (father, 16 MLB seasons)\nRoy’s consistent success with the Blue Jays and Phillies led to him winning a Cy Young Award in each league and ultimately racking up 203 victories. He threw two no-hitters for Philadelphia in 2010, the second of which was only the second no-no in postseason history. An eight-time All-Star, he was inducted into the Hall of Fame on his first ballot in 2019, not long after his tragic death in November 2017.\nMax McGwire, 1B, San Diego\nRelative: Mark McGwire (father, 16 MLB seasons)\nThe 1987 AL Rookie of the Year, Mark’s memorable career included 583 homers, 11th-most on the all-time list. In 1998, his home run chase with Sammy Sosa captivated a nation and ended with McGwire becoming the first player in big league history to reach 70 home runs.\nNoah Sheffield, SS, Jesuit HS (Fla.)\nRelative: Gary Sheffield (father, 22 MLB seasons)\nGary swatted 509 home runs and posted a .907 OPS with eight teams from 1988-2009. With 253 career steals, he is also just one of four players with 500 home runs and 250 stolen bases, along with Willie Mays, Barry Bonds and Alex Rodriguez.\nLucas Ramirez, OF, American Heritage HS (Fla.)\nRelative: Manny Ramirez (father, 19 MLB seasons)\nOne of the most feared sluggers in the Majors during his long career, Manny ranks 15th all time with 555 career home runs. He was an All-Star every year from 1998-2008 and finished in the top 10 of AL MVP voting in each of the first eight seasons of that stretch.\nWill Mize III, SS, Georgia State\nRelative: Johnny Mize (15 MLB seasons)\nIt’s not clear exactly how Will is related to the Hall of Famer Johnny, a 10-time All-Star and five-time World Series champion. Despite missing three seasons due to World War II service, the first baseman led the NL in home runs four times.\nOrlando Hernandez, RHP, Florida International\nRelatives: Orlando Hernández (father, 9 MLB seasons), Liván Hernández (uncle, 17 MLB seasons)\nOrlando (aka “El Duque”) didn’t arrive from Cuba until he was 32 but made over 200 starts. He became known as a terrific postseason performer, posting a 2.55 ERA in more than 100 playoff innings that yielded four World Series championships (including three with the Yankees). As for Livan, he was a two-time All-Star and also was at his best when the lights shined brightest, winning World Series MVP in 1997 with the Marlins.\nDawson Brown, RHP, Georgia Tech\nRelative: Kevin Brown (father, 19 MLB seasons)\nKevin was one of the very best pitchers in baseball during the late ‘90s and early 2000s. He won 211 games over his 19 seasons and was a six-time All-Star, finishing inside the top 10 in Cy Young voting five times. His best year came with the Marlins in 1996 when his 1.89 ERA was nearly a full run better than any qualified starter that season. He remained the ace of Florida’s rotation the following year as the Marlins won the franchise’s first World Series.\nLuke Heefner, SS, Dallas Baptist\nRelative: Ben Zobrist (uncle, 14 MLB seasons)\nA one-time Dallas Baptist star himself, Zobrist is the brother-in-law of current DBU head coach Dan Heefner (Luke’s father). The super-utilityman played for the Rays, Cubs, Royals and A’s, winning two World Series titles and earning 2016 World Series MVP honors for the Cubs.\nRafael Furcal Jr., 3B, American Heritage HS (Fla.)\nRelative: Rafael Furcal (father, 14 MLB seasons)\nThe elder Furcal spent his first six seasons in Atlanta, winning the 2000 NL Rookie of the Year Award and earning an All-Star nod in 2003. The speedy shortstop finished his career with three All-Star selections, 113 home runs and 314 stolen bases.\nBrady Counsell, SS, Minnesota\nRelative: Craig Counsell (father, Cubs manager)\nOver a 16-season career as an infielder from 1995-2011, Craig was a two-time World Series champion who racked up 1,208 hits. He led the Brewers to five playoff appearances over eight full seasons as their manager from 2016-23, before he became the highest-paid manager in MLB history (in terms of average annual value) by taking the Cubs job.\nLandon Hairston, OF, Casteel HS (Ariz.)\nRelatives: Scott Hairston (father), Jerry Hairston Jr. (uncle), Jerry Hairston Sr. (grandfather), Sam Hairston (great-grandfather), John Hairston (great-uncle)\nThose five members of the Hairston family have all played in the big leagues, including Scott and his brother, Jerry Jr., who combined for 27 MLB seasons. It all started with Sam, a Negro League All-Star with the 1948 Indianapolis Clowns who made it to the Cubs briefly in 1951.\nFront office movers and shakers\nTeddy Cashman, OF, Lafayette College\nRelative: Brian Cashman (father, Yankees GM)\nThe league’s longest-tenured general manager, Brian has seen the Yankees make the playoffs 21 times in 25 seasons since taking over in 1998. His time at the helm includes four World Series championships, six American League pennants, 13 division titles and zero losing seasons.\nRyan Picollo, OF, Saint Joseph’s\nRelative: J.J. Picollo (father, Royals GM)\nThe elder Picollo has worked for Kansas City since 2006 and has overseen baseball operations since 2022.\nJack O’Dowd, SS, Texas\nRelatives: Dan O’Dowd (father, former Rockies GM), Chris O’Dowd (former baseball player)\nDan led the Rockies’ front office from 1999-2014, notably being at the helm for what stands as the only NL pennant in franchise history in 2007. He works as an analyst for MLB Network now. Jack’s brother, Chris, also played in the Minors and reached Triple-A.\nActive players\nGavin Casas, 1B, South Carolina\nRelative: Triston Casas (brother, current Red Sox 1B)\nTriston was a first-round Draft pick of the Red Sox out of high school in 2018 and finished third in AL Rookie of the Year voting last season after posting an .856 OPS with 24 homers.\nAkhil Nimmala, 3B, Strawberry Crest HS (Fla.)\nRelative: Arjun Nimmala (brother, current Blue Jays prospect)\nThe No. 20 overall pick in the 2023 Draft out of the same high school, Arjun is the Toronto’s No. 3 prospect, currently playing for Single-A Dunedin.\nOwen Puk, RHP, FIU\nRelative: A.J. Puk (brother, current Marlins LHP)\nThe A's selected A.J. sixth overall in the 2016 Draft out of the University of Florida and traded him to Miami before the 2023 season. The 6-foot-7 southpaw has mostly pitched out of the bullpen in MLB.\nJayden Melendez, C, Pittsburgh\nRelative: MJ Melendez (brother, current Royals OF)\nMJ has been a regular in the Kansas City lineup ever since making his MLB debut in May 2022.\nZach Toglia, 3B, University of Portland (Ore.)\nRelative: Michael Toglia (brother, current Rockies OF)\nMichael was a first-round pick by the Rockies out of UCLA in 2019, and he made his debut at the MLB level in August 2022.\nNick Boyle, RHP, Xavier\nRelative: Joe Boyle (brother, current A’s RHP)\nJoe was drafted in the fifth round by the Reds out of Notre Dame in 2020, was traded to the A’s in July 2023 and debuted that September.\nBenjamin Vespi, RHP, Central Florida\nRelative: Nick Vespi (brother, current Orioles Minor Leaguer)\nNick is a left-handed pitcher who is currently on the Orioles’ 40-man roster. He has gone back and forth between the Minors and Majors for the past few seasons.\nAnthony Susac, RHP, Arizona\nRelatives: Daniel Susac (cousin, current A’s prospect), Andrew Susac (cousin, 6 MLB seasons)\nAnthony is related to a pair of notable catchers. Andrew spent time with the Giants, Brewers, Orioles and Pirates. Daniel was taken 19th overall by the A’s in the 2022 Draft and is currently the team’s No. 5 prospect.\nHoss Brewer, RHP, Arkansas\nRelative: Colten Brewer (brother, current Cubs pitcher)\nThis is the sixth season in which Brewer (also a right-handed pitcher) has appeared in the Majors, mostly in relief. The Cubs are his fourth MLB team.\nSam Klein, RHP, Ball State\nRelative: Will Klein (brother, current Royals pitcher)\nWill was the Royals’ fifth-round pick in 2020, and the right-handed pitcher made his MLB debut for the club on April 28, 2024.\nBrian Walters Jr., RHP, Miami (Fla.)\nRelative: Andrew Walters (brother, current Guardians prospect)\nThe two Walters brothers both pitched for the Hurricanes in 2023. Andrew was the 62nd overall pick in the 2023 Draft by the Guardians and is Cleveland’s No. 23 prospect. He was promoted to Triple-A Columbus in May.\nJorge De Goti, 3B, Nova Southeastern University (Fla.)\nRelative: Alex De Goti (cousin, current Rangers Minor Leaguer)\nAlex went 2-for-7 in his only MLB action so far, for the 2021 Astros. The second baseman has spent time at Double-A and Triple-A for the Rangers in 2024.\nDeric Fabian, SS, Auburn\nRelative: Jud Fabian (brother, current Orioles prospect)\nA second-round Draft pick out of Florida in 2022 as an outfielder, Jud has spent the 2024 season at Double-A Bowie and is ranked as Baltimore’s No. 11 prospect.\nAndre Duplantier II, RHP, Texas\nRelative: Jon Duplantier (cousin, 2 MLB seasons)\nJon, also a right-handed pitcher, was drafted in the third round by the D-backs in 2016 and appeared in 19 games for the team. He pitched in Triple-A for the Mets this season but was released in June.\nMore baseball names to remember\nBryce Martin-Grudzielanek, SS, USC\nRelative: Mark Grudzielanek (father, 15 MLB seasons)\nMark carved out a strong career from 1995-2010 as a middle infielder for six different franchises. He was a .289 lifetime hitter, having been an NL All-Star in 1996 with the Expos and an AL Gold Glove Award winner 10 years later with the Royals.\nMason Greer, 3B, Baylor\nRelative: Rusty Greer (father, 9 MLB seasons)\nRusty played his whole career with the Rangers from 1994-2002 and was a key cog for Texas’ AL West-winning teams in 1996, ‘98 and ‘99. His best season came in 1997, when he slashed .321/.405/.531 over 601 at-bats and received a few MVP votes.\nBeau Hollins, 1B, River Bluff HS (S.C.)\nRelative: Dave Hollins (father, 12 MLB seasons)\nDave notched 112 home runs and 870 hits for seven teams from 1990-99 and 2001-02. His best seasons came in Philly, where he hit 27 homers in 1992 and garnered his lone All-Star selection in ‘93, before homering twice in the NLCS against the Braves.\nTyler Inge, SS, Detroit Country Day HS (Mich.)\nRelative: Brandon Inge (father, 13 MLB seasons)\nInitially a catcher, Brandon soon moved to third base and became an All-Star in 2009, thanks in part to his slick glove. He spent 12 of his 13 MLB seasons with the Tigers, including on their 2006 AL pennant run.\nJack Washburn, RHP, Texas Tech\nOwen Washburn, 1B, Texas Tech\nRelative: Jarrod Washburn (father, 12 MLB seasons)\nJarrod, a left-handed pitcher, could see two sons drafted this year. The elder Washburn’s best seasons came with the Angels, most notably 2002, when he went 18-6 with a 3.05 ERA over 206 innings. He finished fourth in AL Cy Young Award voting and earned a World Series ring.\nJaison Andujar, OF, Culver-Stockton College (Mo.)\nRelative: Joaquin Andujar (father, 13 MLB seasons)\nHis son is a lefty-hitting outfielder, but Joaquin was a standout right-handed starting pitcher who was a four-time All-Star, including in 1984, when he led MLB with 20 wins for the Cardinals. Joaquin, who helped St. Louis win the 1982 World Series, died in 2015.\nJackson Jaha, 3B, Oregon\nRelative: John Jaha (father, 10 MLB seasons)\nA slugging first baseman, John swatted 34 homers for the 1996 Brewers and 35 more for the 1999 A’s, earning his only All-Star selection at age 33.\nBennett Thompson, C, Oregon\nRelative: Jason Thompson (uncle, 11 MLB seasons)\nJason was a three-time All-Star first baseman who played for the Tigers, Angels, Pirates and Expos from 1976-86. He hit more than 200 career homers, topping the 30 mark twice.\nCooper Blauser, INF, Clemson\nRelative: Jeff Blauser (father, 13 MLB seasons)\nJeff was the starting shortstop for some of those powerhouse 1990s Braves teams and earned All-Star nods in 1993 and '97, eclipsing a .300 average and .400 OBP in both seasons.\nGarrett Bevacqua, 3B, St. Cloud State (Minn.)\nRelative: Kurt Bevacqua (father, 15 MLB seasons)\nA utilityman, Kurt hit just 27 regular-season home runs during his career (1971-85), but he went deep twice against the Tigers in a 7-for-17 (.415) performance for the Padres in the 1984 World Series.\nJevin Relaford, SS, Florida Southern\nRelative: Desi Relaford (father, 11 MLB seasons)\nDesi suited up for seven different teams, most notably the Phillies. He was known for his defense and versatility, playing every position except catcher and first base (yes, he even pitched once for the Mets in 2001).\nElijah Jackson, SS, Cal State LA\nRelative: Damian Jackson (father, 11 MLB seasons)\nDamian played for eight teams, primarily the Padres (1999-2001, 2005). Over his career, he appeared at every defensive position except pitcher and catcher.\nRoman Bracamonte, RHP, Central Arizona College\nRelatives: Gil Heredia (uncle, 10 MLB seasons)\nHeredia served as a reliever for the Giants, Expos and Rangers from 1991-1996 before returning to the Majors as a starter for the A’s from 1998-2001.\nCaden Marcum, RHP, Blinn College\nRelative: Shaun Marcum (father, 9 MLB seasons)\nAlthough he battled injuries, Shaun had a stretch from 2007-12 in which he went 54-32 with a 3.67 ERA over more than 800 innings for the Blue Jays and Brewers.\nTague Davis, 1B, Malvern Prep HS (Pa.)\nRelative: Ben Davis (father, 7 MLB seasons)\nBen is a color commentator for the Phillies. He was the No. 2 overall pick by the Padres in the 1995 Draft and went on to catch for the Padres, Mariners and White Sox from 1998-2004.\nTyler LaRue, C, Houston Christian University\nRelative: Jason LaRue (father, 12 MLB seasons)\nJason was a catcher from 1999-2010, mostly for the Reds. Over a four-year span from 2002-05, he had a .761 OPS, and played at least 110 games in each season.\nHiram Bocachica III, SS, Puerto Rico Baseball Academy\nRelative: Hiram Bocachica (father, 8 MLB seasons)\nThe elder Hiram Bocachica was selected 21st overall in the 1994 Draft by the Montreal Expos. Sent to the Dodgers at the 1998 Trade Deadline, the outfielder debuted with L.A. in 2000 before playing for four other teams.\nTurner Spoljaric, RHP, Oregon\nRelative: Paul Spoljaric (father, 6 MLB seasons)\nLike his son, Paul was born in Canada, a sign of things to come given that he played four seasons with the Blue Jays as a left-handed pitcher.\nJordan Williams, OF, Florida State\nRelatives: Reggie Williams (father, 4 MLB seasons)\nReggie, also an outfielder, appeared in 88 games for the Angels and Dodgers in the 1990s. Jordan’s brother, Cam, was also a 19th-round pick in the 2021 Draft and is currently in the Angels’ system.\nTanner Witt, RHP, Texas\nRelative: Kevin Witt (father, 5 MLB seasons)\nKevin was the 28th overall selection in the 1994 Draft by the Blue Jays and appeared in 146 MLB games with Toronto, Detroit, San Diego and Tampa Bay.\nAmari Bartee, OF, Hope International University (Calif.)\nRelative: Kimera Bartee (father, 6 MLB seasons)\nAn outfielder for the Tigers, Reds and Rockies, Kimera later became a coach for the Pirates, Phillies and Tigers. He was serving as Detroit’s first base coach when died of a brain tumor in December 2021 at age 49.\nConnor McGuire, SS, Cal Baptist University\nRelative: Ryan McGuire (father, 6 MLB seasons)\nRyan played 368 MLB games as an outfielder/first baseman, mostly for the 1997-99 Expos. But Connor’s most athletic parent may be his mother, Kristy Heydanek, a competitive swimmer who won a silver medal in the Women's 100 meter backstroke at the 1995 Pan American Games in Argentina.\nKobe Minchey, RHP, Dallas Baptist\nRelative: Nate Michey (father, 4 MLB seasons)\nNate pitched 15 games for the Red Sox and Rockies across four seasons in the 1990s, then pitched in Japan for seven seasons. He currently works as an international scout for the Yomiuri Giants of Nippon Professional Baseball.\nNathan Humphreys, OF, Dallas Baptist\nRelative: Mike Humphreys (father, 3 MLB seasons)\nA 15th-round pick of the Padres in 1988, Mike was traded to the Yankees in December 1990 and got into 54 games for them from 1991-93 as an outfielder/third baseman. Nathan also has a brother, Zach, a catcher who is at Triple-A with the Angels.\nJonny Lowe, RHP, Cisco College (Texas)\nRelative: Sean Lowe (father, 7 MLB seasons)\nFrom 1997-2003, Sean pitched for five different clubs, primarily as a reliever. He made a majority of his appearances for the White Sox.\nCJ Cepicky III, OF, Northern Illinois\nRelative: Matt Cepicky (uncle, 5 MLB seasons)\nMatt was a fourth-round pick by the Expos out of Missouri State in 1999, and the outfielder played 80 of his 89 MLB games for the Expos/Nationals franchise.\nJackson Dannelley, RHP, Purdue\nRelative: Chris Sampson (cousin, 5 MLB seasons)\nChris went 20-15 with a 4.42 ERA in 174 games (33 starts) for the Astros from 2006-10, throwing more than 100 innings in both 2007-08.\nJoshua Stewart, RHP, Texas A&M\nRelative: Kohl Stewart (cousin, 3 MLB seasons)\nThe Twins took Kohl Stewart fourth overall in the 2013 MLB Draft, but the right-hander appeared in only 21 big league games for Minnesota and the Cubs.\nTyrelle Chadwick, RHP, Illinois State\nRelative: Ray Chadwick (father, 1 MLB season)\nRay’s only MLB action came in 1986, when he made seven starts on the mound for the Angels.\nEli Jerzembeck, RHP, South Carolina\nRelative: Mike Jerzembeck (father, 1 MLB season)\nMike appeared in his only three MLB games for the 1998 World Series champion Yankees, pitching a scoreless inning against the Royals in his debut.\nBlake McGehee, RHP, Louisiana\nRelative: Kevin McGehee (father, 1 MLB season)\nKevin appeared in his only MLB action for the 1993 Orioles, making five relief appearances.\nTommy Tavarez, SS, Gardner-Webb\nRelative: Luis Jimenez (cousin, 3 MLB seasons)\nA third baseman, Jiménez played in 68 games for the Angels, Brewers and Red Sox from 2013-15.\nSuccess in other sports\nJaden Agassi, RHP, USC\nRelatives: Andre Agassi (father, former tennis player), Steffi Graf (mother, former tennis player)\nJaden's parents won 30 Grand Slams between them, with both holding No. 1 rankings during their careers. The aspiring hurler made 40 appearances for USC and is currently pitching for the Mahoning Valley Scrappers in the MLB Draft League.\nDerrick Mayes II, OF, Maryland Eastern Shore\nRelative: Russell Wilson (cousin, NFL player)\nNot only is Wilson a Super Bowl champion and nine-time Pro Bowler, but he was also a fourth-round Draft pick by the Rockies back in 2010, spending two seasons in Colorado’s Minor League system as a second baseman. He continued to dabble in baseball afterward.\nKevin Madden Jr., 3B, College of Charleston\nRelative: Joe Flacco (cousin, NFL player)\nA longtime NFL quarterback, most notably for the Ravens, Flacco was the MVP of Super Bowl XLVII, leading Baltimore to a title. He threw 13 touchdown passes in five games with the Cleveland Browns in 2023 before signing with the Indianapolis Colts this past March. He is heading into his 17th NFL season.\nJoseph Sullivan III, OF, South Alabama\nRelative: Pat Sullivan (grandfather, football player and coach)\nPat Sullivan starred on the football field, winning the 1971 Heisman Trophy as the best player in college football -- the first Heisman won by an Auburn player. Sullivan was selected in the second round of the 1972 NFL Draft and played in 30 games for the Atlanta Falcons from 1972-75. He later served as the head coach of TCU (1992-97) and Samford University (2007-2014).\nEli Paton, 3B, Grand Canyon\nRelative: George Paton (father, Denver Broncos GM)\nGeorge played defensive back at UCLA from 1988-91, and has worked in various football positions since then. He was in the Minnesota Vikings front office from 2007-20, and he has been the general manager of the Denver Broncos since 2021.\nJesse Robinson Jr., OF, Lynn University (Fla.)\nRelatives: Earnie Shavers (cousin, former pro boxer)\nShavers was a boxer who was a two-time challenger for the world heavyweight title, notably taking Muhammad Ali to a 15-round decision for the belt in 1977. Another cousin, Ted Toles Jr., played baseball in the Negro Leagues and in the Minors.\nSean Matson, P, Harvard\nRelative: Erin Matson (sister, field hockey player and coach)\nErin was transcendent as a field hockey player at North Carolina, winning four national championships and three Honda Sport Awards (i.e. national player of the year) in her five-year career. But that’s not the biggest reason she’s made headlines. She took over as the program’s head coach in January 2023 immediately upon graduating, when she was still 22 years old. The Tar Heels went on to win the national title last fall, and she’s believed to be the second-youngest head coach to win an NCAA Division I title, behind Myron Roderick in 1958 (Oklahoma State wrestling).\nAidan Meola, 3B, Oklahoma State\nRelative: Tony Meola (father, former soccer player)\nDespite being drafted by the Yankees out of high school and playing baseball at the University of Virginia, Tony Meola took his career in a different direction. Meola chose to stick with soccer, playing goalkeeper for the U.S. national team in the 1990, 1994 and 2002 World Cups. He even tried to become a placekicker for the New York Jets in 1994 but failed to make the team.\nCole Hansen, C, Norco HS (Calif.)\nRelative: Kinzie Hansen (sister, softball player)\nA decorated college softball player at Oklahoma, Kinzie helped the Sooners to an astounding four straight national championships from 2021-24. Like her brother, Hansen is a catcher by trade, and she’s prolific at the plate: Hansen hit .400 in four of her five seasons at OU and finished her career with a .717 slugging percentage.\nRob Ready, RHP, UNC Greensboro\nRelative: Sean Landeta (uncle, former NFL player)\nLandeta was an NFL punter for a staggering 22 seasons, suiting up for five different teams in that span. His peak came with the Giants from 1985-93, when he was a three-time First Team All-Pro and two-time Super Bowl champion in his time with New York.\nJayden Hill, OF, Arkansas State\nRelative: Greg Hill (father, former NFL player)\nA star running back at Texas A&M, Greg Hill was taken in the first round of the 1994 NFL Draft by the Kansas City Chiefs and rushed for more than 3,000 career yards.\nDevin Obee, OF, Duke\nRelative: Terry Obee (father, former NFL player), Charlie Jones Sr. (cousin, former NFL player)\nDevin Obee’s father and cousin were both NFL wide receivers in the 1990s.\nBrock Moore, RHP, Oregon\nRelative: Evan Moore (cousin, former NFL player)\nA football and basketball player at Stanford, Evan got NFL playing time as a receiver for three teams from 2009-12.\nJoshua Rolling, SS, Georgetown\nRelative: Henry Rolling (father, former NFL player)\nHenry played eight NFL seasons as a linebacker from 1987-94, starting 47 career games in his career, including 36 in his three seasons with the Chargers.\nNick Wallerstedt, OF, Long Beach State\nRelative: Brett Wallerstedt (father, former NFL player)\nBrett was an NFL linebacker for three teams from 1993-97 and is now a senior associate athletic director at Arizona State.\nJoey Mundt, RHP, Oregon State\nRelative: Johnny Mundt (brother, NFL player)\nJohnny was undrafted in 2017 out of Oregon, but he has since carved out an NFL career as a tight end, now entering his eighth season. He currently plays for the Minnesota Vikings, with whom he had a career-high 172 receiving yards in 2023.\nJackson Williams, RHP, Millard West HS (Neb.)\nRelative: Jamel Williams (father, former NFL player)\nAfter starring as a defensive back at Nebraska, Jamel played for Washington from 1997-99, appearing in 35 games.",
  "word_count": 5091,
  "scraped_at": "2026-02-14T13:31:17.306388"
}