{
  "article_id": "74bb7974b33f",
  "url": "https://www.asiaone.com/asia/north-korea-wont-host-world-cup-qualifier-against-japan-kyodo-reports",
  "title": "North Korea wont host World Cup qualifier against Japan , Kyodo reports",
  "date": "20240322T041500Z",
  "domain": "asiaone.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "TOKYO — North Korea will not host a World Cup qualifier with Japan that was scheduled to be held in Pyongyang next week, Kyodo news agency reported late Thursday (March 21), citing the president of the Japan Football Association (JFA).\n\"A game will not be played in Pyongyang,\" Kyodo quoted Kozo Tashima as saying after Japan beat North Korea 1-0 in another qualifier in Tokyo on Thursday.\nThe Asian Football Confederation (AFC) informed the JFA this month that the match between the two nations would be held on March 26 in Pyongyang, the report said.\nNorth Korea, which has no formal diplomatic relations with Tokyo, appears to have decided not to stage the match in its capital over worries about infectious diseases in Japan, Kyodo said.\nIt has not been decided whether the match will be held on the scheduled date or where it will take place, according to Kyodo.\nJapanese Chief Cabinet Secretary Yoshimasa Hayashi said the government was not in a position to comment as FIFA and AFC would make the decision.\nThere was no immediate response to a request for clarification from the AFC. JFA was not immediately available for comment either.\nThe Samurai Blue squad has cancelled a flight to Beijing originally scheduled for Friday morning and plan to train in Chiba prefecture, the JFA said.\nNorth Korea last hosted a men's football international in Pyongyang in 2019 during the qualifying competition for the 2022 World Cup. The country pulled out of that competition citing health concerns related to the Covid pandemic.\nThe North Koreans are also scheduled to stage home qualifiers against Syria and Myanmar in June.\nIn February, an Olympic qualifier between the women's teams of the two countries scheduled for Pyongyang was switched at the last minute to a neutral venue in Saudi Arabia.\nThere was similar confusion over that match, with the Japan team departing for Jeddah four days before the scheduled kickoff without any confirmation of where the match would be played.",
  "word_count": 331,
  "scraped_at": "2026-02-14T12:07:21.236168"
}