{
  "article_id": "74c8bdca3c8a",
  "url": "https://www.smh.com.au/sport/the-moment-that-proved-wallabies-have-found-their-next-eales-20250912-p5muj0.html",
  "title": "Harry Wilson is Wallabie next John Eales",
  "date": "20250912T214500Z",
  "domain": "smh.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This was published 5 months ago\nOpinion\nThe moment that proved Wallabies have found their next Eales\nPeter FitzSimons\nColumnist and authorAfter that fabulous win over the Pumas in Townsville last Saturday, courtesy of a try in the sixth minute of extra time, my colleague Paul Cully nailed it when writing about Wallabies No.8 and skipper Harry Wilson.\n“There’s something about the way he wears his heart on his sleeve that is becoming infectious,” Cully wrote. “The Wallabies are starting to take on his characteristics. Here’s a guy who was overlooked for years and no doubt could have cashed in overseas – and at just 25, Australian rugby has found its long-term leader.”\nIndeed. For there was no better example of Wilson at his best than in the way he captained the team in those final minutes of the match. Down 21-24 as the clock ticked two minutes into extra time, the Wallabies were awarded a penalty and an easy chance to salvage what would have been a more than honourable draw.\nAnd now, have a look at what happens next, as the Stan Sport camera captures Wilson in the moments after the ref awards the penalty. James O’Connor comes up to him, clearly seeking instruction: Do I kick for goal?\nWilson takes a deep breath. Turns to look at his forwards. Looks to O’Connor. Makes the decision. We’re going for the try. Kick for touch, James.\nThen he turns to his forwards and yells – close your ears, kiddies – “You want this? Let’s f---ing go then!” before bumping fists with Fraser McReight and Angus Bell, the two he will most be looking towards to get this done. And so it starts.\nFor the next three minutes, through two more eschewed penalty kicks, the Wallabies pound the Pumas line. And now, in the 85th minute, it happens. Len Ikitau flicks a superb no-look pass to Bell on the burst, who crashes over for the biggest meat pie of his life, getting a kiss on the head from his skipper for his trouble!\nIt was superb stuff, and superb captaincy by Wilson.\n“He’s such a leader within our group,” Joseph-Aukuso Suaalii said afterwards. “We all look to him to make the calls when the pressure is on the line. He made the right call. He backed his boys. That’s what he does. He puts belief in his teammates, and for myself, he’s someone that I look to. I want to play for him.”\nMake a place for him next to you, John Eales. He’s arrived.\nWayne storm\nSouths coach Wayne Bennett has taken a lot of stick this week for his robust defence of his charge, Brandon Smith, after the hooker last month received a police summons on drugs and betting allegations.\n“In my opinion,” Bennett said, “it’s pretty trivial what’s going on with it. He is a high-profile person, and [the police] are using that profile to get a message out to a lot of people about whatever.”\nNothing to see here, officer. Just a few allegations about corruption and ordering some drugs between friends.\nTFF need not add to the pile-on, because it has mostly been said. What interests me more is Bennett’s decision to take on Smith – mid-season from the Roosters – in the first place. The coach’s assumption, presumably, was that Smith had plenty still to offer that only he could get out of him. And yet?\nAnd yet you had to see Smith at the end of the Roosters-Bunnies match on Friday night to believe it.\nSouths had just been completely humiliated by their bitter rivals who ran out 36-6 winners. Did that bother the laughing, joking Smith, as he caught up with his old Roosters teammates after the final whistle? Not in the least.\nNot a single ounce of sting about him. Not a trace of disappointment on his face. All good fun. There is no doubt about the bloke’s talent. It is the character that is at issue, and if I was a Souths supporter, I’d want my money back.\nYou want blokes who will bleed for the jersey, and he is not one of them. It was yet another poor decision by Bennett, long regarded as the best coach in the game.\n(And seeing as you ask, there are parallels to all of the above in the superb documentary America’s Team: The Gambler and His Cowboys, about the Dallas Cowboys. In my characterisation, Bennett is like Tom Landry, a great and legendary coach who stayed too long. Whereas Brandon Smith stands in strict contrast to the likes of Emmitt Smith, Michael Irvin and Troy Aikman, who are still mourning particular lost matches, 35 years later! Theirs was the commitment on which dynasties are built.)\nChoose your Battles, Nick ...\nNick Kyrgios? For all his sins, the man clearly has a good heart, and was far and away the most entertaining player of his generation. He could pull off shots others could barely conceive of. Sadly, in recent years, his body seems to have more or less fallen apart, which leaves him, seemingly, scratching around for the right gigs.\nThe latest news is that in January he will play women’s world No.1 Aryna Sabalenka in a modern version of the famed “battle of the sexes” between Bobby Riggs and Billie Jean King, then Margaret Court in the mid-1970s. Which would prove what, exactly?\nExactly.\nRiggs was trying to prove a point – that a man in his mid-50s could still beat the best female players in the world. (He lost to King, but beat Court.)\nBut this match would prove nothing remotely close to that. It might prove that the world’s best female tennis player can beat a male Wimbledon finalist, now badly hampered by various injuries.\nSo what? Who cares, either way? Don’t do it, Nick. It would be a circus act – just like when they once had Jesse Owens racing a horse. And you, just like him, are actually better than that.\nCauliflower with all the trimmings\nThank you, thank you all. The Cauliflower Club’s lunch at the Fullerton Hotel on 10 October is rapidly coming together, to celebrate this wonderful year for Australian rugby.\nWe have skipper Harry Wilson locked in, with half a dozen Wallabies and even more Wallaroos attending. Toasts to the forwards and backs will be made by Premier Chris Minns and federal sports minister Anika Wells. Come! All profits to help those gravely injured by sport. You can book a seat or a table, by Googling. Thank you!\nWhat They Said\nCarlos Alcaraz in his victory speech after defeating Jannik Sinner 6-2, 3-6, 6-1, 6-4, in their third successive grand slam final: “I want to start with Jannik. It’s unbelievable what you’re doing during the whole season. Great level every tournament you’re playing. I’m seeing you more than my family.”\nSinner after the loss: “I’m still proud of myself, about the season I’m playing, and making... four grand slam finals of the year. You know, two grand slams won, two times lost in the final, it’s incredible results, no?”\nNRL boss Peter V’landys on Snoop Dogg being the AFL’s grand final half-time entertainment: “We saw what the AFL got, what’s he called, Labrador, or poodle ... Labradoodle. All I know is it’s a dog act, so we had to get better than that. We actually got a vocalist, none of this doof doof stuff... this bloke [Teddy Swims] can actually sing.” I’ve never heard of Teddy Swims either, which reminds me: YOU KIDS, GET OFF MY LAWN!\nPenrith hooker Mitch Kenny on how his side feels trying to win the NRL grand final from a starting point way back, at seventh on the grid: “I’m confident we can beat anyone, anywhere, anytime.”\nAryna Sabalenka on a potential match against Nick Kyrgios: “I think it’s a cool idea and will be spectacular to watch. It’s going to be fun, especially against someone like Nick. I genuinely think that I’m going to win and I’ll definitely go out there and I’ll try my best to kick his ass.”\nWallabies skipper Harry Wilson on the win against Argentina, and his decision to for a fabulous try and a WIN, rather than an easy tepid goal for a dull draw: “Everyone believed that we could finish the job. And if the boys want to win a game, we may as well back them. [I’m] proud of the boys, we weren’t at our best, but to find a way to get a win against such high-quality opposition is a real credit to them.”\nGold Coast Suns coach Damien Hardwick on his side’s victory over Fremantle – their first in an AFL finals match in the club’s history: “To tick that off is pretty special. They’ve changed the narrative, this playing group, which is so important. At the end of the day, we’ve been a club that’s been ... I don’t want to say ridiculed, but stomped on, forgotten, and all of a sudden the narrative has changed. We’re very proud of what they’ve done thus far.” Fair enough, but it does seem against nature for the Gold Coast to win anything, bar the occasional toss?\nRetiring Fremantle champion Nat Fyfe was philosophical after his dream ended on Saturday night: “I don’t think I needed anything else from the game. We all want to win premierships. I do have some contentedness that I tried everything and gave absolutely everything I could to the club and evolved myself along the way. In some ways, maybe my journey it was more important for me not to win than to win.”\nNZ Warrior James Fisher-Harris channelling Rodney Dangerfield ahead of Sadurday’s final against the club he helped build, Penrith: “No-one really respects us, no-one gives us any hope or anything like that, and I actually love that.”\nOutgoing Newcastle coach Adam O’Brien after the Knights got the wooden spoon: “The people of our town, they don’t put up with bullshit ... there’s better days ahead, but right now, I can’t lie, it’s bitterly disappointing.”\nVictor Boniface, Nigerian soccer player, on X: “Life is like a shoes, u cannot drink a cow, because the earth is carrot. Think about it.”\nTeam of the Week\nJoseph-Aukuso Suaalii. “His name is Su, how do you do?” Scored two superb tries to lay the foundation for the Wallabies great victory over the Pumas last Saturday in Townsville. The second Test is this afternoon at Allianz, which I think is the Sydney Football Stadium.\nWallaroos. Take on Canada tonight in World Cup quarter-final. Our women were seriously competitive in the first half against the rampant England team last week, and just need to hold on for longer.\nCarlos Alcaraz. Behind only Bjorn Borg as the second-youngest man to win six grand slam titles.\nGold Coast Suns. Take on Lions tonight in a historic all-Queensland AFL final.\nAryna Sabalenka. Back-to-back US Opens as she won her fourth grand slam single title.\nAnge Postecoglou. Back on the horse, leading Nottingham Forest in tonight’s Premier League match against Arsenal. They’re looking forward to the second season!\nFootball has a new Home. Stream the Premier League, Emirates FA Cup, J.League and NWSL live & on demand, including Premier League with 4K, from August 2025 on Stan Sport.",
  "word_count": 1885,
  "scraped_at": "2026-02-14T12:36:56.947834"
}