{
  "article_id": "74df1243718c",
  "url": "https://allafrica.com/stories/202601020060.html",
  "title": "Nigeria : Insecurity , Police Abuses , Press Attacks Shaped Nigeria Human Rights Profile in 2025",
  "date": "20260102T063000Z",
  "domain": "allafrica.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This piece reviews some notable incidents and developments that shaped Nigeria's human rights outlook in 2025.\nNigeria's commitment to human rights continued to face tests in 2025.\nData from the National Human Rights Commission (NHRC) revealed a plunge in human rights complaints at the beginning of the year compared to the last month of 2024. However, as the year progressed, the number increased steadily until it had grown threefold.\nAlthough the data covered a range of violations, some forms stood out for the spike they recorded or their pervasive nature.\nKeep up with the latest headlines on WhatsApp | LinkedIn\nThe complaints, precipitated by the activities of both state and non-state actors, raised questions about Nigeria's commitment to security and regard for human rights in law enforcement.\nThe economic pressures on many Nigerians from the past years persisted and continued to drive civil actions. This, in turn, tested the tolerance of the police and security agencies for fundamental rights. Insecurity too emerged as a major contributor to human rights abuses in the year.\nThis piece reviews some notable incidents and developments that shaped Nigeria's human rights outlook in 2025.\nAbductions and killings in 2025\nWithin the year, Nigeria witnessed several cases of abductions, including kidnappings of students, continuing a long line of student abductions since the Chibok girls tragedy of 2014.\nIn November, terrorists abducted 25 school girls from Maga Comprehensive Girls' Secondary School in Danko/Wasagu Local Government Area of Kebbi State, North-west Nigeria, and killed two teachers.\nWithin the same month, terrorists attacked St Mary's School, a Catholic-owned institution in Papiri community, Agwara Local Government Area of Niger State, north-central Nigeria and abducted 265 students and staff members.\nThese incidents generated tension across Nigeria and brought the widespread insecurity in the country into the global spotlight, which has intensified following the United States government's renewed interest in what it described as the killings of Christians in northern Nigeria since the beginning of the year. Meanwhile, the reality of the insecurity in Nigeria is that it does not recognise religious lines.\nIn reaction to the Niger and Kebbi kidnappings, the federal government ordered the closure of all Unity Schools, and the governors of Katsina, Kebbi, Plateau, and Yobe States similarly halted school activities.\nWhile the government's measures might appear protective, their aftermath left a grim reality for the right to education. They also damage the perception of schooling in a region that already accounts for 80 per cent of the out-of-school children in the country.\nThe Executive Secretary of the NHRC, Tony Ojukwu, described this as a threat to the future.\n\"Education is not just a right, it is a fundamental human right, only through which we can conquer most of the world's challenges, including violent extremism, poverty, and inequalities. To have access to education threatened, as we have seen recently, is an attack on the future of our society,\" Mr Ojukwu said earlier this month during the NHRC's monthly presentation on the human rights complaints received by the commission.\nAside from schools, worship centres were targeted. While 38 worshippers were abducted from the Christ Apostolic Church, Oke Igan, in Eruku, Kwara State, north-central Nigeria, 15 were seized and taken away from the First Evangelical Church Winning All (ECWA) in Ayetoro Kiri, Kabba/Bunu Local Government Area of Kogi State. This also became a threat to the worshipers' right to freedom of worship.\nFarmers also faced attacks, which violated their economic rights. Recent incidents include the abduction of four farmers in Bauchi, 15 from the Ungwan Nungu community in Kaduna State, and 24 from the Palaita community in Niger State, including a pregnant woman. Similar abductions have also been reported in Borno State, north-east Nigeria, where insurgency has ravaged for more than a decade, destroying thousands of lives and sacking communities.\nThe reaction to the incessant abductions in the country included the lynching of 16 hunters in Uromi, Edo State, after they were mistaken for kidnappers.\nIn a tragic incident, terrorists killed over 100 people in the town of Yelwata (a refugee settlement) in the Guma Local Government Area of Benue State in June, sparking national outrage. The root cause of this violence has been traced to the farmer-herder crisis, a menace that past and present administrations have yet to solve.\nBeyond the immediate violence, the killings and abductions severely infringe socio-economic, health and safety rights. It also created an atmosphere of fear, with many farmers abandoning their farms. When farmlands become 'red zones, ' it breeds a looming national food crisis.\nProtests in 2025\nThe killing of over 100 persons in the town of Yelwata in Benue State in June sparked national outrage, resulting in a protest. Beginning with the residents of Yelwata town, the demonstration spread to Makurdi, the capital of Benue, where protesters, dressed in black, waved leaves and chanted, \"No violence.\"\nHowever, the police clamped down on the protest by firing teargas to disperse the participants.\nOn 17 October, another protest was held to coincide with the International Day for the Eradication of Hunger, which was a cry against the demolitions happening since 2023 in parts of Oworonshoki, Lagos State, which led to the displacement of hundreds of households.\nThe protesters marched from Ikeja Bridge to the Lagos State Government Secretariat in Alausa to demonstrate against hunger and the demolitions in Oworonshoki, which they say have rendered thousands of residents homeless.\nDuring the protest, the Chief Whip of the Lagos State House of Assembly, Fatai Mojeed, assured the protesters that their concerns would be conveyed to the Lagos State government. Yet on 26 October, demolitions were carried out in the area at midnight.\nThis ignited another protest, which was met with a severe police clampdown. Security forces dispersed the crowd using teargas. This reportedly caused injuries and the death of a baby and a five-year-old.\nOn 20 October, human rights activist and Sahara Reporters publisher, Omoyele Sowore, led a protest tagged #FreeNnamdiKanuNow, demanding the release of now convicted Nnamdi Kanu, the Biafra agitator who was sentenced in November to life imprisonment.\nWhen Mr Sowore fixed the protest's date, police authorities filed an ex parte motion before the Federal High Court in Abuja, urging the court to restrict the protesters from sensitive government sites, specifically the three armed zones of the Federal Capital Territory (FCT).\nThe court granted the request but approved the protest in areas outside of sensitive government sites, including the Presidential Aso Villa, the National Assembly, Force Headquarters, Court of Appeal, Eagle Square, and Shehu Shagari Way.\nDespite the approval, the police fired teargas at protesters multiple times in areas outside of the limit, including the Hilton hotel area and in the Jabi area of the FCT.\nEarlier this month, widespread insecurity in the country spurred a protest by the Nigerian Labour Congress (NLC). The protest started late and ended abruptly, leading some Nigerians to express disappointment with the NLC's lack of momentum.\nOn 10 December, mourners gathered to protest at the NHRC headquarters in Abuja against the alleged killing by the Nigerian military. This tragedy occurred during a military operation intended to clamp down on a communal feud in Adamawa State. The military refuted the claims. However, this set a tone for a conversation around human rights abuses by law enforcement officers.\nViolations by law enforcement officers\nFrom the beginning of the year to its end, gross violations by law enforcement officers consistently ranked among the top three abuses reported to the NHRC monthly.\nThe commission identifies police extortion, unlawful detention, and abuse of power as critical issues within the Nigeria Police Force. Specific instances of this abuse include the indiscriminate use of tear gas to break up demonstrations.\nPREMIUM TIMES examined this and found out that the indiscriminate use of teargas in 2025 not only succeeded in breaking demonstrations but also impacted economic rights, democratic rights, human dignity, and risked the lives of people.\nFor instance, during the #FreeNnamdiKanu protest in October, the police succeeded in grounding economic activities at a major building material plaza in the Jabi area of Abuja, after they fired teargas at protesters and traders.\nA woman named Sulifa narrated how a man sustained a forehead injury as a result of the commotion that ensued. The protest, organised by Mr Sowore, called for the release of Mr Kanu while his trial was ongoing. The Federal High Court in Abuja, where Mr Kanu was standing trial for terrorism, eventually convicted and sentenced him to life imprisonment in November.\nAlthough the Police Force Order mandates the use of lethal force as a measure of last resort in violent situations, the police continue using force, including teargas, disproportionately against gatherings.\nIn September, the police fired teargas at the supporters of Kogi Central Senator Natasha Akpoti-Uduaghan at the National Assembly gate in Abuja. The crowd had arrived with Mrs Akpoti-Uduaghan, celebrating her return to the Senate after a controversial six-month suspension.\nIncidents of rape of minors\nOther human abuses include the increase in reported cases of rape. The NHRC captured rape incidents in its monthly reports.\nSome cases reported in the media included one in April involving a man who was remanded for raping a 17-year-old. In May, the court remanded another for raping three sisters and one other.\nIn another June incident, Amos Isah, general overseer of Prophetic Voice of Fire Ministry International, Gwagwalada, was accused of raping a minor.\nThis case highlights a broader danger to young girls and points to a systemic failure in the judiciary. Despite the severity of the allegation, Mr Isah's case has been adjourned four times without him being arraigned. Instead, he resumed his pulpit after five weeks of detention.\nOn 25 November, a court in Lagos remanded a 58-year-old security guard for allegedly assaulting a teenager.\nWhile the list of incidents is not exhaustive, these cases ignited national discourse on the fragile state of security and abuses in the country.\nCitizens' involvement in human abuses\nBesides the abuse of rights by law enforcement agents, citizens also perpetrated human rights violations against one another in the year.\nSome youths and loyalists to the Benin Traditional Council, on 28 December, humiliated a filmmaker and former Managing Director of DAAR Communications, Don Pedro Obaseki, for allegedly criticising the Oba of Benin.\nDuring a football match Mr Obaseki took part in, some Benin youths attacked, stripped, and dragged him to the Oba's palace.\nA video trending on social media showed the cousin of the former governor being forced to crawl on his knees towards the palace chiefs.\nThe youths were reportedly aggrieved due to comments Mr Obaseki made at a meet-and-greet organised by the former governor, Godwin Obaseki.\nThis incident exposes a barbaric approach to conflict resolution and a blatant disregard for the rule of law, favouring chaos over civilised procedure. It also pointed to the fact that human rights abuse is not peculiar to law enforcement agencies. Under the reign of impunity, where there is scant regard for the rule of law, individuals also\nFreedom House ranking\nThe Freedom House 2025 freedom ranking adjudged Nigeria partly free in the broad metrics of Global Freedom and Internet Freedom.\nIt scored Nigeria 59 in global freedom and 44 in internet freedom, both on the scale of 0 to 100.\nGiving an overview of Nigeria's rights profile, the report noted that security challenges, including insurgencies, kidnappings, and communal and sectarian violence in the Middle Belt region (North-central), threatened the human rights of millions of Nigerians. \"The vibrant media landscape is impeded by criminal defamation laws, as well as the frequent harassment and arrests of journalists who cover politically sensitive topics,\" it added.\nIt also noted that while Nigeria has made significant improvements to the quality of its elections since 1999, when it transitioned from military rule to civilian rule, balloting has continued to be marred by irregularities.\nIt said corruption remains endemic in the petroleum industry, and military and law enforcement agencies often engage in extrajudicial killings, torture, and other abuses.\nIt added that civil liberties are undermined by religious and ethnic bias, while women and LGBT+ people face pervasive discrimination.\nJournalists targeted\nNigeria ranked 122 with a global score of 46.81 in the world press freedom index according to Reporters Without Borders (RSF).\nAccording to the Committee to Protect Journalists (CPJ), three journalists have been detained since August.\nFor instance, the Nigerian police charged Fejiro Oliver, the publisher of the state-based Secret Reporters, with cyberstalking for calling Delta State Governor Sherif Oborevwori and a senator's names on social media.\nMr Oliver was charged in two separate cases filed at the Federal High Court in Asaba, Delta State.\nOther documented incidents include the three-day detention of Francisca Azuka in August and Sadeeq Atanda, a reporter with the Foundation for Investigative Journalism (FIJ), who was detained in September.\nMr Atanda was rearrested again in December and later released following interventions. A common denominator shared amongst these journalists is that they were arrested using the Cybercrimes Act and strategic lawsuits against public participation (SLAPPs).\nThis Act has repeatedly been weaponised to intimidate journalists.\nThe CJID also launched the Openness Index Report. The report is Nigeria's first-ever subnational assessment of press freedom and civic space across the 36 states and the FCT.\nDrawing on responses from over 1,100 professionals, including journalists, editors, newsroom managers, and civil society actors, the CJID said the Index examines seven key diagnostic dimensions. These include legal protections, institutional guarantees, journalist safety, media diversity, internet freedom, civic engagement, and government transparency.\nThe report declared Imo State the worst place to be a journalist in Nigeria.\nIPI's blacklisting and commendation\nTo curb the excesses, in December, the International Press Institute (IPI) Nigeria blacklisted two serving governors and the Inspector-General of Police for violations of press freedom and democratic norms.\nOn 2 December, the IPI unveiled the \"Book of Infamy,\" naming Governor Mohammed Bago of Niger State, IGP Kayode Egbetokun, and Governor Umo Eno of Akwa Ibom State for their roles in press crackdowns in 2025.\nMr Bago was blacklisted following his order to close Badegi 90.1 FM, the detention of a People's Daily correspondent, and the reported assault of a Voice of America journalist by one of his commissioners.\nThe IPI also cited Governor Eno for media repression after he barred Channels TV reporters from the state's press centre in response to their report on his undemocratic comments.\nLastly, the IPI blacklisted the Inspector-General of Police, Kayode Egbetokun, for overseeing a culture of impunity within the police force, specifically regarding the frequent harassment and assault of journalists by officers.\nWhile the leaders were blacklisted, the IPI recognised the Director-General of the SSS, Adeola Ajayi, for his professional handling of media relationships, exemplary conduct and his efforts in ensuring the protection of journalists.\nRedress\nHowever, all was not entirely gloomy, as the court granted justice to some people whose rights had been violated.\nOne of such was the landmark judgment the court granted on 24 July. The Federal High Court in Lagos awarded N10 million against the police in damages for the violation of the fundamental rights of several peaceful protesters.\nSimilarly, a Court in Abuja sentenced a 27-year-old man, Abdulhameed Ahmed, to life imprisonment for raping and impregnating a minor in May 2026. A 19-year-old teacher, Abdullahi Abbas, also received a life sentence for sodomy and raping a nine-year-old boy.",
  "word_count": 2549,
  "scraped_at": "2026-02-14T12:13:31.771199"
}