{
  "article_id": "74ec30d0cd4e",
  "url": "https://www.the42.ie/ireland-luxembourg-friendly-2-6729434-Jun2025/",
  "title": "A game soon forgotten but it does pose the question : just what do we want from Ireland ? ",
  "date": "20250610T231500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ON AN EVENING like this, for a friendly like this, when summer beckons and we all just want the League of Ireland to return on Friday and dream of potential European adventures to come, a fair question to ask is this: just what do we want from Ireland?\nLong before Troy Parrott’s disallowed goal – a shame as the dinked finish was sublime – on 66 minutes it was a question to be considered, with thoughts splintering in different directions.\nHeimir Hallgrímsson has made it clear to his coaching staff and the players exactly what it is that he demands.\nWe detailed as much during the 1-1 draw with Senegal, and then Dara O’Shea spoke afterwards offering just a little bit more insight ahead of this trip to Luxembourg.\n“The manager is big on someone making a decision and then everyone else going with that,” the defender, who started once again alongside captain Nathan Collins, explained. “That’s the way he wants us to be. He’s drilled that into us in the sessions and I think everyone buys into that. As soon as someone sets the press off you need to go with them or else it’s not going to work.”\nOn the eve of this friendly with Luxembourg, with Collins sitting alongside him, Hallgrímsson emphasised once more that he wanted to see consistency in the performance and stability with the team shape.\nHe made five changes to his starting XI and was forced into another within 20 minutes when Ryan Manning replaced the injured Robbie Brady. But the message would have been the same. Ireland were content for Luxembourg to enjoy harmless possession – 61% over the opening half hour, dropping to 56% towards the end – with players scuttling from side to side and ensuring the distances between them didn’t become too vast so as to allow passing lanes opening up in behind.\nAnd some of this brings us back to what it is we want from an Ireland team. For the 300 or so travelling fans they didn’t get a goal to celebrate, substitute Jack Taylor smashing the crossbar on 87 minutes.\nWatching on TV, as so often can be the case when attention spans drift, there was a chance for a kind of introspection. Some of the banners being held up in one section of the ground were a catalyst.\n“Red card for violence against women,” was the English translation of one. In the corner of the screen, where an Irish tricolour with Ballybrack was emblazoned across the front, a few more messages stood out from the locals.\n“Let’s break the silence.”\n“Football is political.”\n“Red card to the football federation.”\nIndeed, midway through the first half, pockets of supporters then stood up with red cards.\nLuxembourg striker Gerson Rodrigues was the reason for the second such protest in as many games. He was given an 18-month suspended sentence after being found guilty of assaulting his former girlfriend, and last April he lost his appeal against the charges and subsequent fines.\nHis inclusion in the squad and place in the starting XI was the source of severe criticism. As half-time came and went, with O’Shea and Collins combining from a Will Smallbone free kick just before the break and the skipper heading off the post, it wasn’t simply judgement of the Rodrigues situation that lingered.\nIf you wanted to really look deep into it, when the Ireland team plays it is also a chance to see a reflection of the country it should represent.\nFour days ago, for example, more than 700 members of the Muslim community celebrated Eid al-Adha in a section of Croke Park. It is one of the holiest festivals – the feast of the sacrifice – yet it still resulted in protestors outside.\nThe day before that, the Minister for Justice, Home Affairs and Migration, Jim O’Callaghan, posted the following message on social media just before 8.30am. “Another deportation flight left Dublin last night and landed safely this morning in Lagos, Nigeria. There were 35 people on board who had received but had not complied with Deportation Orders.”\nAs was then detailed by The Journal, two of those children who were deported attended St James Primary school in Dublin 8 for the last three years. They had “become an integral part of the community there” and the principal explained how staff and pupils were “devastated” as the children were “part of our football team, part of our school fabric, part of our school lives.”\nThose children would have been keen to watch this Ireland team play tonight. They should have been able to talk about it with classmates on Wednesday morning.\nBy the time Evan Ferguson was shown a yellow card for stopping a counter attack 10 minutes into the second half, a broader examination of self, and the beliefs we hold, was underway.\nYes, there did seem to be more of an edge to the action on the pitch, Parrott following Ferguson into the book for accosting Danel Sinani after he was yellow carded for a cynical foul on Kasey McAteer, but part of the reason for thoughts drifting was down to reading extracts of a speech made by Pep Guardiola that emerged on the day of the game.\nThe Manchester City manager was receiving an honorary doctorate from the University of Manchester and made good use of the platform. “It’s so painful what we see in Gaza, it hurts my whole body. Let me be clear, it’s not about ideology. It’s not about whether I’m right, or you’re wrong. It’s just about the love of life, about the care of your neighbour.”\nThis 0-0 draw will be forgotten instantly, but if it can go some way to Ireland team building towards World Cup qualification then what a joy that will be.\nIreland needs it.",
  "word_count": 973,
  "scraped_at": "2026-02-14T12:35:16.042879"
}