{
  "article_id": "74ec24413d46",
  "url": "https://www.canberratimes.com.au/story/8483937/sam-kerr-has-knee-surgery-as-chelsea-rally-round-star/?cs=14280",
  "title": "Sam Kerr has knee surgery as Chelsea rally round star",
  "date": "20240111T230000Z",
  "domain": "canberratimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sam Kerr has undergone surgery on the anterior cruciate ligament injury which has dynamited her Olympic dream with the Matildas.\nSubscribe now for unlimited access.\nor signup to continue reading\nChelsea boss Emma Hayes revealed that the club's superstar striker had gone under the knife on Thursday after picking up the devastating injury during what the manager felt had merely been a \"simple and innocuous\" everyday movement on the training field.\nBut Hayes, who said she was \"gutted\" for her key 30-year-old striker, wouldn't pontificate about the future of Kerr at the club.\nThere has been much speculation, some suggesting that Kerr may have played her last game for the English champions and others saying she was planning to renew her contract, which is up at the end of the season.\n\"She's having surgery today. Gutted for her, gutted for the team,\" Hayes, who is herself leaving at the end of the season to take the reins of the US national team, told Sky Sports.\n\"These injuries happen in football, Sam knows that. I think the important thing is we are here to support her.\n\"The recovery, the rehab begins today.\n\"Today's about letting her know she's with her Chelsea family and we'll look after her.\"\nHayes revealed how the injury had happened during Chelsea's warm-weather training in Morocco.\n\"Doing a football action she does every day - turning and shooting. Something every simple and innocuous,\" she shrugged.\nAsked about the growing spate of serious knee injuries to top players in the women's game, the coach added: \"This is not the moment to talk about how those things happen. They happen in the men's and women's game.\n\"Sometimes, we have a confirmation bias around ACL injuries, but they happen in the sport regardless of why they happen.\"\nKerr, who's scored 99 goals in 128 matches for the club, is a huge miss for the rest of Chelsea's Women's Super League campaign, with the Blues going for a fifth WSL title in a row.\nShe'll also have to put on hold her dream of firing them to victory in the Champions League for the first time.\nWhile also missing Australia's Olympic qualifiers and, almost certainly, having to be on the sidelines at the Games themselves in Paris should the Matildas get there, Kerr's longer-term future was not up for debate with Hayes.\n\"The focus for Sam right now is on rehab. I'm sure when the time is right to discuss her future, that will come from Sam and the club - but Sam loves Chelsea and Chelsea loves Sam, so I think that's the most important thing to say on that front,\" said Hayes.\nMeanwhile, Chelsea carry on preparing for the start of their Women's FA Cup title defence on Sunday with a home tie against West Ham, the London club for whom fellow Matildas Katrina Gorry and Mackenzie Arnold and Kerr's partner Kristie Mewis all play.\n\"I know Sam would expect me to say nothing less - our focus now has to be on the players that are fit,\" said Hayes.\n\"I trust in the squad we have, and we have added to that as well. The focus and the attention has to go on the players that are here.\"\nAustralian Associated Press",
  "word_count": 543,
  "scraped_at": "2026-02-14T13:29:58.123209"
}