{
  "article_id": "74f8c244218b",
  "url": "https://www.yahoo.com/news/assaults-higher-education-signal-authoritarian-120050288.html",
  "title": "Assaults on higher education signal authoritarian intent",
  "date": "20241202T130000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Assaults on higher education signal authoritarian intent\nWestcott Hall at Florida State University. (Photo by Michael Moline/Florida Phoenix)\nDonald Trump was perfectly serious when he said he “loves the poorly educated.”\nAuthoritarians always love the poorly educated and the mis-educated. The well-educated, the readers, the questioners, those who demand evidence, gather facts, and trust verifiable information (as opposed to propaganda) are a threat.\nAspirants to dictatorhood know the first play is destroy education. Nip that critical thinking in the bud.\nThe Trumpist floor sample is New College of Florida, now a sad shadow of a once-distinguished, deeply beloved honors college, raped and pillaged by Ron DeSantis, over-paid college president Richard Corcoran, and under-qualified trustee Christopher Rufo, all in the name of fighting a phantom they call “woke.”\nDistinguished faculty have fled, admissions standards diminished, and costs per student are higher.\nNot surprisingly, the college has fallen 24 places in U.S. News and World Report’s rankings.\nTaking a wild guess here: Could it be because of dim bulb moves such as admitting academically unprepared jocks recruited from Christian schools and offering a course on the dangers of “woke,” taught by a Tucker Carlson-endorsed British commentator and right-wing comedian?\nThis is what you have to look forward to, America.\nRufo, who spread the dangerous nonsense about Black folks barbecuing cats in Ohio, has been summoned to Mar-a-Lago to discuss how best to cripple American higher education.\nUniversities embracing diversity and inclusion or teaching courses deemed insufficiently deferential to the “great” white men of the western world could lose all federal funding.\nIgnorance will reign; ignorance is the point.\nFlorida leads\nAs ever, Florida leads the way down the path to censorship and institutional stupidity.\nMore in U.S.\nState university boards of trustees have recently forced colleges to cut subjects that used to be part of the general education core curriculum.\nThe trustees axed 432 of 571 courses at Florida State, including classes in women’s cinema, African American history, issues in religion and sociology, and anything with “gender” or “race” in the title — anything that, as DeSantis and his henchpersons in the Florida Legislature claim, contains “unproven, speculative or exploratory content.”\nThe definition of “unproven, speculative or exploratory”? Whatever DeSantis and his pet reactionaries say it is.\nThe courses haven’t been removed completely: You can still take many of them as electives, but you can’t get gen. ed. credit for them.\nThat means many students will miss out on a chance to explore different perspectives on the world and expand their understanding of what it is to be human.\nAmerica, like Florida, is walking backward into its future.\nA bunch of Texas book vigilantes calling themselves a “citizens’ committee” had “Colonization and the Wampanoag Story” by Linda Coombs, a Native American historian, placed in the fiction section of their local public libraries.\nIt seems Coombs’ well-researched account how the arrival of Europeans affected native peoples didn’t match white folks’ preferred image of Pilgrims and Indians happily feasting on turkey before they settle down to an afternoon of football and online shopping.\nLibrarians, educators, and historians raised a ruckus, and the book was eventually returned to the nonfiction shelf where it belongs.\nStarting fires\nBut for every small victory against ignorance and spite, MAGA’s education arsonists start 100 more fires: attacking college classes here, banning books there, promoting the Bible as a public-school text.\nAs if this weren’t sufficiently damaging, Donald Trump wants to abolish the Department of Education.\nMAGAs do not realize — or do not care — that it funds early education projects, language learning initiatives, and programs for disabled and special-needs kids.\nIn addition, DOE’s civil rights office enforces laws preventing school violence and prohibiting discrimination on the grounds of race, ethnicity, religion, and disability, administers Pell Grants and student loans, sponsors apprenticeship programs, and grants money to Title I schools.\nWithout federal funding, the low-income students they serve will suffer.\nTo carry out his demolition plans, Trump has named former WWE CEO Linda McMahon to head DOE.\nHer qualifications include lying about holding a degree in education and participating in one of WWE’s fake fights in which she pretended to have been drugged by her husband so he could have sex with a model-turned-wrestler, then waking up just in time to kick him in the crotch.\nShe’s being sued by five former employees who claim she, along with other WWE executives, knew they were sexually assaulted repeatedly by their supervisor.\nJust the kind of person you want overseeing the safety and educational achievement of America’s youth.\nVivek Ramaswamy, one of Trump’s fantasy “government efficiency” honchos, loves the idea of blowing up DOE. He accuses public schools of encouraging kids to change gender and wants teachers’ unions to be abolished.\nAlong with increasingly unhinged billionaire Elon Musk, Ramaswamy wants to slash up to $2 trillion from the federal budget.\nNo one outside of Mar-a-Lago or your local psychiatric hospital takes those numbers seriously, but what do you want to bet the DOGE boys propose slashing a couple of hundred million here and a couple of million there from medical and scientific research — much of it done at universities?\n‘The enemy’\nVice President-elect J.D. Vance has declared, “Professors are the enemy.”\nHe’s quoting Richard Nixon.\nVance went to Yale, Trump to Penn, and both Ramaswamy and DeSantis hold degrees from Yale and Harvard, but you don’t have to graduate from an Ivy to get a world-class education. You can get one at plenty of state universities — assuming the politicians and their hand-picked trustees stop trying to regulate thought.\nLike reactionaries from Nixon to Reagan to Bush 43 and beyond, Trump’s bully-boy brain trust claim schools and colleges “indoctrinate” students into caring about social justice, seducing them into Marxism, feminism, and environmentalism.\nYet they emerged from their supposedly left-leaning institutions unscathed by progressivism, untroubled by empathy, and disinclined to critical thinking.\nWhat are they so afraid of?\nEducation is not supposed to make you comfortable; it’s not meant to reinforce what you think you already know. Education should challenge you, disturb you, and maybe even present possibilities you never knew existed.\nBut instead of shining an ever-brighter light on our world, the Trumpists want to make it narrower, nastier, and darker.",
  "word_count": 1041,
  "scraped_at": "2026-02-14T12:10:12.102183"
}