{
  "article_id": "74fce7b5c555",
  "url": "https://uk.style.yahoo.com/england-lionesses-millie-bright-rose-194300418.html",
  "title": "How England Lionesse Millie Bright rose the ranks to become iconic defender",
  "date": "20230216T210000Z",
  "domain": "uk.style.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How England Lionesses' Millie Bright rose the ranks to become iconic defender\nMillie Bright has been named as England captain for the FIFA Women's World Cup.\nShe is an imposing defender for both the England Lionesses and Chelsea’s Women’s teams - and her calm nature and experience makes her a vital member of both squads.\nRight now, she's with the rest of the Lionesses in Australia preparing for group matches against Haiti, Denmark and China.\nShe's also an Olympian, multiple trophy winner, and a proud dog mum - and the Lioness who always takes control of the music in the changing room...\nWhy did Millie Bright replace Leah Williamson as England captain?\nIn April this year, Leah ruptured her ACL when Arsenal played Manchester United. This meant that Millie, who was Leah's Vice Captain during the 2022 Euros, was given the opportunity to step up and take the reins.\nShe said: 'I’ve always been a big believer that you cannot put captains under the same umbrella. Everyone has their different qualities. Everyone has their own way of doing it, that’s the beauty of the game with so many leaders in the group as it is.'\nShe added that she would miss her teammate - and friend.\n'We had a really good connection, we learned about each other in how we complement one another.'\nWho is Millie Bright?\nHer football career began at the young age of just nine-years-old after she fell in love with the game while watching a friend play for Killamarsh Dynamos, a local team in Derbyshire.\nMillie signed herself up for the team and was scouted by Sheffield United, joining their academy team until the age of 16. She started her senior career at Doncaster Rovers before moving to Chelsea in 2015 and it was here that Millie really started to shine.\nThroughout her career, Millie Bright has won the Women’s Super League title four times, the Women’s FA Cup in three seasons, as well as reaching the final of the UEFA Women’s Champions League in 2021. She was also named the league’s Player of the Month in December 2019.\nWhen did Millie Bright start playing for England?\nHer success hasn’t been limited to the domestic stage either, the 5ft 9 (176cm) player was named England’s Young Player of the Year in 2016 after having a great season with the Lionesses.\nHaving captained the U23 team, Millie Bright is no stranger to a little pressure and flourished in the senior team, starting in every game in the Lionesses Euro’s run in 2017.\nAs a defender, her first England goal took a little longer than some of the other women on the team. Millie eventually found the back of the net, scoring her first goals in a 10-0 win over Luxembourg in 2021.\nWhat has been the biggest moment in Millie Bright’s career?\nThe 29-year-old has a calm and collected attitude on the pitch and was picked to Captain England for the first time in 2021 when they faced Canada in a friendly game.\nMore in Sports\nSarina Wiegman also picked Millie Bright as captain in two World Cup qualifiers but she lost out to Leah Williamson ahead of the Euro’s – definitely still a feat to celebrate though as she was named vice-captain and was a real figurehead for the whole of the tournament.\nSpeaking of the Euro’s, the record-breaking win was certainly a highlight for Millie sharing that 'the achievement still hasn’t sunk in'.\n‘I’ve spoke to a lot of older players who tell me I’ll only realise what I’ve achieved at the end of my career when I look back on it,’ she said.\nWiegman relied on Millie Bright as one of the most experienced members of the squad, using her reliability and calming presence at the back, to guide the team towards glory.\nWhat does Millie Bright do in her spare time?\nAfter such an incredible year with the Lionesses, Millie recently headed to Toronto with partner, Levi Crew, taking to her Instagram (@mbrighty04) to share snaps of their incredible trip. She also spent time relaxing over Christmas surrounded by lots of family members – we’re happy to see you taking some time out, Millie!\nMillie Bright also uses her platform as a Lioness to help raise money for two organisations close to her heart: Make A Wish UK and the Darby Rimmer Foundation, a charity formed by former footballer Stephen Darby and British Forces Veteran, Chris Rimmer which raises awareness on Motor Neurone Disease.\nMost recently, Millie has partnered up with another Motor Neurone charity called the My Name’5 Doddie Foundation, taking to Instagram to share the update.\nMillie Bright also loves sharing photos of her two pups on the social media platform. She has a Sausage Dog called Hera and a French Bulldog called Zeus – both incredibly adorable.\nYou can also find her on Twitter, @mdawg1bright.\nYou Might Also Like",
  "word_count": 819,
  "scraped_at": "2026-02-14T12:39:01.762494"
}