{
  "article_id": "7519ab158e31",
  "url": "https://www.the42.ie/ireland-tnt-6353785-May2024/",
  "title": "From Liberty Hall and a thousand fans , to 30 , 000+ at the Aviva and primetime TV",
  "date": "20240531T010000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE DIFFERENCE SEVEN years makes.\nApril 2017 was turbulent, to say the least, for the Republic of Ireland women’s national team.\nWho could forget Liberty Hall?\nThat extraordinary press conference, and the fight for fairness.\nFourteen players stood together, declaring themselves “the dirt on the FAI’s shoe” as they demanded improved treatment.\nAfter hitting headlines across the world, they boycotted training, and an international friendly against Slovakia six days later was thrown into doubt. A deal was eventually struck and the focus returned to football after the landmark stand-off.\nNot helped by the 2pm kick-off time on a Monday afternoon, just 1,037 fans came through the turnstiles at Tallaght Stadium for the 1-0 win over Slovakia.\nSupport and goodwill had been widespread, though this wasn’t exactly reflected in the attendance figure.\nOne day short of seven years on, a crowd of 32,742 turned out at the Aviva Stadium to watch Ireland’s Euro qualifier defeat to England.\nTomorrow night, they welcome Sweden to Lansdowne Road [KO 7.30pm, live on RTÉ 2]. The FAI said almost 30,000 tickets had been sold yesterday, so a similar bumper attendance is expected.\nSix players who featured against Slovakia in 2017 are in Eileen Gleeson’s current squad.\nKatie McCabe, who stayed quiet in the back row at Liberty Hall and was really starting to show promise in the green jersey, is now the Arsenal star, Ballon d’Or nominee, and Ireland captain who led her country to a first World Cup last summer.\nLouise Quinn, Denise O’Sullivan, Ruesha Littlejohn, Megan Connolly and Diane Caldwell have been mainstays through the years.\nSix of the fourteen players who fronted up in that press conference remain international regulars — Quinn, Caldwell, McCabe, Littlejohn, Niamh Fahey and Megan Campbell — while one of the main speakers, Emma Byrne, is one of Gleeson’s assistant coaches.\nThey laid firm foundations for the current day in April 2017.\n***\nApril 2024, and it’s one of those rare nice spring-to-summer Irish evenings.\nThere’s a palpable buzz in the air around Dublin 4. The sun has decided to make an appearance, and there are no shortage of green — and white — jerseys beginning to gather on the streets around Lansdowne.\nAt each and every turn, there’s signs of the exponential growth of women’s football. The local pubs, cafés and other establishments are filling up ahead of the kick-off, and the sense of occasion is heightening with each passing minute.\nAn announcement from RTÉ about TV coverage the previous afternoon drew quite a lot of attention. The Ireland v England game would take precedence on RTÉ 2, with Manchester City and Real Madrid’s Champions League clash moved to the Player and News Now channel instead. Proper order.\nThe reaction was mixed, as expected, but the viewing figures would later tell a story. The peak TV audience was 363k, the average 262k, and there were 44k streams on RTÉ Player.\nA peak audience on @RTEsport of 363k plus 44k streams on @RTEplayer for the @IrelandFootball WNT team. Average tv audience was 262k. Very strong performance considering Champs League at the same time. Well done to #COYGIG, @mariecrowe & RTE team. pic.twitter.com/I6E9n9vbrJ\n— Declan McBennettRTE (@RTEmcbennettd) April 10, 2024\nAcross the water, more people watched the Euro 2025 qualifier on ITV1 than made up the combined audience for Man City and Arsenal’s Champions League fixtures.\nAn average of 1,479,000 viewers tuned in to the free-to-air game, as opposed to Arsenal (617,000) and City (685,000). The peak was 2.1 million, compared to 1.1m and 1.3m respectively.\nMore people watched the Lionesses’ victory over the Republic of Ireland on ITV1 than the combined audience for Arsenal and Manchester City’s Champions League games last night.\n— Kathryn Batte (@KathrynBatte) April 10, 2024\nEngland’s game watched by an average of 1,479,000 viewers while Arsenal’s was 617,000 and City 685,000.\nAs the minutes ran down to kick-off in the stadium, the noise levels rose. Despite the result, they remained at a healthy decibel throughout.\n“32,000 Irish against us, as well as the 11 on the pitch, it was a good finish to hold out,” as England captain Leah Williamson said.\nHer Irish counterpart offered a typically honest assessment in the mixed zone afterwards, but reserved some praise for a “really special occasion”.\n“Someone asked me did I have a moment in terms of taking it all in, for us singing the anthem in front of 32,000 people on a Tuesday night is really special,” McCabe said.\n“It was incredible, it’s not an easy thing to do in midweek with people travelling and kids at school, so we really appreciate all the support from the fans.”\n“The fans were amazing tonight,” Denise O’Sullivan added.\n“They were so loud, so we thank them and hope they keep coming back.”\n***\nMay 2024, and that is indeed the challenge now.\nIreland need to keep building sustainable big crowds.\nWe’ve come a long way from the attendance of 1,037 that Monday afternoon in April 2017. But there’s still some way to go.\nIt’s imperative that those who went to the England game return for tomorrow’s blockbuster billing under Friday Night Lights.\nIreland have secured a result against top side Sweden before, so will be hoping to repeat the trick. That 1-1 draw in Gothenburg in April 2022 was a standout moment on their journey to date.\nThere has been significant growth on and off the field, and it now needs to filter down to the Women’s League of Ireland.\nAt Tolka Park, Greenogue and the likes, it’s generally a far from the glitz and glamour of international fixtures.\nAttendances and coverage must increase.\nLots done, but much more to do. We’re a long way from Liberty Hall now.",
  "word_count": 951,
  "scraped_at": "2026-02-14T12:48:03.322373"
}