{
  "article_id": "75229c629dec",
  "url": "https://www.gov.uk/government/news/downing-street-celebrates-international-womens-day",
  "title": "Downing Street celebrates International Women Day",
  "date": "20230308T201500Z",
  "domain": "gov.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Downing Street celebrates International Women's Day\nWomen from all walks of life have stepped into Downing Street this week to celebrate International Women’s Day 2023.\nWomen from all walks of life have stepped into Downing Street this week to celebrate International Women’s Day 2023.\nThis afternoon, female leaders and students from business, tech and the arts sector attended a reception in Downing Street. They browsed a showcase of some of the best female-led small businesses from across the UK, including Bag&Bones which, inspired by urban street culture, creates unique neon artwork that is both eco-conscious and energy efficient. Others, such as Luminary Bakery, use baking to provide employment and training for vulnerable women, and last year created 6820 hours of paid work for women coming from disadvantaged circumstances.\nSpeaking at the event, Prime Minister Rishi Sunak said:\nIt’s fantastic to be marking International Women’s Day with this celebration of women in business….\nI know the phenomenal work that goes into running a business. I know too from watching my mum running our family pharmacy, the huge sacrifices that are made. It takes guts, stamina and perseverance.\nYou do an amazing job. You create jobs. You enrich our country. And together, you demonstrate the power of women in business – with the huge amount of social good that you do…\nTo grow our economy, create jobs and build a more productive and innovative country, we need the transformative power of women. That’s what I will be championing as Prime Minister.\nAlso showcasing at the event were Saskia Patel, India Taylor-Smith and Jess Patel, co-founders of DeMoo, a clothing company that upcycles pre-loved clothes into unique hand-finished pieces, who said:\nThe energy in the room was infectious. To be surrounded by so many remarkable female business women was incredibly uplifting. A memory we will never forget.\nJoelle Drummond and Sarah McNena of UK’s top rated brewer of non-alcoholic beers, Drop Bear Beer Brewery said:\nIt has been an absolute honour to be invited to No 10 Downing Street. As two LGBT+ women in a male-dominated industry such as brewing, it’s so important to drive representation and it has been a fantastic opportunity to meet influential politicians and people from big business. When we started with just a big saucepan and a bigger dream, we could never have imagined we’d end up in No 10.\nDuring the event, the Prime Minister awarded Points of Light awards– to recognise four outstanding individuals from across the country who are making a positive change within their community and inspiring others.\nThis week’s award recipients are:\n- Deana Uppal – a British Indian entrepreneur and documentary-maker from London who set up charity ‘DKU Kindness Diaries’. The charity has supported thousands of disadvantaged families in India through weekly food and medicine donation drives.\n- Lisa-Marie Tonelli – a film producer from Newcastle who created the ‘North East International Film Festival’ in 2020. Entirely voluntary-led, it is one of the fastest-growing film festivals in the world, showcasing local creative talent alongside work byfilm-makers from 15 countries.\n- Matilda Handy, aged 9 from Nottingham, who created the ‘Postbox to Heaven’ scheme, allowing people to send cards and letters to loved ones who have passed away through a dedicated postbox. Following the popularity of the project, in which 100 letters were posted within a month, 36 other postboxes are being set up in cemeteries UK-wide.\n- Patricia White from Birmingham who leads ‘Suited for Success’, an organisation tackling unemployment in the city by giving out free application advice, interview coaching, and interview wear.\nToday, the government confirmed a package worth over £600 million to support schools to improve their sport offer for all pupils and introduce a new school standard to offer girls and boys the same access to sports at school.\nFormer Lioness midfielder Jill Scott, Lionesses Beth Mead and Ellen White joined the Prime Minister in Downing Street to lead a football training session for local primary and secondary schoolgirls.\nThe week kicked off with a speed mentoring session hosted by Culture Secretary Lucy Frazer on Monday, where girls and young women were given the chance to be mentored by leading women from across several sectors including: Ella Mills of Deliciously Ella, Stemette Anne-Marie Imafidon MBE and designer Kelly Hoppen CBE.\nThe event was delivered together with The Girls’ Network, a charity organisation which partners with secondary schools and colleges across England to offer girls, aged 14-19, a year-long mentoring programme to support their ambitions.\nOn Tuesday, the Minister for Women, Maria Caufield, and the government’s Women’s Health Ambassador Professor Dame Lesley Regan hosted a roundtable attended by clinicians, female GPs and women’s health charities. They discussed the progress made on implementing the Women’s Health Strategy and the next steps to improve women’s experiences of health services.\nThis followed a visit by the Minister for Women to the Elizabeth Garrett Anderson Wing at University College London Hospitals NHS Foundation Trust on Monday, where she met leading researchers and discussed their work to improve health outcomes for women and babies and the importance of women working in STEM.\nFinally, on Friday, tech entrepreneur Anne Boden MBE will chair a meeting on the Women’s High Growth Enterprise Taskforce in Downing Street, where the taskforce will examine hot and cold spots for female-led high growth enterprises across the country to inform the next stage of their work to identify how we can support the growth of female-led business.\nIn the run up to this International Women’s Day, this government has been delivering on the priorities of women across the board, including on health, safety and careers.\nOn health\nToday, we have announced £25 million investment over the next two years to create new women’s health hubs, which will provide essential services for menstrual problems, contraception, pelvic pain and menopause care.\nThis week we announced Helen Tomlinson as the first-ever menopause employment champion earlier this week to improve workplace support, following on from last month’s launch of a new pre-payment certificate for HRT to help around 400,000 women save hundreds of pounds a year on prescription charges.\nIn January we announced new funding to speed up cancer diagnosis for tens of thousands of women with new NHS mobile breast cancer screening units and life-saving upgrades to service. Additional funding has also been made available to 16 organisations across England who are implementing innovative ways to raise awareness, tackle the stigma and improve outcomes for women in the workplace, including Maternity Action, Mind and Fertility Network UK.\nOn safety\nNo woman or girl should ever have to feel unsafe in her home or community and the government is taking action to stamp out appalling crimes against women.\nLast month, the Home Secretary announced that we are - for the first time - requiring police forces to treat tackling violence against women and girls as a national threat, and set out a range of measures to crack down on domestic abusers. This includes toughening up the way offenders are managed and taking action to ensure the most dangerous domestic abusers are recorded on the Violent and Sex Offender Register, including those convicted of controlling or coercive behaviour where they are sentenced to twelve months or more.\nThe Home Office is also well on its way to putting an extra 20,000 more police officers on our streets, and continues to roll out crime prevention measure including improved CCTV and street lighting through our Safer Streets Fund.\nThe Justice Secretary has also raised the age of marriage and civil partnership to 18 in England and Wales, and made it a criminal offence to exploit vulnerable children by arranging for them to marry, under any circumstances.\nOn business\nThis government is also committed to supporting the growth of female-led business and providing opportunities for girls to get into high-skilled, high paid jobs.\nLast week, Business and Trade Secretary and Women & Equalities Minister Kemi Badenoch announced that FTSE 350 companies have met the target of 40% Women on Boards three years ahead of the 2025 deadline and has urged business to keep up this momentum to achieve balance in leadership positions as well as in boardrooms.\nIn order to help even more women into business, the government-founded women-led high growth enterprise taskforce, has been working to identify the barriers that women entrepreneurs face and look at how we can work together to remove these and pave the way for our ambition to increase the number of female entrepreneurs by 50% by 2030, equivalent to 600,000 new entrepreneurs.",
  "word_count": 1419,
  "scraped_at": "2026-02-14T13:03:00.758766"
}