{
  "article_id": "75256c7633fa",
  "url": "https://www.90min.com/five-things-learned-england-goalless-draw-against-usa",
  "title": "Five things we learned from England goalless draw against the united states ",
  "date": "20241203T141500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Five things we learned from England’s goalless draw against the USA\n- England drew 0-0 with Emma Hayes’ USA team on Saturday evening\n- Their final game of the year will see them take on Switzerland on Tuesday\n- The goalkeeper debate is wide open while Sarina Wiegman must find balance\nEngland’s 2024 campaign will draw to a close on Tuesday night when they take on Switzerland at Bramall Lane in Sheffield.\nIt’s a crucial international window for Sarina Wiegman and her side as they ramp up preparations for next summer’s European Championships. Emma Hayes’ USA side represented a perfect opponent as the Lionesses tested themselves against one of the world’s best.\nNeither side could break the deadlock at Wembley Stadium on Saturday evening, although the visitors came closest to scoring in the second half with a sustained spell of pressure. For England, there were plenty of positives, and plenty of learnings to take into their Nations League and Euro campaigns.\n90min have assessed the five things we learned from Saturday’s stalemate…\nGoalkeeper debate is wide open\nMary Earps or Hannah Hampton. That is the decision Wiegman will need to make ahead of next summer’s Euros in Switzerland.\nThe number one spot has been claimed by Earps for the previous two tournaments, and the 31-year-old’s performances have earned her a number of individual accolades over the years. However, Hampton’s form for Chelsea since her move from Aston Villa in 2023 has moved her up the pecking order, and for the first time in a while, there is genuine competition.\nEarps was given the nod on Saturday evening against the USA, and she more than justified her selection with a handful of vital saves. With the Nations League around the corner ahead of the Euros, it’s set to be a significant few months for both goalkeepers as they battle it out for the shirt.\nWiegman needs to find balance\nEver since the Euros in 2022, England have struggled to rediscover the formidable form that won them the trophy. Even at the World Cup in 2023, they did enough to get over the line and win games, but defensively they looked vulnerable and could be cut through with ease.\nEngland’s defensive vulnerabilities were also on full display in October when they were beaten 4-3 by Germany at Wembley Stadium. For a team that boasts some of the best defenders in the world, they looked like a side bereft of any structure or solidity.\nThe tweaks the manager made against the USA on Saturday paid off. Even when under sustained pressure from the Olympic champions, England looked capable of clearing their lines. Only when they were loose in possession did they gift their opponent clear cut openings.\nThe problem, however, was further up the pitch. England struggled in the final third and mustered up just a single attempt on target the entire game. The challenge for Wiegman will be finding the perfect balance between being tough to break down while still creating chances of their own.\nAggie Beever-Jones still awaiting opportunity\nOne of England’s greatest assets in recent years has been their depth up front. At the Euros, they had Ellen White, and at the World Cup, they had both Alessia Russo and Rachel Daly competing for minutes.\nNow, Russo is England’s sole striker option. The Arsenal star is more than deserving of the shirt, but they risk becoming overly reliant on the 25-year-old making something happen.\nAggie Beever-Jones is still young, and maybe Wiegman feels like she isn’t ready, but the lack of minutes she’s been given over the last few camps has been surprising. The 21-year-old doesn’t start every week for Chelsea, but she’s still able to produce decent numbers when called upon – it’s time she’s given the opportunity to do the same for England.\nJess Park stakes claim\nWith Ella Toone sidelined due to injury, this has been the perfect camp for England’s up and coming midfielders to make a statement. Grace Clinton has impressed in every appearance, but so too has Jess Park.\nThe Manchester City star was given the nod against the USA and it was a mature display from the 23-year-old, alongside Georgia Stanway and Keira Walsh. She was the bright spark and was fearless in possession, and most of England’s promising attacks came through her.\nOne final chance to experiment\nWith the Nations League set to kick off in the new year, this international break is Wiegman’s final opportunity to experiment. She did so to an extent against the USA, with Jess Naz and Park coming into the fold.\nThe Switzerland game on Tuesday represents an even greater chance to try things out. Beever-Jones must get some minutes, while the likes of Clinton, Laura Blindkilde Brown and Ruby Mace will be interesting to see in midfield.",
  "word_count": 801,
  "scraped_at": "2026-02-14T12:49:12.232978"
}