{
  "article_id": "753e3ced4bae",
  "url": "https://island.lk/sinopecs-first-fuel-shipment-expected-to-arrive-in-august-state-minister/",
  "title": "Sinopec first fuel shipment expected to arrive in August – State Minister – The Island",
  "date": "20230723T141500Z",
  "domain": "island.lk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Latest News\nSinopec’s first fuel shipment expected to arrive in August – State Minister\nState Minister of Power and Energy D. V. Chanaka said that the first fuel shipment of China’s Sinopec, will arrive in the country early next month and that steps will be taken to replace the fuel price formula with a maximum retail price (MRP) that will be stipulated by the government, thereby creating a fuel competitiveness that benefits the country.\nHe expressed these views today (23) during a press conference themed ‘Collective Path to a Stable Country’ held at the Presidential Media Centre (PMC).\nLatest News\nHigh risk of rain in marquee India vs Pakistan T20 World Cup game in Colombo\nTwo days out from a will-they-won’t-they India vs Pakistan contest, the weather in Colombo has largely been clear. But the Sri Lanka Department of Meteorology has warned of a low-pressure system developing in the Bay of Bengal, which indicates a high risk of rain that could disrupt the marquee World Cup game on Sunday evening.\nThe weather forecast for Sunday in the Khettarama area of Colombo, where the R Premadasa Stadium is located, shows warm and humid conditions to start the day, with temperatures peaking around 30° to 31°C. However, scattered thunderstorms are predicted throughout the afternoon, with a 50-70% chance of rain.\nWith the game set to begin at 7pm local time, some models suggest heavy thundershowers in the hours before the scheduled start, which might lead to a delayed toss, or a shortened game. While clouds are expected to linger, some forecasts indicate a slight clearing trend after 8pm, though isolated showers remain possible through the night.\nThe Premadasa, however, features a sophisticated drainage system and specialised ground staff protocols designed to handle Colombo’s tropical downpours. And unlike many international venues that only cover the pitch, the Premadasa has enough covers to protect the entire playing area. This prevents the outfield from soaking up water in the first place.\nThe staff also manually push water from one cover to the next until it reaches the perimeter drains. This method is often faster and more effective than using mechanical super soppers. Under standard conditions, the ground typically becomes fit for play within 45 to 60 minutes after heavy rain stops.\nThere’s also some rain expected the day before, on Saturday, which could disrupt India’s scheduled training session at the ground.\nThe weather in Colombo has otherwise been largely dry, making any rain unseasonal for this time of the year. So far, none of the matches in Sri Lanka of this T20 World Cup has been impacted by inclement weather, even though there have been a few close calls – such as Sri Lanka’s match against Oman, where rain was predicted but fell hours after the match ended.\nBoth India and Pakistan, meanwhile, currently have four points each after playing two games. But India are ahead in Group A due to a superior net run rate of 3.050 to Pakistan’s 0.932. If rain in Colombo forces a washout, both sides will get one point each as there is no reserve day for group-stage matches.\n[Cricinfo]\nLatest News\nNew Zealand and South Africa look ahead to Super Eights in low-pressure contest\nWednesday afternoon’s all-time classic in Ahmedabad was a game of inches. A couple of inches this way or that, and Saturday night’s game, at the same venue, could have had a whole lot more riding on it.\nBut as things stand, New Zealand and South Africa look set for safe passage out of Group D and into the Super Eights, leaving Afghanistan bemoaning fate and small margins, and praying for miracles from UAE and Canada – or is probably unlikely to cut it.\nThere’s no mystery about which of the Super Eights groups New Zealand and South Africa will end up in either. Pre-tournament seedings already decided that.\nSo this game, which could have been one of the tastiest clashes of the tournament, pitting two title contenders and featuring several tactical sub-plots, doesn’t really have much riding on it at all.\nIt could still turn out to be one of the games of the tournament, of course, because that can happen when you put two T20 teams of elite power and skill on the field together. But the title of this section, big picture? There isn’t much of it at all.\nHe is one of South Africa’s greatest cricketers of all time, but is Kagiso Rabada under some pressure to hold his place in their first XI in T20Is? He has the pace and skills to operate in any phase, but he has had an indifferent time in T20Is of late. Rabada averages 34.55 with the ball since 2025, with an economy rate of 9.82. But in his defence, he has only played nine T20Is in this time, thanks to injury and workload management. The chaotic 20th over against Afghanistan, during which Rabada overstepped twice, shouldn’t put his spot in danger. But he’ll want to pick himself up and remind the world of the impact he can make at his best.\nRachin Ravindra looks like he could be the archetypal modern-day T20 No. 3, but his international record in the format is… not good, with a strike rate of 135.19, an average of 19.09, and just three half-centuries in 40 innings. All that doesn’t take away from Ravindra’s potential – which he has shown in flashes in recent weeks, in a pair of cameos against India – and he could make a big difference on Saturday if he and his fellow left-handers in New Zealand’s line-up could get stuck into Keshav Maharaj’s left-arm spin.\nNew Zealand played the same XI against both Afghanistan and UAE, and they seem unlikely to make any changes unless a used pitch prompts them to pick an extra spinner in Ish Sodhi.\nNew Zealand (probable): Tim Seifert (wk), Finn Allen, Rachin Ravindra, Glenn Phillips, Daryl Mitchell, Mark Chapman, Mitchell Santner (capt), James Neesham, Matt Henry, Lockie Ferguson, Jacob Duffy\nSouth Africa replaced seam-bowling allrounder Corbin Bosch with spin-bowling allrounder George Linde when they played Afghanistan. They might, however, worry about having two left-arm fingerspinners in Linde and Maharaj against a New Zealand side with four left-hand batters in their likely top eight. Bosch, therefore, could come back in.\nSouth Africa (probable): Aiden Markram (capt), Quinton de Kock (wk), Ryan Rickelton, Dewald Brevis, David Miller, Tristan Stubbs, Marco Jansen, Corbin Bosch/George Linde, Kagiso Rabada, Keshav Maharaj, Lungi Ngidi\n[Cricinfo]\nLatest News\nTeacher recruitment examinations will be conducted in accordance with the relevant court decisions – PM\nPrime Minister Dr. Harini Amarasuriya stated that the forthcoming two teacher recruitment examinations will be conducted in accordance with the relevant court decisions pertaining to the ongoing legal proceedings and further noted that, taking into consideration the requests received, steps have been taken to make a request to Court’s approval to revise the conditions of the effective date of degree completion.\nThe Prime Minister made these remarks while addressing a meeting held at Monaragala Royal College to brief education authorities of the Monaragala District on the new education reforms.\nUnder the new education reforms, Smart Boards will be provided to 132 schools in the Monaragala District as part of the program to equip secondary schools with modern technology. As a symbolic step under this initiative, Smart Boards were presented to 10 secondary schools under the Prime Minister’s patronage. This program is being implemented with the intervention of the Digital Task Force operating under the Prime Minister’s Office. It was also emphasized that a new digital policy, formulated with special attention to child protection, will be introduced in April.\nAs part of her visit to the Monaragala District on the 13 th of February, the Prime Minister observed the implementation of the new learning methodologies introduced for Grade One under the new education reforms. She visited Kumbukkana Sri Shanmugam Tamil Maha Vidyalaya and Maduruketiya Maha Vidyalaya in Monaragala to observe the educational activities of Grade One students.\nConsidering the increase of student numbers and the development of infrastructure facilities, the Prime Minister also approved a proposal submitted by the School Development Society to rename Maduruketiya Maha Vidyalaya as Monaragala Dharmaraja Maha Vidyalaya.\nTeachers briefed the Prime Minister that the new education system, supported by revised workbooks and activity-based learning methods, has proven to be effective, with students participating enthusiastically.\nAddressing education officials further at the meeting held at Monaragala Royal College, the Prime Minister stated:\n“Although this will not provide a complete solution to the existing teacher vacancies, these examinations can offer considerable relief. According to the Court’s previous determination, the effective date of degree completion had been set as 30.06.2025. However, considering numerous requests and following the cabinet approval we have sought Court’s consent to revise this date. We will act in accordance with the decision granted.\nFunds allocated for school infrastructure must be utilized transparently and in line with proper planning, and progress must be reported accordingly. We cannot move forward by dividing ourselves along national, provincial, rural, or urban lines. As education authorities, you must make swift and accurate decisions based on correct data.\nFurther, discussions are already underway within the Piriven Committee of the Ministry of Education to develop Piriven education and to address the issues faced by Piriven teachers.”\nThe event was attended by the members of the Maha Sangha, Uva Province Governor Attorney-at-Law Kapila Jayasekara, Deputy Minister of Trade and Commerce R.M. Jayawardhana, Member of Parliament Ajith Agalakada, Uva Provincial Education Secretary Nihal Gunarathne, and several officials from the education sector.\n[Prime Minister’s Media Division]\n-\nFeatures6 days ago\nMy experience in turning around the Merchant Bank of Sri Lanka (MBSL) – Episode 3\n-\nBusiness6 days ago\nRemotely conducted Business Forum in Paris attracts reputed French companies\n-\nBusiness6 days ago\nFour runs, a thousand dreams: How a small-town school bowled its way into the record books\n-\nBusiness6 days ago\nComBank and Hayleys Mobility redefine sustainable mobility with flexible leasing solutions\n-\nBusiness3 days ago\nAutodoc 360 relocates to reinforce commitment to premium auto care\n-\nMidweek Review3 days ago\nA question of national pride\n-\nOpinion2 days ago\nWill computers ever be intelligent?\n-\nMidweek Review3 days ago\nTheatre and Anthropocentrism in the age of Climate Emergency",
  "word_count": 1710,
  "scraped_at": "2026-02-14T13:27:04.562819"
}