{
  "article_id": "7567c3ed7248",
  "url": "https://www.uefa.com/womensfinalissima/news/027a-1670620b3d3b-2d52c63434c2-1000--women-s-finalissima-the-teams/",
  "title": "Women Finalissima 2023 : Meet England and Brazil",
  "date": "20230329T113000Z",
  "domain": "uefa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Women's Finalissima 2023: Meet England and Brazil\nThursday, April 6, 2023\nArticle summary\nThe full lowdown on Women's Finalissima contenders England and Brazil.\nArticle top media content\nArticle body\nEngland took on Brazil in the first Women's Finalissima: we introduce the teams.\nWhat is the Women's Finalissima?\nThe meeting of Women's EURO winners England and Copa América Femenina champions Brazil is part of the expansion of the cooperation between UEFA and CONMEBOL, which notably includes women's football, futsal and youth categories, the exchange of referees, and technical training schemes. There had already been a men's Finalissima (won by Argentina at Wembley), a Futsal Finalissima (won by Portugal in Buenos Aires), and an Under-20 Intercontinental Cup (won by Benfica in Montevideo).\nENGLAND\nWorld Cup best: third place (2015)\nEURO best: winners (2022)\nHow they became 2022 European champions\nGroup A: winners\n06/07: England 1-0 Austria (Mead 16)\n11/07: England 8-0 Norway (Stanway 12p, Hemp 15, White 29 41, Mead 34 38 81, Russo 66)\n15/07: Northern Ireland 0-5 England (Kirby 41, Mead 45, Russo 48 53, Burrows 76og)\nQuarter-finals\n20/07: England 2-1aet Spain (Toone 84, Stanway 96; Esther 54)\nSemi-finals\n26/07: England 4-0 Sweden (Mead 34, Bronze 48, Russo 68, Kirby 76)\nFinal\n31/07: England 2-1aet Germany (Toone 62, Kelly 110; Magull 79)\nCoach: Sarina Wiegman\nAppearing more than 100 times for the Netherlands between 1987 and 2001, Wiegman became coach of ADO Den Haag in 2007, winning the Dutch double in 2011/12 and KNVB Cup a year later. In 2014, she was appointed Netherlands assistant coach, and she had a brief spell in caretaker charge in 2015 before taking over the helm permanently at the start of 2017.\nThat was just a few months ahead of hosting UEFA Women's EURO 2017, which the Netherlands ended up winning for the first time. Two years later, they showed it was no fluke as Wiegman's side reached the FIFA Women's World Cup final, losing to the United States\nIn 2020, the hosts of the next Women's EURO, England, announced Wiegman would take over as their coach following the 2021 Olympics (where the Netherlands reached the quarter-finals). Wiegman had a spectacular first season as England boss, her team scoring more than 100 goals and claiming their first major title with the Women's EURO triumph at Wembley (making Wiegman the first coach to win the tournament in charge of two different nations).\nWiegman, known for her attacking style, was named FIFA women's coach of the year in 2017 and 2020 and took UEFA's award in 2021/22.\nKey player: Leah Williamson\nThe captain is a ball-playing centre-back who can also be deployed as a defensive midfielder, a role in which Wiegman initially used Williamson. By the time of EURO, the Arsenal player reverted to being used at the back in a rearguard only breached twice in the seven games at Women's EURO.\nWilliamson has been on Arsenal's books since she was nine and made her first-team debut in 2014 aged 17 in a UEFA Women's Champions League quarter-final. In more than 200 appearances she has aided Arsenal to one league title and several other trophies, most recently the League Cup in March.\nFor her country, WIlliamson played at the 2013/14 WU17 EURO in England; the hosts did not win that tournament but of course she was to lift the trophy at Wembley when the Lionesses claimed their first major senior honour in 2022. Her senior debut had come in 2017 and four years later new coach Wiegman appointed Williamson captain.\nKey stats\n- England's 22 goals at Women's EURO 2022 broke the single-tournament record set in 2009 by Germany (when the Lionesses were EURO runners-up for the second time, having also taken silver at the inaugural 1984 edition).\n- Not only did Mead equal the record of six goals at a Women's EURO (shared with Inka Grings in 2009 and Alex Popp in 2022), but Alessia Russo posted a new best of four as a substitute.\n- The 87,192 crowd for the Women's EURO 2022 final was a new best for a female international in Europe, and the highest for any men's or women's EURO finals match. They have also twice attracted crowds of 75,000+ for Wembley friendlies.\nBRAZIL\nWorld Cup best: runners-up (2007)\nCopa América best: winners (1991, 1995, 1998, 2003, 2010, 2014, 2018, 2022)\nHow they became 2022 South American champions\nGroup B: winners\n09/07: Brazil 4-0 Argentina (Adriana 28 58, Bia 36p, Debinha 87)\n12/07: Uruguay 0-3 Brazil (Adriana 32 48, Debinha 45+2)\n18/07: Venezuela 0-4 Brazil (Bia 22, Ary Borges 51, Debinha 58 65)\n21/07: Brazil 6-0 Peru (Duda 1, Duda Sampaio 17, Geyse 41, Duda Santos 44p, Fe Palermo 48, Adriana 50p)\nSemi-finals\n26/07: Brazil 2-0 Paraguay (Ary Borges 16, Bia 28)\nFinal\n30/07: Colombia 0-1 Brazil (Debinha 39p)\nCoach: Pia Sundhage\nThe Sweden forward was one of the game's greats as a player, not least when she converted the decisive penalty to win the first Women's EURO in 1984 against England in Luton. In all, she got 71 goals in 146 international appearances, and was the first woman to score at Wembley in a 2-0 friendly win against England in 1989. She also helped Jitex win four Swedish titles.\nSundhage was Hammarby player-coach from 1992 to 1994 and worked as an assistant at Vallentuna, AIK and Philadelphia Charge, before taking the helm of Boston Breakers in 2003 and topping the WUSA regular-season table. After spells with Kolbotn and Örebro, Sundhage served as assistant to Marika Domanski-Lyfors with 2007 World Cup hosts China.\nLater that year, Sundhage became coach of the United States and went on to win the Olympic tournaments of 2008 and 2012, also reaching the 2011 World Cup final. At the end of 2012 (when she was named FIFA coach of the year), Sundhage took charge of her native Sweden and helped them to the Women's EURO 2013 semis as hosts, and then 2016 Olympic silver.\nSundhage moved on to become Sweden U17 coach in 2018 and the following year took command of Brazil, winning the 2022 Copa América.\nKey player: Bia Zaneratto\nIn the absence of injured Debinha and Marta, Brazil were shorn of a combined 173 international goals. However, Sundhage has other options, notably Bia, capped more than 100 times while still in her 20s.\nScorer of three goals in the 2022 Copa América, and six more when Brazil also won four years earlier, the forward for Copa Libertadores holders Palmeiras is a familiar figure on the big stage having also been to three World Cups and two Olympics.\nKey stats\n- Brazil have won eight of the nine editions of the Copa América, only missing out in 2006 after losing the final 2-0 to hosts Argentina.\n- In 2023, they will keep up their record of appearing at every World Cup final tournament (this will be the ninth). They have also featured at every Olympic women's football tournament (only matched by the US and Sweden), taking silver in 2004 and 2008.\n- In 2022, they became the first team to triumph at the Copa América Femenina without conceding a goal, and for the second straight tournament won all their fixtures.",
  "word_count": 1195,
  "scraped_at": "2026-02-14T12:25:15.331852"
}