{
  "article_id": "75920efa15d9",
  "url": "https://www.lbc.co.uk/article/rory-mcilroy-new-years-honours-tax-5HjdPyZ_2/",
  "title": "Rory McIlroy missing from New Year Honours list  due to tax concerns  ",
  "date": "20251230T023000Z",
  "domain": "lbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rory McIlroy missing from New Year's Honours list 'due to tax concerns'\nMcIlroy’s name was nowhere to be seen despite his involvement in Europe’s victorious Ryder Cup team and winning the Masters to complete a career grand slam.\nRory McIlroy has been denied a place in the New Year Honours list after an alleged intervention by tax officials.\nListen to this article\nThe golfer’s exclusion from the list has been described as one of the most surprising omissions after he became the first European in history to win all four of golf’s majors this year.\nUp to 1,157 people received honours this year, including many athletes and sporting figures from England’s victorious women’s football and rugby teams to Dame Jayne Torvill and Sir Christopher Dean, who took home the Olympic gold at the 1984 Winter Games and saw success at the World, European and British Championships.\nBut McIlroy’s name was nowhere to be seen, despite his involvement in Europe’s victorious Ryder Cup team and winning the Masters to complete his career grand slam.\nAccording to the Telegraph, this could be because he was among thousands of wealthy individuals who put cash into a scheme that ended up being challenged by the HM Revenue & Customs (HMRC).\nRead more: Idris Elba, Torvill and Dean, Gabby Logan and Lionesses lead honours list\nRead more: How does the British honours system work?\nA Whitehall source told the paper this snub was comparable to that of Sir David Beckham, whose knighthood was held up for years after a “red flag” was put on his nomination following an investment he made, with HMRC later deeming it to be a tax avoidance scheme.\nHe finally received his knighthood earlier this year in the King’s Birthday Honours.\nIn 2015, the tax collector opened an investigation into whether investments made by McIlroy and others had unfairly avoided tax by exploiting a programme which allows investors to claim up to 100 per cent tax relief on expenditure.\nThe Business Premises Renovation Allowance scheme was legal, but HMRC said at the time it could demand payments for any tax viewed as being unfairly avoided.\nHowever, there is no suggestion he has ever deliberately attempted to dodge his tax obligations.\nLBC has contacted McIlroy’s team, the cabinet office and HMRC for comment.\nAlso included in this year’s list was The Sports Agents co-host Gabby Logan and broadcaster Clive Tyldesley. Both have been made an Officer of the Order of the British Empire (OBEs) for services to broadcasting and charity.\nEngland’s Lionesses feature heavily on the list after their Euros win in the summer – with captain Leah Williamson made a Commander of the Order of the British Empire (CBE).\nAlex Greenwood, Keira Walsh, Georgia Stanway and Ella Toone, who were all part of the side that beat Spain in the final in Basel, Switzerland, in July, become MBEs.\nWhat are honours for?\nHonours as part of orders of chivalry have been given by monarchs since the Middle Ages.\nIn recent times, the British honours system has recognised people who have “made achievements in public life” and “committed themselves to serving and helping Britain”.\nIt acknowledges long-term volunteers, innovators, entrepreneurs, individuals displaying “moral courage”, those making a difference in their community or field of work or people improving life for others less able to help themselves.\nHonours are given to people involved in a range of fields, including sport, health, science and technology, education, business, and the arts and media.\nGallantry awards recognising bravery can also be given to members of the armed forces and the emergency services, as well as civilians.",
  "word_count": 600,
  "scraped_at": "2026-02-14T13:07:05.908694"
}