{
  "article_id": "75ba94875e6d",
  "url": "https://markets.businessinsider.com/news/stocks/club-tigres-signs-multi-year-deal-with-tradable-bits-for-fan-engagement-1033156050",
  "title": "Club Tigres Signs Multi - Year Deal with Tradable Bits for Fan Engagement",
  "date": "20240312T171500Z",
  "domain": "markets.businessinsider.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mar. 12, 2024, 12:00 PM\nSAN NICOLÁS DE LOS GARZA, Mexico and VANCOUVER, British Columbia, March 12, 2024 (GLOBE NEWSWIRE) -- Club Tigres announced today it is partnering with Tradable Bits, a leading provider of fan engagement, data, and marketing solutions, to deliver the very best engagement experience to fans.\nThe deal follows a highly successful pilot program between Club Tigres and Tradable Bits that saw the launch of more than a dozen fan engagement campaigns designed to harness the power of Tradable Bits’ proprietary fan CRM platform. In less than six months, the program generated a 30% growth in Club Tigres’ fanbase, while also establishing new assets for Club Tigres’ sponsor base that includes Bitso, adidas, Viva Aerobus, Afirme, and more.\nMiguel Hernández is Brand Director for Club Tigres, where he oversees the Tradable Bits’ relationship and is responsible for the development of the brand strategy of Club Tigres through its different points of contact. He said of the collaboration, “Club Tigres’ millions of fans are among the most passionate in the whole of football. We owe them meaningful, personal connections to the Club. This is something that can only be achieved in partnership with Tradable Bits whose innovative fan engagement platform is what’s driving our fan outreach campaigns. Tradable Bits ensures we understand our fans and can activate on that data quickly and meaningfully.”\n“We look forward to expanding our partnership with Club Tigres, a Club that is truly at the forefront of sports marketing and a case study for best-in-class fan engagement models,” said Darshan Kaler, Chief Executive Officer, Tradable Bits. “Together with the innovative marketing team at Club Tigres, we are preparing to launch a robust campaign slate that will surprise and delight fans, whether they are in the stadium or at home, and whether the Club is in-season or off-season.”\nIn one campaign, Club Tigres partnered with Tradable Bits to engage casual fans with a “memory match” game featuring men’s and women’s players that launched on social media. The fastest fans were rewarded with a special edition signed jersey. The campaign generated more than 100,000 impressions and a 10% increase in new fans registered on the platform.\nIn another campaign, Club Tigres teamed up with Tradable Bits to reach U.S. fans that launched this past September to kick off Hispanic Heritage Month. The “Hispanic Heritage Month” campaign spotlighted the Club’s commemorative jersey and was one of 15 that ran during the pilot period resulting in a cumulative 61,000 entries and more than 515,000 unique views.\nTradable Bits was recently recognized by Sports Business Journal as a Power Player in Fan Experience Technology.\nAbout Tradable Bits\nTradable Bits is a leading provider of cutting-edge fan engagement, data analytics, and marketing solutions to the global sports, music, and entertainment industries. Tradable Bits’ proprietary fan engagement platform and CRM leverages zero-party data, artificial intelligence, and machine learning so promoters, sports leagues and teams, and live event organizations can market more effectively, generate revenue, and foster brand loyalty. Tradable Bits’ technology is built exclusively in-house by award-winning engineers and mathematicians working alongside veteran sports and entertainment executives to meet the unique needs of live audience organizations. More than 100 leading organizations rely on Tradable Bits including sports partners in the AFL, NBA, NFL, NRL, NHL, MLB and MLS, and entertainment partners AEG Presents’ GoldenVoice, BMG, Live Nation Canada, Front Gate Tickets, Country Music Association, Danny Wimmer Presents, Life is Beautiful, and Outside Lands. Tradable Bits is headquartered in Vancouver, Canada, and has offices in North America, Australia, and Europe. More information is available at visit www.tradablebits.com.\nAbout Club Tigres\nClub Tigres is a soccer team belonging to the Autonomous University of Nuevo León and managed by CEMEX through its subsidiary, Sinergia Deportiva S. A. de C. V. since 2006. The Club was born on March 7, 1960 and since then it has added eight League titles (1977-78, 1981-82, Apertura 2011, Apertura 2015, Apertura 2016, Apertura 2017, Clausura 2019 and Clausura 2023); three Cup Championships (1975, 1995-96 and 2014) and has been Champion of Champions four times (2015-2016, 2016-2017, 2017-2018 and 2022-2023), CONCACAF Champion 2020, among other titles. It has been one of the three Mexican teams that has played in a Copa Libertadores Final (2015). We are the team with the best average stadium attendance in Mexico, recognized for having one of the best fans in the world and as the fifth national soccer team with the largest number of fans, according to the Mitofsky survey. Tigres has been recognized for 16 consecutive years as a Socially Responsible Company, it has the Tigres Foundation to support UANL students with financial scholarships, connection, remodeling of their homes or English scholarships, and we are the first institution in Mexico to have two inclusive teams, Tigres PowerChair and Tigres Unión, among other actions.\nAbout Tigres Femenil\nClub Tigres is a soccer team belonging to the Autonomous University of Nuevo León and managed by CEMEX through its subsidiary, Sinergia Deportiva S. A. de C. V. since 2006. In 2017 the Liga MX Femenil and Tigres Femenil were born, since then it has added six League titles (Clausura 2018, Clausura 2019, Guardianes 2020, Guardianes 2021, Apertura 2022 and Apertura 2023); and has won a Champion of Champions (2020-2021 and 2022- 2023). It is the Women's team with the most titles in Mexico, the first to welcome a NWSL team (Houston Dash) in its stadium, the first to make an alliance with a NWSL team (Angel City FC) and creator of the Amazon Cup, defeating FC Bayern Munich. They are the first team to launch a season ticket for Tigres Femenil matches and the team with the best tickets since the start of the Liga MX Femenil. Tigres has been recognized for 16 consecutive years as a Socially Responsible Company, it has the Tigres Foundation to support UANL students with economic scholarships, connection, remodeling of their homes or English scholarships, we have the Amazonas initiative X More, as a commitment to the principles of gender equality and female empowerment in the context of Mexican soccer, and we are the first institution in Mexico to have two inclusive teams, Tigres PowerChair and Tigres Unión, among other actions.\nPhotos accompanying this announcement are available at\nhttps://www.globenewswire.com/NewsRoom/AttachmentNg/7e784d18-d0fd-4230-ab55-35f07a0aa754\nhttps://www.globenewswire.com/NewsRoom/AttachmentNg/93e96437-3cd7-4b0a-9adf-ee37635940c1\nhttps://www.globenewswire.com/NewsRoom/AttachmentNg/b55fb139-42ce-4d2d-b0c1-523af5bb11f9",
  "word_count": 1041,
  "scraped_at": "2026-02-14T12:47:20.818296"
}