{
  "article_id": "75e37b4b9b6c",
  "url": "https://www.mirror.co.uk/tv/tv-news/super-bowl-best-shows-usher-26216115",
  "title": "Super Bowl most iconic halftime shows ever that Bad Bunny has to top",
  "date": "20260208T090000Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Super Bowl's most iconic Halftime shows ever as Bad Bunny riles Donald Trump\nPop superstar Bad Bunny will play to fans at Levi's Stadium in Santa Clara and millions of viewers worldwide as he makes his stamp on the iconic Super Bowl half time show\nThis Sunday Puerto Rican pop star Bad Bunny made history during the Super Bowl half time show. The 31-year-became the first male solo Latin artist to take the title and performed his entire set in his native Spanish.\nDonald Trump said he would not be attending, or even watching: \"I'm anti-them. I think it's a terrible choice. All it does is sow hatred. Terrible,\" moaned the US President. Bad Bunny avoided playing the US on his current sold out world tour over concerns that Immigration and Customs Enforcement agents would conduct raids on his concerts.\nThe show opened with Puerto Rican scenes of dominoes and sugar cane fields, set to his 2022 hit single Titi Me Pregunto. At various points, he was joined by Ricky Martin and Lady Gaga, who performed a salsa version of her Bruno Mars collaboration Die with a Smile. Other celebrity guest appearances included actress Jessica Alba, rapper Cardi B, and Ricky Martin.\nUS President Donald Trump called the performance “absolutely terrible”. In a post on his Truth Social account, Mr Trump said: “The Super Bowl Halftime Show is absolutely terrible, one of the worst, EVER!\n“It makes no sense, is an affront to the Greatness of America, and doesn’t represent our standards of Success, Creativity, or Excellence. Nobody understands a word this guy is saying, and the dancing is disgusting, especially for young children that are watching from throughout the U.S.A., and all over the World. This “Show” is just a “slap in the face” to our Country, which is setting new standards and records every single day — including the Best Stock Market and 401(k)s in History! There is nothing inspirational about this mess of a Halftime Show and watch, it will get great reviews from the Fake News Media, because they haven’t got a clue of what is going on in the REAL WORLD.”\nThe Super Bowl halftime show has become as gargantuan a spectacle as the game itself, with an estimated 120 million people tuning in around the world to be wowed in a tight 15 minute time slot.\nThe most coveted entertainment slot on television has seen some legendary performances over the years from some of the biggest icons in music. And there's been plenty of controversy along the way, from Janet Jackson's nipple exposé in 2004 to the NFL filing a lawsuit against M.I.A. for £1.5million for giving the middle finger while performing alongside Madonna. It's fair to say the halftime show rarely disappoints.\nLast year, Kendrick Lamar raised the bar with a theatrical production exploring Black American identity, his rendition of Drake diss track 'Not Like Us' has already become of the most watched clips in SuperBowl history.\nWe take a look back at some of the most iconic halftime shows in Super Bowl history in history kicking things off with the King of Pop...\nREAD MORE: How to watch Super Bowl 2025 halftime show and who is performing with Kendrick Lamar1. Michael Jackson, 1993\nThe one that started it all, Michael Jackson’s epic 1993 performance birthed the mammoth spectacle that is the halftime show.\nWith a children's choir, a giant globe soaring above the 50-yard line and an epic moonwalk to Billie Jean, Jacko threw everything into his performance that threw down the gauntlet for future stars.\nDrawing a TV audience of a whopping 133 million, more people tuned in to watch Michael's 12-minute set than the entire first half of the game.\n3. Janet Jackson and Justin Timberlake, 2004\nThings didn't go quite as smoothly for Michael's younger sister....\nDuring her 2004 Super Bowl performance with Justin Timberlake, Janet Jackson ended up exposing herself in front of one of millions live on TV.\nAs the singers belted out a duet of hit single Rock Your Body, Justin strutted over to Janet and tore off part of her costume in front of a 140 million-strong audience, revealing her jewellery clad breast.\nThe moment was quickly explained as a “wardrobe malfunction” and MTV who produced the segment hasn’t been allowed near the Super Bowl since.\nSuch was the controversy surrounding the shock nudity, Janet's glittering career derailed with shocking force as she was mercilessly axed from upcoming performances and TV appearances.\nLast year, Justin issued a grovelling public apology to the his former co-performer for letting her take the wrap for the incident.\n3. Paul McCartney, 2005\nAfter the controversy of 'nipplegate' the year before, the Half Time Show was placed in Paul McCartney's very safe hands 12 months later.\nThe former Beatle ran through legendary hits from his decade-spanning career, including Drive My Car, Live and Let Die and of course, a rousing singalong rendition of Hey Jude as the finale.\nIt takes a lot to upstage Queen of Controversy Madonna, but British rapper M.I.A managed to do just that when she flashed her middle finger mid-performance.\nThe star, who made a guest appearance alongside Madge and Nicki Minaj, later claimed she made the one-fingered salute as a symbol of spiritual devotion to a Hindu goddess.\nBut even Madonna wasn’t impressed calling the stunt “childish and irrelevant”.\nThe NFL even tried to sue M.I.A. – also known as Mathangi Maya Arulpragasam – for a whopping $16.6million (£11.4m) claiming the music star had breached their contract and ruined the NFL’s 'goodwill and reputation.' Both sides settled the case in 2014 for an unknown amount of money.\nQueen Bee was always going to put on one hell of a show, and when her time came she did not disappoint.\nShe even brought her old Destiny's Child band mates out of girlband retirement for the occasion - but in keeping with tradition she was still centre stage. From Run the World, Independent Women Part 1 and ending on a spine-tinging rendition of ballad Halo, Beyonce's career-spanning setlist landed her the fourth most watched halftime in Super Bowl history.\n6. Katy Perry, 2016\nArriving into the stadium on a robotic tiger, 'lying above the heads of the crowd and bringing out Missy Elliott and Lenny Kravitz for guest cameos, Katy Perry went all out to make her shot at the Super Bowl show one to remember.\nBut despite all that Katy still managed to get upstaged, by a dancing shark no less, who momentarily forgot his closely choreographed dance moves and free-styled through the mishap.\nThe hilarious moment sparked a viral frenzy with #LeftShark trending on worldwide Twitter within minutes as viewers lapped up the on stage blunder.\nChris Martin's Coldplay were billed as the 2016 headliners but they called upon a little help from their friends to get the party started.\nA leotard-clad Beyoncé showed up with a troupe of backing dancers to perform a stomping rendition of her hit Formation direct from the pitch.\nMany fans questioned if Bey had stolen the show from English crooners Coldplay, but the band came together with Bruno Mars and Bey for a singalong of Uptown Funk as they ended the collaboration on a high.\n8. Lady Gaga, 2017\nThere's a good reason Gaga's epic half-time show remains one of the most watched in history.\nShe wowed crowds at NRG Stadium in Houston, Texas, during a performance which saw her glide across the field attached to a harness, drop her mic, catch a football, and exit the stage by jumping off of it.\n\"I want to more than anything create a moment that everybody watching will never forget. Not for me, but for themselves,\" Mother Monster announced before taking to the stage - and stayed true to her word.§\n9. Justin Timberlake, 2018\n14 years after 'nipplegate' chart-topper Justin Timberlake accepted the honour of performing at the 2018 halftime show , which took place at the US Bank Stadium in Minneapolis.\nThe 2017 event was viewed by a whopping 110 million Americans alone, meaning the ex-NSYNC frontman had a lot of people to please. Despite the rumours, Janet Jackson confirmed she would't be joining JT on the night, putting the daunting performance solely in his hands.\n10. Prince, 2007\nIt doesn't get much bigger than Prince, who rocked his personalised love symbol stage at Miami Gardens in 2007.\nThe rain might have been pouring down for the entire 13 minutes but that didn't stop the popstar who gave no sign of slowing down as he strutted around in his perilously high heeled boots in front of an enthralled crowd.\nThe performance kicked off with We Will Rock You before Prince went full throttle into a medley of hits that included 1999 and of course Purple Rain.\nThe show was an enormous success with the New York Times reporting it would 'go down in history as the most thrilling halftime shows ever; certainly the most predictable, and perhaps the best.'",
  "word_count": 1500,
  "scraped_at": "2026-02-14T14:21:47.917412"
}