{
  "article_id": "76203cf143c7",
  "url": "https://spartanavenue.com/a-spartan-legend-showed-up-to-support-tom-izzo-michigan-state-vs-north-carolina-01kb66kf1rgd",
  "title": "A Spartan legend showed up to support Tom Izzo , Michigan State vs . North Carolina",
  "date": "20251128T224500Z",
  "domain": "spartanavenue.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "One thing that fans have grown to love about Michigan State is the fact that all the programs seem to support each other. Tom Izzo just went to a women’s soccer game this month and celebrated a win with the team, and other coaches and players always seem to show up for each other.\nHowever, expecting a coach of another program to show up to a neutral site game all the way down in Florida on Thanksgiving is asking a lot — especially if that coach retired more than five years ago.\nWell, a Spartan legend showed up to support Izzo and his team down at the Fort Myers Tip-Off on Thanksgiving Day as Michigan State took down No. 16 North Carolina by 16 points.\nThat Spartan legend? Mark Dantonio.\nDantonio is retired now, and it makes sense that he would be in Florida enjoying his post-coaching days, but he could’ve been doing a million other things on Thanksgiving Day around dinner time, but he decided to spend some time supporting his good friend and fellow Hall of Fame head coach Tom Izzo at the Fort Myers Tip-Off.\nIt’s always cool to see these coaches come out and support each other, but seeing Dantonio in Fort Myers to cheer on his good friend isn’t all that surprising. When he was still leading the Michigan State football program, Dantonio could be spotted at just about every hoops home game.\nThe Spartans improved to 7-0 with Dantonio in attendance, and Michigan State posted a picture of the two Hall of Famers sharing a laugh with each other before the game.\nDantonio wasn’t the only one who showed up for Izzo and the Spartans. Carlton Valentine and Jason Richardson were also in attendance supporting Izzo and the program, and that’s cool to see given the fact that both of their sons have already moved on to professional basketball. That just goes to show how highly they think of the legendary head coach.\nMichigan State is one big family, and this is a prime example. Just like Jase Richardson FaceTiming in during the post-game press conference and Izzo acknowledging him and telling him he loves him.\nThere’s really no place like Michigan State if you’re an athlete.",
  "word_count": 373,
  "scraped_at": "2026-02-14T14:20:38.522793"
}