{
  "article_id": "7627f29472e2",
  "url": "https://www.smh.com.au/sport/cricket/it-s-time-england-handed-over-the-ashes-for-real-20251121-p5nhe7.html",
  "title": "It time England handed over the Ashes , for real",
  "date": "20251122T001500Z",
  "domain": "smh.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Opinion\nIt’s time England handed over the Ashes, for real\nPeter FitzSimons\nColumnist and authorTFF’s long-time correspondent Joe Weller makes a very good point.\n“We are, once again, playing for the mythical Ashes. Little Britain, which still acts like an imperial power, keeps the actual trophy. The colonials, of course, curtsy and say ‘yes m’lord’. It makes a republican ill. Even the Yanks parted with the America’s Cup. Imagine if the Wallabies beat the All Blacks in a series, and the Bledisloe Cup stays in NZ?”\nHe’s bloody well right. In what other international comp with a famous trophy, does the trophy itself stay with just one side?\nIt’s time.\nHand it over, you bastards. Oh, all right, we can wait till the end of this series. But then, hand it over, you bastards!\nDream debut day for Doggett\nThe most heartwarming thing about the first day of the Ashes Test? I grant you, there’s a few contenders.\nThe destruction of the English top batting order is certainly right up there. Get that up yers, yer Pommy bastards! (Sorry, sorry, there is still a teenage lout in many of us Australian males of a certain age, and we have to work extra hard to control it when the Ashes are on, particularly on the first day when the worst of our atavistic urges can be downright nasty.)\nAnd that is less heartwarming, than just cold joy.\nMitchell Starc’s fabulous seven-fer, then?\nYes, that is indeed a little more warming. Good bloke, great servant of the game, delivering again, just as he always has. Love it.\nBut no, I’ll still go with Brendan Doggett’s two-fer, fer Australia, in his Test debut at the age of 31!\nHere he was, just when the Queenslander must have thought that the dream of wearing the baggy green had passed him by, getting the opportunity to play at last, and nailing two important wickets on his first day. Who knows what the rest of the match, and his career, holds for him? It don’t matter. He has lived the dream. Heartwarming!\nCA to step up for AB\nThere were some very sobering quotes from Allan Border this week, which gave an indication of just how much the 70-year-old former Australian cricket captain is suffering from Parkinson’s. Travel will soon be out of the question.\n“Part of my masterplan is to have a swansong at Lord’s [in 2027],” Border said. “I want to go over with a crew and get a corporate box. It would be an expensive way to do it, but I just want to spend a couple of days at Lord’s having a bit of fun at the cricket. I have never been a corporate box hopper, and you pay for it, but it is a really good way to enjoy the cricket.”\nYeah, nah.\nUnder such circumstances as that, someone of Borders’ stature – he was the mainstay of the baggy green through so much of the 1980s – should never have to pay for a corporate box. And new Cricket Australia CEO Todd Greenberg agrees.\n“AB is a legend of Australian cricket and will be the first person invited to Lord’s in 2027,” he told me on Friday, when I contacted him. “I can assure you that he won’t be paying! He has an open invitation to every match we play.”\nMad Monday shows AFL still a work in progress\nSix weeks after coming out to The Daily Aus – thank you, I know – the AFL’s first openly bisexual player, Mitch Brown, has expanded on his experience for DNA magazine, out this week.\n“When I was closeted, I lived in a very privileged world,” he says in the profile. “I’m a tall, white footballer who people wouldn’t consider part of a minority group. In the last six weeks [since coming out], I’ve gained a lot of insight into what being in a minority means.\n“Despite my looks and build, I’m still fearful. While riding a tram, I’ll look to the side thinking, ‘Who’s looking at me? Are they a homophobe? Is it a hyper-masculine man who thinks I’m filth?’\n“It’s not a nice feeling, and this is in Australia, so imagine what it’s like in other countries, especially where they have jail terms and death penalties. It’s just f---ed.”\nDNA calls Brown coming out “one of the most important moments in Australian sporting and LGBTQIA+ history,” though notes there is still a long way to go, as witness the antics of Mad Monday, when Geelong’s losing grand-finalists Bailey Smith and Patrick Dangerfield posed for a photograph referencing Brokeback Mountain, with Smith captioning the social media image with: “This is what losing a granny does to ya.”\nAh, but seriously folks, he’s here till Thursday. Try the veal!\nYou and I thought it was lame. Mitch Brown lived the consequences.\n“There was that one week where the hate dialled up again with the Mad Monday stuff,” Brown tells DNA. “[My partner] Lou and I decided we had to address it publicly because people love to say, ‘This is so positive, Mitch. We’ve come so far!’ But ... maybe we haven’t come as far as we thought. There’s still a lot of shit out there.”\nThe best cricketer on the golf course\nAs if you didn’t know, The Chappell Foundation is having their annual golf day on December 4 at Concord. Greg Chappell (who plays off nine at 77) is flying in from Adelaide to participate. When I asked him who were the best golfer-cricketers he’s played against over the years, he nominated the late Shane Warne as the best putter, but said for a long time his reckoning was that Ricky Ponting and Greg Blewett were the two best cricketer-golfers he had played with.\n“But that assessment had to change earlier this year when I played at The Chappell Foundation Melbourne golf day with David Warner. Davey is simply the most talented of the lot. He’s a devastating left-handed batsman, yet he swings a golf club naturally right-handed. And when I say he hits it, I mean he hits it a kilometre. The distance he gets is astounding. Of course, I had to ask the obvious question: ‘Davey, have you ever tried playing left-handed?’\n“He paused, considered it, and gave a classic, matter-of-fact answer: ‘Yeah, I hit it further left-handed, but not as straight!’”\nWhat they said\nDaly Cherry-Evans on being a Rooster: “I’m no spring chicken.”\nGreg Norman, on Greg Norman, defends Greg Norman: “LIV wasn’t about Greg Norman. LIV was about what was right for the game of golf.” Three vomit emojis.\nBrisbane Bullets coach Stu Lash also channelling his best Rodney Dangerfield: “Our guys are not getting the same level of respect as others in this league do.” My favourite Dangerfield line, however, remains: “If it wasn’t for pick-pockets, I’d have no sex life at all.”\nJarome Luai on why he wants to be less of a Batman, these days: “Batman sort of does things on his own. He’s that kind of character. But it takes 30 guys to win a premiership, you know what I mean? I definitely look at it in a different light now. There’s no one-man show, there’s no one-man team in any successful team ... it’s about how I’ll make players better. How I’ll make better men around me and then ultimately that’s going to create a winning culture.” He’s a brilliant player, but is he a bit on himself?\nHan Willhoft‑King on giving up Premier League soccer with Manchester City to play for Oxford University instead: “I wasn’t enjoying it. I don’t know what it was, maybe the environment. I’m bored often, as well. You’d train, you’d come home and you wouldn’t really do anything. If you contrast it to now … I’m struggling to find hours in the day. I’m either studying, going out with friends, playing for the university first team, also my college.”\nWillhoft‑King: “I always felt under-stimulated in football. Say I had a career in League One or the Championship … you make good money. But how much would I enjoy it? In my head I wasn’t sure. Also, best-case scenario – you’ll play for 10, 15 years and after that, what? I thought going to university would provide a platform for me to do something at least for longer than the next 10 to 15 years. So, it’s a bit of a long-term thing, as well.”\nJoe Schmidt on the best Australian player in the Ireland match, actually playing fullback for Ireland: “Unfortunately, Mack [Hansen] was probably the standout Australian player on the field.”\nCanberra’s own Mack Hansen on it: “There’s been a lot of talk that I wasn’t born here and didn’t grow up here – but this feels like home.”\nCarlos Alcaraz wants to win in Melbourne: “In 2026 I’d rather win Australia alone than win two repeated grand slams.”\nJannik Sinner on the debacle of the new Davis Cup format, which appears to be universally hated: “I never unfortunately played the Davis Cup, the real Davis Cup, where it’s away, playing in Argentina or in Brazil with the whole stadium, not against you, but for the other team. It can happen that Australia plays against US next year in Bologna. You don’t have this Davis Cup feeling.”\nAFL draft prospect Lachy Dovaston on being compared to Nick Watson, whoever he is: “I’m not the next Nick Watson – I’m the first Lachy Dovaston.” That’s sorted then.\nNigerian football manager Eric Chelle on why the Democratic Republic of Congo won their World Cup playoff penalty shootout: “During all the penalty sessions, the guy from Congo did some voodoo. Every time, so this is why I was a little nervous after him.” Oh, do stop sneering. It is no more ludicrous than players and coaches crediting Jesus for the winning putt/goal/try.\nAtlanta Falcon Bijan Robinson after a loss: “The biggest thing we have to do is stay off social media. That’s such a worldly thing. It’s just controlled by the devil, and if it gets in this locker room, that’s what divides locker rooms.” See?\nMatildas coach Joe Montemurro during a press-conference, after taking a pen to scribble something onto his left palm, following a question about Sam Kerr: “I was just waiting for the Sam Kerr question. I lost a bet. It took two minutes.” GUMP! You a goddamn genius!\nTeam of the Week\nWallabies. Looking to avoid a grand slam of sorts when they take on France in Paris on Sunday morning.\nOscar Piastri. Good luck to him at the Las Vegas Grand Prix.\nKai Trump. The Orange Oaf’s granddaughter came dead last in the LPGA event she received an exemption for.\nStephanie Gilmore. Has taken the surfboard out of the closet as she makes a comeback.\nLuke Littler. No.1 darts player in the world, at age 18.\nThe triumphant 1975 Newcastle Uni Women’s Hockey team. Had a successful 50th reunion last weekend.\nEli Katoa. Melbourne Storm player ruled out for the whole 2026 season following brain surgery. Give it away, Eli, and sue. After the damage you have taken, it is insane to put your brain through any more trauma.\nRIP Paige Greco. The Paralympic gold medallist and world champion para-cyclist passed away aged 28.\nTwitter: Peter_Fitz",
  "word_count": 1884,
  "scraped_at": "2026-02-14T14:20:44.870893"
}