{
  "article_id": "762c9416d084",
  "url": "https://www.opinionnigeria.com/how-democracy-undermines-development-in-nigeria-by-ifeanyichukwu-afuba/",
  "title": "How Democracy Undermines Development In Nigeria",
  "date": "20250912T160000Z",
  "domain": "opinionnigeria.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Democracy & Governance\nHow Democracy Undermines Development In Nigeria -By IfeanyiChukwu Afuba\nIt was scandalous. Almost unbelievable. The treatment was nothing short of mockery of education. From whatever angle, the discrimination against the academic ambassadors is patently unjust. Against the background of the festival declared for the football and basketball teams, the reception extended to the global communication champions was wretched, contemptuous, dismissive and hurtful. That was not a show of appreciation.\nLike examination, like democracy, you may say. Examination, some contend, is not a true test of knowledge. If it’s not a reliable measure of academics, what then is? Democracy, too, is criticised for it’s defects. Is there a better system of government? Endless controversy. Perhaps, it’s enough that there’s awareness of the shortcomings of democracy. Efforts can then be continually made toward managing it’s deficiencies. And the challenges of democracy tend to vary in time and space. For much of the West, it’s about the high turnover of governments and the attendant instability. In Africa, it’s chiefly about the limitations posed to democracy by power of incumbency. The Nigerian experience has another by – product; the elevation of populism above development.\nOn July 28, 2025, the President, Bola Ahmed Tinubu, received the national female football team, Super Falcons who won the 2024 Women Africa Cup, at the presidential villa, Abuja. “You have inspired millions, especially young girls who now see proof that their dreams are valid and achievable” an excited President told the players. The President promptly conferred national honours on the contingent of 24 players and 11 technical crew. In further appreciation, the players and support staff were each granted ownership of three bedroom flat at government housing estate. The biggest was yet to come. Mr President then announced a reward of $100,000 to every member of the team! A week later, precisely, August 4, 2025, it was the turn of the female basketball team, also returning with a continental crown, for presidential reception. Again, encomiums poured in from the highest levels of government on the remarkable achievement of the squad. Vice President, Kashim Shettima, who stood in for the President, extended the same valuable gifts declared for the footballers for the basketball contingent.\nThen, move on a little bit and it’s a sweet and sad tale. In the same month of August, Nigeria recorded another outstanding performance on the global stage. The trio of Nafisa Abdullahi Aminu, Rukaya Muhammad Fema and Hadiza Kashim Kalli, from Yobe State, cruised to victory in the 2025 Teenage Global English Championship. In the contest involving 20, 000 participants from 69 countries, Rukaya Fema and Hadiza Kalli clinched category winners in debate and communication skills respectively. 17 year old Nafisa Aminu however emerged the overall best and star of the championship. The milestone was well reported in the media. If you thought the news – breaking incident would be celebrated by the government, you were both right and wrong. Right, because what the teenagers accomplished deserved rolling out the red carpet. And this was more so, against the treatment given to the female sporting champions. But the expectation was wrong by not factoring in the politics of governance in Nigeria. The educational laureates were denied the honour of presidential reception. Neither the president or the vice president granted them even a minute’s audience. The world champions were received by the Minister of Education, Dr Tunji Alausa. On behalf of the federal government, Alausa announced N200,000 reward for Nafisa, the ultimate winner and N100,000 each for Rukaya and Hadiza.\nIt was scandalous. Almost unbelievable. The treatment was nothing short of mockery of education. From whatever angle, the discrimination against the academic ambassadors is patently unjust. Against the background of the festival declared for the football and basketball teams, the reception extended to the global communication champions was wretched, contemptuous, dismissive and hurtful. That was not a show of appreciation. The federal government’s attitude to exploits of Nigeria’s team at the contest in London was one of disregard and gross insensitivity. If any of the three competitions could be rated as superior, it is easily the language contest won by Nafisa. The football and basketball titles were continental competitions; and the\ncompeting teams no more than 32 for each sport. By sharp contrast, the London English language event was a global contest featuring 20 competitors from 69 countries. The standard of the engagement was bound to be high, tasking both the mental and affective domains of the teenagers, majority of who were traveling out of their countries for the first time. Yet, after going through the pressures of this international tournament, the same federal government that proudly gave over N160m to each member of the football and basketball teams, felt no embarrassment presenting the world champions with a total cash award of N400,000.\nThis belittling of the feat by our academic heroes was predictable. Perhaps, no one expected it to take the straight – faced, undiluted humiliation that has unfolded. Chances are that students of Nigerian government and politics looked forward to a moderated marginalisation that would have seen the educational pace – setters receiving about half the package showered on their sporting counterparts. But not this brazen, shouting marginalisation – one that the government three weeks after, has not deemed necessary to make apologies on and rectify.\nI had in the preceding paragraph described the government’s discrimination against the teenage intellectuals as ‘almost unbelievable.’ The qualification stemmed from the consideration that the apartheid – like response was foreseeable. It followed a tradition of according greater value to populism than development in governance. Government’s worshipping of the football and basketball teams was not out of profound admiration for the game, skills of the players or their victories. The attraction and premium placed on them lay in the political capital that could be mined from it’s promotion. Similarly, the government had nothing against the London outing of the three girls. It only lacked the incentive to invest in a brand that held no prospect of tangible and immediate returns. The educational laurels were seen as lacking political value. In the dynamics of electoral power, sports is considered a much higher assets than education. Sports has both mass appeal and the benefit of visibility. Many Nigerians can be trusted to keep vigil before television sets each time the national football team is part of a competition. If the match is in Nigeria, the youth are certain to invade the venue. The entertainment value of sports is huge, giving it a celebratory spice. This is why firms fall over themselves to clinch endorsement deals with successful players and athletes. Contrastingly, academics is a sober undertaking with virtually no room for the razzmatazz of show business. How many Nigerians were aware of the London language contest while it lasted? How many would have sat down to watch? Consequently, government’s interest was with the popular lane, the product on high demand. It was a case of identifying with the hot brands.\nAs it were, populism is the easier and first resort of Nigerian governments. Subjects like education, the ultimate harbingers of advancement are sidelined and neglected. The fruits of the education industry not only take a long time to mature, they suffer the double jeopardy of not being easily visible. Schools, especially tertiary institutions, being removed from city populations, are not likely to make the priority list of the average Nigerian government. Thus, our schools suffer a dearth of infrastructure projects and needed facilities at all levels. Governments baulk at providing research grants because they do not yield electoral value as would road construction contract, for instance. It’s for related reasons that Nigeria’s hospitals are sub standard. The ruling elite, failing to equip public healthcare to world standards, continue to embark on medical tourism for their health needs. What is the state of our fire services? Which state can boast a full complement of modern fire – fighting vehicles and gadgets, backed up with optimal maintenance; as well as regular training of personnel? The answer blows in the wind of populist dictates of government policies.\nIt all boils down to preoccupation with the next election. We find that there’s an obsession with second tenure. Retention of power by the outgoing incumbent’s party is considered no less paramount. Former President, Olusegun Obasanjo conceived the 2007 general election a “do or die affair” for his party, the PDP. Appetite for the next election is so strong that it becomes a pet project from the first year in office. How absurd to encounter leaders of government busy with reelection agenda so early in office! Inevitably, governance suffers, with development as the foremost casualty. As revolting as it may sound, this may turn out the one advantage of military rule over our democratic experience. The system was spared the pervasive distractions of reelection agenda. This democratic dispensation is in dire need of the discipline conducive to good governance. Nigerians have a duty to refocus governments on development.",
  "word_count": 1495,
  "scraped_at": "2026-02-14T12:37:22.765267"
}