{
  "article_id": "765d854e223b",
  "url": "https://www.counterpunch.org/2023/12/29/the-year-in-police-crime/",
  "title": "From Taser Face to the Goon Squad : the Year in Police Crime",
  "date": "20231229T073000Z",
  "domain": "counterpunch.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "January\n+ Mississippi jails more of its population than any other state and nearly twice the average for the US as a whole. It’s incarcerate rate of 1,031 per 100,000 people (including prisons, jails, immigration detention, and juvenile justice facilities) becomes even more glaring when compared to that of the founding countries of NATO.\n+ An off-duty Salt Lake Police Department officer named Thomas Caygle was arrested after allegedly driving under the influence, rear-ending a car, then pinning other driver with his pickup, while he checked for damage.\n+ A Louisiana prison inmate working at the state Capitol for no pay who told a Washington Post reporter that he’s been called a “slave” was placed on lockdown by prison officials for talking to the reporter.\n+ According to a disturbing report in the Arizona Republic, Arizona prison official are inducing the labor of pregnant prisoners against their will — sometimes as early as three weeks before their due date.\n+ A senate investigation paints a grim picture of life inside federal women’s prisons, finding that the Bureau of Prisons “failed to prevent, detect, and stop recurring sexual abuse in at least four federal prisons, including abuse by senior prison officials.”\n+ More than 2,000 Black women and girls were killed in 2021, a 51% increaseover 2019. At the same time the number of unsolved homicides of Black women and girls soared by 89% in 2020 and 2021 over the levels in 2018 and 2019.\n+ On Tuesday, Missouri executed Amber McLaughlin. The jury in McLaughlin case deadlocked at the punishment phase of her trial, so the trial judge intervened and imposed a death sentence. Missouri is one of only two states that allow judges make this decision. Amber was 49-years old and the first openly transgender woman executed in the U.S.\n+ In the first two weeks of December at least 7 LAPD officers were arrested for drunk driving.\n+ 12: the number of days in 2022 when police in the US didn’t kill anyone.\n+ Andrea Ritchie on her book with Mariam Kaba No More Police (one of my selections for the best books of 2023): “We want folks to come away with the understanding that police are not producing safety. They are not preventing or interrupting violence. They’re not healing and transforming people from violence.”\n+ On New Year’s Eve, Biden issued six more pardons…for people who aren’t in prison.\n+ A recent study in the journal PlosOne reveals that 43 of the 50 most populous cities in the US spend more on police, jails, and courts, than on health and human services, public health, parks & recreation.\n+ Meanwhile, 1-in-3 incarcerated people in the US are locked up in jails, most of them (nearly 500,000) haven’t even gone to trial.\n+ People are dying in US jails for lack of a couple hundred bucks for bail on minor “crimes,” while the crypto geek SBF, facing several lifetimes in prison, gets home confinement in one of the most elite communities on the West Coast.\n+ In an effort to kill bail reform, Mayor Eric Adams had the NYPD compile a list of people with repeat arrests, even though none of the people’s cases impacted by bail reform. It appears Adams and the broke the law by leaking sealed and dismissed arrests records.\n+ According to OSHA the 10 most dangerous jobs are: fishers, loggers, roofers, construction workers, pilots, garbage workers, steel workers, delivery drivers, miners, and farmers. More cops need to be assaulting other cops in order to get cops back in the top 10 most “dangerous” jobs…\n+ On the other hand, police killed 1,176 people in 2022, more police killings than any other year recorded. Fully one-third of those killed by police last year were fleeing at the time they were shot. Most of the killings took place after a routine encounter with police, a traffic stop, a mental health call or an incident where no crime was alleged. The data also revealed an upsurge in killings by local sheriff’s departments.\n+ Even in a society saturated with guns, it’s very rare that a six-year shoots anyone, as happened in a Virginia class room last week. It’s not nearly as rare that cops kill kids. Between 2014 and 2018, police shot and killed at least 30 children in the US, 5 of them 7 years old or younger.\n+ Responding to a domestic disturbance call, deputies in Madison County, Alabama showed up at the wrong house this week and shot to death a 50-year-old man…\n+ If the name of this sheriff’s department sounds familiar it’s probably because a few years ago one its officers, a certain Justin Watson, got into an off-duty bar fight with a local handyman. Then over the course next couple of weeks Watson actively searched for the handyman and pulled him over when he finally spotted him driving down the highway. Watson ordered the man out of his truck, then struck him in the face, beat him with his baton and choked him until he was unconscious. Then tried, unsuccessfully, to cover it all up.\n+ An off-duty Chicago cop named Joseph Cabrera shoots at an unarmed man that he was harassing while driving drunk. The cop then calls CPD, lies about the incident and has the person he shot at arrested, saying he attacked the cop. Eventually the lies unravel, but the cop’s charges are reduced and he ends up with probation in a plea deal. When other defendants in the court room awaiting their cases heard the details of the case, one gasped, “He’s a cop?” Another said, “He got probation?…Damn!”\n+ According to a new report out of the Quattrone Center, in the state of Pennsylvania on 11% of the state’s 1000 different law enforcement agencies require recording police interrogations and 64% of the agencies no written policy on interrogations at all.\n+ Prison is what many aging Americans are going to get instead of Social Security and Medicare. In 2003, there were around 48,000 people in the US 55 years and old locked up in US jails and prisons. Today that number has skyrocketed to 160,000.\n+ Eliza Orlins, public defender: “Today, Trump Org CFO Weisselberg is being sentenced to five months jail. On a five-month sentence, he’ll serve approximately 100 days. As a public defender in Manhattan, I represented a man who was sentenced to 3-6 years (and will serve 1500+ days) for stealing a jacket.”\n+ In one of the government surveillance programs in recent history, the state of Arizona worked with the Dept. of Homeland Security to create a nationwide surveillance program to track Americans’ personal money transfers. The scheme to collect records of millions of money transfers sent to or from Arizona, California, New Mexico, Texas, and Mexico was first exposed last yearby Oregon Senator Ron Wyden. But a trove of new documents unearthed by the ACLU show Arizona has sent over 140 illegal subpoenas to money transfer companies compelling them to turn over their customers’ private financial data, which is then put into a huge database. As of 2021, this database contained over 145 MILLION records of transactions. More than, 700 law enforcement entities had access to this database, from small sheriff’s offices to the Los Angeles and New York police departments, to federal law enforcement agencies and military police units.\n+ In Alabama last year, 106 people over the age of 60 were considered for parole. Just seven – or 6.6 percent – were granted parole. 21 people over the age of 70 have come up for parole. None were granted release. By law, the parole board is allowed only 6 minutes to consider and render a decision on each case.\n+ An Arizona man was sent to jail on a drug charge for taking fentanyl to ease chronic pain so he could continue working and pay for the insulin needed by his 9-year-old Type 1 diabetic son. After he was incarcerated, his son was placed into state custody, where two weeks later the child died of ketoacidosis. Where’s the bigger crime?\n+ US taxpayers spend more than $5 billion a year to buy firearms for law enforcement agencies, many purchased from dealers that have been cited for violations of federal gun laws.\n+ There are three times as many AR-15s on the streets of the US than Ford-150 trucks, the top-selling vehicle in the country.\n+ Two weeks after a 6-year-old shot his teacher, a Las Vegas gun trade show is hosting a manufacturer promoting its “JR-15,” a child-size AR-15 rifle.\n+ Meanwhile, in Beech Grove, Indiana, a few miles from where I grew up…\n+ Clearly, the only solution is to arm all pre-schoolers…\n+ More than 70 inmates in Texas are on a hunger strike, protesting solitary confinement in the state’s prison system, which has locked more than 500 people in isolation cells for longer than a decade.\n+ New York City taxpayers are on pace to pay $820 million in just overtime for NYPD this year, which is enough to house all 14,000 homeless families in NYC and pay several years of rent for 7,000 families out of work and facing eviction.\n+ Our friend Arun Gupta has written a detailed piece exposing the cozy relationship between the Proud Boys and the Portland (Oregon) Police: “Since 2017, police have allowed the Pacific Northwest city to serve as a proving ground for fascists like the Proud Boys. They received legal impunity and even police support with few attempts to stop it. The far-right used political violence to network with white nationalists, militias, and other extremists, raise their image nationally, gain recruits, and build capacity.”\n+ Cops in Louisiana coerced a woman into working as an informant after her drug arrest. Then failed to protect her, as she was raped twice while undercover. “She was an addict and we just used her as an informant like we’ve done a million times before,” said retired Lt. Mark Parker, who oversaw the operation. “We’ve always done it this way. Looking back, it’s easy to say, ‘What if?’”\n+ As California moves to dismantle its death row, Louisiana is using to the former death row block at the infamous Angola prison to incarcerate juveniles. One of the imprisoned kids said: “It is very depressing to be here knowing this is the former death row. When the lights go out at night, I think I see shadows going past.”\n+ The city of Pittsburgh passed an ordinance banning officers from stopping drivers for certain minor offenses. The Pittsburgh Police chief has decided to ignore the ordinance, claiming that the rules deflated “officer morale.”\n+ After learning that she’d repeatedly been denied jobs because background checks showed she had a criminal record (she didn’t), Julie Hudson, a black 31-year-old Ph. D. student, visited a Philadelphia police station to try and clear things up. She was promptly arrested and taken into custody after being mistaken for a suspect with the same name.\n+ David Carrick, a Metropolitan police officer in London has admitted this week to at least 80 sex attacks, including 47 rapes, against a dozen women. England’s worst sex offenders has been working at the nation’s largest force for 20 years.\n+ John Adams is often offered up as a counter to his rival Thomas Jefferson, a Bostonian with more enlightened views on slavery and human equality. But I don’t think you’ll find anything in the slave-owner’s writings as explicitly racist as this from Adams in 1765: “Our forefathers came over here for liberty. Providence never designed us for negroes, I know, for if it wou’d have given us black hides, and thick lips, and flat noses, and short woolly hair, which it han’t done, and therefore never intended us for slaves.”\n+ Mass shootings are an unimpeachable proof of American exceptionalism.\n+ On the same day as the bloodbath in Monterrey Park where 20 people were shot (11 killed), 5 people were shot in Yuma, Arizona 2 in Cleveland, 2 in Dillon, South Carolina, 4 in Queens, 2 in Manhattan, 2 in Brooklyn, 4 in the Bronx, 4 in Chicago, 5 in Houston, 3 in Long Beach, 3 in New Bern, North Carolina and two dozen more in single victim shootings.\n+ One of the people shot in California last week told the state’s Governor, Gavin Newsom, that he was trying to get out of the hospital as soon as possible because he couldn’t afford the medical bill. Last year, Newsom, some may recall, helped sink California’s single-payer health care bill.\n+ If only Brandon Tsay had shot the mass-murderer instead of disarming him by hand, he would have been lionized by the NRA, given a headline speaking slot at CPAC, and rewarded with his own weekend show on FoxNews…\n+ Kareem Mayo and Donnell Perkins were convicted of the 1999 murder of Reuben Scrubb in Brooklyn. The case hinged solely on the eyewitness testimony of Ernest Brown, who said he clearly saw Mayo shoot Scrub on the orders of Perkins. Brown, who claimed at trial that he had good eyesight and only needed reading glasses, was a surprise witness, sprung on the defense the night before trial, meaning they didn’t have a chance to investigate his story. It turns out that Brown lied on the stand about the quality of his eyesight, which was actually quite bad a multiple distances. His ex-wife confirmed that he needed glasses for everyday activities and DMV records revealed that he required glasses to pass the eye exam for his driver’s license. After 20 years in prison, Brooklyn Judge Dena Douglas vacated Mayo and Perkins’ convictions and ordered their immediate release. The prosecutor who ambushed the defense and put the lying surprise witness on the stand remains at his post, an active member of the Brooklyn DA’s office.\n+ T.J. Juty, a black man living in Worcester, Massachusetts, has been pulled over by the city’s police 70 times in the last eight years. Once for failing to update the new color of his car on his registration, which he wasn’t required by law to do. When he pointed this out to the cops, he was arrested for disorderly conduct. He’s suing.\n+ A Justice Department investigation into the Louisiana prison system found that from January to April 2022, 27 percent of people who were legally entitled to be freed from Louisiana state custody were held past their release dates.\n+ The Aurora, Colorado Police Department has re-hired Matthew Green, the cop who threatened Elijah McClain with his police dog during the stop that led to the 23-year-old black man’s death, after being put in a chokehold and then injected with ketamine.\n+ LA County’s new homeless czar, Lecia Adams Kellem, will be paid $430,000 a year, which helps explain why LA has at least 66,436 people sleeping without a roof over their heads…\n+ It’s entirely predictable, I suppose, that transphobes would begin making a fuss about the prospect of someone with a rape conviction being sentenced to a women’s prison. Yet how many of these fierce guardians of biological identity have ever expressed outrage over women prisoners being raped by male guards? In the last 10 years, there have been 5,415 reported sexual assaults and rapes of women in the federal prison system alone and thousands more in state prisons. I think it’s safe to assume that the people who run the carceral state see rape as a feature (not a problem) of the prison system, as yet another form of discipline and punishment.\n+ It’s probably a toss-up between about 20 of them, but Woodrow Wilson, who fancied himself a progressive, gets my vote as America’s most racist president. In one of his most famous speeches, a speech that is said to’ve brought tears to the eyes of journalists, Wilson, in making a final plea for Congress to approve his League of Nations plan, couldn’t suppress the rancid nature of his xenophobia. He frothed about the grave threat posed by non-Anglo immigrants, who he believed were the animating force behind the radical labor movement. In his 1919 Pueblo speech, Wilson roused himself one last time to the cause of the preserving the US as an Anglo-Saxon country: “Any man who carries a hyphen about with him carries a dagger that he is ready to plunge into the vitals of this Republic whenever he gets ready.” A few weeks later the Palmer Raids were unleashed. Using lists compiled by the young J. Edgar Hoover federal agents raided union offices and homes (as well as a couple of Tolstoy reading clubs) across the country, arresting and deporting more than 1,300 foreign-born union members.\n+ It’s useful to remember that Mitchell Palmer, the man behind the infamous Palmer Raids, the largest mass arrest and deportation operation in US history (all without warrants by the way) was a Quaker. Not a Nixon Quaker. But a real, practicing, “thee and thou” speaking Quaker…\n+ Who needs Rudy Giuliani when you’ve got Matty Yglesias?\nFebruary\nShortly after 6 PM on the evening of February 7, Leonard “Raheem” Taylor was executed by the state of Missouri for a crime he almost certainly didn’t commit: the 2004 murder of Angela Rowe and her three children in suburban St. Louis. Rowe had been Taylor’s girlfriend. She and her children shot and killed in the house she shared with Taylor. In the 19 years since the murders, Taylor never wavered in asserting his innocence and much of the evidence in the case backed him up and always has.\nWhen the bodies were discovered on December 3, 2004, Taylor was 2,000 miles away in Oakland, visiting his daughter Deja. He’d been in California for more than a week and there was plenty of evidence to prove it, starting with security footage at the St. Louis airport showing Taylor on his way to catch his November 26th flight to Ontario, California on Southwest Airlines. Taylor’s daughter and her mother, Mia Perry, both said that Taylor called Angela Rowe from Oakland and put Deja on the phone to talk with Rowe’s children.\nBut none of this mattered to the cops, who had settled on Taylor as their only suspect. To the police, Taylor’s alibi was manufactured. They viewed it as evidence of his guilt, not innocence. A legal Catch-22: if he were really innocent, why would he need an alibi? The problem for the cops was they had no gun, no evidence and no motive. That’s when they went to work on Taylor’s brother, Perry.\nPerry Taylor was a truck driver, who used Rowe and Taylor’s house as a kind of staging area for his life on the road. He stored his things there and sometimes slept in his truck in the driveway. He was in Atlanta when the bodies were discovered. Over the next couple of weeks, Perry was followed, harassed, threatened, and arrested by the Missouri cops. He was interrogated for five hours, during which Perry later said he was coerced into giving a statement implicating his brother, a statement he fully recanted before the trial.\nAccording to Perry, “Some detective right off the bat told me, ‘OK, before we get to the station, here’s what you’re going to say.” As part of the coercion, Perry claimed the cops made threats against his disabled mother and ransacked her apartment. “That’s the kind of shit that makes you hate law enforcement,” Perry later said in a deposition.\nThe other key witness for the state was Philip Burch, the medical examiner. In his initial report and pre-trail deposition, Burch concluded that the murders took place no more than a week before the bodies were found. This assessment was fatal to the state’s case, because Taylor could prove he was in California during that entire week. Then at trial, Burch suddenly changed his theory to fit the state’s case, testifying that because the air conditioner was left on Rowe and her children could have been killed three weeks before the bodies were discovered.\nStill the case strained credulity. For this theory to hold, the prosecutors had to argue that Taylor was so depraved that he stayed in the house with the bodies of his murdered girlfriend and three kids for several days. But that’s exactly what they argued and Taylor’s legal team, ambushed by the dramatically changed testimony of the medical examiner, put up a weak defense. Taylor was found guilty and sentenced to death. (For an in-depth account of this disturbing case see the reporting of Liliana Segura and Jordan Smith for The Intercept.)\nIn the ensuing years, more evidence supporting Taylor’s alibi and discrediting the police investigation has emerged. But none of his claims of innocence have ever been put to a legal test. Taylor’s supporters had pinned their hopes on the reform-minded Prosecuting Attorney for St. Louis County Wesley Bell, But Bell declined to invoke a Missouri law permitting prosecutors to reopen possible wrongful convictions, perhaps because of the brutality of the murders and Taylor’s criminal record. But should that really matter?\nAs Taylor’s execution date neared, Missouri’s Governor Mike Pearson, who has campaigned on accelerating the pace of executions in the state, turned down a request from Taylor’s lawyers for a Board of Inquiry investigation of the evidence of Taylor’s innocence. Pearson curtly dismissed the plea as “self-serving.” After the governor also denied Taylor’s clemency request, the Missouri Supreme Court rejected last appeal and the US Supreme Court refused to issue a stay of execution. In a final indignity, Missouri’s new Attorney General, Andrew Bailey, spurned Taylor’s entreaty to have his spiritual advisor present during the execution.\nWhat is the rush to execute? Where’s the risk in hearing every bit of exculpatory evidence? What are we killing in the name of? Why must the cruelty be torqued up to the very last breath?\n+++\n+ World map of per capita prison populations…\n+ The US is home to less than 5 percent of the world’s population, but holds 20 percent of the planet’s prisoners.\n+ Even though we keep putting people to death, more and more prisoners are serving life sentences, a kind of death penalty on the installment plan. These merciless sentences now account for one-in-seven incarcerated people in the US. Our prison system is becoming more punitive not less.\n+ In Massachusetts, anyone 18-years-old and above is automatically given a life sentence after being convicted of first degree murder. The state’s supreme court is now considering two cases on whether it is constitutional for people between the ages of 18 and 20 — sometimes referred to as “emerging adults” — to receive mandatory sentences of life in prison without the possibility of parole.\n+ An new study by the Sentencing Project calculates that at the current rate of decarceration, it would take 75 years—until 2098—to return to 1972’s pre-mass incarceration prison population.\n+ There’s a new move in California to reverse this awful trend in life sentences. California Senate Bill 94. SB 94 will provide judicial review for individuals serving life without parole or sentenced to death for offenses committed before June 5, 1990 and who have served at least 20 years of their sentences.\n+ After the raid on Cop City in Atlanta, where police shot protester Manuel Terán 13 times, law enforcement officials justified the shooting by claiming that Terán had fired first, wounding a Georgia State Trooper. But newly released body cam footage suggests that the trooper was likely struck by friendly fire, instead. “You fucked your own officer up,” an Atlanta Police Department officer is heard saying. He later approaches two other officers and asks, “They shoot their own man?”\n+ Through the first week of February, police in the US had killed at least 133 people –a 20% increase over the same period last year.\n+ Newly released documents show, the cop who pulled Tyre Nichols from his car before police fatally beat him never explained why Nichols was being stopped. This was apparently a common tactic of the Scorpion Unit.\n+ Memphis police officer Demetrius Haley took a photo of Tyre Nichols after the beating and sent it to at least five people.\n+ During the campaign, Biden promised he’d develop a “police misconduct database.” Two years after taking office there’s still no sign of it.\n+ A Boston cop named David Williams was fired twice for misconduct. Twice he filed for arbitration and got his job back. It turns out that 33% of fired police officers in the city eventually get reinstated.\n+ The New York Civilian Complaint Review Board found police used pepper spray and batons on peaceful protesters in 140 instances. It also documented case of officers refusing to identify themselves, concealing their badges, and making false or misleading statements. The review board suggested 89 officersshould be fired.\n+ For the first time, a detention officer has been hit with criminal charges in the death of an inmate at the notorious Harris County, Texas Jail.\n+ Last year Gus Vallas, the son of Paul Vallas, now leading in the polls to become Chicago’s next mayor, was one of three police officers who chased and fatally shot Kevin Johnson, a 28-year-old black man in San Antonio.\n+ The Governor of New Mexico, Michelle Lujan Grisham, is pushing a bill that calls for people accused of certain violent crimes to remain jailed without bond until their trial. A legislative analysis estimates it could cost the cash-strapped state up to $15.3 million a year.\n+ The majority of people in state prisons were first arrest before the age of 18, according to an analysis by the Prison Policy Institute.\n+ There are still more than 4.6 million people prohibited from voting because of state laws denying the franchise to those with felony convictions.\n+ Federal subsidies to police have reached a 10-year high of $4.5 billion, $900 million more than the peak funding under Trump.\n+ The parallels between Flint and Jackson are stunning: This week a white supermajority of the Mississippi House voted to create a separate court system and expanded police force within the city of Jackson — America’s blackest city — that would be appointed completely by white state officials.\n+ Never mind this. Somewhere a child might be reading The Bluest Eye…\n+ Lamar Johnson spent the last 28 years in a Missouri prison for a murder he didn’t commit. This week Judge David Mason vacated his conviction and released him from prison. Under Missouri law, Johnson is prohibited from receiving any compensation for the nearly three decades he spent behind bars after being wrongfully convicted. The Midwest Innocence Project has organizing a fundraiser to help Lamar reboot his life.\n+ What the police originally claimed about the police killings of …\nLaquan McDonald: “a very serious threat”\nFreddie Gray: “Arrested without force”\nElijah McClain: “a struggle ensued”\nGeorge Floyd: “medical distress”\nBreonna Taylor: “injuries: none”\nTyre Nichols: “shortness of breath”\n+ When an LAPD officer shoots someone, the body cam footage is edited by the department to depict the incident in the best possible light for the officers involved before being released to the press. The original footage is suppressed, in violation of California open records laws.\n+ A Missouri sheriff’s deputy groomed and then sexually molested a teenage boy. When the child’s parents reported the abuse, child protective services tried to remove him from their custody.\n+ In a unanimous vote, West Virginia legislature passed a bill ordering a life sentence for “obstructing” police, if said the interference results in a death.\n+The Ombudsperson of the New Jersey Department of Corrections is investigating reports that staff at the South Woods “Restorative Housing Unit” are committing acts of violence and egging on fights between incarcerated people.\n+ Daryl Williams, a 32-year-old black man in North Carolina, told Raleigh police officers he had a heart condition as they Tasered him repeatedly. He soon lost consciousness and died an hour later.\n+ Stop-and-Frisk has come to Australia, where police are conducting more than 150,000 body searches annually across New South Wales along. Minors and Indigenous people are the most likely to be stopped, searched and interrogated.\n+ Tiffany Lindsay filed a civil rights suit against the Detroit police department after cops shot her dog, dumped its body in a neighbor’s trash can and told her nothing about it.\n+ Police in Littleton, Colorado said a man on a motorcycle “crashed,” fled the scene and then produced a gun, prompting an officer to shoot and kill him. But the video shows the cop rammed the motorcycle with his squad car.\n+ The Illinois legislature passed a law to end cash bail. But a judge invalidated the law, ruling that it violated separation of power for lawmakers to try to regulate judges, even legislatures have set sentencing rules for decades. The case is the latest episode where courts have tried to shield themselves from criminal justice reform.\n+ Bills have been introduced in Georgia, Indiana, South Carolina and Texas allowing state officials to either bypass local prosecutors or evict them from office if their abortion-related enforcement is considered too lenient.\n+ About 20,000 people leave Illinois prisons each year. Nearly 40% will be sent back in three years. A cycle of “recidivism” the state needs to keep the prison system in business.\n+ More than half (52%) of people arrested multiple times in an average year reported having a substance use disorder.\n+ On a late January night, Tony Mitchell froze to death in the Walker County (Alabama) jail. A new federal lawsuit claims that Mitchell was placed in a restraint chair and left in the jail’s walk-in freezer for hours before his death. The Sheriff’s office originally claimed Mitchell was “alert and conscious” when he was taken to the hospital. But a surveillance video filed with the lawsuit shows four officers loading Mitchell, who appears to be limp, with his head and feet dangling, into a marked police SUV.\n+ Prison guards in Maine routinely mocked prisoners, disparaged minorities and shared confidential inmate records. None of the guards were fired, according to the Bangor Daily News.\n+ Leaked documents show that the Maryland State Police use an arrest quota-system to determine which officers will get new patrol cars.\n+ Blacks and Latinos make up 57% of the US prison population but only 31% of the US population.\n+ New data out of British Columbia shows a similar trend, with blacks and indigenous residents having much more frequent “interactions” with police than whites. In Vancouver, indigenous people are six times more likely than whites to have the police called on them. From 2011 to 2020, Indigenous men were the subjects of 19 percent of the department’s arrests, even though they make up only 1.1 per cent of the city’s population.\n+ In August 2022, Florida’s “election crimes” office arrested 20 people with past felony convictions for voting while ineligible. Most of these people were not aware they had to navigate a complex system to know their eligibility. Instead of fixing this flawed system, the Florida legislature has moved to expand the power of prosecutors to criminalize people with past felony convictions for making honest mistakes.\n+ Michigan State is the 67th mass shooting so far this year in the USA and we’re only halfway through February.\n+ In the 24 hours following the mass shooting at Michigan State University, 78 other people were shot in the US.\n+ A new study suggests that gun control measures which only target “assault weapons” increase demand for handguns.\n+ Apparently, one of the centerpieces of Trump’s 2024 campaign will be a plan to bring back firing squads, hangings and mass executions. He’s beginning to sound more Lincolnesque every day. (In 1862, Honest Abe ordered the mass execution of 38 Lakota in Minnesota in front of a crowd of 4,000 people, their bodies left dangling for a half hour after their deaths for the ghoulish spectators to inspect. At least two of the men were hung “mistakenly”–one of them had been acquitted at trial, the other sent to the gallows because his name was confused for one of the condemned.)\n+ I wouldn’t trade one Fiona Apple for 10 Bonos…\nMarch\n+ The first comprehensive data on the NYPD’s use of vehicle stops shows that police pulled over hundreds of thousands of drivers in 2022. About 90% of those who were searched or arrested in those stops were Black or Latino.\n+ South Carolina is so eager to revive the death penalty that the state Senate passed a law shielding the identity of drug companies providing lethal injection drugs for state executions.\n+ A Tennessee Republican named Paul Sherrell wants to bring back “hanging by a tree” as an execution method. Between 1882 and 1968, at least 251 peoplewere lynched in Tennessee–47 of whom were white and 254 black. Sherrell is surely aware of this savage history and longs to re-enact it.\n+ Last September police in Weld County, Colorado pulled over Yareni Rios for a suspected road rage incident. They stopped her car near a set of railroad tracks. One of the patrol cars parked behind Rios, straddling the tracks. Rios was cuffed and placed in the back of the police cruiser. While the cops went to search her car, a freight train plowed into the cop car, inflicting serious injuries on Rios. This week Colorado prosecutors dismissed felony assault chargesagainst Officer Jordan Steinke, the cop who locked Rios in the car even though the railroad crossing was clearly visible.\n+ For the last 20 years, Antonio Loredo Morales has been locked in a California state prison for the murder of a Norteños gang member, Jesus Alderete, even though no one alleged Morales did the killing. Last week, a judge in Yolo County vacated Morales’ conviction and ordered him set free.\nThe case dates back to 2003, when Morales was walk back to his home in Woodland, when he heard a fight taking place in a nearby alley. One of the combatants was Morales’ friend, Juan Carlos Montoya, a member of the rival Sureños gang. When Morales intervened to stop the fight, Montoya still enraged, stabbed Alderete in the back seven times, killing him.\nThe cops quickly arrested both Alderete and Morales. Morales was charged with murder under California’s old Natural and Probable Consequences Doctrine. The prosecutors argued that Alderete’s death was the predictable outcome of Morales intervening in the fight. Morales appealed his conviction twice and lost.\nThen in 2018, the California legislature abolished the Natural and Probable Consequences Doctrine. Morales appealed again and this time Judge Samuel McAdam ruled that he found no evidence that Morales’ intervention in the fight was motivated by malice toward Alderete or that he showed a “conscious disregard” for his life. The conviction was overturned and McAdam ordered Morales released from prison by March 1st.\n+ The Ohio white supremacist who is serving a life sentence in prison for ramming his car into a crowd at the 2017 “Unite the Right” tragedy Charlottesville, Virginia, killing Heather Heyer and injuring dozens more, is now accused of a series of crimes and acts of misconduct at the federal prison in Springfield, Missouri. Among other acts, James Alex Fields was cited for possessing a dangerous “homemade” weapon.\n+ A year ago a court ordered Los Angeles county to stop chaining mentally ill people to benches for hours. But in a new filing the ACLU alleges that the jail has been skirting that by tethering people to gurneys instead.\n+ Last week, during an LAPD car chase the two suspects crashed into Yolanda Reyna, who remains in a coma. There have been two other fatal collisions during LAPD pursuits in the past couple of weeks. Back in 2015 an LA Times analysis showed that the LAPD hurt innocent bystanders in 1-out-10 car chases, more than twice as often as other California cities.\n+ SCOTUS let stand an appeals court decision granting qualified immunity to officials who arrested and prosecuted a man for parodying police on Facebook.\n+ Over to you, Philip K. Dick: Dayton, Ohio approved the police department’s proposed use of something called a Fusus Tech Real-Time Crime Center. The police will “reach out” to people who own security cameras & ask them to “opt”-in to the platform, then their cameras will have Fusus tech added to them…\n+ In Texas, high school kids are being arrested on felony charges for vaping with legal hemp. Police often can’t tell if it’s marijuana or legal hemp, like the Delta-8 products.\n+ In Colorado, lawmakers want to make all auto theft a felony, regardless of the monetary value of the car. The bill was introduced by a Democrat.\n+ In Britain, Black people are seven times more likely than whites to die after police “restraint.”\n+ The return of Crime Bill Joe: The Biden administration is defending rules that let judges increase sentences based on alleged crimes even if a jury found the accused not-guilty of that conduct.\n+ During his presidential campaign Biden vowed to cut the federal prison population in half. Now in a little more than two years, there are more than6,000 more people in federal prisons than when Biden took office.\n+ Consider that this tough-on-crime grandstanding by Biden comes almost a year to the day after a Pittsburgh man named Gerald Thomas was berated by Judge Anthony Mariani and sent to the Allegheny County Jail after charges against him were dropped. “I have to put you in the cage, lasso you, corral you, stuff you, because you won’t quit,” the Judge barked. Thomas died inside 17 days later.\n+ Footage out of Atlanta from last Sunday show the police arresting arresting a clearly marked legal observer for the National Lawyers Guild at the Stop Cop City protests. Thomas Jurgens, an attorney with the Southern Poverty Law Center, is now facing domestic terror charges.\n+ After aggressively attacking the police reform bill passed by DC (which Biden, joining congressional Republicans, has vowed to kill) the Washington Post was forced to run this correction:\n+ In fact, violent crime in Washington, DC. is lower than it’s been since at least 1985.\n+ The penalty for carjacking under DC’s “Revised Criminal Code Act” (which Joe Manchin denounced as “an absolutely crazy crime law”) is 12-24 years. In Steve Scalise’s Louisiana, the penalty is far more lenient, starting at just 2 years, and tops out at 20.\n+ It’s the same story in NYC, despite Eric Adams’ demand that people drop their Covid masks before entering shops, stores and restaurants to combat retail theft: “And when you see these mask wearing people, oftentimes it’s not about being fearful of the pandemic. It’s fearful of the police catching [them] for their deeds.”\n+ The NYC crime stats published last week show 4,276 shoplifting complaints filed last month down from 4,757 in February 2021.\n+ Ditto with murders…\nNYC murders in 1989: 2,246\nNYC murders in 2022: 433\n+ Nationally, you’re still 8 times more likely to die of Covid than from a homicide.\n+ According to the US Justice Department’s post-Breonna Taylor investigationof the Louisville Police Department, the cops there routinely use excessive force, invalid warrants and discriminatory stops. Some officers have videotaped themselves throwing drinks at pedestrians from their cars; insulted people with disabilities; and called Black people “monkeys,” “animal,” and “boy.” Hardly surprising. But what are they going to do about? Give them more money?\n+ One particularly graphic episode disclosed in the DoJ report describes how a Louisville cop urged his dog attack a 14-year-old Black kid who was not resisting. While the dog “gnawed’”on the teen’s arm, the officer blurted, “Stop fighting my dog.”\n+ Just a couple of weeks before the DoJ report came out, a Louisville cop “accidentally” shot two unarmed teenagers.\n+ So much training, so many “accidents”…\n+ A new study finds that police departments which focused on generating revenue through fine and fees have killed more people than those that didn’t.\n+ According to a story in Business Insider, both Google and Facebook are handing over user data to help police track women seeking abortions.\n+ The Idaho House passed a bill on Tuesday that would criminalize people who help teens get abortions out of state, even their own parents. One of the bill’s sponsors, Rep. Barbara Ehardt, compared helping teens get abortions to human trafficking.\n+ A Rikers prison guard has won a $125,000 settlement over allegations that her colleagues spread false rumors she was transgender and left her alone during a brutal attack from inmates.\n+ What it takes to cancel an execution in Texas: A Texas court just called off the scheduled execution of Andre Thomas, the death row prisoner so mentally disturbed that he ripped out both his eyes and ate one…\n+ A University of Massachusetts cop resigned from the force after sexually assaulting a student and was later hired by a neighboring town’s police department to be their…sex crimes investigator.\n+ Ten years after the Supreme Court’s decision in Miller v. Alabama, where the court ruled it was unconstitutional to impose a life-without-parole sentence for a child under age 18 without considering the unique status of children and their potential for change, the state of Louisiana released from prison 109 juveniles previously sentenced to life in prison. Of the 109 released from prison, zero have returned.\n+ In a rare win for free speech advocates, a Knoxville, Tennessee jury acquitted police reform activist Nzinga Bayano Amani of a charge of blocking a squad car while he led a demonstration demanding police accountability after a cop shot and killed a 17-year-old student in a high school bathroom.\n+ Bill Kunstler: “I cannot regard someone like John Gotti as more evil than someone in George Bush’s position. I must confess to a slight romantic attraction to the folk-hero quality I see in them. Here’s to crime!”\n“You can’t talk about fucking in America, people say you’re dirty. But if you talk about killing somebody, that’s cool.”\n―\nThe US is not going to solve its gun violence epidemic until it addresses its war violence epidemic. There’s a reason the AR-15 has become the weapon of choice for post-Gulf War shooters. Blame guns if you must, but start with the war culture that has indoctrinated so many people to crave them, not, I suspect for self-protection, but for the projection of power in a society where the individual is left with so little.\nFor three decades, we have saturated our society with government-sponsored violence, where every type of killing is officially sanctioned, including that of children. We’ve committed infanticide with impunity from Kandahar to Belgrade. The sniper and the drone have become cultural icons, grotesque symbols of the American imperium.\nPredictably, the chickens that have come home to roost haven’t only been the relatives of the victims, but also the children of perpetrators, nurtured on fear, bloodshed and high-capacity ammo. They’ve been reared to see people in uniform–from Mosul to Memphis-kill with impunity. The lessons seem to have taken root.\n+ “Enough, enough, enough” is the liberal version of “thoughts and prayers.” It’s a meaningless cliché in the face of a carnage they don’t know how to stop. They’re content to use the blood of children as a political cudgel against the gun rights Right. But their reflexive response is to give more money to police, which inevitably only leads to more bloodshed on the streets.\n+ Biden, though, has simply declared his own impotence: “I have gone the full extent of my executive authority to do, on my own, anything about guns.”\n+ The president apparently can’t think of anything to do other than just throw his hands up as 9-year-old kids are mowed down, reinforcing the notion that Biden is old, tired, powerless, out of ideas and lacking any genuine outrage at this senseless slaughter.\n+ One thing you have to admire about Trump is that he didn’t give up pursuing his agenda, no matter how debased it was. He didn’t surrender to the presumed “bounds of executive” authority. He pushed them. People liked that he was a fighter…or, at least, projected the image of one.\n+ A couple of weeks ago New York Mayor Eric Adams blamed school shootings on taking prayer out of public schools. What’s his explanation for the shooting at the Covenant Christian School in Nashville that left 7 dead?\n+ Republican members of Congress suffered an anxious couple of hours waiting to hear what kind of gun was used to slaughter the three children (and 3 adults) in Nashville, so that they’d know which pin (AR-15, Glock, Smith & Wesson) to wear to “work” the next day. It turned out they could emblazon their chests with three pins, two assault rifles and a 9 mm handgun.\n+ Marsha Blackburn, the former beauty pageant contestant turned US senator from Tennessee, has raked in $1,306,130 from the NRA, while her state averages 1,273 gun deaths a year.\n+ When did it become fashionable to celebrate the birth of Christ with your favorite automatic weapon? Here’s the family Xmas card of Rep. Andy Ogles, who represents the Nashville congressional district where the Covenant School is located.\n+ Ogles is the same family values politician who used photos of stillborn fetus to raise $25,000 for a funeral park, featuring benches and a “life-size statue of Jesus,” which never materialized…\n+ The common factor in school shootings according FoxNews: “Side doors.”\n+ Childrearing in America: Spare the AR-15, spoil the child.\nNashville: AR-15\nUvalde: AR-15\nBuffalo: AR-15\nBoulder: AR-15\nOrlando: AR-15\nParkland: AR-15\nLas Vegas: AR-15\nSandy Hook: AR-15\nSan Bernardino: AR-15\nMidland/Odessa: AR-15\nColorado Springs: AR-15\nPoway synagogue: AR-15\nSutherland Springs: AR-15\nTree of Life Synagogue: AR-15\n+ Washington Post on the impact of a single high validity AR-15 round: “A single bullet lands with a shock wave intense enough to blow apart a skull and demolish vital organs. The impact is even more acute on the compact body of a small child.”\n+ Jessica Ellis: “I have no maternal instinct. I’ve never wanted to have kids, not a day in my life. I still know that the right of a child to come home alive at the end of a school day supersedes my right to have unfettered access to guns. It’s not a hard moral choice. It’s not even a question.”\n+ FoxNews’ Shannon Bream: “Sometimes we have nothing left but to say, ‘God, please help us. We can’t make sense of this situation, but just meet us in the grief.’ And sometimes that’s all we can ask for.”\n+ “Can’t make sense of the situation?” Perhaps her hairdresser can it explain it to her…\n+ Sen. Rick Scott (Moron-FL): “We need to consider an automatic death penalty for school shooters. Life in prison is not enough for the deranged monsters who go into our schools to kill innocent kids & educators.” What’s the plan, Senator, resurrect the shooter and then kill her again?\n+ Sen. Josh Hawley, the running man from Missouri, is demanding that the Nashville shooting be labeled an anti-Christian hate crime, despite the fact Hawley was the only U.S. senator to vote against a 2021 bill to help victims of hate crimes.\n+ The shoulder shrugs really sell the congressman’s complete indifference…\n+ In a study published this week, the CDC reported that the number of people injured by gunfire was nearly 40% higher in 2020 and 2021 than it was in 2019. In 2022, gun injuries declined slightly, but were still 20% higher than before the pandemic.\n+ In the 72 hours since the Nashville shootings, another 192 people have been shot by guns in the US.\n+ According to a report released by Physicians for Human Rights and the International Network of Civil Liberties Organizations, more than 119,000 people have been injured by tear gas and other chemical irritants globally since 2015.\n+ Prisoner rights groups have raised alarms about the wretched condition of drinking water in Illinois’ prisons for years. Last week the Illinois EPA finally issued drinking water violation notices to 10 state-run prisons.\n+ Jose Viera, a guard at the federal lockup in downtown Los Angeles, was sentenced to 10 years in prison for raping an inmate who was being held in an isolation cell while recovering from COVID-19.\n+ Louisiana jails people at twice the rate of the national average. The state has the second-highest imprisonment rate in the country, trailing only Mississippi.\n+ Since taking office in 2020, Mississippi Gov. Tate Reeves has replaced the entire Mississippi Parole Board with his own appointees. Over the last two years, the number of parole approvals has fallen, while the incarceration rate in the state has increased steadily.\n+ Virginia’s Governor Glenn Youngkin just signed into law a measure giving the state’s Department of Corrections nearly unlimited discretion to place people in solitary conditions.\n+ “Inmate factories“: how Rep. Gary Palmer (Bigot-AL) described the majority-black DC public school system during “oversight” hearings last week.\n+ In the wake of the BLM protests, North Carolina has passed a new “anti-rioting” bill that will impose extreme penalties on protesters, including mass arrests, detention of at least 24 hours for all of those accused of rioting before getting a bond hearing, and allowing property owners to sue for up to three times the actual damage sustained. The state’s Democratic Gov. Roy Cooper criticized the bill: “Property damage and violence are already illegal and my continuing concerns about the erosion of the First Amendment and the disparate impacts on communities of color will prevent me from signing this legislation.” But, in typical Democratic fashion, he won’t veto it either, which means the bill will become law.\n+ Los Angeles County DA George Gascón announced involuntary manslaughter charges against seven California Highway Patrol officers and a registered nurse for the 2020 death of Edward Bronstein, who after being pulled over on a traffic stop was pushed to the ground and forcibly restrained while repeatedly pleading that he could not breathe.\n+ A federal judge San Diego named Robert Benitez berated a crying 13-year-old girl and had her handcuffed at her dad’s sentencing hearing in order to send her a message, though precisely what the message was, other than the cruelty of the criminal system, wasn’t clear to anyone in the court room.\n+ The Texas legislature wants to a new intermediate court of appeals, designed to take power away from locally-elected and largely Democratic, judges in Austin, Houston, San Antonio and other cities.\n+ The Clay County, Florida jail is so over-crowded inmates are sleeping on the floor, “head to toe” and jail staffers have been moved out of their offices to make more room for newly arriving inmates.\n+ The town of Winona, Mississippi put its animal welfare program under the control of the police department and it didn’t take long for the police to start killing dogs at the shelter by shooting (instead of euthanizing) them and dumping their bodies in a public dumpster.\n+ An error in the database of the Oregon DMV resulted in a man being wrongly imprisoned for nearly a year. The DMV knew about the issue but didn’t correct it because it “wasn’t at a high enough level to understand the urgency.”\n+ What more training buys you: A report by the Chicago Use of Force Community Working Group finds that Chicago Police officers are taught how to “justify or even cover up police brutality.”\n+ The New Mexico Department of Corrections has lost track of nearly two dozen prisoners in its custody who are serving life sentences for crimes they committed as children, an error that could keep these “juvenile lifers” from getting a chance at freedom.\n+ Idaho is now the fifth state after Utah, South Carolina, Mississippi and Oklahoma to allow death by firing squads as pharmaceutical companies restrict the use of drugs for lethal injections.\n+ Globally, executions for drug-related offenses surged in 2022, while the number of drug offenders on death row rose by more than a quarter…\n+ In blind testing, the error rate of forensic firearms analysts is nearly 40%.\n+ The national murder rate is down by 10% in the top 67 cities in the US through February of this year.\n+ Surveillance footage shows that at least 10 sheriff’s deputies and medical staff at Virginia’s Central State Hospital piled on top of Irvo N. Otieno for 11 minutes until he stopped moving, leading to the 28-year-old Black man’s death. Otieno was shackled at the time.\n+ Shithole Country Update: Alabama is installing “bulletproof” whiteboards in classrooms in an effort to protect students and teachers from mass shooters.\n+ The average price of a home in Alabama is about $142,000. But under its no-bid billion-dollar prison, the state will pay $243,750 per inmate bed.\n+ Police in Kansas City were told to target minority neighbors to meet their (illegal) traffic ticket-writing quotas because “it would be easier to write multiple citations on every stop.”\n+ Hugo Holland, the special prosecutor hired to investigate the killing of Black motorist Ronald Greene by five White police officers in Louisiana, once displayed a portrait of Confederate general and Ku Klux Klan leader Nathan Bedford Forrest in his office.\n+ The city of Torrance, California was forced to paid Kylie Swaine $750,000 after two officers spray-painted a swastika on the inside of his car. Swaine is part Jewish. His lawyer, Jerry Steering, said: “I have been suing police officers for 39 years and I have never seen anything like this.”\n+ Suddenly Rep. James Comer, the Kentucky Republican, is everywhere. This week he was on CNN attacking “soft-on-crime” DAs and the alleged “crime wave” plaguing NYC. Yet, statistics show that NYC is one the planet’s safest cities. The murder rate in the New York has dropped by 80% in last 30 years. Meanwhile back in Comer’s home of Kentucky, with its tough on crime prosecutors, the murder rate is now the third highest in the nation.\n+ DeSantis is rightfully getting shit for going after books on library shelves. But New York Mayor Eric Adams is going after the libraries themselves, reducing their budgets by $36 million, mainly to increasing funding for the NYPD….\n+ Newly released interviews with the Uvalde cops who lingered in the hallway as kids were being mowed down inside the school reveal the reason they feared to enter the classroom was that the shooter had an AR-15, one of them exclaiming: “He has a battle rifle!”\n+ Later this week, Anne Marie Guerra, the NYPD sergeant who is accused of stuffing her dirty panties in the mouth of one of her subordinates, is set to get a raise and a promotion: According to a lawsuit now pending against here, five years ago “in a fit of rage, Sgt. Guerra retrieved her soiled underwear and violently shoved them into Falcon’s mouth and then aggressively rubbed them all over Falcon’s face,”\nApril\n+ A study in the Journal of the American Medical Association (JAMA) looked at 134 school shootings and found that the presence of armed guards increased deaths by 2.83 times.\n+ In 2014, there were 273 mass shootings in the US. The number has risen sharply ever since: 283 in 2016, 417 in 2018, 610 in 2020 and 290 in 2021. In the first three months of 2023, there already have been 135 mass shootings.\n+ The first three months of U.S. gun violence in 2023:\n+ 4,529 gun deaths\n+ 8,085 gun injuries\n+135 mass shootings\n+197 children shot\n+1,258 teenagers shot\n+268 incidents of defensive gun use\n+368 unintentional shootings\n+ 6,138 suicides\n+ An investigation by the Baltimore Banner reveals that since the start of the academic year last fall, two dozen high school-age teens have been shot in Baltimore within approximately two blocks of 16 different schools.\n+ Republicans in Tennessee tried to expel three Democratic members of the state legislature (Justin Jones, Justin Pearson, and Gloria Johnson) for expressing support for peaceful protesters (many of them high school students) calling for new gun safety legislation in the wake of the Covenant School in Nashville. The three Democrats have been accused of leading “an insurrection” that “stormed the capitol.” Yet, there were no injuries, no property damage and no arrests. The protestors went through the building’s security, which was operated by officers from the Tennessee Highway Patrol, and left the galleries willingly when the chamber went into recess.\n+ Rep. Gloria Johnson: “We’ve had members pee in each other’s chairs. We’ve had members illegally prescribe drugs to their cousin-mistress, and nothing happened. But talk on the floor without permission, and you’ll get expelled.”\n+ In the end, the Tennessee legislature expelled the two black men (Jones and Pearson) and retained the white woman (Johnson).\n+ A couple of months after the murder of Tyre Nichols by Memphis cops, the Tennessee legislature has voted to override police accountability measures passed by voters, strip civilian review boards of their power, and make it difficult to investigate abuse and excessive force.\n+ The female incarceration rate in the US is more than 6 times higher now than in 1980.\n+ And once in prison, their menstrual cycles are exploited as a form ofpunishment, degradation and humiliation.\n+ “A routine discomfort”: how the Sixth Circuit Court of Appeals describes solitary confinement in prison.\n+ Pro Publica has published a devastating exposé of the secret gratuities, trips and Clarence Thomas has pocketed from his sugar daddy, Harlan Crow, a Dallas tycoon who is a big time GOP donor. For two decades, Thomas has been indulged by Crow with yearly vacations and soirees, including international cruises on Crow’s super-yacht, flights on Crow’s Global 5000 jet, and retreats at Crow’s east Texas ranch and private resort in the Adirondacks. Crow even took Thomas to the Bohemian Grove gathering of the world’s top male power-brokers, a confab which the anti-globalist right has portrayed as a kind of annual Black Mass of the financiers of the Deep State, where the members satiate themselves on the blood of sacrificed infants.\n+ At his home in Dallas, Thomas’s sugar daddy Harlan Crow has a collection Hitler artifacts, including two of the frustrated watercolorist’s paintings, along with a signed copy of Mein Kampf and other assorted Nazi memorabilia. His garden is decorated with statues of some of the 20th century’s most notorious dictators.\n+ In the wake of these revelations came the inevitable calls for new ethics rulesfor members of the court. But this entirely misses the fact that were already rules and laws in place and Thomas violated them, knowing he’d never be held to account.\n+ Clarence Thomas: Reparations for me, but not for thee.\n+ Paul Roland: “From Jim Crow to Harlan Crow in one generation.”\n+ Even in his short tenure on the court, Abe Fortas was one of the most consequential and progressive jurists in American history. Yet Fortas resigned (and rightly so) after it was revealed he was paid for teaching a summer law course at my alma mater, American University, and had received and returned a $20,000 check from the Wolfson Foundation, a charity run by the family of Wall Street financier Louis Wolfson, who had been indicted for securities fraud (ie, falsifying business records and checking the wrong boxes). So will Thomas the bag man, resign? You’re kidding, right? Yeah.\n+ Be sure to set your clocks back 23 years tonight…\n+ In 2019, the US Department of Justice issued a blistering survey of the state of Alabama’s failures to protect incarcerated people from violence, sexual abuse, excessive force by staff. Since then 698 more incarcerated Alabamians have died in state prisons.\n+ Before the Supreme Court’s decision in Roe vs. Wade, the LAPD operated one of the country’s few “abortion squads,” tracking down women who had terminated their pregnancies. Why hasn’t this become a James Ellroy novel?\n+ According to a report in Vice, ICE (remember them?) has been using 1509 summonses to demand data from elementary schools, news organizations, and abortion clinics.\n+ More than three million people in the US are on probation or parole. About 750,000 of them have no health insurance. They risk incarceration if they can’t do things like pass regular drug tests.\n+ A Bureau of Justice Statistics study of victims of child sexual abuse in detention facilities found that among 499 substantiated incidents, perpetrators faced legal action only 31% of the time, and that incidents were typically handled internally, with a reprimand or discipline, demotion or temporary suspension.\n+ Despite the howls about the supposed leniency of NYC prosecutors and recent bail reforms, inmates spend an average of 115 days at the city’s Rikers jail, four times the national average. Most of them are stuck in jail awaiting trial.\n+ If you read most of the coverage (and especially that in the New York Times) on the results of the Chicago mayoral primary, you’d probably come away convinced that former mayor Lori Lightfoot lost because she was soft on crime. Thus it must have come as a shock to you to learn that she was replaced by someone even “softer” on crime than she supposedly was: Brandon Johnson, who handily defeated the tough-on-crime candidate Paul Vallas. In the run-up to the election, the head of the Chicago Police Union said at least 1,000 officers would quit their jobs if Johnson was elected. Let’s see if it happens.\n+ A study in the Journal of the American Medical Association (JAMA) looked at 134 school shootings and found that the presence of armed guards increased deaths by 2.83 times.\n+ In 2014, there were 273 mass shootings in the US. The number has risen sharply ever since: 283 in 2016, 417 in 2018, 610 in 2020 and 290 in 2021. In the first three months of 2023, there already have been 135 mass shootings.\n+ The first three months of U.S. gun violence in 2023:\n+ 4,529 gun deaths\n+ 8,085 gun injuries\n+135 mass shootings\n+197 children shot\n+1,258 teenagers shot\n+268 incidents of defensive gun use\n+368 unintentional shootings\n+ 6,138 suicides\n+ An investigation by the Baltimore Banner reveals that since the start of the academic year last fall, two dozen high school-age teens have been shot in Baltimore within approximately two blocks of 16 different schools.\n+ Republicans in Tennessee tried to expel three Democratic members of the state legislature (Justin Jones, Justin Pearson, and Gloria Johnson) for expressing support for peaceful protesters (many of them high school students) calling for new gun safety legislation in the wake of the Covenant School in Nashville. The three Democrats have been accused of leading “an insurrection” that “stormed the capitol.” Yet, there were no injuries, no property damage and no arrests. The protestors went through the building’s security, which was operated by officers from the Tennessee Highway Patrol, and left the galleries willingly when the chamber went into recess.\n+ Rep. Gloria Johnson: “We’ve had members pee in each other’s chairs. We’ve had members illegally prescribe drugs to their cousin-mistress, and nothing happened. But talk on the floor without permission, and you’ll get expelled.”\n+ In the end, the Tennessee legislature expelled the two black men (Jones and Pearson) and retained the white woman (Johnson).\n+ A couple of months after the murder of Tyre Nichols by Memphis cops, the Tennessee legislature has voted to override police accountability measures passed by voters, strip civilian review boards of their power, and make it difficult to investigate abuse and excessive force.\n+ The female incarceration rate in the US is more than 6 times higher now than in 1980.\n+ And once in prison, their menstrual cycles are exploited as a form ofpunishment, degradation and humiliation.\n+ “A routine discomfort”: how the Sixth Circuit Court of Appeals describes solitary confinement in prison.\n+ Pro Publica has published a devastating exposé of the secret gratuities, trips and Clarence Thomas has pocketed from his sugar daddy, Harlan Crow, a Dallas tycoon who is a big time GOP donor. For two decades, Thomas has been indulged by Crow with yearly vacations and soirees, including international cruises on Crow’s super-yacht, flights on Crow’s Global 5000 jet, and retreats at Crow’s east Texas ranch and private resort in the Adirondacks. Crow even took Thomas to the Bohemian Grove gathering of the world’s top male power-brokers, a confab which the anti-globalist right has portrayed as a kind of annual Black Mass of the financiers of the Deep State, where the members satiate themselves on the blood of sacrificed infants.\n+ At his home in Dallas, Thomas’s sugar daddy Harlan Crow has a collection Hitler artifacts, including two of the frustrated watercolorist’s paintings, along with a signed copy of Mein Kampf and other assorted Nazi memorabilia. His garden is decorated with statues of some of the 20th century’s most notorious dictators.\n+ In the wake of these revelations came the inevitable calls for new ethics rulesfor members of the court. But this entirely misses the fact that were already rules and laws in place and Thomas violated them, knowing he’d never be held to account.\n+ Clarence Thomas: Reparations for me, but not for thee.\n+ Paul Roland: “From Jim Crow to Harlan Crow in one generation.”\n+ Even in his short tenure on the court, Abe Fortas was one of the most consequential and progressive jurists in American history. Yet Fortas resigned (and rightly so) after it was revealed he was paid for teaching a summer law course at my alma mater, American University, and had received and returned a $20,000 check from the Wolfson Foundation, a charity run by the family of Wall Street financier Louis Wolfson, who had been indicted for securities fraud (ie, falsifying business records and checking the wrong boxes). So will Thomas the bag man, resign? You’re kidding, right? Yeah.\n+ Be sure to set your clocks back 23 years tonight…\n+ In 2019, the US Department of Justice issued a blistering survey of the state of Alabama’s failures to protect incarcerated people from violence, sexual abuse, excessive force by staff. Since then 698 more incarcerated Alabamians have died in state prisons.\n+ Before the Supreme Court’s decision in Roe vs. Wade, the LAPD operated one of the country’s few “abortion squads,” tracking down women who had terminated their pregnancies. Why hasn’t this become a James Ellroy novel?\n+ According to a report in Vice, ICE (remember them?) has been using 1509 summonses to demand data from elementary schools, news organizations, and abortion clinics.\n+ More than three million people in the US are on probation or parole. About 750,000 of them have no health insurance. They risk incarceration if they can’t do things like pass regular drug tests.\n+ A Bureau of Justice Statistics study of victims of child sexual abuse in detention facilities found that among 499 substantiated incidents, perpetrators faced legal action only 31% of the time, and that incidents were typically handled internally, with a reprimand or discipline, demotion or temporary suspension.\n+ Despite the howls about the supposed leniency of NYC prosecutors and recent bail reforms, inmates spend an average of 115 days at the city’s Rikers jail, four times the national average. Most of them are stuck in jail awaiting trial.\n+ If you read most of the coverage (and especially that in the New York Times) on the results of the Chicago mayoral primary, you’d probably come away convinced that former mayor Lori Lightfoot lost because she was soft on crime. Thus it must have come as a shock to you to learn that she was replaced by someone even “softer” on crime than she supposedly was: Brandon Johnson, who handily defeated the tough-on-crime candidate Paul Vallas. In the run-up to the election, the head of the Chicago Police Union said at least 1,000 officers would quit their jobs if Johnson was elected. Let’s see if it happens.\n+ Myles Cosgrove, the former Louisville cop who shot Breonna Taylor, was hired by the Carroll County, Kentucky Sheriff’s Office.\n+ They say there are a million ways to die in New York City. Maybe so, but this way is becoming more and more familiar, especially if you’re a black male. Last week, Kawaski Trawick accidentally locked himself out of his NYC apartment while he was cooking. He called the fire department, who let him back in. In the meantime, Trawick’s neighbor saw him standing in the hallway holding a knife (butter) and called the NYPD. The cops show up, break into his apartment and startle Trawick, who had resumed cooking in his kitchen. He asks the cops to leave. They say no and demand he drop the knife (butter). Then one cop tasers Trawick and the other shoots him. The two cops wait at least 4 minutes before rendering any medical aid. By then, Trawick has bled out and is dead.\n+ More than two years ago Anthony Alvarez was shot to death by a Chicago police officer during a foot pursuit. This week the city moved to fire the officer (Sammy Encarnacion) who initiated that fatal chase– but over entirely different charges of “serious misconduct” made several years before.\n+ According to a new report by the San Diego Association of Governments (SANDAG), San Diego Police are nearly seven times more likely to use force on Black suspects than they are on White and Hispanic suspects.\n+ An internal review by the LAPD disclosed that since 2018, its officers have been involved in 4,203 vehicle pursuits, more than a quarter of which ended in injuries or deaths. More than half of those injured in these chases were bystanders.\n+ A long-running study by Northwestern University finds that one-in-four youths who spent time in the Cook County Juvenile Detention Center were shot or killed in the years following their release.\n+ It doesn’t get much more obscene than this. A couple of weeks ago, Gentner Drummond, the Attorney General for the state of Oklahoma, asked the Court of Criminal Appeals to vacate the conviction of death row inmate Richard Glossip. Citing the misleading testimony of the main witness in the case, a mentally-disturbed man named Justin Sneed, who actually committed the murder, Drummond told the court: “The state has reached the difficult conclusion that the conviction of Glossip was obtained with the benefit of material misstatements to the jury by its key witness.” Drummond wasn’t alone. The prosecutor in Glossip’s case also wants the conviction overturned, as do many members of the Oklahoma legislature, fearing the state is on the verge of putting to death an innocent man. But the appeals court swiftly rejected the request, coldly saying: “Glossip has exhausted every avenue and we have found no legal or factual ground which would require relief in this case.” The appeals court’s denial was followed by the OK Board of Pardon and Parole decision to deny a clemency request for Glossip on a 2-2 vote. His execution date is set for 5/18, unless the Supreme Court intervenes.\n+ Damien Echols, Jesse Miskelley and James Baldwin, the so-called Memphis Three, were convicted for the 1993 murder of three young boys in West Memphis, Arkansas. Echols spent 18 years on death row, before being released. Even though Echols, Miskelley and Baldwin were freed, their convictions have never been overturned. Now an Arkansas court has refused Echols’ request for DNA testing that could prove who really killed Chris Byers, Stevie Branch, and Michael Moore.\n+ Similarly, Tennessee has refused to test DNA evidence that could prove the state executed an innocent man (Sedley Alley) 2006. After to Tennessee law, Alley is the only person who could have filed a petition for post-conviction DNA testing.\n+ Maurice Jimmerson was arrested by police in Albany, Georgia in 2013, along with four other men for a double murder. Two of Jimmerson’s co-defendants were acquitted by a jury in 2017. But Jimmerson has yet to even go trial and has spent the last 10 years in the Dougherty County Jail. At this point, Jimmerson, who has pleaded not guilty, doesn’t even have a lawyer, due to a shortage of public defenders in rural Georgia. Maurice was 22 when he was arrested. He’s now 32 and still doesn’t have a trial date.\n+ Texas police are still arresting lots of people on marijuana charges, most of them Black or Hispanic. According to data collected by Austin Sanders at the Austin Chronicle, of those arrested on pot charges last year:\n49% – Hispanic\n34% – Black\n17% – White\n1% – Asian\nThe racial composition of Travis County is:\n48% – White\n34% – Hispanic\n8% – Black\n7% – Asian\n+ While we’re still thinking about Texas, under HB13, the bill which would give teachers in the state a $25,000 stipend if they agree to arm themselves at school, would also confer upon them the same kind of qualified immunityenjoyed by police.\n+ From 1910 to 1920, lynchings and racial violence led to the death or disappearance of nearly 5,000 people of Mexican descent in the U.S.\n+ The city of Minneapolis is facing a federal lawsuit after revelation that the city’s police officers spied on members of the local chapter of the National Association for the Advancement of Colored People (NAACP) for years without any legitimate purpose.\nMay\n+ Dallas County Judge Clay Jenkins on why so many kids are kept in solitary confinement in the county’s juvenile facilities: “We’ve been locking those children up in solitary confinement, essentially because there weren’t enough people there to do the care that is required by law.”\n+ 42 women, including 10 minors, are filing lawsuits against the West Virginia State Police for hidden cameras in junior troopers locker rooms. The suits allege rampant sexual misconduct and that key evidence has been destroyed.\n+ A Wayne State University police officer was called to an apartment complex in downtown Detroit, where moments after entering the building he shot a dog in the face twice. The police chief decided not to take any disciplinary action against the cop, saying “He had no recourse. He was boxed in the corner with nowhere to retreat.” The dog, named Ace, is a 10-year-old Goldendoodle, described by neighbors as gentle and playful, who serves as an emotional support dog.\n+ The number of women and girls incarcerated in the US is now 6 times higher than it was in 1980.\n+ Francine Martinez is the first Colorado cop to be convicted by a jury for failing to intervene after another officer choked a man and beat him with a gun during an arrest in 2021.\n+ Kawneta Harris, a nurse incarcerated in a Texas prison, told another inmate that “partial birth abortions” aren’t a real thing. Her conversation was overheard by a male guard, who exclaimed that he had survived a “partial birth abortion.” The guard retaliated against Harris by placing her in solitary confinement.\n+ When a Delaware inmate named David Holloman led a peaceful boycott against the high fees that ViaPath charges to use its tablets, he was stripped of his good time, fired from his prison job, and confined to a cell for all but two hours a day for more than a year.\n+ A federal Bureau of Prisons monitor who raped a Miami woman on house arrest was handed a prison sentence one month shorter (four months) than his victim’s time on house arrest.\n+ France’s prisons are now at 120% of capacity. As of April 1, France counted 73,080 inmates in prisons equipped to hold just 60,899 people.\n+ The rate of firearm deaths in the US are much higher in small towns than big cities. According to a new study out of Columbia University’s School of Public Health, “In the 2000s, the two most rural county types had statistically more firearm deaths per capita than any other county type, and by the 2010s, the most urban counties—cities—were the safest in terms of intentional firearm death risk.”\n+ Despite the drumbeats about the “defunding” of police departments, the opposite has happened. From 2016-2020, the number of full-time staff in local police departments declined by 0.1%. In terms of budgets, far more departments have seen an increase since 2019 than have seen a decrease.\n+ Let’s look at “liberal” San Francisco. In the last 10 years, the SFPD’s budget has increased by over $100 million. It’s put an additional 400 cops on the streets, but the department’s clearance rate for serious offenses has fallen by 10 percent.\n+ Since the beginning of the 2022 fall semester, 17 guns have been seized on the grounds of public schools in Albuquerque, New Mexico. The most ever. And seven more than through all of last school year.\n+ $11,071: the average annual income of women locked up in jail awaiting trial because they can’t afford bail.\n+ Here’s an update on the Great Crime Wave: So far this year, in NYC homicides are down 8% and shootings down 25%.\n+ A society that systematically victimizes people tends to reflexively blame its victims for their own misfortune: poverty, hunger, chronic illness, homelessness, mental distress and, as we’re witnessing once again with the case of Jordan Neely, even their own deaths.\nTraditionally, this role has fallen to the New York Times and when it came to the murder on the F train they sprang into action. Within a few days of the killing of Jordan Neely, the Times was out with a piece by Michael Wilson and Andy Newman that softened the image of Daniel Penny, the unemployed ex-Marine who choked the life out of Neely, making the killer more relatable to the Times’ middle class readers, while dirtying up the image of the man Penny asphyxiated in a chokehold that lasted more than 10 dreadful minutes.\nPenny is described as easy going, a people person, an unstressed former Marine who loved surfing. Yes, he too was jobless, but unlike Neely, he had aspirations. He wanted to become a bartender in Manhattan and a good citizen in the city he loved.\nWhen the Times turns to Neely, we are treated to sketches in urban pathology–the portrait a troubled black youth, who has been in decline since high school. His life is reduced to his rap sheet, his arrests, his confinements to the psych ward. There’s even a gratuitous description of Neely urinating in public, though surely at some point in his life Penny had done the same.\nNeely is depicted as ranting, homeless, troubled, erratic, violent, mentally ill and ready to die. It’s almost as if we’re meant to believe that Neely’s murder was a case of “suicide by vigilante.” He was, the story implies, almost asking for someone to kill him.\nThe Times reporters paint Penny’s takedown of the frail, malnourished Neely as a “struggle.” Despite a car full of witnesses, the Times account says the origins of this “struggle which ended Neely’s life” were “unclear.” They couldn’t find anyone who would say Neely had threatened them, but left the impression that he might have and likely did.\nAs a Marine, we’re told that Penny had been trained in the “blood choke,” which is described as a “fast and safe” method of rendering people unconscious. No mention is made of the chokehold deaths of Eric Garner and George Floyd or the scientific evidence that chokeholds which cause people to lose consciousness often inflict brain injuries. We’re left to believe that Neely didn’t respond properly when his neck was being choked, that he struggled and flailed for his life, instead of passively surrendering and slipping into a harmless sleep.\nPenny’s motives were pure and Neely’s were suspect. “Knowing Danny and knowing his intentions,” the Times reporters quote one of Penny’s friends as saying, “it was to help others around him.”\nAfter all, Penny surfs and Neely didn’t.\n+ Late on Thursday, NYC prosecutors announced they were charging Penny with Manslaughter in the Second Degree, which is classified as a Class C Non-Violent Felony, where first-time offenders often receive a non- incarceratory sentence, usually of probation.\n+ Are they going to be rewriting the Gospel of Luke in the King Ron version of the Bible, where the Good Samaritan kills the homeless person left along the road without money or food?\n+ I’m not a Christian, but I think DeSantis has missed the core teaching of its prophet, which is that the robbers, especially those acting out of destitution, should be forgiven not asphyxiated by trained killers. The parable itself is about a reversal of fortune– a rich man suddenly deprived of his wealth and health and thus ignored by passers-by–including pious Jews and gentiles–until a heretical Samaritan comes to his aid. A true Good Samaritan would have offered a distraught man shouting he was thirsty a drink–not crushed his windpipe.\n+ The Massachusetts Supreme Court ruled unanimously this week that pedestrians arrested after a stop-and-frisk have the right to challenge the resulting criminal prosecution on the grounds that they were targeted by the officers on the basis of their race.\n+ Speaking of good Samaritans, Border Patrol agents felt compelled to arrest a 75-year-old humanitarian worker who was bringing water to lost migrant children, including one holding a baby. The charge? Trespassing on public land.\n+ NYC Mayor Eric Adams is apparently considering a plan to lock up migrants, including asylum seekers, in a notorious Rikers Island jail that was shuttered last year.\n+ A report in Homicide Studies shows that the rate of firearm violence is increasing in smaller cities, not large ones like New York. Some small cities have had increases as high as or higher than 500% within a six-year window, including Dothan, Alabama (population 71,072) — a 500% increase.\n+ After guards at the South Central Correctional Center in Missouri saw Anthony O’Neal “open kissing” his wife during a contact visit, they assumed (wrongly) she was passing him drugs. The guards placed O’Neal in solitary confinement for 17 days. During that time, he was held in arm and leg restraints and given no breaks for meals, sleep or restroom usage. Prison officials claimed they were trying to determine if he would pass the contraband through his bowels. According to court records: “While in the dry cell and full restraints for seventeen days, plaintiff was not able to bathe and was forced to lay in his own feces and rotten food that was on the floor. During these seventeen days plaintiff had at least ten bowel movements and… no contraband was ever found.”\n+ In the last eight years, 5 of the 10 deadliest mass shootings in America have occurred in Texas, a state where nearly every household owns at least one gun.\n+ For the 14th straight year, the United States was the only country in North or South America to execute people, according to Amnesty International’s annual report on the global use of the death penalty. At least 883 executions were recorded around the world last year, a 53-percent increase over 579 deaths in 2021. Executions in Saudi Arabia tripled to 196 people (the most in the country in 30 years) and included the execution of 81 people in a single day.\n+ The Lancet on capital punishment: “At its core, execution is a barbaric practice that goes against the ethical foundation of the physician’s role, and draws medical professionals into the state-sanctioned murder of civilians.”\n+ At least, 729 cops died from COVID from 2020 – 2021. According to a study in the Police Journal, he majority of these deaths occurring in the South. A larger percentage of COVD-19 deaths were reported for officers who were male, White, and older.\n+ The Havana Syndrome of the War on Drugs: Dozens of cops across the country claimed by accidentally touching or breathing fentanyl while making an arrest. But there’s no evidence that fentanyl can be absorbed through the skin and a lot of evidence that it can’t be. Dr. Ryan Marino, a toxicologist and emergency room physician who studies addiction at Case Western Reserve University: “This has never happened. There has never been an overdose through skin contact or accidentally inhaling fentanyl.”\n+ An AP investigation found that Black people are disproportionately denied aid from state programs that reimburse victims of violent crime. Using data from 23 states, the AP reporters found some states where Black applicants were nearly twice as likely as white applicants to be denied aid.\n+ Last weekend in mass shootings: 3 in Portland, OR, 6 Anderson, IN, 3 ABQ, 3 Memphis, 3 Chicago, 3 New Orleans, 3 Portland, OR, 3 Mobile, 3 Albany, NY, 4 Sacramento, 7 Yuma, 4 Manchester, NH, 5 Louisville, 4 Shreveport, 3 New Orleans, 5 Augusta, GA, 5 Dallas, 3 Philly, 4 Laurel, MD, 3 Columbus, OH. Total shot: 77.\n+ After Brazil enacted firearm restrictions in 2003, suicides using guns fell by 27 percent.\n+ Yet more empirical evidence that bail reform has little to no influence on crime rates.\n+ A study in Massachusetts shows that higher suicide rates were associated with being male, 65 years or older, White, and non-Hispanic or having military background. Suicide rates were highest in the construction industry sector.\nJune\n+ Joe Biden made his rep as a drug warrior and, by god, he’ll go out as one. Biden has lent his support to the HALT Fentanyl Act, would permanently add “fentanyl-related substances” (FRS) to Schedule I of the Controlled Substances Act, the most restrictive category. FRS is defined as “any substance that is structurally related to fentanyl” and features one of five chemical alterations. Anyone convicted of possessing specified amounts of an FRS will be subject to mandatory minimum sentences: five years for 10 grams or more of “a mixture or substance containing a detectable amount” of an FRS and 10 years for 100 grams or more. If “death or serious bodily injury results from the use of such substance,” the mandatory minimum increases to 20 years.\n+ 36% of people who went to jail in 2017 had incomes under $10,000. 22% had a serious mental illness. Over one-third had a substance use disorder. Nearly a quarter had no health insurance.\n+ Cities across the US have been forced to pay out a total of more than $80 million in settlements to protesters injured by police during 2020 BLM protests.\n+ The Waukegan, Illinois cops who coerced a teen’s false confession to a shooting will face no disciplinary action. But the north Chicago suburb is on the hook to $200,000 to the 15-year-old, who was wrongly charged with attempted murder and jailed for two nights.\n+ A Virginia State trooper who catfished and abducted a 15-year-old girl and killed her grandparents and mother had a history of mental health issues so severe that his gun rights had been stripped. These warning signs didn’t stop the Virginia State police from hiring him…\n+ A review of millions of traffic stops and the voting records of the officers who made them reveals that White police officers who vote Republican exhibit a larger racial disparity in police stops than white police officers who vote for Democrats. This bias increased from 2012–2020.\n+ The use of solitary confinement has become so pervasive and controversial that officials in California, where Gov. Gavin Newsom vetoed a measure to restrict its use, have started labeling prolonged isolation “administrative segregation” and a range of other terms to disguise how often it is employed in the state’s prisons.\n+ In justifying detaining migrants seeking asylum in Rikers jail, New York City Mayor Eric Adams has claimed the city simply has “no more room”. But according to documents obtained by the New York Daily News, at least 2,182 apartments meant for homeless New Yorkers are currently sitting vacant.\n+ Last week an LA Sheriff’s Department deputy accused of being in a department gang known as the Executioners was compelled to show his gang tattoo in court. The case also disclosed images of the group’s logo printed on office supplies in the station and on flag on a deputy’s truck.\n+ In 2021, 93% of the arrests that began as felonies in New York City and did not end in felony convictions.\n+ This week the 9th Circuit Court of Appeals overturned the death sentence for Colin Dickey, ruling that his prosecutor knowingly presented false and misleading testimony and arguments and withheld favorable evidence from Dickey’s defense.\n+ The Lancet, the UK’s leading medical journal, published an editorial (The Death Penalty: a Breach of Human Rights and the Ethics of Care) condemning physician involvement in executions: “Physician involvement undermines the four pillars of medical ethics—beneficence, non-maleficence, autonomy, and justice.”\n+ Richard Carter, 63, was booked into a Harrisburg-area jail on the coldest night of the year and put on suicide watch by a psychologist named Robert Nichols, who said as Carter was taken away: “Fuck him. He can freeze in that smock.” Carter died in his cell a couple of days later from COPD (Chronic obstructive pulmonary disease).\n+ At least four people have died inside Sacramento County jails already this year. Since 2014, there have been 64 reported deaths.\n+ Joshua Valles was one of the people sent to Rikers after last year’s rollbacks of bail reform. He died in custody on Saturday after complaining of headaches. Jail officials claimed he had a heart attack and there was “no Departmental wrongdoing.” However, an autopsy revealed Valles had a fractured skull and significant brain injuries. It seems likely that Valles fell victim to the rampant violence inside the jail, which has put the facility under court-ordered monitoring. Valles appeared to be healthy when he was sent to Rikers, after he couldn’t pay the $10,000 in bail set for a non-violent theft charge. Under the bail reforms gutted by Gov. Kathy Hochul, Valles wouldn’t have been sent to Rikers and would probably be alive today.\n+ Over the last decade, the firearm death rate in rural counties has been nearly 40 percent higher than in urban areas.\n+ Biden’s Justice Department is in court this week arguing that lawsuits filed by some of the thousands of families separated at the border by the Trump Administration should be rejected because the family separation policy was “adopted” for “perceived humanitarian considerations.”\n+ Michel Foucault: “Justice must always question itself, just as society can exist only by means of the work it does on itself and on its institutions.”\n+ In the 90 largest cities in the US, the murder rate is down by 12%. If this trend continues, it would represent one of the largest declines in the murder rate in the US in history. But where’s the press coverage?\n+ Almost 70 percent of the homicides in the US each year (13,927 in 2019) are committed by people who know their victims and according to the FBI’s own statistics, people in the US are now almost as likely to be killed by police (1,039) as they are by a stranger (1,372).\n+ Prior to 2007, gun sales in the US never topped more than 7 million guns in a single year. By the time Obama left office in 2017, the US was purchasing nearly 17 million guns a year. In 2020, US gun sales had soared to 23 million guns in a single year.\n+ More than 4o percent of the people sentenced to life without parole were 25 or younger at the time of their conviction. Numerous studies show that their younger age contributes to diminished capacity to comprehend the risk and consequences of their actions.\n+ A report by the Pew Charitable Trusts examined the cases of 33,128 childrenwho were placed on probation in Texas from October 2013 to September 2017. Despite making up only 13% of Texas’ population, Black children accounted for 27% of youth on probation in Texas. In comparison, white children make up about 33% of the state’s population, but only 23% were placed on probation. Black children were also 1.5 times more likely to be placed in a facility and 1.2 times more likely to be placed on probation when compared to white children, who were most likely to receive alternatives like diversion or dismissal, according to the report. These disparities existed despite Black and white children being charged with a similar share of f felony offenses — 23.1% for Black children compared to 22.7% for white children. The report found that nearly half of the kids — 15,362 in total — remained on probation for more than one year, despite a low risk of recidivism.\n+ A Chicago cop got out of 44 tickets by repeatedly that his girlfriend stole his car. 44 times!\n+ Oakland police paid a broke homeless woman $30,000 to testify about a slaying she didn’t witness. Based on her testimony, two young men were sentenced to serve life in prison for a murder they didn’t commit. The real killer was never caught and the men’s three children grew up without a father.\n+ At least two people appear to have died this year in Los Angeles’s jails from …hypothermia. There have been a total of 22 deaths in LA jails already this year.\n+ In July 2016, Philando Castille was shot and killed by police in Minnesota after being pulled over for a broken taillight. In the wake of his killing, Ramsey County, Minnesota changed its prosecution policies related to traffic stops based solely on minor infractions in 2021. Since then, the county has seen 66% decrease in traffic stops of Black motorists and an 86% decline in non-public safety traffic stops.\n+ 37% of trans people who were receiving hormone therapy before incarceration were denied their hormones once inside.\n+ An analysis by the New York Post disclosed that the NYPD issued 10,000 summonses to people for having open alcoholic beverages in public in the last year– 90% of people who received these tickets are Black or Hispanic.\n+ Speaking of the “weaponization” of the Justice Department, after the Dobbs ruling came down the FBI increased the number of its investigations into abortion-rights activists by 1o-fold. Over to you, Jim Jordan. Jim? Hello? Are you there, Jim?\n+ According to a new court filing on the atrocious conditions inside the jails of Los Angeles, prisoners are not getting toilet paper and instead have had to wipe themselves with orange juice cartons.\n+ Sex offender registries don’t work and often punish those they seek to protect: “Those on registries are primarily men, and these laws are presented as policies that protect women and children. Yet those on registries live with partners, children, and parents who are also directly impacted by these restrictions.”\n+ Continuing a demented tradition set by Antonin Scalia, the Supreme Court has ruled that a finding of “innocence” is not enough to overturn a conviction. In a 6-3 ruling last week, the Court denied the appeal of Marcus Jones who in 2000 was sentenced to 27 years in prison on federal firearms charges. Jones’ conviction should have been invalidated, according to a later Supreme Court ruling in Rehaif v. US. But by the time of the Rehaif decision in 2010, Jones had already appealed his conviction and been denied and according to the Roberts Court you only get one bite at the appeal. The majority opinion came from the pen of Clarence Thomas, who wrote that: “A federal prisoner may not, therefore, file a second or successive §2255 motion based solely on a more favorable interpretation of statutory law adopted after his conviction became final and his initial §2255 motion was resolved.” Thomas based his decision on the odious 1996 crime bill authored by Clinton and Biden. In a scorching dissent, Justice Sotomayor wrote: “A prisoner who is actually innocent, imprisoned for conduct that Congress did not criminalize, is forever barred by 28 U. S. C. §2255(h) from raising that claim, merely because he previously sought postconviction relief. It does not matter that an intervening decision of this Court confirms his innocence. By challenging his conviction once before, he forfeited his freedom.”\n+ Kwame Ture: “We are saying that there is a system that allows for one or two Black people to get out and that’s the rationale for keeping other Black people down.” Consider Clarence Thomas…\n+ The Supreme Court struck down affirmative action based on race. It left intact affirmation action for the privileged and the connected, for legacy admissions, the children of rich donors, staff, politicians and athletes. (A 2019 study found that 75% of those white students who entered Harvard on legacy admissions would have been rejected on the merits.)\n+ From Justice Jackson’s dissent in the affirmative action case: “With let-them-eat-cake obliviousness, today, the majority pulls the ripcord and announces ‘colorblindness for all’ by legal fiat. But deeming race irrelevant in law does not make it so in life.”\n+ Here’s Sotomayor: “Despite the court’s unjustified exercise of power, the opinion today will only serve to highlight the court’s own impotence in the face of an America whose cries for equality resound.”\n+ Revealing that Chief Justice Roberts’ majority opinion explicitly exempts military academies on using race as a consideration for admissions “in light of the potentially distinct interests [they] may present.”\n+ As we contemplate the end of affirmative action in a case involving Harvard, it is worth remembering that more than a third of the money donated to Harvard up until the Civil War came from men who made their fortunes from slave labor.\n+ After the Democrats swapped the New Deal for Neoliberalism, the last rationale they could muster for progressives voting for them was their vow to save the Supreme Court, which they promptly lost. There’s literally no justification now, since any progressive programs they pass will be struck down by the reactionary court they helped foster into decades-long dominance.\n+ Recall that RBG was diagnosed with pancreatic cancer in 2009 (10 years after being diagnosed with colon cancer), when she was 76, and the Democrats controlled the Senate. (Of course, at a personal level at least, Ruth Bader Ginsburg didn’t seem to be an enthusiastic supporter of affirmative action. In her entire tenure on the federal bench, Ginsburg hired only one black law clerk.\n+ Federal Judge Carlton Reeves on why he felt compelled by the Supreme Court’s recent swath of “originalist” opinions to rule that the 2nd Amendment prohibits laws restricting the sale of firearms to convicted felons: “Judges are not historians. We were not trained as historians. We practiced law, not history. And we do not have historians on staff. Yet the standard articulated in Bruen expects us ‘to play historian in the name of constitutional adjudication.’” Reeves had asked both the Justice Department and the defendant whether he should appoint a historian to assess the constitutionality of felon-in-possession laws. Both said no, so he didn’t. The entire 77-page opinion (US vs. Bullock) is compelling–if dispiriting–reading.\n+ It took years to destroy the misplaced trust in the Court. Why work to restore it now?\n+ Stop-and-Frisk policing seems to have returned with a vengeance in NYC. In the Brooklyn neighborhood of Brownsville, tickets for low-level crimes are up 2,000%. In a recent case, Manuel Morales threw a Mike and Ike candy box at a trash can and missed. Nearby cops jumped out of their car, grabbed Morales shoved his face into the sidewalk, arrested the bloodied man, and jailed him for 7 hours.\n+ John Askins and Chris Drake were friends in Oklahoma City. They were both Christians and addicted to fentanyl, living hard lives, often on the streets. One morning Askins, going through withdrawals, showed up at Drake’s grandmother’s house and said he was in pain. Drake suggested they buy some fentanyl to take off the edge. Drake bought three-tenths of a gram from a street dealer for $30, took the first hit and collapsed, his lips turning blue. Askins tried to revive his friend by performing CPR and called 911. When the cops showed up, they arrested Askins and, under merciless new “death by delivery” drug laws, prosecutors charged Askins with Murder One.\n+ A Florida couple hired a man to clean their pool. When they heard someone outside their porch, they hid behind their couch and fired 30 rounds from an AR-15 at the man who showed up to clean the pool as requested. The shooter wasn’t charged because the Pinellas County sheriff concluded that his was protected by the state’s “stand your ground” law.\n+ The National Association of Medical Examiners now says “excited delirium” should not be cited as a cause of death for people who die in police custody.\n+ Inmates in Alabama’s prisons are around three times as likely as other residents in the state to have HIV. While HIV rates have been dropping in the US over recent decades, the new data shows that inmates continue to be a high-risk population.\n+ According to CDC data, Florida (37.5 per 100,000) has more fatal drug overdoses per capita than California (26.6 per 100,000)–though you’d assume the reverse was true after listening to Ron DeSantis: “Don’t tell me it doesn’t affect people’s lives. I was just in San Francisco. In 20 minutes on the ground, I saw people defecating on the sidewalk. I saw people using Fentanyl.”\n+ DeSantis’ immigration plan could have been written by Stephen Miller: It includes ending birthright citizenship, mass detention of people, possible military action against Mexico and a change in the rules of engagement to allow for deadly force to be used against illegal immigrants cutting through the border wall: “If you drop a couple of these cartel operatives, they’ll stop coming.” Will they be wearing “cartel operative” fatigues? Or will Border Patrol be able to fire on any 12-year-old girl scaling the border wall?\n+ As Texas swelters under a record heat wave with the heat index approaching 127°F, 70% of the prison units within the Texas Department of Criminal Justice do not have full air conditioning, creating stifling conditions for the state’s large prison population. This is policy not negligence…\n+ Anthony Sanchez is a prisoner on death row in Oklahoma, convicted of a murder his father confessed to committing. Last week, Sanchez rejected a chance to plea for his life before the state’s clemency board, saying: “I’ve sat in my cell and I’ve watched inmate after inmate after inmate get [recommended for] clemency and get denied clemency…. They went out there and poured their hearts out, man. Why would I want to be a part of anything like that?”\n+ A federal appeals court in Louisiana ruled that a cop can sue a protest organizer for injuries caused by another person during a demonstration, ratifying a novel legal theory that threatens to further suppress protests and 1st Amendment rights more broadly…\n+ A recent Washington Post-Ipsos poll found that 51% of Black Americansexpect racism together worse within their lifetimes and 70% said that it’s more dangerous to be a Black teen now than when they were younger.\nJuly\n+ As France erupted after the killings of two young men by police, it’s worth noting that in the last 12 months police in the US have shot and killed at least 1,048 people, the rate of shootings little changed since the killings of Michael Brown, Philando Castile or George Floyd.\n+ Not to be a homer, but I’d like to remind people who whine: “Why can’t the US protest like the French?” that Portland sustained nightly protests against the local police, the feds and ICE for more than a year. It can, has and is (see Atlanta) being done here.\n+ In a gut-punch to the rights of defendants, the Georgia Court of Appeals ruled that a man who spoke with his attorney on the jail phone was not entitled to attorney client privilege because there is no reasonable expectation of privacyon a jail line, even though its often impossible for lawyers to visit their clients who are detained pretrial.\n+ Florida police are secretly acquiring real-time access to private surveillance cameras, which the cops are using to run AI-powered image searches, picking out people wearing certain colored shirts and certain makes and models of cars.\n+ Meanwhile, in Vallejo, California the police chief folded to pressure from the police union to cancel a contract with a video analytics firm reviewing body cam footage because they kept coming across videos of cops violating procedure and laws. Now the footage will remain examined.\n+Mark Lesure, a retired Memphis Police officer who was outspoken against the MPD after the killing of Tyre Nichols, was found murdered in his front yard last weekend, two days after the City of Memphis filed a motion to dismiss the Tyre Nichols lawsuit.\n+ Car chases by the NYPD have increased dramatically in the last year, up nearly 600%. The surge is part of a deliberate shift in “quality of life” enforcement tactics under Mayor Eric Adams that has put civilians and cops at risk.\n+ Ann Butts was horrified to learn this week that the Seattle Police unit which shot and killed her teenaged son, Damarius, in 2017, kept a mock tombstonemarking his death on a shelf in a precinct break room. As revealed in recently released body cam footage, the room also featured a Trump 2020 flag hanging the wall, in violation of Washington state law.\n+ Texas hires between 8,000 and 10,000 new prison guards a year. But the retention rate is less than 45% and now the state is running so short on prison guards that it’s recruiting high school students. “I don’t know how to phrase this in a good way,” Thomas Washburn, director of the Law and Public Safety Education Network, told the Texas Observer. “Corrections is a job whose challenges outweigh its benefits. It’s not a great career…When it’s paying 40% better than anything else in your community, it is a viable option.”\n+ Bureau of Justice Statistics data show that of the more than 50,000 people released from federal prisons in 2010, a staggering 33% found no employment at all over four years post-release, and at any given time, no more than 40% of the cohort was employed. And those formerly incarcerated people who succeeded in finding work earned $.84 for every $1 the average worker earns ($28,851 a year).\n+ Amid the hysteria over fentanyl, more and more states are allowing prosecutors charge a person with murder if they distribute drugs to someone who overdoses and dies, even when neither person was aware of the risk. One person recently charged with a fentanyl murder was 17-years-old.\n+ State troopers in Connecticut wrote more than 25,000 fake tickets to fake white people, likely to hide over-policing of minorities. At least, a quarter of the state’s troopers were involved in the scam. The investigation found there was a “high likelihood” at least 25,966 tickets were falsified between 2014 and 2021. Another 32,587 records over those years showed significant inaccuracies and auditors believe many of those are likely to be false as well.\n+ The San Francisco Police made 113 arrests for skatingboarding on Dolores hill (the Dolores Hill Bomb), 81 of those arrested were minors, most of the rest teenagers. Parents had to wait until the early morning to get their kids. The last one was released from custody at 4:30 AM.\n+ Dakotah Wood, an employee with the Hernando County, Florida sheriff’s office, fabricated a story about two Black men attempting to carjack him, after he shot himself in the leg while ‘playing’ with his gun. Wood resigned from his job and has been charged with a slate of crimes, including tampering with evidence, filing false police reports and discharging a firearm in public.\n+ Meta, the parent company of Facebook, handed over messages between a Nebraska mother and her teenage daughter, about the mother ordering abortion pills for her daughter. Thanks to the Facebook DMs, the mother had to plead guilty and faces up to two years in prison.\n+ Mass Shootings on July 4th: Akron (4), Indy (3), Edgewood, MD (4), Hayward, CA (3), Shreveport (9), Charlotte (4), Lansing (5), Peoria (3), DC (9), Lexington (3), Cleveland (3), Chicago (3)…There were 118 shootings overall resulting in 164 deaths or injuries. Let freedom ring!\n+ After the Supreme Court overturned Roe, the National Domestic Violence Hotline experience a 99-percent increase in callers who reported attempts by their abusers to manipulate their reproductive decisions.\n+ Here’s the changes in the murder rates for 70 of the largest cities in the US…\n+ The average length of time people are now languishing in Philadelphia’s jails before going to trial is 240 days, simply because they can’t afford bail\n+ Under new policy from NYC’s police oversight agency, NYPD officers accused of wrongdoing can now watch all the video of the wrongdoing before speaking to investigators.\n+ Coincidentally, New York City just agreed to pay more than $13 million to protesters who were arrested or beaten by NYPD officers during the George Floyd demonstrations in 2020 — one the largest settlements ever for a mass arrest class action in the US.\n+ Texas is banning all physical mail to incarcerated people, including hand drawn cards from children, and sending them scans instead, citing “contraband.” This is purely a punitive measure, since it’s well-documented that almost no contraband enters prisons through the mail. In fact, most contraband comes through guards.\n+ Here’s a brief glimpse of what life is like inside solitary confinement from Kevin Light-Roth, an inmate in the general population of a prison in Washington State who was ticketed for a rules infraction. Light-Roth challenged and beat the charge, but was sent to solitary for 400 days anyway because prison officials surrealistically surmised that if the charges “had been true,” he would have led a prison riot:\nI spent much of 2009 in One North, a solitary confinement wing at the Washington State Penitentiary, in Walla Walla, Washington. We were on a 23-and-one schedule: Once each day my cell door would roll open, controlled remotely. I would step out alone, given an hour to pace the empty tier or use a pay phone. Back in my cell, I’d be confronted by more loneliness. A steel sink and a toilet, a bunk, a battered paperback, and my own thoughts for company.\n+ Louisiana is locking up kids in in solitary for days on end at the infamous Angola state prison. According to declarations taken by lawyers at the ACLU, the teenagers receive only 8 minutes out to shower each day, while they remain shackled. Their cells have no air conditioning, even as the heat inside has reached 132F.\n+ Shotspotter is a surveillance tool used by many police departments around the country, which deploys microphones that listen for gunshots. But the results have been pretty shoddy. Critics claim that ShotSpotter can routinely“misclassify fireworks or sounds from cars as gunshots and company employees can alter evidence; during a police shooting trial, a ShotSpotter employee admitted to reclassifying sound from a helicopter to a bullet at the request of police.”\n+ Eating Grapes While Black: Jarrell Garris, 37-year-old black man, was shot and killed by police in New Rochelle, N.Y., after a report of theft from a local grocery store that Garris had eaten a few grapes and a banana and left without paying.\n+ An investigation by Searchlight into the deplorable conditions inside New Mexico’s largest jail for children disclosed how kids from 12-17 are “routinely subjected to strip searches, held for weeks in cells without toilets, and left with only a thin plastic sheet to block out the glare of hallway lights that never turn off.”\n+ In a 79-page opinion on the systematic profiling of black drivers with out-of-state plates, Federal Judge Kathryn Vratil wrote that a Kansas state police unit waged a “war on motorists…[in the] name of drug interdiction.” “As wars go, this one is relatively easy; it’s simple and cheap, and for motorists, it’s not a fair fight. The war is basically a question of numbers: Stop enough cars and you’re bound to discover drugs. And what’s the harm if a few constitutional rights are trampled along the way?” Vratil was appointed by President George H.W. Bush. One of the five plaintiffs in the case, Joshua Bosire, said: “I sleep with a gun next to my bed. I drive with cameras recording. I don’t travel at night, because I am scared of what law enforcement people can do to me.”\n+ Filmmaker Damien Smith was making a documentary on police brutality (Searching for Officer Friendly), when someone broke into his Hollywood home. Smith called the police. When the cops arrived, they tasered Smith three times, cuffed him and hauled him into the back of a police car in front of his neighbors. He was eventually released without charges. But the incident wasn’t investigated for more than a year.\n+ When reporters from the LA Times tried to figure out the names of cops who blew up a neighborhood after detonating a cache of confiscated fireworks, the LAPD and police union denounced them as “unethical” and “stalkers.”\n+ Leonard Leo, the panjandrum of the Federalist Society, urged the police in Mount Desert Island, Maine to arrest Eli Durand-McDonnell for the offense of calling him a “fucking fascist” in public. This doughty defender of the Constitution claims that Durand-McDonnell’s speech isn’t protected by the First Amendment: “This is no longer a political protest, when they have ‘Fuck Leo’ signs . . . and their Twitter and Facebook posts talk about ‘Get out,’ and ‘You don’t belong here.’ ”\n+ Randy Heath, a 39-year-old Miami resident who “loved to eat,” weighed 204 pounds before he was sent to jail. By the time he was found dead in his jail cell months later, he weighed just over 100 pounds. His family claims Heath, who’d been diagnosed with schizophrenia, was starved to death by his jailers.\n+ The Houston chapter of Food Not Bombs has now been ticketed more than 30 times for sharing free food with unhoused neighbors. Each ticket is for $2000 and specifically notes the citation is for “feeding homeless.”\n+ When Cyrus Gray was arrested he didn’t have the money to afford bail. Staff at the Hays County Jail in Texas warned him: “Get comfortable. You are going to be here a while.” They were right. Gray spent the next four-and-a-half yearsbehind bars waiting for his trial.\nAugust\n+ An Arkansas woman called 911. When the cops arrived, an officer was frightened by her Pomeranian, shot at the dog and missed, hitting the woman in the leg. The cop then tries to tell her the bullet hole in her leg is probably just a scratch from the dog.\n+ Cops in Portland, Oregon have been telling city residents that their crime-fighting hands are tied by the reformist DA Mike Schmidt so frequently that Police Chief Chuck Lovell sent out an email to the entire police bureau telling them to stop doing so.\n+ Last month, the Washington State Supreme Court struck down extended psychiatric holds “even when done for the person’s own good” as a form of involuntary detention without due process of law.\n+ Percy Taylor spent more than 20 years in a Louisiana prison, after being convicted of selling marijuana and cocaine. Then after his legal release date, Louisiana officials kept in him in prison for another 525 days, even though they’d been informed multiple times by Taylor and his lawyers that he was being illegally detained. It turns out that Taylor was just one of several thousand prisoners illegally kept behind bars in Louisiana each year, a practice the state corrections department has been aware of for the last decade. In Taylor’s case, even after a commissioner ruled the state’s rationale for Taylor’s extended detention “manifestly erroneous,” and issued an official order for his release the state refused. It took another six months of legal wrangling for Taylor to finally walk out of prison.\n+ People locked up in San Francisco’s rancid county jails have been forced to sue the sheriff in order to gain access to…sunlight.\n+ According to a fascinating NPR report on the trade in illegal fentanyl nearly 90% is seized at official border crossings and “nearly all of that is smuggled by people who are legally authorized to cross the border, and more than half by US citizens. Virtually none is seized from migrants seeking asylum.”\n+ The three affidavits used as the basis for an August 11 police raid on the Marion County Record, a small Kansas newspaper that was investigating corruption in the department, were not filed until three days after the search warrants were executed. Many civil libertarians are blaming the judge for blindly signing the warrants. “Too often the warrant process is just a way for police to launder their lack of probable cause through a compliant judge,” Jared McClain told the Kansas Reflector. “Until we start holding judges accountable for enabling the abusive and lawless behavior of the police, incidents like this are just going to keep happening.\n+ After a no-knock raid on a house in Ville Platte, Louisiana a cop is dead, a father, disabled veteran and former cop is dead, a mother is fighting for her life, and their 23-year-old son is now charged with murder. All this carnage merely to try to serve a narcotics warrant.\n+ After winning a new contract, a jail phone company in Georgia gave a $160,000 “donation” to the Glynn Count Sheriff, which will go directly towards buying three new police cruisers. Meanwhile, the jail will charge $0.30 per minute of video visitation calls, which amounts to $6 per 20 minute video call. The sheriff will receive 25% of the revenue while Pay Tel receives the other 75%.\n+ Over the past decade in Florida, kids—some as young as 5—have been seized and subjected to 335,000 forced psychiatric exams under the Baker Act. Advocates say the detentions and exams are traumatic, especially to those with disabilities who may not understand what is happening.\n+ Laura Ann Carleton was the owner of the clothing store Mag.Pi in Cedar Glen, California. After Carleton displayed a Pride flag in her store window, a man began to harass her by making disparaging remarks about the flag. Last Friday, he returned to the store, where he shot and killed her.\n+ Cops arrested 10-year-old black boy in Senatobia, Mississippi because he had to pee and the law office where his mom was having a meeting didn’t have restroom. Police saw him peeing behind his mom’s car, took him to jail and charged him with public urination.\n+ This week the Los Angeles City Council voted to approve the new LAPD contract, which will increase the LAPD budget by a billion dollars over the next 4 years.\n+ Over a three-year period, repeated misconduct by 116 officers in the Chicago Police Department has cost the city $91.3 million.\n+ Gun-related deaths among children claimed 4,752 young lives in 2021, a bloody new record. Nearly two-thirds of these deaths were homicides, although unintentional shootings have killed many children.\n+ In Texas’s stifling prisons, most of which lack air conditioning, at least 41 inmates have died of heart-related or undetermined causes since the summer’s unrelenting heat wave began.\n+ From Federal Appeals Court Judge James Ho’s concurring opinion in the abortion pill ruling.\nWait until Judge Ho hears about what goes on inside a confined feeding facility, slaughterhouse or animal testing lab…\n+ In South Carolina, the nation’s only all-male state supreme court upheld a ban on abortions after six weeks, even though the state constitution explicitly protects the right to privacy.\n+ At Bunnell Elementary School in Flagler County, Florida, black (and only black) fourth- and fifth-grade students were hauled out of class last Friday an “assembly” on how to improve their grades, which were becoming a “problem” for the school. Even black students who had passing grades were pulled out of class and given the lecture. Students were selected to attend based on their race, Flagler Schools spokesman Jason Wheeler told The Washington Post on Wednesday.\nSeptember\n+ California judges call for the elimination of cash bail: “The misunderstanding of bail as a tool to incarcerate people before trial has left in its wake a simultaneously unsafe, unfair & unjust legacy…. No arrested person should be detained simply because they cannot afford monetary bail.”\n+ Anita Earls, a supreme court justice in North Carolina, has filed suit against the state’s judicial standards commission after the commission launched an investigation into her statements about how racial bias continues to infect the judicial system. In a law review article this June, Earls pointed to the lack of racial diversity in Supreme Court law clerks: “If you look at who is hired to serve as clerks to the justices … we have plenty of female clerks, but on racial diversity we’re lacking,” Earls said that there was only one Black clerk and one Latina clerk employed in the court’s latest term. In her lawsuit, Earls asserts that the investigation by state’s judicial standards commission represents a “chilling of [my] first amendment rights.”\n+ A constitutionally questionable ordinance in St. Louis allows courts to banish people from large sections of the city as a punishment for petty crimes. These orders of neighborhood protection often prevent people from accessing vital services or visiting relatives. Police can arrest them if they return.\n+ The same Georgia RICO statute liberals cheered for its use against Trump and his co-conspirators is now being used against 60 Stop Cop City protestors. They were indicted by the same grand jury that indicted Trump.\n+Thomas B. Harvey: “The logic of this RICO case suggests you could be indicted in the future if you: are an abolitionist, donate to a bail fund, buy food for unhoused people, think we should protect the environment, believe we should protect people over profits, or support anyone who does.”\n+ Nine months ago, the State of Alabama tortured death row inmate Kenny Smith with a botched attempt at a lethal injection. Now the state wants to try to execute him again, this time by suffocating him with nitrogen gas, a method veterinarians consider too cruel to use for the euthanasia of most mammals.\n+ An East LA sheriff’s deputy was caught stealing $500 in poker chips during a traffic stop. But the DA dropped the prosecution after the driver stopped cooperating because he said he feared his life would be put in danger from deputy gangs.\n+ Baltimore Police arrested 77 kids in July. But there’s no record of any calls from the police department to the city’s youth counsel hotline where an attorney could explain their Miranda Rights. This means many of them were likely interrogated by cops without a lawyer, in violation of a state law banning the questioning of minors that local prosecutors are trying to overturn.\n+ Minnesota passed a state law preventing school police from putting kids in face-down physical restraint or restricting their breathing. This sensible legislation prompted several police departments in the state to pull their officers out of schools altogether (a salutary response which will undoubtedly make schools safer), which led Republicans to denounce the measure as “anti-police.”\n+ Last year a Department of Justice investigation found that more than 5,000 deaths in the criminal legal system had gone uncounted over the previous three years alone. But that figure is an undercount, since fifteen states failed to report any arrest-related deaths in that period.\n+ Multiple women in New York’s prisons who said they were sexually assaulted by prison guards also described being placed in solitary confinement. One called it “a means of intimidation following the rape.”\n+ After his client Joe Biggs, one of the leaders of the Proud Boys gang, was sentenced to 16 years in prison for his role in the January 6 insurrection, lawyer Norm Pattis pointed the finger at Trump: “Where’s Donald Trump in all of this? He basically told people, 76 million of his followers, the election’s stolen, go to the Capitol, fight like hell or you won’t have a country any more. Some people listened to him, were they supposed to know he was full of hot air? I look forward to his trials. I look forward to seeing him testify some day.”\n+ In pleading for a lighter sentence for his client, Proud Boy leader Enriqué Tarrio’s lawyer highlighted the fact that Tarrio had been an informant for law enforcement, which is probably not the smartest thing to disclose as your client begins a 22-year sentence in the federal pen. Of course, Tarrio’s lawyer wasn’t wrong. In Portland, the cops often huddled with the Portland Police, who considered the sedition-minded Proud Boys “much more mainstream” than the BLM protesters, who they regularly harassed.\n+ The Proud Boys trials represent a textbook case of how prosecutors use plea deals to coerce guilty pleas and punish those who insist on their constitutional right to a trial.\nPre-trial offer | Sentence after trial\nTarrio: 9-11 yrs| 22 yrs\nNordean: 6-8 yrs | 18 yrs\nBiggs: 6-8 yrs | 17 yrs\nRehl: 6-7 yrs | 15 yrs\nPezzola: 4-5 yrs | 10 yrs\n+ For 17 years, the state of Oregon tried to execute Jesse Johnson for a murder the attorney general now says he didn’t commit. After 25 years in prison, Johnson is finally a free man, who can’t be retried.\n+ Forty-eight years ago, Leonard Mack, 23-year-old Vietnam War veteran and father of two who was working toward his GED, was arrested by cops in Westchester County, NY because he matched the description of a rape suspect: a black man wearing a hat and an earring. Mack, who has always maintained his innocence, was convicted at trial and served seven years of a 15-year sentence. But newly obtained DNA evidence exonerates Mack and led to a new suspect, who has confessed to his role in the 1975 rape case. Mack’s case represents the longest wrongful conviction in US history.\n+ New euphemism alert: “Officer-involved discharging.”\n+ New disclosure filings show that Ginni Thomas was paid $700,000 by the Heritage Foundation, the rightwing white-paper mill that has weighed in on Supreme Court justice confirmation processes, filed multiple amicus briefs and had cases before the Court…\n+ Suicide by firearms claims 25,000 American lives every year, a rate that is 12 times higher than other high-income nations.\n+ Shortly after learning that a Seattle police officer had run over and killed a woman at a crosswalk, Daniel Auderer, a Seattle cop and the vice-president of the police guild, called the union’s president and downplayed the accident. “There is initially—he said she was in a crosswalk, there is a witness that said, ‘No she wasn’t,’ but that could be different,” Auderer says, “because I don’t think she was thrown 40 feet, either. ”\nOn Auderer’s body camera audio they can be heard joking about the woman’s death and laughing at the crash. “She is dead,” Auderer says. Then he laughs. “No, it’s a regular person. Yeah, yeah, just write a check, just, yeah.” Auderer laughs again. “$11,000. She was 26 anyway, she had limited value.”\nThe police cruiser was traveling at 75 MPH in a 25 MPH zone when it hit and killed Jaahnavi Kandula, who was only 23 when she was killed. Kandula, who was in the middle of the crosswalk and had the right-of-way when she was fatally struck, was a Master’s student at Northeastern University and financially supporting her mother back in India. The police car did not have its siren on at the time it ran her down.\nAs for the cop who laughed at her death and called her a person of “limited value,” Daniel Auderer has been the subject of eighteen Office of Police Accountability investigations since 2014 costing the city more than $2,000,000 in lawsuits.\n+ In April, a police sergeant named Joshua Hartup was driving a police truck when ran over and killed Henry Najdeski, a 52-year attorney who was legally crossing the street at a crosswalk in downtown Fort Wayne, Indiana. Hartup was cited by the State Police for failure to yield the right of way to a pedestrian, causing bodily injury, Class A infraction. Hartup, too, got off by merely writing a check: for $35. It turns out that Hartup had been involved in four previous crashes while driving a police vehicle in 2000, 2005, 2007, and 2019. Hartup was suspended for the crash in 2007.\n+ In the decade since the Supreme Court ruled in Miller v. Alabama that it’s unconstitutional to sentence a kid to life without parole (except in extremely rare circumstances), Georgia has quietly given the punishment to dozens of young people and no govt. entity is tracking it.\n+ According to an investigation by Oklahoma Watch, at least seven people have died in recent years while being held in the Pottawatomie County, Oklahoma jail and the county has withheld public records on the deaths, ignored the family’s requests for them, and defied court orders to produce them. Some of the dead had unexplained broken bones and bruises.\n+ According to a new analysis by the Sentencing Project, at the current pace of decarceration, it would take 75 years—until 2098—to return to 1972’s pre-mass incarceration prison population.\n+ A recent study of employees who were formerly incarcerated found that: 83% rated as a good or better than average worker; 75% were rated as more dependable and 70% had better job retention.\n+ An investigation by Eyewitness News 13 found that the temperatures inside some Texas state prisons reached 100 degrees or more in cells where individuals are housed. A majority of state prisons in Texas have either partial or no air conditioning. At least 68 prison facilities house inmates in areas without air conditioning. Incarcerated people and employees told the reporters it’s unbearable and are advocating for temps of 85 or cooler.\n+ Louisiana law enforcement agencies have been accused of targeting Hispanic drivers in traffic stops and identifying them as white on tickets. The intentional misidentification makes it impossible to track racial bias.\n+ In November 2020, Noel Espinoza was pulled over by two sheriff’s deputies near the town of Trinidad, Colorado, about 200 miles south of Denver. Espinoza’s 70-year-old father, Kenneth, was following Noel in his truck and pulled over behind the police cruiser. When Kenneth got out of his truck to see why his son had been stopped, one of the deputies ordered him to move his truck. Then as the older Espinoza was walking back to his vehicle, the deputies told him to stop. They put him in handcuffs, sat him in the back of the cop car, where without any apparent provocation began tasering the restrained and unarmed man repeatedly in front of his son. The two Las Animas County sheriff’s deputies, Deputy Mikhail Noel and Lt. Henry Trujillo, didn’t just taser the old man once or twice. They tasered him 35 times and, from the evidence of the body camera footage, made it look as if were engaged in a kind of deranged sport. “To watch my father almost lose his life to these men — time stopped,” Nate Espinoza said. “I can still see them pointing the gun at my father and watching time stop, just feeling everything leave my body.”\nDeputy Trujillo shouldn’t have been hired in the first place. In 1998 he was convicted of harassment conviction and he served a year of probation and paid $179.50 in fines. Then in 2006, he was hit with three restraining orders, all for domestic violence. In 2009 Trujillo had been forced to resign from the sheriff’s office, but was later re-hired and promoted. After the brutal tasing of Espinoza, Trujillo had been placed on administrative leave. A few weeks later he was involved in a road rage incident, after being passed on a road outside Trinidad by a teenage boy riding a motorcycle. Trujillo chased down the teen in his car and initiated a fight with the boy on the side of the road. The whole affair was caught on a surveillance camera.\n+ Eric Adams is blaming migrants for an alleged budgetary crisis in New York City while remaining mute about the $50 million the City has had to pay out already this year for the abusive violations of civil liberties of its residents by the NYPD, money that’s paid by city taxpayers not the department which incurred the costs.\n+ Gavin Newsom isn’t much better. He is pushing the largest-ever budget to combat shoplifting: giving $267 million to 55 law enforcement agencies in California. “When shameless criminals walk out of stores with stolen goods, they’ll walk straight into jail cells,” Newsom said. Last week I wrote in my CounterPunch + column (Shoplifting as Capital Offense) about two unarmed people (three if you include an unborn girl fetus) shot for shoplifting, one in suburban Columbus, Ohio and one in a Virginia suburb of DC. This absurd plan by Newsom will only encourage more violence against poor people, when retail outlets are stealing more in wages ($15.2 billion a year) than they’re losing from theft ($14.7 billion a year.) With at least 171,500 houseless people in California, surely there’s a better way to spend this money.\n+ In 2021, police in Lynchburg, Virginia chased down a man (Steve Rucker) on horseback, stunned Rucker with a taser to knock him off the horse and then ran him over with a police cruiser, inflicting severe injuries. The near-fatal chase stemmed from a misdemeanor warrant that was later dismissed and did not require Rucker to be arrested. The cops tried to get the lawsuit dismissed, claiming qualified immunity. But the federal judge said no. The case, seeking $5 million for excessive force, is going to trial next April.\n+ A $500 million racial profiling lawsuit filed by Benjamin Crump alleges that over a two-year period, the Beverly Hills Police Department arrested 1,088 Black people yet only TWO were eventually convicted of any crime.\n+ When she was just 16, new US Open champ Coco Gauff spoke at a Black Lives Matter protest in her hometown of Delray Beach, Florida after the 2020 murder of George Floyd: “This is not just about George Floyd. This is about Trayvon Martin. This is about Eric Garner. This is about Breonna Taylor. This is about stuff that’s been happening. I was eight years old when Trayvon Martin was killed. So why am I here at 16 still demanding change? And it breaks my heart because I’m fighting for the future of my brothers. I’m fighting for the future of my future kids. I’m fighting for the future of my future grandchildren. So, we must change now.”\n+ The 10 most dangerous cities in the US, according to Security Gage.\n1. Bessemer, AL\n2. Monroe, LA\n3. Saginaw, MI\n4. Memphis, TN\n5. Detroit, MI\n6. Birmingham, AL\n7. Pine Bluff, AR\n8. Little Rock, AR\n9. Alexandria, LA\n10. Cleveland, OH\n+ Try harder, Chicago!\n+ Ismael Lopez and his wife Claudia Linares were asleep in their beds on the night of July 23, 2017, when they were awakened by a loud knocking on the door of their trailer. Ismael got up and opened the door. Two men were standing on the porch with guns. They didn’t identify themselves. Lopez’s dog ran out. One of the men, Samuel Maze, shot and killed it. Frightened by the late-night banging, Lopez had answered the door with a shotgun. As Maze shot the dog, the other man, Zachary Durden, pointed his gun at Lopez and told him to drop the shotgun. When Lopez turned to put the gun down, Durden shot Lopez in the back of the head, killing him instantly. With Lopez’s body lying still on the floor, Durden cuffed him. Maze and Durden were cops with the Southaven, Mississippi police. They had come to the trailer to serve a warrant. But they were at the wrong address. They weren’t even on the right side of the street. No charges were brought against either cop. When Claudia Linares filed suit for wrongful death, the city of Southaven defended itself by arguing that Lopez had no civil rights to violate because he was a Mexican living in the US without documentation. A federal court rejected that argument. But after the case finally went to trial last week, an Oxford, Mississippi jury rejected Linares’ suit, ruling that the two cops didn’t use “excessive force.”\n+ On a March night in 2020, Manuel Ellis, a 33-year-old black man, was walking back to his sober living home in Tacoma, Washington when he was confronted by three police officers. Ellis was carrying a box of raspberry-filled donuts and a bottle of water. The cops claimed they stopped him because he was walking “erratically.” When Ellis protested, he was tased and beaten. While on the ground, Ellis was hogtied and beaten again. The cops took turns kneeling on his back and sitting on him. Then they wrapped a nylon bag around his face. Less than an hour after he was accosted by the police, Ellis was dead, a death the Pierce County medical examiner ruled a homicide. Now the three officers who tortured and killed Manuel Ellis, Matthew Collins, Christopher “Shane” Burbank, and Timothy Rankine are going on trial. Collins and Burbank for second-degree murder and first-degree manslaughter and Rankine for first-degree manslaughter. The officers have all been on paid leave since the killing and have collected more than a million dollars in salary and more in benefits. In the last 50 years, only 6 law enforcement officers have been charged with unlawful killings in Washington State, half of them in this case.\n+ A Colorado cop named Gabriel Jordan was cited for indecent exposure after he allegedly masturbated in public while staring at a woman at the Denver Police Academy. Jordan was in uniform and on duty at the time. He has been placed on paid leave. In 2015, the same cop shot and killed a 17-year-old girl named Jessica Hernandez. The slain teenager’s family received $1 million in a settlement.\n+ According to a review of police databases nationwide by the Intercept, out of 54 officers involved in 14 high-profile killings since 2014 that sparked the Black Lives Matter protests, only 10 had their certifications or licenses revoked as a matter of disciplinary action.\n+ Last Thursday night, the Minor High School band was on the verge of finishing its “Fifth Quarter” rendition of Cameo’s funk classic, Talking’ Out the Side of Your Neck, after a football game in Birmingham, Alabama, when local cops approached the band director, Johnny Mims, and demanded he stop the performance, so the police could clear the stadium. Mims told the officers the band was almost done and that there was only a minute left in the song. Then the cops turned the lights out at the stadium and as the band wrapped up the song two officers tried to arrest Mims for not complying with their request. When Mims declined to put his hands behind his back, a cop pointed a stun gun at the teacher and tasered him, as many as three times, in front of the 175-member band, many of them his students. Mims was taken to the hospital. After he was discharged, he was arrested and taken to jail, where he was charged with harassment, disorderly conduct and resisting arrest. “I’m a Christian guy and I’m called to forgive but this situation makes me more apprehensive about the police,” Mims said. “You may not know what their intentions might be even when you’re doing something positive.”\n+ In 2020 reporters for Reuters documented more than 1,000 deaths related to police use of tasers. Most of the deaths occurred between 2000 and 2018. Black Americans accounted for a disproportionately high number of those deaths.\n+ Glynn Simmons was only 22 years old when he was convicted of murdering Carolyn Sue Rogers during the robbery of a liquor store in Edmonds, Oklahoma. The jury in the case sentenced Simmons to death, even though a witness testified that Simmons had been with him in Louisiana playing pool at the time of the killing. Simmons told the cops, “I don’t even know where Edmonds is at.” Simmons, who has always asserted his innocence, spent the next 48 years in prison, much of it on death row. The young black man was convicted based on the testimony of a witness who had been shot in the head during the armed robbery. But during a police line-up, the witness identified two other people as the perpetrators, not Simmons. During the trial, the police buried this report and prosecutors refused to turn it over to the defense. This week an Oklahoma judge vacated Simmons’ conviction with prejudice, meaning he can’t be tried again. After his release, Simmons told reporters: “I’m going to spend what is left of my life helping others in similar situations.”\n+ When a father called the police in Columbus, Ohio to report that his 11-year-old daughter had been manipulated by an adult man into sending him explicit photos, the cops showed up at the father’s house, acted dismissive of the complaint and blamed his daughter for being a perpetrator of the sex crime committed against her. One of the cops told the father of the girl that his daughter could be charged with making “child porn.” The exchange was captured on the door-cam of the father’s house. One of the cops says: “I mean, she can probably get charged with child porn.”\n“Who? She can?” the dad replies, incredulously. “She’s 11 years old.”\n“Doesn’t matter,” the cop insists. “She’s still making porn.”\n+ In 2014, constitutional law scholar Erwin Chemerinsky called on Ruth Bader Ginsburg to resign from the Supreme Court, writing in the LA Times: “If Ginsburg waits until 2016 to announce her retirement, there’s a real chance that the Republicans would delay the confirmation process to block an outgoing president from being able to fill a vacancy on the Supreme Court.” In the end, it was Scalia who resigned (by dying in his sleep in a hunting lodge) and proved Chemerinsky’s prediction.\n+ In 2011, the first year with complete data, San Francisco police made arrests in about 2% of reported car break-ins. Today, that figure is less than 1%.\n+ Last year, the Las Vegas Police Department cleared only 15.5% of the rape cases they investigated. This year the clearance rate is even worse with the cops solving only 14% of their rape cases.\n+ Since former cop Eric Adams took office as Mayor of New York City, the NYPD has made more than one million traffic stops. Of those who were pulled over, 62% were given citations and 2% were arrested. Nearly 90% of those who were arrested were Black or Hispanic. Blacks and Hispanics make up about 52% of NYC’s total population, but only 22% of the city’s drivers. Meanwhile, white New Yorkers, who make up 40% of the city’s drivers, accounted for only 25% of traffic stops by the NYPD.\n+ This week Illinois became the first state to end cash bail. To give you an idea of how revolutionary this development is: there are currently at least 500,000 locked up in US jails without having been convicted of a crime, that’s more than twice as many currently people in jail awaiting trial than it incarcerated in all of its prisons in 1970.\n+ After public outrage over the handcuffing and arrest of a six-year-old girl at an Orlando school, Florida changed its law increasing the minimum age for such arrests to…7. Meanwhile, the Florida legislature is taking up a bill to gut child labor laws and allow minors to work full time and overnight. Old enough to work the night shift at the slaughterhouse, but too young to learn that gay people exist.\n+ At least 32 people have died inside LA County’s jails this year, with 14 of the deaths occurring since June. That’s an average of about one a week.\n+ Despite Biden’s pledge to end private prisons at the federal level, a review by the ACLU shows that the US Marshals Service is renewing private prison contracts on a much larger scale than previously reported. “Secret loopholes” in a Biden Administration Executive Order allow for 1/3 of the detainees to remain in private facilities.\n+ From 2014 to 2018, 35 women at the federal women’s prison in Carswell, Texas reported they had been sexually assaulted by a staff member.\n+ In 2018, Coloradans voted to amend their state constitution to ban forced labor in prison. Years later, incarcerated people are still being punished for refusing prison work assignments, which pay around 13 cents an hour. According to an investigation by 9News in Denver, since 2018 there have been at least 727 documented cases where an incarcerated person was disciplined for failing to work. The punishments have included changes in housing, loss of privileges and delayed parole.\n+ ShadowDragon is a tool that lets ICE monitor pregnancy tracking sites like Baby Center. “When people post about their pregnancies to BabyCenter,” says Eva Galperin, the director of cybersecurity at activist organization the Electronic Frontier Foundation. “I think it’s safe to assume they are doing so without the expectation that ICE is watching.”\n+ From 2006 to June 2022, around 1,400 people were arrested for actions related to their pregnancies, according to a report by Pregnancy Justice. Most of the arrests involved allegations of substance use, even when there was no harm to the fetus or infant. The report cites the spread of fetal personhood laws—which give fertilized eggs, embryos, and fetuses the same legal rights as people—to the increase in the criminalization of pregnant women. Nearly 77 percent of cases where pregnant people were arrested occurred in states that expanded the definition of child abuse to include fetuses, fertilized eggs, and embryos.\n+ On the morning of August 21, Ronald Davis, a Pennsylvania State Trooper, went to the Lykens Police Barracks and asked some of his fellow troopers to have his ex-girlfriend involuntarily committed to a hospital for a psych evaluation. Davis was told he would have to submit a commitment request with the county Crisis Intervention unit. Davis told the county officials he was a state trooper and exchanged emails with them using his state police account. When the commitment request was approved, Davis told the local police in Lykens, “I’ll take care of it myself.”\nDavis, who had served as a state trooper for more than seven years, part of Troop L, based in nearby Jonestown, drove to his ex-girlfriend’s house in Williamstown, about 11 miles away. Not finding her at home, Davis cruised the town before spotting her at a picnic area in the Weiser State Forest, where he got out of his car and confronted her. As she tried to get away from Davis, he grabbed her, threw her to the ground and sat on top of her. She repeatedly asks, why he is doing this to her.\nDavis tells her “The police will explain it to her when they arrive.”\nAt this point, someone in the park started filming the assault. As the two struggled, Davis put the woman in a chokehold and she shouted, “I can’t breathe…I can’t breathe.”\nWhen the state troopers arrived, Davis told them his ex-girlfriend had been making comments the entire day about being suicidal and depressed. The troopers took the woman to the Lehigh Valley Hospital for observation and, based on Davis’ bogus statements, she was placed on a 72-hour psychiatric hold. A physical exam showed that the woman had cuts and bruises to her forehead, torso, arms, knee, leg and backside. The psych evaluation didn’t reveal any suicidal tendencies and the staff later told police that the woman had calmed down and seemed “agreeable” once she’d been treated for her injuries and Davis was gone.\nDavis and the woman had been in a four-month-long relationship that soured to the point where she wanted to split. The woman later told police that when she expressed her unhappiness with their situation, the trooper became more controlling and abusive. He shut off the electricity to the camper they shared, locked the shed where she kept her property and kept her from having contact with her friends. The woman told police that Davis had repeatedly threatened to make her seem to be crazy. “I know you’re not crazy,” he told her. “I’ll paint you as crazy. I know the law.”\nLast week, Davis was arrested and charged with strangulation, unlawful restraint, false imprisonment, simple assault, official oppression, and recklessly endangering another person.\n+ In 2021, the NYPD launched a new website with public officer profiles. It was touted by officials as part of an effort to improve transparency. Yet the site has left out hundreds of police misconduct lawsuits that have cost the city tens of millions of dollars since 2013.\n+ Since the election of Eric Adams as mayor, NYPD officers are making 84% more drug arrests per month than before he was elected.\n+ Since 2013, 10 NYPD cops accounted for more than $68 million in misconduct payouts. All of them are still on the public payroll. One of the cops, Sgt. David Greico has been a defendant in 48 cases for which the city paid a total of $1,099,825 in legal settlements. Officer Pedro Rodriguez has only been the subject of three different suits, but one of them resulted in a payout of nearly $12 million.\n+ Over the past seven years, the Alaska Board of Parole has considered only two applications for geriatric parole. Neither was granted.\n+ Police have killed at least 827 people this year, roughly three every day.\n+ During a narcotics arrest in Tampa’s Ybor Heights neighborhood, Officer Dukagjin Maxhuni, a 10-year veteran of the department, chased down a young Black man and knocked him to the ground. Maxhuni looked down at the kid and said, “You fucking broke my glasses you piece of shit.” By then a crowd of mostly black people from the neighborhood had gathered around the cop and he began to gesture at them and boast, saying: “That was one hell of a flying knee from me, guys! You should have seen it, it was good. It’s on my body camera, I’ll show it to you. It was awesome.” In fact, the entire episode was captured on his body camera, the footage from which was released this week. As people began to walk away from the cop, he followed them and taunted: “Hey come stand up to me, I’m standing right here, motherfucker! Motherfuckers, you should know who runs these fuckering streets, and it ain’t you all.” Maxhuni was given a reprimand and moved to a different district.\n+ Jonathan Lancaster was only 38 years old when he died four years ago in an isolation cell at Alger Correctional Facility in Michigan. During his time in solitary confinement, Lancaster lost more than 50 pounds in 15 days and became so dehydrated he couldn’t speak. He was kept in restraints and his body was found lying in his own urine and feces. Two wardens and four prison nurses were charged with involuntary manslaughter in Lancaster’s death. This week a Michigan judge let them walk, saying that while the prison officials were negligent none of their actions (or lack thereof) directly led to Lancaster’s death, who, the judge noted, was “doomed to die from dehydration.”\n+ The Prison Policy Institute just released a new report on the incarceration rate of blacks in state prisons, which nationally lock up Black people at 6 times the rate of white people. But some states, including ones with liberal reputations, have much worse racial disparities: New Jersey 11.9x, Wisconsin 11.8x, Connecticut 9.9x, California 9.5x, Rhode Island 9.4x, Maine 9.2x, Utah 9.1x…\n+ Alabama, one of the poorest states in the union, is going to spend $1.082 billion for a new prison–the most expensive prison ever built in the United States, at a cost of $270,500 per bed.\n+ Nothing spells bi-partisanship like a nationwide campaign to round up homeless people and put them in camps or prisons…\n+ Mike Davis (not our Mike Davis, but the former Gorsuch law clerk) on the GOP immigration agenda: “We’re gonna deport a lot of people, 10 million people and growing–anchor babies, their parents, their grandparents. We’re gonna put kids in cages. It’s gonna be glorious”\n+ In the latest expansion of biometric surveillance, the FBI’s latest budget proposal requests an additional $53 million to store and maintain DNA samples collected from hundreds of thousands of immigrants and asylum seekers.\n+ The DEA is celebrating the 50th Anniversary of the War on Drugs. And what a smashing success it has been!\nUS drug overdose death rate, 1973: 3.0 per 100,000\nUS drug overdose death rate, 2021: 32.4 per 100,000\n+ The Washington State Supreme Court ruled this week that “quelling riots” by drenching protesters (and surrounding neighborhoods) with tear gas is a “core function” of sheriff’s departments.\n+ NuBrittany Smith and her mother Tasha, two black women living in Portland, Oregon, are looking for a new place to live after fleeing their apartment to escape the harangues of a mentally-disturbed neighbor, who lived in the unit above them and had harassed them for the past two months. “Every time he comes down he is either holding a knife or beating on our door,” NuBrittany said. When Smith complained to property management, they refused her request to be moved into a new unit. NuBrittany and her mother posted a door ring camera video of the neighbor, a man named Dominic Austin, yelling, “You’re about to get murdered!” In another clip, Austin shouts: “I’ll fucking rape your daughter, bitch!” NuBrittany says during one of his nightly rants, Austin stabbed the door with a knife. The harassment went on for weeks until Austin was finally arrested. But neither feel safe living in a complex that ignored their safety for weeks. They’ve set up a GoFundMe page for help finding a new place.\n+ A Delaware woman who was arrested for begging in two upscale restaurants spent a year even though she was never convicted and the original charges against her carried no more than a month in jail.\nOctober\n+ In 1996, Gerardo Cabanillas of Los Angeles was sentenced to 87 years to life in prison for two separate carjackings and a rape. Two weeks ago he was exonerated after DNA testing excluded him and identified DNA profiles implicating two other men.\n+ In April, Mike Mascorro, a sergeant in the Thermopolis, Wyoming police department, illegally broke into the home of Buck Laramore to confront him over his suspected use of meth, a misdemeanor. Laramore shot at the cop. Missed. The cop shot back, hitting and killing Laramore. But Mascorro wasn’t charged because of Wyoming’s Stand Your Ground Law, which has an exemption when you shoot at a cop, even if the cop acted illegally.\n+ A single county (Washington) in Western Pennsylvania accounts for 25% of the state’s pending death penalty cases, even though it contains only 2% of the state’s population.\n+ According to a lawsuit filed over the appalling conditions in the solitary confinement cells in Pennsylvania’s prison, where more and more prisoners are being locked up on secret evidence, within months of entering the Security Threat Group Management Unit at SCI Fayette, one man smeared, “Kill me, I’m ready to go,” on the cell in his own blood.\n+ On World Against the Death Penalty Day, the State of Texas executed Jedidiah Murphy, shortly after the Supreme Court revoked an appeals court order granting him a reprieve. Murphy had spent 22 years on death row for the 2000 murder of 79-year-old Bertie Lee Cunningham. As he was strapped to a gurney, Murphy, a halachic Jew, started to recite Psalm 24, ending with the words “The Lord redeems the soul of his servants, and none of those who trust in him shall be condemned.” He then shouted, “Bella is my wife!” His body seized and he lost consciousness and, then, his life. Murphy, who suffered extreme abuse as a child, was executed despite his history of severe mental illness, which included blackouts, hearing voices and hallucinating snakes. Murphy had been diagnosed as psychotic with multiple personality disorder at the time of the murder. In order to secure a death sentence, prosecutors told the jury that Murphy would present a “continuing threat to society” if sentenced to life imprisonment, instead of being put to death. As evidence, they presented false testimony that he had been involved in a carjacking that took place three years before Cunningham was shot, even though Murphy had never been charged or even investigated for the crime. On Monday, the Fifth Circuit Court of Appeals stayed his execution after being presented with evidence that Murphy had an alibi for the carjacking, that his fingerprints didn’t match those left on the stolen vehicle, and that DNA samples left by the perpetrator had never been tested. The stay was quickly quashed by the Supreme Court, which is becoming increasingly reluctant to allow new evidence to slow the pace of the death machine. Here’s the Huntsville Prison’s Death Watch summary of how Murphy spent his last three-and-a-half days…\n+ A North Carolina man Mario Alberto Gomez-Saldana II molested a 5-year-old girl. During an investigation into his sexual assaults, cops with the Mint Hill Police found $70,000 and some marijuana in his home. Even though Gomez-Saldana wasn’t charged with a drug crime, the police seized the cash, telling the victim’s family the money would be awarded to her after they filed a civil suit. So they sued. The judge in the case awarded the money to the young girl. But it turns out there was no money, the cops had already spent it, claiming they needed it to fight drug crime. Moreover, the money the cops seized and spent wasn’t part of a drug ring. The molester, now in prison, had won it at the lottery. However, the police weren’t entitled to spend the money in the first place since North Carolina law prohibits the police from spending cash seized through asset forfeiture. To get around the law, the cops colluded with the federal government, which allowed them to spend the money under its “equitable sharing program” as long as they shared some of it with the US Justice Department. In the end, the North Carolina cops got $45,000, the DOJ $25,000, and the victim of sexual assault? She got nothing.\n+ In 2014, a Mississippi sheriff named Bryan Bailey convinced the local district attorney’s office to use a grand jury issue subpoenas to compel a phone company to turn over call records and text messages for what Bailey claimed was a “confidential internal investigation…of possible wrongdoing by a school district employee.”\nThe school district employee was a man Bailey suspected of having an affair with the sheriff’s married girlfriend, Kristi Shanks. Shanks worked as an administrative assistant for Bailey, when they began their sexual relationship. Throughout 2014, Bailey made seven more requests for subpoenas for records of texts and calls between Shanks and the school employee.\nTwo years later, Kristi Shanks’ former husband Fred, now dating another sheriff’s office employee, learned that Sheriff Bailey had been spying on his ex-wife’s phone and text records. Fred informed the local DA, Michael Guest, that Bailey had conned the local prosecutors into seeking the subpoenas, a felony punishable by up to five years in prison. Guest told the Mississippi Today that he didn’t feel he could investigate the case because of his longtime friendship with Bailey, so turned the investigation over to the state attorney general. Guest is now a member of Congress and chairman of the House Ethics Committee.\nBut the attorney general at the time, Jim Hood, never pressed charges. When asked why not by the Mississippi Today, Hood said because he believed the subpoenas were targeting people implicated in “some criminal activity, maybe drugs or a home burglary.” There’s never been any evidence of either and, in any event, the sheriff certainly shouldn’t have been investigating his former lover.\nBy the way, Bryan Bailey is the same sheriff whose department employed the Goon Squad, five deputies who pleaded guilty earlier this year for torturing two black men during an illegal raid on a house, filing false police reports and planting fake evidence. Bailey is up for reelection in November and it looks like he’s going to win.\n+ Darryl George is an 18-year-old junior at Barbers Hill High School in Mont Belvieu, Texas. Since August 31, George has been suspended from school because he refused to cut his dreadlocks. Now he’s being removed from the high school altogether and placed in what the principal describes as “an alternative disciplinary education program.” Despite the passage of the CROWN Act, which is meant to prohibit discrimination on race-based hairstyles and bars schools from penalizing students (and teachers) because of hair texture or hairstyles including Afros, braids, dreadlocks, twists or Bantu knots, the Barbers Hill School district still maintains a policy banning male students from having hair falling below the eyebrows, ear lobes or top of a T-shirt collar. It also demands, more subjectively, that the hair on all students must be clean, well-groomed, geometrical and not an unnatural color or variation. Darryl’s mother, Darresha, have filed a federal civil rights lawsuit against the state’s governor and attorney general, alleging they failed to enforce a new law outlawing discrimination based on hairstyles.\nWe build your penitentiary, we build your schools\nBrainwash education to make us the fools\nHate is your reward for our love\nTelling us of your God above\nWe gotta chase those crazy bald heads\nGotta chase those crazy bald heads outta town…\n+ According to the National Registry of Exonerations, 60% of sexual assault exonerees are Black, but less than a quarter of people in prison for sexual assault are Black. This suggests that Black people are nearly 8 times more likely than white people to be wrongly convicted of sexual assault.\n+ 35 people have died this year in Los Angeles County’s jails, 17 since June 1st, averaging about one every week.\n+ For only the second time in forty years, the Cook County Jail population has fallen below 5,000, a consequence of Illinois’ move to end cash bail.\n+ According to the FBI, last year the violent crime rate was the fourth lowest it has been in America in the last 50 years. Moreover, the homicide rate in the U.S. fell significantly in 2022 and has declined even faster this year, “putting the country on track for one of the biggest declines in killing ever recorded.”\n+ On the other hand, the number of people police have killed in the US has remained steady. Police have killed at least 920 people through the first 9.5 months of the year.\n+ Myles Cosgrove, the Louisville cop fired for killing Breonna Taylor who was then rehired by another police agency, recently rammed a pickup truck with his police cruiser, then pointed his gun at the occupants and witnesses. The driver and passenger he rammed were then arrested.\n+ Bettersten Wade searched for her missing son for seven months, before finding out that Dexter Wade had been run over and killed by a police SUV driven by an off-duty cop as he tried to cross a highway in Jackson, Mississippi. Police knew Wade’s name and address, but never contacted Bettersten, even after she had reported him missing. Instead, they let his unclaimed body sit in the morgue for months, then buried him in an unmarked pauper’s grave in the Hinds County penal farm. His mother had been reluctant to report him missing to the same police department, which employed a cop who had killed her 62-year-old brother Robinson by slamming his head into the ground in 2019. There’s speculation in Jackson that the Department decided not to notify Bettersten about her son’s death because her family had filed a wrongful death suit over Robinson’s killing. Dexter Wade was the father of two young daughters.\n+ Casey McWhorter is scheduled to be executed by the State of Alabama on November 16. Casey McWhorter was sentenced to death by an Alabama trial judge in 1993 even though two of his jurors voted for a life sentence. Only Alabama and Florida permit judges to impose the death penalty based on nonunanimous votes by the sentencing jury.\n+ As he was shopping for food with his kids, Silvester Hayes was violently arrested by Dallas cops who mistook him for someone with a similar name. The police officers pushed Hayes to the ground and knelt on him as he yelled for help. After noticing their error, the cops can be heard on a body cam recording making up bogus charges against him: resisting arrest and unlawful carrying of a weapon. Hayes was jailed for days and lost his job as a security guard. He couldn’t pay his car bill, or his mortgage or support his four kids, who moved in with their mother. It took a year for the trumped-up charges against him to be dropped.\n+ At least 27 current and former Chicago police officials’ names appeared in leaked rosters for the Oath Keepers. Nine of those cops remain on the police force.\n+ Colin Eaton, a Vallejo, California cop who was caught on video punching a woman after a car chase last week, is the same police officer who shot and killed 20-year-old Willie McCoy in 2018, while he was sleeping in his car at a Taco Bell drive-thru. Two months later, Eaton was one of two cops who tasered McCoy’s niece during a traffic stop. In 2020, Eaton was cited for stepping on a man’s head during a search. He was suspended from duty for 80 hours.\n+ NYPD officer Willie Thompson started an affair with a witness in one of his cases. When the witness broke it off, Thompson threatened her to keep quiet and lied to the DA about the affair. After the DA learned the truth, Thompson threatened the woman again. Ultimately, Thompson was found guilty of misconduct and was recommended for termination. But NYPD commissioner Edward Caban intervened, overturned the decision and put Thompson back out on the streets.\n+ Justin Lee, a cop in Montgomery County, Maryland, who fatally shot a suspect in a stabbing in July, was arrested by the FBI last week on charges that he assaulted a police officer during the January 6, 2021 riots at the Capitol. Lee had been hired by the department a year after the riots. The Police Department claims it thoroughly investigates the background of all job applicants.\n+ Gregory Rodriquez, a guard at the Central California Women’s Prison, has been charged with 96 counts of sexual abuse over a fifteen-year period, after 22 women accused him of sexual harassment, assault and rape. Several of the women were punished with longer sentences for reporting Rodriquez’s abuse.\n+ In an attempt to undermine a reform-minded District Attorney, St. Louis detective Roger Murphey sabotaged several murder cases in which he had served as lead investigator. His department did nothing to stop him\n+ Scott Jenkins, a self-proclaimed “constitutional sheriff” in Virginia, asked people for cash or campaign donations in exchange for making them ‘auxiliary’ sheriff deputies, with the right to carry sheriff-issued firearms. He collected tens of thousands of dollars.\n+ Briana Erickson, a reporter with the Las Vegas Review-Journal, obtained an email in which the Henderson (NV) Police Department’s public information officer, Sgt. Daniel Medrano, brags that his office “vets each news reporter” to see which ones “make the department look good.” When Erickson called the PIO to ask about this, Medrano refused to return her calls. The police sergeant made more than $227,000 in pay and benefits last year.\n+ The estranged son of Nashville’s police chief is the suspect in the shooting of two police officers outside a Dollar General store.\n+ Eight years after pointing a loaded gun at a black man in his courtroom, Robert Putort, a white judge in upstate New York, has been removed from office. Putort’s lack of contrition for the incident was cited as one of the reasons for his removal.\n+ In 2002, Sedrick Moore was sentenced to 50 years in prison for a rape and armed robbery in Moultrie, #Georgia. After more than two decades in prison, Moore was exonerated in August 2023 by evidence showing that a co-defendant had falsely accused him and that the forensic DNA analysis presented at trial was flawed.\n+ Patrick Heron, a now-retired Philadelphia police officer, pled guilty to sexually assaulting 48 women and girls over 17 years. Heron filmed himself doing it, while he was in uniform, in the back of his police car.\n+ City officials in Newton, Iowa ordered the police to arrest city resident Noah Peterson for calling the mayor a “fascist” thus proving his point.\n+ Last year, the new Governor of Louisiana, Jeff Landry pushed a bill to make public the criminal records of children as young as 13, but only in the three parishes that have large Black populations, and nowhere else in the state.\n+ Reporter: You said Sidney Powell wasn’t your attorney. Are you concerned that won’t be covered by attorney-client privilege?\nTrump: “No. Not at all. We did nothing wrong. This is all Biden…All of these indictments that you see. I was never indicted. You practically never heard the word. It wasn’t a word that registered.”\n+ The State of Mississippi only gives property owners 10 days to challenge a blight finding that could lead to their house being seized through eminent domain. This rule is applied largely in the state’s poorest and blackestneighborhoods.\n+ New York City spends $1,200 per day on each detainee held at the Rikers Island jail, a total of nearly $450,000 per person per year.\n+ After begging to be taken to a hospital, an Alabama woman was left to give birth in a jail shower.\n+ Elizabeth Wince, an incarcerated woman at the Topeka (Kansas) Correctional Facility, fell, breaking several bones. When she tried to seek medical treatment, prison staffers laughed at her and mocked her, calling her “lazy” and “fat” in front of other prisoners. The guards did nothing to help Wince, as she struggled for two hours to crawl back to her cell. Instead, one officer, who had accused Wince of faking her injury, patted her patted her own knee and said, “Come on, you can do it!” Wince was later hospitalized for her injuries.\n+ According to the Prison Policy Institute, 80% of women in jails and 58% of women in prisons are mothers, and most are the primary or sole caretakers of young children.\n+ The state of Florida is set to forbid the discussion of “social issues” at public universities, which the new rule defines as “topics that polarize or divide society among political, ideological, moral, or religious beliefs, positions, or norms.”\nNovember\nIn April 1990, Brent Brewer and his new girlfriend, whom he’d met in a psychiatric hospital weeks earlier, hitched a ride to a Salvation Army store in Amarillo, Texas with a local flooring store owner named Robert Doyle Lamarck. During the drive, Brewer and the woman tried to rob Lamarck at knifepoint. The three struggled for the blade and Brewer ended up stabbing Lamarck fatally in the neck. Brewer was 19 and had been suicidal for weeks at the time of the murder.\nBy all accounts, Brent Brewer had a brutal childhood. He and his mother were repeatedly abused by both his father and his stepfather. As a child, Brewer was verbally assaulted and frequently thrashed with belts, cables, and extension cords. When he was 15, Brewer used a broom handle to fend off his biological father from beating his mother. Brewer suffered from depression and anxiety as a teenager and began to numb himself with drugs. A few months before the murder, Brewer was involuntarily committed to a psychiatric hospital after his grandmother found a suicide note he’d written.\nNone of these circumstances mattered at his trial, where the Texas death machine quickly found him guilty of capital murder. The verdict was based on the bogus testimony of a crank doctor, who assured jurors that Brewer represented “a terminally dangerous menace to society” and the manufactured confusion of the jury instructions in Texas capital cases, which have led so many others to death row.\nThe death verdict was primarily based on the testimony of a discredited forensic psychologist named Richard Coons, who made something of a career out of testifying for the prosecution about the alleged “future dangerousness” of defendants. Despite having never interviewed Brewer, Dr. Coons testified that Brewer had “no conscience” and would “probably” join a gang in prison and commit criminal acts of violence if given a life sentence. Coons’ testimony ignored Brewer’s exemplary record, where during his more than 30 years of incarceration he has shown no history of violence in prison. Brewer is deeply religious and has counseled many others on death row.\nStill, not all of the jurors bought Coons’ sham science. One of the jurors at Brewer’s trial later said she wanted to vote for a life sentence. She said wasn’t convinced that Brewer had acted with premeditation when he killed Lamarck and she didn’t think Brewer would be a danger in the future. But she was misled into thinking that the jury instructions in Texas meant that the vote for a life sentence had to be unanimous, instead of a death verdict. In fact, a single life vote would have meant a life sentence for Brewer and saved him from death row. In a deposition for Brewer’s appeal, the juror also said that one of her fellow jurors shared her desire to vote for life and was similarly confused and coerced into going along with the death verdict.\nThe Texas legislature has been aware for years that the jury instructions are confusing and problematic and the Texas State House has passed numerous bills in recent years aimed at fixing the instructions that misled jurors about the unanimity requirement for a death sentence. Although those bills have won bipartisan majorities in the State House, none has passed the Texas State Senate.\nNot long after Brewer’s trial, the Texas Court of Criminal Appeals ruled that Dr. Coons’s “future dangerousness” testimony in other cases was unreliable. The Court noted that Coons, who had testified as an expert in dozens of capital trials, was unable to point to any “books, articles, journals, or even other forensic psychiatrists who practice in this area” to buttress his self-originated theory. Despite billing $480 per hour for his lethal mumbo jumbo, Coons also admitted that not only did he rarely interview the people he assessed, he never followed up to see if his predictions of “future dangerousness” were borne out. In the wake of that decision, Coons stopped testifying in capital cases altogether.\nBut when Brewer challenged his conviction on the same grounds, the Texas Court of Criminal Appeals refused to consider the issue because his trial lawyer failed to object to Dr. Coons’s testimony. When he filed another appeal arguing “ineffectiveness of counsel” for failing to object to Coons’ quackery, the appeals court inexplicably ruled that even if Brewer’s lawyers had made a mistake by not challenging Coons’ testimony, Brewer wasn’t prejudiced by it. So even though the State of Texas admits that Coons should not have been allowed to testify at Brewer’s trial and that his theory is junk science, it still wants to put Brewer to death.\nOn Monday, the US Supreme Court denied Texas Brewer’s petition for certiorari in a single line with no dissents, clearing the way for his scheduled execution on November 9th. Brewer’s last hope now is a grant of clemency from the death-happy governor of Texas, Gregg Abbott.\n+++\n+ Colin Berryhill, the Memphis cop they called “Taserface,” was being investigated by internal affairs for three separate incidents of excessive force for using his taser while making arrests, including tasering a motorist named Owen Buzzard, while he was handcuffed. “He’s not police material,’’ Buzzard later said. But before Berryhill was brought up on misconduct charge, he quit the Memphis force and took a job as a patrol officer at the Southaven (Mississippi) Police Department, where he was recently feted as the department’s officer of the month.\n+ Philadelphia’s juvenile jail is still dangerously overcrowded with children sleeping on benches and floors in cramped, filthy cells where the lights are often kept on 24 hours a day.\n+ More than 3,300 people in the U.S. have been exonerated since 1989 of crimes for which they were imprisoned, according to the National Registry of Exonerations.\n+ Orange County, California’s District Attorney Todd Spitzer is refusing to publicly release racial data on who his office prosecutes, following a court order on the issue.\n+ Got this disturbing note from the incarcerated journalist and CounterPunch contributor Christopher Blackwell: “Today Securus, a predatory prison communication co, silenced journalists. With no warning, they deleted all drafts of writing. Years of work. Manuscripts. Articles. Everything gone. We’re no longer able to save drafts. Now near impossible to write.”\n+ In 2021, all California counties combined spent about $3.9 billion on adult jails.\n+ The age of the average police officer in California, 40.4 years, is three years older than in 1991.\n+ Back in January 2021, Joshua Garton was arrested after he posted a meme showing two people pissing on a tombstone featuring the photo of a Dickson County sheriff’s deputy who had been shot and killed in 2018. Garton captioned his post: “Just showing my respect to deputy Daniel Baker from the #dicksoncountypolicedepartment.” Garton was charged with harassment and jailed for nearly two weeks on a $76,000 bond until a Dickson County judge dismissed the charges. Garton sued for false arrest and violation of his First Amendment rights. This week the State of Tennessee settled the case and agreed to pay Garton $125,000.”\n+ The Alabama Personnel Board has reinstated Timothy McCorvey, a correctional officer at the Ventress Correctional Facility, who was dismissed on his warden’s recommendation earlier this year after he struck inmate Brandon Crosby and dragged Crosby by his shirt collar into the hallway outside the dorm. Prison video showed that McCorvey leaned down and spoke to Crosby, then punched him before placing him in handcuffs. After he was handcuffed on the ground, Crosby grabbed McCorvey’s leg and raised his head slightly. Then, an Administrative Law Judge who reviewed a video of the incident concluded: “It appears McCorvey hit Crosby a second time in the video. Crosby’s head snapped toward the floor after McCorvey made a sudden movement toward Crosby. Crosby rolled over onto his side and appeared in distress until the end of the video.” Crosby, 36, died at the hospital later that day from blunt force trauma. An autopsy showed extensive hemorrhaging around Crosby’s brain as well as multiple rib fractures, liver and spleen lacerations, and deep bruising on his neck.\n+ The cops in Lewiston, Maine knew mass shooter Robert Card was a threat, a man who “might snap and do a mass shooting,” and did nothing to track him down or prevent the attack and then, after shutting down much of the state for 48 hours, couldn’t find him afterward, even though his body a lot adjacent to where his car was parked.\n+ In 1917, 13 Black soldiers were hanged following racial violence in Houston—the largest mass execution of American soldiers in the U.S. Army. Over the next year three mass trials, another 6 black soldiers were hanged and 91 others were convicted of serious crimes from the riots, which included murder and mutiny. The soldiers were represented by just one officer who was not even a lawyer.\nThe all-white military court took only two days to convict the first 58 soldiers. They were denied any appeal and were hanged less than 24 hours later. Now more than a century later, the Army has overturned the convictions and acknowledged that the trials were fundamentally unfair and racially biased.\n+ Tyrone Paylor, a public defender in Memphis, on the brutal tactics of the city’s police department: “Some officers, from our experience, they’re just not trained enough to know where the boundary is from between ‘any means necessary’ and what is constitutionally allowed in interacting with the citizens.”\n+ The NYPD is using police drones to record hundreds of protesters and handing the footage over to prosecutors to “help enhance arrests.”\n+ In April, Juneanne Fannell, an 82-year-old woman in Rio Rancho, New Mexico, called the police, telling them that her caretaker, Henry Cardana, had threatened to kill her. The police interviewed Cardana, dismissed Fannell’s complaint, complimented the man on his gun collection and left, as the bed-ridden woman begged them to stay. Four hours later, Cardana shot and killed Fannell.\n+ When David Hall fractured his left wrist while in an Anne Arundel County, Maryland Jail, the jail doctor treated his serious injury by giving Hall an Ace bandage and telling him it would “self-heal.” Since then, Hall has barely been able to move his wrist. Hall sued and won a $770,000 judgment from a jury. Then Corizon, the correctional health care company that employed the doctor, declared bankruptcy, blocking the compensation.\n+ A couple of weeks ago I wrote about the case of Brent Brewer, a Texas man who was sent to death row based on the junk science testimony of a discredited forensic psychiatrist and jury instructions so confusing at least two jurors (who wanted to vote for life without parole) thought they meant the opposite of what they said. The Supreme Court declined to hear Brewer’s appeal and Texas Governor Gregg Abbott, who seems to believe that his poll numbers go up every time he supervises an execution, refused to grant him clemency. Brewer’s final words: “I would like to tell the family of the victim that I could never figure out the words to fix what I have broken. I just want you to know that this 53-year-old man is not the same reckless 19-year-old kid from 1990. I hope you find peace. Thank you, warden.”\n+ Last week, Stephen Cooper wrote about the death penalty case of Casey McWhorter, who the state of Alabama executed on Thursday. Before he was killed, McWhorter said he loved his family and expressed remorse to his victim’s family. He also said of his executioner, “It’s not lost on me that a habitual abuser of women is carrying out this procedure.” McWhorter was referring to Terry Raybon, the warden of William C. Holman Correctional Facility in Atmore. Raybon, now the state’s execution, is a former Alabama State Trooper, who was fired for misconduct two decades ago. A judge later described him as a man who “beats on women, consorts with felons, and neglects his official duties.”\n+ Idaho finally found an outlet that would sell them execution drugs, so the state can resume killing death row inmates. The Idaho Department of Correction paid $50,000 for 15 grams of pentobarbital, according to a purchase order for the execution drugs obtained by the Idaho Statesman Review. The price has tripled since they were last used to poison someone to death.\n+ For the first time since Gallup started asking about the fairness of the death penalty’s use in the U.S., more Americans say it is applied unfairly (50%) than fairly (47%), a five-point increase in the percentage who think it is applied unfairly since the prior measurement in 2018.\n+ Under the new Clean Slate Act, two million formerly incarcerated people in New York State will have their convictions sealed if they aren’t convicted of new crimes for a set period of time (three years for misdemeanors, eight for eligible felonies).\n+ Last year K’aun Green was shot by San Jose cop Mark McNamara at a taqueria after Green broke up a fight and disarmed a gunman. McNamara resigned last week over the discovery of racist text messages he wrote, including one saying, “I hate black people.”\n+ During a pre-dawn raid this week, police in Mobile, Alabama shot and killed a 16-year-old boy, who wasn’t the target of the raid. The man the police were seeking wasn’t home at the time. But he was later arrested on charges including possession of marijuana and drug paraphernalia.\n+ “They put him in the ground without my permission and they dug him up without my permission,” said Bettersten Wade, the mother of Dexter Wade, a man run-over killed by an off-duty Jackson police officer in March and later buried without her family’s knowledge.\n+ After a federal act aimed at removing minors from adult lockups went into effect, the number of kids at the Allegheny County (PA) Jail actually increased. After 249 hearings to decide if kids should be transferred out of jail, only one was removed.\n+ The Supreme Court rejected hearing the appeal of Michael Johnsonimprisoned man in Illinois with bipolar disorder who was locked in solitary confinement for three straight years without any access to the outdoors or opportunities to exercise. From Justice Jackson’s dissent: “During that time, Johnson spent nearly every hour of his existence in a windowless, perpetually lit cell about the size of a parking space.”\n+ Last week, Los Angeles County agreed to pay $700,000 to Josie Huang, a public radio reporter who was slammed to the ground and arrested by the LA Sheriff’s Department while covering a BLM protest. This is likely the largest payout to a reporter in connection with covering the 2020 protests.\n+ The Baton Rouge Police Department ran a “torture warehouse” where members of its Street Crimes Unit strip-searched, beat, and humiliated dozens of people and then released them, often without their being charged with a crime.\n+ Despite the hysteria about organized smash-and-grabs, the Council on Criminal Justice finds no change in shoplifting nationally between 2019 and 2023 and attributes the illusion of a spike in shoplifting to “increased reporting.” In other words, the press created and then hyped its own crisis.\n+ Parental incarceration has impacted over 5 million children in this country. 47% of people in state prisons are parents of minor children. But only 8 states have passed laws attempting to reduce the number of caregivers who are being thrown behind bars:\n+ A federal lawsuit by five Black women alleges Kansas City officers raped and intimidated them into not reporting the crimes “Report me to who, the police?I am the police,” one accuser said she was told after she was raped.\n+ A driver rushing his injured dog to the vet in Bernalillo, New Mexico was pulled over by local police. He explained: “My dog’s bleeding out of his mouth!”\nCop: “I don’t give a fuck”\nThe dog died as the family was held at gunpoint.\n+ A Seattle police dog in training mauled his partner’s roommate while she was doing laundry. The police report referred to the incident as a “spontaneous self-initiation of inappropriate bite contact.”\n+ A Texas social worker who made mistakes while helping patients at a psychiatric center sign up to vote was charged with dozens of election crimes. None of the people she helped actually got registered, but she pleaded guilty to avoid the risk of being sent to prison. Now the state is taking her teaching license.\n+ Rosa Miriam Sanchez was killed while working in a carrot field. Her coworkers say her body was left lying in the dirt where she died for hours and they were told to finish harvesting the field around her.\nDecember\n+ The total number of migrants held in U.S. Immigration and Customs Enforcement detention facilities has grown to 39,748, the most since January 2020. Most of the detainees are jailed in just one state: Texas. The vast majority of migrants held in ICE facilities — 71% — have no criminal record.\n+ According to Alexandria Ocasio-Cortez, Nancy Pelosi thinks that the phrase Abolish ICE “was injected into the political discourse by the Russians and that the Democrats need to quash it.” AOC reportedly said to her colleagues in the Squad, “This is how the leader of the party thinks?” (See Ryan Grim’s new book, The Squad: AOC and the Hope of a Political Revolution)\n+ Latinos now make up around 40.2% of Texas’s population, surpassing non-Hispanic whites, who make up 39.8% of the population. Blacks account for 13.4% of Texas’s population.\n+ Nearly 38% percent of Americans seem willing to embrace an authoritarian leader “who is willing to break some rules if that’s what it takes to set things right,” according to a recent poll on American Values by the Public Religion Research Institute, and 33% of Republicans endorse the idea that “true American patriots may have to resort to violence to save the country.”\n+ Trammell Crow Jr., the brother of Republican mega-donor and Clarence Thomas sugar daddy Harlan Crow, must face a lawsuit that accuses him of running and participating in a sex trafficking ring…\n+ In 1851, the Supreme Court of Georgia held that killing a slave is not murder because American slaves were property and held a status even lower than other historical slaves and serfs.\n+ NYC Mayor Eric Adams’ financial disclosures from his years in the state Senate failed to detail a 2012 trip he took to Azerbaijan and Turkey. Two two other lawmakers who went with Adams reported their travel was funded by government entities in the countries.\n+ As Adams’s political fortunes crumble, disgraced former Governor Andrew Cuomo is considering running to replace him. Our political candidates all seem to be riding in the same sushi train from Dante’s 8th Circle of Hell…\n+ Episodes in Gerrymandering: out of more than 300 districts in Louisiana and Mississippi, not a single legislative election this fall ended up being within 10% between the two parties.\n+ Peter Antonacci, Ron DeSantis’ appointee for overseeing “election integrity,” abruptly left a heated meeting in the governor’s office, collapsed in the hallway, and lay on the ground dying for 24 minutes before anyone noticed him. By then he was dead.\n+ Kim Phuong Taylor, the wife of a former Iowa House Republican, was convicted of 52 counts of voter fraud for taking Democrats’ absentee ballots and using them to vote for Republican candidates, including Donald Trump.\n+ A far-right school board in Bucks County, Pennsylvania, packed with Moms for Liberty censors who pulled numerous books out of classrooms and off library shelves, was voted out of office a few weeks ago. Before their terms expired, they quickly gave their equally censorious superintendent, Abram Lucabaugh, a $700,000 golden parachute.\n+ The latest variation on a poll tax is being implemented in Tennessee which has added new requirements for residents who’ve lost their voting rights and want to regain them. Residents of Nashville would have to pay $159.50 to petition a judge to regain their rights.\n+ In February, Siavash Sobhani, a doctor living in northern Virginia, applied for a passport renewal. Months went by. Then a letter arrived from the US State Department denying his renewal request. The Department informed Sobhani that he was never a citizen of the US, despite having been born in DC 61 years ago, holding a US passport for decades and practicing medicine here for more than thirty years. A State Department official told him that he should not have been granted citizenship at the time of his birth because his father was a diplomat with the Embassy of Iran. “I trust that you can imagine how difficult it must be to believe that you were a citizen of the U.S. your entire life, just to find out you actually were not,” Sobhani told the Washington Post.\n+ As seen in a video, a white female police officer is standing over a handcuffed black man next to a road in Pickens County, Alabama. First, she orders him to “stand up”. He does. Then she orders him to lie face down on the front of a car. He does. The cop draws her stun gun and points it at his back and says, “Stay still.” The man doesn’t move, but replies: “I ain’t doing shit, bro. I got a gun right there.” The cop laughs and says, “Oh, yeah,” as she picks up his gun. Then she tases him. The man screams in pain. The cop yells, “Shut the fuck up!” The man starts to cry, saying: “Oh my God. Oh my god.”\n“You want it again?” the cop threatens. “No, ma’am.” The man continues crying, irritating the cop even more. “Shut the fuck up, then. You were big and bad.” He keeps crying. “Shut your bitch ass up,’’ the officer says. Then the video cuts out.\nThe cop hasn’t been named. But the man, 24-year-old Micah Johnson who appeared to comply with every command, has been overloaded with charges, including obstructing governmental operations, resisting arrest, marijuana possession, drug trafficking and being a felon in possession of a firearm.\n+ The Chicago Police Department created a new “community” unit designed to restore public trust. Instead, it inaugurated a surge of traffic stops that have primarily targeted Chicagoans of color.\n+ This week San Francisco DA Brooke Jenkins was asked whether anything legal could be done to clear the homeless from the streets of San Francisco, DA Brooke Jenkins said they need to be made “uncomfortable” enough to move. Don’t be surprised if Jenkins volunteers to defend members of the Israeli war cabinet at The Hague…\n+ A study published in Science reveals that 1 in 10 Black men born in Pennsylvania in the 1980s have spent time in solitary confinement by the age of 32. About 9% of black men in the state were held in solitary for more than 15 consecutive days, violating the United Nations standards for minimum treatment of incarcerated people. Nearly 1 in 100 black men experienced solitary for a year or more by age 32.\n+ So far this year, at least 43 people have died inside LA County jails.\n+ In late November, Michigan became the first state in the nation to require the registration of people to vote when they’re released from prison.\n+ Florida’s Supreme Court ruled this week that the state’s largest police union cannot block the disclosure of officers’ names after shootings.\n+ Mike Parson, the Republican governor of Missouri, has granted over 600 pardons, the most of any Missouri governor since the 1940s. Contrast this with Joe Biden, who has issued only 13 pardons in three years in office…\n+ 80% of women in American jails are mothers, and most of them are the primary caretakers of their children.\n+ Through November 2023, Detroit is close to recording its fewest homicides in almost 60 years. Detroit police data also shows a drop in other crimes relative to the same time last year, including a 13% decline in nonfatal shootings and a 36% fall in carjackings.\n+ Speaking of symbolic things, in keeping with last year’s marijuana pardons, which freed no one from prison, Biden has issued a new round of marijuana pardons which will free no one from prison…\n+ Almost 80 percent of Americans, and 92 percent of Republicans, think crime has gone up. It actually fell in 2023.\n+ Innocent Black people are seven times more likely than white people to be falsely convicted of serious crimes, according to a report released today by the National Registry of Exonerations.\n+ Prosecutors in Warren, Ohio have criminally charged a black woman for having a miscarriage at home. Brittany Watts, a medical worker, was told by her doctor that her 21-week pregnancy was nonviable. Even though abortion is legal in Ohio until 22 weeks, Watts was unable to have her labor induced because hospital administrators raised concerns about potential legal issues. Watts suffered a miscarriage at home in her bathroom. After the miscarriage, Watts became ill and was treated in the hospital, where a nurse called the police after Watts told her she had disposed of the bloody tissue of her miscarriage. Watts, who was still recovering from the loss of her pregnancy, was interrogated by a police officer in her hospital room. Two weeks later, Ohio prosecutors charged Watts with felony abuse of a corpse, which carries a possible sentence of a year in prison.\n+ In Illinois, two best friends—Tevin & Marquise—robbed a gyro shop. A cop with 20 misconduct complaints chased, shot, and killed Marquise without justification. The cop received accolades. But under Illinois’ felony murder statute, Tevin was charged with his friend’s murder, even though he was miles away.\n+ Shortly after midnight on Sunday morning, a St. Louis police department SUV was swerving through multiple lanes of traffic when it jumped the curb and crashed into an LGBTQ bar as it was closing. One of the Bar:PM’s owners, James Pence, was upstairs when he felt the entire building shake as the SUV plowed into the building. As he went downstair to find out what had happened, he was confronted by a cop, who demanded to see his ID. Pence refused and the cop spun him around and placed him in handcuffs. Meanwhile, the other co-owner, Chad Morris, was filming the scene and asked the cops why his partner had been handcuffed: “He’s not going to yell at me, that’s causing a disturbance?” Morris asked, “Who was sucking whose dick?” when the car crashed. Then three cops went after him and tried to take his phone. According to Pence, as Morris raised his hands, “the cops said he hit them.” Morris was arrested on charges of felony assault and resisting arrest against the cops who rammed their car into his building. He was held in jail for 36 hours. When he was released, Morris was sporting a black eye. A video of the entire incident, filmed by a bystander, didn’t show Morris hitting the cop, which prompted the St. Louis Circuit Attorney’s Office to reduce the charges to misdemeanor assault. Morris’s lawyer, Javad Khazaeli, said, “There is a history of St. Louis police officers driving around drunk.” Khazaeli uncovered street camera footage of the cop car speeding through a red light a few seconds before crashing into the bar. The driver was not given a breathalyzer test.\n+ Why Eric Adams wanted to shutter NYC’s libraries: Overtime pay for extra NYPD officers in the subway system went from $4 million in 2022 to $155 million this year, according to city records obtained by Gothamist.\n+ Steve Bannon has a new plan to stop school bully: arm the students: We should get kids off social media and start teaching them the proper use of guns, how to defend themselves, their own self-defense. “Should we not make that an integrated part of the education so they’re not picked on or not threatened and certainly not scared, right?”\n+ White men account for 80% of the gun suicides in the US.\n+ A recent charging sheet in a J6 case shows how Google searches can be used against defendants in criminal cases…\n+ In 18 states, it’s a parole violation to hang out with anyone with a felony record – even if that person is trying to help you adjust to life outside of prison.\n+ The Supreme Court of New York ruled this week that the state doesn’t have to release the “training documents” that its parole board uses to guide its often murky and seemingly inconsistent decisions on who gets granted release and who doesn’t.\n+ Last month as human waste flooded parts of a U.S. immigration prison in central New Mexico, guards ordered incarcerated people to clean up the sewage with their bare hands and put those who protested in solitary confinement.\n+ When UCLA researchers Nick Shapiro and Terence Keel examined the autopsies of 59 people who had died in LA County jails, they found that the bodies of more than half of the deaths classified as “natural” by the coroner showed signs of violence. The deaths of black people were much more likely to be classified as “natural.”\n+ At least 14 Mississippians have died, including 9 by suicide, after being jailed while awaiting mental health treatment.\n+ Intoxication deaths in jails increased 381% between 2000-2018. When someone dies of an overdose in jail, it’s usually after just one day of incarceration.\n+ This week the New York City Council passed (with a veto-proof majority) a ban on the use of solitary confinement in city jails.\n+ The state of Alabama has made millions leasing prisoners to work for employers including McDonald’s, KFC, Burger King and Wendy’s restaurants and a Budweiser distributor — as well as state, county and city agencies.\n+ April Sponsel, the former Maricopa County prosecutor, who worked with Phoenix cops to invent a gang and then falsely charge BLM protesters as members, was given a two-year suspension for prosecutorial misconduct by Arizona’s presiding disciplinary judge.\n+ Missouri Republicans are proposing murder charges for women who get abortions.\n+ For nearly two years, the Louisiana State crime lab has refused to testfingerprint evidence that could exonerate death row inmate Daniel Blank, unless he agrees not to sue them for civil damages if the court rules in his favor.\n+ I feel vindicated once again in fingering Samuel Alito as the leaker of his draft opinion in the Dobbs case overturning Roe v. Wade. According to a detailed account of how the court rendered its decision, New York Times reporters Jodi Kantor and Adam Liptak revealed that Alito secretly leaked his draft to his fellow conservative justices. Only 10 minutes after Alito sent out the 98-page draft to overturn Roe, Neil Gorsuch replied saying he would sign on without revision, which is scarcely enough time to read Alito’s convoluted writing never mind assess how it could overturn 50 years of constitutional precedent. By the next morning, Thomas, Barrett and Kavanaugh had all given their total blessing to Alito’s opinion/screed. Roe was dead, killed by a cadre of rightwing justices assembled for that very purpose. As Kantor and Liptak wrote: “Justice Alito appeared to have pregamed it among some of the conservative justices, out of view from other colleagues, to safeguard a coalition more fragile than it looked.”\n+ Clarence Thomas threatened to quit the Supreme Court unless he could make more money–a lot more. So Republican politicians arranged for billionaires to start showering him with money, luxury trips and gifts in exchange for his continued service. This sounds an awful lot like judicial extortion to me.\n+ Some as yet unknown benefactor gave Clarence Thomas a $514,000 mortgage with only $8,000 down.\n+ Despite the relentless incoming tide of stories on the death of Portland by outlets as varied as FoxNews and the NYT, violent crime in Portland is down 14% year-over-year.\n+ After 44 jail deaths in Rikers since January 2021, only two Correctional Health Services staffers have been disciplined and that resulted from a single case–despite questions raised in independent probes about the quality of medical care in a number of other deaths.\n+ A year ago, the sheriff for Harris County, Texas fired Robert “Mark” Antill for bigotry. A month later, he was hired by the county DA’s office.\n+ Baltimore experienced fewer than 300 homicides for the first time since 2014.\n+ The Chicago Police Department claims that gun arrests curtail violence, but an investigation by the Marshall Project found that despite such arrests doubling since 2010, they have not substantially reduced shootings in Chicago.\n+ NYPD officers shot and killed 13 people in 2022, the most since 2012.\n+ Number of people killed by police in the US in 2023: 1,206, at least 4 more than last year’s record.\nAll together now…",
  "word_count": 34104,
  "scraped_at": "2026-02-14T12:05:24.123167"
}