{
  "article_id": "767a332d083d",
  "url": "https://www.irishfa.com/news/2023/july/northern-ireland-fully-focused-ahead-of-clash-with-scotland",
  "title": "Northern Ireland  fully focused  ahead of clash with ... ",
  "date": "20230714T110000Z",
  "domain": "irishfa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Northern Ireland Women will have to bring their A game if they are to get a result against Scotland this evening.\nGail Redmond’s side have been cast firmly in the role of underdogs as the countries prepare to meet at the Kilmac Stadium (Dens Park) in Dundee.\nThe Scotland squad is packed full of players operating at the highest levels of the game.\nTheir engine room is formidable. It regularly features Real Madrid’s Caroline Weir, West Ham United’s Lisa Evans and Chelsea’s Erin Cuthbert, and now it also boasts Sam Kerr of Bayern Munich, formerly of Rangers and Glasgow City.\nScotland head coach Pedro Martinez Losa also has several other FA Women’s Super League players to choose from, including Manchester United strikers Kirsty Hanson and Martha Thomas and defender Jenna Clark, who has just signed for Liverpool from Glasgow City.\nAnd up front they have another experienced operator in Fiona Brown, who plays her club football in Sweden these days with FC Rosengard.\nHowever, the Scots will be without regular captain Rachel Corsie (Aston Villa Women), who has had to withdraw from the squad through injury. Her replacement is Celtic Women defender and skipper Kelly Clark.\nScotland currently sit in 23rd position in the Coca-Cola FIFA Women’s World Ranking list, while Northern Ireland occupy 45th place.\nInterim Northern Ireland Women manager Gail Redmond has chosen a 23-strong panel for the match against Scotland – and a second friendly against Czechia in Opava next Tuesday (18 July).\nShe is expecting a tough, physical battle against the Scots but says her team are “fully focused” ahead of the game in Dundee, which kicks off at 7.35.\n“Scotland play a very direct style of football and we have been working hard on how to counteract that,” revealed Redmond.\n“They are very strong on set pieces in particular and we cannot afford to lose concentration in those situations or they will punish us.\n“Scotland had two great results in the last international window against Australia and Costa Rica, who are both taking part in the World Cup this month, so they will be keen to keep up that momentum ahead of the UEFA Women’s Nations League games this autumn. It will be a hard match.”\nThe interim boss has been impressed with her players’ attitude in training so far this week and she senses “a real hunger” in the squad to perform well in both Scotland and Czechia as the girls in green and white prepare for their Nations League bow in September.\nMost of the Northern Ireland players come from the NIFL Women’s Premiership, however Redmond believes they are more than capable of performing on the international stage, as they showed at the Women’s Euros a year ago.\nThe two sides’ most recent meeting was a friendly at Seaview in June 2021.\nBoth teams created plenty of chances in that encounter, however a second half penalty from Scotland substitute Caroline Weir was enough to give the visitors a 1-0 victory. Weir will captain Scotland in Dundee tonight.\nThis evening’s game is being broadcast on the BBC iPlayer as well as on BBC Scotland. And the friendly international can also be followed live on the BBC Sport website and app.",
  "word_count": 536,
  "scraped_at": "2026-02-14T13:27:22.336180"
}