{
  "article_id": "768840110b79",
  "url": "https://www.faribaultcountyregister.com/news/local-news/2025/09/28/usc-exchange-student-comes-from-germany/",
  "title": "USC exchange student comes from Germany | News , Sports , Jobs - Faribault County Register",
  "date": "20250928T071500Z",
  "domain": "faribaultcountyregister.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "USC exchange student comes from Germany\nAmelia Linke is staying with the Wegner family in Wells this year\nFor United South Central English teacher Kirstyn Wegner, becoming a host family for a foreign exchange student was an entirely new experience.\n“This is my first year hosting an exchange student, and I remember getting an email from the school saying that teachers made for great host families,” Wegner recalls. “I thought that it sounded fun, and decided to try hosting a student.”\nNow, Wegner, her husband Britt and daughter Nadia, are the host family for exchange student Amelia Linke, who is spending her fall semester as a student at USC. Linke hails from Frankfurt, Germany, and while this is her first time traveling to the U.S., this is not her first experience as an exchange student.\n“My school in Germany did an exchange program with other countries in Europe, so I got to travel to Finland as part of that program,” Linke shares.\nHowever, Linke also notes that her decision to do an exchange program to the U.S. was a sudden decision – one that even her parents weren’t sure about.\n“Joining the exchange program was just an idea I had one day,” Linke admits. “My parents had their doubts about it, especially since I’m pretty introverted, but eventually I convinced them to let me sign up. We finished the application in January, and it all went very quickly from there.”\nDespite being signed up for the program, Linke and Wegner both shared that there were some unexpected difficulties in getting Linke to the U.S. on time.\n“While I was going through the process of getting my visa, Trump was trying to close the borders of the U.S. and didn’t want any foreigners coming in, and that slowed down my visa interview process,” Linke shares. “I had to wait to get my visa, but thankfully I was able to get it before I needed to travel.”\nWegner also recalls that she was given very little notice for Linke’s arrival, only finding out a few days before she arrived.\n“I knew that Amelia was coming, but I had no idea when,” Wegner explains. “I got an email only a few days before she arrived telling me that she was coming – there wasn’t much notice at all!”\n“That was because my school was missing a document that allowed me to participate in the program,” Linke adds. “Once that document arrived, they sent me off right away without giving much notice to either of us.”\nLinke also shares that her travel situation was unique, as she didn’t fly directly to Minnesota, but instead landed in New York to meet up with a group of other German exchange students for orientation camp before flying to their final destinations.\n“We all had a kind of orientation day in New York City with our German exchange company, TravelWorks, before we split into small groups to fly to our designated states,” Linke recalls. “I flew here to Minnesota with another German exchange student. I think he’s doing the exchange program with Northfield.”\nNow that Linke has made it to Minnesota safely, she has settled in with her host family and joined the student body at USC. While it took some getting used to for both Linke and Wegner, both of them are happy to report that everything is going well thus far.\n“Living with the Wegners has been great,” Linke comments. “They’ve been very welcoming to me.”\n“Amelia really melted into the family and made herself at home right away,” Wegner adds. “She’s also been very open to trying new things.”\nWegner isn’t exaggerating when she says that, either – in the short time that Linke has been with her host family, they’ve traveled all over Minnesota and done several activities together, including going to the State Fair, a trip to the Renaissance Festival, and watching a Minnesota Lynx women’s basketball game.\n“I also got to try root beer for the first time!” Linke shares. “It’s really good, and we don’t have anything like it at all in Germany.”\nAs for her education at USC, Linke has already gotten involved with several activities, including joining tech crew for the fall musical and trying volleyball, though she admits that volleyball wasn’t exactly what she was hoping for.\n“I play handball back in Germany, and I was hoping that volleyball might be something similar,” Linke explains. “Unfortunately, it’s nothing like handball at all.”\n“I actually work as a manager for the theater department here at USC, and I noticed that Amelia mentioned wanting to do theater in her exchange student profile while looking through the list,” Wegner remarks. “I took one look at that and thought, oh, she’s a perfect match for me.”\nLinke also has a lot to share about her experience as a student at USC, noting the many differences between schooling here in the U.S. versus Germany.\n“School is very different here compared to back home in Germany; it’s a much more personal experience,” Linke remarks. “Teachers here get to create their own classrooms and engage with their students one-on-one. The class schedule here is completely different, too.”\nLinke also shared that she was excited for the changing of the seasons, citing that she would get to be in the U.S. to experience Halloween, Thanksgiving, and Christmas before she had to travel home.\n“I’m very excited to get to experience Halloween – we don’t really celebrate it in Germany at all,” Linke shares. “I’m also excited to see a real Minnesotan winter, though I didn’t have room in my suitcase to pack any winter clothes.”\nFor all of the new experiences that Linke has gotten to enjoy as an exchange student, she’s also brought a piece of Germany to the U.S. with her. She and her host family have established a “German word of the week” activity, where she teaches her host family a new German word every week along with its meaning and pronunciation.\n“We’ve done a few words already – our first word was schwül, which refers to warm, humid weather, and then there was Apfelschorle, which is a drink mixed with water and apple juice,” Linke explains.\n“There was also one that Amelia taught us while we were watching a football game, because it was cold outside and we had to stick together for warmth,” Wegner adds. “It was kuscheln, which means cuddling.”\nWhen asked whether she would recommend joining the exchange program to other students, Linke said that yes, she would definitely recommend doing an exchange.\n“My advice to other exchange students is not to compare your experiences during an exchange to those of other exchange students,” Linke comments. “You only get to experience the world like this once, so it’s important to live in the moment and enjoy it while you can.”",
  "word_count": 1141,
  "scraped_at": "2026-02-14T12:13:22.947070"
}