{
  "article_id": "769ae194ce5e",
  "url": "https://punchng.com/england-tops-womens-transfer-spending-in-2025-with-20-7m/",
  "title": "England tops women transfer spending in record 2025",
  "date": "20260128T203000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England led the global women’s football transfer market in 2025, as worldwide spending reached a record £20.7m ($28.6m), according to a report published by FIFA.\nAs reported by BBC Sport on Wednesday, the figure represents an 83.6% increase from 2024 and underlines the rapid financial growth of the women’s professional game.\nEngland accounted for the biggest share of spending, with clubs paying out £7.9m ($11m) in transfer fees, while generating £1.5m ($2.1m) through player sales.\nThe United States was the second-highest spender, with £5.8m ($7.9m).\nFIFA reported a rise in international player movement, with 2,440 cross-border transfers completed in 2025 — up 6.3% on the previous year.\nThe governing body noted that the figures do not include transfers between clubs in the same domestic league, meaning overall spending is likely to be considerably higher.\nThe number of clubs involved in paid transfers also reached new highs.\nIn total, 135 clubs paid fees for incoming players, while 155 clubs received money for at least one outgoing transfer, reflecting the widening financial base of the women’s game.\nThe year’s standout deal was Grace Geyoro’s move from Paris St-Germain to Women’s Super League side London City Lionesses in September, reported to be worth a world-record £1.4m ($1.9m).\nChelsea were also prominent, involved in two of the five most expensive transfers after signing defender Naomi Girma and forward Alyssa Thompson.\nRecord spending was also seen in the men’s professional game, where £9.5bn ($13.08bn) was spent on transfer fees globally — a 52.3% rise from 2024.\nEngland again topped the table, with Premier League clubs spending £2.7bn ($3.8bn), including the two most expensive deals completed by Liverpool.",
  "word_count": 272,
  "scraped_at": "2026-02-14T13:06:56.920538"
}