{
  "article_id": "76afd9a51ab5",
  "url": "https://www.namibian.com.na/man-citys-foden-wins-pfa-player-of-the-year-award/",
  "title": "Man City Foden wins PFA Player of the Year award - Sport",
  "date": "20240821T010000Z",
  "domain": "namibian.com.na",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester City forward Phil Foden won the Professional Footballers’ Association Player of the Year award on Tuesday.\nFoden played a key role in City winning an unprecedented fourth consecutive Premier League title last term.\nThe 24-year-old scored 19 times and delivered eight assists for Pep Guardiola’s team as they pipped Arsenal to the title on the last day of the season.\n“To win this award is something very special and it is one that I am very proud of and grateful for. To be recognised this way by your fellow professionals means everything and I would like to thank everyone who voted for me,” Foden said.\n“I also want to pay special thanks to Pep, the City coaches and all my teammates as they help me to try and get better every single day.”\nFoden has already set his sights on a fifth successive Premier League crown after City started their title defence with a 2-0 win at Chelsea on Sunday.\n“Last season was another very special one for everyone at the Club but now all our focus is concentrated on trying to achieve more success this term,” he said.\nFoden also won the 2023-24 Premier League player of the season award and was named the Football Writers’ Association footballer of the year.\nCity director of Football Txiki Begiristain added: “Everyone here is so thrilled to see Phil win this award. To have your fellow professionals recognise you in such a way is very special.\n“Phil embodies everything we stand for at Manchester City. He is a supremely talented player but is someone who always strives to seek to improve.\n“He is a very humble guy who is hugely popular throughout the Club. We are all very proud of him.”\nFoden’s City team-mates Erling Haaland, who won the award last year, and Rodri, as well as Chelsea’s Cole Palmer, Arsenal’s Martin Odegaard and Aston Villa’s Ollie Watkins were also on the Player of the Year shortlist.\nChelsea forward Palmer was named the men’s PFA young player of the year.\nFoden and Palmer’s awards made it the first time that both the senior and young player trophies went to English players since 2009-10, when Wayne Rooney and James Milner took home the silverware.\nEngland international Palmer was second only to Haaland in the Premier League scoring charts with 22 goals in a breakthrough campaign after leaving Guardiola’s team to move to Stamford Bridge.\nCity enjoyed a clean-sweep of the main awards at the Manchester ceremony as Khadija Shaw was voted the women’s Player of the Year.\nJamaican forward Shaw was the top scorer in the Women’s Super League with 21 goals as City were edged out for the title on goal difference by Chelsea.\n“I am both happy and proud to have received this award, to be recognised in such a way by my peers is a very special honour,” Shaw said.\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 585,
  "scraped_at": "2026-02-14T12:42:13.493344"
}