{
  "article_id": "76bd17e52d11",
  "url": "https://telegrafi.com/en/ku-gaboi-zgjimi/",
  "title": "Where did the  awakening  go wrong ? ",
  "date": "20250406T033000Z",
  "domain": "telegrafi.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Where did the \"awakening\" go wrong?\nBy: Henry Mance / The Financial Times\nTranslation: Telegrafi.com\nAll revolutions face a backlash. A few years ago, Elon Musk and other supporters of Donald Trump began denouncing what they called the “woke mind virus.” In 2023, the U.S. Supreme Court ruled that affirmative action policies in college admissions were illegal. Right-wing activists began preparing legal battles against companies that promoted prominent diversity initiatives.\nSince taking office as president, Trump has ordered a halt to federal diversity efforts, including some dating back to the time of Lyndon Johnson, and may expel transgender people from the US military. Walmart and Amazon are among the companies that are closing their diversity programs. Mark Zuckerberg, who once valued the role of Facebook-ut in the spread of movements #MeToo and #BlackLivesMatter, now says the parent company needs more “male energy” and will stop targeting women and minorities. American businesses have gone from knee-jerk to changing stance.\nBut perhaps just as significant has been the loss of faith among the revolution’s natural supporters. Kamala Harris, who once criticized Joe Biden’s past on desegregation issues, has distanced herself from the awakening. (Trump’s ads still say, “Kamala is for them. President Trump is for you.”) In the United Kingdom, Keir Starmer reversed his stance on transgender rights. Between 2021 and 2024, the percentage of Britons who thought efforts to provide equal opportunities for transgender people had not gone far enough fell from 32 percent to 22 percent.\nOnce, progressive activists could insist that criticism of their causes was fabricated. Today, that has become more difficult. Critics include people like philosophers Sam Harris and Susan Neiman, who identify themselves as part of the left.\nPurpose of the movement Black lives matter. [Black Lives Matter] was to make support almost a default option. Shortly after the killing of George Floyd by a Minneapolis police officer in 2020, protesters’ banners read: “White silence is violence.” The movement didn’t aim to convince people — it expected them to participate.\nIn this aspect, Black lives matter. It was initially a huge success. Within weeks of Floyd’s killing, an unprecedented 20 million Americans marched. Government policies were scrutinized for bias. Company executives looked around their offices and wondered why they were so white-dominated. Seminars were held, donations were promised, new appointments were made to senior positions. Statues were toppled; company logos that relied on racial stereotypes of people of color were changed.\nIn the years before this, other movements had similar success.#MeToo highlighted sexual abuse by men. LGBT+ activists highlighted the difficulties transgender people faced. After the expansion of gay rights, many people wanted to be on the right side of history. They added rainbows to their social media profiles and pronouns to their email signatures. Transgender characters became sought-after brand ambassadors.\nToday, however, many progressives have decided that speaking out is no longer so urgent. Silence has returned. If these movements are to rise again, they must overcome not only their opponents but also their own limitations.\nThe term “woke” first appeared in the black community in America to describe the awareness of the injustices they faced. Later, it spread more widely to the political left. Critics on the right took the word and turned it into a negative term, just as they did with “political correctness” in the 90s. Today, they often use the term in a disingenuous way.\nAwakening - for lack of a better term - today refers to efforts to address inequalities affecting marginalized groups, including women, people of color, the LGBT+ community, and people with disabilities. It assumes that people can discriminate even unconsciously by upholding unjust norms.\nFor many supporters, these efforts were a continuation of earlier movements, such as the civil rights movement in the US. Past revolutions had been only partially successful. The killing of George Floyd, as well as that of young people like Trayvon Martin in 2012, showed that the law was still not being applied equally to people of color in the US. Old inequalities persisted, while new ones emerged: technology companies were forced to apologize after their algorithms produced racist results.\nIf the awakening faced opposition, its supporters could point to those who had opposed civil rights in the 60s, or those who in the 90s complained about the banning of sexist and racist expressions.\nThe problem, as writer Yascha Mounk puts it in his book The identity trap [The Identity Trap], is that the new activism was built on a rejection of the civil rights movement’s optimistic goal of racial equality and integration. Its foundations were in the post-structuralism of the philosopher Michel Foucault in postcolonial studies and in critical race theory. Derrick Bell, the founder of this theory, argued in 1991 that black people in the United States had seen no real progress since slavery and that the desire for racial equality was a “fantasy.”\nBell's words did not spread widely, but examples of awakening exaggerations did. In 2020-2021, activists Black lives matter. occupied the city of Portland for months, causing millions of dollars in damage. Calls to “defund the police” complicated the law and order situation in many American cities, allowing critics to argue that it was making life more dangerous, not safer.\nLess serious, but just as prominent, were some counterintuitive theorizing. Some definitions of racial equality suggested that punctuality was a feature of “whiteness.” Some transgender rights activists adopted terms like “Latinx” and “people who menstruate,” even though most of the people they were talking about did not accept these terms.\nIn the 90s, political correctness meant using the word “chair” instead of “chairman” and “sex worker” instead of “prostitute” (the idea of calling short people “vertically challenged” came from critics of political correctness.) The conceptual and linguistic shifts of recent years have been perhaps even more drastic. The terms “white privilege,” “toxic masculinity,” and “cisgender” have come into widespread use.\nEven beyond these extremes, “awakening” clashed with some tenets of liberal society. It defined people as part of a group, not as individuals. It encouraged them to identify as black, queer, or something else. For Robin DiAngelo, the white author of the bestselling book White fragility [White Fragility], all white people are inherently racist.\nAll of this ran counter to the civil rights era's emphasis on equality and how many citizens wanted to see themselves. As early as 2015, veteran civil rights activist Barbara Reynolds argued that Black lives matter. was wrong not to make the slogan “all lives matter” part of it (and to disapprove of the church-inspired approach of the 60s protesters).\nWithin companies, awareness of the groups was initially welcomed: support networks were created for black, Asian, LGBT+, disabled and other employees. But now bosses have other ideas. “We’re starting to focus too much on all these differences, rather than saying that this is fundamentally about inclusion and respecting differences, without necessarily having to highlight them,” said Peter Cheese, chief executive of the CIPD, the British organisation for human resources professionals. “We can’t deal with every aspect of the differences between people in the workplace.”\nCompanies invested in anti-bias training, including that from Robin DiAngelo. But some evidence suggested that it had little effect. While diversity programs focused on race and gender, conversations about class were often absent. “[Employees would say] What does ‘white privilege’ mean? I come from a working-class background and I’ve been promoted,” said Kamal Munir, a professor at Cambridge Business School. “It was also seen as a zero-sum game.”\nClass wasn't the only point overlooked. The epithet \"Karen\" was originally used to describe white women with feelings of superiority, but it went from being a harmless meme to being blatantly sexist. In May 2023, the head of diversity at Uber left the company after employees complained that its training sessions, \"Don't Call Me Karen,\" were too focused on the struggles of white people.\nOne of the activists' main demands was the representation of marginalized groups. This had a liberating effect. After the campaign went viral #OscarsSoWhite In 2015 [the so-white Oscars] — when 20 acting nominations went to white people — more actors of color began to be recognized. Representation was long overdue. But, it wasn't everything. Does the film deserve Emilia Perez, a product of Netflixabout Mexican cartel violence, to be denied an Oscar nomination simply because it was made by a mostly non-Mexican crew? As the director argued in his defense, Shakespeare [William Shakespere] had never been to Verona. In 2021, an award-winning nonbinary Dutch writer who had been selected to translate the poems of the black American Amanda Gorman withdrew after criticism that the translation should have been done by a person of color.\nIn less familiar contexts, who was speaking became more important than what he/she was saying. It could be powerful, even funny, to question an opinion simply because it came from a white man. But when used repeatedly, it stifled debate. It became boring to hear people start their speech by defining their own identity.\nActivists also aimed to change what was acceptable to say or relate to. Ibram X. Kendi, author of the bestselling book How to be anti-racist [How to Be an Antiracist], apologized for using the words \"crazy,\" \"stupid,\" and \"incompetent,\" which were considered discriminatory toward people with disabilities. Robin DiAngelo listed phrases that white people should not say, including: \"I can't say anything right.\"\nIn 2020, the LA Galaxy soccer team fired a player after his wife posted racist messages on Facebook. Instagram, although he publicly condemned them (later, he became the top scorer in the Serbian Super League). A British children's author was rejected by her publisher for expressing support for JK Rowling's views on transgender issues (she later became a truck driver).\nThis approach was politically incorrect. In 2018 and again in 2021, a majority of Americans said they did not want political correctness to go any further. Barack Obama rightly observed that voters did not want to feel like they were “walking on eggshells”; they wanted a realistic acceptance of the fact that “life is a mess.”\nIn its most obvious form, the awakening offered not tolerance and debate, but punishment and “re-education.” This was intellectually flawed. Many people could agree that racial discrimination existed and that Floyd’s killing was a terrible act. But they disagreed with the weight that activists gave to discrimination. A survey in the US found that white progressives were more likely than people of color and Hispanics to say that racism is entrenched in American society — and less likely to say that most people can get ahead if they work hard.\nSuch radical changes in society deserved debate. This was particularly evident in transgender issues. Did the use of puberty blockers in children raise questions about permissibility and long-term health risks? Even raising these questions was viewed with suspicion, until - in 2024 - a review of the NHS England gender identity service concluded that the use of puberty blockers was based on “weak evidence”.\nLGBT+ activists had reasons not to engage in such debates. As Shon Faye argues in her book The transgender issue [The Transgender Issue], the way the media framed these issues could be oppressive in itself. Transgender people felt ridiculed for their very existence. Many distrusted the health system, believing it had neglected their needs. There was also the idea that questioning the positions of transgender activists made them more unsafe - both psychologically and physically, as it could lead to policy changes that further limited health care for them.\nBut the result was disappointing. Transgender activists often labeled their critics “transphobic.” The public that once supported the colorful rainbow of pride now often saw toxic debates on social media. (The critics also bore much of the blame for this toxicity.) For many supporters of the cause, this led them to think it was best to avoid transgender issues.\nIn the end, the law protected freedom of expression. In 2021, a UK court ruled that a woman named Maya Forstater was unlawfully discriminated against when her contract was not renewed because of her critical views on gender identity.\nSimilarly, efforts at racial diversity clashed with basic hiring rules. Previously, employers could only mention the possibility of hiring a candidate from a more diverse background if the two candidates were equal. This has always been unclear: no two candidates are ever completely equal, and there can always be a hidden bias on one side of the scale.\nAround 2020, some organizations wanted to speed up the hiring process for candidates from diverse groups. (Being a woman or a Jew probably wasn’t enough anymore.) In at least some cases, they openly discriminated against white employees. In 2022, the Thames Valley Police in Britain promoted an Asian officer without a competitive process; three white officers who were not given the opportunity to apply won a discrimination lawsuit. Perhaps the law should give employers more leeway to address social inequalities. But it doesn’t. Again, managers who wanted to change things from within and activists from without were moving faster than liberal society and the majority’s sense of justice could handle.\nThe strong social activism of mid-2020 — fueled by anger at Trump and perhaps the emotional fatigue of the pandemic — was never going to be sustainable. In April 2024, 52 percent of Americans thought the U.S. had done enough to make up for past discrimination against people of color. 2020 showed how sensitive companies were to the prevailing political winds. Now, those winds had shifted to the economy and immigration.\nIn fact, it's hard to separate the rise and fall of \"wokeness\" from American politics. This month, when Zuckerberg pulled the diversity initiatives on Meta and changed the moderation rules to allow posts like \"homosexuals are sick,\" the company justified this as follows:\n“It’s not fair that something can be said on television or in Congress but not on our platforms.” For weaker bosses, the changing political moment was a perfect excuse to bend the rules set by diversity managers and activists.\nThe awakening revolution might have lasted longer if progressives had not been so skeptical of universal ideas and free debate. Voters are not part of an anti-awakening crusade. Transgender issues do not figure prominently on the agenda of British voters. Most Britons support supposedly awakening ideas, such as returning the Parthenon marbles to Greece. Two-thirds of Americans support DEI [Diversity, Equity, and Inclusion] programs. But many of them have drifted away from the movements they once supported.\nThis might have been more convincing if the activists had been as organized as their more cynical opponents. Instead, Black lives matter. there were no established leaders and no stable structures. (In the US and Britain, several activists were imprisoned for misusing donations.) Very quickly, progressives also lost their most influential social network - Twitter: initially filled with abuse, then \"ruined\" by Musk.\nIf he were still alive, Derrick Bell might argue that this backlash is proof that racism always resurfaces. But for those who believe in progress, the awakening revolution has much to be proud of. It aimed higher than mere political correctness and brought greater awareness to issues of race, gender, and sexual identity. “There were advances,” says Munir of the University of Cambridge. “People tried to explore more diverse sources of talent. [But] Progress is never linear.”\nThe fate of diversity initiatives is closely linked to that of climate policy. The fact that climate action is no longer politically interesting does not mean that it is any less urgent. Likewise, the fact that Black lives matter. and transgender rights are no longer in the spotlight, it doesn't mean that economic and social inequalities have disappeared. \"Silence is violence\" was one of the many things progressive activists got wrong. But silence is not the best strategy either. /Telegraph/",
  "word_count": 2638,
  "scraped_at": "2026-02-14T12:19:57.778305"
}