{
  "article_id": "76c3c4fd7887",
  "url": "https://www.easternriverinachronicle.com.au/story/8980602/australia-must-step-up-for-world-glory-matildas-coach/",
  "title": "Australia must step up for world glory : Matildas coach",
  "date": "20250530T180000Z",
  "domain": "easternriverinachronicle.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Matildas interim coach Tom Sermanni says Australia has to be at the \"cutting edge\" of women's football to remain in contention to win a Women's World Cup.\nSubscribe now for unlimited access.\nor signup to continue reading\nIn Thursday's pre-match press conference, Sermanni slammed the professionalism of the A-League Women competition, especially in the wake of the 2023 Women's World Cup in Australia and New Zealand.\nAfter the Matildas' 2-0 win over Argentina on Friday night, Sermanni's 150th game at the helm, the women's football stalwart said he hoped his comments would prompt a \"positive reaction\".\n\"I always want more for the women's game,\" he said.\n\"That's my job, and it's always been my job, and it's been my job since I first walked into women's football in 1994 and it will continue to be my job.\n\"And while I've got a position where I can influence things, then it's important that I do that.\"\nProfessional Footballers Australia have previously warned of a potential player drain from the ALW if the league is not fully professionalised within the next two years.\nWhen asked what a lack of progress could mean for the Matildas' player pathways, Sermanni said: \"It's like any industry, probably, you've got to keep at the cutting edge.\n\"You can't afford to stay still, and you can't afford to go backwards. It's as simple as that. The world has opened up for women's football.\n\"Europe has come alive in the last three or four years. The game in the last two to three to four years has expanded more than it did in the 10 years previous to that.\n\"So we need to keep up with that. And to keep up with that, we need to put certain things in place domestically, and we need to put certain things in place internationally.\n\"It's important that we do that with everybody on board and everybody pushing in the right direction, and that's A-League people, FA (Football Australia) people and club people.\"\nAustralia reached the semi-finals of the 2023 Women's World Cup.\nWhen asked whether Australia was getting closer to or further away from winning football's grandest prize, Sermanni said: \"It's getting harder.\n\"It's not necessarily whether closer or further away. It's actually getting harder because the big countries are investing in women's football.\"\nSermanni pointed to England and Spain kicking on over the past decade.\n\"So what's happened is that, there's far more investment in the game worldwide and if South America comes alive, that will make it even tougher.\n\"When all of our players are fit and healthy, I think we have got a high-quality squad that can compete with anyone in the world.\n\"And in reality, two years ago, we came close to winning the World Cup\n\"So we're in the mix, but we need to keep progressing, just to stay in there and to be competitive.\"\nAustralian Associated Press",
  "word_count": 483,
  "scraped_at": "2026-02-14T12:36:06.921294"
}