{
  "article_id": "76e249587929",
  "url": "https://www.bbc.com/news/articles/c0mp38mjzlno",
  "title": "Barrow Lioness Georgia Stanway awarded Freedom of the Town",
  "date": "20251224T183000Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lioness Stanway awarded freedom of hometown\nEngland Lioness Georgia Stanway has said she wants to continue to support the next generation after being awarded the freedom of her hometown.\nBarrow Town Council said the \"inspirational\" midfielder had placed Barrow-in-Furness \"on the global map\".\nStanway said she returned \"as much as I can and this is the place I call home\".\nMayor of Barrow councillor Frederick Chatfield said: \"Georgia Stanway represents the very best of us. Her journey from the local pitches of Cumbria to the stadiums of the World Cup is a story of sheer perseverance.\"\nThe award officially grants the footballer the symbolic right to march through the town with \"drums beating and colours flying\", and serves as a permanent record of her \"eminent services\" to the reputation of the area.\nThe council said the award was the highest civic distinction it could offer and \"a celebration of character, community, and the enduring spirit of Barrow\".\nStanway was part of the Lionesses' squad who won the Euros earlier this year and also in 2022.\nArriving back on Tuesday from playing for her current club Bayern Munich in Germany, she said seeing a mural of herself overlooking the town's football stadium was \"unbelievable\".\n\"I saw it for the first time and I can't believe how big it actually is,\" she told BBC Radio Cumbria.\nShe said after also seeing her name on the back of people's shirts it was \"very surreal\" and she \"never thought it was going to happen so it's pretty special\".\nAfter spending Christmas at home with her family, she said she wanted to continue to be consistent on the pitch, enjoy her football and \"continue to inspire and try and do as much as I can in Barrow in helping support the next generation\".\nThe 26-year-old scored the winner against Spain in the quarter-final of the Euro 2022 tournament, which England went on to win.\nThe team retained the crown at the 2025 final against the Spanish squad, winning 3-1 on penalties.\nChatfield said Stanway had reached \"the pinnacle of world football\" and was an \"inspiration for the next generation\".\n\"Georgia remains the ultimate role model for our youth,\" he said.\n\"By returning to her roots, from her early days at Blackburn Rovers to her current international success, she proves to every girl and boy in Furness that there is no limit to what can be achieved through hard work and determination.\"\nStanway had \"never forgotten where she came from\", he said, whether through her support of local junior football or her involvement with the mural.\n\"In awarding Georgia the Freedom of the Town, we are acknowledging that while her career takes her all over the world, her home - and her legacy - will always be here,\" he added.",
  "word_count": 464,
  "scraped_at": "2026-02-14T12:37:15.908181"
}