{
  "article_id": "7704a583e188",
  "url": "https://www.theguardian.com/world/2025/apr/24/thursday-briefing-rachel-reeves-heads-to-washington-in-pursuit-of-a-trade-deal-will-she-get-one",
  "title": "Thursday briefing : Rachel Reeves heads to Washington in pursuit of a trade deal – will she get one ? ",
  "date": "20250424T063000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. I’m Annie Kelly, I’ll be bringing you First Edition alongside Archie for the next few weeks.\nIt’s probably fair to say the annual spring meeting of the International Monetary Fund (IMF) has not traditionally been an event high on drama. Not so this year, as Rachel Reeves and her fellow finance ministers from around the globe have been blown into Washington DC on the chilly winds of global economic chaos caused by Donald Trump’s “America First” economic policies, pithily described in a recent Guardian leader as “part oligarchic enrichment scheme, part mobster shakedown”.\nReeves arrived for the four-day event hot on the heels of the news that the world economy has, says the IMF, suffered a “major negative shock” from Trump’s tariffs with the lender slashing global growth estimates across all major political economies, including the UK.\nReeves will have a big few days ahead of her as she strives to negotiate with the US administration and return home with a firm prospect of a big, beautiful trade deal to calm the nation’s jangling nerves.\nFor today’s newsletter, I talked with the Guardian’s senior economics correspondent Richard Partington about what she’ll be hoping to come home with … and if she’ll get it. First, today’s headlines.\nFive big stories\n-\nUkraine | At least nine people have been killed and more than 60 wounded in a “massive” missile attack on Kyiv, according to Ukraine’s state emergency service. It is among the deadliest attacks on the capital of the three-year war.\n-\nLabour | Keir Starmer is under pressure from more than 60 Labour MPs to allow thousands of young Europeans to live and work in the UK, a move seen as key to unlocking a more ambitious trade reset with Brussels.\n-\nHealth | Adults with severe peanut allergies can be desensitised by daily exposure, according to the first clinical trial of its kind. After being given steadily increasing doses of peanut flour over a period of months, two-thirds of the trial participants were able to eat the equivalent of five peanuts without reacting.\n-\nNHS | NHS staff are so tired they are dying in car crashes and posing a major threat to patients, the service’s safety watchdog will warn on Thursday. Fatigue among frontline personnel causing them to make mistakes is a “significant” risk to patients, according to the Health Services Safety Investigation Body (HSSIB).\n-\nMusic | Oasis fans have collectively lost more than £2m to scams since tickets for its reunion tour went on sale last year, a major bank has estimated. Lloyds Banking Group based the calculation on the volume of fraud reports made by its own customers. Oasis fans make up more than half (56%) of all reported concert ticket scams so far this year, losing £436 on average.\nIn depth: ‘There is a queue around the block to get time with the US’\nRachel Reeves is walking a tricky line in Washington DC as she attempts to negotiate a trade deal with the US this week. She will have to balance the political pressure to deliver good news on a deal and protect Britain’s interests, while at the same time being sure not to even appear confrontational or oppositional to a hyper-sensitive Trump.\nHer first face-to-face meetings with Scott Bessent, the US treasury secretary, will be key to whether she comes back home with anything solid to show for her time in the US. Her conversations with him will hopefully lay the foundations of any future trade deal the UK will be able to strike, with Reeves saying they would be talking about “how we can build on the trade relationship that we have”.\nHow good are Reeves’s prospects?\nAccording to Richard, the chancellor arrived in Washington in a relatively good position.\nBack at home, her Labour government has been dealing with almost universally bad news on the economic front and has so far failed to deliver the growth that they promised, but in the US he believes she has the space to negotiate a favourable deal.\n“There is £60bn worth of bilateral trade between our two countries and this is significant,” he points out. Yet he also says a big challenge for Reeves will be getting the deal prioritised amid the clamour this week. Trump’s focus is also likely to be on China, with whom he has the biggest grievances, but where he is also softening his position to open up space.\n“Reeves has flown into Washington with every other finance minister, each one of them trying to cut a deal with the Trump administration,” he says. “There is a queue around the block to get time with the US.”\nYesterday Reeves also seemed very keen to manage – or even dampen – expectations, dashing hopes of an early breakthrough during this week’s negotiations, saying although she is confident a deal can be struck she is “not going to rush” into anything.\nWhat does she want?\nReeves’s ultimate wish would be to fly home with a blanket exemption from the 10% trade tariffs Trump has imposed on the UK, and with an agreed trade deal under her belt. But, again, she has indicated that this is almost certain not to happen.\nThe UK has already offered concessions in the hope of getting tariffs cut, such as offering to reduce the digital services tax on US tech companies. One of her reported aims this week is to secure a carve-out tariff reductions for the 25% levies placed on cars, aluminium and steel to try and stave off the job losses that UK car industry bosses have warned could be just weeks away.\nHowever, as economics editor Heather Stewart reported last night, Reeves has already pushed back on leaked plans that suggested that the US was preparing to issue a series of demands, including the government drop its standards on agricultural products such as hormone-fed beef.\nReeves needs to hold her position in the coming days on deal-breakers for the voting public like the prospect of being forced to import chlorinated chicken or give away parts of the NHS. She also needs to make sure that she isn’t alienating or cutting off the UK’s relationships with other trading partners, like the European Union.\n“I think a good scenario for her would be some kind of positive public commitment on both sides about an intention to strike a deal and deepen economic links,” says Richard. “Something she can hold up and say, ‘look what I got done’.\nWhat are her main challenges to getting what she wants?\nA problem Reeves shares with all the other finance ministers trying to secure agreements with the US this week is – you guessed it – that they are trying to negotiate with a wildly erratic and unpredictable partner.\n“The whole process has this sense of peril and brinkmanship,” says Richard. As a reporter, Richard says he finds reporting on Trump’s economic policies “just completely mad. I wake up in the mornings and check the news on tariffs like I’m checking the weather because it’s so changeable. It is hard to be authoritative on something that is constantly shifting so imagine what it’s like to be trying to nail down the details of a trade deal.”\nOne thing Reeves will be aware of is that even if she does manage to carve out some concessions or reprieves from the blanket 10% tariff Trump has imposed on all trading partners, the chilling economic effect of his policies so far is almost inevitably going to be felt by both businesses and consumers in the UK and beyond for months or years to come.\nOne problem Labour has, says Richard, is that the government’s gloomy and downbeat rhetoric on the economy since the party came to power last year has already affected business and consumer confidence.\n“People here responded to that already – they didn’t start that business or make that hire or buy that new kitchen,” he says. Now with the tariffs and global economy sliding, Reeves is potentially facing the prospect of having to raise taxes, cut spending or break her own fiscal promises in the Autumn budget,”which will increase the pressure on her to come home with good news” says Richard.\nWhat else we’ve been reading\n-\nRafael Behr thinks Nigel Farage has found his next “vehicle for economic and cultural grievance” in net zero – and challenges Keir Starmer to start firmly defending the much-needed green transition. Charlie Lindlar, acting deputy editor, newsletters\n-\nThe legendary Peter Bradshaw has done a wonderful job of delivering a brief history of popes in film and TV and decodes the enduring cinematic appeal of the Holy Father. Annie\n-\nThe Turner prize shortlist is out, and features all sorts of works from videotape sculptures to war trauma paintings. For his money, though, Jonathan Jones thinks “this shortlist’s lack of connection with the realities of contemporary Britain is just another way to dig the ailing Turner prize deeper into irrelevance and empty bourgeois ritual”. Charlie\n-\nSean Ingle’s piece on the Kenyan athlete Faith Kipyegon’s “audacious” bid to become the first woman to run a sub-four minute mile is a testament to her ambition to push the boundaries of women’s sports. Annie\n-\nHere’s Adrian Chiles on why he hates pigeons. Need we say any more? Charlie\nSport\nFootball | Substitute Jean-Philippe Mateta’s 83rd-minute goal earned Crystal Palace a 2-2 draw at Arsenal – and gives Liverpool the chance to secure the Premier League title against Tottenham on Sunday. In the Women’s Super League, two goals from Catarina Macario, a penalty from Guro Reiten and Mia Fishel’s strike gave Chelsea a 4-0 win against Crystal Palace.\nTennis | Former tennis world No 1 Andre Agassi will make his professional debut in the fast-growing sport of pickleball next week when he teams up with top ranked Anna Leigh Waters for the mixed doubles at the US Open Pickleball Championships.\nAthletics | The London Marathon has revealed that it is permanently boycotting X, with the event director, Hugh Brasher, accusing the social media platform of “descending into a gutter” since Elon Musk took charge.\nThe front pages\n“Crimea is lost, says Trump as he warns Zelenskyy on peace deal” – that’s the story fronting the Guardian’s print edition today. The Times goes with “Zelensky is key obstacle to peace deal, says Trump” and the Daily Mail has “Back my peace or lose all of Ukraine, Trump warns”. “Trump: Zelensky to blame for no peace” says the Telegraph. In business news, the Financial Times reports “Reeves ready to cut tariffs on US car imports in push for deal with Trump”. Reunion tour turmoil in the Metro: “£2m Oasis scam pain supernova”. Freddie: part of me wished I had tied” – the cricketer talks about his car crash recovery in the Mirror. “The truth is he doesn’t have the balls!” – vulgarity directed at Keir Starmer by Kemi Badenoch is the most pressing story for the Express today.\nToday in Focus\nTrump’s class war on Harvard\nIs the US president exploiting popular resentment towards elite colleges to achieve his political goals? Ed Pilkington reports\nCartoon of the day | Ella Baron\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nSlow-roasted pork with pearl barley and mushrooms. Rye pancakes with salmon, cream cheese and avocado. Beetroot tartare with horseradish and rye toasts, and a spelt side salad.\nRachel Dixon reports not from some trendy new Soho joint, but from a Denmark train company canteen, as she explores how the country transformed its population’s diet for the better through the power of wholegrains.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 1979,
  "scraped_at": "2026-02-14T12:43:32.209000"
}