{
  "article_id": "7726cc4245a2",
  "url": "https://news.yahoo.com/legislators-request-more-76m-capital-115546710.html",
  "title": "Legislators request more than $76M in capital outlay funding for Doña Ana County communities",
  "date": "20230325T154500Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Legislators request more than $76M in capital outlay funding for Doña Ana County communities\nLAS CRUCES - As this year’s 60-day legislative has drawn to an end, southern New Mexico lawmakers have requested $76,110,360 in capital outlay funding for projects in Doña Ana County.\nHere is how the individual requests break down:\nAnthony, N.M.\nAnthony citywide streets improvement: $500,000 to plan, design and construct street improvements citywide, including drainage and sidewalks, in Anthony.\nAnthony Health Center construction: $1,750,000 to acquire easements and rights of way and to plan, design, construct, furnish and equip a health and wellness center in Anthony.\nAnthony public safety construction: $1,000,000 to plan, design, construct, renovate, furnish and equip a multipurpose facility, including space for fire protection and law enforcement services, in Anthony.\nAnthony Solid Waste Transfer Station acquisition: $300,000 to acquire easements, rights of way and land and to plan, design, construct, furnish and equip a solid waste transfer station in Anthony.\nAnthony vehicle purchase: $125,000 to purchase and equip vehicles in Anthony.\nAnthony Water and Sanitation District Farmers’ Market improvement: $100,000 to plan, design, construct, equip and improve a produce processing room and irrigation system at the Farmers' Market Youth Center facility for the Anthony Water and Sanitation District.\nChamberino\nChamberino Mutual Domestic Water Consumer and Sewer Association Community Complex construction: $800,743 to plan, design and construct a community complex, including an office and meeting space, common space, kitchen, storage area, gymnasium, restrooms, janitorial room, parking, sidewalks and a playground, for the Chamberino Mutual Domestic Water Consumer and Sewer Association.\nChaparral\nChaparral Fire Station 10 renovation: $580,000 to plan, design, construct, renovate, furnish and equip Fire Station 10 in Chaparral.\nChaparral flood control improvements: $580,000 to acquire land for and to plan, design, construct and equip flood control improvements in Chaparral.\nDoña Ana\nDoña Ana Boxing Club improvements: $50,000 to plan, design, construct, furnish and equip improvements to the Dona Ana Boxing Club.\nDoña Ana flood control improvements: $700,000 to acquire land for and to plan, design, construct and equip drainage and flood control improvements in multiple locations in the community of Doña Ana.\nGarfield\nGarfield Mutual Domestic Water Consumers’ and Mutual Sewage Works Association backhoe equipment purchase: $100,000 to purchase backhoe equipment for the Garfield Mutual Domestic Water Consumers' and Mutual Sewage Works Association.\nGarfield Mutual Domestic Water Consumers’ and Mutual Sewage Works Association vacuum trailer and generator purchase: $150,000 to purchase and equip a vacuum trailer and portable generator for the Garfield Mutual Domestic Water Consumers' and Mutual Sewage Works Association.\nHatch\nHatch food pantry renovation: $175,000 to purchase equipment and to plan, design and renovate a building for a food pantry in Hatch.\nMore in U.S.\nHatch library construction: $420,000 to acquire land for and to plan, design, construct, furnish and equip a library, including a parking lot, in Hatch.\nHatch Valley High School vertical garden installation: $100,000 to purchase, install and equip a controlled environment vertical garden unit at Hatch Valley High School.\nLa Mesa\nLa Mesa Community Center improvements: $200,000 to plan, design, construct, furnish and equip improvements to the La Mesa Community Center.\nLower Rio Grande Public Water Works Authority La Mesa power line extension: $277,514 to acquire easements and rights of way and to plan, design, construct, purchase, and equip water line extensions and connections to the La Mesa area for the Lower Rio Grande Public Water Works Authority.\nLa Union\nLa Union drainage improvements: $200,000 to acquire land for and to plan, design, construct and equip improvements to drainage systems in La Union.\nLa Union Mutual Domestic Sewer and Water Association solar system construction: $300,000 to plan, design, construct, purchase, install and equip a solar system, including security cameras, for La Union Mutual Domestic Sewer and Water Association.\nLeasburg\nLeasburg Mutual Domestic Water Consumers Association vacuum equipment purchase: $50,000 to purchase and equip a trailer-mounted vacuum system for the Leasburg Mutual Domestic Water Consumers Association.\nLeasburg Mutual Domestic Water Consumers Association water meter replacement: $110,000 to plan, design, construct, purchase, install and equip water meters, including associated meter reading hardware, software and locking meter boxes, for the Leasburg mutual domestic water consumers association.\nMesilla\nMesilla Marshals’ Department vehicle purchase: $150,000 to purchase and equip vehicles for the Marshals’ Department in Mesilla.\nMesilla roads improvements: $190,000 to plan, design, construct and improve roads in Mesilla.\nMesilla street sweeper purchase: $306,000 to purchase and equip a street sweeper for Mesilla.\nMesilla water lines improvement: $100,000 to plan, design, construct, install and improve water lines in Mesilla.\nRio Grande Preparatory Institute front renovation: $197,147 to plan, design, construct and renovate the front area of the school as a Plaza Mercado to showcase student work from the career and technical education programs at the Rio Grande Preparatory Institute in the Las Cruces Public School District.\nTaylor Reynolds Barela Mesilla Historic Site improvements: $795,000 to plan, design, construct, repair, upgrade and improve exhibits and facilities at the Taylor Reynolds Barela Mesilla Historic Site in Mesilla.\nMesquite\nMesquite Ballpark improvements: $200,000 to plan, design, construct, purchase, install and equip improvements to the Mesquite Ballpark, including lighting, in Doña Ana County.\nMesquite Community Center improvements: $200,000 to plan, design, construct and install improvements to the building and grounds at the Mesquite Community Center.\nMesquite sidewalk construction: $300,000 to plan, design and construct sidewalks in the Mesquite area.\nMesquite Stake Park improvements: $200,000 to plan, design, construct, purchase, furnish and equip a skate park in Mesquite.\nNew Mexico Department of Agriculture\nPhase 4 building renovation: $10,900,000 to continue renovation efforts at the New Mexico Department of Agriculture in Las Cruces.\nNew Mexico State University\nNMSU basketball equipment purchase: $100,000 to plan, design, construct, renovate, furnish and equip basketball facilities and equipment at New Mexico State University in Las Cruces.\nNMSU Biomedical Research Building phase 2 construction: $500,000 to plan, design, construct, renovate, equip and to purchase and install equipment to modernize the biomedical research building for phase 2 of an agricultural modernization project at New Mexico State University in Las Cruces.\nNMSU Biomedical Research Building construction: $4,800,000 to plan, design, construct, renovate, equip and to purchase and install equipment to modernize the biomedical research building for an agricultural modernization project at New Mexico State University in Las Cruces.\nNMSU Chemistry Building HVAC improvements: $6,977,513 to plan, design, construct, renovate, equip and to purchase and install equipment to modernize the HVAC system at the Chemistry Building at New Mexico State University in Las Cruces.\nNMSU Delameter Activity Center improvements: $670,743 to plan, design, construct, renovate, furnish and equip recreation and wellness improvements for the James B. Delamater activity center at New Mexico State University in Las Cruces.\nNMSU Fabian Garcia Science Center equipment purchase: $140,000 to purchase equipment for the Fabian Garcia science center at New Mexico State University in Las Cruces.\nNMSU football facility improvements: $550,000 to plan, design, construct, renovate, furnish and equip football facilities and equipment at New Mexico State University in Las Cruces.\nNMSU football stadium improvements: $2,200,000 to plan, design, construct, replace, renovate, furnish and equip football stadium facilities at Aggie Memorial Stadium at New Mexico State University in Las Cruces.\nNMSU Golf Course and Learning Center improvements: $100,000 to plan, design, construct, furnish, equip and improve the golf course driving range building and learning center at New Mexico State University in Las Cruces.\nNMSU Health & Social Services Building and O’Donnell Hall renovation: $100,000 to plan, design, construct, renovate, furnish and equip improvements to O'Donnell Hall, including an addition to the Health and Social Services Building and expansion of a nursing laboratory, at New Mexico State University in Las Cruces.\nNMSU volleyball locker room renovation: $100,000 to plan, design, construct, renovate, furnish and equip volleyball locker rooms, including finishes and locker replacement, at New Mexico State University in Las Cruces.\nNMSU women’s basketball locker room renovation: $200,000 to plan, design, construct, renovate, furnish and equip women’s basketball locker rooms at New Mexico State University in Las Cruces.\nNMSU-Doña Ana Community College Digital Media Building roof replacement: $615,000 to replace the roof at the Digital Media Building on the campus of Doña Ana Community College.\nNMSU-Doña Ana Community College Gadsden Center roof replacement: $1,200,000 to replace the roof at the Gadsden Learning Center on the campus of Doña Ana Community College-Gadsden Campus.\nRadium Springs\nFort Selden Historic Site improvements: $145,000 to plan, design, construct, repair, upgrade and improve exhibits and facilities at the Fort Selden Historic Site.\nFort Selden Road walking path expansion: $50,000 to plan, design, construct, extend, improve and equip a walking path on Fort Selden Road in Radium Springs.\nRadium Springs drainage improvements: $560,000 to acquire land for and to plan, design and construct a storm water retention pond near the Interstate 25 and Fort Seldon off-ramp near Radium Springs.\nSalem\nSalem drainage phase I improvements: $700,000 to plan, design, construct and equip a retention pond, including a principal outlet and emergency spillway, to collect runoff generated north of Salem and downstream along Grande Avenue in Salem.\nSanta Teresa\nDoña Ana County Emergency Response Facility restroom improvements: $100,000 to plan, design, construct, renovate, expand and furnish areas of the emergency and hazmat response facility, including restrooms, in Santa Teresa.\nSunland Park\nSouth Central Regional Transit District electric buses purchase: $300,000 to acquire land and an administrative and maintenance building and to purchase electric buses and electric charging stations for the South Central Regional Transit District in Sunland Park.\nSunland Park City Hall/Municipal Complex construction: $1,365,000 to acquire land and to plan, design, construct, renovate, furnish and equip municipal complexes and plazas, including a food pantry facility, in Sunland Park.\nSunland Park police vehicle equipment: $200,000 to purchase and equip vehicles and equipment for the police department in Sunland Park.\nTortugas\nTortugas lighting and road safety improvements: $200,000 to plan, design, construct and equip lighting, road safety and speed reduction improvements in Tortugas.\nVado\nVado/Del Cerro Community Park improvements: $150,000 to plan, design, purchase, install and construct a playground, park structures and landscaping at the Vado/Del Cerro Community Park.\nDamien Willis is a Lead Reporter for the Las Cruces Sun-News. He can be reached at 575-541-5443, dwillis@lcsun-news.com or @DamienWillis on Twitter.\nOthers are reading:\nThis article originally appeared on Las Cruces Sun-News: Legislators request $76M in capital outlay funding for Doña Ana County",
  "word_count": 1705,
  "scraped_at": "2026-02-14T13:07:27.637634"
}