{
  "article_id": "774d69d381be",
  "url": "https://www.winnipegfreepress.com/breakingnews/2025/06/05/distraction-at-the-falls",
  "title": "Distraction at the Falls – Winnipeg Free Press",
  "date": "20250606T003000Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Distraction at the Falls\nManitoba wildfire evacuees find respite in beauty — thousands of kilometres from home\nAdvertisement\nMichael McLeod noticed something Thursday that had become rare in recent weeks — smiles on people’s faces.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nMichael McLeod noticed something Thursday that had become rare in recent weeks — smiles on people’s faces.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 05/06/2025 (254 days ago), so information in it may no longer be current.\nMichael McLeod noticed something Thursday that had become rare in recent weeks — smiles on people’s faces.\nSpeaking to the Free Press from Niagara Falls, Ont., the 36-year-old Cross Lake resident was still taking in the wonder of seeing the world famous waterfalls for the very first time. He had arrived in southern Ontario the day before, following a week spent at the Winnipeg Soccer Federation Soccer North facility on Leila Avenue, where evacuees from fire-threatened communities were being housed.\n“It was crazy, lots and lots of people,” McLeod said of the crowded congregate shelter. “Some nights were restless nights. Everyone was panicking with the fires going on around Manitoba. It was just scary.”\nThursday brought a different atmosphere. The people McLeod saw walking around near his hotel weren’t as tense.\n“They’re distracted,” he said. “It’s good to see people smiling that way. It helps. Seeing the Falls boosts the spirits.”\nFor McLeod — whose community, located roughly 815 kilometres north of Winnipeg, had been in the grip of a mass evacuation — the beauty of the Falls was more than a tourist attraction. It was a sight for weary eyes, long deprived of clear skies and clean air.\nHe’d spent days in Cross Lake helping with fire and rescue efforts, putting out grass fires and scanning the skies for embers as winds blew fires closer to town. Eventually, the danger became too great.\n“We were prepared this time,” McLeod said, having gone through an evacuation a few years ago. “Not prepared, I guess, but we knew we had to get out. It was pretty bad. They told us we had to leave.”\nThough scheduled to leave for Niagara Falls on Monday, McLeod stayed behind, insisting that women and children be given first priority.\n“It was bad that night, a lot of people tried jumping on the plane,” he said. “I was bumped back, but women and children should go first.”\nNow scattered across Manitoba, his family remains top of mind.\n“I’m taking it one day at a time out here,” he said. “I just get too emotional thinking about back home.”\nMeanwhile, from her 18th-floor hotel room, Lori Osborne looked out over Niagara Falls — a view unlike anything the 29-year-old had ever seen.\n“It’s so freakin’ beautiful,” she said from one of the 1,500 rooms the province has secured for Manitobans in Ontario. Transportation and Infrastructure Minister Lisa Naylor said at a news conference on Thursday that about 800 of those rooms are occupied.\nOsborne, another evacuee from Cross Lake, had arrived in Niagara Falls on Wednesday with her family, including her four children — Sophie Osborne, 10, Lakota Robinson, 7, Meena Osborne, 5, and Greenly Osborne, eight months — and boyfriend, 29-year-old Stephan Robinson.\nTheir long journey began early last week, first going to Norway House, then Winnipeg, and later to Peguis First Nation, where they were briefly settled.\n“My boyfriend and I took turns carrying our 29-pound eight-month-old,” Osborne said, having not been able to take their stroller from Norway House. One was donated when they made it to Peguis.\nOsborne said her family didn’t want to leave there.\n“It felt like home… I was really sad,” she said. “I loved it. My kids had things to do every day. We stayed in a multiplex, and my boyfriend made us a little shelter area with sheets and dividers.\n“There was a bouncy castle, an arcade, a pool table… they had everything there.”\nTheir trek, however, was anything but smooth. After arriving at the airport Tuesday night and waiting until 1 a.m., their flight was delayed. They returned to Peguis and flew out the next day — though their luggage had already made the trip without them.\n“We thought we would just be there for a week until it blows over,” she said. “Then we got the call we were going to Niagara Falls.”\nJamie Anderson, 26, from Cross Lake, heard stories of people losing their homes on his flight to Niagara Falls on Tuesday.\n“You just felt bad for them,” he said, adding there were passengers from Flin Flon, Pukatawagan and Split Lake, among other communities. “Just praying for everybody.”\nBefore arriving in Ontario, Anderson spent several nights at Century Arena in Winnipeg after being evacuated last weekend. At first, even finding a place to rest wasn’t easy, as all the cots were taken.\n“But Red Cross was really good, the hospitality, the people were great. They fed us, gave us taxi vouchers so we could go pick up our government cheques, and provided buses so we could get to where we needed to go,” he said. “I can’t complain, at least I’m out of the fire, out of the danger zone.”\nAnderson said he still has some brothers back in Cross Lake helping to fight the fires.\n“Another brother and his family are in Brandon,” he said. “And my mother, sister and little brother are in Winnipeg, all accommodated. They’re all good.”\nNow settled in Niagara Falls, Anderson visited the famous waterfalls on Tuesday and found himself settling down, something he hasn’t been able to do in days.\n“From my hotel, either direction you go, you’re going to find something to do,” he said. “You’re seeing smiles on people’s faces.”\nscott.billeck@freepress.mb.ca\nScott Billeck is a general assignment reporter for the Free Press. A Creative Communications graduate from Red River College, Scott has more than a decade’s worth of experience covering hockey, football and global pandemics. He joined the Free Press in 2024. Read more about Scott.\nEvery piece of reporting Scott produces is reviewed by an editing team before it is posted online or published in print — part of the Free Press‘s tradition, since 1872, of producing reliable independent journalism. Read more about Free Press’s history and mandate, and learn how our newsroom operates.\nOur newsroom depends on a growing audience of readers to power our journalism. If you are not a paid reader, please consider becoming a subscriber.\nOur newsroom depends on its audience of readers to power our journalism. Thank you for your support.\nHistory\nUpdated on Thursday, June 5, 2025 7:22 PM CDT: Updates photo",
  "word_count": 1298,
  "scraped_at": "2026-02-14T14:16:40.775481"
}