{
  "article_id": "776d6e613340",
  "url": "https://metro.co.uk/2026/01/01/anthony-joshua-pays-final-respects-to-departed-friends-after-leaving-hospital-25967722/",
  "title": "Anthony Joshua pays  final respects to departed friend after leaving hospital",
  "date": "20260101T020000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Anthony Joshua has been discharged from hospital following the devastating car crash in Nigeria that left two of his close friends dead.\nThe two-time heavyweight champion was travelling in a Lexus SUV on the Lagos-Ibadan Expressway in Makun, Nigeria on Monday when it hit a stationary vehicle.\nJoshua escaped with ‘minor’ injuries but close friends and long-time members of his team Latif Ayodele and Sina Ghami were killed instantly.\nJoshua’s mother Yeta Odusanya rushed to her son’s bedside following the tragedy with the pair paying their respects to his ‘departed friends’ at a funeral home on Wednesday afternoon ahead of their repatriation to the UK.\nA statement from the regional governments of Lagos and Ogun said: ‘Anthony Joshua was discharged from hospital late this afternoon though heavy hearted and full of emotions over the loss of his two close friends he was deemed clinical fit to recuperate from home.\n‘Anthony and his mother were at the funeral home in Lagos this afternoon to pay their final respects to his two departed friends as they were being prepared for repatriation scheduled for later this evening.\n‘Ogun State Governor Dapo Abiodun and Lagos State Governor Babajide Sanwo-Olu deeply appreciate the public concern and show of love and affection over this very sad and unfortunate incident.’\nWho were Anthony Joshua's friends Latif Ayodele and Sina Ghami?\nThroughout his time in boxing, Anthony Joshua has kept a close-knit circle of friends and associates around him, plenty of those working silently behind the scenes during his ascent to the summit of the sport.\nBoth Ghami and Ayodele were part of that group, considered good friends having worked closely with him for years.\nWho is Latif ‘Latz’ Ayodele?\n‘Latz’ is a long-time friend of Joshua’s and has been part of the AJ team going all the way back to his maiden world title victory over Charles Martin in 2016.\nAyodele was Joshua’s personal trainer and a dedicated Muslim having converted to Isam in 2012.\nHis Instagram feed is littered with images and videos of him alongside Joshua in the gym and relaxing away from it.\nJust hours before the crash, he shared a video on Instagram of him and Joshua smiling and laughing over a game of table tennis.\nLatif worked with a number of other prominent sports men and women with New Zealand rugby legend Sonny Bill Williams among those paying tribute.\nAccording to his Facebook profile, he attended St Joan of Arc Catholic School in Rickmansworth, a few miles from Joshua’s hometown of Watford.\nWho is Sina Ghami?\nGhami was Joshua’s strength and conditioning coach, a role he held for more than a decade.\nHe was also the co-founder of Evolve Gym in London. Their website states Ghami was a qualified sports and exercise rehabilitator who specialises in musculoskeletal injuries and corrective exercise.\nGhami was at Joshua’s side throughout his career, including his crowning moment against Wladimir Klitschko at Wembley Stadium in 2017.\nHis last Instagram story appeared to be a shot of Joshua’s motorcade through Lagos.\nThe post also thanked the team of doctors and medical staff at the Lagoon Hospital Ikoyi ‘that attended to Anthony and those that sustained injuries.’\nMore Trending\nAyodele was a long-time friend of Joshua’s, serving as his personal trainer.\nGhami worked as Joshua’s strength and conditioning coach, another who has been part of ‘AJ’s team for several years.\n‘Rest in peace Latz and Sina. Your energy and loyalty among so many other great qualities will be deeply missed,’ Joshua’s promoter Eddie Hearn wrote on Wednesday.\n‘Praying for strength and guidance for all their family, friends and of course AJ during this very difficult time.’\nMORE: Anthony Joshua may not fight again after devastating car crash, Tyson Fury’s promoter fears\nMORE: Anthony Joshua says ‘I feel pain all over my body’ after car crash that killed two friends\nMORE: Nigerian president reveals Anthony Joshua message from hospital after fatal car crash",
  "word_count": 653,
  "scraped_at": "2026-02-14T13:24:18.361083"
}