{
  "article_id": "77701459b5b1",
  "url": "https://www.arsenal.com/news/every-word-jonas-pre-chelsea-press-conference",
  "title": "Every word of Jona pre - Chelsea press conference | Press conference | News",
  "date": "20231208T131500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jonas Eidevall held his pre-Chelsea press conference at London Colney on Friday morning.\nThe boss was asked all about the attendance for Sunday’s big London derby at Emirates Stadium, the test of facing Chelsea and more.\nHere’s what he had to say on the following subjects:\non winning the Manager of the Month award:\nIt’s not one of the things that I put the most focus on! But it’s of course a reflection of a really good month that we had and credit should go to the wider staff group and the players who have all done an incredible job, so it’s nice to get recognition for that but, in the end, it’s the collective trophies that we care about.\non if the players congratulate him for it:\nI don’t know actually! When you’re in our environment, of course we all need to individually contribute to the team’s goal, but the reason that we are here is to win things with Arsenal and that has to be our main focus for it and that’s what we should care about all the time. What does the team benefit from? That’s what we need to do.\non if Emma Hayes will have revenge on her mind because of the award:\nI don’t think she cares a dime about that! I think she’s the same as me and only cares about the team and the team’s results.\non having the third highest attendance for a football game in England this weekend:\nI think we have to push and make it a sellout. The atmosphere that has been created by supporter groups like The Red And White, Arsenal Women supporter clubs, that’s what drives us to go into this stage here. We’re 2,000-ish tickets short of this being a sellout. Let’s push, you don’t want to miss it.\non if he thought we’d be talking about sellout stadiums a few years back:\nThis is where it comes into saying you might have visions, dreams, goals for it but the reality is, when I came two and a half seasons ago and we were playing Chelsea at the Emirates with less than 10,000 people at the Emirates, now we’re talking about a sellout, that’s tremendous growth. It’s down to so many people doing great work and that’s of course the players. Those are the ones that drive the excitement of the league and the matches, but also off the pitch the club’s commercial, communication departments, the supporters, everything comes together and you need everyone in order to get this growth. It can’t be driven by a few, it has to be driven by many.\non what statement it would be to win and go level on points with Chelsea:\nAlways what you need to focus on in a football match is the performance. The performance will sort of equal into the result, but our full focus needs to be on the performance. It can never be on what it would mean to win or what it would not mean to win. Focus on playing good football, focus on playing well as a team, especially coming back from an international break with players being away, now we need to connect with each other to find our principles as well, so our focus needs to be on playing well and if we play well then we have a good chance of winning.\non if success from men’s and women’s teams rubs off on each other:\nI definitely think that when the dynamics are very positive in a football club, it’s important. It’s probably also very true that our wide supporter groups for both teams are rubbing off for both teams. Also, our management at the club drips down to both teams. I think there are so many positive things in and around the club that benefits both teams and that’s probably the main reason why both teams are able to be competing in the top spots for both prospective leagues.\non if it is a must not lose game against Chelsea:\nLike I said, our focus is on the performance and that’s what you can control. That’s always the case when you try to prepare the team and what we need to put our focus on, the things that we can control. The future, we don’t have 100 percent control over that. We don’t know what’s going to happen over the rest of the games coming after this game, but we can control our performance in this game here and will need to put 100 percent of our focus into it. Like I said, if we focus on playing as well as possible, that’s going to give us the best chance of winning.\non what other clubs could learn from us in terms of big attendances:\nI think that’s so hard because I don’t know the other clubs in and out like I know Arsenal, but like I said, I think there are many factors that come together with making us very successful, with selling so many tickets. It’s both the players on the pitch, the staff on the pitch, but it’s also the supporters and you need to have those three components in order to make it successful. Right now we have a really nice mix of that.\non how close we are to every club playing every game at their bigger stadiums:\nI think you would hope that that would be closer than I think it actually might be. I think there is a lot of logistics in moving all games in the league to bigger stadiums because you have many different factors in everything from permits on how many games you’re allowed to play in a stadium, but also how do you have pitch maintenance and so on in congested periods of games? So I think there are a lot of logistics that you don’t necessarily think about. Especially if we see in the future, it’s probably likely that we will have more than 12 teams in the WSL, I think not for next season but if we look a decade forward, I think that certainly has to be the direction. That means more games, it means then even more demands on the stadium that the games are going to be played on, so I think that requires some really smart people getting together and having a think about how that will be possible.\non Frida Maanum’s FSA Women’s Player of the Year award:\nIt’s great. Seeing Frida coming from the league in Sweden, developing into the player and the person that she is today, I think that has been really strong and impressive for her and I’m really happy to continue to see her progression with us.\non if he has a date in mind for when it might be a reality to play every game at Emirates Stadium:\nNo, but you can see the progression that the club has been doing with playing more and more league games at the Emirates Stadium every year. Hopefully that’s a progression that continues but, like I said, there are so many different factors going into, say, how many games that we can play in a stadium, so I think we have to review it on a season-by-season basis, but you can clearly see the club’s intent in the progress that we’ve been making.\non whether the dynamic of our rivalry will be different as it’s Emma Hayes’ last season at Chelsea:\nNo. It’s still two teams that want to win and even though something else is going to happen in the summer, we can do very little about the future and I have no idea about what’s going to happen in the summer in general. So, we have to be here and now, we have to play on Sunday and that’s where our focus needs to be.\non whether Chelsea have extra motivation because it’s Hayes’ last season:\nNo, because I think they have been highly motivated before that and we are highly motivated as well. I don’t think you can add any more.\non the latest team news:\nLina had to come back earlier from the Swedish camp after picking up an injury against Switzerland, but apart from that everyone is in and training today.\non what’s made Chelsea even stronger this season:\nThat’s always hard to say, but I think they have a really good dynamic on the pitch and they have really developed a way so that they can sustain attacks and they have many different ways that they can score goals. I think you saw a team that was maybe more dependent on a few individual players two and a half seasons ago, but now you see the number of various line-ups that they have been playing this season and they’ve still been able to have really high consistency and high levels in their performance. It shows that it’s more of a team thing rather than an individual player thing, which is a point where most teams want to go to and that’s a part about them that impresses me, but it doesn’t mean that they’re unbeatable, it just means that we need to be very good.\non Beth Mead having 11 goals involvements in games against Chelsea:\nI think both Beth and the rest of the team is really hungry. Of course, we look forward to this game and we really look forward to going out at the Emirates and playing in front of our all of our supporters. We want to make the most of the occasion and really try to show how good and well we can play as a team. We’re highly motivated.\non the importance of sticking to his key principles after some difficult results:\nI remember we had that conversation, it was back In Sweden, but the same is true now as it was then. That is the way to navigate your way through a stormy sea, it’s to be very clear on where you’re going and how you’re going to get there, so you don’t have to start thinking about that when the waves are smashing against the boat. I think with how you do that, it’s really important in those times to connect, both with staff but also with players. What happens is that people start to get your own ideas because everyone wants to solve it and no one wants to not be playing well or not having good results, but when people start to go off in different directions, that’s when it starts to harm the team’s performance, even if everyone is doing it with the best intentions. That’s why it’s so important to bring everyone together, to focus around the key principles and then I always think the art of coaching is to try and think what principle at this moment is going to give us the most impact because as a coach you need to choose that because that’s how you get trust from the group to say that if you’re able to pick that, now the next time you pick something the likelihood is that they’re going to think ‘oh this is going to benefit the team as well’, so I think that’s always the art of coaching, to see what principles we’re going to focus most on, but the process there is definitely the one that I believe in.\non which principle he picked:\nI can be open with that. We have four key principles which we always look at. When we have the ball, we look at our positioning. When we don’t have the ball, we look at whether we’re compact in the area that we want to be compact in. When we lose the ball, we try to make the pitch small. When we win the ball, we try to make the pitch big. It’s as easy as that and then we need to see which one of these now are we not doing well enough. I think we had a fair bit to do with our positioning but also compactness, so those two things were really important for us to address after the first games and working together as a team to make sure that we were compact in the right spaces, but also so that everyone was aware of how we’re positioned and why we’re positioned that way, and then we could get dynamic and interacting with the players so that it’s not the same players who have to fill the same positions all the time. We’ve started to play a little more fluid and dynamic in offence.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 2132,
  "scraped_at": "2026-02-14T12:22:13.761071"
}