{
  "article_id": "779f9545a323",
  "url": "https://mwnation.com/fam-to-buy-ai-equipment-establish-clinic/",
  "title": "FAM to buy AI equipment , establish clinic",
  "date": "20250914T070000Z",
  "domain": "mwnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FAM to buy AI equipment, establish clinic\nFootball Association of Malawi (FAM) says it will procure modern artificial intelligence (AI)-powered equipment for data and player performance analysis for all national teams and the Luwinga Inclusive Academy.\nThe association will also establish a medical clinic and sports science centre and will conduct medical capacity building for all national teams, TNM Super League teams and NBM Women’s Premiership teams.\nIn an interview yesterday, FAM president Fleetwood Haiya yesterday said these are some of the resolutions made during the association’s executive committee meeting in Mangochi last weekend as a critical issue to transforming the game of football in Malawi.\nHe said: “By personalising training and development plans, coaches will be better equipped to nurture talent and make informed tactical decisions. This technology also strengthens talent identification, builds a national football performance database and provides Malawi with a competitive edge.”\nAbove all, Haiya said the initiative aligns with FAM’s ‘Transforming the Game’ agenda by embracing technology and modernising football management and positioning teams for greater success on the continental and global stages.\nFootball analysts Parry Chinyama and Kelvin Moyo have lauded FAM for the resolutions, saying they are good developments to ensure rapid transformation of the game.\n“For instance, the AI equipment has a lot of benefits as it captures all data for each player, which will in turn assist the technical team to make informed decisions in time,” said Chinyama.\n“It will help to save time and energy on whether to drop or assist a player on how to change, approach and improve his tactics. AI saves a lot of time in data management and storage for future use in selection of players to the national team. Economically it is a cost-saving initiative.”\nMoyo said technical modernisation and science adoption in the game is the way to go.\n“The game of football has gone too scientific and most African countries have lagged behind compared to those from other continents. The adoption of these trends will help to significantly improve our teams’ performance at major football events,” he said.\nOther resolutions made at the FAM executive meeting, include the initiation of the Lilongwe head office and technical centre project with immediate effect, the recruitment of a technical director by September 30 this year and the establishment of a separate commercial entity, wholly owned by FAM, responsible for managing all the association’s commercial and business units.\nAccording to a statement from FAM which was posted on its Facebook page, the executive committee will also have an interface with member associations by November this year.\nOn competition and marketing matters, the executive committee has decided to enhance stadium security by among others appointing regional safety and security officers to coordinate and strengthen security for all local games, recruit a full-time safety and security officer and procuring at least 300 metal barriers for all local and international matches at Bingu National Stadium in Lilongwe.\n“All national teams must be accompanied by safety and security personnel when travelling for local and international assignments,” part of the statement reads.\n“All officials who participated in the recent FAM-organised CAF safety and security programme must also enroll in CAF and Fifa online courses.”\nOther resolutions are the completion of the Beach Soccer pitch in Lilongwe by end of October this year and the establishment of appropriate women’s football structures in the Eastern Region and the introduction of women’s football league in the region by 2026/2027 season.",
  "word_count": 575,
  "scraped_at": "2026-02-14T13:44:25.598424"
}