{
  "article_id": "77bde1a95a0d",
  "url": "https://www.justarsenal.com/some-miedema-magic-wins-arsenal-womens-dutch-international-wsl-january-goal-of-the-month/359689",
  "title": "Some Miedema Magic wins Arsenal Women Dutch international WSL January Goal of the Month",
  "date": "20240209T111500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal Women’s Vivianne Miedema, who has only recently returned to action for club and country, after suffering a devastating ACL injury in December 2022, has been awarded the Women’s Super League Goal of the Month for January.\nWhat a way to score your first goal back!@VivianneMiedema‘s strike against Liverpool is the #BarclaysWSL Goal of the Month! pic.twitter.com/01rzvXW4Wr\n— Barclays Women’s Super League (@BarclaysWSL) February 8, 2024\nMiedema suffered a horrible ACL injury in December 2022, only a few short weeks after her partner & teammate, Beth Mead, suffered the same fate. The pair missed a chance to play for their countries in the FIFA Women’s World Cup 2023, and their injuries left them on the sidelines of WSL football for almost a year.\nVivianne Miedema’s first goal, since returning to the public arena, has been awarded WSL Goal of the Month. The goal and this award marks the much-anticipated return of Vivianne Miedema. Viv’s first goal came against Liverpool in Arsenal’s 2-0 victory in January.\nMiedema is as ecstatic as every Gooner in the land, after getting that first goal back under her belt, telling SkySports:\n“It’s been really tough. I’ve had a few setbacks in my recovery and before today I’ve just not felt myself.\n“Something over Christmas shifted my mindset and I feel more myself again. I’m happy I’m playing and back at the point where I can help the team.\n“I’m so happy this goal flew in today and I can move on. Coming back, some players don’t overthink it but I did. I was a bit scared coming back. I put a lot of pressure on myself because I wanted to be old me again – or even better than old me even.\n“I’ve finally started enjoying training again and being back out there with the girls. I don’t think about my knees any more.”\nWell done Miedema – and her form can only get better! Other WSL teams better watch out!\nYour thoughts Gooners?\nMichelle Maxwell\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 362,
  "scraped_at": "2026-02-14T12:41:14.211270"
}