{
  "article_id": "77c1ff304dc3",
  "url": "https://www.npr.org/transcripts/1163815547",
  "title": "Memphis drag queen Bella DuBalle vows to fight Tennessee new law : NPR",
  "date": "20230316T211500Z",
  "domain": "npr.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Drag queen (and ordained minister) Bella DuBalle won't be silenced by new Tenn. law\nTERRY GROSS, HOST:\nThis is FRESH AIR. I am Terry Gross. Tennessee's new anti-drag law goes into effect April 1. My guest, Bella DuBalle, is a drag queen who's the show director and host at the largest drag club in Memphis, the Atomic Rose. She's also the creator of the club's drag competition. Bella is sounding the alarm about how this law could result in shutting down drag clubs and imprisoning many drag queens.\nThe law pertains to, quote, \"male or female impersonators who provide entertainment that appeals to a prurient interest,\" unquote, and puts those performances in the category of adult cabaret performance, the same category as topless dancers and strippers. It's an offense for a person to engage in an adult cabaret performance on public property or in a location where the performance could be viewed by a person who is not an adult.\nThe first offense for violating the new law is a misdemeanor with a fine of up to $2,500 and up to six months in jail. All subsequent violations would be felonies, punishable by up to six years in prison. At least 14 other states have proposed anti-drag bills. Bella has lived in Tennessee all her life, where she's been performing in drag for 10 years. She describes her drag persona as part Miss Piggy, part Dolly Parton, part Mr. Rogers.\nBella DuBalle, welcome to FRESH AIR.\nBELLA DUBALLE: Thank you so much for having me. It's really a pleasure.\nGROSS: I just want to get straight and have the audience understand what pronouns you prefer.\nDUBALLE: Sure. Out of drag, I use they/them, but in drag, I use she/her.\nGROSS: And what would you like me to use today?\nDUBALLE: Today let's just go ahead and use she/her since most people are accustomed to referring to me as Bella.\nGROSS: Very good. So the anti-drag law goes into effect April 1, which is really soon. What's it been like now in this intermediate period when the law has been signed but not in effect yet? What's it been like to perform at the club?\nDUBALLE: There's still a little bit of a weird limbo. You know, we're coming out of a time of a lot of fear, a lot of anger, a lot of confusion. But since the law has been signed and the cavalry has kind of shown up, I think we've become a lot bolder and a lot more sure that we are on the right side of history. So for us, the performance has become a little bit more about activism and putting our thoughts and our feelings out into our performances. And I think also it's - I don't know. It's become a time when everybody really wants to stand up and be an example.\nGROSS: I know your answer to this question is going to be everything, but what do the legislators and the governor of Tennessee not understand about drag? And like I said, I know the answer will be everything, but get more specific.\nDUBALLE: Well, the questions that I've had are about defining drag, you know? I've been doing drag for 10 years. And every time somebody asks me to define it, I think it gets a little harder to try and pin down. I cannot succinctly put into words what the entire art of drag is. And the fact that these legislators, who know far less about the art than I do and have never been to a drag show, are sitting out there making these laws - that's a little upsetting. For me, the idea that they think that every drag performer is doing something hypersexual or obscene obviously means they don't know very much about it. Also, there is extremely, extremely vague language in this bill, you know, in saying male and female impersonators.\nOne of my largest fears is that this bill will actually be misused to target trans people, gender nonconforming people or nonbinary folks. Right now in the GOP, you know, you have people like Michael Knowles at CPAC saying transgenderism must be eradicated from public life entirely. And if I am to accept that these people only look at transgenderism as an ideology, not real people, then it's very easy for me to believe that by extension, they could look at a trans person and say, that is a male impersonator; that is a female impersonator. And so my real fear is that a lot of this vague language is very, very intentional so that it could be misused to target people that the bill is not specifically written about.\nGROSS: I think it was the same day that the anti-drag bill was signed - there was an anti-trans bill that was signed by the governor of Tennessee.\nDUBALLE: Correct. Yes.\nGROSS: Describe that bill.\nDUBALLE: Yeah. SB 1 and SB 3 were signed the same day, and SB 1 will outlaw all gender-affirming health care for trans youth in the state. I believe that one goes into effect in June - it's either June or July - and they will be given until March of next year to work with their doctors to, quote, \"detransition.\" And for me to see both of these things signed in the same day, it's absolutely not a coincidence. This is a concentrated attack. It's meant to send a message, as with all these legislations, that they don't want queer people in Tennessee.\nGROSS: In the anti-drag law, it's an offense for a person to engage in an adult cabaret performance on public property or in a location where the adult cabaret performance could be viewed by a person who's not an adult. And since drag is now defined as adult cabaret, what does that mean for your club? Like, you have shows for whole families, including children, that are, you know, matinees. What won't you be able to do at your club?\nDUBALLE: Yeah, if the law stands as it is and is enforced the way that they would like it to be, then we would not be able to welcome people under the age of 18 into our all-ages brunch. If it stands that they will not allow any drag being classified as adult cabaret here in public, that means no drag performers in the Pride parade and festival. I - as a minister, I've been asked to marry couples in public in drag. I don't know if that would be legal anymore, if my religious freedom supersedes this law or if it would be infringed upon.\nAlso, again, just for myself as a nonbinary person who wears clothing that does not necessarily match the gender that I was assigned at birth, I am fearful that just all these people like me who are presenting authentically in their daily life, that someone's going to see me in Kroger in a dress and call the cops and say, this person's being obscene in front of my kids.\nGROSS: So you can't appear in public or walk around outside in drag. Do you often appear in public in drag? Do you promote your shows in public in drag?\nDUBALLE: Well, you know, I get ready here at home, and then, I go to the venue. So I'm worried the small amount of time that I'm walking from the parking garage to the venue - is that public? Our venue has large windows, and we're off of Beale Street. If there are people walking by with their kids and they glance through the windows, is that now being viewed by a minor despite the fact that they're looking through the windows into our private establishment? So for me, again, there's just some really, really vague terminology, and that's where most of my fear and confusion lies.\nGROSS: You know what I've been wondering? Would somebody who wants to punish a drag performer encourage their child to wait at the entrance of a drag club, for instance, and then report a person walking in there, you know? And the person might have had, like, no intention of being seen by a child, but a child was stationed outside the door or in the parking lot that you just described. And then, you'd have to face possible jail.\nDUBALLE: First time is a misdemeanor charge. The second would be a felony that carries up to six years in prison.\nGROSS: And even the first time, the misdemeanor, that's up to six months. That's a long time.\nDUBALLE: Yeah. Yeah.\nGROSS: Not as long as six years, but it's long enough.\nDUBALLE: That's it, yeah. Considering I've made it 43 years without a charge, yes, I would prefer to not to have to endure that just for doing my job or living my constitutionally protected expression.\nGROSS: Do you think I'm just being paranoid, thinking that a child might be intentionally stationed to report somebody in drag?\nDUBALLE: Absolutely not, no. I mean, given the fact that I've seen the network of the Proud Boys, you know, putting out their APBs on where you can find drag performances, especially ones that involve kids. And, you know, right now, Texas, looking at similar legislations, has proposed a bill that will basically instate drag bounty hunters, and they'll be offered $5,000 a person that they can turn in that they have proof of violating this law. So absolutely.\nGROSS: I didn't know that.\nDUBALLE: If someone thinks they could make a quick buck on it, yeah, you bet they'd station their kid outside and say, look what they...\nGROSS: That's like the abortion law where they're...\nDUBALLE: It is. It is turning people into mercenaries and bounty hunters.\nGROSS: So tell us more about what this law will mean to you personally as an individual trying to live your life.\nDUBALLE: I think, again, my biggest fear is that they're going to try and chill my constitutionally protected expression. And living here in Memphis in a blue pocket of this red state, I'm not as fearful. Our district attorney, Steve Mulroy, as soon as the law was signed, came out and said this law is unnecessary. It is unfair. It's going to chill free speech. This is not OK. And I personally believe that there's not a single show happening in my county that is in violation of this law. So he said that he had no real intent to enforce it. So that makes me feel a little safer.\nBut I grew up in a little bitty farm community in west Tennessee. And it's those smaller places where I do think that someone would literally just misuse this law to try and harm a trans person in their community that they don't like. I grew up close to Jackson. And in the last year, Jackson had one of its first public pride shows and they asked me to come and host that. We were originally set to do it in Conger Park, which is a public park space. And there was a lot of public backlash about putting a drag show in a public space that kids could see it, despite the fact that, of course, everything was on target to be family-friendly and appropriate for all ages. We ended up negotiating and moving the entire event indoors so that it would not be in a public place. And they continued to push, and we ended - they - the committee caved to them and raised the age to 18, you know, to be able to enter Pride at all. So it's those smaller communities where people are already vilifying queer people and trying to push us out that I'm afraid that they will really, really misuse this law because they may be under jurisdictions that are not as forgiving. You know, they may not have a district attorney who says the things that ours has said, and those people I'm worried for.\nGROSS: The message being sent in Jackson, apparently, is go ahead and express Pride, but just do it in the closet, please.\nDUBALLE: That's what this whole thing has been about. You know, for the longest time, the message that we've received is you can live your life, but just don't put it in our faces. You know, keep it in private. So for the most part, we were just, like, doing it in private, living peacefully. And now they've said, now we're going to take those spaces away from you, too. And we're going to make those safe spaces no longer safe for queer youth. So it's like, wait. How much more do you want? How much more are you going to take? We thought we were, you know, staying in our lane and being quiet over here.\nGROSS: So it's not only, like, your freedom to be yourself that's at stake. Your income is at stake because that's your job. That's your income.\nDUBALLE: That is my livelihood. And all these people who are like, well, you shouldn't have that as a job, you shouldn't be around kids, it's my supreme joy to tell them, well, if I have to quit doing drag, I'm going to go back to my old job - teaching.\nGROSS: (Laughter) You're going to love that.\nDUBALLE: So if you don't want me around your kids, I've got really bad news for you.\n(LAUGHTER)\nGROSS: What did you teach?\nDUBALLE: Theater. Yeah, I'm a founding member of the Tennessee Shakespeare Company. And it was through Shakespeare that I first came to drag.\nGROSS: Yeah, because men - like, women weren't allowed to...\nDUBALLE: Exactly.\nGROSS: ...Perform in Shakespeare's era, so men did women's clothes in drag.\nDUBALLE: So I got paid really good money by the National Endowment for the Arts and the state of Tennessee to go into all these schools and play drag roles in front of their students.\nGROSS: (Laughter).\nDUBALLE: It was OK then, but it's not OK now.\nGROSS: My guest is Bella DuBalle, a drag queen who's the director and host at the largest drag club in Memphis. Tennessee's anti-drag law goes into effect April 1. We'll be right back. This is FRESH AIR.\n(SOUNDBITE OF MUSIC)\nGROSS: This is FRESH AIR. Let's get back to my interview with Bella DuBalle, a drag queen who's the director and host at the largest drag club in Memphis. Tennessee's anti-drag law goes into effect April 1.\nThere's a video of you introducing the show to one of the - I think it's one of the family shows. You asked, like, who's in the audience for whom this is the first time you've been to a drag show? And then you explain what to expect. So what do you tell those audiences?\nDUBALLE: Usually, if they've never been to a drag show, I consider my role as the host to prime them for what they're going to see and help guide them through what's going on. So normally, I just tell people that I'm going to introduce the entertainers, tell them a little bit about what each person is going to present, and then they come out and perform. If you like what they're doing, you scream. You cheer. You - yes - because we're in a live space, so it's not like TV, and we can see and hear you. The noise will really get them working. But if you want to see my dolls work, you have to give them some money.\nGROSS: Tips. Yeah.\nDUBALLE: And my tagline on that is always - because it takes a lot of money to look this cheap. I do it full time. I can give it to you on good authority.\nGROSS: You also do readings for children. Do you do them at the club or at the library?\nDUBALLE: I have gone to the library, and I've actually been invited to several of our area churches here to lead Drag Queen Storytime for their congregations.\nGROSS: So what gets the biggest reaction from the children?\nDUBALLE: I think most kids are so taken with the aesthetic. You know, if they're young enough, most of them just think I'm a Disney princess. And, you know, people ask sometimes, they're like, but how do you explain drag to kids? And I'm like, you don't have to. They're the originators of drag. Kids came up with playing dress-up. They understand it way better than the rest of us. Some of us just never quit playing.\nGROSS: What's your understanding of why so many people think it's really hilarious and perfectly acceptable for a straight man to dress in women's clothes for a laugh in a variety show or, you know, any kind of sketch comedy, whereas it's really dangerous for a queer person to dress in drag?\nDUBALLE: Isn't it interesting how that standard exists? It's totally fine as long as the person identifies as straight. And I think you actually hit the nail on the head with what you - with how you phrased that. When a straight person does it, it's a joke. I put on this dress because it is to take on femininity, which is less than my masculinity. So don't we laugh at that? Look at how sissy-fied (ph) I am.\nWhen I put on a dress, it is a statement of strength. It is a statement of how powerful my femininity is. So for me, I think it's about the way that we approach the feminine. You know, the patriarchy has always, you know, used drag as another way to reinforce that women are weaker. I think we as the queer community actually champion that pride or, you know, that femininity. We're very proud of something that other people are deeply ashamed of.\nGROSS: A photo has surfaced from Governor Bill Lee's 1977 high school yearbook with him dressed in drag. And I think it was at, like, a football event of some sort.\nDUBALLE: Yes, a powderpuff football game. So here in the South, we have these old fundraisers that have been going on for decades. And one of them is powderpuff football, where the boys dress as cheerleaders and the girls dress as football players. My school - we had the womanless beauty review, which is where all of the older brothers and fathers would dress up and put on a beauty pageant. So this is very, very old-style Southern entertainment. You may have seen the clip when The Tennessee Holler put it forth to him, and he said, quote, \"That's ridiculous, that you would conflate something like that to sexual entertainment in front of children.\" And I completely agree. They're not the same thing. But he does not agree that he signed a law that makes no such distinction. The law does not draw any distinctions between a school fundraiser or theater or opera, ballet, wrestling, cosplay, people dressing up for Halloween. It's so vague. And that was the real hypocrisy. It was not that he'd been in a dress. It was that he didn't realize that what he was doing was just as innocent as what I do.\nGROSS: Now, you mentioned opera. There's a long tradition in opera of young women performing the role of a boy in an opera. It's called a pants role. And I suppose...\nDUBALLE: This is very Shakespearean, too.\nGROSS: Yeah. And I suppose that has something to do with a boy's vocal range or perhaps the - you know, they're going through puberty, and their voice is changing. I'm not exactly sure of the history behind that, but can you not do that in opera anymore in Tennessee?\nDUBALLE: Right. That's the question. You know, I've seen theater companies that are changing their seasons because they are afraid that one of the pieces that they've chosen to produce will be in violation of this law, despite the fact that we know if you're doing \"Mrs. Doubtfire,\" there's nothing in there that's inappropriate for kids. You know, \"Hairspray\"...\nGROSS: Yeah.\nDUBALLE: ...Classically, there is a role that is drag. You know, this is very deeply entrenched in the arts. So for me, I need every theater company in Tennessee to change its season and produce more drag role shows. You know, like, this is the time to stand up and say, please show me what we're doing wrong. I've put the question to the governor multiple times. Can you show me a single instance of a child being harmed or abused at a drag show?\nGROSS: You're calling for resistance. What are some of the actions that are being planned in protest against Tennessee's anti-drag law?\nDUBALLE: There will, of course, be marches, rallies and things like that. But I think a lot of the protests that we will be doing is active protest. So, for instance, we're continuing all our shows. I will continue to welcome families into our all-ages brunch. I will march in the Pride parade. So a lot of it that I'm urging Tennesseans to do is active resistance. I think these legislations are aimed at trying to diminish or erase us, trying to get us to sit down and be quiet. And I think the best response to that is to get louder and to be more in your face, to be bolder, and to let them understand that we're not a threat to society. We're a part of it. We belong here, too. I've called this state my home for 43 years, and there are a lot of queer people in Tennessee, and I think that we deserve a fair shake of our state too.\nGROSS: My guest is Bella DuBalle, a drag queen who's the director and host at the largest drag club in Memphis. We'll talk more after a break. And Maureen Corrigan will review the 40th anniversary edition of Nora Ephron's novel \"Heartburn,\" and she'll review a new comic novel. I'm Terry Gross, and this is FRESH AIR.\n(SOUNDBITE OF SONG, \"9 TO 5\")\nDOLLY PARTON: (Singing) Working 9 to 5, what a way to make a living, barely getting by. It's all taking and no giving. They just use your mind.\nGROSS: This is FRESH AIR. I'm Terry Gross. Let's get back to my interview with Bella DuBalle, a drag queen who's the director and host at the largest drag club in Memphis, the Atomic Rose. Tennessee's anti-drag law goes into effect April 1. Bella is calling on queens to resist this law, which could result in shutting down drag clubs and imprisoning many drag queens.\nI think there's something called the Brick Ball being planned, a drag show to commemorate the 54th anniversary of Stonewall. Are you one of the people planning that?\nDUBALLE: Yes. Yeah. That's my show. So our Saturday night...\nGROSS: Oh, that's your show?\nDUBALLE: Yeah.\nGROSS: Oh, OK.\nDUBALLE: Our Saturday night show will be the Brick Ball. And the following Sunday, the next day, April 2, will be the Brick Brunch. But we're going to take that weekend and talk a little bit about Stonewall, remind some folks that may not know our history of how we got to where we are and how we won the rights that we have.\nGROSS: Talk about the influence of and the inspiration of Stonewall, which was the uprising in 1969 after police raided a gay bar in Greenwich Village called the Stonewall Inn and hauled out the patrons, employees. And people from the neighborhood came over, and they resisted. You know, the police were being rough. At least one person was really roughed up. And so, you know, people started fighting back, throwing things at the police. The confrontation went on for several days. And it kind of galvanized the gay rights movement.\nDUBALLE: It did. It ignited - the whole movement for liberation began there at Stonewall. And I have a good friend who used the analogy, you can chain up a dog. And you can kick that dog every day. And it will allow that behavior for a certain amount of time. And then one day, that dog is going to lash back and attack you. And we as queer people, we're not eager to fight, you know? I don't think those people at Stonewall were looking for a fight. But they were pushed to the wall. They were left in a place of desperation.\nAnd there was nothing - they felt they had nothing to lose, so of course they fought back. So a lot of times, what I do in my calls to action and speeches is to remind people that it wasn't very long ago that we had to stand up and fight for our liberation. And that fight never ended. We are still in the next phase of that battle. And we have to be ready to stand up and defend our liberties again, if necessary, because if we don't, people will eagerly take them away from us.\nGROSS: One of your rallying cries right now is vote.\nDUBALLE: Yes.\nGROSS: Run for office. Run for office.\nDUBALLE: Yes.\nGROSS: That was not the rallying cry of Stonewall. What's changed?\nDUBALLE: Well, I think that we have a chance of actually getting elected now. You know, before Harvey Milk, I think it was almost a laughable idea that an openly queer person could run for office and be elected. Now we see a much larger, diverse representation in legislature. That being said, you're right. We do need to vote. We do need to run. Ten percent of queer Tennesseans voted in the last election.\nGROSS: What does that say to you?\nDUBALLE: (Laughter) To me, it probably says more about apathy, you know? It's hard to vote election after election after election and watch your vote be a tiny drop in this giant bucket of red. And I think it's easy to be disenfranchised and to feel like maybe that system doesn't work for us. Unfortunately, that complacency is what leads to these officials running unopposed and winning their seats on a very small amount of voters.\nGROSS: Oh, there are a lot of politicians who run unopposed in Tennessee?\nDUBALLE: Far too many.\nGROSS: Are you thinking of running for office?\nDUBALLE: I've been asked. And I never really considered myself a political person. But if that is the way in which I can best affect change or help lead my community, then I will do that. But I really - I don't know if I could trade the wig and heels for a suit and tie (laughter).\nGROSS: Well, if you wear a wig and heels at one of your own political rallies, you can spend time in jail.\nDUBALLE: Correct, you know, or at least that is the threat that the law makes.\nGROSS: Right. Right.\nDUBALLE: Which is, to me, another terrifying point. We look back at Stonewall. That rebellion was led by drag entertainers of color and trans people of color. Most of our marches, our rallies and our protests, many are organized and lots led by drag entertainers and trans folks. So if we can't be there in public at the protests without being arrested, then the protests don't happen. For me, it's just another attempt to get us to not have leaders, to be quiet. If you get that second charge, you get that felony charge, there goes your right to vote. I think a whole lot of this legislation is aimed at taking queer rights away of the people that choose to stay in this state.\nGROSS: I hadn't thought of the right to vote. I mean, like I said, one of your rallying cries is vote and run for office. But if you were arrested for dressing in drag in public or protesting in public in drag and you spend time in jail, if it's a felony offense, which the second time would be - the first time, it's just a misdemeanor - then you can't vote or run for office.\nDUBALLE: Right. And I don't think that's an accident.\nGROSS: Are there divisions between the drag community and the trans community, whose, you know, motivation for dressing in gender nonconforming ways are maybe a little different? I'm not sure exactly what the split is, if there is one.\nDUBALLE: Yeah, we have several drag entertainers who identify as trans in their daily life. Many of them, like me, drag was a part of their gender journey. But some of them still continue to perform because it is their artistic voice and their creative outlet. So there is an overlap. And I'm very disconcerted when I see the growing movement of people wanting to separate the LGB from the TQIA+. And we wouldn't have any rights if it weren't for the trans people that started our liberation movement. We wouldn't have any rights if it weren't for these people. So now to see so many cis, white gays say, hey, we got the right to marry and lay their armor down like the battle is over, and be so eager to leave their trans siblings behind, I don't understand it. To me, it will take our entire community, united and fighting together, to be able to overcome this insurmountable wave of hate that is coming at us. And so to see anyone who is eager to further divide our already divided community, I just don't understand it. I don't understand it.\nGROSS: My guest is Bella DuBalle, a drag queen who's the director and host at the largest drag club in Memphis. Tennessee's anti-drag law goes into effect April 1. We'll be right back. This is FRESH AIR.\n(SOUNDBITE OF MUSIC)\nGROSS: This is FRESH AIR. Let's get back to my interview with Bella DuBalle, a drag queen who's the director and host at the largest drag club in Memphis, the Atomic Rose.\nAll right. Let's talk a little bit more about you. You've described your drag persona, Bella DuBalle, as part Miss Piggy, part Dolly Parton and part Mister Rogers. So describe where each of them figure in.\nDUBALLE: So Miss Piggy, I think, is the big costumes, the - I am a movie star. Every room I walk into the story is about me. For Dolly, you know, like, that's the full fantasy of drag. For Dolly Parton, it's big flashy costumes and the fact that you can continue to be a genuine and sweet Southern person and still be successful. I - and then for me, Mister Rogers is probably the most important. And that's about just recognizing each person's humanity.\nGROSS: How did you start dressing in drag?\nDUBALLE: So I began through Shakespeare. And I was playing a couple of roles for the Tennessee Shakespeare Company in drag. And around the same time, I had a costume designer friend who was working on Condomonium (ph), which is a fundraiser that we do here for CHOICES Reproductive Health Center. And in Condomonium, the designers are charged to create outrageous outfits out of condoms. So this designer had this idea. And she came to me and said, I want you to be my model, but I want you to do it in full drag. And I was very into the idea. I had watched a little of \"RuPaul's Drag Race,\" and I wanted to try it. And the sensation of being able to put my femininity to the forefront on display and it be so well received and lauded was something I'd never experienced. So it was a bug that bit, and I could not turn back.\nGROSS: When did you start identifying with drag?\nDUBALLE: I mean, very shortly after those first couple of encounters, I started doing drag on my own. I started painting - accruing wigs and costumes, performing any place I could locally. And it pretty quickly became much more than just theater for me. I was identifying as an actor and also a drag queen. They're very, very similar. You know, she is just a role that I've created. It's another character. She's just a little closer to my heart. But for me, the identification with drag became so strong because drag helped me work out my own gender identity. You know, growing up, having to suppress all the stuff that was feminine, I had never allowed any of that stuff to be a big part of my life. And finally getting to put on all of this femininity and feel good about it was so affirming and lifesaving to me that I was like, oh, drag is powerful. This is really something.\nSo I started to question. I was like, am I trans? Do I - am I a woman? Do I want to be a woman? And the more that I did drag, I was like, no, it's not that. You love these parts of yourself, but that's not how you feel. And then when I turned and looked back down the road the other direction to that box labeled man, I was like, uh-oh, that's not it, either. I - there's so much of that that doesn't work for me and it doesn't fit. And so I sat down right there in the middle of the road and said, I'm not going to do either of those. They don't fit. They don't work. So I'm going to forge my own path. And for me, drag was the thing that helped me to understand and identify that.\nGROSS: You've been doing - well, I've seen at least one video of you dressed in gender-neutral clothes. You know, you're definitely not in drag. Was that a big decision to do a video out of drag?\nDUBALLE: Yeah. I think most of my presentation, people are accustomed to seeing through the lens of Bella. And that one - if it's the video that I'm thinking of, which was the one that I shot the night that the legislation was signed into law...\nGROSS: That's it. Yeah. That's the one.\nDUBALLE: I was trying to decide, do I need to paint? Do I need to get up in drag and film a video and say something? And the more that I thought about what I needed to hear in that moment, I needed a Mr. Rogers moment. I needed somebody to tell me that it was OK for me to be afraid and that it was OK for me to be sad. And I wanted to be able to come to people who were hurting or scared or feeling my feelings as vulnerably and openly and honestly as I could. And for me, when I lay down the mantle of drag, I feel far more vulnerable. And so I thought maybe we just have a human moment right now, and we don't worry about this invincible goddess that I portray. And we just remind folks that there's a soft-hearted human being underneath all of that.\nGROSS: Are you concerned about possibly becoming a target?\nDUBALLE: I have, since going viral, received threats of violence and death threats and stuff. That's a new one on me. But I look at that as a very feeble attempt to scare me into being quiet. And I have been confronting bullies since I was about 5 years old. So this is nothing new to me. And I will not cow to intimidation. And I won't be silenced.\nGROSS: Well, I hope that you remain safe. Do you ever feel like the people who bullied you when you were a kid in school are similar to the people who are making these laws now, and do you see that as a form of bullying?\nDUBALLE: Absolutely. Yeah. Yeah. People fear what they don't understand.\nGROSS: Legal bullying.\nDUBALLE: It is. It is legal bullying. That's exactly what RuPaul said. RuPaul said there are a bunch of bullies making these laws. And it is true. I think it causes a lot of big feelings when you see someone love in themselves something that you hate in yourself. And to me, that is - that's a big cause of why we're seeing these sort of legislations passed.\nGROSS: You're a minister, and you've officiated at wedding ceremonies while dressed in drag. When did you become a minister? And what was your motivation for doing it?\nDUBALLE: I was actually a missionary Baptist minister before I came out. And when I came out as queer, my church kicked me out. And I was devastated at the loss of what I thought was going to be a very supportive and loving family. And I spent several years in a fallout from faith. And as I reconciled my identity and my relationship to the divine, I realized that even though I did not believe within those strictures that I had been taught, I did not feel that my call to serve my community was disingenuous. I very much still believe that I'm supposed to be here to help people. Like, queer people need their ceremonies. They need their guidance. And so I found a more affirming faith and got reordained so that I could continue to serve my community in the ways that I felt compelled.\nGROSS: So when you were young and felt like you weren't fitting into the categories of male or female, feminine or masculine, but you were somewheres, you know, in between parts of both, something different, but you didn't have the language to express what you were feeling, what was it like being in church during those years before they knew and threw you out?\nDUBALLE: Yeah. It's really difficult to be in a congregation that tells you that this thing that you are is not only sinful and wrong, but it's a choice that you're making. You know, it's a choice that I made to feel the way I feel. And if I just had enough faith and prayed hard enough, then God would fix it, and I would wake up one day and be like everyone else. And all that did was serve to further alienate me.\nI did not have queer representation in my family or my actual physical life. I didn't have it on TV. I didn't see it in media. And so I thought I was the only one. The closest thing that I ever found to identify with was Gonzo on the Muppets because when he would go to the restroom - they had a restroom for men, a restroom for women, and then one labeled whatever, and that's where Gonzo would go. And whenever they would ask, you know, what - hey, so Kermit is a frog, and Miss Piggy is a pig. What is Gonzo? And the answer is always, he's a weirdo.\nAnd there was something so deeply affirming about this whatever weirdo that didn't fit in any of the other categories. And all of - all the people around Gonzo still loved and affirmed them just as they are. And so there was this tiny shred of hope outside of the boundary of language. I didn't know what it was that I was identifying with, but I identified with it.\nGROSS: Bella, it's really been wonderful to talk with you. I wish you safety and, you know, good luck.\nDUBALLE: Thank you. I really appreciate it. It is an honor and a privilege. The pleasure has been all mine.\nGROSS: Bella DuBalle is a drag queen who's the director and host at the largest drag club in Memphis, the Atomic Rose. Tennessee's anti-drag law goes into effect April 1.\nA new 40th anniversary edition of Nora Ephron's novel \"Heartburn\" has just been published. After we take a short break, book critic Maureen Corrigan will have an appreciation and a review of a new comic novel. This is FRESH AIR.\n(SOUNDBITE OF DIGABLE PLANETS SONG, \"REBIRTH OF SLICK (COOL LIKE DAT)\")\nCopyright © 2023 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.",
  "word_count": 6759,
  "scraped_at": "2026-02-14T11:59:23.336109"
}