{
  "article_id": "77c5ec2cd1c5",
  "url": "https://www.90min.com/posts/bethany-england-admits-world-cup-dreams-motivated-chelsea-exit",
  "title": "Bethany England admits World Cup dreams motivated Chelsea exit",
  "date": "20230621T143000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Bethany England admits World Cup dreams motivated Chelsea exit\nBy Emily Keogh\nBethany England has revealed she took the big risk of leaving Chelsea, joining struggling Tottenham during the January transfer window, in the hope of getting the regular game time that would earn her a place at the 2023 Women's World Cup.\nHaving scored 12 goals in 12 WSL games to steer her new club away from relegation danger in the second half of the campaign, England was included in Sarina Wiegman's final 23-player squad for the World Cup trip Down Under, ending a 10-month absence from the Lionesses setup.\nA mutually beneficial decision, her £250,000 switch setting a new record for a transfer between two WSL clubs gave England the chance to re-establish herself as one of the best strikers in the country and was hands down one of the best WSL transfers of the 2022/23 season.\n\"I think the situation I was in, I wasn't getting used,\" England said of her time at Chelsea. \"I was stuck on a bench, and as Sarina said, rightly, I wasn't getting picked because I wasn't playing the minutes.\n\"I think it was up to me to make sure that I was not only getting the minutes but making those minutes count, and I think I did that at Spurs, and I can't take them enough for giving me the opportunity to go out and play.\"\nPreviously FWA Footballer of the Year with Chelsea as recently as 2019/20, England's diminished role saw her miss out on a huge Wembley friendly against the United States, as well as the Arnold Clark Cup and Women's Finalissma this past season. But she now suggests those omissions did her good.\n\"I had to look at myself and just say, look, what can I do to make sure I'm in the best possible place? Physically, mentally, I think the break [from international football] probably gives you that extra drive, not that I was complacent,\" the player explained.\n\"Like I say, I did everything I could and thankfully the risk paid off and I'm getting the rewards for it, so I'm really excited to go out there in the summer and do what we can.\"\nAlthough her struggle for consistent club minutes had begun prior to 2022/23 due to the incredible form of Sam Kerr in front of her at Chelsea, England was called up for Euro 2022 last summer. However, she surprisingly remained an unused substitute for the entire tournament.\nBefore leaving for Spurs, England had made 164 apperances for Chelsea, scoring 74 goals and capturing 10 trophies, making her one of Emma Hayes's most successful players. But things changed dramatically once Kerr found her feet a few months after her 2020 arrival.\n\"You can only control what you can control all I could do was go to Spurs, make sure that I worked hard, trained hard, and put the performances in on a game day and I think I very much did that,\" England explained\nREAD THE LATEST LIONESSES NEWS HERE\nShe added the move across London happened 'pretty much overnight', while the speed of it also meant no input from Wiegman with regard to the impact on her international prospects.\n\"I think ultimately it's my career, and I had to take it into my hands and make sure that I put myself in the best position because I'm not getting any younger,\" she said.\n\"I think it was just first and foremost, I want to be back on the pitch, back playing minutes and scoring and doing what I do best then. I'm glad I did that, and thankfully I'm here today. I just did everything I could, controlled what I could and it paid off.\n\"I did not want to be sat in a position where I didn't try and give my everything to go [to the World Cup] because I could have stayed at Chelsea, could have stayed on the bench in my comfort zone. But then I'd have been watching other people going out there to Australia when I know that it's something that I would've regretted looking back on.\n\"Even if it didn't pay off and I didn't come [to England camp], I could have at least looked at myself in the mirror knowing I did everything I could to put myself on that plane.\"\nWith the hypotheticals now in the past, earning herself that all-important selection, England's focus now turns to the tournament where the Lionesses face Haiti, Denmark and China in Group D.\nHowever entering the tournament as one of the favourites to win as reigning European Champions carries its own burden and the pressure is an added factor that England has to take into account.\n\"I think obviously there's gonna be a lot of pressure on us,\" she said. \"There's expectations, but as the girls have been saying in the group, pressure is a privilege, and I think anything can happen in tournament football, and we'll go out there and certainly give it all.\"",
  "word_count": 837,
  "scraped_at": "2026-02-14T13:08:04.874364"
}