{
  "article_id": "77dde48b8d34",
  "url": "https://www.gtfm.co.uk/27226-2/",
  "title": "Local Football Player Signs for Chelsea – GTFM",
  "date": "20250205T193000Z",
  "domain": "gtfm.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Local Football Player Signs for Chelsea\nWritten by Gavin on 5th February 2025\nVera Jones, the 17-year granddaughter of Roger, a former Pontypridd RFC rugby player and committee man, will continue her remarkable career with the Women’s Football Academy at Stamford Bridge.\nRadyr born midfield player Vera has enjoyed outstanding success which has included playing for the Wales Under 15 Girls team in which she was also made captain while also representing Wales against Serbia and Chile and also against England Under 15 and 16 teams.\nIn February 2023 came an incredible step in Vera’s football venture when she represented the England Lionesses Under 16 side which toured Portugal.\nFollowing the tour to Portugal Vera’s status as an England Young Lionesses player was made official.\nIn 2024 Vera was part of the Young Lionesses team which competed in a tournament in Spain and also was in the team that played in the EUFA Cup in Sweden.\nIn October Vera was in the Young Lionesses side which competed in the FIFA World Cup in Santiago in the Dominican Republic.\nRoger, who is an integral part of the Pontypridd Men’s Shed Woodfellas project in Trallwn, said:\n”Vera recently joined training sessions with the Chelsea WSL (Women’s Super League) squad in Portugal.”\nThe Women’s Super League (WSL) is the highest level of women’s football in England, run by the Football Association and featuring twelve professional teams.\n“Considering everything it was quite a major honour for Vera to train with the WSL squad.”\nRoger said that Vera will now decide whether she stays in the Chelsea Women’s Academy for a while before perhaps joining one of Under 21 teams that’s in the League for her to get game time.\n“It has been an incredible football journey for Vera and her footballing future looks very promising.\n“We are all very proud of her.”",
  "word_count": 308,
  "scraped_at": "2026-02-14T13:05:54.878889"
}