{
  "article_id": "77edc7d10f77",
  "url": "https://okcfox.com/news/entertainment/what-to-watch-in-theaters-and-at-home-this-weekend-march-29-31-2024-godzilla-kong-wilder-ennio-netflix-prime-hulu-disney",
  "title": "What to watch in theaters and at home this weekend March 29 - 31 , 2024",
  "date": "20240329T224500Z",
  "domain": "okcfox.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "What to watch in theaters and at home this weekend March 29-31, 2024\nSALT LAKE CITY (KUTV) — I can’t tell you how incredibly sad it made me that Warner Bros. didn’t screen “Godzilla x Kong: The New Empire” for local critics. Apparently, major-market critics didn’t think much of the film. I haven’t read them. I just hate not getting invited to the giant monster party. The old Godzilla films played a big role in my love for film. I am, however, more reasonable than Bill Maher about it. I’ll save my outrage for things that matter. Maybe I’ll see “The New Empire” this weekend or next week. Maybe I won’t. Life moves fast and there’s so little time for playing catch up.\nPerhaps I can steer your attention towards “Ennio” and “Remembering Gene Wilder.” Ennio Morricone is one of the greatest composers to walk the modern world. Morricone is to westerns what John Williams is to summer blockbusters. Gene Wilder is much more than Willy Wonka, but even if he wasn’t he’d still be worth celebrating.\nMost of your options come from streaming services. I’ll probably give Hulu’s “We Were the Lucky Ones” a chance. I hope it isn’t saccharine. I like Joey King. I’ll certainly watch “A Gentleman in Moscow.” Hopefully, I’ll watch Caitlin Clark and some Aaron Judge while I do some spring cleaning. That would be borderline productive.\nBe good to each other.\nGodzilla x Kong: The New Empire (Theaters)\nStudio Synopsis:The epic battle continues! Legendary Pictures’ cinematic Monsterverse follows up the explosive showdown of “Godzilla vs. Kong” with an all-new adventure that pits the almighty Kong and the fearsome Godzilla against a colossal undiscovered threat hidden within our world, challenging their very existence—and our own. “Godzilla x Kong: The New Empire” delves further into the histories of these Titans and their origins, as well as the mysteries of Skull Island and beyond, while uncovering the mythic battle that helped forge these extraordinary beings and tied them to humankind forever.\nRemembering Gene Wilder (Theaters)\nStudio Synopsis:This loving tribute to Gene Wilder celebrates his life and legacy as the comic genius behind an extraordinary string of film roles, from his first collaboration with Mel Brooks in The Producers, to the enigmatic title role in the original Willy Wonka and the Chocolate Factory, to his inspired on-screen partnership with Richard Pryor in movies like Silver Streak. It is illustrated by a bevy of touching and hilarious clips and outtakes, never-before-seen home movies, narration from Wilder’s audiobook memoir, and interviews with a roster of brilliant friends and collaborators like Mel Brooks, Alan Alda, and Carol Kane. Remembering Gene Wilder shines a light on an essential performer, writer, director, and all-around mensch.\nEnnio (Theaters)\nStudio Synopsis:A portrait of one of the most popular and prolific film composers of the twentieth century, ENNIO celebrates the life and legacy of Ennio Morricone, featuring never-before-seen archival footage and interviews with renowned filmmakers and musicians including Hans Zimmer, John Williams, Quentin Tarantino and Clint Eastwood.\nLimbo (Theaters)\nStudio Synopsis:In a small Australian outback town Travis Hurley, a detective, arrives to review a 20-year-old unsolved homicide of a young Indigenous girl. Travis discovers a collection of unpleasant truths, highlighting the intricacies of loss and injustice faced by Indigenous Australians.\nThe McBee Dynasty: Real American Cowboys (Peacock Original)\nStudio Synopsis: The McBee Dynasty: Real American Cowboys, a thrilling new docuseries, takes viewers behind the scenes of the high-stakes world of farming and ranching in rural Missouri. McBee Farm and Cattle is on the brink of becoming a billion-dollar business... or a financial disaster. It all depends on the decision from a venture capital firm of over $100 million. Steve McBee, the patriarch of the family and recent divorcee, started McBee Farm and Cattle, but his lifestyle may be its undoing. While Steve is in a rocky romantic relationship with McBee's CFO, Galyna, he continues sleeping with other women, which creates tension with his eldest son and McBee's CEO, Steven Jr. With the farm on the line, Steve’s three sons, Steven Jr., Jesse, and Cole all vie to take over the farm when he retires, causing conflict within the family. Will the farm survive? If it does, who will be leading it into the future?\nNo Pressure (Netflix)\nStudio Synopsis:Oliwia, a Polish chef, lives a single life in a big city. One day she receives a message about her granny’s death in Podlasie. Once she arrives, it turns out the whole thing was a trap to bring her back and convince her to help rescue Granny’s farm business. She must learn to manage an animal farmstead and produce local cheese for the upcoming village carnival. Unexpectedly she receives a helping hand from a local farmer Kuba who, as it turns out later, hides a secret.\nWe Were the Lucky Ones (Hulu)\nStudio Synopsis: Georgia Hunter’s New York Times bestselling novel, We Were the Lucky Ones, tells the incredible true story of a Jewish family separated at the start of World War II. In this Hulu Original limited series adaptation of the book, Joey King and Logan Lerman recount one of the darkest moments in human history to highlight the power of love, hope, and the human spirit.\nAmerican Rust: Broken Justice - Season 2 (Prime)\nStudio Synopsis: Four months after the shoot-out in West Virginia, Del has returned to Pittsburgh P.D. while the folks in Buell try to get their lives back on track. Del and his new work partner Angela, are assigned a high-profile bombing case that proves to be quite complex. Del finds himself back in the folds of The Brotherhood and he struggles to find the balance between his life in Pittsburgh and his life/ relationship with Grace back in Buell. Billy accepts a settlement for his injuries from his time in prison and he decides to try to move forward with his life. Billy uses the money from the settlement to buy Grace the property they lived on. Grace uses this land to give herself new economic/ work opportunities. Meanwhile, Billy and Lee try to figure out their relationship with each other as they navigate their own futures. Lee has taken a job working as a paralegal at a law firm in Pittsburgh. Billy decides to move in with Isaac and Lee and Isaac helps Billy get back into shape. Isaac has decided to make a life for himself in Buell and is working for Landwill Energy. Isaac has fully embraced his sexuality and pursued new romantic situations. Virgil is still up to his old ways but finds a way to get money from Grace so he can pursue a new business opportunity. Steve Park has taken over for Del as the Chief of Police in Buell and is determined to take Del down and prove his connection to the crimes that happened in West Virginia. The town of Buell is rocked by more murders that create chaos in the lives of all of its residents.\nThe Believers (Netflix)\nStudio Synopsis:A team of young and ambitious entrepreneurs who have been unlucky with their own startups seek other opportunities to build up their business on rebranding one unrecognized Buddhist temple.\nThe Baxters (Prime)\nStudio Synopsis: Based on the worldwide best-selling book series by Karen Kingsbury, The Baxters is a riveting family drama that follows Elizabeth and John Baxter and their five adult children. Season One of The Baxters centers on Elizabeth and John’s daughter, Kari, who learns the shocking truth that her professor husband, Tim, has been secretly having an affair with one of his college students. As her relationship is tested, Kari must seek comfort in her faith and family to discover if love is truly a choice and if her marriage can be redeemed. In this deeply moving faith-based journey, The Baxters must come together as a family to work through the challenges of life.\nTestament: The Story of Moses (Netflix)\nStudio Synopsis:Testament: The Story of Moses is an epic three-episode series exploring the life of Moses and his rise from outcast and murderer to prophet and liberator of the Hebrews. From the banks of the Nile to Mount Sinai to the Red Sea, Testament seamlessly interweaves gripping docudrama and expert interviews, revealing Moses’ intensely personal quest for redemption—setting in motion some of the most inspiring and iconic events in the Bible, Qur’an and Torah.\nThe Settlers (MUBI)\nStudio Synopsis: A highlight of last year’s Cannes where it won the FIPRESCI Prize, this March MUBI presents the exclusive streaming premiere of Felipe Galvez’s incendiary debut, The Settlers. Blending historical specificity with vivid visual style, this revisionist Western follows three horsemen as they embark on an expedition across the Tierra del Fuego archipelago at the behest of a wealthy landowner, tasked with securing his vast state-appointed property, whose true goal is to murderously “remove” the indigenous population. Featuring breathtaking imagery, Galvez slowly unravels a previously unknown piece of Chilean history whose impact is still felt to this day. A MUBI release.\nThe Beautiful Game (Netflix)\nStudio Synopsis: Mal (Bill Nighy, Living, About Time) is the manager of England’s homeless football team, taking his players to Rome with the hope of being crowned champions of the Homeless World Cup, a global street soccer tournament. At the last minute, he decides to bring with them a talented striker Vinny (Micheal Ward, Empire of Light, The Book of Clarence), who could give them a real chance at winning, but only if he’s ready to let go of his past and become part of the team.\nA Gentleman in Moscow (Paramount+)\nStudio Synopsis: An adaptation of Amor Towles’ internationally best-selling novel, A Gentleman in Moscow follows Count Alexander Rostov who, in the aftermath of the Russian Revolution, is sentenced to house arrest in the opulent Hotel Metropol.\nMadu (Disney+)\nStudio Synopsis: “Madu” follows 12-year-old Anthony Madu as he leaves his family and community in Nigeria to study at one of the most prestigious ballet schools in the world in England. Having never left his home outside of Lagos, Anthony finds himself thrust into a new world where his wildest dreams are suddenly within reach. His courageous journey is a story of extraordinary obstacles as he searches for belonging and acceptance, a family far away, and unexpected challenges that could impact his future. Forming a rich and immersive tapestry told on multiple continents, MADU introduces the world to a boy chasing a dream of inspiration that will resonate with us all.\nRest In Peace (Netflix)\nStudio Synopsis:A family man, cornered by debt, decides to take advantage of a coincidence and an unpredictable circumstance to disappear. After many years of living away from his country under a false identity, a chance discovery provides the irresistible temptation of wanting to know how the people of his town have moved on in his absence. The question becomes an obsession: Can an entire life disappear and be forgotten? Can you start from scratch and never look back?\nRenegade Nell (Disney+)\nStudio Synopsis: Nell Jackson, a quick-witted and courageous young woman, finds herself framed for murder and unexpectedly becomes the most notorious outlaw in 18th-century England. But when a magical spirit called Billy Blind appears, Nell realizes her destiny is bigger than she ever imagined. “Renegade Nell” stars Louisa Harland (Derry Girls) in the leading role of “Nell Jackson” with Frank Dillane as “Charles Devereux”, Alice Kremelberg as “Sofia Wilmot”, Ényì Okoronkwo as “Rasselas”, Jake Dunn as “Thomas Blancheford”, Bo Bragason as “Roxy Trotter”, Florence Keen as “George Trotter”, with Nick Mohammed as “Billy Blind”, Joely Richardson as “Lady Eularia Moggerhangar” and Adrian Lester as “Robert Hennessey, Earl of Poynton”. Pip Torrens as “Lord Blancheford” and Craig Parkinson as “Sam Trotter” also star.\nWages of Fear (Netflix)\nStudio Synopsis: In the middle of the desert, near a refugee camp, an oil well catches fire, directly threatening the lives of the population. Dispatching experts to the site, the company operating the well realizes that it has only one solution to avert the catastrophe: detonate the oil well with nitroglycerin within 24 hours. Against a large sum of money, a powerhouse team is then sent 800 km away to transport 200 kg of explosives in two trucks.\nThe team now has less than 20 hours to reach the oil well. 20 hours to traverse hostile zones controlled by armed rebels, cross minefields, and drive two trucks loaded with nitroglycerin over rough terrain! The race against the clock has begun...\nBeyond The Aggressives: 25 Years Later (Paramount+)\nStudio Synopsis: Picking up two decades after the groundbreaking film ‘The Aggressives’ showcased the remarkable stories of Chin, Octavio, Trevon and Kisha, the four protagonists are back, interwoven with fresh voices from the wider BIPOC community, to continue challenging normative ideas about gender while reflecting on their trailblazing past and envisioning new futures.\nIs It Cake? - Season 3 (Netflix)\nStudio Synopsis:The hit series returns with bigger cakes, higher stakes, and wilder bakes! This season, watch as a new batch of bakers push the boundaries of culinary craftsmanship, creating hyper-realistic cakes to trick and deceive their way to the ultimate cash prize. Once again, you’ll find yourself asking the question - is it real? Or Is It Cake?",
  "word_count": 2199,
  "scraped_at": "2026-02-14T12:31:31.370563"
}