{
  "article_id": "785b3a17c9ab",
  "url": "https://keepingitheel.com/posts/hey-santa-here-s-my-2023-wish-list-for-north-carolina-tar-heels-athletics",
  "title": "Hey Santa , here my 2023 wish list for North Carolina Tar Heels Athletics",
  "date": "20231224T144500Z",
  "domain": "keepingitheel.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "While spending some quality time with my family, we just happened to run into the man with a few white whiskers wearing a red hat.\nNo, it wasn't an NC State fan (thankfully), it was the one and only Santa Claus.\nLike Buddy the Elf, I shouted \"Santa!\"\n\"Nick Delahanty,\" Santa said with a big smile on his face, followed by a belly shake. \"How about them North Carolina Tar Heels!\"\nI replied, \"big win over Oklahoma this past week!\"\nSanta agreed and proceeded to ask, \"are you ready for the Duke's Mayo Bowl?!\"\nI couldn't help but put my head down and say, \"let's not talk about football.\"\nSanta understood, admitting that \"we've always been a basketball school anyway.\" I asked Santa if there was anything he could do for us to change that, and his reply was simple: \"Have faith in good ole Mack Brown; he knows what he's doing.\"\nThe conversation began to focus on basketball, of course, as both teams are off to pretty solid starts this season.\n\"Santa, Courtney Banghart and the UNC women's basketball program have faced a very tough non-conference schedule, I think coach deserves a nice little present this year.\"\n\"Oh, Courtney is always on the good list! How about a commitment from five-star Sarah Strong?\"\n\"Perfect! Speaking of big-time recruits...\"\n\"Don't worry Nick, I have tons of UNC basketball gear heading to James Brown, Ian Jackson and Drake Powell!\"\n\"You're always ahead, Santa!\"\n\"Now, I could use your help with ideas for this certain someone...\"\n\"Who would that be?\"\n\"Erin Matson.\"\n\"I could see how that is a tough one. What about a trophy case for all of her national championships?!\"\n\"Brilliant! I'll leave some extra room for more additions in the near future- I see plenty of more success in her future now as a coach!\"\n\"That's what we LOVE to hear!\"\nSanta proceeded to ask if I had any requests for this holiday season. Of course, I asked for him to send some holiday joy to the loved ones of the late Eric Montross, as this holiday season will be tough for not only his family but the entire North Carolina Tar Heels community.\nI want Armando Bacot to finish out his UNC basketball career on a high note (a national championship would be fitting!). Current Chicago Bulls guard Coby White has to continue his hot shooting streak (and maybe an All-Star appearance, if that's not too much to ask!). We also want to see Drake Maye land in a great spot when his name gets called in the upcoming NFL Draft.\nKobe Paysour's health was also a topic of discussion, as I told Santa how he couldn't catch a break this season. We also discussed the return of Megan Smith Lyon to lead the UNC softball program, as the hope is that many runs will be scored this season by the team in Carolina Blue.\nOh, and would it be too much to ask for RJ Davis, Deja Kelly AND Alyssa Ustby to come back for one more year?\n\"Well Nick, the wish list is rather long this year! Is there anything you have on your list?\"\nHonestly, Santa, I'm just happy that I get the opportunity to write about the North Carolina Tar Heels on a daily basis. I love being able to talk about the Tar Heels with fellow die-hard fans.\nSanta smiled from ear to ear, and before you knew it, he left faster than someone who entered the transfer portal as he went on his merry way.\nUntil next year, Merry Christmas and Happy Holidays!",
  "word_count": 601,
  "scraped_at": "2026-02-14T13:10:11.484253"
}