{
  "article_id": "7898a5f2fe2b",
  "url": "https://www.dailypress.com/2025/05/07/norfolk-states-angie-nicholson-named-meac-softball-coach-of-the-year/",
  "title": "Norfolk State Angie Nicholson named MEAC Softball Coach of the Year – Daily Press",
  "date": "20250508T051500Z",
  "domain": "dailypress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "COLLEGE SOFTBALL\nNorfolk State’s Angie Nicholson has been named the MEAC Coach of the Year after guiding the Spartans to their best single-season turnaround in Division I program history.\nNSU went 21-21 overall and 14-7 in the MEAC in the regular season and is the No. 2 seed in the MEAC Tournament in Nicholson’s first year at the helm. The Spartans went 4-43 last season.\nSix NSU players earned all-conference honors. First baseman Maya Johnson, third baseman Kira Turner, shortstop Qween Edmonds, outfielder Kailey Bryant and relief pitcher Brierra Tyler each made the second team, and pitcher Amaya McPherson made the third team.\nSouth Carolina State infielder Taylor Ames-Alexander is the Player of the Year.\nVT’s McMillan is ACC Player of Year\nVirginia Tech outfielder Cori McMillan has been named the ACC Player of the Year, and she was one of seven Hokies to earn all-conference honors.\nMcMillan, a senior from Greensboro, North Carolina, leads the country with 29 homers and hit .454 with 59 RBIs in the regular season.\nHokies infielder Michelle Chatfield joined McMillan on the All-ACC first team. Catcher Kylie Aldridge made the second team, while pitcher Emma Lemley, utility player Jordan Lynch, pitcher/utility player Emma Mazzarone and catcher Zoe Yaeger are on the third team. Lynch also made the all-freshman team.\nUVA had three all-conference players in pitcher Eden Bigham and infielders Jade Hylton and Macee Eaton. Bigham and Hylton made the first team, while Eaton is on the second team.\nUVA prevails in ACC tourney opener\nKelly Ayer hit a walk-off RBI double in the bottom of the seventh inning to lead No. 7 seed Virginia to a 3-2 victory over No. 10 seed Louisville on the first day of the single-elimination ACC championship tourney Wednesday in Brighton, Massachusetts.\nThe Cavaliers (37-16) will face No. 2 seed Clemson in a quarterfinal at 5 p.m. Thursday.\nWOMEN’S COLLEGE GOLF\nUVA secures spot in NCAA finals\nNo. 11 Virginia tied for third at the Charlottesville Regional on Wednesday to clinch a spot in the NCAA Championships for the fourth straight season.\nMegan Propeck shot an even-par 71 to finish tied for fourth individually and lead the Cavaliers.\nNo. 4 South Carolina won the regional at 2-under 850, while No. 16 Ole Miss was second at 9-over 861 and No. 21 Florida tied with UVA at 6-over 290. UCLA placed fifth for the final qualifying spot.\nCOLLEGE FOOTBALL\nOklahoma State QB heads to VT\nFormer Oklahoma State quarterback Garret Rangel announced on X that he has committed to Virginia Tech out of the transfer portal.\nThe former four-star prospect saw action in 13 games for the Cowboys and passed for 1,075 yards, eight touchdowns and seven interceptions in three seasons.\n- Old Dominion announced the signing of three football players Wednesday: safety Kollin Collier, cornerback Zach Hobson and offensive lineman Logan Cox. Also, punter/kicker Josh Hamel announced on X that he has committed to the Monarchs. Collier spent time at TCU and Hutchinson Community College. Hobson played for UNC Pembroke last season. Cox was at Kansas State, but redshirted last season.\nLACROSSE\nTwo UVA players headed to PLL\nTwo University of Virginia lacrosse players were selections in the Premier Lacrosse League draft Tuesday.\nLong-stick midfielder Ben Wayer went to the Philadelphia Waterdogs with the No. 23 overall pick in the third round.\nMidfielder Griffin Schutz was the 31st overall pick of the California Redwoods in the fourth round.\n- Virginia Wesleyan women’s lacrosse player Reese Morgenthaler, a midfielder, has been named to the All-Old Dominion Athletic Conference second team.\nBriefly\n- Six Christopher Newport baseball players have earned Coast-To-Coast Athletic Conference all-league honors. Outfielder Jake Benedict, designated hitter Doc Daniels, first baseman Aaron Maxie and shortstop Josh Reinhold made the first team, while infielder Justin Liakos and outfielder Ayden Stuffel earned honorable mention.",
  "word_count": 635,
  "scraped_at": "2026-02-14T13:20:57.248656"
}