{
  "article_id": "789fb6a58c8c",
  "url": "https://www.bbc.co.uk/sport/football/articles/cly2wv9e5plo",
  "title": "Lucy Bronze: Chelsea full-back named England Women's Player of the Year after Euros heroics",
  "date": "2025-10-23T16:09:21.603Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "Bronze wins England award after Euros heroics\n- Published\nLucy Bronze says she puts her \"heart and soul\" into every game after being named England Women's Player of the Year for 2024-25.\nFans chose the Chelsea full-back in a year that ended with the Lionesses winning Euro 2025 in Switzerland.\n\"I wasn't expecting it but it's always nice to get recognition, especially from England fans,\" said Bronze, 33.\n\"I adore playing for England and I have put my heart and soul into every game over the last 12 years. In that respect, it's a huge honour and especially after such a crazy year with the Euros. I'm very proud.\"\nBronze made 16 appearance for England in 2024-25, 15 of them starts, and started all six matches at the Euros.\nWith her side 2-0 down in the quarter-final against Sweden, it was her 79th-minute header that sparked the comeback that led to a penalty shootout. Bronze, with her thigh strapped up, then blasted home the winning spot-kick.\nAfter playing 106 minutes of the final win over Spain - also settled by a penalty shootout following a 1-1 draw - Bronze revealed she had played at the tournament with a fractured leg.\nShe has 140 caps since making her senior debut in 2013, placing her joint-fourth on the all-time appearance list alongside Alex Scott.\nA two-time European champion, Bronze has played in 36 games across seven major tournaments, more than any other Lionesses player in history.\n\"For me, 2015 was a real starting point as an England player - 2019, I feel like that's when I was hitting my peak as an individual, but this year has been something that I couldn't have imagined,\" she added.\n\"The way we won the Euros, the noise around it and women's football in general this year has been out of this world.\"\nArsenal forward Chloe Kelly, scorer of England's winning penalty against Spain, and Chelsea goalkeeper Hannah Hampton - player of the match in the final - were voted second and third respectively.\nDespite making just two appearances for Chelsea this season because of injury, Bronze has been included in the England squad for friendlies against Brazil (25 October, 17:30 BST) and Australia (28 October, 19:00 BST).\nHow did Bronze play Euro 2025 with fractured tibia?\n- Published28 July 2025\nLego, lash lifts and Reggie the dog - inside England's Euro 2025 success\n- Published28 July 2025\nLionesses defy odds to create English football history\n- Published27 July 2025",
  "word_count": 414,
  "scraped_at": "2026-02-14T11:17:47.019162"
}