{
  "article_id": "789f4a50fe70",
  "url": "https://www.theguardian.com/world/2025/mar/18/tuesday-briefing-first-edition-gaza-strikes",
  "title": "Tuesday briefing : At least 330 dead in major Israeli airstrikes that break fragile peace",
  "date": "20250318T093000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. Just before 2.30am local time, Israel launched airstrikes on dozens of targets across Gaza. War planes hit sites across the territory, from Gaza City in the north to Khan Younis in the south. At least 330 people have been reported dead so far, Gaza’s health ministry said, and Benjamin Netanyahu’s office appeared to suggest that the two-month-old ceasefire is now over: “Israel will, from now on, act against Hamas with increasing military strength,” it said.\nYou can follow the latest here at the Guardian’s live blog. Today’s newsletter explains what’s happened overnight, and why. Here are the headlines.\nFive big stories\n-\nUK politics | Keir Starmer will unveil drastic cuts to disability benefits on Tuesday, despite deep opposition from Labour MPs and poverty campaigners, and warnings from economists against making kneejerk savings to hit fiscal targets. The changes are expected to affect some of the UK’s most severely disabled people.\n-\nUK news | Lucy Letby has called for the public inquiry into her crimes to be halted, arguing there is now “overwhelming and compelling” evidence undermining her baby murder convictions. Lawyers for the former nurse took the extraordinary step of writing to Lady Justice Thirlwall on Monday to say that the inquiry – due to end on Wednesday – should be suspended immediately.\n-\nSpace | Two Nasa astronauts “stranded” aboard the International Space Station (ISS) since last summer were finally on their way back to Earth on a SpaceX vessel on Tuesday, more than nine months after the failure of Boeing’s pioneering Starliner capsule scuppered their originally scheduled week-long mission.\n-\nFinance | The hedge fund manager Crispin Odey will be banned from the City and hit with a £1.8m fine by the UK’s financial watchdog for deliberately attempting to “frustrate” a disciplinary process into sexual harassment allegations.\n-\nSecond world war | The last surviving Battle of Britain pilot, John “Paddy” Hemingway, has died aged 105. The Royal Air Force (RAF) said Hemingway, a member of “the Few” who took to the skies during the second world war, died peacefully on Monday.\nIn depth: ‘They unleashed the fire of hell again on Gaza’\nSince the first phase of the ceasefire in Gaza expired in early February, many Palestinians have been braced for a return to war at any time. Instead of moving on to a planned second phase, Israel cut off aid shipments into the territory and pressed Hamas to accept a plan that would extend the first phase and bring the release of more hostages, a move Hamas was unwilling to take without steps towards the complete withdrawal of Israeli troops.\nTwo days ago, talks in Doha failed again to reach an agreement. One key question now is whether the airstrikes unleashed overnight herald a full-scale return to hostilities, with Israeli ground troops operating in Gaza again and Hamas responding, or are an attempt by Benjamin Netanyahu to force Hamas to accept Israel’s terms – but the very hostile language from Israel suggests that the latter is now unlikely.\nHere’s what else we know.\nWhat kind of damage has been done?\nThe first explosions were heard in north-west Gaza, as many ate their pre-dawn meals during the holy month of Ramadan. The airstrikes hit Gaza City in the north, Deir al-Balah in the centre, and Khan Younis and Rafah in the south. Israel said that it had hit “terror targets belonging to the Hamas terrorist organisation”.\nWitnesses and photographs taken at Gaza’s hospitals suggested that many civilians, including children, were among the dead, with piles of bodies stacked up under white plastic sheets. AFP quoted Ramez Alammarin, 25, who described carrying children to a hospital near Gaza City. “They unleashed the fire of hell again on Gaza,” he said. “Bodies and limbs are on the ground, and the wounded cannot find any doctor to treat them. They bombed a building in the area and there are still martyrs and wounded under the rubble … fear and terror. Death is better than life.”\nThe European hospital in Rafah said that 17 members of one family, including 12 women and children, were killed there. Mahmoud Abu Wafah, Gaza’s deputy interior minister and the highest-ranking Hamas security official in the territory, was reported to be among the dead.\nThe toll, recently reported at 330, is likely to rise, since it does not include all those taken to smaller health centres or those yet to be found by rescuers.\nIs the ceasefire over?\nBy one very clear measure, yes: while Israel has carried out some drone strikes against suspected militants in recent weeks, the overnight airstrikes are on an entirely different scale.\nThe statement from Benjamin Netanyahu’s office referring to plans to act with “increasing military strength” also appears to point in a clear direction. And the White House, which was consulted before the new attack, said: “Hamas could have released hostages to extend the ceasefire but instead chose refusal and war.”\nHamas, meanwhile, accused Israel of treachery for overturning the ceasefire, and said that Netanyahu is using the war as a “lifeboat” to ensure his own political survival amid domestic crises. But it has not yet said specifically that it is resuming the war. One official, Taher Nunu, said: “The international community faces a moral test: either it allows the return of the crimes committed by the occupation army or it enforces a commitment to ending the aggression and war against innocent people in Gaza.”\nThere is also a question about whether the airstrikes are a prequel to a return of Israeli ground forces. The Associated Press quoted one Israeli official who said that there was a plan to expand the operation beyond air attacks.\nWhat does the attack mean for the hostages?\nFewer than half of the 59 hostages left in Gaza are thought to still be alive. Some of those released so far have urged the Israeli government to press ahead with the ceasefire to ensure the return of those still being held in Gaza.\nThe Hostages and Missing Families Forum, the main group representing families of the captives, this morning accused the government of backing out of the ceasefire, saying it “chose to give up on the hostages”.\n“We are shocked, angry and terrified by the deliberate dismantling of the process to return our loved ones from the terrible captivity of Hamas,” it said in a statement.\nThe issue was expected to surface again today and tomorrow during demonstrations planned in response to the news that Netanyahu wants to fire Ronen Bar, the head of the internal security agency Shin Bet. Bar was a key player in negotiations to free the remaining hostages until he was replaced in that role last month, and one opposition leader in Israel, Yair Golan, this morning accused Netanyahu of ordering the renewed attacks to deflect attention from Bar’s planned removal.\nNetanyahu has sought to blame Hamas’ refusal to release the remaining hostages without moving to a second phase for the resumption of strikes in Gaza; Donald Trump recently said that unless Hamas immediately released all remaining hostages, “not a single Hamas member will be safe”. He also appeared to threaten civilians in Gaza.\nBut Hamas has been reluctant to give up its sole remaining source of leverage without a move to the second phase of talks. It said last week that it was ready to release American-Israeli soldier Edan Alexander and the bodies of four others, but US Middle East envoy Steve Witkoff rejected that offer and said that Hamas had privately made unrealistic demands.\nNow Hamas is threatening the last living hostages in captivity, saying: “Netanyahu’s decision to resume war is a decision to sacrifice the occupation’s prisoners and impose a death sentence on them.” If that happens, there would appear to be very little hope of an end to the war before Israel is satisfied that Hamas has been completely eliminated – and before many more Palestinian civilians are killed.\nWhat else we’ve been reading\n-\nChief reporter Daniel Boffey and photographer Sean Smith took a train journey from London to Lviv to ask how Trump’s new world order has changed Europe. The resulting piece is fascinating, and a reminder of how different the pressures are in each country – even in a time of unifying crisis. Archie\n-\nIsrael’s devastation of Gaza has resulted in the estimated destruction of more than two-thirds of its heritage, cultural, and archaeological sites. Malak A Tantesh and Jason Burke speak with those advocating for the protection and future restoration of these historically and culturally invaluable landmarks. Nimo\n-\n“With its killer combination of artistic virtuosity, startling performances and gut-punch power, Adolescence is a howl of despair and a call to action,” writes Michael Hogan on the new Netflix four-part drama that has become a hit in large part because it is “old-fashioned, issue-led, socially conscious television”. Nimo\n-\nAs part of a series on how coronavirus changed the UK five years after the first lockdown, Esther Addley, Matthew Pearce and Pamela Duncan have a great piece on the most fundamental shift of all: how we think. From trust in politics and conspiracism to social atomisation, they lay out an urgent debate on whether we have been transformed – or headed more quickly down a familiar path. Archie\n-\nFor almost a decade, misinformation has been one of the most heavily discussed problems that modern society faces – but are we tackling the right problem? Adam Kucharski makes a compelling case that the real challenge isn’t just debunking falsehoods, but sharpening our critical thinking and interpretation of information. Nimo\nSport\nFootball | Kieran Trippier has stressed that Newcastle’s Carabao Cup win will not distract the team from their overriding ambition this season of achieving Champions League qualification. Howe’s team are sixth, two points behind fourth-placed Chelsea with a game in hand – although fifth is likely to be enough to seal qualification.\nGolf | Rory McIlroy of Northern Ireland won a three-hole aggregate playoff against JJ Spaun to capture his second title at the Players Championship on Monday morning. McIlroy took a one-shot lead when he birdied the par-five 16th hole, and the task of protecting that advantage became much easier when Spaun hit his tee shot over the famed island green at the par-three 17th and into the water.\nRugby | The Premiership is to trial away sections for supporters in an effort to improve atmospheres in top‑flight fixtures. The trial will take place at Saracens’ fixture against Gloucester on 19 April and Leicester’s match against Harlequins on 26 April.\nThe front pages\n“D-day for benefit cuts as Starmer faces growing tide of opposition” says the Guardian while the Mirror pleads “Don’t punish the needy” and the i has “Disability benefit cuts: Reeves still scrambling to win over Cabinet”. The Times has “Checks on sick benefit claimants to increase” and the Express finds its way in with “£40bn tax raid ‘disaster’ is killing growth”. “£17bn needed just to fix the roads” is the Metro’s splash. “Kemi – net zero by 2050 impossible” – we are on first-name terms in the Daily Mail but the Telegraph keeps it professional with “Badenoch – net zero by 2050 is impossible”. Top story in the Financial Times is “Odey to be banned from City roles and fined £1.8mn”.\nToday in Focus\nInside the UK’s first drug consumption room\nLibby Brooks reports from the Thistle, a new Glasgow clinic that offers somewhere for people to use drugs in a safer, hygienic environment\nCartoon of the day | Ben Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nOn the shores of Lake Geneva, swimmers young and old dive into crystal-clear waters – a luxury few cities can offer. René Rottenberg, 75, embraces the chill year-round, finding joy in the beauty of his surroundings. Thanks to Switzerland’s commitment to clean water, this scene is the norm. Decades ago, its rivers were among Europe’s most polluted, but a national effort transformed them into some of the cleanest.\nA typhoid outbreak in 1963 sparked change, leading to rigorous wastewater treatment laws. Now, Switzerland leads the world in filtering micropollutants, ensuring pristine waterways for future generations. Beyond health, these waters foster community – friends sharing laughter, lunches, and a love for nature. As Britain’s rivers face dire pollution, Switzerland’s success is a hopeful reminder that change is possible. “We are united by a love of water,” says Pascal Baudin, a member of Le Givrés swimming club.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2121,
  "scraped_at": "2026-02-14T12:34:55.498034"
}