{
  "article_id": "78a9f4d46dea",
  "url": "https://thepeoplesperson.com/2025/01/20/manchester-united-keen-on-shock-loan-deal-for-out-of-favour-man-city-star-chloe-kelly-289815/",
  "title": "Manchester United keen on  shock  loan deal for out - of - favour Man City star Chloe Kelly - Man United News And Transfer News",
  "date": "20250121T011500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United are reportedly interested in completing a loan deal for Manchester City and England forward Chloe Kelly.\nThe Telegraph reports that United are lining up a “shock” move for Kelly, who has fallen out of favour at City under Gareth Taylor.\nShe was not available to Taylor for selection during United’s 4-2 derby win over City on Sunday.\nElla Toone grabbed a sensational hat-trick to help United ease past their arch-rivals and leapfrog them in the WSL rankings. Leah Galton also got on the score sheet.\nKelly has started just one WSL game this season and is largely expected to part ways with City in the summer once her contract runs out.\nBefore derby kick-off, Taylor told reporters that Kelly was left out of the matchday squad with an ankle injury. The City boss remarked, “Chloe trained last night and came out of the session just after a warm-up with an ankle problem so wasn’t available to be selected for tonight.”\nWhen asked about United’s interest in the 27-year-old, Taylor responded, “All of that stuff is news to me, so no comment.”\nHowever, The Telegraph note that Kelly was indeed fit for Sunday’s match and was in fact dropped.\nThe newspaper further notes, “Kelly and City reached an impasse over new contract talks last year and it is understood her relationship with manager Taylor has become fractured over the last 12 months.”\nCity are also on the brink of signing Brazilian forward Kerolin and are pursuing German international Jule Brand. If these two deals get over the line, Kelly would be pushed further down the pecking order.\nKelly is believed to be keen on joining United, partly because she knows regular football is needed in a bid to guarantee her place in the England squad ahead of Euro 2025.\nMarc Skinner’s side are back in action on Wednesday when they take on City in the quarter-final of the Women’s League Cup.\nFeatured image Carl Recine via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 334,
  "scraped_at": "2026-02-14T13:32:09.005036"
}