{
  "article_id": "78cf5a02c5a3",
  "url": "https://www.twtd.co.uk/ipswich-town-news/37997/lambert-marcus-will-do-what-he-wants-to-do-i-don%e2%80%99t-sit-and-worry/onthisday",
  "title": "Lambert : Marcus Will Do What He Wants to Do , I Dont Sit and Worry - Ipswich Town News",
  "date": "20230306T171500Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Friday, 6th Mar 2020 12:26\nTown boss Paul Lambert spoke about speculation regarding his future, the aftermath of Tuesday’s defeat to Fleetwood, social media and terrace abuse towards players and the Blues current situation at this morning’s press conference.\nAsked how things have been around the club since Tuesday’s defeat to Fleetwood and the atmosphere at the game, Lambert said: “Listen, as I said to you, even when I win, we never get too high, and we never get too low, and I think that’s really important, the way you handle defeats and the way you handle runs.\n“It’s the same with a winning streak, you never get too high, and you never get too low. The lads have been fine, they’re obviously disappointed with the run, but they’ve got a chance to rectify it. The great thing about football is you’ve always got a chance to rectify it.”\nAnd personally, it can’t have been easy. “My inner strength is really strong, really, really strong, and I never do anything that’s going to benefit myself, I try to benefit the team and the football club.\n“If anybody knows my career over the last 15/20 years of football, there weren’t many things that phased me. Playing in front of 100,000 that gave me abuse, playing in front of everything, I played in front of the biggest derbies in the world where you get abused for an incredible 90 minutes on the pitch and off the pitch.\n“I’ve had everything, but I don’t get involved with anything, my inner strength is my mind, that’s your strength. And as I said before, if you’re going to beat me, then you really need to put me down.”\nHe says he has spoken to owner Marcus Evans since Tuesday’s match: “He’s fine. Obviously, he isn’t happy either, and nobody is happy with the situation, everybody suffers with the situation.\n“The abuse Marcus gets isn’t nice. As I said before if Marcus comes one day, then where does the club go, that’s what I’d love to know, where does it go. What happens?\nQuizzed on whether Evans had given him assurances regarding his job, he responded: “The vote of confidence? I never go into it, I never worry about. What’s going to happen is going to happen, I’ve said that before, what happens happens, it’s not something I actually worry about.\n“You lose your job, and it happens, it’s not nice. You keep it, great, you carry on. But Marcus has been really good, and as I said before, the club needs a bit of help, without a doubt.\n“He knows that, everybody knows that it needs a bit of help. We tried to bring in people in January, we tried to buy people and we couldn’t do it, but that’s the way the club is, and that’s the situation of the club. There’s no magic formula that’s going to jump out of the woodwork.”\nAsked whether it hurts when people, in this instance Neil Warnock, are linked with your job, he said: “I don’t worry about it. I don’t get involved in it. Link with all you want, it’s fine, I don’t have a problem.”\nDoes he still see himself at Town for the long-term? “You hope you do. I’ve been involved with clubs before where people say you’re going to stay, you’re going to stay and the next thing you’re away. So, football for me is no problem.”\nThe job at Town isn’t an impossible one, one where even the likes of Pep Guardiola or Jurgen Klopp might fail? “Listen, those guys are brilliant, obviously what they are and where they are.\n“I think Pep came out and said it, and he said the other week there if you have great players the game becomes a bit easier. If he went to another team where he couldn’t really work or invest, he would struggle.\n“He said that himself and that’s the great manager I think in the world, I think, along with Jurgen at the minute.\n“Without the resources, without the infrastructure and the finance to back it becomes very difficult, you ask any manager that, you’ve got to have the tools to do it.\n“But this club is different because it’s a big club and people portray it as a big club, but if you look at it over the piece it doesn’t really buy anybody, it doesn’t really get that level that the club should [be].”\nDoes that suggest it’s going to be a big summer at Town? “If it fails and doesn’t go up then you have to look at other things. The guys need a bit of help, the guys give you everything, but they need a little bit of help.”\nMight fans might have to accept that it could take years to rebuild and get back to the Championship? “Nobody knows because you want to try and get out at the first time of asking. I go back to it, Sheffield United five years in it, Leeds United, Sheffield Wednesday, Nottingham Forest have been in it for a few years.\n“Sunderland for example, look at them guys up there. Unbelievable set-up, terrific club, this is the second year it’s been in here, it just shows you it’s not easy, and you have to earn a right.\n“And nobody knows whether you go first time, second time or third time. Sheffield United were in the league for five years and all of a sudden they’re sitting fifth or sixth in the Premier League. It’s an incredible rise. If you had a crystal ball, it would be great.”\nIs it possible for a club to go up too soon? “It can never be too soon. I’d rather have that problem than not have that problem. You’d rather go up, whether you’re ready to stay up, nobody knows.\n“It’s the same as if you go from the Championship to the Premier League, can people say it’s too soon and then you come back down again? The difference there is you come back down with about £100 million in your pocket, and then you reinvest again. This football club I’ve got no doubt needs a bit of help.”\nLooking at Saturday’s match and an atmosphere which has the potential to become as fractious as Tuesday’s, Lambert was asked if he speaks to his players specifically about preparing for that.\n“Yes, but you’re hoping it doesn’t,” he said. “You’re hoping the guys and women come, there are some kids that come to the game, and they hear the language, it’s not nice to hear.\n\"I saw the lad Eric Dier the other day going into the stands. Eric Dier did what Eric Cantona did 25 years ago and as I think what Jose Mourinho said is it wasn’t right what happened, but that kid must have heard something that wasn’t nice.\n\"In an article I read this morning, we’re creating a culture of hate towards people, it’s not good for the sport. Tennis I don’t hear it, snooker I don’t hear it, golf I don’t hear it, I don’t hear the abusive stuff that people have to take other than a football pitch.\n“And the guys are young, so some will hear the things, and some will react in different ways, but we have to stick together with that.\n“As I said before, you need the support, and you need that support to be right behind it.\n“I get the frustrations of people saying to me this is the accumulation of six or seven years and it’s come to a head and those sort of things.\n“I get all that, but the guys need the help on the pitch when it’s like that. All we can do it try and keep them feeling free that they can go and play with the pressure that the club has on them because of the size of the badge, it’s handling the expectancy level of the club.\n“But you want your support to come in and get behind everybody, but I understand the frustrations, I totally get it, they’ve been brilliant since we’ve come in and maybe it was an accumulation of six or seven years.\n“But are we creating a culture of abuse, online stuff on social media, it’s a platform for people to criticise people on and people read it and listen to it — stay away from it.\n“Then it fuels it in the stands and then all of a sudden it gives people vile abuse, and you think hang on a minute, you’re here to support, everybody is here to support the team.\n“And Jose said it the same, another of the world’s great managers, says the exact same. It’s raising its head, and I don’t think it’s going in a good place.”\nHe added: “I can’t play the game for them. They have to go and play. One thing I will do is back them to the hilt, I’ll never chastise them, they give me everything they’ve got in their bodies to try and be brave on the ball, they train well and do everything I ask them in here, they behave properly in here, they do the right things, you’ve just got to stick together.\n“But you’re hoping that’s not going to be the case, and you’re hoping it’s going to be a different scenario. And that’s all we can do is go out there and try our best and try and get on the front foot.\n“Joey Barton said it after the game that the Ipswich fans helped them win the game because they turned the crowd. We would have been the exactly same if we went somewhere else, it can be a tactic for a team, to turn the crowd against us which happened the night.\"\nDoes he believe it’s harder now to be a professional footballer? “Without a doubt. Social media — I think it’s a sad state of affairs with that. When I was growing up, I knew how to handle it because I was brought up harder that way and I knew how to deal with things.\n“I was brought up with men that made me hard and I was brought up with managers that made me hard, there was unbelievable discipline with the clubs I played with.\n“And, as I said before, at Celtic, for example, it wasn’t just your life on the pitch, it was your life off the pitch that you had to handle.\n“Dortmund, huge, huge football club where you had to win things, Celtic you had to win things.\n“So, totally different but we didn’t have social media to communicate with people and some guy saying x, y and z and you’re saying sorry for a bad performance today, better luck next time.\n“These things never happened, but it’s part and parcel of the game, it’s more difficult now because the guys are in that bubble as such.\n“My advice is stay away from it, but it fuels everything onto the stands, I don’t think it’s conducive to there being a nice atmosphere in a stadium where people want to have a nice time with the kids and that coming.\n“So, I see how Cantona and all those guys did what they did, but it’s not right, but also they’re human. So you’re subjected to that abuse for trying to do a job, I don’t agree with it.”\nDid the conversation with Marcus get on to his future? “If you ask me, do I worry about it, no. As I said before, Marcus will do what he wants to do, I don’t sit and worry, I’ve been in the game too long.\n“I can handle it no worries, people being linked, this guy being linked, this guy being linked, it’s not a problem.\n“Again, I don’t read anything on social media, I don’t do social media, I love my life with football, football is a hobby, it’s a sport, it’s a great game, I love the game, and I do my best. If my best isn’t good enough, ‘Thanks Paul very much, see you later’, no problem, good luck to you.”\nHas there been any sport of vote of confidence, have you been told you have to win on Saturday?\n“No, we don’t speak about that,” he added. “We talk about the game and we speak about other things.\n“You don’t go into a meeting and say ‘Is my job safe?’. I don’t get caught up in that, I don’t worry about it. You probably worry about it more than I do.\n“What’s the worst thing that can happen? I lose my job. There are more things in the world to worry about. All I worry about is the guys, the team and the football club, I never worry about myself, I’m totally fine.”\nAsked how he reacts when specific managers such as Warnock are linked with his job, he added: “I don’t worry about it. No problem. What do you want me to say? I don’t have one problem with Neil or Pep or Jurgen or Antonio Conte it doesn’t bother me.\n“All I’m here to do is to try and do my best. If my best isn’t good enough, it’s not good enough, if it’s good enough then great.\n“I love the club, as I said, brilliant club and even when I do eventually leave here I’ll always look back and go what a club that is, and it still is.”\nIf Saturday goes as Tuesday did, do you think you’ll be here on Monday? Ask Marcus. You’re better asking him. You’ve just came here with all of this, don’t worry about me, I’ve got my own thoughts on it, but what can I do. If I do my best and my best isn’t good enough then no problem.\nAfter it was pointed out that the media would love to ask Marcus, but are never given the chance, the club media manager interjected that Lambert would still be in his job on Monday.\nLambert was asked whether he felt the reaction to Tuesday’s performance and result was down to frustrations which had simmered for six or seven years prior to him taking over, something has alluded to in the past.\n“That’s just what I’ve heard, people have said that to me,” he said. “I never really thought about it you know, because I don’t look at the past and say, you can see what happened to the football club in the past, but I don’t really delve into it or criticise any other manager because I know how hard it is or whatever else has happened here.\n“The frustration on Tuesday night, as I said before, when you come to a football game you want to come and enjoy yourself, I wouldn’t come to a football — I swear to God — I wouldn’t come to a football game and go there and just abuse somebody, I wouldn’t go.\n“Because all I’m doing is paying, I don’t know, £20 or £30, to abuse a guy for 90 minutes or abuse a team, where is the enjoyment in that?\n“I understand when the team isn’t winning and that, but that’s when the team needs everybody in the stadium to go the same way. I understand the frustrations with everything, but that’s when you need everyone to go the same way.”\nQuestioned on whether there was something he would have done differently this year, he said: “There always is, every year, every day, you always learn different things. The way the club is if Marcus could spend millions on guys you’d say OK we need three or four guys to get us back up there.\n“OK, we go and buy x, y and z to give that current group a hand, but there weren’t the finances there, So, you work within that, Marcus said it as well, you’ve got to work within the parameters he’s set. I think he’s told you guys the same.”\nIs success achievable within the parameters which have been set? “You need help, everybody knows that. If I sat here and said no, we need a bit of help for the guys.\n“As I said before, young Tyreece Simpson comes on the other night and he’s just 18 and a year ago the kid’s playing rugby, but that’s where the club is.\n“And nobody in a million years would have thought the club was where it was, no chance, but that’s where it is at this minute, but you’ve just got to keep the faith with the guys, as long as they give you everything you can always walk off that pitch, thinking you know what, they’ve given us everything, it’s just not happening.”\nLambert was pressed on his references to the likes of Sheffield United and Leeds struggling to get out of League One, it taking a number of seasons and managers paid the price for those prolonged stays in the division. Does he believe he can buck that trend?\n“If that happens, it’s not a problem,” he said. “You said this to me the other week. You’ve got to get it in your head, nothing fazes me really, nothing really, really fazes me. I’m strong mentally because what I’ve been through at my clubs and because I’m a fighter.\n“That has always stood me in good stead. As I said before, I came through an incredibly hard part up the road, incredibly hard part in Glasgow. My upbringing is really, really strong.\n“If it doesn’t happen for me, absolutely no problem. I would never criticise the club or anyone around about it because it’s a great club which needs to try and be up where [it was].\n“But it is what it is. You can ask the me the question from here to kingdom come, my answer would be the same. If you’re looking for a negative thing, you’ll never get it. Because all I do is just bat it back to you because I don’t do online, I don’t do social media, I don’t do anything like that, not a jot, it doesn’t interest me.”\nDod he feel the flat performance in the first half set the tone for the crowd reaction? “Absolutely it was flat, we didn’t do enough. The second half was better, they came out and we changed system and personnel a little bit and they came out and might have got an equaliser.\n“First half we were too passive. We just need to go for everything and just run and run and run and hopefully it transpires on to the stands and people get right behind us.”\nHe added: “They’ve got to not worry about anything, don’t worry about mistakes, don’t worry about anything else other than just giving it what they’ve got. At the end of the day, if the result goes for you great.\n“Great teams cannot play well at certain times but still do enough to win. Great teams can play really, really well but if they come up against a better opponent then they’ll lose.\n“There’s a way of looking at a winning streak and there’s a way to look at a losing streak. We’re in a losing streak at the minute but we have to arrest it and we have to try and stop that from happening.\n“As long as the effort’s there and the commitment’s there, that’s all you can ever ask from them, from any footballer, that’s all you can ever ask for.”\nPreviously Lambert has spoken about needing three or four transfer windows to get the squad he wants and he believes that’s the case for any boss.\n“You need time, any manager will tell you that, you need time,” he continued. “One of the staff told me they were listening to Tony Pulis on the radio and Tony said that a really bad transfer window can set you back five years. And that’s an experienced guy who has been at the top level and done great with the teams he’s been at.\n“Everybody’s got to get everything virtually spot on for it to happen, and it takes time. Whether you get the time is another question, but it takes time to build what you want to really build.”\nLambert, who was initially contacted by Evans while Paul Hurst was still in the job, is well aware that those conversations can take place.\n“They will do,” he admitted. “Do I fear that that goes on? Have you not listened to what I’ve said? I don’t care if Marcus has phoned Pep or Jurgen and said ‘Come down to Ipswich, will you?’. What am I going to do? Say ‘Oh, please don’t do that’.? If he wants to do something, then it’s not a problem.”\nLambert was given a four-year contract extension which took his terms to the summer of 2025 on January 1st but admitted that means little in football.\n“You know and I know that contracts are not worth the paper they’re written on,” he said. “If someone wants to [get rid of a manager] they [get rid of a manager]. Somebody wants to say ‘OK, you keep it’.\n“I don’t get caught up in the whole thing, I really don’t. I don’t get caught up in it, I do my best. Since the other night I’ve spoken to world class managers, all round Europe I’ve spoken to them and virtually every one of them have told me the same, so there you go.”\nAsked whether he agreed that regardless of the parameters in which he is working, the bottom line is that the squad should be good enough to be higher than ninth, Lambert said: “We should be better. And two months ago we were sitting top. The last few games we’ve not been at it at all.\n“Actually, that’s wrong, because against Oxford we had incredible chances, [Sunderland], we should have won, [Wimbledon], that has been the frustration, we’ve not put the ball in the net.\n“If the team wasn’t performing and wasn’t dominating games, it would be worse, it would be a lot worse, coinciding with not scoring we’ve lost games.\n“You put it in mixing pot and it becomes ‘We should be doing better’, which we should be, we should be higher up because two months ago we were sitting first.\n“And that’s why when the pressure does get on the guys, they have to handle that expectancy level. Yes, we’ve lost all the strikers, that’s what happens. You’ve got to come up with a scenario where you get a result, that’s the secret of it.”\nWhile personal abuse aimed towards players should obviously be condemned, can he understand the frustrations of fans given the current position? “Yes, but, as I said before, I wouldn’t entertain [socal media] at all if I was a professional sportsperson, that’s my opinion. Some people can use it for their brand, I get all that.\n“I certainly wouldn’t get into a fight with somebody on a keyboard. I tell you what, pick up the phone and I’ll meet you somewhere, I’d do that! But don’t go behind a keyboard and say ‘This, this, this and that’. It’s an absolute nonsense.\n“Go back to Eric Cantona 25 years ago, one of the greatest players who ever played the game, it overspills, he shouldn’t have done it. You tell me another sport where you go in and take a load of abuse.”\nIt has been part of the culture of football for a long time, hasn’t it? “Yes, but not as bad, absolutely not as bad. It’s way, way off the scale now. Eric Dier, for example, something must have happened there. Jose comes out and says it, did Eric Cantona deserve somebody running down and [abusing him]. What would happen out in the street if somebody did that at you?\n“So why should people be subjected to that? Does Eric Dier deserve that, did Eric Cantona deserve that? Do their families deserve that?”\nAsked whether he was conflating the Dier incident, where the Spurs midfielder waded into the crowd to confront an apparently abusive supporter, with the atmosphere on Tuesday, Lambert said: “No, I’m just talking about the culture, are we generating that culture, nothing to do with Tuesday night.”\nBut he said he understands the frustration felt by fans - “I get all that” - given this was a season which was viewed as the bounce back after last year’s hugely disappointing relegation season.\n“We actually said at the beginning of the season that this would be a tough, tough league to get out of,” he recalled. “We actually said that, we said there would be bumps on the road and everything like that.\n“If it was that easy, Sunderland would have done it last year, the biggest club in the division would have done it.\n“Sheffield United would have done it, massive club. Leeds would have done it, massive club. Everybody’s perception was totally wrong, and we even told you guys.”\nThe expectation at those clubs would have been the same and, as said previously, those managers have paid the price, is that not a concern? “Have you not listened? What you want me to do. Marcus says ‘Pack your car and go, pack your office and go’. That’s absolutely not a problem.”\"\nBut it must be a problem from the perspective of your pride? “No, because I had that at Stoke, I had that at Wolves. Have I not just answered that? You’re not listening.”\nDo you still see the play-offs as realistic? “Absolutely, we’re going to go for it. Are we going to go for the top two? Absolutely we go for it. Go for everything.\n“I’m not used to being in a situation where I go ‘Aye, do you know what, toss it off, toss it off’. It’s not my nature. I’m not like that as person, I’m not like that as a sportsperson.\n“I go for everything, while it’s still feasible, I go for everything. I’ve told you before, if somebody beats me, it’s going to have to be a good one.”\nPhoto: TWTD\nPlease report offensive, libellous or inappropriate posts by using the links provided.\nIt's a problem for us though...\nI want it to be a problem for our Manager if he is under pressure\nThis seems to be rubbing off on the players too much for my liking\nTime for a change...\nPlayer need to step up and PL needs to stop protecting them.\nWe talk the talk but then fail to walk the walk.\nIf the effort & commitment is apparent then so will the support be.\nWe all accept last season was a write off but this season has been even worse.The season started well then came the ( the six seven eight team changes every game) why I ask.Then the sudden reverse back to a settled team and we hit a winning run again.(must prove something).Stupid decisions to cancel games due to international games when most of the players didn't get picked anyway.We then lost our way again and the rot set in and from there it has stagnated and has never really recovered.Just lately we are back to unbelievable team selections for must win games.Last Tuesday was the final straw for me.I personally feel PL has finally lost the dressing room and it will now be impossible to recover from this.Loose Saturday and that will be the final nail in the coffin I fear.Although the owner has held this club together his decisions on appointing managers has been diabolical and his spending leaves a lot to be desired.(But as I've said without him we could have folded) but that does not mean I support his decisions.\nFinally I'm really not looking forward to Saturday if we were to loose as the future would become very toxic and I don't want to see this happen to MY club who I love.Well that's enough of my rant.I'm sure many won't agree with my thoughts but that is just how I feel.ðŸ˜¢ðŸ˜¢\nWe will run out of ideas, make a mistake\nThey will score\nGame over\nFor all our issues up front- its the horrendous mistakes at the back that need to be cut out first. Don't get the feeling that is the focus at Portman Road - or whether there is any focus\nWe are 17th in the form table over the last 6 games.\nWe are 18th in the form table over the last 24 games. We've amassed just 4 points more than Bolton over that period, and they didn't have a squad at the start of the season. Unbelievable.\nAs posted on the forum the other day by Doctor_Earman, first League 1 seasons after their most recent relegation from the Championship:-\nSheffield Wednesday - 15th\nLeicester - 1st\nForest - 7th\nLeeds - 5th (with 15-point deduction, lost in play-offs)\nSouthampton - 7th (with 10-point deduction)\nWolves - 1st\nSheffield United - 3rd (Lost in play-offs)\nSunderland - 5th (Lost in play-offs)\nSo based on our current position, only Sheffield Weds did worse, who were a club in total disarray and in the middle of a takeover. Leeds and Southampton out-performed us with large points deductions.\nLambert can blub about his lack of budget (which is a laughable argument considering it is one of the biggest in the division) and abuse from the stands (again, rubbish, nobody is abusing anybody personally just expressing discontent at the state of us) but the reality is he is failing ITFC. Spectacularly so. And the only person to blame is him.\nLambert out.\nFor PL to come out with a comment like this says one thing. \"I couldn't care less as long as I get a pay out\"\nI really do appreciate the fact he wasnt financially backed in January....and had an unfortunate rash of injuries. Im also glad he highlighted the neglect that had gone on with the club, not just from an aesthetic point of view.\nHowever........ L\nLambert insisted they were good enough for automatic promotion and it would be a failure otherwise....well, he has failed to even make the playoffs.\nHe had a large, well paid squad and a big fan base that turned up in their thousands so could not bemoan the strength of his team or the lack of support\nHe continuously rotated the team/formation and cancelled games due to squad players being on international duty.... which had a detrimental effect on morale and confidence\nHe has no tactical ability whatsoever. Waiting until the other side are ahead before adapting the game/making changes.... often leaving substitutions until far too late. The prime example being Mcgavin...who had not been involved at all......then is suddenly starting a 'must win' game when Teddy/Sears are on the bench.....madness.\nSo get your pay out Paul and sod off. You like to remind us of how much you have achieved as a player. You werent so good that you stick in the memory and as for you managerial career........(tumbleweed passes by)\nI do agree that over time Evans' lack of investment has made us uncompetitive at Championship level, but I see no excuse for our terrible League One form.\n''I've played for big clubs''\n''I was brought up on the mean streets of Glasgow''\nWelcome to your newest edition of Paul Lambert bingo.\nIv'e just read his comments on bbc football(div1 section) where he says the expectancy at Ipswich is high i don't think it's overly expectant of the fans to beat some of the sides we've thrown points at this season resulting in the mess we are in! i really hope(optimist that i am)that we put in a proper full blooded performance on Saturday and get 3 points and give us an extremely thin chance of getting to the play offs C.O.Y.B\nOr not, as in this case.\nHe is doing some good however, as keeping a 6 foot social distance gap to slow down the virus is going to get very easy at PR.\nYou need to login in order to post your comments",
  "word_count": 5363,
  "scraped_at": "2026-02-14T11:59:32.870772"
}