{
  "article_id": "78d06ab2f3d2",
  "url": "https://www.azcentral.com/story/news/2023/01/27/alex-murdaugh-trial-livestream/11126271002/",
  "title": "Murdaugh trial livestream today : Watch live feed from court ; updates",
  "date": "20230228T224500Z",
  "domain": "azcentral.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Alex Murdaugh sentencing: Watch live as Murdaugh is sentenced in double murder trial\nAs the trial of Richard \"Alex\" Murdaugh continues in South Carolina, lawyers are discussing the timeline of the murders, and presenting cell phone and weapons evidence.\nOne of the most high-profile true crime cases in recent history is playing out in a South Carolina courtroom.\nTestimony is underway in the double murder trial of disbarred attorney Richard \"Alex\" Murdaugh, who is charged with killing his wife and son.\nMurdaugh, part of a South Carolina legal dynasty, was charged with murder in connection to the 2021 shooting deaths of his wife, Maggie, and son, Paul. Murdaugh has pleaded not guilty.\nAfter the shootings in June 2021, police launched investigations into two other deaths connected to Murdaugh and alleged criminal acts dating back more than a decade.\nHere are the details of the case:\nAlex Murdaugh sentenced to life in prison, autopsy photos leaked from courtroom\nIn a dramatic end to one of the nation's most sensational true crime cases, disgraced attorney Richard “Alex” Murdaugh was sentenced to life in prison Friday for the murder of his wife and son.\nAfter a six week trial and just three hours of deliberation, jurors found Murdaugh guilty of the gruesome killings, marking the end of a powerful South Carolina family legal dynasty.\nMurdaugh continued to proclaim his innocence before Judge Clifton Newman issued his sentence, an assertion the judge told him was simply not believable. “It might not have been you,\" Newman said, \"it might have been the monster you've become.\"\nAfter the sentencing, the judged said a complaint had been made about autopsy photos from the case being leaked. It appeared, he said, that the photos were taken in the courtroom well where staff, lawyers and the jury work, not from the audience. He invited law enforcement to investigate the matter.\nJury receives instruction from the judge, moves to deliberate on verdict\n“You have heard the testimony, received the evidence and heard the argument of the state and the defendant,” Judge Clifton Newman told the jury Thursday afternoon before sending the jury out to deliberate. Newman told the jurors they were “finders of the facts,” and reminded them that the defendant is to be given the benefit of any reasonable doubt.\nThe judge also told jurors evidence of other crimes committed by Murdaugh may be considered only in relation to the motive for the crime and not as the basis of a moral judgement.\nEach of the four indictments — two counts of murder and two counts of possession of a weapon during the commission of a violent crime — will require its own verdict from the jury. Newman reminded the jury it should limit outside influence and only consider evidence and testimony presented at trial.\nJohn Meadors wraps up the trial with a dramatic rebuttal for the prosecution\nIn prosecutors' final address to the jury, John Meadors said, “This is a commonsense case,” and told them they'd been preparing to make this ruling their whole lives.\nDuring his emotional rebuttal the defense's closing argument, Meadors told a story about the children’s book ‘The Velveteen Rabbit.’ His mother gifted him a copy with the inscription, \"always be real,\" a theme of the book.\nThroughout his rebuttal Meadors returned to that metaphor, saying the prosecution presented real, hard facts. Murdaugh was never real, Meadors said, he was a habitual liar.\nMeadors described the case as being as clear cut as an episode of Columbo, though admitted that the jury was probably too young to understand the reference.\nMurdaugh might have loved Paul and Maggie, Meadors conceded, but he loved himself more than anything, and that drove him to do the unspeakable.\nJim Griffin paints prosecution’s theory on motive as divorced from reality, not matching defendant’s character\n“Totally illogical, irrational, and insane” are the words Griffin used to describe the prosecution’s assertion that Murdaugh killed his loved ones to escape his own criminal misconduct.\nThat’s just not what people do, Griffin said. He pointed instead to Murdaugh’s failed suicide plot as a more likely reaction of a person who was running out of options.\nThe prosecution, Griffin said, wanted to win at all costs, and had been caught up in media attention to the case they developed a shoddy motive.\nGriffin argued that the prosecution's evidence was merely circumstantial and does no conclusively prove Murdaugh’s guilt. There is no reason he would have committed this crime, no answer to the ‘Why?’ he said.\n“There are two words that justice demands in this case, and those words are not guilty,” Griffin said near tears, asking the jury not to compound the tragedy the Murdaugh family has endured\nJim Griffin begins closing arguments for defense, juror ousted for discussing the case\nJust before attorney Jim Griffin began his closing arguments for the defense Thursday morning Judge Clifton Newman announced one of the 12 jurors was removed for discussing the case with at least three other people, which is strictly prohibited.\nThe juror was replaced with an alternates “in order to preserve the integrity of the process,” Newman said. Lead prosecutor Creighton Waters did not object to the move but described the process as “muddled” — drawing attention to the fact that the interviews conducted to determine the whether the juror had violated court rules were carried out by SLED agents, an agency, he asserted, had already had their credibility questioned throughout the trial.\nState concludes closings, frames Murdaugh as man with no way out\nIn his sweeping closing argument, Waters said Murdaugh was a man who relied on his family name to bring him immunity and privilege. As his father Randolph was dying, with his son was facing criminal charges for the boat case, Murdaugh was facing civil charges that would unravel his financial crimes and became desperate.\n“He’s the kind of person for which shame is an extraordinary provocation,” Waters said, and when his ego couldn’t stand it anymore he became a “family annihilator.”\nDozens of witnesses took the stand over the past few weeks Waters noted, but two were notably absent: common sense and human nature. Waters insisted that while the two concepts can't take the stand they should speak on behalf of Maggie and Paul.\nHe lied to everyone close to him, and he’s good at it Waters cautioned the jury. He fooled everyone who thought they were close to him, including Maggie and Paul, and they paid for it with their lives. Don’t let him fool you too, Waters wrapped up, asking the jury to return a guilty verdict.\nState focuses on Murdaugh's lies\nClosing arguments for the state resumed after lunch with attorney Creighton Waters taking the jury through a detailed timeline of the night of the murders.\nUsing cell phone data, Waters placed Murdaugh at the scene of the crime “just minutes before” the murders occurred. Why, Waters asked, would he lie about his whereabouts and the last time he saw his wife and son so quickly after their death?\n“It doesn’t make sense ladies and gentleman,” Waters said. Murdaugh, he alleged, merely fabricated a new story to match the facts of the case once they were presented in court.\nAt one point Waters walked to a courtroom door and reenacted the shooting, describing what Maggie must have felt \"running to her baby\" never imagining it was her husband who pulled the trigger.\n‘We know how powerful opiates can be’ State casts doubt on Murdaugh’s drug use\nAfter a detailed review of the ‘hamster wheel’ of Alex Murdaugh’s cycle of spending and stealing, Waters moved to his drug use.\nWhile testifying on his own behalf, Murdaugh claimed he was taking 1000 milligrams of opioid painkillers a day. Waters cast doubt on that assertion, arguing Murdaugh could never have kept up his lifestyle \"if he was taking that much dope.\"\nMurdaugh said he lied to law enforcement officers the night of the murder because of drug-induced paranoia. But Waters downplayed the severity of the drug problem, noting that the cover-up he pulled off after the murders could not have been orchestrated by someone in such a drug-induced state.\nCreighton Waters begins closing arguments for the state\nAfter the jury’s trip to the crime scene Wednesday morning, closing statements began in the trial of Alex Murdaugh on charges he murdered his wife and son.\nThe state began, with lead prosecutor Creighton Waters arguing there was only one person with the motive, opportunity and means to commit the crime - and that person was Alex Murdaugh.\nWaters painted Murdaugh as a man of great privilege who became so dependent his high-dollar lifestyle began to steal by “talking fast” to family members and legal clients.\nWaters described missing legal fees, a 2019 boat crash which killed Mallory Beach, and a wrongful death settlement for former his former housekeeper closing in on Murdaugh.\nWith his finances falling apart, Murdaugh was without options, Waters said, and he did what he's always done when accountability comes knocking - he made himself a victim.\nWaters seemed intent on separating Murdaugh from everyday people, highlighting his wealth and prominence in the community and characterizing his crimes as a story never before seen.\n“The pressures on this man were unbearable and they were all reaching a crescendo the day his wife and son were murdered by him” Waters argued.\nState rests after rebuttal, jury adjourns\nAfter exhaustive testimony from forensics expert Dr. Kenneth Kinsey, the state rested its rebuttal.\nWith no more witnesses to call, both sides will make their closing arguments after an expected visit to the crime scene by the jury. Deliberations may begin by the week's end.\nMark Ball, Alex Murdaugh’s former law partner, takes the stand again\nMark Ball, one of Murdaugh’s former law partners, took the stand early Tuesday afternoon to go over previous testimony he shared as a witness for the prosecution.\nBall characterized Murdaugh’s relationships with law enforcement as healthy, casting doubt on previous claims by the defendant that he had a deep distrust of SLED and that was why he lied in an interview conducted the night of the murders.\nDuring cross-examination, defense team lawyer Jim Griffin pinpointed a number of events which would have prompted a distrust of SLED — a criminal prosecution of Murdaugh’s close friend Greg Alexander, and a case involving Paul Murdaugh’s 2019 boat crash, both of which involved SLED.\nDuring cross examination, Ball was also asked about Murdaugh’s disposition; he has been emotional on the witness stand. Ball confirmed Murdaugh was a generally emotional person, agreeing with Griffine that there had been other occasions when the defendant had become emotional.\nMurdaugh’s defense team rests, prosecution to call only 5 rebuttal witnesses\nMurdaugh’s defense team rested Monday afternoon, following two days of blockbuster testimony from the defendant himself – Alex Murdaugh.\nThe prosecution on Tuesday called rebuttal witnesses. The state plans to call five witnesses, including Colleton County Coroner Richard Harvey and Murdaugh’s former law partners Ronnie Crosby and Mark Ball.\nCreighton Waters, the lead prosecutor on the case indicated the rebuttal will be done by Tuesday afternoon. After that the jury is expected to visit the crime scene at Moselle – the Murdaugh property where Paul and Maggie were shot. Closing arguments could begin as early as Thursday and are expected to take a full day before the case goes to the jury for deliberation.\nProsecutor paints Murdaugh as a self-made martyr, moves the trial to a character debate\nProsecutor Creighton Waters widened the scope of cross-examination late Friday afternoon, moving to broader questions about Murdaugh's character.\nWaters has made sweeping statements about Murdaugh’s character, evidently aiming to poke holes in Murdaugh’s projected image of a grief-stricken defendant. Throughout his time on the stand Murdaugh has remained fairly even-headed, obfuscating direct attacks on his character and expressing remorse over previous crimes.\nWaters has been dogged in his attempts to puncture that image and to convince the jury that the defendant’s attitude is an act — that he is a man of great privilege and wealth who is once again trying to skirt accountability.\nMurdaugh gave an unequivocal denial when Waters prompted, “Mr. Murdaugh are you a family annihilator?”\nProsecutor tries to poke holes in Murdaugh’s new story, needles about lying to SLED\nIn an exhaustive review of the events leading up to the murders of Paul and Maggie Murdaugh, Waters focused on revealing inconsistencies in the defendant’s story.\nWaters focused on details including phone calls Murdaugh made before the killings and conversations he had with his wife in an apparent effort to poke holes in a new narrative of events Murdaugh recounted for the first time on the witness stand.\nDuring yesterday’s testimony, Murdaugh admitted to lying to SLED officials the evening of the murder. Murdaugh blamed his lying on drug-induced paranoia. During extensive questioning, Water pressed Murdaugh on exactly when he decided to lie to SLED detective David Owens about seeing Maggie and Paul that night, playing clips from the interview and pausing at certain points to ask if he'd started lying yet.\nDay 2 of Alex Murdaugh’s cross-examination begins with detailing of oxycodone addiction\nThe cross examination of accused murderer Alex Murdaugh continued for a second day Friday, as lead prosecutor Creighton Waters pressed the defendant on his drug dependency.\nMurdaugh painted himself as a man at the mercy of his opioid addiction, attempting at kick the habit hundreds of times. He described the pain it inflicted on his family and the paranoia it elicited.\nBefore rehab, Murdaugh said he always kept the pills on him, afraid someone might discover them. He said he had a pocket full of pills when he was interviewed by law enforcement the day after the murders.\nMurdaugh said the prosecution failed to respond to multiple requests from his lawyers talk about his other wrong-doings. He would have been willing to share about his drug addiction and financial crimes and how they related to the evidence, he said, but lawyers for the state did not respond to his attorney. The first contact with prosecu Murdaugh said he received was when he was charged with murder.\nWaters balked at that assertion, noting that Murdaugh had never, before taking the stand Thursday, told prosecutors he had lied about being at the dog kennels the night of the murder. Waters said Murdaugh was simply coming up with a brand new story to match the facts of the case.\nTensions rose between Waters and Murdaugh over financial crimes\nTempers flared during the cross examination between the defendant and lawyer Creighton Waters on Murdaugh's financial crimes. Waters described how Murdaugh sat across from one client, looking her in the eye and \"talking fast\" – a folksy way of saying lying.\nMurdaugh equivocated on the eye contact, and said the details of his fraud was hazy.\nThe questioning appeared aimed at portraying Murdaugh as a man who lied easily, and had become quite good at it.\nMurdaugh, expressed exasperation, telling Waters he had been forced to sit through weeks of testimony about financial crimes he has admitted to and is embarrassed about, bit is on trial for the murder of his wife and son.\n“I stole money that was not my money, I misled people I shouldn’t have misled and I did wrong I can tell you that,” Murdaugh conceded.\nCross examination begins, Creighton Waters draws on Murdaugh family legacy\nCreighton Waters began an aggressive cross-examination of Murdaugh, taking a combative tone with the defendant.\nDelving into the history of the Murdaugh legal dynasty, Waters peppered him with questions about his family tree and his own success as a lawyer.\nWaters and Murdaugh sparred over the definition of success, with Waters pointing out the cases Murdaugh won and the millions of dollars in legal fees he collected. Murdaugh, however, seemed hesitant to paint himself in too favorable a light. “Do I feel like I was successful? No sir not sitting here today I don’t,” Murdaugh said.\nWaters line of questioning sought to portray a cozy relationship Murdaugh had with law enforcement based on family connections.\nMurdaugh confesses to orchestrating assisted suicide plot, gushes about wife Maggie and son Paul\nMurdaugh told jurors about an assisted suicide plot he hatched, paying Curtis Edward Smith to shoot him to escape his addiction.\n“At the time in the bad place that I was, it seemed like the better thing to do,” he said, saying that now he is grateful to have survived.\nWhen asked about his wife, Murdaugh lovingly described her as a wonderful woman whose laugh would light up a room. Very feminine, she did her best as the mother of two sons, he said, taking to their interests. She could hob-nob with the affluent at the governor’s mansion and then take a shift at a soup kitchen.\n“I would never hurt Maggie – ever,” Murdaugh insisted.\nMurdaugh described his son Paul as a good man, who had been misrepresented in the media. He challenged everyone in the courtroom, and anyone listening – nodding to the trial’s wide digital audience – to find anyone who knew Paul “without an ulterior motive” who had something negative to say about him.\n“He was a man’s man,” Murdaugh said, a true country boy with a soft and sweet side, often checking in on his grandparents.\n“Did I love him?” Murdaugh said, choking back tears “Like no other.”\nMurdaugh admits to stealing client funds, talks about his opioid addiction\nAlex Murdaugh returned to the witness stand Thursday afternoon after a lunch break to answer question about his alleged financial crimes. He downplayed his feelings about a confrontation by his former law firm CFO about his stealing that occurred the day of the murders\n“It wasn’t anything that was a big deal,” Murdaugh said, noting he was not worried at the time about anyone looking into the missing legal fee which prompted the conversation.\nMurdaugh later admitted to stealing legal fees from the family law firm. Asked by lawyers how he got himself into such a predicament he said, “I’m not quite sure how I let myself get where I got.”\nMurdaugh said he was addicted to opioids, in particular oxycodone, after knee surgery for a college football injury sustained during his time at University of South Carolina. The addiction was expensive he said. After various detox attempts and a trip to rehab, Murdaugh shared he has been sober for 353 days and is “very proud of that.”\nMurdaugh details threats against his son Paul after boat accident, walks lawyers through moments after murders\nAt one point in his 911 call, Murdaugh can be heard saying, “I should have known.” He explained he was referring to “the most vile threats” that had been levied against his son Paul after he was implicated in a 2019 boat crash. Murdaugh said the threats were so extreme that a counselor at Paul’s college had reached out to him.\nHis lawyers also asked Murdaugh why he traveled back to his home to get a firearm after discovering his wife and son. Murdaugh, appearing slightly flustered repeated “I don’t know” a number of times on the stand before indicating he thought the killer might be at large.\nMurdaugh also offered an explanation for suspicious phone activity presented by the prosecution that showed he made google searches for a restaurant and called a wedding photographer in the moments after the murder. In the rush to call family members, Murdaugh said the search must have happened by accident.\nAlex Murdaugh breaks down on the stand describing crime scene\nFollowing a detailed play-by-play of his day leading up to the murders, Murdaugh became emotional on the stand, breaking down in tears and asking for water, before describing the moment he discovered the bodies of his wife and son.\nThrough tears, Murdaugh recalled his shock and desperation at the scene, saying he touched both bodies to check for signs of life and to return his son Paul’s phone to his pocket after it had fallen out.\nDefense attorneys played back the 911 call from the evening of the murders as Murdaugh listened in to his own voice, often looking downward and shaking.\nAlex Murdaugh admits to lying to SLED the night of the murders, blames addiction\nSpeaking to crowded courtroom pews, Murdaugh admitted to lying to South Carolina Law Enforcement agents, but vehemently denied ever shooting his wife Maggie or son Paul, who he referred to by nicknames ‘Mags’ and “Pau-Pau’ on the stand.\nMurdaugh, appearing at times emotional and at a loss for words, told defense attorney Jim Griffin that he had lied to SLED agents about the last time he had seen his wife and son the night of the murders, blaming it partially on his distrust for the agency, and on a paranoia induced by drug addiction. Mr. Murdaugh entered rehab previously for oxycodone dependence.\nAsked why he continued to lie to law enforcement after the murders, Murdaugh lamented: “What a tangled web we weave.”\nWhat is SLED?\nSLED stands for South Carolina Law Enforcement Division, the state agency which has run point on the investigation into the killing of Paul and Maggie Murdaugh.\nSLED agents arrived on scene after the killings, and conducted interviews with father and husband, Alex Murdaugh, who was charged with their murders.\nOn Thursday, Murdaugh took the stand and admitted lying to SLED agents in the aftermath of the crime, attributing his dishonesty to a general distrust in the agency and the advice of former law partners not to speak to agents without an attorney present.\nAlex Murdaugh takes the stand for highly anticipated testimony\nAfter some back and forth, defendant Alex Murdaugh confirmed Thursday he will take the stand in his own murder trial, opening himself up to questioning from his lawyers, and a potentially brutal cross-examination.\nMurdaugh, a former attorney, will provide testimony aimed at rebutting claims by the state that he murdered his wife and son to distract from his financial crimes.\nDefense attorney Jim Griffin asked Judge Clifton Newman Wednesday if Murdaugh could use his Fifth Amendment rights against incriminating himself in the nearly 100 other allegations he faces including stealing from clients, money laundering, tax evasion and insurance fraud. Newman said prosecutors generally get wide latitude in cross examination.\nAlex Murdaugh's lawyers present a defense, Buster Murdaugh testifies\nWeek five of the Murdaugh trial kicked off Tuesday with the defense team at the helm. Lawyers for Alex Murdaugh began making their case Friday afternoon, calling two officials whose testimony they view as crucial to poking holes in the state's presented evidence: Colleton County Coroner Richard Harvey, and Sheriff’s Office Public Information Officer Shalane Tindal.\nTuesday morning Buster Murdaugh, Alex Murdaugh's surviving son, took the stand detailing how guns were stored at the family property 'Moselle.'\nMurdaugh's high profile defense team will need to provide the jury reasonable doubt that their client committed the murders and paint the evidence presented by the prosecution as circumstantial and too week to bring such a serious charge.\nState rests, but Murdaugh defense team asks for case to be tossed\nOver the course of the past month, lawyers for the State of South Carolina have called over 50 witnesses, presenting a case against disgraced lawyer Richard \"Alex\" Murdaugh. On Friday, they rested their case. Shortly after, Jim Griffin, one of Murdaugh's attorneys, requested a \"directed verdict,\" alleging the prosecution had failed to provide sufficient evidence for the jury to deliver a guilty verdict.\nIn a hearing without the jury present Griffin claimed the evidence was \"exclusively circumstantial\" and \"merely suspicious.\" Judge Clifton Newman shot down these assertions, saying the court and S.C. law makes no distinction between direct evidence and circumstantial evidence.\n\"Their is evidence to derive at a guilty verdict, if the jury agrees,\" Newman commented.\nRead a full recap of Day 20's trial proceedings.\nWhen was Alex Murdaugh's roadside shooting?\nThe murders of Maggie and Paul Murdaugh are not the only shootings related to this case. In September 2021, Alex Murdaugh himself was hit in the head by a bullet during a drive-by shooting.\nState police confirmed that the shooting was orchestrated by Murdaugh himself as an \"assisted suicide\" plot. He was charged in connection with the failed suicide-for-hire attempt from which he had hoped to secure a $10 million life insurance payout for his son.\nCurtis Edward Smith, the shooter, was a former client of Murdaugh, and also faces a number of charges including insurance fraud, conspiracy, assisted suicide, aggravated assault and battery.\nMurdaugh gave Smith the gun to kill him, police said. Smith then followed Murdaugh to Old Salkehatchie Road in Hampton County and fired the shot. It only grazed Murdaugh though, who was then able to call 911.\nFollowing the incident, state agents confirmed both men confessed. Murdaugh's lawyer later asserted his client had come up with the plan for a would-be-assassination amid a battle with oxycodone addiction and a depressive episode. He entered rehab shortly after and resigned from the family law firm following allegations he had misappropriated funds.\nMurdaugh jurors test positive for COVID\nTwo of the jurors in the double-homicide trial tested positive for COVID-19 ahead of Monday's court proceedings. The clerk of court also tested positive.\nAfter the remaining 10 jurors and five alternates tested negative, Judge Clifton Newman decided to continue the trial despite requests from both the prosecution and defense for a delay. Another round of tests will be administered Wednesday.\nThe remaining jurors will wear masks, as will testifying witnesses and questioning attorneys. The courtroom will remain as packed as before, with 200-plus onlookers, who will not be required to don masks.\nNewman, however, recommend safety measures. “At the moment, we are going to encourage everyone here to mask up for your own protection as well as the protection of these proceedings and each other,” he said.\nWho is Claude 'C.B. Rowe?\nClaude “C.B.” Rowe is a former Murdaugh employee.\nColleton County Sheriff’s Office detective Laura Rutland, who served as a liaison to SLED for the investigation, testified earlier that Murdaugh offered up Rowe’s name as a possible suspect in the murders during an interview the night of the killings.\nCell phone records presented in court indicate Rowe’s phone was was not in the vicinity of the Murdaugh estate at the time of the murders.\nRowe, a groundskeeper for the Murdaugh estate, also is part of the defendant’s alibi. In court filings, Murdaugh says the night of the murders he drove to his mother's house in nearby Vanville and called a number of people on the way, including C.B. Rowe.\nDuring Monday's court proceedings, SLED Forensic DNA analyst Sarah Zapata testified in tedious and inconclusive detail about DNA samples, including those found beneath Maggie Murdaugh's fingernails. Rowe's DNA couldn't be ruled out but Zapata said it was only a \"moderate likelihood\" the mixture was his and Maggie's.\nThe foreign DNA from a male found under Maggie's nails was not her husband or son Paul.\nGloria Satterfield's son testifies\nTony Satterfield, the son of Gloria Satterfield, a former housekeeper for the Murdaughs, who died as a result of a fall at the family property, took the stand Thursday.\nSatterfield testified that after his mother died in 2018, Murdaugh approached him and his brother and promised to take care of them, telling them he would allow a friendly claim against his homeowner's insurance.\nMurdaugh promised to secure $100,000 for each of the grieving sons, Satterfield testified. However, according to indictments and civil lawsuits, Murdaugh, along with fellow attorney Cory Fleming carried out a scheme to coerce his insurance companies into paying roughly $4.3 million — all of which Murdaugh kept.\n\"Did he ever pay you one dime?\" Creighton Waters, lead prosecutor Creighton Waters asked Satterfield. \"No,\" he responded.\nWho is Chris Wilson? Alex Murdaugh's friend takes the stand\nChris Wilson, a former close friend of Alex Murdaugh, took the stand midday Thursday. Wilson, a Bamberg lawyer, who has known Murdaugh since high school, appeared as a witness for the prosecution.\nWilson testified to his family's shock and grief at the death of both Maggie and Paul, and described traveling to Moselle, the family property, to comfort Murdaugh the night of the murders.\nIn his testimony Wilson suggested that both he and other lawyer friends of Murdaugh did not want him speaking to South Carolina Law Enforcement Division (SLED) officers alone because he was so distraught. \"We felt that Alex wasn't in a position that he needed to, or was even able to, talk to SLED without someone being with him,\" Wilson said.\nIn a previous in-camera testimony, without the jury present, Wilson described how close he and his family were to the Murdaughs, and how he felt truly betrayed by Murdaugh's financial crimes.\n\"He was one of my best friends, and I thought that he felt that way about me,\" Wilson said, his voice thick with emotion on Thursday.\nAs questions continued, Murdaugh hung his head and wiped away tears.\nColleton County Courthouse evacuated due to bomb threat\nOn Wednesday, a Colleton County Sheriff's Office deputy was reported to be sprinting across the grounds of the Courthouse, yelling in a panic for people to clear the area.\nAt 12:27 p.m., Judge Clifton Newman ordered the courtroom to be evacuated until as late as 2:30 p.m. Newman did not cite a specific reason for the evacuation, but the South Carolina Law Enforcement Division confirmed that a bomb threat was reported.\nSeveral student groups were in attendance today at the trial today as well as Murdaugh family members.\nJason Ryan on the ground at the courthouse on behalf of the The Hampton County Guardian described significant police presence at the scene, reporting that law enforcement had formed a perimeter around the courthouse square and cleared the block.\nShortly after 3 p.m. the court reconvened and proceedings resumed.\nJeanne Seckinger testifies to Alex Murdaugh's alleged stealing\nJeanne Seckinger, CFO of the Murdaugh family law firm PMPED (now Parker Law Group) took the stand Tuesday, painting Alex Murdaugh as a thief and manipulator.\nSeckinger alleged Murdaugh used his prominent name and the chummy culture of the law firm to pull off a years-long con, stealing millions from clients, partners and other close associates.\nSeckinger characterized Murdaugh as a sloppy thief, stealing the same funds twice and leaving incriminating checks and bank statements on his desk at the office.\nHis success as a lawyer, she alleged, was not the result of skill but manipulation. \"Alex was successful, not because of his work ethic, because of his ability to manipulate people into a settlement,\" Seckinger told the courtroom, \"He did it through the art of (expletive) , basically.\"\nAn important ruling from Judge Newman\nJudge Clifton Newman ruled on Monday that evidence pertaining to Alex Murdaugh's other alleged crimes would be permitted in the trial. The ruling is a big win for the prosecution, which filed documents indicating lawyers plan to paint Murdaugh as a man out of options, desperate to distract from his financial crimes.\n\"I find that the jury is entitled to consider the apparent desperation of Mr. Murdaugh because of his dire financial situation and the treat of being exposed. ... possibly resulting in the commission of the alleged crimes,\" Newman said.\nMurdaugh is the subject of a number of state investigations and has been indicted on nearly 100 different charges including fraud and drug trafficking. The admission of evidence related to these alleged crimes is expected to prolong what was already anticipated to be a three-week trial.\nCaretaker for Libby Murdaugh, Alex Mudaugh's mother testifies\nThe prosecution called Mushelle \"Shelley\" Smith to the stand as Monday. Smith is the caretaker for Alex Murdaugh's elderly mother, Libby Murdaugh.\nSmith testified that Murdaugh came to visit his mother the night of the murders at about 9 or 9:30 p.m. and stayed 15 to 20 minutes. Smith testified that days later, at the funeral of his father, Randolph Murdaugh III Alex made a point of telling her he was at the house that night for longer — 30 to 40 minutes.\nShe also testified that Murdaugh offered financial support for her upcoming wedding and to use his connections to help with her second job at the local school district .\nSmith also said a week after the murders she saw Murdaugh at his mother's home carrying what looked to be a blue tarp.\nIn his cross-examination, defense team lawyer Jim Griffin sought to undermine Smith's account by pointing to a conflicting report she gave police about whether Murdaugh had a tarp or a raincoat.\nWhen were the Murdaugh murders?\nMaggie and Paul Murdaugh were shot and killed the evening of June 7, 2021, on the family's property in Islandton, South Carolina.\nIt wasn't until July 14, 2022, more than a year later, that authorities pointed to Alex Murdaugh as the killer, indicting him on two counts of murder.\nWhere is the Murdaugh trial being held?\nThe trial is taking place in Walterboro, South Carolina at the Colleton Country Courthouse.\nJudge Clifton Newman is presiding.\nWhere did the Murdaugh murders happen?\nBoth Maggie and Paul were killed at the Murdaugh estate, called 'Moselle' in Islandton, South Carolina.\nThis is also the home where Gloria Ann Satterfield, long-time housekeeper for the Murdaugh family, died following a fall down the stairs.\nAlex Murdaugh was later investigated by the South Carolina Law Enforcement Division (SLED) in connection with Satterfield's death over allegations he stole insurance settlement funds from her heirs. Murdaugh also faced a civil suit from Satterfield's sons in connection with those allegations.\nWho is Rogan Gibson?\nRogan Gibson, a friend of Paul Murdaugh's, was named a number of times in day six of the trial.\nGibson's communications via text and call with Paul were presented as evidence to help establish a timeline of the murders.\nSLED Senior Special Agent Jeff Croft shared cell phone snapshots of text exchanges between Gibson and both victims, as well as a call log showing Gibson attempted to call Paul numerous times without answer.\nLogs also showed that Gibson missed a number of calls from the defendant Alex Murdaugh.\nWhat is the significance of the 300 Blackout rifle?\nDuring week one of the trial, prosecutors said markings, model and brand information for the 300 Blackout rifle cartridges found at the crime scene matched other ammunition found throughout the Murdaugh estate.\nThe defendant Alex Murdaugh purchased a 300 Blackout style rifle for his son Paul in 2017, which could not be found. Murdaugh's attorney Richard Harpootlian maintains it was stolen.\nWhat are the charges against Alex Murdaugh charged?\nMurdaugh is facing double-homicide charges, accused of killing his son Paul, 22, and wife Maggie, 52.\nMurdaugh also is the subject of other state investigations and has been indicted on roughly 100 additional charges. Those charges include tax evasion, drug trafficking and fraud.\nHis cases have thrust the small town of Walterboro and Colleton County, South Carolina, into the national spotlight.\nThe criminal saga of Alex Murdaugh, whose family had control over a local prosecutor's office in Hampton County for over 80 years, stretches back nearly a decade. Following the June 2021 shootings, law enforcement began to investigate two other deaths in connection with Murdaugh. He himself survived a gunshot during a drive-by shooting prosecutors allege was part of a failed insurance fraud scheme.\nHow is the PMPED law firm/Parker Law Group related?\nPMPED (now called Parker Law group) is the family law firm where Alex Murdaugh was formerly employed. The name stands for the initials of Peters, Murdaugh, Parker Eltzroth and Detrick.\nMurdaugh resigned from the firm after being accused of stealing funds. Judge Newman ruled on Monday that evidence of Murdaugh's alleged financial crimes will be admissible in the case. On Thursday Jeannie Seckinger, the CFO of Parker Law Group, testified she had confronted Murdaugh about missing legal fees the day of the murder. The jury was not present for this testimony.\nFilings from the prosecution indicate they allege Murdaugh carried out the murders to distract PMPED from his financial crimes. The state also plans to call Annette Griswald, Murdaugh's former paralegal who first sounded the alarm bell on the alleged finacial crimes .\nMurdaugh trial witness list\nMore than 250 people are on the potential witness list for the defense and prosecution.\nThe list includes agents from the South Carolina Law Enforcement Division (SLED), forensic experts, Murdaugh family members and medical professionals. Murdaugh himself eventually took the stand as well, proving perhaps to be the defense's most key witness.\nWho are Alex Murdaugh's attorneys? Richard \"Dick\" Harpootlian leads defense team\nJudge Clifton Newman is presiding over the trial and Murdaugh's defense team is headed by attorneys Richard Harpootlian and Jim Griffin.\nHarpootlian is a trial lawyer with decades of experience, having worked as a prosecutor, defense attorney and civil litigator. He is no stranger to high-profile cases. Notably, in 1983, Harpootlian sealed a death-row conviction for the prosecution of Donald “Pee Wee” Gaskins — a notorious serial killer.\nGriffin is both a trial lawyer and health care attorney and has extensive experience in representing clients charged with federal crimes, including various classifications of fraud, public corruption, and criminal tax charges.\nWho is the prosecutor in the Murdaugh trial? Creighton Waters leads the team\nCreighton Waters is the chief attorney for the State Grand Jury division of the South Carolina Attorney General’s Office and is the lead prosecutor in all of the criminal cases involving Murdaugh.\nWaters, 52, has worked for the Attorney General’s Office for more than 24 years. He has won State Grand Jury indictments on corrupt law enforcement officers, as well as school district and county officials. His work has earned indictments on more than 100 suspects following investigations into drug operations in the state prison system.\nSince 2019, Waters’ primary focus has been on unraveling Murdaugh’s alleged web of financial and drug-related crimes, and leveling indictment after indictment against the disbarred attorney and several of his alleged accomplices.\nPaul Murdaugh boat crash\nIn July 2021 court documents were filed alleging a civil conspiracy that would have connected law enforcement with members of the Murdaugh family after a 2019 Beaufort County boat crash killed Mallory Beach, 19.\nPaul Murdaugh, Alex Murdaugh's late son, was allegedly driving the boat when he crashed into a bridge, resulting in Beach's death and injuries to the two other passengers on board. He was awaiting trial after pleading not guilty to three felony counts of boating under the influence. The boat was owned by Alex Murdaugh.\nIn court proceedings Sgt. Daniel Greene of the Colleton County Sheriff's Office testified that Murdaugh, moments after officers arrived on the scene the night of Maggie and Paul's death, told them that the shootings were likely related to the 2019 boat crash and threats his son had been receiving.\nWho is Buster Murdaugh?\nAlex and Maggie Murdaugh had two children: Paul, who is the subject of the murder trial and one other surviving son Richard \"Buster\" Murdaugh.\nBuster is on the witness list for the trial. He attended law school at University of South Carolina before being kicked out over accusations of plagiarism, according to the Wall Street Journal.\nBuster and Maggie Murdaugh were both named in the wrongful death lawsuit brought by Mallory Beach's family following the 2019 boat crash, but their names were eventually dropped in the settlement. Buster was charged originally because his ID was used by younger brother Paul to buy the alcohol in his system at the time of the crash.\nAlex Murdaugh trial jury selection\nJury selection began Monday, Jan. 23 in a Walterboro, South Carolina, courtroom for the highly anticipated trial.\nAttorneys narrowed down a list of 900 residents to a potential jury pool of roughly 150 in open court and made further cuts in judge's chambers. On Wednesday, Jan. 25, they settled on a final jury of four white men, six white women and two Black women. The alternates include two white men, one white woman, one Black man and two Black women.\nThe South Carolina Attorney General's Office is seeking life in prison for Murdaugh if he is convicted.\nAlex Murdaugh trial opening statements\nOpening statements were given by state prosecutors and defense attorneys on Wednesday, Jan. 25.\nLead prosecutor Creighton Waters asserted evidence would show a \"perfect storm\" was brewing that led Murdaugh, 54, to kill his wife and son in June 2021. Dick Harpootlian, Murdaugh's defense attorney, reminded the jury his client is innocent until proven guilty and dismissed the state's evidence and mere \"theories.\"\nWaters detailed a precise timeline of the crime in his opening statement, drawing on ballistic and forensic evidence, cell phone data and video footage of the crime scene. He alleged Murdaugh used a family gun, which is now missing, to commit the murders, then drove to his mother's house before returning home later and phoning 911.\n\"You are going to see what he did to Maggie and Paul, and it is going to be gruesome,\" Waters said.\nContributing: Michael M. DeWitt Jr. and N'dea Yancy-Bragg",
  "word_count": 6840,
  "scraped_at": "2026-02-14T11:59:54.445840"
}