{
  "article_id": "78d900b7271f",
  "url": "https://www.dailyliberal.com.au/story/8800715/dubbos-miley-shipp-thankful-for-john-moriarty-foundation-support/?cs=113",
  "title": "Dubbo Miley Shipp thankful for John Moriarty Foundation support | Daily Liberal",
  "date": "20241024T083000Z",
  "domain": "dailyliberal.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Miley Shipp may only be 16 but she's already achieved more than many footballers do in a lifetime.\nSubscribe now for unlimited access.\nor signup to continue reading\nShe's played for her state, won a who host of awards, featured in official A-League videos, and had her name in publications like the New York Times.\nBut you wouldn't know it when she's at home in Dubbo running around the same grounds she had for more than a decade.\nThere, she's just another kid - albeit with a slightly higher skill level - who simply loves the game.\n\"It's really crazy just how far I've gone in the last year or so. It's been a big step,\" Shipp said.\n\"I'm beyond proud of what I've got to do. It's really amazing.\"\n\"Crazy\" is a good way to sum up the last 18 months.\nDuring the FIFA Women's World Cup in Australia last year, Shipp got the chance to be a ball kid for one of the Matildas' matches while she was also profiled as a rising star and passionate fan of the game for the New York Times' sport department, The Athletic.\nFor the past two seasons, she has travelled to Sydney almost every weekend during winter to play club football with the University of NSW in the leading NSW NPL 1 competition.\nShe also captained the NSW side that won the NAIDOC Cup, played for the the NSW Country under 16s, earned selected in the NSW under 16s squad, and was most recently selected in a NSW Regional Under 18s team which flies out next week to compete in the Malaysia Borneo Cup.\nFor a player who dreams of representing her country and the Matildas, the first opportunity to play overseas is a thrilling one.\n\"I'm really excited. I just can't wait to go overseas and play,\" she said.\n\"I think it will be really challenging but I think it will also be really good.\"\nMuch of what Shipp has gone on to achieve has been possible thanks to the John Moriarty Foundation.\nShipp was a primary school student when she first became a scholarship holder with JMF, an initiative for Indigenous players aged two-18 which helps drive change through on-field activities and a focus on education.\nTiffany Stanley, a JMF coach, has worked closely with Shipp throughout her time with the program and is one of the many pleased to have been a part of the Dubbo College star's development.\n\"I am so proud,\" Stanley said.\n\"Seeing Miley achieve everything, it just makes me want to cry, because it makes me realise I'm doing something right.\n\"We see a lot of kids and sometimes you wonder if you're doing enough, but seeing Miley succeed and excel in her football, it makes me realise I am.\"\nShipp said JMF has played a huge role in her own skill development and she has relished taking on a more senior role in the Dubbo program.\nWhile she is still one of the junior players, her advanced talents mean she has outgrown it in some respects, so she's now turned her handing to coaching those younger than her.\nShe said she was proud to be a role model for those up-and-coming Indigenous players and it's aspects of Shipp's personality like that which means a huge amount to those closest to her.\n\"She won't ever forget where she's come from, she doesn't,\" Stanley said.\n\"She knows who she is and is a very big advocate for the younger kids. She shows them it doesn't matter where you come from or who you are, you can go places if you're determined and committed.\n\"She's a very good leader for the kids and showing them right for wrong.\"\nSo much of what Shipp has achieved is the result of hard work, dedication and sacrifice.\nHer parents, particularly father Kevin, play a huge role and have driven her around much of the country in order to play the game she loves.\nTo play for UNSW, the family was leaving Dubbo at roughly 4am every week and returning late that same night.\n\"I just sleep most of the way,\" Shipp laughed, before speaking about what the game meant to her.\n\"Soccer's pretty much my whole life. It's been with me since I was four, I've grown up with it.\n\"I'm super thankful. I get so much support from my family and obviously JMF. It's so much and it's really, really helpful.\"",
  "word_count": 743,
  "scraped_at": "2026-02-14T12:18:42.787266"
}