{
  "article_id": "78e6121ccc7f",
  "url": "https://www.newcastleherald.com.au/story/8844097/2025-npl-mens-and-womens-northern-nsw-fixtures-released/?cs=13296",
  "title": "2025 NPL Men and Women Northern NSW fixtures released | Newcastle Herald",
  "date": "20241211T060000Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A grand final rematch and five days straight of matches will kick off Northern NSW Football's premier competition next year.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe NPL Men gets underway with newest club Belmont Swansea United, who earned promotion from Northern League One, hosting Adamstown Rosebud at Blacksmiths Oval on Thursday, February 13.\nDual title-holders Broadmeadow begin their premiership-championship defence when they travel to Jack McLaughlan Oval to face Edgeworth in a grand final rematch on Friday, February 14.\nMagic claimed the 2024 championship with a thrilling 2-2 (4-3) grand final victory over Edgeworth on penalties.\nNewcastle Olympic, who have signed former Newcastle Jets striker Roy O'Donovan, will host Cooks Hill United at Darling Street Oval and Valentine FC play Maitland at Cooks Square Park on Saturday, February 15.\nCharlestown Azzurri are at home to Weston at Lisle Carr Oval on Sunday, February 16 then Lambton Jaffas play New Lambton at Arthur Edden Oval on Monday, February 17.\nPromotion and relegation was reintroduced in 2024 for the men's premier competitions and returns next year.\nThe 12th-placed side at the completion of the 2025 NPL Men's season will be relegated to Northern League One, while the second-tier competition's top team will earn promotion.\nThe team which finishes 11th in NPL Men joins the Northern League One second, third and fourth-placed sides in a promotion-relegation play-off series.\nThe winner will gain entry into NPL Men for 2026.\n\"The return of promotion and relegation in the 2024 season made for one of the most thrilling seasons of NPL Men's Northern NSW we've had,\" NNSW Football general manager football operations Liam Bentley said.\n\"Adamstown Rosebud narrowly escaped relegation and Belmont Swansea United earned their way into our top-tier men's competition after an outstanding season in HIT106.9 Northern League One.\n\"Broadmeadow Magic became the benchmark side in 2024 but there are so many strong clubs across the competition now which is great for football in northern NSW.\n\"We have made a concerted effort to spread the matches for each league throughout the weekend this season, with more Friday night football and multiple timeslots on Saturdays and Sundays to make it easier for everyone to get to or watch more games than ever before.\"\nLake Macquarie City were relegated to Northern League One and host South Cardiff in round one at Lake Macquarie Regional Football Facility on Friday, March 14.\nDudley Redhead United, who were promoted from Zone League One, face Toronto Awaba at Lyall Peacock Oval on Saturday, March 15 in their first outing.\nElsewhere in Northern League One's first round, Cessnock City welcome Singleton to Turner Park and West Wallsend meet Thornton at Johnston Park on Saturday, March 15 while Kahibah and Wallsend battle at the Gardens on Sunday, March 16.\nIn NPL Women, Broadmeadow and Newcastle Olympic face an opening-round showdown at Magic Park on Friday, February 14.\nNew Lambton play defending champions Charlestown Azzurri at Alder Park on Saturday, February 16 and newcomers Lake Macquarie City, who replaced Warners Bay, face 2024 premiers Maitland first-up at Cooks Square Park on Sunday, February 16.\nAdamstown have the bye in round one after the withdrawal of Mid Coast from NPLW.\nLake Macquarie City will play their games out of Lake Macquarie Regional Football Facility on a mix of grass and synthethic pitches while Macquarie Field undergoes an upgrade.\nA pre-season Charity Shield double-header at Jack McLaughlan Oval launches the season on Friday, February 7. In the women's match, State Cup winners Olympic play NPL champions Charlestown.\nIn the men's fixture, NPL champions Magic face State Cup victors Lambton.",
  "word_count": 599,
  "scraped_at": "2026-02-14T12:49:00.543912"
}