{
  "article_id": "78f91efcbf91",
  "url": "https://www.afl.com.au/aflw/news/1428575/ten-seasons-100-games-and-bulletproof-ebony-marinoff-and-ally-andersons-streak-thats-defied-injury-and-the-odds",
  "title": "Ten seasons , 100 games and bulletproof : The streak that defied injury and the odds",
  "date": "20250928T004500Z",
  "domain": "afl.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "TEN SEASONS, nine years, 100 games, and they've never missed. Ebony Marinoff and Ally Anderson are bulletproof.\nThey have played every possible game since making their AFLW debuts back in round one, 2017 and so, alongside their respective clubs of Adelaide and Brisbane, they will make history when they run out for their 100th career games on Sunday afternoon.\nAlong the way there have been incidents that threatened their perfect records. Injuries, match review sanctions and Tribunal appeals, finals qualifications, and form. But they've fought through it all to keep the streak intact.\nNot even the most gruesome of injuries in Darwin back in 2018 could keep Marinoff off the field, with Adelaide high performance manager Jordan Sellar's favourite story about the star still vivid in his memory.\n\"We were playing a game against Fremantle up in Darwin, and in that game, I think there's a famous photo of her face looking a bit like the Wilson volleyball from 'Castaway'. She got her eyebrow split open in the first quarter and then had it stapled,\" Sellar told AFL.com.au.\n\"It was still bleeding a little bit through the Vaseline and everything in the second quarter, so half-time up in Darwin, in the humidity, she's paying attention to (coach) Bec Goddard during the huddle and the doctor's taking the staples out and stitching her eyebrow up properly.\n\"But then she goes out in the third quarter and has a little bit of a collision, and you can see she just pauses for a moment, something's not quite right, but her eyebrow looks okay. She runs around and plays the rest of the game, and something seems a little bit off. You can't really hear her out there, she's not as vocal, she's making some weird movements between stoppages.\n\"The game finishes and we get out to her on the ground, and she's essentially bitten her tongue in half in the first contest of the third quarter. It was still connected, but it needed about four stitches across it to put it back together.\"\nMarinoff was sick of coming to the bench, so she just played out the game with her mouth closed, tongue hanging on for dear life.\n\"I think that tongue's going to need some work at the end of her career,\" Sellar chuckled.\nReally, it's remarkable to have two players from two different clubs notching up the milestone on the same day.\nAnd they haven't just played week in, week out. They've consistently done it at a high level.\nBoth have won an AFLW best and fairest award, multiple premierships, club best and fairests, and have been named in the All-Australian side more than once. They embody what high performance in the AFLW looks like.\nThey might be some of the most decorated players in the League, and they're preparing to make history together, but they trod differing paths in the early days.\nMarinoff was the exciting teenager in the inaugural AFLW season, the young gun in a premiership team, while Anderson was a touch older, selected by Brisbane with pick No.47 in the 2016 Telstra AFLW draft.\nBut what has always been consistent for both players is the willingness to simply do the work to get better.\nAnderson, who came into the AFLW as a little known 22-year-old out of Zillmere in Queensland's state league, wasn't the walk-up start in Brisbane's midfield that she is known as today. Instead, she was named on the bench in every game across the 2017 season, and deemed a rotation option through the contest.\nWhat she did from there has become lore at the Lions; look at what you can achieve if you put in the work.\n\"The evolution of Ally from season one has been quite extraordinary,\" Brisbane high performance manager Matt Green said.\n\"Season one, she didn't feel that she was ready and that she shouldn't get drafted. But she walked away from season one pretty unhappy with how she went, and I think that was a real catalyst for her.\n\"We use her story a lot with our new players coming in about what you're capable of doing in the first 12 to 24 months in an AFLW system … People don't look back on season one and think about Ally Anderson in our team.\"\nTeammate Jade Ellenger, who now has a regimented warm up routine with Anderson before each training session and game, can attest to this. Anderson was a role model well before Ellenger landed at the Lions in 2019 because of her ability to keep levelling up.\n\"Ally Anderson's hitting her prime at 30,\" Ellenger said.\n\"What she's done in her career, she didn't come into the AFLW the superstar she is now, she worked her god damn ass off to get where she is. From a gym perspective, and she'd be the first to admit, in her first few years that wasn't her strength, but now she is one of the strongest in our team, and she's incredibly fit.\n\"I've never told her that she's my role model, but she's been so instrumental, like a football idol to me… she's slowly guiding me into a professional athlete. She doesn't do it in a way that's telling you want to do; she just leads by example.\"\nMarinoff, meanwhile, hit the AFLW with a bang. A top 10 pick in the inaugural draft, and the very first Telstra Rising Star winner.\n\"Out of anyone in the competition, (Marinoff) would be the most hard working, dedicated player ever. She's always trying to find ways that she can improve her game, improve the team, and she's just fully invested in AFLW and just becoming the best player and person she can be,\" long-time teammate Anne Hatchard said.\n\"Being alongside her in the midfield where we work so well together, bouncing off each other, when I see her pushing, trying to get better it's like 'f***, I've got to keep improving to keep up with her'. It's just awesome to have had her along this journey, and to see each other grow and build. She helps me each and every day.\"\nAccording to both Sellar and Green, both of whom were there on day one, and are still there today, there's no real secret to their success.\nAttention to detail, consistency, and work ethic.\n\"Perhaps more than anybody I've ever worked with, (Ebony) has the most tremendous attention to detail and work ethic for the mundane and boring parts of physical preparation and recovery, nutrition, management of her body. Seven days a week, for 365 days a year,\" Sellar said.\n\"She's phenomenal in that space, and it's as much about what she does when she's away from the club, or outside of our programmed hours, as it is what we deliver to her. And so, from a work ethic and attention to detail standpoint, she's one of the very best I've ever had a chance to work with.\"\nThe concept of 'working hard' over an off-season is pretty simple. Volume running and strength work. It might be repetitive, it might be boring, but it's proof that getting the basics right – both on and off the field – can be the difference.\nGoing to this effort during summer, means that when Marinoff and Anderson then rock up at the club for the first official day of preseason, they're ready to refine their craft and work on technical footy skills.\nThis diligence around preparing and maintaining themselves physically also makes them less susceptible to injury – another key to their ability to turn up and play every single week.\nThey haven't slid through 99 games of AFLW footy totally unscathed, but their threshold to fight through and manage pain despite injury has kept them from missing.\nOver the most recent off-season Anderson had a 'clean out' of her foot – something she has undergone multiple times throughout her AFLW career. But soft tissue injuries have been something Anderson has been able to avoid.\n\"Everyone looks for that magic bullet, but for us and for Ally, and Ally's the shining light of it, is that she's just consistent with all of the high-performance behaviours that we drive,\" Green said.\n\"And it's not just one thing. Ally ticks every single box.\"\nMarinoff famously battled a syndesmosis injury in the 2022 (S7) finals series, but she pushed through.\n\"She's the most stubborn player I've ever worked with. Men's, women's, any sport. She's more stubborn than anyone I've ever come across,\" Sellar said.\n\"She was quite firmly advised, particularly with relation to that syndesmosis, that was something that required surgery or at the very least, a period of time to rest. But, given our situation in that particular year, that advice didn't go over particularly well.\"\nHatchard, one of the toughest players in the AFLW, still wonders how Marinoff played through the injury.\n\"Honestly, I would be in a wheelchair, I don't know how the hell she did that,\" Hatchard laughed.\n\"She does things that other people just can't.\"\nLooking back on all the pair have achieved, there is a sense of pride for Sellar and Green for what Marinoff and Anderson have done for not only their clubs, but for the AFLW more broadly along the way.\n\"We lean on her story a lot because it's one that we're incredibly proud of as a football club, about how she's developed, the person she is, importantly, and that provides us with a lot of pride when we're bringing in new players,\" Green said of Anderson.\n\"It's more about her as a person, and her as a footballer, and the role modelling she does. Not only for our players, but the role modelling she does for women's sport in general, for young girls coming up to have someone to look up to. Just incredibly proud.\"\nBoth have a nonchalant attitude toward individual accolades, but that just means everyone else can wax lyrical about how important they've been.\n\"I'm proud of her, and proud of all of them, and the program and what it's become… I hope the ones that were around from the beginning appreciate just how much of a pioneering job they did, and how special and how significant those early years were,\" Sellar said.\n\"Because, soon enough, this is just going to be another professional support, another pathway, another opportunity that's there for the girls and anyone that wants to play the game. To see the work people like 'Noffy' put in early to drive those professional standards and essentially demand that it became what it has become is pretty impressive.\"",
  "word_count": 1766,
  "scraped_at": "2026-02-14T13:33:24.519712"
}