{
  "article_id": "790118b1937b",
  "url": "https://www.westernpeople.ie/your-community/local-notes-mickey-flatley-minor-player-of-the-year-at-kiltimagh-gaa-annual-presentation_arid-10946.html",
  "title": "Local Notes : Mickey Flatley , Minor Player of the Year at Kiltimagh GAA annual presentation - Community",
  "date": "20240305T231500Z",
  "domain": "westernpeople.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In conjunction with Seachtain na Gaeilge CLG Coillte Mach are organising a bilingual Table Quiz in Teach Ó Hóra on Thursday, March,14, at 9.30pm.\nTar isteach ar an oíche don craic agus spraoi. Gaeilge do gach éinne. Ní gá bheith buartha faoin Gaeilge. Bí linn do Seachtain na Gaeilge. Fáilte roimh gach éinne.\nAfter their successful three nights in the Town Hall Theatre with ‘Stolen Child’ Clann Machua Drama Group have started their journey on the All Ireland Drama Festival circuit with their first outing at the weekend in Castleblayney on Sunday night and Tubbercurry on Monday night.\nUnfortunately they had to cancel the play in Westport last Wednesday night owing to one of the cast suffering a sudden bereavement.\nThey are in the Linenhall Theatre in Castlebar on March 14, at the West Cork Festival on March 16, in Claregalway on March 21, Claremorris on March 22 and in Glenamaddy on March 24. They also intend to reschedule their date in Westport at a later time. They are wished the best of success on their travels.\nGood luck to Kiltimagh Knock United player Ava Mitchell in her upcoming All-Ireland final with the Mayo schoolgirls U14 team.\nTwenty one players competed in Round 6 of the Kitimagh Poker League in Teach O’Hora on Wednesday night last and the prizewinners were; 1 Marc Shepherd, 2 Keith Lydon, 3 John Borza, 4 Pat Boyle. The other finalists were; 5 Paul Walsh, 6 Gerry Groarke, 7 Isaac Boyle, 8 AN Other, 9 Mary McGlynn. Isaac Boyle remains clear at the top of the league table with 113 points. He is followed by Michael Sheridan on 92 and Bart Furtak on 85. The rest of the top twelve is; Michael Sheridan 82, AN Other 79, Pat Boyle 78, Mossie O’Connell 77, Michael Higgins 77, Gerry Groarke 76, AN Other 73, Martin Regan 73, John Reynolds 72.\nCongratulations to Andrew Maloney, Cordarragh, Kiltimagh, on being awarded a Papal Cross medal. Andrew was the only young person in the Diocese of Achonry to receive the award this year. Congratulations also to his parents Andrea and Tommy, Fr Pat Lynch, Fr Michael Quinn and Deacon Martin Lynch.\nCongrats to Shane Freeman, Kiltimagh, who won the GAA Club’s 50/50 jackpot of €595 at the draw held in Langan’s Bar on Saturday night, February 25.\nCongratulations to Kiltimagh Knock United's Mary Moran who has signed for the Mayo FC Women's U17 squad for the upcoming League of Ireland Academy season.\nThe winners at the February monthly members draw held at the weekend at Kiltimagh District Credit Union were; 1st prize €500 Dominick Geraghty, 2nd €300 Michelle Carney, 3rd €200 Ann McNicholas, 4th €200 Pat O’Neill, 5th €200 Mary O’Donnell.\nKiltimagh Knock United have bowed out of the Connacht Shield. Goals from Jojo Glynn, Conor Prendergast and Rafael Costa weren’t enough when KK came up against a well drilled Mervue United B side who prevailed 4-3.\nSt. Louis Community School was delighted to welcome former Mayo footballer Cora Staunton into the school last week for an interview with some of the transition year students for a documentary on gender equality in education. A big thank you to Cora for visiting the school to do the interview and meeting some more of the students around the school after - everyone was delighted to see her.\nOisin Boland from Aghamore was the lucky winner of €315 in the Kiltimagh Knock United 50/50 draw last week, Jennifer Folliard was the previous week’s winner of €315.\nFrancis McNicholas and Tom Flatley were the winners of the first prize at the 25 card game in Kiltimagh on February 24, second were Michael Carney and Michael Costello and third prize was shared by Tom Begley and Seamus Larkin and Hugh Forde and Tom Walsh Last 10 Tom Conroy and Joe Boyle, spot prize Martin Regan and Danny Doherty, Raffle winners were Michael Carney, James Walsh, Flor Higgins and Liam Moran. Game starts at 9pm every Thursday in the Parish Centre at rear of church.\nThe Knock Shrine Bereavement Support group meet every Wednesday at 11am at the Family Centre, Knock. Following a family bereavement you can feel very lonely. Sometimes spending time with others who know the experience can be helpful. Further information from Monica Morley 094 9375320.\nThe results from last Tuesday night’s game held in the Park Hotel, Kiltimagh, were 1st Thomas McNicholas and Cait McTigue, 2nd Jimmy Morley and Sheila McNicholas, 3rd Brenda McNicholas and Bernie Byrne, 4th Robert Healy and Frances Healy, 5th Geraldine Forde and Jerome Tarpey, 6th Cora Waldron and Tom Grogan, 7th Martina O’Hara and Cathy McNamara, 8th Bridie Grogan and Kathleen Morley.\nThe results of the competition for prizes on February 20, were Ray Nally and Mary Colahan, 2nd Kathleen Morley and Bridie Grogan, 3rd Bernie Byrne and Brenda McNicholas, 4th Michael Gallagher and Leona Connery, 5th Tony King and Eileen Mulderrig, 6th Eugene and Eilish Gallagher.\nKiltimagh Bord na nOg are again running an Easter Camp for children from junior infants to 6th class. This camp will be held at the COE Bekan on March 26, 27, 28 from 10am to1pm. It will be fully supervised by the club’s volunteer coaches and is a fundraiser for the Kiltimagh Bord na nÓg. Activities will include football, rounders, soccer, hurling and plenty of fun games.\nCost is €30 for one child and €60 for two (or more children). All dues will be collected on the Monday morning of the camp from 9.30am. There is a lot of interest already so places will be limited. Registration must be completed by March 15. Enquiries to Mark Jennings on 085 1555077 or any member of Bord na nÓg committee; for registration call Karol Rushe on 086 311 7498. Kids are advised to bring a snack for break time and appropriate sports gear.\nCalling all community groups, clubs, charities and voluntary organisations in Mayo to register with Mayo Volunteer Centre and avail of the wonderful services we provide: assistance with volunteer recruitment, volunteer management training, volunteer policy development, promotion of volunteering locally and nationally, Garda vetting service and training. The majority of these services are free of charge to organisations coming from the categories listed above. For more information or to sign up visit www.volunteermayo.ie or contact the office on 096 71444 or by emailing: vincent@volunteermayo.ie.\nAlone is looking for volunteers in Mayo and surrounding areas for older people who need befriending visits for up to one hour per week and/or telephone support for up to 2 hours per week. The befriending program is designed to help older people combat loneliness and isolation. If this is something that interests you, please phone 086 0135043, email paul.stafford@alone.ie or follow the links www.alone.ie.\n*******************\nYour prayers are also requested for the happy repose of the soul of Brendan Fitzpatrick, Swords, Dublin, who died on Friday, February 16, and whose funeral took place in Dublin on Wednesday, February 21. He was a brother-in-law of Terry Mullaney, Toughnane. May he rest in peace.\nAs part of the 50th anniversary this year, Moy Davitts is compiling a special commemorative book looking back at the five eventful decades of the club’s history. This book will be launched at a special club event later this year.\nThe committee are on the look-out for material which can be included in the book including old match programmes, press cuttings, articles, team photos, pictures from special trips and events, or anything you may have relating to the club’s development over the past number of years.\nSo, if you have any material which you would be happy to share, email the details to: moydavitts50@gmail.com or call Bernie on 086 853 2293 for further details.\nCPR and AED course will be held in The Sheridan Memorial Community Centre, Bohola, on March 28, at 6pm. The cost is €50 per person, limited spaces. Contact Eimear Morrin at 087 1810827 to sign up.\nA one day Easter Camp will be held on Friday, April 5, from 10am - 2pm in Bohola Community Centre. It is suitable for boys or girls 6 - 12 year olds and costs €20 for one, €35 for 2 siblings. An action packed day of fitness, games, fun challenges and fundamental movement activities. Booking is essential so contact Euan McDonnell 089 4282157.\nThe death occurred of Padraic Filan, Rathruane, who died on Wednesday last, February 27, and whose funeral took place in Bohola on Saturday last. Sincere sympathy to all of Padraics family and friends.\nMS Ireland thank all who contributed so generously to the recent church gate collection in Bohola and Shraheens. The amount raised was €300.11. All monies raised will go directly to the provision of services to persons from Mayo who live with MS.\nCongratulations to Dara Gaughan, Attymass, who won a jackpot of €388 in the Moy Davitts 50/50 draw on Saturday, February 24. Tickets are available in the usual retail outlets and by clicking https://smartlotto.ie/Bohola-moy-davitts.\nCANA Talks ‘A Roadmap to Happiness’ will be held in the TF Royal Theatre, Castlebar on Friday, May 31, at 8pm. There will be 6 speakers plus special guests. Each speaker has just 15 minutes to inspire you (from a faith perspective). Enjoy real-life stories, humour, inspiring talks, great visuals, music, and more. This is not a conference, but a show! Tickets cost €20 plus booking fee at www.ticketmaster.ie. Can pay cash at the door.",
  "word_count": 1562,
  "scraped_at": "2026-02-14T14:10:24.081905"
}