{
  "article_id": "791f32ba7488",
  "url": "https://www.courant.com/2023/06/20/coventry-softball-league-finally-gets-field-of-its-own/",
  "title": "Coventry softball league finally gets a field",
  "date": "20230620T223000Z",
  "domain": "courant.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "COVENTRY – When Jen Rodgers moved to Coventry eight years ago she realized that there were no softball fields, other than the fields at the schools.\n“I played softball my entire life, it’s been a huge part of my life,” Rodgers said. “I said, ‘Huh, that’s weird, why are there no softball fields? Maybe I should have done research before I moved in.’”\nShe was told that the town softball league played games on the middle and high school fields. But the town’s baseball league had dedicated fields at Miller Richardson Park.\nRodgers, the vice president of Coventry softball league, and others initially went to the town in September 2016 to ask for fields. Seven years later, on Monday night, the town had a ribbon cutting for the new softball field at Miller Richardson. Another field is currently being constructed.\n“I have a daughter who is 28 and she played softball when she was young,” said Marie Gallo-Hall, chairperson of the Coventry Parks and Recreation Department. “The girls did not have adequate fields 20 years ago.\n“This is something that is so long overdue. To have this … and we have another field going in over there … these young women are so awesome and hard-working, it’s about time they have a place to call home.”\nPlayers from the town softball league, who had advocated for the field by carrying signs outside of town council meetings and speaking at meetings in favor of the project, gathered Monday at the field, which will not be used until next spring because it’s not quite ready and the softball season is winding down. So did members of Coventry High’s state championship softball team, who won the Class S title on June 11.\nFreshman Brooke Blouin, who played third base for the Patriots, said she started playing softball when she was 4. She said she spoke at meetings over the last few years.\n“We played at the high school or middle school,” she said. “It was like we were always the second option. It just made you feel bad. You’re a young kid, you want to have Opening Day, but the high school has practice first, so you have to warm up on the football practice field before you play because you can’t warm up on your own field.\n“It makes me feel good that the next generation is going to have a field to call their own.”\nThe process was long and arduous and other sites were considered. But the consensus in the end was that the softball fields should be at Miller Richardson, where the baseball fields are, and that eventually, other recreational venues like pickleball courts could potentially be added there.\n“We wanted to create a real vision for Miller Richardson as a multi-generational, accessible park,” Coventry town council chairwoman Lisa Thomas said. “It can’t happen all at once. It will happen over time. It took COVID to get a lot of people to understand the value of outdoor community spaces.”\nIn November 2021, town residents voted in a referendum to spend $325,000 for the field that has been completed. A state grant is paying for the second field. The town also used federal money to relocate a transfer station that was on the site.\nThe league can now put advertising signs up on the fences to offset costs, something that could not be done at the school fields. Earth Dynamics, a Mansfield-based company which did work on the site, donated a scoreboard.\nBonnie Edmondson, a town resident who was a coach with the U.S. track and field team at the 2016 Olympic Games in Rio de Janeiro and also coached at six track and field World Championships, was asked to help with the project. She said Monday she had always stood for equity in girls and women’s sports and when she discovered inequity was occurring in the town in which she grew up, she was compelled to do something.\n“We’ve really come so far,” she said. “One of things we’ve been fighting for is gender equity and the spirit of Title IX, having equitable facilities, and our town really answered the charge.\n“We had key people in place. The young girls – one of the neatest moments for me was looking outside, we were at a town council meeting, and outside the window, were the young women holding signs that said, ‘Equal the Playing Field.’ They were the voices that made the difference. The young women learned skills about advocacy, communication, leadership.\n“Overall, I couldn’t be more pleased.”",
  "word_count": 758,
  "scraped_at": "2026-02-14T13:08:04.536824"
}