{
  "article_id": "794366658ce6",
  "url": "https://kingfm.com/ixp/1004/p/hulstrom-why-arent-students-showing-up-for-pokes-hoops/",
  "title": "Hulstrom : Why Arent Students Showing Up For Poke Hoops ? ",
  "date": "20241121T144500Z",
  "domain": "kingfm.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hulstrom: Why Aren’t Students Showing Up For Pokes’ Hoops?\nLARAMIE - Is it the team's recent history of losing? The ever-changing weather in Laramie? Tip times? Lack of promotion?\nAll of the above -- and more -- if you ask some current University of Wyoming students why they aren't showing up to the Arena-Auditorium for basketball games, more specifically on the men's side.\nOur Paityn Hulstrom inquired. Here's the feedback:\nAvery Strand, a sophomore, said she only went to one basketball game last season. When asked how it went, she laughed -- “We lost.\"\n“I think football, overall, is just a more popular thing,” Strand said, referring to why the student section inside War Memorial Stadium is full throughout the fall and the same area inside the A-A isn't. “The weather is nicer and people are more into it. For the non-university attendees for basketball games, driving in the winter is different than driving in the fall.”\nBlake Hogan, also a sophomore and member of the Sigma Nu fraternity, is a big fan of Cowboy basketball. He tries to make it to every game he can.\n“I think Sundance (Wicks) is flipping our program around,” Hogan explained. “He’s a really great community guy. He’s super involved with the student body ... I feel like for the past couple years, it's been trying to reach out to the people who live in Laramie and less of the students. Before, it would just be like, ‘We're offering free stuff, please show up.’ But now, it's like they actually care.\"\nHogan also added his frat is not only supporting the Cowboys but are in the works with the team, planning an event with all of Laramie's Greek Life.\nOther students said game times were unknown. Promotion, that was also nonexistent.\nWhy didn't I attend games?\nMainly it was the timing. During the week, games oftentimes didn’t align with my schedule. I'll admit, I wasn’t brave enough to bear the cold weather. I also couldn't ever find friends that would be willing to go with me. I think, especially as a freshman, if there isn’t a large number of people going to an event, it’s hard to branch out and go yourself.\nWicks, a Gillette native, who is in his first season at the helm, realizes the challenges facing his program.\nYes, travel is difficult in the winter months. So is keeping a roster together. The faces and names have always changed, but now, thanks to Name, Image and Likeness and the transfer portal, players have turned the once aptly nicknamed Dome of Doom into a turnstile.\nFor instance, just five players, none of which were starters -- Levi Brown, Nigle Cook, Kobe Newton, Oleg Kojenets and Cort Roberson -- return from last year's 15-17 squad. Roberson walked on to the team before the 2021-22 campaign. That season, the Cowboys earned an at-large bid to the NCAA Tournament, appearing in the First Four in Dayton.\nNot a single one of his teammates from that run remains. In fact, no one from the following year is here anymore, either.\nWicks has already made an effort to get students involved, whether that's \"slices with Sunny\" in the dorms or paying visits to sorority row.\n“If you want love, you’ve got to show love -- and I’m showing love,” Wicks said. “I’m going to continue to go to every fraternity and sorority, every dorm, we’re going to give out tickets in Prexy's Pasture, we’re going to do whatever it takes, because I don’t feel like anybody comes to games, let alone students, if they're not connected to the cause.”\nWicks won't be alone, either.\nIt is a requirement for his players to play their part in the community. An example of that happened on Halloween, when his guys got dressed up, shot some hoops with the kids and handed out candy inside the Arena-Auditorium.\nThe on-court product has already been a breath of fresh air, too.\nWinning, as they say, cures all.\nThe Cowboys are off to a 3-1 start after easily handling Utah Tech 86-69 last Saturday night in Laramie. Though guard Obi Agbim leads the way with 19 points a night, this hasn't been a one-man show. Jordan Nesbitt and Newton are also scoring in double-figures. Big men Cole Henry (7.5 ppg) and Scottie Ebube (7.3 ppg) are inching closer to that mark, as well.\n“For us, culturally, we want to play a brand of basketball that the state of Wyoming is proud of,” Wicks added. “We want to be a reflection of the working men and women and the blue-collar style of business that we go about out here. To me, that’s what it’s about.”\nThe Cowboys host Southeast Louisiana Friday night in Laramie. Tipoff is slated for 6:30 p.m.\nUniversity of Wyoming’s Top 50 Football Players\nGallery Credit: 7220Sports.com\n- University of Wyoming’s Top 50 Football Players",
  "word_count": 814,
  "scraped_at": "2026-02-14T13:18:00.249752"
}