{
  "article_id": "797122303b2a",
  "url": "https://www.birminghammail.co.uk/black-country/minutes-silence-popular-ironman-contestant-27570674",
  "title": "Minute silence for popular Ironman contestant Brendan Wall after tragic race death",
  "date": "20230822T150000Z",
  "domain": "birminghammail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Minute's silence for popular Ironman contestant Brendan Wall after tragic race death\nThe much-loved sales director, who lived in Solihull, tragically died alongside Ivan Chittenden during an Ironman race in Ireland\nA football club will hold a minute's silence before games kick off in tribute to an Ironman competitor who died during a sea swim. Popular sales director Brendan Wall, who lived in Solihull, died alongside Ivan Chittenden, 64, during the event in Youghal, County Cork, on Sunday, August 20.\nTributes were paid upon news the newly-engaged 44-year-old - originally from Ireland - had passed away. But governing body bosses said they had not sanctioned the race due to \"adverse conditions\".\nFamily and friends confirmed Brendan's tragic death. He had become engaged to much-loved fiance Tina earlier this year before sharing the news on social media in May.\nREAD MORE: Heartbroken parents 'left without closure' after toddler's sudden 'mystery' death\nNow, Stourbridge FC has revealed Brendan worked as a sales director for one of its shirt sponsors. Top Tubes Limited had recently agreed to become a headline partner.\nA Facebook post by the club read: \"Stourbridge Football Club is saddened and shocked to report the following news. As many of you will have read recently, Top Tubes Limited have agreed to become the headline sponsor for our women's 1st team and the rear shirt sponsor of our men's 1st team.\n\"April Pearson-Myatt (Director) and Brendan Wall (Sales Director) attended our photo shoot for the teams on Thursday 10th August and were introduced to managers, coaches, players and directors. We are therefore both very shocked and sad to tell you that on Sunday, 20th August 2023, Brendan Wall died during the swim section of an Ironman event in Youghal, Co Cork.\n\"Our sympathies and prayers are with his family, friends and work colleagues at this sad moment. The club will be holding a minute's silence on both Sunday at the Women's cup match v York City Ladies (kick-off 2pm) and at the Men's Bank Holiday Monday fixture v Bromsgrove Sporting (kick-off 3pm). We look forward to your attendance and would ask for your strict adherence to the silence before both kick-offs.\"\nA death notice was posted online by members of Brendan's family. Heartbroken relatives confirmed he passed away while competing in Ironman 70.3 Cork.\nThe post revealed he had a large number of relatives. Family members added Brendan's funeral would be held in Grangegeeth on Thursday, August 24, and be streamed online.\nIn a statement, Triathlon Ireland said: \"As there is an investigation ongoing, at this stage it would not be appropriate for us to make any further comment. Triathlon Ireland will provide any assistance that the authorities require.\n\"We reiterate our deepest condolences to the families of Ivan Chittenden and Brendan Wall. Triathlon Ireland is reeling from the news that Ivan and Brendan tragically died while participating in the race.\n\"Our thoughts and prayers are with Ivan's and Brendan's loved ones. The triathlon community is a very close community and this loss has a devastating effect on all of us.\"\nGot a story? Email josh.sandiford@reachplc.com",
  "word_count": 515,
  "scraped_at": "2026-02-14T12:05:10.797945"
}