{
  "article_id": "79926e4c3b18",
  "url": "https://theprideoflondon.com/posts/one-of-our-own-beever-jones-inks-new-deal-with-chelsea-women-01hn8enrjhx8",
  "title": "One of our own : Aggie Beever - Jones inks new deal with Chelsea Women",
  "date": "20240130T013000Z",
  "domain": "theprideoflondon.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Aggie. Aggie. Aggie. No.33 in blue isn't going anywhere. Chelsea Women's academy trailblazer Aggie Beever Jones was rewarded for her sensational form so far this season with a new contract until the summer of 2026 with an option for an additional year. It comes less than 10 days after Niamh Charles became the sixth member of CFCW's \"2027 club.\" The announcement was made yesterday morning after the west Londoners' three-goal second half that pushed them over the top against Brighton and Hove Albion.\nFor attack-minded players like Reanna Blades, and Aimee Claypole, success in blue can be a reality. Beever-Jones has set the example. Similar to the men's team, talent can be In just 196 minutes in the Women's Super League since her return from Everton, ABJ has found the back of the net on five occasions. Four off the bench. Once from the starting lineup. From the ball girl in south west London to a regular on the senior team. ABJ reflected on what it means to be where she is today in her professional football journey.\n\"There aren’t too many words to sum it up. I’m living the dream, I wake up everyday and I’m honored to be able to share a pitch with the likes of Fran and people who I looked up to when I was younger,\" Beever-Jones said. \"Being a ball girl, I always wanted to play but whether it was going to become a reality was a different question. It’s surreal being able to do it every day, being able to score and help the team the best I can is the icing on the cake.\"\nOn the international stage, Beever-Jones has been a key piece to the recent success of England's U23 national team, contributing to three goals in six games since September. It is only a matter of time before Sarina Wiegman calls her up to the senior national team. Her versatility fits the mold of this club, allowing her to find a spot anywhere on the frontline. No. 33 is an incredibly adaptable player who has created bonds on the pitch with her CFCW teammates in the span of months.\nAggie Beever-Jones solidifies essential depth up top, continuing to inform the public that Chelsea Women can retain players past Emma Hayes' tenure\nBeever-Jones' potential is sky high. You could see it in glimpses in northern England last year. Now, it's all coming together with Hayes providing the platform. That unpredictability with the ball at her feet. An intelligence to create space with wide runs. The efficiency inside the penalty area. We've seen so many positives from her this season, and it's not even February. Here's to many more ABJ celebrations near the corner flag in the SW6.",
  "word_count": 456,
  "scraped_at": "2026-02-14T12:41:19.324789"
}