{
  "article_id": "79967231363e",
  "url": "https://www.cardchronicle.com/2023/3/7/23627566/tuesday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Tuesday afternoon Cardinal news and notes",
  "date": "20230307T200000Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "—Spread check: Boston College by 6.\nTuesday afternoon Cardinal news and notes\nChris “Shred Red” Howle is ready for Mission 11 Straight to commence.\n—U of L baseball returns to the diamond this afternoon at 3 against Morehead State. Here’s a preview.\n—The Chicago Bulls have signed Carlik Jones to a full contract for the remainder of the 2022-23 season.\n—El Ellis wants to leave Louisville as a winner.\n—Most of the time, NIL is cool.\n—Racing Louisville will be in the new FIFA game, which is pretty cool.\n—The mood in Greensboro for this week’s ACC tournament is a bit ... weird.\n—BC Interruption is a little bit worried about Tuesday’s first round matchup against the Cards.\nTues Mar 7 vs. #15 Louisville\n4-27. Dead last in the ACC in offense and 14th in defense. 284th in KenPom. Zero wins away from home. The list goes on and on. Apart from a weird, mid-February win against Clemson, Louisville has had pretty much nothing go right for them this season. This team is bad. And yet, when the Cardinals came to Conte Forum in January, it was a one-possession game with 3 minutes to go. Not to mention, Quinten Post played in that game. If Post sits tomorrow, expect this one to be a challenge for the Eags. Senior guard El Ellis leads the Cardinals with 17.7 points and 4.4 assists a game, and he played a pretty efficient game in the earlier meeting with BC, putting up 17 on 7-11 shooting. Aside from Ellis, there isn’t really another go-to player for the Cardinals. Freshman guard Mike James (10.1 ppg), and junior forward Jae’Lyn Withers (9.0 ppg, 42.1% 3pt) can both do damage, but they have not been consistent enough.\nIf BC hoops want to take a step forward as a program and be taken seriously, they have to take care of this one. With or without Post, the Eagles are the better team. Jaeden Zackery and Makai Ashton-Langford combined for 36 points and 5 steals in the first game vs. Louisville, and the Eagles will desperately need their lead guards to step up again tomorrow. To solidify this season as a success, Earl Grant and co. must at least force a matchup with #7 UNC on Wednesday.\n—Ole Miss reportedly met with Chris Beard today about its head coaching vacancy.\n—Dre Davis notched a new career-high in Seton Hall’s trouncing of No. 25 Providence over the weekend. The former Card says he’s drawing inspiration from his 7-month-old daughter.\n—Our guy Matt Sefcovic keeps tabs on where the baseball Cards stand in the polls after a monster weekend in Houston.\n—I “previewed” the ACC tournament on the first episode of the Mark Titus Show, which you can check out here.\n—Despite being selected in the USFL draft, Malik Cunningham is fully focused on the NFL.\n—Texas Tech has suspended men’s basketball coach Mark Adams for an “inappropriate, unacceptable, and racially insensitive comment.”\n—Kenny Payne hasn’t shied away from entertaining the possibility of Louisville winning five games in five days this week.\nPayne said he understands the hurdles his team is facing but he wants them to continue to fight and he’s still hoping to see some success.\n“I love the fact that a team may be on the bubble that plays Louisville and we pop them; what does that mean for them?” Payne said. “I want us to take joy in having a killer instinct. I want us to enjoy that you have an opportunity that ‘What if?’\n“What if we win the ACC tournament? What If? Now, I understand it’s hard I understand what we are facing, I understand the odds are against us and we are playing teams that are great teams but what if? And if you lose to ‘What if’, then why are we doing this?”\n—ACC coaches discuss where they’d prefer the league tournament to be held.\n—Louisville is a 100-1 shot to win the women’s NCAA tournament and a 500-1 shot to win the men’s ACC tournament according to SportsBetting.ag.\n—A Louisville librarian is making an appearance on Wheel of Fortune this week.\n—JCPS is starting a girls only basketball league in Louisville.\n—Somehow this is real:\n—For at least the time being, Clemson and Florida State seem to be stuck with the ACC.\n—Full details for this Sunday’s Selection Show are here.\n—There are plenty of reasons (video) to be excited about Cardinal baseball right now.\n—Robbie Valentine pled guilty to misdemeanor assault earlier this week.\n—Kaleb Glenn is putting up some big numbers for La Lumiere.\n—Four-star athlete Julius Pope will visit four schools this spring, including Louisville on April 7.\n—Louisville is one of four schools that have been in contact with four-star point guard Darius Carr (2023) who recently decommitted from New Mexico State. Illinois, TCU and Fresno State are the others.\n—The NCAA rules committee has announced major changes to speed up college football games.\n—No consecutive timeouts\n—No untimed down at the end of the 1st & 3rd quarters\n—Running clock after 1st down conversions except within 2 minutes of the 1st half\n—If this week does represent the end of his college career for El Ellis, it’s ending back in his home state.\n—Louisville’s dominance was the biggest takeaway from last weekend’s Shriners Classic.\n—Eagle Insider’s AJ Black is predicting a 9-point Boston College win this afternoon/evening.\n—This is the funniest announcer clip of the season by far.\n—U of L baseball made a “Lone Star Statement” over the weekend.\n—Matt McGavic predicts that Louisville’s season ends today the same way it started four months ago: With a 1-point loss.\n—And finally, beat Boston College.",
  "word_count": 948,
  "scraped_at": "2026-02-14T13:33:53.251800"
}