{
  "article_id": "79aac2978576",
  "url": "https://chicago.suntimes.com/other-views/2025/02/07/diversity-dei-nfl-bears-end-racism-superbowl-trump-eldon-ham",
  "title": "What the future of the NFL commitment to diversity ? ",
  "date": "20250207T133000Z",
  "domain": "chicago.suntimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Diversity, equity and inclusion is suddenly on the ropes. On Jan. 22, President Donald Trump pulled the rug with an executive order terminating DEI programs and policies in the federal government.\nWhat about the NFL’s DEI policy, as defined by its Rooney Rule mandate? Is that on the way out, too? Is the rule effective and helpful, or is it already obsolete?\nOn Monday, NFL Commissioner Roger Goodell publicly reiterated the league’s support for the Rooney Rule and its promotion of diversity. Problem solved? No. The NFL just can’t get out of its own way.\nThe Rooney Rule was implemented in 2003 to bolster diversity in hiring around the league. Now Goodell and the NFL have decided to take a public DEI stand to support its own Rooney Rule as the Trump administration seeks to eliminate diversity from government ranks. Excellent. Someone of power and influence stood up, a huge step for a league that has oft struggled to go all-in on diversity and equal rights.\nNot so fast. It has now been widely reported that the league has decided to erase an end zone message that has appeared in the last four Super Bowls: “End Racism.”\nThe replacement is reportedly a vanilla “Support Love,” normally a nice goal but not if it is misused to placate a thin-skinned administration, given Trump has announced plans to attend Sunday’s Super Bowl game.\nOpponents of the Rooney Rule, a broad DEI fairness mandate, complain that it fosters reverse discrimination and, as such, is not fundamentally fair.\nProponents argue that DEI adds flexibility and adaptability to the whole NFL enterprise, combats discrimination, encourages growth and improvement through diversity and is eminently principled. None of those elements can be perfectly defined or executed, but ideally, the Rooney Rule should promote fairness the best it can without abuse.\nMany critics of the rule also lament that it actually mandates nothing except for meaningless forced job interviews. Some of that is accurate if it is abused or taken out of context. Who is right?\nRooney Rule widens talent pool\nThe rule is meant to broaden the exposure of teams to possible new hires who may otherwise have been skipped over. It doesn’t mean that candidates from minority groups must be hired. But it does force a broader search that includes new or different or lesser-known candidates. Teams become acquainted with a broader range of candidates who could later be recommended to other teams or maybe hired at a later date.\nThe rule forces more possibilities without compelling the final choices. It’s not perfect, but this makes it meaningful without being unfair.\nThe rule was originally adopted from the recommendations of what is now called the NFL’s Diversity, Equity, and Inclusion Committee. The rule “…aims to increase the number of minorities hired in head coach, general manager, and executive positions,” and it now makes a distinction between external hires and interviews versus internal candidates.\nStarting in 2022 the rule was broadened to include female candidates as applicable candidates from minority groups. Recently it has also been quantified to define how many candidates from minority groups to interview for what positions, and also to address in-person and virtual interviews.\nWhat if a team interviews a candidate who is Black for the general manager job, then metaphorically checks that box with no intention of hiring them, or even getting better acquainted? It’s a cynical but necessary hypothetical because such bad faith not only fails to seek meaningful outcomes, it actually exploits the individual candidate with a sham process. One way to improve the rule, then, is to mandate good-faith interviews of generally qualified candidates. That, too, leaves a few holes to define, but it makes sham interviews less likely and harder to disguise.\nSo no, the current rule does not force specific hiring outcomes. That is both an attribute and perhaps a fault, but if the interviews must be in good faith, then the broader purpose is enhanced. The Rooney Rule should not just be about going through the motions.\nThe Chicago Bears are an excellent example of pursuing good practices, even as the NFL can’t seem to decide where it really stands. The Bears website features nine front-office executives. Eight of them are African Americans or women or both, including the team president and CEO, Kevin Warren. The only one who isn’t from a minority group is George McCaskey, who represents the family ownership as chairman. Good for him, but also good for the Bears in pursuing good examples for themselves, the league and best practices for all.\nThey are a leading example of finding the best fits for the organization without regard to race or gender. After all, a diverse working team expands and enhances multiple viewpoints and ideas. That works for football, business, and government.\nI’m not so sure about the NFL. If the removal of “End Racism” occurs, it’s a cowardly step backward. Now that “end racism” has generated a tsunami of publicity, what will the NFL do? Stonewall the issue or take credit for pushing back?\nEldon Ham is a faculty member at IIT/Chicago-Kent College of Law, teaching sports, law and justice. He is the author of five books on the role of sports history in America.\nThe views and opinions expressed by contributors are their own and do not necessarily reflect those of the Chicago Sun-Times or any of its affiliates.\nThe Sun-Times welcomes letters to the editor and op-eds. See our guidelines.\nGet Opinions content delivered to your inbox.",
  "word_count": 917,
  "scraped_at": "2026-02-14T12:43:11.305518"
}