{
  "article_id": "79c021dc28ba",
  "url": "https://mlsmultiplex.com/posts/international-spectacle-washington-spirit-take-on-chivas-in-electrifying-clash-01j38k0wdk7n",
  "title": "International spectacle ! Washington Spirit take on Chivas in electrifying clash",
  "date": "20240720T204500Z",
  "domain": "mlsmultiplex.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When the NWSL teams up with Liga MX Femenil, we can expect nothing less than a spectacle of women's soccer. And this weekend, the Washington Spirit are set to take on Club Deportivo Guadalajara, popularly known as Chivas Femenil, in Chester, Pennsylvania. This clash promises to be electrifying, as both teams bring their best weapons to the field, looking to start the Summer Cup on the right foot.\nFollow MLS Multiplex on X (Twitter).\nThe Spirit arrive in high spirits after an impressive start to the NWSL regular season. With 11 wins in 16 matches, they are third in the table, just four points behind the undefeated Orlando Pride. This performance includes an overwhelming attack, which has scored 32 goals with 12 different scorers. Newcomer Croix Bethune, the team's standout, has already netted five times and is one assist away from tying the NWSL season assists record.\nBut don't think it will be a walk in the park for the Spirit. The team hasn't played for more than two weeks and will face the absence of several stars, who are representing their national teams at the 2024 Olympic Games. Trinity Rodman and Casey Krueger are with the United States, while Hal Hershfelt and Bethune serve as reserves. Gabby Carle is with Canada, and newly signed Leicy Santos will represent Colombia.\nThese absences, however, open up space for the squad to show its depth and talent. Players who have had few minutes so far will have the chance to shine, taking on more important roles. In addition, new signings Esme Morgan and Rosemonde Kouassi, who joined the team recently, will begin to integrate the team and could make their debut in the Summer Cup semi-finals in August.\nOn the other side, we have Chivas Femenil, one of the powerhouses of the Liga MX Femenil. Two-time league champions, the team is on a roll after winning their first match of the 2024-25 Apertura season. With a successful record, including victories in the 2022 Clausura and 2017 Apertura championships, and a Campeón de Campeonas title, Chivas Femenil are formidable opponents.\nSpirit coach Jonatan Giráldez knows Chivas well, having recently faced them in a friendly against FC Barcelona. Although Barcelona emerged victorious, Giráldez knows that Chivas are a resilient and dangerous team. Chivas Femenil's stars include defender Jaqueline Rodríguez, who scored in the first game of the season and has already made almost 150 appearances for the team. Captain Alicia Cervantes leads the attack with her experience and talent, while goalkeeper Blanca Félix is a constant and reliable presence in goal, with over 100 appearances for the club. Araceli Torres, at just 23, has already made over 150 appearances for the team, showing that youth can also be synonymous with experience and skill.\nThis match promises to be a real battle of the titans. On one side, the Washington Spirit will be looking to keep their momentum going and overcome the absence of their stars. On the other, Chivas Femenil, bringing their strength and tradition to the field. The Summer Cup offers a unique opportunity to see these teams face each other, each with their own stories and talents.\nSubaru Park will be the stage for this confrontation, where each team will seek to prove its worth and achieve victory. Regardless of the result, the real winner will be women's soccer, which gains more visibility and respect with every international competition like this.",
  "word_count": 569,
  "scraped_at": "2026-02-14T12:18:06.505850"
}