{
  "article_id": "7a1cbd613606",
  "url": "https://news.sky.com/story/jordans-prince-feisal-al-hussein-seeks-to-become-the-iocs-first-leader-from-middle-east-13331803",
  "title": "Jordan Prince Feisal Al Hussein seeks to become the IOC first leader from Middle East",
  "date": "20250319T121500Z",
  "domain": "news.sky.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jordan's Prince Feisal Al Hussein seeks to become the IOC's first leader from Middle East\nTrying to become the first IOC leader from the Middle East means geopolitical dimensions to his candidacy and this interview - especially against the backdrop of war.\nWednesday 19 March 2025 11:45, UK\nIt takes sport to place royals in such an unfamiliar situation - seeking election rather than just inheriting the throne.\nSo Jordan's Prince Feisal Al Hussein has spent the last six months campaigning, within tight constraints, to become president of the International Olympic Committee (IOC).\nAnd the brother of King Abdullah II touts the benefits of being from a royal household in his pitch for votes from the 111 IOC members, including Princess Anne and Monaco's Prince Albert.\n\"I've been born into a family that's dedicated to service,\" he tells Sky News.\nThere are six rivals, including World Athletics President Sebastian Coe, in the vote that takes place in Greece on Thursday.\n'A fantastic tool for healing'\nTrying to become the first IOC leader from the Middle East means geopolitical dimensions to his candidacy and this interview - especially against the backdrop of war.\n\"We've seen the power of sports in being able to heal particularly and to bring peace and unity to the world,\" Prince Feisal said.\n\"It's not going to solve wars, but it is a fantastic tool for healing.\"\nWith that the focus turns to 2036 and the Summer Games slot without a host yet.\nThe Middle East staging the biggest multisport show on Earth could require shifting from a usual summer slot around July and August to much earlier or later in the year when the heat is not as fierce.\nQatar and Saudi Arabia are both touted as potential bids having built infrastructure as past and future hosts of the men's World Cup.\nRead more from Sky News:\nTeen brother and sister among Palestinians killed by Israel\nDocuments about Prince Harry's US visa application released\n\"One of the challenges that we currently face with the existing calendar is that it's not an appropriate environment to have the Olympic Games,\" the prince said.\n\"So one of the things that I'm suggesting as president of the IOC is to work with international federations to have a bit more flexibility.\n\"This will allow not just countries within our region, but across the globe, give them the opportunity to potentially host a game.\n\"And I think it's the imagination, the enthusiasm of being able to do that that is part of the Olympic legacy. We'd like to see.\"\n'Not for exclusion'\nUnlike his brother Prince Ali - who runs Jordan's football federation - Prince Feisal is against banning Israel from sport.\n\"I'm not for exclusion,\" he said. \"I believe in inclusion. And right now, the only reason for anybody to be banned is in violation of the Olympic charter.\n\"And although people have different opinions on it, as long as there is no violation of the Olympic charter, then I have no reason to ban anybody. We have to respect the Olympic charter as a precedent.\"\nWe speak before the latest outbreak of war in Gaza, but with concerns already growing about Donald Trump's calls for Palestinians to leave the territory.\nThe US president suggested Jordan take in Gazans to \"clean out that whole thing\" after the war turned the territory of 2.3m people into a \"demolition site\".\n\"It should be what the Palestinian people want, not what the rest of us [want] - we should not be in a position to take decisions on behalf of other people,\" Prince Feisal said.\n\"We are against forced movement or migration of any people from their territories and it's something that we firmly believe in.\"\nAnd Prince Feisal, who has held military roles in Jordan, insists Mr Trump is \"somebody I can work with\" as Los Angeles prepares to host the 2028 Games.\n\"I hope this is the start of a movement towards peace in and of itself,\" he said. \"Peace is not created by stopping wars or having ceasefires.\n\"It's created by building hope, a sense of justice, a sense of fairness. These are all critical elements that need to be there in order for peace to really exist.\"\nBe the first to get Breaking News\nInstall the Sky News app for free\nPrince Feisal is currently vice chair of the IOC's gender, diversity and inclusion commission.\nSo how does he feel about women's sport in Afghanistan being banned by the Taliban?\nHe said women being able to partake in sports in Afghanistan is \"something I would very much like to see but at the end of the day, every country is its own, has its own sovereign rules and its own decisions.\n\"I would encourage them to allow women to participate in life because I think that is in part embedded in the very principles of Olympism.\n\"But I can't force people to change laws just because I believe it is wrong. It's up to them to understand that this is actually for their benefit.\"\nSo Afghanistan's participation at the Olympics is not at risk over lack of gender equality - despite the IOC Charter being used to ban Russia over the war on Ukraine?\n\"I think to ban them on that principle alone would require potential change to the Olympic Charter,\" he said.\n\"It's not something I've personally looked into, but I believe it would require a change in the charter. And then it's up to the IOC members if they agree and the consensus is there and that's what they do.\"\nLA 2028 will see transgender women banned from women's sport if Mr Trump gets his way - even by denying athletes visas.\n\"What we need to look at is a scientific-based approach on eligibility, to make sure that [it] is both fair and safe for all the competitors involved in that sport,\" he said.\nBut unlike Lord Coe, the prince does not advocate a blanket IOC ban - leaving the issue of gender eligibility to each sport.\n\"The international [sports] federation is in a far better position to make that determination than the IOC,\" he said.\n\"Could you imagine if the IOC started taking decisions on these issues, for instance, over FIFA?\"",
  "word_count": 1044,
  "scraped_at": "2026-02-14T12:34:53.355919"
}