{
  "article_id": "7a2b92ca91bc",
  "url": "https://dandenong.starcommunity.com.au/entertainment/2024-05-04/looking-back-135/",
  "title": "Looking Back",
  "date": "20240504T020000Z",
  "domain": "dandenong.starcommunity.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "100 years ago\n1 May 1924\nSporting News\nFootball\nDandenong V Oakleigh\nDandenong made a poor start in the Melbourne Districts Association on Saturday last, as they had to scratch for a team and had to take to the field with only 17 men, the eighteenth man going out after the game had been in progress for about ten minutes. Despite this drawback, however, they gave a surprisingly good display for three parts of the match. In the last quarter, lack of training told on them and the locals had things pretty much their own way.\nOakleigh – 9.14 (68 points)\nDandenong – 5.7 (37 points)\n50 years ago\n7 May 1974\nGovt. gives $22,000 towards new home units\nA Dandenong home for the aged in Clow St. has been given a $22,000 grant from the Federal Government. Mr Max Oldmeadow, MHR for Holt, was told of the grant by the Minister for Aged Services, Mr Hayden. President of the Thuruna committee, Mrs Eavia Tharle, said yesterday: “We’re delighted. We get a two-for-one Federal grant and the Lions Club of Dandenong has helped us with finance of about $7,000. This means the units will cost overall about $30,000 and we have to provide the furnishings.” Mrs Tharle said that there were 48 people occupying the site and the additional four would bring the total occupancy to 52.\n20 years ago\n3 May 2004\nCouncillor in a flap and squawking over scavenging gulls.\nGreater Dandenong councillor, Peter Brown, wants to make it an offence to feed seagulls. Cr Brown said residents had complained about the large numbers of gulls scavenging for food and making a mess in the Andrew Erikson Gardens in Springvale Road. “Where birds flock they also roost. They make a hell of a mess, rip open rubbish bags, squawk and carry on and their droppings are seeing buildings affected. I think it should be made an offence to feed birds in site specific areas.” The council’s head of environmental health said although seagulls, pigeons and bats were a nuisance, they were an “extremely” low health risk. He said continuing to educate people not to feed them was the best approach to the problem.\n5 years ago\n6 May 2019\nHousing costs hit\nWho of your local Federal election candidates is responding to the growing void of affordable homes and rentals in Greater Dandenong? The municipality is in the top tiers of homelessness rates in Victoria according to analysis by Council for Homeless Persons late yesterday. In the latest Rental Report, there were 71 lettings in Greater Dandenong that were affordable to people on Newstart benefits. Bruce MP Julian Hill said an ALP Federal Government would build 250,000 affordable rental homes in the next decade for Australians on low and moderate incomes. It would encourage ‘build to rents’ with tax concessions, reform negative gearing, provide more transitional homes for women fleeing domestic violence, young people in out-of-home care and older women on low incomes.\nCompiled by Dandenong & District Historical Society",
  "word_count": 502,
  "scraped_at": "2026-02-14T12:08:55.987678"
}