{
  "article_id": "7a2cc603549c",
  "url": "https://www.rnz.co.nz/news/sport/506217/chelsea-s-kerr-latest-women-s-player-to-suffer-acl-injury",
  "title": "Chelsea Kerr latest women player to suffer ACL injury",
  "date": "20240107T184500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea's Australian forward Sam Kerr has suffered an anterior cruciate ligament (ACL) injury at the side's warm weather training camp in Morocco, the Women's Super League club said.\nKerr averaged nearly 30 goals in the previous three seasons for Chelsea, who are top of the WSL table with a three-point lead over Manchester City.\n\"Sam will be assessed by a specialist in the coming days and then begin her rehabilitation with the club's medical team,\" the club said in a statement.\nKerr, who joined Chelsea in 2019, has scored 99 goals in 128 matches for the London side, winning the league four times, the FA Cup three times and the League Cup twice.\nShe has also won the Golden Boot twice, and was runner-up to Spain's Aitana Bonmati at the Ballon d'Or awards last year.\nKerr is one of the sport's most popular figures and was the first female player to feature on the global cover of the FIFA video game in 2022 alongside Kylian Mbappe.\nThe 30-year-old joins a long list of women's players who have suffered ACL injuries, which usually take at least nine months of recovery before a return to action.\nACL injuries were the talk of the women's World Cup last year after England's Beth Mead and Leah Williamson, Vivianne Miedema of the Netherlands and Canada's Janine Beckie missed the tournament.\nGlobal soccer players union FIFPRO said an increased workload, travel and insufficient rest have contributed to an increase in injuries, including torn ACLs, among women's professional players.\nIn December, European soccer governing body UEFA introduced a women's health expert panel to seek a deeper understanding of ACL injuries and their occurrence in the women's game.\n-Reuters",
  "word_count": 281,
  "scraped_at": "2026-02-14T12:41:26.486478"
}