{
  "article_id": "7a31f5adaaf5",
  "url": "https://newsbusters.org/blogs/culture/dawn-slusher/2024/09/23/fxs-english-teacher-brings-drag-queen-school-teach-male",
  "title": "FX  English Teacher  Pushes Liberal Propaganda in Public School",
  "date": "20240923T221500Z",
  "domain": "newsbusters.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Liberal schoolteachers are every conservative parent’s worst nightmare. But, at least in the past, they tried to hide their bias. These days, there’s an all-out culture war going on in our schools, and FX’s new comedy English Teacher, which Time magazine called “easily the year’s best new sitcom,” is a perfect example of how liberal teachers now openly push their agenda without any shame.\nTo its credit, the show pokes fun at itself. It gives a voice to conservative viewpoints at times, but not enough to overcome the overall message that kids should be allowed to dress in drag for a school event after learning how to perform by a drag queen, that gay teachers should be able to make out and grab their partner’s backside in front of their students without repercussions, that it’s wrong to teach kids proper gun safety, and that all guns are bad.\nAnd that’s just the first four episodes. Episode 1, “Pilot” centers around a controversy that erupts after main character Evan (show creator Brian Jordan Alvarez), kisses a fellow teacher in front of students during class at the high school they teach at. This leads to a meeting with Principal Grant Moretti (Enrico Colantoni) after a parent complains:\nEvan: I’m being investigated? For what?\nGrant: A mom named Linda Harrison…\nEvan: Linda Harrison? Wait, I know that name…\nGrant: …alleges that you kissed your boyfriend in front of her son…\nEvan: Oh my God!\nGrant: …in a whole class of other high schoolers at the end of the last school year.\nEvan: You talked to me about that when it happened. That was nothing.\nGrant: I know, but now she’s made a formal complaint. I have to read this.\nEvan: Wait, her kid… That kid graduated. He’s in college now. Why is she doing this now?\nGrant: I don’t know. Why does anybody do anything?\nEvan: Wait a minute. Linda Harrison… I remember that name. That’s the mom that complained about the assigned reading.\nGrant: Lewd content.\nEvan: Lewd content, right. And do you remember what the book was that she said was lewd?\nGrant: The Great Gatsby.\nEvan: The Great Gatsby. Do you know how long that’s been on the curriculum?\nGrant: Oh my God.\nEvan: I mean, this doesn’t make sense. This is political. She’s doing a political move.\nGrant: Yeah. Politics are real.\nEvan: You know, why doesn’t Markie ever get investigated for all that sh*t he says?\nGrant: Who?\nEvan: Markie, the gym teacher. Markie.\nGrant: Markie. He can’t be investigated. He has a protected victim status.\nEvan: How do I get that?\nGrant: Because he was injured in a car accident in his first week of training in the ROTC, and he’s 1/32 Native American and he has paper proof of that.\nEvan: This is insane.\nGrant: I mean, you kissed your boyfriend in front of her son. This is serious now.\nEvan: I think it was just like, just like barely…I don’t even know if our lips touched. Do you understand? This is homophobia. This is what homophobia is like.\nGrant: I don’t care what it is.\nEvan: It’s insidious.\nGrant: I’m agoraphobic.\nEvan: So, what I do? Do I wait for my fate to be decided?\nGrant: I don’t know, you can do anything. If you hand in your resignation letter, you could work in a restaurant or something. Or do a short film with your friends. Join Amway. Amway’s very good.\nEvan: You want me to quit this job?\nGrant: No, I don’t want you to quit. I don’t want you to quit. She wants you to quit. Look, what I want you to do is write a statement in defense of your position, okay? Then I’ll submit it to the district on your behalf. That’s what I can do.\nEvan: I’m not writing a statement. This whole thing is bullsh*t.\nGrant: It’s not bullshit. You’re lucky they’re not suspending you.\nEvan: Grant, let me ask you something. Her kid… You remember that kid?\nGrant: Yeah.\nEvan: Is he gay?\nGrant: Hmm…\nEvan: He’s in college, and he’s gay now, right? I always felt like that kid was gay.\nGrant: Just, just stop. Just stop.\nEvan: I’m right! She thinks I turned her kid gay!\nGrant: Will you stop?\nEvan: This is insane!\nGrant: Evan, please, just take the rest of the day off!\nYeah, no one is trying to ban The Great Gatsby. They’re trying to ban extremely explicit and pornographic books that don’t belong in student libraries. Huge difference. And of course, the son is gay — such an overused trope.\nAt lunch with his former boyfriend, Evan proclaims it’s his responsibility to “improve the future” of his students by fighting the “evil intentions” of their conservative parents:\nMalcolm: Maybe if you were in like a city school here in Austin it would be one thing, but these suburbs, they’re still like very old-fashioned.\nEvan: No, but I have to stay there because somewhere bigoted like that is where you can make the most difference. Like, what am I doing if I’m not trying to improve the future for these kids that come through that system. If I just succumb to the evil intentions of their conservative parents, then these kids are going to grow up to be just like them and it’s 1980 again, or worse.\nMalcolm: Okay, I mean, I will just say, I wouldn’t think of all conservatives as evil.\nEvan: I don’t.\nMalcolm: I’m basically a conservative at this point.\nEvan: No, you’re not.\nMalcolm: No, not about like everything. I still want social progress.\nEvan: You say that because you think it’s kitchy.\nMalcolm: No, I really. I am against a lot of what the left… I don’t even know what I am anymore. I listen to Red Scare.\nEvan: If my very desire to f*ck is… Oh, I love this song. If my very desire to f*ck is like up for debate or actually evil to them… I don’t know. We have to do something.\nMalcolm: Oh, we? You and I?\nEvan: We. Us together. We’ll go talk to the school board. We’re the ones who kissed.\nMalcolm: No, we are not even together anymore because you can’t commit.\nEvan: You always act like I broke up with you, but I didn’t break up with you. We broke up with each other.\nMalcolm: I’m not going back anywhere near that school, and certainly not getting involved.\nEvan: On that note, if you are open to it, I’d be down to hang out today at your place.\nMalcolm: Okay. Wow.\nEvan: I’m supposed to take the rest of the day off to think about my actions.\nMalcolm: See, this is your whole thing. You create your own problems. Like, for example, what happens if you get me pregnant? Like, are we gonna keep the baby? I can’t raise a baby. I work in tech.\nEvan: If I get you pregnant, it’ll be a miracle.\nEvan claims he’s being targeted because he’s gay. But the show does poke fun at itself by showing what really happened, which was extremely inappropriate:\nEvan: This behavior would not only be tolerated but encouraged if a straight couple did the same. Homophobia… Hello.\nGwen: What’re you doing, you little gay guy?\nEvan: I love when you call me that. Um, I’m writing this official statement I have to submit for this investigation.\nGwen: What do you have so far?\nEvan: To whom it may concern, I pecked my boyfriend on the cheek, perhaps making momentary, passing contact with his lips in front of a class of his students. We were in a serious relationship at the time and it is clear to me that this behavior would not only be tolerated but encouraged if a straight couple did the same. That’s all I have. It feels kind of defensive.\nGwen: I don’t know. I think that’s good. Like, you’re in the right on that. Did you talk to Malcolm about it?\nEvan: We hooked up today, actually.\nGwen: Oh my God! Crazy. I didn’t know you guys did that still.\nEvan: Yeah. Barely. Sometimes.\nGwen: Did you guys do it in the school? In front of all the students?\nEvan: Hahaha.\nGwen: I gotcha. The vegan one. Sorry, Nick’s making dinner and he’s just basically been trying to busy himself since he lost the job. He’s been making like those Hello Fresh meals that are too salty.\nEvan: Tell him I love him.\nGwen: Evan says he loves you. Aww, he loves you, too. Okay, I gotta go. I love you so much.\nEvan: Okay. Love you. Bye.\nMarkie the gym teacher (Sean Patton) gets the investigation canceled by threatening to tell the mom’s country club friends her son is gay. Evan becomes livid and says, “You can’t fight homophobia with homophobia,” adding, “This is about principles. This is about my right to exist as a man in the modern world without being harassed by women like this. This is about ethics and ideals.”\nSo, making out with your boyfriend and him grabbing your behind at your place of employment in front of children is about ethics, principles, ideals and your right to exist? Hardly. You don’t get special rights and if it had been a straight couple, they would have been fired.\nIn episode 2, “Powderpuff,” the school’s annual Powderpuff event, where football players and cheerleaders switch places, gets partially canceled by the school’s “LGBTQ+IA2S+ Alliance” (haha!) because they perceive the football players as mocking drag.\nEvan discusses the situation with his book club group:\nEvan: So, you’re saying…\nMonica: Powderpuff is this old boomer tradition where the boys get to make fun of the girls and more importantly these football players are gender-switching as a joke, when there are actually people in this school who are non-binary or trans. And that is not a joke.\nEvan: Pablo. Wake up. Wait is anybody actually upset about it? Like, in my experience, if men want to dress up as women, you should just let them.\nFrank: Yeah, let my boys have fun.\nBecca: I actually love powderpuff because the boys have to admit how hard our cheers are.\nTiffany: Becca, you literally quit cheerleading.\nBecca: Yeah, because I literally died for three minutes last year. I went to hell.\nTiffany: Stop talking about that.\nJeff: I’ve never liked powderpuff, personally.\nEvan: Why, Jeff?\nJeff: Because it sickens me. The beauty’s too intense.\nPablo: That’s crazy.\nEvan: So, who here is in the LGBTQIA2S+ Alliance? Okay, look. If you guys had come to me, I would have gently reminded you that while your hearts may be in the right place, in actuality, you’re banning a drag performance at a school in the south.\nFrank: Oooh!\nMonica: Stop being a contrarian. You know what’s bullsh*t? That these cool jocks get to dress however they want, and everybody loves it.\nHartman: They’re doing it as a joke. It’s not like real, authentic drag.\nEvan: So, you guys just want the boys to be authentic and respectful in their performance. That would make you happy?\nMonica: Yeah.\nHartman: Yeah, sure.\nEvan: Okay. Good to know. Yes, Tiffany.\nTiffany: This is literally book club. Like, why are we even talking about this?\nGood question, Tiffany! A “real,” “authentic” performance would be nothing like drag which insults the cheerleaders by making a mockery of what true femininity is. I’m sure the girls aren’t walking around with 3-foot-tall hair, clown makeup, breasts three times the normal size, and costumes with heels, feathers and boas.\nEvan calls upon an old drag queen friend Shazam (played by RuPaul’s Drag Race All Stars winner Trixie Mattel/Brian Michael Firkus) to teach the football players how to do authentic drag, a scene which is pretty scary if you’re a parent and realize they really are coming for your children:\nEvan: I would like to introduce you today to a very special friend of mine. This is Shazam.\nShazam: Hello, hello, my little babies! Hello.\nPlayers: Hello.\nEvan: So, Shazam was the queen of drag back at college. Now she has a long-running show in Austin called Woman of LA Mancha.\nShazam: That actually got canceled. The show is now called Drink Ticket Tuesday.\nEvan: So, when you guys are old enough to drink, maybe you can go check that out. Or, don’t tell anyone I said that.\nJason: So, are you like a dude?\nShazam: I’m like a dude. Yeah, I’m cool like you guys. I’m a cool dude. I sit home. I wear tube socks. I blow my nose. I have hair.\nEvan: But when she’s dressed like this, she’s Shazam.\nShazam: When I’m dressed like this, I’m your mama.\nMatt: Okay.\nShazam: Quick question. Does anybody own a ferret?\nEvan: Do they have ferrets?\nShazam: I’m just trying to connect with the kids.\nEvan: They’re not 8.\nShazam: I don’t know how old they are.\nEvan: So, here’s the deal, guys. Shazam is gonna teach you guys the proper way to dress like a girl.\nShazam: The right way. You know, it’s a little bit like if you guys are going to drink or experiment with drugs, I’d rather you do it in the house.\nEvan: That’s not a great example. But she and I, we’re gonna be your coaches in this.\nTray: Them like real titties, or like what you got going on?\nShazam: Honey, no. This is a breast plate.\nEvan: It looks great, right? Very realistic.\nMatt: Yeah, it looks awesome.\nShazam: We call it a tittie bib. And this is a lace front wig.\nPlayer: My mom has that.\nShazam: Okay.\nTray: So, is there like a tittie bib for your dick, too, or, like, where’s that at?\nShazam: Yes, I am tucked.\nEvan: It’s like a jock strap. Or a cup.\nShazam: It just kinda…\nPlayer: Does it pop in?\nShazam: Yeah, I tie it at the end of a ping pong ball and shove it up my a*s.\nJason: Don’t laugh. It’s rude.\nEvan: Yeah, no no. You guys can laugh. This is what I’m saying. Shazam is very funny. Drag can be very funny. So, if you guys, for this powderpuff performance, instead of doing joke drag or half-drag or just the cheerleading outfits, if you just do authentic, real drag like this, then the LGBTQ Alliance cannot be upset.\nTray: So, you want us to dress like this?\nShazam: Honey, I don’t think you have the balls to dress like this.\nEvan: This is good. She just read you and you can read her back.\nGrant receives complaints and Evan says he was just trying to satisfy the LGBTQIA2S+ Alliance. Grant hands him a list of “appropriate and approved attire,” which includes hair ties, face glitter, nail polish, and cheerleading outfits.” This sounds exactly what Powderpuff is really all about, but Evan says it’s, “ridiculous.”\nEvan and Shazam meet with the players to inform them of the list, but Evan rips it up and the boys begin dressing in drag anyway:\nEvan: I hate to break it to you. We got some bad news. I got this e-mail from the school board. This is a list of things that have been approved for the boy's powderpuff performance. Needless to say, the things we've been doing here are not on this list. They want to kick Shazam out of the party.\nShazam: First my sister’s baby shower, now this.\nEvan: You guys want me to read this list?\nPlayers: No.\nEvan: Why don't I just…\nPlayers: Yeah!\nShazam: Who’s house?!\nPlayers: Our house!\nShazam: It’s our house! There we go. This is supposed to be a bra, but I wear mine as a sleep mask when I fly coach. Step together. Step together. Come on, boys, a little more sashay, a little less shantay. You see the way she just did this, she was like… You know what I mean? That is what do we call it? Marking. She was marking. Sway, sway. Let’s see your hands like this. We saw a nipple! Now we’ve been disqualified. Evan, I think you’re ready!\nThe students tell Evan they want Shazam in the performance with them because, as one player puts it, “She steps our pussy up.” Yes, really.\nGrant cancels the boys’ performance after they defied his orders, and Evan emphatically replies, “Do you understand how big this issue is? This isn’t just about a little skit at a football game. This is about drag!”\nOh! Well, now that you put it that way, Evan! #eyeroll The boys continue with the performance despite the ban, and the school superintendent ends up being impressed. Of course:\nGrant: Evan, what the hell is going on?\nEvan: They did this themselves. I was not involved with this.\nJason: Hey, yo! Let me ask you something. Do we offend you? Someone taught us something. That even if things don’t go your way, or work out, we don’t mark it. We going full out. Thank you, Coach Marquez. And even if you understand what I'm talking about then you about to learn. You b*tches ready? One, two, three, four…\nGrant: Markie! Markie! Control your players!\nMarkie: Who do you think gave them the keys to the cart? Let the girls dance!\nEvan: Oh, yeah, Markie!\nMarkie: Hey, man. Powderpuff is tradition.\nPlayer: Here we go. It’s time for the death drop.\nMarkie: You’re in.\nGrant: I am so sorry. I didn’t even expect this to happen.\nSuperintendent: Are you kidding? This is funny as hell. Back in my day, when we did powderpuff, they told us to go whole hog. That was whole hog and an extra half hog for good measure!\nEpisode 4, “School Safety,” took on gun rights. As Evan enters the school, he hears shots ring out. He panics and locks everyone in the classroom only to learn it was from the school’s gun club. He demands the club be shut down, but Markie, who runs it, tells him it’s a firearms safety program designed to teach kids how to properly handle and use guns.\nEvan stages a protest with his students, but Markie counters with kids from the club:\nTeacher: Dude, is this one of those drunk driving things?\nEvan: It’s an anti-getting-killed-by-guns protest. The kids are making their voices heard. I’m joining them.\nTeacher: That's good. I'm so anti-death so I'm like so on board.\nGwen: Ghosts. Duality of life and death. Dia de los Muertos.\nEvan: It’s an anti gun club protest.\nGwen: Oh, it's not reading like that.\nEvan: What is going on? You look like Erin Brockovich.\nGwen: I always look like this.\nTeacher: Lies. She's doing it because of the list.\nGwen: No! But seriously who is making that list, right? ‘Cause we know who's making the Hot List. Who makes it? Who is it?\nTiffany: I don't know.\nEvan: Nobody knows who makes the list. What the hell is this?\nMarkie: Just a little protest. Yeah, that's right. Some of the kids in my program heard about what y'all were up to and decided they wanted to make their voices known, too.\nEvan: You're doing a protest. What are you protesting?\nMarkie: Protesting y'all for bullying us.\nEvan: Bullying you.\nMarkie: Yeah, trying to bully us out of having guns. If we can't have guns, then we can't protect ourselves.\nEvan: Protect yourselves against what, Markie?\nMarkie: People with guns.\nEvan: You're saying if you can't protect yourself from guns then you're dead. So, guns are the problem. If there were no guns there would be no problem. Are you starting to see that?\nMarkie: I'm starting to see that you're the problem. You don't understand that we already live in a world where guns exist, Evan. Guns exist. Guns are already here.\nGrant: Coach!\nEvan: What?\nGrant: What?! What?!\nEvan: Let’s go.\nMarkie: We’re not even meeting on school grounds!\nEvan: You are promoting death.\nMarkie: I am not promoting death.\nGrant: Civil. Civil.\nEvan: You are promoting death. That is what you’re promoting. What does a gun do other than kill people?\nMarkie: Protect people! It protects people!\nEvan: From what?\nMarkie: It protects people from people who don't know how to use it. You know, Evan, man, I'm trying to do something for the kids. I'm trying to give them a skill. A lesson.\nEvan: But the problem is when you do something like that it doesn't work cause you're an idiot.\nThere are obviously many things people protect themselves from other than people with guns, especially women. I have a gun to protect myself and my family from a home invasion, rapists, thieves, etc. The writers should research how guns deter crimes and save lives.\nEvan manipulates a student into writing a dark essay that’s taken as an active threat so he can get the club canceled, which works. However, Grant announces the faculty must now undergo gun training because they’ll each be provided with a gun in a lock box in case of a threat. Which is a fantastic idea for keeping students safe.\nThe episode ends with Evan feeling empowered when he hits the bullseye:\nTeacher: We have to do firearms training now. Markie’s going to f*cking shoot us.\nEvan: It's fine, we'll just get through it.\nTeacher: You're just saying it cause it's your fault.\nEvan: I was trying to do something good.\nTeacher: What if we all get into gunfights like every day now.\nEvan: Yeah, that would suck.\nGwen: At least we get to be outside. We're together.\nEvan: See this outfit is working.\nGwen: I know!\nMarkie: Alright, the only thing stronger than a bad guy with a gun is…\nGwen: A girl with a gun.\nMarkie: A good guy with a gun.\nEvan: Which one are you?\nMarkie: Listen, I know man. I know you’re pissed at me. I know you think you won something.\nEvan: I did win, okay? In my own way, because, no, I didn't end gun violence. But I got some guns out of some kids’ hands and that is good, Markie. I made the world a better place.\nMarkie: I don’t care how much sh*t you give me. We're on the same side, okay, buddy? Seriously, we're the good guys. Here, man, think about it like this. You worked your whole life to become a power bottom. Now you get to be a power bottom with a gun.\nEvan: You think I'm a bottom after this whole week?\nGwen: He’s only bottomed like once.\nGrant: Can we please shoot, please? Evan can you… Markie, please.\nMarkie: Here we go. This is what we're here for. Aim.\nEvan: Markie, I don't need your advice.\nMarkie: I know you need my advice.\nEvan: Please back up. This is very straightforward. Here’s the bullseye. Here's the gun.\nMarkie: No, it's called backup.\nAll: Oh sh*t! Whoa!\nGwen: Did you break your wrist?\nMarkie: You okay?\nTeacher: Yeah, I'm fine.\nMarkie: You okay?\nEvan: I don’t know. I don’t know.\nMarkie: Actually… Hey look at that. Bullseye! Huh? Look at you. Feel that power buddy?\nEvan: Oh, hell yeah.\nOkay, that was funny! But not enough to overcome the heavy liberal propaganda. With four episodes left, we can only imagine what will come next. As always, we watch so you don’t have to, so we’ll keep you updated!",
  "word_count": 3908,
  "scraped_at": "2026-02-14T12:33:08.774435"
}