{
  "article_id": "7a3326c69efe",
  "url": "https://economictimes.indiatimes.com/news/india/assam-cm-himanta-biswa-sarma-launches-mukhya-mantrir-eti-koli-duti-paat-scheme-in-tinsukia/articleshow/127532333.cms",
  "title": "Assam CM Himanta Biswa Sarma launches Mukhya Mantrir  Eti Koli Duti Paat  scheme in Tinsukia",
  "date": "20260126T091500Z",
  "domain": "economictimes.indiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It may be noted that over Rs. 300 crore will be disbursed as a one-time financial assistance of Rs. 5,000 each to more than six lakh tea garden workers—both permanent and casual—across 836 tea gardens in 27 districts and 73 legislative assembly constituencies.\nSarma also inaugurated mobile creches and mobile toilet services to ensure child care, health, dignity, and a safer working environment for the workforce.\nThe Chief Minister said that the launch of Eti Koli Duti Paat marked the fulfillment of yet another election promise of the present state government. He added that budgetary allocation has been made to ensure the scheme reaches a successful conclusion.\nSarma further highlighted the immense contribution of tea tribes and indigenous communities to Assam’s social life. He noted that after the British discovered tea plants in Assam and brought workers from various parts of India to cultivate them, nearly 200 years have passed. In other words, Assam’s tea industry has now completed two centuries.\nHe observed that while people around the world and across India begin their day with a cup of Assam tea, the workers who labor tirelessly in the fields to cultivate tea often remain unseen. These hardworking individuals have sent Assam tea to every corner of the globe. He emphasized that just as people take pride in Assam tea, they must also take pride in the tea workers.\nSpeaking about Prime Minister Narendra Modi’s long association with Assam tea, Sarma mentioned that before going to school, Modi used to sell tea at his father’s tea stall at a railway station in Gujarat. He recalled the Prime Minister’s appeal to give equal importance to the socio-economic development of tea workers after assuming office and stated that the present government is making maximum efforts for the welfare of tea garden workers and their families.\nHighlighting steps taken by the state government for tea garden and indigenous communities, Sarma said that a 3% reservation has been provided for tea tribes and indigenous communities under the Other Backward Classes category in Grade III and Grade IV government jobs.\nAdditionally, land rights will be granted to tea garden workers and indigenous families living in labour lines. Starting early February, application forms will be distributed, and after submission, land titles (pattas) will be issued.\nAfter 200 years, the residential land in tea garden labour lines will finally belong to the workers. They may even use this land as bank collateral for their children’s education if needed. However, the land must remain in their name for at least 10 years, and if sold, it can only be sold to other tea garden workers—not outsiders.\nHe noted that earlier many tea workers did not have bank accounts, but thanks to the Prime Minister’s initiative, they now do, enabling monthly deposits under the Orunodoi Scheme. Beneficiaries will receive an additional Rs. 8,000 on 20 February.\nSarma also mentioned that earlier tea gardens had only a few primary schools, insufficient for securing employment. Therefore, for the first time in 75 years of independence, the government established 120 model schools in tea garden areas, with plans to open 100 more in February. Previously, there were no doctors in tea garden areas, but now 27 reserved MBBS seats have been provided for tea tribe and indigenous students, which will be increased to 40 seats. Additionally, 250 seats have been reserved in paramedical courses. Over 1,50,000 students from these communities have received pre-matric and post-matric scholarships, as well as other financial assistance.\nUnder the Shaheed Dayal Das Panika Self-Employment Scheme, financial assistance of Rs. 25,000 has been provided to help youth become self-reliant. Approval has been given for 500 community halls and skill centers in tea garden areas. Eighty mobile medical units have been introduced, and pregnant women working in tea gardens will receive Rs. 15,000 as wage compensation for nutritional support. Tea garden football tournaments are being organized to promote sports talent.\nHe described Jhumoir dance as a unique symbol of the energy and resilience of the tea community. Recognizing its importance, the government invited tea garden youth to Guwahati last year to showcase their dance to the world, and next year they will be taken to Delhi.\nTo mark the completion of 200 years of Assam’s tea industry, meetings have been organized across the state to express gratitude to tea workers. In all tea-growing constituencies—including Doomdooma, Makum, Tinsukia, Digboi, Margherita, Naharkatia, Tingkhong, Moran, Dibrugarh, Chabua, Lahowal, Charaideo, Sonari, Jorhat, Titabor, Golaghat, Kaliabor, Biswanath Chariali, Gohpur, Behali, Lakhimpur, Dhemaji, Dhekiajuli, Barchala, Udalguri, Dhubri, and others—6,03,927 tea workers and employees will be honored with Rs. 5,000 each as financial assistance. He urged them to use this money wisely, including for their children’s education.\nSarma further announced that 2,000 more beneficiaries in the Doomdooma constituency will be included under the Orunodoi scheme. Ration card holders are currently being provided free rice along with sugar, salt, and pulses at Rs. 100, and the government is considering providing these items free of cost in the future.",
  "word_count": 830,
  "scraped_at": "2026-02-14T12:38:39.461201"
}