{
  "article_id": "7a6046a49bce",
  "url": "https://www.in.gr/2025/12/13/english-edition/lloyds-list-marinakis-angelicoussis-top-17-greeks-top-100-global-shipping/",
  "title": "Lloyd List : Marinakis and Angelicoussis at the Top – 17 Greeks in the Top 100 of Global Shipping",
  "date": "20251213T121500Z",
  "domain": "in.gr",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Source: tovima.com\nLloyd’s List: Marinakis and Angelicoussis at the Top – 17 Greeks in the Top 100 of Global Shipping\nSeventeen individuals represent Greek shipping in the Lloyd’s List 2025, which features what the journal extols as the industry’s 100 most influential figures on the planet\n- Πάτρα: Δασκάλα χαστούκισε 8χρονο που βρίσκεται στο φάσμα του αυτισμού γιατί… «έκανε θόρυβο»\n- Η κυβέρνηση Τραμπ μηνύει ξανά το Χάρβαρντ – Στο επίκεντρο η εισαγωγή φοιτητών «βάσει φυλής»\n- Ο φυλακισμένος Ιμάμογλου προκαλεί τον Ερντογάν να προκηρύξει πρόωρες εκλογές τώρα\n- Ρωσία: Τουλάχιστον δύο άμαχοι νεκροί από ουκρανική πυραυλική επίθεση στο Μπέλγκοροντ\nEvangelos Marinakis and Maria Angelicoussis are the two top Greek shipowners among the 100 top influencers shaping global shipping in 2025, according to the One Hundred People edition by British Lloyd’s List.\nAnother 15 individuals representing Greek shipping are included among the 100 most powerful figures in global shipping for the One Hundred People 2025 edition.\nAt the top of the list is US President Donald Trump, whom Lloyd’s describes as arguably as the most influential figure in shipping for 2025, saying he has “…affected global shipping more than anyone else in 2025, via a stranger-than-fiction whirlwind of tariffs on almost every trading partner, start-and-stop port fees, Iranian and Russian sanctions, airstrikes in Yemen and Iran…a bid to make American shipbuilding great again, and a successful 11th-hour sabotage of the Net-Zero Framework vote.”\nMaria Angelicoussis, Angelicoussis Group\nMaria Angelicoussis rose to 8th place in the 2025 edition from 12th in last year’s Lloyd’s List. She is also first among the 17 Greeks in the Top 100.\nDespite the company’s international outlook, as she said, Angelicoussis adds that “…our heart will always be in Greece,” underlining the strong bonds with the country’s shipping tradition\nUnder her guidance the Angelicoussis Group completed the largest transaction in its history by acquiring a major shuttle tankers company, thereby further reinforcing its already leading position in dry bulk, crude oil tankers and LNG.\nHowever, she remains focused on the Group’s basic philosophy: “to provide a safe and first-class service to our customers.”\n“We have an international outlook, but our heart will always be in Greece,” she underlines, retaining the strong bonds with the country’s maritime tradition. The company’s management is characterized by a combination of continuity and renewal, with the goal being to boost the fleet’s resilience and to prepare for energy transition era.\nEvangelos Marinakis, Capital Group\nEvangelos Marinakis posted a significant improvement in his ranking on the 2025 edition of One Hundred People by Lloyd’s List, placing 10th among the world’s top shipping influencers, up from 16th place in 2024. This year’s distinction means that he is the businessman with the biggest improvement of those in the Top 10, an elite group where US President Donald Trump ranks first.\nOver the past couple of years Capital Group has become one of the world’s premier diversified shipping platforms.\nAccording to Lloyd’s List, he is “…one of the most publicly recognised faces in shipping, the Greek owner has put his group in the vanguard of positioning shipping as part of the climate solution, rather than part of the problem.\n“Evangelos Marinakis is probably the most widely recognisable major shipowner on the planet, thanks mostly to his high profile in the world of football.”\nHe owns not only Greek champions Olympiacos, but also Premier League club Nottingham Forest and Rio Ave in Portugal.\n“Such is his passion for the sport that it has often been asked whether it might be deflecting his attention away from the shipping business. However, he has said shipping is his ‘big love’ and that, in any case, it had to come first in order to generate the money for him to spend on his football passion.”\nCapital seems to have a clear and comprehensive strategy to decarbonise, which includes charting a course toward zero-emission nuclear propulsion, while delivering more immediate emission cuts through dual-fuel vessels and shore power systems.\nThe past couple of years have resoundingly underlined the truth of this, as the Greek shipowner has expanded his Capital Group to become one of the world’s premier diversified shipping platforms. It is also one of the most modern in terms of the age of its fleet, its investment in lower-carbon and more efficient technologies, and its emphasis on gas transportation.\nAs 2025 drew to a close, the group controlled 163 vessels totalling about 13m dwt across numerous segments, including 95 on order for delivery between the latter stages of 2025 and 2028. There were 52 container vessels, 33 tankers, 30 liquefied natural gas carriers, 20 offshore platform supply vessels, 14 bulk carriers, eight mid-size gas carriers, four liquefied CO2 carriers, and two very large ammonia carriers. In 2025 alone, the group contracted more than 40 newbuildings worth $4.7bn, while selling 13 older vessels valued at more than $1bn.\nAstute and profitable selling of vessels has long been one of Marinakis’s strengths, although the balance of activities over the past couple of years seems to have shifted more decisively towards building an impressively advanced and efficient fleet.\nThe group’s technological advances are backed by Capital’s own new training centre opened on the island of Chios, which boasts Europe’s first extended reality bridge simulator\nCapital seems to have a clear and comprehensive strategy to decarbonise, which includes charting a course toward zero-emission nuclear propulsion, while delivering more immediate emission cuts through dual-fuel vessels and shore power systems.\nThe group has partnered with the MIT Maritime Consortium and classification society ABS to complete the first detailed feasibility analysis for converting ships to nuclear micro reactor propulsion.\nBy sharing operational data and economic analysis, it helped demonstrate potential lifecycle savings of $405m-$806m for converted neopanamax containerships, compared to diesel engines, underlining Marinakis’ determination to be at the vanguard of positioning shipping as part of the climate solution, rather than part of the problem.\nThe first of Capital’s groundbreaking 22,000 cu m CO2 carriers — the largest yet built — has appropriately been named Active and is scheduled to be one of 2026’s first deliveries.\nThe group’s technological advances are backed by Capital’s own new training centre opened on the island of Chios, which boasts Europe’s first extended reality bridge simulator.\nMuch of the limelight given to Marinakis’s shipping empire inevitably shines on Capital Clean Energy Carriers, his Nasdaq-listed company that has pivoted away from containerships.\nAt the same time, the private side of the business continues to invest in the sector. At last count, no fewer than 35 of the newbuildings the group had on order were boxships, with capacities ranging from 1,800 teu to 9,000 teu. With all of them being fixed on long-term charters to reputable liner companies during a lucrative period for containership charter rates, they seem set to play an anchor role in generating reliable revenues for years to come.\nGeorge Economou, TMS Group\nGeorge Economou is shipowner with 40 years of experience in shipping, and there’s not much he has failed to do in the business over the course of four decades.\nIf there was a gap in his CV as a major shipowner, it was arguably that he had never directly operated much of a containership fleet, something he can now be crossed off his list with his entry into the sector.\nHe was ranked in 13th place this year, up from 33rd in 2024. Since late 2024, Economou’s TMS Group has built up one of the largest independent containership orderbooks in the world, with at least 22 vessels ordered in Chinese and Korean shipyards.\nThe vast majority are liquefied natural gas dual-fuel boxships of 11,400 teu. At the same time, TMS Cardiff Gas, the group’s gas shipping arm, is an anchor partner in the Methane Abatement in Maritime Innovation Initiative. Finally, he’s been involved in a series of investor suits with the managements of other listed companies.\nGeorge Prokopiou, Dynacom/Dynagas/Sea Traders\nIn 14th place, George Prokopiou who has moved up from 20th place in last year’s Lloyd’s List. With one of the largest tanker orderbooks in the world, George Prokopiou has established himself as a key player in the LNG sector, especially in exports from the US, through Dynacom, Dynagas and Sea Traders.\nProkopiou insists that shipping must “pursue what is do-able, not what is desirable,” highlighting practical solutions such as fuel oil engines combined with carbon capture devices.\nDynagas has a fleet with 14 newbuildings of a new, larger 200,000 cu m design that he envisaged would be particularly attractive to American charterers, while the group has made innovations such as floating storage and regasification units in China, and ice class vessels for the Northern Sea Route. At the same time, Dynacom and Sea Traders are ordering around 80 new tankers and bulkers that run on conventional fuel, including VLCC, suezmax, aframax and panamax, maintaining a strong presence in traditional cargoes.\nProkopiou also aims to revive the Skaramangas Shipyards, while his family is strengthening its shipping presence with his daughters taking on leadership positions and their own companies.\nMagda Kopczynska, Fotini Ioannidou and Apostolos Tzitzikostas, European Commission\nTHE failure of the International Maritime Organization to pass a global carbon price on shipping in 2025 has made the European Commission once again the most important force in green regulation, with Transport and Tourism Commissioner Apostolos Tzitzikostas and EU officials Magda Kopczynska and Fotini Ioannidou included on the Lloyd’s List in 24th position.\nThe Commission presented the new Sustainable Transport Investment Plan (STIP), a first step in accelerating the use of clean fuels, which aims to mobilize €2.9 billion by 2027 through ETS revenues, the newspaper notes. Despite the positive climate, the European shipping industry has expressed doubts about the effectiveness of the plan, pointing to the need for real investment and the fuels in the market, Lloyd’s List adds.\nMelina Travlos\nMelina Travlos has emerged as one of the most powerful personalities in Greek and international shipping, especially after her re-election as President of the Union or Greek Shipowners for a second consecutive term, Lloyd’s List reports. This year, she remains in 26th place in the list.\nFrom the start, she sought to champion the industry and promote Greek shipping’s national and global importance in the public eye, while building on a legacy of the sector’s social support within Greece. At the same time, through her activities in the IMO, ECSA and ICS, she has made it clear that the transition to zero footprint shipping must be informed by reality and what the market can take. Ms. Travlos has strongly advocated for the need for a global regulation, rather than a fragmented and chaotic quilt of national and regional rules, and has not hesitated to criticize the IMO proposals as unworkable due to the unavailability of compliant fuels.\nAt the same time, as head of the Neptune Group, she continues to expand its vehicle carrying business, with a dynamically growing fleet and new lines in Latin America. At the same time, under her leadership, social outreach remains a pillar of the Union of Greek Shipowners’ activities—for example, through its initiatives to support schools after Storm Daniel.\nAngeliki Frangou\nAngeliki Frangou is in 29th place on the list of the 100 most influential people in shipping, down from 24th place last year.\nAngeliki Frangou has established herself as one of the most strategically perceptive figures in international shipping, with her key maxim that “diversification is strength”. She leads Navios Maritime Partners, one of the world’s most diversified and flexible shipping groups, with a fleet of around 170 vessels across 15 separate sub-sectors ranging from dry bulk to tankers and containerships.\nCommitted to modernization and continuous fleet renewal, the company has developed a risk management culture that allows it to adapt quickly to market fluctuations. In four years, Navios has increased its contracted revenue to $3.7 billion, reduced leverage and strengthened the fleet with dozens of newbuildings, including methanol-ready containerships.\nSignificant capital was raised from the successful Nordic bond issues, while Navios South American Logistics has strengthened its presence in the region with new capital and expanded its operations. Ms. Frangou is one of the few shipowners who is so deeply invested in terminals and logistics, adding tremendous resilience to the group’s business model. With a firm commitment to long-term strategy and consistent growth, she remains one of the most influential presences in the industry.\nThomas Kazakos\nThomas Kazakos, the new Secretary-General of the International Chamber of Shipping, took office at a singularly complex juncture for global shipping. He is ranked 36th in the Lloyd’s List for 2025.\nWith three decades of experience leading the Cyprus Shipping Chamber, he brings with him a profound knowledge of institutional processes and negotiations with governments and regulatory bodies. At the ICS, he has set the following top priorities: protecting the global regulatory framework, addressing volatility in international trade due to geopolitical tensions, and developing realistic policies on decarbonization. He insists that the IMO remains the only appropriate body for setting global rules.\nKostis Konstantakopoulos\nKostis Konstantakopoulos has transformed Costamare into one of the most stable and diversified shipping groups internationally, expanding the company’s business into containers, dry bulk, offshore and ship finance.\nHe is ranked 40th this year, down from 35th on the list last year.\nAs the longest-standing Greek player in the containership sector, he took advantage of the industry’s momentum to maintain a secured backlog of $2.5 billion in revenue, while placing orders for six new 3,100 teu vessels for delivery in 2027-2028. In the dry bulk shipping sector, Costamare spun off Costamare Bulkers in 2025, which was listed on the NYSE and subsequently forged a strategic relationship with Cargill, which took over much of the portfolio of chartered-in bulkers and its FFA trading book. At the same time, Konstantakopoulos is selectively moving into the offshore support vessel market, while he has established through Neptune Maritime Leasing a significant lease financing business that has already financed 50 vessels.\nSemiramis Paliou\nSemiramis Paliou has moved up to 52nd from 80th place last year.\nSemiramis Palios has turned Diana Shipping into a more extroverted, flexible and strategically far-sighted company, while maintaining the stability built up by her father, Simos Palios. Diana’s recent takeover bid for Genco Shipping, in which Diana already held a significant stake, is described by the Lloyd’s List as confirming its greater adventurousness.\nAt the same time, Paliou has placed orders for methanol dual-fuel kamsarmaxes, investing in green technologies, and has also entered the offshore wind support vessel sector. As President of HELMEPA for a third consecutive term, she has completely modernized the organization, increased membership and strengthened environmental education activities.\nNikolas Tsakos\nNikolas Tsakos, founder and CEO of Tsakos Energy Navigation, which has been listed on the NYSE for more than three decades, has maintained a business model based on long-term employment, strong relationships with leading charterers and careful fleet renewal.\nHe is ranked 56th this year, up from 76th place in 2024. In 2025, Tsakos Energy Navigation pulled off the biggest deal in its history: winning a tender for nine newbuild shuttle tankers for Petrobras-Transpetro under 15-year bareboat charters, it added $2 billion in future revenues and earned TEN a place among the industry’s leading operators. The company maintains a fleet of over 80 tankers, with a highly competitive average age.\nPeter G. Livanos\nPeter Livanos remains one of the most multifaceted figures in shipping, combining a leading presence in the LNG Carriers sector, a dynamic expansion into dry bulk, and pioneering investments in the CO₂ and liquefied hydrogen supply chain through EcoLog.\nHe is in 60th place, down from 49th last year.\nPeter Livanos is also promoting the establishment of the first large-scale liquid hydrogen import and regasification plant in Amsterdam, paving the way for commercial flows of green hydrogen from both Norway and Oman. At the core of its traditional business, GasLog has continued to renew its LNG fleet with four new vessels and two more for 2028, while also participating in the Alexandroupoli FSRU.\nGeorge Logothetis\nGeorge Logothetis has transformed Libra Group from a small family shipping business into a diversified global group involved in shipping, energy, cutting-edge technologies, shipyards and LNG infrastructure.\nGeorge Logothetis dropped to 67th from 63rd place on the Lloyd’s list.\nIn shipping, Lomar maintained a large fleet of containerships for years, which it strategically liquidated during the market upturn in 2023-2024, securing revenues of over $2 billion. Today, it is investing more in dry bulk carriers and chemical and product tankers through CB Tankers, while strengthening its role in innovation through Lomarlabs, working with start-ups in carbon capture, engine upgrades, new materials, kites and small autonomous vessels.\nPetros Pappas\nPetros Pappas helms Star Bulk, the largest pure dry bulk company publicly traded in the US, with a history of intense consolidation through ten or so mergers over the last decade.\nThis year, he dropped to 80th from 37th place in 2024.\nThe acquisition of Eagle Bulk in 2024 was a milestone, combining two all-scrubber fleets, strengthening its know-how in geared vessels, and creating significant economies of scale. Despite the slowdown in large deals, Pappas is focused on the careful renewal of Star Bulk’s 150-160 bulkers, taking into account the geopolitical instability that now affects the market more than the traditional supply/demand data. At the same time, Pappas is involved in other shipping businesses through Product Shipping & Trading and Oceanbulk Maritime, the latter under the management of his daughter, Milena.\nSotiris Raptis\nIn 88th place is Sotiris Raptis, Secretary-General of the European Community Shipowners’ Associations (ECSA), who took office at a time of decisive developments for EU shipping.\nOwning 35% of the world fleet, Europe is at a crossroads between regeneration through green industrial policy and a dangerous path of over-regulation that could damage the competitiveness of European shipowners. With the Green Deal Industrial Plan and the Net-Zero Industry Act defining the future of European shipping, ECSA Secretary-General Raptis, his team, the ECSA Board of Directors led by President Karin Orsel and, of course, the members themselves are pursuing the well-being of the industry by pushing for practical policies that support the green transition without destroying the competitiveness and interconnectivity of the continent.\nElpi Petraki\nElpi Petraki is completing her third year as president of the women’s shipping organization WISTA International, at a time when the debate around equality in shipping is at a crucial juncture.\nDuring her tenure, WISTA has been institutionally strengthened, with the total number of members almost doubling. Elpi Petraki dropped to 91st place from 83rd last year.\n- Το Πεντάγωνο φέρεται να χρησιμοποίησε το Claude της Anthropic στην επιδρομή κατά του Μαδούρο στη Βενεζουέλα\n- Καραϊβική: Νέο πλήγμα των ΗΠΑ εναντίον ταχύπλοου σκοτώνει τρεις επιβαίνοντες\n- Ουκρανία: Δεν έχω πειστεί ότι κάποια μέρα η Ρωσία θα κλείσει συμφωνία, λέει ο πρεσβευτής των ΗΠΑ στο ΝΑΤΟ\n- Συγκλονιστική μαρτυρία πατέρα που το παιδί του έβαλε τέλος στη ζωή του\n- Σαλαμίνα: «Τον είδαν να φοράει την ακριβή καδένα της» – Μαρτυρία για τη δολοφονία της Φαιναρέτης Μπαξεβάνη\n- Περού: Το κοινοβούλιο συζητά την αποπομπή του υπηρεσιακού προέδρου για «ανάρμοστη συμπεριφορά»\n- Σαλαμίνα: Το στοιχείο «κλειδί» για τη δολοφονία της Φαιναρέτης Μπαξεβάνη & ο ένστολος μάρτυρας\n- Γουινέα: Τουλάχιστον 11 νεκροί, οι 10 γυναίκες, εξαιτίας κατάρρευσης αυτοσχέδιου χρυσωρυχείου\nΑκολουθήστε το in.gr στο Google News και μάθετε πρώτοι όλες τις ειδήσεις",
  "word_count": 3213,
  "scraped_at": "2026-02-14T12:50:38.821412"
}