{
  "article_id": "7a7d6a3ef86f",
  "url": "https://www.kalw.org/show/the-kalw-morning-almanac/2025-06-11/kalw-almanac-wednesday-june-11-2025",
  "title": "KALW Almanac - Wednesday June 11 , 2025",
  "date": "20250611T171500Z",
  "domain": "kalw.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Today is Wednesday the 11th of June of 2025,\nJune 11 is the 162nd day of the year\n203 days remain until the end of the year.\n9 days until summer begins\nSunrise at 5:47:14 am\nand sunset will be at 8:32:31 pm.\nToday we will have 14 hours and 45 minutes of daylight\nThe solar transit will be at 1:09:52 pm\nWater temperature in San Francisco Bay today is 61.9°F\nThe first low tide will be at 5:51 am at -0.78 feet\nThe first high tide will be at 1:12 pm at 4.51 feet\nThe next low tide at 5:20 pm at 3.38 feet\nand the final high tide at Ocean Beach tonight will be at 11:05 pm at 6.11 feet\nThe Moon is currently 99.8% visible\nWe can still call it a Full Moon\nWe'll had a 100% Full Moon in early this morning at 12:44 am\nThe June full moon is called The Strawberry Moon\nby the Algonquin, Ojibwe, Dakota, and Lakota peoples, among others.\nThis name came about because ripe strawberries were ready to be gathered at this time.\nThe full moon in June can also be called the....\nFull Rose Moon in Europe\nBerries Ripen Moon (Haida)\nBlooming Moon (Anishinaabe)\nGreen Corn Moon (Cherokee)\nHoer Moon (Western Abenaki)\nBirth Moon (Tlingit)\nEgg Laying Moon and Hatching Moon (Cree)\nHoney Moon\nHot Moon\nToday is ....\nCorn on the Cob Day\nCousteau Day\nKing Kamehameha Day\nNational German Chocolate Cake Day\nNational Making Life Beautiful Day\nPizza Margherita Day\nToday is also....\nAmerican Evacuation Day in Libya\nBrazilian Navy Day in Brazil\nDavis Day in Cape Breton, Nova Scotia, Canada\nKing Kamehameha I Day in Hawaii\nStudent Day in Honduras\nIf today is your birthday, Happy Birthday To You! You share your special day with....\n1572 – Ben Jonson, English poet, playwright, and critic (died 1637)\n1864 – Richard Strauss, German composer and conductor (died 1949)\n1876 – Alfred L. Kroeber, American-French anthropologist and ethnologist (died 1960)\n1880 – Jeannette Rankin, American social worker and politician (died 1973)\n1888 – Bartolomeo Vanzetti, Italian-American anarchist and convicted criminal (died 1927)\n1895 – Nikolai Bulganin, Soviet politician (died 1975)\n1910 – Jacques Cousteau, French biologist, author, and inventor, co-developed the aqua-lung (died 1997)\n1913 – Vince Lombardi, American football player, coach, and manager (died 1970)\n1925 – William Styron, American novelist and essayist (died 2006)\n1930 – Charles Rangel, American soldier, lawyer, and politician (died 2025)\n1932 – Athol Fugard, South African-American actor, director, and playwright (died 2025)\n1933 – Gene Wilder, American actor, director, and screenwriter (died 2016)\n1937 – Chad Everett, American actor and director (died 2012)\n1939 – Jackie Stewart, Scottish racing driver and sports presenter\n1956 – Joe Montana, American football player and sportscaster\n1959 – Hugh Laurie, English actor and screenwriter\n1960 – Mehmet Oz, American surgeon, author, and television host\n1969 – Peter Dinklage, American actor and producer\n1986 – Shia LaBeouf, American actor\n....and on this day in history......\n980 – Vladimir the Great consolidates the Kievan realm from Ukraine to the Baltic Sea. He is proclaimed ruler (knyaz) of all Kievan Rus'.\n1509 – Henry VIII of England marries Catherine of Aragon.\n1919 – Sir Barton wins the Belmont Stakes, becoming the first horse to win the U.S. Triple Crown.\n1920 – During the U.S. Republican National Convention in Chicago, U.S. Republican Party leaders gathered in a room at the Blackstone Hotel to come to a consensus on their candidate for the U.S. presidential election, leading the Associated Press to coin the political phrase \"smoke-filled room\".\n1936 – Inventor Edwin Armstrong demonstrates FM broadcasting to an audience of engineers at the FCC in Washington, DC.\n1936 – The London International Surrealist Exhibition opens.\n1944 – USS Missouri, the last battleship built by the United States Navy and future site of the signing of the Japanese Instrument of Surrender, is commissioned.\n1962 – Frank Morris, John Anglin and Clarence Anglin allegedly become the only prisoners to escape from the prison on Alcatraz Island.\n1963 – American Civil Rights Movement: Governor of Alabama George Wallace defiantly stands at the door of Foster Auditorium at the University of Alabama in an attempt to block two black students, Vivian Malone and James Hood, from attending that school. Later in the day, accompanied by federalized National Guard troops, they are able to register.\n1963 – John F. Kennedy addresses Americans from the Oval Office proposing the Civil Rights Act of 1964, which would revolutionize American society by guaranteeing equal access to public facilities, ending segregation in education, and guaranteeing federal protection for voting rights.\n1970 – After being appointed on May 15, Anna Mae Hays and Elizabeth P. Hoisington officially receive their ranks as U.S. Army general officers, becoming the first women to do so.\n1971 – The U.S. Government forcibly removes the last holdouts to the Native American Occupation of Alcatraz, ending 19 months of control.\n1987 – Diane Abbott, Paul Boateng and Bernie Grant are elected as the first black MPs in Great Britain.\n1998 – Compaq Computer pays US$9 billion for Digital Equipment Corporation in the largest high-tech acquisition.\n2008 – Canadian Prime Minister Stephen Harper makes a historic official apology to Canada's First Nations in regard to abuses at a Canadian Indian residential school.\n2010 – The first African FIFA World Cup kicks off in South Africa.\n2013 – Greece's public broadcaster ERT is shut down by then-prime minister Antonis Samaras. It would be opened exactly two years later by then-prime minister Alexis Tsipras.",
  "word_count": 923,
  "scraped_at": "2026-02-14T12:35:13.983970"
}