{
  "article_id": "7abc5fb60536",
  "url": "https://www.eonline.com/news/1428433/cardi-b-buys-s500k-watch-amid-stefon-diggs-breakup-rumors",
  "title": "Cardi B Buys $500K Watch Amid Stefon Diggs Breakup Rumors",
  "date": "20260210T234500Z",
  "domain": "eonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Cardi B is making money moves all on her own.\nAs the \"Bodak Yellow\" rapper's relationship with Stefon Diggs continues to make headlines, Cardi dropped six figures on an Audemars Piguet watch in celebration of her upcoming Little Miss Drama Tour.\nRetailing between $445,000 to $551,000 on the secondary market, the timepiece features an 18-carat frosted gold case and bracelet with 32 baguette-cut, rainbow-colored sapphires surrounding the watch face.\n\"A little gift for me from me,\" Cardi shared in a Feb. 9 Instagram video, as celebrity diamond dealer Benny the Jeweler strapped the watch on the 33-year-old's wrist, \"to set myself up the proper way for tour.\"\nIndeed, Cardi has been busy preparing to hit the road for her first tour in nearly seven years. So much so, Stefon—with whom the Grammy winner welcomed a baby boy in November—was in awe that she still found time to attend his NFL games ahead of the Super Bowl.\n“I never want to not let her know that I appreciate her for being there,\" he said during a January press conference. \"Not just for the games—her being there for the games was more so [because] she wanted to experience it—but she supported me [even] when she wasn’t there.\"\nHowever, when Cardi—who also shares kids Kulture, 7, Wave, 4, and Blossom, 14 months, with estranged husband Offset—left the Super Bowl early on Feb. 8 without finding out how Stefon and the New England Patriots, reports emerged that the couple of one year had quietly called it quits.\nE! News has reached out to Cardi's rep for comment and has not heard back.\nBreakup speculation was further fueled when Cardi and Stefon, 32, unfollowed each other of Instagram following the big game, which saw the Seattle Seahawks take home the Vince Lombardi Trophy with a 29-13 score.\nStill, the wide receiver is keeping his head up amid the defeat.\n\"We lost. We gotta deal with it,\" Stefon told reporters in the locker room after the match. \"We gotta take it on the chin.\"\nFor a deeper dive into Cardi and Stefon's romance, read on.",
  "word_count": 349,
  "scraped_at": "2026-02-14T14:21:30.603625"
}