{
  "article_id": "7ad202008ba3",
  "url": "https://www.13wmaz.com/article/news/local/macon/incident-report-shooting-near-zebulon-road-waffle-house/93-985d70ae-12e4-4818-ac94-297aad4125cd",
  "title": "Shooting near Zebulon Road Waffle House : What incident report says",
  "date": "20250821T211500Z",
  "domain": "13wmaz.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "MACON, Ga. — A newly released incident report is revealing new details on a shooting near the Zebulon Road Waffle House, which caused panic in the crowded Waffle House filled with people after a Friday night football match.\nThe Bibb County Sheriff's Office report says the shooting happened just after midnight Saturday on an access road between the Waffle House and Pizza Hut. Many of the patrons were teenagers who were enjoying a night out after the Howard-Westside football game.\nWitnesses told deputies they saw a masked man in the parking lot. The report says they saw the masked man \"dig in his pants,\" causing the witnesses to flee since \"they knew something was about to happen.\"\nMoments later, the report says, they heard gunfire.\nWitnesses tell 13WMAZ that some customers hid behind the restaurant's counter in the kitchen. Others \"hit the decks.\"\nThey reported \"rapid gunfire\" before the car idled in the parking lot for a few minutes, firing in the air and then driving off.\nThe Bibb County Sheriff's Office says nobody was injured.\nBut the incident report also reveals that one stray bullet damaged a nearby room at the Wingate Hotel. The occupants called the front desk, telling them the hotel room's wall had \"exploded,\" according to the report.\nThe report said the bullet had broken the window of another room, went through the wall and into hallway and then entering room where two women were asleep.\nBut the report says that many circumstances leading up to the shooting are still unknown, including the identity of the person who fired the shots that Friday night.\nThey say some witnesses told deputies it may have been a car chase between a dark blue Dodge Challenger and Dodge Charger that ended in the parking lot.\nBut the shooting remains under investigation, the Bibb County Sheriff's Office says, and no arrests have been made.",
  "word_count": 314,
  "scraped_at": "2026-02-14T12:12:21.030946"
}