{
  "article_id": "7af77f997048",
  "url": "https://www.manchestereveningnews.co.uk/news/greater-manchester-news/in-day-wasnt-sunday-league-32398731",
  "title": "  In my day , it wasnt Sunday league football , it was like a religion  ",
  "date": "20250921T081500Z",
  "domain": "manchestereveningnews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "'In my day, it wasn't Sunday league football, it was like a religion'\nFootball has never been more popular, but down in the grassroots of the Sunday leagues it's a different story\nIt's Manchester Derby Day and in just a few hours the eyes of the footballing world will be on the Etihad Stadium.\nBut at the Manor Farm council playing fields in Timperley another fiercely contested local clash is taking place. Bowdon Athletic are taking on Higher Poynton in division two of the Stockport District Sunday League.\nSore heads from the night before, muddy boots in carrier bags, car-sharing and p***-taking, it's grassroots football at its finest. And for a couple of hours on a Sunday morning, for those pulling on their kit, running the line or just showing up to support their mates, it matters just as much as the action on Sky Sports that afternoon.\nFootball has arguably never been more popular. The Premier League's biggest names are multi-millionaire global superstars, crowds are at near record levels, the women's game is making giant leaps forward every season and junior football is booming.\nBut down in the mud and sweat of the Sunday leagues, it's a different story. Here the game is fighting a rear-guard action against a bewildering combination of social and financial factors that's left many involved in the game concerned for its future.\nKeith Coates has been involved with the Stockport Sunday League since its inception in 1957 - first as a player and then as a long-term committee member. The 86-year-old says at its peak in the 60s and 70s the league had more than 70 teams competing. But last season the figure dropped to just 22.\n\"In my day Sunday league football was like a religion. But last season was probably our worst-ever,\" said Keith. \"We had to split the second and third divisions in half, so the teams could get enough games.\"\nNever miss a story with the MEN's daily Catch Up newsletter - get it in your inbox by signing up here\nIt's a story that's been repeated across Greater Manchester. Since 2010 the Ashton and District league and the Rochdale Alliance have both folded while the Oldham and Hyde leagues merged due to a lack of clubs.\nIn September 1980 the Middleton Guardian carried several match reports from the town's thriving local leagues. Team names such as Langley Labour Club, Black Bull, Chloride, and Westend Boys Club gave a clue to the clubs' background and ties.\nBut fast forward to 2012 and the Middleton Sunday League, which had formed 52 years earlier, had folded. Chairman Barry Hamilton said the dwindling number of teams had been caused by a cash crisis and admitted many clubs could no longer afford the annual running costs.\n\"Less than 15 years ago, we had four divisions of 12 teams,\" he said. \"Last year we only had eight teams. We said we’d keep it going if we had eight teams so we could keep the name going, but we've had two teams pull out already and two are amalgamating.\n\"It’s a big wrench. I never thought it would happen on my watch, but it has. We’ve got a very hard-working committee who have been fantastic but the funds just aren’t there any more.\"\nPub closures, deindustrialisation, the cost-of-living crisis, changing work patterns, more teenagers going to university, dads playing a bigger role in raising their kids, five-a-side leagues, gym culture, more football on the telly and even England's relaxed licensing laws, all are said to have played their part in less men wanting to get out of bed on a Sunday morning for a kickabout with their mates.\nRobert Sleigh, secretary and chairman at Higher Poynton, points to running costs as one of the main difficulties. When pitch hire, equipment, refs' fees and insurance are taken into account he says a club needs to raise a minimum of £3,000 a season.\n\"There's also been a cultural shift,\" he said \"There's saturation around football coverage nowadays and I think as a society we have become more of a passive observer rather than participating.\n\"There are also more ways to play football now with five-a-side leagues and more people are going to the gym, running and cycling. And in the early days you had works teams, like ICI, but those big places of employment have also gone.\"\n\"A lot of it is down to the demise of the pub,\" says Andy Palombo, chairman of Rochdale, Bury and District Sunday League. \"If you look at our leagues now, you don't get the George and Dragon and the Red Lion like you used to.\n\"Now a lot of teams start out as a gang of lads who know each other or maybe played five-a-side together. And it used to be all about the camaraderie side of it where you'd go for a drink after the game, but now that's gone and most lads just get in their car and go.\n\"A lot of people on our committee get frustrated that there is so much money in football but the grassroots doesn't really see any of it. You have working lads having to pay to play, but on the other hand you see Premier League players on £300,000 a week. None of it feeds down to our level.\"\n\"Adult open age football is in decline sadly,\" said Mark Wilson, who has been involved with Rochdalians, one of Rochdale's oldest Sunday league teams, since he joined as an 18-year-old player in 1968.\n\"Social attitudes have changed,\" he said. \"The lads are listening to their partners maybe more than we did in my day. They're organising things with their families on a Sunday, which means they can't always play.\n\"Covid also had a big impact. A lot of teams folded in lockdown and never returned.\"\nBut it's not all doom and gloom by any stretch. After years of steady decline there are signs things might have turned a corner. Following last year's low, this season the Stockport league has almost doubled in size.\nAnd, after a long-term shortage, the league now has more than enough refs to officiate every game, even taking into account this season's expanded league. Figures provided by the Manchester FA show it's a similar story across the region.\nThere are currently 5,000 men playing in Manchester FA-run open-age and veterans Sunday leagues, and the total number of teams is up 10% this season to 182. Both county cup competitions have also seen a significant increase in entries.\nIn a statement the FA said participation in Sunday league football in Greater Manchester was 'still strong' but said there was 'more choice' in where and how the game was played. It highlighted a number of measures the FA is taking to improve participation, including plans to increase the number of good or high quality grass pitches in the region by 50% to 188.\nMeanwhile the FA said said clubs could apply to its Fund4Football to help with running costs, and said heavily discounted second-hand kit was available from its Bits and Boots store for players 'facing financial pressure to stay in the game'.\nA spokesperson added: \"We believe participation in Sunday League is still strong within Greater Manchester. In line with the FA's strategy, we believe that in Manchester there are many different formats and choices for players when looking to play football.\n\"There has been a noticeable shift to veterans' football as well as small-sided formats, giving players more choice to stay involved in the game for longer. Therefore, numbers are more spread across these formats as a whole, with over 44,000 players across all age groups and formats in Greater Manchester.\n\"Overall, Sunday League football continues to play a vital role in our grassroots landscape, providing opportunities for thousands of players to enjoy competitive football each week.\"\nBut something much more important lies behind the numbers. For those involved Sunday league provides a vital source of community, camaraderie, friendship and purpose.\n\"I am on the touchline every Sunday and I've seen it all,\" said Keith Coates. \"It is a ball-ache at time, it takes up all my Sunday, but I love it. I wouldn't have been doing it this long if I didn't. It's in my blood.\"\n\"I've always enjoyed it, it's always been a passion,\" said Mark Wilson, a former teacher at Balderstone high school in Rochdale. \"I'm proud to say my 17-year-old son is now playing for the second team on a Saturday.\n\"There's lads who I taught at school who came to play for the club and they're now friends. We have a life vice president Colin Wild who's about 90 years old - he was the second team manager when I first started - he still comes to watch the games.\"\n\"It's everything - it's the game and it's the social side of it.\"\nJoin the Manchester Evening News WhatsApp group HERE\n\"It's love and hate at times,\" said Robert Sleigh, now in his 50th season at Ponyton. \"I feel the burden of it, but I also get a lot of pleasure from the games and the camaraderie.\n\"It's builds a sense of community. It's nice to be part of a social and cultural thing. It's always been part of my life and it's still a pleasure to be involved. But I don't want to give the impression the game is dying or in terminal decline, because it isn't. There is still a lot of active teams, a lot of people want to be involved.\"",
  "word_count": 1590,
  "scraped_at": "2026-02-14T12:36:42.193534"
}