{
  "article_id": "7afd8a126b94",
  "url": "https://tribune.com.pk/story/2545031/alcaraz-sabalenka-post-wins-at-italian-open",
  "title": "Alcaraz , Sabalenka post wins at Italian Open",
  "date": "20250510T050000Z",
  "domain": "tribune.com.pk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Alcaraz, Sabalenka post wins at Italian Open\nThe Spaniard defeated qualifier Lajovic 6-3, 6-3 on his return after injury\nCarlos Alcaraz kicked off his bid for a first Italian Open title by cruising past Serbian qualifier Dusan Lajovic 6-3, 6-3 in Rome on Friday on his return to action from a thigh injury.\nWorld number three Alcaraz got past Lajovic in one hour and 23 minutes in his first match since suffering the injury in his Barcelona Open final defeat to Holger Rune last month.\nThe Spaniard showed some signs of ring rustiness with 22 unforced errors but still managed to win the first four games of the match to give Lajovic too much to do in the first set.\nAnd Alcaraz closed out the match in professional style with another quick start in the second set which put him three games ahead, allowing him to serve out for the win.\n\"Today was a really good day in the office, hopefully tomorrow and Sunday is going to be better,\" said Alcaraz.\n\"Of course I tried to make the most of my time, when I'm not playing tournaments I always try to find the positive things... I could stay at home more with my friends, with my family, recovering and getting a little bit fresh mentally.\n\"It was a great performance, a great level, which was surprising for me a little bit but I'm just really happy for that.\"\nAlcaraz will now face one of Alex Michelsen and Laslo Djere in the third round as he eyes a potential final with world number one Jannik Sinner in the Italian capital.\nSinner will make his comeback from a three-month doping ban on Saturday when he takes on Mariano Navone in front of what will be a partisan crowd at the Foro Italico.\nAlcaraz later told reporters that he would take it easy on his day off, keep an eye on Sinner's match and go to watch his friend Patric play for Serie A football club Lazio against Juventus at the nearby Stadio Olimpico.\nOne of Alcaraz's potential opponents in the last 16, Grigor Dimitrov, fell at the first hurdle against wild card entrant Francesco Passaro.\nHome hope Lorenzo Musetti opened his week, his first in the top 10 of the men's world rankings, with a 6-3, 6-2 win over qualifier Otto Virtanen.\nIn the women's draw, Aryna Sabalenka cruised past Anastasia Potapova and into the third round with a 6-2, 6-2 victory.\nShe swept past Russian Potapova in just over an hour. AFP\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 445,
  "scraped_at": "2026-02-14T12:53:43.636178"
}