{
  "article_id": "7b063e174979",
  "url": "https://www.westmeathexaminer.ie/2025/01/25/saturday-briefing-walker-heads-for-milan-as-city-new-boys-prepare-for-debuts/",
  "title": "Saturday briefing : Walker heads for Milan as City new boys prepare for debuts",
  "date": "20250125T080000Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Saturday briefing: Walker heads for Milan as City new boys prepare for debuts\nBy PA Sport staff\nKyle Walker’s exit from Manchester City was confirmed as Pep Guardiola declared the club’s three new arrivals ready to be involved this weekend.\nChelsea head coach Enzo Maresca did not rule out trying to bring in Alejandro Garnacho from Manchester United, whose boss Ruben Amorim said he was unsure about whether Marcus Rashford would leave Old Trafford this month.\nMeanwhile, Championship promotion hopefuls Sheffield United were stunned by relegation-threatened Hull at Bramall Lane, and there was bad news for Welsh EFL clubs’ hopes of competing in Europe.\nCity announced on Friday evening that England right-back Walker had joined AC Milan on loan for the rest of the season, a deal which includes an option for the Serie A outfit to make the switch permanent in the summer.\nIn a post on Instagram the 34-year-old, who has won 17 trophies including six Premier League titles and the Champions League as a City player, thanked his team-mates “for the great memories and all the success we have shared together” and boss Guardiola “for believing in me and working so hard to bring me here in 2017.”\nThat came after Guardiola had confirmed City’s trio of January recruits, forward Omar Marmoush and defenders Vitor Reis and Abdukodir Khusanov, would go straight into his squad for Saturday’s home clash with Chelsea, saying: “They can play but I don’t know (what position) yet.”\nReports have linked Chelsea with Garnacho and representatives for the 20-year-old Argentina winger were in attendance at the Blues’ 3-1 victory over Wolves at Stamford Bridge on Monday.\nAt his pre-match press conference ahead of the trip to City, Maresca said of the reports that he was “happy with what we have in this moment”, before adding: “We pay attention (to the market) if something can happen.\n“But 10 days to go, we didn’t do anything, just we called back Trev (Chalobah). We’ll see in the next 10 days if something is going to happen.”\nAnother forward potentially heading out of United is Rashford, who has not played for the team since December 12 and last month told journalist Henry Winter he was ready for a new challenge.\nNo move has yet materialised for the 27-year-old England forward despite links with AC Milan and Barcelona, and when Amorim, having again left him out of his matchday squad for Thursday’s 2-1 Europa League win over Rangers, was asked if Rashford would now be staying for the rest of the season, he said: “I don’t know.\n“I really don’t know. We will see in the end of the window what happened. And then we will talk about it in that moment.”\nSheffield United had the chance to move above Leeds to the top of the Championship table as they hosted a Hull side lying in the bottom three.\nBut the visitors surged to a 3-0 victory, with efforts from Matt Crooks and substitute Matty Jacob being added to by a late Harrison Burrows own goal, that moved Ruben Selles’ men out of the relegation zone and up to 18th.\nChris Wilder’s Blades remain a point behind Leeds in second and two clear of third-placed Burnley ahead of those sides going head-to-head at Turf Moor on Monday.\nThe prospect of the likes of Wrexham taking part in European competition appeared to have increased with UEFA granting a Conference League qualification spot to a new-look Welsh League Cup, which the Football Association of Wales had wanted the EFL’s four Welsh clubs to be a part of.\nHowever, the proposal regarding the Red Dragons, Cardiff, Swansea and Newport was rejected by the English FA board.\nA statement from the FA sent to the PA news agency on Friday read: “Following careful consideration, taking into account various factors including equal opportunity for clubs to participate in the same competitions, for the same rewards on an equal basis, concerns raised by stakeholders regarding competition integrity, fixture congestion and player welfare, and the impact on the standing of existing competitions, the FA board has rejected the request.”\nAs well as the City-Chelsea clash, the Premier League action sees both leaders Liverpool and second-placed Arsenal face relegation battlers, hosting Ipswich and visiting Wolves respectively, while there is a meeting of two of this season’s most impressive sides at the Vitality Stadium as Bournemouth take on Nottingham Forest.\nCeltic will look to further strengthen their position at the top of the William Hill Premiership as they entertain Dundee, and Manchester City go to Aston Villa in the Women’s Super League.",
  "word_count": 765,
  "scraped_at": "2026-02-14T12:43:16.674043"
}