{
  "article_id": "7b3d6d9b9a03",
  "url": "https://pina.com.fj/2023/12/20/fifa-support-helps-pacific-nations-return-to-international-stage/",
  "title": "FIFA support helps Pacific nations return to international stage",
  "date": "20231220T120000Z",
  "domain": "pina.com.fj",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "American Samoa, Samoa and Tonga all made a welcome return to the FIFA/Coca-Cola World Ranking following a challenging period for the Polynesian nations.\nThe recent 2023 Pacific Games in the Solomon Islands provided the stage as all OFC member associations (MA) – other than New Zealand – lined up in the men’s and women’s football tournament at the quadrennial multisport event. For many of the participating nations an increased level of FIFA funding via the Forward 3.0 programme aided preparation for the tournament.\nFew places in the world face as many challenges as Pacific-based nations when it comes to playing regular international football. That is particularly true for Polynesian countries based at the eastern end of the OFC’s footprint where limited travel options, considerable expense and sheer geographic remoteness present major obstacles.\n“It is critical for all nations to play international football as an important pathway to success,” said Sanjeevan Balasingam, Director Member Associations Asia & Oceania. “Sustained success at the international level requires long term planning to develop capacities and teams.\n“The excessive cost of domestic and international travel across Oceania given the geography of the region and the impact of Covid-19 more recently, has exacerbated existing issues, and constrained the available resources for national team participation.\n“The increase in FIFA Forward funds will enable MAs to better invest in the critical success factors such as improved systems, and human capacities. It will also improve national team preparation and increase participation at international competitions on an annual basis.”\nAmerican Samoa, Samoa and Tonga all missed the qualifying competition for the 2022 FIFA World Cup Qatar™ due to the impact of Covid-19, while Cook Islands competed in just a single match before being forced to withdraw. For American Samoa, the Pacific Games proved a double cause for celebration with their women’s national team competing and now set to return to the FIFA/Coca-Cola Women’s World Ranking after missing Australia & New Zealand 2023 qualifiers.\nSamoa, typically the strongest of the quartet, impressed with some strong performances in the Solomon Islands including a win over American Samoa.\nReturning to the international arena was another step on the road to recovery for Tonga following the nation’s destructive natural disaster – the 2022 Hunga Tonga–Hunga Ha’apai volcanic eruption. The Pacific Games also offered a rare opportunity for the Tonga men’s national team – newly-named Tuulalupe – to gain exposure with their matches broadcast on national TV.\nThe ambitious Tonga Football Association [TFA] have remained a symbol of dependability for the disaster-struck nation with their rapidly growing infrastructure projects widely used by the general community, while the TFA will host an unprecedented three OFC tournaments during the upcoming calendar year.\nCook Islands, meanwhile, face the kind of logistical challenge that is unsurpassed even by their Pacific neighbours. By population, Cook Islands are one of FIFA’s smallest MAs, yet the nation’s archipelago is spread over an area that would cover a considerable portion of Western Europe.\n“The nature of the Cook Islands, composed of 15 small islands, makes it difficult and costly to identify and develop football talent, especially in the outer islands,” said Allen Parker, General Secretary of the Cook Islands Football Association. “This geographical fragmentation can hinder the scouting process and the implementation of consistent training programmes across the islands.”\nThe international resumption proved a happy one for Cook Islands who picked up a 2-1 win over Tonga in their opener. “The return to international football was of immense significance for the Cook Islands,” Parker added. “As a small member association, it is crucial for us to consistently provide our players with exposure to top-tier international football competitions throughout the region.\n“Participating in these competitions helps to inspire Cook Islanders, regardless of gender, to aim to play for their national teams. This not only promotes the sport but also contributes to the personal development and aspirations of our athletes.”\nSolomon Islands proved an ideal location for the football component of the Games with passion for the sport unsurpassed in the region. Large crowds were on hand whenever the home team took the field, but there was disappointment at the last hurdle with the Solomons losing the final 9-8 on penalties against Melanesian neighbours New Caledonia and missing out on their first gold medal in the process. Fiji picked up the bronze with a 4-2 victory over Vanuatu.\nIn the women’s tournament, Papua New Guinea continued their perfect record in the competition, collecting a sixth crown on the back of a 4-1 win over Fiji in the decider. New Caledonia saw off Samoa to earn the bronze medal and continue their recent surge in women’s football after local side AS Academy Feminine won last year’s first edition of the OFC Women’s Champions League.\nSPORTS: FIFA/PACNEWS",
  "word_count": 790,
  "scraped_at": "2026-02-14T12:46:35.031765"
}