{
  "article_id": "7b498d5070bc",
  "url": "https://www.theguardian.com/tv-and-radio/2025/nov/29/tv-tonight-a-delightful-french-travelogue-with-sandi-toksvig",
  "title": "TV tonight : a delightful French travelogue with Sandi Toksvig",
  "date": "20251129T073000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sandi’s Great Riviera Rail Trip\n8.05pm, Channel 4\nLovely Sandi Toksvig is travelling along the French Riviera, following in the footsteps of artists, writers and freethinkers who made the glamorous holiday destination “the beating heart of intellectual life” in the 20th century. After the shock of the first train actually arriving on time in Marseille, Toksvig heads to Sanary-sur-Mer, where Brave New World author Aldous Huxley and German writers Thomas Mann and Bertolt Brecht spent time. Hollie Richardson\nStrictly Come Dancing\n6.35pm, BBC One\nStrictly’s annus horribilis continues, via injured contestants, departing presenters and a revolving door of scandal. It’s the perfect time, then, to try and inject some much-needed joy, with a new time-pressured Instant Dance challenge in which couples are given just 10 seconds to mastermind a new routine of their choosing. Hannah J Davies\nWho Wants to Be a Millionaire?\n8pm, ITV1\nNext year will see the UK launch of a faster-paced remix called Millionaire Hot Seat with contestants taking turns to answer questions and claim cash. We are still in original mode here though, with lugubrious host Jeremy Clarkson doing his best to put nervy players at ease. Graeme Virtue\nMichael McIntyre’s The Wheel\n8.05pm, BBC One\nWhat’s the coldest temperature recorded in the UK? (Wasn’t it the other week?) And which herb or spice isn’t in the KFC recipe? Don’t ask Fatiha El-Ghorri: “I just came here to feel the breeze through my hijab,” she says. These and other questions feature in tonight’s roulette of fate. Ali Catterall\nGreatest Basslines\n9pm, Sky Arts\nThe second in a three-part series of profiles of rock bassists has a slightly less seminal subject than last week’s Peter Hook episode. Tonight it’s Hole and Smashing Pumpkins bassist Melissa Auf der Maur talking about the basslines that shaped her playing style. Alexi Duggins\nWild Cherry\n9.05pm, BBC One\nEpisode four of Nicôle Lecky’s soapy yet moreish drama centred on an elite girl’s school. As the nude photo scandal/psychodrama continues, the dads begin to act out alongside the mums. Meanwhile, Lorna (Carmen Ejogo) asks whether race and class have influenced how the school has treated her daughter. HJD\nLive sport\nSnooker: UK Championship, 1pm, BBC One\nDay one of the tournament from the York Barbican. There’s further coverage on BBC Four at 7pm.\nWomen’s Football: England v China, 5pm, ITV1\nLeah Williamson will lead the Lionesses in a friendly at Wembley.\nPremier League Football: Everton v Newcastle United, 5pm, Sky Sports Main Event\nWith Tottenham Hotspur v Fulham to follow at 7.45pm.",
  "word_count": 421,
  "scraped_at": "2026-02-14T13:06:47.083978"
}