{
  "article_id": "7b557018318d",
  "url": "https://www.thesun.co.uk/sport/21048558/johanna-rytting-kaneryd-chelsea-wsl-sweden/",
  "title": "Rytting Kaneryd hails mentality of Chelsea Sweden stars ahead of derby duel with title rivals Arsenal",
  "date": "20230116T020000Z",
  "domain": "thesun.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "JOHANNA RYTTING KANERYD sees herself as a late bloomer after enduring three major injuries in her mid-teens and early twenties.\nSince then the Chelsea midfielder, 25, whose team face Arsenal later, has emerged as one of Sweden’s most promising attacking midfielders.\nThe player, regarded as one of Europe’s rising stars, joined Emma Hayes’ Blues ranks last August sealing a move from Swedish side BK Hacken.\nThe Kingsmeadow ace, who helped her national side reach last year’s Euros semi-finals said: “I had three big injuries early in my career.\n“It’s why I feel like I’m a little bit of a late bloomer even though I was a young talent.\n“I had two ACL (anterior cruciate) injuries. The first one was when I was 15-years-old.\nRead More Football Stories\n“Later I injured my other knee and had some problems with my meniscus.\n“I recovered from that but then a few years later (in 2018), in the same week that I signed for Rosengard, I had an ACL injury.\n“In total it was three years (of playing time) that I missed (due to injuries).”\nRytting Kaneryd’s journey to football’s elite level began during her childhood growing up in Kolsva, a small village in Sweden.\nMost read in Football\nShe took up football as soon as she “could walk” with her earliest years spent playing alongside her twin brother Marcus in a mixed boys and girls’ team.\nThe WSL ace added: “It was a special situation against other teams especially before the games.\n“When they (our opponents) looked at our team and saw there were girls in it, they were almost laughing and saying ‘what was this?’\n“After the games they were not laughing anymore.\n“It was nice to look at them after a game (we’d won) and be like ‘okay, you’re not that cocky anymore’.\nRytting Kaneryd’s Chelsea switch has seen her become one of several elite players from Sweden to join the league leaders in recent years.\nCompatriots who have contributed to Chelsea’s silverware success under Hayes include Magda Eriksson, goalkeeper Zecira Musovic and former Blues defender and shot stopper Jonna Andersson and Hedvig Lindahl.\nSince her July 2017 move from Linkoping, Blues captain Eriksson has skippered the team to three consecutive WSL titles from 2020.\nThe centre-back was also part of the squad that won a league crown in 2018.\nRytting Kaneryd added: “I heard good things about the club from the Swedish players that have been here.\n“It was an easy decision (to move) after I spoke with Zecira, Magda and the girls who have been here before.\n“Our mentality is the same and we want to achieve a lot.\n“I also spoke to Emma just before signing as well and got a really good feeling.\n“As a manager Emma has something extra about herself, she is special in many ways.\n“I have learned a lot from being coached by her. Our meetings are never boring.”\nRytting Kaneryd’s career took off when she chose to move away from home at 15 with the player later joining Swedish club Tyreso FF.\nThat decision would see her join the club’s senior side in 2014.\nAt the time their star-studded side included Brazil and USA icons Marta and Christen Press and Sweden midfield heroine Caroline Seger.\nRytting Kaneryd was part of a Tyreso squad that reached the Champions League final in 2014.\nThe Sweden ace was an unused substitute during the match which her team lost 4-3 to German giants Wolfsburg.\nHer senior career includes a two-year spell with Swedish giants Rosengard from 2018 to 2020\nBack then the club were managed by Jonas Eidevall before his Gunners head coach appointment.\nAnd she could be in line the to play against her former boss with Arsenal aiming to close the three-point gap between themselves and the WSL leaders.\nThe midfielder added: “It’s one of those matches you really love to play in.\n“Hopefully it’s going to be a good game and a big challenge.”",
  "word_count": 661,
  "scraped_at": "2026-02-14T12:21:37.791796"
}