{
  "article_id": "7bc0d4b34b3b",
  "url": "https://www.arsenal.com/news/renee-we-look-forward-challenge",
  "title": "Renée :  We look forward to the challenge  | Quotes | News",
  "date": "20251111T201500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Renée Slegers is expecting another tough test from Bayern Munich following last season’s encounters against them.\nWe lost 5-2 away to Bayern at the beginning of last season’s UEFA Women’s Champions League group stage, before winning 3-2 to end the group on a high. at Meadow Park.\nPreviewing Wednesday’s meeting at Allianz Arena, our head coach said in her pre-match press conference: “It's less than a year ago we played against them.\n“They still have quite some players that are similar with their qualities. I think they still pose the same threat from set-pieces, for example, and how they create. They're a really good team. They rotate and they try to create problems for the opposition.\n“So I have very high respect for Bayern because we know the last two games they played against them were very tight. So I look forward to the game. We look forward to the challenge. I think it's two really good teams going against each other tomorrow.\n“Of course, that [win last season] was a big part of our journey in the Champions League. But it was also a big part of our journey as a team. For me, that game was crucial in how I see the team, where I see the potential, not only from a football perspective. Of course, I've always believed in this team and the quality that we have. But the resilience that we showed in that game and how we found a way to win in very hard conditions. It was raining. It was windy. They posed a lot of threats on us with set-pieces and direct play at times and movements.\n“We deal with it as a team and we get the win over the line somehow because it wasn't always beautiful. So, that for me was a crucial moment in the journey in the Champions League. But more bigger was the journey of us as a team from a mentality perspective.”\nRenée was also asked about the specific threats that could be posed by Georgia Stanway this week.\n“I think she's a great player,” she said. “I think she's very important for Bayern as we see it. They like to get her on the ball. She tries in those moments to be able to conduct play and she has an intelligence on the pitch. I think what stands out is that she has a short and a long pass, and that's something she likes to use in games.\n“I think she's a really good player. From the outside, from watching, you can see that she brings some fight as well in duels, and likes to defend as well. I think in the situation that they're in - and also before this situation - as I see it from the outside, she’s an important player for Bayern on the pitch.”\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 500,
  "scraped_at": "2026-02-14T14:21:22.050339"
}