{
  "article_id": "7bd1d9596e44",
  "url": "https://www.indiatimes.com/entertainment/hollywood/did-fans-confront-gerard-piqu-with-shakiras-infidelity-anthem-in-spain-as-their-high-profile-breakup-still-captivates-fans-heres-what-happened/articleshow/126384393.html",
  "title": "Did fans confront Gerard Piqué with Shakira infidelity anthem in Spain , as their high - profile breakup still captivates fans ? Here what happened",
  "date": "20260107T083000Z",
  "domain": "indiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Did fans confront Gerard Piqué with Shakira’s infidelity anthem in Spain, as their high-profile breakup still captivates fans? Here’s what happened\nSimran Guleria | Jan 07, 2026, 06:26 IST\nFans confronted Gerard Piqué in Spain by playing Shakira’s infidelity anthem, showing their high-profile breakup still captivates public attention.\nImage credit : X| @RealBrasil_BR (L) @etnow| Piqué confronted by fans with Shakira’s infidelity anthem\nSome break-ups are quickly forgotten. Others continue to follow those involved long after they end. Gerard Piqué is experiencing that reality once again, years after his highly publicised split from Shakira. While the former Barcelona defender has largely retreated from football’s spotlight, moments from his personal life continue to resurface in unexpected ways. This time, it wasn’t a headline interview or social media post, but an unplanned encounter on the streets of Ceuta that reignited public fascination with one of sport and music’s most talked-about break-ups.\nA casual stroll with friends turned awkward when a group of young women recognised Piqué and decided to make their feelings unmistakably clear. Instead of calling out his name or asking for a photo, they blasted Shakira and Bizarrap’s BZRP Music Sessions #53 at full volume from their car, loudly singing along as they passed him. The message was clear and deliberately pointed.\nReleased in early 2023, the track quickly evolved from a diss song into a cultural statement. Its sharp lyrics, widely interpreted as a response to Piqué’s infidelity, struck a chord with millions, particularly women who saw their own experiences reflected in Shakira’s unapologetic tone. The song didn’t just dominate charts; it became a symbol of empowerment and collective outrage.\nTwo years on, Shakira herself appears to have moved forward. Her recent public appearances and interviews suggest a more measured, calmer chapter in her life, with less emphasis on the past and more focus on her career and children. Yet, while the singer may have closed that door, many fans clearly haven’t.\nThe Ceuta incident, filmed and swiftly shared online, spread across social platforms within hours. Viewers dissected Piqué’s reaction, or lack of one. He didn’t confront the group, didn’t acknowledge the song, and didn’t alter his pace. His silence spoke volumes, interpreted by some as resignation and by others as an attempt to rise above the noise.\nWhat the moment underscored is how deeply the story remains embedded in popular culture. For a section of the public, Piqué is no longer just a former football star or businessman, but a central figure in a narrative shaped by betrayal, music and viral memory.\nPublic opinion, once formed, can be unforgiving. Despite time passing and both parties carving out separate lives, the relationship’s legacy continues to trail Piqué, resurfacing in moments like this, spontaneous, unscripted and impossible to control. Shakira’s music has long been praised for transforming personal pain into universal emotion, and this episode is further proof of that reach. The song still resonates, still provokes reactions, and still carries enough cultural weight to turn a random street encounter into headline news.\nWhether Piqué has made peace with that reality is unclear. What is certain is that some stories don’t end when the relationship does. They linger in lyrics, in fan memory, and occasionally, in the echo of a song played just a little too loudly from a passing car. And if that clip ever reached Shakira herself, it wouldn’t be surprising if it prompted a quiet, knowing smile, a reminder that her voice, and her story, still travel far beyond the studio.\nImage credit : X| @BuzzingPop| Piqué confronted by Shakira’s anthem on the street\nA casual stroll with friends turned awkward when a group of young women recognised Piqué and decided to make their feelings unmistakably clear. Instead of calling out his name or asking for a photo, they blasted Shakira and Bizarrap’s BZRP Music Sessions #53 at full volume from their car, loudly singing along as they passed him. The message was clear and deliberately pointed.\nFAN TROLLS PIQUÉ WITH SHAKIRA BREAKUP SONG! 🚨😬\nAfter an FC Andorra match in Ceuta, a group of girls followed Gerard Piqué and played the song Shakira released after their breakup, clearly trying to get a reaction. 🎶💔#GerardPique #Shakira #FCAndorra #Ceuta #Football #Soccer pic.twitter.com/XbepBWHVZf\n— MARCA in English 🇺🇸 (@MARCAinENGLISH) January 5, 2026\nWhy Piqué can’t escape Shakira’s viral anthem\nReleased in early 2023, the track quickly evolved from a diss song into a cultural statement. Its sharp lyrics, widely interpreted as a response to Piqué’s infidelity, struck a chord with millions, particularly women who saw their own experiences reflected in Shakira’s unapologetic tone. The song didn’t just dominate charts; it became a symbol of empowerment and collective outrage.\nTwo years on, Shakira herself appears to have moved forward. Her recent public appearances and interviews suggest a more measured, calmer chapter in her life, with less emphasis on the past and more focus on her career and children. Yet, while the singer may have closed that door, many fans clearly haven’t.\nImage credit : X| @CelebTattler| Shakira and Gerard Piqué during their years together\nThe Ceuta incident, filmed and swiftly shared online, spread across social platforms within hours. Viewers dissected Piqué’s reaction, or lack of one. He didn’t confront the group, didn’t acknowledge the song, and didn’t alter his pace. His silence spoke volumes, interpreted by some as resignation and by others as an attempt to rise above the noise.\nWhat the moment underscored is how deeply the story remains embedded in popular culture. For a section of the public, Piqué is no longer just a former football star or businessman, but a central figure in a narrative shaped by betrayal, music and viral memory.\nHow Shakira’s music continues to shape Piqué’s story\nPublic opinion, once formed, can be unforgiving. Despite time passing and both parties carving out separate lives, the relationship’s legacy continues to trail Piqué, resurfacing in moments like this, spontaneous, unscripted and impossible to control. Shakira’s music has long been praised for transforming personal pain into universal emotion, and this episode is further proof of that reach. The song still resonates, still provokes reactions, and still carries enough cultural weight to turn a random street encounter into headline news.\nImage credit : X| @Burtytweets| Shakira’s anthem meets Piqué in an awkward moment\nWhether Piqué has made peace with that reality is unclear. What is certain is that some stories don’t end when the relationship does. They linger in lyrics, in fan memory, and occasionally, in the echo of a song played just a little too loudly from a passing car. And if that clip ever reached Shakira herself, it wouldn’t be surprising if it prompted a quiet, knowing smile, a reminder that her voice, and her story, still travel far beyond the studio.\nWhat is glowmads? Here's all about the new skincare travel trend\nBy Saloni Jha\nValentine's Day K-drama date ideas you can recreate\nBy Karen Noronha\nWas 15-yr-old Jill Falkon groomed by Erika Kirk?\nBy Nillohit Bagchi\nWho is Pujarini Pradhan?\nBy Nillohit Bagchi\nThe Last Meeting Theory is the goodbye you never saw coming\nBy Saloni Jha\nHow we believe in spirituality more in 2026\nBy Saloni Jha\nWhy dusting powder is floating back into our beauty routines\nBy Saloni Jha",
  "word_count": 1207,
  "scraped_at": "2026-02-14T12:53:51.461498"
}