{
  "article_id": "7bf1b8d47fd6",
  "url": "https://usnwc.edu/Student-Information/Resident-Domestic-Students/Recreation-Extracurricular-and-Social-Activities",
  "title": "Recreation , Extracurricular , & Social Activities | U . S . Naval War College",
  "date": "20250611T004500Z",
  "domain": "usnwc.edu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Recreation, Extracurricular, & Social Activities\nThe academic schedule at the U.S. Naval War College (NWC) can be rigorous and students are encouraged to enjoy both the range of extracurricular activities at NWC and the attractions of the Newport area. The NWC offers a series of intramural sports and social events and the New England area offers everything from world-class cuisine to summer and winter-themed entertainment and events.\nAbout Social Activities\nThroughout the year, students can participate in a wide variety of social activities, from military socials to various cultural and athletic events. These provide an opportunity for interaction between students of other military services and nationalities.\nStudents can also participate in a wide variety of local community activities, combining recreation with social responsibility.\nMany take an active part in holiday food and gift drives; some participate as volunteers for Scout troops, youth sports teams, women’s shelters and soup kitchens; others tutor local elementary, middle, and high school students.\nAthletic Activities\nGroup athletics for students include intramural sports run through the base gym, the President’s Cup Competition, and an Army-Navy Flag Football game.\nThe Naval Station gym is a full-service facility providing cardio and weightlifting equipment, basketball and racquetball courts, a pool, locker rooms, and saunas. It also has professional athletic trainers on staff and available to assist in developing a conditioning program.\nStudent Organizations\nThe resident student organization supports academic, athletic, and social activities. An executive committee appoints members to serve as chairs of the student academic and athletic committees, as well as social committees if the class desires. Each seminar has an appointed leader, who organizes student physical fitness, business, academic, activity, and athletic functions.\nEvents Around the College\nNWC hosts a wide variety of events including lectures, symposia, and conferences throughout the year. Our world-class faculty members are frequent media contributors to both historical and current issues in world affairs, policy, and national security.\nTo see a listing of upcoming events, please visit our events page.",
  "word_count": 328,
  "scraped_at": "2026-02-14T12:35:17.055715"
}