{
  "article_id": "7c0a30a0898b",
  "url": "https://www.miragenews.com/lioness-lucy-bronze-gains-edge-with-cycle-1493491/",
  "title": "Lioness Lucy Bronze Gains Edge with Cycle Syncing",
  "date": "20250709T164500Z",
  "domain": "miragenews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England footballer Lucy Bronze recently said in an interview that \"cycle syncing\" gives her an edge on the pitch. This practice involves aligning your training schedule to the different phases of your menstrual cycle.\nCycle syncing has become increasingly popular in recent years - especially among athletes who are looking to get an edge over the competition. Even Chelsea women's football team have put this new approach to use, tailoring training schedules according to each player's menstrual cycle.\nFor the average person, tailoring your workouts to your menstrual cycle is probably not going to have much of an impact. But for a professional athlete such as Bronze, cycle syncing could be a gamechanging strategy in shaping her elite performance.\nGet your news from actual experts, straight to your inbox. Sign up to our daily newsletter to receive all The Conversation UK's latest coverage of news and research, from politics and business to the arts and sciences.\nThe menstrual cycle begins and ends with menstruation (a period). While the length of the menstrual cycle varies for each person, it's usually around 28 days .\nThe menstrual cycle is underpinned by fluctuations in levels of the female sex hormones oestrogen and progesterone. This is why the cycle is divided into three key phases : early follicular, late follicular and the luteal phase.\nThe early follicular phase usually lasts around seven days and begins with the start of your period. This is when hormone levels are at their lowest.\nThe late follicular phase follows on from the first seven days, and is where ovulation happens - usually around day 14 of the cycle, though this will depend on cycle length. Ovulation is when the egg is released and you're at your most fertile.\nAfter that comes the luteal phase (lasting around 12-14 days), when progesterone peaks to prepare the body for pregnancy. If pregnancy doesn't happen, hormones drop and the cycle begins again.\nIt's no secret that mood and energy levels can shift - sometimes significantly - throughout the menstrual cycle. This is why some female athletes have begun using cycle syncing. By tailoring training schedules to match hormonal fluctuations, women are gaining a deeper understanding of their bodies and the symptoms they experience throughout each phase - empowering them to train smarter, not harder.\nBronze said the strategy has transformed her performance, saying that during certain phases of her cycle she feels \"physically capable of more and can train harder\".\nDespite these testimonials, scientists are yet to reach a definitive conclusion on how the menstrual cycle affects athletic performance.\nSo far, there's some suggestion that there may be a slight dip in performance (specifically to strength and endurance) during the early follicular phase. However, these effects are minimal - and highly dependent on the person. It's also not entirely clear what mechanisms underpin these small performance dips that some women experienced.\nOther research suggests that certain aspects of the neuromuscular system (the network of nerves and muscles that make movement possible) - specifically how our muscles generate force - is altered during the luteal phase. Research has also found that certain muscles may fatigue less quickly during this phase as well.\nThis implies that during the luteal phase, there may be changes in signals from the brain and spinal cord to the skeletal muscles. However, no changes in the neuromuscular function have been observed.\nPart of the reason it's so difficult for researchers to gather enough evidence to draw firm conclusions on the menstrual cycle's potential effects on athletic performance is because of the huge variability in menstrual cycle characteristics, which makes it difficult to study. Phase length, hormone levels and symptoms can differ widely between women - and even from cycle to cycle.\nThe small effects seen in these studies will have little effect on how most of us train or exercise. But for an elite athlete, these minuscule differences could have an effect on their training and competition, which may be why so many are willing to give the practice a try.\nSo while it isn't entirely clear how much influence certain menstrual cycle phases have on performance, how you feel during different phases could certainly affect your ability to train at your best.\nAround 77% of female athletes experience negative symptoms in the days leading up to and during menstruation. Fatigue, feeling less motivated and even experiencing digestive issues such as bloating and nausea, could all affect your ability to train at your best.\nTrying cycle syncing\nIf you're still interested in giving cycle syncing a try to see if it has any effect for you, the best place to start is by tracking your menstrual cycle. This will help you understand your body, how you feel in each phase of your cycle and what effect certain symptoms have on your training .\nIt's recommended you track your cycle for at least three months before making any changes to your training to establish a baseline and spot trends over time.\nFor example, if you notice you often feel fatigued when training in your luteal phase, it may help to focus on ensuring you fuel well with carbohydrates before and during workouts. Or on days where you feel more energetic and motivated to train, you might be able to push yourself a bit harder in your workouts.\nWhether you're playing for England in the Euros or simply working towards your own fitness goals, understanding your cycle can help you train smarter, manage your symptoms better and stay consistent with your training.",
  "word_count": 921,
  "scraped_at": "2026-02-14T12:58:49.744688"
}