{
  "article_id": "7c19dcc6a88f",
  "url": "https://www.wrestlingnewssource.com/news/90368/WWE-NXT-Results-November-19-2024/",
  "title": "WWE NXT Results ( November 19 , 2024 ) ",
  "date": "20241122T020000Z",
  "domain": "wrestlingnewssource.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Featured below are complete WWE NXT results from Tuesday, November 12, 2024. The following report is from Rajah.com, our live coverage partner.\nTZC is sick tonight, so there will be no regular live updates. However, we will add results throughout the night. Feel free to use the comments section below to discuss the show in real time.\nResults by: f4wonline.com\nVic Joseph and Booker T do a stand-up intro at ringside welcoming viewers to the show from a sound stage at the WWE Performance Center in Orlando. Opening the show is a qualifier for the Iron Survivor.\nLots of Chase U shirts among the live studio audience. Also among the audience are several tag teams watching the match. More appear as the opener progresses. Some are even at ringside.\nBefore his match tonight, Nathan Frazier is with NXT Tag Team Championship co-holder Axiom. Frazier is pumped for the qualifier. Axiom not so much. Gallus is seen behind them. A tag team stalking the scene is foreshadowing what unfolds during the opener.\nAll of the tag teams start closing in on the ringside area as the match cuts to a commercial break. When the show returns from the break, the teams are all around ringside as if it was a lumberjack match. A huge brawl erupts at ringside. Frazier does a dive on to a pile of bodies on the floor. Back in the ring, Frazier counters Thorpe. Frazier then climbs the turnbuckles and leaps off the top with a Phoenix Splash. Frazier then scores a three count.\nThe teams brawling continues as security pours out for a pull-apart.\nGreat vignette with Andre Chase giving an impassioned speech as clips highlight the success of Chase U.\nAnother video package has Giulia delivering a promo with her using the “Beautiful Madness” moniker.\nIn a backstage skit, Kelani Jordan asks Robert Stone or Stevie Turner to get her an Iron Survivor qualifying match against Giulia.\nJaida Parker vs. Stephanie Vaquer in an Iron Survivor qualifying match\nThe match goes through a commercial break. Parker got a near fall just before they went home, getting a two count after a Falcon Arrow. Lola Vice comes down to ringside just before the finish, and Vice is carrying a brick. That is a call back to a previous match. Parker had Vaquer set for the hip attack finisher, but Parker is distracted by Vice being at ringside. Vaquer capitalizes and executes her finisher on Parker. Vaquer then scores a three count.\nLater in the show, another locker room skit has Karmen Petrovic and Ashante “Thee” Adonis dressed in Washington State merch. That school is plays Oregon State on CW this weekend. Adonis and Petrovic deliver their lines decent enough, and then they compliment each other’s appearance.\nNXT Women’s Champion Roxanne Perez was cutting a promo on the beach in video uploaded to social media. Sol Ruca photos bombs Perez and confronts her on the beach, much to the chagrin of Perez.\n“The Don” teases hurting his knee in the match, which played into a post-match angle. Jensen got his heat back by chop blocking D’Angelo in the injured knee. Spears had offered a handshake to D’Angelo, which set up the sneak attack by Jensen. D’Angelo pinned Jensen after a spinebuster.\nAdonis wanted a kiss on the cheek, but Reece slaps him instead. However, that distraction allowed Petrovic to land a roundhouse kick on Reece. Petrovic then covers Reece for the three count.\nLots more plugs for the Pac 12 football games on CW, and even more to come.\nRidge Holland cuts a promo ahead of his match tonight against Andrea Chase, who Holland vows to defeat. Holland says Chase U will be lost without their leader.\nZaria pinned Sinclair after a F-5. Zaria is still getting a monster push, but Sinclair still got too much offense here. Zaria got to win in mostly decisive fashion, but she could have went over stronger. Nonetheless, she is in the Iron Survivor Challenge.\nIn a skit from the trainer’s room, Tony D’Angelo is angry. NXT GM Ava sees the anger, and she makes a match next week against Shawn Spears. That is, if D’Angelo is cleared to wrestle (in storyline).\nEddy Thorpe throws a tantrum with Ava. Thorpe is such a good character, but he is booked to look like such a jerk.\nFatal Influence are headed to the ring to deliver a promo. After a commercial break, they are in the ring. Jacy Jayne, Jazmyn Nyz and NXT Women’s North American Champion Fallon Henley get to cut promos. Henley announces an open challenge for her title next week, and out comes Lash Legend and Jakara Jackson to interrupt the promo. They want to accept the open challenge. Out comes Nikkita Lyons, and she too wants to challenge Henley. More women enter the scene. Adrianna Rizzo jumps Lyons, and a hug brawl erupts at ringside with seemingly everyone involved.\nAs the smoke clears, Tatum Paxley is in the ring with Henley. Paxley executes her finisher on Henley, and Paxley poses with the North American title belt. This sets up Henley defending the title against Paxley next Tueday on NXT.\nKarmen Petrovic and Ashante Adonis are chatting backstage and there is a spark between them. Nikkita Lyons interrupts to ask Adonis to text her back. Petrovic is upset by this, and she storms off.\nA really good video package hypes the Iron Survivor Challenge.\nEthan Page vows to regain the NXT Championship in a backstage promo, and that begins with qualifying for the Iron Survivor.\nIn a separate (but related) locker room skit, Axiom tells Nathan Frazier that Axiom is booked against Page in a qualifying match. This plays on what sometimes seems like the only tag team subplot in WWE, which the partners are not on the same page.\nChase U is featured in another vignette with Andre Chase. This was great like the other hype video earlier in the show.\nNXT Champion Trick Williams gets a full entrance as he comes out in street clothes. Trick will provide guest commentary for the main event.\nThe Chase U Crew is watching on monitors backstage. Before the show cuts to its final commercial break, Holland pulls up the floor mats to expose the bare concrete. Chase fights back with a somersault senton off the apron. Chase poses with the crowd as the show cuts to the break.\nChase was doing well for himself when Holland went to fetch a metal folding chair. Holland went to use the chair as a weapon, but the referee took it from him. The ref turns him back to get rid of the chair, and Holland kicks Chase in the groin with a low blow. Holland then delivers an implant DDT for a near fall. Duke Hudson, who along with Thea Hail, came to ringside during the match, and he pulled the referee out of the ring to stop the count. Somehow, this was not a disqualification.\nHudson and Riley Osborne would both get involved as the match progresses. Hudson is rammed through a wall on a gimmicked section of the set. Osborne flew in on a flip dive that wipes out Holland and Hail. Holland counters Osborne, and Holland picks up Osborne with a military press. Holland then tosses Osborne over the ropes to the floor like the Ultimate Warrior might have done to some jobber in ’89.\nIn the closing moments, Holland faces off with Chase in a slugfest. Comeback by Chase as he runs wild. Chase powerbombs Holland off the middle rope for a close three count. That would be the final near fall, as Holland soon cuts off Chase.\nChase jumps off the top rope with a high cross, but Holland hangs on with the roll through. Holland then executes his Redeemer (implant DDT) finisher. Holland then hooks a leg for the deciding pinfall. Chase kicked out on a lot of near falls, until he could kick out no longer. With that, Andre Chase must leave Chase U.\nPost-match, Chase is nearly in tears as he locks at his fallen students, all in some way were laid out at the hands of Holland. This was seemingly supposed to be a serious moment, but some people in the studio audience begin singing the “Hey hey hey, goodbye” song. That somewhat killed the mood.",
  "word_count": 1391,
  "scraped_at": "2026-02-14T12:10:17.025566"
}