{
  "article_id": "7c3a0ff941df",
  "url": "https://www.themag.co.uk/2024/02/newcastle-united-women-back-at-st-james-park-be-there-to-be-part-of-history/",
  "title": "Newcastle United Women back at St Jame Park - Be there to be part of history",
  "date": "20240222T153000Z",
  "domain": "themag.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Newcastle United Women back at St James’ Park – Be there to be part of history\nNewcastle United women are set to take on Portsmouth in the FAWNL Cup semi-final on Sunday, in what will be their fifth run out at St James’ Park.\nThe game, which kicks off at 2pm, is set to break their previous attendance record at the stadium, with talk of a crowd in excess of 30,000 expected.\nTheir inaugural match at Gallowgate took place in April 2022. It was technically an Alnwick Town home game, but was an occasion to remember, as the Lady Mags recorded an emphatic 4-0 victory in the FA Women’s National League Division One North. They posted a then record crowd of 22,134 as Becky Langley’s side played at the iconic stadium for the first time. Striker Katie Barker, that season’s captain Brooke Cochrane, who retired soon after the game and midfielders Georgia Gibson and Beth Guy were all on target.\nThe following season saw Barnsley visit in the second round of the Vitality Women’s FA Cup. Second-half strikes from Georgia Gibson and fellow midfielder Sharna Wilkinson, were enough to earn a hard-fought 2-1 win in front of more than 28,000 supporters, which was a new record for the competition outside of the final.\nTheir final league game of the 2022-23 campaign was also switched to St. James’ Park as 24,092 fans\nWitnessed a 6-1 win over Bradford City in the FA Women’s National League Division One North.\nBeth Guy and lynchpin at the back Charlotte Potts, both scored twice while Georgia Gibson and midfielder Rachel Lee, also netted in the emphatic win which helped propel the club to promotion.\nKick-off was delayed by 15 minutes to allow fans to get into the ground, such was the demand to witness what was a superb performance and another monumental afternoon for United’s women’s team.\nTheir most recent game was during pre-season as goals from forwards Bridget Galloway and Becky Ferguson along with Scottish midfielder Cara Milne-Redhead gave Newcastle United Women a comfortable 3-0 win over West Bromwich Albion during the Sela Cup weekend.\nSunday’s game against Portsmouth is perhaps their biggest occasion though. Having already seen off Burnley, Boldmere St. Michaels, Nottingham Forest and Fylde, in the competition, they are now just one game away from a possible cup final. It is surely going to attract even more fans. which could potentially break their St James’ Park attendance record.\nEmma Kelly, who has been instrumental in the Lady Mags midfield this season can’t wait to make her competitive bow at the famous stadium.\n“I think everyone is just really excited to play at St James’ in front of our home fans. Hopefully, they will turn up in their thousands, as it’s always nice to have their support.” She said when talking to the club website.\nThose words were echoed by her manager Becky Langley who has been involved in all the Lady Mags previous games at Gallowgate.\n“We can’t wait to play at St James Park again.” Becky said during Wednesday’s press conference. “They are always great occasions and we’re hoping it will be in front of over 30,000 Geordies, who will be cheering us on.”\nHowever, if Newcastle do make it to the final they will have to do so without some of their key personnel. With two players limping out of the 2-1 win over Derby at the weekend adding to what has become a growing injury list. Sound familiar?\n“We do have a few injuries issues right now.” The United manager admitted. “It’s late in the season and you kind of expect them to mount up around this time. Elyssa Boddy [star playmaker] won’t feature and neither will Jodie Bartle [top defender] as they are still working on their fitness, but we are hoping to have one or two back in the squad.”\nAnother player who won’t be involved on Sunday will be recent signing Beth Lumsden, who only arrived last month from, of all teams, Portsmouth! Having already appeared for the South Coast side in the competition earlier on in the season, it means the winger will have to watch from the sidelines, but she has been able to provide some important inside knowledge on her former team.\n“Obviously Beth is cup tied, and can’t play on Sunday.” Becky said. “She does have knowledge on them of course and she has been able to help us with a bit of insight and speaks very highly of the club from her time there.”\nWith the club still focused on gaining promotion to the second tier, come season’s end the cup run could have been seen as something of a distraction. However, it is one that manager and players alike have welcomed.\n“The league is still our number one priority.” The United manager admitted. “But when you have an opportunity to get to a cup final you have to take it, and this has been a welcomed distraction from our league campaign. We know the game will be tough, Portsmouth have had a good season, similar to us really, in that they are top of their league. But without home support behind us we will give it everything to reach the final.”\nEmma Kelly said the feeling in the dressing room with the players was much the same.\n“All we are focusing on is winning week in week out now.” She said. “Were not putting too much pressure on ourselves, we just want to go out and enjoy it.”\nTickets are priced at £5.00 adult and £1.00 concession if purchased in advance HERE. Costs will rise to £8.00/£2.00 if buying on the day.\nFor those who have not been to a Lady Mags game before, I would recommend doing so. The atmosphere will be electric inside the stadium and Wor Flags continued support certainly adds to that. Away fans will almost certainly travel, with Portsmouth expecting to bring plenty of their own support.\nRegardless of the result, both sets of fans should see an interesting game of football between two evenly matched sides.\n(Final reminder – Go HERE to buy tickets for Sunday’s Newcastle United Women’s match)\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1041,
  "scraped_at": "2026-02-14T13:29:35.937402"
}