{
  "article_id": "7c476529c915",
  "url": "https://www.elevenwarriors.com/ohio-state-athletics/2024/06/147515/ohio-state-s-top-36-athletes-of-2023-24",
  "title": "Ohio State Top 36 Athletes of 2023 - 24",
  "date": "20240615T234500Z",
  "domain": "elevenwarriors.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ohio State had no shortage of standout performers across its 36 varsity sports in 2023-24.\nFrom national champions to All-Americans and record-setting performers, Ohio State’s athletic department produced plenty of stars over the past year in sports, which officially concluded for the Buckeyes last weekend with the NCAA outdoor track and field championship.\nParing down that list of athletes to just the 36 best of the year wasn’t easy, but we took our best shot at ranking Ohio State’s best athletes across its entire catalog of sports.\nRanking athletes across different sports is a highly subjective exercise, so there’s plenty of room for debate on how these athletes should be ranked. That said, factors that were considered in our rankings included the athlete’s individual accolades, how integral each athlete was to his or her team’s success, whether they won national and/or conference championships, whether or not they broke records or achieved unprecedented feats for Ohio State and how much competition they faced to achieve what they did in their respective sports.\nWhile not all of Ohio State’s 36 sports are represented in the following countdown, each sport was limited to a maximum of four athletes in order to recognize standout performers across a wide variety of Buckeye teams.\n36. Luca Fioretto, Fencing\nFioretto was Ohio State’s most consistent fencer during the 2023-24 season, finishing the season with a 62-20 record in duals while earning a top-three finish in all five individual tournaments the Buckeyes competed in.\nThe freshman from Italy led the Buckeyes to team and sabre conference championships in the CCFC while he made it to the semifinals at the NCAA championship to earn first-team All-American honors and lead Ohio State to a sixth-place finish. He was named the men’s sabre newcomer of the year by the U.S. Fencing Coaches Association.\n35. Tory Vetter, Women’s Gymnastics\nVetter earned first-team All-Big Ten honors after an excellent regular season in which she won five event titles and helped the Buckeyes go 6-2 in dual-meet competition. She tied the program record with an all-around score of 39.625 in the Buckeyes’ victory over Iowa.\nThe redshirt sophomore followed that up by winning the balance beam title and finishing second in the all-around at the Big Ten championships, leading the Buckeyes to a fourth-place finish as a team in the conference meet.\n34. Hayden Tobias, Men’s Track and Field\nTobias was the Big Ten’s best shot putter this year, winning the conference championship during both the indoor and outdoor seasons with nearly identical tosses of 20.01 meters (65 feet, 7.75 inches) indoors and exactly 20 meters (65 feet, 7.5 inches) outdoors.\nThe Ohio State senior also finished among the top 12 shot putters in the nation in both seasons, earning an 11th-place finish at the NCAA indoor championships and a 12th-place finish at the NCAA outdoor championships, narrowly missing first-team All-American honors at both national meets.\n33. Nick Feldman, Wrestling\nIn his first season of competition for the Buckeyes, Feldman quickly emerged as one of the nation’s best heavyweights. The redshirt freshman went 12-2 during the dual meet season, then finished as the runner-up at 285 pounds at the Big Ten championship. He finished fifth at the NCAA championship to earn All-American honors.\nFeldman finished the year with an overall record of 29-8, suffering three of his eight losses to Penn State’s Greg Kerkvliet, who went unbeaten on the season on his way to winning the Big Ten and NCAA heavyweight titles.\n32. Bruce Thornton, Men’s Basketball\nThornton became the full-fledged leader of Ohio State’s men’s basketball team as a sophomore, leading the Buckeyes with 15.7 points and 4.8 assists per game on his way to earning third-team All-Big Ten honors. He scored in double digits in 31 of Ohio State’s 36 games while also leading the Buckeyes on the defensive end with 1.2 steals.\nHis efforts weren’t enough to lead the Buckeyes back to the NCAA Tournament, but he’ll have the chance to be significantly higher on this list next year if he can lead Ohio State to more team success in Jake Diebler’s first season as head coach.\n31. Cannon Kingsley, Men’s Tennis\nKingsley set a record that will likely never be broken as he became the first-ever Big Ten men’s tennis player to earn first-team All-Big Ten honors five times – an honor made achievable only because his freshman class received an additional year of eligibility due to the COVID-19 pandemic.\nPlaying as the No. 1 or No. 2 player in Ohio State’s singles lineup all season, Kingsley went 18-7 in singles and 21-5 in doubles for his final campaign as a Buckeye, helping lead Ohio State to its 18th straight Big Ten championship and a run to the NCAA semifinals. He earned ITA All-American honors for the fourth time by earning a top-16 seed in the NCAA singles championship.\n30. Adam Wallin, Men’s Golf\nWallin led the way for Ohio State to make an unexpected run to the semifinals at the NCAA men’s golf championship. The senior took the lead into the final round of the stroke play portion of the championship, ultimately tying for eighth on the individual leaderboard – the best individual finish by a Buckeye at the NCAA championship since 1985 – to help the Buckeyes earn a berth in the eight-team match play bracket.\nHe followed that up with a win over the world’s top-ranked amateur golfer, Gordon Sargent, to lead Ohio State to a quarterfinal upset over Vanderbilt. He came close to upsetting national college golfer of the year Jackson Koivun in the semifinals before falling in 21 holes in Ohio State’s loss to eventual national champion Auburn.\nFor the season as a whole, Wallin had the most counting rounds of any player on the team (34.5), finishing the year with a scoring average of 71.73. He was named an honorable mention All-American by PING.\n29. Celeste Taylor, Women’s Basketball\nAfter winning the 2023 ACC Defensive Player of the Year Award in her final season at Duke, Taylor transferred to Ohio State and won the Big Ten Defensive Player of the Year Award in her lone season as a Buckeye. Taylor was also a finalist for the Naismith Defensive Player of the Year Award as one of the top four defensive players in the entire country.\nTaylor averaged 10.1 points, 4.1 rebounds, 3.4 assists and 2.5 steals per game and earned second-team All-Big Ten honors as she helped lead Ohio State to the regular-season Big Ten championship. She now plays for the WNBA’s Indiana Fever, who selected her with the 15th overall pick in this year’s WNBA draft.\n28. Tyleik Williams, Football\nWilliams went from flashing inconsistently in his first two seasons as a Buckeye to dominating in his junior season, earning second-team All-American and All-Big Ten honors as he recorded 53 total tackles – the most by any Ohio State defensive tackle since Johnathan Hankins in 2012 – including 10 tackles for loss, which tied for the team lead.\nPlaying a rare volume of snaps (642) for a 320-plus-pound defensive tackle, Williams was one of Ohio State’s most disruptive defenders all year long, leading the way up front for a defense that ranked No. 2 in the country with only 11.2 points allowed per game.\n27. Addie Engel, Women’s Cross Country\nOne year after becoming Ohio State’s first-ever Big Ten champion in cross country, Engel defended her title at the 2023 Big Ten championship by winning the six-kilometer race by a 9.5-second margin.\nThe senior from Springfield, Ohio, went on to finish second at the NCAA Great Lakes Regional. She was on pace for an All-American finish at the NCAA championship until a fall led to a 61st-place result.\n26. Leah Bertrand, Women’s Track and Field\nBertrand was the star of Ohio State’s outdoor track and field season, winning the Big Ten championship with an 11.16-meter 100-meter dash and following that up by running an 11.05 100 to earn All-American honors with a seventh-place finish at the NCAA championships.\nThe junior was also among the nation’s top sprinters during the indoor season, finishing second in the Big Ten and 15th at NCAAs in the 60-meter dash.\n25. Emily Londot, Women’s Volleyball\nLondot earned first-team All-Big Ten honors for the third time in her Ohio State career and was a unanimous selection for the second time. She led the Big Ten and ranked fourth in the country with 5.06 kills per set and led the Big Ten and ranked sixth in the country with 5.51 points per set.\nIn a down season as a team for the Buckeyes, who went just 11-18 one year after making the Elite Eight, Londot was as good as ever individually, earning AVCA All-Region honors for the fourth straight year.\n24. Jacob Pasteur, Men’s Volleyball\nPasteur earned first-team All-MIVA honors for the third straight year as he led the Ohio State men’s volleyball team to a 22-9 season in which the Buckeyes won the MIVA Tournament title and qualified for the NCAA Tournament.\nThe senior from Maryland led the Buckeyes with 390 kills and 480 points, also earning second-team All-American honors from the AVCA.\n23. Cotie McMahon, Women’s Basketball\nAfter emerging as an immediate star as a true freshman in 2022-23, McMahon experienced some ups and downs in her sophomore season but still ended up as a first-team All-Big Ten honoree.\nMcMahon averaged 14.4 points and hauled in a team-high 6.3 rebounds per game, playing a vital role for the Big Ten champions on both ends of the floor with her ability to defend and drive to the basket. She was at her best in some of the biggest games of the season, including a 33-point, 12-rebound performance in a memorable overtime victory over Caitlin Clark and Iowa, the eventual national runner-up.\n22. TreVeyon Henderson, Football\nAfter battling through a foot injury for most of the 2022 season, Henderson reminded everyone how dynamic he can be when healthy as he accumulated 1,155 yards from scrimmage and 11 rushing touchdowns in only 10 games in 2023.\nThe junior running back’s 115.5 yards from scrimmage per game were the 20th-most in the country and he earned first-team All-Big Ten honors for the first time in his career.\n21. Kary Hollenbaugh, Women’s Golf\nHollenbaugh played 26 rounds during the 2023-24 season and was a counting scorer for the Buckeyes in all of them, finishing the year with a team-best 71.69 scoring average. She earned four top-10 finishes and seven top-20 finishes in just nine events, earning an individual win with an 8-under-par score at the Spartan Sun Coast Invitational.\nThe sophomore from New Albany earned first-team All-Big Ten honors and was an honorable mention All-American.\n20. Hannah Bach, Women’s Swimming\nBach was Ohio State’s top performer at the Big Ten women’s swimming and diving championships, finishing first in the 100-yard breaststroke while also winning gold medals with the 200 and 400 medley relay teams, leading the Buckeyes to a second-place finish at the conference championship meet.\nBach followed that up by earning first-team All-American honors as a member of Ohio State’s second-place 200 medley relay team and with a sixth-place finish in the 100 breaststroke, leading the Buckeyes to a ninth-place finish in the team standings.\n19. Laurence Wootton, Men’s Soccer\nWootton made history by earning his fourth first-team All-Big Ten honor, an award no previous Ohio State men’s soccer player had won more than twice, becoming the sixth player in Big Ten history to be a four-time first-team all-conference selection. He also became the first Buckeye and just the second player in conference history to win the Big Ten Midfielder of the Year Award twice.\nThe Englishman scored a team-high five goals, including two game-winners, as the Buckeyes went 6-6-6 on the year. Chicago Fire FC selected Wootton in the third round of the 2023 MLS SuperDraft and he is now playing his first season of professional soccer for the Indy Eleven of the United Soccer League.\n18. Rocco Welsh, Wrestling\nWelsh made a spectacular NCAA championship run as a true freshman, advancing all the way to the final before falling to Penn State’s Carter Starocci in the national championship match at 174 pounds. He became Ohio State’s first true freshman to make an NCAA championship final since Myles Martin in 2016.\nFor the season as a whole, Welsh went 26-6 in his first year as a collegiate wrestler, notching an 8-3 record in duals and finishing third at the Big Ten championship. Half of his wins came by either tech fall (seven), major decision (five) or pin (one).\n17. Irina Cantos Siemers, Women’s Tennis\nCantos Siemers earned unanimous All-Big Ten honors for the fourth year in a row as she went 31-13 in singles and 25-17 in doubles in her final season as a Buckeye, leading the way for Ohio State to finish second in the Big Ten regular-season standings and in the Big Ten Tournament.\nShe earned All-American honors for the third time in four years by making the Round of 16 in the NCAA Tournament. She finished the season ranked 13th in the ITA singles rankings for women’s college tennis.\n16. Emily Armstrong, Synchronized Swimming\nWhile Ohio State’s 34-time national championship-winning synchronized swimming program had a down year by its standard, finishing fourth at the U.S. Collegiate Championships, Armstrong brought an individual national title back to Columbus by winning the A figures title for the second time in three years.\nThe junior from Toronto also finished fifth in the solo competition and sixth in both the duet (with teammate Hannah Heffernan) and trio (with Heffernan and Emma Spott) contests at the national championship meet.\n15. Ada Korkhin, Pistol\nKorkhin played a key role in Ohio State winning its fourth consecutive intercollegiate pistol championship.\nThe freshman from Massachusetts won the individual national championship in air pistol. She also finished second in sport pistol and seventh in standard pistol on her way to finish second – only to her Ohio State teammate Katelyn Abeln – in the individual aggregate.\n14. Jack Anthrop, Men’s Tennis\nAnthrop led the entire nation with 41 singles wins during the 2023-24 season, finishing the year with only six losses. He went 26-2 in dual matches, helping lead Ohio State to its 34-2 record for the season, while he also went 15-3 for the year in doubles competition.\nAnthrop earned first-team All-Big Ten honors for his efforts, then earned All-American honors by making a run to the quarterfinals in the NCAA men’s singles tournament. A redshirt sophomore this season, Anthrop will enter next year as the Buckeyes’ top returning player and one of the best singles players in the country.\n13. Robert Cash, Men’s Tennis\nCash had a historic fifth and final season at Ohio State. He broke Ohio State’s all-time record for doubles wins, finishing his career with 148 victories in doubles matches. The last five of those victories came in the NCAA doubles championship as he teamed up with JJ Tracy to win this year’s national title in doubles.\nCash went 36-7 in doubles for the year while also posting a 25-4 record in singles, winning the deciding singles match in Ohio State’s ITA Indoor Nationals victory over TCU. He earned second-team All-Big Ten honors for the third year in a row.\n12. Makenna Webster, Field Hockey/Women’s Hockey\nWebster was a star for not one but two Ohio State sports teams this past season.\nThe two-sport star began the year by leading the field hockey team with 17 goals and 12 assists, earning first-team All-Big Ten and third-team All-American honors as she led Ohio State to its best record (14-6) since 2010.\nWebster then played a key role in leading the women’s ice hockey team to its second national championship, scoring 12 goals and 14 assists on the season and earning All-Tournament team honors at the Frozen Four, where she had a goal and an assist in the Buckeyes’ NCAA semifinal win over Clarkson.\n11. Neal Shipley, Men’s Golf\nShipley has competed on three of the biggest stages in golf over the past year and shined bright in all of them. He finished as the runner-up at last summer’s U.S. Amateur, earning him berths in both The Masters and the U.S. Open this year. Playing against the best professional golfers in the world in both of those tournaments, Shipley made the cut in both majors, earning him a trip to Butler Cabin in Augusta as the Masters’ low amateur; as of Saturday, he was tied for the best score among amateurs at the U.S. Open, which concludes Sunday.\nThe Pittsburgh native also excelled in his final season of collegiate competition, leading the Buckeyes with a 71.35 scoring average and earning an individual victory at the Southwestern Invitational. He was unanimously selected to the All-Big Ten first team and was named as an honorable mention All-American by PING.\n10. Raygan Kirk, Women’s Hockey\n9. Hannah Bilka, Women’s Hockey\n8. Cayla Barnes, Women’s Hockey\nBarnes, Bilka and Kirk all make the top 10 as the three top players on the national championship-winning women’s hockey team, which emerged as the sport’s best team because of its depth of talent across the roster.\nBarnes earned second-team All-American and first-team All-WCHA honors as one of the best defensemen in women’s college hockey. Her 36 points ranked sixth among all NCAA defensemen while her plus-minus of +71 was 16 points better than any other player in the sport.\nFellow Boston College transfer Bilka also earned first-team All-WCHA honors as the Buckeyes’ leading scorer, finishing the year with a team-high 48 points on 22 goals and 26 assists.\nKirk was one of the best goaltenders in women’s college hockey all year long, finishing the season with the nation’s best winning percentage (.917) with a 22-2 record in net as well as the second-fewest goals against average (1.05) in the country. She earned second-team All-WCHA honors and was named the Most Outstanding Player for the Frozen Four after holding Ohio State’s opponents to just one combined goals in three NCAA Tournament games.\nAll three players will now play professionally after being selected in this past week’s PWHL draft. Bilka was the No. 4 overall pick and Barnes was the No. 5 overall pick in the draft while Kirk was the draft’s 42nd and final selection.\nBuilding a legacy #GoBucks pic.twitter.com/E8LbVsgHtn\n— Ohio State Women's Hockey (@OhioStateWHKY) March 31, 2024\n7. Denzel Burke, Football\nOhio State had the best pass defense in college football in 2023, holding opponents to an FBS-low average of 145.9 passing yards per game, and no one played a bigger role in that dominance than Burke. The junior cornerback was a first-team All-Big Ten honoree and second-team All-American as he locked down his opponents as OSU’s No. 1 cornerback all year long.\nWhile Burke could have been an early-round pick in this year’s NFL draft, he chose to return to Ohio State for his senior season alongside Williams, Jack Sawyer, JT Tuimoloau and several other defensive stars, making OSU the clear-cut preseason favorite to have college football’s best defense in 2024.\n6. Jacy Sheldon, Women’s Basketball\nAfter she was plagued by a foot injury for most of the 2022-23 season, Sheldon returned to form as one of the best players in women’s college basketball in 2023-24. She earned first-team All-Big Ten honors, second-team AP All-American honors and Big Ten all-defensive team honors as she averaged 17.8 points, 3.75 assists and 1.9 steals per game to lead Ohio State to the Big Ten regular-season championship.\nFollowing her final season as a Buckeye, Sheldon was selected with the No. 5 overall pick in the 2024 WNBA draft, becoming Ohio State’s first first-round WNBA draft pick since Kelsey Mitchell in 2018.\n5. Lyle Yost, Men’s Diving\nYost won the national championship on the 1-meter board for the second straight year, becoming the first athlete from Ohio State’s men’s swimming and diving team to win back-to-back national titles since Tim Moore won the 1-meter dive three straight times from 1973-75.\nThe fifth-year senior from Shaker Heights also earned All-American honors in the 3-meter dive with a seventh-place finish in that event. He earned top-three finishes in all three events he competed in at the Big Ten championship, finishing third in the 1-meter, fourth in the 3-meter and fifth on platform.\nYost was named as Ohio State’s male winner of the Big Ten Medal of Honor this year, recognizing his excellence both in the pool and in the classroom. He also earned Academic All-American honors with a 3.87 GPA as he balanced student teaching with his diving this past season as he pursued a graduate degree in education.\n4. Katelyn Abeln, Pistol\nAbeln completed her illustrious Ohio State career by winning her second consecutive individual aggregate national championship. She also won the individual titles in both the sport and standard pistol categories while finishing second in air pistol to lead the Buckeyes to their fourth straight team title in convincing fashion.\nA five-time All-American, Abeln ranked among Eleven Warriors’ top 20 Ohio State athletes of the year in all five of her years as a Buckeye. The most decorated pistol shooter in OSU history, Abeln will now compete for Olympic medals in both air pistol and sport pistol at the Paris Olympics this summer.\n3. JJ Tracy, Men’s Tennis\nTracy led the nation with a whopping 77 combined wins as he went 40-4 in singles and 37-8 in doubles during the 2023-24 season. He earned first-team All-Big Ten honors for the third year in a row as he led Ohio State to Big Ten regular-season and tournament championships and the semifinals of the NCAA team competition.\nTracy then made a run to the quarterfinals in the NCAA men’s singles competition before teaming with Cash to cap his college career with an NCAA doubles championship.\n2. Jesse Mendez, Wrestling\nMendez became the first Ohio State wrestler since 2018 to win a national championship as he bested Penn State standout Beau Bartlett with a takedown in the final 10 seconds of the 141-pound final to bring home the NCAA title.\nThe winning takedown for Jesse Mendez!\n— NCAA Wrestling (@NCAAWrestling) March 24, 2024\nESPN#NCAAWrestling x @wrestlingbucks pic.twitter.com/sruBsM2PkN\nThe sophomore from Indiana also defeated Bartlett in the Big Ten championship final to win the conference crown. For the season as a whole, Mendez went 30-2 with a 13-2 record in duals, winning most of his matches in dominant fashion as he secured 10 tech falls, five major decisions and six pins.\nWith two more years to go at Ohio State, Mendez has a chance to continue building his legacy and establish himself as one of the greatest wrestlers in program history.\n1. Marvin Harrison Jr., Football\nNo Ohio State athlete drew a bigger spotlight in 2023-24 than Harrison, and the superstar wide receiver lived up to the hype. By catching 67 passes for 1,211 yards and 14 touchdowns, Harrison earned the Biletnikoff Award as college football’s best wide receiver and became just the fifth football player in Ohio State history to be named a unanimous first-team All-American twice.\nHarrison won the Silver Football as the Big Ten’s best player as well as the Big Ten Offensive Player of the Year Award and his second straight Big Ten Receiver of the Year Award. He became just the 10th wide receiver (and the first from Ohio State) to earn an invitation to the Heisman Trophy ceremony since the Heisman Trust began naming multiple finalists for the award in 1981. And he became Ohio State’s highest-drafted wide receiver ever when the Arizona Cardinals selected him with the No. 4 overall pick in the 2024 NFL draft.\nPairing his 2023 season with an arguably even more spectacular 2022 season, Harrison became the most decorated wide receiver in Ohio State history. While Ohio State fell short of its team goals in 2023, Harrison was still undeniably the face of Ohio State athletics in his final season as a Buckeye, and Buckeye fans will remember his individual greatness at OSU for decades to come.",
  "word_count": 4010,
  "scraped_at": "2026-02-14T12:47:50.380659"
}