{
  "article_id": "7c51da04b833",
  "url": "https://cartilagefreecaptain.sbnation.com/2024/9/3/24234256/tottenham-hotspur-transfer-news-rumors-opinion-no-way-to-grade-spurs-business",
  "title": "There no real way to grade Tottenham summer transfer window",
  "date": "20240903T104500Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "I celebrate 10 years as Managing Editor of Cartilage Free Captain in October. In nearly all of the summer transfer windows over the past decade, I asked my fellow writers at Carty Free to submit a paragraph or two on Tottenham Hotspur’s efficacy in the transfer window, and to assign a letter grade to the club’s window as a whole.\nThere’s no real way to grade Tottenham’s summer transfer window\nWith so much weirdness, silence, and conflicting ideas of what success means, assigning a grade to Spurs’ transfer business feels gauche and unfair.\nI’m not doing that this year.\nWhy? For several reasons, but in part because this has simply been a weird year. There were and continue to be forces outside of the clubs’ control that have dictated what moves were available, as well as how and when world football clubs made moves for players. The Premier League’s PSR rules shackled certain clubs from being able to make moves at all until they could prove that their books didn’t fall afoul of the league’s new rules on overspending. This also led to shenanigans like Italian-style overpriced sales of youth academy players, or Chelsea selling a hotel and its women’s team to itself, all of which could still backfire spectacularly.\nIn addition, the expected backstop of money provided by the bottomless pockets of the Saudi Premier League didn’t have as much of an effect as anticipated. There wasn’t a blockbuster £200m sale of a player like Victor Osimhen or Mohamed Salah that would inject an adrenaline-like boost of cash into the market, and so things just kind of stagnated for much of the window (Chelsea’s bizarre and schizophrenic transfer moves notwithstanding).\nSo that’s one reason. But the other reason I’m not compiling and dispensing transfer grades this summer is that Spurs’ approach to the transfer window turned out to be very, very different than what everyone, including us, anticipated. I have seen one person rate Tottenham’s current window as an A-, mostly because of the outgoing players and the acquisition of Dominic Solanke. I have seen others rate the same window a D because Tottenham did not fully address the obvious holes in the starting XI, or purchased players that are not ready to contribute immediately after the promise of last season. Both are valid opinions, and both are very, very different grades.\nNow, opinions are opinions, but the fact remains that this summer, perhaps more than any other summer I can remember, there’s a huge disconnect between various fans’ expectations. Did Spurs set themselves up for success? Is this a rebuilding year? What does success even look like, and did Tottenham meet that threshold?\nAnd how in the world are we to grade this window with all of that swirling around?\nBecause of that disconnect, I feel like it behooves us all to re-evaluate Tottenham’s window under a different frame, one that shifts the “Overton” window from:\nTottenham need to improve the quality of the squad to compete for titles this season\nto:\nTottenham are engaged in a systematic and long-term project to improve and this summer is about changing the squad rather than outright improving it.\nTo be fair to everyone reading this article, this isn’t the piece I expected to write either. And if you were fully committed to the idea of the first statement, readjusting your frame to embrace the second feels like, at best, a slightly disappointing restructuring of your anticipation for this season, and at worst, a deeply upsetting concession to what might feel like a lack of ambition or embracing of failure. Both are equally valid responses and would help to explain the dramatically different opinions of, say, the average Carty Free reader to the average purple-and-yellow Spurs fan still (unfathomably) reading and posting on Twitter.\nHeading into the summer, I would suggest the majority of Spurs fans had two main goals for the summer:\n- Get rid of the numerous squad players that either don’t fit Ange Postecoglou’s tactics or who are aging out of the team and are on high wages\n- Sign improved talent at several positions of need, notably defensive midfield, striker, left back, and central defense\nIt’s simple, innit? Just get rid of all the deadwood and sign Eberechi Eze, Kvicha Kvaratshkelia, and a reincarnated Mousa Dembele who can also defend. Transfer windows are easy! And it must be said that Johan Lange and his recruitment team did an excellent job at #2, shifting an enormous number of players out of the club, slimming down the bloated team size and also shifting the age of the squad decidedly younger.\nCompounding the confusion is an online media and social media apparatus that is wholly committed to leaks and transfer rumors clashing with Johan Lange, who has operated in near complete radio silence this summer. There have been very few actual leaks from sources inside the club this window. Most of the transfer rumors that have emerged — and there have been many — have been driven either by agents representing various players and their interests, or completley unsourced and unverified “ITK.” With no real leaks coming from inside the club, fans whipped themselves into a frenzy online with every new, and eventually debunked, “rumor” emerging from Bat Country.\nThat said, in hindsight it’s clear that Lange and the Spurs’ recruitment team’s focus on incoming players was either significantly more focused on bringing in younger, high ceiling players at the expense of established, more expensive players that could significantly improve Spurs’ starting XI than we realized. Or, they shifted their strategy mid-stream in response to the realities of the market. Yes, Tottenham did make a splash by shelling out a club-record £65m for Bournemouth striker Dominic Solanke, a true statement of intent in a position of real need. But their other incomings were significantly different.\nLucas Bergvall and Archie Gray are young players with enormous potential, but that potential is not yet realized and we won’t know if it will be for a while. Wilson Odobert is a similar profile — he fits the need of a “dribbly winger” but he is still young and has only one year of Premier League experience, on a terrible Burnley team. Yang Min-hyeok could be the next Son Heung-Min, or “merely” the next Ki Sung-Yeung, we don’t yet know.\nIf you are a Spurs fan expecting the club to sign the perfect player, regardless of price, to fit all of the holes in Tottenham’s squad, this probably feels like an extremely underwhelming window. The fact that Tottenham did not end up signing Ebereche Eze (ignoring the fact that Tottenham maybe dropped any potential interest in Eze weeks ago) and Pedro Neto (perhaps not ever a serious target), but spent significant money seemingly out of nowhere on a player like Odobert few players had actually heard of (and apparently the deal had been quietly in the works for months) will feel like an infuriating betrayal and a “lack of ambition.”\nBut in hindsight, Lange and Postecoglou were clearly not going for quick fixes and instant gratification. Ange, for the record, was clear after the window closed that he would rather not sign anyone than sign the wrong player, which echoes in many ways the approach taken by Mauricio Pochettino years ago. Lange and Spurs’ recruitment team seem like their approach has been, from the beginning, to focus energies on turning the squad over, and targeting youngsters with high potential that can develop into the next Tottenham Hotspur stars. That likely kicks the can down the road when it comes to challenging for titles, but, the argument goes, allows Spurs further flexibility and a chance for the weird market to make itself, hopefully, less weird next summer.\nIn summary — Tottenham spent their transfer energy clearing out a bunch of unwanted players, and brought in a bunch of young guys and a striker. That’s pretty clearly a project window, not a transformative one. It means that even with Ange developing his team and instilling his tactics, Tottenham might not be as good this season as we hoped. And that’s difficult for some of us to accept.\nSo how are we supposed to evaluate the window? That’s something you’ll have to figure out for yourselves, but assigning letter grades from on high doesn’t feel like the right approach to me. Personally, I’m both excited about the prospects of players like Bergvall, Gray, and Odobert, as well as Spurs academy stars like Mikey Moore, Will “BIG WILLY LANKS” Lankshear, and Jamie Donley, and also disappointed that Tottenham weren’t able to find the players in the window that will immediately take the team to the next level. I appreciate the team focusing on young pIayers with potential, while recognizing that it’s a significant gamble on the future at the expense of the present that could backfire. I grapple with the conflicting desires to be competitive and challenge for titles now, with the reality that Postecoglou is in the middle of a multi-year project that may not bear fruit for a while. I believe Ange has been backed by the club, while also thinking he could’ve (and maybe should’ve) been backed MORE.\nI also think about Mikel Arteta at Arsenal (groan, I know) and how their club stuck with him after starting his tenure finishing 8th, 8th, and 5th in his first three seasons. The Arsenal fanbase howled for him to be sacked. Spurs fans reveled in his weird ideas and finishing above them in the table while Arsenal fans questioned his every move, both on the pitch and in the transfer market. But Arsenal stuck with Arteta, backed his vision, and have turned that club from an afterthought into one of the best teams in the league. Arsenal’s trust in Arteta never wavered, and that trust paid off. I hate that it happened to them, but I still want that same thing for us.\nThat tension between what we want and what is is something we’ll all need to deal with, and until we do, the only appropriate grade for this window is — Incomplete.",
  "word_count": 1687,
  "scraped_at": "2026-02-14T13:15:06.181678"
}