{
  "article_id": "7c7b1e917dec",
  "url": "https://www.the42.ie/ireland-belgium-nations-league-promotion-relegation-6725416-Jun2025/",
  "title": "Ireland to face Belgium in Nations League promotion - relegation play - off",
  "date": "20250606T151500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE IRELAND WOMEN’S team will play Belgium at the play-off stage of the Uefa Nations League.\nThe two-legged promotion-relegation clash will take place in October after today’s draw with a place in League A on the line.\nCarla Ward’s side will be at home for the first leg and travel to Belgium for the second leg, with venue and ticket details yet to be announced. The FAI mentioned Friday, 24 October, and Tuesday, 28 October, in their social media posts, while Belgium generally play their home games in Leuven.\nTuesday’s 1-0 win over Slovenia, thanks to a Saoirse Noonan header, saw Ireland progress to the play-offs as they fell short of the four-goal victory needed to seal to spot and secure automatic promotion.\nIreland have played Belgium six times – winning their first-ever meeting in 1980 – and they last came up against each other in an international friendly in April 2021 in Brussels. The hosts won 1-0, leading from the 14th minute.\nBelgium are 20th in the Fifa Women’s World Rankings, six places above Ireland, and are preparing for this summer’s European Championships in Switzerland.\nThey stunned defending champions England 3-2 in their Nations League group in April, while their other win came against Portugal (3-0) last week. They led world champions Spain 2-0 until the 77th minute of their opener, but fell to a 3-2 away defeat. They were beaten 5-1 in the return tie, while lost their other games to England (5-0) and Portugal (1-0).\n“We now know our opponents for this play-off and our preparation for those two games starts now,” said Ward.\n“We know that Belgium are a very good team with a strong history in women’s football, so this will be a difficult challenge for us but one that we are excited to take on.\n“Having won five of our six group games in the Nations League and ended with a very good performance against Slovenia, we are building day by day, game by game. We have a fantastic team spirit, a brilliant support staff and a group of players who are ready to take that next step in their progression.\n“Next up are two games against the United States, which will help as part of our preparation but the play-off is our next target. We want to reach League A to play against top-ranked teams and be in the best position possible going into the 2027 Fifa World Cup qualifiers next year.”\nAnna Patten will be suspended for the first-leg after her second yellow card of the group in the closing minutes of Tuesday’s win over Slovenia at Páirc Uí Chaoimh, while other bookings to Katie McCabe, Denise O’Sullivan, Caitlin Hayes and Aoife Mannion won’t carry over.\nDenmark (12th), Iceland (13th) and Austria (18th) were Ireland’s other possible opponents, Austria the only of the quartet not preparing for Euro 2025.\nNorthern Ireland drew Iceland as they bid to reach League A for the first time, while Finland and Denmark, and Czechia vs Austria also go head-to-head in the League A/B promotion/relegation play-offs.\nLeague A status significantly boosts 2027 World Cup qualification hopes, with all teams guaranteed a play-off with favourable seedings.\n- Additional reporting from Emma Duffy.",
  "word_count": 534,
  "scraped_at": "2026-02-14T12:35:48.764430"
}