{
  "article_id": "7c8178331e19",
  "url": "https://www.thecourier.com.au/story/8693162/ballarat-city-faces-off-against-geelong-at-morshead-park/",
  "title": "Ballarat City faces off against Geelong at Morshead Park | The Courier",
  "date": "20240712T023000Z",
  "domain": "thecourier.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "STATE LEAGUE 1\nBallarat City Men v Geelong @ Morshead Park\nSubscribe now for unlimited access.\nor signup to continue reading\nAfter a shock defeat at home last weekend, there are no more second chances for Ballarat City as they chase the valuable three points in State League 1 this weekend.\nLast wee's 1-0 defeat to Clifton Hill would have hurt hard, but at least they can take some solace in the knowledge that when they were defeated by Clifton Hill earlier in the season, they were able to rebound quickly and defeat Geelong on the road.\nThis week is a similar situation apart from the fact the match is at home.\nWhen the two sides met in round four it was a 1-0 win to City thanks to a Xagai Douhadji strike deep into the second half.\nA win for City here will move it back into the top four at the expense of Geelong, however a defeat could see it slip down to as low as seventh if other results go against it.\nWith early game in Ballarat on Saturday in both State League 3 and State League 4, Saturday's match at Morshead Park does not kick off until 5.30pm.\nSTATE LEAGUE 1\nBallarat City Women v Kings Domain @ Kings Domain\nBallarat City finds itself in a solid enough position on the State League 1 ladder, but can't afford to drop too many games on the run home.\nAfter an impressive 2-2 draw with the second placed Mill Park in the previous round, City will be chasing a much-needed three points when they meet up with the struggling Kings Domain.\nKings Domain has tasted success only once this year, but when they faced Ballarat City earlier in the season at Morshead Park, they proved to be more than competitive, with City taking a long time to shake off the plucky opposition.\nOn that day, Ballarat City eventually got the job done 2-1 thanks to a first half goal from Lisie Dodds and a fortunate own goal.\nSunday's match will be far from a walk in the park, but City should have the talent to get the job done on the road.\nSunday's match is an early game at Kings Domain, getting underway at 1pm.\nSTATE LEAGUE 3\nSebastopol Vikings v Altona North @ St Georges Reserve\nSebastopol Vikings are in desperate search for a win but it won't be an easy task this weekend against the fourth placed Altona North.\nThe Vikings are coming off yet another draw, this time on the road to Diamond Valley, but will be keen to feel the home comforts of St George's Reserve for this match.\nWhen the two sides met earlier in the season it was a big win to Altona North 5-1, but the Vikings would be confident of a much better result this weekend.\nSaturday's match at St George's Reserve gets underway at 3pm.\nSTATE LEAGUE 5\nBallarat SC v Gisborne @ Trekardo Park\nThe challengers keep on coming for Ballarat SC, but recent good form should give it confidence of a strong result against one of the top teams in State League 5 this weekend.\nBallarat this weekend is at home to the third-placed Gisborne at Trekardo Park on Saturday afternoon.\nGisborne sits third on the table with eight wins, two losses and three draws. When these two sides met back in round four it was a convincing win to Gisborne 3-0.\nBallarat will be keen to use its recent defensive edge to shut down the opposition attack and if it can find some attacking flair, an upset could be very much on the cards.\nSaturday's match at Trekardo Park gets underway at 3pm.\nBDSA\nAfter the week's rest, the Ballarat District Soccer Association men's Division 1 competition returns this weekend with a couple of games that will shape the upcoming finals series.\nWith top side Vikings having the bye, there's plenty of opportunities for the chasing pack to close in. Ballarat North United will be hoping to cash in on its opportunity when it clashes with the lowly Daylesford while Creswick will be chasing some much-needed points when it heads to Maryborough.\nFriday night's match between Forest Rangers and Ballarat looks to be the match-of-the-round while the other game sees Victoria Park at home to Bacchus Marsh.\nThe women's competition sees Creswick up against Victoria Park on Friday with Ballarat North United at home to Forest Rangers on Sunday. Also on this weekend is the Ballarat derby between Ballarat White and Ballarat SC.\n- Need more sport from The Courier? Check out our WhatsApp channel for stories as they go online, and download our app for breaking news alerts - and daily puzzles",
  "word_count": 787,
  "scraped_at": "2026-02-14T12:18:08.203985"
}