{
  "article_id": "7c92d67f4ade",
  "url": "https://www.nytimes.com/athletic/6402117/2025/06/05/xabi-alonso-real-madrid-coaching-staff/",
  "title": "Xabi Alonso Real Madrid staff : Two ex - Barcelona coaches , a former Leeds assistant and an academy mainstay",
  "date": "20250605T051500Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Xabi Alonso era has begun at Real Madrid — and it’s brought a significant refresh of the first-team coaching staff.\nCarlo Ancelotti’s exit to manage the Brazil national team has led to the fellow Italians who assisted him at the Bernabeu leaving too. That was a group that led Madrid to win two Champions League titles after Ancelotti’s return for a second spell as coach in 2021, so replacing them will be a tough task.\nAdvertisement\nThe Athletic has spoken to multiple sources who have worked or are working with those in Alonso’s new-look coaching setup — on the condition of anonymity to protect relationships — to find out who the new guys are and what their roles at Madrid will be.\nSebastian Parrilla (assistant coach)\nKnown as Sebas, Parrilla is the only member of the new backroom staff who has been with Alonso all through the latter’s coaching career — right back to when they were in charge of Real Madrid Under-14s in 2018.\nFormer Liverpool, Madrid, Bayern Munich and Spain midfielder Alonso wanted someone with experience alongside him as he took his first steps in coaching and turned to the Argentinian, who at that stage had spent nearly two decades working within the club’s academy. He was recommended by experienced in-house figure coach Manolo Diaz, previously the head of development at Madrid.\nStaying with Alonso, Parrilla then made the jump to Real Sociedad’s ‘B’ team and on to Bayer Leverkusen before returning to Madrid. Sources at Leverkusen describe the now 47-year-old as a “highly valued coach”. Parrilla also holds a UEFA Pro Diploma, the European football body’s highest coaching qualification.\nSeveral players who have worked with Parrilla in the Madrid youth system and at Real Sociedad describe him as someone who was close to those squads and knew how to keep everyone engaged — from the ones who were getting lots of game time to their team-mates given fewer opportunities.\nAlonso relies on him for practically every part of the game, particularly defence, but also set pieces and the team’s overall style of play.\n“His place was in professional football instead of with those kids,” says another source who has extensive knowledge of Madrid’s youth system. Parrilla is seen as being loyal and discreet, and he keeps a low profile — all of which are highly valued by Alonso.\nAdvertisement\nIsmael Camenforte Lopez (fitness coach)\nCamenforte Lopez will be Madrid’s new head of fitness preparation. The 40-year-old spent eight years at Barcelona’s academy from 2011-18 — he is not the only coach on this staff with links to Madrid’s fierce La Liga rivals, as we will see below.\nAccording to various sources consulted at Valdebebas, Madrid’s training complex, Camenforte Lopez is highly educated, having been taught by renowned scientist and physical trainer Paco Seirul-lo Vargas at Barca. He focuses more on the style of play of Alonso’s teams, planning players’ loads and on-pitch work, rather than what happens in the gym.\nVoices close to Camenforte Lopez say he is a discreet person who is observant and obsessed with his work. He has even created his own app, focused on strength training, called ‘K-Forte’.\nAfter his time at Barcelona’s La Masia academy, he had time with New York City (2018-19), Denmark’s national team (2019-20) and Leverkusen (2020-25), which is where he met Alonso, who was appointed manager there in 2022.\nAlberto Encinas (analyst/assistant coach)\nEncinas is the other former La Masia coach Alonso has brought with him after a successful spell together at Leverkusen. The 43-year-old was actually appointed at Barca following a recommendation from Camenforte Lopez.\nThey both worked with Barcelona B (the reserve side now known as Barcelona Athletic) coach Gerard Lopez there.\n“He has a low profile — discreet, shy — but is very hard-working and has a very good ability to read match situations,” Lopez tells The Athletic. “He helped me and gave me perfect results at Barcelona B.”\nThe contribution of both assistants extended beyond their roles, according to Lopez.\n“They are two very good partners for a coach,” he says. “I relied on them a lot to read the games and even to prepare a possible XI and see how the boys were doing. It wasn’t just that they gave me a video or an analysis and I worked on it. I used them a lot to consult on any aspect of the game. I got the impression that we were a very strong squad, and with Xabi they have achieved the same thing: a super-strong squad (at Leverkusen).”\nAdvertisement\nBenat Labaien (video analyst/assistant coach)\nLabaien is the youngest member of Alonso’s coaching staff at 37, but he is not short of experience. A fellow Basque, the analyst spent three years at Atletico Madrid at the start of his career, a year with the Spanish football federation and worked at Real Madrid from 2011-14.\nPart of Fernando Morientes’ coaching staff when the former Madrid striker was in charge of their under-19s team from 2012-14, he is a well-known figure around Valdebebas and knows some of those who work there well already.\nHe has also had several experiences outside of Spain, including at Leeds United from 2017-18, when he was assistant to Thomas Christiansen and Paul Heckingbottom in the Championship — English football’s second division. A source who was also at Leeds at the time describes Labaien as an “expert” and says it was “impossible to find someone better in the Spanish market”.\nLabaien moved to Real Sociedad in 2018 as then head coach Imanol Alguacil’s analyst and played a role in the San Sebastian club’s most important recent success — winning the Copa del Rey in 2021.\nBefore joining Madrid, Labaien took charge of Japanese side Tokushima Vortis in his only role as head coach in 2023 and was also an assistant for Qatari side Al Wakrah and Real Zaragoza back in Spain.\nTristan Celador (individual work, analysis and academy focus)\n“More than 20 years in-house, with the Real Madrid stamp and values. Knowledgeable about the idiosyncrasies of the club. Knowledgeable about the academy. Knowledgeable about the game.”\nThat is how a source at Valdebebas described Celador, who did not attend Alonso’s presentation but was revealed by The Athletic to be the fourth known member of his staff.\n⚡️NEW: Tristan Celador set to join Xabi Alonso's staff at Real Madrid as analyst and with a focus on individualised work\nRecommended by assistant coach Sebas Parrilla\nTC has been at the club for more than 20 years and he was at the women's team last season.@TheAthleticFC\n— Mario Cortegana (@MarioCortegana) May 31, 2025\nCelador, who also holds the UEFA Pro Diploma, is one of the most veteran employees at Madrid’s headquarters, having joined the club in 2001. He was first tasked with coaching promising players, such as Achraf Hakimi, now a Champions League winner with Paris Saint-Germain, during his time in the youth system in the 2014-15 season, unusually combining that job with one in the distribution department of Spanish newspaper El Pais.\nAdvertisement\nRising through the ranks of the Madrid academy, Celador ended up as No 2 to women’s team head coach Alberto Toril last year. Toril recently left his position but Celador has stayed, having gained the trust of some of the club’s most important figures.\n💬 Tristán Celador, entrenador del Infantil A: \"Intentaremos competir con la ilusión al máximo\".#HalaMadrid | #LaFábrica pic.twitter.com/3kJPpoDP25\n— Cantera Real Madrid (@lafabricacrm) October 2, 2021\nAmong those is Parrilla, who knows him well from his own previous spell at Madrid and was the driving force in recruiting him for Alonso’s staff. Celador was part of the club’s ‘methodology’ department that oversees the style of the academy teams and is known for his ability to assess individual player performances.\nIn recent years, there was a suggestion that Ancelotti’s staff needed more members who could help develop the first team’s youngsters, such as Arda Guler and Eduardo Camavinga. Celador should help solve this problem.\nWho has left and who stays from Ancelotti’s staff?\nThree members of Ancelotti’s backroom team have joined him in Brazil: assistant Francesco Mauri, head of analysis Simone Montanaro and fitness trainer Mino Fulco.\nCarlo’s son and assistant coach, Davide, meanwhile, has also left but has not joined up with his father and former colleagues in South America. The 35-year-old would like to start his own career as a head coach and has received interest from Rangers in Scotland — before they announced the appointment of former Southampton manager Russell Martin on Thursday — and Spanish second-tier side Deportivo La Coruna.\nAnother to leave is Giuseppe Bellistri, the former right-hand man of Ancelotti’s head of physical preparation Antonio Pintus. He wants to be a first-team fitness coach in his own right and was highly praised at Valdebebas; staying in Spain or moving on to Italy are possible next steps for him.\nThe goalkeeping coach Luis Llopis — who is from the same Gipuzkoa province of the Basque Country as Alonso and met him at Real Sociedad — is set to continue and has the backing of everyone at Valdebebas. Alvaro Gomar and Carlos Herrera, who were part of the analysis team under Montanaro, will now work alongside Encinas and Labaien.\nAdvertisement\nThe only doubt is over Pintus, who is expected to stay at the club at least through the upcoming Club World Cup, although Juventus have contacted him about the possibility of hiring him as their fitness trainer.\nThe Athletic has reported that Madrid want him to stay, and Camenforte Lopez and Pintus met last week — with Alonso present — to discuss how the new staff would be organised. But it remains to be seen whether the Italian, who is from a more traditional school of fitness training, will adapt to the requirements of Alonso’s former Leverkusen assistant.\nSo while the new-look coaching staff is in place for now, there could be more figures from the academy, or from outside, who join its ranks as Alonso’s revolution continues.\n(Top photo: Alonso at his Madrid presentation; Maria Gracia Jimenez/Soccrates/Getty Images)",
  "word_count": 1676,
  "scraped_at": "2026-02-14T12:35:53.707910"
}