{
  "article_id": "7ca55a0ce9d9",
  "url": "https://decider.com/2024/05/03/welcome-to-wrexham-season-3-fx-review/",
  "title": "  Welcome To Wrexham  Season 3 FX Review : Stream It Or Skip It ? ",
  "date": "20240503T190000Z",
  "domain": "decider.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "At the end of Season 2 of Welcome To Wrexham, Wrexham AFC earned a promotion back into the English Football League after 15 years in the fifth-level National League. In Season 3, the team is not only celebrating its promotion, along with its newfound fame thanks to the docuseries and owners Ryan Reynolds and Rob McElhenney, but they’ll also get a reality check at the beginning of their League Two campaign.\nWELCOME TO WREXHAM SEASON 3: STREAM IT OR SKIP IT?\nOpening Shot: An overview of the Racecource Ground stadium. “April 22, 2023.”\nThe Gist: This is the date that Wrexham AFC won the championship of the National League, earning them promotion back into the English Football League after 15 long years. They’ll play the next season in EFL’s League Two, and the hope is that the team, owned by Ryan Reynolds and Rob McElhenney, will earn a promotion to League One. In fact, the owners, management and players think they can win League Two.\nBut first, the owners are giving the team some well-earned time to whoop it up, namely during a blowout week in Las Vegas, where they partied, met celebrities and completely lived it up. Then they spent the summer playing “friendlies” in the U.S., either against MLS clubs or Premier League teams like Manchester United (at least their rookie club) and Chelsea. “I believe we lost 27-0?” says Rob about the Chelsea match, in which Wrexham was blown out, 5-nil. “They gave us 90 minutes of shut-the-fuck-up.”\nWhat the team found out during these friendlies is that, because of the show, Wrexham has lots of fans in the U.S., and they came out in force to support the team no matter where they played.\nDuring the Manchester United match, star forward Paul Mullen collides with Man United’s goalie; he ends up breaking 3 ribs and puncturing a lung. Because of the lung puncture, he is not allowed to fly home to Wales for two weeks, which means he won’t be with the team when it starts its League Two season.\nWrexham starts the season against a team they think is very beatable. However, as they quickly find out, the margin for error in League Two is a hell of a lot smaller than it was in the National League.\nWhat Shows Will It Remind You Of? As the seasons go on, Welcome To Wrexham feels less like a real-life Ted Lasso and more like a straight sports docuseries like Hard Knocks.\nOur Take: As Wrexham AFC makes its way up the ladder of the EFL, Welcome To Wrexham continues to be less about Ryan and Rob’s ownership of the team and more about how the team is such a huge part of identity of the city of Wrexham. But it seems that, now that the team has been promoted, this season is going to be a lot about how everyone involved in the club is going to get a reality check about the higher level of competition they face.\nWhat the show tries to portray is that, despite the team’s increased fame outside of its hometown, the members of Wrexham AFC are the same humble, working-class guys they’ve always been and that they still have a strong connection to their fans and the city. It’s why they don’t make any sort of connection between Wrexham’s eventful summer with their failure in their first League Two game. What everyone acknowledges, though, is that mental mistakes are going to cost them a heck of a lot more in League Two than they did in the National League.\nWe’re sure we’ll get more info about some of the players we haven’t already heard about, plus new players will inevitably join the team. The third episode is about how Wrexham’s women’s team adjusts to being in the top Welsh league.\nAnd, sure, Ryan and Rob will always be present; they are hands-on owners, who still have work to do to keep the team going. But they’re not the scrappy, underfunded team that Ryan and Rob bought in 2020, which is good for the team and their fans but not quite as entertaining for viewers.\nSex and Skin: None.\nParting Shot: Rob and Ryan visit the locker room after the first loss, and they comment that it felt like “a funeral” in there.\nSleeper Star: The sleeper is always going to be Humphrey Ker, who is Wrexham’s director of operations while not acting in shows like American Auto. He’s the realist among Ryan and Rob’s team. After the first game, Rob speculates that Wrexham is in 14th place, while Humphrey gives the real picture: They’re in 21st place.\nMost Pilot-y Line: Nothing we could find.\nOur Call: STREAM IT. Welcome To Wrexham isn’t exactly about the same plucky underdog team anymore. But as long as the show’s producers continue to emphasize the team’s connections with its fans and city, it should be a little more than just a straightforward sports docuseries.\nJoel Keller (@joelkeller) writes about food, entertainment, parenting and tech, but he doesn’t kid himself: he’s a TV junkie. His writing has appeared in the New York Times, Slate, Salon, RollingStone.com, VanityFair.com, Fast Company and elsewhere.",
  "word_count": 866,
  "scraped_at": "2026-02-14T12:57:34.537838"
}