{
  "article_id": "7ca63709e1d0",
  "url": "https://www.maitlandmercury.com.au/story/8958311/wallaroos-v-new-zealand-at-mcdonald-jones-stadium-on-may-10-layne-morgan/",
  "title": "Wallaroos v New Zealand at McDonald Jones Stadium on May 10 : Layne Morgan | The Maitland Mercury",
  "date": "20250507T001500Z",
  "domain": "maitlandmercury.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "KAITLAN Leaney had only played sevens rugby in Coffs Harbour when she moved to Newcastle for university and joined the Hunter Wildfires.\nSubscribe now for unlimited access.\nor signup to continue reading\nIt quickly lit a flame in the then 19-year-old. A spark to convert a hobby into a career.\nOn Saturday, Leaney will run out for her 26th Test when the Wallaroos take on the New Zealand Black Ferns at McDonald Jones Stadium (3pm).\n\"It feels nostalgic,\" Leaney said. \"Even training at No.2 Sportsground, that is where I spent my Saturdays.\n\"I was introduced to 15s when I came to the Hunter. I started at Hamilton and went straight across to the Wildfires. I think it was the Wildfires' first season in the Jack Scott Cup in 2020.\n\"That was a big opportunity for me. It was what got me selected in the NSW Waratahs.\n\"The team culture and morale - travelling down the bus to Sydney together - was instrumental. I knew it was something I wanted to take more seriously.\"\nLeaney, now 24, is a full-time player, splitting her time between playing for the Waratahs in Super W and with the Harlequins in the England Premiership Women's Rugby.\nThe powerhouse lock spent two years in Newcastle and is among four players in the squad, alongside halfback Layne Morgan, breakaway Ashley Marsters and winger Maya Stewart, with a strong connection to the Hunter.\nStewart has been ruled out of the Test against New Zealand after she suffered a knee injury in the Wallaroos' 43-7 thumping of Fiji in Suva on Saturday.\n\"We have a lot of players who live in Sydney now but are from the Hunter region,\" Leaney said. \"Newcastle is a second home for a lot of us. We have a lot of family live in this area as well.\"\nAnd she is banking on strong home support to give the Wallaroos an advantage against the world champions.\nThe record attendance for a stand alone Wallaroos match is 7055 at Redcliffe for a 50-0 defeat to the Black Ferns in June, 2023.\nA crowd of 3912 packed No.2 Sportsground when the Wallaroos last played in Newcastle, a 34-5 thumpinf of Japan in 2019.\nThe poularity of women's sport has since exploded, especially in the Hunter.\nNewcastle set a women's State of Origin crowd record in game two of the first three-match series last year when 25,782 brave rain-soaked conditions at McDonald Jones Stadium.\nThat attendance figure was eclipsed last Thursday night, with 26,022 on hand for Origin I of this year's series at Brisbane's Suncorp Stadium.\nIn April, 28,019 fans turned out to watch the Matildas beat Korea Republic 2-0 at Turton Road, the biggest crowd for a Matildas match in Newcastle.\nStrong attendance at the Wallaroos-Black Ferns clash on Saturday could strengthen Newcastle's case to host women's Rugby Union World Cup games in 2029. Newcastle is already a host city for the men's rugby World Cup in 2027.\nMORE NEWCASTLE SPORT\n\"It is always good having that home crowd advantage,\" Leaney said. \"Coming to regional areas is really important for us. We want to inspires future Wallaroos.\n\"You can't be what you can't see. The last time the Wallaroos had a Test here, it was a great crowd. It will be really good to have the same thing this weekend.\"\nThe clash against the Black Ferns is for the O'Reilly Cup and is part of the Four Series Cup.\nThey meet the US at GIO Stadium, Canberra, on May 17 and Canada at Suncorp Stadium on May 23.\nThe Wallaroos are yet to beat New Zealand. The last encounter was a 62-0 thrashing at Ballymore last July.\nHowever, Leaney believed the Wallaroos have improved significantly, highlighted by their victory in the WXV2 tournament, in the past 12 months.\n\"At our first camp in Canberra, we spoke about where we are now compared to 12 months ago,\" Leaney said. \"Not only are our PBs in the gym and fitness scores showing it, we are really connected as a group and our rugby IQ has gotten a lot better as well.\n\"That comes on the back of playing more Test matches. We saw Super W was a lot more competitive this year. That all plays a part.\n\"Saturday will be a good challenge but I feel we are really up for it.\n\"The Black Ferns are a very physical team. If we can beat them aroud the collision area and win our set piece, we have electric backs. We want to get them the ball early.\"\n'Test match of the year': Can the Wallaroos make history in Newcastle?\nWomen's rugby in Australia has come a long way since Layne Morgan watched from the stands six years ago as the Wallaroos beat Japan at No.2 Sportsground.\nOn Monday afternoon, the Lake Macquarie-raised Australian halfback was inspiring the next generation of rugby players during an open Wallaroos training session at the Newcastle West venue ahead of their showdown with the almighty New Zealand Black Ferns at McDonald Jones Stadium this Saturday (3pm).\n\"I was kind of on the border of XVs and sevens at that time and it was something that really sparked the XVs for me and made me want to get into that sport, seeing the opportunity that women had, and especially in Newcastle,\" Morgan said.\n\"It was really cool to see the Australian team playing here. It's good to see the game is growing and now we're not at No.2, we're just training there and we're playing at McDonald Jones Stadium.\"\nIt will be the first time the Wallaroos have played in Newcastle since 2019, and Morgan hopes the opening match of the Pacific Four Series, which also includes United States and Canada, will prove an historic occasion.\nThe Australian women's rugby team have never beaten New Zealand but host the world powerhouses after claiming the second-tier WXV2 title in South Africa last year for the first time.\n\"The growth has been massive,\" Morgan, who has featured in every Test since making her debut against Fiji in Brisbane on May 6, 2022 and now has 30 caps for her country, said.\n\"We've grown from being unprofessional to semi-professional, the Super W is growing and we're seeing a new generation coming through that are just next level.\n\"We've seen a lot of monumental occasions ... that WXV2 result, getting that silverware last year, it's showing that we are growing as a team.\n\"Any time you play New Zealand, it's such a big game for us. They've had such a good record in their footy, and I definitely think that we're getting primed to beat them and to put it to them.\"\nThe Wallaroos arrived in Newcastle on Sunday night after kickstarting a big 2025, which will culminate in the World Cup in England in August-September, by thrashing Fijiana 43-7 in Suva on Saturday.\nIt felt like a full-circle moment for Morgan, who clocked countless kilometres and hours driving between Newcastle and Sydney to pursue an elite rugby career.\nThe 26-year-old was part of the NSW Waratahs program between 2018 and 2024 before joining the Queensland Reds this year.\nMorgan, who played rugby for Merewether Carlton and has been part of the Hunter Wildfires program since 2023, is one of five current Wallaroos with Hunter connections.\nStar winger Maya Stewart is from Nelson Bay, back-rower Leilani Nathan did her schooling in Newcastle, while veteran Ash Marsters and lock Kaitlan Leaney have also played for the Wildfires.\n\"There's a lot of young girls who are coming through the Wildfires system at the moment, and there's so many talented athletes in the Hunter area, and I'm so lucky to be one of those girls who have come out of this area,\" Morgan said.\n\"The Wildfires are killing it at the moment. I was at the gym this morning in my Wildfires polo. I couldn't find my training tee, but I repped that polo in the gym session.\n\"I'm so excited to be a part of that club as well. They're doing great things for the area, providing such a good pathway for youth and for seniors, and it's awesome to have such a strong rugby culture in Newcastle.\"\nNathan is out of action after sustaining a severe knee injury playing for the Waratahs in April.\nStewart has already experienced two long-term knee injuries in her career but was cleared of another on Monday after limping from the field in Suva.\nThe 2024 Wallaroos player of the year was cleared of any major damage on Monday but has been ruled out of the Pacific Four Series.\nWildfires general manager Stuart Pinkerton expected the Newcastle showdown to be the \"Test match of the year\" for women's rugby in Australia.\n\"It's probably the No.1 game of the year, and to have that in town is just brilliant,\" Pinkerton said.\n\"The Black Ferns have been the benchmark in world rugby forever. It would be huge if the girls could knock them off.\n\"It's great to have that local connection. That's important and just to re-emphasise how many talented people there are in this area and the opportunity now for the Wildfires program to really develop our next crop of players.\"\nThe Wildfires expanded their women's program to two teams - first and second division - this year in a move to strengthen their position in the Sydney premier competition.\nBoth teams are unbeaten after four rounds and the first-division side defeated heavyweights Sydney University, winning 15-12 at Tomaree on Saturday, for the first time since entering the Sydney competition in 2020.\n\"Sydney University women's program has been the benchmark of women's club rugby forever and we've had a couple of close losses but we've never been able to finally get that win,\" Pinkerton said.\n\"So, for the girls on the weekend to finally crack it, it really puts that program now under a bit of a spotlight and shows we're doing the right things there.\"",
  "word_count": 1661,
  "scraped_at": "2026-02-14T13:32:24.340143"
}