{
  "article_id": "7cac9a97df62",
  "url": "https://www.bbc.co.uk/newsround/articles/c74eqz30j3yo",
  "title": "Naomi Girma : Chelsea sign defender for a world - record transfer deal",
  "date": "20250126T113000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Five facts about Chelsea's record-breaking Naomi Girma\n- Published\nChelsea Women have agreed a world-record deal to sign defender Naomi Girma, from US side San Diego Wave.\nThe fee is believed to be in the region of £900,000, making the 24-year-old the most expensive women's footballer in history.\nIt smashes the previous world record of more than £200,000 set last year by Bay FC for Zambia forward Racheal Kundananji.\nBut who is Naomi Girma? Here are five facts about her you may not know.\nMore sports news\nSport 2025: What are the big events to look out for?\n- Published5 January 2025\nAustralia beat England to retain women's Ashes\n- Published20 January 2025\nIncredible Olympic surfer picture wins top sports photography prize\n- Published10 January 2025\n1. She started playing football thanks to her dad\nNaomi's parents were both born in Ethiopia and moved to the United States from the African country.\nWhen Girma was young, her father decided to start a grassroots football club, called Maleda Soccer, in California.\n\"It was just for Ethiopian kids to get together, play soccer and hang out,\" she told BBC Sport.\n\"That was when I first started playing,\" she explained.\nGirma says that it feels special to have had support from her community throughout her career and that it's still a big part of who she is today.\n2. She's one of the best players in the world\nThe 24-year-old is widely regarded as one of the best women's footballers in the world.\nKnown for her leadership skills and her composure - or calm - on the ball, she has impressed for both club and country.\nSo much so that she has been described as \"the best defender I have ever seen\" by United States head coach, and former Chelsea boss, Emma Hayes.\nGirma says she loves being a defender and a team player.\n\"There's so much strategy that I love that goes into it and I think there is a technique.\n\"There's reading the play, but also you're just always doing things for the team,\" she explained.\n3. She made her US senior team debut in 2022\nGirma has represented the United States at various youth levels, from under-17s to under-20s.\nShe has also played a key role for her national team since making her senior debut three years ago.\nShe first came to international attention during the 2023 Women's World Cup in Australia and New Zealand.\nShe was one of her country's standout performers as the USA made it through to the last 16 of the competition.\n4. She's an Olympic champion\nGirma played every minute of football in the United States' run to Olympic gold in Paris last summer - helping her team keep four clean sheets across six matches.\nShe described the victory as \"such a special tournament\".\nIt wrapped up a remarkable treble in 2024 for Girma after the USA's success in the Concacaf Gold Cup and the She Believes Cup earlier in the year.\nGirma also made history last year, as the first defender in history to win the US women's player of the year award.\n5. She's smashed the British transfer fee record\nGirma's fee sees the 24-year-old become the first women's million dollar player.\nIt also almost trebles the previous British record.\nThat was set last year when Chelsea signed striker Mayra Ramirez, from Levante, for £384,000.\nGirma becomes Chelsea manager Sonia Bompastor's first January signing at the club.\nThe west London side currently sit top of the WSL table with a seven-point lead over Arsenal and have qualified for the knockout stages of the Women's Champions League.",
  "word_count": 603,
  "scraped_at": "2026-02-14T12:23:13.396143"
}