{
  "article_id": "7cbe5f77b9cf",
  "url": "https://wwd.com/fashion-news/designer-luxury/louis-vuitton-official-partner-real-madrid-jude-bellingham-1237914615/",
  "title": "Louis Vuitton Signs Multiyear Partnership With Real Madrid",
  "date": "20250613T070000Z",
  "domain": "wwd.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "PARIS — Jude Bellingham’s work wardrobe is about to sync with his off-duty looks.\nLouis Vuitton has unveiled an official multiyear partnership with the Real Madrid soccer and basketball teams, marking yet another high-profile sports deal for the world’s biggest luxury brand, which is active in disciplines ranging from sailing to Formula 1.\nThe French fashion house last year signed Bellingham, who plays midfield for Real Madrid, as a brand ambassador, and has dressed him for prestigious events such as the Ballon d’Or ceremony.\nNow he and his teammates, including Kylian Mbappé, Thibaut Courtois and Vinícius Júnior, will wear a wardrobe designed by Pharrell Williams, creative director of menswear at Vuitton, for major travel and events.\nYou May Also Like\n“It’s football royalty meets luxury royalty,” Pietro Beccari, chairman and chief executive officer of Louis Vuitton, told WWD.\n“Because ultimately, football is the number-one sport worldwide, and Real Madrid is a legendary team, on top of that. Louis Vuitton has just as much aura, being the global leader. I think it’s a perfect marriage and an authentic one,” he added.\nThe announcement, on the eve of the FIFA Club World Cup in the U.S., confirmed speculation swirling in sports circles since February that Vuitton was poised to succeed Zegna as the team’s official off-field outfitter. The club’s jerseys are designed by Adidas.\n“At Real Madrid, we relentlessly pursue excellence as the path to remain at the top. That same philosophy defines a brand as iconic in the luxury industry as Louis Vuitton,” Emilio Butragueño, Real Madrid’s director of institutional relations, said in a statement.\n“Both of us have managed to transcend time, and we share not only the responsibility of building a legacy, but also the purpose of inspiring the world — beyond our respective industries,” he added.\nBeccari, a former professional soccer player, noted that the brand has partnered with FIFA, the sport’s international governing body, since 2010 to create the trunk for the World Cup winner’s trophy. “Today, this partnership with a football club marks a new era and predicts a very positive future,” he said in an emailed interview.\nThe house has also created carriers for the Rugby World Cup, the NBA Championship trophy, the Formula 1 Grand Prix de Monaco prize and the sailing America’s Cup, among others, and reached a pinnacle of global visibility last year by crafting special trunks for the medals and torches for the 2024 Paris Olympic and Paralympic Games.\n“This partnership is a natural fit for Louis Vuitton and our continued focus on sports. As we like to say, ‘Victory travels in Louis Vuitton,’” Beccari said.\nBouncing Back From Defeat\nFresh off the signing of Trent Alexander-Arnold and Dean Huijsen, Real Madrid and its new coach Xabi Alonso have a lot riding on the Club World Cup, after a season that saw it beaten by historic rival Barcelona at home, and bow to Arsenal in the Champions League.\nReal Madrid leads a pack of favorites in the competition that also includes Paris Saint-Germain, Manchester City, Bayern Munich and Chelsea. Beccari lauded the resilience of the club and its supporters.\n“Sports people embody the ultimate journey: a pursuit of excellence. Overcoming failure is part of the process, just as there are challenging times in business. What matters is the team spirit, and the values represented by the club and its federation. Real Madrid remains a legendary club, the most decorated in the world of football,” he said.\n“And I think the mentality of Real Madrid is exceptional. They are able to celebrate for 24 hours and then move on to the next chapter or be sad for 24 hours because they didn’t win a trophy, then forget about it and focus on what’s next,” Beccari added, noting that he tries to apply the same spirit at Vuitton, which is navigating a global slowdown in luxury demand.\nThe label’s positioning as a “cultural” brand with broad reach across segments including sports, gaming, music and art, is all about diversifying revenue streams as consumers switch their focus from status-conferring luxury goods to once-in-a-lifetime experiences.\n“We see fashion, culture, entertainment and sports merging like never before, and as a house of culture, we want to be at the forefront, celebrating those who excel. Our house ambassadors inspire us as the competitions we are supporting do,” Beccari said.\nSoccer holds a special place for the Arnault family, which controls LVMH Moët Hennessy Louis Vuitton, the conglomerate that owns Vuitton alongside brands including Dior, Tiffany & Co., Moët & Chandon and Sephora. Its holding group Agache last year acquired a majority stake in Paris FC, which in May vaulted back into France’s first division after almost half a century in the second tier.\nBeccari would not be drawn on the possible implications for Vuitton’s link with soccer, but noted: “At Louis Vuitton, we have a genuine passion for sports and are always looking for new opportunities that resonate with the values of Louis Vuitton.”\nWhile the terms of its deal with Real Madrid were not disclosed, Vuitton noted it was the first time it was placing its tailoring expertise at the service of athletes beyond the pitch.\nThe formal wardrobe for the men’s and women’s football teams, as well as the men’s basketball team, includes ready-to-wear, shoes and accessories that will be worn during official representations.\nSoccer Players as “Cultural Icons”\nA label made of natural cowhide leather, embossed with the Louis Vuitton signature, is sewn onto jacket lapels and the back pockets of trousers. Accessories include a leather belt with a palladium LV buckle, a navy cotton embroidered cap and LV Soft sneakers.\nPlayers will also have a choice of luggage pieces including the Horizon 55 carry-on suitcase, the classic Keepall weekender bag, and the Christopher backpack, as well as travel accessories such as a toiletry bag and passport holder.\nThe items come in the brand’s signature Monogram canvas decorated with stripes and the initials “RM.” Each one also features an exclusive leather charm adorned with the club’s colors.\nWhile items from the collection won’t be available for purchase, clients can buy pieces like the Keepall and Horizon in store and personalize them via the Mon Monogram service, potentially adding the club’s colors or initials. “It is a good way to experience a touch of that collaboration,” Beccari said.\nAhead of the 2018 World Cup in Russia, Vuitton had launched a licensed collection of upscale leather goods in the flag colors of the participating nations. And in 2020, it dropped its first menswear capsule collection designed by Virgil Abloh as part of a three-year partnership with the National Basketball Association.\nThese days, soccer fans are as likely to take their cues from individual players as their favorite club. In France, stars like Jules Koundé have turned their arrival at the training ground for the national team into style statements, akin to NBA tunnel arrivals.\n“We see Louis Vuitton as a universal brand, not just a fashion house. So, these athletes aren’t just playing a game; they’re shaping culture and influencing tastes on a global scale,” Beccari noted.\n“These players are today’s cultural icons, and their style choices resonate with the ones of the Louis Vuitton community. And during the shoot and the fittings in Madrid, all the players wanted to participate and take part in the shoot as they deeply wanted to be associated with Louis Vuitton,” he added.\nIf in Formula 1 the brand has a strong trackside presence as title sponsor of key races, including the Australian Grand Prix, don’t expected to see its logo writ large inside the renovated Santiago Bernabéu stadium in Madrid.\n“Instead, we’ll be there to support the players, team representatives and members during international trips, official events, ceremonies and occasions when they will be representing the club. We’re focused on being a part of their journey and their representation of Real Madrid on a global scale,” Beccari said.",
  "word_count": 1319,
  "scraped_at": "2026-02-14T12:35:10.061150"
}