{
  "article_id": "7cd4422a3be4",
  "url": "https://www.nytimes.com/athletic/6118614/2025/02/06/rubiales-trial-luque-hermoso-messages/",
  "title": "Luis Rubiales trial : Luque accused Hermoso of  jumping on the bandwagon to kill Rubiale , messages show",
  "date": "20250206T220000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Albert Luque accused the Spain player Jenni Hermoso of “jumping on the bandwagon to kill (Luis) Rubiales” in text messages shown to the court on the fourth day of Rubiales’ trial for alleged sexual assault and coercion.\nRubiales, the former president of the Spanish Football Federation (RFEF), kissed Hermoso as she and her team-mates were receiving their winners’ medals after the Women’s World Cup final against England in Sydney on August 20, 2023. He maintains that the kiss was consensual.\nAdvertisement\nThe prosecution alleges that Rubiales, 47, and three other RFEF employees — the former Spain women’s coach Jorge Vilda, the former Newcastle United forward and ex-RFEF sporting director Luque and former marketing director Ruben Rivera — coerced Hermoso into publicly supporting Rubiales’ version that the kiss had been consensual. Rubiales, Luque, Rivera and Vilda deny any wrongdoing.\nIn the days after the final, Luque travelled to Ibiza — where the players were on a holiday paid for by the RFEF to celebrate the World Cup win — to try to speak to Hermoso about what had happened in Sydney. Hermoso refused to talk to him, so Luque spoke with her close friend Ana Belen Ecube, who was with the player in Ibiza. They communicated via WhatsApp messages and in person. Their messages were presented in court by the prosecutor Marta Durantez.\nIn one of those messages to Ecube, sent on August 24, four days after the kiss, Luque wrote: “She (Hermoso) will find herself all alone, all alone, and me, as someone who isn’t made happy by anybody’s ills, this time I’ll be happy for the first time in my life.”\nOn two occasions at the Audiencia Nacional, Spain’s national high court in San Fernando de Henares near Madrid, Luque’s lawyer, Jorge Navarro Massip, described the text messages as “unfortunate”. He pointed to the start of the text message exchange between Luque and Ecube, where there was a “cordial relation” and the conversation was initially “absolutely cordial”.\nIn a face-to-face conversation between Ecube and Luque in Ibiza, she alleges that he said she and Hermoso would be assured of future work if they co-operated with the RFEF.\n“I told him they (senior figures at the RFEF) were all nervous because if Rubiales went down, they would all be out on the street,” Ecube told the prosecutor. “But he told me that he was calm and that if we behaved well, Jenni and I wouldn’t be short of work. I said no, it was like selling my soul to the devil.”\nGO DEEPER\nThe Luis Rubiales trial explained: The kiss, the fallout, the accused and the key witnesses\nEcube was one of five witnesses speaking on day four of the trial, along with three of Hermoso’s Spain team-mates (Alexia Putellas, Irene Paredes and Laia Codina), and Francisco Javier Pujol, the former head of regulations and compliance for the RFEF.\nAdvertisement\n“I thought it (the kiss) was something by chance (that it might have been accidental while trying to kiss on each cheek). Irene Paredes said not to make jokes, that it was serious,” said Putellas, the Barcelona Femeni captain, in response to questions from the prosecutor Durantez.\nPutellas, Paredes, Codina and Ecube spoke about the fallout from the kiss and the impact it had on Hermoso. “She was exhausted, emotionally and physically… it was also psychological exhaustion,” Ecube told Durantez.\nPutellas said: “I remember on the plane (back to Madrid) that she (Hermoso) was very overwhelmed, that they didn’t let her, that they didn’t stop.\n“She started crying from exhaustion. No longer angry, but exhausted.”\nParedes, the Spain and Barcelona centre-back, told the court: “Jenni just wanted to be left alone and celebrate the World Cup that had cost us so much. The other thing I remember is that my brother told me that the coach Jorge Vilda had been to see Jenni’s brother (Rafael) several times.”\nThe court heard about the trip to Ibiza soon after the final, which is where Rivera and Luque are alleged to have coerced Hermoso.\nSpeaking to the prosecutor Durantez, Putellas recalled Hermoso’s fragile state on a bus journey to a street parade in Ibiza that was organised to celebrate them being crowned world champions.\n“I remember perfectly that I get on, I sit down next to her and she starts crying. ‘This isn’t finishing here, I can’t take it anymore, I can’t take it anymore’.”\nCodina, who plays as centre-back for Arsenal and Spain, was present in court, while Putellas and Paredes gave their evidence over video link. Codina said it was in Ibiza that Hermoso was at her lowest point.\n“On the trip is when she was at her worst,” said Codina in response to questions from Durantez, “because she had already seen everything that happened, she had assimilated it and she was sad. She wasn’t enjoying it. It was supposed to be theoretically the best moment of her life, but she was sad.”\nAdvertisement\nShe highlighted two moments in the trip in her testimony. “One is when we arrived, Jenni had no battery and Ruben (Rivera, the marketing director) asked her to charge it, that someone, I don’t know who, wanted to talk to her.\n“Ruben insists and ends up taking it (the mobile). Yes, he insists more than two or three times. Less than half an hour. Then we go to watch the sunset, we are in a quiet hammock and Ruben Rivera comes five or six times, at least, asking Jennifer to go and talk to Luque.\n“He keeps insisting until Jenni gets overwhelmed and starts crying again. At that point, Ana Ecube talks to them and acts as an intermediary.”\nEcube said to the prosecution: “She (Hermoso) didn’t know how to say no (to Rivera) more times. At that moment, in a short space of time, (she said no) maybe three or four times.”\nWhen asked about this incident by Rivera’s lawyer, Joaquin Jimenez Rubio, Codina says Rivera’s tone was “insistent”.\nRubio asked Ecube to clarify the occasions in which Rivera had been insistent and whether she sensed “violence or threats” when he spoke to her for a second time, to which she said, “No.”\nThe same lawyer asked Ecube: “Was he (Rivera) polite, correct?” and she said “Yes.”\nEcube said that Rivera never communicated to her the idea that Hermoso had to participate in a statement supporting Rubiales.\nEcube said in hindsight that she regrets offering to help Rivera in case Hermoso needed someone to talk to in Ibiza. “When I saw that his intentions were to make me uncomfortable, I changed my attitude towards him and protected Jenni,” she said in response to Durantez’s questions.\n“Jenni told me: ‘Don’t talk to them, please’. I saw her crestfallen, she hardly spoke. As Ruben had insisted a lot, I said that I would go down to talk to him (Luque) and save time.\nAdvertisement\n“I saw that they wouldn’t stop and they weren’t going to stop. I told (Ruben) that Jenni wasn’t going to come down, I could see that the situation was going to be very hostile.\n“He (Luque) had no intention of helping my friend but to harm her.”\nEcube also spoke of the isolation that Hermoso felt after what happened, and the perceived lack of support from the RFEF.\n“She was worried because she saw that, of the whole environment that was supposed to protect her (the RFEF), nobody was helping her,” Ecube said in response to questions from the lawyer for the Spanish players union AFE, Maria Jose Lopez. “She was alone. There wasn’t even a single person from the RFEF who worried about Jenni. Not even the psychologist, the safeguard. It was clear, there was nobody who was defending her.”\nThe trial continues.\n- Day one report: Hermoso tells court she received death threats after Rubiales kiss following World Cup final\n- Day two report: Spain coach Luis de la Fuente testifies at Luis Rubiales trial\n- Day three report: Jorge Vilda spoke of ‘consequences’ for Jenni Hermoso, claims her brother\n(Top image: Rivera, Luque and Rubiales; photo by: Chema Moya/AFP via Getty Images)",
  "word_count": 1351,
  "scraped_at": "2026-02-14T12:53:16.118680"
}