{
  "article_id": "7ce8b75d8152",
  "url": "https://pina.com.fj/2025/12/18/mead-puts-hand-up-to-coach-png-orchids-following-coaching-exit/",
  "title": "Mead puts hand up to coach PNG Orchids following coaching exit",
  "date": "20251218T013000Z",
  "domain": "pina.com.fj",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former PNG Kumuls skipper David Mead has publicly expressed his interest in coaching the PNG Orchids following the Papua New Guinea Rugby Football League’s decision to cut ties with former head coach Tahnee Norris.\nMead made the call through a social media post addressed directly to the PNGRFL, writing: “PNGRFL you have my number. I put my hand up to coach the Orchids. Ps I know some great assistant coaches who are willing to help. One of their initials are J.O…”\nThe Facebook post comes at a pivotal time for the national women’s program, with the Orchids now in search of new leadership as they prepare for upcoming Rugby League World Cup and continued development of the women’s game in Papua New Guinea.\nThe former Kumuls fullback brings a wealth of experience from a distinguished playing career in the NRL and Super League, along with a strong reputation for professionalism and leadership. His willingness to step forward has been widely welcomed by fans, many of whom believe former internationals should play a greater role in shaping the future of PNG rugby league.\nThe Kumul no.227 has also hinted that former PNG international and NRL centre Justin Olam could be among the assistant coaches he would look to involve, a suggestion that has generated strong interest and discussion among supporters. Olam’s experience at the elite level and his standing within the rugby league community are seen as assets that could add significant value to the Orchids’ coaching setup.\nThe PNGRFL has yet to issue a formal response to Mead’s expression of interest. However, his public statement has intensified discussion around the direction of the Orchids program and the importance of appointing experienced leadership following Norris’s departure.\nAs attention now turns to the PNGRFL’s next move, Mead’s post has ensured he remains firmly in the conversation for the Orchids’ coaching role.\nMeanwhile, the PNG Orchids will head into the countdown to the 2026 Rugby League World Cup under new leadership after the Papua New Guinea Rugby Football League [PNGRFL] confirmed it has mutually parted ways with head coach Tahnee Norris, following a drop in the team’s world ranking.\nAfter being ranked fifth in the previous World Cup, the national women’s side slipped to sixth during Norris’s two-year tenure, prompting PNGRFL to move decisively as preparations intensify for the home-and-away World Cup to be hosted by Papua New Guinea, Australia and New Zealand next year.\nPNGRFL chairman Sandis Tsaka thanked Norris for her contribution to the women’s game, particularly her focus on development, while acknowledging the need to sharpen performance ahead of the global showpiece.\n“Tahnee has played a pivotal role not only in leading the Orchids but also in developing women’s rugby league across the country,” Tsaka said. “We thank her for her dedication and the legacy she leaves within PNG Rugby League.”\nDespite competing in the Pacific Championships and introducing more than 10 players to Test rugby league, the Orchids struggled for consistency against top-tier nations, reflected in the heavy back-to-back losses, which led to drop in ranking.\nNorris said she remained proud of the progress made by the squad, especially the emergence of young players at international level.\n“Watching our young players step onto the international stage and prove they belong has been one of the most rewarding parts of my role,” she said.\nWith the 2026 Rugby League World Cup scheduled for October and November next year, PNGRFL says it will immediately begin the search for a new head coach, tasked with reversing the rankings decline and lifting standards ahead of the tournament.\nThe coaching change is crucial for the Orchids as they seek to convert development gains into results, under the spotlight of a World Cup to be played partly on home soil.\nFurther updates on the recruitment process and team preparations are expected in due course.",
  "word_count": 639,
  "scraped_at": "2026-02-14T12:37:42.543001"
}