{
  "article_id": "7cf1e3060719",
  "url": "https://www.independent.ie/regionals/cork/localnotes/around-the-districts-freemount-kilbrin-kilcorney-dromtariffe-and-killavullen/a138961646.html",
  "title": "Around the Districts : Freemount , Kilbrin , Kilcorney - Dromtariffe and Killavullen",
  "date": "20250606T010000Z",
  "domain": "independent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Around the Districts: Freemount, Kilbrin, Kilcorney-Dromtariffe and Killavullen\nFREEMOUNT\nWeekly 45 Drive\nThe weekly 45 Drive was well attended on Sunday night last. The following is a list of the lucky winners.\nTop prize went to Mike Ryan and Richard O’Donoghue, Newcastle West. The winning Ladies team was Eileen Scott and Delia Conroy, Churchtown. Gents prize was won by John Mulcahy and Frank O’Brien, Kilbrin. The winning mixed team was Kathleen Guiney, Boherbue and Paddy Hartnett, Newmarket. The table prize was won by Nora Mai Deane, Glash and Con Foley, Freemount.\nThe following won Raffle Prizes: 1 Frank O’Brien, Kilbrin; 2 Pat Gilbourne, Kilmeedy; 3 Kathleen Twomey, Meelin; 4 Richard O’Donoghue, Newcastle West; 5 Paddy O’Leary, Glash; 6 John O’Riordan, Kanturk; 7 Jack O’Keeffe, Glash; 8 Michael O’Callaghan, Freemount.\nThe 45 Drive continues every Sunday night at 8pm sharp. See you all then.\nSocial Dancing\nAfternoon dancing continues every Sunday in Freemount Community Centre from 3pm to 5.30pm. All top bands are booked for the year ahead, so set your satnav (P56 P893) and head for Freemount and enjoy a great afternoon’s dancing this Sunday June 8th, with music supplied by Declan Aungier. Coming on Sunday June 15th is Muriel O’Connor and Fran Curry.\nFreemount Community Alert\nFreemount’s Be Alert Text system is set up to help prevent suspicious or criminal activity in our community. The annual membership fee of €10 is now due. Renewal forms are available in Freemount shop or from Josephine (087 2255757). Alternatively you may renew online at www.muintir.ie and pay using debit/credit card or by PayPal. If renewing online, the Organisation name is Freemount Community Alert, Code FRE0001. We ask you to please join up to help us keep our community safe.\nComhaltas\nWe wish best of luck and God’s Blessing to all our members who are preparing for their exams this week.\nTidy Towns Committee\nA meeting of the Tidy Towns Team was held recently and a full plan of action has been drawn up. We will meet weekly on Wednesday evenings at 7pm at the Garden of Remembrance. All volunteers are welcome and would be greatly appreciated.\nParish Website\nThe parish website is up on the computer and you can get into this page by clicking freemountvillage.com and spend some time reminiscing.\nSt Michael’s Church\nWeekend Mass in Freemount will be at 6pm every Saturday evening. You can now tune into all Masses in St Michael’s Church by tuning into Freemount Church on your phone, computer or tablet, as new equipment has been installed. This is great news for all those unable to attend Mass in Church.\nMass on TV - Did you know that R.T.E. broadcast Holy Mass every morning on the News Channel (21) at 10.30 am, Monday to Friday.\nPhoto exhibition\nDue to popular demand the photo exhibition ‘Captured Memories, Kanturk in the 50’s and 60’s through the Lens of Danny O’Sullivan’ will remain in Kanturk library until June 14th. Don’t miss it!\nG.A.A. club news\nLotto - Results for weekend June 1st. Numbers drawn were 6-12-13-18. There was no Jackpot winner. Lucky Dip winners were: 1. Mairead O’Connor, Charleville. 2. Rebecca Duggan, Freemount. 3. Allan Buckley, Ballinla, Freemount. 4. Larry Browne, Ferryfort, Dromina. 5. Cillian O’Sullivan, Knawhill, Freemount. Jackpot this weekend is €2,050. If you are not in you can’t win!\nNotes\nItems for these notes should be with the correspondent each Monday night before 8pm. Email osullivanpj38@gmail.com\nKILBRIN\nKilbrin GAA Notes\nDuhallow Hurling League Semi Final: Our hurlers qualified for the Twohigs Supervalu Duhallow Hurling League Final last Monday night when they had a good victory over Banteer in stormy weather conditions. Full time score was 2-16 to 3-08. They play Dromtarriffe in the final. Time & date TBC.\nKeep an eye out on Club Zap, our social media pages and club texts for updates.\nBlue & White Support: We’re calling on everyone to show their support for our hurlers as they gear up for another league final in the coming weeks. If you have blue and white flags, we’d love for you to hang them proudly for all to see. Let’s turn the community blue and white and get behind the team together!\nClub Zap: Kilbrin GAA have partnered with ClubZap, a leading club management platform that helps streamline communication, payments, and updates all in one place. With ClubZap, our members can stay up to date with fixtures, results, news, and events while also making membership payments and booking fundraising events seamlessly. This partnership will enhance how we connect with players, coaches, and supporters, making club life easier and more efficient for everyone. Download the ClubZap app from the App Store on iPhone or the Google Play Store on Android, create an account and search for Kilbrin GAA and follow us.\nWedding Congratulations: Congratulations to club player Niall Field and Clodagh O’ Sullivan who married last weekend. Kilbrin GAA wish you all the best for the future.\nClub Lotto: There was no winner of our recent jackpot. The numbers drawn were: 5, 10, 26, 35. Our lucky dip winners were: Bridie Walsh, Sarah Kiely, Donal O’ Connell, Elizabeth Ahern & Helen Byrne. Our next lotto jackpot is €6,300 and takes place on June 11th. You can play our lotto on our club website here: https://kilbringaa.ie/categories/lotto/products\nExams\nThe state exams junior cert and leaving cert starting this Wednesday\nWishing all the students the best of luck with their exams.\nGolf\nCongratulations to Vinny Hayes, Shane O’Riordan and Mick Dennehy on winning the Kanturk Golf Club Development classic held the June bank weekend Prize presented by Padraic O’Connell Kanturk golf club men’s captain.\nFathers Day Walk\nOn Saturday 14th June there will be a Father’s Day walk/run in aid of Kilbrin Primary School. BBQ and music on the day.\nBasketball news\nCongratulations to Anina-May Cremin from Kilbrin representing Kanturk Basketball Club who was nominated for MVP (Most Valuable Player) in the U15 Cork League.\nAthletics News–Cork City Sports.\nCongratulations and well done to Reid Casey who came 1st in his heat and reached the county final for a third year in a row. He was also the anchor leg for the under 11 boys relay team to win a silver place. Cork GAA hosted the primary schools North Cork Region football skills competitions on 15th May in Mallow.\nBadminton news\nAnna Lucey O’Sullivan was part of the Cork County C Badminton team that won the All Ireland Inter Counties final May 18th in Galway. They played Dublin in the final. Well done Anna!\nBingo\nBingo is held every Monday night in the Kilbrin Social Club at 8.30 sharp. Tea, coffee, sweets and treats and bar refreshments available. A Lovely and comfortable environment to be in for these Spring evenings. Jackpot is €1,700 in 52 calls. Thank you to all that support week in and week out. It is much appreciated.\nPickleball\nPickleball continues every Thursday from 8pm in the Social Club Hall. We always welcome current and new members to this fun and exciting new sport!\nSquash\nDid you know Kilbrin sports and social is host to one of North Cork’s last remaining active squash courts. Founded in 1980, this club had upwards of 50 members back in 2009 with huge juvenile interest leading to them competitive games & success.\nFor further information contact: Brendan Barrett at 0872789501 or kilbrinsquashclub@gmail.com or the community page here.\nKilbrin Village Hub\nIs your son or daughter looking for a quiet place to study for their upcoming Leaving Cert, consider using the hub! Book your day for study or remote office working at Connectedhubs.ie.\nWe have 2 remote work stations with 500mb fibre broadband, tea/coffee facilities, fridge, free parking. Student rates available. Contact Bas on (087) 1805511 for further details or kilbrincc@gmail.com\nKILCORNEY-DROMTARIFFE\nBowling notes\nDenis Horgan Bowling Club Jackie Daly / Liam Casey Competition: Sam Aherne 7 points, Donal Cashman 4 points, Maurice Cashman 7 points, Jonathan O Callaghan 1 point, Dean Sexton 4 points, Geraldine Casey 5 points, John Breen 2 points, Ned Kelleher 5 points, Eugene O Sullivan 5 points, Keven Flynn 1 point,\nTuesday Social Club -Terelton Series–Chris Larkin/Denis Crowley beat Jerry O Donovan/Connie Lehane twice. For the last shot on both occasions.\nJohn Cummins Competition–Ned Kelleher 1 point, Maurice Cashman 2 points, Eugene O Sullivan 1 point, Geraldine Casey 2 points.\nRoad bowling results\nRoad bowling results February 22nd and 23rd\n@ BALLINACURRA Deckie O’Mahony bt Mark Coleman €400 as. Conor\nDesmond bt Tom O’Donovan 2bls €770 as. Colm O’Regan bt John Hickey 1bl\n€1,100 as. Martin Cronin bt Jeremiah Keohane 2bls €500 as. Paudie Keohane bt\nDenis Mangan ls €300 as. Mark Cahalane bt Gary O’Sullivan ls €550 as.\n@ BALLINAGREE Paul O’Sullivan bt Ted Sexton Nov-D 2bls €200 as.\n@ BEAL NA BLATH Gene O’Callaghan/Chris Larkin bt Connie Lehane/Jerry\nO’Donovan. Jerry O’Donovan/Connie Lehane bt Chris Larkin/Gene\nO’Callaghan. Eoin O’Callaghan bt Tim Allen 1bl Nov-D €500 as. Kieran Kelly\nbt Kevin Browne 1bl Nov-D €200 as.\n@ CASTLETOWN Thomas Maloney bt Ian O’Sullivan ls €300 as. Donnacha\nO’Donovan bt Danny O’Donovan 2bls €350 as. Chris Hayes bt Raymond\nO’Neill 1bl Nov-D €250 as. Sean Galvin bt Paul Welsh 1bl Nov-D €1,050 as.\n@ CLONDROHID Ailbhie O’Shea bt Juliette Murphy €300 as. Emily Murphy\nbt Katie Moynahan Nov-Ladies Final 1bl.\n@ DONERAILE Dillon McDonnell bt Alex Deady Nov-C 2bls.\n@ DUNDERROW Paul Kelleher bt Cormac Desmond Nov-D ns.\n@ DURRUS Finaian Hurley bt Ian Crowley ls ns Nov-D\n@ FIRMOUNT Stepehn Spillane bt Ethan De Burca SF€510 as. Mark Bourke\n(Jnr) bt Matthew Bradley ls €460 as.\n@ GLENABO Pat O’Donovan bt Benny Hoare Nov-Vet 1bl ns. Alan Corcoran\nw/o Billy O’rourke Nov-C.\n@ GRANGE Jack O’Callaghan bt Conor Lucey ls €3,000 as. Denis O’Sullivan\nbt Michael Bohane (Willie Whelton Cup) 1bl €4,150 as.\n@ JAGOES Kieran McCarthy bt Finbarr Lucey €270 as.\n@ KILNAMARTYRA Flor Crowley bt Martin Cotter Nov-C ls €100 as.\n@ NEWCESTOWN James O’Sullivan bt Dean Ellis Nov-D 2bls €200 as.\n@ TEMPLEMICHAEL Jim Coffey bt Anthony Gould ls €800 as. Andrew\nO’Leary bt Jim Coffey ls €1,000 as.\n@ TOGHER X Jack McCarthy bt Oisin Murphy Hurley Nov-D ns. Conor\nMccarthy bt Andy Sullivan €360 as. Timmy Gibbons bt James Hurley U-16.\nKILLAVULLEN\nLeaving Cert and Junior Cert exams\nAs the Leaving Cert and Junior Cert exams begin on June 4th, we want to extend our warmest wishes to all the young people in our parish. This can be a stressful and demanding time, but remember=97you’ve already demonstrated great resilience, hard work, and determination to reach this point.\nDo your best, take each day as it comes, and know this: your worth is not defined by exam results. These tests cannot measure your kindness, your compassion, your sense of community, or the light you bring to those around you.\nTo our Leaving Cert students: As you face these final school exams and begin to look toward the future, know that your community stands behind you with pride and support. You are stepping into a new chapter=97filled with opportunities, growth, and new beginnings.\nSecondary Students on their holidays\nWe wish all second level students a safe and happy summer holiday from school. When you are out and about on the roads please be safe, and be seen. Wear your high-vis jackets and helmets when cycling. We wish the secondary school staff among us a restful and healthy summer break too.\nBus drivers - thank you!\nWe are fortunate to have a wonderful and efficient bus service bringing our second level students to and from school on a daily basis. We wish you a lovely summer break too and thank you for all your kindness to our young people on their daily commute.\nAnnual Parish Sports will take place on Sunday June 15th in Killavullen GAA pitch. This event is open to all children living in the Parish and to those who attend Killavullen NS, Ballygown NS and Rahan NS.\nCongratulations to the children who took part in Cork City Sports last Thursday, May 29th with participants from Killavullen NS and Ballygown NS running representing their schools. There were many trophies brought home to the parish but it’s not just about winning – having the honour of representing your school on such a big stage is a wonderful achievement in itself.\nChiropody Dates\nAppointments with our friendly and dedicated chiropodist Patricia are now available for June 14th and July 5th. Please contact her at 086 3225052 to arrange an appointment.\nLotto\nKillavullen Community Council Lotto takes place twice a week. The bonus ball of the National Lottery draw is the winning number each Wednesday and Saturday evening.\nLast week’s winners were Isabella Glassett and James Walsh both having the lucky bonus numbers. Congratulations and thank you to one and all for your support.\nGAA club news\nColm Looney proves to be a handful against Nemo Rangers - Last Friday night in the superb facilities, that are the home grounds of Nemo Rangers, in Trabeg, Killavullen secured two more points in the Red FM county Division 7 Hurling league.\nWhen you say superb facilities, this is another level, impressive and thriving club house, with a bar and outside seating area, three pitches with games on them simultaneously and the place heaving with people. Good to see some Killavullen names on the centenary wall in the facility as well, after some members of the Dorgan family, from Monanimy threw their lot it with this club, when they relocated to the city.\nKillavullen started very cold in the game and Nemo Rangers had the opening point in the game and then the first of early goals on the board before we had got to grips with their hard pressing athletic game. That goal, scored by Ronan Dalton from that club should not happen, a player picked up the ball, on the forty, and everyone backed off and looked after their own man, allowing Ronan to advance and give Colm, deputising on our goal for the injured Charlie, in our goals no chance. Jamie got a point back for us, but then calamity again when a long delivery into their full forward line, caught us ball watching, and in a twinkle, it was nestling in our net. 2-01 to 0-01 after four minutes was not the start that we wanted.\nWe got another point back from a free after Darragh was fouled, and then a lifeline and a way back into the game, when Colm Looney caught a high ball, in and around their square and held off his man, and finished to the net. Nemo added a point, but Owen Magner got one back for us and gradually, we had come up to the pace of the game, on the rock hard and low cut pitch. Nemo added another point from a free, in the 13th minute but Jamie got that score back, from a dead ball situation again, against the wind. We lost Fionn Magner to an injury but where able to call on Charlie Lillis as a replacement for his first game in over 10 months after an injury sustained in our second championship game of 2024. Nemo added another free, but then we were awarded a penalty.\nColm Looney had fetched a high centre and in turning and going towards goal, he was fouled and Jamie dispatched the shot emphatically to the net. A drawn game on the 29th minute, 2-04 apiece after the slow start was an impressive come back and we took the lead with a Jamie free only for Nemo to equalise on the stroke of half time with a fine score from Shane Horgan, their impressive full forward.\nAfter some sustenance at half time, by the viewing public and an intake of more modest fluids by the players, the second half restarted in a way similar to the first, when Ronan Dalton turned our corner back and finished with aplomb to the net. The same player fired a ball over his shoulder in the next play to push the Nemo lead out to 4 points. Colm Hannon was introduced for Cian Lane, at the interval. Now playing with the aid of the wind, Killavullen came much more into the game in and around midfield and the middle triangle between the two forties, and Jamie rattled off five frees in quick fire concession interspersed with a free back for Nemo to leave the teams on equal terms 2-10 to 3-07 by the midpoint of the second half.\nColm Looney scored another goal for us then, after fetching a clever ball in from Patrick O Grady to push us ahead again, and that was the Cathylst for an impressive run of scores when Nemo could scarcely get out of their half, and beyond our forty. Nemo were missing a decent cohort of players though, away enjoying a club wedding in Spain and players of the ilk of Barry Cripps and Jerry Kerins, especially Barry Cripps are a huge loss to any team.\nOwen Magner stretched out our lead with another fine point, from a player having a stellar break out year, from minor and our lead was extended by two further points from his brother Jamie and then Darragh O Grady. Mikey O Connor added lustre to the scoreline with a fine goal in the 23rd minute. Nemo got a point back and Jamie got a point from a 65 metre shot after the alert goal keeper from Nemo had turned away a shot that would otherwise have nestled in the top corner of the Nemo net. Padraig Cronin was introduced for Seamus O Mahony, who had given his all. Nemo scored another point, but then Colm Looney used his bulk to turn his man, and apply a deft flick to a ball that he had allowed to run through, and the result was another goal for us.\nMikey O Connor, did not want his fellow fabricator to gleam all of the headlines, and scored two fine point scores in quick succession to bring our tally to 5-16 but lesson in life Mikey, Colm repaired the club house gates during the week, and was always going to get a favourable mention as a result, even though the three goals he scored, and the penalty won, meant he was always going to auspiciously called out in the report anyway.\nNemo got a goal back, that their over all spirited play deserved and then a point, but we got the final score of the game, when Colm Hannon showed a nice sidestep and fired a ball over the bar to bring our final tally to 5-17 as against 4-10 for Nemo.\nBallygown North Cork Hurling Champions - We are so proud of the Ballygown school team who won the North Cork Sciath na Scol B3 Hurling Final last week. Ballygown had a tremendous game against a very sporting and skilful Analeentha team and it took a mighty team effort to come out on top.\nThe win caps a great year on the playing field as Ballygown added to previous victories in the football final, the Mini Sevens Competition and the Fr. Burns Shield. In congratulating the players Ballygown school also want to thank and commend the wonderful support they had in Mallow and back at school from pupils, parents, families and staff.\nA big thank you to the North Cork Schools Board committee and the volunteers who made the finals’ day special for the participating schools.\nLotto - The treasurer of Killavullen GAA was only delighted last week, when there was no winner winners of the GAA lotto on Tuesday night, 27th May in the draw which took place in the Community Centre. The numbers drawn were 8, 23 and 29. The jackpot on the night was, at €1,000. The winners of the lucky dips were as follows. €50–Eva Gorea – Mary Mellerick; €30 – David Brosnan (seller – Michael Linehan); €20 – Paul Stafford (seller – Michael Linehan). Purchase your ticket from any committee member or from our website- Killavullengaa.com. Thank you for your anticipated and ongoing support.\nRebel Óg North Selections - Well done to Conor Vaughan and Fionnán Murphy who were in action on Saturday last in Ballyhooly for Rebel Og North U14 hurling teams against Tipperary North and South teams. Both players had great games. Keep up the good work boys and thanks to all who turned up to support the Killavullen boys!\nKillavullen player in Primary School Game - Congratulations to Dan Hanrahan who has been selected next Saturday to play in a packed TUS Stadium in Limerick, at the half time interlude between Cork and Limerick, in the Munster Hurling Final. Well known in Killavullen as the water boy / hurley carrier and a host of other tasks in and around the adult junior hurling team, if John Kiely or Pat Ryan want any advice on the teams’ selections, Dan could voice a knowledgeable opinion.\nHeading up by bus next Saturday and getting dinner and a medal presentation down in Na Piarsaigh’s in Limerick and walking up to the stadium and then welcoming Cork into the pitch and playing at halftime, not a bad day out for Dan. Congratulations to Dan.\nGolf Classic\nGood interest in been expressed in our annual Golf Classic, which is creeping up steadily upon us. Killavullen GAA Golf Classic for 2025 will be on in Doneraile Golf Club, on 13th and 14th June.\nAt this juncture, the club would be confident that all of the available team slots will sell out, but Golf Classics are successful or not depending, on the amount of other revenue streams, that they can bring in, from Tee and Green sponsorship.\nThere is also competitions, for the longest drive for men and women, and nearest the pin on the 8th hole, plus a raffle on the days; it will make for a very enjoyable occasion.\nPlease contact any club official, if you would like to partake, or indeed, assist the club in sponsoring of a green or Tee box.\nThere are a number of ways to support this event:\nEnter a team of 3 People for €120; the format is Champagne Scramble and there are times available from 11am to 5pm. We also have a limited number of tee slots, on Friday afternoon. There are a number of excellent prizes for the winners and a meal is included\nSponsor a Tee Box for €100; Have your company name displayed on a tee box\nSponsor a Landing Green for €50; Have your company name displayed in and around the landing green area\nIf you would like to play or advertise we would be delighted to have you involved. You can revert to John O Donovan on 086-3934232 or simply reserve a slot for your team to Communications.killavullen.cork@gaa.ie",
  "word_count": 3797,
  "scraped_at": "2026-02-14T12:49:57.887667"
}