{
  "article_id": "7d2e6c244f5f",
  "url": "https://www.justarsenal.com/codina-ready-to-go-again-against-chelsea-women-after-poor-bayern-performance/378004",
  "title": "Codina ready to  go again  against Chelsea Women after poor Bayern performance",
  "date": "20241012T110000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Arsenal versus Chelsea Women Super League clash on Saturday afternoon is one game that could shape the WSL title race. Chelsea has made a strong start in the league, securing a perfect start.\nOur Gunners have found themselves in a tricky position; they have only won once, drawing twice. Though on paper those results are not that bad, the performances also haven’t been impressive; in fact, it is the performances that have Gooners worried about this team.\nExpectations are high for the Gunner women to defeat the Blues, but will they succeed? Well, if they channel the Laia Codina mentality going into that game, then they may be well motivated to put up a spirited perfomance versus Chelsea and grab the London bragging rights.\nAfter the defeat against Bayern Munich, Codina made a defiant promise to the Gooners: they’ll demonstrate what they, the Arsenal women, are capable of against Chelsea. She said: “Sticking together is what we want, of course. We came from another tough game on Sunday against Everton. Today, I think we were a better team but it went wrong. It is what it is. Football is like this. Accept that. Fresh possibilities.\n“As a defender, I don’t want to go back home with five goals against me but Saturday, we are going to go again. It’s in our hands and we need to be a better team if we want to go further in the Champions League and battle for the league.\nCertainly Codina is showing she’s owning up to their mistakes, saying, ‘As a defender, I don’t want to go back home with five goals against me’ is the mentality we’d want our Gunners to embrace. They need to strive for improved performances and results, refusing to settle for anything less.\nA win versus Chelsea will surely turn things around. This victory could serve as the catalyst for the Arsenal women’s team to intensify their efforts in both the league and the Champions League.\nCOYGW!\nSusan N\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 363,
  "scraped_at": "2026-02-14T12:23:05.734732"
}