{
  "article_id": "7d3bf414ca44",
  "url": "https://www.aa.com.tr/en/europe/many-european-nations-ban-pro-palestine-rallies-despite-right-to-freedom-of-expression/3057875",
  "title": "Many European nations ban pro - Palestine rallies despite right to freedom of expression",
  "date": "20231118T171500Z",
  "domain": "aa.com.tr",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Many European nations ban pro-Palestine rallies despite right to freedom of expression\nPeaceful protests against Israel cannot be seen as security issue, Amnesty International says\nBELGRADE, Serbia\nEuropeans who want to raise their voice in solidarity with Palestine at various events face obstacles in many countries where restrictions include the banning of pro-Palestinian slogans, flags, and banners.\nThe UK, France, Switzerland, Germany, Czech Republic, and Austria are just some European nations that have imposed strict measures on the people who wish to publicly condemn Israel's occupation of Gaza and its killing of more than 12,000 Palestinians in Gaza, including approximately 5,000 children,\nMany human rights groups, including Amnesty International, have criticized the attitudes of European authorities that have imposed these restrictions, arguing that they violate freedom of expression.\nAmnesty has said that peaceful protests against Israel cannot be seen as a security issue.\nAccording to the organization, banning pro-Palestinian demonstrations, harassing or detaining those expressing their views on the matter, and warning that foreigners who participate in such activities may be deported do not comply with human rights.\nThe group further said that some countries, including Austria, the Czech Republic, and Germany, have been blocking the EU from collectively calling for a cease-fire or calling out violations of international humanitarian law by Israeli security forces.\nIsrael has launched relentless air and ground attacks on the Gaza Strip since a cross-border attack by the Palestinian group Hamas on Oct. 7.\nAt least 12,000 Palestinians have been killed, including around 8,300 women and children, and over 30,000 others injured, according to the latest figures from Palestinian authorities.\nAnadolu compiled some of the restrictions imposed by European countries against those who want to make their voices heard in support of Palestinians.\nIn Britain, there have been attempts to ban Palestine solidarity protests, attended by hundreds of thousands every Saturday since Oct. 14.\nFormer Interior Minister Suella Braverman opposed the marches from the very beginning, claiming on the first week of the marches that they amounted to \"support for terrorism.\"\nShe said carrying the Palestinian flag or chanting certain slogans could be perceived as backing terrorism \"depending on the situation\" and advised police to take her perspective in their evaluations.\nBraverman took specific issue with the phrase, \"Palestine will be free, from the river to the sea,\" which she claimed is antisemitic and sought to erase Israel off the map.\nShe also called the rallies \"hate marches,\" and asked for the march on Nov. 11 to be canceled because it coincided with Armistice Day, marking the end of World War I.\nThe same call came from Prime Minister Rishi Sunak and the London Metropolitan Police. Sunak described a march on Armistice Day as \"provocation and disrespect.\"\nThe march was held, though, and with the demand for Braverman's resignation, despite the calls.\nBraverman, in her statement after the march, said: \"The streets of London are polluted with hatred, violence and antisemitism.\"\nHer accusations against the police, alleging that they were \"taking sides\" for not preventing the protests, were soon dismissed, but the extreme right-wingers she encouraged took to the streets on Nov. 11, causing tensions with law enforcement.\nAlleged 'antisemitism' detentions spike in France\nIn France, authorities imposed a total ban on demonstrations supporting Palestine. The decision was taken to the Council of State on the grounds that it was against freedom of expression.\nThe council ruled that \"a collective ban\" could not be taken for the demonstrations, and required authorities to make decisions on a \"case-by-case basis.\"\nSince the start of demonstrations in support of Palestine, the number of people detained \"on the grounds of antisemitism\" has surged in the country.\nThe government responded by organizing a pro-Israeli demonstration on the grounds of protesting antisemitism.\nThe participation of far-right leader Marine Le Pen and her supporters in this demonstration held in Paris on Nov. 12, upon the call of Parliament Speaker Yael Braun-Pivet and Senate President Gerard Larcher, sparked controversy.\nLarge rallies, marches banned in Bern on Nov. 17-Dec. 24\nPro-Palestinian demonstrations were banned in the Swiss cantons of Basel and Zurich after Oct. 7, on the grounds that they \"pose a risk to the police, demonstrators and those around them.\"\nThe UN High Commissioner for Human Rights criticized the bans, saying they were \"disproportionate.\"\nWhile the ban in Zurich has been lifted, no rallies have yet been held in Basel.\nIn Bern, local authorities banned large rallies and marches between Nov. 17 and Dec. 24, citing other activities scheduled to be held in that period, as well as the city's Christmas Market.\nPhilippe Muller, security director in the canton, urged for avoiding pro-Palestine rallies, claiming that there was a high possibility of violence.\n99 pro-Palestine demonstrations barred in Germany\nMany pro-Palestinian demonstrations were banned in Germany in the first weeks of Israel's attack to Gaza.\nIn Berlin, students were banned from carrying Palestinian shawls and stickers with Palestinian flags.\nIn the state of Bavaria, the slogan \"From the river to the sea\" often chanted at pro-Palestinian demonstrations, was banned.\nTo date, 99 demonstrations in support of Palestine have been banned in Germany.\nCzech Republic, Austria ban slogan ‘From river to sea, Palestine will be free’\nThe Czech Interior Ministry announced that the use of the slogan \"From the river to the sea, Palestine will be free,\" which has been used for decades at pro-Palestine demonstrations all over the world, would be punishable as \"terrorist propaganda.\"\nIt said anyone using the phrase could be charged with \"potentially supporting and encouraging terrorism, inciting hatred against a group of people, or denying, questioning, condoning or justifying genocide.\"\nIn Austria, the same slogan was banned at demonstrations on the grounds that it was \"provocative and exclusionary.\"\nPermits were not given to hold demonstrations against the slogan's banning.\nBulgaria allows pro-Israel demonstrations, bars pro-Palestine ones\nSince Oct. 7 in Bulgaria, authorities declared Hamas a terrorist organization and took a pro-Israeli stance, with lawmakers passing a declaration in condemnation of Hamas and throwing unconditional support behind Israel.\nWhile the Balkan country has allowed pro-Israel demonstrations, attempts by pro-Palestinian rallies have constantly been blocked.\nThough the country allows for general demonstrations to take place, a ban was announced with a recommendation by the prosecutor's office that \"demonstrations that appear to be indirect support for the terrorist Hamas cannot be allowed.\"\nThe municipality in the capital Sofia also banned a demonstration planned for Oct. 23 for the same reason.\nA press conference by representatives of Arab and Palestinian associations in the country on Nov. 15 was boycotted by national press organizations.\nKosovo bans protest ahead of football match with Israel\nPolice in Kosovo have banned a pro-Palestine protest planned ahead of an UEFA Euro 2024 qualifier football match with Israel.\nFollowing the decision, people took to social media to call for a complete boycott of the match's ticket sales.\nStrict measures and a ban were also enforced on possessing of all kinds of \"racist, xenophobic, political and religious materials\" in and around the stadium.\nThis was the first appearance of the Israeli national team abroad since the beginning of the conflict in the Gaza Strip.\nKosovo has allowed pro-Israel supporters to hold a rally and light candles for the victims of the conflict.\nMeanwhile, in surrounding countries like Bosnia-Herzegovina and Serbia, thousands have freely gathered in pro-Palestine rallies to hold peaceful demonstrations under the security and presence of the police.\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options.",
  "word_count": 1260,
  "scraped_at": "2026-02-14T14:09:21.730019"
}