{
  "article_id": "7d4e2d7bb04b",
  "url": "https://mwnation.com/free-entry-at-cosafa-tourney/",
  "title": "Free entry at Cosafa tourney - Nation Online",
  "date": "20240813T071500Z",
  "domain": "mwnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Free entry at Cosafa tourney\nFootball Association of Malawi (FAM) says fans will watch the Cosafa Women’s Club Championship for free as a way of enticing more girls to join women’s football.\nThe regional showpiece, which is also a qualifier for the 2024/25 CAF Women’s Champions League, kicks off this Thursday at Mpira Stadium in Chiwembe Township, Blantyre.\nFAM competition sand communications director Gomezgani Zakazaka said in an interview yesterday that they hope the move will attract more fans, especially girls.\n“We are aware that this tournament having complied with FAM’s short notice to submit a response within 48 hours, the association should also treat the matter with urgency.\nHe said: “FAM gave us a 48-hour timeline. Since they have set that timeline as the standard, we expect a conclusion to this matter within the same timeline. It is only fair for them to do that.\n“Besides, we are doing injustice to the player by prolonging this whole matter. They should close this within the same timeframe they have set.\n“It is only logical to do that. The same measure they have subjected us to should be the same measure they need to conclude this matter.\n“This will allow us to complete the registration exercise they have held..”\nIn the highly controversial transfer, Bullets also accuse Wanderers of coercing the player to sign for them on the day he was expected to be unveiled by the TNM Super League defending champions.\nBut in response to FAM, the Nomads have tendered 10 pieces of evidence to prove that they did not violate article 25(6) of the FAM Regulations on the Status and Transfer of Players.\nThe submission, signed by Ndovi, reads in part: “By our club’s letter dated 29 July 2024 addressed to Premier Bet Dedza Dynamos FC [hereinafter Dedza FC], we made a transfer request for Mr. Promise Kamwendo .\n“By letter dated 31 July 2024, under the hand of their chief executive officer, one Flera Chimango Kulemero, Dedza FC advised of valuation of the player at the sum of K15 million. The said letter also categorically granted our club permission to speak to the player regarding personal terms. ’.\n“Thereafter, negotiations via telephone and WhatsApp texts ensued between Dedza officials namely Lewis Yumbe and their CEO on the one hand, and our CEO Mr. Panganeni Ndovi and our Director Mr. Tiya Somba-Banda on the other hand, culminating in an understanding on the quantum of transfer fees.\n“By our club’s letter dated 3 August 2024 we, therefore, counter-offered the sum of K 4 million. . Dedza FC agreed to the counter-offer and provided their account details for us to remit the transfer fee of K4 million which [we] promptly facilitated.\n“The player was given the greenlight to travel to our base and upon agreement of personal terms we executed an employment contract in the evening of 3rd August 2024.”\nAccording to Wanderers, Kamwendo signed the contract on August 3 in the presence of his uncle, brother and the player’s manager Hastings Chilunga.\nThe Nomads claim that Dedza chose their offer “presumably due to its higher economic value”.\nDedza, on the other hand, acknowledged having reached an agreement with Bullets on the transfer of the player following his instructions through his manager and the club received K3 million as transfer fee.\nFAM competitions and communication director Gomezgani Zakazaka in an interview yesterday confirmed receiving responses from all concerned parties.\nOn Wanderers’ plea to expedite the conclusion of the case, he said: “The Players Status Committee will have to sit and hear the case as soon as possible.”",
  "word_count": 596,
  "scraped_at": "2026-02-14T13:16:06.024646"
}