{
  "article_id": "7da0e7ef3a61",
  "url": "https://www.yahoo.com/news/trump-f-ed-idiot-stormy-204757957.html",
  "title": "  Trump f ---- ed you , idiot , Stormy Daniel lawyer told tabloid",
  "date": "20240426T211500Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "‘Trump f----ed you, idiot’, Stormy Daniels’ lawyer told tabloid\nThe lawyer who negotiated Stormy Daniels’ hush money deal told a tabloid editor who helped Donald Trump kill stories of alleged affairs “he f----d you, idiot”.\nKeith Davidson represented Ms Daniels and Karen McDougal, a former Playboy model, in financial agreements to buy their silence over their purported trysts with Mr Trump.\nHe later texted Dylan Howard, the-then editor of the National Enquirer to whom he fed salacious stories: “He owes AMI [the Enquirer’s parent company] everything and he f----d u. Idiot.”\nMr Davison did not explicitly name Mr Trump in the text message, sent months into Mr Trump’s first term in office.\nDuring his four days of testimony, former tabloid boss David Pecker named Mr Howard and Mr Davidson as key players in the “catch-and-kill” scheme to bury negative stories about the former president.\nThe pair appeared to regret their involvement in the scheme, according to a string of text messages submitted into evidence by prosecutors in Mr Trump’s criminal hush money trial.\nOn the night of Mr Trump’s victory in the 2016 presidential election, Mr Davidson texted Mr Howard saying: “What have we done?”\nMr Howard replied shortly before 3am on November 9, 2016: “Oh my god.”\nBut their concern appeared to be short-lived, as later exchanges showed the pair discussing trying to get tickets to Mr Trump’s inauguration from Michael Cohen, Mr Trump’s former fixer.\nMr Pecker previously testified that he, Cohen and the former president had in August 2015 hatched a plan to bury any potentially embarrassing stories that could hurt Mr Trump in his 2016 election run.\nWeeks before voters went to the polls, Mr Howard brought Ms Daniels’ story of an alleged sexual encounter with Mr Trump to Mr Pecker. Mr Pecker said Daniels’ story could have been “very damaging” and he advised Cohen to buy it and “take it off the market”.\nThe 34 felony charges being brought against Mr Trump centre on an alleged $130,000 payment Cohen made to Ms Daniels to “silence” her.\nMore in Politics\nProsecutors say Mr Trump illegally falsified business records by disguising his reimbursement payments to Cohen as legal fees.\nMr Trump has pleaded not guilty on all 34 counts. He denies having a sexual encounter with Ms Daniels.\nDuring Friday’s cross-examination, Emil Bove, a defence lawyer, tried to suggest Mr Pecker’s arrangement with Mr Trump was “standard operating procedure”.\nHe also tried to cast doubt on Mr Pecker’s testimony, suggesting his story had changed since his first meeting with the FBI in 2018.\nMr Pecker insisted he had been “truthful to the best of my recollection”.\nBefore court was in session on Friday morning Mr Trump wished his wife Melania “a very happy birthday”.\n“It’d be nice to be with her, but I’m at a courthouse for a rigged trial”, he told reporters in the courthouse hallway.\nThe trial continues.\n09:41 PM BST\nWhat happened today\nThanks for following along with today’s live coverage of the fourth day of testimony in Mr Trump’s hush money trial.\nHere’s a recap of Friday’s court session:\nThe lawyer who negotiated Stormy Daniels’ hush money deal told a tabloid editor who helped Mr Trump kill stories of alleged affairs “he f----d you, idiot”.\nOn the night of Mr Trump’s victory in the 2016 presidential election, Mr Davidson texted Mr Howard saying: “What have we done?”\nThe defence finished its cross-examination of David Pecker. Trump lawyer Emil Bove tried to suggest Mr Pecker’s testimony was inconsistent. He also suggested Mr Pecker’s “catch and kill” arrangement was normal practice in the tabloid industry.\nMr Pecker insisted he had been “truthful to the best of my recollection”.\nThe trial continues next week.\n09:20 PM BST\nAs the prosecution go through a mass of files, Trump shuts his eyes\nRebecca Mangold, for the prosecution, is going through reams of documents regarding Cohen setting up a bank account for a new company.\nThe content is very dry - especially for a Friday afternoon.\nMr Trump just closed his eyes.\nIn the court aisle one police officer yawned, while another checked his watch.\n08:46 PM BST\nNext witness: Gary Farro\nGary Farro is the prosecution’s third witness.\nMr Farro, from New Jersey, is dressed in a navy suit, with a blue tie and purple pocket square.\nHe tells the court he works as a private client advisor for Flagstar Bank.\nHe used to work at First Republic bank.\nMr Farro was a senior managing director at First Republic when Cohen was seeking to arrange the $130,000 payment to Stormy Daniels.\nHe is currently going through banking regulations covering secrecy and anti-money laundering.\n08:28 PM BST\nTrump tries to talk to witness\nMr Trump stood up and tried to speak to his long-time executive assistant Ms Graff as she stepped down from the witness stand.\nIt was hard to hear what he said, but he appeared to ask how she was.\nMs Graff, who was holding a walking stick, continued to walk out of the room.\nDuring her cross-examination, Ms Graff said she had heard “office chatter” that Mr Trump was considering casting Ms Daniels in the Celebrity Apprentice.\nShe assumed that is why the former porn star had been waiting in the reception of Trump Tower in 2016.\nOther reporters say Mr Trump tried to touch Ms Graff’s hand when she finished testifying.\n08:10 PM BST\nWorking for Trump was ‘stimulating, exciting and fascinating’\nThe court was shown a redacted contact book entry from the Trump Organization which showed entries for “Stormy” and Ms McDougal.\nFollowing a short string of questions from the prosecution, Susan Necheles has started her cross-examination.\nMs Graff described working for Mr Trump as “very stimulating, exciting… just a fascinating place to be”.\nWhen asked if Mr Trump treated her with respect, Ms Graff said: “I don’t think I would have been there 34 years if he didn’t.”\nMr Trump could be seen smiling.\nShe also described how she and her husband had been invited to the inauguration.\n08:01 PM BST\nPorn star was in Trump Tower, says ex-president’s assistant\nMs Graff said she has a “vague recollection” of seeing Stormy Daniels in the reception area of Trump Tower in 2016.\nSusan Hoffinger, the prosecutor, asked whether Ms Graff had seen Ms Daniels before then, she said: “To the best of my recollection, yes.”\nMs Graff confirmed she knew Ms Daniels was an adult film actress.\n07:55 PM BST\nTrump’s former assistant testifies\nMr Trump’s former assistant Rhona Graff is on the stand.\nMr Trump is watching intently as Ms Graff describes her 34-year-career working for him.\nMs Graff has said she is being represented by two lawyers paid for by the Trump Organisation.\nShe is being asked in detail about how she managed his diary and contacts.\n07:54 PM BST\nTrump rests his eyes as testimony continues\nMr Trump’s eyes are closed and he’s leaning back in his chair as prosecutor Joshua Steinglass continues his redirect of Mr Pecker.\nThe testimony is once again focused on the tabloid chief’s unwillingness to deal with the Stormy Daniel’s story, and his decision to alert Mr Trump’s lawyer Michael Cohen to it instead.\nMr Pecker said he notified Cohen because, “if he heard it from somebody else he would go ballistic.”\nWhen it came to the question of buying up Daniels’ story, Mr Pecker testified: “I said to Michael Cohen that after paying for the doorman story and the Karen McDougal story, I wasn’t going to pay anything further and I wasn’t a bank.”\nMr Pecker added he was not going to “print it or buy it or be associated with it.”\n07:46 PM BST\nBrief recap as court resumes\nCourt is back in session after a break for lunch. Here’s a brief recap of where things stand.\nThe former National Enquirer publisher David Pecker testified today that he suppressed a story about an alleged affair to help Trump’s 2016 presidential bid, even though it would have boosted sales of his tabloid.\nMr Pecker, 72, agreed with a prosecutor who asked whether it would have been “National Enquirer gold” to publish the story of former Playboy model Karen McDougal’s claim that she had an affair with Trump in 2006 and 2007.\nBut he said he opted not to run the story after paying Ms McDougal for it, because it would have hurt Mr Trump’s chances of beating Hillary Clinton.\n“You killed the story because it helped the candidate, Donald Trump?” prosecutor Joshua Steinglass asked him. Mr Pecker agreed.\nProsecutors hope to demonstrate that the suppression of allegations of adultery was motivated by political considerations. The defence has argued the payment was made to spare Mr Trump’s family embarrassment, not bolster his campaign.\nUnder cross-examination, Trump lawyer Emil Bove sought to undermine Mr Pecker’s credibility.\nHe asked Mr Pecker whether his statements aligned with facts contained in an agreement by the Enquirer’s parent company to co-operate with legal authorities to avoid prosecution. Pecker denied any substantial mismatch.\nMr Bove has also sought to illustrate that Mr Pecker’s chequebook journalism was not confined to Mr Trump.\n07:37 PM BST\n‘Trump f---ed you, idiot,’ Stormy Daniels’ lawyer told tabloid\nStormy Daniels’ lawyer told a tabloid that helped Donald Trump bury stories of affairs, “he f---ed you, idiot”.\nKeith Davidson represented Daniels and Karen McDougal, a former Playboy model, in financial agreements to stay silent over their alleged trysts with Mr Trump.\nHe later told Dylan Howard, the-then editor of the National Enquirer and a key figure in the deals: “He owes AMI [the National Enquirer’s parent company] everything and he f---ed u. Idiot”.\nMr Davison did not explicitly name Mr Trump in the message, sent months into Mr Trump’s first term in office, but it appears to relate to the former president.\nBoth Mr Davidson and Mr Howard, key players in Mr Trump’s “catch-and-kill” schemes to bury negative stories, appeared to later regret their involvement, according to a string of text messages submitted into evidence by prosecutors in Mr Trump’s hush money trial.\nOn the night of Mr Trump’s victory in the 2016 presidential election, Mr Davidson texted Mr Howard saying “what have we done?”\nMr Howard replied shortly before 3am on November 9, 2016: “Oh my god”.\nMr Trump, 77, is on trial accused of falsifying business records in relation to hush money payments.\nHe denies the charges, and the claims of affairs.\n06:13 PM BST\nPecker says he killed story to influence 2016 election\nMr Pecker has confirmed it was not standard practice prior to the August 2015 meeting to give candidates oversight over headlines and copy of intended stories.\nHe also agreed with Mr Steinglass’ claim that he had reused old stories about Mr Trump’s political rivals because they were “surging in the polls”.\nMr Pecker said while he didn’t use the term “catch and kill” in the meeting he understood the agreement to mean using “the company’s sources to hear of any information that would be coming out on Mr Trump or the campaign” related to women selling their stories.\nMr Steinglass asked Mr Pecker whether his purpose of “locking up” Ms McDougal’s story was to “influence the election”.\nMr Pecker said “Yes” and said it was “to acquire lifetime rights” so the story “was not published by any other news organisation”.\nMr Steinglass said while Ms McDougal’s story would have been “National Enquirer gold”, Mr Pecker had “zero intention of publishing it.”\n“You killed the story because it helped the candidate, Donald Trump”, Mr Steinglass said.\n”Erm.. yes”, Mr Pecker replied.\n05:57 PM BST\nProsecution resumes questionining\nMr Steinglass is trying to pick apart the defence’s argument that there was nothing untoward about the hush money deals with Ms McDougal and Mr Sajudin.\nThe prosecution asked whether amending Ms McDougal’s agreement to make the exclusivity deal from 90 days to “in perpetuity” was standard practice.\nMr Pecker said it was not, and that it was edited “after my conversation with Michael Cohen”.\nHe also asked if it was “standard operating practice” to consult with a president’s fixer about amendments, to which Mr Pecker said “no”.\n05:47 PM BST\n‘I’ve been truthful’: Defence’s cross-examination of Pecker concludes\nMr Bove rested his cross-examination after trying to cast doubt over Mr Pecker’s testimony.\nYesterday, Mr Pecker said Cohen had told him not to worry after the Federal Election Commission contacted him because “Jeff Sessions is the attorney general, and he is in Donald Trump’s pocket.”\nMr Bove asked whether Cohen was “prone to exaggeration”, to which Mr Pecker replied: “Yes.”\nThe jury followed the cross-examination closely, their heads and eyes moving between Mr Bove and Mr Pecker.\nMr Bove also had Mr Pecker confirm that the boxes held at National Enquirer were “worthless” and not a “trove” on the former president.\nTowards the end of Mr Bove’s grilling, Mr Pecker said: “I’ve been truthful to the best of my recollection.”\nMr Steinglass, for the prosecution, is now questioning Mr Pecker again.\n05:07 PM BST\nPecker discusses FBI probe\nCourt is back in session. The jury is seated and Mr Bove is carrying on with his cross-examination.\nThings are moving very slowly now.\nMr Bove is showing the jury a copy of AMI’s non-prosecution agreement and asking a confused Mr Pecker what different sentences mean.\nMr Pecker earlier described how three FBI officers came to his house and searched his phone at 8am in 2018.\nHe also said AMI was in the middle of negotiating a $100million deal for Hudson News Group to buy the National Enquirer.\nThe deal could not go ahead without the FBI’s investigation into AMI being resolved, he said.\nMr Bove asked whether the FBI probe “put some pressure on the negotiations.”\n“From a timing standpoint, it would have added onto the stress of the transaction,” Me Pecker said.\n04:23 PM BST\n‘Was that another mistake?’: Defence grills Pecker\nMr Bove has been questioning Mr Pecker about claims he made during his testimony on Thursday that Mr Trump had thanked him for “handling the McDougal situation” in front of Mike Pompeo, former FBI chief James Comey and Reince Priebus, former White House.\nMr Pecker had claimed Mr Trump had also thanked him for “the doorman situation” in front of the men.\n“Was that another mistake?” Mr Bove asked\n“No”, Mr Pecker replied.\n“Do you believe President Trump said that to you, as you sit here right now?” Mr Bove added.\n“Yes I do”, Mr Pecker said.\nMr Bove, again trying to cast doubt over Mr Pecker’s reliability as a witness, referred to an FBI report from 2018 which states Mr Trump showed no gratitude to Mr Pecker and AMI.\nMr Pecker said he is “not responsible” for the FBI report.\n“I know what the truth is, I can’t state why it was written this way”, he said.\nThe court is now on a short break.\n04:10 PM BST\nPecker quizzed on Stormy Daniels\nBack in court, Mr Trump is watching intently as his old friend is questioned about porn star Stormy Daniels.\n“You wanted nothing to do with it, right?”, Mr Bove asked.\n“That’s right”, Mr Pecker said.\n04:08 PM BST\nBiden shares childhood tales as president trails new media strategy\nStern began by discussing Mr Biden’s early life: his upbringing, childhood stutter, his time as a public defender and how he met his first wife, Neila.\nThe president recounted family stories and said his stutter was the best thing that happened to him because it prepared him for life’s challenges.\nThis new strategy by the Biden campaign of engaging with the media more, and confronting the president’s vulnerabilities head-on, comes as they attempt to make the 81-year-old appear more accessible to voters.\nMr Biden also told Stern that his father took a tough-love approach to parenting, telling the radio host an anecdote about getting knocked out while playing football when he was around ten years old.\n“My dad walked out with us and said ‘Joey get up. Just get up. Gotta get up’,” he said.\n03:59 PM BST\nBiden makes surprise Manhattan appearance\nAs Donald Trump sits in court, his 2024 opponent Joe Biden has unexpectedly popped up in Manhattan too.\nThe US president is just a few miles from his predecessor to do an unscheduled interview with radio presenter Howard Stern.\nThe White House revealed in the last hour to reveal that Mr Biden, who has done far fewer interviews than his recent predecessors, would be appearing live on Stern’s Sirius XM radio show.\nMr Biden arrived in New York yesterday and held a glitzy campaign event at the home of actor Michael Douglas.\n03:51 PM BST\nGiggling reporters told to ‘quiet down’ during moments of levity\nEvery time Mr Pecker says something funny - and reporters laugh - we are quickly told to “quiet down” by police standing around the courtroom.\nThe most recent giggle was prompted when Mr Pecker was being asked whether a “major attorney” was one of his colleague Dylan Howard’s key sources.\nMr Pecker hesitated before saying: “I wouldn’t call him a major attorney”.\n03:47 PM BST\nPecker shown invoice for Playboy mate\nDefence lawyer Emil Bove has shown Mr Pecker the invoice from Karen McDougal’s attorney Keith Davidson for her $150,000 agreement.\nMr Pecker testified that he did not personally process the invoice and wire transfer to Ms McDougal’s attorney.\nThe former tabloid publisher said that Ms McDougal, a former Playboy mate, was interested in relaunching her career.\nMr Bove asked Mr Pecker to confirm that “Ms McDougal was not focused on cash.”\nAfter a lengthy pause, Mr Pecker replied: “Cash wasn’t the primary portion of the agreement.”\n03:44 PM BST\nDefence repeat ‘standard operating procedure’ mantra\nMr Bove has just used his favourite phrase “standard operating procedure” three times in as many minutes.\nHe has been asking Mr Pecker about AMI’s paperwork for the $150,000 payment to Ms McDougal’s lawyer.\nHe has confirmed he didn’t input any of the payment details himself, but relied on staff on the accounting team.\nMr Bove has asked whether he was “comfortable they were following procedures”, to which Mr Pecker replied “yes”.\n03:39 PM BST\nAnalysis: Trump’s team dig into tabloid’s incentives\nDavid Pecker has painted a tawdry portrait of so-called “catch and kill” tabloid schemes. The tactic is used to prevent a potentially damaging story by buying the rights to it and then killing it through agreements that prevent the paid person from telling the story to anyone else.\nDonald Trump’s lawyer, Emil Bove, is digging into the National Enquirer’s editorial process in his cross-examination of Mr Pecker today, to demonstrate to the jury that the tabloid had its own incentives to act on certain political stories.\nTo underscore his point, Mr Bove pulled up five unflattering headlines that ran in 2015 about Ben Carson, who ran against Mr Trump in the 2016 GOP primary.\nMr Bove noted the information was pulled from publicly available information published in other outlets, including The Guardian.\nMr Pecker, who chaired the National Enquirer’s parent company, has acknowledged that it was standard practice at the publication to recycle stories from other outlets with a new slant.\n“Because it’s good, quick and cost efficient, and you would’ve done it without President Trump?” Mr Bove asked.\n“Um, yes,” Mr Pecker replied.\n03:28 PM BST\nAwkward pause as Pecker struggles to recall details\nThere was just a bit of an awkward pause in the courtroom as Mr Pecker visibly struggled to recall details of a phone call with Mr Trump.\nFollowing his grilling from Mr Bove yesterday, Mr Pecker appears on edge, eager not to make a mistake and be called out on it.\nThe former tabloid boss, who today is wearing a white shirt and pink tie, said he received a call in June 2016 from Mr Trump about Karen McDougal.\n“He said ‘is it true that there’s a Mexican group that’s looking to buy the story for $8million’”, Mr Pecker said.\nMr Pecker said he told Mr Trump he didn’t think that was true. He then trailed off as he tried to recall the rest of the conversation.\nA few moments later he continued, saying he told the former president the story “should be taken off the market”.\nMr Trump told him: “I don’t buy stories because it always gets out”.\n03:25 PM BST\nTrump ‘love child’ story would ‘sell 10 million’ copies if true, says former tabloid boss\nMr Bove is grilling Mr Pecker on the $30,000 payment to Trump Tower doorman Dino Sajudin for his story about Mr Trump fathering an illegitimate child, which was later revealed to be false.\nMr Pecker confirmed he had signed “hundreds of thousands” of source agreements like the one for the Mr Sajudin story.\nMr Bove is suggesting that had the story been true, Mr Pecker would have published it.\nHe agreed when he was asked by Mr Bove whether it would have been “the biggest” National Enquirer story “ever” and “could sell 10 million” copies of the tabloid.\n“If this story was true you would’ve run it, correct?” Mr Bove asked.\n“Yes”, Mr Pecker replied.\n03:22 PM BST\nInside the courtroom\nHere’s a glimpse inside the courtroom from the pool of photographers who are briefly allowed in to take a few snaps of Donald Trump.\n03:13 PM BST\nPecker quizzed on ‘hit pieces’\nMr Bove is questioning Mr Pecker on the National Enquirer’s hit-pieces on Mr Trump’s political rivals in the run-up to the 2016 election.\nHe is suggesting that there wasn’t “much new content” in articles attacking Mr Trump’s former primary opponents Ben Carson, Marco Rubio and Ted Cruz.\nMr Bove asks whether it was “good for business” for the National Enquirer to “recycle” information from other news outlets about people of interest.\nMr Pecker confirms it was.\nMr Bove has again used the term “standard operating procedure”- a phrase that has come up repeatedly in his cross-examination.\n02:55 PM BST\nDefence lawyer: ‘Let me know if I ask a bad question’\nMr Trump’s lawyer, Emil Bove, has opened the cross-examination by apologising to Mr Pecker for causing “confusion” regarding his questioning about an FBI interview.\nMr Bove begins by saying there was some “confusion” in the questioning on whether former White House communications director Hope Hicks had come up in his FBI interview in 2018.\n“I wanted to apologise and move on from that,” Mr Bove told Mr Pecker.\nHe added that Mr Pecker can let him know “if I ask a bad question” today - joking that the prosecution would not hesitate to do so too.\nSome of the jury smiled at the jibe.\n02:51 PM BST\nCourtroom divided over ‘freezing’ conditions\nThe temperature inside Part 59, the courtroom where the trial is being held, has become a point of contention in this trial.\nIt’s not warm in the courtroom, but I wouldn’t say it’s “freezing” as Mr Trump has claimed.\nI’m in a dress and a jumper, with my coat firmly on the floor, but other reporters are bundled up in puffer jackets.\nOne member of the jury is wearing a coat, while another is in a short sleeved polo shirt.\n02:49 PM BST\nDavid Pecker returns to the stand\nFormer tabloid boss David Pecker is back on the stand where he will be cross-examined by the defence.\nMr Pecker walked past Donald Trump at the defence table as he made his way to the stand but did not look over at his longtime friend.\nIt is his fourth day of testimony.\nThe jury has also entered the courtroom.\n02:45 PM BST\nTrump’s lawyer to apologise to Pecker\nJoshua Steinglass, for the prosecution, has again complained about Donald Trump’s lawyer’s line of questioning of David Pecker yesterday.\nMr Bove’s line of attack on Thursday involved questioning which suggested Mr Pecker had changed his testimony regarding the date of the August 2015 Trump Tower meeting and whether former communications head Hope Hicks had been there.\nMr Bove said his intention is to “apologise” to Mr Pecker at the start of today’s session.\nMr Steinglass also took umbrage with Mr Bove’s grilling of Mr Pecker’s meetings with the district attorney’s office, which he said “left a misleading impression”.\n02:41 PM BST\nTrump gag order hearing Thursday\nJudge Juan Merchan said a hearing over the Donald Trump’s gag order violations has been changed to Thursday at 9.30 am.\nThe judge has yet to rule on a request by prosecutors to punish Mr Trump for allegedly violating a gag order that bars him from publicly criticising witnesses, some court officials and their relatives.\nJudge Merchan said he would hold a hearing next Thursday to examine what prosecutors say are further gag order violations.\nMr Trump could be fined $1,000 for each violation or jailed, though prosecutors say they are not seeking imprisonment at this point.\n02:37 PM BST\nCourt is in session\nMr Trump entered the courtroom followed by his entourage of lawyers, secret service agents and his loyal legal adviser Boris Epshteyn.\nThe former president appears to keep a packet of mints or sweets in the right hand pocket of his navy suit jacket, it rattles each time he storms past the rows of reporters.\nJustice Juan Merchan is on the bench, the court is in session.\n02:35 PM BST\nTrump: ‘Happy birthday Melania’\nDonald Trump has entered the courtroom in Manhattan. He paused to address reporters outside, and began by wishing his wife Melania a happy birthday.\n“I want to start by wishing my wife Melania a very happy birthday,” he said. “It would be nice to be with her - but I’m in a courthouse for a rigged trial.”\nMr Trump then complained about the “freezing” courtroom, adding he believed the temperature was deliberately being kept at an uncomfortable level.\n“So we have another day of court [in a] freezing courthouse. It’s very cold in there - on purpose I believe. They don’t seem to be able to get the temperature up. It shouldn’t be that complicated. And that’s just fine”.\nPRESIDENT TRUMP: \"I want to start by wishing my wife Melania a very happy birthday. It would be nice to be with her—but I'm in a courthouse for a rigged trial.\" pic.twitter.com/83s4UeWAiP\n— Trump War Room (@TrumpWarRoom) April 26, 2024\n02:27 PM BST\nA recap of a historic first week\nOver the past three days David Pecker has detailed how he worked with Mr Trump and Michael Cohen to hatch a “catch-and-kill” scheme to bury negative stories about the former president in the run up to the 2016 election.\nMr Pecker said the “highly confidential” agreement involved his firm, AMI paying $150,000 to former Playboy model Karen McDougal for her story about an alleged 10-month affair with Mr Trump.\nIn another hush money deal, the publishing company paid Trump Tower doorman Dino Sajudin $30,000 for a story about Mr Trump fathering a child out of wedlock, even though they believed the story to be false.\nBut Mr Pecker said he drew the line at paying off porn star Stormy Daniels, who had initially requested $120,000 for her story of a 2006 sexual encounter with the then-Republican nominee, telling Cohen he should stump up the cash instead.\nMr Trump watched intently as Mr Pecker described how Cohen became “upset” with him when he refused to shell out for the story and said “the boss would be furious with me”.\nMr Pecker said Daniels’ story could have been “very damaging” and he advised Cohen to buy it and “take it off the market”.\n02:23 PM BST\nOfficers patrol the court aisles\nReporters have filled the benches in the Manhattan courtroom where Donald Trump’s hush money trial is being held.\nSix police officers are currently patrolling the aisles, ensuring nobody uses their phones.\nMeanwhile, four court artists are preparing their pastels and watercolour paints ready for Mr Trump’s arrival.\nSome journalists are discussing whether to start bringing a small cushion into the courtroom - the wooden benches are very unforgiving.\n02:09 PM BST\nWelcome\nHello and welcome to the live blog. Rozina Sabur here. We’ll be bringing you all the updates as Donald Trump’s “hush money” trial returns for its fourth day of testimony in New York.",
  "word_count": 4705,
  "scraped_at": "2026-02-14T13:13:44.841821"
}