{
  "article_id": "7da5a22f171f",
  "url": "https://www.sounderatheart.com/2023/10/three-stats-ol-reign-vs-angel-city-playoff-edition/",
  "title": "Three stats : OL Reign vs . Angel City , playoff edition",
  "date": "20231022T191500Z",
  "domain": "sounderatheart.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On Friday evening in front of home fans at Lumen Field, OL Reign got the job done – advancing to the NWSL semifinal. It took until the 87th minute for Veronica Latsko to find the breakthrough goal – off a great cross from Phoebe McClernon – but the Reign were knocking on the door in the second half.\nHere are three stats from the Reign's NWSL quarterfinal win.\n6\nAccording to FBref, Angel City had only six shot-creating actions all match – defined by Opta as the last two actions that directly led to a shot. That was Angel City's lowest total all season – three fewer than their previous low of 9, which came in their 2-1 win against the Reign in late August.\nHere are Angel City's shot-creating action totals in their last five matches between this playoff match and their last battle against the Reign:\n- 23 vs. Portland Thorns\n- 18 vs. Houston Dash\n- 44 vs. Orlando Pride\n- 19 vs. Chicago Red Stars\n- 26 vs. Kansas City Current\nAcross these five matches, Claire Emslie and Savannah McCaskill both had 20 shot-creating actions. Against the Reign? Zero for McCaskill and two for Emslie (the team's highest).\nWhat did OL Reign do that successfully limited Angel City's chances? It was really a full team effort that was focused on keeping them wide and providing a lot of cover to ensure nobody was defending alone. Here's a look at all of Angel City's successful passes in their final third.\nHere's one more stat that highlights the Reign's collective defensive effort: Despite the fact that Angel City had 55% of possession on Friday night, they had just 16 touches in their box – their third-lowest total all season. The only matches where they had fewer were their two regular-season games against the Reign.\nWhile it was a team effort, Latsko provided a lot of defensive effort on the right side – where M.A. Vignola and Emslie presented constant threats. And credit should go to Emily Sonnett for the role she played in covering her teammates and preventing balls into the box. Sonnett and midfield partner Quinn were often pulling wide to ensure Sofia Huerta and McClernon weren't isolated trying to defend Angel City's speedy attackers. At the same time, they had work to do in the midfield to limit how much space McCaskill had to operate – or in Sonnett's case in this clip, do a bit of both.\nAs a result, Sonnett had more touches on the edges around the Reign's defensive box than she did last week against Chicago. According to FotMob, she led the Reign with eight defensive actions and 13 recoveries.\n\"They defended us well. We have to problem-solve on the field and I don’t think we problem-solved quickly enough,\" McCaskill said after the match.\nBefore the match, Reign head coach Laura Harvey talked about how expansive Angel City plays. She used that word a few times in pre-match press conferences and interviews. And credit to OL Reign – they defended extremely well to prevent Angel City from playing in the expansive way they wanted.\n100%\nLauren Barnes was dialed in for the quarterfinal match. She completed 100% of her 53 passes. That includes going 13/13 on long passes, which is pretty darn remarkable, and a team-high nine completed passes into the final third.\nAs Alison Gale confirms, no player has connected 100% of their passes at the volume of passes that Barnes attempted. The last player to get close was Dorian Bailey in 2020, with 44 passes.\nOn top of that, Barnes had two big tackles – including what felt like a game-saving one at the end of the match. What a match from the OL Reign veteran.\n65%\nAccording to FotMob, the Reign won 65% of their duels on Friday night.\nOL Reign players were in the top five in duels won: Jordyn Huitema won 12, Megan Rapinoe won 11, Latsko and Fishlock won seven, and McClernon won five. This group also won 8 of 10 tackles and were fouled 11 times (with Latsko taking most of these hits) while getting whistled for four.\nPlayoff soccer is not always going to be pretty, and sometimes you just need to play a game of chess, stay organized, and win the duels when they count. The Reign made sure to do that for 90 minutes.\n\"I think we're a lot more mentally tough this year,\" Rapinoe said referencing why the team finally won a playoff match. \"I think we have a little more grit about us – and I think when you get into the playoffs, I mean, if you can play nice, great, but usually you're going to have to get weird and have that intensity and grind things out. So, I think that is what we've added.\"\nUp next for OL Reign is a trip to San Diego to face the Wave in the NWSL semifinal on Sunday, Nov. 5 at 6:30 PM PT.\nSeven Reign players will join their national teams during a FIFA international window before the semifinal match: Alana Cook, Huerta, and Sonnett will join the U.S. for two friendlies against Colombia, Angelina and Brazil will face Jordyn Huitema and Quinn's Canada in two friendlies (although Huitema may be rested after her knock), and Jess Fishlock has been called up by Wales for two UEFA Women's National League matches.",
  "word_count": 901,
  "scraped_at": "2026-02-14T12:17:04.625919"
}