{
  "article_id": "7e1d74e6b2a9",
  "url": "https://www.aol.com/army-navy-game-pomp-circumstance-103120500.html",
  "title": "Army - Navy game is pomp and circumstance with true meaning this weekend at Gillette Stadium",
  "date": "20231208T140000Z",
  "domain": "aol.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Army-Navy game is pomp and circumstance with true meaning this weekend at Gillette Stadium\nThinking out loud — while wondering if people who are afraid of Santa Claus are really \"Claustrophobic.\"\nEver wonder what “pomp and circumstance” means? This weekend at Gillette Stadium is pomp and circumstance at its finest. Plus a traditional football game like few others.\nArmy and Navy’s set up is in Foxboro for only the third time ever outside of the mid-Atlantic states in the 124th meeting on the gridiron between the two service academies. The economic impact for our area should be obvious. Worldwide radio and TV coverage, too.\nBut for those who don’t really follow football outside of their beloved NFL, remember, the Cadets and Midshipmen also put it all on the line off the field, even if the game has a few aesthetic bumps to it.\nIt is, without a doubt, an example of college sports in its purest form. These guys don’t play for pay. This is pageantry and patriotism, rolled into a singular event, around a football field.\nMore: The Army-Navy football game is at Gillette. Providence is using it to showcase the city.\n∎ Sports bucket list item checked off. Privileged to have seen and broadcast games at Army’s Michie Stadium and Navy’s Marine Corps Memorial Stadium, but this is something you need to see and feel to appreciate. For all of the bad you can come up with about our country these days, these guys will make you feel good again about the U.S. of A.\nAnd you’ll wonder what you were ever mad about, if even for a brief moment in time.\n∎ The Friars passed their first road test for about 25 minutes Tuesday in Norman, Oklahoma. But they soon(er) learned most good teams play 40 minutes, not 25.\n∎X post of the Week I, from @NBADraftWass: “Providence’s Devin Carter becoming one of the NCAA’s most unique impact guards. … First Team All-Irritating to Play Against. Extreme defensive intensity, activity under boards. At 6-3, only player under 6-5 with > 20 % reb, > 3.0 blk ...”\nCarter’s personal 11-0 run against Oklahoma was impressive, pulling his team back into the game after falling into a 12-0 hole at the start. But unless Providence’s guards can help with some consistency (and shot making), Carter’s Superman act will be a requirement every game, not a luxury.\n∎Bounce-back time against Brown on Sunday? What? Brown is back on the PC schedule? Who messed that up?\nSeriously, it’s great for local hoops, great for Brown to renew a longstanding tradition. The Bears should make it interesting, after beating URI Wednesday night. But this ain’t 1956. Not entirely sure this is an every-year event again. Hope I’m wrong.\n∎URI’s Rams certainly put their best foot forward against the Friars a week ago, before stumbling to Brown. But like PC against Oklahoma, Rhody learned what they need to compete at the next level. Shooting. Shooting. And more shooting.\n∎Tammi Reiss’ Rams may have learned a valuable lesson after knocking off Top 25 Princeton. Beware of the next opponent — which happened to be PC. And the Friars popped Rhody’s bubble, 51-50, on Wednesday night.\n∎Going into the Big East-Big 12 Battle this week, there were 14 undefeated teams in Division I. Six of them play in the Big 12. For all the bluster the Big East possesses, and they do have some, the Big 12 is a veritable hurricane.\n∎The first NET (NCAA Evaluation Tool) rankings in college basketball are out. But pay no attention to the silly men behind the curtain and the numbers they concoct. At least for today. You can begin paying attention to NET rankings by the end of January — after enough actual basketball has been played.\n∎ICYMI this week: NCAA Grand Poobah Charlie Baker is stepping up. Changes proposed within Division I include a new subdivision of like-minded institutions with higher resources banding together to support student-athletes at a higher level.\nIn other words, if ya’ wanna play with the bigger boys, you had best be ready to invest like they do. If approved, football is likely to get its way with its own rules and regs. But the chasm between high major and mid- to low-major in basketball and Olympic sports likely gets larger than ever.\nAnd swallows some schools whole.\nThis is, at best guess, an olive branch offering to the football powerhouse schools in an effort to keep the NCAA from splintering and keep everyone in the collegiate family under the same roof. And to keep from ruining the best thing going — the NCAA Men’s Basketball Tournament.\n∎Will the Big East, considered a “Power 6” league in basketball, follow the Football Five, or make that now Four (buh-bye, Pac-12), into the abyss?\n∎Was Florida State hosed by the College Football Playoff committee? Yes. Undefeated conference champs should play on, regardless of injuries. The regular season should mean something.\nBut were the actual four best teams at the end of the season chosen for this years’ playoff? They were.\nThe committee, gulp, got it right. The four best teams today should be playing for the natty. Otherwise, why have the playoff at all? The alternative is the antiquated (but sometimes still enjoyable) bowl system, bloated beyond recognition these days.\n∎The NFL equivalent to this, of course, would be to ban, say, Jacksonville from the postseason because Trevor Lawrence was knocked out of commission. Stupid is as stupid does, amiright?\n∎At least one undefeated Florida State team won it all this week. Congrats to the women’s soccer team, undefeated national champs. But they didn’t lose an on-field star, either.\n∎Speaking of losses, Bryant QB Zevi Eckhaus has hit the transfer portal after winning the Big South/OVC offensive player of the year award this season. He’s got a grad year now to play somewhere else, where ostensibly, the grass is greener. Maybe the $$$, too.\n∎My buddy “Big E” says he bought Mrs. E a fridge for a Christmas present. He can’t wait to see her face light up when she opens it.\n∎What’s left to say about the Patriots? Humbug? Ebenezer Scrooge does have a way with words.\nRecord-setting New England, winning three Super Bowls in four years, then three in five. No one has done that before or since. Then going three straight weeks holding opponents to 10 points or less — and losing all three games. That hasn’t been done by anyone else in the Super Bowl era, either.\nHow? Why? Even diehard Pats fans must acknowledge, the talent level, especially on offense, has dried up faster than a rain puddle in the desert. When you can’t refill (or recharge) your car, it doesn’t run forever. The Bills, Dolphins, maybe even the Jets (and others) have beaten the Patriots to the pump for players.\nCan’t imagine Al Michaels, who has been known to be less-than-pleased with some of the \"Thursday Night Football\" matchups in recent years, was all-too-fired-up to call Patriots-Steelers this week. Just sayin’.\n∎X post of the Week II, from @FrontOfficeNFL: “Bill Belichick is on pace to have the lowest win percentage [.167] in a season by any head coach with a team he had previously won the Super Bowl with. The current season-long low was Tom Landry with the 1988 Cowboys [.188], who was fired after the season.”\n∎None better than Joe Castiglione. A friend, a mentor, a pro, a teacher and a Sox guy through and through. The Baseball Hall of Fame announced Joe this week as the Ford Frick Award winner for broadcasters making major contributions to the sport. I’d say he more than qualifies.\n∎If the reports coming from baseball’s winter meetings in Nashville are true, the Red Sox might be taking a major step back into the A.L. East fray with potential additions like Yoshinobu Yamamoto and the Padres’ Seth Lugo to their rotation.\nBut this much is certain. Being 21st in Major League Baseball in team ERA (4.52) again won’t cut it.\n∎The Sox and Yankees made a trade this week? Alex Verdugo heads for New York with flotsam and jetsam coming in return. It’s just the ninth deal between the two since 1969. Is this part of the “keep-your-friends-close-but-your-enemies-closer” thing?\n∎ICYMI, Part II: The WooSox sold a majority of shares to Diamond Baseball Holdings, a group that owns and operates select minor league teams affiliated with Major League Baseball. Larry Lucchino remains as chairman, Dr. Charles Steinberg as president and Dan Rea as general manager. Local business leader Ralph Crowley, CEO of Polar Beverages, also will join the leadership group.\nYes, the team will stay in Worcester. Blew it again, huh, Rhode Island?\n∎And not for nothin’ but how long will the Independent Man stand around the State House before he eventually pleads: “Put me back upstairs!”\n∎The Celtics lost an in-season tournament game to the Pacers? Yawn. Fitting that it was to Indiana, where the NFL’s Colts certainly know how to hang meaningless banners.\n∎While you’re watching your favorite holiday specials on TV, here’s a little-known fact: Did you know that in the animated “Rudolph the Red-Nosed Raindeer,” Rudolph was actually voiced by a female?\n∎One of television’s most creative, original and daring writers and producers — Norman Lear — passed away this week at 101. Lear revolutionized TV in the 1970s and ‘80s, first by creating the sitcom, “All in the Family,” which featured racism, feminism and the Vietnam War among its topical episodes, with characters like Archie and Edith Bunker that will forever remain popular.\nLear was years ahead of his time. He followed up with comedy spin-offs and specials that made us laugh at our own foibles and dealt with topics previously considered taboo. Go watch an “All in the Family” rerun to see for yourself. We’d never get away with such blatant honesty today.\nInterested in having your questions on Rhode Island sports (and, yes, that includes the Patriots, Red Sox, Bruins and Celtics) answered in a somewhat timely fashion? Think out loud and send your questions, comments and local stories to jrbroadcaster@gmail.com. We’ll share mailbag comments/Facebook posts/threads right here! Join me on Twitter/X, @JRbroadcaster; on Facebook, www.facebook.com/john.rooke; and on Instagram and Threads @JRbroadcaster.\nThis article originally appeared on The Providence Journal: Army-Navy battle in Foxboro is college sports in its purest form",
  "word_count": 1725,
  "scraped_at": "2026-02-14T13:10:24.847516"
}