{
  "article_id": "7e1d52b886a3",
  "url": "https://www.centralmaine.com/2026/02/05/colby-college-skiers-jack-young-maddie-hooker-ready-for-olympic-debuts/",
  "title": "Colby College skiers Jack Young , Maddie Hooker ready for Olympic debuts",
  "date": "20260206T011500Z",
  "domain": "centralmaine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A pair of Colby College cross-country skiers are ready to test their skills against the best in the world.\nJack Young and Maddie Hooker will make their Olympic debuts in Italy this weekend. Young, a native of Jay, Vermont, will represent the United States. Hooker, from Carlton, Victoria, will race for Australia.\n“It’s always been a dream to go to the Olympics,” said Hooker, 21. “To be living that dream out now is amazing. I’m just trying to take it all in. I wasn’t expecting to make it to the Olympics this year, so it was kind of a surprise and delight.”\nYoung and Hooker are among numerous athletes with Maine ties that who will be competing at the Olympics, which spans across several sites in northeast Italy. Three former members of the University of Maine women’s hockey team — Ida Kouppala (Finland), Vendula Přibylová (Czechia) and Tereza Vanišová (Czechia) — will be competing. Gould Academy alums Brianna Schnorrbusch and Hanna Percy will compete in the snowboardcross for Team USA along with fellow alum Nathan Pare of Bethel.\nSchnorrbusch is a native of Monroe Township, New Jersey, while Percy is from Truckee, California.\nYoung, 23, a 2025 Colby graduate, was a multi-sport athlete growing up in Jay — nestled in northern Vermont, just 5 miles from the Canadian border. He played football and baseball and started downhill skiing in elementary school. He began to focusing on skiing midway through high school.\nHooker, who competed in swimming back home in Australia, learned how to ski while on family trips to the United States. She eventually competed in Alpine races at home (several ski resorts exist in the Victorian Alps and High Country). Before Colby, Hooker attended and competed for the Stratton Mountain School in Vermont for two years, where she discovered cross-country skiing.\n“I took the plunge and went, ‘Yup, this is the sport I want to do,” said Hooker, who had to withdraw from Colby to focus on her Olympic training, but will return to school in the fall. “Let’s just see if I can make it work, and if not, I’ll just get on the plane and get home. I loved every second of it. I loved skiing every day and being part of a ski academy.”\nYoung and Hooker credit Colby Nordic head coach Tracey Cote in seeing the potential in both athletes.\n“I think it was pretty obvious early on that Jack was a talented skier,” Cote said. “He was especially talented in freestyle sprinting. The summer before his junior year really put into his head, ‘I can really be good at this.’ Jack was really incredible at setting goals and doing everything that he could do to beat those goals … I think he’s trying to use these Olympics to gain experience, and his mind is set on 2030 and, probably, a medal. That’s not something that I would put past him at all.\n“From the moment I met Maddie, she loved ski racing and she loved skiing. She has just singularly focused on doing everything she can to get better at skiing. By the time I got her, she had already been at Stratton and around the eastern ski scene. It didn’t seem that weird to me (to recruit her). The more I’m learning about Australia, the cooler I think her story is.”\nAlthough Colby is an NCAA Division III program, it competes against Division I schools like Dartmouth, Vermont and New Hampshire in skiing.\n“Colby has played nearly 100% in getting me here,” Hooker said. “It definitely would not have been possible without Colby and without Tracey. Back home in Australia, we don’t have coaches, we don’t have clubs, we don’t really have ski teams … I always kind of wanted to be in the U.S. for collegiate sports. I was desperate for any college team that would take me. Tracey really only had one season of winter results (to judge me on). I was the fourth and final recruit from my class. I must’ve just been the wild card.”\nYoung said his breakthrough came during his junior year (2023-24) when he tweaked his training regime.\n“I was training hard before then,” Young said. “But I never fully, fully committed, going at it with a leave-no-stone-unturned approach.”\nThat same year, Young joined the World Cup circuit. He opened eyes in his first World Cup race in Canmore, Alberta, where he finished 11th and was the second-fastest American.\nYoung continued to find success throughout the 2024-25 World Cup season, securing three top-20 finishes, including a 12th place in Davos, Switzerland. He was selected to the U.S. ski team in June.\n“That season went really well,” Young said. “That’s when I knew that I could maybe do this professionally. I definitely wasn’t thinking Olympics at that point. It was more, ‘Give this a shot, after college and see where it takes me.’\n“My senior year, things started to go really well. I made the (United States) team for world championships, and because the selection process for the Olympics and the world championships are the exact same, that’s where I realized, ‘Holy (expletive). Not only should the Olympics be a goal of mine, it would almost be a letdown if I didn’t make the team.’ That’s a crazy place to find myself this year with my training.”\nHooker also joined the World Cup circuit and secured one of the final spots on the Australian team for events in Finland and Norway.\nBoth skiers hope this year’s Olympics leads to long-term success.\n“I want to tell myself that it’s just like the World Cup, because it’s the same exact level of competition, it’s the same players,” Young said. “But it’s a bigger stage, that’s all there is to it. People pay attention to cross-country skiing once every four years back in the states … I’ve started so many World Cups at this point, I’m so dialed in, I just hope I do more of the same (at the Olympics) because I know how to succeed.”",
  "word_count": 1007,
  "scraped_at": "2026-02-14T12:38:17.019075"
}