{
  "article_id": "7e23f74333e8",
  "url": "https://bleedingcool.com/tv/lanterns-green-lantern-series-gets-promising-james-gunn-emoji-update/",
  "title": "Lanterns : Green Lantern Series Gets Promising James Gunn Emoji Update",
  "date": "20231115T051500Z",
  "domain": "bleedingcool.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Posted in: Max, Movies, Preview, streaming, TV | Tagged: dc studios, dcu, green lantern, james gunn, lanterns, peter safran, preview\nLanterns: Green Lantern Series Gets Promising James Gunn Emoji Update\nDC Studios' James Gunn had a very brief (okay, it was an emoji) but promising update on how the Green Lantern series Lanterns is looking.\nNormally, when we're covering what DC Studios co-head James Gunn has to say about his & Peter Safran's upcoming slate of DCU programming, it usually revolves around the live-action Superman: Legacy and Creature Commandos. But for this go-around, another film and streaming series gets the spotlight. Earlier, we learned that Ana Nogueira had been tapped to pen the script for Supergirl: Woman of Tomorrow. But little did we know that the news would lead to a very brief yet very promising emoji update from Gunn regarding Lanterns.\nCompared to \"a huge HBO-quality event\" along the lines of \"True Detective,\" the \"Green Lantern\" series is set to focus on Hal Jordan and John Stewart, who investigate a mystery that Safran said \"plays a really big role leading us into the main story that we're telling across our film and television. So this is a very important show for us.\" Thankfully, someone was smart enough to ask Gunn if there was anything new he could say about the series. While not offering any words, Gunn did respond with a flame emoji – which we're taking as a good sign. Granted, now we're curious to know if that's based on any scripts that were seen, maybe some preliminary production designs. But the fact that he had a response and was willing to offer it is a good sign that things are moving on that front, too.\nSet for a Summer 2025 premiere, DC Studios' Superman: Legacy stars (so far) David Corenswet (Hollywood) set as Superman/Clark Kent, Rachel Brosnahan (The Marvelous Mrs. Maisel), Isabela Merced (Sicario: Day of the Soldado) as Hawkgirl, Edi Gathegi (X-Men: First Class) as Mister Terrific, Nathan Fillion (The Rookie) as Green Lantern Guy Gardner, and Anthony Carrigan (Barry) as Metamorpho. The role call for Max's 2024-premiering Creature Commandos includes Frank Grillo set as Rick Flag Sr., with Maria Bakalova as Princess Ilana Rostovic, Indira Varma as The Bride, Zoe Chao as Nina Mazursky, Alan Tudyk as Dr. Phosphorus, David Harbour as Eric Frankenstein, and Sean Gunn as G.I. Robot & Weasel, and Steve Agee returning as John Economos. Here's a rundown of what else was announced series-wise at the beginning of the year:\n\"Waller\": With Peacemaker Season 2 on hold while Gunn works on Superman: Legacy, the Viola Davis-starring series will include the \"Peacemaker team\" and serve as a \"continuation\" of the HBO Max series. The series will be executive produced & penned by Jeremy Carver (Doom Patrol) and DCU writers's room writer Christal Henry.\n\"Paradise Lost\": Set before the birth of Diana (Wonder Woman) and set on the island of Themyscira, Safran & Gunn see the series as a \"Game of Thrones\" -like take on Wonder Woman's origins (\"It's really about the political intrigue behind a society of all women\": Safran). Comic fans may recognize the title from Phil Jimenez & George Pérez's Paradise Island Lost comics series. \"How did that come about? What's the origin of an island of all women? What are the beautiful truths and the ugly truths behind all of that? And what's the scheming like between the different power players in that society?\" were the rhetorical question that Gunn asked when explaining the series' themes.\n\"Booster Gold\": Seen as the DCU's deep dive into comedy, Safran describes Mike Carter/Booster Gold as \"a loser from the future who uses basic future technology to come back to today and pretend to be a superhero.\" From a series perspective, we're looking at a possible 25th-century setting, where Mike is a disgraced former football star who uses a time machine on display in the Metropolis Space Museum to gain fame and fortune… and maybe the desire to be a real superhero (if the sponsorship is right?). \"Basically, \"Booster Gold\" is imposter syndrome as a superhero,\" Gunn added.",
  "word_count": 685,
  "scraped_at": "2026-02-14T13:38:34.901619"
}