{
  "article_id": "7e2b40874f4e",
  "url": "https://highlandcountypress.com/index.php/news/2023-year-review-part-2",
  "title": "2023 : The Year in Review , Part 2 | The Highland County Press",
  "date": "20231231T163000Z",
  "domain": "highlandcountypress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "2023: The Year in Review, Part 2\nHeadliner Creed Fisher performs in concert Saturday, July 8 at the Festival of the Bells in Hillsboro. (HCP Photo/Caitlin Forsha)\nThe Highland County Press is recapping some of the top stories from 2023. The following is Part 2 of the series.\nMay\n• In December 2022, the Hillsboro Police Department received a $55,475.90 Body-Worn Camera Grant from the Ohio Office of Criminal Justice Services. On May 1, the Hillsboro Police Department deployed 10 Axon Body 3 cameras as a result of this grant funding.\n• Winners of the May 2 primary election included Hillsboro Mayor Justin Harsha, Hillsboro Municipal Court Judge William (Chad) Randolph, Hillsboro City Auditor candidate Dawson Barreras and Hillsboro Law Director Randalyn Worley (unopposed). Voters in certain precincts also approved three separate ballot questions and issues: a proposed ordinance for retail electricity aggregation in the City of Hillsboro; a proposed ordinance for retail natural gas aggregation in the Village of Greenfield; and a local liquor option petition for Paint Township Southwest.\n• Kassie Brigner, 27, of Hillsboro woman was sentenced May 3 to 59 months in prison after pleading guilty to aggravated trafficking in drugs, a third-degree felony; one count each of possession of cocaine, aggravated possession of methamphetamine and aggravated possession of a fentanyl-related compound, all fifth-degree felonies; and a forfeiture specification.\n• The Village of Leesburg’s 2020-21 audit, released by the Ohio Auditor’s Office May 4, included two findings of material weakness and one finding for recovery. The finding for recovery, which was repaid under audit, was issued against the village’s former tax administrator, Dorothy Vance, who received a “one-time thank-you bonus of $4,000” that was determined to have been “public monies illegally expended” by the village. Vance repaid the amount in full on Feb. 21.\n• A finding for recovery and four other findings of noncompliance were listed in Highland County’s 2021 audit released by the Ohio Auditor’s Office May 4. The 2021 Highland County audit — completed under the tenure of former auditor Bill Fawley — pointed to a number of problems with the county’s standards. The finding for recovery, which was repaid under audit, was issued against Fawley and Payroll Clerk Melanie Anderson in the amount of $6,015. According to the finding, it was repaid March 1.\n• Robert G. Jackson of Lynchburg man was sentenced May 4 to nine years in prison after pleading guilty to felonious assault and abduction.\n• Robert Ballein, 52, of Mount Gilead was sentenced May 4 to six years in prison after pleading guilty to first- and second-degree felony meth trafficking charges in Highland County.\n• Numerous local FFA members were recognized during the Ohio FFA State Convention, May 4-5.\n• In May 4’s Frontier Athletic Conference softball showdown between the Hillsboro Lady Indians and Jackson Ironladies, Hillsboro won by a 10-0 score at Alice Cassner Field to seal the outright conference championship for a third straight season. Then, on a game that began on May 1 in pouring rain, then ended on May 5, the Lady Indians won over the host McClain Lady Tigers, 16-3. HHS clinched their third straight perfect FAC season with the win, as they are 30-0 in the conference the past three seasons with three consecutive championships.\n• For a second year in a row, the Fairfield Lions won the Division I Southern Hills Athletic Conference baseball championship, clinching the title May 5, with a 10-0 win over North Adams.\n• For a fifth consecutive season, the Whiteoak Wildcats earned the Division II Southern Hills Athletic Conference title, as they defeated the Peebles Indians May 5 by a 16-5 score in five innings.\n• The Fairfield Lady Lions took the field May 5 and earned their 24th Southern Hills Athletic Conference title and seventh consecutive championship with an 11-1 win over North Adams.\n• The Strategic Ohio Council for Higher Education recognized three Southern State Community College individuals — Dr. Joshua Montgomery, Dr. Julianne Krebs and Susan Morris— with 2022-23 SOCHE Excellence Awards for excellence in teaching, service and scholarship, as announced May 8.\n• A jury seated in Highland County Common Pleas Court returned a verdict May 9 convicting Ronald Shepard, 68, of Sardinia man of gross sexual imposition. The trial began Monday morning and continued until approximately 5:40 p.m. After a little more than an hour of deliberations, the jury asked to be dismissed for the evening. They returned Tuesday morning at 8:30 a.m. to continue deliberations, with the verdict read around 9 a.m.\n• After a disagreement in open session two weeks prior, commissioners voted 3-0 May 10 to pass a resolution to authorize funding of the Village of Greenfield Downtown Facade Improvement Program Project with Coronavirus Local Fiscal Recovery funds as established under the American Rescue Plan Act.\n• Six firefighters assigned to the 788th Civil Engineer Squadron on Wright-Patterson Air Force Base, including Capt. Richard Tarr of Hillsboro, received medals for their life-saving efforts in the line of duty during a ceremony at the base’s fire station, May 10. They were awarded the Command Civilian Award for Valor, the second-highest civilian decoration for heroism, for their roles in rescuing an unconscious victim during a March 2022 house fire in Fairborn.\n• Christopher Colvin, 58, of Hillsboro was arrested and charged with felonious assault after an hourslong standoff with local law enforcement May 10 in Allensburg.\n• On May 11, Representative Brad Wenstrup (R-OH) announced that the winner of the 2023 Congressional Art Competition for Ohio's 2nd Congressional District was Maria Giannatacsia Cartaino, a homeschooled student from Hillsboro, with her piece, \"Bucolic.\" Her artwork was to be displayed with all winning entries from congressional districts across the country in the U.S. Capitol for one year.\n• The 2023 Frontier Athletic Conference track and field meet was held May 9 and 11 at Hillsboro High School. Earning FAC championships from Highland County were: Hillsboro, Steven Kibler (high jump), Cameron Smart (300m hurdles), Nick Turner (800-meter run), Jack Wagoner (long jump); Turner, Chris Sowders, Ryan Howland and Tate Davis (4x800-meter relay team) and Jailyn Williams, Ramsey Haines, Brooklyn Minton and Taylor Thoroman (4x800-meter relay); and McClain, Michael Stevenson (discus), Lily Barnes (discus and shot put); Becca Bergstrom (pole vault) and Mylie Lovett (high jump).\n• May 12 was the annual MHS Day, where McClain High School students and staff serve the community through various projects.\n• At Greenfield Exempted Village Schools’ May 15 meeting, it was announced that two of the district’s own were recognized at the annual Hopewell Exceptional Achievement Awards ceremony. Those are Nathan Onusko, recognized as Highland County’s Outstanding Student; and Buckskin Elementary aide Kristie Adams, who received the Exceptional Achievement award.\n• Hillsboro sophomore Camryn Spruell was named the Frontier Athletic Conference Softball Player of the Year, as announced May 15.\n• Much of the May 15 Hillsboro City Schools Board of Education was spent recognizing the district’s students, including through committee reports, a presentation from Hillsboro Elementary student council and honoring the outgoing student board representative, Ethan Kirk.\n• The top of the Southern Hills Athletic Conference Division I softball standings ended in a three-team tie for the conference championship, as on May 15 the Lynchburg-Clay Lady Mustangs wrapped up their ’23 season with a convincing 12-2 win over West Union to earn a share of the title.\n• The regular-season and Southern Hills Athletic Conference finale for the Lynchburg-Clay Mustangs was a “perfect afternoon” for pitcher Cole Wells, as the hurler pitched a perfect game May 15 in a 12-0 win against the West Union Dragons.\n• A Hillsboro man accused of eluding police before eventually hitting the historical bell in front of the Highland House Museum, as well as two other vehicles, last year was sentenced May 17. Joshua L. Arnold, 34, pleaded guilty to failure to comply with the order or signal of a police officer, a third-degree felony, and was sentenced to 18 months in prison.\n• The Ohio Department of Higher Education (ODHE) Chancellor Randy Gardner has named the latest group of Ohio colleges and universities designated as Collegiate Purple Star campuses for their efforts to support students with military backgrounds. Southern State is part of that group, as announced May 18.\n• Bluffton skipper James Grandey was named the Heartland Conference Coach of the Year after guiding the Beavers baseball team to a third-place finish in the HCAC, as announced May 18. Grandey is the son of Jim and Madeleine Grandey of Greenfield.\n• The Highland County Republican Central Committee announced the resignation of Hillsboro City Auditor Patty Day, effective June 2, on May 19.\n• The Hillsboro and McClain track and field teams competed in the Division II Southeast District meet May 16 and 20, where the Lady Tigers earned their first-ever district title. Individual district champions included Brenna Wright (100m hurdles and 300m hurdles), Lily Barnes (discus) and the team of Ryan Butterbaugh, Brenna Wright, Katie Cook and Luca Matesic (4x100m relay).\n• Two Greenfield representatives were recognized at Ohio Northern University’s spring 2023 commencement ceremonies. The Honorable Stephanie Pearce Burke, JD ’94, and formerly of Greenfield, was a commencement speaker at the Pettit College of Law ceremony May 20.\nONU Professor Emeritus Steve Iseman of Greenfield received an honorary doctoral degree.\n• Alexandra Grace Workman of Hillsboro woman was sentenced to seven and a half years in prison, with credit for time served, as the second-to-last defendant sentenced in a 2019 federal drug conspiracy case. During a hearing May 23, U.S. District Judge Douglas Cole sentenced Workman to 90 months in prison, with credit for time served, followed by four years of supervised release. Workman was also ordered to forfeit her “interest” in $4,791 in U.S. currency and $1,053 in U.S. currency (along with other co-defendants); three handguns; two rifles; two pistols; and two shotguns.\n• The University of Oregon Ducks women's basketball added senior guard Peyton Scott, formerly of Lynchburg-Clay High School and Miami University, for the 2023-24 season, head coach Kelly Graves announced May 24.\n• The Highland County Land Reutilization Corporation announced May 25 that Highland County Land Bank Coordinator Mackenzie Edison has resigned, after serving in that role for one year.\n• At the Southern Hills Athletic Conference spring sports banquet May 28, Whiteoak’s Landon Barnett was named the SHAC Baseball Player of the Year; Fairfield’s Kyle Zimmerman earned SHAC Baseball Coach of the Year. Whiteoak’s Landen Eyre was recognized as SHAC Co-Athlete of the Year for Boys Track and Field; Fairfield’s Rosey Bates earned Girls Track and Field Coach of the Year; and Whiteoak’s Kim Roush was named Boys Track and Field Coach of the Year.\n• The former Sunnyside Inn on U.S. 50 in Allensburg was heavily engulfed in flames May 30. The former tavern had been closed for several years.\n• In the semifinals at the NAIA World Series, the historic season for the University of the Cumberlands softball team came to a close with a 3-0 loss to Oregon Tech May 30. Former Fairfield Lady Lions standout and Hillsboro resident Kaiti White made appearances in two World Series games.\n• The Ohio High School Baseball Coaches Association May 31 released its All-Southeast District baseball team, with 24 players and one coach from Highland County earning honors.\nJune\n• Jennifer M. Baker of Hillsboro was sentenced June 1 to a minimum two years in prison after being convicted at trial (in April) of one count of felonious assault. Judge Rocky Coss sentenced Baker to a minimum of two years in the Ohio Reformatory for Women in Marysville. Under the Reagan Tokes Law, the sentence could be as long as three years. The 12-gauge shotgun used during the offense was also ordered to be forfeited.\n• A convoy of semis passed through Hillsboro Friday, June 2 en route to the Lake View Loft on Jones Road in support of a fundraiser for Aralyn Slack, a 10-year-old from Lynchburg who is fighting DIPG, a terminal, aggressive form of brain cancer. The semi truck parade was a scheduled part of the event, which also included music, catered food, raffle items and a silent auction.\n• The Whiteoak Wildcats were unable to extend their tournament run on June 2, with the No. 2 state-ranked Wildcats falling to No. 1-ranked Berlin Hiland, 8-0 in the Division IV Regional Final game at Beavers Field in Lancaster. WHS ended the season as regional runners-up and 27-4 overall.\n• A total of eight Highland County athletes competed at the 2023 OHSAA State Track and Field Championships June 2-3. McClain junior Lily Barnes finished in 17th place in the Division II discus throw event. Fairfield senior Hallie Haines became the first girls runner in program history to race at the state meet, running in the Division III girls 400-meter dash at the 2023 State Track and Field Championships and finishing 15th. The McClain Lady Tigers 4x100-meter relay team — senior Ryan Butterbaugh, sophomore Katie Cook, junior Luca Matesic and sophomore Brenna Wright — finished 17th. Whiteoak sophomore Landen Eyre ran to a ninth-place finish in the Division III 1600-meter run. Hillsboro freshman Jailyn Williams made her state debut in the Division II 800-meter run, finishing 15th.\n• The 20th and final Daryle C. Unger & Peanut Memorial Kids Fishing Derby was held Saturday, June 3 at the Mitchell Park pond in Greenfield and was another huge success. A total of 345 kids attended in three age groups.\n• The legacy of traditional country music carried on, as John Paycheck, the gifted son of country music legend Johnny Paycheck, returned to his father's hometown of Greenfield, Ohio during the Greenfield Music Festival on June 3 as parade grand marshal. The Festival successfully wrapped up after an exciting three-day run from June 2-4. The festival boasted an attendance of over 6,000 people and offered a wide range of attractions, activities and performances, including headliner Whey Jennings.\n• Also in Greenfield on June 3, a commemoration ceremony honoring Greenfield’s C.R. Patterson & Sons, America’s first and only Black-owned and operated automobile company, was held. The event included the dedication of the naming of a roadway and the creation of a downtown mural honoring the Pattersons’ accomplishments.\n• The Village of Lynchburg hosted a rededication ceremony for the Lynchburg Covered Bridge Saturday, June 3 at the bridge, which has been restored.\n• Dawson Barreras was sworn in as acting Hillsboro city auditor June 5, after Hillsboro Mayor Justin Harsha appointed him to the position. On June 8, it was announced that the members of the Highland County Republican Central Committee residing in the City of Hillsboro appointed Barreras to fill the vacancy of the office of auditor.\n• Ronald Shepard of Sardinia, who was convicted at trial of one count of gross sexual imposition in May, was sentenced to five years in prison June 5. In addition, Shepard will be classified as a tier II sex offender, which requires registration every 180 days for 25 years.\n• Daryl Bumgarner Jr. of Greenfield was sentenced June 5 to at least 11 years in prison after pleading guilty to a first-degree felony count of aggravated trafficking in a fentanyl-related compound, along with two forfeiture specifications. Under the Reagan Tokes Law, Bumgarner could serve up to 16.5 years in prison.\n• Highland County Prosecutor Anneka Collins honored Highland County Sheriff’s Office Sergeant Steve Alexander as the Officer of the Quarter in a surprise ceremony June 6. Alexander was recognized for his bravery when he responded to a reported domestic violence incident in February.\n• For a second consecutive offseason, the Fairfield Lady Lions hired a new head basketball coach, as Jennifer Blue was selected to take over the program, as announced June 6.\n• Nicole J. Pierce, 42, of Hillsboro was sentenced June 7 to four years in prison after pleading guilty to felonious assault, a second-degree felony, and assault, a first-degree misdemeanor.\n• On June 9, the Highland Humane Society purchased a new facility located in southern Highland County. The Board of Directors for the Humane Society said they expected renovations on the new facility to take approximately six to nine months.\n• Following a season where the Whiteoak Wildcats reached the Division IV Regional Final game, five of their players earned All-Ohio honors as selected by the Ohio High School Baseball Coaches Association for the 2023 season, as announced June 9: Landon Barnett, Eli Roberts, Nate Price, Luken Roades and Carson Emery.\n• The Board of Directors for the Highland County Chamber of Commerce elected Diana Setty as board chairman for the remainder of 2023 as well as 2024, as reported June 12. Additionally, Eddy Maillot was elected as chairman-elect and Meghan Wagoner as vice chairman.\n• The Ohio Federation of Soil and Water Conservation Districts held their Annual State Envirothon June 12-13 at Defiance College, where the Lynchburg-Clay Gold team of Sam Hamilton, Sydney Hamilton, AbbiGail Manning, Kelsey McPherson and Abigail Shepherd won second overall in the state competition. Their coach was Lara Hamilton.\n• Kris Donley, nurse manager for Adena Greenfield Medical Center’s specialty clinic and wound care, was selected as a nominee for the Ohio Hospital Association’s Albert E. Dyckes Health Care Worker of the Year Award and attended the OHA banquet in Columbus June 12-14.\n• The Supreme Court of Ohio announced June 13 the Highland County Court of Common Pleas, Juvenile and Probate Divisions would receive a technology grant from the Supreme Court of Ohio. Judge Kevin Greer said the $55,578 grant would be used “to upgrade [the Court’s] current system.”\n• J. Boeckmann Excavating, LLC acquired Bean Farm Drainage, after Kevin and Amy Bean operated the business for 41 years, as announced June 14. Kevin Bean will continue to work with the company.\n• Highland County commissioners and the county auditor Alex Butler gave an update on a previous invoice for a solar project’s Payment in Lieu of Taxes (PILOT) during the June 14 commission meeting. The update came almost three months after the invoice for New Market Solar was issued and nearly two months after it had been listed as due for payment by the developers. According to the update, it is now the county’s understanding that the project should be subject to public utilities tax, not the PILOT payments, as the project is still not officially complete.\n• Hillsboro sophomore Camryn Spruell was selected as second-team All-Ohio by the Ohio High School Fastpitch Softball Coaches Association, as announced June 14.\n• After years of being advised by state and county officials that the city’s lodging tax was improper, Hillsboro City Council members voted Thursday, June 15 to rescind both ordinances regarding the tax.\n• Two resolutions related to the planned Roberts Lane extension were approved by Hillsboro City Council June 15, including a resolution authorizing the safety and service director to advertise, solicit bids and enter into a contract with the lowest and best bidder for the development of Roberts Lane as well as a grant agreement for ARPA funding from the Highland County Board of Commissioners.\n• After nearly a year of planning, Hillsboro City Council voted — in a split decision — to approve an ordinance creating a Designated Outdoor Refreshment Area (DORA) in uptown Hillsboro during their Thursday, June 15. The ordinance narrowly passed, by a 4-3 margin.\n• KAMP (Kids and Motivated People) Dovetail held a ribbon cutting with the Highland County Chamber of Commerce, community members and supporters on June 20, to celebrate the completed construction of their new horse barn.\n• Highland County commissioners approved a resolution for a payment in lieu of taxes (PILOT) for Fayette Solar, LLC June 21.\n• Fourth District Court of Appeals Judge Kristy S. Wilkin of Hillsboro served as a first-time assigned judge on the Supreme Court of Ohio, as reported June 26 by Court News Ohio. The Fourth District judge heard a case that brought into question the specifics of a libel lawsuit.\n• Steve Parker, a well-known and much-loved member of the Greenfield community, was posthumously recognized with an award from the Ohio High School Athletic Association. His wife, Mary Jane Parker, daughter Stephanie Lanning and grandchildren Christopher and Riley Lanning were on hand June 26 to accept the OHSAA Sportsmanship, Ethics, and Integrity award during the regular meeting of the Greenfield Exempted Village Schools District Board of Education.\n• At the June 26 Greenfield council meeting, city manager Todd Wilkin reported that the village was recently awarded a $1.471 million grant for “Phase One” water repairs, including hydrants, service line replacements, valve replacements and water main fixes. Additionally, $350,000 of that money is to go toward infrastructure repair on a portion of Fourth Street, a $1.285 million project.\n• Clayton T. Collins, 26, of Hillsboro was sentenced to a minimum of 19 years in prison June 28 after pleading guilty to one count of rape, a first-degree felony; and one count of gross sexual imposition, a third-degree felony. The case was presented to a grand jury by a special prosecutor, Kara Keating of the Ohio Attorney General’s Office. Prosecutor William Walton appeared on behalf of the Ohio AG’s Office for the plea hearing.\n• Former Ohio House Speaker Larry Householder, 64, was sentenced in federal court June 29 to 20 years in prison for leading a racketeering conspiracy to receive nearly $61 million in bribes to pass and uphold a billion-dollar nuclear plant bailout. Former Ohio Republican Party chair Mathew Borges, 51, was sentenced in federal court June 30 to five years in prison for his role in the racketeering conspiracy.\n• The Highland District Hospital Medical Executive Committee changed hands, as announced June 30, after new elections appointed Dr. Anthony Wetherington as Chief of Staff, Dr. Craig McKinney as Vice Chief of Staff, Dr. Steven Battaglia as Chief of Surgery, Dr. David Gunderman as Chief of Medicine and Dr. Poonam Singh as Secretary/Treasurer.\n• A Hillsboro man charged in a 12-count indictment was sentenced to a minimum of 22 years and nine months in prison June 30, after a jury seated in Highland County Common Pleas Court convicted him of all charges. Richard Wayne “Scoots” Johnson, 51, of Hillsboro, was convicted of: engaging in a pattern of corrupt activity, aggravated trafficking in methamphetamine and aggravated possession of methamphetamine, all first-degree felonies; aggravated trafficking in drugs and aggravated possession of drugs, both third-degree felonies; receiving stolen property, a fourth-degree felony; two counts of possession of cocaine and one count each of aggravated possession of methamphetamine and aggravated possession of a fentanyl-related compound, all fifth-degree felonies; receiving stolen property, a first-degree misdemeanor; and a forfeiture specification. It took the jury a little over two hours to deliberate, including their review of all of the items subject to forfeiture.\nJuly\n• The Madison Township trustees contracted with the Greenfield Police Department for law enforcement services July 1-Dec. 31, 2023.\n• Effective July 1, a shift in staffing roles began to better fulfill Southern State’s mission and vision. Dr. Jessica Wise, of Ross County, took over as Interim Dean of Student Affairs. She is currently serving as the Dean of Instructional Operations and Director of Library Services, which will continue. Dr. Peggy Chalker, of Adams County, assumed the role of Campus Director at the Brown County Campus in Mt. Orab as well as retaining her responsibilities as Dean of Articulation and Transfer. Dr. Erika Goodwin, of Clinton County, was promoted to the Vice President of Academic and Student Affairs.\n• Retired Highland County Sheriff’s K-9 Django passed away July 3 after a battle with cancer.\n• Longtime Hillsboro Realtor and community leader Donald E. Fender Jr. passed away July 4 at the age of 85. Mr. Fender owned and operated Donald E. Fender, Inc., Realtors for many years.\n• In their annual All-Ohio list, Prep Baseball Report selected six players from Highland County as 2023 All-Ohio honorees, as reported July 5. From Whiteoak, players selected PBR All-Ohio were Landon Barnett, Luken Roades, Nate Price and Eli Roberts. From Fairfield, players selected were Gabe Fouch and Cade Miller.\n• The 2023 Festival of the Bells was held July 6-8 at Crossroads Park in Hillsboro. The event kicked off July 6 with a packed crowd enjoying the return of the Christian music night to the first day of the festival, as contemporary Christian artist Micah Tyler took the stage. There was a great turnout Friday for Thomas Mac’s country music concert. The 2023 Festival of the Bells concluded with an enthusiastic crowd enjoying a headlining performance by country music artist Creed Fisher, while longtime Festival committee members Rick and Connie Williams were also honored. Previously announced headliner, “The Voice” winner Bryce Leatherwood, was unable to attend due to illness.\n• The Pittsburgh Pirates drafted former Moeller High School and University of Kentucky relief pitcher Austin Strickland of Winchester with the 227th pick in the eighth round of the 2023 Major League Baseball draft, July 9-11.\n• Hillsboro City Council members authorized city administrators to enter a $1.7 million loan agreement for the planned Roberts Lane extension during their July 13 meeting. Also during that meeting, it was noted that a major update has been made, as the property maintenance and restoration committee has been dissolved. In that committee’s place is a newly implemented parks committee, which will be chaired by council member Don Storer. Its agenda will include plans for a potential new parks department and for possible acquisition of the local pool.\n• Edward Wild, 38, of Washington Court House was sentenced July 13 to three years in prison after pleading guilty to a second-degree felony charge of aggravated trafficking in methamphetamine in Highland County.\n• On July 17, Jason Johansen was welcomed by county commissioners in his first day as Highland County Land Bank coordinator.\n• The Highlanders Chapter Sons of the American Revolution was awarded the USS Stark Memorial Award July 17 at the 133rd National Congress held in Orlando, Fla.\n• One week after being indicted on 26 counts, an Allensburg man accused of engaging in a standoff with police pleaded guilty to multiple charges and was sentenced to 10 years in prison. Christopher Todd Colvin, 58, pleaded guilty to multiple counts during a pretrial hearing July 19, including: four counts of assault on a peace officer (fourth-degree felonies); intimidation (third-degree felony); and four counts of pandering sexually oriented matter involving a minor (fourth-degree felonies).\n• In her report to the Greenfield Exempted Village Schools Board of Education July 17, district Superintendent Quincey Gray discussed the district team’s travel to Florida for the annual Visible Learning Conference the previous week, where the team not only got to share the district’s experiences from the last three years of its Visible Learning journey, but also got to be recognized as the first district in the world to receive Visible Learning certification.\n• Highland County commissioners awarded two projects totaling over $1 million each during their July 19 meeting. Commissioners voted 3-0 to approve a resolution awarding the HIG CR 5-C New Market Road reconstruction and resurfacing project in the amount of $1,121,627.20. Commissioners also voted 3-0 to award the new OSU Extension building project in the amount of $1,113,599.\n• Lynchburg-Clay graduate Kalyn Rich was selected to the United Soccer Coaches Association All-America Team for her play on the soccer field and success in the classroom, as announced July 20. Rich, a 2023 LCHS graduate, had a GPA of 3.96.\n• State Rep. Bob Peterson announced July 24 that Southern State Community College will receive a grant to increase security measures on campus. The college will receive more than $142,000 to upgrade entrance and exit door security throughout the campus’ main building.\n• County commissioners met with Highland County Juvenile Court Judge Kevin Greer and Highland County Job & Family Services Director Jeremy Ratcliff July 26 to discuss information and statistics about the Children Services agency.\n• The Friend of 4-H Award winners were recognized at the 4-H Summer Awards Ceremony, as announced July 26. Jeff Duncan, Brian Cummings and Eric Rhoads were this year’s recipients. Also honored during the ceremony were Diane Waits and Nikki Eyre, who reached 40 years of service as 4-H advisers.\n• Christopher Spencer, 29, of Washington Court House, who was already serving prison sentences from two other counties, was sentenced July 27 to another five years in connection with a Highland County burglary case. Highland County Common Pleas Court Judge Rocky Coss sentenced Spencer to a minimum of four years on the burglary charge (maximum of six years, under the Reagan Tokes Law), consecutive to nine months on the grand theft of a motor vehicle charge and six months for receiving stolen property. Those sentences run consecutively to Spencer’s already imposed sentences in Clinton and Warren counties, for a total of 10 years and two months in prison.\n• Longtime Highland County educator, businessman and philanthropist Robert \"Bob\" Allen Hodson passed away Saturday, July 29 at the age of 95.\n• The annual Rumble in the Hills was held at Rocky Fork Lake July 29-30.\n• Daniel Miller, 46, of Greenfield was sentenced to five years in prison after a jury seated in Highland County Common Pleas Court convicted him of a second-degree felony count of felonious assault. Following the trial July 31, it took the jury less than an hour to deliberate and return a guilty verdict.\nAugust\n• Donald Elliott, 31, of Hillsboro man was sentenced to six years in prison Aug. 1 after pleading guilty to two second-degree felony charges of aggravated trafficking in methamphetamine in the vicinity of a juvenile.\n• Ohio Governor Mike DeWine announced Aug. 2 that thousands of first responders across Ohio will receive incentives from the state in recognition of their dedication to public safety and their ongoing commitment to public service. Area agencies receiving funding included Highland County North Joint Fire and Ambulance District, $18,308.16, for six first responders; and Paint Creek Joint EMS and Fire District, $78,325.58, for 22 first responders.\n• One week after meeting to discuss continued increases in Children Services cases, Highland County commissioners voted Aug. 2 to approve a tax levy replacement issue for the agency to be placed on the Nov. 7 ballot.\n• On Aug. 4, Kenneth D. Davis of Leesburg was inducted into the Ohio Agricultural Hall of Fame, an esteemed recognition of their contributions to the agricultural industry.\n• The Area Agency on Aging District 7 (AAA7) “Porch Talk” program received a 2023 Aging Achievement Award from USAging, one of the highest honors presented by USAging to its members, as announced Aug. 4. Porch Talk, which is a telephone reassurance/friendly chat service, was among 50 local aging programs to receive honors during USAging’s 48th Annual Conference and Tradeshow, held recently in Salt Lake City, Utah.\n• Jurors heard opening statements and testimony from the state’s first three witnesses Monday, Aug. 7 in the reckless homicide trial of former Highland County deputy sheriff Jonathan Dustin Malone. Malone took the stand in his own defense Tuesday afternoon, as jurors heard testimony from multiple witnesses throughout the second day of the trial. After two full days at trial and hearing testimony from a final witness Wednesday morning, it took a jury of seven women and five men just under an hour to reach a verdict of not guilty on the afternoon of Aug. 9.\n• Despite strong support in Highland County and the surrounding area, Issue 1 — proposed to raise the majority threshold for constitutional amendments — failed statewide in a special election Aug. 8.\n• Matthew Gossett of the Lynchburg-Clay FFA chapter was named a national finalist for the Fiber and Oil Crop Production Agricultural Proficiency Award, as reported Aug. 10.\n• Donald Lee Hill, 46, of Hillsboro was sentenced to six and a half years in prison Aug. 11 after pleading guilty to two counts of sexual battery, both third-degree felonies.\n• Local radio broadcaster and entertainer Herb Day, along with Greenfield native and recording artist Ralph May were inducted into the Ohio Country Music Hall of Fame Aug. 12 at the Keepin’ It Country Farm near Waynesville.\n• At the Aug. 14 Greenfield Exempted Village School District Board of Education meeting, four students were recognized for achieving perfect scores on state tests in Laura Barber, Lucas Banks, Addison Allen and Porter Roe.\n• Robert Keith Taylor of Hillsboro man was sentenced Aug. 15 to life in prison without parole. After approximately two hours of deliberations, a jury found Taylor guilty of three first-degree felony charges of rape, with an additional finding of guilty for each charge stipulating that the victim was under 10 years of age at the time of the commission of the offense. Highland County Common Pleas Court Judge Rocky Coss proceeded to sentence Taylor to life in prison without parole Tuesday night.\n• A resident’s suggestion earlier this year to convert Johnson Street in Hillsboro to a one-way street was met with criticism Aug. 17, with Hillsboro City Council members conducting a public hearing before hearing the first reading of an ordinance for the potential change. With the meeting also falling roughly halfway through the public comment period for the city’s proposed pedestrian safety project, the citizens’ comments portion of the meeting included backlash from property owners concerned about the projected loss of 15 parking spots in the uptown district.\n• Following a second appeal attempt by James Carver of New Vienna, who was found guilty of murder and rape after a jury trial in Highland County in 2019, the Fourth District Court of Appeals affirmed the judgment in his direct appeal in a new judgment entry dated Aug. 7 and posted Aug. 15.\n• The Highland County Historical Society inducted six honorees into its Hall of Fame Aug. 20: Albert “Uncle Al” Lewis and Wanda Lou “Captain Windy” Lewis, Ted and Eileen Salter, Admiral John Jennings Ballentine and Maynard Roberts Surber.\n• During the Hillsboro City Schools board’s Aug. 21 meeting, it was announced the Summer Food Program — the HCS Tomahawk and Juice Box — served over 100,000 meals to children under 18 in the Hillsboro area between May 30 and Aug. 4. The previous summer, the district provided 27,228 free meals; this year, it was 110,082.\n• Bill Roller, an art teacher at Greenfield Elementary, presented the Greenfield council with new signs of native son Gen. John E. Hull during the Aug. 21 council meeting.\n• Doug Daniels, Commander of the Ohio Peace Officer Training Academy at Southern State Community College as well as a Special Deputy with the Highland County Sheriff's Office, recently presented at the National Sheriffs’ Association (NSA) Annual Conference in Grand Rapids, Mich., as reported Aug. 22.\n• Gary Lee Pettiford of Greenfield was sentenced Aug. 21 to 20 years to life in prison. Following a trial that lasted under three hours, it took the jury seated in Highland County Common Pleas Court half an hour to find Pettiford guilty of two counts of rape, both first-degree felonies.\n• Hope Rowland, 25, of Greenfield, who was indicted on first-degree felony drug charges, was sentenced to four years in prison Aug. 23 after pleading guilty to lower-level charges. Rowland pleaded guilty to an amended count of aggravated trafficking in a fentanyl-related compound, lowered from a first-degree to a third-degree felony; illegal conveyance of drugs of abuse onto the grounds of a specified governmental facility, a third-degree felony; and the forfeiture specification. Subject to forfeiture were a 2017 Chevrolet Cruz, for “its instrumentality in the commission or facilitation fo the offense,” as well as $5,823.\n• Highland County commissioners received an update on the planned Revolutionary War memorial at the Highland County Courthouse Aug. 23.\n• The Highland County Agricultural Society held a dedication and ribbon cutting ceremony to celebrate the new Highland District Hospital Livestock Building with the Highland County Chamber of Commerce and members of the community on Aug. 26.\n• Ohio Governor Mike DeWine Aug. 28 announced the award of $90 million in American Rescue Plan Act funds aimed at strengthening mental health and addiction crisis services statewide. The Paint Valley ADAMH Board was awarded $7,962,700 to help strengthen local services for residents facing a mental health or substance use crisis.\n• At the Volunteer Services Committee meeting held at the Ohio Veterans Home (OVH) in Georgetown on Aug. 28, Hannah Hopper, OVH Volunteer Services Coordinator, presented Gerold (Buzzard) Wilkin of Hillsboro with the Outstanding Volunteer Service Medal and Certificate.\n• After more than a year of planning and discussions, Highland County commissioners voted Aug. 30 to award the new county records storage building project to the low bidder, Alpha Construction Inc., who had submitted a $2,797,000 proposal.",
  "word_count": 6109,
  "scraped_at": "2026-02-14T12:17:38.621038"
}