{
  "article_id": "7e48b69f80d4",
  "url": "https://www.sail-world.com/news/285331/Americas-Cup-Hall-of-Fame-announces-new-inductees",
  "title": "The America Cup Hall of Fame to induct James Spithill , Paul Cayard , and Susan Henn",
  "date": "20250417T161500Z",
  "domain": "sail-world.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The America's Cup Hall of Fame to induct James Spithill, Paul Cayard, and Susan Henn\nby Herreshoff Marine Museum 17 Apr 2025 23:20 HKT October 16, 2025The Herreshoff Marine Museum/America's Cup Hall of Fame welcomes James Spithill, Paul Cayard, and Susan Henn as Class of 2025 inductees of the America's Cup Hall of Fame. They will be honored on October 16th, 2025 at the America's Cup Hall of Fame Induction gala in the Model Room of the New York Yacht Club.\n\"The Class of 2025 includes two of the most accomplished and well-known sailors of the 21st Century, and the first woman who competed for the Cup,\" said America's Cup Hall of Fame Selection Committee Chair Steven Tsuchiya. \"We look forward to celebrating their accomplishments in October!\"\nThe America's Cup Hall of Fame has inducted over one hundred individuals since its founding in 1992. Candidates eligible for consideration include sailing team members, designers, builders, syndicate leaders, supporters, chroniclers, and other individuals of merit. Each nominee is judged on the basis of outstanding ability, international recognition, character, performance, and contributions to the America's Cup. The members of the Selection Committee are intimate with the history and traditions of America's Cup and are committed to maintaining the integrity of the Hall of Fame.\n\"What a triumvirate the Selection Committee has given us,\" said America's Cup Hall of Fame President & Executive Director Bill Lynn. \"Susan Henn is a fascinating character and an amazingly accomplished sailor, while Paul and Jimmy have been standing on the threshold of the Hall of Fame for years with never a doubt that they would both end up here. The story about the Henns' \"menagerie\" on board GALATEA will be worth hearing at the induction!\"\nAmerica's Cup Hall of Fame Inductees, Class of 2025\nJames \"Jimmy\" Spithill (AUS) (b. 1979)\nIn 2000, Australian James \"Jimmy\" Spithill cemented his place in the annals of the America's Cup When, at just 20 years old, he became the competition's youngest helmsman. In 2013, he accomplished something even more extraordinary, winning the 34th Match from a -2 starting deficit to a 9-8 victory. The Wall Street Journal described ORACLE Team USA's astonishing against-the-odds triumph over Emirates Team New Zealand as one of the most remarkable comebacks in any sport.\nJimmy Spithill epitomizes what it means to be an Aussie battler, a person who goes against the grain to succeed, demonstrating perseverance to overcome disadvantage.\nBorn on June 18, 1979 in Sydney, one of Spithill's earliest memories is the jubilation that swept across his home country when AUSTRALIA II won the 1983 America's Cup, especially in the Pittwater area where crew member Colin Beashel lived.\nSpithill's family had moved north from Sydney to the Pittwater area and lived on Scotland Island. \"I had to go to school by boat. To get to the mainland we went by boat. It was just a way of life.\" His first boat was someone else's throwaway, recovered from a dump and made ready for racing. In 1989, Jimmy won the first race he ever entered, with his sister, but the path to his 2000 America's Cup debut took an unconventional course.\nHe led his team to win the Australian High School Sailing Championship in 1997. However, unlike many of his peers who graduated through successive dinghy classes to national or Olympic squads, Jimmy switched to match racing in heavy keelboats through a youth scheme at the Royal Prince Alfred YC. This program identified talent regardless of background or identity.\nKeeping a beady eye on Spithill's progress was one of Australia's greatest ocean racers and previous America's Cup challenger, Syd Fischer. He invited Spithill aboard his 50-footer RAGAMUFFIN in 1998 for a third-boat-to-finish in the storm-ravaged Sydney-Hobart Race. Jimmy placed 6th in his first Grade 1 Match Race Tour event the following year and became Fischer's pick for the skipper of Young Australia for the 2000 America's Cup in San Diego.\nA defining moment in James Spithill's career, it also marked a significant chapter in the history of the America's Cup. At just 20 years old, he became its youngest-ever helmsman. Young Australia was characterized by a limited budget, ambitious dreams, and the tremendous opportunity that Syd Fischer provided to his team of eager and aspiring youngsters.\nJimmy Spithill was far from alone in having his America's Cup career launched by Fisher's 2000 campaign. However, few maximized their opportunities as much as Spithill, who was consistently sought by top teams throughout his subsequent career. He was involved with the American OneWorld and ORACLE Team USA teams and Luna Rossa from Italy. He won the 33rd and 34th Matches as challenger and defender, representing San Francisco's Golden Gate YC against Alinghi (Switzerland) in 2010 and Emirates Team New Zealand in 2013.\nIn these two matches, Jimmy Spithill made two further indelible impressions on the history of the America's Cup. By helming the 113ft (34m) trimaran USA 17 in the 2010 match, he expanded his skillset beyond slow, heavy displacement monohulls to master high-apparent windspeed sailing on a giant multihull. USA 17 featured the tallest single-span wing ever built at 223ft (68m), double the size of a Boeing 747 or Airbus 380. This transformed America's Cup yachts into the most advanced racing boats in the world, achieving previously unseen speeds with foiling hulls.\nIn the 2013 Match, the New Zealanders were the first to perfect tacking and gybing while still foiling. ORACLE Team USA started with a -2 score after the International Jury penalized the team for an earlier rules breach in another class. The Kiwis quickly advanced to match point with an 8-to-1 lead, poised to win the trophy. \"It's a long way from being over,\" declared Spithill about the belief-defying odds before his crew staged their remarkable comeback to win 9-8. He reflected, \"That's the great thing about sport and in life, that, you know, if it's not over, if they haven't handed the trophy over, you still have a shot.\"\nAfter the 2024 America's Cup in Barcelona, where he co-skippered the Italian Luna Rossa Prada Pirelli team, Spithill brought 25 years of helming to a close. This period spanned the most remarkable transformation of America's Cup boats, from the conventional ACC 80-ft monohulls in 2000, 2003, and 2007 to the astonishing and extreme USA 17 trimaran in 2010, and the foiling wing sail AC72 and AC50 catamarans in 2013 and 2017, right up to the foiling AC75 monohulls in 2021 and 2024. Throughout, Spithill burnished his reputation for being about the toughest opponent his peers could ever meet. \"I'm not an aggressive person, but obviously on the sporting field, I'll do whatever it takes. I just love sport. I love competing. I'm obsessed by it, to be honest.\"\nPaul Cayard (USA) (b. 1959)\nPaul Cayard began his sailing career by winning in a tiny El Toro dinghy at the age of eight. Years later, he remarked, \"As an eight-year-old, sailing just bit me. I really liked it. As a kid you're always doing what your parents tell you. But when I was on my boat, I was the captain of my ship. I was in charge of my own destiny.\"\nOne word that defines Cayard's remarkable career is \"versatile.\" He has won seven World Championships and the Whitbread Round the World Race, competed in seven America's Cup campaigns, and is a two-time Olympian. Beyond all this racing experience, he became one of the most effective communicators of the joys and challenges of grand prix yacht racing.\nRounding out those accomplishments are some notable complementary skills. Due to his European family roots, Cayard is fluent in English, French, and Italian; he is a licensed pilot and has demonstrated effectiveness as a marketer and manager. He learned about business practices from many of the titans of industry with whom he raced over the years. In the process, Cayard became a strong leader and a vital asset in running an America's Cup campaign.\nCayard was first recruited for the Cup by the late Tom Blackaller to serve as a sail trimmer aboard the 12-Meter DEFENDER in 1983. The boat had below-average speed and was eliminated early from the defense trials. Despite this disappointing showing, Cayard was smitten and jumped at the opportunity to try again. His next campaign would be as tactician for Blackaller in the 1987 America's Cup in Fremantle, Australia. Their innovative boat featured a forward canard rudder, a bulbous keel, and a traditional rudder at the stern. At times, they demonstrated remarkable speed, advancing to the semi-final round. After two America's Cups serving as crew for Blackaller, Cayard realized it was time to branch out on his own.\nIn 1988, Cayard won the International Star Class World Championship in Buenos Aires, Argentina. With his Star Class victory, he gained considerable international notoriety. Business mogul Raul Gardini recruited Cayard to skipper his maxi yacht, IL MORO DI VENEZIA. In 1988, they won the Maxi Yacht World Championship. Cayard encouraged Gardini to challenge for the next America's Cup in 1992. For Cayard, it meant joining an Italian team. He spoke Italian and felt right at home with the crew. Gardini and Cayard won the Louis Vuitton Cup Challenger Trials but lost to AMERICA3 in the America's Cup final, 4-1.\nIn 1995, he served as helmsman for Dennis Conner's America's Cup defense effort. They reached the Cup final again but lost 5-0 to New Zealand. The American boat was outmatched by a faster boat and perhaps a more polished crew. The Royal New Zealand Yacht Squadron scheduled the next match for 2000.\nIt was a long wait, and Cayard filled the time with a remarkable victory. He was a noted small boat champion and a match racing specialist. Shifting gears, he was recruited to compete in the Whitbread Round the World Race. Although Cayard had done some long-distance racing, he had never faced anything as compelling or exhausting as the Whitbread. Cayard also found another opportunity to maximize his exposure. The Whitbread organizers allowed the sailors to communicate with fans during the long ocean legs, a practice that had never occurred in ocean racing up to that point. Cayard excelled at writing articulate accounts of facing squalls while racing around the Southern Ocean or drifting endlessly while crossing the doldrums near the equator. EF LANGUAGE went on to win the Whitbread, and Cayard was recognized as a small boat sailor who had mastered long-distance racing.\nWith the momentum and confidence gained from winning the Whitbread, Cayard launched a campaign for the 2000 America's Cup in New Zealand. This time, Cayard challenged on behalf of his home club, the St. Francis Yacht Club. His team, AmericaOne, reached the Louis Vuitton Cup final against the Prada Challenge from Italy.\nIn the best-of-nine series for the Louis Vuitton Cup, with the score tied at 4-4, the final race was quite a show for everyone, with the lead changing hands multiple times during the race. Cayard came up short, losing the 18.5-mile, six-leg race by 47 seconds. For many, such a tough defeat might spell the end of the line, but Cayard had greater ambitions.\nAfter all his Grand Prix racing, he took up a new venture as a leader committed to giving back to the sport. Cayard served as board chair of the St. Francis Yacht Club, from 2018 to 2020. In 2024, Cayard was the President of the International Star Class Association. In September of that year, Cayard won three of six races in the Star World Championship sailed off San Diego against 64 boats, and finished in an impressive fourth place. At that time, Cayard was 65 years old.\nWith a lifetime of experience, Paul Cayard understands what it takes to prevail at the highest levels of sailing. \"Sailing, like all sports, is extremely competitive and there are a lot of young, hungry sailors who would love to be sailing in the America's Cup or the Olympic Games,\" he said. \"It takes nothing short of total dedication. Boats are much more athletic now. I've always considered myself athletic. It was bred in me, not from sailing, but from playing football and basketball in high school, and I've always stayed in great shape. Where sailing is right now, if you are young and you want to be at the top of this game, you might as well adopt the 100-meter sprinter's training regime.\" Paul Cayard is the epitome of what a top athlete is all about. It's a proven formula: keep reaching high, learn from your mistakes, and move on to the next adventure.\nSusan Henn (SCO) (1853-1911)\nSusan Matilda Cunninghame-Graham Henn is celebrated as the first woman to compete in the America's Cup. Henn sailed on the 102-ft (31m) steel cutter, GALATEA, which she also commissioned, financed, and commanded during part of the 1886 match against General Charles J. Paine's MAYFLOWER.\nBorn in Rothesay on the Isle of Bute, Scotland, Susan was the daughter of Susan Jane Cunninghame-Graham, from an aristocratic Scottish family, and Robert Bartholomew, a scion of a wealthy cotton family from Glasgow. She grew up in a family of sailors who raced their yachts in the Firth of Clyde, where she developed her sailing skills.\nIn 1877, while sailing in the Mediterranean with her younger brother Robert, Susan met and married Lt. William Henn RN from County Clare, Ireland, a retired Royal Navy officer who was then racing and cruising his yacht. Their union set her on a course for a permanent life at sea, likely giving Susan more sea time experience than perhaps any other America's Cup sailor.\nFollowing her brother's death, Susan used a significant inheritance to commission yacht designer J. Beavor-Webb to design GALATEA, the first all-steel yacht to challenge for the America's Cup. GALATEA was originally intended to compete in 1885 in a double Cup match alongside Sir Richard Sutton's GENESTA. However, delays in GALATEA's construction affecting her keel caused her to challenge the following year in 1886, facing MAYFLOWER, a design one generation newer than GALATEA. GALATEA's design, like that of GENESTA, reflected the leading British yacht technology of the time, favoring cutters with long, deep, narrow hulls and a trans-Atlantic reputation for speed.\nInstead of taking a faster and far more comfortable journey by steamship, Susan sailed on GALATEA across the Atlantic for the match. Although they lost both races in the Cup match, Susan demonstrated exceptional skill when she took charge of the yacht after her husband's health declined during the competition, and he became incapacitated. This made her not only the first woman to compete in but also the first woman to command a yacht in an America's Cup match. She earned respect in New York, with reports highlighting her enthusiasm and capabilities: \"Owning to severe indisposition, Lt. Henn was to take hardly any part in the contests, but Mrs Henn engaged in the events with all the enthusiasm and skill of a masterful helmswoman.\"\nHer achievements were particularly groundbreaking, considering the social and legal restrictions placed on married women in Victorian society. They often faced barriers to joining yacht clubs and participating in the sport, despite some being skilled and experienced sailors.\nAfter their America's Cup match, Susan and Lt. Henn explored American waters, awaiting a new Cup challenge from their Clyde-based friends and colleagues with their new G.L. Watson-designed THISTLE during the following season. They later returned to British and Mediterranean waters to continue cruising and occasionally racing in GALATEA. Susan remained aboard the yacht after Lt. Henn's death in 1894 until her own passing in 1911. Without children, she left her estate to her cousin, the notable Scots adventurer, author, and politician Robert Bontine Cunninghame-Graham.\nSusan Henn is buried in her birthplace of Rothesay, Scotland, and is honored by the America's Cup Hall of Fame as a pioneering and inspiring figure in sailing and an important part of the America's Cup's storied history.\nAmerica's Cup Hall of Fame Selection Committee\n- R. Steven Tsuchiya, Chairman\n- Margherita Bottini\n- John S. Burnham\n- Brad Butterworth\n- William Collier\n- Richard Gladwell\n- Jack Griffin\n- Halsey C. Herreshoff\n- Tim Jeffery\n- Gary Jobson\n- Andrew Johns\n- Murray Jones\n- William H. Dyer Jones\n- John Lammerts van Bueren\n- Ken McAlpine\n- Elizabeth E. Meyer\n- Shirley Robertson\n- Blue Robinson\n- Hamish Ross\n- Mike Toppa\n- Bruno Troublé\n- Tom Whidden\nRelated Articles\nNew inductees in the America's Cup Hall of FameJames Spithill, Paul Cayard and Susan Henn inducted In the New York Yacht Club's iconic Model Room, the Herreshoff Marine Museum/America's Cup Hall of Fame welcomed James Spithill, Paul Cayard, and Susan Henn as Class of 2025 inductees of the America's Cup Hall of Fame on October 16th, 2025. Posted on 28 Oct 2025 The America's Cup Hall of Fame new inductees\nJosh Belsky, Bob Fisher, Kevin Shoebridge and Juan Vila honored Four new inductees joined the America's Cup Hall of Fame in a ceremony held at Barcelona's historic Museu Marítim during the 37th Match for the America's Cup. Posted on 17 Oct 2024 Sir Richard F. Sutton Medal to be awarded\nVincenzo Ricci and Louis Vuitton will be honored this October The Herreshoff Marine Museum / America's Cup Hall of Fame will award the Sir Richard Francis Sutton Medal to Cino Ricci (b.1934) and Louis Vuitton (founded 1854). Posted on 18 Jul 2024 America's Cup Hall of Fame announces new inductees\nJosh Belsky, Bob Fisher, Kevin Shoebridge and Juan Vila to be honored The Herreshoff Marine Museum / America's Cup Hall of Fame welcomes Josh Belsky, Bob Fisher, Kevin Shoebridge and Juan Vila as Class of 2024 inductees of the America's Cup Hall of Fame. Posted on 16 Apr 2024 ACHof: Induction of Peter Montgomery and Ed Baird\nAmerica's Cup Hall of Fame: Induction of Peter Montgomery and Ed Baird On March 19, 2021, just a couple of days after the Emirates Team New Zealand successfully defended the America's Cup, the America's Cup Hall of Fame held an Induction Ceremony to welcome broadcaster PJ Montgomery and America's Cup winner Ed Baird Posted on 22 Apr 2021 2021 America's Cup Hall of Fame induction\nTo be held at the Royal New Zealand Yacht Squadron on 19th March The Herreshoff Marine Museum / America's Cup Hall of Fame is happy to announce that the 2021 America's Cup Hall of Fame Induction Ceremony will be held at the Royal New Zealand Yacht Squadron on March 19th. Posted on 10 Mar 2021 2020 America's Cup HoF induction set for Thursday\nVirtual America's Cup Hall of Fame Induction on Thursday via Zoom buy tickets here The Herreshoff Marine Museum / America's Cup Hall of Fame advises that 2020 America's Cup Hall of Fame Induction Ceremony will be held via Zoom videoconference this Thursday October 29th Posted on 27 Oct 2020 2020 America's Cup HoF induction set for Oct 29th\nVia Zoom videoconference and emceed by Gary Jobson The Herreshoff Marine Museum / America's Cup Hall of Fame is pleased to announce that the 2020 America's Cup Hall of Fame Induction Ceremony will be held via Zoom videoconference on October 29th. Posted on 8 Oct 2020 Montgomery & Baird for America's Cup Hall of Fame\nPeter Montgomery and Ed Baird will be inducted into the America's Cup Hall of Fame in March 2021 The Herreshoff Marine Museum / America's Cup Hall of Fame welcomes Peter Montgomery and Ed Baird to the America's Cup Hall of Fame as inductees for the Class of 2021. Posted on 6 Aug 2020 America's Cup Hall of Fame announces new inductees\nmerica's Cup Hall of Fame inducts Franklin Osgood, Bryan Willis, and Rolf Vrolijk The Herreshoff Marine Museum / America's Cup Hall of Fame welcomes Franklin Osgood, Bryan Willis, and Rolf Vrolijk, to the America's Cup Hall of Fame as the inductees of the Class of 2020. Posted on 10 Mar 2020",
  "word_count": 3310,
  "scraped_at": "2026-02-14T12:53:47.555958"
}