{
  "article_id": "7e4c93138906",
  "url": "https://www.aol.com/news/k-state-q-big-12-152458419.html",
  "title": "K - State Q & A : Big 12 football over / under win predictions , basketball transfers and more",
  "date": "20230512T164500Z",
  "domain": "aol.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "K-State Q&A: Big 12 football over/under win predictions, basketball transfers and more\nA few different sports books have released over/under win totals for the upcoming college football season.\nThat is excellent news for anyone who is struggling to set preseason expectations for their teams. It is also great news for me, because I get to start off my weekly mailbag by sharing some thoughts on them.\nHere’s how I would bet every Big 12 team several months ahead of the season.\nBaylor (7.5): Under. A nonconference game against Utah in Week 2 may decide how this goes. Win that game, and the Bears are looking like an over team. Lose and it’s hard to see eight wins.\nBYU (5.5): Over. Transition seasons have rarely gone well for teams moving up a conference level, but the Cougars are used to a brutal schedule. I think they can reach a bowl.\nCincinnati (5): Under. This one is really hard. It probably all depends on how Cincinnati plays against its old American rivals.\nHouston (4.5): Over. Dana Holgorsen has spent decades in the Big 12. I trust him to find a way to win five games next season.\nIowa State (5.5): Under. It could be another long season in Ames. The Big 12 did the Cyclones no favors with their schedule.\nKansas (6.5): Under. Vegas was giving away free money last season when it set the Jayhawks at 2.5 before the season. Is this too much of an over correction? Probably. KU will need to be just about perfect in toss-up games against Illinois, BYU, UCF, Oklahoma State and Iowa State for an over to be in play.\nK-State (8.5): Under. Throw tomatoes at me if you must, but nine wins seems a bit much for a team that just lost four NFL Draft picks. That being said, this number seems spot on. If the Wildcats can beat Troy, Missouri and Oklahoma State in the first half of the season they probably go over. Lose any of those games and 8-4 is the most likely record.\nOklahoma (9.5): Over. I really hate to do this. The Sooners were a BAD team last season and I won’t be surprised if they go 6-6 again. But have you looked at their schedule? It’s softer than a pile of pillows.\nOklahoma State (6.5): Under. The Cowboys were spiraling the drain at the end of last season. Then they lost all their best players to the portal. This seems like one of the best bets on the board.\nTCU (7.5): Over. No offense to Max Duggan, but I don’t think he will be that hard to replace.\nTexas (9.5): Under. It is un-American to bet on this over, especially when the Longhorns have to play at Alabama.\nTexas Tech (7.5): Over. Best bet on the board for me. I think the Red Raiders make it to the Big 12 championship game.\nUCF (6.5): Under. Six wins seem more likely than five.\nWest Virginia (4.5): Under. If the Mountaineers start 1-2 like I think they will, this bet could cash early on.\nIt’s time for another K-State Q&A.\nE-MAIL QUESTION: How is it that Kansas State has only landed ONE freaking player out of the transfer portal since the season ended. After the amazing season that Jerome Tang just had, why aren’t transfers crawling on glass to play for the Wildcats? - Alison T.\nLet me start by saying there are undoubtedly lots of transfers out there who want to play for Jerome Tang and Kansas State.\nIf Tang wanted to, he could have picked the top three transfers who expressed interest in the Wildcats and been done recruiting for the cycle in late April.\nBut that’s not his style.\nTang is smart enough to understand that the first wave of players in the transfer portal tends to feature a lot of players who were “run off” by their previous coach. He is more interested in the players who decided to leave on their own and will be ideal fits for the K-State locker room.\nNorth Texas transfer Tylor Perry is exactly the type of player he was looking for.\n“He has been a winner everywhere he has been,” Tang told me earlier this week. “He went to the national championship semifinals in junior college, he won conference championships at North Texas and (an) NIT championship. He will do whatever it takes to win.\n“He hit my criteria exactly. When the season was over, I said that we were going to find two guards that have played 90-plus games of college basketball and could come in and really help us. Now we will go find another one to pair with him.”\nKeep an eye on Toledo transfer RayJ Dennis as another guard candidate.\nTang said he is also prioritizing a transfer forward who is versatile enough to play both offense and defense at a high level. You can tell he didn’t like constantly flip-flopping between Ismael Massoud for his shooting and Abayomi Iyiola for his defense.\nIn any case, the longer a coach waits, the higher quality of player can present himself in the portal. Dozens of players are going to withdraw from the NBA Draft later this month and start looking at transfer destinations.\nOne of them might be Julian Phillips, a former five-star recruit who played for Tennessee last season. K-State has some recruiting history with him and will undoubtedly be involved with him if he returns to school.\nHe would not be an option if the Wildcats had already filled their spots.\nGrad transfers are also allowed to enter the transfer portal whenever they feel like it. So they are worth waiting on.\nTang signed Keyontae Johnson and Desi Sills super late in the process last summer. He knows how to play the waiting game.\nIs there an athletic program on campus that has not had a significant building/infrastructure project in the past 4-7 years? Where does that compare with other Big 12 schools.\n— Eric Wimmer (@ewim55) May 11, 2023\nIn terms of facilities, pretty much every team on campus has received a major upgrade within the past decade.\nMen’s basketball: Practice facility and upgrades to Bramlage Coliseum.\nWomen’s basketball: Same as above.\nFootball: New indoor practice facility, new strength and conditioning center and major upgrades at Bill Snyder Family Stadium.\nRowing: New training complex.\nSoccer: New stadium.\nBaseball: Major stadium enhancements.\nTennis: New courts.\nVolleyball: New arena.\nTrack & Field: New practice center.\nI hope that covers everything. Sorry if I omitted anything.\nThat is comparable to what you see elsewhere in the Big 12. Every athletic apartment is constantly looking at ways to improve facilities. Kansas built a first-class dorm for its basketball team. Texas Tech has the nicest basketball practice facility in the world. Texas just opened a new basketball arena and Baylor will do the same next year.\nIt’s impressive that K-State has been able to raise enough money to have some type of construction always going on. But we are also entering a new world of college athletics in which facilities matter much less than they used to. With the rise of NIL, I think donors would be wise to funnel their money toward student-athletes rather than to facility projects.\nWhen was the last time you heard a recruit or transfer commit to a team because they have state-of-the-art facilities? When was the last time you saw the Big Ten or SEC poach a school from another conference because it had an awesome stadium?\nOne of the biggest misnomers in college athletics is that facilities are of the utmost importance. They aren’t meaningless, because a football team would struggle to recruit if it didn’t have any kind of weight room. I just don’t think having an opulent weight room is really all that much of an advantage.\nBut I digress ...\nK-State is ahead of the game in terms of facilities. And that is a good thing as the world turns its focus toward things like NIL.\nWhat comes first? https://t.co/Ri4q9y7zHI uniforms. 2. Different sponsorship than Nike. 3. New child in the Robinett household??\n— bfullingt (@bfullingt1) May 11, 2023\nI’m going with new uniforms.\nThe K-State football team has been slow to order new threads from Nike because the people over there are a superstitious bunch, and the Wildcats have lost every time they modified their look under Chris Klieman.\nBetter to win in the classic Bill Snyder uniforms than to lose in flashy new uniforms.\nBut I think that will change in the next season or two. Lavender has been a cash cow for the men’s basketball team. Fans love it. Everyone wants more of it. Seems silly to not try and tap into something similar with the football team.\nI don’t think K-State will leave Nike.\nAnother apparel provider would have to step in and offer a much better deal, and I’m just not sure Adidas, Under Armour, Puma, New Balance or Russel Athletic are going to pounce.\nThese aren’t exactly boom times for apparel companies and colleges. Under Armour seems to be cutting way back in that area.\nThe only new “child” that could enter the Robinett house hold is a pet. And we already have a dog. So that seems the least likely of all.\nE-MAIL QUESTION: I read a report that the Big 12 might look into changing its name if it expands and brings in any of the Four Corner schools from the Pac-12. Question for your next Q&A ... What’s the perfect new name? - Jeff M.\nThe Kellis Conference ... Duh!\nOK, so that might not fly with all (or any) of the schools across the conference. But I would vote for it.\nThe key to a good conference name isn’t what you might think. You want something boring and easily recognizable. The Big Ten, the ACC, the SEC. People get in trouble when they try to call things Legends and Leaders.\nYou’re looking for the least objectionable name and nothing more.\nConference-USA is just about perfect. Too bad that’s already taken.\nDepending on what future Big 12 expansion looks like, you could re-brand as the Big 14, 15 or 16. Problem is, that number might not always match the conference’s membership. We have already learned that the hard way.\nGeographical names are probably out, because you could have teams in San Diego and Orlando.\nBut something like the National Conference or the Nationwide Conference or the Sea to Shining Sea Conference could work.\nEveryone loves the word Power. How about the Power Conference?\nThe Horns Down Conference?\nWhat about the League of Extraordinary Schools? Or just The League? The Conference?\nI much preferred the Washington Football Team to the Washington Commanders. Just saying.\nOf all the names I have spewed out here, I probably like the Nationwide Conference the best.\nBut switching names would destroy all the brand recognition that the Big 12 has built over the years. It’s probably best just to stick with the Big 12 and create a new logo.\nSchools out - what does this mean for the Robinett family? Will any of the kids get to meet with Principal Kellis for some learning opportunities. Does this include any road trips to Texas to learn about Texas BBQ?\n— Chad fullington (@ChadFullington) May 11, 2023\nThe first part of summer will be devoted to watching my two oldest sons play baseball. It’s unbelievable how many games their teams have on the schedule in May and June.\nProfessor Kellis will probably take his students on an educational field trip to Kauffman Stadium at some point. Plenty of recess at the swimming pool. I’m thinking movies will be shown quite frequently in our basement.\nWe might hold a few classes outdoors at the golf course.\nI’ve got a family trip to Los Angeles on the books after Big 12 Media Days. We’re flying, not driving like the Griswolds, fortunately. But a road trip to Texas would be nice for some BBQ, among other things.\nWe’ll see what happens.\nI’m just hoping to survive. Once you become a parent, that’s what summer is all about.",
  "word_count": 2027,
  "scraped_at": "2026-02-14T12:01:30.628667"
}