{
  "article_id": "7e52a9f6c948",
  "url": "https://www.foodnavigator.com/Article/2025/03/24/how-danone-is-reaching-glp-1-users-through-clever-advertising/",
  "title": "How Danone is reaching GLP - 1 users through clever advertising",
  "date": "20250324T180000Z",
  "domain": "foodnavigator.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "From protein to ‘food noise’, the world’s largest yogurt maker is keeping a close eye on what matters to consumers with respect to weight management.\nSuper Bowl is one of the biggest events for FMCG firms. This year, multi-million dollar advertising slots were snapped at a record rate, with broadcaster FOX stating that commercials had sold out as early as November.\nWith around 128 million viewers tuning in for the Big Game this year according to Nielsen estimates – and record-setting 191.1 million unique viewers who tuned in for at least a minute – brand visibility is a big factor for advertisers.\nBut tracking social media interactions is becoming increasingly important, too. Knowing how commercials are being received by viewers in realtime allows brands to keep their finger on the pulse of consumer attitudes.\nAnd with weight management a hot topic in the food and beverage industry, Danone North America was tracking if GLP-1 was a big topic of conversation during the Big Game.\nDairy’s health halo in the age of GLP-1\nBut before we delve into the numbers, let’s take a look at dairy’s role for consumers on a weight management journey.\nDairy is typically seen as a food group that has a ‘health halo’. Minimally-processed products such as plain full-fat yogurt, milk, butter and low-fat cheese have been associated with health-promoting properties and a clean label. In addition, past research has shown that dairy protein and calcium content stimulate the release of GLP-1, suggesting an antiobesity effect (see ‘sources’ below for more information).\nAnd according to market research carried out by Morgan Stanley, the majority (57%) of consumers on GLP-1 medications continue to consume about the same amount of dairy as they did before starting the medication; with 15% stating they have started to consume more dairy.\nDairy’s appeal also lies in its high quality protein content, with 6oz of Greek yogurt containing 17g of protein; cottage cheese – around 12g per half a cup; and low-fat milk – 8.2g per cup, according to USDA FoodData Central 2020 data.\nProtein demand has been a boon for dairy companies, with brands globally tapping into the growing consumer market through innovation in high-protein formats, from yogurts and dairy beverages to cheese and fluid milk.\nWhile these food products had been predominantly aimed at athletes and the active consumer in the past, the category has become popular with the general consumer in more recent years as health and well-being started to take a more central stage during and after the COVID-19 pandemic.\nBut besides promoting strength and muscle growth, protein plays a key role in satiety; a factor of increased importance for consumers on a weight management journey and those coming off of GLP-1 medications.\nDanone’s approach to GLP-1 medication users\nDanone, too, has benefitted from consumer interest in protein. The company’s high-protein yogurt brand Oikos experienced a 40% increase in sales in North America in 2024 with low-sugar line Too Good & Co and protein range Light & Fit seeing boosts, too, Danone reported.\nIn addition, the CPG major has been quick to directly appeal to consumers on weight management journeys by partnering with registered dietitians and setting up a dedicated website with resources such as nutritional and health information and recipe suggestions.\n“We are closely following specific nutritional challenges that come with these medications so that our innovation can meet specific needs like nutrient management and muscle mass preservation,” says the company of its focus on GLP-1 consumers.\nBefore GLP-1 medications became more widely available, they were typically prescribed to people with type-2 diabetes. Just last year, Danone North America secured through an FDA petition a science-backed claim that links yogurt consumption with reduced risk of developing type-2 diabetes.\nThe claim – which all yogurt producers can leverage as it is FDA-verified - states: “Eating yogurt regularly, at least two cups (3 servings) per week, may reduce the risk of type 2 diabetes according to limited scientific evidence.”\nDanone North America VP of health and scientific affairs Miguel Freitas, PhD, said at the time that a growing body of research suggested that regular yogurt consumption could reduce the risk of developing ‘one of the most significant and rapidly rising health ailments’ in the US.\nDiabetes in numbers\nDiabetes is one of the top 10 causes of death in the US, impacting more than 37 million Americans, according to the American Diabetes Association.\nAs many as 1.2 million Americans are diagnosed with diabetes every year.\nIn 2021, 97.6 million Americans aged 18 and older had pre-diabetes.\nBut let’s go back to Super Bowl LIX and why Danone’s Oikos commercial was a masterstroke in advertising.\nDuring the Big Game, Danone North America said that the number of social media discussions about GLP-1 rose 50%, and 21% of the overall GLP-1 chats were about nutrition, including how to reach particular protein goals, how to reduce sugar cravings, and how to address so-called food noise.\nMeanwhile, the company chose its high-protein yogurt brand, Oikos, as one of the products to highlight during the Big Game; and attracted TV and sport star power in Ted Lasso actress Juno Temple and Cleveland Browns player, Myles Garrett.\nBut what type of consumers engaged with Super Bowl LIX commercials?\nIn terms of viewing medium, the share of streamers was the largest this year, at 43.5% according to Nielsen’s The Gauge; compared to 23.2% for cable television; 21.2% for broadcast, and 12.1% for other ways to watch.\nAccording to behavioral engagement data specialists EDO, Inc, men aged 45-54 and 35-44 were most likely to interact with adverts streamed online on average. At the same time, middle-aged viewers were more likely to engage than older viewers or young adults, the market insights company concluded.\nHow does this interface with US diabetes data? According to a 2023 study referenced in sources below (3), the prevalence of diabetes in the US increases with age, peaking around the 60s among males. In terms of ethnicity and race, the study found that white and Mexican American men were more like to have diabetes than females in these cohorts.\nTaken together, there are clear opportunities for food companies wishing to position themselves as health and wellness brands to reach the consumer demographic – in this case, younger to middle-aged males – that is the most commonly affected by diabetes.\nIn its Super Bowl LIX advert, Danone North America doesn’t just speak to the male viewership, however. The narrative theme – where Juno Temple’s character effortlessly carries US football player Myles Garrett on her back through an airport terminal – conveys female empowerment.\nAnd academic research (4) suggests that women who view female empowerment adverts have more positive attitudes towards the brands advertised, as well as higher purchase intentions.\nHere is Danone North America’s commercial masterstroke laid bare: the food, beverage and nutrition company manages to promote its high-protein brand without making it all about plain health and nutrition; while at the same time positioning it front of the right audience and making it inclusive all at the same time.\nSources:\n1. Dairy protein and leucine alter GLP-1 release and mRNA of genes involved in intestinal lipid metabolism in vitroAuthors: Chen Q, Reimer RAPublished: Nutrition. 2009 Mar;25(3):340-9. DOI: 10.1016/j.nut.2008.08.012. Epub 2008 Nov 26. PMID: 19036562; PMCID: PMC3827015.\n2. Protein- and Calcium-Mediated GLP-1 Secretion: A Narrative ReviewAuthors: Jonathan D Watkins, Françoise Koumanov, Javier T GonzalezPublished: Advances in Nutrition, Volume 12, Issue 6, 2021DOI: 10.1093/advances/nmab078\n3. Prevalence of diabetes in the USA from the perspective of demographic characteristics, physical indicators and living habits based on NHANES 2009-2018.Authors: Fang L, Sheng H, Tan Y, Zhang Q. Published: Front Endocrinol (Lausanne). 2023 Mar 7;14:1088882. DOI: 10.3389/fendo.2023.1088882. PMID: 36960397; PMCID: PMC10028205.\n4. The Impact of Female Empowerment in Advertising (Femvertising)Author: Drake, Victoria, E.Published: Journal of Research in Marketing (JORM – Technical Research, Canada), Volume 7, No.3, August 2017ISSN: 2292-9355Accessed: March 24, 2025, https://core.ac.uk/download/pdf/229163714.pdf",
  "word_count": 1313,
  "scraped_at": "2026-02-14T12:34:46.359382"
}