{
  "article_id": "7e73a39898b1",
  "url": "https://www.fcbarcelona.com/en/club/news/4284164/fc-barcelona-fans-all-set-for-the-culer-walk",
  "title": "FC Barcelona fans all set for the Culer Walk",
  "date": "20250612T131500Z",
  "domain": "fcbarcelona.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FC Barcelona fans all set for the Culer Walk\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link\nAll set for the Culer Walk (Marxa Culer). On 13 and 14 June, Barça members, supporters' club members and fans will enjoy a day of all things FC Barcelona, sport and nature with a group walk to Montserrat to commemorate the 125th anniversary of FC Barcelona, while also celebrating the millennium of the Benedictine monastery.\nThe clamour to participate has been overwhelming and places on both versions of the walk were filled days ago. The long walk with a 46.7 kilometre route will set off at 10.00pm CEST on Friday 13 June from the Estadi Johan Cruyff. The short walk that is just over six kilometres will set off from the Rambla de Collbató at 8.00am CEST on Saturday 14 June. The vice president for the Institutional Area of the Club Elena Fort and the 125th anniversary David Carabén will be there to see off both walks.\nCommemorative event\nThe FC Barcelona commemorative event will take place during the morning of Saturday 14 June at the Plaça Museo de la Abadía in Montserrat as the participants are arriving, with the trophies achieved by the men's and women's first teams during the 2024/25 season on show. There were be dances and entertainment by Comparsa Blaugrana and a parade with bastoners (stick dancers). Members of the Board of Directors in Elena Fort and Josep-Ignasi Macià will also be present at the event, and will hand out medals to every Culer Walk participant.\nFC Barcelona president Joan Laporta and the Most Reverend Abbot Manel Gasch will preside over the Culer Walk commemorative event, which will include the showing of a video featuring the historical bond between Barça and Montserrat. The event will also see the participation of the president of the Catalan Federation of Hiking Organizations Jordi Merino, and tribute will be paid to the Penya Blaugrana de Manresa, through its president Anna Calvera, in recognition of the organisation for the first ever gathering of Penyas at Montserrat Monastery in 1972.\nThis act will be followed by a sardana dance performed by Mirant al Cel and then the Board of Director members and the institutional representatives will move into the Montserrat Basilica. During the conventual mass, which will begin with a short speech by president Joan Laporta, there will be a floral offering to the Virgin of Montserrat, along with the trophies achieved by the men's and women's football first teams in the 2024/25 season by the FC Barcelona president.\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link",
  "word_count": 456,
  "scraped_at": "2026-02-14T12:53:35.765499"
}