{
  "article_id": "7e81b6e4d023",
  "url": "https://www.opb.org/article/2023/03/24/portland-thorns-new-coach-2023-season/",
  "title": "Portland Thorns coach Mike Norris looks ahead after last year winning season",
  "date": "20230324T201500Z",
  "domain": "opb.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Last year was filled with turmoil for the National Women’s Soccer League. A yearlong investigation of the NWSL found sexual misconduct, verbal abuse and sexual coercion by coaches – something perpetuated by officials turning a blind eye and allowing the accused coaches to continue in the league. And it had major reverberations in Portland, where leadership of the local team, Portland Thorns FC, had actively interfered with the investigation.\nBut even with the unrest, the Thorns went on to win the 2022 NWSL Championship and their forward Sofia Smith was named MVP for the league. On Sunday, they’ll kick off a new season with a home game against the Orlando Pride, and with a new head coach at the helm. Earlier this year, Mike Norris became the Thorns FC head coach, after joining the team in 2022 as an assistant coach. He spoke with All Things Considered host Crystal Ligori about the upcoming season.\nCrystal Ligori: The Thorns won last year and you’ve got a super strong team with lots of great players, but a lot of those great players will likely be on the US women’s team at the World Cup for some of the season. So what do you see as your chances to repeat the win of the NWSL Cup this year?\nMike Norris: I think we’re hopeful in terms of just tackling every day with the group that we do have. Obviously, we’re trying to plan accordingly for the World Cup window and some of the holes that we will lose. So I think that’s just being proactive in all parts to see how we can hopefully stay consistent and stay strong through those windows. I mean, we’ve got a strong and a deep group beyond just the international players, so that will be an opportunity for those players as well.\nLigori: You were promoted to head coach after former coach Rhian Wilkinson resigned after self-reporting inappropriate communication with a player. And that incident came on the heels of an investigation that was led by the former U.S. Deputy Attorney General, Sally Yates, which found systemic abuse across the women’s pro-league, including alleged sexual coercion on the part of the former Thorns coach and a decision by management that actually allowed him to stay in the league. So how are you working to rebuild trust with both the players and the fans?\nNorris: Yeah, I mean, I hope I’m not having to rebuild trust with the players coming into the role last year. I think it took time for me to build trust with the players for them to get to know me, for me to get to know them. I think being new in the environment, new to a club that’s gone through a lot, I think being a male coach as well and obviously, there could be some hesitation or sensitivities to that. But ultimately I think I trust who I am as a person and the upbringing that I’ve had in terms of what’s right and wrong.\nAnd for the fans? Yeah, I mean, I think it’s a tough one for me to answer. Obviously, I think they’ll have some scarring and some hesitations. I think all I could ask is that they give me an opportunity to work with the group and hopefully see the product on the field and just the general interactions that I have with the team and the community to hopefully see that my intentions are right. [And] to hopefully shift the issues that have been within the league.\nLigori: I know that you played youth football in England before moving to Canada to coach. What changes do you think need to be made in the league as a whole, especially in women’s youth clubs to make the culture more inclusive and make players feel more safe?\nNorris: I think process is a big piece. … Processes in terms of communication, the environment. I think education is a big piece as well, through coaching courses [like] Safe Sport. And then I think it’s just setting good practices on a daily basis. And I think open communication and reporting is probably a big piece, but again, that comes back to processes. Is there a process in place for people to report minor or major instances at the field?\nLigori: After the Yates report, Merritt Paulson stepped down as CEO of both the men’s and women’s teams and later announced that he’s going to be selling the Thorns. There’s been a lot of talk of fan ownership, which might sound like a long shot, or maybe a new celebrity owner or a women-led investment group. What would you like to see in terms of ownership of the team?\nNorris: It needs to be somebody or a group of people that are in for the long haul, in terms of the investment for the club and the players, is the key piece for me. Whether that’s a big personality, a small personality, I think that needs to be at the core of the longevity of the investment into the organization.\nLigori: I know that the season opener is on Sunday, so what are your hopes for that game?\nNorris: We’re excited. Look, there’s a lot happening in the off-season. The group’s put a lot of work in. We’ve made some good forward strides. There’s an excitement around the season ahead and the expectations.\nI think there’s obviously external pressure being the champions, but there is [also] the pressure of being the Portland Thorns. But I don’t think there’s any more pressure than what the staff and players put on each other every day. And it’s how we embrace that and go towards openly trying to chase a better and more successful version of what we were last year.\nThe Portland Thorns FC kick off the 2023 regular season against the Orlando Pride on Sunday at Providence Park.",
  "word_count": 986,
  "scraped_at": "2026-02-14T11:59:17.481537"
}