{
  "article_id": "7e9361ebd2d1",
  "url": "https://metro.co.uk/2024/03/06/arsenal-women-crowds-larger-10-premier-league-teams-20411874/",
  "title": "Arsenal Women crowds larger than 10 Premier League teams | Football",
  "date": "20240306T171500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The average attendance figure for Arsenal Women this season is larger than 10 teams in the Premier League, it has been revealed.\nThe Gunners sold out the Emirates for their Women’s Super League (WSL) win over north London rivals Tottenham on Sunday.\nEngland international Alessia Russo scored the only goal of the match in front of 60,050 – the second biggest crowd in WSL history – as Arsenal beat Spurs 1-0.\nSunday’s game means Arsenal Women’s average attendance this term now stands at 34,997 – which is impressively more than 10 teams in the men’s top-flight.\nThe north Londoners have attracted a total of 279,974 supporters to watch their WSL team this season as interest in the women’s game continues to increase.\nFive of Arsenal’s eight WSL home matches have taken place at the Emirates this term with the other three at the 4,500-capacity Meadow Park in Borehamwood.\nArsenal Women have sold out the Emirates three times this season and they will play there again when they host Leicester City in April.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I was thinking about a quote from Dennis Bergkamp,’ Arsenal Women boss Jonas Eidevall said about the attendance figures, with his side sandwiched between the men’s teams of Everton and Sheffield United.\n‘He said you don’t support a team only for a player, or only for history, or only for trophies, you go and support a team because that’s where you found an environment where you think you belong.\n‘And that’s what makes me extremely proud to be able to say that I think we have found a place where more than 60,000 people feel that they belong.\nMore Trending\n‘They feel that this is their home, this is where they want to come and support their football team.\n‘That is very special and that is something we need to keep very very much alive and keep building on.’\nThe Gunners currently sit third in the WSL table, three points behind leaders Chelsea and second-placed Manchester City.\nMORE: Thomas Tuchel open to returning to Chelsea this summer\nMORE: Newcastle made audacious bid to sign Manchester United legend Wayne Rooney, says Alan Shearer\nMORE: Liverpool put together four-man shortlist in search for new sporting director",
  "word_count": 420,
  "scraped_at": "2026-02-14T12:22:22.425388"
}