{
  "article_id": "7e965ca43219",
  "url": "https://theathletic.com/live-blogs/premier-league-news-updates-live-latest/j1JfVbX3UBtj/ojcIaa76gNO3/",
  "title": "Rowett close to Birmingham return as interim head coach",
  "date": "20240320T070000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Football news live: Premier League latest, Women's Champions League updates and more\nRowett close to Birmingham return as interim head coach\nGary Rowett is close to returning to Birmingham City as interim head coach for the remainder of the season.\nHe would become the sixth separate person to take charge of Birmingham this season.\nRowett is in advanced talks over the role and both parties are confident he will take the post until the conclusion of the 2023-24 campaign.\nFull story below\nSpurs 'vastly different' to a year ago, says club chief\nTottenham Hotspur's chief football officer says they are a “vastly different” club compared to a year ago.\nMunn was speaking to local broadcaster Optus Sport in Australia where he has been part of the Tottenham delegation announcing a post-season friendly in Melbourne between the north London side and Newcastle United.\nIn his first interview since joining the club officially in September, having been appointed in April, Munn said: “I think the club today off the pitch, compared to where the club was 12 months ago, it's vastly different. The women's team last weekend beating Manchester City to go through to the FA Cup semi-final, which will be fantastic, but also the men's team are doing incredibly well this year.\n“I think we're playing a wonderful brand of football. It's attractive, it's back to what the DNA of Spurs was about and we just need to continue to improve and challenge ourselves and we'll have another window in the summer and I think we want to position ourselves as best we can for the start of the next Premier League season.”\nThe club’s transformation has been overseen by Munn’s compatriot Ange Postecoglou, who joined as head coach in June. “He's embraced everything that Spurs is about,” Munn said of Postecoglou. “He wants success and that is sustained success, so our alignment is completely in lockstep.”\nOn working with chairman Daniel Levy, Munn added: “Daniel is incredibly invested in the club, personally and professionally, and I don't think one person has a great single focus on success for the club than him and I feel absolutely privileged to work with him and the support he gives to me and the entire football team is unconditional. I just hope we're able to repay the faith he's put in us.”\nTottenham are currently in fifth position, three points behind Aston Villa with a game in hand, as they look to qualify for the Champions League. They are next in action at home against Luton Town on March 30.\nPavlovic out of Germany squad with tonsillitis\nAleksandar Pavlovic has withdrawn from the Germany squad for March's international friendlies due to tonsillitis.\nThe 19-year-old midfielder received his first senior call up this month after breaking into the Bayern Munich first team this season.\nHowever, he did not join up with the team on Monday because of the illness, instead remaining in Munich. He will now miss the fixtures against France and the Netherlands.\nPavlovic was one of six players to receive their maiden senior call up for March's international camp, with Julian Naglesmann also selecting Waldemar Anton, Maximilian Mittelstadt, Deniz Undav, Maximilian Beier and Jan-Niklas Beste in his 26-player squad.\nThe fixtures are part of Germany's Euro 2024 preparations, with Naglesmann's side kicking off the tournament against Scotland in Munich on on June 14.\nLukaku out of Republic of Ireland game\nRoma striker Romelu Lukaku will not feature for Belgium when they face Republic of Ireland in a friendly on Saturday.\nBelgium announced that Lukaku will be unavailable \"due to a slightly overloaded groin\" earlier this morning.\nThe 30-year-old will, though, travel with the squad for the game at Dublin's Aviva Stadium and has not been ruled out of Belgium's second friendly, against England at Wembley Stadium on March 26.\nLukaku has scored 18 goals in 37 matches for Roma this season, having joined on loan from Chelsea last summer.\nChelsea striker Ramirez in contention to return to WSL action on Sunday\nChelsea record-signing Mayra Ramirez could return for Sunday's Women's Super League fixture against West Ham.\nChelsea signed Ramirez from Levante for a fee of €450,000 in January, but she has missed her side's last two matches after being forced off during the Continental Cup semi-final victory over Manchester City.\nThe 24-year-old will be unavailable for today's Champions League quarter-final tie with Ajax but Emma Hayes said she could be in contention to return to training ahead of Sunday's WSL fixture.\n\"I think it’s more the weekend is realistic,\" Hayes said. \"When we return from here she could very well join team training for part of that on Friday, but she’s still going through another two-step process as part of her rehab with the medical team and my hope is that she’ll join in again on Friday.\"\nChelsea are already without strikers Sam Kerr and Mia Fishel due to season-ending anterior cruciate ligament (ACL) injuries, but are still competing in all four competitions this season.\nOn managing load, Hayes continued: \"It helps when you’re winning, let’s put it that way. You find a little bit more energy in the legs. Something that Erin (Cuthbert) and I’ve discussed on the way here is that yes, of course, you can imagine there’s very little time between games, but it’s so motivating when you’re able to play for, to take part in so many competitions. I think it galvanises us.\n\"I think us, as a group, do really really well with games accumulations and we’re showing that again this year.\"\nLandmark football governance bill introduced to create independent regulator\nA landmark football governance bill has been introduced in UK parliament to confirm the creation of an independent football regulator.\nThe independent football regulator will have powers to prevent breakaway competitions such as the European Super League, strengthen the owners and directors’ test and hold backstop powers around financial distribution between the Premier League and English Football League (EFL).\nIt comes over three years since the fan-led review called for the introduction of a regulator in November 2021. The government announced plans for one in February 2023.\nMore details below\nMessi out of Argentina friendlies in United States through injury\nInter Miami forward Lionel Messi will miss Argentina’s international friendlies against El Salvador and Costa Rica in the United States due to a hamstring injury.\nMessi was taken off in the 51st minute of Miami’s CONCACAF Champions Cup victory against Nashville on Thursday, with manager Tata Martino telling the media that his removal was due to a physical issue with his right leg.\nHe subsequently missed Miami’s clash against D.C. United on Saturday and the Argentina Football Association (AFA) have confirmed he will not be able to be part of the squad for March’s friendlies.\nSpurs and Newcastle to play post-season friendly in Australia\nTottenham Hotspur and Newcastle United will meet in a post-season friendly in Australia.\nThe game, three days after the conclusion of the Premier League season, will see Spurs manager Ange Postecoglou return to Melbourne where he previously played and coached.\nNewcastle exited the FA Cup over the weekend freeing them up for the trip in the week running up to the FA Cup final. Tottenham went out in the fourth round, also at the hands of Manchester City.\nCh'ship PO final could be moved if Coventry beat Man United\nThe English Football League (EFL) has drawn up a contingency plan to hold the Championship play-off final on June 2 in case Coventry City reach the FA Cup final.\nThe play-off final is scheduled to take place on Sunday, May 26, which comes the day after the FA Cup final.\nCoventry reached the FA Cup semi-final with a 3-2 win at Wolverhampton Wanderers on Saturday and are eighth in the Championship — four points behind sixth-placed Norwich City who occupy the final play-off spot — with nine matches remaining.\nThat means, in theory, Coventry could be down to play in both the Championship play-off final and FA Cup final — if they reach the play-offs and qualify for the final, as well as beating Manchester United in next month’s FA Cup semi-final.\nGabriel withdraws from Brazil squad due to injury\nAnd it's not just Liverpool players out, Premier League title rivals Arsenal also have a player missing their international team matches through injury.\nDefender Gabriel has withdrawn from Brazil's squad for their upcoming international fixtures due to injury.\nThe 26-year-old, who has only been capped six times by Brazil’s national team since making his debut last September, was expected to play a part in Brazil’s upcoming friendlies against England and Spain.\nHowever, Brazil head coach Dorival Junior revealed on Monday that Gabriel has been forced to pull out due to an issue. Juventus centre-back Bremer has been named as his replacement.\nNunez pulls out of Uruguay squad with hamstring injury\nElsewhere, Liverpool striker Darwin Nunez dropped out of the Uruguay squad after complaining of discomfort in his hamstring following Sunday’s FA Cup quarter-final defeat to Manchester United.\nThe former Benfica attacker, 24, will play no part in the Europe-based friendlies against the Basque Country on March 23 and Ivory Coast three days later following discussions with national team boss Marcelo Bielsa.\nNunez, who played the full 120 minutes at Old Trafford, has been hampered by a number of hamstring issues so far this season, with both club and country keen not to over-burden him.\nMore details below...\nForest 'extremely disappointed' at points deduction\nFollowing the news of the points deduction, Forest stated their viewpoint very clearly.\nIn a statement on Monday, the club said they were \"extremely disappointed\" with the decision and \"were extremely dismayed by the tone and content of the Premier League’s submissions\" which they said were \"unexpected and has harmed the trust and confidence we had in the Premier League\".\nForest also referred to the eight-point sanction the league sought as \"utterly disproportionate when compared to the nine points that their own rules prescribe for insolvency\".\nForest deducted four points for PSR breach\nThe big news from Monday was Nottingham Forest being handed a four-point deduction following a breach of the Premier League’s profitability and sustainability rules (PSRs).\nForest were referred to an independent commission in January after the club reported losses that exceeded the allowed amount over the three-year reporting cycle ending in the 2022-23 season.\nUnder the guidelines, they could have been fined or deducted points for the breach, and their four-point deduction now drops them to 18th in the Premier League.\nYou can read more on the situation below...\nGood morning!\nHello everyone and welcome to The Athletic's live football news blog.\nFollow here for all the latest updates from across the globe as we look at the fallout from Nottingham Forest's points deduction.\nLandmark football governance bill introduced to create independent regulator\nA landmark football governance bill has been introduced in UK parliament to confirm the creation of an independent football regulator.\nThe independent football regulator will have powers to prevent breakaway competitions such as the European Super League, strengthen the owners and directors’ test and hold backstop powers around financial distribution between the Premier League and English Football League (EFL).\nIt comes over three years since the fan-led review called for the introduction of a regulator in November 2021. The government announced plans for one in February 2023.\nFull story below\nBoa Morte to depart Fulham for Guinea-Bissau head coach role\nFulham first-team coach Luis Boa Morte will leave the club at the end of the season to take charge of Guinea-Bissau.\nBoa Morte, who spent six and a half years at Fulham as a player, returned to the club in the summer of 2021 following the appointment of head coach Marco Silva.\nGuinea-Bissau announced in February they would not be renewing manager Baciro Cande’s contract following their group-stage exit at the Africa Cup of Nations.\nMore details below\nMessi out of Argentina friendlies in United States through injury\nInter Miami forward Lionel Messi will miss Argentina’s international friendlies against El Salvador and Costa Rica in the United States due to a hamstring injury.\nMessi was taken off in the 51st minute of Miami’s CONCACAF Champions Cup victory against Nashville on Thursday, with manager Tata Martino telling the media that his removal was due to a physical issue with his right leg.\nHe subsequently missed Miami’s clash against D.C. United on Saturday and the Argentina Football Association (AFA) have confirmed he will not be able to be part of the squad for March’s friendlies.\nFull story below\nChelsea striker Ramirez in contention to return to WSL action on Sunday\nChelsea record-signing Mayra Ramirez could return for Sunday's Women's Super League fixture against West Ham.\nChelsea signed Ramirez from Levante for a fee of €450,000 in January, but she has missed her side's last two matches after being forced off during the Continental Cup semi-final victory over Manchester City.\nThe 24-year-old will be unavailable for Tuesday's Champions League quarter-final tie with Ajax but Emma Hayes said she could be in contention to return to training ahead of Sunday's WSL fixture.\n\"I think it’s more the weekend is realistic,\" Hayes said. \"When we return from here she could very well join team training for part of that on Friday, but she’s still going through another two-step process as part of her rehab with the medical team and my hope is that she’ll join in again on Friday.\"\nChelsea are already without strikers Sam Kerr and Mia Fishel due to season-ending anterior cruciate ligament (ACL) injuries, but are still competing in all four competitions this season.\nOn managing load, Hayes continued: \"It helps when you’re winning, let’s put it that way. You find a little bit more energy in the legs. Something that Erin (Cuthbert) and I’ve discussed on the way here is that yes, of course, you can imagine there’s very little time between games, but it’s so motivating when you’re able to play for, to take part in so many competitions. I think it galvanises us.\n\"I think us, as a group, do really really well with games accumulations and we’re showing that again this year.\"\nForest 'extremely disappointed' at points deduction\nAs reported earlier, Nottingham Forest have been handed a four-point deduction following a breach of the Premier League’s profitability and sustainability rules (PSR).\nThe club have said in a statement they are \"extremely disappointed\" with the decision and \"were extremely dismayed by the tone and content of the Premier League’s submissions\" which they said were \"unexpected and has harmed the trust and confidence we had in the Premier League\".\nForest also referred to the eight-point sanction the league sought as \"utterly disproportionate when compared to the nine points that their own rules prescribe for insolvency\".\nFor the club's full statement, read our story below...",
  "word_count": 2469,
  "scraped_at": "2026-02-14T12:47:06.515611"
}