{
  "article_id": "7e9edc900dad",
  "url": "https://www.usforacle.com/2025/11/08/usf-byrum-brown-espn-alex-golesh/",
  "title": "Takeaways : USF Alex Golesh defends Bulls roster as they sprint to 55 - 23 win over UTSA",
  "date": "20251108T223000Z",
  "domain": "usforacle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Takeaways: USF’s Alex Golesh defends Bulls roster as they sprint to 55-23 win over UTSA\nWith just over two minutes left in the first quarter, USF quarterback Byrum Brown led his opening trot to the ball – poised to start the game after waiting almost 45 minutes to play.\nThe Bulls (7-2, 4-1 American) found themselves up by 14 points despite the offense not touching the ball. It was a Thursday night spent going through the motions of a 55-23 implosion for UTSA.\nYet, before the game ever started, the stakes for USF were high – between restoring energy in a College Football Playoff berth and showcasing USF’s roster building talent.\nRelated: Photo Gallery: USF vs UTSA\nAfter the game, head coach Alex Golesh gave the defense credit for the quick start.\n“The way our defense played was contagious,” Golesh said. “They played together. They played with a purpose.”\nDefending the Bulls\nIn preparation for the Roadrunners’ game against South Florida, UTSA coach Jeff Traylor commented about USF’s financial situation regarding roster building.\n“[USF has] maxed out their roster as far as scholarships,” Traylor said in an early week press conference. “The money they spent, credit to [Golesh] for getting that done, is unbelievable.”\nTraylor went on to speak about USF’s recent athletic developments, between USF’s $22 million Indoor Practice Facility and its $407 million on-campus stadium.\nFor Traylor, the gap in spending defined where UTSA was in the American Conference.\n“I just know we’re not close to being where we want to be if we want to be successful in this league,” Traylor said. “I knew this was not sustainable with what we were investing.”\nBefore UTSA’s move to the American Conference, the Roadrunners won 23 games in two years as a premier member of Conference-USA. UTSA won two C-USA championships in 2021 and 2022.\nNow, Traylor finds his team in a more competitive conference – lacking the funding he said is necessary to compete.\n“[South Florida] doubled down,” Traylor said. “The bar has been moved tremendously.”\nFor Golesh, ever impervious to outside noise, UTSA’s financial struggles should have stood alone without mentioning USF’s situation.\n“Don’t do it at the expense of us,” Golesh said. “Your prerogative is to go build your own program.”\nGolesh took time in the post-game press conference to defend USF — saying that the university’s success could be attributed to hard work, not a hefty payroll.\n“When you’re talking about money, you’re taking away from the fact that there’s a bunch of dudes in that locker room that have poured into their process,” Golesh said. “It discredits the fact that there’s recruiting, there’s relationships being built, there’s coaching going on.”\nOffensive response\nBrown’s first and only incompletion of the night came with 10 minutes left in the third quarter, after 11 straight completions put the Bulls ahead by 35 points.\nWhen Brown wasn’t making defenders miss or vaulting over them, he was lining up deep passes en route to a 239-yard passing performance — complemented by a pair of touchdowns.\nThe Bulls went 4-5 on passes deeper than 15 yards, including a pair of 40-yard bombs to sophomore receiver Keshaun Singleton.\n“[Brown’s] so self-aware, so conscious of what he feels like,” Golesh said. “He is truly as close to a coach on the field as you can ever imagine.”\nWhile Brown let loose over the air, the Bulls found green grass on the ground. USF rushed for 238 yards, with Brown accounting for 109 of those yards.\nUSF entered the UTSA game looking to recover from its 34-31 loss to Memphis on Oct. 25.\n“A really good response to the nasty, nasty feeling we had leaving Memphis 10 days ago,” Golesh said. “The response is what defines you.”\nAfter jumping out to a 10-point lead against the Tigers, the Bulls’ offense sputtered in the second half – outgained by over 100 yards.\nIn USF’s bout with the Roadrunners, not making the same mistake was paramount.\nAfter the Bulls’ quick defensive start, the offense scored on six straight possessions.\n“It’s a team sport, so we need offense, defense and special teams in order to make plays,” Brown said.\nDefensive specialty\nWhile USF’s offense didn’t touch the field until late in the first quarter, the Bulls’ defense took up real estate.\nSenior safety Tavin Ward returned an interception on the first play of the game for a touchdown.\nFor the next possession, sophomore safety Fred Gaskin waltzed into the endzone with an 85-yard fumble return for a touchdown — after a strip sack by junior cornerback Jarvis Lee.\nRelated: USF women’s soccer ends postseason run in semifinal loss to Rice\nUp 14 points, the Bulls would walk back on the field after more than 10 straight minutes of play. Still, the USF would force a punt.\nWhile the Bulls’ defense couldn’t get off the field, it wasn’t because the offense was scoring. The Roadrunners possessed the ball for over 22 minutes in the first half – yet put up only 10 points.\nThe Bulls effectively silenced one of UTSA’s most potent weapons – senior running back Robert Henry Jr.\n“[The defense] held what I think is one of the best running backs in the entire country to 27 yards,” Golesh said.\nUSF will travel to Annapolis, MD, to take on Navy for another decisive American Conference matchup at Noon on Nov. 15. The game will be available on ESPN and Bulls Unlimited.",
  "word_count": 906,
  "scraped_at": "2026-02-14T14:21:23.943735"
}