{
  "article_id": "7eae09983b03",
  "url": "https://economictimes.indiatimes.com/news/international/canada/mere-eye-candy-or-brawn-with-beauty-anna-kalinskaya-gives-tough-fight-against-swiatek-in-arthur-ashe/articleshow/123609850.cms",
  "title": "Mere eye - candy or brawn with beauty , Anna Kalinskaya gives tough fight against Swiatek in Arthur Ashe",
  "date": "20250831T034500Z",
  "domain": "economictimes.indiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Prior to the match, however, there were fans who couldn’t stop gushing over Kalinskaya, with comments ranging from the most good-looking WTA player ever, and photoshoots of Kalinskaya spread all over from her recent interview to Flaunt magazine.\nAlso read: A self-made tennis superstar, who hailed from wealthy backgrounds, meet Emma Navarro, the All-American, South Carolina native born in NY\nIs Kalinskaya all that on court, too?\nYes, the World no. 29, has much to show for in court, with early titular reigns at the young age of 17. A doubles and singles player, she has more than meets the eye capacities.\nAnna Kalinskaya has caught everyone’s attention for her match with top seed Swiatek, during her photoshoot.\nSchool-boy comments from excited fans, hilariously, stated: “Best tennis face card ever argue with the wall,” one fan said.\n“The most beautiful in the WTA,” another fan declared. These are all from fans in a match which is supposed to be focused on tennis, rather than a photoshoot.\nWho is she?\nA singles and doubles tennis queen, Anna Nikolayevna Kalinskaya, had run through the grade system rankings of Eastern European tennis selections through her budding years, and is currently the singles World no. 29, and doubles World no. 37.\nBorn in Moscow, to a family where grandparents from her mother’s side are Ukrainians, she also has a brother, Nikolay Kalinsky, who plays football. She moved to the US at the age of 14 to pursue tennis.\nAlso read: US Open star Jasmine Paolini’s ‘One-in-a-Million’ photo is breaking the internet\nHer most famous match wins come from her early years at the age of 17 being the woman’s champion in doubles at 2016 Australian Open, with Tereza Mikhalikova, 2015 US Open finalist along with Anastasia Potapova, and several other high achievements at such a young age.\nHowever, Kalinskaya, 26, according to a Spun article, became more popular for an interview with Flaunt magazine four days prior to her third round, which saw her photoshoots.\nOptimistic mindset behind ‘trained killer’ on court\nTalking about her mindset to recuperate post her six month absence in 2023 due to injuries, she says,\n“I can be mad, but will it help me?” to Flaunt Magazine\n“I can be stuck in my head, asking myself, ‘Why, why, why?’ Will it solve anything? No. You never know when you’ll lose or when you’ll play [well]—there is no control. I can control my thoughts. I think it’s very important what is on your mind. I’m a positive person in general. So, I just choose not to be mad anymore. Of course, there were moments when I was frustrated, but maybe it’s for me to learn. The big lesson from all of this is it’s not going to last forever. I can only try to improve, even in the face of loss.”, she adds.\nShe writes on Instagram that she is a positive person, and chooses to be a better person everyday, as she captions the Flaunt interview.\nAlso read: Play, eat clean and screen-off: Tennis Maestro Billie Jean King shares her secrets for a healthy life at 8\nLooks or strikes, could kill? Shift focus on match, says basic decency\nThe tormentuous debate of whether looks could kill, is taken now more seriously amongst fans, and spectators, who do not realise that sometimes, the very players who are gushed over so much, actually, become the victims of such compliments, by really looking past their accolades, and the respect for the player’s skill and even the sport in and of itself.\nLooks do matter, in a sport, which has not shied away from showcasing a set of players since the past three decades, who seemingly also fit the beauty quotient. But, the question arises, what’s actually left of the sport?\nThis is not new, as, recent news of people whistling at women players, loud inappropriate commentary, and a sort of poster-girl requirement has seeped into the psyche of women players to earn ‘extra respect’.\nThe Maria Sharapova resurgence to ‘beauty standards’\nHere, brawn, most associated as a ‘masculine’ trait, actually saw women’s tennis grow newfound respect by breaking stereotypes of typical beauty standards.\nAlso read: Planning to attend US Open 2025? Check full schedule, ticket prices and other key details\nA perfect example of such beauty with brawn, was Serena Williams, Williams overcame the stereotype of what’s beautiful, and was again, brought back by Sharapova’s entry with her model-like ‘feminine’ looks, which again became more evidence for an industry which growingly became a platform for eye-candy rather than genuine interest for the sport.\nPlayers, like Sharapova and Serena had made it clear that such reductive views on them, definitely did not encapsulate their deserved reputation on the court.",
  "word_count": 787,
  "scraped_at": "2026-02-14T12:12:14.650349"
}