{
  "article_id": "7ec3e081b807",
  "url": "https://huskercorner.com/2023/07/01/nebraska-cornhuskers-noah-vedral-joins-kansas/",
  "title": "Nebraska Cornhuskers News : Noah Vedral joins Kansas , more",
  "date": "20230701T144500Z",
  "domain": "huskercorner.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former Nebraska Cornhuskers football player Noah Vedral has officially started his coaching career with a former Big 8 rival.\nNoah Vedral has had quite an interesting career around college football. That career started with the UCF Knights. Then he moved to the Nebraska Cornhuskers football team when Scott Frost took over. Vedral finished his career with the Rutgers Scarlet Knights.\nNow that Vedral’s playing days are over, it appears his coaching career has started. The former quarterback just joined the Kansas Jayhawks. Vedral joined Lance Leipold’s staff as a volunteer strength intern.\nVedral’s family certainly has a ton of ties to the Nebraska Cornhuskers. However, he’s also got some ties to KU, considering that his younger brother Ezra will be a linebacker for the Jayhawks this fall. His younger sister Anna is also a track and field star with Kansas.\nDuring his days as a member of the Nebraska Cornhuskers, Noah Vedral was mostly a backup, though he did start two games in the 2019 season after Adrian Martinez fell to injury. His best career game as a Husker was an October 26 matchup that year against Indiana when he completed 14-of-16 passes for 201 yards and ran for 21 yards and a touchdown. The Huskers still lost 38-31.\nOther Nebraska Cornhuskers news\n- As we inch closer to the start of the 2023 season more and more writers are starting to look at whether Matt Rhule can lead a real Nebraska Cornhuskers rebuild. Those writers include Pete Thamel who is counted among those who believe the former Baylor and Temple coach can indeed find success almost immediately.\n- If Rhule is able to find real success in Lincoln, it will almost assuredly be because at least in part because of the Huskers strength coach, Corey Campbell. Sports Illustrated spelled out why.\n- Former Nebraska basketball star Jame Palmer has signed a new deal with Turkish basketball team, Türk Telekom Ankara. Palmer was a leading scorer for the Huskers in the two years he started for Nebraska. That included averaging 19.7 points, 4.2 rebounds and 3 assists per game in the 2018-19 season.\n- The Nebraska women’s basketball team has a new assistant. Jace Henderson has been promoted to a full-time position as the new title of Director of Player Personnel, Development & Influence. Henderson joined the Nebraska Cornhuskers as a graduate assistant manager after being an assistant with Montana.\n- The Nebraska softball team got its own new assistant. It’s been a big month with the Jordy Bahl news and now former Nebraska softball pitcher Olivia Ferrell has been named a full-time assistant coach. The former Nebraska Cornhuskers star was a team captain and is 8th on the program’s career list in strikeouts with 402 (irony)!",
  "word_count": 457,
  "scraped_at": "2026-02-14T13:24:42.129588"
}