{
  "article_id": "7ecc7cdd6565",
  "url": "https://www.geosuper.tv/latest/34935-womens-league-cup-final-hayes-lashes-out-at-arsenals-eidevall-over-male-aggression",
  "title": "Women League Cup Final : Hayes lashes out at Arsenal Eidevall over  male aggression  ",
  "date": "20240401T101500Z",
  "domain": "geosuper.tv",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Web Desk\nApril 01, 2024\nChelsea manager Emma Hayes hit out at Arsenal counterpart Jonas Eidevall for showcasing \"male aggression\" during the Women's League Cup final.\nThe development comes after Eidevall had a heated exchange with midfielder Erin Cuthbert.\nCuthbert and Eidevall exchanged words when the Chelsea midfielder was set to take a take a throw-in in extra time from the touchline when her side was behind the game at Molineux.\nArsenal's Stina Blackstenius's goal in the 116th minute bagged the 1-0 victory for Eidevall's team.\n\"I think there's a way to behave on the side of the pitch and not for the first time, I've been in women's football a long time and I don't think we should tolerate male aggression like we did today,\" said Hayes, who appeared to push the Arsenal manager away as they shook hands after the final whistle.\n\"Fronting up or squaring up to a player is something that's unacceptable. I've never been booked in 12 years of my career but I think there's a way to behave on the touchline.\n\"He received a yellow card but perhaps should have been more,\" she told the BBC.\nEidevall didn’t agree that his behaviour was aggressive and said his exchange with Cuthbert had been a result of Chelsea's decision to use a one-ball system for the final.\n\"The ball goes out of play, the Chelsea player wants a new ball to take a quick throw-in and I said, 'we play with only one ball and you guys were the ones who decided that,'\" he told the BBC.\n\"I can't see that I did anything, had any form of contact with anyone - either a player or a coach. That was it. To be honest I can't really take it seriously (being called an 'aggressor').\nThe Swede also brushed aside Hayes's comments in his press conference.\n\"I don’t think I was aggressive,\" he added. \"I think that is irresponsible to label it as that.\"",
  "word_count": 328,
  "scraped_at": "2026-02-14T13:01:31.992177"
}