{
  "article_id": "7eceb176ae63",
  "url": "https://www.90min.com/3-key-battles-that-could-decide-england-vs-spain-26-2-25",
  "title": "3 key battles that could decide England vs Spain",
  "date": "20250226T184500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "3 key battles that could decide England vs Spain\n- England host Spain in the Nations League group stage on Wednesday\n- This is the first meeting between the two teams since 2023 World Cup final\n- Both teams will hope to make a statement ahead of Euro 2905 in summer\nEngland host Spain in the Nations League group stage on Wednesday evening, and it is quickly becoming one of the most highly anticipated rivalries in women's international football.\nThe two nations have met at the last two major tournaments, first in the quarter-finals at Euro 2022, when England came from a goal down to win 2-1 in extra time. Spain then exacted their revenge 12 months later, edging past the Lionesses 1-0 in the World Cup final in Sydney.\nBoth teams will be hoping to claim the Euro trophy in Switzerland this summer, although they won’t be the only ones fancying their chances. That said, Wednesday night's meeting at Wembley will be a strong indicator of where they are and who has the upper hand at this stage.\n90min has broken down some of the key battles that will determine who walks away with the victory and takes control of the Nations League group...\nMariona Caldentey vs Niamh Charles\nThe last time England faced Spain saw Mariona Caldentey battle it out with Lucy Bronze, but the Arsenal star has predominantly played on the right wing under Montse Tome. Whether the Spain boss decides to switch things up remains to be seen, but Caldentey will undoubtedly cause problems for whichever full-back she comes up against.\nIf she does indeed start on the right, it will likely be England's Niamh Charles who is tasked with keeping her quiet. The Chelsea defender missed the international camps before Christmas due to injury, but she is now back in the fold and played the full 90 minutes against Portugal on Friday.\nSarina Wiegman could switch things up and start Jess Carter, but Charles will likely be England's starting left-back at the Euros and will need to test herself against top opposition, as she regularly does for Chelsea in the WSL and Champions League.\nCaldentey has scored 11 goals for Arsenal across all competitions, mostly while playing in a more central role. The 28-year-old has the pace and strength to beat and fend off opponents, which means England's left-back could be in for a long night.\nAitana Bonmati vs Grace Clinton\nIf England are to do a number on Spain on Wednesday, it is crucial they win the midfield battle. The visitors are slightly weaker in that area of the pitch, with some notable absentees, including Patri Guijarro, who is sidelined with a thigh injury.\nThat said, England are also without one of their own stars, Georgia Stanway, who is likely to miss the Euros this summer due to a knee injury. Both nations still have focal points in Keira Walsh and Aitana Bonmati, but it will likely be Grace Clinton tasked with matching the two-time Ballon d'Or winner.\nFluidity in formations and positions from game to game makes it difficult to predict who will start where, but if Clinton is given the nod, this will undoubtedly be her biggest test yet. The Manchester United star had a strong first half showing against Portugal but was exposed for the hosts' equaliser in the second half.\nAny lapse in concentration against Spain's midfield could prove costly, particularly because Bonmatí dominates games seemingly with ease and dictates the tempo. Her close control can make her press-resistant at times, and her game intelligence makes her a nightmare to mark.\nLaia Codina vs Alessia Russo\nTome often rotates her centre-back partnerships, and Laia Codina was an unused substitute in the last-gasp victory over Belgium last week. Whether that decision was made with an eye on Wednesday's game remains to be seen.\nFrom an England perspective, much of their hope rests on the shoulders of Alessia Russo. The forward was on the scoresheet in the draw against Portugal and will no doubt be determined to make a statement against Spain.\nCodina may be a solid choice to start at Wembley, given that she comes up against Russo in training for Arsenal week in, week out. The familiarity between the two players could make for an interesting battle, one that could ultimately decide the game.\nEngland do have other goal threats, including Chelsea's Lauren James if she is given the nod for a second game in a row. But there is no denying Russo's growing importance to the team, and the fact that most of the Lionesses' hopes rest on her ability to put the ball in the back of the net.\nWiegman could turn to Nikita Parris from the bench, who is in fine goalscoring form for Brighton this season. However, the starting place is not up for debate, and it will be Russo's responsibility to ask questions of Spain's centre-back pairing.",
  "word_count": 822,
  "scraped_at": "2026-02-14T13:05:51.941712"
}