{
  "article_id": "7ee6570154f3",
  "url": "https://www.rollbamaroll.com/2024/2/16/24065963/home-opener-alabama-crimson-tide-softball-tuscaloosa-2024-virginia",
  "title": "Home Opener for Alabama Crimson Tide Softball",
  "date": "20240216T221500Z",
  "domain": "rollbamaroll.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "My gawd. How deep down did Patrick Murphy have to dig to unearth these practice dummies?\nHome Opener for Alabama Softball\nThe Crimson Tide returns to Tuscaloosa to face Virginia, St Thomas, and Southern Indiana. Please! PLEASE! Contain your excitement!\nSCHEDULE\n- Friday, Feb. 16 vs. St. Thomas - 4 p.m. CT\n- Friday, Feb. 16 vs. Virginia - 6:30 p.m. CT\n- Saturday, Feb. 17 vs. St. Thomas - 11 a.m. CT\n- Saturday, Feb. 17 vs. Virginia - 1:30 p.m. CT\n- Sunday, Feb. 18 vs. Southern Indiana - 1 p.m. CT\nHOW TO WATCH... ALLEGEDLY\nStreaming: SEC Network Plus\nVIRGINIA (3-2)\nThe Wahoos were 30-22 and 8-16 in a vastly improving ACC last year. Jade Hylton was named the No. 13 middle infielder in the country by D1Softball.com for the 2024 season. The sophomore hit at a .314 and led the team in home runs (10), runs (33), RBI (26), and steals (22). She was also tops in extra-base hits with eight doubles and four triples to go along with the 10 home runs.\nUVa lost two of their top three pitchers but the workhorse of the team (111 innings pitched), Eden Bigham has returned. She was 13-6 with a 2.52 ERA last year.\nIn the opening weekend, UVa topped Jacksonville State and UNC-Greensboro (twice) while South Carolina dominated the Cavaliers, 6-1 and 7-1.\nST THOMAS (0-5)\nIf when you saw this name on the schedule you thought it was a team from the U.S. Virgin Islands, you are not alone. No, this team is from Minnesota. For most of the school’s history, they have been Division III and even won the 2004 and 2005 softball championships. In the fall of 2021, most of their sports made the jump from DIII all the way up to D1. The football team is now FCS/Pioneer League while most of the other sports compete in the Summit League. It has been a tough row for the Tommies since moving up. Their last four or five seasons in DIII, they were defeated only 7 to 11 games per season. Their two campaigns in D1 the last two years have resulted in records of 14-36 and 18-35. It would be hard to imagine they will be at any other level this season after they lost five games to Arizona State, Northwestern, Boise, Wisconsin, and Grand Canyon to open 2024. Team ERA sits at an ugly 13.50.\nSOUTHERN INDIANA (0-0)\nIn 2018, the Screaming Eagles - yes, that is their name; No, Craig T. Nelson is not their coach - won the DII women’s national championship in softball. They moved up to D1 in 2022. Last season, USI went 21-23 without playing a single “Power” team from the big five conferences. They lost to teams such as Evansville, IUPUI, Bethune-Cookman, and Yale. The Screagles have yet to play this season. I honestly don’t know where Murphy gets these guys from.\nWEATHER\nTuscaloosa is expecting cloudy weather with highs in the mid 60s on Friday. Saturday will be pretty dang cold with maybe a peek of sun. Sunday will be sunny and a smidge warmer.\nLOWDOWN\nWith three cupcakes coming to town, Murphy will have ample opportunities to tinker with the lineup.\nIn the outfield, Kristen White missed the opening weekend with what is being called a “minor injury”. In her stead, freshman Lauren Johnson outshined many of her teammates including her sister, Jenna (.133 BA). Juco transfer Kendal Clark (.364) was also a pleasant surprise in her limited playing time. Larissa Preuitt made a big play in the field but struggled at the plate (.111). When White comes back, there will be some tough decisions to make on playing time and batting order.\nCatcher is another position that needs sorting out. The three candidates were all pretty weak, producing one solitary single and 0 RBI from the position in five games.\nAlabama is now ranked 11, 11, 12, 15.\nAnything less than a sweep would be highly disappointing and embarrassing.",
  "word_count": 667,
  "scraped_at": "2026-02-14T13:11:19.432021"
}