{
  "article_id": "7efdcbf233ce",
  "url": "https://metro.co.uk/2024/05/31/jamie-carragher-urges-arsenal-sign-two-players-win-premier-league-20945375/",
  "title": "Jamie Carragher urges Arsenal to sign two players to win Premier League | Football",
  "date": "20240531T120000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jamie Carragher believes Arsenal ‘need two players’ to go to the next level and win the Premier League title next season.\nIt’s another important summer for the Gunners, who have finished as runners-up two years in a row under Mikel Arteta.\nWhile Manchester City have clinched four Premier League titles in a row and six in seven years since Pep Guardiola’s arrival at the Etihad, Carragher says Arsenal are close to ending a 21-year wait for the trophy.\nIn order to get to the next level, Carragher believes Arteta needs to sign a new left-back this summer and a ‘great attacker’ to support Bukayo Saka.\nOleksandr Zinchenko was Arsenal’s main left-back last season but had mixed success and has even been linked with a move away from north London ahead of the summer transfer window.\nArteta’s attacking options include Saka, Gabriel Jesus, Kai Havertz, Gabriel Martinelli and Leandro Trossard but Carragher believes another ‘top attacker’ would turn Arsenal into a ‘tasty’ side.\n‘I think they [Arsenal] need two players,’ Carragher told Metro.co.uk at the 2024 Women’s Football Awards. ‘They need a left-back and I think they need a great attacker.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Not necessarily a centre-forward. People keep saying they need a goalscorer. Sometimes you can have a goalscorer who plays wide.\n‘[Mohamed] Salah is like that for Liverpool. [Sadio] Mane was like that in the past. I just think they need another top attacking player to go alongside Bukayo Saka.\n‘Then one of the others can fill the other role – Martinelli, Trossard or Havertz. If they got another top attacker, you look at those five or six names, it is pretty tasty.’\nMore Trending\nArsenal amassed 89 points last season – just one fewer than the Invincibles team managed in 2003-04 – but still narrowly missed out on the Premier League title.\nThe Gunners won the same amount of games as Man City and finished the season with the exact same goal difference, but a crucial defeat at home to Aston Villa in April proved costly.\nAsked if he expects Arsenal to go again next season, Carragher added: ‘I think they will be up there again.\n‘In some ways, throughout a lot of the season, they were the best team. When you look at the goals they scored, the xG difference and how strong they were defensively.\n‘The problem is that Man City have the best players, they have individuals like Foden, Haaland and De Bruyne.\n‘Arsenal just don’t have that quality at that end of the pitch. That’s why they need a top attacking player.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Mike Phelan gives advice to Manchester United over sacking Erik ten Hag\nMORE: Enzo Maresca contract details revealed with Chelsea set to confirm new head coach",
  "word_count": 528,
  "scraped_at": "2026-02-14T13:12:35.923130"
}