{
  "article_id": "7f108686a524",
  "url": "https://www.broadcastnow.co.uk/production/jill-scott-and-karen-carney-launch-long-story-short-podcast/5205462.article",
  "title": "Jill Scott and Karen Carney launch Long Story Short podcast",
  "date": "20250523T164500Z",
  "domain": "broadcastnow.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It will be available on all streaming platforms from Wednesday 11 June\nFormer Lionesses Jill Scott and Karen Carney are launching their own podcast called Long Story Short.\nIt will be made by Crowd Network and will be a platform to tell stories from throughout Jill and Karen’s decades-long friendship.\nWith over 300 England caps between them, the pair will podcast together every week, bringing listeners stories from both on and off the pitch.\nPart of Crowd’s model is providing former athletes ownership of their podcasts to unlock meaningful post-professional retirement career paths, so Long Story Short is owned by Jill and Karen.\nThrough its network of female sports podcasts, Crowd works with brands like Sage and Škoda on shows such as For The Love Of Rugby and We Are Chelsea.\nScott said: “I’ve always loved catching up with Kaz over a coffee, so this podcast is just us sharing stories from football, friendship, and life — past, present, and future. From the changing rooms to green rooms, we’re giving people a chance to hear the moments you don’t usually get to hear. It’s been great working with the Crowd team to create something that’s ours, and we can’t wait to share it with you.”\nCarney added: “I’m excited to start this podcast with Jill, who I have a lot of good memories and history with — we always have a good laugh. It’ll also be a chance for people to get to know me without my serious punditry hat on and see behind the curtain on life in and out of football.”\nLouise Gwilliam, talent manager at Crowd, said: “Engagement with women’s football continues to grow, and with legends of the sport like Jill and Karen becoming household names, it’s showing no sign of slowing down. We’re thrilled to welcome them to our presenting team and give them the opportunity to take ownership of Long Story Short as a platform that’s uniquely theirs.”\nThe first episode of Long Story Short will be available on all streaming platforms on Wednesday 11 June.",
  "word_count": 342,
  "scraped_at": "2026-02-14T13:06:11.690829"
}