{
  "article_id": "7f1839390ad0",
  "url": "https://www.hudsonriverblue.com/spain-finish-euros-group-stage-undefeated-advance-to-quarterfinals/",
  "title": "Spain finish Euros group stage undefeated , advance to quarterfinals",
  "date": "20250712T164500Z",
  "domain": "hudsonriverblue.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Spain finished the UEFA Women's Euro 2025 Group Stage with a win when they overcame a one-goal deficit early in the first half for a 3-1 victory over Italy on Friday evening. Spain tops Group B after going undefeated in three games, and will face hosts Switzerland in the Quarterfinals next Friday in Bern.\nItalian defender Elisabetta Oliviero drew first blood just ten minutes into the match, finding Spain in a rare moment of negligence. Italy's lead didn't last for long: Four minutes later, Spain's Athenea del Castillo carried the ball past four Italian players on her way towards Alexia Putellas, who sent a quick pass right back to Castillo with the back of her ankle. Castillo struck to even the game, which ended 1-1 at the half.\nHopes for a draw against the formidable Spanish team went out the window after Patricia Guijarro scored minutes into the second half. Italy played catch-up for the rest of the match, attempting to take possession from time to time but mostly focusing their energy on defending from Spanish strikes on all sides of the pitch.\nA late goal from Gotham FC striker Esther González put an exclamation point on Spain's win, but Italy's time at the Euros doesn't end here. With Belgium overcoming Portugal in the group stage, Le Azzurre moves on to the Quarterfinals in Geneva, where they will meet Norway on Wednesday.\nSpain: 20 shots, 8 shots on target, 75% possession, 705 passes, 90% pass accuracy, 7 fouls, 9 corners, 1 offside\nItaly: 13 shots, 2 shots on target, 25% possession, 273 passes, 73% pass accuracy, 3 fouls, 5 corners, 2 offsides\nGoals:\n• Italy, Elisabetta Oliviero, 10'\n• Spain, Athenea del Castillo, 14'\n• Spain, Patricia Guijarro, 49'\n• Spain, Esther González, 90 + 1'\nEsther González can't stop scoring\nIt had to be her.\nAfter securing their spot in the quarterfinals with a win over Belgium on Monday, Montse Tomé's Spain looked for fresh faces to play for a change in pace. She started Barcelona's Salma Paralluelo at striker, giving the 21-year-old an opportunity to score her first goal since April.\nSpain took the lead in the 49th minute on a goal from Patricia Guijarro. It looked as if La Roja was going to settle for a tighter scoreline than in their previous two group stage matches, when they fired 11 goals past Portugal and Belgium. But Tomé brought on González for Paralluelo in the 76th minute, and the momentum shifted towards Spain. Putellas got her hands on the ball in the final seconds of stoppage time, sending a pass over Italy's backline as González ran ahead to fly past the Italian side entirely. González's first striker was blocked by Italian goalkeeper Laura Giuliani, but it wasn't strong enough: The ball rolled into the net as González rushed forward to finish it off.\nIt wasn't the prettiest, nor was it the cleanest, but it was a goal, one that gave Spain a comfortable win. It also lifted González into the lead for the Golden Boot race, with four goals after three games.\n\"It was a very competitive match,\" said Spanish forward Salma Paralluelo. \"We had to withstand, so to speak, the storm. But we overcame it, managed to find our shape on the pitch, started playing our game, and from there, I think we began to create chances, and those opportunities eventually came.\"\nGonzález not only leads the Golden Boot at the Euros with four goals in three games, she's the leading scorer in the National Women's Soccer League with 10 goals in 13 games. That brings her total for club and country this year to an astonishing 14 goals in 16 games.\nGonzález is one of several strikers on this year's Spanish squad, but her ability to read and assess a pass and position herself to meet it sets her apart in terms of finishing on target. She struggled to finish while playing for Gotham in the NWSL early on in the season; however, her drive gives her the momentum to move on a riskier play rather than play it safe in make-or-break moments.\nIt's a mindset that brought Gotham back in front after going down a goal against Bay FC on June 21, and it's one that pushed her to score the stalemate-breaking goal in the matchup against Belgium.\nItaly move on\nFor the first time in 12 years, Le Azzurre are Euros quarterfinalists.\nThe Italian side gathered together on the pitch right after their match with Spain wrapped, huddled around phones as they watched the last few minutes of Belgium's match against Portugal in Sion. Belgian midfielder Janice Cayman scored a late game winner at the 96th minute, sending the Italians into a frenzy with their spot in the knockout stages officially confirmed.\nThe second Quarterfinal spot from Group B was precarious at best, although Italy's win against Belgium in their first group stage match placed them in prime position.\nNerves didn't seem to be a factor last night when Italy struck first. Oliviero scored her first international goal just 10 minutes into the game, netting a ball off a blocked shot by Spanish midfielder Mariona Caldentey.\n\"We knew there would be tough moments,\" said Oliviero. \"But we gave it everything we had. Heart, energy, and determination to make it to the quarter-finals. Spain are an incredible team, and I think we did an outstanding job standing up to them.\"\nDespite Spain's comeback four minutes later, Le Azzurre persevered, enduring a determined Spanish opposition throughout the first half. Things fell apart in the second. Italy were unable to secure more than 25% possession of the ball and only shot one more ball on target as a result. It mattered very little in the end, with Belgium's late goal sending the Italian side through to face Group A winner Norway in the quarterfinals.\n\"The first half was of the highest level,\" said Italy head coach Andrea Soncin. \"In the second we perhaps played with more focus on Portugal-Belgium in Sion than on our own. We came to play against Spain, the world champions, and we managed to do so for one half.\"",
  "word_count": 1026,
  "scraped_at": "2026-02-14T12:20:30.773174"
}