{
  "article_id": "7f3a8fee5d0a",
  "url": "https://www.nytimes.com/athletic/6367628/2025/05/21/fifa-uefa-infantino-club-world-cup-champions-league/",
  "title": "Are FIFA and UEFA in a forever war ? ",
  "date": "20250521T054500Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "If we are searching for a story to encapsulate the tension between FIFA, the world football governing body, and UEFA, its European counterpart, then let us begin with an anecdote about the prize money for this summer’s FIFA Club World Cup.\nA pet project of FIFA president Gianni Infantino, he describes the newly expanded 32-team tournament, which will be held in the United States, as the “most coveted” trophy in club football.\nAdvertisement\nAccording to multiple people briefed on FIFA’s planning for the tournament, who wished to remain anonymous to protect relationships, Infantino was determined to make a splash and, in FIFA-land, nothing makes a splash quite like dollar signs. Infantino wanted the winner of the Club World Cup to earn even more than the winners of the UEFA Champions League and to be able to unveil a figure that immediately captured the world’s attention. In the end, he fell narrowly short.\nThe winner of the Club World Cup, according to figures published by FIFA, may earn up to $125m (£93.5m). This is less than the $154m that UEFA recently announced Real Madrid earned by winning the Champions League in 2024.\nThat the ambition existed at all underlines how the two most powerful bodies in world football are in a forever war for the economic and political control of the global game.\nThese tensions spilled over once again in Paraguay last week when the eight European members of the FIFA Council, led by UEFA president Aleksander Ceferin, walked out midway through the FIFA Congress. They said this was because Infantino appeared to prioritise meetings with world leaders, including the U.S. president Donald Trump, in Qatar and Saudi Arabia. He subsequently arrived in Asuncion so late that FIFA’s congress needed to be delayed three hours due to an issue with his flight.\nIn a later statement, UEFA admonished Infantino for disrupting the timetable “to accommodate private political interests.” This week, they wished to take a more conciliatory tone. A spokesperson told The Athletic: “We value the strong and respectful relationship with FIFA, built on mutual trust and a shared passion for football. The recent episode was isolated and does not reflect our ongoing collaboration. We remain committed to working together in the best interest of the game.”\nAdvertisement\nYet through numerous conversations over the past week with football stakeholders, a different picture has emerged of relations between UEFA and FIFA. The “strong and respectful relationship” has revealed itself to be vulnerable to the slightest tremors.\nA senior executive within European football believes last week’s congress is a potential “inflection point” for the sport. They added: “An uneasy truce that had been found in mutual convenience has now been broken and the seeds of discontent may in time flourish against Infantino.”\nFIFA declined to comment on the specifics within this report but stressed it has no problem with anyone, while FIFA secretary general Mattias Grafstrom insisted after the congress FIFA has an “excellent relationship” with UEFA.\nThere is a growing sense within Europe that FIFA is seeking to make incursions into both UEFA’s dominance and income. For a long time, FIFA has been the organiser of World Cups and, in name at least, the most powerful organisation in the sport. But it rarely had a stake in major club competitions.\nEurope is financially dominant within football. UEFA makes more than double FIFA’s revenue, largely via its extremely successful annual Champions League for clubs and the European Championship for its international teams, which is held every four years.\nFor the four-year period between 2023 and 2026, culminating in a money-spinning World Cup in the United States, Canada and Mexico, FIFA is projecting $13billion in revenues. UEFA’s annual revenue for 2023-24 was €6.8billion ($7.64bn) alone. Four of the past five men’s World Cups have been won by European nations and 16 of the last 17 Club World Cup finals have been won by European sides.\nSince Infantino became president of FIFA in 2016, he has spoken repeatedly about the need to globalise the sport more effectively. His advocates would argue that expanding the men’s and women’s World Cups to 48 teams will increase competition revenues, which can in turn be redistributed across the world to FIFA’s member associations. This helps those associations to develop the sport in their territories, and allows more nations to take part in the showpiece event.\nAdvertisement\nBy diversifying FIFA’s interests into the club game, Infantino lessens its reliance on the men’s World Cup, which drives the vast bulk of its revenues. He has highlighted a complaint that many football supporters will share — that a handful of sides, even within Europe, are always at the top table.\nHe told club administrators at a FIFA diploma in club management session in 2022: “It is true there is a gap between a few countries in Europe — not even the whole of Europe, but a few countries — and the rest of the world.\n“What we need to do is to close the gap, not by bringing these big Europeans down, because these big Europeans also need to continue to grow. But the rest of the world has to grow as well and ensure we have a more competitive football world out there.”\nOn the surface, this is a valid argument. Yet within the corridors of power at UEFA, it is more often perceived as a power and cash grab that will detract from its own money-making potential and disrupt Europe’s hegemony.\nOn Monday, UEFA insisted the personal relationship between the organisation and FIFA is “very good”, built on “open communication and mutual respect”, which may appear absurd to those who witnessed half the FIFA Congress play out without Europe’s leading representatives in their seats.\nOr how Ceferin also exited the congress early in Bangkok last year, despite the fact his confederation had a joint German-Belgian-Dutch bid to host the Women’s World Cup in 2027. By then, however, it was firmly expected that Brazil would triumph.\nWithin Europe, there has been frustration at the continent’s struggles to secure a men’s World Cup. Between the 2006 edition in Germany until at least 2042 (presuming FIFA abide by their confederation rotation principle in 2038), Europe will not have solely hosted a men’s World Cup other than Russia in 2018. The 2030 edition will, remarkably, be shared between Spain, Portugal, Morocco, Argentina, Paraguay and Uruguay.\nAdvertisement\nThe feud between Ceferin and Infantino first spiked in 2018 when Infantino sought to push through a $25billion arrangement with the Japanese and Saudi-backed firm SoftBank, which would have created new global club and national team competitions. This deal would have included a reported $3billion towards each edition of the revamped Club World Cup, as well as a global version of the Nations League.\nThe Nations League had originally started as a UEFA project and the governing body wished to license it out to different confederations. UEFA had concerns that the SoftBank-FIFA tie-up could lead the Champions League to be undercut, the calendar to be interrupted and that new global competitions could eat into UEFA’s existing market share with broadcasters and sponsors.\nUEFA were first out of the blocks to oppose the possibility of the World Cup becoming a biennial tournament. FIFA did not formally endorse the idea but the FIFA Congress did agree to consult on the matter.\nCeferin, however, said European nations would boycott the tournament and claimed he had the support of the South American confederation CONMEBOL. Europe and South America have produced the winner of every men’s World Cup since its inception in 1930, and UEFA and CONMEBOL formed an alliance to rebut FIFA’s aspirations, even working together to launch a shared office space in London in April 2022. As part of this, they launched a Finalissima event, which sees the winners of the European Championship play the winners of Copa America.\nThe inference of the joint venture was clear; if FIFA continued to pursue proposals that Europe and South America did not think was in their interests, then those confederations would work independently to achieve their own objectives. They successfully rebutted the idea of a biennial World Cup but more recently CONMEBOL has moved closer to FIFA, particularly since securing the 2027 Women’s World Cup in Brazil. It wants FIFA to expand the 2030 men’s World Cup to 64 teams to mark the 100th anniversary of the tournament — and, more specifically, secure more games to be hosted in South America.\nThe UEFA-CONMEBOL alliance in London is now on the back burner. Sources describe the operation as very slim and that it may even be wound down. In Paraguay, CONMEBOL’s growing relationship with Infantino was highlighted when CONMEBOL’s HQ and the Bourbon Hotel chain dedicated a tower in the FIFA president’s name.\nAt the height of the animosity between UEFA and FIFA, there were outward displays of tension. When Infantino, during a speech at the UEFA Congress in 2020, called for a review of the men’s calendar, the UEFA president Ceferin said: “No football administrator, no matter the size of his ego, should think we are the stars of the show…”\nAdvertisement\nThe unease greatened in the spring of 2021 when plans for a closed European Super League for the continent’s elite clubs appeared and disappeared in the space of three days, and UEFA’s suspicions of FIFA having prior knowledge and complicity in the Super League — which FIFA denies — have never fully shifted.\nLast week at the FIFA Congress in Asuncion, all these old hostilities sprang to the surface.\nIn a statement after their eight members of the FIFA Council walked out, UEFA said: “We are all in post to serve football; from the streets to the podium.”\nTheir departure and condemnation certainly rankled some at FIFA, and there are plenty of similarities between Infantino, who flew into Asuncion on a Qatari private jet, and Ceferin, who traversed Euro 2024 in Germany in a private plane. A private jet was spotted leaving Asuncion not long after the European executives walked out of the FIFA Council. UEFA did not comment when asked on Monday if Ceferin left the country by private jet.\nThose UEFA figures who walked out of the congress are handsomely remunerated for their FIFA work. Ceferin, as a confederation president and FIFA Council vice-president, is eligible to receive a net annual compensation of $300,000. Neither UEFA nor FIFA commented when asked whether he accepts this money from FIFA.\nThe pair have other challenges, too. By venturing into the club game with the Club World Cup, they may wish to share notes on the challenges of handling the demands of Europe’s richest and most widely-supported teams, who, with the exception of Real Madrid and Barcelona, are usually represented by the European Clubs’ Association (ECA).\nWhile Infantino talks about globalising the sport, the Club World Cup is once again a win for Europe’s richest teams. Participation fees will range between $12.8million and $32.8m for European clubs, while the maximum a South American team will receive to participate is $15.2m. Teams from North America, Asia and Africa will receive $9.6m and Oceania $3.6m.\nAdvertisement\nWhen we then add in the tens of millions of dollars available in prize money, which is likely to be largely secured by European teams owing to their bigger budgets, then the Club World Cup is likely to further entrench and extend the dominance of the small number of European clubs that Infantino bemoaned.\nThe FIFA president, however, reiterated in Asuncion last week how he believes football’s growth potential will come outside Europe. He said with “relatively small investment” from Saudi and the U.S., the global football GDP (gross domestic product) could grow from $270billion a year to half a trillion.\nThen the bees buzzing over the pot of honey may at last be satisfied.\n(Design: Eamonn Dalton for The Athletic. Photos: Getty Images)",
  "word_count": 1976,
  "scraped_at": "2026-02-14T12:53:37.966708"
}