{
  "article_id": "7f735ecf383f",
  "url": "https://www.heritagefl.com/story/2025/01/03/news/weekly-roundup-of-world-briefs/21011.html",
  "title": "Weekly roundup of world briefs",
  "date": "20250102T203000Z",
  "domain": "heritagefl.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Central Florida's Independent Jewish Voice\nIsrael investigating suspected settler attack on West Bank mosque\nBy Ben Sales\n(JTA) — Israeli authorities are investigating after a mosque in the northern West Bank town of Marda was torched and graffitied with Hebrew slogans.\nNo one was injured in the incident.\nFootage from the scene appeared to show burn marks and Hebrew graffiti featuring a Star of David and reading “revenge” and “burn the mosque, build the temple.” Israel’s police and Shin Bet security service have opened an investigation and have not yet made any arrests.\nPalestinian leaders accused settlers of the vandalism, and Israeli media are also reporting that Jewish Israelis are suspected of perpetrating the attack.\nHuman rights groups have reported a spike in settler violence since Hamas’ Oct. 7, 2023, invasion launched Israel’s multi-front war. The Biden administration has sanctioned several extremist settler leaders and groups in that time, though it indicated recently to the Times of Israel that it would not place sanctions on Itamar Ben Gvir and Bezalel Smotrich, two far-right members of the Israeli cabinet.\nOver the past year-plus, Israel has engaged in a series of operations in the West Bank to fight cells of terror groups. Hundreds of Palestinians have been killed, and thousands arrested, in the territory in that time. Dozens of Israelis have also been killed in terror attacks in the West Bank and Israel since the Oct. 7 attack.\n‘Most Aussies support you,’ TV host Erin Molan tells Israelis\nBy JNS Staff\n(JNS) — Former Sky News Australia anchor Erin Molan on Monday met with Israeli President Isaac Herzog at the President’s Residence in Jerusalem.\nMolan, who is visiting Israel as part of a delegation organized by the Australia Israel & Jewish Affairs Council, has defended Israel outspokenly on air, including by saying several times that “Israel is held to a standard that doesn’t exist.”\nFollowing her recent departure from Sky News Australia, some cited her pro-Israel views as the reason, but advocates of the network deny this, noting that it is staunchly pro-Israel in its editorial approach and has several other outspokenly pro-Israel presenters who have not been fired.\nAsked last week by news.com.au as to the reason for her departure, she replied: “Budget.” She added: “I was never asked by anyone to tone down anything – and nor would I.”\nWith regard to rising anti-Israel and antisemitic sentiment in Australia, Molan told Herzog: “I can assure you the vast majority of Australians stand with you. The loud minority gets a very big run. Clearly, we all believe, and we stand with you.”\nOn Sunday, Molan met Yossi Schneider, cousin of hostage Shiri Bibas, and Ashley Waxman Bakshi, cousin of hostage Agam Berger, along with the founder of the “I’m That Jew” movement and the CEO of the Peres Center, Efrat Duvdevani.\nHerzog on Monday praised Molan’s “moral clarity” with regard to Israel’s war against the Hamas terrorist group.\n“We are under this huge attack—endless attack—by people who don’t understand, who don’t get the picture,” Herzog told Molan. She thanked him and, referencing Israelis, said: “You see so much horror and terror and heartbreak, but then you also feel the most incredible sense of hope.”\nMiami mayor: ‘We reaffirm our solidarity’ with Jews in US, Israel, world\n(JNS) — Some 21 mayors, vice mayors and community leaders attended Greater Miami Jewish Federation’s third annual “Standing Strong Together Against Antisemitism” press conference—this year part of a Nova Music Festival exhibit traveling across America—in North Miami, Fla., on Dec. 18.\nDescribing the immersive nature of the exhibit designed to provide visitors with a snapshot of the Hamas-led terrorist attacks in Israel on Oct. 7, 2023, Daniella Levine Cava, mayor of Miami-Dade County, said: “These beautiful efforts here make sure that the world can touch and feel and see what has happened, and how it must never happen again.”\nMusic manager Scooter Braun helped bring the exhibit to Miami, after major showings in New York City and Los Angeles. He stated that “we want people to immerse themselves in this experience so they can see their own humanity in it” and “we want them to see themselves at any festival they’ve gone to.”\nFrancis Suarez, the mayor of Miami, wrote on Instagram that he “proudly participated” in the press conference.\nHe wrote that in Miami, “we stand unwavering in our commitment to protecting our residents from hate and terror. We will not allow any group to disrupt our peace, safety or way of life. The Jewish community—here, in Israel and across the globe—continues to face those who seek to destroy their right to live in peace and security. Today, we reaffirm our solidarity with them and vow to always defend the values of freedom, justice and humanity.”\nRepresentatives from other organizations who attended included the Anti-Defamation League, the American Jewish Committee and the Israeli Consulate.\nWreckage of Israeli chopper downed in Yom Kippur War found in Syria\nBy JNS Staff\n(JNS) — Israeli forces in Syria have found the wreckage of an Israeli Air Force helicopter which crashed during the 1973 Yom Kippur War.\nThe remains of the helicopter, which crashed due to bad weather conditions during a rescue mission, were uncovered last week on the Syrian side of Mount Hermon.\nThe wreckage was returned to Israel on Saturday, and the families of the six victims of the April 27, 1974, crash were notified, Israel’s Channel 12 News reported on Sunday.\nIsraeli forces took up defensive positions on the Syrian side of Mount Hermon shortly after Syrian President Bashar Assad was ousted by rebels on Oct. 8.\nIsraeli Prime Minister Benjamin Netanyahu has said that Israel will remain on the Syrian side of the strategic plateau until another arrangement can be found.\nIsraeli officials have described the move as limited and temporary, with the aim of ensuring the security of Israel’s border area.\nIAF strikes Hamas terrorist in Khan Younis humanitarian zone\n(JNS) — The Israeli Air Force on Sunday night carried out an airstrike against a Hamas terrorist operating in the Khan Younis humanitarian zone in southern Gaza, according to the military.\nThe Israel Defense Forces emphasized that many steps were taken before the attack to minimize the risk to civilians.\n“This is a further example of the Hamas terrorist organization’s systematic abuse of civilian infrastructure and the Gaza population in violation of international law,” the IDF said. “The IDF will continue to operate against Hamas in defense of the citizens of Israel.”\nThe IDF also announced on Sunday night that a reservist with the Harel Brigade’s 429th Battalion was seriously wounded earlier in the day during combat in central Gaza. The soldier was evacuated to a hospital for medical treatment and his family was notified.\nIsraeli soccer team drops Arab goalie who played on Palestinian team\nBy JNS Staff\n(JNS) — An Israeli soccer team has released an Arab-Israeli goalie after fans expressed outrage over his appearance with a Palestinian Authority team in 2017.\nHapoel Beit She’an soccer club released Ganem Mahajna, 33, who it had just hired last week, according to Israeli media reports. The decision followed a wave of social media backlash as the 15-month-old war against Hamas in Gaza continues.\nThe team’s director initially came out in support of Mahajna, saying the club “believes in true coexistence” and that the outraged fans “do not even attend the games.”\nHowever, the player was subsequently dropped amid the public criticism even before he took to the field in any of the club’s matches.\nDozens hurt, three critically, in fire at Jerusalem seminary\nBy JNS Staff\n(JNS) — A fire that erupted on Monday morning at a Jerusalem seminary dormitory on David Yellin Street caused injuries to almost 50 people, including three in critical condition, according to the Magen David Adom emergency medical service.\nFirefighting teams worked to put out the fire raging in the upper floors of the dormitory and rescued scores of female students who were trapped inside the building, Hebrew media reported.\nThe volunteer-based emergency response service United Hatzalah reported that an additional two individuals were listed in moderate condition and the rest suffered light injuries. All were evacuated to Shaare Zedek Medical Center and Hadassah Ein Kerem Hospital.\nAccording to Ynet News, one of those critically injured was the seminary’s security guard, who ran into the building to rescue the students before first responders arrived. The rescue efforts were reportedly delayed because the doors to the seminary were chained shut.\nA 17-year-old boarding school student told Israel’s Channel 12, “A friend of mine woke me up because she smelled smoke. She woke us all up. We are five in the room, and you can’t get out of our window. We opened the door, [but] smoke came in, so we closed it. I wanted to call firefighters but couldn’t even remember the number. We opened the window, and people told us to get out. We couldn’t see anything, there was smoke everywhere. We couldn’t tell if it was just smoke or [smoke with] fire but we all held hands and just got out.”\nIraq’s pro-Iranian militias reportedly agree to stop firing on Israel\nBy Erez Linn\n(Israel Hayom via JNS) — A senior figure in Iraq’s pro-Iranian Al-Nujaba Movement militia (known as HHN) has confirmed that Tehran’s proxies have reached an agreement with Iraqi Prime Minister Mohammed Shia’ al-Sudani to cease military operations targeting Israel in support of Hamas in Gaza, the Lebanese pro-Hezbollah Al-Akhbar reported on Monday.\nThe agreement comes amid international pressure to dismantle the Iraqi factions and transfer their weapons to state control.\nSpeaking to Al-Akhbar, the HHN leader revealed that the factions have also agreed “not to interfere in Syrian affairs and to monitor the situation from a distance, while also awaiting the policy directions of U.S. President-elect Donald Trump, particularly regarding the Middle East and Iran.”\nThe source criticized American and Israeli efforts promoting the dissolution of the Iraqi government’s umbrella organization for militias, the Popular Mobilization Forces, describing these attempts as aimed at forcing the surrender of the “resistance axis” that has challenged Israel over the past year.\nPrime Minister al-Sudani recently dismissed suggestions of disbanding the PMF, stating in a televised interview that “such claims are purely speculative and come from those who oppose the political process.”\nKazem al-Fartousi, spokesperson for the Kata’ib Sayyid al-Shuhada Brigades, another pro-Iranian militia, told Al-Akhbar, “The operations of the factions against Israel were linked to Hezbollah’s operations in Lebanon. When a ceasefire was reached in Lebanon, the Iraqi factions also halted their operations. There are also partners in Iraq with reservations about these operations and their perspectives must be considered.”\nHe added, “The situation is currently under review, and communication is ongoing among the resistance axis to coordinate positions and develop a unified vision.”\nIn response to a JNS query on these developments, an IDF spokesperson said, “The military does not comment on foreign reports.”\nOriginally published by Israel Hayom.\nIran feeling heat, fears Israeli attack in near-term\n(JNS) — Iran is worried about a direct attack by Israel against its strategic sites in the near future, Channel 12 reported on Sunday.\nThe Iranians have reached this conclusion due to a series of events, including Israel’s agreement to a ceasefire with the Tehran-backed Hezbollah terror group in Lebanon. Iran’s leadership has interpreted this move as meant to free up Israel to concentrate on the Islamic Republic directly.\nTwo other events playing into their conclusion: Israel’s elimination of Iranian air defense systems in October as a step in paving the way for future Israeli Air Force sorties, and the election of Donald Trump as president of the United States.\nIsrael wants to do everything it can to prevent Iran from returning to Syria and Lebanon, and the Iranians are already investing money and resources into doing so, according to Channel 12.\nThe Houthis in Yemen also came up for discussion in the Security Cabinet meeting on Sunday. The Iranian-proxy has increased missile launches against Israel, showing a certain independence to the point of upsetting the Iranians. They are no longer acting as a classic proxy of Iran, according to the report.\nThe Houthis have advanced weapons that include cruise and surface-to-surface missiles, as well as drones. These assets are spread out over large areas and are difficult to reach, making it challenging for Israel to create a bank of targets, Channel 12 said.\nMultiple Houthi missiles have hit Tel Aviv and its environs, prompting Prime Minister Benjamin Netanyahu to promise the Israeli public that the terror group would be dealt with.\n“Just as we have acted forcefully against the terror arms of Iran’s axis of evil, so too will we act against the Houthis,” he said on Sunday.\n“However, in this case, we are not acting alone. Like us, the U.S. and other countries see the Houthis not only as a threat to international maritime navigation but to the international order as well,” he added.\n“Therefore, we will take forceful, determined and sophisticated action. I will say this, even if it takes time, the result will be the same as it has been with the other terror arms,” said Netanyahu.\nIDF downs Houthi attack drone heading towards Israeli territory\n(JNS) — The Israel Defense Forces shot down an attack drone launched by Iranian-backed Houthi terrorists from Yemen before it crossed into Israeli territory on Monday, the military announced in a statement.\nIn accordance with IDF policy, no air-raid sirens sounded in the Jewish state as the aerial attack from Yemen was thwarted, the army added.\nMultiple Houthi missiles have hit Israel’s densely-populated central region in recent days, prompting Prime Minister Benjamin Netanyahu to promise the Israeli public that the terror group will be dealt with.\n“Just as we have acted forcefully against the terror arms of Iran’s axis of evil, so too will we act against the Houthis,” Netanyahu said on Sunday.\nThe Houthis in Yemen came up for discussion in an Israeli Security Cabinet meeting on Sunday. The Iranian proxy has stepped up missile launches against Israel to the point of upsetting the Iranians. They are no longer acting as a classic proxy, according to a report from Israel’s Channel 12 News.\nThe Houthis have advanced weapons that include cruise and surface-to-surface missiles, as well as drones. According to the report, these assets are spread out over large areas and are difficult to reach, making it challenging for Israel to create a bank of targets.\nIsrael’s Christian population grows to 180,300 on Christmas 2024\n(JNS) — On the eve of Christmas 2024, Israel’s Christian population is approximately 180,300, accounting for 1.8 percent of the country’s total population. This represents a 0.6 percent increase from 2023, according to data published Tuesday by the Central Bureau of Statistics.\nArab Christians constitute 78.7 percent of the Christian population in Israel and 6.9% of the nation’s overall Arab population.\nMost Arab Christians reside in the Northern District (68.2 percent) and Haifa District (14.7 percent).\nNon-Arab Christians are more concentrated in the Tel Aviv and Central Districts (41.3 percent), with 34.8 percent living in the Northern and Haifa Districts.\nThe cities with the largest Arab Christian populations include Nazareth (19,800), Haifa (18,700), Jerusalem (13,100), and Nof HaGalil (10,500).\nIn 2022, 762 Christian couples married in Israel. The average age at first marriage was 30.9 for Christian grooms and 27.6 for Christian brides, both higher than the average for other religious groups in the country.\nIn 2023, Christian women gave birth to 2,193 infants, with approximately 74 percent (1,616 infants) born to Arab Christian mothers.\nThe total fertility rate for Christian women in 2023 was 1.64 children per woman, with Arab Christian women having a slightly lower fertility rate of 1.52 children per woman.\n- President nominates Kevin Warsh as next Federal Reserve chair\n- After excluding Israel for 2 years, Guinness World Records caves to legal pressure\n- Actress Tal Berkovich killed in road accident in southern Israel\n- 'We did not discuss disarmament 'for a single moment'\n- NYPD investigating, after car repeatedly hits doors at Chabad\nFar from the Land of Disney A Voice from Uganda: The Story of Samuel Kyeyune from the Abayudaya Community in Uganda and Kulanu, New York\nEd Borowsky\nLebanese PM pledges to stay out of war after Hezbollah warning\nJNS Staff\n'Erdoğan is not a barrier to ISIS; he is ISIS,' Israeli minister says\nJNS Staff and Amelie Botbol",
  "word_count": 2734,
  "scraped_at": "2026-02-14T12:19:41.254711"
}