{
  "article_id": "7f88197aba60",
  "url": "https://www.printweek.com/content/news/integrity-communications-group-proud-to-support-young-boxer-ruby-white",
  "title": "Printweek - Integrity Communications Group proud to support young boxer Ruby White",
  "date": "20251119T184500Z",
  "domain": "printweek.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "White trains with Sturminster Newton Amateur Boxing Club, and the 18-year-old manages a full-on schedule alongside her day job as a window cleaner.\nOn Mondays and Tuesdays she trains at her local gym, while at weekends she trains at the England boxing camp alongside the national squad.\nAfter triumphing in last year’s Women’s Minimumweight category at the World Boxing U19 Championships held in Pueblo, Colorado, White is set to step up a weight class at an upcoming competition in Europe, her fourth on the European stage.\nThe support from Midsomer Norton-headquartered Integrity Communications Group (ICG) will help White with an array of expenses including specialist support for nutrition and physiotherapy, boxing lessons, high-quality equipment, and travel costs.\nICG CEO Mark Cornford posted about the sponsorship on LinkedIn and said he felt “emotional and proud” after meeting White.\n“She’s honest, open, driven but also kind, and she shows great courage, determination, unselfishness and cheerfulness.\n“There’s a lot of negativity and worry in the world, so if we can help a young, aspiring athlete to fulfil her potential and achieve her dream of a gold medal at the Olympics then it makes me happy,” he said.\n“We are proud to support her.”\nWhite commented: “Excitement and nerves fill my mind on fight day, and I love it.\n“The excitement comes from doing what I love, and the nerves show that I care. As my past wins have raised expectations, the pressure to win has grown, but I am willing to give it my all.”\nLast year White also won SportsAid’s ‘One-to-Watch’ Award, which recognises Britain’s brightest young sporting prospects. She came out top of some 1,000 rising stars across 60 different sports who were in contention for the accolade.\nPrevious winners include Olympic champions Tom Daley and Alex Yee, and Paralympic gold medal winner Hollie Arnold.\nICG's services include security print, labels, direct mail, web-to-print, app development and bespoke software. It had sales of just over £69m last year.\nIts support of grassroots sport has previously included sponsoring the Paulton Rovers Ladies Reserves football team, playing in Division One of the Somerset County Women’s League.",
  "word_count": 353,
  "scraped_at": "2026-02-14T12:51:02.393724"
}