{
  "article_id": "7f9d873ddfb9",
  "url": "https://www.investegate.co.uk:443/announcement/rns/celtic--ccp/results-for-the-year-ended-30-june-2024/8419504",
  "title": "Results for the year ended 30 June 2024 | Company Announcement",
  "date": "20240916T183000Z",
  "domain": "investegate.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Celtic PLC\n16 September 2024\nThe information contained within this announcement is deemed to constitute inside information as stipulated under the Market Abuse Regulations (EU) No. 596/2014. Upon the publication of this announcement, this inside information is now considered to be in the public domain.\nCeltic PLC\nAnnouncement of Results for the year ended 30 June 2024\nSUMMARY OF THE RESULTS\nKey Operational Items\n· Winners of the SPFL Premiership and Scottish Cup in season 2023/24.\n· Winners of the SWPL in season 2023/24.\n· Qualification for the group stages of the UEFA Champions League for season 2024/25.\n· Participation in the group stages of the UEFA Champions League in season 2023/24 achieving 4 points.\n· 24 home matches played at Celtic Park (2023: 26 games).\nKey Financial Items\n· Group revenue increased by 3.9% to £124.6m (2023: £119.9m).\n· Operating expenses including labour increased by 10.4% to £105.4m (2023: £95.4m).\n· Gain on sale of player registrations of £6.6m (2023: £14.4m).\n· Acquisition of player registrations of £16.6m (2023: £13.0m).\n· Profit before taxation of £17.8m (2023: £40.7m).\n· Year-end cash of £77.2m (2023: £72.3m).\nFor further information contact:\nCHAIRMAN'S STATEMENT\nI should start by congratulating Brendan, in his first season back at Celtic Park and the men's team for securing the Scottish Premiership and Scottish Cup. I also extend my congratulations to Elena and our women's team for securing the Club's first ever SWPL Championship. Elena joined Celtic in February 2024, and led a competitive and exciting title run, which went to the final few minutes of the season. Success is something we can never take for granted. It is important to celebrate and appreciate these wins, but also to recognise that we should always strive continuously to improve.\nThe results for the year ended 30 June 2024 show an increase in revenue to £124.6m (2023: £119.9m) with a corresponding profit before tax of £17.8m (2023: £40.7m). The £4.7m increase in revenue reflects several factors including higher participation fees in the UEFA Champions League in season 2023/24, when compared to the previous season, alongside stronger retail performance in the year. The £22.9m decrease in profit before tax, although significant, was in line with expectations due to a number of known and anticipated factors. In relation to football activities, our gain on sale achieved in the year was £7.8m lower than in the prior year. We also invested higher sums into the men's team compared to the prior year in the form of salaries. In addition, we have experienced a rise in overhead costs driven by the high inflationary environment in which the business has operated over the last year. There was also the absence of £13.5m of non-recurring other income which was specific to the prior year.\nOur year end cash was £77.2m (2023: £72.3m). Despite Champions League qualification, the increase in cash was more modest than it may have been owing to the investment into the team in terms of transfer expenditure and wage costs in the year under review. This was coupled with the commencement of significant capital expenditure projects, including the Barrowfield re-development and a number of stadium maintenance projects.\nFurther to the investment in player registrations of £13.0m in the previous financial year ended 30 June 2023, the Club made significant investment by committing an additional £16.6m in the year under review. This took our total spend to £68.0m over the three financial years to 30 June 2024. Since the year end, and up to the closure of the transfer window on 30 August 2024, we have invested a further £31.2m into player registrations (including transaction costs). Over the summer transfer window, we twice broke the Club's previous record transfer. As a result of this period of sustained investment, our current squad carries the highest value and resulting amortisation charge in the Club's history, by a considerable margin.\nIn the summer 2024 transfer window, we have acquired the permanent registrations of Kasper Schmeichel, Viljami Sinisalo, Paulo Bernardo, Adam Idah, Arne Engels, Auston Trusty and Luke McCowan and the temporary registration of Alex Valle. We permanently transferred out the registrations of Hyeon-gyu Oh, Sead Haksabanovic, Matt O'Riley, Michael Johnston, Yuki Kobayashi, Ben Siegrist and Tomoki Iwata. We also temporarily transferred out the registrations of Gustaf Lagerbielke and Hyeokkyu Kwon.\nWinning the Scottish Premiership in 2023/24 resulted in automatic qualification into the new UEFA Champions League format for season 2024/25. This new structure brings more variety, the opportunity for more teams to participate at the highest level and a fresh dynamic for fans to enjoy. Last year's Scottish Premiership and Scottish Cup trophies brought our total men's team honours to 118, including 54 league titles, 42 Scottish Cups, 21 League Cups and a European Cup. When compared to the 80 trophies won by the start of season 1999/2000 this represents a truly remarkable achievement over the last 25 years. We are also firmly established as a European club from a participation perspective. Over the same 25-year period we have participated in either knock-out round or group stage European competition in 23 seasons, 12 of which were in the Champions League. As well as delivering domestic success, we are determined to progress as far as possible in European competition and improve upon our recent record. We cannot and must not be complacent and we must strive for progression as a club as the football industry evolves at a remarkable pace.\nNotwithstanding the domestic success we have enjoyed and the establishment of Celtic as a regular European football participant, it is important that we do not deviate from our strategy, which has been successful over many years, based on maintaining a self-sustaining financial model. This involves targeting Champions League qualification each year along with introducing young players into our team, either from our academy or through recruitment, with a view to developing them and helping them to progress their careers. This is not without its challenges as domestic media rights have been unable to keep pace with the media rights environment of our competitor markets and football industry inflation in general over recent years. This means that securing the best players is more challenging and we must work harder than ever to bring success. Our strategy has been crucial to the domestic success of recent years, and it is one your Board intends to maintain. In line with all other clubs who compete in European competition, we must also be cognisant of the UEFA Financial Sustainability rules and look to balance the short term and long-term objectives of our Club. This is a difficult balance, but a vital one.\nAs a Club we are well represented domestically with the governing bodies. Through my capacities as Vice Chairman at the European Club Association (ECA), a member of the ECA Executive Committee and a Board member on the newly formed joint venture between the ECA and UEFA, we are able to have close proximity to, and influence over, the future of European football. This is important to the interests of Scottish football as a whole.\nI wish to express my condolences to the family of John Keane who sadly passed away in June of this year. John served as a Non-Executive Director of The Celtic Football and Athletic Company Ltd (\"CFAC\") for over 20 years, and in 2013 was confirmed as the Honorary Chairman. John was a Celtic supporter all his life and played a pivotal role in saving our Club from insolvency. He was there when Celtic needed him most and for that we will always be grateful. I would also like to take this opportunity to pass on my gratitude to Michael McDonald. Michael retired from the CFAC Board on 30 June 2024. He was a Director for 30 years and a true lifelong Celtic fan. His involvement with Celtic from the 1990s demonstrated that he always had the interests of Celtic at heart, through thick and thin, and for that I wish to thank him.\nThanks also go to all of our Celtic colleagues for their contribution to delivering another successful year and to all the Club's supporters who give the Club their crucial and relentless backing, year after year.\nPeter T Lawwell, Chairman\n16 September 2024\nCHIEF EXECUTIVE'S REVIEW\nThe year ended 30 June 2024 was successful on and off the field of play. On the pitch, the men's first team secured the Scottish Premiership and Scottish Cup Double and our women's team won our Club's first ever SWPL title. I congratulate Brendan and Elena, team captains Callum and Kelly, and all of the players, team staff and colleagues at Celtic, whose hard work and dedication made our success possible. I also thank the Celtic support, who carried our teams through challenging times during the season and shared in the success at its conclusion. Off the pitch, the financial results reflected that success as well as the continued commitment of our supporters, partners and sponsors, for which we are very grateful. This allows us to continue to invest in improvement and progress, both for the short and long term. Our primary objectives continue to be the domination of football in Scotland and competing in the group stages of the UEFA Champions League.\nOur men's team's domestic campaign got off to a challenging start, with an early exit from the League Cup in the second round away to Kilmarnock as well as some disappointing league results. We had full confidence that Brendan's leadership, style of play and winning mentality would bring the best out of the team over the course of the season. This proved to be the case, and having won the league at Kilmarnock on 15 May 2024, the team went on to win the Scottish Cup on 25 May 2024 against Rangers. The scenes at Celtic Park and Hampden will live long in the memory. Special mention must be made of James Forrest, whose Scottish Cup medal was his 24th major honour for the Club, one more than Billy McNeill and only one fewer than Bobby Lennox. James's hard work, dedication and humility in over 500 senior appearances for Celtic serve as an inspiration to all of us. We entered the Champions League group stage for the second consecutive season, playing against Feyenoord, Atletico Madrid and Lazio. We achieved four points, an improvement over the two points in the previous season, but ultimately we were disappointed to finish fourth in the group. We are committed to improving in the Champions League, and look forward to the opportunities presented by the new format.\nFollowing on from securing the Scottish Cup in season 2022/23, Fran Alonso left as head coach of our women's team to pursue another opportunity in women's football in the USA. We wish Fran well and thank him for his contribution. We were delighted to appoint Elena Sadiku as head coach in January 2024. Arriving in a new country and new club mid-season is not without challenges but Elena immersed herself in Celtic and her inspirational approach led our women's team to their first ever SWPL title in dramatic circumstances on the final day of the season. The importance of this milestone achievement cannot be over-estimated, and it will form the basis for future development and success. Following a strategic review, we have restructured Women's Football and our Girls' Academy divisions and have increased our investment to the highest levels ever seen at the Club. By virtue of winning the league, our team entered the Women's Champions League qualifiers, defeating Kup Kuopio of Finland and FC Gintra of Lithuania in the first round group, setting up a play-off against Vorskla of Ukraine for qualification to the group stages for the first time. Just as it is for our men's team, further progress in the Champions League is the goal.\nWhilst it is important to reflect on our success, we must look forward. There is no room for complacency. We cannot stand still and we are determined to improve. In support of our strategic objectives of dominating domestic football and competing in the Champions League, we have continued to invest across the Club.\nDuring the summer 2024 transfer window, we invested significant sums to improve the squad for the season ahead. Player trading is a key aspect of our strategy both for performance and financial sustainability. As some players move on it is crucially important that we identify, attract, develop and retain top talents at the Club. The continued development of our football technical functions will therefore be a focus for the year ahead, both at first team and academy levels, along with continued investment in our infrastructure. During the year, we continued to upgrade and improve our first team and B team training facilities at Lennoxtown, with new changing, medical and sports science facilities following the development of the performance gym and first team lounge.\nJust as it is important to continue to recruit players, so it is crucial to develop them through our academy. With that objective in mind, in December 2023, we commenced the creation of a new facility at our historic training location at Barrowfield. This represents the most significant capital project the Club has undertaken since the re-development of Celtic Park, which was completed in 1998. The facilities at Barrowfield, including a full size indoor pitch, changing facilities, gym and technical departments, will be completed over the coming months and will deliver an outstanding new environment for our women's team and boys and girls academy, with the strategic objective of creating Champions League players for our first teams.\nAs the football environment becomes increasingly challenging for clubs such as ours, we must continue to invest strategically to improve all aspects of our operations. During the close season, we commenced a number of significant stadium improvement projects, including upgrades to the first team changing facilities, the tunnel and structural maintenance. Whilst these are not always immediately visible, they are vital to maintaining and developing one of our key assets. In addition to infrastructure, in the year ahead we will continue to invest to take our Club operations forward. We were delighted at the response to the Celtic FC Fans' Survey, the biggest ever survey of Celtic supporters worldwide, and work is ongoing to process the valuable opinions shared. This will help inform decision-making at the Club, including in relation to our International Development and Digital Strategies.\nCeltic F.C. Foundation continues to be at the heart of everything that we do. For the first time ever we opened Celtic Park on Christmas Day as an extension of the Paradise Pitstop project, which has been supporting our local community on four days a week throughout the year. I thank our colleagues in the Foundation, volunteers and trustees, whose work continues to make such a positive impact on the lives of those with whom the Foundation works. We all share the ambition to continue to grow Celtic F.C. Foundation, and we are grateful for the continued support of Celtic fans around the world for our Foundation.\nSadly, in the last six months we have lost two of our colleagues. James Peacock worked for Celtic for over 30 years and was a well-known and popular figure around our catering and restaurant business. Vanessa Clinton worked in our finance function for over nine years and was a hugely popular figure in the office. I extend my condolences to their families and their colleagues for the loss of these two valued colleagues and friends. Our people are the foundation for success at Celtic, and at difficult times we come together to support each other.\nIn closing, I take this opportunity to thank our supporters for their phenomenal commitment to our Club. Supporters are the life blood of Celtic. The sacrifices and commitment that our supporters contribute are truly exceptional. Without your support, none of what the Club achieves would be possible.\nMichael Nicholson, Chief Executive\n16 September 2024\nCONSOLIDATED STATEMENT OF COMPREHENSIVE INCOME\nFor the year ended 30 June 2024\nCONSOLIDATED BALANCE SHEET\nAs at 30 June 2024\nCONSOLIDATED STATEMENT OF CHANGES IN EQUITY\nFor the year ended 30 June 2024\nCONSOLIDATED CASH FLOW STATEMENT\nFor the year ended 30 June 2024\nNOTES TO THE FINANCIAL STATEMENTS\n1. BASIS OF PREPARATION\nThe principal accounting policies applied in the preparation of this announcement are detailed within the Group financial statements. These policies have been consistently applied to financial years 2024 and 2023, presented, for both the Group and the Company.\nGoing Concern\nThe Group has adequate financial resources available to it, including currently undrawn bank facilities, together with established contracts with a number of customers and suppliers.\nAdditionally, the Group continues to perform a detailed budgeting process each year which is reviewed and approved by the Board. The Group also performs regular re-forecasts and these projections, which include profit/loss and cash flow forecasts, are distributed to the Board. As a consequence, the Directors believe that the Group is well placed to manage its business risks successfully over the medium term.\nIn consideration of the above, the Directors have a reasonable expectation that the Group and Company has adequate resources to continue in operational existence for the foreseeable future. Thus they continue to adopt the going concern basis of accounting in preparing the annual Financial Statements and have not identified a material uncertainty in this regard.\n2. REVENUE\n3. EXCEPTIONAL OPERATING INCOME/(EXPENSES)\nThe exceptional operating credit of £0.2m (2023: expenses of £0.1m) can be analysed as follows:\nSettlement agreements on unforeseen contract termination are costs in relation to exiting certain employment contracts.\nThe compensation for player salaries is recovery of labour costs as a result of players being injured while on international duty.\nThese events are deemed to be unusual in relation to what management consider to be normal operating conditions as the occurrence of these events is sufficiently irregular enough to warrant it as exceptional.\n4. DIVIDEND ON CONVERTIBLE CUMULATIVE PREFERENCE SHARES\nA 6% non-equity dividend of £0.53m (2023: £0.53m) was paid on 30 August 2024 to those holders of Convertible Cumulative Preference Shares on the share register at 26 July 2024. A number of shareholders elected to participate in the Company's scrip dividend reinvestment scheme for the financial year to 30 June 2024. Those shareholders have received new Ordinary Shares in lieu of cash. No dividends were payable or proposed to be payable on the Company's Ordinary Shares.\nDuring the year, the Company reclaimed £nil (2023: £nil) in respect of statute barred preference dividends in accordance with the Company's Articles of Association.\n5. TAX ON ORDINARY ACTIVITIES\nThe corporation tax payable as at 30 June 2024 was £2.3m (2023: payable of £2.3m). The current year tax charge was £4.4m (2023: £7.4m) and net tax payments in the year were £7.0m (2023: £4.3m). The available capital allowances pool is approximately £8.5m (2023: £4.3m). These estimates are subject to the agreement of the current year's corporation tax computations with H M Revenue and Customs.\nThe standard rate of corporation tax for the year in the United Kingdom is currently 25% (2023: 25%).\n6. EARNINGS PER SHARE\nEarnings per share of 14.14p (2023: 35.26p) has been calculated by dividing the total comprehensive profit for the period of £13.4m (2023: £33.3m) by the weighted average number of Ordinary Shares of 94.6m (2023: 94.5m) in issue during the year.\nDiluted earnings per share of 10.21p (2023: 24.79p) has been calculated by dividing the diluted earnings for the period of £13.9m (2023: £33.9m) by the weighted average number of Ordinary Shares, Convertible Cumulative Preference Shares and Convertible Preferred Ordinary Shares in issue, assuming conversion at the Balance Sheet date, if dilutive. When considering a loss per share scenario, no adjustment is made for the Preference Share dividend and therefore the diluted loss per share is equal to the basic loss per share.\n7. ANNUAL REPORT & FINANCIAL STATEMENTS\nCopies of the Annual Report & Financial Statements together with the Notice and Notes of the 2023 AGM will be issued to all shareholders in due course.\nThe financial information set out above does not constitute the Company's statutory financial statements for the years ended 30 June 2024 or 30 June 2023. The Independent Auditor's Reports on the statutory financial statements for 2024 and 2023 were unqualified, did not draw attention to any matters by way of emphasis, and did not contain a statement under 498(2) or 498(3) of the Companies Act 2006. The statutory financial statements for the year ended 30 June 2023 have been filed with the Registrar of Companies and those for the year ended 30 June 2024 will be delivered to the Registrar of Companies in due course.\nThis information is provided by RNS, the news service of the London Stock Exchange. RNS is approved by the Financial Conduct Authority to act as a Primary Information Provider in the United Kingdom. Terms and conditions relating to the use and distribution of this information may apply. For further information, please contact rns@lseg.com or visit www.rns.com.\nRNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.\nRNS may use your IP address to confirm compliance with the terms and conditions, to analyse how you engage with the information contained in this communication, and to share such analysis on an anonymised basis with others as part of our commercial services. For further information about how RNS and the London Stock Exchange use the personal data you provide us, please see our Privacy Policy.\n- 14 hours ago Hansa Investment Company Limited (DI)\n- 14 hours ago Barclays\n- 14 hours ago Foresight Enterprise VCT\n- 14 hours ago Schroder Japan Growth Fund\n- 14 hours ago Schroder Japan Growth Fund",
  "word_count": 3663,
  "scraped_at": "2026-02-14T12:33:26.398827"
}