{
  "article_id": "7fc070d0b17f",
  "url": "https://www.hawaiinewsnow.com/2025/03/20/uh-president-announces-athletics-director-search-committee/",
  "title": "UH president announces athletics director search committee",
  "date": "20250320T043000Z",
  "domain": "hawaiinewsnow.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UH president announces athletics director search committee\nHONOLULU (HawaiiNewsNow) - University of Hawaii president Wendy Hensel announced a search committee Wednesday, a key step in the quest for a new athletics director.\nThe 10-person search committee includes a diverse group of key stakeholders in and around the UH community.\n“She realizes this is a crucial hire and wants to have the best of the best helping her make that decision,” said Rainbow Collective founder Mike Kawazoe.\nKawazoe, a longtime supporter of UH athletics, announced he’d stop donating to the university directly after the tumultuous and abrupt firing of former athletics director Craig Angelos.\nHowever, he feels Hensel is taking the right steps in this process.\n“Her reaching out into the community, listening to folks, talking to a lot of folks, she realizes that she needs a diverse group of people to help make this decision,” Kawazoe said. “I think she understands the power of athletics and the power here locally that UH athletics brings.”\nThe search committee announcement comes four months after Angelos was dismissed following a brief 18-month tenure.\n“We need an athletics director who is not only a strategic and dynamic leader, but also a strong fundraiser who can navigate the many challenges ahead, including the lack of a Division 1 football stadium,” Hensel said in a statement.\nSupporters said that list of issues also includes the constantly changing landscape of conference realignment, Name, Image, and Likeness (NIL), personnel salaries, and the ever-active player transfer portal.\n“All of that stuff coming down, it’s going to require someone that has not only global reach, but a desire to grow Hawaii from being the state’s professional team to being the entire Indo-Pacific’s professional team and beyond, that’s not easy,” said Na Koa Football Club president Daren Kimura. “I don’t care who you are, that’s not easy.”\nThe search committee is in charge of identifying potential candidates and Hensel said it will meet with a national search firm that will facilitate the hiring process.\nThe hope is to conduct interviews in late May with a new hire being announced by mid-to-late summer.\n“I do not envy anyone on that committee, because they know that they need to hit a home run,” Kawazoe said. “In this current climate, it’s a generational time in college athletics where the decision we make now will have a ripple effect for years to come.”\nThe search committee includes:\n- UH Board of Regents chair Gabe Lee,\n- Bank of Hawaii CEO Peter Ho,\n- Former Rainbow Wahine volleyball star Tita Ahuna,\n- UH head women’s soccer coach Michele Nagamine,\n- State Business, Economic Development and Tourism director Jimmy Tokioka,\n- Clarence T.C. Ching Foundation chair Jack Tsui,\n- Former UH basketball player and broadcaster Artie Wilson,\n- aio president & COO Susan Eichor,\n- UH Manoa faculty athletic representative Scott Sinnett, and\n- Ahahui Koa Anuenue chair and Hawaii Bowl executive committee member Leslie Campaniano.\nAn ex officio advisory group of UH Manoa student-athletes and staff will also be named soon and will have the opportunity to meet with finalists to provide input on the selection, the university said.\nCopyright 2025 Hawaii News Now. All rights reserved.",
  "word_count": 531,
  "scraped_at": "2026-02-14T13:18:43.203754"
}