{
  "article_id": "7fdbae1d73e7",
  "url": "https://apnews.com/article/next-england-coach-applications-klopp-pochettino-4b2eb58bba68574e9888354f15bea4c0",
  "title": "The English FA has publicly invited applications to be the next England coach",
  "date": "20240720T014500Z",
  "domain": "apnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The English FA has publicly invited applications to be the next England coach\nThe English FA has publicly invited applications to be the next England coach\nEnglish Football Association is inviting applications to succeed Gareth Southgate as head coach of the national team.\nThree days after Southgate said he would step down from the post he held for eight years, the governing body on Friday publicly advertised for candidates to step forward - but said it had already identified a “number of” potential replacements.\n“We are currently overseeing a highly targeted process to appoint the next Head Coach of the England Men’s Senior Team,” the FA said in its vacancy, which was posted on the careers portal of its official website.\nIt gave an indication of its preferred candidate, saying the next head coach would have “significant experience of English football, with a strong track record delivering results in the Premier League and/or leading international competitions.”\nThe FA laid out its high ambitions for the role, which includes ending England’s decades-long wait for a first trophy since the World Cup in 1966.\nIt said part of the job description was to lead and develop the team to “win a major tournament and be consistently ranked as one of the top teams in the world.”\nThe closing date for applications is Aug. 2\nSouthgate stepped down after England’s loss to Spain in the final of the European Championship in Berlin on Sunday.\nHe led the team through four major tournaments, was a beaten finalist in back-to-back Euros and advanced to the semifinals of the World Cup in 2018.\n“As a proud Englishman, it has been the honor of my life to play for England and to manage England. It has meant everything to me, and I have given it my all,” he said when announcing his decision Tuesday. “But it’s time for change, and for a new chapter.”\nThe FA said it was “committed to open recruitment processes in the football industry.”\nPotential candidates from overseas could include Jurgen Klopp, Mauricio Pochettino and Thomas Tuchel.\nLeading English contenders could include Newcastle manager Eddie Howe, former Chelsea bosses Graham Potter and Frank Lampard and England Under-21 manager Lee Carsley.\nSarina Wiegman, who has led the England Women’s team to success in the Euros and also to the final of the World Cup last year, could also be considered.\nEngland plays Ireland in the Nations League on Sept. 7, but the FA said it was prepared to go into that match with an interim coach, rather than rush to a decision on its next manager.\n___\nJames Robson is at https://twitter.com/jamesalanrobson\n___\nAP soccer: https://apnews.com/hub/soccer",
  "word_count": 442,
  "scraped_at": "2026-02-14T12:57:54.354396"
}