{
  "article_id": "7fdc91681714",
  "url": "https://www.morningadvertiser.co.uk/Article/2026/01/28/licensing-hours-extensions-bill-proceeds-to-royal-assent/",
  "title": "Licensing Hours Extensions Bill proceeds to Royal Assent",
  "date": "20260128T150000Z",
  "domain": "morningadvertiser.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Licensing Hours Extensions Bill passed its Third Reading in the House of Lords last week and will now proceed to Royal Assent.\nIt was led through the House of Commons by Andrew Ranger MP and taken through the Lords by Lord Thomas Watson of Wyre Forest, receiving cross-party support.\nThe Bill will amend the Licensing Act 2003 to allow the Secretary of State to extend pub opening hours far more quickly ahead of major national events, such as international football matches or royal weddings.\nSignificant change\nInstead of requiring prior parliamentary debate and approval, the Secretary of State will be able to introduce extensions immediately, with Parliament retaining the ability to intervene afterwards if necessary.\nThis is intended to remove regulatory barriers for the Government and prevent delays that have previously seen licensing extensions agreed too late to be useful for pubs.\nExplaining the significance of the change, Poppleston Allen senior associate solicitor Andy Grimsey told The Morning Advertiser (MA) the Bill would address long-standing delays in the system.\n“Readers may recall the debacle of the Women’s World Cup final in 2023 when, under the current legislation, the Government had not given itself enough parliamentary time to extend the hours for licensed premises in England and Wales to be open to sell alcohol on Sunday morning, when the match was taking place”, he said.\n“This prompted quite an outcry and some very creative interpretations of licensing law by some authorities, who were put in an unenviable position by ministers to do their utmost to allow punters to have a pint whilst watching the game.\nBoost growth\n“Currently, these national extensions require a certain number of weeks’ notice and/or debate in Parliament before they are approved.\n“The Licensing Hours Extensions Bill, once it comes into force, will allow the Secretary of State to make an Extensions Order quickly, while preserving Parliament’s ability to intervene if necessary.”\nIndustry bodies also welcomed the move. The British Beer & Pub Association (BBPA) said the change could unlock new opportunities for pubs at a time when many hospitality businesses face significant pressure.\nBBPA chief executive Emma McClarkin said: “We’re delighted the Government have acted to boost growth and make it easier for pubs to do what they do best, right at the heart of moments of national significance in local communities.”",
  "word_count": 387,
  "scraped_at": "2026-02-14T12:38:34.690093"
}