{
  "article_id": "801397531134",
  "url": "https://www.independent.co.uk/news/world/europe/ap-spanish-spain-barcelona-seville-b2522686.html",
  "title": "Spanish police detain ex - soccer federation head Rubiales on return to country amid corruption probe",
  "date": "20240403T130000Z",
  "domain": "independent.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Spanish police detain ex-soccer federation head Rubiales on return to country amid corruption probe\nSpanish police have detained former soccer federation president Luis Rubiales on his return to the country amid an ongoing corruption probe\n- Bookmark\nSpanish police detained former soccer federation president Luis Rubiales on his return to the country amid an ongoing corruption probe, Spain's Civil Guard said Wednesday, before later releasing him.\nThe Civil Guard said that Rubiales was questioned by police at Madrid’s airport after he was detained on exiting the plane that brought him back home from the Dominican Republic. He was released a few hours later. An investigative judge is expected to summon him for more questioning in the coming days.\nRubiales was returning to Spain amid a judicial probe into a business deal to hold the Spanish Super Cup in Saudi Arabia.\nRubiales was in the Dominican Republic two weeks ago when police raided a property belonging to him in Granada and the offices of the Spanish Football Federation in Madrid. Seven people were detained by police and Rubiales was identified as one of five additional individuals under investigation.\nThe corruption and money laundering investigation is looking into contracts for the Spanish Super Cup and the federation’s links with Seville’s La Cartuja Stadium, which hosts the Copa del Rey final and some international games, among other deals.\nRubiales stepped down as president of the federation in September after causing an international scandal for kissing Spain player Jenni Hermoso without her consent at the Women’s World Cup final. He is facing a trial for allegedly sexually assaulting Hermoso. He has denied any wrongdoing in that case.\nRubiales cut short his stay abroad by three days. He had originally told the court that he was coming back on Saturday.\nDuring his time as president of Spanish soccer, Rubiales overhauled the format of the Spanish Super Cup in 2020, creating a four-team mini tournament and moving the competition to Saudi Arabia as part of a deal that was reportedly worth 40 million euros (then $42 million) per tournament for the federation.\nProsecutors opened a probe of that deal in 2022 following leaked audio between Rubiales and then-Barcelona player Gerard Piqué regarding millions of dollars in commissions. Piqué’s sports entertainment company Kosmos was involved in the deal with the federation and Saudi Arabia. A company official told The Associated Press that no employee of Kosmos has been detained or placed under investigation and no property of the company has been raided.\nIn a brief preview of a recorded interview with Spanish television channel La Sexta, Rubiales denied a series of what he called false claims made by Spanish media.\n“I don’t know what the judge has said or what Civil Guard has investigated,” he said. “The money in my bank account is the result of my work and my savings.”\n___\nAP soccer: https://apnews.com/hub/soccer",
  "word_count": 478,
  "scraped_at": "2026-02-14T12:52:41.261069"
}