{
  "article_id": "803948f21fe5",
  "url": "https://www.governing.com/archive/gov-las-vegas-homeless-shelter.html",
  "title": "Drugs ? Pets ? Couples ? Unlike Most Homeless Shelters , This One Will Take You No Matter What",
  "date": "20231110T074500Z",
  "domain": "governing.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Higgins has come back to the Courtyard to collect the last of his possessions. After living at the resource center since August, he recently got a job and his own place to live. “I’ve had problems with alcohol,” he says. “I’m still dealing with it.”\nThe Courtyard is unlike most homeless shelters in the country in several important ways. It allows guests, as they are called, to store their belongings in the bins. It allows them to have pets. It lets couples come in together. Most striking of all, it admits people who show up drunk or high. “You have to allow them to come in with their drugs and alcohol,” says Las Vegas Mayor Carolyn Goodman. “But they can’t sell it. They can’t be buying it. If they’re high, we’ll help them.”\nGoodman, like the residents of the Courtyard, knows that denying access to alcoholics and drug addicts can pose problems for people living on the streets. “I had an intoxicated gentleman try to rape me and hit me in the mouth and knocked my two bottom teeth out,” says Julia Laymance, a Courtyard resident for the past six months. Kathi Thomas-Gibson, the director of community services for the city, says that “people come here because if they stay on the street they get beat up, mugged and abused. There has to be a safe place so folks can make a decision about what next step to take. If you’re out there, you’re just in survival mode.”\nAt the Courtyard Homeless Resource Center, there are no beds. Overnight guests, typically around 200 of them, sleep on mats laid along the ground outside. No food is served except on rare special occasions. What the Courtyard does offer is easy access to services that include securing ID cards, getting medical help and finding a job.\nTraditional shelters and other places to stay and eat exist not far away. Catholic Charities is across the street. The Salvation Army and the Shade Tree shelter for women and children are also close. They are not competitors to the Courtyard. “Our partners are full every night,” says Thomas-Gibson. “There are beds for 500 men across the street. Where do the women go? Where do the people with pets go? Where do same-sex couples go? Same thing for the Salvation Army. They’re full. So you add it all together you’ve got maybe a thousand beds. We’ve got 6,000 people on the streets.”\nOne thing that draws homeless people to the Courtyard is the policy toward possessions. Most providers will insist that people give up their belongings in order to access services, a meal or a place to sleep for the night. “If everything you own is in two shopping bags ... or however you’re trying to maintain a semblance of your former life, we say you don’t have to leave it outside,” says Thomas-Gibson. “You can bring it inside.”\nThe Courtyard sits alongside North Las Vegas Boulevard, a half-mile up the road from the Neon Museum, the resting place of the once-glittering signage of the city’s storied past. The most prominent feature of the Courtyard is an abandoned three-story motel of the same vintage as the museum, but devoid of any charm. Until the city purchased the property, it was used by a homeless youth center. A vacant church was demolished to make room for the hundreds of storage bins. The steeple was spared and sits alone in a distant corner of the lot.\nWhile one side of the abandoned motel is up against Las Vegas Boulevard, the other looks down on an open expanse of dirt and concrete. A few forlorn trees punctuate the otherwise barren space. An open shed protects a few more tables and benches where people stand guard over their phones while charging them. Large red rocks provide seating for those who would rather take their chances with the elements. Beyond the courtyard itself is a tent-covered outdoor basketball court, also with picnic tables. Next door, a former funeral home serves as the shelter’s office space and provides storage.\nThe campus perimeter is ringed with fencing. Guests may come and go, but they must use the one and only entry point. Armed security personnel are always visible everywhere on the property. It’s hard to find someone with anything negative to say about the security staff. “They treat you like a human being,” says Laymance. “They joke with you.” Outside the gate, Metro Police routinely stop to question individuals loitering on the street to keep guests from being taken advantage of as they come in and out.\nBesides the fence and security personnel, perhaps the most important feature of the Courtyard is a row of 10 Port-a-Potties that are cleaned every day, along with hand-washing stations near the entrance. Goodman says her first order of business upon opening the Courtyard in 2017 was sanitation. “The biggest thing for me were the stupid Port-a-Potties. Safety first and sanitation. They go hand in hand,” she says, slapping the top of her desk. “There are certain basic needs and we have to be able to provide them.”\nOn a chilly late-winter Tuesday, three white vans pull up to a deserted, trash-strewn lot not far from the Courtyard grounds. As they do every day, the vans have brought members of the Multi-Agency Outreach Resource Engagement Team (MORE) to look for people in need. They try to coax them into the Courtyard. If they won’t come in, it is hoped they will at least agree to get help with services. The MORE team always works in tandem with law enforcement officials.\nIn this lot, a tent city the length of a football field has been set up beside a cement drainage ditch. Train tracks run along the other side. Piles of trash, shopping carts and all manner of debris define individual encampments. It is quiet except for the sounds of small planes buzzing overhead. Stopping at every makeshift dwelling, a Las Vegas city marshal leans in. “Hey, folks inside the tent, we have service providers out here if you want to talk to them.” Sometimes a muffled “no” comes from within, but usually there is silence. Once in a while someone will come out to talk.\nTwo women in bright green MORE vests ask a disheveled young man some questions while the marshal stands a few yards off to the side. “It sounds like you had a pretty shitty childhood. Have you talked to someone? Maybe a little depression? Anxiety?”\n“No, it takes a lot to bring me down.”\n“Do you have a learning disability?”\n“Dyslexia.”\n“Are you currently running from something? Do you have any pets with you?” The women try to convince him to come to the Courtyard, but he won’t. He says he’s at least thinking of spending the night at a conventional shelter, and he eventually agrees to meet them again in the morning.\n“You can’t make people take services,” says staffer Jason Arroyo of MORE. “But you can try, try, try.”\nIn a tiny corner office, case manager Jakki Wells is questioning a guest with a head injury. “Has anybody threatened you or tried to harm you? Have you tried to threaten or hurt anybody in the last year? Have you been attacked or beaten up in the last year? What happened to your head?”\n“Don’t touch it. It’s gonna hurt.”\n“You fell? Did somebody beat you up?”\n“No,” is all he can answer.\n“You did, you’ve got a big gash on your head right now. Is there anybody that thinks you owe them money?”\nLess than two feet away, another staffer is arranging for a young woman to get a bus ticket home to her mother in Seattle. Every day several guests take advantage of a program offering free rides home. After showing that someone expects them on the other end, they are handed a ticket and a bag lunch and sent on the 20-minute walk to the bus station. “It doesn’t bother me if it’s tonight or tomorrow morning. But I would prefer today,” says the hopeful passenger. “I don’t have any money now because I gambled it all away. Yesterday I slept outside underneath an awning.”\nMany of the staff and volunteers at the Courtyard have their own history of homelessness and addiction that helps them identify with the Courtyard’s guests. Wells has been clean for 29 years. “I’m very proud of my own accomplishment,” she says. But her empathy for the homeless and addicted doesn’t mean she’s a pushover. Her expression turns to exasperation if she thinks someone is trying to manipulate her. “They’re not bad people,” she says of the guests. “They’re just in bad situations.”\nAlthough this is the desert, temperatures are close to freezing and a light rain is falling on a February afternoon. Groups of people huddle under blankets at the tables beneath the old motel. Suddenly, the area is bathed in a red glow as heat lamps mounted in the ceiling are turned on. A chorus of “Thanks, Mark,” goes up, directed at\nMark Sommerfeld, manager of the Courtyard’s physical plant.\nHe has turned on the lamps sooner than he was supposed to.\nBuddy and Krystal are part of the group thankful for the heat lamps. They have been staying at the Courtyard for three of the eight months they’ve been married. Buddy, 34, says he’s had two heart attacks and is quick to tell you about his dislocated shoulder. L-O-V-E is tattooed across the fingers of one hand and H-A-T-E across the other. “I was a bad drug user,” he says. “Now I smoke weed.” Krystal, 27, is pregnant with twins. They stay here because they can be together at night. “We may sleep on mats,” Buddy says. “But at least I’m not too far from my wife.”\nLas Vegas and surrounding Clark County have the eighth-largest homeless population among all of the country’s metropolitan areas. Two thirds of the region’s 6,000-plus homeless population are unsheltered. To address the need, the Courtyard sprang from modest beginnings two years ago on vacant land purchased by the city. “When I came here, this place was nothing. It was a mess,” says staffer Steve Rehberger. After the Port-a-Potties were installed, a security staff was added, along with a rented trailer for any interested service providers. Bottled water was handed out during hours of operation, initially 6 a.m. to 6 p.m.\nAs the project began to take off, says Rehberger, “all the politicians and the mayor came, nonprofits wanted to come and do services -- it just turned into a mini courtyard.”\nSteve Quackenbush was one of those living on the street at the time and recalls the early days. “Three cases of water, 10 guests. I came over and was just relaxing on a bench and I saw there was trash that needed to be dumped. So I was trying to help out and started dumping trash. I’d come every day.” His enthusiasm for work eventually earned him a paid position.\nWill Kight came from similar circumstances, having met Quackenbush at Catholic Charities. ”Being part of the homeless population makes it easy to relate,” he says. Kight now does public speaking on behalf of the Courtyard. “I want to see it to completion,” he says.\nThe size and funding model of the San Antonio campus make it difficult to replicate. But delegations from several other cities, including members of the Courtyard team, have made multiple trips to the private, nonprofit facility looking for ideas. “We took our team down to see San Antonio because we knew we were going to adapt elements of what they were doing,” says Thomas-Gibson, the city’s director of community services. “You can’t adopt, pick it up whole and plop it here, but you can adapt certain aspects. The folks who work here needed to see that in action.”\nRehberger has commandeered someone’s office and is spreading the architect’s plans for the new Courtyard across a desk. “We’re going to be able to sleep 500 people,” he says. “There’s going to be heat and cooling. We’re going to have 15 or 16 permanent showers, with bathrooms. No more Port-a-Potties.” Plans also call for a large covered dayroom for watching TV, playing games or just staying dry when it rains. There will be new office space for service providers, a kennel and a laundry. The city plans to begin construction on the new facility in the fall.\nBut all of this is coming at a price. In the past few months, the anticipated cost of building the new facility has almost doubled to $15 million. “The issue, as with everything in life and everything in government in particular, is how do you fund it?” says Goodman. “Not only how do you fund it but how do you sustain it? There has to be an ongoing stream of income to do all the wonderful things. There is no free. You have to pay for it.” But the mayor is mindful of the larger effects of the city’s homeless policy. “It does affect all of us,” she says. “It affects tourism. It affects business. It affects schools. It affects safety. It affects everything.”\nIn the end, what may be most important is that the Courtyard gives people a chance to focus on moving forward instead of just surviving. “This is a population that has chronic issues and we need to be able to intervene,” the mayor says. “If you don’t allow them to come in with their [alcohol or drugs] and everything else, they’re not coming.”",
  "word_count": 2261,
  "scraped_at": "2026-02-14T13:28:05.742303"
}