{
  "article_id": "8040934ad649",
  "url": "https://www.opinionnigeria.com/update-chelsea-man-utd-womens-fa-cup-final-to-validate-growing-rivalry/",
  "title": "UPDATE : Chelsea , Man Utd Women FA Cup final to validate growing rivalry",
  "date": "20230513T073000Z",
  "domain": "opinionnigeria.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Breaking News\nUPDATE: Chelsea, Man Utd Women’s FA Cup final to validate growing rivalry\nUnderlining the surge in popularity enjoyed by the women’s game in recent years, an expected 90,000 crowd – a record for a women’s domestic club match – will flock to Wembley to witness the latest instalment of the growing rivalry between Chelsea and United.\nChelsea’s role as the dominant force in women’s football in England faces a stern test from emerging challengers Manchester United in Sunday’s FA Cup final at Wembley.\nWell-established as the preeminent power in the Women’s Super League after winning the last three top-flight titles, Chelsea have come under sustained pressure from United this season.\nUnited sit top of the WSL table but have only a one-point lead over second-placed Chelsea, who hold a game in hand.\nThe title race pauses for this weekend as United bid to win the first major trophy in their short history, while Emma Hayes’s Chelsea aim is to make it three successive FA Cup triumphs.\nUnderlining the surge in popularity enjoyed by the women’s game in recent years, an expected 90,000 crowd – a record for a women’s domestic club match – will flock to Wembley to witness the latest instalment of the growing rivalry between Chelsea and United.\nThe Blues came from behind for a title-clinching 4-2 win against United on the final day of last season and have won both league meetings this term.\nHaving spent the last five years battling with Manchester City and Arsenal for supremacy in the domestic women’s game, Chelsea could be facing their greatest threat yet.\nUnited have had a remarkable rise since their formation in May 2018.\nThey were promoted from the Championship in their inaugural season and have finished fourth in three successive WSL campaigns.\nThey train at Carrington, where the United’s male team is based, and their matches at Old Trafford have attracted crowds of over 20,000.\n– ‘If we win, it will be massive’ –\nUnited manager Marc Skinner, who took charge in 2021, admits there is extra pressure on his team on Sunday as they look to validate their rapid ascent with a first piece of silverware.\n“I even think there’s more pressure on us than Chelsea, Arsenal or Manchester City because we are Manchester United,” he said.\n“I feel that because every Manchester United fan will want us to win and we are huge around the world.\n“I’m sure there will be some nerves, but I’m fuelling my focus and attention to maximise this because, if we win, it will be massive.”\nStanding in the way of United’s uprising is Chelsea’s Australian striker Sam Kerr.\nAmong the crucial goals Kerr has scored since joining Chelsea are a brace in each of the last two FA Cup finals.\n“I play this game to score goals and I love the pressure, I love the big games, I love being able to have a moment in the palm of your hands and be able to do something great,” Kerr said.\n“I get excited about these games. People are still talking about that Man United last game of the season, and for me that was so exciting. I think it’s exciting when there’s another moment like that on the horizon.”\nKerr has scored 87 times for Chelsea and helped them win seven major trophies in her three-and-a-half years with the club so far.\nIt could be a golden year for Kerr even by her sky-high standards as she chases glory with Chelsea before captaining Australia when they co-host the Women’s World Cup in July and August.\n“Obviously you can’t look into the future, but I see myself going bigger and better than what I am now, and hopefully continue winning trophies with this team,” she said.\nAFP",
  "word_count": 629,
  "scraped_at": "2026-02-14T12:21:54.864447"
}