{
  "article_id": "80644830ea45",
  "url": "https://www.leinsterexpress.ie/news/gaa/2003191/preview-busy-sunday-for-laois-as-hurlers-host-derry-and-ladies-welcome-down.html",
  "title": "PREVIEW : Busy Sunday for Laois as hurlers host Derry and ladies welcome Down",
  "date": "20260201T111500Z",
  "domain": "leinsterexpress.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Laois v Down throws-in at 2pm in Heywood Community School.\nLeft: Mossy Keyes on the run against Mayo, picture: Oonagh Maher. Right: Fiona Dooley playing against Fermanagh, picture: Denis Byrne\nIt’s a busy Sunday afternoon for Laois supporters, with both the senior hurlers and the senior ladies in league action on home soil as their respective league campaigns continue.\nFirst up at 1pm, the Laois senior hurlers return to Laois Hire O’Moore Park as they welcome Derry for Round 2 of the Allianz Hurling League Division 2.\nLaois got their league campaign off to a flying start last weekend with a comprehensive win away to Mayo. Tommy Fitzgerald’s side were utterly dominant in the opening half, racing into a commanding 5-15 to 0-1 lead by the interval, effectively putting the contest to bed before half-time. While the second half saw a drop-off in intensity and accuracy, Laois still ran out convincing winners on a final scoreline of 6-23 to 0-12.\nSpeaking after the game, Fitzgerald was quick to point out areas for improvement despite the margin of victory. He acknowledged disappointment with the second half display, citing a loss of efficiency and a high wide count, while also stressing that the intent, energy and attitude shown in the opening half were encouraging signs as the season develops.\nDerry, meanwhile, arrive in Portlaoise looking to bounce back from a difficult opening outing. The Ulster side were well beaten by Kerry in their first league game, going down 5-23 to 0-14, and will be keen to show a response against one of the promotion favourites.\nLaois are the favourites for promotion from Division 2, with Westmeath likely to provide their main competition. However, the league will primarily serve as preparation for the Joe McDonagh Cup, a competition Laois have reached the final of in both 2024 and 2025, and which remains the central focus of their season.\nLaois v Derry throws-in at 1pm in Laois Hire O'Moore Park, Portlaoise.\nAn hour later, attention switches to Heywood, where the Laois Ladies welcome Down for their second game of the Lidl Ladies Football League Division 3, with throw-in at 2pm.\nLaois picked up a valuable point from their opening-round contest with Fermanagh last weekend, a game that was relocated to the all-weather pitch in Heywood Community School due to poor weather conditions. It was a contest full of drama, with Laois showing real resilience to recover from a six-point deficit.\nA brace of goals from Mia Branagan on her senior debut turned the game on its head, putting Laois in front and seemingly on course for victory. However, a late infringement of one of the new rules that has carried from the men's game to the women's game, which saw Laois penalised for having only two players in the opposition half, handed Fermanagh a free directly in front of the posts. Emily Lacey proved to be the hero for Laois, landing her eighth point of the game to ensure the sides finished level at 3-13 apiece.\nDown also come into Sunday’s clash on the back of a draw, having shared the points with 2025 Junior All-Ireland champions Louth. That game ended 1-12 to 3-9.\nWith promotion firmly the target for Laois this season, Sunday’s game is an important one. Anything less than a win could see the early pace-setters in Division 3 begin to pull away, making this a must-win fixture for the hosts as they look to build early momentum.\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nSubscribe or register today to discover more from DonegalLive.ie\nBuy the e-paper of the Donegal Democrat, Donegal People's Press, Donegal Post and Inish Times here for instant access to Donegal's premier news titles.\nKeep up with the latest news from Donegal with our daily newsletter featuring the most important stories of the day delivered to your inbox every evening at 5pm.",
  "word_count": 693,
  "scraped_at": "2026-02-14T12:51:11.295726"
}