{
  "article_id": "8087b981e710",
  "url": "https://theathletic.com/4898249/2023/09/26/benham-club-owners-betting/",
  "title": "Why Matthew Benham and other club owners are allowed to bet",
  "date": "20230926T054500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Football’s relationship with gambling is back in the spotlight, but this time it is nothing to do with a player.\nIt has emerged that there is a policy that allows senior figures at some football clubs to be involved in betting, including Brentford’s owner Matthew Benham and Brighton & Hove Albion’s owner-chairman Tony Bloom. A report by The Guardian, which was published on Sunday, claims Benham has placed bets on football in his own name via a gambling syndicate called MSPP Admin. Benham said he abides by all the Football Association’s (FA) betting rules.\nAdvertisement\nOver the past year, there have been several high-profile cases of players being punished for breaking the FA’s rules on gambling. In May, Brentford forward Ivan Toney received an eight-month ban after admitting to 232 offences, including betting on his own team to lose and backing himself to score in matches.\nNottingham Forest defender Harry Toffolo received a suspended five-month ban and was fined £20,956 for 375 rule breaches, while West Ham United midfielder Lucas Paqueta is being investigated for potential breaches.\nA football manager who gambled nearly £1million ($1.2m), including 28 bets on his own sport, avoided severe punishment from the FA and was issued with a warning. The manager, who cannot be identified for legal reasons, had eight betting accounts and admitted being a gambling addict in evidence presented to a court last year in a case in which two former footballers were accused of blackmailing him.\nToney’s career has been placed on hold due to his betting activity, but his club’s owner is not bound by the same restrictions. Here, The Athletic explains why.\nWhat are the FA’s rules on betting?\nThe FA updated its rules around betting in 2014. Rule E8 in its handbook stipulates that players and staff at clubs in England, from the Premier League and the Women’s Super League all the way down to the Northern, Southern and Isthmian leagues, are prohibited from betting on any football matches taking place anywhere in the world.\nThey are not allowed to gamble on other football-related matters either, including transfers, managers being hired or sacked, team selection or disciplinary matters. You can also get in trouble for passing on information to other people. This happened to Kieran Trippier, who was banned for 10 weeks and fined £21,000 for telling his friends to “lump money” on him moving from Tottenham Hotspur to Atletico Madrid during the summer of 2019.\nThe rules exist to protect the integrity of the sport and prevent any accusations of match-fixing.\nAdvertisement\nWhy is it different for Benham and Bloom?\nWhen the FA introduced the new set of rules nearly a decade ago, it drew up a policy to account for club owners with a financial interest in the betting industry. It recognised these clubs could be negatively affected unless special provisions were made which allowed their benefactors to retain existing relationships with gambling firms.\nFor example, Bloom made his fortune through a betting syndicate called Starlizard and he took over Brighton in 2009 when they were in League One. They have climbed up the divisions during his time in charge and qualified for Europe for the first time in their history last season. Roberto De Zerbi’s side are third in the top flight after the opening six games of the campaign, only three points behind leaders Manchester City.\nBenham worked under Bloom at Premier Bet before setting up his own company, Smartodds. Benham became Brentford’s majority shareholder in June 2012 and has funded their rise from the third tier of English football to a ninth-placed finish in the Premier League last season.\nGO DEEPER\n'A Cold War': the rivalry between Brighton's Tony Bloom and Matthew Benham at Brentford\nPeter Coates is the joint-chairman of Stoke City with his son John. Peter is the co-founder and chairman of Bet365, while John is the joint chief executive with his sister Denise.\nThe FA’s policy has never been made available to the public, but it details how these individuals with links to gambling firms should act and what they can and cannot do. They are subject to independent audits and have to submit an annual declaration to ensure they are meeting a strict set of conditions. They are also required to report any suspicious activity they discover through their role within the betting company. If these conditions are breached, individuals are subjected to disciplinary action.\nWhat has happened with Benham?\nAccording to The Guardian, Benham funds MSPP Admin, which is based in London and bets in the United Kingdom and Hong Kong. On Companies House, Brentford’s chairman Cliff Crown is listed as a co-owner of the company along with Philip Wall, who is a former director of the club.\nAdvertisement\nA spokesperson for Benham said: “Matthew Benham, alongside other club owners who have a financial interest in a betting company, is subject to an FA policy which, if abided by, ensures that their betting companies may continue to bet on football.\n“In particular, those the policy applies to must not, among other things, have any direct involvement in setting odds or placing bets on football or pass on any inside information. This policy has been in place for almost a decade.\n“Matthew fully complies with this FA policy. He abides by all its conditions and restrictions and is also subject to regular third-party audits to confirm compliance.”\nWhen The Athletic contacted the FA, it said it was “aware of the report” and will look into it, “but we do not currently have any information to suggest any rules have been breached”.\n(Top photo: Nick Potts/PA Images via Getty Images)",
  "word_count": 939,
  "scraped_at": "2026-02-14T12:03:47.538040"
}