{
  "article_id": "80c3e94e8c10",
  "url": "https://www.justarsenal.com/arsenal-must-beat-bk-hacken-by-min-2-goals-to-keep-women-champions-league-dream-alive/376663",
  "title": "Arsenal must beat BK Hacken by min 2 goals to keep Women Champions League dream alive . ",
  "date": "20240925T144500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal women played out to a 2-2 draw versus Manchester City in one of the trickiest WSL openers. Despite the shared points, the game yielded numerous positive outcomes. And coming in between an Arsenal versus BK Hacken UEFA Champions League qualifier bout, it was the perfect fixture to get the best out of this Arsenal team.\nLotte Wubben-Moy, speaking to the media after the draw with City, hinted they don’t really know what to expect from BK Hacken they’re going to face, but she’s excited about that fixture, and she’s confident they’ll build on their great performance versus City. She was pleased with how defensively solid they were against the WSL 2023-24 runners-up, and she felt they’re only going to get better given they’re still gelling.\nWubben-Moy told the Halfway Line,\n“But if we look at today [Man City], in terms of accepting runners, I think us in the back line, we put in a shift. We were really communicating well, accepting runners; we know that Bunny Shaw is going to drop deep and Viv [Miedema] is likely going to make the B-run from the 10. So [it was] really important for us to be working well gelling well; again, this is the start of the season, so looking at what’s to come, it’s good to build on.”\nAfter a disappointing 1-0 loss to Hacken in Sweden, Arsenal need to bounce back against the Swedish side. They’ll be back in action Thursday night, at Meadow Park, in the second leg of the UEFA Women’s Champions League qualifiers. Lotte Wubben-Moy is confident they’ll be defensively sound for that game, but the attack also needs to deliver. It won’t be simple for them to qualify, by just relying on their defensive prowess; they must beat Hacken by at least 2 goals to keep their Champions League dream alive.\nFixture details – Arsenal Women v BK Hacken. UWCL Round 2 qualifier\nDate: Thursday, September 26th\nKick-off: 7:30 pm UK\nVenue: Mangata Pay UK Stadium, Meadow Park\nHow confident of this season’s Champions League football are you feeling?\nSusan N\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 377,
  "scraped_at": "2026-02-14T12:48:12.418596"
}