{
  "article_id": "80cfbdddceab",
  "url": "http://www.virginislandsnewsonline.com/en/news/wolues-fc-are-womens-national-league-champions",
  "title": "Wolues FC are Women National League Champions ! | Virgin Islands News Online",
  "date": "20240529T044500Z",
  "domain": "virginislandsnewsonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Wolues FC are Women’s National League Champions!\nUnder a clear night sky and a \"sold-out crowd\" sitting on the north end wall, standing along the fence and lining the perimeter of the pitch, the Wolues women kept their nerve and focus to strike early (15th minute) with a great team goal, starting from the back, slicing through the midfield and then culminating in a delightful through ball from captain, Zolita Bamford, which was weighted perfectly for Carey to take a touch and arrow an unstoppable shot past a despairing dive from the Avengers keeper who just managed to get her fingertips to the ball as it arrowed into the top left corner of the goal.\nGoalkeeper Giada Palladino praised\nWith Giada Palladino keeping the Wolues organised, a back line expertly led by Tinia Van Zoost also included Camille ‘Millie’ Cottreau and Aerin Westlake, whilst the returning Bamford, Charli Sedon and Kya Ridway dominated the midfield, allowing both Ariel Mohamed and Gabi Jermain to showcase their skills.\n“It was a team win from start to finish, with Giada Palladino, picking up her 8th clean sheet of the season,” noted Head Coach, John Reilly. “Her match awareness at such a young age is so important to us, her ability to sprint off her line, her shot-stopping abilities and ability to claim high balls with poise and composure gave the team’s back line confidence to ping the ball around in the trademark Wolues build-up.”\n“We were really happy to win a physical and challenging game against tough opponents,” stated Bamford. “I am proud of all the players and particularly our younger girls who coped with all the added pressure of a final. It was a great feeling to lift the Trophy and hopefully the momentum for Women’s football will continue.”\nThe defense had to be at its best against a formidable opponent in Avengers FC, who were well-disciplined in their game plan to sit deep and invite Wolues forward before attempting to hit them on the break.\nHowever, Palladino and her teammates kept them at bay, created a couple of good chances to increase the lead themselves, but ultimately had enough control of the game to be worthy winners.\nThe future looks bright for the young Wolues team, whose members hone their skills at the Saturday morning Manatees Youth Football programme, the Cedar School afterschool football programmes, and the highly successful Soccer Sisters programme on Thursday afternoons.\nNext up for some of the younger girls on the team is a St Croix-based tournament slated for the end of June.\n6 Responses to “Wolues FC are Women’s National League Champions!”\n-\nany of them born here?\n-\nYes, most of them.\n-\nGo babes rep BVI and #proudmom\n-\nYour friend got to be an A$$while to ask you thst!\n-\nWhy does it matter ?\n-\n-\nThis story is very one sided, no mention of the opposition. Clearly someone from Wolues wrote this.",
  "word_count": 491,
  "scraped_at": "2026-02-14T12:48:07.495136"
}