{
  "article_id": "80cfa80a97a7",
  "url": "https://www.inforum.com/news/local/happenings-around-the-lakes-area-may-34",
  "title": "Happenings in the lakes area , Sept . 14 - 25",
  "date": "20240914T133000Z",
  "domain": "inforum.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Detroit Lakes Tribune accepts community calendar items for publication online and, space permitting, in our Wednesday and Saturday print editions. Submissions must be made at least a week in advance of the event date, in writing, to either dltribune@dlnewspapers.com or vgerdes@dlnewspapers.com. Each submission must include the date, time and location of event, and where to go for more information (phone, email and/or website). Also include whether the event is free or paid admission, and how much it costs when applicable.\nSaturday, September 14\nWomen's Conference: First Baptist Church of Detroit Lakes will host a women's conference from 9 a.m. to 1 p.m. Amanda Ellison of \"The Preacher's Daughters\" will be speaking on \"Choosing Joy in the Seasons of Life\" and sharing some Biblical insight on what fills us with joy as well as what robs our hearts of happiness. Free and open to the public, but please RSVP if planning to attend. Contact the church at 218-847-4571 or dlfirstbaptistchurch@gmail.com to reserve your spot. Lunch will be provided. Registration begins at 8:15 a.m. The church is located at 300 E. Central St., Detroit Lakes.\nADVERTISEMENT\nDeep Roots Festival: Maple Hills Orchard in rural Frazee is the setting for the 4th Annual Deep Roots Festival, which runs from 3-7 p.m. There will be local vendors, many specializing in organic products, along with farm tours, educational workshops, live music featuring local talent, food trucks, family-friendly activities and more.\nClaryce Iverson Benefit: A chili feed and silent auction benefiting Claryce Iverson and her family will take place from 4 to 7 p.m. at the Soo Pass Ranch, located south of Detroit Lakes on Highway 59. In January, Iverson's life changed dramatically after a sudden medical crisis that ended with her being diagnosed with transverse myelitis, which left her paralyzed from the chest down. The benefit is open to the public, and there will be live music as well.\nShrine Color Guard Septoberfest: The Detroit Lakes Shrine Color Guard will host their annual Septoberfest celebration from 5-8 p.m. in the parking lot behind Coldwell Banker at 517 Washington Ave., Detroit Lakes. There will be door prizes and costume contest prizes for best male and female German dress as well as best couples' German dress along with live music, brats and beer, potato salad and other German-style cuisine. Tickets are $20 each, payable at the gate.\nWoodstack Music Festival: The Prospect House and Civil War Museum in Battle Lake will host \"Woodstack,\" an outdoor music festival featuring the sounds of the iconic Woodstock music festival as performed by Darren Quam and Friends, from 5-9 p.m. Cost is $10 for adults, $5 for children, with the proceeds benefiting Prospect House. Food and drinks will also be available for purchase. Bring lawn chairs and/or blankets for comfortable seating.\nSt. Paul's Grilled Turkey Supper: St. Paul’s Lutheran Church of Evergreen will host a grilled turkey supper, with serving from 4:30-7 p.m. Menu includes grilled turkey, mashed potatoes, gravy, dressing, coleslaw, vegetable, cranberries, bread, pumpkin dessert and beverage. Cost is a free will offering. St. Paul's is located at 13130 Co. Hwy. 39, Frazee. A bake sale with crafts and produce will also be open during this event.\nThrown Out Bones Concert: The New York Mills Regional Cultural Center will launch its 2024 fall concert series with a performance by Thrown Out Bones, a San Francisco-based trio that includes lead singer/drummer Liliana Urbain; Nick Chang on blues rock guitar, and Sam Miller on psychedelic and jam-centric bass. Whether it be improvising songs about a member of the audience or inviting them onstage to sing lead, Thrown-Out Bones rides the power of a live crowd and encourages fans to drive what each show looks and sounds like. Tickets are $12 in advance or $15 at the door (with a $2 member discount); or $5 for students (same in advance or at the door). Cash bar and snacks available. You can buy tickets online at kulcher.org or call the Cultural Center at 218-385-3339. Doors open at 7:00 p.m. and music begins at 7:30.\nLive Music: Darren Quam and Friends at Prospect House and Civil War Museum in Battle Lake, 5-9 p.m.; The Fat Cats at Pit 611 in Cormorant, 7-10 p.m.; Tony Lee at The Roadhouse in Cormorant, 8-11 p.m.; Verge at Shooting Star Casino's Mustang Lounge in Mahnomen, 8 p.m.-12:30 a.m.; Karaoke with Kelly Reller at Zorbaz in Detroit Lakes, 9 p.m.-1 a.m.\nADVERTISEMENT\nSunday, September 15\nColor Guard Fundraiser Breakfast: The Lake Region Veterans Color Guard will be hosting a breakfast fundraiser from 8 a.m. to noon at the American Legion Club, 810 West Lake Drive, Detroit Lakes. Suggested donation is $8 for a meal including scrambled eggs; pancakes or French toast; sausage or bacon; and coffee or orange juice. Plenty of tables, lots of space. Open to all.\nSunday Brunch Open Mic: Come to the Corner Collective Bistro, Arts and More at 300 2nd St. NW (upper level), Frazee, from 11:30 a.m.-1:30 p.m. for some crepes, coffee and live music. All ages welcome to participate in open mic; do it karaoke style, or plug in your own instrument.\nSt. John's Sauerkraut Dinner: The congregation of St. John's Lutheran Church in Height of Land Township invites the community to enjoy a meal of homemade sauerkraut, pork, potatoes, corn, baked beans, bread and dessert, with serving from 11 a.m. to 1 p.m. at 37425 Co. Hwy. 56, Frazee (six miles east of Detroit lakes on State Hwy. 34, then turn right on Co. Hwy. 56). Proceeds will go to church service projects.\nSt. Francis Xavier Chicken Dinner: St. Francis Xavier Catholic Church of Lake Park will host a chicken dinner featuring fried chicken, dressing, mashed potatoes and gravy, corn, salads, desserts and coffee, with serving from 11 a.m. to 1:30 p.m. Cost is $15 for adults, $10 for children ages 6-12, and free for preschoolers age 5 and under. Crafts and baked goods will also be available for purchase. The church is located at 2066 2nd St. in Lake Park.\nSt. Andrew's Turkey Dinner: St. Andrew's Catholic Church in Hawley will host a turkey dinner with all the trimmings, including assorted salad and desserts, from 11 a.m. to 1:30 p.m. Cost is $15 for adults, $5 for kids ages 6-12, and free for preschoolers age 5 and under, with 15% of the total proceeds going to support local charities. The church is located at 1418 Main St., Hawley.\nVikings Watch Party with Chuck Foreman: Come to The Roadhouse in Cormorant village to watch the Minnesota Vikings football home opener against the San Francisco 49ers and meet Vikings alumni Chuck Foreman (#44). Kickoff is at noon.\nTamarac Sunday Movie: A free screening of the family-friendly, nature-themed movie, \"A Squirrel’s Guide to Success,\" will be held at 2 p.m. in the Visitor Center at Tamarac National Wildlife Refuge. Uncover the extraordinary abilities of these cheeky nut lovers as a filmmaker puts their problem solving to the test on an obstacle course. See the world through the eyes of an orphan red squirrel called Billy. Run time is approximately 55 minutes; all are welcome. For more information on this event, call 218-847-2641, visit fws.gov/refuge/tamarac or check the Refuge's Facebook page at facebook.com/TamaracNWR.\nADVERTISEMENT\nMonday, September 16\nAsk a 'Techspert': Do you have a phone, tablet, laptop, iPad, Kindle or other device that you’re struggling to use? Visit the Detroit Lakes Public Library, 1000 Washington Ave., at 4 p.m. to learn more about your device, plus learn how to download eBooks and eAudiobooks free of charge.\nTuesday, September 17\nOld-Time Variety Dance: Marie and the Boys will provide the music for an Old-Time Variety Dance, taking place from 1-4 p.m. at the Frazee Event Center. All are welcome; admission is $7 per person.\nTuesday Afternoon Book Club: Join the Detroit Lakes Library’s monthly Tuesday Afternoon Book Club at 3 p.m. for a lively discussion of the book \"What We Hunger For: Refugee and Immigrant Stories about Food and Family,\" edited by Sun Yung Shin. This book contains 14 stories about food written by refugees and immigrants who moved to Minnesota. All are welcome, even if you haven't read the book. If you have any questions, feel free to email the library at detroit@larl.org or call 218-847-2168.\nInvesting 101 Webinar: Mid Minnesota Federal Credit Union (MMFCU) is offering a free financial education class on \"Investing 101\" from 5 to 6 p.m., via webinar. This introduction to investing covers compound interest and how it builds wealth; dollar-cost averaging and how it might benefit your investment strategy; the importance of diversifying your assets; and ways to find trusted experts to help you with future planning. This webinar is provided by experts from Lutheran Social Services. There is no cost to join the Zoom meeting, but pre-registration is required. Sign up online at mmfcu.org/events to reserve your spot. For questions call MMFCU at 218-829-0371.\nMedicare Workshop: Come to the Detroit Lakes Holiday Inn at 5 p.m. for a free, no-obligation workshop with a Blue Cross Medicare expert and get all your questions answered. Learn Medicare basics and plan options available in your region and receive help in determining the option that is best for you. Please register in advance; walk-ins are welcome, but space may be limited. Click on the link on the Facebook event page to reserve your spot.\nTheology on Tap: Bucks Mill Brewing in downtown Detroit Lakes will host an evening of \"Theology on Tap,\" starting at 7 p.m. Questions about life, about God, or both? Come ponder those questions over a pint of cold, local brew with other like-minded individuals. Co-hosted by First Lutheran Church of Detroit Lakes, this 90-minute event is open to the public.\nWednesday, September 18\nTry Hockey for Free: The Detroit Lakes Youth Hockey Association is hosting a free \"Discover Hockey\" event at Kent Freeman Arena in Detroit Lakes from 5:30 to 7 p.m. Beginner skaters between ages 4-9 are welcome to come learn about the basics of skating and the most important life lessons hockey can offer, like learning to get up after a fall. This is a come-and-go event; no registration necessary. All are welcome; a limited number of skates and equipment are available to test the ice for yourself. Questions? Contact Joe Schiller at joeschiller26@hotmail.com for more information.\nADVERTISEMENT\nLive Music: Come to Parallel 46 in Cormorant village from 6-8 p.m. for some live piano music, and stay for the food and wine specials.\nThursday, September 19\nDeep Dive DL: This month's \"Deep Dive DL\" presentation will feature Pitch 412 finalists Barb Owen Boerger, creator of Getaway Kimonos, and Timmie and Landon Hansen of Lillie's Lollipops, who finished second and first, respectively, in the innovative entrepreneurship competition held on Aug. 12. Hosted by local nonprofit Project 412, the event will begin with an 8 a.m. coffee social on the first floor of the Becker County Museum, 714 Summit Ave., Detroit Lakes, with the presentation to get underway at 8:15 a.m. Free and open to the public.\nUnited Way Community Celebration: The United Way of Becker County will host its annual Community Celebration from 4:30-6:30 p.m. at the Detroit Lakes Pavilion, 1361 Washington Ave. There will be a free community picnic supper, blow-up games, face painting, Hero Vehicles display, and a drawing to give away 14 free bicycles. The United Way's community partners will also have information booths where guests can register for door prize giveaways at the end of the evening (before the bike giveaway). No cost to attend; open to the public.\nMixed Media Collage Art Class: Come to the Holmes Art Cellar in the basement of the Historic Holmes Theatre, 806 Summit Ave., Detroit Lakes, at 9 a.m. for a Mixed Media Collage class taught by artist Carmen McCullough, who will lead participants in creating their own piece of mixed media collage art, using paper, glue, paint and found objects. Full-day class will include a one-hour lunch break at noon, concluding at approximately 3 p.m. No prior \"artsy\" experience required, though the class is intended for artists age 16 and up. Cost is $85 per person, including all supplies. Sign up online at dlccc.org/artcellar.html to reserve your spot.\nLive Music: Tim Stoll and Carrie LeDoux at Essentia Health Lincoln Park Winchester in Detroit Lakes, 3-5 p.m. Open to the public.\nAcrylic Painting 101: Local artist Anna Lassonde will lead a 6 p.m. acrylic painting class at the Holmes Art Cellar, located in the basement of the Historic Holmes Theatre, 806 Summit Ave., Detroit Lakes. Learn basic techniques on how to use acrylic paints and start your own masterpiece. Bring your own sample image on which to base your painting, or use one of those provided. Cost is $65 per person, which includes all supplies. Class is intended for artists age 16 and up; class size is limited, so please sign up in advance at dlccc.org/artcellar.html to reserve your spot.\nFood and Beer Pairing Dinner: Bucks Mill Brewing in downtown Detroit Lakes will host a food and beer pairing dinner starting at 6 p.m. Cost is $60 per person, which includes four courses, each paired with an exceptional brew. La Barista will be catering the meal, with brews selected from Bucks Mill's own menu. Sign up in person at the Bucks Mill taproom, 824 Washington Ave.\nADVERTISEMENT\nWomen's History Presentation with Doug Ohman: Join Minnesota author Doug Ohman at the Becker County Museum, 714 Summit Ave., Detroit Lakes, for a 6:30 p.m. presentation on \"Influential American Women\" including Clara Barton, Amelia Earhart and Harriet Tubman, just to name a few of the author's favorites. The museum exhibit, \"She Shattered: Women's Rights and Workplace Stories,\" sponsored by the Detroit Lakes Area League of Women Voters, will be open for viewing starting at 6 p.m., and will remain open for a half hour after Ohman's presentation. Admission is $10 per person (museum members receive a 50% discount). Tickets can be purchased in advance via the museum's online store at beckercountyhistory.org/store as well as at the door.\nFriday. September 20\nSquare Dancing: The Country Twirlers will host a square dance from 7-9 p.m. at the Oddfellows Hall, 118 W. Holmes St., Detroit Lakes. Charley Huhtala will be the caller. Admission is $5 per person; all are welcome. For more information call 218-849-9317.\nBethlehem Lutheran Fall Supper: The annual fall supper and bake sale at Bethlehem Lutheran Church in Frazee will take place from 4:30-6 p.m. Enjoy a supper of turkey steak with all the trimmings, for a free will offering, and don't forget to check out the bake sale before you leave. Dine-in and drive through options available. The church is located at 210 E. Maple Ave., Frazee. Call 218-334-2866 for more information.\nLive Music: Doug Thompson at the Sandbar II in Detroit Lakes, 6:30-10 p.m.; Broseph Tucker Band at Shooting Star Casino's Mustang Lounge in Mahnomen, 8 p.m.-12:30 a.m.; Smokin' Amp DJ at the Detroit Lakes Holiday Inn, 9 p.m.-1 a.m.\nSaturday, September 21\nBack Roads Studio Art Crawl: The 2nd Annual Back Roads Studio Art Crawl will be held from 10 a.m.-5 p.m., with 12 artists in eight locations around the Vergas area participating. There will be a door prize drawing at each location, which includes artist Carol Albright's studio at 1210 East Frazee Ave. in Vergas; Jody Marquart's blacksmith studio at 33454 Sybil Lake Road; Dan Modrow's wood turning studio, Turning Nature, at 34804 Sybil Lake Lane; Leona Rogers' paper flower making studio at 37253 Delight Lane; Forest Edge Gallery at 46461 295th Ave., where artists Helena Johnson, Patrick Shannon, Kris Domier, Karla Urbach and Marlys Bucholz Pearson will all be participating; Lost Highway Pottery at 27015 4070th St., where artist Butch Pavlacky will be participating; Brianna Mae Designs jewelry studio at 140 E. Main Street, Vergas; and Billy's Corner Bar at 158 W. Main St., Vergas, where author Lucinda Michalski will be signing copies of her book, \"SOS.\" The Back Roads Studio Art Crawl is sponsored by the Vergas Arts Club, in conjunction with the Vergas Community Club. Go to the Vergas Community Club’s Facebook page or web page at vergascommunityclub.com for further information.\nAround the World in 30 Instruments: The Detroit Lakes Public Library (1000 Washington Ave.) will host a free family concert at 1 p.m. This concert, titled \"Around the World in 30 Instruments,\" will feature the Celtic, world and folk music duo Four Shillings Short, which consists of husband-and-wife duo of Aodh Og O'Tuama, of Cork, Ireland, and Christy Martin, of California. This concert is free and open to the public, courtesy of the Lake Agassiz Regional Library.\nDetroit Lakes Oktobierfest: Detroit Lakes' 2nd Annual Oktobierfest will take place from 12-6 p.m. The community's downtown retail district will be transformed into Little Germany, with live music, the finest Bavarian cuisine and Bier Garten, stein-holding competitions, yodeling challenges, costume contest and more. Tickets are $30 for adults (age 21 and up), which includes a limited edition commemorative stein and complimentary first pour; or $15 for young adults age 13-20 (no stein included). There is no cost for kids age 12 and under to attend. The Detroit Lakes Noon Rotary Club invites all area residents to throw on their lederhosen and dirndls (German dress is optional, not required) and come on down!\nADVERTISEMENT\nLive Music: Broseph Tucker Band at Shooting Star Casino's Mustang Lounge in Mahnomen, 8 p.m.-12:30 a.m.; Runestone Rebellion at the Holiday Inn in Detroit Lakes, 9 p.m.-1 a.m.\nSunday, September 22\nPermit to Carry Class: The Becker County Sportsman's Club will host a full-day Minnesota permit-to-carry firearms class from 9 a.m.-3 p.m., taught by Red Bull Firearms Training. This class will cover the laws pertaining to the permit as well as the basic fundamentals of marksmanship. Cost is $80 for new students, $70 for renewals, and includes lunch. Handgun rental for $20 also available. Call 218-234-7145 to register.\nSunday Brunch Open Mic: Come to the Corner Collective Bistro, Arts and More at 300 2nd St. NW (upper level), Frazee, from 11:30 a.m.-1:30 p.m. for some crepes, coffee and live music. All ages welcome to participate in open mic; do it karaoke style, or plug in your own instrument.\nDylan Brune Cancer Benefit: The Frazee Event Center will host a benefit for Dylan Brune, who is battling sarcoma bone cancer, from 12-6 p.m. Enjoy a pulled pork dinner (free will offering) and live music while participating in the raffles, silent auction, bake sale and more, while supporting a young man whose family has always been a huge part of the Frazee community.\nPatriot Assistance Dogs Team Graduation: Join the Patriot Assistance Dogs program volunteers at 1 p.m. inside the Detroit Lakes Pavilion to celebrate those PAD teams that have graduated over the past year. Doors open at 1 p.m., with the graduation ceremony taking place at 3 p.m. Though the event is free and open to the public, please RSVP to participate in all of the fun games of chance, enjoy the meal and more. Sign up online at patriotassistancedogs.myshopify.com (under \"Event Tickets\") to reserve your spot.\nPaint With Nate: Join Park Rapids artist Nate Luetgers at the Tamarac Discovery Center for a fun afternoon of painting, starting at 2 p.m. Artists and aspiring artists of all ages welcome. Cost is $40, which includes all the materials and instruction needed to complete the project. Preregistration is required; sign up online at eventbrite.com to reserve your spot. This event is co-hosted by the Friends of Tamarac National Wildlife Refuge. The Discovery Center is across the road from the Visitor Center at 35704 Cty. Hwy. 26, Rochert. For more information on this event, call 218-847-2641, visit fws.gov/refuge/tamarac or check the Refuge's Facebook page at facebook.com/TamaracNWR.\nTamarac Sunday Movie: A free screening of the family-friendly, nature-themed movie, \"Penguin Post Office,\" will be held at 2 p.m. in the Visitor Center at Tamarac National Wildlife Refuge, Co. Hwy. 26, Rochert. In the heart of the Antarctic Peninsula there’s a unique British post office surrounded by jaw-dropping scenery that includes 3000 gentoo penguins. Every summer, this colony of penguins returns from deep sea fishing to its breeding grounds alongside the post office trekking two miles across sea ice and snow. Run time is approximately 55 minutes; all are welcome. For more information on this event, call 218-847-2641, visit fws.gov/refuge/tamarac or check the Refuge's Facebook page at facebook.com/TamaracNWR.\nMonday, September 23\nAnime and Manga Club: Anime and manga fans are invited to geek out over their favorite shows and stories, starting at 4 p.m. at the Detroit Lakes Public Library. This month the discussion will focus on school life as portrayed in anime, from contemporary Japanese school life to superhero schools, magic academies and schools set in another world entirely. Highlighted shows will include \"My Life as a Villainess,\" \"My Hero Academia,\" \"Mashle\" and \"Jujutsu Kaisen.\" Open to all area teens (age 13 and up) who are interested in joining. No cost to attend.\nContributions of American Indians in History: Join historian Travis Zimmerman at the Detroit Lakes Public Library for a 2 p.m. presentation, \"Don't Know Much About History: Contributions of American Indians in History.\" Zimmerman, who is the site manager for the Mille Lacs Indian Museum and Trading Post, will discuss the history and culture of Minneseota's indigenous people, including Ojibwe culture and American Indian contributions to history, such as their military service and the World War II \"code talkers.\" This presentation is free and open to the public, thanks in part to funding from the Minnesota Arts and Cultural Heritage Fund.\nTuesday, September 24\nDetroit Lakes Library Club: Join Matt Davis, regional trail coordinator for the North Country Trail Association in North Dakota, Minnesota and Wisconsin, for a 2 p.m. presentation at the Detroit Lakes Public Library, 1000 Washington Ave. Davis will talk about \"Exploring Our North Country Trail in the Lakes Area,\" as well as opportunities for supporting the nation's longest hiking trail and its amazing local volunteers. Entertainment will be provided by vocalist Kathy Larson. The Library Club invites the public to come early and enjoy a complimentary cup of coffee and a treat prior to the presentation.\nWednesday, September 25\nAdvance Planning Seminars: David-Donehower Funeral Home in Detroit Lakes will be hosting two advance planning seminars, at noon and 5:30 p.m. Area residents are invited to join them for a light meal and presentations on advance funeral planning and the major changes in coverage anticipated for Medicare Part D plans in 2025. Both the presentation and meal are free and open to the public, but RSVPs are requested for planning purposes. Call 218-847-4147 to reserve your spot.\nWomen's EDGE Workshop: The Detroit Lakes Regional Chamber of Commerce will be hosting the final presentation in its 2024 Women's EDGE Speaker Series, \"Mentorship Mastery: A Path to Loving and Living Our Best Life,\" from 2-5 p.m. in the Venue at Meadows on Lind, 11457 U.S. Hwy. 59, Detroit Lakes. Renowned keynote speaker Brent Stromme will kick off the workshop with a presentation on the power of mentorship, assisted by expert facilitators Missy Wokasch and Karen Pifher. Cost is $60 per person if you are just registering for this event; if you purchased your ticket as part of the speaker series package, there is no additional fee. Register online at business.visitdetroitlakes.com/events or call 218-847-9202.\nMethodist Meatball Supper: Detroit Lakes United Methodist Church will be hosting a meatball supper from 4:30-7 p.m. To-go meals will be prepared for pickup only; no on-site dining. The meal includes two meatballs, mashed potatoes and gravy, a roll, green beans, coleslaw and dessert. Cost is $15 per meal; cash, check or credit cards accepted. The church is located at 885 Pembina Trail, Detroit Lakes.\nOpen Acoustic Jam: Bring your acoustic instruments to the Detroit Lakes Public Library for an unplugged jam session, starting at 5 p.m. All experience levels are welcome to this supportive and family-friendly event. Free and open to the public. Bring your acoustic instrument and come have some fun!\nMulti-day and Recurring Events\nLaker Prep Plants and Parties: The first official fundraiser for Laker Prep Early Childhood Center and Preschool, \"Plants and Parties,\" will take place on Sept. 20-21. From now through Sept. 21, area residents can purchase $10 raffle tickets for a chance to win one of a handful of \"party experiences\" (some for kids, some for adults), donated by local businesses and organizations. On Friday, Sept. 20, Laker Prep Early Childhood Center will be hosting a plant sale, with a variety of colorfully potted succulents and perennials for purchase from 3-5:30 p.m. Then, on Saturday, Sept. 21, a second plant sale will take place from 10 a.m.-5 p.m. at Lakeside Tavern and Brewery. All proceeds from the raffle and plant sales will go to benefit the \"learning and teaching environment\" at Laker Prep, which is a 501(c)(3) nonprofit organization as of 2023.\nShady Hollow Flea Market: The Shady Hollow Flea Market is open from 7 a.m.-3 p.m. every Saturday through the end of September. For more information visit shadyhollowfleamarket.com online or call 602-809-6661.\nFarmers Market: The Lakes Area Farmers Market will be open every Tuesday and Saturday through the end of September in Detroit Lakes' Peoples Park from 10 a.m.-1 p.m. Come shop with your favorite returning vendors, or discover some new ones, until 1 p.m. Vendors accept EBT cards and food checks to be used for fresh fruit and vegetables. Go to lakesareafarmersmarket.info for more information.\nMaster Gardening Clinics: The Becker County Master Gardeners will host their weekly Plant, Pest and Gardening Clinics, every Wednesday through the end of September, 9 a.m.-12 p.m. at the local University of Minnesota Extension Office, which is located at 1120 8th St. SE in Detroit Lakes. Bring your plant, pest, disease or gardening questions to them for helpful solutions and ideas. Samples would be helpful for answering specific questions. For more information, including what types of samples are needed, call 218-846-7328, extension 7105.\nSleeping Bags Needed: The Holy Rosary Knights of Columbus in Detroit Lakes are collecting sleeping bags for distribution to those in need. Anyone who has a new or used, functional sleeping bag (i.e., the zipper works) can drop them off at the Becker County Food Pantry, 610 Terry St., Detroit Lakes, anytime between 8 a.m.-3 p.m. on Tuesdays and Thursdays. For more information contact Brad Carlson at 218-234-4448.\nGrace Cafe: Grace Lutheran Church in Detroit Lakes will be serving lunch every Wednesday from 12-1 p.m. The lunch is open to all in the Detroit Lakes area; admission is a free-will donation. Guests are welcome to stay after the meal to play games or cards.\nGrace Food Pantry: Grace Lutheran Church in Detroit Lakes will be operating a food pantry during its regular office hours, 9 a.m.- noon Monday through Friday. Anyone in need can come in and pick up some food. Donations will also be accepted.\nLibrary Storytime: The Detroit Lakes Public Library offers weekly Preschool Storytime sessions every Thursday at 10:30 a.m. Preschoolers and their caregivers/families are invited to join library staff for stories, flannel boards, finger plays, songs and more. This early literacy experience explores a different theme each week and is a way to encourage young children to enjoy reading. Call 218-847-2168 for more information.\nCelebrate Recovery: The Celebrate Recovery group meets every Tuesday, 6:30-8 p.m. at Christian Fellowship Church, 28048 Meadow Drive, Detroit Lakes, to take the next steps on the \"Road to Recovery: Eight Principles Based on the Beatitudes, Twelve Steps and their Biblical Comparison.\" Many struggle with alcoholism, divorce, sexual abuse, codependency, domestic violence, drug addiction, food and gambling addictions. Celebrate Recovery is a tried and proven format to help you walk through life's struggles. Men and women meet in a large group format, then break off into smaller discussion groups; men with men, women with women. Come as you are. No cost. We are here to help. Unfortunately, no childcare is available at this time. For more information, check out the website at celebraterecovery.com or call us at 218-234-2496.\nCaring Cup Grief Support: The Caring Cup, a gathering of community members who are dealing with the loss of a loved one, will meet at the David-Donehower Funeral Home in Detroit Lakes on the second Wednesday of every month; the Furey Funeral Home in Frazee on every third Wednesday, and West-Kjos Funeral Home in Detroit Lakes on every fourth Wednesday. All meetings take place from 10:30 to 11:30 a.m., and offer a relaxed time to face the challenges of life after loss, together. For more information, call Mary Swenson at 218-847-4147.\nTOPS Meeting: The local chapter of Take Off Pounds Sensibly (TOPS) meets weekly on Thursday mornings at Trinity Lutheran Church, 1401 Madison Ave., Detroit Lakes. Weigh-in begins at 8:20 a.m., meeting at 9 a.m. Contact Carol at 218-841-0226 or Coleen at 218-841-2877 for more information. All are welcome; first session is free.\nTrivia Nights: Lakeside Tavern in Detroit Lakes hosts a Trivia Night every Monday from 7 to 9 p.m. Event takes place in Lakeside Tavern's upstairs space, so seating is limited. Open to the public.\nGED/Adult Diploma Instruction: If finishing high school is still on your “to-do” list, it is never too late!! Lakes Area Adult Education is open and ready to help you meet your goals. Orientation sessions for GED or Adult Diploma classes take place twice a month, so get in touch and get started now! Call 218-844-5760 or email slandsem@detlakes.k12.mn.us. Additional Adult Education offerings and associated flyers can always be found at dlschools.net/departments/community-education.\nFree ESL Instruction: Free English as a Second Language instruction is offered for adults in the Detroit Lakes Area, every Monday through Thursday (holidays excepted) at Lakes Area Adult Education. The schedule is flexible and individualized. Call 218-844-5760 or email slandsem@detlakes.k12.mn.us for more information. Additional Adult Education offerings and associated flyers can always be found at dlschools.net/departments/community-education.\nMinnesota Driver's License Exam Preparation: Detroit Lakes Adult Basic Education offers virtual classes that are designed to help unlicensed adult drivers become familiar with vocabulary, signs and rules of the road so they can successfully pass the written portion of the Minnesota Driver’s License Exam. Call 218-844-5760 or email slandsem@detlakes.k12.mn.us for more information. Additional Adult Education offerings and associated flyers can always be found at communityed.dlschools.net.\nDL Cloggers: The DL Cloggers meet to dance and socialize every Tuesday (excluding holidays) at 1 p.m. in the basement of Detroit Lakes VFW Post 1676. No prior dance experience necessary. For more information, call Ruby at 218-847-7741.\nHR Connect: The Detroit Lakes Chamber is hosting an opportunity for human resources professionals, business owners and managers to connect, every first Thursday of the month at 8:15 a.m. at the Chamber office at 700 Summit Ave. Discuss human resource topics, share best practices and review data to help attract, retain and grow the workforce for the lakes region. Event is free for Chamber members, $10 for non-members.\nBaby Bounce: Songs, stories, and action poems for infants, toddlers and their caregivers are offered every Monday at the Detroit Lakes Public Library at 10:30 a.m. Program runs about a half hour including playtime and chatting with other caregivers. For ages 0-18 months. Call 218-847-2168 for more information.\nAlcoholics Anonymous: Detroit Lakes' Alano Club meets at 827 Summit Ave. on the following days and times: Sundays at 1 p.m., 12x12 open meeting; Tuesdays at 7 p.m., Big Book open meeting; Wednesdays at noon, Grapevine open meeting; Wednesdays at 6 p.m., women's open meeting; Thursdays at 7 p.m., Intro to AA open meeting; Saturdays at 7 a.m., men's open meeting; Saturdays at 9 a.m., Women's Big Book closed meeting; Saturdays at 8 p.m., open topic meeting. There are no dues or fees for meetings. For more information, call 218-844-9970 or the District 3 AA Helpline at 877-833-2327.\nHoly Rosary Al-Anon Meeting: There will be an Al-Anon meeting every Thursday, starting at noon, inside Holy Rosary Catholic Church, 1043 Lake Ave., Detroit Lakes. There is also an Al-Anon meeting at 7 p.m. every Tuesday at the Alano Club at 827 Summit Ave. in Detroit Lakes.\nOvereaters Anonymous: A 12-step program for those who struggle in their relationship with food, Overeaters Anonymous continues to meet at noon every Tuesday at Holy Rosary Catholic Church in Detroit Lakes. There is no charge to attend. Contact Debbie C. at 218-234-3071. Another group also meets on Sunday nights at 6 p.m. via Zoom. This is a change of venue as of Oct. 9. Please call Sharon R. at 1-701-388-7585 or Hailee S. at 1-701-212-7904 for information if you plan to join the Zoom meeting. There is no charge to participate.\nCompiled by Vicki Gerdes for the Detroit Lakes Tribune.",
  "word_count": 5421,
  "scraped_at": "2026-02-14T12:33:31.129666"
}