{
  "article_id": "80f50b9041d3",
  "url": "https://www.liverpoolfc.com/news/2023-24-barclays-womens-super-league-fixture-details-key-dates-and-transfer-window",
  "title": "Liverpool FC 2023 - 24 Barclays Women Super League : Fixture details , key dates and transfer window",
  "date": "20230617T094500Z",
  "domain": "liverpoolfc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Guide2023-24 Barclays Women's Super League: Fixture details, key dates and transfer window\nLiverpool FC Women will look to build upon their seventh-placed finish in last season's Barclays Women's Super League when they play their second campaign back in the top division in 2023-24.\nHere's our guide to the key dates and details for what promises to be another exciting season for Matt Beard's side.\nFixtures release\nA reveal date for the Barclays Women's Super League fixture list is still to be confirmed.\nOnce announced, the schedule will be available in full on Liverpoolfc.com, with games then subject to change due to television broadcast.\nKey dates\nThe start of the season will be a little later than in previous years due to the Women's World Cup taking place in Australia and New Zealand between July 20 and August 20.\nThe opening matchweek of the 2023-24 WSL season will therefore take place between September 29 and October 1.\nThe final fixtures will take place on the weekend of May 18 and 19 next year, which is the same weekend that will see the conclusion of the Premier League for 2023-24.\nTransfer window\nThe summer transfer window runs from June 23 to September 14, though deals for free agents can be agreed outside of these dates.\nThere will then be a second window in the winter, which will likely run through the month of January 2024.\nPromoted team\nBristol City followed in the footsteps of LFC Women by winning the FA Women's Championship last season, and they will replace relegated Reading in the WSL for 2023-24.\nLiverpool supporters will have fond memories of their last visit to Bristol, as it saw them clinch the second-tier title and promotion in April 2022 with a 4-2 win. The teams drew 0-0 in the reverse fixture at Prenton Park earlier in the season.\nWatch: LFC Women's top 10 goals in 2022-23\nCup football\nThe dates for the early rounds of the Continental League Cup have yet to be confirmed.\nLFC Women reached the quarter-finals of the competition last season and will hope to make it to the 2024 final, which is scheduled for the weekend of March 30.\nThe Reds will enter the Women's FA Cup at the fourth-round stage, with those ties pencilled in for Sunday January 14. The final is set to take place at Wembley on May 11 or 12 next year.",
  "word_count": 399,
  "scraped_at": "2026-02-14T13:08:25.396795"
}