{
  "article_id": "8119e50e5071",
  "url": "https://hoganstand.com/County/National/Article/Index/335290",
  "title": "  We just want to keep pushing ourselves on to reach our full potential  ",
  "date": "20250301T120000Z",
  "domain": "hoganstand.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Niamh Coleman of Armagh in action against Niamh Carmody of Kerry during the 2022 Lidl Ladies NFL Division 2 Final between Armagh and Kerry at Croke Park. Pic Brendan Moran/Sportsfile\nBy Daire Walsh\nBy lining out at inter-county level for their native Armagh, Niamh Coleman and her younger sister Dearbhla are maintaining a strong family legacy.\nFormerly their manager when the Orchard County claimed an Ulster minor ladies title nine years ago, the Colemans’ father Tommy played senior football with the Armagh men and was a starter in an Ulster championship final defeat to Tyrone in 1984. While their mother Avoureen has always had a keen interest in the big ball game – representing the Lurgan-based Clann Eireann in the past – it was in the sport of camogie that she donned the orange and white.\nIn the same year she jointly-captained the minor side to that provincial crown, Niamh followed in her parents’ footsteps when she made her debut for the Armagh seniors in a Lidl National Football League encounter against Dublin at the BOX-IT Athletic Grounds on April 3, 2016. Fast forward a few short years and Coleman, who recently secured a permanent teaching position at St Francis’ Primary School in Lurgan, was thrilled to be joined on the Orchard panel by her aforementioned sibling Dearbhla.\n“Dad, he still has some of his Armagh jerseys. He would have played football for Armagh as well. Some of his Ulster final jerseys he still has. He would have been involved in our club and then he got into the county as well. He would have taken a lot of the girls for county minors. We had a bit of success under him as well. He’s football mad!” Niamh explained.\n“Then Mum’s first sport would have been camogie. She had success with the county as well. She would have played football for our club, but never really progressed for the county. Camogie was her number one sport.”\nIn more recent times, Tommy and Avoureen have become proud supporters of their daughters as they have enjoyed success with the Armagh footballers. Last April saw the Coleman sisters featuring in the starting line-up – Niamh at midfield and Dearbhla at left half-back – when the Orchard defeated Kerry in Croke Park to secure their maiden Lidl NFL Division 1 title.\nWhile this game began brightly for the elder Coleman when she rattled the Kerry net in response to a Lorraine Scanlon three-pointer for the Kingdom, she was unfortunately withdrawn before the opening half had come to a close. The nature of her injury ensured Niamh wasn’t in the ground by the time her Clann Eireann colleague Clodagh McCambridge climbed the steps of the Hogan Stand to lift the top-tier league trophy, but she nevertheless found a way to keep up to speed with how the second period action unfolded.\n“It was a strange one. I got injured I think 20 minutes in, unfortunately. I was coughing up blood, so the doctor advised that I should go to the hospital and get checked out. Thankfully I think it was just from the impact.\n“I was fine, but as I was waiting in the waiting room, I had the game on my phone. The TG4 Player! Trying to watch and cheering the girls on. It was lovely to see the celebrations and then I was able to meet up with the girls afterwards. I didn’t miss out on too much. The girls did the work for me!”\nHaving won Division 2 and Division 1 league crowns under the guidance of Shane McCormack and Greg McGonigle respectively in the past two seasons, Coleman and Armagh now find themselves under the joint management of Darnell Parkinson and Joe Feeney for 2025. The fact that this duo were part of McGonigle’s backroom team last year means there is some level of continuity and the Orchard are currently flying high at the summit of the NFL top-tier with four wins from as many games.\nRemarkably, Armagh have secured victory in 19 of their last 20 league fixtures stretching back to the start of the Division 2 campaign in 2023 with a solo reversal coming at the hands of Dublin in last year’s Division 1 – by which point the Orchard women had already booked their spot in the league final.\nThe Ulster outfit did previously fall short to Kerry in a Division 2 decider back in 2022 and while there have also been some difficult defeats at the quarter-final and semi-final stages of the TG4 All-Ireland senior football championship, Coleman acknowledged a desire to keep improving year-on-year has helped them to reach their current position of strength.\n“It was a bit hard to push out of Division Two. Obviously, Kerry beat us that first time in the final, but from there then, we kicked on. We just wanted to keep building and building and pushing. We know that we’re able to compete with those top teams. Obviously Kerry beating us in the All-Ireland semi-final last year too.\n“We know we’re there or thereabouts. We just want to keep pushing ourselves on to reach our full potential. The past couple of years has been brilliant, the success the county has had. We’re really happy with our results and our performances in the league so far.”\nHaving already overcome the challenges of Kerry, Tyrone, Dublin and Mayo, Armagh will be hoping to make it five straight wins in this year’s Lidl NFL Division 1 when they face Kildare at Silverbridge Harps tomorrow afternoon (throw-in 2pm).\nA year on from Armagh securing the same title, Kildare claimed the National Football League Division 2 crown for 2024 with an impressive final triumph over Tyrone.\nAfter being in a similar position to the Lilies themselves not so long ago, Coleman (whose sister Dearbhla is currently battling her way back from injury) is careful not to take their upcoming opponents for granted – particularly when they have gotten the better of provincial rivals Dublin and Meath in recent weeks.\n“They’re a really exciting team and it’s going to be a big challenge for us. We know that they’re going to be coming out with great fight, especially because we have the home advantage. Hopefully we try and push on from that,” Coleman added.\n“It’s a team that is new, like we were playing in previous years coming up from Division Two. We know what it is like. Sometimes even media or other teams can write you off, but we definitely won’t be sitting on our laurels.”\nTweet",
  "word_count": 1092,
  "scraped_at": "2026-02-14T13:31:57.458667"
}