{
  "article_id": "8132a38dbea3",
  "url": "https://home.nzcity.co.nz/news/article.aspx?id=390541",
  "title": "Football has been the big sporting winner in the New Year Honours List - 30 - Dec - 2023",
  "date": "20231229T193000Z",
  "domain": "home.nzcity.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "News | Rugby\n14 Feb 2026 20:00\nNZCity News\n30 December 2023\nShe's appeared on the New Year Honours List for services to football governance following this year's World Cup across New Zealand and Australia.\nThe tournament saw the attendance record for a football game in Aotearoa snapped three times - with the top mark of 43,217 in the stands for the semi-final between Spain and Sweden at Eden Park.\nBareman says there's plenty of events to keep an eye on next year, including under-17 and under-20 World Cups.\n© 2026 Newstalk ZB, NZCity\nThe tournament saw the attendance record for a football game in Aotearoa snapped three times - with the top mark of 43,217 in the stands for the semi-final between Spain and Sweden at Eden Park.\nBareman says there's plenty of events to keep an eye on next year, including under-17 and under-20 World Cups.\nBlues fullback Zarn Sullivan has fresh motivation heading into the Super Rugby Pacific season More...\nOpenAI has deleted the word ‘safely’ from its mission – and its new structure is a test for whether AI serves society or shareholders More...\nBijou Phillips has launched an urgent appeal to find a kidney donor 19:51\nEntertainment:\nStacy Keibler says it was a \"gift from God\" to be with James Van Der Beek in his \"final days\" 19:21\nHealth & Safety:\nTwo sailors have been hospitalised after a nasty crash between the Black Foils and France, forcing the cancellation of racing for the day at the Auckland Sail GP event 18:57\nEntertainment:\nJames Van Der Beek's widow has launched a GoFundMe 18:51\nRugby:\nBlues fullback Zarn Sullivan has fresh motivation heading into the Super Rugby Pacific season 18:37\nEntertainment:\nNick Jonas admires Priyanka Chopra's \"willingness to get her hands dirty\" 18:21\nPolitics:\nThe US government has just entered another shutdown. Here's what it means this time 18:17\nCricket:\nAn international sporting rivalry is set for another chapter 18:07\nEntertainment:\nJennifer Garner channelled her dance background in The Last Thing He Told Me 17:51\nRugby:\nNews Chiefs recruit Kyren Taumoefolau is looking to continue his momentum after being named to start on the right wing for tonight's Super Rugby Pacific clash with the Blues in Auckland 17:37\nPower Search",
  "word_count": 373,
  "scraped_at": "2026-02-14T12:30:46.183665"
}