{
  "article_id": "815abd53bb4a",
  "url": "https://www.nzherald.co.nz/lifestyle/society-insider-martin-hendersons-property-investment-with-girlfriend-kathryn-wilson-expands-to-arrowtown-auckland-fc-goalkeeper-michael-wouds-romantic-proposal/UZ5YWGKQNZETNI5O7PGV5TP6EI/",
  "title": "Society Insider : Martin Henderson property investment with girlfriend ; Kathryn Wilson expands to Arrowtown ; Auckland FC goalkeeper Michael Woud romantic proposal",
  "date": "20250702T174500Z",
  "domain": "nzherald.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Man about town Ricardo Simich brings you Society Insider. This week, Martin Henderson and girlfriend Penny Hay have bought a house together; Kathryn Wilson is opening her first South Island store; Auckland FC goalkeeper’s romantic proposal; and the Kiwis spotted in the crowd at Glastonbury.\nSociety Insider: Martin Henderson’s property investment with girlfriend; Kathryn Wilson expands to Arrowtown; Auckland FC goalkeeper Michael Woud’s romantic proposal\nSubscribe to listen\nProperty records from last year show Hay and Henderson made a property investment together north of Auckland, purchasing a coastal sanctuary in trendy Point Wells for an estimated $3 million.\nThe residence is nestled in a generous 1260 sq m of landscaped tropical gardens and a pool.\nNeither Henderson nor Hay returned Society Insider’s attempts to contact them in regard to their plans for the home.\nHay has made a successful name for herself, and her work features in design magazines, including Australian Vogue Living and Elle Decoration.\nHay often collaborates with her brother Tim, of multi-award-winning Fearon Hay Architects in Grey Lynn, famous for designing some of New Zealand’s most magnificent homes and commercial buildings. Fearon Hay’s acclaimed designs include Takapauna’s City Beach House, The Wintergarden at The Northern Club and The Brancott Estate Heritage Centre in Marlborough.\nHer business, Penny Hay Design, was founded in 2004, and has completed high-end residential and tailored commercial projects in the United States, Asia, the Middle East and Australia, as well as New Zealand.\nShe is said to have been a great help to Henderson with refurbishments for his Great Barrier pad, for which he is estimated to have paid more than $1 million. The home has sweeping views looking out over Whangaparapara Harbour.\nHay also did fabulous work on a Great Barrier property she owns with Tim and her other brother, Jeremy, who is the managing director of project management firm RCP. The Hays’ home, called Storm Cottage, is in a pristine position on the water in Oruawharo Bay.\nStorm Cottage is 50 metres from another property owned by the siblings, the 16-acre Fearon Hay multi-award-winning 2000 square foot, glassy, minimalist retreat, which can be rented for $1500 per night.\nStorm Cottage is currently for sale through high-end real estate firm, Wall Real Estate, with an estimated value of $3m.\nHay’s next project is believed to be a fabulous house by Te Arai Links golf course, in Auckland’s north.\nHenderson’s last public relationship was with Mexican model Aisha Mendez, which is understood to have ended in late 2020.\nSince 2019, Henderson has been the star of one of Netflix’s biggest hits, the Vancouver-filmed Virgin River, where he stars alongside Alexandra Breckenridge.\nIn the last season, their characters, Melinda Monroe and Jack Sheridan, got married, and there are reports of a seventh season.\nLast year Henderson was back home to star in the Rachel Griffiths-led Kiwi show Madam and earlier this year he filmed his fifth season of Lucy Lawless’ show My Life is Murder.\nAfter three decades of living in Australia and Hollywood, Point Wells and Great Barrier are not Henderson’s only New Zealand real estate investments. Records show the 50-year-old star has also purchased a luxury apartment in Auckland’s Viaduct in a premium building on Halsey St.\nThis year, Henderson has used his social media to hit out at scammers, after reports of women being conned out of money by impostors claiming to be him and asking for money for flights, hospital treatments and legal fees. One woman who spoke to the Herald was scammed out of $375,000.\nHenderson urged fans to cease all contact with anyone saying they were him. He told the Herald in March it was awful to have his name and likeness associated with something that had caused such harm to someone.\nAn earlier version of this story said Penny Hay was an interior architect. It has been amended to clarify that she is an interior designer.\nKiwi shoe queen’s Arrowtown dream\nNew Zealand’s shoe queen, Kathryn Wilson, has fulfilled a long-held dream by opening her first South Island store in Arrowtown this week. Wilson is the latest high-end brand to open on Buckingham St, further boosting Arrowtown’s appeal as a destination for fashionable shoppers.\nAfter more than 20 years in business, Wilson knows the rollercoaster of the fashion business. She already has retail stores in Auckland’s Remuera and Herne Bay, one in Wellington in the Old Bank Arcade, and she was determined to open a store in the South Island this year.\n“I thought it would be Christchurch first, but things have come together in very special ways to make Arrowtown happen first,” Wilson tells Society Insider.\nHer husband Liam Taylor spent 10 years in Queenstown with his business Exclusive Events, before he co-founded high-end marketing firm Dark Horse. Last week, while Wilson was getting her store ready to open, Taylor, director of the NZ Fashion Week Board, was part of a glamorous event at Giltrap Group on Auckland’s New North Rd, where the first tranche of Fashion Week designers and partners were revealed for this year’s event. Wilson was announced as one of the headlining designers on the programme.\nHaving a “flagship” brick-and-mortar presence in the South has been important to Wilson.\n“It’s not just for my local clientele, there are a huge number of tourists coming in that I want to appeal to as well,” she says.\nWhen Society Insider spoke with Wilson on Sunday, she had finished cleaning the awning and was doing the finishing touches on the exterior paint. A woman visiting from Sydney was her first sale on Saturday night, and shoes were being sold at a steady pace on Sunday.\nAfter putting her Arrowtown dream out there in February, Wilson and her family were holidaying at Dame Julie Christie’s holiday home in Hokitika, when her dream manifested.\n“My friend and stockist Francesca King called me and told me the perfect store had come up for lease on Buckingham St,” says Wilson. “I was so lucky to hear about the store before it hit the market.”\nThe store is owned by high-rolling Queenstown property developer John Guthrie, and Wilson says when she met with him, she told him about her dream and love for the street. The south-end corner site at 16 Buckingham St was built in 1863 and previously tenanted by former The Block judge, interior designer Jason Bonham of Bonham Interiors.\nThe Block’s former co-host and in-demand interior designer, Shelley Ferguson, helped Wilson transform the dark gallery into a light space to show off her shoes to perfection, while Nadia Lim, who has her Royalburn Farm Shop around the corner, connected Wilson with the electrical firm she used for her store.\nNext door to Wilson’s new store is celebrity chef Ben Bayly’s popular Italian fine dining restaurant Aosta and accompanying Little Aosta. Further down the lane is the famous Blue Door Bar.\n“I said to Ben a few years ago that I would love to have a little high heels bar in Aosta, and now I am next door.”\nWilson picked a good week to open; 150 well-heeled guests are heading to Ayrburn tonight for the annual Winter Wonderland Gala. This year, the gala is taking place at Ayrburn’s plush new restaurant, Billy’s, doubling as a launch party, two days before it opens to the public.\nSociety Insider is told the black-tie affair with a Chinese twist will be full of surprises, including “A Bump With Billy” – the venue’s signature offering, which entails a bump of caviar and a shot of Chinese distilled wine, Moutai.\nIn two weeks’ time, Wilson will host her Arrowtown store’s official opening - with Aosta doing the catering.\nAuckland FC star’s romantic proposal\nMichael Woud was one of Auckland FC’s first signings when the club was established and he’s been working hard in his role as the A-League club’s goalkeeper. But recent events have outshone his performance on the pitch, with the Kiwi keeper executing an impressive romantic engagement proposal last month in Bali.\nWoud, 26, and his partner of nearly three years Zana Renton, 24, had just spent an amazing day together exploring Uluwatu.\n“We stopped for a late lunch where Michael said he had booked a couples’ massage for us back at the resort for 4pm, so we had to be back by then,” Renton tells Society Insider.\nAs they were walking back to their Villa at the Cross Bali Breakers Resort, Woud said to Renton: “You always do surprises for me, so I wanted to surprise you.”\n“We walked into our villa and Michael led me around the corner to see the pool full of rose petals spelling out ‘Marry Me Zana’,” says Renton.\nShe says she cried tears of joy and turned around to find Woud on one knee, presenting her with a beautiful oval-cut mined diamond solitaire from Partridge Jewellers.\nRenton of course said yes.\nWoud had spent three days planning the proposal, and booked a romantic celebration dinner at Rock Bar, a cliff-top restaurant and bar in Uluwatu known for its stunning sunset views.\n“We spent some time taking it all in, having dinner and didn’t tell anyone for 24 hours,” says Woud.\nThe St Heliers-based pair met not long after Renton moved up to Auckland from Havelock North for modelling - later working as a talent agent for Unique Model Management.\nWoud left Sacred Heart College at age 16 to follow his professional football dreams in the UK and Europe. He was back in Auckland when the pair met through social media in 2022.\nTheir online friendship started hours before Woud boarded a flight to Melbourne, which resulted in a week of non-stop phone calls before they had a chance to meet in person. They later became an item, and when Woud left to play football in Japan at the end of his pre-season with Kyoto Sanga FC, Renton booked a one-way ticket to join him.\nThere, they brought their fur baby, Saki, a Japanese Akita dog. While Woud played for Kyoto and then for Ventforet, Renton, a self-taught artist, was inspired by the Japanese culture.\nAfter a year of living in Japan together, Woud signed for Auckland FC and the trio returned to live in Auckland in April last year.\nAlong with being a talent manager, Renton has found success in selling her art and digital designs through commission-based work with her brand Art Houze.\n“My work is incredibly flexible, helping me mould my schedule around Michael’s football career.”\nWoud says it was amazing to be part of something special with the first season of Auckland FC and being back in Auckland gives him the time to support Renton.\n“The ups and downs we experience in our careers are kind of similar,” says Woud. “She has always been there for me, she’s a great listener, doesn’t judge the situation, but tries to help where she can.”\nThe couple have started throwing some wedding ideas around, but for the moment are still basking in engagement bliss.\nRenton says Woud is the most loving, supportive, selfless, driven and handsome man she knows.\n“The way we love each other is like a heart with a single beat, a united couple that faces any feat together forever,” she says.\nWoud will be back at training in the coming days - this season as FC Auckland’s premier goalkeeper - while the team gets ready for the start of the A League season at the end of this month.\nA good week for... Kiwis at Glastonbury\nLorde hit the stage at the Glastonbury Festival in Somerset, England, last weekend. As well as the 28-year-old Kiwi superstar, artists such as Doechii, Charli XCX, Olivia Rodrigo, Kneecap and Shaboozey also performed, with A-List stars such as Paul Mescal, Margot Robbie, Lily Allen, Lily James and Daisy Edgar-Jones in the crowd.\nRhythm and Vines founder Hamish Pinkham was there with his wife Roma, and described the festival as “the best in the world”. The Pinkhams enjoyed the music in the fields alongside South Island festival promoter Mitch Ryder and his wife Steph, and Sydney-based Kiwi photographer Paddy Foss.\nDays after popstar Rita Ora revealed she broke from tradition by proposing to her husband, Kiwi director Taika Waititi, the couple hit the festival partying with celebs including Lorde, Olivia Rodrigo, Alexa Chung, Pixie Geldof and Jack Guinness.\nWhen rocking Rod Stewart took to the Glastonbury stage on Sunday night, his daughter with Rachel Hunter, Renee Stewart, was also there with her sister Ruby and brother Alastair.\nParty people of the week\nNZ Fashion Week unveiling\nFashion industry insiders gathered at Giltrap Group’s Headquarters on New North Rd last Thursday evening, to celebrate several milestone announcements ahead of New Zealand Fashion Week: Kahuria 2025.\nSurrounded by luxury models from all 18 car brands represented by the event’s naming rights sponsor, Giltrap Group, guests were treated to the official reveal of the first wave of this year’s stacked designer lineup.\nAlso revealed was a preview of the official NZ Fashion Week 2025 campaign, photographed by Mara Sommer and directed by Dan Ahwa, Viva’s former creative director and now a board member of NZ Fashion Week. Fellow board member Murray Bevan was also in attendance alongside board director Liam Taylor.\nParticipating 2025 designers in attendance included Juliette Hogan, Kiri Nathan, Liz and Neville Findlay from Zambesi, and Rory William Docherty.\nOther guests included Rich Lister Michael Giltrap, top model Juliette Perkins, skincare magnates Emma and Andrew Lewisham, photographer Holly Burgess and her designer sister Rebe Burgess, entrepreneur Iyia Liu, and fashion stylist Lulu Wilcox.\nDoc Edge Film Festival Premiere\nThe Doc Edge (The Documentary New Zealand Trust & Screen Edge Limited) Film Festival rolled out the red carpet at Auckland’s SkyCity Theatre last Thursday night for its 20th Anniversary Gala.\nCreatives, filmmakers and fans in fishnets gathered to celebrate two decades of powerful documentaries, diverse voices, and unforgettable stories.\nThe night featured the International Premiere of Strange Journey: The Story of Rocky Horror.\nDirector Linus O’Brien and his father, the film’s legendary subject Sir Richard O’Brien, joined the audience for a lively Q&A, while Rocky Horror specialists Hot & Flustered Shadowcast had everyone up dancing to the Time Warp. Also featured was the world premiere of Sapiosexy, the Documentary, a playful short film created by Saatchi & Saatchi.\nCo-founder and executive director of Doc Edge, Dan Shanan, and general manager and festival producer of Doc Edge, Rachael Penman’s guests included Minister for Arts, Culture and Heritage Paul Goldsmith; broadcasting legend Judy Bailey and her husband, producer and director Chris; broadcaster Neil Waka and his wife, Auckland Girls Grammar Head of Faculty for P.E and Health, Tanya; The 13th Floor founder Marty Duda; Fiona Tarlton; Grand Millennium general manager James Billing and co-director/founder of Doc Edge, Alex Lee.\nDoc Edge runs until August 24 in Auckland, Wellington, Christchurch and online nationwide.\nRicardo Simich has been with the Herald since 2008 where he contributed to The Business Insider. In 2012 he took over Spy at the Herald on Sunday, which has since evolved into Society Insider. The weekly column gives a glimpse into the worlds of the rich and famous.",
  "word_count": 2519,
  "scraped_at": "2026-02-14T13:43:19.777023"
}