{
  "article_id": "815f9ae77f8c",
  "url": "https://news.yahoo.com/trendy-trivia-game-wordle-straight-150000023.html",
  "title": "The Trendy New Trivia Game That Like Wordle for Straight Men",
  "date": "20231001T161500Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Trendy New Trivia Game That’s Like Wordle for Straight Men\nWe are in the midst of an unprecedented, intergenerational phone-game renaissance. Wordle has become a pillar of the New York Times brand, newspapers everywhere are resurrecting their crossword backpage, and Words With Friends has essentially transformed into a dating app. These games are designed to be approachably mainstream—every English speaker alive can deduce a five-letter word with six chances—but unfortunately, I am a man of unconventional taste. If I’m going to entertain a daily dose of potpourri, I need something weirder, more challenging, and better suited for the precise category of useless knowledge that occupies my brain. That’s why the sports-trivia game Immaculate Grid has become a fixture of my morning routine.\nThe structure of Immaculate Grid is similar to the blank canvases of Wordle. Every day, you’re offered a tic-tac-toe puzzle bracketed by the logos of six professional basketball teams. For example, the grid from Sept. 25 has three columns marked for the Utah Jazz, Milwaukee Bucks, and Toronto Raptors, and three rows occupied by the Los Angeles Lakers, Boston Celtics, and Indiana Pacers, respectively. In each of the empty spaces, you’re asked to enter the name of any player from the NBA’s 77-year history who logged time with both of the franchises that meet at the intersection of the grid. Bonus points are awarded based on the obscurity of the athlete identified, which adds a dangerously competitive wrinkle to the proceedings. Regurgitating LeBron James’ championship runs with both the Cleveland Cavaliers and Miami Heat will result in a laughably anemic score, but the rare sickos capable of rattling off the niche specifics of D.J. Augustin’s career—11 teams in 15 years, with a career average of 9.5 points per game—are wreathed with glory.\nIn other words, this game is designed for people who are at their happiest when they’re thinking about the minor characters of the NBA—not the MVP-level superstars, Taylor Swift–dating crossover celebrities, or even the quality starters on resonant title teams. No, the guys I tend to remember for Immaculate Grid are delectably anonymous, proudly mediocre, and—for some strange, cosmic reason—spark transcendent joy. At its best, the puzzle plunges me into a zonked-out fugue state, evoking psychedelic visions of bygone SportsCenter reruns, where I strain to recall the men who passed through both the Rick Carlisle regime in Indianapolis (Al Harrington, James Jones, Jeff Foster) and the Jerry Sloan era in Salt Lake City (Mehmet Okur, Ronnie Brewer, Derek Fisher). I hate to say it, but this is my paradise.\nSports Reference, the company that owns Immaculate Grid, as well as the internet’s foremost resource for outré sports statistics, claims that the puzzle has accrued 200,000 daily players since launching in April. It was originally built for baseball nerds—the name is actually a reference to a rare feat called an “immaculate inning,” where a pitcher strikes out three batters with nine pitches—but today, you can find permutations for pro football, women’s basketball, and international soccer. No die-hard fan compulsion has been left unaccounted for.\nI was enchanted from the jump. Like many other men of my general disposition, I have spent entire evenings clicking through the archives of bygone sports seasons, unearthing meaningless little curios and tidbits to call my own. Wow, Kevin Martin scored 50 points against the Golden State Warriors? In 2009? For the Sacramento Kings? These facts are extraneous and alienating in general conversation, but Immaculate Grid grants purpose to the junk I’ve taxonomized in my mind, gamifying a life’s worth of wasted time.\nIn the realm of sports fandom, we’ve already given a name to the ritual Immaculate Grid evokes. The term is “Remembering Some Guys,” or as a noun, “Guy-Remembering,” and it refers to any interaction between—let’s face it—mostly straight men who, in lieu of fruitful conversation about more substantial topics, kill time by naming, and then remembering with profound sentiment, the remote athletes of their youth. The motif was first brought to the mainstream by veteran essayist and sportswriter David Roth, now at Defector and previously at Deadspin, who starred in a series of videos for the site where he would tear open an old pack of Topps cards on a chintzy talk-show set and marinate in the brief shock of nostalgia that a image of Chuck Finley can induce in baseball fans of a certain age. It was Guy-Remembering as subtle, ASMR-lite performance art, and given that pedigree, it will not shock you to know that Roth plays Immaculate Grid several times per day, opening up the webpage in multiple incognito tabs, so he can fill out the boards with progressively more esoteric Baseball Men.\n“It’s not a great use of my time,” he told me, willingly acknowledging his perverted behavior. “There are probably other things I could be doing.”\nThe baseball guys Roth knows best are from his youth, back when he was a junior card collector who was happy to burn an afternoon by absorbing all the legacy stats and banal trivia printed on the back of, say, a holographic Bret Saberhagen. Roth wasn’t necessarily watching a ton of baseball in those days—this was before broadband and panoptic subscription packages—so he was stuck with his local tri-state broadcast and whatever ABC cooked up for the weekly national showcase. In that sense, Roth’s primary way to participate in sports culture was to memorize, and then subsequently remember, the guys he unsheathed from the foil.\nMuch later, as an adult, Roth realized that he had inadvertently created an inner sanctuary of Baseball Names—glorious psychic terrain he would savor over and over again, among intimates who have also made the lifelong mistake of sports fandom.\n“For me, when I get together with friends and we start Remembering Guys, I think it’s a way for us to talk about the times where we used to hang out more often, before they left the city, or had kids,” he said. “When my friend Brendan and I remember Lonny Baxter and the rest of the guys who were on the University of Maryland college basketball championship team, what we’re really doing is remembering what we were up to in 2002.” The subtext here—that Roth leverages those memories to broker communion between old pals—was implied. He tells me he had another friend, named Mike, who is a big New Orleans Saints fan, and possessed one of the few televisions in the Northeast capable of picking up the team’s hapless, humiliating campaigns of the early 2000s. “When we remember guys who played for the team, we’re also remembering going over to his place to watch Aaron Brooks throw two interceptions before halftime,” he continued. “We’re remembering our friendship.”\nI, too, have male friendships that have been emotionally buoyed by the ritual of Guy-Remembering. It’s a shortcut to brotherhood, a way to immediately extinguish all the spats of awkwardness innate to those unsteady, once-in-a-blue-moon post-college reunions. There’s an old adage that men need some sort of a buffer—a video game, a UFC prizefight, even a dartboard in the back of a bar—to break bread, and I’ve witnessed that magic firsthand. In the spring, I attended the wedding of the first roommate I ever had. He lives in Mexico City, while I live in New York, and our friendship grew increasingly inaccessible as life took us to different parts of the globe. The one way we’ve managed to stay close? By texting each other the names of lapsed, mid-2000s NFL pros—Guys we both find extreme pleasure in Remembering—about once a month or so. There’s never a hello, a goodbye, or any contextual dialogue whatsoever—just Charlie Batch, Correll Buckhalter, Warrick Dunn, and Antwaan Randle El.\nEric Hudson, bassist for the indie rock band Foxing, put it best when he posted, in a hugely viral tweet, that “Dudes can literally just sit around and name old sports players and just have the best time.”\n“There’s some sort of mystique about suddenly remembering a guy’s name and thinking, ‘I wonder what he’s up to now?’ ” Hudson told me. “Sometimes I think it’s about the linguistics of the names themselves. Like, BenJarvus Green-Ellis, or Keyon Dooling. Last year, when Mac Jones was injured and Bailey Zappe came in to play quarterback for the Patriots, my friend kept saying his name over and over again. Bailey Zappe, Bailey Zappe, Bailey Zappe. You know that’s a future Guy we’ll be Remembering.”\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\nHe’s absolutely right. Decades from now, if Immaculate Grid is still up and running, I greatly look forward to inserting Bailey Zappe in one of the puzzle’s oblique corners—likely after he completes a totally nondescript circuit through the NFL, bouncing around practice squads and waiver wires, before his phone stops ringing for good. This is the standard arc for the vast majority of professional athletes, but when you’re young—and perhaps a little less beaten down by the world—it’s so easy to equate TV sports with immortality. So many of my middle-school afternoons were spent absorbing Priest Holmes highlights on ESPN. He was the best running back in the league at the turn of the millennium, and during a recent bit of my own private Guy-Remembering, I learned, to my horror, that Holmes was somehow effectively retired by 32. He only had three substantial seasons, from 2001 to 2003. As a 12-year-old, that somehow felt like a lifetime.\n“For the most part, sports are completely ephemeral,” said Roth, toward the end of our conversation. “And yet, it’s still as meaningful to you as it felt back then. There’s something kind of heartening about how much it sticks.”\nMaybe that’s the truth of it. Maybe we like to believe we’re the only ones capable of speaking these guys back into existence. Someone still loves you, Luke Ridnour, Donyell Marshall, Alexey Shved, and Raef LaFrentz, no matter where you are.",
  "word_count": 1648,
  "scraped_at": "2026-02-14T12:17:13.158291"
}