{
  "article_id": "816610b87b97",
  "url": "https://www.justarsenal.com/arsenal-women-start-wsl-season-at-the-emirates-full-2025-26-fixtures-revealed/397014",
  "title": "Arsenal Women Start WSL Season at the Emirates - Full 2025 / 26 Fixtures Revealed",
  "date": "20250726T094500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The wait is over, Gooners.. Arsenal Women’s full Barclays WSL fixture list for the 2025-26 season has finally landed!\nOur Gunners will kick off the new campaign in front of a home crowd at the Emirates Stadium on Saturday, 6th September when we welcome newly-promoted London City Lionesses. The match is scheduled for 1:30pm kick-off and will be broadcast live on BBC One – the perfect start to what promises to be another thrilling season for our Champions of Europe.\nTickets are already on sale through Arsenal here, so make sure you secure your seat for opening day and help pack out N5 from the very first whistle.\nAnother big season ahead for Arsenal Women\nSeptember is packed with early tests. After our opener, the team head east for a London clash against West Ham, followed by a trip north to face Manchester United. We’ll be back at the Emirates to take on Aston Villa before the month is out.\nNovember brings a huge headline fixture, as Chelsea visit the Emirates in a match that could shape the title race. Then in February, we welcome Manchester City, completing a home double against our two main rivals.\nHistory will also be made this season. For the first time ever, all 11 of Arsenal Women’s home WSL games will be played at the Emirates Stadium – a powerful statement of Arsenal Women’s place at the heart of the club. No more split venues. N5 is our Gunneresses true home.\nOur north London derbies are set for November (away) and March (home), while the season concludes in May with matches against both Merseyside clubs – hosting Everton before a final day trip to Anfield.\nArsenal fans can also subscribe to the official Arsenal calendar to download these fixtures straight to their devices and stay updated with any changes throughout the season.\n2025/26 FIXTURE LIST\nSEPTEMBER\nSat 6 – London City Lionesses (H) – Emirates Stadium\nSun 14 – West Ham United (A) – Chigwell Construction Stadium\nSun 21 – Manchester United (A) – Leigh Sports Village\nSat 27 – Aston Villa (H) – Emirates Stadium\nOCTOBER\nFri 3 – Manchester City (A) – Joie Stadium\nSun 12 – Brighton & Hove Albion (H) – Emirates Stadium\nNOVEMBER\nSun 2 – Leicester City (A) – King Power Stadium\nSat 8 – Chelsea (H) – Emirates Stadium\nSun 16 – Tottenham Hotspur (A) – Brisbane Road\nDECEMBER\nSat 6 – Liverpool (H) – Emirates Stadium\nSun 14 – Everton (A) – Goodison Park\nJANUARY\nSun 11 – Manchester United (H) – Emirates Stadium\nSun 25 – Chelsea (A) – Stamford Bridge\nSat 31 – Leicester City (H) – Emirates Stadium\nFEBRUARY\nSun 8 – Manchester City (H) – Emirates Stadium\nSun 15 – Brighton & Hove Albion – Broadfield Stadium\nMARCH\nSun 15 – London City Lionesses (A) – The CopperJax Community Stadium\nSat 21 – West Ham United (H) – Emirates Stadium\nSun 29 – Tottenham Hotspur (H) – Emirates Stadium\nAPRIL\nSun 26 – Aston Villa (A) – Villa Park\nMAY\nSun 3 – Everton (H) – Emirates Stadium\n15/16/17 – Liverpool (A) – Anfield\nAll fixtures are subject to change.\nLooking forward to the new season kicking off Gooners?\nThankfully we have the UEFA Women’s Euro 2025 to keep us fueled up on football for now – who do you think will walk away as Euro 2025 Champs?\nCOYGW!\nMichelle M\n__________________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 644,
  "scraped_at": "2026-02-14T12:23:30.215791"
}