{
  "article_id": "816e3857244a",
  "url": "https://www.offtackleempire.com/power-polls/47491/big-ten-power-poll-week-one-the-sweet-valley-universe",
  "title": "Big Ten Power Poll , Week One : The Sweet Valley Universe",
  "date": "20250903T193000Z",
  "domain": "offtackleempire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome back to volleyball football season! Another year, another Power Poll. And, as was pointed out last year, there are a metric ton of teams to cover. Luckily, this week’s topic spanned 20 years and 181 books* so there is almost enough material for 18 teams. Welcome to Week One, and to the Sweet Valley universe.\nBig Ten Power Poll, Week One: The Sweet Valley Universe\nGrowing up in the 90s, age-wise I was more into Sweet Valley Twins, a spin-off to the original Sweet Valley High series set when the titular twins were in 7th grade. All of the series center on identical twins Elizabeth and Jessica Wakefield - blonde, tan, with blue-green eyes, matching dimples, and a “perfect size 6” (a “perfect size 4 in recent re-releases, because diet culture never takes a day off.) These stats– as well as that Elizabeth, four minutes the elder, was studious, responsible, logical, and rule-following; and Jessica, a poster child for Main Character Energy who is obsessed with boys, makeup, and various sundry schemes–were repeated in every single book without fail. They live with their parents and older brother in idyllic (and fictional) Sweet Valley, CA where nothing bad ever happens.**\nThis Power Poll is dedicated to the mostly mild trials and tribulations of the Wakefields and their compatriots. While bad things certainly happen on the reg in the Big Ten, thanks to expansion, Sweet Valley is now officially Big Ten country, so it was time.***\n* Longer and with more books if you count 2011’s Sweet Valley Confidential and 2012’s serial The Sweet Life.\n**Although one time, in Sweet Valley Twins #86: It Can’t Happen Here, a visiting social studies teacher is brought in to “teach WWII” and creates an overly participatory game about the Holocaust that is handled as sensitively as you’d think a pre-teen soap opera book series would handle such a thing. Apologies to Sinclair Lewis were needed, but not forthcoming.\n***If this feels familiar to you, you may be thinking of 2020’s Babysitter’s Club Power Poll. I have really done my best to rep Elder Millennial women on this site, by god.\n1. Ohio State - The Unicorn Club\nFirst Place Votes: 8 High: 1 Low: 12\nYou know those things you just accept when they’re in the media of your youth, and occasionally flash back to with a “what the hell?” The Unicorn Club is one of them. Jessica is lucky enough (I guess) to fulfill her dreams soon after matriculating into the 6th grade and joining The Unicorn Club, an exclusive group made up of the most beautiful and popular girls in middle school. Unicorns are beautiful, special, and everyone likes them, so it’s the perfect name for a group of the worst girls you’ve ever met. If my math is correct, the Unicorns should all be well into their Botox/filler journeys by now, and I wish them well in that.\nThis is not a subtle comparison, obviously. Ohio State thinks highly of themselves, and would be proud members of the Unicorn Club. Sadly, for the rest of us, we can’t really quibble with this - a National Championship followed by a win over the #1(lol) team does confer a certain amount of status. As for the “writer” who decided to throw off these rankings and lowball OSU… watch your back, because hell hath no fury like a mean girl/OSU fan scorned.\n2. Penn State - Lila Fowler\nFPV: 0 High: 2 Low: 11\nI’m not assigning too many specific characters in this poll, but a few are fitting, and Lila is one of them. Lila appears throughout the series as Jessica’s best friend/arch enemy, depicted as a beautiful, spoiled girl with an offbeat sense of drama. Lila is a “poor little rich girl” whose father owns a “computer company” and is the “joint-richest” in town. In spite of Lila’s many advantages in life, her mother is estranged and living in France, and her father’s frequent travels leave her feeling ignored.\nOf course, this all comes to a head in The Unicorn Club #14: Lila on the Loose. Those daddy issues couldn’t stay buried forever, and Lila decides to go wild until her father notices her! While Penn State may not resort to dating older men or throwing ragers, you can bet that James Franklin and Co. will do whatever it takes to get love from the playoff committee and the national sports media.\n3. Oregon - Francine Pascal\nFPV: 1 High: 1 Low: 16\nFrancine Pascal passed away in 2024 at the ripe age of 92 - proof that working smarter, not harder, can pay dividends. The creator of the series had previously worked in soap operas (an influence hard to miss in the Sweet Valley Universe), and allegedly called it “Dallas for teens.” Pascal herself only wrote the first handful of Sweet Valley High books, before turning over the job to a stable of ghostwriters. Pascal claimed that she’d created a “Bible” of necessary Sweet Valley lore for the ghostwriters to use. However, the ghostwriters themselves - as well as the series’ innumerable continuity errors– indicate that this document was less-than-helpful. Pascal finally returned to writing the series in 2011 with the controversial Sweet Valley Confidential, in which she gleefully turned her beloved characters into various trashy archetypes.\nStill, whether Pascal was an author lucky enough to stumble upon a winning formula, or perhaps just a lucky grifter, she laughed all the way to the bank. Like Pascal, Oregon too has found a way to make the system work in their favor. Time will tell if there is substance behind the apparent juggernaut.\n4. USC - Down With Queen Janet! (Sweet Valley Twins #117)\nFPV: 1 High: 1 Low: 14\nLol, look at this book cover and tell me that this girl is not currently the head of the Department of Homeland Security.\nJanet Howell is throwing a huge end-of-school bash! Since she’s president of the Unicorn Club, a group of the most beautiful and popular girls at SVMS, her party is sure to be the biggest event of the year. Suddenly Janet has the school at her feet. But the attention is changing her from a simple pain in the neck to a nightmare on wheels! Janet’s cruel jokes and vicious remarks have gotten way out of hand – now everyone’s a target. Is anyone brave enough to stand up to the most popular girl in school?\nA “nightmare on wheels”? Dare USC fans to dream they can reach Janet’s lofty heights? Putting up 73 points is apt to make a girl feel pretty high and mighty, after all. But for those of us bold enough to mention it to this SoCal menace, it may be germane to note that those points came against FCS Missouri State, and will not alone guarantee attendance at an end-of-year bash/playoff game.\n5. Illinois - Sweet Valley Twins #38: Lois Strikes Back\nFPV: 1 High: 1 Low: 15\nWhile nearly everyone in Sweet Valley is described as white, skinny, and beautiful, the ghostwriters made one exception - Lois Waller. Described as “overweight” and consequently the butt of cruel jokes and a few asides about how she’s actually very nice and doesn’t deserve it, this is Lois’ first stand-alone book. (From the cover, I have to say I’m not getting “overweight,” but I am getting further confirmation of why nearly every American woman over 30 has a complicated relationship with her body image.)\nBecause this book was published in 1990, it is rife with fat shaming. However, it also gives Lois the chance to best the super-rich, super-dickish Bruce Patman (more on him in the next entry), who is her primary tormenter, in the school Bike-a-Thon. Lois’ triumph is a breath of fresh air in Sweet Valley, which you get the sense is a place in the habit of rewarding mediocre pretty people. Illinois, only a few seasons ago a reliable punching bag in this very feature, seems to be on the up-and-up–currently placing ahead of perpetual bully and rich boy, Michigan. Can Illinois effect meaningful, lasting change in the Big Ten standings, or will this apparent triumph end with being written out of the series entirely?\n6. Michigan - Bruce Patman\nHigh: 5 Low: 10\nWell, well, well, if it isn’t the other “joint richest” rich kid in Sweet Valley. Unlike Lila’s father and his newfangled computer money, Bruce’s family loves tradition - their money came from when canning was all the rage, and they’d like the town to remember its historical indebtedness to the Patman Canning Empire, thankyouverymuch. This familial attitude has spawned exactly the teenaged boy you expect: “He is an avid tennis player and race car driver. Known for his trademark black Porsche with a license plate that read 1BRUCE1.” (per Wikipedia, hitting all the highlights.) Bruce is a twat, though this didn’t stop image-obsessed Jessica from dating him (of course, he cheated on her.)\nBut just as the saying “cheaters never win” isn’t terribly accurate in life, or in Sweet Valley, neither is it true in Ann Arbor. However, the win over New Mexico wasn’t quite as dominant as a winner like Bruce would like it to be. Get it together, Michigan, or you’re going to have to put some lower numbers on that license plate.\n7. Indiana - Ned & Alice\nHigh: 2 Low: 11\nThe twins, of course, have parents that occasionally show up in the books. Not often, mind you. Ned is a lawyer, and Alice is an interior decorator, that other idealized girl job of the 90s alongside “marine biologist.” Alice is described as “pretty, blonde, and young-looking, often mistaken for the twins’ eldest sister,” which now makes me wonder if the bit was that Alice was the ghostwriter for this entire series! Ned and Alice are generically good parents, in that they provide for and love their offspring. Upon closer examination, they are fairly inconsistent in both rules and presence, flip-flopping between not letting their daughters go out with friends to the local ice cream shop, and shipping them off solo at age 12 via bus to visit a cousin in another city.\nIndiana was a pleasant story last season, a redemptive arc that neither Ned nor Alice is afforded in the series since they are essentially non-entities. But that performance on Saturday against Old Dominion was underwhelming and kind of disappointing. The kind of thing that might prompt Ned and Alice to offer a mild reprimand and a half-assed attempt at grounding.\n8. Nebraska - The Ghostwriters\nHigh: 4 Low: 17\nAs discussed earlier, the Sweet Valley universe contained very few works actually written by its creator, Francine Pascal. Instead, the stable of ghostwriters - who themselves sometimes collectively went by another pseudonym, “Jamie Suzanne” - churned out most of the books. At the zenith of the franchise’s popularity, the publishers demanded a book a month! Unsurprisingly, this led to some fairly significant gaps in consistency and overall low quality, while keeping the books themselves mind-numbingly formulaic.\nAnother thing that is consistently mediocre but unfailingly popular with its fans is Nebraska football. Interestingly, their game last weekend did contain a twist ending - instead of going all the way to yakking up another hairball of a close loss, the Huskers did the most surprising thing - they found a way to win! Is this the start of a fresh new era for the franchise, or will “Jamie Suzanne” be back to her old ways soon?\n9. Iowa - Steven Wakefield\nHigh: 3 Low: 14\nIt is a truth universally acknowledged that a series focused on tween/teen girls needs to have a brother to serve as antagonist. Luckily, Francine and Co. came through with an ideal of the type - Steven Wakefield. Steven is basketball-obsessed, annoying, usually mean to the twins, and disgusting. It’s a core memory for me reading that Steven drank milk directly out of the carton. My brother happens to be younger, so I hadn’t been fully exposed to how gross teenage boys can be at that point and I was shocked, but I will also say to my brother’s credit that I can’t ever remember him drinking out of the milk carton.\nIt’s probably low-hanging fruit for me to give Iowa, who I hate, one of the worst characters in this series (though Queen Janet - see #4 USC, is probably actually a worse person than Steven, you’re welcome Hawkeyes). But you know what else is low-hanging fruit? Playing University at Albany for your season opener. What in the NAIA is that nonsense? Iowa is dumb and annoying, and probably does drink straight from the milk carton.\n10. Washington - No Dogs (or Cats)\nHigh: 6 Low: 15\nThis is the last entry I’m writing, and I’m over it. This is always the hardest part of the power poll to write. The top teams are usually pretty easy, and the bottom teams are often a lot of fun - but the mushy middle is meh by definition, and meh is tough to find humor in. So instead, I’ll take the canine mascot and wonder: how weird is it that in this entire series, not a single pet or animal is associated with any of the main characters?\nIn the Babysitter’s Club, future cat lady Mary Anne had her kitten, Tigger. The Harry Potter kids have all manner of animal companions - there’s even a pet toad, for goodness’ sake. If ever a family was crying out in its white, suburban perfection for a lovable golden retriever to complete the stereotype, it’s the flippin’ Wakefields! But nothing. The only pet mentioned in the series is occasional reference to Elizabeth as a “teacher’s pet.”\nAnyway, Washington also has a football team.\n11. Maryland - Winston Egbert\nHigh: 3 Low: 16\nWinston is the class clown - not exactly popular, and who for a time nurses an unrequited crush on Jessica, who is scornful of his attentions. Nevertheless, Winston is a consistent member of the twins’ orbit, gaining general acceptance through jovial harmlessness in that classic way of teen movies/books. Things eventually look up for Winston though - he bags a cheerleader girlfriend in high school, and in college, after choosing to go by the name “Winnie” instead (ok), he is accidentally placed in the women’s dorm, and since it’s not 2025’s ridiculous timeline, this is treated as a humorous meet-cute with a love interest, and not an Attack On American Values that would clog up certain sectors of entertainment news and podcasts for weeks.\nWeirdly, when series creator Francine Pascal revisited the crew in 2011 in Sweet Valley Confidential for a mid-twenties check-in with our besties, she took Winston to a really (REALLY) dark place. Made wealthy from the dot-com boom, the good-natured goofball had transformed into a bitter, lonely, womanizing a-hole who dies from an “accidental” fall from his 20th story balcony and is denounced thoroughly by his former classmates at his funeral. Yikes on bikes, Francine. Perhaps she was inspired by the inevitable trajectory of Maryland between the months September and October.\n12. Michigan State - MYFACEISGREEN\nHigh: 6 Low: 15\nIn Sweet Valley Confidential, the 2011 follow-up to the twins and friends in their 20s (RIP Winston), Jessica is thriving in the #girlboss era: “Jessica worked for MYFACEISGREEN, an environmental promotion company that helped introduce new, green beauty products for the popular cosmetics market.” This is the most idiotic name for a fake company that I’ve ever heard, and perversely, I’m kind of obsessed with it. It’s idiotic on the level of getting fired while pleasuring yourself at work while on the phone with a Title IX educator. Simply spectacular.\nI chose this because of the green link and because I don’t know anything about MSU right now and apparently can’t be arsed to learn anything new about them. They won against Western Michigan, but in a fairly underwhelming manner, and I think that’s probably normal for them. If football doesn’t work out, maybe they can try entering the popular cosmetics market.\n13. Purdue - Jessica’s Glasses\nHigh: 4 Low: 17\nTragedy strikes in Sweet Valley in Sweet Valley Twins #47: Jessica’s New Look. The unthinkable has happened - Jessica’s blue-green eyes have developed subpar seeing abilities, and she has to get glasses! Tipping this from mild misfortune into tragedy is the fact that this horrible news comes on the heels of Jessica’s longtime crush, Aaron Dallas, asking her out after she displays some basic knowledge of basketball! Attempts to help Jessica reframe (heh) the situation into a more appropriate reaction predictably fail:\n“Glasses are for nerds like Randy Mason and Lois Waller!” she declared emphatically. “Unicorns don’t wear glasses!”\nJessica could tell from Mr. Bowman’s frown that he disapproved of what she had said. But it was true. She was just not the kind of person who wore glasses. She was popular. She was pretty. She had a date with Aaron Dallas”.\nUltimately, a twin switcheroo helps Jessica to see (via Elizabeth) that she looks good in glasses and also that Aaron gives zero effs about her wearing glasses. Hooray!\nSomething akin to this optometric drama befell Purdue last year - they simply could not see their way to the end zone or to more than one win. Rather than new specs, they got a new coaching staff, and we await the results of that makeover. Their first foray looked less incompetent than last year - but time will tell whether or not this transformation was for real. Jessica’s glasses are never seen or mentioned again in the series, so these things don’t always stick.\n14. Minnesota - Holiday Mischief (Super Edition)\nHigh: 6 Low: 15\nThe title of this book would lead you to believe it is perhaps Christmas-themed, but you’d be wrong. It’s a fantastical action-packed thriller with non-stop, crazy coincidences that happens to be set in December. It’s the Die Hard of the Sweet Valley Universe.\nThis book contains the following: a choir trip to Washington D.C., a spy, an ambassador who collects chandeliers (ok?), and a one-off character who sneaks on to the choir trip in order to find who she believes to be her birth parents (the Australian ambassadors to America, of course). Or something like that, it’s a lot.\nWhat’s not a lot is the effort PJ Fleck and Minnesota are apparently putting into this. They’re doing just enough to skate by, as per usual. I suppose that’s fine, but you can’t blame a girl for wishing there was a little more Australian espionage or chandelier collection happening in Minneapolis to spice things up.\n15. Wisconsin - The Super Chillers\nHigh: 9 Low: 16\nIn the mega-franchises of the 80s and 90s, popular book series like SVT and The Babysitter’s Club searched for ways to diversify the types of situations their characters encountered, featuring these as extra-special branch series. In the Sweet Valley Universe, one of these was the “Super Chiller” set. These books featured not just a mystery, but typically a paranormal mystery. These ranged from the relatively mundane (The Secret of the Magic Pen) to the possessive (Evil Elizabeth) to the weird (The Curse of the Golden Heart: “While taking a scuba diving course, Elizabeth and Jessica stumble upon the wreck of an old pirate ship and half of a golden heart, but their delight soon turns to terror when they begin to receive ominous chain letters”).\nWith their history of mysterious QB1 injuries in season openers, it seems that the Badgers are perhaps in a Super Chiller of their own. Let’s give it a spin.\nThe Curse of the Haunted Civil War Camp: When Bucky and Luke decide to make this year the Best Year Ever, both are thrilled to find that this year’s transfer quarterback is the Best Quarterback Ever! Little do they know that the ground on which their quarterback attempts to run is haunted by the ghosts of Civil War soldiers, and they seem to be very angry. Watch out - it’s late August, and their excitement is about to turn to TERROR!\n16. Rutgers - Sweet Valley Twins #78: Steven the Zombie\nHigh: 12 Low: 16\nThis book is only a few books ahead of the Holocaust one, so the ghostwriter crew was really delving into the historical sticky spots during this phase of publication. Our story begins with Jessica and Elizabeth learning about the Civil War era and about how bad slavery was. (At least the book went there, which is more than the Smithsonian is now allowed to do.) Jessica’s reading also includes a section about “Voodoo in Creole Society.” What follows is some predictable cultural appropriation as Jessica sets out to unleash the powers of voodoo against her pain-in-the-ass older brother, Steven.\nIncredibly, Jessica’s efforts seem to yield some success! Steven walks around the house, moaning and in apparent agony. If you’re curious what her incantation was, it’s this:\n“Double, double toil and trouble; fire burn and cauldron bubble. Let my brother feel the pain, which I inflict into his vein.”\nCatchy, won’t lie. Anyway, Steven has the flu, and that partially accounts for his aches and pains, and also, he somehow saw everything she did with the doll and acted accordingly to mess with her. It doesn’t make any sense, but pretty much nothing in this series does.\nIn truth, I’d have enjoyed this more for Rutgers in days of yore, but I have to work with what I have. Luckily, current Rutgers is as lame as this book, barely eking out a win over Ohio.\n17. Northwestern - Super Edition: Lila’s Secret Valentine\nLast Place Votes: 8 High: 8 Low: 18\nThere are so many stinkers and uncomfortable moments in this series that I was really spoiled for choice for Northwestern. However, I found it appropriate to select a book featuring the spoiled rich girl getting herself into an extremely humiliating situation of her own making:\n“Lila Fowler is dreading Valentine’s Day. She has no valentine, and she’s determined not to let her friends in the exclusive Unicorn Club know. So she tells everyone that she does have a boyfriend and sends herself flowers and candy to prove it. Her valentine’s name is Gray Williams, and he’s rich, cute and completely made up.\nThe Unicorns are totally impressed, and Lila is thrilled—until her friends pressure her into bringing Gray to the Valentine’s dance. How can she bring a date that doesn’t exist.”\nGirl, you are 12. This is not the crisis situation you imagine. Twelve-year-old boys smell like feet and unwashed hoodie, you’re really and truly not missing out, I promise.\nSomething else that stinks is Northwestern football. 23-3 to Tulane is not the stuff of dreams, and it’s shaping up to be a potentially long season for our fine feline friends. While Lila may have gotten her happy ending (of course) in the form of a convenient, handsome, grandson of her family’s groundskeeper willing to take her to the dance, it’s unlikely that Northwestern will find any such Prince Charming waiting in the wings.\n18. UCLA - Sweet Valley Twins #42: Jessica’s Secret\nLPV: 3 High: 14 Low: 18\nUCLA! Don’t say I never give you anything nice, because this here is as close to a classic as it gets in this two-decade celebration of writerly sub-mediocrity. Jessica’s Secret is “the period book,” a staple special event in YA since Judy Blume and Margaret asked some very good questions about reproductive design in 1970. In a slight twist, Jessica’s secret is not, as the reader might assume, that she has gotten her period, but rather, that she has NOT yet been blessed by the crimson wave - and perfect, special Elizabeth already has. In spite of the series setting up Elizabeth as the brainiac, she idiotically assumes that once she has gotten her period, Jessica has also gotten hers at the exact same time - twins, right?\nUCLA, like Jessica, is dealing with a secret of their own - they don’t have a defense. Like, at all. It’s so bad. Unwatchable. Unworkable. It’s only a secret because last week, UCLA started their game at 10 pm central, so most of us didn’t see it. Soon enough though, it will grace your screens, and if you’re lucky, your team’s stadium. Good for you, bad for UCLA fans.",
  "word_count": 4065,
  "scraped_at": "2026-02-14T13:22:35.843251"
}