{
  "article_id": "81bdba80f718",
  "url": "https://www.bordermail.com.au/story/8457925/pat-naish-explains-why-he-joined-wangaratta-in-the-om/?cs=9681",
  "title": "Pat Naish explains why he joined Wangaratta in the O & M . | The Border Mail",
  "date": "20231213T000000Z",
  "domain": "bordermail.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Wangaratta signing Pat Naish says he walked away from the VFL, citing a lack of opportunities.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe former Richmond and West Coast player signed with Carlton at state level in November, but has now elected to join the Pies in the Ovens and Murray Football League.\n\"The original plan for me was to potentially train as a SSP (supplemental selection period) train-on type player and obviously given the players they picked up in the draft, they used all their list spots, so for me personally it was going to be a bit hard to play VFL, knowing there wasn't that list spot there,\" he explained.\nSince leaving the AFL at the end of 2022, having played 20 games over four seasons, Naish is Kookaburra Sport's Territory Sales Manager for Victoria-Tasmania.\nKookaburra is synonymous with cricket bats, with white-ball superstar Glenn Maxwell and Australian women's captain Alyssa Healy among the high-profile ambassadors.\n\"I've always loved cricket, but we've also expanded the business to do more apparel, so dealing with the A-League, AFL and NRL clubs,\" he said.\n\"I've probably got more of a work-life balance than I had playing footy full-time.\"\nNaish, who turns 25 next month, will bring tremendous versatility to the Pies.\n\"The older I'm getting, I see myself as a midfielder, playing at the level I was it was more of an outside footballer, just due to the limited opportunities playing inside at Richmond and West Coast, but now it's more of an inside mid, but at the same time I can play in multiple positions, like half-back, half-forward, wing,\" he revealed.\nNaish is great mates with fellow Pies' recruit Alex Federico.\n\"He's a gun, I played literally every junior game with him at the Northern Knights, he beat us in the grand final of school footy and he was one of the best midfielders in the Northern footy league, I can't wait to watch him go,\" he offered.\nAnd although Naish didn't grow up in Wangaratta, it's a coming home of sorts after his father Chris played at the club, prior to a decade-long AFL career at Richmond and Port Adelaide.\n\"My brother Xavier played some games at (Wangaratta) Rovers, but his football has been on hold due to concussion issues, but he'd like to be involved in some way and our younger brother Charlie has signed at Footscray VFL and I'm sure he'll look to sign at Wangaratta (as his second club), so to have the family back in 'Wang', and particularly the Magpies, is definitely exciting for myself and the club as well.\"",
  "word_count": 438,
  "scraped_at": "2026-02-14T13:27:42.749594"
}