{
  "article_id": "81d0c0719cdd",
  "url": "https://www.wamc.org/news/2023-01-24/banchero-isaac-magic-end-celtics-9-game-win-streak-113-98",
  "title": "Banchero , Isaac , Magic end Celtic 9 - game win streak 113 - 98",
  "date": "20230124T120000Z",
  "domain": "wamc.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NBA\nPaolo Banchero scored 23 points, Jonathan Isaac played in an NBA game for the first time in 2 1/2 years and the Orlando Magic broke the Boston Celtics’ nine-game winning streak with a 113-98 victory. Jayson Tatum and Jaylen Brown scored 26 points apiece for the Celtics, who managed just three points after Tatum’s 3-pointer cut Orlando’s lead to 97-95 with 6:20 remaining. Isaac missed 211 games since tearing his ACL in the NBA’s restart at Walt Disney World on Aug. 2, 2020. He finished with 10 points, three rebounds and two steals, playing about 9 1/2 minutes.\nGiannis Antetokounmpo scored 20 of his 29 points in the first quarter, returning to the lineup after a five-game absence to lead the Milwaukee Bucks in a 150-130 win over the Detroit Pistons. The two-time MVP was joined by three-time All-Star Khris Middleton, putting the Bucks' prolific duo in the same lineup for the first time in more than a month. Antetokounmpo had been out with a sore left knee. Middleton hadn’t played since Dec. 15 due to a sore right knee. He had eight points and four assists. Bojan Bogdanovic scored 33 points for the Pistons.\nJalen Green scored a career-high 42 points and the Houston Rockets held on for a 119-114 victory over the Minnesota Timberwolves to snap a 13-game losing streak. Green, the second overall pick in the 2021 draft, had 21 points by halftime and kept up his strong play in the second half to lead the Rockets to their first victory since Dec. 26 at Chicago. They ended their longest skid of the season and also a 10-game home losing streak, winning at home for the first time since Dec. 13 against Phoenix. Anthony Edwards had 31 points and D’Angelo Russell tied a season high with 30 for the Timberwolves, who had won two straight.\nThe Los Angeles Lakers have acquired former lottery pick Rui Hachimura from the Washington Wizards in exchange for Kendrick Nunn and a package of second-round draft picks. Hachimura and the Wizards didn't agree on a rookie extension before the season started. That prompted speculation that the Japanese power forward wouldn’t be in their long-term plans.\nHall of Fame football player Shannon Sharpe apologized after getting into a heated courtside conversation with Memphis Grizzlies players Ja Morant and Dillon Brooks and Morant’s father during Friday’s game against the Los Angeles Lakers. The Fox Sports personality issued the apology Monday during the “Undisputed” show with Skip Bayless. Sharpe exchanged words with Brooks throughout the first half and then yelled at Morant on the final possession of the second quarter. After the halftime buzzer sounded, Brooks yelled at Sharpe and Sharpe motioned toward Brooks. Tee Morant, Ja Morant’s father, also got involved in the conversation before security at Crypto.com Arena separated everyone.\nNHL\nRookie defenseman Owen Power scored his first goal of the season 56 seconds into overtime and 41-year-old Craig Anderson stopped 29 of 31 shots in his 700th career NHL appearance as the Buffalo Sabres beat the Dallas Stars 3-2 on Monday night. Rasmus Dahlin and Victor Olofsson also scored for the Sabres, who have won three consecutive games. Jamie Benn and Jason Robertson scored for the Stars, who lost after winning two consecutive shutouts. Jake Oettinger made 22 saves.\nMika Zibanejad scored twice and Igor Shesterkin stopped 33 shots as the New York Rangers beat the Florida Panthers 6-2. Adam Fox had a goal and two assists, and Jimmy Vesey, Alexis Lafreniere and Filip Chytil also scored for the Rangers, who are 15-4-2 since Dec. 5 and 5-0-1 in their last six home games against Florida. Artemi Panarin had three assists. Carter Verhaeghe and Aleksander Barkov scored for the Panthers, who had won four of their previous five and are 7-3-1 since Jan. 1.\nWilliam Nylander had two goals and two assists as the Toronto Maple Leafs beat the slumping New York Islanders 5-2. John Tavares had a goal and an assist, Calle Jarnkrok and Auston Matthews also scored and Justin Holl had two assists for Toronto, which is 3-0-1 in its last four and 6-2-1 in its last nine. Ilya Samsonov had 31 saves. Anders Lee scored twice for New York in its ninth loss in 10 games (1-6-3). Ilya Sorokin had 33 saves.\nCalgary beat Columbus in overtime 4-3.\nAustralian Open\nKaren Khachanov moved into his first Australian Open semifinal when Sebastian Korda stopped playing in the third set because of an injured right wrist. Khachanov will face either No. 3 seed Stefanos Tsitsipas or unseeded Jiri Lehecka for a berth in the final at Melbourne Park. Khachanov was leading 7-6 (5), 6-3, 3-0 when Korda retired from the match Tuesday. The 22-year-old American had received treatment on his wrist from a trainer during the second set. Reigning Wimbledon champion Elena Rybakina reached the semifinals with a 6-2, 6-4 victory over 2017 French Open champion Jelena Ostapenko. Rybakina will face Jessica Pegula or Victoria Azarenka next.\nNational Women’s Soccer\nFew women are coaching at the top of American soccer — a result of how the sport offers scarce opportunities for female players and imposes a high price on coaching licenses. The shortage of qualified women was highlighted by a glut of vacancies created by men who were pushed out of the sport. When scandal rocked the National Women’s Soccer League in 2021, five male coaches were dismissed or forced to resign because of misconduct or harassment. Today, just three women hold head coaching jobs in the 12-team league. Five coaches, all men, are embarking on their first season with their teams this year.\nMLB\nLos Angeles Angels owner Arte Moreno has decided not to sell the team. Moreno has announced he is taking his franchise off the market. The 76-year-old owner announced his plan to explore a sale of the team last August, and he met with interested buyers during the winter. Moreno says he has unfinished business with the Angels, who haven't won a playoff game since 2009. Moreno bought the franchise in 2003. The Angels currently have the majors' longest streaks with seven straight losing seasons and eight straight non-playoff seasons.\nWORLD CUP\nMikaela Shiffrin holds a slim lead after the first run of a giant slalom and is in position for a record-breaking 83rd World Cup win. Shiffrin currently shares the women’s record of 82 wins with former American teammate Lindsey Vonn. Shiffrin is 0.13 seconds ahead of world champion Lara Gut-Behrami and 0.27 ahead of home favorite Federica Brignone at\nthe Kronplatz resort in San Vigilio. Petra Vlhova was 1.01 back with Olympic champion Sara Hector nearly two seconds behind. The second run starts at 1:30 p.m.\nLIV GOLF\nSI.com is reporting a full LIV Golf schedule for 2023 that will include three stops at courses own by former President Donald Trump. And whether the rival league gets world ranking points will be decided by the four major championship and the chairman of the Official World Golf Ranking board. The Daily Telegraph says leaders of the PGA Tour and European tour and a longtime European tour executive have recused themselves. LIV hasn't officially announced its 14-event schedule. The SI report indicates events at Trump National in northern Virginia, New Jersey and Doral. Saudi Arabia will now have final event.\nTYSON\nThe Times Union of Albany is reporting a lawsuit has been filed accusing former heavyweight champion Mike Tyson of raping a woman in a limousine outside an Albany-area nightclub in 1990s. More details are available in today’s Morning Headlines with Mike Goodwin, City Editor of the Times Union.\nKILLINGS PLEADS NOT GUILTY\nUAlbany men’s basketball coach Dwayne Killings pleaded not guilty yesterday to assaulting a player in a virtual court appearance in Kentucky Monday morning.\nThe misdemeanor charge involves an incident in 2021. According to a criminal complaint obtained Monday by WNYT NewsChannel 13, a former player says Killings threw him against a locker and hit him before a game at Eastern Kentucky University.\nNewsChannel 13 reports the document said former UAlbany basketball player Luke Fizulich reported the incident to university police in Madison County, Kentucky.\nBased on the document, he reported the alleged attack to police for the first time on November 1, 2022. Fizulich told police the incident took place at a road game against Eastern Kentucky University on November 24, 2021.\nThe Daily Gazette first reported the charge stems from a November 2021 incident that led to Killings' five-game suspension and a $25,000 fine. Killings apologized and served the suspension earlier this season.\nThe actions came after UAlbany investigated claims of inappropriate physical contact with a student athlete.\nThe former player involved in the incident has filed a lawsuit against Killings, UAlbany, and the school’s athletic director.\nThe University told the newspaper it was aware of the complaint and that it was currently not “aware of any additional information that would result in a change” in the coach’s status.\nThe 41-year-old is in his second year coaching UAlbany, his first head coaching position, and earns $365,000 a year.\nUAlbany told NewsChannel 13’s sports department Monday that there was no change in the coaching lineup for the team’s next game on Wednesday at New Hampshire.\nAP Top 25 MEN’S COLLEGE BASKETBALL POLL\nPurdue is back at No. 1 in the AP Top 25. Alabama is right behind the Boilermakers. Purdue returned to the top spot in The Associated Press men’s college basketball poll, moving up two spots after Houston’s loss to Temple. The Boilermakers received 39 first-place votes after a volatile week where just two teams kept the same spot from a week ago. Alabama climbed two spots to No. 2, its highest ranking since reaching No. 1 in 2002-03. Houston, Tennessee and Kansas State round out the top five.\nAP Top 25 WOMEN’S COLLEGE BASKETBALL POLL\nFor the first time in the 47-year history of The Associated Press women’s basketball poll no team from Texas is in the Top 25. That ends a 835-week run dating to the first poll in 1976. South Carolina remained a unanimous No. 1. The Gamecocks were followed by Ohio State, Stanford, LSU and UConn to round out the top five. Middle Tennessee entered the poll for the first time since 2014, coming in at No. 23. Florida State also entered at No. 24. Oregon and Texas fell out of the rankings.",
  "word_count": 1725,
  "scraped_at": "2026-02-14T12:14:18.850439"
}