{
  "article_id": "81d727feab5a",
  "url": "https://www.thenationalnews.com/future/technology/2025/11/03/uae-microsoft-nvidia-gpus-ai/",
  "title": "UAE secures Nvidia GPUs : what Microsoft AI announcement means",
  "date": "20251104T024500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The UAE's ability to secure Nvidia's coveted chips as part of an overall deal with Microsoft marks a major shift in AI adoption.\nAs part of Microsoft's announcement on Monday that it plans to invest $15.2 billion in the UAE by 2030, the tech giant also spoke of its ability to secure licences for the UAE to obtain 21,500 Nvidia A100 graphics processing units (GPUs) “based on a combination of A100, H100 and H200 chips.”\n“Washington doesn't hand out these licences lightly,” Mohammed Soliman, technology analyst and senior fellow at the Middle East Institute, told The National, referring to the US Commerce Department.\n“It means they're confident in the safeguards, the operator and the bilateral relationship. This is the US saying the UAE belongs inside the American AI ecosystem, not looking elsewhere.\"\nYousef Al Otaiba, the UAE's ambassador to the US, said Monday's news exemplifies the strength and depth of the US–UAE partnership.\nIt \"underscores the UAE’s role as a trusted, forward-looking partner\", Mr Al Otaiba said, adding that both nations will benefit.\n\"We look forward to continued collaboration and future announcements that further our shared commitment to driving progress and excellence in AI.”\nMr Solimon said Microsoft's UAE announcement marks “a shift from blanket restriction to managed diffusion\", or adoption.\nHe pointed to instances over the past year in which UAE officials have given the US security guarantees that would prevent American tech falling into the wrong hands.\nIn September, Microsoft became one of the first companies to secure export licences to ship its powerful GPUs to the UAE.\nThe company said the licences would allow it “to ship the equivalent of 60,400 additional A100 chips, in this instance involving Nvidia’s even more advanced GB300 GPUs.\"\nWhat's all the fuss about?\nTo train AI models, the sheer volume of computing power made possible by GPUs is necessary.\nSome regard AI as potentially the most important and economically lucrative invention since electricity, and countries have sought to protect their AI creations to maintain an advantage. The US and China have both sought to win a race for AI dominance.\nAn attempt to prevent US companies from exporting AI technology to China and other countries towards the end of President Donald Trump's first term gained momentum under the Biden administration.\nThose policies, however, drew fire from companies including Nvidia and Microsoft, who insisted the strategy could cause other countries to use China's technology for AI research, possibly leaving the US on the sidelines.\nNvidia's chief executive Jensen Huang also continues to lobby Mr Trump to loosen restrictions.\n“We need to be in China to win their developers,” Mr Huang told reporters recently, pointing to difficulties in gaining market share and influence in China due to strict US chip export regulations.\n“A policy that causes America to lose half of the world's AI developers is not beneficial for the long term and it hurts America more than it hurts them.\"\nMeanwhile, the UAE's promise to implement security measures has helped it to win the vote of confidence from US officials.\n“With these chips, the UAE can train and fine-tune large models locally, run heavy inference workloads without shipping data abroad, and give developers across the region access to serious GPU clusters,” Mr Soliman said.\nHe said the UAE also has an edge in operating the GPUs because of readily available energy and capital.\n“The bigger strategic goal is simple: become a trusted place to run GPU-dense workloads and plug into the global AI economy as a real infrastructure hub, not just a customer,” Mr Soliman said.\nG42, the UAE's AI and cloud company, also reflected on Microsoft's announcement. Peng Xiao, head of G42, said the deal would help build enduring value for “not just the UAE, but for a more interconnected and intelligent world\".\nAmazon deal with OpenAI makes waves\nAlso on Monday, OpenAI announced a new partnership with Amazon Web Services, Amazon's cloud computing subsidiary, to provide “AWS’s world-class infrastructure to run and scale OpenAI’s core artificial intelligence workloads, starting immediately\".\nAmazon's stock jumped nearly 5 per cent on the announcement, seen as a major endorsement from OpenAI, one of the world's leading AI firms.\nMr Soliman said that with the deal, OpenAI is making it clear it wants to diversify the cloud services it uses.\n“This tells you where frontier AI is heading, it's going multi-cloud and it has to,” he said. “These models are too big for any one provider to handle alone, and there is just not enough compute to go around.”\nThe OpenAI announcement was also a much-needed boost for AWS as it deals with the fallout from a massive cut last month that affected millions of computers around the world.",
  "word_count": 784,
  "scraped_at": "2026-02-14T12:13:08.117849"
}