{
  "article_id": "81dc602962c3",
  "url": "https://www.wmnf.org/events/wmnf-news-wednesday/",
  "title": "MidPoint - WMNF 88 . 5 FM",
  "date": "20231025T140000Z",
  "domain": "wmnf.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On MidPoint, Shelley brings you current Florida news and public affairs with a local perspective, and with a definite pro-democracy, anti-fascist bent that she hopes will leave you with righteous indignation and a hair-on-fire fever to fight tyranny and autocracy…before it’s too late.\nListen to the latest episodes\n-\nWhat happens when love and affection become toxic or abusive? Domestic violence and abuse issues are often misunderstood or left unspoken. MidPoint guests raise awareness of the harsh realities of domestic abuse and discuss survivor support programs and available resources.\n-\nThe Public Defender's new Street Legal initiative is changing how legal services are delivered in Hillsborough County by providing essential support directly to those in need in the neighborhood where they live.\n-\nThe Holocaust Remembrance Day show covers the Florida Holocaust Museum's educational programs and exhibits, and the Gulf Coast JFCS support services on this week's MidPoint episode.\n-\nWendy Wesley, a licensed nutritionist and registered dietitian, explains how to balance our daily nutritional habits and navigate the new federal dietary guidelines.\n-\nDr, Jennifer Takagishi, MD, an academic pediatrician at USF Medical School discusses the new CDC and Florida vaccine guidelines.\n-\nCAIR- Florida, the Council on American-Islamic Relations, a civil rights advocacy organization, has recently been unilaterally designated a \"foreign terrorist organization\" by Executive Order of FL Gov. DeSantis. Now, CAIR-FL is suing the governor for violations of the U.S. Constitution.\n-\nCraig Pittman, a Florida Phoenix environmental columnist and author of Oh, Florida and Welcome to Florida shared with us some of the notable, weird, and wacky incidents involving Florida Man and Florida Woman over the past year and beyond.\n-\nListeners called in to MidPoint's Talk Back show to talk about the Florida news stories that most outraged or annoyed them this year. Hope Florida came up often.",
  "word_count": 303,
  "scraped_at": "2026-02-14T12:17:06.098904"
}