{
  "article_id": "82194883b3e7",
  "url": "https://www.moreechampion.com.au/story/8778976/hamstrung-roos-aflw-skipper-kearney-out-for-six-weeks/?cs=9310",
  "title": "Hamstrung Roos AFLW skipper Kearney out for six weeks",
  "date": "20240930T110000Z",
  "domain": "moreechampion.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "North Melbourne skipper Emma Kearney faces a race against the clock to be fit for the Kangaroos' AFLW finals push after suffering a high-grade hamstring injury.\nSubscribe now for unlimited access.\nor signup to continue reading\nKearney, 35, injured her right hamstring early in the first quarter of Sunday's 12-point win over Richmond in Launceston.\nScans confirmed Kearney suffered a high-grade strain, sidelining her for six weeks.\nThat timeline rules the gun half-back out of ladder-leading North's remaining five regular-season matches and puts her in doubt for at least the start of the AFLW finals in November.\nIt is a hammer blow to North's bid to claim an elusive first AFLW premiership.\n\"This is obviously disappointing news for Emma and our program,\" North Melbourne general manager of women's football Erin Lorenzini said.\n\"Emma is an incredibly reliable player and leader for us and was putting together another stellar campaign this season.\n\"For this type of injury, it's usually a six-week rehab, and we know she will do everything in her power to return within that timeframe and continue to support the team as much as she can from the sidelines.\"\nKearney, the only eight-time All-Australian in the AFLW, has thrived in her half-back role this season.\nShe has captained the Kangaroos since their first season in 2019 and led them to their maiden grand final appearance last campaign.\nDarren Crocker's side, the only unbeaten team in the AFLW, sit atop the ladder with five wins and a draw after six matches.\nThey finish the regular season with games against the Western Bulldogs, Sydney, Essendon, Adelaide and Gold Coast.\nAustralian Associated Press",
  "word_count": 271,
  "scraped_at": "2026-02-14T13:31:48.974742"
}