{
  "article_id": "8268ba52d2c1",
  "url": "https://www.ksl.com/article/51136763/pac-12-eyeing-unlv-utah-state-gonzaga-for-2026-ap-sources-say",
  "title": "Pac - 12 eyeing UNLV , Utah State , Gonzaga for 2026 , AP sources say",
  "date": "20240923T231500Z",
  "domain": "ksl.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Estimated read time: 5-6 minutes\nThis archived news story is available only for your personal, non-commercial use. Information in the story may be outdated or superseded by additional information. Reading or replaying the story in its archived form does not constitute a republication of the story.\nLOGAN — Utah State is reportedly headed to the Pac-12.\nAfter a dizzying day of statements, reports and speculation, the Aggies accepted an invitation to join a reconstituted version of the Pac-12, according to multiple reports.\nThe news was first reported by ESPN.\nThe development came as the Pac-12 moved from a trio of expansion targets in the American Athletic Conference, doubled back to a group in the Mountain West that included UNLV, and landed on the Aggies as the Rebels — along with Air Force and others from the Mountain West — recommit to the 25-year-old conference to keep the league intact. News of the pivot was initially reported Saturday by The Action Network's Brett McMurphy.\nIn the Pac-12, Utah State joins Oregon State and Washington State, who were left to themselves after dramatic conference realignment last summer saw schools scatter to the Big Ten, Big 12 and ACC, as well as incoming Mountain West members Boise State, Colorado State, Fresno State and San Diego State.\nSources: Utah State is expected to take its offer from the Pac-12. The confirmation of accepting the offer is expected soon.\n— Pete Thamel (@PeteThamel) September 23, 2024\nEarlier Monday, the Pac-12's initial targets of Memphis, Tulane, South Florida and UTSA released a statement pledging commitment to the AAC. While the statement did not mention the Pac-12 by name, it did note the schools had received \"interest ... from other conferences.\"\n\"While we acknowledge receiving interest in our institutions from other conferences, we firmly believe that it is in our individual and collective best interests to uphold our commitment to each other,\" the schools said, in part. \"Together, we will continue to modernize the conference, elevate the student-athlete experience, achieve championship-winning successes, and build the future.\"\nThe Pac-12 navigated back to the western half of the continent, but Mountain West Commissioner Gloria Nevarez was working, as well. With eyes on UNLV and Utah State, as well as basketball power Gonzaga from the West Coast Conference (per Yahoo Sports), Nevarez laid out a tiered distribution system of media-rights payouts that would provide a financial boost to certain league members.\nGonzaga athletic director Chris Standiford denied an initial report that the Bulldogs had agreed to join the conference, he told Jim Meehan of the Spokesman-Review. But the Zags have had on-again, off-again talks with multiple conferences for years about a potential departure from the WCC, according to multiple sources.\nAir Force quickly agreed to the proposal and its accompanying new grant of rights, and received a signing bonus of at least $10 million in doing so, according to Yahoo's Ross Dellenger.\nHawaii was not required to sign the new grant of rights as a football-only affiliate of the Mountain West that competes in the Big West Conference in most other sports, as noted by Extra Point's Matt Brown.\nWe are the American Athletic Conference. pic.twitter.com/nuwCtF0dQz\n— The American (@American_Conf) September 23, 2024\nUNLV soon followed, per ESPN's Pete Thamel, as did San Jose State in committing to the Mountain West.\nOf course, things move quickly in college athletics — especially when conference realignment and multi-million dollar media contracts are involved.\nWithin an hour of the Aggies' commitment to the Pac-12 being reported, UNLV officials were having second thoughts about the Rebels' decision to stay in the Mountain West, per Thamel. The school's commitment to the conference was predicated on a memorandum of understanding that included eight schools in the league, he reported.\nWith Utah State's departure, the Mountain West would have been down to seven schools — thus negating the MOU.\nThat pushed the Rebels' future with the Mountain West — and a potential future with the Pac-12 brand — in further question.\nMeanwhile, three sources confirmed to the Associated Press that the Pac-12 was continuing to hold discussions with Gonzaga about the basketball power's future with the league. Those discussions did not include a commitment — or an offer — from either side, according to several reports.\nAdding Gonzaga would give the Pac-12 one of the best men's basketball programs in the country. The Bulldogs have thrived in the West Coast Conference, reaching the NCAA Tournament every year it has been played since 1998, with two Final Four appearances and eight seasons of at least 30 victories. Gonzaga does not have a football program.\nThe Pac-12 and its four newest members are already set to pay around $110 million in exit fees and \"poaching\" penalties to the Mountain West, according to several reports. The poaching fee alone is more than $10 million that increases as the number of schools the Pac-12 invites increases.\nPer sources, UNLV officials are expected to huddle tonight to further evaluate options. They would have committed to the MWC if all eight school were in. Now they've pivoted back to exploring. https://t.co/UuYUmczgcX\n— Pete Thamel (@PeteThamel) September 24, 2024\nPac-12 commissioner Teresa Gould has declined to detail how that cost will be shared by the incoming schools and conference, which is sitting on about $250 million in revenue the previous iteration of the Pac-12 was in line to receive this year and next.\nStill, the precarious state of the Mountain West provides an opportunity for the Pac-12 to circle back on those schools.\nTrying to pull Texas State from the Sun Belt Conference would be far less costly for the Pac-12 and give it a school in the Central time zone.\nNevarez is working to get long-term commitments from the conference's remaining eight members, including football-only Hawaii. Even if it it sustains no other losses, the Mountain West will need to add at least one more school.\nUTEP and New Mexico State from Conference USA make geographic sense, but that league recently had its members sign a grant of rights that could make it more difficult and costly for them to move.\nPulling schools up from the second-tier of Division I football would also be an option. Sacramento State from the Big Sky and Texas-based Tarleton State from the Western Athletic Conference, have shown interest in making the jump.\nContributing: Ralph D. Russo, Associated Press",
  "word_count": 1061,
  "scraped_at": "2026-02-14T14:13:26.939624"
}