{
  "article_id": "82794882121a",
  "url": "https://www.hellomagazine.com/royalty/705405/prince-william-reacts-ollie-watkins-sends-england-euro-2024-final/",
  "title": "Prince William celebrates as Aston Villa Ollie Watkins sends England to Euro 2024 final -  What a beauty ! ",
  "date": "20240710T223000Z",
  "domain": "hellomagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Prince of Wales hailed Ollie Watkins' last-minute goal as England soared into the Euro 2024 final, with Prince William, a devout Aston Villa fan, writing: \"What a beauty, Ollie! Congratulations England! #EURO2024 Finalists W.\"\nIt came as the King encouraged Gareth Southgate's side to \"secure victory before the need for any last minute wonder-goals or another penalties drama\" to alleviate the stresses on the nation's \"collective heart rate and blood pressure\".\nIn a personal message to the England boss, after the final whistle blew in their semi-final against The Netherlands on Wednesday night, Charles wrote: \"My wife and I join all our family in wishing you the warmest congratulations on reaching the final of the U.E.F.A. European Championship – and in sending our very best wishes for Sunday's match.\n\"If I may encourage you to secure victory before the need for any last minute wonder-goals or another penalties drama, I am sure the stresses on the nation’s collective heart rate and blood pressure would be greatly alleviated! Good luck, England.\" It was signed off with Charles R.\nThe Three Lions fell behind after seven minutes to a Xavi Simons strike but a controversial Harry Kane penalty, awarded by VAR, brought the scores level ten minutes later.\nAston Villa striker Ollie Watkins then scored a 90th-minute winner to send England through to face Spain in the final on Sunday.\nHELLO! understands that William could not be at the semi-final in person due to work commitments.\nIt comes after the future king was animated in the stands at the Dusseldorf Arena in Germany as he watched the Three Lions' nail-biting quarter-final match against Switzerland last Saturday.\nWilliam was seen with his head in his hands before punching the air with delight as Gareth Southgate's squad got through extra time and a penalty shootout.\nThe prince was then pictured congratulating the players in the tunnel after the game, including Bukayo Saka, Trent Alexander-Arnold and John Stones.\nPassionate football fan\nWilliam, who is a passionate Aston Villa fan, has also long supported the national teams at various tournaments in recent years.\nHe was joined by wife Kate and their eldest child, Prince George, as England reached the Euro 2020 final against Italy in July 2021.\nBut sadly the Three Lions were beaten by the Italians during a penalty shootout.\nWilliam also presented the trophy to the Lionesses following their historic Euro 2022 win against Germany.\nPrior to the match, he shared a good luck message to the team alongside daughter, Princess Charlotte.\nBut in 2023, he faced criticism for not attending the England women's team's World Cup football final against Spain in Sydney.\nIt was the first time the Lionesses had reached the final of a World Cup, and the first time an England football team had competed in a World Cup final since the men’s side beat West Germany in 1966.\nA difficult dilemma\nWith England set to face Spain in the Euro 2024 final at Olympiastadion Berlin on Sunday 14 July, the Prince of Wales faces a tough dilemma.\nThe football match coincides with the Men's Singles Final at Wimbledon, and typically William would join his wife, the Princess of Wales, at the tennis tournament.\nHowever, it has not been confirmed whether Kate will make an appearance at the Championships this year, given her ongoing cancer treatment.\nIf she's unable to participate in the trophy presentation as tradition in her role as patron of the AELTC, William could potentially step in for his wife.\nHowever, given the Prince's role as President of the FA, he is likely to travel to Germany to support England in the final.",
  "word_count": 606,
  "scraped_at": "2026-02-14T13:05:12.298315"
}