{
  "article_id": "828c76e72198",
  "url": "https://www.euronews.com/2023/07/20/new-zealand-beat-norway-1-0-in-womens-world-cup-opening-game",
  "title": "New Zealand beat Norway 1 - 0 in Women World Cup opening game",
  "date": "20230720T101500Z",
  "domain": "euronews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Girls in Green suffered a lost to co-hosts Australia, while New Zealand women bagged their first-ever World Cup victory, sending the Auckland crowd wild.\nAustralia v Ireland: 1 - 0\nCo-hosts Australia bagged a narrow victory over the Republic of Ireland at Sydney's Stadium Australia on Thursday afternoon, winning 1 - 0.\nAustralia, who have emerged as one of the tournament favourites, got their World Cup campaign off to a strong start in front of what was a record-breaking crowd of around 83,000.\nBut the Matildas were dealt a blow when star skipper Sam Kerr was ruled out of the tie against the Republic of Ireland with a calf injury just an hour before kick-off.\nHer teammates had hoped to rely on her sharp eye for the goal with Canada and Nigeria making up the ‘group of death’.\nAustralia boss Tony Gustavsson spoke after his team's slim victory: “We knew this game would be tough. All the teams here will put up a fight.”\n“Everyone can beat everyone in this tournament. We knew set pieces would be a massive part of it and I have to credit the team for how they handled all those set plays in the final stages.\n“They are one of the best teams in attack on set plays and we dealt with it.\nCatley took the captain's armband from Kerr, bringing the Australians a winning start.\nIreland put up a valiant effort and walked away with their heads held high in what was the country's first Women's World Cup fixture.\nNew Zealand v Norway: 1 - 0\nNew Zealand got off to a flying start on day one of the FIFA Women’s World Cup with a 1-0 victory over Norway in Auckland's Eden Park.\nA 48th-minute-goal from Hannah Wilkinson was enough to secure the three points and send the crowd into raptures, in what was the first-ever World Cup win for the Football Ferns.\nNew Zealand's Ria Percival missed the chance to double her side's lead late on when she saw her 88th-minute effort from the penalty spot bounce off the woodwork.\nHege Riise's Norwegian had been wanting to bounce back from a bitterly disappointing European Championship in 2022 when they were beaten 8-0 by tournament winners England in the group stage.\nNorway was the first European side to get their hands on the Women's 1995 World Cup in Sweden - the second edition of the competition - after beating Germany 2-0 in the Råsunda Stadium.\nThe quadrennial tournament will run until 11 August, featuring 32 nations for the first time, having been expanded from 24 teams. A total of 64 matches will take place throughout the month at ten different venues across nine cities.",
  "word_count": 451,
  "scraped_at": "2026-02-14T13:38:03.137865"
}