{
  "article_id": "829301657c96",
  "url": "https://www.dailyadvertiser.com.au/story/8669256/feminising-community-team-names-trend-is-seen-across-the-state/?cs=9402",
  "title": "Feminising community team names trend is seen across the state | The Daily Advertiser",
  "date": "20240620T220000Z",
  "domain": "dailyadvertiser.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The trend of feminising sporting names has swept across the country.\nSubscribe now for unlimited access.\nor signup to continue reading\nFrom the Grenfell Girlannas to the Crookwell She Devils and the Young Cherry Bombs everywhere you go there's a flurry of clubs renaming their women's sides.\nSome clubs and players are in support of the phenomenon but others question why the changes are necessary.\nAcross New South Wales, we looked at the naming conventions of women's teams across a range of sports.\nLions a no-brainer at Riverina club conception\nWhen the Riverina Lions women's Australian football club formed in 2002, there was no big brain storming session to determine their identity.\nTheir colours could not clash with any team in the competition, nor could their name.\nAnd when their first sponsor came on board, the Red Lion Hotel, it was an easy choice to adopt the animal as their mascot.\nFounding member Julie McLean said there was never a discussion of the club being Lionesses.\n\"It was a really hard choice because we had to fit in with some colours and names the league already had, and there wasn't any Lions then,\" McLean said.\nAt the time it was tough getting players and sponsors for the club, with old views on women's sports a barrier to their entry into the football world.\nDespite it, the club forged on to become a beacon for women's football in the region.\nLooking back, McLean can't imagine any player wanting to have a team name with a feminine suffix.\n\"It's a bit cutesy,\" McLean said.\n\"We can probably roll without having those -ettes at the end of it.\n\"If teams are aligning with their men's teams, then what's the problem with them being Saints and Saints or Hoppers and Hoppers.\"\nUltimately McLean said that getting women involved in sport should be the top priority, not re-naming sides.\n\"Once you step on the field, you're going to play however you want to play, as fierce or as skilful as you want,\" she said.\n\"Whether it's a Lion or a Lioness or a Hopper or a Hopperette, when you're yelling out or when you're singing the song, it's much clearer to be the Lions.\"\nWest is best - at creating unnecessary additions\nIf you want to look into the weird and wonderful world of women's sporting teams, the state's western region is the place for you.\nCentral West Rugby Union delivers more misses than hits. The premier competition keeps names consistent across all grades at every club apart from the Dubbo Kangaroos, whose women's side is the Roolettes.\nThe further down the tiers you go, the more interesting it gets.\nThe West Wyalong Weevils would probably name their women's side the same? Incorrect, the women are the Redbacks. The Temora Red Devils? Well, they become the She Devils. We've even seen the Young Yabbies referred to as the Yabettes. It's not what you want.\nWe'll allow the Boorowa Goldies to have the Goldilocks in the women's competition. When you're providing some imagination and having some fun, rather than adding -ette or -esses to the end it's much easier to handle.\nRugby league isn't exempt from all this either.\nIn the Peter McDonald Premiership, the Macquarie Raiders of Dubbo have the Raidettes and jerseys with a splash of pink. For the most part, the rest of the PMP is fine and it is home to two women's names we do give a pass too. The Wellington Cowgirls make sense when the men are the Cowboys while the Parkes Spacecats are a fun version of the Parkes Spacemen. Thank the heavens there's no Spacewomen or Space-ettes.\nThe Castlereagh League is also worthy of mention. Gilgandra is home to the Pink Panthers and that's a big tick compared to another we're going to single out. Surely you don't need to provide a female-specific name at the Dunedoo Swans? Wrong, let us introduce you to the Swanettes.\nIn Woodbridge Cup, a league competition spanning the area between Oberon and Trundle, there are plenty of altered names.\nManildra Rhinettes, Molong Bullettes, Grenfell Girlannas, CSU Mungals and Peak Hill Bantams spring to mind.\nMany of the leaguetag sides also feature pink as part of their jersey designs.\nWhile the clubs have flexed their creative muscles to name their women's side, you cannot look past the Eugowra Geagles, who play alongside the Golden Eagles.\nDifferent is okay if it's done the right way\nNo one quite remembers when or how the Wagga Basketball Association settled on the names of its teams.\nThe men's team, the Heat, and the women's team, the Blaze, are some of the only Association sides in NSW that have different names.\nHowever under 20s player Caitlin Quintal isn't concerned about the separation.\nAdmitting that she's wondered in the past why they were different, she wouldn't want them to start aligning soon.\nThe Blaze have had great success in their time and the name is now strongly associated with women's basketball in the region.\n\"I was always really curious why the names were different because we're one of the only associations that do have different team names for the different genders,\" Quintal said.\n\"Most of the other associations just have one big broad name compared to whatever we have but it's not a bad thing.\n\"Having a different name, being the Blaze, it was definitely like having our own identity.\n\"It's definitely much better than being something like the Lady Heat, it's definitely nice to be the Blaze instead of that.\"\nNow playing with the Albury Wodonga Bandits in the NBL1 competition, Quintal said having consistency in the team names improves the one-club feel.\nThe club stopped referring to the women's team as the Lady Bandits in recent seasons.\n\"It definitely has that sense of togetherness, that sense of community that we're all a lot like closer compared to is we had two separate names,\" she said.\nThe Blaze aren't the only ones in the region with their own identity though.\nIn the Farrer League, women in the Charles Sturt University Football Netball Club proudly play as both the Bushpigs and Bushsows.\nLeeton Phantom's women's rugby union side has aptly named themselves Dianas, while across in league the Young's tackle side have adopted the nickname the Cherry Bombs.",
  "word_count": 1049,
  "scraped_at": "2026-02-14T12:32:37.071965"
}