{
  "article_id": "82aa300f27d8",
  "url": "https://www.theacorn.com/articles/triple-j-cranks-up-the-heat/",
  "title": "TRIPLE J CRANKS UP THE HEAT",
  "date": "20230629T210000Z",
  "domain": "theacorn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jaime Jaquez Jr., the pride of Camarillo, answered the most important phone call of his life on draft day.\n“Thank you guys for taking the chance on me,” Jaquez told Pat Riley. “I’m not going to let you guys down.”\nRiley, the Miami Heat president who has been involved in 19 NBA Finals as a player, coach or executive since entering the league in 1967, including this season, replied to the No. 18 pick of the NBA Draft.\n“I know you’re not,” Riley said. “You’re not going to let yourself down.”\nJaquez, the Camarillo kid who spent all four years at his neighborhood public high school before starring for four seasons with the UCLA men’s basketball team, is the highest NBA Draft choice of any local player in the history of the Acorn Newspapers.\nDon MacLean, a scoring machine out of Simi Valley High and UCLA, was a No. 19 selection in 1992 by the Detroit Pistons, who immediately shipped him to the Washington Bullets.\nJaquez, a versatile 6-foot-7 forward and the Pac-12 Conference Player of the Year, was the first four-year college player selected in a draft spearheaded by No. 1 pick Victor Wembanyama, a 7-foot-5 prodigy from France.\nWhen Jaquez’s name was announced by commissioner Adam Silver on June 22 in Brooklyn, Camarillo High Scorpions weren’t the only folks celebrating. Acorn country, Ventura County and Mexican Americans across the globe joined the festivities.\nBrendan Garrett, the current Camarillo boys’ basketball head coach, recalled a conversation with his close friend Pablo Gallegos, the athletic director at Hueneme.\n“Pablo was out with his family for dinner in Ventura,” Garrett said. “When they announced that Jaime got drafted, the whole restaurant erupted in celebration.”\nRiley opened the press conference in front of local media by introducing Jaquez and his family, his parents Angela and Jaime, and siblings Gabriela and Marcos.\n“Marcos almost broke his back last night lifting (Jaquez) up,” Riley said with a smile. “But it was good. He’s got some strength.\n“It’s a sports family. It’s unbelievable what this family is all about. We’re so proud to have him here.”\nThe parents both played basketball at Concordia University Irvine.\nMarcos, who graduated this spring from Camarillo, was the area’s only three-sport varsity athlete in football, basketball and baseball. The Acorn All-Star in two sports will be a football defensive lineman at Ventura College.\nGabriela, a McDonald’s All American with the Scorpions who also excelled at softball, is an incoming sophomore forward for the UCLA women’s basketball team.\n“My brother wanted to be an NBA player all his life,” Gabriela said. “It’s super exciting, and we’re super proud of him.”\nJaquez will wear No. 11 with Miami. He’s wearing it in homage to his sister, who donned No. 11 at Camarillo but is No. 23 at UCLA.\n“He couldn’t be 24. They gave him the option for 11 and another number. I pushed for 11,” Gabriela said. “I think it looks really good.”\nMichaeltore Smith, who coached Jaquez all four seasons at ACHS, extrapolated on the monumental moment.\n“He put the city on his back and represents Camarillo with class,” said Smith, currently the girls’ flag football head coach. “Everybody has fallen in love with him. Now, people will get to fall in love with him on a bigger stage.”\nJack Willard, the former Camarillo football head coach who still assists the school’s softball squad, coached Jaquez’s siblings. He had a front row seat to Jaquez’s brilliant prep career, which included two years of baseball under skipper John Gonzalez.\n“Those kids always were the hardest-working people,” Willard said. “It’s not that other kids didn’t work hard—no one was going to outwork any of those three kids.\n“Whenever you see Jaime, Camarillo is going to show up, and I think that’s neat. It’s fantastic for our school, fantastic for him. You could not have a better representative of Camarillo High School. It’s just not possible.”\nThe undisputed best player in Camarillo history (and arguably the best basketball player in the area), Jaquez dropped 2,653 points with the Scorpions and averaged 31.7 points, 12.7 rebounds, 3.7 assists and 2.1 steals per game his senior year.\nHe helped UCLA return to glory during the Bruins’ run to the 2021 Final Four. The All-American ranks No. 8 in career points (1,802), No. 8 in steals (178) and No. 11 in rebounds (842) in program history. He’s also No. 8 in most points scored by a Bruin in the NCAA Tournament with 200 in 12 games.\nJaquez—Triple J or Super-Hawk, we’re still workshopping nicknames on Acorn Sports Island— will always keep Camarillo close to his heart.\nWhen he visits home, he’ll drop by campus to watch sporting events and take photos with giddy teenagers. Garrett would open the Scorpion Dome doors for Jaquez and his sister to shoot late-night jumpers during rare breaks from the UCLA grind.\nThe next chapter in Jaime Jaquez’s epic journey continues with the Miami Heat, one of the best basketball teams in the world.\n“I know what this organization is about. It’s about toughness and willing to work and put in that work to become the best player that you could possibly be,” Jaquez said. “That’s what I’ve always been about. . . .\n“I’m really excited, and I can’t wait to get to work.”\nFind sports editor Eliav Appelbaum on Twitter @EliavAppelbaum.",
  "word_count": 893,
  "scraped_at": "2026-02-14T13:46:14.677268"
}