{
  "article_id": "82b139645c69",
  "url": "https://www.yahoo.com/news/francis-simple-pope-end-world-182350156.html",
  "title": "Francis , the simple pope from the end of the world who broke the mold and opened the Church as never before",
  "date": "20250421T190000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Francis, the simple pope from the end of the world who broke the mold and opened the Church as never before\nROME.- It was supposed to be a “short” pontificate, one that would last “four or five years”. But fate decreed otherwise. And with fragile health and multiple ailments, Francis died today at the age of 88, one of the oldest serving popes in the history of the Roman Catholic Church.\nAs the first Jesuit pope and “from the end of the world,” —as he introduced himself on the afternoon of March 13, 2013, when he succeeded Benedict XVI (2005—2013), who had shocked the world with his resignation—, Francis, the 266th pontiff in history, will be remembered as a reformist pope.\nHe was the first non-European pope —albeit of Italian immigrant origin—, an outsider from the periphery of the world who stirred the waters and created “lío” (mess) by urging the Church to open itself to today’s world, to be missionary, and not to condemn but to accompany and integrate everyone. He stood out for his humble, authentic, simple, austere and accessible style, especially towards the forgotten, the sinners and the “discarded”, with which he desacralized the papacy, an institution previously considered inaccessible.\nAware of the importance of the media and of the fact that pictures often say more than a thousand words, Francis made an impact with his gestures from the very beginning. Like when he embraced a man deformed by illness in St Peter’s Square, or when on his first Holy Thursday, as he did in Buenos Aires as Archbishop, he surprised the world when he went to a juvenile prison and washed the feet of the inmates, including women and Muslims.\nA fierce critic of clericalism, of pomp and of a Roman Curia that he reformed to put it at the service of the other Churches of the world — and which he himself defined as “one of the last European courts” — Francis was a Pope who, as a free man, dared to do what had never been done before, in tune with his time.\nA time that he used to describe as a “change of era”, marked by conflicts, wars, injustices, a pandemic, the irruption of social networks, the “Me Too” movement that gave a voice to victims of abuse and sexual assault, the spread of fake news, the advance of artificial intelligence (AI) and, more recently, the advance of a far-right nationalist hostile to migrants.\nLoved by non-Catholics, intellectuals, scholars and university students who admired his openness and keen Jesuit intelligence, Francis was loathed by ultra-conservative Catholic factions. With a black-and-white view of reality, those groups opposed his vision of the Church as a “field hospital” called to heal the wounds of today’s world and to welcome everyone without exception: remarried divorcees, LGBTQ+ people, migrants, prisoners, “Everyone, everyone, everyone,” as he used to repeat in his final years.\nHis way of being different, unconstrained, in accordance with the Church of the origins and the Gospel, made him unpalatable for those factions from the very first moment. They could not bear the “buonasera” with which he presented himself to the crowd gathered in St Peter’s Square after his election on 13 March 2013. And then, in another disturbing gesture that would mark a red line in his pontificate, before giving his solemn blessing to the crowd, this unknown and shy Archbishop from Buenos Aires bent down and asked the people —the People of God, a category of the Second Vatican Council (1962—1965)— to ask God to bless him from heaven.\nAn obstacle course race\nA devotee of St Joseph and St Therese, Jorge Mario Bergoglio was a unique figure. His life, a true obstacle course, was marked by his rise to positions of great responsibility in turbulent times, without having sought them out. Each challenge, however, prepared him for the papacy.\nThe son of Italian immigrants, the eldest of five children in a middle-class family, Bergoglio was born in Buenos Aires on 17 December 1936. His childhood was normal, but deeply influenced by his paternal grandmother, Nonna Rosa, who instilled in him the belief in a merciful God.\nHe played football, basketball and billiards, read a lot and was a good student. Although his mother, Regina, dreamed of him becoming a doctor, he felt from a young age that his true vocation was “medicine of the soul”. His teenage years were like that of any other young man: he has lots of friends, went dancing and even had a girlfriend. But God’s call came to him on 21 September 1953, after a confession, when he was 16 years old. Nevertheless, he decided to wait before entering the Metropolitan Seminary of Buenos Aires, which he finally did in 1957, at the age of 20.\nAfter a pneumonia that left him on the verge of death and cost him the ablation of the upper part of his right lung —something that meant a chronic fragility of the bronchi that accompanied him until the end—, he decided to become a Jesuit at the age of 21: his dream was becoming a missionary in Japan. During his humanistic studies in Chile, he began to develop a vision of a Church committed to the most vulnerable, a perspective that would mark both his life and his pontificate.\nIn 1964, still in his formative years and already with a degree in Philosophy, he became a teacher at the Jesuit College of the Immaculate Conception in Santa Fe, where he taught Literature and Psychology. He was 28 years old and he had an appealing charisma and sense of humor.\nOrdained a priest in 1969, in 1973, at the age of 36, he became the youngest “provincial” in the recent history of the Jesuits, with whom he had a conflictual relationship. It was an era of great expectations and deep conflicts, not only within the Catholic Church, shaken by the winds of change of the Second Vatican Council, but also in Argentina, a country then on the brink of an atrocious dirty war. Despite his youth, Bergoglio faced this first great challenge with steadfast determination, although not without mistakes. “My tenure as Provincial of the Jesuits was flawed at the beginning. It was crazy: I was only 36 years old! Challenging situations had to be faced and my decision-making was abrupt and personalistic,” Francis admitted in an interview with the Jesuit magazine Civiltà Cattolica in September 2013.\nAt the time, his critics portrayed him as a rigid, conservative figure opposed to progressive sectors and liberation theology. However, the most serious accusation he faced during his years as Provincial was that of being an accomplice of the military dictatorship and of having “handed over” the Jesuit priests Orlando Yorio and Francisco Jalics, who became “desaparecidos” (missing) on 23 May 1976. A throughout false accusation that gave rise to a “black legend” fed by his opponents.\nThe story was very different. Silently, Bergoglio did everything possible to get the military to release Yorio and Jalics. And he also helped many other people to hide or escape from that crazy Argentina, victim of State terrorism, as confirmed by Nello Scavo’s book “Bergoglio’s List: How a Young Francis Defied a Dictatorship and Saved Dozens of Lives”, and by one of the last books of Francis, “Life: My Story Through History”.\nFrom 1979 to 1985 he served as school principal of Colegio Máximo de San Miguel, also Jesuit, on the outskirts of Buenos Aires. He taught theology there, but he did not stay cooped up in his office. He went out to get “his feet dirty”, to preach by example.\nMore in World\nHe was multifaceted man: he washed his clothes, he cooked for everyone, he worked in the fields, even with the pigs. And he kept the doors of Colegio Maximo open to the people from the poor neighborhoods around it. Not only he organized catechesis for the children, but also soccer tournaments and even summer camps on the beach.\nIn 1986, confronted by the local Jesuit authorities, he asked for permission to travel to Germany. He wanted to write a thesis on the Italian naturalized-German theologian Romano Guardini (1885—1968), which he never finished.\nWith a determined and sometimes inscrutable character —so much so that some Jesuits nicknamed him “La Gioconda”— he incited both support and rejection. Between 1990 and 1992 he was sent as confessor to the Jesuit Residencia Mayor in Cordoba, a virtual exile. His career took a turn, however, when the then Archbishop of Buenos Aires, Cardinal Antonio Quarracino, rescued him from his exile and persuaded Pope John Paul II to appoint him first as an auxiliary bishop of Buenos Aires in 1992, and later, in 1997, as a coadjutor bishop with the right of succession, which became his great platform to the papacy.\nIn 1998, when he became the first Jesuit archbishop of Buenos Aires, he again had to weather storms: first a financial scandal inherited from his predecessor, then the economic and political chaos of a defaulting Argentina. In addition, he had to face a war full of low blows started by a right wing of the Argentinean Church, linked to a conservative sector of the Roman Curia.\nAs an Archbishop, Bergoglio continued to surprise with his style of being very different from his predecessors. Just as he later did as Pope Francis —he decided not reside in the Apostolic Palace of the Vatican, but in the austere Hotel Santa Marta, a real scandal for the ultraconservatives— in Buenos Aires he broke with the rules: he chose not to live in the residence reserved for the Archbishop, located in Olivos, on the outskirts of the city. Instead, he settled in a sober little room in the Curia, in the emblematic Plaza de Mayo of Buenos Aires. He also continued to travel by bus and subway, giving up the official car and chauffer.\nAs Archbishop, he was tireless, with an endless capacity for work, a sharp political mind and a memory worthy of a statesman. He took care of everyone who knocked at his door and established a personal and paternal relationship with each of the priests in his charge. He was especially supportive of the so-called “slum priests” and their work in the slums of Buenos Aires, where he worked with the poorest of the poor and their demonstrations of popular religiosity.\nA surprising conclave\nHow did this archbishop from the end of the world become Pope, who on February 11, 2013, when Benedict XVI announced his resignation, was already on the verge of retirement, who at the age of 75 had submitted his letter of resignation to the Buenos Aires See and had already prepared his room in a home for retired priests?\nA combination of factors catapulted him to the throne of Peter. After serving as rapporteur for the 2001 Synod of Bishops and as a member of various Vatican congregations, his international prestige had grown.\nHaving cultivated a low profile and without ever having participated in lobbies or “cordate”, he had already been the second most voted cardinal after Joseph Ratzinger in the 2005 conclave that elected John Paul II’s successor. He also played a decisive role in drafting the document of the General Conference of the Latin American Episcopal Conference (CELAM) in Aparecida, Brazil, in 2007.\nUnlike the conclave of 2005, the conclave of March 2013, marked by the resignation of the German Pope, did not have a candidate of widely recognized stature, as Joseph Ratzinger had been in his time. On the other hand, there was an anti—Italian climate among the cardinals: the scandals of the previous months, with the theft of confidential documents by the butler (the famous Vatileaks), the intrigues, poisonings and corruption accusations, nepotism and even a gay lobby, had Italian prelates as protagonists. They were looking for a pastor, a man of God, with the capacity to govern and inspire, all qualities that Bergoglio, considered by some to be out of the game because of his 76 years, fulfilled.\nAnd his intervention in one of the pre-conclave meetings, on March 9, dazzled the other cardinals. The Archbishop of Buenos Aires spoke of evangelization, the “raison d’être” of the Church, which must go out from itself to the margins, not only geographically but also existentially. He criticized the “self-referential, narcissistic and worldly Church that lives by itself and for itself,” which he contrasted with “the evangelizing Church that goes out from itself”.\n“This should shed light on the possible changes and reforms to be carried out for the salvation of souls,” he assured, without imagining at the time that he was revealing the program of his pontificate.\nThe “conversion of the papacy”\nA free man who never studied in Rome like his predecessors, Jorge Bergoglio surprised from the beginning. He did so by choosing to call himself “Francis”, the saint of the poor and of nature, the patron saint of Italy. A name that no one had dared to use before, and which, moreover, represented a program of government, as reflected in one of his most important documents: the apostolic exhortation “The Joy of the Gospel: Evangelii Gaudium” of November 2013, in which he even spoke of the need for a “conversion of the papacy”.\nNot only he left everyone speechless when, from the central “loggia” of St. Peter’s Basilica, he bent down and asked the crowd gathered in the square to ask God to bless him, something no pope had ever done before: he also asked the people to pray for him. Jorge Bergoglio was aware that he had been elected not because a pope had died, but because a pope had resigned, marking the beginning of an unprecedented coexistence with the “retired” pope.\nThis strange cohabitation —which lasted almost ten years, until January 31, 2022, when Joseph Ratzinger died—, was serene, as Pope Francis himself recounted in “El successor”, a book interview with the Spanish journalist Javier Martínez Brocal, which overturned the false myth of the hostility between them. However, Pope Francis confirmed that there were sectors of the Church that opposed to his pontificate and tried in vain to use Benedict —a wise and courageous man whom he always admired— as a counterpoint.\nBergoglio also made an impact by rejecting the papal symbols. He did not want the red shoes —he kept his black orthopedic shoes— nor the gold pectoral cross —he kept his silver cross with the image of the Good the Shepherd— nor the cape, nor the limousine, nor the apartment in the Apostolic Palace. This would have become a virtual gilded cage or funnel that would have distanced him from reality and led him to “psychiatric problems,” as he used to say.\nFor this reason, he preferred to remain in the Santa Marta community, with the discontent of the Curia and the Vatican gendarmerie. There was no longer a “controllable” Pope, easy to protect, but a “free” Pope who continued to manage his own agenda independently of the Curia. And apart from the official agenda organized by the Prefecture of the Papal Household, he had a parallel agenda in the afternoon, which he set himself and which was only made public if the guest decided to share it.\nIn addition to beginning to preach the Gospel and the revolutionary and all-forgiving love of Jesus in a new way and with simple and understandable language during the morning Masses in the chapel of Santa Marta, Francis took action.\nAs the other cardinals had requested in the General Congregations, the pre-conclave meetings, the first thing he did was to overhaul the finances of the Vatican. After the scandals that marked the Benedict years, deep housecleaning was needed. The corruption, nepotism, and shady business practices that had been entrenched in the Holy See for centuries had to be reversed, in addition to the “dirt” and lobbies denounced by Benedict XVI. This was extremely difficult because it meant breaking with the status quo.\nSo the Pope created the Secretariat for the Economy (SPE), an institution that did not exist before, and appointed Australian Cardinal George Pell to lead it. Pell quickly made enemies within the Curia as he presided over accounts that were in the red. In 2017, Pell was forced to resign from this key post after being accused of abuse in his home country. Paradoxically, far from being an ally in the cleanup effort, he was one of the great leaders of the conservative opposition to Francis. He died in 2023 at the age of 81; in a posthumous article, he defined Francis’ pontificate as “in many ways a disaster, a catastrophe.\nIn addition, through his successors in the SPE (first the Spanish Jesuit Juan Antonio Guerrero Alves and then the Spanish layman Maximino Caballero Ledo) and through various “motu proprio”—decrees issued at the pope’s own will—Francis introduced new systems and mechanisms that introduced controls, budgets, and tenders into what was once a veritable jungle. He also appointed an auditor general, an investment committee, and renewed the statutes of the IOR (Institute for Works of Religion).\nOn the other hand, in another bold move, he removed the Secretariat of State from the management of secret funds. Thanks to the new controls, a scandal erupted over a failed investment with secret funds made by the Secretariat of State in London, leading to a trial for embezzlement in the Vatican. For the first time, a Vatican court convicted a cardinal: the once influential former vicar general, Angelo Becciu, an unprecedented event.\nAt the same time, to dismantle that “court” he so criticized —the “last absolute monarchy in Europe”, as he often called it— Francis was working on a drastic reform of the Roman Curia, the central administration of the Church. To assist him in this process and to advise him on the universal government of the Church, which was another major innovation, immediately after his election Francis created a Council of Cardinals from every continent.\nAfter nine years of work, on March 19, 2022, Francis promulgated the Apostolic Constitution “Praedicate Evangelium” (“Proclaiming the Gospel”) which radically overhauled the Roman Curia. The absolute priority, according to the new Constitution, was evangelization. In fact, the new Dicastery for Evangelization, presided over by the Pope, became the most important, over the Congregation for the Doctrine of the Faith, the Holy Office, which safeguarded Catholic orthodoxy. In third place was the Dicastery for the Works of Charity, formerly the Apostolic Almoner. Another important change was opening leadership positions in the Vatican an institution historically dominated by men, to lay people and women. As a true example of the revolution in this regard, in January 2025 he appointed the Italian nun Simona Brambilla as the first female “prefect” of the Dicastery for Institutes of Consecrated Life and Societies of Apostolic Life, the “service” that cares for all the religious men and women of the world. And in March, he appointed nun Raffaella Petrini to head the Governorate, the body that oversees nearly 2000 employees and the day-to-day management of Vatican City State.\nIn parallel with his harsh criticism of the capitalist economic system, which he accused of “killing” and putting the “god of money” at its center —views that gained him the label of “communist”— the Pope placed the poor and migrants at the center of his pontificate. On March 19, 2013, in his first solemn Mass —which he dismissed as an “enthronement” because there was no longer a papal king, but rather a “Petrine assumption,”— he placed Sergio Sánchez, a friend of Bergoglio’s since 2005, in the front row, next to the heads of state and world leaders. Shortly thereafter, he announced that his dream was “a poor church for the poor”, made up of “shepherds with the smell of sheep”. And his first trip was to the island of Lampedusa, a symbol of the plight of migrants fleeing poverty and war who die in “that vast graveyard we call the Mediterranean”. Thinking of the poor, he not only installed showers and shelters under the colonnade of St. Peter’s Basilica, but also welcomed the homeless on his birthday. Among other gestures, such as welcoming grassroots movements to the Vatican on several occasions —whom he called “social poets” and urged them to continue fighting for housing, land, and jobs— in 2016 he established the World Day of the Poor. In the same spirit and for the first time in history, he opened a Jubilee outside Rome: the Jubilee of Mercy—a key concept of his pontificate—which he inaugurated at the end of 2015 in Bangui, the capital of the Central African Republic, one of the poorest countries in the world, ravaged by a devastating civil war. With this move, he broke with the Eurocentrism that had previously prevailed in the Vatican.\nIn perhaps his greatest innovation, Francis linked the cry of the poor to that of the Earth, increasingly affected by the effects of climate change. This connection was reflected in his historic and acclaimed encyclical, “Laudato Si’”, on taking care of “Our Common Home”. Published in June 2015, the document preceded COP 21, the United Nations climate summit in Paris, and influenced its discussions and conclusions. Seven years later, on October 4, 2023, on the eve of another climate summit, the COP 27 in Dubai, Francis updated and deepened his message with a new apostolic exhortation entitled “Laudate Deum”.\nHe had previously written two other encyclicals. The first, “Lumen Fidei” (“The Light of Faith”), published in June 2013, was a joint effort with Benedict XVI. In fact, his predecessor had initiated and nearly completed the document, to which Francis added his own contributions before publication. The second, “Fratelli tutti”, on fraternity and social solidarity, was published in 2020. The last was “Dilexit Nos” (“He Loved Us”), on the human and divine love of the Heart of Jesus Christ, published in October 2024.\nIn addition to “The Joy of the Gospel” and “Laudate Deum”, Francis left behind five other apostolic exhortations. “Amoris Laetitia”, on love in the family, published in March 2016, was the document that followed the two synods he convened on the subject. Chapter eight of this exhortation caused controversy in the conservative wing of the Church because of its openness to communion for the divorced and remarried in certain cases. Then came “Gaudete et Exsultate”, of March 2018, on the call to holiness in today’s world; “Christus Vivit”, of March 2019, following the Synod on Youth; “Querida Amazonia”, of February 2020, following the Synod on the Amazon, a document that disappointed progressive sectors who had hoped for an opening to the ordination of married men to address the shortage of priests in remote areas; and “C’est la confiance”, of October 2023, on trust in God’s merciful love, on the occasion of the 150th anniversary of the birth of Saint Thérèse of the Child Jesus and the Holy Face.\nInterviews and trips\nAs Archbishop and Cardinal Primate of Buenos Aires, Bergoglio was known for not giving interviews. But all that changed when he became Pope Francis: throughout his pontificate, he granted dozens of interviews, something that behind closed doors did not sit well with many high-ranking prelates of the Vatican.\nThey also disliked the press conferences he held on the plane on his way back from his international trips, which often sparked controversy and media storms. There, Francis answered journalists’ questions with no filters. “Who am I to judge a gay man?” was, for example, the phrase that marked his first press conference at 10.000 meters above sea level upon his return from World Youth Day in Rio de Janeiro in July 2013, the first of his 47 international trips to 67 countries.\nIn all these trips, Francis took giant steps to overcome divisions among Christians and strengthen interreligious dialogue through the culture of dialogue and encounter he has fostered to counter the ongoing “Third World War in episodes.” Leaving aside theological differences, he focused on what united us humans.\nIn 2016, he had a historic meeting at Havana airport: the first face-to-face meeting between a pope and the Orthodox Patriarch of Moscow, Kirill, since the schism of 1054. In 2017, he commemorated the 500th anniversary of the Protestant Reformation in Lund, Sweden. He also cultivated a close friendship with Bartholomew, Patriarch of Constantinople, with whom he shared a firm alliance in the fight for the environment and the defense of the marginalized. He also strengthened ties with Anglicans: in 2023, he traveled to South Sudan on an ecumenical peace pilgrimage with the Archbishop of Canterbury, Justin Welby, and the Moderator of the Church of Scotland, Iain Greenshields. He applied the same approach of focusing on what unites rather than what divides to dialogue with the other two great monotheistic religions: Judaism and especially Islam.\nFrancis managed to rebuild relations with the Muslim world, that had been damaged by Benedict XVI’s Regensburg speech. He visited more than a dozen Muslim-majority countries and established a close friendship with Sheikh Ahmad al-Tayyeb, Grand Imam of Al-Azhar University, considered the “Vatican” of Sunni Islam, which represents 85% of the Muslims in the world.\nIn February 2019, in Abu Dhabi, the Pope signed with Sheikh Ahmad al-Tayyeb a historic document on human fraternity. He considered him, along with St. Francis of Assisi, one of the great inspirations for his encyclical “Fratelli Tutti.”\nOn another note, in 2018 Francis signed a provisional agreement with China —a country with which the Vatican does not hold diplomatic relations— on the appointment of bishops in the communist superpower, which is home to some 12 million Catholics. This agreement has been questioned by conservative sectors but is considered a milestone in this culture of uncompromising dialogue, regardless of the problems.\nThe enormous scandal of sexual abuse of minors by priests that erupted at the end of the pontificate of John Paul II (1978-2005) and continued into that of his successor, Benedict XVI, also caused him enormous headaches. Although in March 2014 he created a Pontifical Commission for the Protection of Minors, chaired by Cardinal Sean O’Malley, Archbishop of Boston —a U.S. diocese particularly affected by the scandal— the former Archbishop of Buenos Aires really understood the extent of the damage after his trip to Chile in January 2018.\n“I was converted,” he admitted in an interview, adding that he had misjudged the problem in Chile, to whose people he publicly apologized in a letter. In addition to inviting three Chilean victims to spend time with him at his home in Santa Marta, where he again asked for their forgiveness, and convening an anti-abuse summit with the heads of all the episcopates, during his pontificate Francis has passed numerous laws to hold bishops accountable and properly investigate cases of sexual abuse of minors.\nMany Vatican experts believe the issue will be crucial in choosing his successor, who must have a “clean” record in this regard.\nPreparing his succession\nSpeaking of succession, it is well known that throughout his pontificate and nine consistories, Francis has internationalized the College of Cardinals as never before. Breaking with tradition, he appointed as top aides not the archbishops of large dioceses, whose holders had previously automatically received the purple biretta, but those prelates “that smelled of sheep”, men from peripheral cities and countries that had never been represented in the College.\nThus, he changed the geography of the conclave that will elect his successor. There is no longer a European majority, as there was at the time of his election: now, more than three quarters of the cardinal electors (under 80 years of age) were appointed by Francis. However, this does not guarantee that his successor, the 267th Pope, will follow in his footsteps as a great reformer. Although many believe that on many issues, the new Pope will not be able to reverse Francis’ course.\nTranslated by Jaime Arrambide",
  "word_count": 4639,
  "scraped_at": "2026-02-14T14:17:33.065902"
}