{
  "article_id": "82b57b9c6ca6",
  "url": "https://www.newcastleherald.com.au/story/8768204/mid-coast-fc-withdraws-from-nplw-northern-nsw-in-2025/?cs=305",
  "title": "Mid Coast FC withdraws from NPLW Northern NSW in 2025 | Newcastle Herald",
  "date": "20240919T203000Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mid Coast Football Club have withdrawn their senior sides from NPLW Northern NSW, reducing the top-tier competition to seven clubs in 2025.\nSubscribe now for unlimited access.\nor signup to continue reading\nQuestions had been raised over the club's long-term viability in the women's premier league after being unable to field a reserve-grade team this year then struggling for numbers in first grade due to mounting injuries.\nMid Coast Football Club, who are managed by Football Mid North Coast, will continue to field teams in the Northern NSW Football (NNSWF) Premier Youth League for boys and girls.\nFootball Mid North Coast chairman and acting general manager Lance Fletcher told the Newcastle Herald financial requirements and low player numbers at senior level were contributing factors to the decision.\n\"We as a board have decided that we really should concentrate on the youth program,\" Fletcher said.\n\"The issue we have in regional areas is travel, and these players are travelling to and from Newcastle every second week for games of football. We were given permission this year by Northern NSW Football just to have a first-grade team because we weren't getting the numbers to fill both grades.\n\"The reality is we need 32 players to be part of the first and reserve-grade competition. We finished the season with 11 and, with our expressions of interest, we've only had four applicants.\n\"In doing the right thing for Northern NSW Football and also for ourselves, we need to offer those girls the opportunity to go to Newcastle and trial down there to remain part of the NPLW.\"\nMid Coast Football Club's youth programs are strong.\nThey were crowned Premier Youth League champions for 17s girls after beating Maitland in the grand final at Darling Street Oval on Sunday.\nBut attracting and retaining senior players has been an ongoing issue.\n\"We had 16, 17-year-old girls playing first grade and it's really not fair on them,\" Fletcher said.\n\"I'm really proud of them for stepping up, but you still need a few old heads in the team ... so a lot of reasons. Finance has been one of the biggest but player numbers is also the other issue.\"\nA Mid North Coast team has played in the women's premier league since 2014, making semi-finals in 2015 and 2017. They collected the wooden spoon on four occasions, including this season, and did not field a team in 2018.\nNNSWF general manager football operations Liam Bentley said NPLW would remain 21 rounds next year with each team having three bye rounds.\nLake Macquarie City Football are replacing Warners Bay in NPLW from 2025.\nThe management of Mid Coast FC in the Premier Youth League programs will move from a zone-based model to a club-based model at the end of 2025.",
  "word_count": 462,
  "scraped_at": "2026-02-14T12:48:16.620126"
}