{
  "article_id": "82bb246e99b3",
  "url": "https://www.rimonthly.com/trivia-troves/",
  "title": "A Trove of Trivia Nights in Rhode Island - Rhode Island Monthly",
  "date": "20230127T181500Z",
  "domain": "rimonthly.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A Trove of Trivia Nights for Every Night of the Week in Rhode Island\nRound up all your wicked smaht friends and head to these local pubs to crush the trivia competition.\nWhether you’re training for “Jeopardy” or just keeping your brain spry, there’s no better way to test your know- ledge than with a game of live trivia. Lucky for you, our little state has a wide selection of team trivia nights. See our roundup below for a preview of some of the trivia topics, good eats and special prizes you may be able to find at each, any day of the week.\nMONDAY\nThe Malted Barley\nJoin them on: Monday nights at 7 p.m. (and Wednesday nights at 8 p.m.)\nStudy up on: General knowledge.\nThe winnings: Restaurant-related prizes for the top teams.\nOrder a round of: Pretzels and beer cheese, duh (if you forgo the dip, the asiago parmesan pretzel is a solid choice on its own).\nDetails: 334 Westminster St., Providence, 401-490-0300, themaltedbarley.com\nNarragansett Brewery\nHosted by: Andrew McCaughey of McCaughey Standard Trivia\nJoin them on: Monday nights from 7–9 p.m.\nStudy up on: Geography, history, pop culture, science… basically everything is fair game.\nBest team names so far: According to Peter Crowley, the brewery’s accounting manager and trivia extraordinaire, “There was one team called ‘We all wear glasses’ who won a lot at our taproom, so one time the bar staff all traveled to the Guild in Pawtucket all wearing sunglasses with the team name, ‘we all wear sunglasses’ to challenge them; I think it ended in a tie.”\nOrder a round of: Obviously you’ll want a Narragansett Brewery exclusive like the Bohemian Pilsner, but don’t skip out on the food menu which is chock full of snacks like pretzels, nachos and flatbreads.\nThe winnings: First place gets a $50 gift card to the brewery and second gets a $25 gift card.\nDetails: 271 Tockwotton St., Providence, 401-437-8970, narragansettbeer.com\nThe Patio on Broadway\nHosted by: Comedian and Comedy Bus Host Brad Pierce\nJoin them on: Monday nights at 7:30 p.m.\nStudy up on: General knowledge.\nOrder a round of: The trivia-night-only food and drink specials.\nDetails: 166 Broadway, Providence, 401-227-9366, thepatiori.com\nTUESDAY\nThe Guild (Pawtucket)\nHosted by: Andrew McCaughey of McCaughey Standard Trivia\nJoin them on: Tuesday nights at 6:30 p.m.\nStudy up on: Geography, history, pop culture, science… basically everything is fair game.\nOrder a round of: Salted or cinnamon sugar pretzels, and a Bohemian Grove pilsner or Friars Forever light lager on tap.\nThe winnings: First place gets a $50 gift card to the Guild.\nDetails: 461 Main St., Pawtucket, 401-724-1241, theguildri.com\nThe Guild (Warren)\nHosted by: Andrew McCaughey of McCaughey Standard Trivia\nJoin them on: Tuesday nights at 6:30 p.m.\nStudy up on: Geography, history, pop culture, science… basically everything is fair game.\nOrder a round of: shareable falafel or BBQ pulled pork sliders, and a pour of the Hoppy Guildmore pale ale or the Festbier Oktoberfest lager.\nThe winnings: First place gets a $50 gift card to the Guild.\nDetails: 99 Water St Suite 2, Warren, 401-252-4275, theguildri.com\nLadder 133*\n*Note: Ladder 133 is temporarily closed.\nHosted by: DJ Trivia\nJoin them on: Tuesday nights from 7:30–9 p.m.\nStudy up on: Movies, history, music, TV, science and more.\nOrder a round of: Tacos in honor of Taco Tuesday.\nThe winnings: The top teams earn special prizes, but all those who participate can take advantage of the trivia night-only drink specials.\nDetails: 133 Douglas Ave., Providence, 401-272-7427, facebook.com/Ladder133\nMews Tavern\nJoin them on: Tuesday nights at 7 p.m. upstairs in The Pub. Must be 21+ to enter.\nStudy up on: Anything and everything is on the table.\nOrder a round of: Apps like fried pickles or fried calamari and start to make your way through their sixty-nine beers on tap.\nThe winnings: If your team finishes on top, you’ll get a $50 gift certificate. The second place winners receive $30, and third place gets $20.\nDetails: 456 Main St., Wakefield, 401-783-9370, mewstavern.com\nMoniker Brewery\nJoin them on: Tuesdays from 6:30–8:30 p.m.\nStudy up on: General knowledge.\nOrder a round of: A flight of the brewery’s on tap brews, plus snacks from an on-site brew truck (usual suspects often include Lucky Enough, Great Northern BBQ, ABCD Brothers Kitchen and more).\nDetails: 432 W Fountain St, Providence, 401-648-0150, monikerbrewery.com\nTumblesalts Cafe / Nicholena’s Pizza\nHosted by: Wise Guys Trivia\nJoin them on: Tuesday nights at onsite at Nicholena’s Pizza from 7–9 p.m.\nStudy up on: General knowledge.\nOrder a round of: Slices from the pizza station.\nDetails: 2207 Mineral Spring Ave., North Providence, 401-436-8293, tumblesaltscafe.com\nUnion Station Brewery\nHosted by: DJ Trivia\nJoin them on: Tuesday nights from 7–8:30 p.m.\nStudy up on: Movies, history, music, TV, science and more.\nOrder a round of: Union’s uber popular Friartown, an old school West Coast IPA brimming with American hops. If you’re feeling peckish, also grab some crispy Brussels sprouts and cauliflower tacos.\nDetails: 36 Exchange Ter, Ste 2, Providence, 274-2739, unionstationpvd.com\nWEDNESDAY\nBlack Duck Tavern*\n*Note: Black Duck Tavern is temporarily closed.\nHosted by: DJ Trivia\nJoin them on: Wednesday nights at 7:30 p.m.\nStudy up on: Movies, history, music, TV, science and more.\nBest team names so far: “Nick Sux at Trivia” “Trivia Groupies” and “Aristocats”\nOrder a round of: Half-off apps like wings, pretzels and nachos, plus discounted Titos drinks.\nThe winnings: $20 Black Duck gift cards for first place and $10 for second and third.\nDetails: 31 Warren Ave., East Providence, 401-434-8703, blackducktavern.com\nButtonwoods Brewery\nHosted by: The brewery’s resident random knowledge guru, Sean Fitts (@fittsbag on Instagram).\nJoin them on: Wednesday nights from 6:30–8:30 p.m.\nStudy up on: Geography, history, science, movies and more.\nOrder a round of: A Buttonwoods brew, of course, plus some snacks from their onsite kitchen, Screaming Unicorn.\nDetails: 50 Sims Ave., Providence, buttonwoodsbrewery.com\nCiro’s Tavern\nHosted by: Wise Guys Trivia\nJoin them on: Wednesday nights at 6:30 p.m.\nStudy up on: Certain months often boast specific trivia themes. Past favorites include movies, TV topics and ABC trivia, where the first letters of answers cover every letter of the alphabet.\nOrder a round of: Ciro’s calamari or poutine fries.\nBest team name so far: “Colors that end in -urple”\nThe winnings: Gift certificates to the tavern.\nDetails: 42 Cherry St., Woonsocket, 401-769-3330, cirostavern.com\nThe Fastnet Pub\nJoin them on: Wednesday nights at 8 p.m.\nStudy up on: Standard pub trivia, but near St. Patrick’s Day it wouldn’t hurt to brush up on your Irish history, Gaelic and so on.\nThe winnings: Local businesses (such as Newport Craft Brewing and Distilling and Narragansett Beer) often swing by to sponsor Fastnet’s trivia nights and contribute to the prize pot.\nFunniest team name: Too crass for print.\nOrder a round of: Golden fried wings, curry fries, mozzarella sticks… the options are endless.\nMore fun and games: Fastnet also offers up games of pool, darts and ping pong.\nDetails: 1 Broadway, Newport, thefasnettpub.com\nKimi’s Bar\nHosted by: QueeriosityPVD\nJoin them: Bimonthly on Wednesday nights, check the QueeriosityPVD Instagram for dates.\nStudy up on: Anything and everything LGBTQ+ -related.\nOrder a round of: Shotskis (a.k.a. a lineup of shots on a ski).\nThe winnings: Prizes vary but have included everything from gift cards to handles of alcohol to impressive pool floatie packs.\nDetails: 373 Washington St, Providence, kimis.bar\nLong Live Beerworks\nHosted by: WRIK Entertainment\nJoin them on: Wednesday nights from 7–9 p.m.\nStudy up on: General knowledge, thouh sometimes they’ll throw in a themed-night like “It’s Always Sunny in Philadelphia” or Halloween.\nOrder a round of: Hazy, hoppy brews. And if you arrive early enough in the evening, you might be able to catch a pop up food vendor or two.\nDetails:40R Sprague St. Providence, 401-213-9830, longlivebeerworks.com\nThe Malted Barley\nJoin them on: Wednesday nights at 8 p.m. (and Monday nights at 7 p.m.)\nStudy up on: General knowledge.\nThe winnings: Restaurant-related prizes for the top teams.\nOrder a round of: Pretzels and beer cheese, duh (if you forgo the dip, the asiago parmesan pretzel is a solid choice on its own).\nDetails: 334 Westminster St., Providence, 401-490-0300, themaltedbarley.com\nMcBride’s Irish Pub\nHosted by: WRIK Entertainment\nJoin them on: Wednesday nights at 9 p.m.\nStudy up on: You’ll be thrown questions on culture, history, sports, music and general knowledge topics.\nFunniest team name: “Horsman’s Unicorn Army”\nThe winnings: Runners up often earn prizes like t-shirts or free apps while first place secures a McBride’s gift card.\nOrder a round of: Draught beers like Grey Sails’ Captain’s Daughter and a platter of corned beef or Angus beef cheese sliders.\nDetails: 161 Wayland Ave., Providence, 401-751-3000, mcbrides-pub.com\nO’Rourke’s Bar and Grill\nHosted by: WRIK Entertainment\nJoin them on: Wednesday nights at 7 p.m.\nStudy up on: General knowledge, music, sports and more.\nOrder a round of: Irish classics like corned beef Reuben, Guinness-battered fish n’ chips, and shepherd’s ‘cottage pie.’\nDetails: 23 Peck Ln., Warwick, 401-228-7444, orourkesbarandgrill.com\nPhantom Farms Brewing\nHosted by: Wise Guys Trivia\nJoin them on: Wednesday nights from 6–8:30 p.m.\nStudy up on: General knowledge.\nOrder a round of: A snack from the featured food truck of the night paired with a complementary Phantoms Farm brew.\nDetails: 30 Martin St., Cumberland, 401-642-2653, phantomfarmsbrewing.com\nPivotal Brewing Company\nHosted by: Andrew McCaughey of McCaughey Standard Trivia\nJoin them on: Wednesday nights from 6:30–8:30 p.m.\nStudy up on: Geography, history, pop culture, science… basically everything is fair game.\nOrder a round of: The Petrichor IPA, the Dr. Darkness Coconut stout and/or the Beyond the Wavelength sour.\nDetails: 140 Broadway, Newport, 401-638-1100, pivotalbrewing.com\nReiners at the Graduate Providence\nHosted by:WRIK Entertainment\nJoin them on: Wednesday nights from 7–10 p.m.\nStudy up on: General knowledge, but look out for seasonal-inspired questions (such as local college facts around back-to-school time in September).\nOrder a round of: The signature Biltmore ball drop cocktail and a basket of the staff-favorite sesame chicken loaded fries.\nThe winnings: Restaurant-related prizes for the top team.\nDetails: 11 Dorrance St., Providence, instagram.com/reinersprovidence\nThirsty Beaver (Smithfield)\nHosted by: Rick Rolle of Luke Renchan Entertainment\nJoin them on: Wednesday nights from 6:30–8:30 p.m.\nStudy up on: General knowledge.\nOrder a round of: ‘Beaver snacks’ like Obi-Wan Pierogi and Cauli-Fornia Bites. If you’re thirsty, try a blood orange sage margarita or a fireside old fashion.\nThe winnings: A Thirsty Beaver gift card for first place.\nDetails: 45 Cedar Swamp Rd., Smithfield, 401-349-4790, thirstybeaverpub.com\nThirsty Beaver (Westerly)\nHosted by: Rick Rolle of Luke Renchan Entertainment\nJoin them on: Wednesday nights from 6:30–8:30 p.m.\nStudy up on: General knowledge.\nOrder a round of: $8 margaritas.\nThe winnings: A Thirsty Beaver gift card for first place.\nDetails: 265 Post Rd., Westerly, 401-315-0080, thirstybeaverpub.com\nTwin Willows Restaurant Pub\nHosted by: WRIK Entertainment\nJoin them on: Wednesday nights from 7–9 p.m.\nStudy up on: General knowledge and song titles/artists.\nOrder a round of: Raw bar selections like oysters, littlenecks and jumbo lump crab.\nDetails: 865 Boston Neck Rd., Narragansett, 789-8153, twinwillowsri.com\nUncle Ronnie’s\nHosted by: Wise Guys Trivia\nJoin them on: Wednesday nights at 7 p.m.\nStudy up on: General knowledge.\nOrder a round of: The appetizer sampler, which includes two chicken tenders, two mozzarella sticks, two potato skins and onion rings.\nDetails: 2692 Victory Hwy., Harrisville, 401-568-6243, uncleronniesredtavern.com\nTHURSDAY\nThe Brazen Hen\nJoin them on: Thursday nights at 7 p.m.\nHosted by: The Brazen Hen’s Dave.\nStudy up on: All the things.\nOrder a round of: The housemade stuffed clams.\nThe winnings: Restaurant-related prizes for the top teams.\nDetails: 4 Canal St., Westerly, 401-348-8100, thebrazenhen.com\nFinn’s Harborside\nJoin them on: Thursdays at 7 p.m.\nStudy up on: General knowledge.\nThe winnings: Gift cards for the top three teams.\nOrder a round of: good eats from Finn’s new test kitchen.\nDetails: 38 Water St., East Greenwich, 401-884-6363, finnsharborside.com\nFoolproof Brewing\nHosted by: WRIK Entertainment\nJoin them on: Thursday nights at 6 p.m.\nStudy up on: Pop culture, history, sports, current events, music and people and places.\nOrder a round of: Anything from the Tap list, like their Ocean State Lager or their Raincloud porter.\nDetails: 241 Grotto Ave., Pawtucket, 401-721-5970, foolproofbrewing.com\nMerola’s Restaurant and Bar\nHosted by: Wise Guys Trivia\nJoin them on: Thursday nights at 7 p.m.\nStudy up on: General knowledge.\nOrder a round of: seasonal specials like the cranberry white chocolate pancake or Elissa’s Hot Honey Sandwich (yes, breakfast is served all day!).\nDetails: 50 Danielson Pk., North Scituate, 401-647-7774, facebook.com/p/Merolas-Restaurant-Bar\nSullivan’s Publick House\nHosted by: WRIK Entertainment\nJoin them on: Thursday nights at 7 p.m.\nStudy up on: General knowledge.\nOrder a round of: Half -price apps starting at 9 p.m.\nDetails: 572 Armistice Blvd., Pawtucket, 401-725-0082, sullivanspublickhouse.com\nFRIDAY\nAudrey’s Coffee House and Lounge\nJoin them on: Friday nights from 8–11 p.m.\nHosted by: Owner and “Bachelor” nation alum Jared Haibon.\nStudy up on: Pop-culture, sports, history and more.\nOrder a round of: A pesto mozzarella flatbread and/or some buffalo chicken dip, plus espresso martinis and/or apple cider margarita.\nBest team names so far: “Dawson’s Biggest Fan Club” and “Drinking Team with a Trivia Problem”\nThe winnings: Third place gets a $10 gift card, second place gets a $15 gift card and first place gets a $25 gift card.\nMore fun and games: The coffee house slash lounge also regularly hosts “Bachelor”/”Bachelorette” viewing parties and karaoke nights.\nDetails: 6 South County Commons Way, South Kingstown, 401-661-9787, audreysri.com",
  "word_count": 2231,
  "scraped_at": "2026-02-14T13:34:40.433829"
}