{
  "article_id": "82cb08ee380c",
  "url": "https://www.hudsonriverblue.com/amateur-hour-local-clubs-look-to-qualify-for-the-2025-us-open-cup/",
  "title": "Amateur Hour : Local clubs look to make the US Open Cup",
  "date": "20240913T170000Z",
  "domain": "hudsonriverblue.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "While the 2024 Lamar Hunt US Open Cup Final will be held later this month, with both LAFC and Sporting Kansas City chasing history, preparations for the next edition of the tournament are already being made. Earlier this week, US Soccer announced the slate of teams competing in 2025 Open Cup Qualifying over the next few months. The 114 teams, a record number of entries since qualifying for the tournament began in 2015, will play for 14 slots into the 110th edition of America’s national championship.\nThe match windows for the qualifying tournament are as follows:\n- First Qualifying Round: Sat, October 5 and Sun, October 6\n- Second Qualifying Round: Sat, October 26 and Sun, Oct. 27\n- Third Qualifying Round: Sat, November 16 and Sun, November 17\n- Fourth Qualifying Round: Sat, December 7 and Sun, December 8\nThe US Soccer Federation will conduct a draw sometime over the next few days to determine the First Qualifying Round match-ups, along with any byes if necessary.\nIncluded in the slate is a huge number of Tri-State Area teams. Ten of the announced teams hail from New York State, with eight of them coming from the New York City and Long Island area. An additional three teams are from across the Hudson River in New Jersey. In all likelihood, only one (possibly two) of these teams will be left standing come the final round of qualifying in December.\n14 spots\nIn their statement, US Soccer announced that 32 spots in the 2025 Open Cup are reserved for teams in the Open Division, which includes all leagues below the three professional-sanctioned tiers of soccer.\nHalf of those spots (16) will be allocated to National League teams, which are teams from the National Premier Soccer League and USL League Two. Those teams will be announced officially at a later date. The other half (16) will be allocated to three parties: The United Premier Soccer League (UPSL) Spring National Champion, the USASA National Amateur Cup champion, and an additional 14 teams who make it through the qualifying rounds from around the country.\nOne NYC side already claimed one of these spots. The New York Pancyprian-Freedoms of Astoria, NY won the National Amateur Cup back in July to qualify for the 2025 Open Cup.\nThe fresh faces\nSeven local teams in qualifying are entering for the first time, with a mix of young squads and championship organizations.\nCentral Park Rangers FC is an organization whose history traces back to 1999 as a five-a-side team at Chelsea Piers. After decades of play, CPR boasts 11 teams (nine men, two women) across various NYC leagues — mostly in the Cosmopolitan Soccer League system. The team finally won the CSL Division 1 title back in 2023, earning promotion to the Eastern Premier Soccer League’s Metropolitan Conference.\nFurther east, deep in Suffolk County, is a group competing not just in their first USOC, but also in their first season: NY Empire FC is a semi-professional soccer team based in East Patchogue, New York, competing in the top men’s division of the United Premier Soccer League. The team pride themselves on integrating with the heart of their community and it had some immediate results. Home games at Danzi Stadium on the campus of St. Joseph's University, New York regularly see hundreds of people turn out.\nThe roster even has some former professional talent. Rosedale, NY native Lenworth Lopez played professionally with Chattanooga FC in 2023, including scoring in his debut match as a substitute.\n“We decided to enter the Lamar Hunt US Open Cup because it’s a chance to test ourselves at the highest level of competition,” head coach Max Ferro told Hudson River Blue. “It’s an incredible opportunity to put our team on the national stage, represent Long Island, and show that we can compete with the best. This tournament is a platform for growth, not just for the players but for the club and the community that supports us.”\nAnother first-timer entering the fray is KidSuper Samba AC, also out of the EPSL Metro Conference. The team was founded in 2017 by artist and fashion designer Colm Dillane, known professionally as KidSuper. They made a steady climb through the ranks of NYC’s lower divisions, including a Cosmo League second-division championship in 2019. The team plays out of Randalls Island’s Icahn Stadium, the new home of New York City FC II.\nKidSuper (the artist) was actually on the field earlier this year when he started for USL expansion side Brooklyn FC in its friendly versus Ecuador’s Deportivo Cuenca at Coney Island.\nTwo other first-timers are Oaklyn United FC (Glassboro, NJ) and FCY New York (Buffalo, NY). Oaklyn are a member of the EPSL Delaware River Valley Conference where they won playoff silverware in 2023. They are also a developmental team for USL League Two’s Ocean City Nor'easters. FCYNY are a club with a Yemeni heritage that dates back to the 1970s. The team made a go of it in the UPSL since joining in 2021 and had a deep playoff run last year.\nThe big dogs\nNo team active in New York City have more US Open Cup pedigree than the New York Greek Americans. Founded in 1946 as Greek American Atlas Astoria, the powerhouse have four USOC titles from 1967, 1968, 1969, and 1974 and are one of the few teams to ever three-peat in the competition. In league play, the Greeks won the top division of the Cosmopolitan Soccer League nine times and are defending Eastern Premier Soccer League champions. The team’s spiritual home is the Metropolitan Oval in Maspeth, Queens, which has hosted the US Open Cup Final four times.\nOne familiar name on the Greeks’ roster to readers might be midfielder Daniel Bedoya, who was signed by New York City FC in late summer 2018 following a scrimmage against the MLS side. Goalkeeper David Greczek has previous pro experience with USL League One’s Greenville Triumph SC and won a national title with locals FC Motown in 2022. He played with Motown against NYCFC II earlier this year in the First Round of the Open Cup, losing 3-0.\nNorth of Yankee Stadium’s bright lights, Lansdowne Yonkers FC continues to build their own legacy of soccer just outside the city limits at Tibbetts Brook Park in Yonkers. Formed in 1997 as Bronx Bhoys FC, and later Lansdowne Bhoys FC, the team have a long history in the USOC. They are seeking their fifth qualification for the tournament — and their first since 2023. In league play, Lansdowne compete in the EPSL, where they won the inaugural league championship in 2021 during a year-long unbeaten streak across all competitions, including a run to the National Amateur Cup title.\nEddie Speed, son of former Wales national team midfielder and manager, currently plays defender for Yonkers. Two players joined Lansdowne from the League of Ireland First Division in the past year: Defenders Michael Gallagher (University College Dublin) and Séamas Keogh (Finn Harps FC). Finally, the team's defense includes former University of Notre Dame player and Northern Ireland Under-18 captain Patrick “Paddy” Burns — which feels too perfect of a name for this team to not mention.\nDespite being a first-timer when it comes to Open Cup qualifying, Leros Soccer Club aren’t new to success. The team from the Long Island Soccer Football League have a heavy Greek background with its name and badge representing the island of Leros, which is part of the Dodecanese Islands. The team from College Point, Queens won the 2021-22 LISFL Premier Division championship and won the league double (league and league cup) last year.\nThe well-knowns\nCompeting in Open Cup qualifying for a second-straight year are Zum Schneider FC 03, a German Heritage club that wasrelated to the now-closed East Village beer hall in Lower Manhattan. The team won their first-ever qualifying match last year against league rival New York Greek Americans, and are now looking to go farther in qualifying. The team currentlycompetes in the EPSL’s Metropolitan Division and plays out of Roosevelt Island’s Octagon soccer field.\nAnother regular are New Jersey Alliance FC out of Lyndhurst, NJ, which are competing in its fourth straight qualifying tournament. The UPSL side reached the fourth and final qualifying round last year but fell in a penalty kick shootout to Pennsylvania’s Vereinigung Erzgebirge. Since being founded in 2012, the organization have grown out of their humble beginnings in the Garden State Soccer League and now has three men’s teams and a women’s team. The group are also planning a tour of Ecuador later this year to play against Division 1 professional sides.\nOne team that’s well known for all the wrong reasons is NY Renegades FC from Hicksville, NY. The organization, which has multiple teams in the UPSL, made their debut in USOC qualifying last year. They reached the penultimate round where its match against the Pancyprian Freedoms was abandoned due to an alleged threat against a referee by a Renegades player.\nAccording to a source, one member of the team has been suspended by US Soccer. Neither the name of the affected player nor the duration of the suspension could be verified.\nTwo other teams with some pedigree are Roc City Boom (Rochester, NY) and SC Vistula Garfield (Garfield, NJ). While this will be Boom’s first time in qualification officially, that isn’t totally true as the team’s reserve side (IASC Boom) played in the last three qualifying tournaments. Roc City play in the Upstate New York Region of NISA Nation and are yet another side from the city of Rochester looking to make it big in the Open Cup. For Vistula, celebrating its 72nd anniversary in 2024, this marks their third straight year in qualifying. The Polish club got within one win of qualifying for the 2023 Open Cup but lost to Lansdowne Yonkers. Since then the senior men’s side has continued to grow and is now in its second season of play in the EPSL Metro Conference.",
  "word_count": 1663,
  "scraped_at": "2026-02-14T12:48:20.804436"
}