{
  "article_id": "82d8798e7be7",
  "url": "https://www.latimes.com/travel/story/2024-09-20/adult-recess-groups-leagues-dodgeball-double-dutch-kickball-pickleball",
  "title": "Adult recess ? L . A . groups for double Dutch , dodgeball and more",
  "date": "20240920T123000Z",
  "domain": "latimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Recess for grown-ups: Join these L.A. groups for double Dutch, dodgeball and more\n- Share via\nAs a Black woman who grew up in New York City in the late ’90s and early aughts, double Dutch has always been near and dear to my heart.\nIn the summertime, the balmy Bronx streets would be filled with kids hanging out on their blocks with time to kill and limited means. We’d fashion an XL double Dutch rope out of landline cords and spend hours taking turns, inviting in anyone who passed by — usually neighborhood aunties, including my auntie Thelma, who would join us for a turn or two on her way home from work.\nNow I am the auntie, and I’ve been feeling called to jump again.\nSimple strategies for infusing more playfulness, awe and delight into your life.\nA lot of people like me have been returning to their beloved childhood activities as a way to reconnect with their inner child — and perhaps to cope with the fact that adulthood looks nothing like what we had imagined.\nAround L.A., there are groups you can join to play the games you loved as a kid and connect with like-minded people (and perhaps awaken some physical skills that have been dormant since high school gym class). Here are six organizations to join for “adult recess”-style activities.\nRelive your high school glory days with WeHo Dodgeball\nWhat calls to mind phys ed and school gymnasiums more palpably than dodgeball? The game is nightmare fodder for countless nerds across the country. In case you’ve blocked it out of your memory, the game is as it sounds: a mad rush to dodge a rubber ball being hurled at you by a member of the opposing team. If you get hit, you’re out, and the game continues until there’s one person left standing.\nFor adults with a taste for nostalgia, WeHo Dodgeball offers league games on Tuesday and Thursday evenings at the West Hollywood Aquatic and Recreation Center, followed by a celebration at the nearby Gym Bar WeHo. The league uses soft rubber “no sting” balls and welcomes everyone “from prom queens to drag queens” who might be looking for something different in the WeHo social scene.\nThe co-ed league has begun accepting new people into its rotating membership base. Registration is $80 for a 12-week series.\nMaster the rhythm of two ropes with 40 Plus Double Dutch Club in Inglewood\n40 Plus Double Dutch Club is a national organization created for women of a certain age who love jumping rope. The group, whose oldest member is 90, takes its age restriction seriously. “You have to be 40 [plus],” said Pamela Brown, 63. “We tell [younger people] to come on back when they’re 40.”\nThe Inglewood branch (or “subclub” as they call it) gathers for 90 minutes on Saturdays, beginning at 9 a.m., at Rogers Park, followed by after-parties. Since the first meet-up, when just a handful showed up, weekly attendance has swelled to more than 50. “It’s been fun,” said Brown, who described it as “a sisterhood, a fellowship.” “I may have on some knee braces but I’m here.”\nFrom the star-studded stadium to the soulful mom-and-pop joints, there’s a reason it’s called the City of Champions.\nThe group has been known to break out into hopscotch, Hula-Hoop, line dancing, jump rope and patty-cake, among other games. Melinda Jackson, 50, serves as the group’s unofficial choreographer for line dances.\n“It started off as women coming together because of the [shared] passion and pastime of double Dutching,” she said. “But once we got together, we found out that we have so much more in common than just that. And it has provided us a place of socialization where we can support one another through our ups and downs of life. We are mothers, grandmothers but we get to see each other as individuals when we’re here.”\nFind your next crush on the kickball field with Zog Sports\nA near-death experience led Robert Herzog to start ZogSports, a social sports community that serves thousands of players annually in the U.S.\nOn Sept. 11, 2001, Herzog got an uncharacteristically late start to his day, which led him to be five minutes late to his job at Marsh & McLennan, on the 96th floor of the World Trade Center in New York City. He stepped off the subway just in time to see the first tower get hit in a terrorist attack.\nThree months later, while reflecting on his life and trying to chart a course forward, he resolved to create a well-organized sports league that could help people forge connections outside the office, to “create community and help people heal,” said ZogSports’ chief of staff, Jody Zellman. “Today, we help thousands of athletes across the country create community and connections through the sports they love.”\nUnplugging is vital for our physical and mental health, right up there with diet and exercise. We journeyed around Los Angeles to unearth some of the most immersive and creative ways to do a digital detox.\nToday, more than 1,000 teams play every year across six regions of the U.S., and there are 37 programs in L.A. Co-ed kickball games are on the schedule for late October, with games being held in Hollywood, West Hollywood and Venice. Among the other offerings are volleyball, basketball, soccer, softball, bowling, flag football and pickleball, which has been having a resurgence lately.\nHerzog, who met his wife at a co-ed softball game before founding his company, credits the organization for “sooo many off-the-field romances,” according to the website. Prices for eight regular season games plus playoffs range from $95 for an individual to $625 for a team of up to seven.\nBecome a team player with Club Waka\nSoccer in Glendale. Bowling in Torrance. Volleyball in Santa Monica. Kickball in Venice, Hollywood, Pasadena and Long Beach. These are some of the offerings and areas served by Club Waka, a national organization that offers social sports for players of all skill levels.\nPlayers meet weekly for eight weeks to play games that run 45 minutes to an hour. Newcomers can join individually, in a small group to be placed in a larger group or as a fully formed team. Postgame, there’s an after-party at a local bar.\nRegistration fees vary and include weekly games (plus playoffs), a team shirt and specials at the sponsor bar.\nTry flag football, pickleball and more with OutLoud Sports\nYou don’t have to be a member of the LGBTQ+ community to join a team at OutLoud Sports, an organization dedicated to creating inclusive spaces for members and allies of the queer community.\n“Our players are extremely diverse with a focus on the queer+ community but inclusive of everyone, including our straight allies,” said founder Will Hackner. “Our policy since Day 1 has been that everyone is welcome.”\nFounded in 2007 (originally under the name Varsity Gay League) with a game of capture the flag at Pan Pacific Park, OutLoud is now the largest LGBTQ+ recreational sports organization in the nation with more than 70,000 registered players. There are leagues in L.A. and Long Beach.\nEach eight-week season offers regular season games as well as playoff games for such sports as beach and indoor volleyball, bowling, dodgeball, flag football, kickball, tennis, pickleball and soccer. Prices range from $20 for bowling to $72 for beach volleyball.\n“We want to everyone to understand that whatever age, size, sex, shape or skill you carry should not be a detriment to participating in a sport,” said Hackner. “So many adults, both queer and straight, harbor fears and anxieties that come from toxic locker room culture. This is not that space. This is about playing, being silly and trying something new, successful or not. This space is for everyone to have fun.”",
  "word_count": 1305,
  "scraped_at": "2026-02-14T12:48:16.507031"
}