{
  "article_id": "82e245505a11",
  "url": "https://chicago.suntimes.com/chicago-sky-and-wnba/2023/6/22/23770499/sky-dwyane-wade-confirms-taking-a-deep-look-at-investing",
  "title": "Dwyane Wade confirms he taking a  deep look  at investing in Sky",
  "date": "20230622T230000Z",
  "domain": "chicago.suntimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Dwyane Wade’s investment interest in the Sky has progressed to something deeper.\nDuring a media call to discuss a three-day competition in Milwaukee with former Marquette teammate Travis Diener, Wade confirmed the Sun-Times’ report that he’s interested joining the Sky ownership group.\nHe added that he’s exploring making the business venture a reality.\n“I’m an investor in a lot of things, and if I can lend my name and brand to something that makes sense that I see a future in, I always try to do that,” Wade said. “I’ve taken a deep look at the WNBA, a deep look at the Chicago Sky and a deep look at if this is a place that Dwyane Wade should be part of.”\nWade’s potential investment comes at a time when the Sky are strengthening their ownership group with the most recent addition of six new women investors, including Cubs co-owner Laura Ricketts. In January, the team announced Nadia Rawlinson had joined the ownership group and the front office as operating chairman.\nThe Sky are one of seven independently owned WNBA teams, along with the Aces, Dream, Storm, Sun, Wings and Sparks. The other five — the Mercury, Mystics, Liberty, Lynx and Fever — share owners with their NBA counterparts.\nIn the last five years, principal owner Michael Alter and the rest of the Sky’s original ownership have taken steps to propel the franchise forward, starting with moving the team from Allstate Arena in Rosemont to Wintrust Arena in the South Loop. Alter admits there’s still work to do for the league and the Sky, but he’s pleased with where the franchise stands.\n“We’re in a great place, but we’re not done,” Alter told the Sun-Times.\nThe impact of Wade’s potential investment can’t be overstated. The added capital could help the Sky in a multitude of ways, including ownership’s efforts to develop a practice facility. They’ve already begun scouting locations and are prioritizing options near Wintrust Arena.\nBeyond capital, Wade brings ownership experience as an investor in the NBA’s Jazz, Major League Soccer’s Real Salt Lake and TMRW Sports. As a three-time NBA champion and 13-time All-Star, Wade brings a name and brand that would provide instant notability. His roots in Chicago further align him with the Sky’s ownership’s efforts to work with investors who are connected to the city.\nBeyond considering whether Wade sees himself as a fit as an investor, he’s also taking into consideration how the players feel about his involvement.\nAfter his visit to a practice last week, the entire team celebrated the possibility of him joining the franchise.\n“It’d be lit,” Kahleah Copper told the Sun-Times. “Especially with his connection to the city and him wanting to invest in women’s sports. I think it’s a perfect fit.”\nWade’s investment in the Sky appears to be only a matter of time.\n“In due time, a decision will be made,” Wade said.\nHonoring the Wades\nHalfway through the second quarter, the Sky honored Wade’s sister, Dr. Tragil Wade-Johnson, and his mother, Jolinda Wade, with the “Crown of Skytown Community Award.”\nThe entire family has an extensive history of giving back to the Chicago community and beyond.\nDwyane currently funds a reading program through Marquette named after his sister. The proceeds raised at this weekend’s event with Diener will go to youth literacy programs in Milwaukee.\nAnnie Costabile\nChicago Sun-TimesFormer reporter, Chicago Sky and Red Stars",
  "word_count": 566,
  "scraped_at": "2026-02-14T12:14:35.731804"
}