{
  "article_id": "83229c4f8758",
  "url": "https://collider.com/best-shows-on-hulu-right-now-june-2024-28/",
  "title": "73 Best Hulu Shows to Watch Right Now ( June 2024 ) ",
  "date": "20240628T200000Z",
  "domain": "collider.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good shows to binge-watch on Hulu aren't hard to come by — especially this year. From Shōgun to season 3 of The Bear, there are a plethora of series that have managed to find both critical and commercial success alike. Ready to find your new favorite? You're in luck. We've compiled a list of the best shows on Hulu, from hilarious sitcoms like Abbott Elementary to intense, addictive dramas like Under the Bridge.\nFor more recommendations, check out our list of the best movies on Hulu, best shows to binge-watch, and best comedy shows on Hulu.\n'The Bear' (2023 - Present)\nRotten Tomatoes: 99% | IMDb: 8.6/10\n- Release Date\n- June 23, 2022\n- Network\n- Hulu\n- Showrunner\n- Christopher Storer\n- Directors\n- Ramy Youssef\n- Writers\n- Catherine Schetina, Alex Russell, Karen Joseph Adcock, Sofya Levitsky-Weitz, Stacy Osei-Kuffour\nCast\n-\nCarmen 'Carmy' Berzatto\n-\nRichard 'Richie' Jerimovich\n- Seasons\n- 4\nJeremy Allen White star as culinary prodigy Carmen Berzatto, a success in the world of fine dining. However, after his brother sadly commits suicide, Carmen must return home and rejoin his family’s small local sandwich shop, The Original Beef of Chicagoland. Now, having to face the harsh realities of local business and a world away from his life of Michelin-star cuisine, how will Carmen cope with balancing a yearning desire to return to his high life, a broken family dynamic, and the grief over losing his brother?\nThis worldwide smash hit show sees breakout starAn awards darling, having scooped up multiple Primetime Emmys and Golden Globes, The Bear has many triumphant factors in the recipe for its success, not least of which is Jeremy Allen White’s captivating lead performance. Managing to find a nuanced balance between heartbreaking and frustrating, the actor has rightfully earned himself both public and critical acclaim for his astonishing performance. Beyond Allen White, though, the show is a gorgeously written story that captures the familial bond at its heart, with the dysfunctional relationship between almost all of its main cast gutwrenchingly relatable. Like fine dining, The Bear is a show to be savored. - Jake Hodges\n'Skins' (2007 - 2013)\nIMDb: 8.2/10\n- Release Date\n- 2007 - 2013-00-00\n- Network\n- E4\n- Showrunner\n- Jamie Brittain, Bryan Elsley\n- Writers\n- Jamie Brittain, Bryan Elsley\nCast\n-\nLarissa Wilson\n-\nJoe Dempsie\nThis groundbreaking British teen comedy follows the lives of a group of unadulterated friends, each feeling disenfranchised by the world around them as they attempt to find love and happiness in a broken Britain. With plenty of questionable parents and teachers giving often unsavory advice, it is up to the teens to find their own paths — even if those paths are full of partying and alcohol. It wouldn’t be an understatement to say that Skins brought about a revolution upon first airing in the UK. Changing culture via dress sense and attitude, the show would break boundaries and showcase the realities of growing up as a frustrated, anxious teenager in Britain. A winner of two BAFTAs, there has been no series before or after Skins that has quite managed to capture its essence, making this a wonderfully astute pick-up for Hulu’s catalog. - Jake Hodges\n'Clipped' (2024)\nRotten Tomatoes: 88% | IMDb: 6.5/10\n- Release Date\n- 2024 - 2024-00-00\n- Directors\n- Kevin Bray\n- Writers\n- Gina Welch\nCast\n-\nKelly AuCoin\n-\nMichael Heidemann\n-\nJock McKissic\nClipped is a biopic about Donald Sterling, portrayed by Ed O’Neill, who was the owner of the Los Angeles Clippers. The series follows his team’s attempts to win a championship and his subsequent sudden downfall, whose controversial comments ballooned into a series of events that would change the NBA forever. Originally titled The Sterling Affairs, Clipped is both an entertaining sports series and an introspective look at one of the NBA’s most infamous men. O’Neill is brilliant as Sterling, managing to capture all of his many often conflicting character traits, but it is Laurence Fishburne who steals the show as coach Doc Rivers. Fast and furious, Clipped is full of power. - Jake Hodges\n'Queenie' (2024 - Present)\nCreated by Candice Carty-Williams, Queenie follows the titular 25-year-old, played by Dionne Brown, as she navigates a modern and multicultural south London. Both Jamaican and British, Queenie struggles to fully immerse herself in either of the two cultures — a struggle felt by many young people in Britain today. A series with its finger firmly on the pulse of modern-day London, Queenie is actually based on Carty-Williams' own 2019 new adult novel of the same name, which received enormous critical and public praise. Politically and socially aware, as well as brimming with biting current humor that makes last week’s releases already look out of date, Queenie is both an entertaining watch and a beacon of representation for the young Black women of London who don’t feel like they fit. - Jake Hodges\n'Will & Grace' (1998 - 2020)\nRotten Tomatoes: 74% | IMDb: 7.4/10\nOne of the longest-running and most fondly-appreciated sitcoms of all time, Will & Grace stars Eric McCormack as lawyer Will and Debra Messing as interior designer Grace. Together with their best friends, the group deals with the highs, lows, and in-betweens of modern life in New York City. Of course, Will & Grace, at its heart, is a laugh-a-minute comedy searching every second for the next gag. However, the show was also a major turning point for LGBTQIA+ representation in modern sitcoms, with many looking back now at some of the series to have been released since and realizing just how honest and self-aware about queer representation the show actually was. Funny and poignant, Will & Grace is a must-have addition to a sitcom fan’s watchlist. - Jake Hodges\n'Scandal' (2012 - 2018)\nRotten Tomatoes: 93% | IMDb: 7.7/10\n- Release Date\n- 2012 - 2018\n- Network\n- ABC\n- Showrunner\n- Shonda Rhimes\n- Directors\n- Tom Verica, Tony Goldwyn, Allison Liddi-Brown, Jann Turner, Oliver Bokelberg, Jeannot Szwarc, Nicole Rubio, Scott Foley, Nzingha Stewart, Greg Evans, Joe Morton, Michael Katleman, Millicent Shelton, Randall Zisk, Salli Richardson-Whitfield, Sharat Raju, Stephen Cragg, Darby Stanchfield, Julie Anne Robinson, Steph Green\n- Writers\n- Matt Byrne, Mark Fish, Zahir McGhee, Jenna Bans, Chris Van Dusen, Ameni Rozsa, Heather Mitchell, Michelle Lirtzman, Alison Schapker, Jeremy Gordon, Johanna Lee, Paul William Davies\nCast\n-\nOlivia Pope\n-\nDarby StanchfieldAbby Whelan\n-\nKatie LowesQuinn Perkins\n-\nGuillermo DiazHuck\nCreated by the legendary Shonda Rhimes, Scandal is an ABC political thriller series that stars Kerry Washington as political fixer Olivia Pope. Based in Washington, D.C., the series follows the staff at Pope’s crisis management firm as they deal with various political situations and scandals. The show ran for 124 episodes over seven seasons, airing from 2012 to 2018. Besides Washington, the series also stars Darby Stanchfield, Katie Lowes, Guillermo Diaz, Jeff Perry, and Tony Goldwyn. Scandal earned high viewership numbers and widespread acclaim over the course of its time on the air, receiving a number of accolades, including the 2012 Image Award for Outstanding Drama Series. Washington’s iconic performance as the bold, powerful political/legal mover has earned the actor nominations for Emmy, Golden Globe, and SAG Awards. With intense drama and thrilling stories of political maneuvering, Scandal is one of the best shows ever developed by one of TV’s most successful creators.\n'The Rookie' (2018 - Present)\nRotten Tomatoes: 68% | IMDb: 8.0/10\n- Release Date\n- October 16, 2018\n- Network\n- ABC\n- Showrunner\n- Alexi Hawley\n- Directors\n- Tori Garrett, Chi-Yoon Chung, Michael Goi, Sylvain White, Lisa Demaine, Lanre Olabisi, Bill Johnson, David McWhirter, Liz Friedlander, Daniel Willis, Toa Fraser, Anne Renton, Jon Huertas, Cherie Nowlan, TK Shom, Rob Seidenglanz, Valerie Weiss, Barbara Brown, Charissa Sanjarernsuithikul, SJ Main Muñoz, Nelson McCormick, Marcus Stokes, Adam Davidson, Anna Mastro\n- Writers\n- Corey Miller, Bill Rinier, Zoe Cheng, Mary Trahan, Ally Seibert, Liz Alper, Nick Hurwitz, Racheal Seymour, Madeleine Coghlan, David Radcliff\nCast\n-\nJohn Nolan\n-\nMelissa O'NeilLucy Chen\nCreated by Alexi Hawley, ABC’s The Rookie is a police procedural series starring Nathan Filion as John Nolan, who becomes the oldest rookie at the Los Angeles Police Department at 45. Partly based on a true story, the drama series also features Alyssa Diaz, Richard T. Jones, Titus Makin Jr., and more. Largely buoyed by Fillion’s delightful performance, the series has become a television favorite since its premiere in 2019, with its sixth season currently underway and a seventh on the horizon. An entertaining series that you can watch with the whole family, The Rookie is a great cop show where the cases may not be all that interesting, but the characters surely are. The series has received largely favorable reviews from critics, with praise for its humor, action, and drama. Though the quality varies a bit between seasons, the show’s talented cast and the well-crafted interpersonal narratives make it a consistently engaging watch.\n'The Veil' (2024)\nRotten Tomatoes: 46% | IMDb: 6.4/10\nWritten by Steven Knight and starring Elisabeth Moss and Yumna Marwan, The Veil is a thriller limited series following two women as they travel from Istanbul to Paris and London, with one of them hiding a dangerous secret that the other seeks to uncover. The series also stars Dali Benssalah, Josh Charles, and Thibault de Montalembert. While the series has received rather mixed reviews, The Veil is elevated by the performances of its two leads. Elisabeth Moss delivers yet another gripping performance as a veteran MI6 agent, and Yumna Marwan equals and, at times, exceeds Moss for dramatic chops in this intriguing thriller. Though it might not be a great spy story (it has been unfavorably compared to Homeland), The Veil is best when seen as a character drama exploring two nuanced and layered characters through a timely narrative.\n'Homeland' (2011 - 2020)\nRotten Tomatoes: 85% | IMDb: 8.3/10\n- Release Date\n- 2011 - 2020-00-00\n- Network\n- Showtime\n- Showrunner\n- Alex Gansa\n- Directors\n- Lesli Linka Glatter, Michael Cuesta, Daniel Attias, Alex Graves, Keith Gordon, Clark Johnson, Seith Mann, Tucker Gates, Michael Offer, Guy Ferland, Michael Klick, Carl Franklin, Charlotte Sieling, Jeffrey Nachmanoff, Brad Turner, Daniel Minahan, David Nutter, David Semel, Jeffrey Reiner, Jeremy Podeswa, John Dahl, John David Coles, Lodge Kerrigan\n- Writers\n- Patrick Harbinson, Debora Cahn, Ron Nyswaner, Anya Leta\nCast\n-\nCarrie Mathison\n-\nSaul Berenson\nWhen Marine Corps Scout Sniper and prisoner of war Nicholas Brody (Damian Lewis) is released by al-Qaeda after eight years in captivity, CIA officer Carrie Mathison (Claire Danes) becomes convinced that Brody has been “turned” by the enemy. That’s the premise of Homeland, a spy thriller series developed by Howard Gordon and Alex Gansa, which is based on the Israeli show Prisoners of War. Over the course of its eight seasons on the air, Homeland received largely positive reviews, with Seasons 1 and 2, in particular, hailed as the best of the lot. Danes and Lewis received great praise from critics for their layered performances, with Danes winning two Emmys for her role and Lewis winning one. However, the show isn’t without its flaws, and it has been criticized for its almost stereotypically negative portrayal of Muslims and the Middle East. It’s important to remember that Homeland is very much a work of fiction and should not be considered an accurate representation of reality. That said, it is a fun watch for fans of the spy thriller genre.\n'Brothers & Sisters' (2006 - 2011)\nRotten Tomatoes: 87% | IMDb: 7.5/10\nA landmark American family drama, Brothers & Sisters is set in Los Angeles, California, and focuses on the lives of the Walker family. The series aired for five seasons on ABC between 2006 and 2011, featuring an ensemble cast led by Sally Field as Nora Walker. The show’s cast also includes the likes of Rachel Griffiths, Calista Flockhart, Matthew Rhys, and Emily VanCamp. A hugely popular show during its time on the air, Brothers & Sisters amassed a large fan following over the course of its five seasons. Though originally panned by critics, the show proved to be quite popular with audiences. Over time, it received plenty of accolades as well, earning Sally Field a Primetime Emmy Award and a Screen Actors Guild Award. Field’s Nora is the heart of the show, which is carried by the performances of its talented cast. The series is a great double-feature with Desperate Housewives (also available on Hulu), and in fact, the two shows aired back to back on ABC during their original television runs.\n'Under the Bridge' (2024 - Present)\nRotten Tomatoes: 100%\n- Release Date\n- 2024 - 2024-00-00\n- Showrunner\n- Samir Mehta, Liz Tigelaar\nCast\n-\nIzzy G\nA true crime drama that recounts the brutal murder of Canadian teenager Reena Virk and the incidents that led to her death, Under the Bridge is based on the late Rebecca Godfrey’s eponymous non-fiction book. The series stars Lily Gladstone and Riley Keough in lead roles alongside Archie Panjabi, Javon Walton, Izzy G., and Vritika Gupta. The recent boom in true crime productions has created a wide range of shows and movies, some thoughtful and necessary and others purely sensationalistic. Under the Bridge seems like it fits in the former category, exploring a brutal and tragic crime from the 1990s. The case of Reena Virk, while much talked about in its time, has now become largely forgotten by the general public. The show seeks to change that, shining some much-needed light on this heartbreaking real-life story. With a gripping narrative and a remarkable cast and crew, this true crime series is simply a must-watch.\n'9-1-1' (2018 - Present)\nRotten Tomatoes: 81% | IMDb: 7.9/10\n- Release Date\n- January 3, 2018\n- Network\n- ABC, FOX\n- Showrunner\n- Tim Minear\n- Directors\n- Bradley Buecker, David Grossman, Brenna Malloy, Gwyneth Horder-Payton, Jann Turner, Jennifer Lynch, Marita Grabiak, Sarah Boyd, John J. Gray, Barbara Brown, Robert M. Williams Jr., Kristen Reidel, Marcus Stokes, Tasha Smith, Millicent Shelton, Juan Carlos Coto, John Gray, Greg Sirota, Alonso Alvarez, James Wong, Kevin Hooks, Varda Bar-Kar, Shauna Duggins, Sharat Raju\n- Writers\n- Tim Minear, Andrew Meyers, Brad Falchuk, David Fury, Ryan Murphy, Christopher Monfette, Nadia Abass-Madden, Nicole Barraza Keim, Erica L. Anderson, Matthew Hodgson, Stacey R. Rose, Taylor Wong, Tonya Kong, Adam Penn\nCast\n-\nAthena Grant\n-\nRobert 'Bobby' Nash\nCreated by Ryan Murphy, Brad Falchuk, and Tim Minear, 9-1-1 is a procedural drama that follows a group of Los Angeles first responders, exploring their lives in the context of the emergencies they deal with. The show’s stacked cast includes the likes of Angela Bassett, Jennifer Love Hewitt, Kenneth Choi, and more. 9-1-1 aired six seasons on Fox before it moved to ABC for Season 7 and beyond. A spinoff, 9-1-1: Lone Star, premiered in 2020. With soapy melodrama and high-stakes action, 9-1-1 presents a winning combination of emotion and thrills, making it popular with audiences and critics. The show has earned several accolades, including three NAACP Image Awards for Angela Bassett in the Outstanding Actress in a Drama Series category. While Seasons 1-6 have been quite engaging, the currently ongoing Season 7 may be the show’s best yet, exploring a more interconnected plot that delivers greater character development. The series has already been renewed for Season 8 as well, so you can look forward to plenty more 9-1-1 to come.\n'Survivor' (2000 - Present)\nRotten Tomatoes: 71% | IMDb: 7.5/10\n- Release Date\n- May 31, 2000\n- Network\n- CBS\n- Showrunner\n- Jeff Probst\n- Directors\n- Jeff Probst\n- Writers\n- Jeff Probst\nCast\n-\nSelf - Host\n-\nRob Mariano\nOriginally created by Charlie Parsons and hosted by Jeff Probst, each season of Survivor takes a new group of strangers and puts them in an isolated location where they must fend for themselves. The contestants also face a series of challenges that test their physical and mental fitness, with regular voting-based eliminations weeding out the players one by one until there is only one left. With 45 seasons and counting on the air, Survivor isn’t just a successful reality show — it’s one of the most successful American shows ever. And despite having been around for so long, the show still finds a way to remain relevant and engaging as time passes. Besides the challenges and the interpersonal dynamics of the contestants, Survivor also scores highly with audiences thanks to its beautiful vistas and high production value. Few game shows can match Survivor for its gorgeous visuals, well-crafted competitions, and sheer entertainment.\n'We Were the Lucky Ones' (2024)\nRotten Tomatoes: 100%\n- Release Date\n- 2024 - 2024-00-00\n- Directors\n- Thomas Kail\n- Writers\n- Erica Lipez\nCast\n-\nHenry Lloyd-Hughes\n-\nAmit Rahav\nBased on Georgia Hunter's bestselling novel, We Were the Lucky Ones is a limited series created by Erica Lipez that tells the story of a Jewish family torn apart at the start of World War II who fight to survive and reunite despite facing the darkest of times. Directed by Thomas Kail, this limited drama series stars Joey King, Logan Lerman, Henry Lloyd-Hughes, and more. The show is executive-produced by Lipez, Kail, Adam Milch, Jennifer Todd, Ben Affleck, and Matt Damon.\nPremiering on Hulu on March 28th, 2024, We Were the Lucky Ones is based on the real history of Georgia Hunter’s own family. Their incredible true story, as told through Hunter’s book, is a narrative that spans continents and explores the dark years of the Holocaust through a heartbreakingly human perspective. Though no doubt a challenging task, the series miraculously manages to capture the brilliance of its source material.\n'Shogun' (2024 - Present)\nRotten Tomatoes: 99% | IMDb: 9.2/10\nOne of the most acclaimed shows of 2024 so far, Shogun is a historical fiction drama series created by Rachel Kondo and Justin Marks. Based on James Clavell’s 1975 novel of the same name, the show is set in 1600s Japan at the dawn of a civil war. Shogun follows the interconnected stories of a Japanese warlord, an English sailor, and a brilliant noblewoman trying to prove her allegiance. Inspired by real historical figures, the series stars Hiroyuki Sanada, Cosmo Jarvis, and Anna Sawai.\nShogun has received massively positive reviews from critics around the world, and it's proven to be an equally popular series with audiences. Presenting an epic story that’s beautifully visualized on screen, Shogun is a well-crafted series that elevates its already strong source material with brilliant performances, writing, and cinematography. Released weekly on Hulu and FX, the ten-episode series was the most streamed show in the US during the first three weeks of its release after premiering its first two episodes on February 27th, 2024.\n'Black Cake' (2023 - Present)\nRotten Tomatoes: 94% | IMDb: 7.3/10\n- Release Date\n- 2023 - 2023-00-00\n- Showrunner\n- Marissa Jo Cerar\n- Writers\n- Charmaine Wilkerson, Marissa Jo Cerar\nCast\n-\nMia Isaac\n-\nAdrienne Warren\n-\nChipo Chung\n-\nAshley Thomas\nBased on the novel by Charmaine Wilkerson, Black Cake is a powerful emotional journey starring Mia Isaac, Adrienne Warren, and Chipo Chung. An emotional journey, Black Cake is\na captivating family drama wrapped in a murder mystery. Spanning decades and the globe, the series takes place in Jamaica, Rome, Scotland, England, and Southern California, unraveling a rich story about a woman’s determination to save herself and her family.\nWith an intricate story so engrossing that it drew the attention of producers Oprah Winfrey, Marissa Jo Cerar, and Aleksander Krutainis, the show is brought to the screen with passionate performances and vividly stunning visuals on a cinematic scale. Black Cake is an absolute must-see. - Yael Tygiel\n'A Murder at the End of the World' (2023)\nRotten Tomatoes: 88% | IMDb: 7.1/10\n- Release Date\n- 2023 - 2023-00-00\n- Network\n- FX\n- Showrunner\n- Zal Batmanglij, Brit Marling\n- Directors\n- Zal Batmanglij, Brit Marling\n- Writers\n- Zal Batmanglij, Brit Marling, Cherie Dimaline, Rebecca Roanhorse, Melanie Marnich\nCast\nCo-created by The OA’s Brit Marling and Zal Batmanglij, Murder at the End of the World follows Darby Hart (Emma Corrin), a young hacker and tech-savvy sleuth, as she joins eight others on a creepy, isolated retreat in Iceland. Co-starring Clive Owen as a reclusive billionaire, Murder at the End of the World is a mind-bending whodunnit, which also features performances from Marling, Raúl Esparza, and Alice Braga.\nMurder at the End of the World delightfully reflects the creative yet undeniably twisted minds of its co-creators, allowing Marling and Batmanglij to present an offbeat brain-teaser built on the skill of a fantastic cast. Murder at the End of the World is best binge-watched to enjoy all the surprises sprinkled along the way. - Yael Tygiel\n'Catch 22' (2019)\nRotten Tomatoes: 84% | IMDb: 7.7/10\n- Release Date\n- 2019 - 2019-00-00\n- Directors\n- George Clooney, Grant Heslov, Ellen Kuras\n- Writers\n- Luke Davies, David Michôd\nBased on the 1961 novel of the same name by Joseph Heller, Catch-22 is a dark comedy miniseries that is set during World War II and follows bombardier John Yossarian (Christopher Abbott), who is enraged by the dozens of assassination attempts on his life and the mounting missions his own army assigns him. He is stuck by the bureaucratic Catch-22 rule, which states that any request to be relieved of duty due to fear of mission danger must be denied since it is deemed to be the act of a reasonable mind.\nThe tone shifts between horror and humor are handled and performed with gusto in Catch-22, just like in the novel that serves as the inspiration. Additionally, George Clooney makes an outstanding comeback to the role of storyteller in this production, tapping into both sides of his directorial oeuvre. Hugh Laurie, Kyle Chandler, and Grant Heslov are among the many talented members of the ensemble who assist in ensuring a fantastic show. Moreover, in contrast to the darkly comedic chaos surrounding him, Abbott's Yo-Yo is grounded and understated, which pays off beautifully when the character spirals into true madness. - Jessie Nguyen\n'House' (2004 - 2012)\nRotten Tomatoes: 90% | IMDb: 8.7/10\n- Release Date\n- 2004 - 2012-00-00\n- Network\n- FOX\n- Showrunner\n- David Shore\n- Directors\n- Deran Sarafian\n- Writers\n- David Shore\nCast\n-\nJesse Spencer\nUsing a crack team of doctors and his wits, an antisocial maverick doctor specializing in diagnostic medicine does whatever it takes to solve puzzling cases that come his way.\nArguably Hugh Laurie's most iconic role, House follows Laurie's character, Dr. Gregory House, an awkward, anti-social doctor in diagnostic medicine who is brilliant at solving whatever medical cases home his way. However, Dr. House's poor people skills and drug addiction lead to a great deal of conflict in his life, and managing it all becomes more and more complicated as the series go on. Premiering in 2004, the show had eight successful seasons on Fox, winning five Emmy Awards, including Outstanding writing, directing, and prosthetic makeup.\nCreated and show run by David Shore (The Good Doctor), House's cast also included Robert Sean Leonard (Dead Poet's Society), Omar Epps (Love & Basketball), Jesse Spencer (Uptown Girls), Lisa Edelstein (Girlfriends' Guide to Divorce), Bobbin Bergston (Volcano), and Jennifer Morrison (Once Upon a Time). When the finale aired in 2012, it was followed by an hour-long retrospective that delved into the history and audience's love of the show. - Emily Cappello\n'It's Always Sunny in Philadelphia' (2005 - Present)\nRotten Tomatoes: 100% | IMDb: 8.8/10\n- Release Date\n- August 4, 2005\n- Network\n- FX, FXX\n- Showrunner\n- Rob McElhenney\n- Directors\n- Matt Shakman, Fred Savage, Todd Biermann, Daniel Attias, Richie Keen, Randall Einhorn, Heath Cullens, Pete Chatmon, Jerry Levine, Kat Coiro, Megan Ganz, Jamie Babbit, John Fortenberry, Maurice Marable, Kimberly McCullough, Imani Hakim, LP, Tim Roche\n- Writers\n- Scott Marder, Rob Rosell, Dave Chernin, John Chernin, Dannah Feinglass Phirman, Danielle Schneider, Conor Galvin, Becky Mann, Luvh Rakhe, Audra Sielaff, Eric Ledgin, Patrick Walsh, Lee Sung-jin, Mehar Sethi, Nina Pedrad, Keyonna Taylor, D. B. Weiss, David Benioff, Elijah Aron, Hunter Covington, Jordan Young, Adam Stein, Chris Romano, Eric Falconer\nCast\n-\nCharlie Kelly\n-\nDennis Reynolds\nIt's Always Sunny in Philadelphia is a sitcom and black comedy created by Rob McElhenney. It stars Rob McElhenney, Charlie Day, Kaitlin Olson, Glenn Howerton, and Danny DeVito. The series follows a group of friends that own and frequent the Irish bar, Paddy's Pub, and get into all sorts of troubling adventures.\nOne of the longest-running live-action American sitcoms ever, It's Always Sunny in Philadelphia was created by Rob McElhenney, who also plays one of the leads, alongside Charlie Day (Horrible Bosses), Glenn Howerton (BlackBerry), Kaitlin Olson (Finding Dory), and starting in season 2, Danny DeVito (Matilda). The story follows this cast of characters as they work at a dive bar in Philadelphia: the janitor Charlie (Day), the bouncer Mac (McElhenney), the bartender Dennis (Howerton), and the waitress Dee (Olson). Charlie, Dennis, and Mac are all co-owners of the bar, but When DeVito's character Frank enters the scene, he plays the father of twins Dennis and Dee and takes over much of the ownership of the failing business.\nSince the show's premiere in 2005, it has not only gained a cult following but is now on its eighteenth season. It's been nominated for three Emmy Awards and also led to a real-life wedding between McElhenney and Olson, who now have two children together. - Emily Cappello\n'Welcome to Wrexham' (2022 - Present)\nRotten Tomatoes: 91% | IMDb: 8.3/10\n- Release Date\n- August 24, 2022\n- Network\n- FX\n- Showrunner\n- Ryan Reynolds, Rob McElhenney\n- Directors\n- Humphrey Ker\nWelcome to Wrexham is a documentary sports series created for FX/Hulu, led by Ryan Reynolds and Rob McElhenny. Reynolds and McElhenny partner together to purchase Wrexham's football club, one of the oldest ones in the league, and hope to turn them into champions. However, these two actors have little experience in football or working with one another, so they'll have to learn to work together and navigate the world's most popular sport to have a chance at turning the team around.\nI'll admit it — I judged Welcome To Wrexham before I ever saw it. In my mind, it was going to be all about the two big names who bought the Wrexham Football Club: Ryan Reynolds (Deadpool) and Rob Macelhenney (It's Always Sunny in Philadelphia). Man, was I wrong. The show masterfully blends its larger-than-life hosts with the incredible townspeople of Wrexham, who are reignited with hope upon Reynold and Macelhenney's purchase of their home team.\nThe show premiered on Hulu in 2022 and was a favorite among audiences. We see the impact that new sponsorship, new players, and a new pitch have on not only the Wrexham team but the people that support them. The stories of the members of the community, as well as those of the team members, are incredible and will make you root for a team you may never have heard of in a sport you've never actually watched. Or maybe that's just me. - Emily Cappello\n'Moonlighting' (1985 - 1989)\nRotten Tomatoes: 89% | IMDb: 7.6/10\n- Release Date\n- 1985 - 1989-00-00\n- Network\n- ABC\n- Showrunner\n- Glenn Gordon Caron\n- Writers\n- Glenn Gordon Caron\nCast\n-\nCybill Shepherd\nBruce Willis (Die Hard) and Cybill Shepherd (Cybill) managing a private detective agency? Yes, please. This is the storyline of Moonlighting, which aired five seasons from 1985 to 1989 on ABC. Willis plays detective David, while Shepherd plays former model Maddie, and the two get themselves in all sorts of shenanigans as they partner up at the agency. The show won six Emmy Awards, as well as Writer's Guild Awards (WGA), Golden Globes, and more.\nMoonlighting is credited with launching Willis into the limelight, as well as reinvigorating Shepherd's career, which had faded a bit. The show was listed as one of Time Magazine's \"100 Best TV Shows of All Time\" in 2007, and the chemistry between the two leads was also hailed as one of the best TV couples of all time by TV Guide. Created by Glenn Gordon Caron, Moonlighting also starred Allyce Beasley (Legally Blonde), Curtis Armstrong (Better Off Dead...), and Kristine Kauffman (Society). - Emily Cappello\n'The Office' (UK) (2001 - 2003)\nRotten Tomatoes: 97% | IMDb: 8.5/10\nThe sitcom that created a phenomenon. The Office (UK) premiered on the BBC in 2001 and starred Ricky Gervais (The Invention of Lying) as boss David Brent, Martin Freeman (The Hobbit) as Tim Canterbury, Mackenzie Crook (Pirates of the Caribbean) as Gareth Keenan, and Lucy Davis (Wonder Woman) as Dawn Tinsley. David Brent's character is as cringe-worthy as it gets, creating uncomfortable moments for his employees like he's being paid for it. Meanwhile, Tim and Gareth constantly butt heads, all while Tim is attempting to gain the affection of Dawn.\nGervais created the show alongside Stephen Merchant (Fighting With My Family), and the two went on to create the American version of The Office. While The Office (UK) didn't have nearly the same amount of seasons as the American office, it has since become a cult classic among comedy fans. With six episodes in its first and second seasons, the show wrapped with a two-part Christmas special in 2003. - Emily Cappello\n'Devs' (2020)\nRotten Tomatoes: 82% | IMDb: 7.7/10\n- Release Date\n- 2020 - 2020-00-00\n- Network\n- FX\n- Showrunner\n- Alex Garland\n- Directors\n- Alex Garland\n- Writers\n- Alex Garland\nCast\n-\nAmaya Mizuno-André\nDevs is a science fiction thriller television series created by Alex Garland, the mastermind behind Ex Machina and Annihilation. The series centers on Lily Chan (Sonoya Mizuno), a young software engineer employed at Amaya, an innovative tech company situated in Silicon Valley. Following her boyfriend Sergei's apparent suicide, Lily harbors suspicions of foul play and initiates an investigation. Her inquiries lead her to Forest, the mysterious CEO of Amaya, and Devs, the company's clandestine development division. As Lily delves into the quest for truth, she unravels a conspiracy rooted in technology that has the potential to reshape the world.\nDevs accomplishes what the finest sci-fi narratives excel at, which is addressing profound existential inquiries and delving into intimate, everyday emotions simultaneously, all the while posing the question, 'What if?' Similar to Garland's prior endeavors, the series receives acclaim for its elevated production standards, encompassing visual aesthetics and cinematic style. Moreover, Devs is filled with mysteries, both about the nature of the Devs project and the characters' motivations. The unfolding mysteries keep viewers engaged and guessing the entire time. Its ambition, design, and cinematography surpass the endeavors of nearly anything else undertaken for the small screen, making it a must-see for not only Garland’s fans but also sci-fi enthusiasts in general. - Jessie Nguyen\n'Futurama' (1999 - Present)\nIMDb: 8.5/10\n- Release Date\n- March 28, 1999\n- Network\n- FOX, Comedy Central, Hulu\n- Showrunner\n- Matt Groening\n- Directors\n- Peter Avanzino, Brian Sheesley, Crystal Chesney, Frank Marino, Edmund Fong, Stephen Sandoval, Bret Haaland, Rich Moore, Ron Hughart, Dwayne Carey-Hill, Raymie Muzquiz, Mark Ervin, Susie Dietter, Gregg Vanzo, Swinton O. Scott III, Ira Sherak, James Purdum, Corey Barnes, Lance Kramer, Ray Claffey, Chris Sauve, Jeffrey Lynch, Pat Shinagawa, Wes Archer\n- Writers\n- Eric Rogers, Dan Vebber, Maiya Williams, David A. Goodman, Ron Weiner, Aaron Ehasz, Kristin Gore, Brian Kelley, Evan Gore, Heather Lombard, Jason Gorbett, Michael Saikin\nCast\n-\nBilly WestFry / Professor Farnsworth / Zoidberg / Zapp Brannigan (voice)\n-\nLeela (voice)\nFuturama follows the exploits of Philip J. Fry, a pizza delivery boy from 1999 who is cryogenically frozen for 1000 years. Waking up in the year 3000, Fry befriends a cyclops named Leela and a roguish robot named Bender, and the three find employment with Planet Express, an interplanetary delivery service. Their work takes them to all corners of the universe, exploring space and the future as imagined by Matt Groening and the creators of The Simpsons.\n- Seasons\n- 10\nOriginally airing from 1999 to 2003 and then having a revival from 2008 to 2013, Futurama is an animated science fiction sitcom created by Matt Groening, the creator of The Simpsons. Unintentionally cryogenically preserved, Futurama follows Fry (Billy West), a pizza delivery guy who awakens 1,000 years into the future. His only living relative, the elderly and eccentric Professor Farnsworth, owns a modest cargo delivery service. Alongside Fry, the crew includes Captain Leela (Katey Sagal), accountant Hermes (Phil LaMarr), intern Amy (Lauren Tom), the boisterous robot Bender (John DiMaggio), and the lobster-like \"Dr.\" Zoidberg (also voiced by Billy West).\nBenefiting from Matt Groening's trademark irreverence, Futurama is a vibrant burst of clever cartoon satire. It races forward with a lively momentum, driven by innovative concepts, sharp one-liners, visual humor, and the requisite playful nods to pop culture. Furthermore, hailing from the same creator's imagination, Futurama shares the same subversive humor, apocalyptic undertones, casual attitude in the midst of chaos, and high standard of ironic wit as The Simpsons. And despite its comedic nature, the series includes episodes with poignant and emotionally resonant moments, exploring themes of friendship and self-discovery. - Jessie Nguyen\n'Bob's Burgers' (2011 - Present)\nRotten Tomatoes: 100% | IMDb: 8.2/10\n- Release Date\n- January 9, 2011\n- Network\n- FOX\n- Showrunner\n- Loren Bouchard\n- Directors\n- Tyree Dillihay, Anthony Chun, Jennifer Coyle, Wes Archer, Ian Hamilton, Tom Riggin, Bernard Derriman, Don MacKinnon, Kevin Wotton, John Rice, Simon Chong\n- Writers\n- Lizzie Molyneux-Logelin, Wendy Molyneux, Kelvin Yu, Scott Jacobson, Greg Thompson, Katie Crown, Aron Abrams\n- Franchise(s)\n- Bob's Burgers\nCast\n-\nBob Belcher (voice)\n-\nJohn RobertsLinda Belcher (voice)\nBob Belcher runs a struggling burger shop with his wife and three children.\n- Seasons\n- 16\nCreated by Loren Bouchard and premiering in 2011, Bob's Burgers is an animated television series that follows Bob Belcher (H. Jon Benjamin), a third-generation restaurateur who manages Bob's Burgers alongside his affectionate wife and their three children. Bob holds firm in his belief that his burgers can speak for themselves, unhesitant to present a diverse array of unconventional creations. Linda (voiced by John Roberts), Bob's wife, stands by his dream, but the prolonged periods of slow business are wearing on her. The constant threat of the restaurant going under adds to the challenges, exacerbated by persistent harassment from Linda's ex, a health inspector. Nevertheless, Bob remains determined to keep the grill sizzling.\nWhile Bob's Burgers might not be entirely family-friendly, and its premise isn't entirely groundbreaking, akin to other animated series on Fox's Sunday night lineup, it's a show that revels in the humor and chaos of the typical American family. Furthermore, the show successfully captures the culture-skewing satirical tones reminiscent of The Simpsons in its early years. It also pays homage to the essence of a \"sitcom\" by weaving together an actual storyline and featuring quirky, funny, and fully developed characters. - Jessie Nguyen\n'Justified: City Primeval' (2023)\nRotten Tomatoes: 91% | IMDb: 7.4/10\n- Release Date\n- 2023 - 2023-00-00\n- Network\n- FX\n- Showrunner\n- Dave Andron, Michael Dinner\n- Directors\n- Michael Dinner, Jon Avnet\n- Writers\n- Dave Andron, Michael Dinner\n- Franchise(s)\n- Justified\n- Seasons\n- 1\nTimothy Olyphant’s Raylan Givens, who, after moving to Miami some years prior, is struggling to maintain a work-life balance. After an unlikely set of circumstances sends him to Detroit, Givens accidentally encounters one of the most feared and wanted men in all of the state, the allusive Oklahoma Wildman Clement Mansell (Boyd Holbrook), and must now come face-to-face with the task of catching him.\nBased on Elmore Leonard's novel City Primeval: High Noon in Detroit, this crime drama followsFor fans of the Justified series, this happens to be a perfect continuation of the story, finding the detailed balance of drama and action that made the first series such a success. However, for non-fans, Justified: City Primeval is also a great watch that doesn’t rely on its previous outing with Raylan Givens as the only returning character. Olyphant’s gritty portrayal of the lead character is just as strong in City Primeval, with his nuanced understanding of the genre he is in translating into a captivating on-screen presence. Fast, fun, and full of mettle, City Primeval is a crime/drama fan’s dream. - Jake Hodges\n'The Other Black Girl' (2023 - Present)\nRotten Tomatoes: 85% | IMDb: 6.8/10\n- Release Date\n- 2023 - 2023-00-00\n- Showrunner\n- Jordan Reddout, Gus Hickey\n- Writers\n- Zakiya Dalila Harris, Rashida Jones\nCast\n-\nSinclair Daniel\n-\nAshleigh Murray\n-\nBrittany Abebumola\n-\nHunter Parrish\n- Seasons\n- 1\nRashida Jones follows editorial assistant Nella Rogers (Sinclair Daniel), who happens to be the only Black woman at her New York-based company. Feeling ostracized, Nella’s prayers are finally answered when another Black woman is hired in the form of Hazel-May McCall (Ashleigh Murray), with the two quickly finding friendship. However, cracks begin to show as Nella is mysteriously instructed to leave her job via text and Hazel begins to seemingly deliberately try and get her in trouble, which all culminates in the uncovering of a company-wide conspiracy.\nThis mysterious comedy from the mind of Zakiya Dalila Harris and co-developed byFunny, thrilling, and all too relevant, The Other Black Girl has one finger firmly pressed on the ‘clever narrative’ button and another on society’s pulse. Weaving between satire and mystery, the show is enhanced by the quality of its two female leads, with both Sinclair Daniel and Ashleigh Murray delivering consistently great performances. The plot is always ready to keep you guessing but never makes you feel lost — a balance often difficult to strike for shows of this nature. Guaranteed entertainment with a text fit for educating the masses on the Black workplace experience, The Other Black Girl is a welcome addition to the viewing habits of millions. - Jake Hodges\n'Law & Order: SVU' (1999 - Present)\nRotten Tomatoes: 78% | IMDb: 8.1/10\nIn the criminal justice system, sexually-based offenses are considered especially heinous. In New York City, the dedicated detectives who investigate these vicious felonies are members of an elite squad known as the Special Victims Unit. These are their stories.\nA spin-off of Dick Wolf’s all-time classic Law & Order, Special Victims Unit follows the group of detectives especially assigned to deal with New York City’s most skin-crawling criminals. Each of the detectives charged with this most challenging of jobs has a detailed set of skills — the sort of skills that, of course, come with their own dramatic baggage. Because of this, perhaps the toughest obstacles they face are, in fact, themselves.\nAfter 24 years, Law & Order: Special Victims Unit goes from strength to strength with ever-increasing dramatic tension and criminal justice thrills. With over 500 episodes in the back pocket, there is plenty of content to get new viewers started, with an abundance of gripping drama ready and waiting. For such a long-running show, SVU has a remarkably consistent cast of talented actors, with many stand-out performances and stories leading to a plethora of awards, including six Primetime Emmys. - Jake Hodges\n'What We Do in the Shadows' (2019 - Present)\nRotten Tomatoes: 97% | IMDb: 8.6/10\n- Release Date\n- 2019 - 2024\n- Network\n- FX\n- Showrunner\n- Paul Simms\n- Directors\n- Kyle Newacheck, Jason Woliner, Jackie van Beek\n- Writers\n- Chris Marcil, Lauren Wells, Tom Scharpling, Rajat Suresh, Jeremy Levick, Max Brockman, Duncan Sarkies, Iain Morris, Josh Lieb, Aasia LaShay Bullock\nCast\n-\nNandor the Relentless\n-\nMatt BerryLaszlo Cravensworth\nWhat We Do in the Shadows offers a comedic glimpse into the nightly lives of four vampire roommates—Nandor, Laszlo, Nadja, and energy vampire Colin Robinson—residing in Staten Island. Alongside their human familiar, Guillermo, they navigate modern challenges like paying rent, attending social events, and dealing with supernatural politics, all while maintaining their centuries-old habits.\n- Seasons\n- 6\nKayvan Novak), Colin (Mark Proksch), Nadja (Natasia Demetriou), and Laszlo (Matt Berry), their immortal lives are full of dark deeds. However, the modern world has seemingly left them behind, leaving them struggling to come to terms with everyday human activities such as sending an email and going to the gym. How will they cope when modern society and their vampire underworld converge on them at the same time?\nThis award-winning mockumentary follows the lives of four vampires and a human familiar living in an old mansion in Staten Island, New York. For Nandor (Quite simply one of the funniest shows on television, What We Do in the Shadows is brimming with some of the 21st century’s most memorable comedy performances. From the trio of lead vampires to Harvey Guillén’s human familiar and a whole host of guest stars, this series is bursting at the seams with captivating comedic turns and eye-catching cameos. Based on Taika Waititi’s critically acclaimed movie of the same name from 2014, this series certainly lives up to its predecessor and, in many ways, exceeds it, managing to find humor in every frame. Laugh-out-loud funny and never far from a touching moment, What We Do in the Shadows is a unique take on the mockumentary genre littered with genius comic creations. - Jake Hodges\n'Cruel Summer' (2021 - 2023)\nRotten Tomatoes: 79% | IMDb: 7.4/10\n- Release Date\n- 2021 - 2023-00-00\n- Network\n- ABC\n- Showrunner\n- Bert V. Royal\n- Directors\n- Jessica Biel\n- Writers\n- Taylor Swift\nCast\n-\nMichael Landes\n-\nAllius Barnes\n-\nFroy Gutierrez\nIn this anthology series, each season follows a new cast of characters who deal with traumatic events over several timelines, and how those events impact their lives.\n- Seasons\n- 2\nOlivia Holt). Socially awkward and hiding from society, Jeanette’s life takes a dramatic turn when the ever-popular Kate one day goes missing, with the former slowly taking over the latter’s life. As time goes by, Jeanette slowly adopts many facets of Kate’s existence, but a sudden twist reveals devastating consequences that even make national news.\nThis teen drama anthology series' first season is set in the mid-1990s and follows the lives of teenage girls Jeanette Turner (Chiara Aurelia) and Kate Wallis (A wonderful blend of high school teen drama and gripping modern mystery, Cruel Summer (not to be confused with the Taylor Swift song) is an absorbing tale of the devastating depths of the human psyche, analyzing just how far many of us could be willing to go in the search for social acceptance. Full of eye-catching cinematography and an eerie sense of tension, Cruel Summer is highlighted by the high-octane lead performances, in particular Chiara Aurelia’s multi-dimensional Jeanette Turner. - Jake Hodges\n'A Small Light' (2023)\nRotten Tomatoes: 100% | IMDb: 8.4/10\n- Release Date\n- 2023 - 2023-00-00\n- Network\n- National Geographic\n- Showrunner\n- Joan Rater\n- Directors\n- Tony Phelan, Susanna Fogel, Leslie Hope\n- Writers\n- Tony Phelan, Joan Rater, Ben Esler, William Harper\nCast\n-\nBel Powley\n- Seasons\n- 1\nLiev Schreiber), who is also Miep’s boss, suddenly one day asks Miep to hide them, the young woman is quick to oblige, with the show documenting the next two years of their lives and the terrifying ordeal it represented.\nThis Primetime Emmy-nominated series tells an oft-told story from a new perspective, with the devastating tale of Anne Frank (Billie Boullet) and her family reframed from the point of view of Miep Gies (Bel Powley), the woman who hid the family from the Nazis for over two years. After Anne’s father, Otto (An emotionally gripping tale made all the more tearjerking thanks to its truth, A Small Light is a once-in-a-lifetime biopic series that manages to both entertain and inform in equal measure. Amongst a plethora of great performances, Bel Powley is simply stunning as Miep Gies, managing to perfectly capture a nuanced blend of impressive courage and genuine fear. With many critics and fans describing this as one of the best depictions of the Anne Frank story, there is absolutely no reason why it shouldn’t be viewed in all of its gut-wrenching glory. - Jake Hodges\n'Under the Banner of Heaven' (2022)\nRotten Tomatoes: 86% | IMDb: 7.5/10\n- Release Date\n- 2022 - 2022-00-00\n- Network\n- Hulu\n- Showrunner\n- Dustin Lance Black\n- Directors\n- Courtney Hunt, Thomas Schlamme\n- Writers\n- Brandon Boyce\nCast\n-\nRon Lafferty\n-\nScott Michael CampbellBrigham Young\n- Seasons\n- 1\nAndrew Garfield as Detective Jeb Pyre, a trusting man of faith whose fondness for justice is bettered by his love for God. Alongside Detective Bill Taba (Gil Birmingham), the two become the key investigators in the murder of a mother and her baby daughter. However, when the murders seem to be directly linked to the Church of Jesus Christ of Latter-day Saints, Pyre and Taba will have no choice but to directly challenge the very faith that their lives are so preciously dedicated to.\nThis critically acclaimed miniseries starsBiting, dramatic, and never short of a controversial suggestion or two, Under the Banner of Heaven is a superb example of modern-day television, managing to display all the technical and narrative mastery one might only expect from a Hollywood movie. Andrew Garfield is simply mesmerizing as Jeb, as is the rest of the ensemble, with the emotionally gripping scripts translating beautifully into on-screen success. Under the Banner of Heaven is a thought-provoking, nuanced discussion of faith and its challenges, with the series deserving of more than just its singular Primetime Emmy nomination. - Jake Hodges\n'Tiny Beautiful Things' (2023)\nRotten Tomatoes: 85% | IMDb: 7.2/10\n- Release Date\n- 2023 - 2023-00-00\n- Writers\n- Jocelyn Bioh, Liz Tigelaar\nCast\n-\nSarah Pidgeon\n- Seasons\n- 1\n- Creator\n- Liz Tigelaar\nKathryn Hahn, Tiny Beautiful Things follows the Emmy-nominated actress as Clare, an advice columnist whose public counsel hides her own shortcomings. With a marriage on the brink, a spiraling relationship with her child, and a stalling career to boot, her choice to become the advice columnist Dear Sugar when the opportunity suddenly becomes available would seem, on paper, to be a disaster in waiting. But in fact, Clare’s own pitfalls are what makes her more than qualified, with her reliving her past trauma in order to offer relatable guidance.\nStarring the ever-brilliantBased on the book by Cheryl Strayed, Tiny Beautiful Things is an emotionally relatable tale never far from a refreshing shot of comedy. Possibly Kathryn Hahn at her very best thanks to a beautifully crafted character in Clare, the entire ensemble seems to be really enjoying their work — a sense of fun that translates into the hearts of the audience. A wonderful journey through a variety of human emotions, Tiny Beautiful Things is brave enough to be both merrily light-hearted and gutwrenchingly sad, not just overall but sometimes in the same scene. - Jake Hodges\n'Great Expectations' (2023)\nRotten Tomatoes: 43% | IMDb: 5.3/10\n- Release Date\n- 2023 - 2023-00-00\n- Network\n- BBC One, Hulu\n- Directors\n- Lucy Forbes\n- Writers\n- Steven Knight\nCast\n-\nMr. Pumblechuck\n-\nMiss Havisham\nAn orphaned boy named Pip is thrust into the complexities of high society after receiving a mysterious fortune. As he tries to win the heart of the beautiful but cold Estella, Pip must reconcile his new ambitions with his roots. The narrative weaves through his encounters with colorful characters and the dark secrets of his benefactor, offering a rich tapestry of Victorian life and the moral dilemmas that come with great expectations.\n- Seasons\n- 1\nFionn Whitehead as the iconic Pip, a young orphan with the world at his feet but a lack of self-belief. Born into a troubled life, Pip finally finds some sense of meaning through Olivia Colman’s Miss Havisham, although her twisted eccentricities end up sending Pip on the wrong path. With the weight of great expectations and a dark new world on his horizon, just how will the young boy cope?\nThis 2023 adaptation of the Charles Dickens classic starsNot only is this Great Expectations adaptation an ode to the literary behemoth that is the original, but it is also not shy from heading in its own direction, often offering modern-day answers to themes otherwise unexplored in the original. The series is backed by an impressive cast that includes the likes of Matt Berry and Owen McDonnell, although it is young Whitehead who stands out the most as Pip, managing to find a striking balance between the innocence of youth and fear for the future. Dramatic and brooding, Great Expectations makes for great viewing for both Dickens diehards and non-fans alike. - Jake Hodges\n'Superstore' (2015 - 2021)\nRotten Tomatoes: 93% | IMDb: 7.9/10\n- Release Date\n- 2015 - 2021\n- Network\n- NBC\n- Showrunner\n- Justin Spitzer\n- Directors\n- Victor Nelli Jr., Ken Whittingham, Ruben Fleischer, Betsy Thomas, Matt Sohn, Ross Novie, America Ferrera, Charles Stone III, Jeffrey Blitz, Mark McKinney, Geeta Patel, Phil Traill, Ryan Case, Todd Biermann, James Renfroe, Amy York Rubin, Jay Hunter, Kabir Akhtar\n- Writers\n- Owen Ellickson, Bridget Kyle, John Kazlauskas, Alessandro Tanaka, Laura McCreary, Brian Gatewood, Josh Malmuth, Rene Gube, Matt Lawton, Dayo Adesokan, Aaron Lee, Colton Dunn, Justin Shanes, L.E. Correia\nCast\n-\nJonah Simms\n-\nLauren AshDina Fox\n-\nColton DunnGarrett McNeill\n-\nNico SantosMateo Liwanag\n- Seasons\n- 6\nThis six-season sitcom created by Justin Spitzer follows the everyday lives of an eclectic mix of employees at a big-box store known as Cloud 9. From America Ferrera’s skeptical store manager to Ben Feldman’s business school dropout to Lauren Ash’s no-nonsense assistant manager, the weaving relationships of this brilliantly real group of people make the backbone of Superstore’s ever-changing plot.\nAn underrated comedy brimming with hilarious oddball characters, Superstore, despite its many episodes, never seems to drop the ball when it comes to quality, with the likes of Justin Shanes and Vicky Luu applying their writing talents across the show. Fast-paced and witty, each character is instantly loveable thanks to their blend of quirky comedy and relatability, with it becoming impossible not to find an emotional connection. Not just a shining example of modern American sitcoms, Superstore is also a forward-thinking genre-defier, with the show thriving thanks to its diverse cast and ranging discussion of issues. - Jake Hodges\n'Schitt's Creek' (2015 - 2020)\nRotten Tomatoes: 93% | IMDb: 8.5/10\n- Release Date\n- 2015 - 2020-00-00\n- Showrunner\n- Dan Levy, Eugene Levy\n- Writers\n- Dan Levy, Eugene Levy, David West Read\nAfter being a victim of fraud, Johnny Rose and his family go from extremely wealthy to penniless overnight. The only asset left to them is a small, unsophisticated town: Schitt's Creek. They relocate there. Culture shock ensues.\n- Seasons\n- 6\nThis iconic comedy follows the Rose family, headed by the wealthy Johnny (Eugene Levy). After an unfortunate set of circumstances leaves the family penniless as victims of fraud, the family must piece together the final semblances of their wealth and rebuild their fortune. The only issue is that all they have left is the titular Schitt’s Creek, a small rural location they once bought simply as a joke.\nWinner of nine Primetime Emmys, Schitt’s Creek is an intelligent series with one eye on desperately funny comedy and another on a thoughtful discussion of class. The series has won a worldwide fanbase thanks in no small part to its talented ensemble that includes the likes of Catherine O’Hara and real-life father and son Eugene and Dan Levy. Witty and wonderful, the show blends tenderness and biting satire in a way that provides something for everyone. - Jake Hodges\n'The Golden Girls' (1985 - 1992)\nIMDb: 8.2/10\n- Release Date\n- 1985 - 1992-00-00\n- Network\n- NBC\n- Showrunner\n- Susan Harris\n- Directors\n- Susan Harris\n- Writers\n- Susan Harris\nCast\nThe Golden Girls follows Dorothy Zbornak (Bea Arthur), Rose Nylund (Betty White), Blanche Devereaux (Rue McClanahan), and Sophia Petrillo (Estelle Getty) as they live together in Miami. Throughout its seven seasons, the beloved series created by Susan Harris won 11 Primetime Emmys and continues to be one of the most beloved sitcoms of the ‘80s and ‘90s.\n- Seasons\n- 7\nThis timeless sitcom created by Susan Harris follows the lives of four previously married women who, through divorce or widowing, have ended up rooming together in their older years. Each with their own outlook on life, The Golden Girls gather their thoughts and share their memories as their friendship continues to blossom across seven beloved seasons.\nRegarded by some as the best sitcom to ever grace our screens, it would be impossible to compliment The Golden Girls without gushing over the women themselves, with the talented Betty White, Rue McClanahan, Estelle Getty, and the endlessly witty Bea Arthur all writing their names into television history. Full of legendary episodes, The Golden Girls beautifully blends laugh-out-loud set pieces and a touching heart, with the iconic theme tune “Thank You For Being a Friend” poignantly summing up the entire series. - Jake Hodges\n'Welcome to Chippendales' (2022)\nRotten Tomatoes: 72% | IMDb: 7.3/10\n- Seasons\n- 1\nKumail Nanjiani) as he travels across the world in search of the American dream. On the hunt for success, Steve starts the very first male strip joint, the titular Chippendales, and finds that his initial triumph soon turns to disaster.\nThis Primetime Emmy-nominated series follows Indian immigrant Steve Banerjee (A drama with a weaving plot that ebbs and flows between gripping tension and touching emotion, Welcome to Chippendales is a story of zero to hero and back to zero again. Amongst a high-performing ensemble, Kumail Nanjiani is captivating as Steve, managing to move through the spectrum of human emotion from right to wrong without ever feeling unrelatable. With an impressive production value and a tender true story in tow, Welcome to Chippendales makes for highly entertaining viewing. - Jake Hodges\n'Fleishman is in Trouble' (2022)\nRotten Tomatoes: 87% | IMDb: 7.7/10\n- Release Date\n- 2022 - 2023-00-00\n- Writers\n- Taffy Brodesser-Akner\nCast\n-\nAdam Brody\nToby Fleishman knew what to expect when he and his wife of almost 15 years separated: weekends and every other holiday with the kids, some residual bitterness, and the occasional moment of tension in their co-parenting negotiations.\n- Main Genre\n- Drama\n- Seasons\n- 1\n- Creator\n- Taffy Brodesser-Akner\nJesse Eisenberg’s surgeon, Toby Fleishman, who, after being married for almost 15 years, finds himself single and on the lookout for a potential partner. Having to face the modern reality of online dating, Fleishman soon finds much more success than he could have ever imagined, although his fun is halted when his ex-wife suddenly disappears. Now in charge of his kids, a promising love life, and the hunt for the missing mother of his children, how will Toby be able to cope?\nNominated for seven Primetime Emmys, this drama followsWith a penchant for always managing to keep the audience on its toes, Fleishman is in Trouble is a refreshing adaptation in a market full of predictably faithful attempts. Full of multiple layers of rich emotional drama, the show is only bettered by its stellar cast, with the likes of Jesse Eisenberg, Claire Danes, and Lizzy Caplan all in top form. The story manages to quickly gain its audience’s trust but also never feels far away from a moment of deception, with the human propensity to find sympathy challenged in all its naive glory. - Jake Hodges\n'Reservation Dogs' (2021 - 2023)\nRotten Tomatoes: 99% | IMDb: 8.2/10\n- Release Date\n- 2021 - 2023-00-00\n- Network\n- FX\n- Directors\n- Taika Waititi\n- Writers\n- Taika Waititi\nCast\n-\nBobby Lee\n- Seasons\n- 3\nTaika Waititi, Reservation Dogs follows the lives of four Indigenous friends living in a sleepy rural Oklahoma town. One year after the death of their friend Daniel, who had always dreamed of moving to the big city, the four battle with their grief adn fight to keep his dream alive, with the gang committing petty crimes to try and scrape together enough money to take a trip to California, the goal set for them by Daniel.\nCreated by Sterlin Harjo and the talentedAn inspirational tale of plucky, youthful courage and a touching discussion of the frustrations felt when mourning, Reservation Dogs is much more than a simple comedy (although it’s also damn funny). A plot never far from a creative twist, each episode finds both heart and head with an emotional throughline, as well as an intelligent structure. However, Reservation Dogs, in fact, transcends its very medium, becoming the very first entirely Indigenous cast and crew to feature in an American series. - Jake Hodges\n'Pose' (2018 - 2021)\nRotten Tomatoes: 98% | IMDb: 8.6/10\n- Release Date\n- 2018 - 2021-00-00\n- Network\n- FX\n- Directors\n- Ryan Murphy\n- Writers\n- Ryan Murphy\nCast\n-\nMichaela Jaé Rodriguez\n- Seasons\n- 3\nOver the course of three stunning seasons, this drama set in New York City in the late 1980s and early 1990s explores various cultural phenomena all centered on a self-selected family known as a ‘house.' Created by MJ Rodriguez’s Blanca, the house all compete with each other in competitions based on various different categories from outfits to dancing, with the true purpose of the house to offer refuge to members of the LGBTQIA+ community who had been disowned by their bigoted families.\nA touching tribute to a community of people who paved the way for the positive side of 21st-century attitudes, Pose is much more than a musical drama, although it should be said that the successful micro elements of its production are all admirably achieved. Poignant, reflective, and culturally significant, Pose pulls no punches when showcasing the very real treatment many members of the LGBTQIA+ community faced and still face to this day. Dramatic and unapologetically so, Pose is proud to be anything but subtle, a trait that will come as no surprise to fans of the series' co-creator Ryan Murphy. - Jake Hodges\n'Ramy' (2019 - Present)\nRotten Tomatoes: 94% | IMDb: 8.0/10\nThis eloquent comedy/drama follows the titular Ramy (Ramy Youssef), the son of Egyptian immigrants, as he goes about his everyday life in modern-day New Jersey. However, inside Ramy’s mind is a fight for power as he seeks spiritual guidance on the hunt for meaning. On one hand, Ramy is part of a devout Muslim community, and on the other, Ramy is part of a group of millennial friends who seek to simply live life to its maximum without the restrictions a religion may pose. Divided down the middle, and in the eye of God, Ramy will find his answer somehow.\nNot dissimilar in its thematic questioning to Are You There God? It’s Me, Margaret, Ramy is an intelligent, thought-provoking drama masking as a tender comedy. As a modern-day look at the life of a Muslim in America, Ramy feels raw and real; it never suppresses its message, but the narrative never ventures into hyperbole either. Ramy Youssef is fantastic in the lead role, which won him a Golden Globe for Best Actor in a Television Comedy. Simple, considerate, and important, Ramy is the lesser-told, poignant story of a demographic of people that make up a pivotal portion of our communities. - Jake Hodges\n'Reasonable Doubt' (2022 - Present)\nRotten Tomatoes: 100% | IMDb: 6.3/10\n- Release Date\n- April 26, 2017\n- Network\n- Investigation Discovery\nCast\n-\nChris AndersonSelf - Host\n-\nFatima SilvaHost\n- Seasons\n- 5\nCreated by Raamla Mohamed, Reasonable Doubt follows Jax Stewart (Emayatzy Corinealdi), a defense lawyer living the high life in Los Angeles at the top of her professional game. However, even the best can feel the pressure, with Stewart beginning to crack under the spotlight of her high-profile cases. This pressure is amplified by her difficult private life thanks to the ongoing separation from her husband, Lewis (McKinley Freeman).\nAccompanied by a killer soundtrack, each episode of Reasonable Doubt is brimming with dramatic tension, forcing the viewer to find a genuine connection with many in the ensemble. Emayatzy Corinealdi is perfectly cast as Jax, neatly finding the nuance between her strength and vulnerability during a testing time in her life. Reasonable Doubt’s plot is intelligently composed, with each scene always feeling like there is a mystery lurking just below the surface. Endlessly gripping, this series will leave you no doubt wanting more. - Jake Hodges\n'Reboot' (2022)\nRotten Tomatoes: 85% | IMDb: 7.4/10\n- Release Date\n- 2022 - 2022-00-00\n- Network\n- Hulu\n- Directors\n- Chris Koch, Jaffar Mahmood, Beth McCarthy-Miller, Steven Levitan, Viet Nguyen\n- Writers\n- Josh Levine, Andrew Gurland, Dave King, David Feeney\nCast\n-\nBob ClendeninDougie\n-\nE.J. CallahanElderly Waiter\n-\nAlan\n-\nGeorge NewbernAnders\n- Seasons\n- 1\nThis meta-comedy from creator Steven Levitan follows the cast of an early-aughts fictional sitcom called Step Right Up. After a budding young writer pitches and develops a reboot of their show, the cast must come back together and face their own dysfunctional relationships as well as a changing television landscape in order to try and make the reboot a success.\nA laugh-a-minute breath of fresh air, Reboot is a refreshing analysis of the modern sitcom environment as well as, simply, a genuinely funny show. Beyond its intelligent premise, Reboot thrives thanks to its perfectly cast ensemble, with the likes of Keegan-Michael Key, Johnny Knoxville, and Rachel Bloom all plucked from a crop of modern comedic talent to find their calling with this series. In a metatextual subversion of many other sitcoms currently on television, Reboot is also gorgeously shot, with clear detail being taken for this show to not just be smartly written but also visually enjoyable. Sadly, the show struggled to find itself a new home in early 2023, with the first season now its only outing to date. - Jake Hodges\n'Tell Me Lies' (2022 - Present)\nRotten Tomatoes: 86% | IMDb: 6.7/10\n- Release Date\n- September 7, 2022\n- Network\n- Hulu\n- Showrunner\n- Meaghan Oppenheimer\n- Directors\n- Isabel Sandoval, Jonathan Levine\n- Writers\n- Meaghan Oppenheimer, Carola Lovering, Allison P. Davis, Bill Kennedy\nCast\n-\nGrace Van PattenLucy Albright\n-\nJackson WhiteStephen DeMarco\nTell Me Lies is a drama television series created by Meaghan Oppenheimer for Hulu. Based on the novel, the series follows the relationship of two people over eight years who develop into a toxic co-dependent relationship that causes lasting effects for them and those closest to them.\n- Seasons\n- 3\nThis romantic drama follows the decade-long relationship of Grace Van Patten’s Lucy Albright and Jackson White’s Stephen DeMarco. After first meeting on their college campus, Lucy becomes infatuated with the alluring Stephen and naively chases after his irresistible charm. As their tumultuous relationship develops, it is clear that not all is emotionally sound. Their obsession with each other turns into addictive toxicity, with their fiery relationship soon tearing apart not just their lives but also those of their friends and family.\nTell Me Lies is a gripping drama full of intimate details that will make you not want to watch it with your parents. Full of palpable sexual and dramatic tension, the show is arguably excruciatingly true to life, with Jackson White’s heartless portrayal of narcissist Stephen the sort of evil we all wish we could avoid but have experienced at least once in our lives. Edge-of-your-seat television, Tell Me Lies is both a wonderful watch and a worrisome warning. - Jake Hodges\n'The Patient' (2022)\nRotten Tomatoes: 88% | IMDb: 7.0/10\n- Release Date\n- 2022 - 2022-00-00\nCast\n-\nLinda Emond\n-\nLaura Niemi\nThe Patient is a limited series that follows a psychotherapist, played by Steve Carell, who is held captive by a serial killer, played by Domhnall Gleeson, who demands therapy sessions in exchange for his life.\nSteve Carrell, The Patient follows psychotherapist Alan Strauss, played by the aforementioned Carrell, as he is scarily kidnapped and held captive by serial killer Sam Fortner (Domhnall Gleeson). However, in a surprising twist, Fortner does not plan to murder Strauss, instead asking him to work his psychotherapy magic and halt his homicidal urges. However, as Strauss dives deeper into the past of his patient, soon he realizes he may be uncovering his own inner demons, too.\nStarring the iconicA thought-provoking character study starring two of the best actors working today, The Patient doesn’t simply rest on its unique premise, instead delivering on its promise as well. As each episode develops, a deeper analysis of the human psyche is uncovered, with the twisting journeys of both main characters finding surprising yet poignant similarities. For the many who haven't seen Foxcatcher and see Carrell as a comic genius and nothing more, let this series be an eye-opening adventure into the actor’s dramatic work, with this performance one of his most nuanced to date. - Jake Hodges\n'Little Fires Everywhere' (2020)\nRotten Tomatoes: 79% | IMDb: 7.7/10\n- Release Date\n- 2020 - 2020-00-00\n- Showrunner\n- Liz Tigelaar\n- Directors\n- Lynn Shelton\n- Writers\n- Liz Tigelaar, Kerry Washington, Reese Witherspoon\n- Seasons\n- 1\nBased on Celeste Ng's 2017 bestseller of the same name, Little Fires Everywhere follows the meeting of the faultless Richardson family and a mother and daughter, Mia and Pearl Warren, played by Kerry Washington and Lexi Underwood, respectively. After living their lives by the rulebook in an attempt to avoid trouble, the Richardson family’s lives come under threat when coming face-to-face with the strange enigmatic combination of the aforementioned parent and child. What unravels is a whole host of deeply held secrets amongst the weight of deception and a crisis in identity for all involved.\nTense and thrilling, this mystery unravels at a beautifully brooding pace, with the television adaptation certainly doing justice to the highly-regarded source material. Reese Witherspoon is unsurprisingly fantastic as Elena Richardson, stealing every scene she is in, although that doesn’t mean to say the rest of the ensemble isn't also impressive. Nominated for five Primetime Emmys, each episode is full of edge-of-your-seat revelations, with many comparing the series tonally to the successful Big Little Lies. - Jake Hodges\n'The Americans' (2013 - 2018)\nRotten Tomatoes: 96% | IMDb: 8.4/10\n- Release Date\n- 2013 - 2018\n- Network\n- FX\n- Showrunner\n- Joe Weisberg\n- Directors\n- Daniel Sackheim, Thomas Schlamme, Daniel Attias, Kevin Dowling, Stefan Schwartz, Adam Arkin, Matthew Rhys, Nicole Kassell, Noah Emmerich, Andrew Bernstein, John Dahl, Kevin Bray, Roxann Dawson, Steph Green, Sylvain White, Alex Chapple, Alik Sakharov, Bill Johnson, Charlotte Sieling, Christopher Misiano, Constantine Makris, Gavin O'Connor, Gregory Hoblit, Gwyneth Horder-Payton\n- Writers\n- Melissa James Gibson, Stuart Zicherman, Hilary Bettis, Bradford Winters, Angelina Burnett, Sneha Koorse\nCast\n-\nElizabeth Jennings\n-\nPhillip Jennings\nIn the midst of the Cold War, Elizabeth and Phillip Jennings appear to be an average American couple, living out the American dream in their house in the suburbs with their two children, Paige and Henry. In truth, though, Elizabeth and Phillip are Soviet agents, working under deep cover for the KGB.\n- Seasons\n- 6\nThe Americans, partly based on a true story, follows the ordinary ‘white picket fence’ lives of Elizabeth (Keri Russell) and Philip Jennings (Matthew Rhys). However, nothing is truly as it seems, with the pair a duo of Soviet spies sent to live out an average American life undetected. By day, they look after their children and become amicable acquaintances with their neighbors, but by night, they craft a deceptive group of confidantes to try and alter the Soviet’s chances of winning the war.\nSet against the backdrop of the Cold War,Regarded by some as the greatest spy series ever made, The Americans has rightfully earned that title amongst a cavalcade of public and critical praise, including an impressive four Primetime Emmys. As each episode progresses, the true nature of the story and its context is analyzed in great detail, with the rising pressure and tension between the couple and their environment a perfect tonal allegory for the Cold War itself. Emotionally poignant, the show intelligently blends the micro elements of a unique relationship and the macro weight of the society it doesn’t simply set itself amongst but soaks every sinew of its plot in. - Jake Hodges\n'The Old Man' (2022 - Present)\nRotten Tomatoes: 97% | IMDb: 7.6/10\n- Release Date\n- 2024 - 2024-00-00\n- Network\n- FX\n- Showrunner\n- Greg Yaitanes\n- Directors\n- Greg Yaitanes\nCast\n-\nDan Chase\n-\nHarold Harper\nPremiering on FX in 2022, The Old Man is a Thriller and Drama series starring Jeff Bridges. The film sees Bridges playing Dan Chase, an ex-CIA operative and war veteran that kills an intruder that enters his home and then goes into hiding to avoid the law.\n- Seasons\n- 2\nJeff Bridges as retired CIA agent and Vietnam veteran Dan Chase, who, after murdering an intruder who broke into his house, went into hiding some 30 years ago. Suddenly, in the present day, Chase becomes the target of two deadly opponents: his former employers and an unknown man from deep within his past. With high-profile agents, hired hitmen, and the harsh reality of his past on his case, will Chase be able to survive?\nThis action series starsFor fans of pure action, this is the series for you. Jeff Bridges is a badass veteran who hasn’t lost a beat since his heyday, with impressive action sequences and adrenaline-pumping one-liners to boot. Based on Thomas Perry’s 2017 novel of the same name, this series doesn’t simply do its source material justice — it neatly adapts it for the screen with a penchant for beautiful cinematography in between the tense thrills. With a plot that feels like it could take a cunning turn at any moment, The Old Man is a fun adventure starring a Hollywood legend on top form. - Jake Hodges\n'The Act' (2019)\nRotten Tomatoes: 88% | IMDb: 7.9/10\n- Release Date\n- 2019 - 2019-00-00\n- Seasons\n- 1\nJoey King, who was held captive by her own mother, Dee Dee (Patricia Arquette), a woman with Munchausen by proxy. After being subjected to a horrifying period of emotional and physical turmoil, Gypsy Rose is eventually pushed to the edge, in which she decides to craft a plan to have her mother murdered.\nThis award-winning biopic tells the now-infamous story of Gypsy Rose Blanchard, played byShocking, dramatic, and sadly true, The Act intelligently retells one of the most harrowing stories to capture the world’s attention in recent years. Both Patricia Arquette and Joey King are honest and emotionally captivating in their performances, made even more impressive when one considers just how sensitive the subject at hand is. Although the plot does take some creative license (as it has every right to do), every micro element from the set design to the costume and especially Joey King’s portrayal of Gypsy Rose is eerily accurate, creating a sense of realism that permeates through the screen and makes the series gutwrenchingly powerful. - Jake Hodges\n'The Dropout' (2022)\nRotten Tomatoes: 90% | IMDb: 7.5/10\n- Release Date\n- 2022 - 2022-00-00\n- Showrunner\n- Elizabeth Meriwether\n- Directors\n- Michael Showalter\n- Writers\n- Elizabeth Meriwether\n- Seasons\n- 1\nAmanda Seyfried portray the true story of Elizabeth Holmes. After dropping out of college, Holmes becomes a prodigy within the medical world, creating Theranos, a device set to revolutionize the blood-testing industry. However, with the world at her feet, Holmes instead decides to scam her patients with false information, leading to the loss of lives and the eventual downfall of Holmes herself.\nThis biopic from Elizabeth Meriwether seesA fascinating true tale of deception and drama, The Dropout sees Amanda Seyfriend give one of her best performances as Elizabeth Holmes, with all credit going to her ability to find the heart within such a deplorable woman. Not only that, but her likeness to the Holmes herself is uncanny, with Seyfried’s performance winning her a Primetime Emmy at the 2022 awards. Beyond its lead turn, The Dropout is a triumph thanks to its detailed look at what could have easily been a black-and-white story, with a level of sympathy offered to Holmes that only seeks to humanize her without ever watering down her heinous crimes. Thoughtful, provocative, and tense, The Dropout is a must-see. - Jake Hodges\n'Abbott Elementary' (2021 - Present)\nRotten Tomatoes: 90% | IMDb: 7.5/10\n- Release Date\n- December 7, 2021\n- Network\n- ABC\n- Showrunner\n- Quinta Brunson\n- Writers\n- Quinta Brunson\nCast\n-\nJanine Teagues\n-\nGregory Eddie\nA workplace comedy centered around a group of dedicated teachers - and an oblivious principal - in a Philadelphia public school where, despite the odds stacked against them, they are determined to help their students succeed in life.\n- Seasons\n- 5\nThis critical success follows the ups and downs of a group of passionate teachers. After being thrust together at a failing Philadelphia public school, the dedicated academics must fight against an ignorant educational system, troubled kids, and a school district’s wayward thoughts on education on the hunt to change the lives of the children they care for.\nA comedy with so much more to say than first meets the eye, Abbott Elementary has the ability to make you both fall out of your chair laughing and provoke a genuinely nuanced conversation about the modern education system. Supported by a fantastic ensemble cast, including the likes of Quinta Brunson and Janelle James, Abbott Elementary is a shining example of the direction the 21st-century sitcom is dying to go in as more and more young people are influenced by the media style’s messaging. - Jake Hodges\n'Harlots' (2017 - 2019)\nRotten Tomatoes: 97% | IMDb: 7.7/10\n- Release Date\n- 2017 - 2019-00-00\nCast\n-\nKate Fleetwood\n-\nHolli Dempsey\n-\nEloise Smyth\nHarlots is a period drama series set in 18th-century London, focusing on the lives of women who work in the city's brothels. The series stars Samantha Morton, Lesley Manville, and Jessica Brown Findlay, and explores themes of power, family, and survival in a patriarchal society. The show provides a gritty depiction of the struggles and complexities faced by women in the sex trade industry during that era.\nSamantha Morton) as she struggles to juggle both running a brothel and looking after her children. With the odds already stacked against her, the sudden attack of a rival madam puts Wells’ career, family, and life at risk, with her chances of survival seeming slim.\nThis period drama from creators Moira Buffini and Alison Newman follows the steadfast Margaret Wells (A wonderful example of a series that gets better and better as episodes go by, Harlots is a gem of a TV show that puts emphasis on the fine details. Each character, leaping with humane abandon from the page to the screen, is a swirling look at a range of tricky emotions, with the actors playing them clearly thriving thanks to just how multi-dimensionally they have been penned. Each episode feels like it has a large budget, such is the technical excellence in the cinematography, with many considering this the hidden dark cousin to the Netflix phenomenon Bridgerton. - Jake Hodges\n'Letterkenny' (2016 - 2023)\nIMDb: 8.6/10\n- Release Date\n- 2018 - 2023-00-00\n- Showrunner\n- Jared Keeso\n- Directors\n- Jacob Tierney\n- Writers\n- Jared Keeso\nCast\n-\nJared Keeso\n- Seasons\n- 12\nThis award-winning Canadian comedy takes place in the titular Letterkenny, a rural Ontario community populated largely by Irish immigrants. Over the course of 12 seasons, the show discusses all sorts of small-town dramas, such as local sports, politics, and drug problems, with the narrative mainly circling siblings Wayne (Jared Keeso) and Katy (Michelle Mylett), who work on local farmland and sell produce with the help of their friends.\nAlways funny and often poignant, Letterkenny is a powerful subversion of a long-held stereotype depicting small-town residents as being unintelligent, with the fast-paced, witty dialogue on display in the show akin to something out of a political satire. Part of the series’ unique attraction is the juxtaposition of the seemingly trivial small-town dramas and the philosophical wonderings the cast of characters seem to associate with them. Both Jared Keeson and Michelle Mylett are comedic gold throughout the show’s many episodes, with Letterkenny’s fanbase a resolute one that will likely go from strength to strength as the series ages like a fine wine. - Jake Hodges\n'Only Murders in the Building' (2021 - Present)\nRotten Tomatoes: 100% | IMDb: 8.1/10\n- Release Date\n- August 31, 2021\n- Network\n- Hulu\n- Showrunner\n- John Hoffman\n- Directors\n- Jamie Babbit, John Hoffman, Cherien Dabis, Chris Koch, Robert Pulcini, Shari Springer Berman, Adam Shankman, Don Scardino, Jesse Peretz, Jessica Yu, Jude Weng, Chris Teague\n- Writers\n- Ben Smith, Matteo Borghese, Rob Turbovsky, Kristin Newman, Madeleine George, J. J. Philbin, Ben Philippe, Kirker Butler, Jake Schnesel, Peter Swanson, Stephen Markley, Rachel Burger, Kenny Schwartz, Rick Wiener, Valentina Garza, Elaine Ko, Tess Morris, Kim Rosenstock, Sas Goldberg, Thembi Banks\nCast\n-\nCharles-Haden Savage\n-\nOliver Putnam\n- Seasons\n- 5\nSteve Martin) as he lives in his apartment in the famous Arconia. One day, Charles’ life changes as a murder takes place in the very building in which he lives, eventually leading him to meet and develop an unlikely friendship with two of his neighbors, Oliver (Martin Short) and Mabel (Selena Gomez). After bonding over their fondness for a true crime podcast, the trio craft the wacky plan to create one of their own. But rather than dig up a cold case, they are going to tackle the very murder investigation that is ongoing in their building right now.\nThis worldwide hit initially follows the mundane, routine-heavy life of washed-up actor Charles (Only Murders in the Building has been a global hit for many reasons, not least due to the stunning performances of each of the lead cast, who all seamlessly blend moments of tense drama and whimsical comedy. Famous for bringing in some of Hollywood’s best-loved faces in cameo roles and beyond (here’s looking at you, Meryl Streep and Paul Rudd), the show is both the perfect series for a modern viewership as well as one not afraid to satirize its own audience, with the very concept of the in-world true-crime podcast tackled with a cheeky subtextual wink. - Jake Hodges\n'Dopesick' (2021)\nRotten Tomatoes: 89% | IMDb: 8.6/10\nFrom the mind of Empire’s Danny Strong, Dopesick sets itself firmly inside the maelstrom of tragedy that is America’s opioid epidemic. By analyzing how widespread addiction affects everyone, from large conglomerates down to small family units, the show takes a particular interest in the legal case against Purdue Pharma and their development and sale of OxyContin.\nMuch like its subject matter, Dopesick is a frankly addictive miniseries that manages to wrap the audience around its little finger over eight gripping episodes. Although based in reality, the overarching story of Dopesick allows creative liberties in the retelling of this issue, which only furthers the dramatic tension that is felt from the narrative content and opens more eyes to the real-life horrors felt by the opioid epidemic. Captivating and heartbreaking while featuring a masterful performance by Michael Keaton, Dopesick is well worth a watch. - Jake Hodges\n'Atlanta' (2016 - 2022)\nRotten Tomatoes: 98% | IMDb: 8.6/10\n- Release Date\n- 2016 - 2022-00-00\n- Network\n- FX\n- Showrunner\n- Donald Glover\n- Directors\n- Donald Glover\n- Writers\n- Donald Glover\n- Seasons\n- 4\nDonald Glover follows Alfred ‘Paper Boi’ Miles (Brian Tyree Henry) on his hunt for success in the burgeoning hip-hop scene in the titular Atlanta. Managed by his cousin, Miles must strike a balance between his life on the streets and his life in the studio, with the lines seemingly being continually blurred.\nThis blend of comedy, music, and drama created and starringA seven-time Primetime Emmy winner, Atlanta manages to find harmony between a range of genres as each episode weaves between moments of side-splitting laughter, indulgent music, and gripping drama. Not simply providing a detailed analysis of the hip-hop scene, Atlanta also offers sociopolitical commentary in nuanced abundance, with Donald Glover’s always-fascinating view of the world on display in all its glory. Featuring a plethora of absorbing performances, Atlanta is hip-hop television at its best. - Jake Hodges\n'The Great' (2020 - 2023)\nRotten Tomatoes: 96% | IMDb: 8.2/10\n- Release Date\n- 2020 - 2023-00-00\n- Showrunner\n- Tony McNamara\n- Directors\n- Tony McNamara\n- Writers\n- Tony McNamara\nCast\n-\nSacha Dhawan\n-\nAdam Godley\n- Seasons\n- 3\nElle Fanning), from her days as a child through to her rise to the top of Russia’s monarchy. After marrying Nicholas Hoult’s Emperor Peter III, her life at the peak of power comes into swift jeopardy as news of a revolt finds the pair, causing a panicked scramble to save the Emperor’s life and restore order to their kingdom.\nSet in 18th-century Russia, this black comedy from Tony McNamara follows the life of Catherine the Great (Stylish, sophisticated, and devilishly funny, The Great is a wonderful period drama with no interest in accurately detailing its history, making it all the more captivating. Both Nicholas Hoult and Elle Fanning feel born to play the ruling duo, with Fanning being rightfully nominated for Best Actress at the Primetime Emmys. The dialogue is always full of quirks, with the tonal sense of spontaneity in the script only bettered by the twisting plot. - Jake Hodges\n'Castle Rock' (2018 - 2019)\nRotten Tomatoes: 88% | IMDb: 7.5/10\n- Release Date\n- 2018 - 2019-00-00\n- Showrunner\n- Dustin Thomason\n- Directors\n- Dustin Thomason\n- Writers\n- Dustin Thomason\n- Seasons\n- 2\nStephen King (endearingly dubbed the Stephen King multiverse), this series is set in the fictional Maine town of Castle Rock, a place that appears in much of King’s work and provides a story that blends a plethora of his best love tales and characters. The shocking scale of darkness in Castle Rock is seen and analyzed through the eyes of André Holland’s Henry Matthew Deaver, who once fled the town after being suspected of killing his father but now returns thanks to an unexpected request.\nBased on the stories ofCastle Rock is a beautiful ode to the mind of one of modern horror’s most influential writers, with each of the episodes managing to pack in so many witty nods and clever references it could fill Shawshank. Visually, the series is stunning thanks to its eye for the gothic, with executive producer J.J. Abrams’ involvement clearly supporting an aesthetically delightful final product. Tonally dark and narratively enticing, Castle Rock is fun for any fans or non-fans of King alike. - Jake Hodges\n'Solar Opposites' (2020 - Present)\nRotten Tomatoes: 98% | IMDb: 8.0/10\n- Release Date\n- 2020 - 2025-00-00\n- Network\n- Hulu\n- Showrunner\n- Justin Roiland\n- Directors\n- Bob Suarez, Kim Arndt, Lucas Gray\n- Writers\n- Josh Bycel, Danielle Uhlarik, Dominic Dierkes, Joe Saunders, Jen McCartney, Ariel Ladensohn, Matthew Libman, Aliki Theofilopoulos, Matt McKenna, daniel libman, Scott Gallopo, Sean O'Connor, Garrick Bernard\nCast\n-\nTerry (voice)\n-\nSean GiambroneYumyulack (voice)\n-\nMary MackJesse (voice)\n-\nSagan McMahanThe Pupa (voice)\n- Seasons\n- 6\nThomas Middleditch’s Terry and Justin Roiland’s Korvo (and their two Replicants), who fled their home planet of Shlorp after an asteroid hit, leading them to crash land on Earth. Needing to build a new life for themselves on an unknown planet, the gang soon falls into suburban American life, struggling to come to terms with just how many ups and downs this mad world comes with.\nThis quirky animated comedy follows the lives of a duo of extra-terrestrials,A tonal sister series to Rick and Morty, especially considering creator Justin Roiland’s involvement in the creation of both, Solar Opposites is a family-friendly animated adventure with a host of fun characters. Each episode breezes by with whimsy and plenty of comedic styling, but the show doesn’t simply rest on its gags, also providing a heartfelt story of finding your identity in a new environment. Visually rich and tonally heartwarming, Solar Opposites is a great proponent for the success of modern animated TV. - Jake Hodges\n'Normal People' (2020)\nRotten Tomatoes: 91% | IMDb: 8.4/10\n- Release Date\n- 2020 - 2019\n- Network\n- BBC\n- Showrunner\n- Alice Birch\n- Directors\n- Lenny Abrahamson\n- Writers\n- Alice Birch\nCast\n-\nDaisy Edgar-Jones\n- Seasons\n- 1\nThis Irish romantic drama miniseries follows the relationship between Marianne Sheridan (Daisy Edgar-Jones) and Connell Waldron (Paul Mescal) from secondary school all the way through to their time at university. Since meeting as childhood sweethearts, the pair engage in an on/off relationship ready to rival the most complicated of ‘situationships.' The pair are burdened by their own set of familial traumas they must soon tackle head-on as they both navigate the trials and tribulations of coming-of-age in a modern world that looks set to tear their hopeful relationship apart.\nA fresh, modern, and stylish look at 21st-century relationships, Normal People is a relatable tale of the hazards of the current world that makes stars of its central pair. Regarded as one of the best shows of the past decade, the show won four Primetime Emmys thanks to its crafting of a nuanced modern couple with a keen eye for gorgeous cinematography. By exploring a swirling range of human emotions, Normal People both breaks and warms hearts in equal and glorious abundance. - Jake Hodges\n'Veronica Mars' (2004 - 2019)\nRotten Tomatoes: 91% | IMDb: 8.4/10\n- Release Date\n- 2004 - 2019\n- Network\n- UPN, The CW, Hulu\n- Showrunner\n- Rob Thomas\n- Directors\n- John T. Kretchmer, Nick Marck, Michael Fields, Harry Winer, Jason Bloom, Steve Gomer, Guy Norman Bee, Marcos Siega, Mark Piznarski, Sarah Pia Anderson, Scott Winant, Dan Etheridge, David Barrett, Joaquin Sedillo, Kevin Bray, Martha Mitchell, Nick Gomez, Rick Rosenthal, Tessa Blake, Tricia Brock, Amanda Marsalis\n- Writers\n- John Enbom, Phil Klemmer, Dayna Lynne North, Jed Seidel, Aury Wallington\nCast\n-\nVeronica Mars\n-\nEnrico ColantoniKeith Mars\n- Seasons\n- 4\nThe role that put Kristen Bell into mainstream minds, Veronica Mars stars the Frozen actress in the titular role as her town of Neptune, California, is brought to a standstill after a local high-school student dies. After Veronica’s father, Keith (Enrico Colantoni), the town sheriff, starts accusing the victim’s family, he is ousted from his position after community backlash, with Veronica deciding to step up to the plate and take on the investigation herself as she goes from popular high-schooler to criminal investigator.\nArguably Kristen Bell’s most iconic role to date, Veronica Mars is a fun, family-friendly mystery that unravels with a maturity usually saved for adult audiences. With each clue slowly revealed, the edge-of-your-seat episodes fly by thanks to intelligent pacing and a set of scripts with an eye for detail. Always entertaining, Veronica Mars is a series that will likely outlast many others in its genre as it continues to entice new generations of fans. - Jake Hodges\n'Shrill' (2019 - 2021)\nRotten Tomatoes: 88% | IMDb: 7.4/10\n- Release Date\n- 2019 - 2021-00-00\n- Network\n- Hulu\n- Directors\n- Andrew DeYoung\nCast\n-\nDana MillicanKim\n-\nJeb BerrierDave\n-\nTommy SniderMike\n-\nAnnie\n- Seasons\n- 3\nAidy Bryant), who dreams of one day becoming a successful journalist. Unfortunately, the world around Annie has decided that, because of her size, she shouldn’t fit in socially — a fate Annie struggles to deal with while also attempting to stay proud of her body. Alongside societal expectations, Annie must also deal with a troubled family setup and an unlucky dating life. Can she fight the unfair expectations put on her and find the self-confidence she surely deserves?\nThis Primetime Emmy-nominated comedy follows young Annie (Funny, heartwarming, and packed full of important messaging, Shrill is one of the strongest comedies to have been released in the last few years. Aidy Bryant neatly finds the nuance between a thriving, confident woman and an example of the societal weight placed on modern young people to fit in. Although, on its surface, it is about body confidence, each episode is full of the will to strive for self-confidence in general, with it nigh-on impossible to not feel awash with a reinvigorated love for life once the credits on the finale roll. - Jake Hodges\n'PEN15' (2019 - 2021)\nRotten Tomatoes: 97% | IMDb: 8.1/10\n- Release Date\n- 2019 - 2020\n- Showrunner\n- Anna Konkle\n- Writers\n- Anna Konkle\nCast\n-\nTaj Cross\n-\nRichard Karn\n-\nMelora Walters\n- Seasons\n- 2\nMaya Erskine’s Maya and Anna Konkle’s Anna as they play 13-year-old versions of themselves and navigate middle school together. Surrounded by real 13-year-olds, the pair are shunted into social outcast status as they relive the haunting dog-eat-dog world of young adolescents in academia.\nThis awkward teen comedy is set at the turn of the millennium and followsAn offbeat comedic gem, PEN15 (named after the classic prank played on kids at school) is the winning combination of an innovative premise and two intelligent and funny lead actors in Erskine and Konkle. Both of the superb performers deserve an enormous amount of credit for managing to portray what is an incredibly unique acting challenge as adults pretending to be children without ever straying into immaturity and always casting an honest light on the difficulties of that age. Punchy, touching, and forever in-your-face, PEN15 is unlike anything you’ve seen before. - Jake Hodges\n'Better Things' (2016 - 2022)\nRotten Tomatoes: 98% | IMDb: 7.9/10\nBetter Things, created by Pamela Adlon and Louis C.K., follows the former as single mother Sam Fox, who struggles with the trials of raising three patience-testing children on her own. If that wasn’t challenging enough for Sam, she is also a working actress, with the deafening difficulties of modern Hollywood vying for the title of ‘toughest part of her life.' With her chances of peace stacked against the odds, will Sam be able to successfully juggle the whirlwind branches of her life?\nBacked by a strong ensemble cast,A funny, thought-provoking series full of a host of top performances, Better Things is a better thing thanks to Pamela Adlon’s relatable lead performance. What makes this series stand above many of its peers is its determination to not have the strong, wild women at its heart turn to men for the solution to their problems — a trope seen so often in shows of this nature. Better Things is not simply a series for women, though, with the whole spectrum of the modern human experience neatly summarized by the often impossible situations the characters seem to fall into. Emotionally captivating as well as devilishly funny, Better Things will make you laugh and cry. - Jake Hodges\n'The X-Files' (1993 - 2018)\nRotten Tomatoes: 74% | IMDb: 8.6/10\n- Release Date\n- 1993 - 2018-00-00\n- Network\n- FOX\n- Showrunner\n- Chris Carter\n- Directors\n- Rob Bowman, David Nutter, R. W. Goodwin, Michael W. Watkins, Tony Wharmby, Daniel Sackheim, Michael Lange, Cliff Bole, David Duchovny, Jim Charleston, James Wong, Peter Markle, Rod Hardy, Thomas J. Wright, William A. Graham, Jerrold Freedman, Joe Napolitano, Kevin Hooks, Larry Shaw, Richard Compton, Tucker Gates, Allen Coulter, Barry K. Thomas, Brett Dowler\n- Writers\n- jeffrey bell, Frank Spotnitz, Howard Gordon, David Amann, Darin Morgan, Steven Maeda, Greg Walker, Chris Ruppenthal, Kim Newton, Paul Brown, Sara B. Cooper, Thomas Schnauz, Tim Minear, William Gibson, Jeff Vlaming, Charles Grant Craig, Chip Johannessen, Chris Brancato, Daniel Arkin, Gillian Anderson, Jessica Scott, Jim Guttridge, Kenneth Biller, Larry Barber\n- Franchise(s)\n- The X-Files\nCast\n-\nFox Mulder\n-\nDana Scully\nTwo F.B.I. Agents, Fox Mulder the believer and Dana Scully the skeptic, investigate the strange and unexplained, while hidden forces work to impede their efforts.\n- Main Genre\n- Sci-Fi\n- Seasons\n- 11\nOne of the most successful sci-fi shows of all time, The X-Files follows the mysterious professional lives of two FBI agents, the iconic Fox Mulder (David Duchovny) and Dana Scully (Gillian Anderson). As a duo, Mulder and Scully work for the titular X-Files branch of the FBI, charged with investigating the unknown and supernatural. Surrounded by a host of unexplained events, Mulder invests himself in the alien potential of the cases, whereas Scully prefers to stay skeptical — a combination that proves to be TV gold.\nA perfect recipe for sci-fi success, The X-Files is brooding, action-packed, and never shy of providing a few nightmarish visuals. Although the show is now over 30 years removed from its debut, each episode still holds up thanks to a team of writers intent on not just bringing strong sci-fi but also captivating drama to the small screen. It would be remiss of me to not mention both Duchovny and Anderson when talking about The X-Files’ success, are they are still considered one of television’s best duos. With impressive special effects, masterful lead performances, and stories that are still talked of to this day, The X-Files is ready and waiting to be indulged in all its gory alien glory. - Jake Hodges\n'The Handmaid’s Tale' (2017 - Present)\nRotten Tomatoes: 83% | IMDb: 8.4/10\n- Release Date\n- 2017 - 2025-00-00\n- Network\n- Hulu\n- Showrunner\n- Bruce Miller\n- Directors\n- Mike Barker, Kari Skogland, Daina Reid, Reed Morano, Floria Sigismondi, Jeremy Podeswa, Kate Dennis, Richard Shepard, Amma Asante, Christina Choe, Deniz Gamze Ergüven, Bradley Whitford, Dearbhla Walsh, Liz Garbus\n- Writers\n- Kira Snyder, Eric Tuchman, Yahlin Chang, John Herrera, Jacey Heldrich, Dorothy Fortenberry, Marissa Jo Cerar, Lynn Renee Maxcy\nCast\n-\nJune Osborne / Offred / Ofjoseph\n-\nSerena Joy Waterford\n- Seasons\n- 6\nElisabeth Moss, The Handmaid’s Tale is set in an alternate USA after a religious autocracy has taken charge and follows the aforementioned actress as June, a woman captured by a totalitarian government and forced into being a handmaid. With an entire political and social system designed to keep her quiet, June is forced to spend her entire existence being made to bear children for childless politicians.\nStarring the incredibleWinner of a staggering 15 Primetime Emmys, The Handmaid’s Tale is a daunting look at a world that feels both scarily futuristic and dangerously relatable at the same time. The plot is eerily dark, with June’s descent into the pits of despair where her entire identity is removed (even her name is changed to Offred) a sometimes harrowing watch. However, the series is also emotionally powerful, making many in its audience feel like they need to stand up and be counted before it's too late. Gripping, poignant, and full of stunning performances, The Handmaid’s Tale is much more than simple viewing — it's a visceral, gutwrenching, and unforgettable experience. - Jake Hodges\n'Firefly' (2002 - 2003)\nRotten Tomatoes: 77% | IMDb: 9.0/10\n- Release Date\n- 2002 - 2003-00-00\n- Network\n- FOX\n- Showrunner\n- Joss Whedon\n- Directors\n- Allan Kroeker, David Solomon, James A. Contner, Marita Grabiak, Michael Grossman, Tim Minear, Vern Gillum\n- Writers\n- Cheryl Cain, Drew Z. Greenberg, Jane Espenson\nCast\n-\nMal Reynolds\n-\nGina TorresZoë Washburne\n- Seasons\n- 1\nThis beloved sci-fi series follows former galactic war veteran Captain Malcolm 'Mal' Reynolds (Nathan Fillion), now the captain of the transport ship Serenity, as he and his crew travel across space. However, the crew’s professional lives are made harder for them by their choice to take on both legal and illegal tasks, with various dangerous factions and authority agents hell-bent on capturing them. How will they survive the furious intent of so many opponents?\nThe perfect definition of a cult classic, Firefly is a swirling, beautiful, out-of-this-world sci-fi adventure with all the trimmings. Supported by an excellent cast of quirky characters, the story moves at a perfect pace, bringing both exciting action sequences and detailed character development in abundance. The show’s special effects are a tremendous effort, seeing as it is now over 20 years old, with the only downside to one of television’s most adored sci-fi shows being its singular season, with many calling its cancellation a modern tragedy. - Jake Hodges\n'Baskets' (2016 - 2019)\nRotten Tomatoes: 92% | IMDb: 7.6/10\nThe Hangover’s Zach Galifianakis, Baskets tells the story of Chip Baskets, a hopeful man with a dream of moving to Paris and becoming a classically trained French clown. However, after failing to adapt to the culture and the language and facing financial ruin, Baskets must move back to Bakersfield, California, and face failure head-on.\nCo-created by and starringAn innovative series starring an ensemble of perfectly cast comedic icons, Baskets is like nothing you have seen before. Zach Galifianakis is known for his eccentric brand of comedy, with this series a 40-episode showcase of some of his best work. Each episode is brimming with biting satire and devilish dark comedy, with the juxtaposition of the desperate failure of the protagonist and the hilarious situations he gets himself into a perfect allegory for the centuries-old genius behind the art of clowning. - Jake Hodges\n'Fargo' (2014 - Present)\nRotten Tomatoes: 94% | IMDb: 8.9/10\n- Release Date\n- 2014 - 2024-00-00\n- Network\n- FX\n- Showrunner\n- Noah Hawley\n- Writers\n- Noah Hawley\n- Franchise(s)\n- Fargo\nCast\n-\nAllison Tolman\nVarious chronicles of deception, intrigue, and murder in and around frozen Minnesota. All of these tales mysteriously lead back one way or another to Fargo, North Dakota.\n- Main Genre\n- Drama\n- Seasons\n- 5\nCoen Brothers movie of the same name, Fargo chronicles various tales of murder and mystery in the snowy climate, with each of the nail-biting stories in some way linked to the titular city in North Dakota. Littered with references to the original film, Fargo features a slew of dark puzzles among a sea of shocking criminal activity across five critically acclaimed seasons.\nInspired by the cult classicThe winner of multiple Primetime Emmys and Golden Globes, Fargo is both a refreshing crime thriller with an eye for comic wit and a touching ode to the charm of the original, with the Coen Brothers actually recruited to executive produce. Each episode feels like guaranteed explosive entertainment, with the frozen backdrop making for some of modern television’s most striking visuals. Funny, fast, and devilishly intelligent, Fargo is beloved by millions for good reason. - Jake Hodges\n'The Last Man on Earth' (2015 - 2018)\nRotten Tomatoes: 85% | IMDb: 7.4/10\n- Release Date\n- 2015 - 2018-00-00\n- Network\n- FOX\n- Showrunner\n- Dan Sterling\n- Directors\n- Christopher Miller\n- Writers\n- Christopher Miller\nCast\n-\nMel Rodriguez\n- Seasons\n- 4\nWill Forte, The Last Man on Earth delivers on the title’s promise, with the aforementioned Forte playing Phil Tandy Miller, the last person alive following a world-ending virus… or so he thinks. After praying for some company for so long, Phil gets much more than he bargained for when he meets the other strange, eccentric, and apocalypse-weary survivors and soon remembers the hells of social interaction back when Earth was populated.\nCreated by and starringAn intelligent comedy with a premise many have often dreamt about, The Last Man on Earth is the sort of show that is destined to deliver. Each episode is packed with wit and whimsy, with Will Forte clearly understanding his strengths as a comic actor and championing them at any available opportunity. Featuring a stellar ensemble cast, Kristen Schaal is particularly delightful as Carol — a role written by Forte with her in mind. If you were the last person on Earth, this would be a great way to spend your time. - Jake Hodges\n'Buffy the Vampire Slayer' (1997 - 2003)\nRotten Tomatoes: 85% | IMDb: 8.3/10\n- Release Date\n- 1997 - 2003\n- Network\n- The WB\n- Showrunner\n- Joss Whedon\n- Directors\n- Joss Whedon\n- Writers\n- Joss Whedon\nCast\n-\nBuffy Summers\n-\nNicholas BrendonAlexander Harris\nA young woman, destined to slay vampires, demons and other infernal creatures, deals with her life fighting evil, with the help of her friends.\n- Seasons\n- 7\nA show with an enormous and justified fanbase, Buffy the Vampire Slayer stars Sarah Michelle Gellar as the titular Buffy, a young girl destined to do exactly as the title suggests and slay vampires. Alongside her best friends, the group endearingly refer to themselves as “The Scooby Gang” (ironic, as Gellar would later go on to play Daphne in the live-action Scooby-Doo movies) as they face the demonic challenges of both apocalyptic creatures and the angst-ridden world of high school.\nAction-packed and full of heart, Buffy the Vampire Slayer cleverly uses its supernatural horrors to provide an allegory for the hormonal nightmare that is academic and social adolescence. Over the course of seven seasons, the show provides an abundance of thrilling, other-worldly set pieces, incredible visual and practical effects, and an array of gripping, relatable storylines suitable for a wide range of audiences. Considered by its millions of fans as one of the best television shows of all time, Buffy the Vampire Slayer is the sort of series you have to watch at least once in your life. - Jake Hodges",
  "word_count": 16979,
  "scraped_at": "2026-02-14T12:47:35.690150"
}