{
  "article_id": "8333d2676633",
  "url": "https://news.yahoo.com/2023-movies-films-preview-most-anticipated-184343585.html",
  "title": "2023 movie preview : Our 40 most anticipated films",
  "date": "20230106T191500Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "2023 movie preview: Our 40 most anticipated films\nFrom the \"Guardians of the Galaxy\" and \"Indiana Jones\" to \"Barbie\" and \"Magic Mike,\" Yahoo Entertainment ranks 40 flicks we're most looking forward to this year.\nGuardians of the Galaxy. Indiana Jones. Fast and Furious. Dune. Aquaman. Ant-Man. Magic Mike. Mission: Impossible. Transformers. Shazam! Scream. The Exorcist.\nThere’s rarely a year with any shortage of new installments in major franchises hitting big screens, but 2023 is stuffed to the gills (speaking of Arthur Curry) with them.\nFret not, fans who clamor for more originality in their cinema. There are also highly anticipated releases from Martin Scorsese (Killers of the Flower Moon), Christopher Nolan (Oppenheimer), David Fincher (The Killer), Ridley Scott (Napoleon) and Wes Anderson (Asteroid City).\nAnd have we mentioned Greta Gerwig made an insane-looking Barbie movie?\nHere are the 40 flicks we’re most looking forward to in 2023.\n40. Blue Beetle\nRelease date: Aug. 18\nDirected by: Angel Manuel Soto\nStarring: Xolo Maridueña, George Lopez, Susan Sarandon\nThe Scoop: Originally slated to follow Leslie Grace’s scrapped Batgirl feature onto HBO Max, the inaugural adventure of Jaime Reyes aka Blue Beetle — played by breakout Cobra Kai star Xolo Maridueña — is instead headed to theaters. That promotion suggests that Warner Bros. sees late-summer hit potential in the alien-tech powered teen crimefighter, who is the first Latino hero to be front and center in a DC movie. The fact that DC Studios’s new co-head, Peter Safran, is one of the producers on the movie, strongly suggests that Jaime will be one of the few heroes to survive the upcoming DC Extended Universe purge.\n39. Knock at the Cabin\nRelease date: Feb. 3\nDirected by: M. Night Shyamalan\nMore in Entertainment\nWhoopi Goldberg struggles to sit at “The View” table during painful discussion: 'I'm out'\nStarring: Jonathan Groff, Ben Aldridge, Dave Bautista, Rupert Grint, Nikki Amuka-Bird, Abby Quinn\nThe scoop: M. Night Shyamalan has long been one of the greatest masters of contemporary suspense, but with the buzzy preview for his 11th feature in the genre, he also proved a master of the tease. All we know is this: A married couple (Jonathan Groff and Ben Aldridge) and their daughter are vacationing at a cabin in the woods when they’re besieged and held hostage by a group of four strangers and told they must make a “horrible decision” to prevent the apocalypse. But what’s the decision?! If you can’t wait until Feb. 3 you could always give the book it’s based on, Paul Tremblay’s The Cabin at the End of the World, a read for an answer — or at least clues.\n38. Teenage Mutant Ninja Turtles: Mutant Mayhem\nRelease date: Aug. 4\nDirected by: Jeff Rowe\nStarring: TBA\nThe Scoop: The Superbad and Sausage Party duo of Seth Rogen and Evan Goldberg head back to the sewers as the producers of the first animated feature starring the butt-kicking heroes in a half shell since 2007’s TMNT. While the movie’s plot and vocal cast remains under wraps, Rogen has previously said that it will emphasize the “teenage” part of Teenage Mutant Ninja Turtles. We have to assume that means a Turtle Power TikTok.\n37. Showing Up\nRelease date: Spring 2023\nDirected by: Kelly Reichardt\nStarring: Michelle Williams, Hong Chau, John Magaro\nThe Scoop: From Wendy and Lucy to Certain Women, Michelle Williams and Kelly Reichardt have quietly become one of the best actor/director pairings around. Their ongoing collaboration continues to bear artistic fruit with Showing Up, the richly nuanced story of a frustrated sculptor (Williams) who tries to pursue her art while also dealing with the mundane challenges of everyday life. Look for 2022’s best scene-stealer, Hong Chau, to show up in another standout supporting turn.\n36. Next Goal Wins\nRelease date: Sept. 22\nDirected by: Taika Waititi\nStarring: Michael Fassbender, Oscar Kightley, David Fane, Will Arnett, Elisabeth Moss\nThe scoop: Taika Waititi looks to rebound from the coolly received (though vastly underrated, in our humble opinion) Thor: Love and Thunder with his first non-Marvel cinematic undertaking since 2019’s Jojo Rabbit. It’s an inspirational sports drama/comedy (are there any other kind?) about the true story of a Dutch-American coach’s efforts to help lead the underdogs of all underdogs, the American Samoa national football (soccer) squad — a team that once lost 31-0 to Australia — to the 2014 World Cup.\n35. Dungeons & Dragons: Honor Among Thieves\nRelease date: March 31\nDirected by: Jonathan Goldstein and John Francis Daley\nStarring: Chris Pine, Michelle Rodriguez, Justice Smith, Hugh Grant, Regé-Jean Page\nThe Scoop: Hollywood takes another roll of the (20-sided) dice at adapting the beloved tabletop game, which has previously been an animated series and a widely-derided movie. But this new iteration has something its predecessors didn’t: Hollywood’s best Chris — that would be Chris Pine — as a dancing, scheming Bard. It doesn’t hurt that co-director John Francis Daley has actual D&D experience, which counts as a bonus action in this big-budget fantasy adventure.\n34. Luther: The Fallen Sun\nRelease date: March 2023\nDirected by: Neil Cross\nStarring: Idris Elba, Cynthia Erivo, Andy Serkis\nThe Scoop: The name’s Luther — John Luther. After multiple short-run TV series, Idris Elba’s crime-stopping, coat-rocking alter ego scores his first feature film, which picks up where the dogged detective left off… in jail. But Luther’s demons resurface after his release as the specter of an old case hangs over his latest investigation. As for whether or not we’ll get an Alice Morgan sighting, go ask Ruth Wilson. We think she’ll know.\n33. Spaceman\nRelease date: TBA\nDirected by: Johan Renck\nStarring: Adam Sandler, Paul Dano, Carey Mulligan, Kunal Nayyar\nThe scoop: We don’t know too much about this Netflix sci-fi drama, besides that it’s based on a Colby Day novel (Spaceman of Bohemia) about a Czech astronaut sent on a solo mission to space where he befriends a giant arachnid. But we know this much: It’s Adam Sandler flexing his drama chops again, and the man simply does not miss (Punch-Drunk Love, The Myerowitz Stories, Uncut Gems, Hustle) when he gets serious.\n32. Scream 6\nRelease date: March 10\nDirected by: Matt Bettinelli-Olpin, Tyler Gillett\nStarring: Melissa Barrera, Jenna Ortega, Hayden Panettiere, Courteney Cox, Samara Weaving\nThe scoop: There hasn’t been this much excitement for a horror franchise to move to New York City since Jason took Manhattan. The popular slasher franchise’s much-hype relocation from Woodsboro to the Big Apple should help ease the blow of losing Neve Campbell, who left the series over a contract dispute. Back, however, is Scream 4’s Hayden Panettiere, plus the newbies from the early 2022 hit Scream (aka Scream 5), including red-hot Wednesday star Jenna Ortega.\n31. 65\nRelease date: March 17\nDirected by: Scott Beck and Bryan Woods\nStarring: Adam Driver, Ariana Greenblatt, Nika King\nThe Scoop: Looks like Adam Driver’s next destination is long, long ago on a planet not-so-far away. The Star Wars veteran plays a pilot who discovers he’s crash-landed on prehistoric Earth in the new film from A Quiet Place scribes, Scott Beck and Bryan Woods. Now, Driver’s got to dodge dinosaurs and other millennia-old dangers without the aid of a lightsaber or any Force powers. In deep trouble, he is.\n30. The Super Mario Bros. Movie\nRelease date: April 7\nDirected by: Aaron Horvath and Michael Jelenic\nStarring: Chris Pratt, Anya Taylor-Joy, Charlie Day, Jack Black\nThe Scoop: Wahoo! Nintendo’s adventurous plumber scores his first big-screen cartoon, and made sure to bring all of his Mushroom Kingdom friends — and foes — along for the ride. While Chris Pratt’s non-Italian voice has dominated much of the pre-release conversation, the early trailers have steadily won over audiences, teasing lots of deep-cut jokes and Jack Black’s spot-on heel turn as the big bad Bowser. Color us cautiously optimistic that a hit Super Mario movie isn’t in another castle.\n29. Transformers: Rise of the Beasts\nRelease date: June 9\nDirected by: Steve Caple Jr.\nStarring: Anthony Ramos, Dominique Fishback, Peter Cullen\nThe Scoop: That ’90s Show isn’t 2023’s only dose of grunge-era nostalgia. The latest Transformers adventure takes place in 1994, when robot beasts roamed the Earth … specifically in Brooklyn. In the Heights star Anthony Ramos plays the latest human that gets to ride along with the Autobots and their bestial counterparts in disguise as they battle the villainous Predacons and Terrorcons. You know what they say — no sleep ’til Cybertron.\n28. Cocaine Bear\nRelease date: Feb. 24\nDirected by: Elizabeth Banks\nStarring: Keri Russell, O’Shea Jackson Jr., Alden Ehrenreich, Ray Liotta\nThe scoop: All these movies are exciting, but let’s face it — none has a better title or premise than the dark-comedy horror Cocaine Bear. There’s also no film title more hilariously on the nose: A black bear ingests an absurd amount of cocaine (dropped into the woods from a drug runner’s plane crash), then goes on a coke-fueled tear, eating up any human he can get his massive paws on. The best part? It’s all “inspired” by a true story in 1985.\n27. Untiled The Exorcist film\nRelease date: Oct. 13\nDirected by: David Gordon Green\nStarring: Ellen Burstyn, Leslie Odom Jr., Ann Dowd\nThe Scoop: Having previously resurrected Michael Myers for his just-concluded Halloween trilogy, David Gordon Green now turns his attention towards Pazuzu. The as-yet untitled Exorcist reboot kicks off another three-movie series that will haunt both theaters and Universal’s struggling streaming service, Peacock. And since Green convinced Jamie Lee Curtis to take a Halloween victory lap, you’d better believe that he’s getting an O.G. Exorcist star to return as well: Ellen Burstyn will reprise her bruising role as Chris MacNeil in the first film.\n26. Wish\nRelease date: Nov. 22\nDirected by: Chris Buck, Fawn Veerasunthorn\nStarring: Ariana DeBose, Alan Tudyk\nThe scoop: The warmest and fuzziest fact about Disney Animation Studio’s 62nd release? It comes the year the Mouse House celebrates its centennial (brothers Walt and Roy O. Disney founded the company in 1923). Written by Frozen masterminds Chris Buck and Jennifer Lee, the film follows the 17-year-old Asha (West Side Story Oscar winner Ariana DeBose) through a magical land called Rosas where wishes are known to come true.\n25. The Hunger Games: The Ballad of Songbirds and Snakes\nRelease date: Nov. 17\nDirected by: Francis Lawrence\nStarring: Tom Blyth, Rachel Zegler, Jason Schwartzman, Peter Dinklage, Viola Davis\nThe scoop: Speaking of West Side Story, you know who else is on a tear? Co-lead Rachel Zegler, who enters the DCEU with March’s Shazam! Fury of the Gods before co-heading this prequel to 2012’s YA mega-hit The Hunger Games (and its sequels), based on the 2020 book release by Suzanne Collins. The story follows a young Coriolanus Snow (Billy the Kid’s Tom Blyth), who mentors Zegler’s District 12 tribute Lucy Gray Baird in the 10th Hunger Games long before becoming the much-feared president of Panem.\n24. Magic Mike’s Last Dance\nRelease date: Feb. 10\nDirected by: Steven Soderbergh\nStarring: Channing Tatum, Salma Hayek Pinault, Jemelia George\nThe Scoop: Save the last dance for Channing and Salma. The absurdly attractive duo play lovers and business partners in the third and final installment of Steven Soderbergh’s Magic Mike trilogy, which finds Tatum’s stripper relocating to London to launch a stage version of his old strip club act. Since the first trailer already has the internet hot and bothered, we can only imagine what else Mike & Co. have up their exposed sleeves.\n23. The Color Purple\nRelease date: Dec. 20\nDirected by: Blitz Bazawule\nStarring: Fantasia, Colman Domingo, Taraji P. Henson, Corey Hawkins, H.E.R.\nThe scoop: It’s not just familiar titles in the realms of action and horror coming in 2023. We’ll also get a musical remix of The Color Purple, first brought to Broadway in 2005 and also based on Alice Walker’s seminal 1982 novel (which also inspired Steven Spielberg’s 1985 Oscar-nominated drama). American Idol alum Fantasia plays the lead of Celie Harris in a story that famously depicts the hardships of African American women in the early-1900s, while the star-studded cast also includes Ciara, Halle Bailey, Louis Gossett Jr. and Jon Batiste.\n22. Aquaman and the Lost Kingdom\nRelease date: Dec. 25\nDirected by: James Wan\nStarring: Jason Momoa, Amber Heard, Patrick Wilson\nThe Scoop: This is how the Snyderverse ends… under water. With James Gunn and Peter Safran poised to remake the DC Extended Universe in their image, Aquaman and the Lost Kingdom caps the last run of DC movies made under the previous regime — a list that also includes Shazam: Fury of the Gods and The Flash, which are opening earlier in the year. Since the billion-dollar grossing Aquaman remains the Snyderverse’s most lucrative movie, it’s only fair that Jason Momoa’s aquatic adventurer gets to bring down the curtain with one last adventure. Remember, it ain’t over until the octopus drummer slaps the skins.\n21. Wonka\nRelease date: Dec. 15\nDirected by: Paul King\nStarring: Timothée Chalamet, Keegan-Michael Key, Sally Hawkins, Olivia Colman\nThe scoop: Is Timothée Chalamet the new Johnny Depp? OK, never mind, that’s far too thorny a question these days. The popular Dune actor will, however, be the first actor to play the famed candy tycoon since Depp in Tim Burton’s 2005 Charlie and the Chocolate Factory. It will be tasty to see what direction Chalamet takes with the role (as a younger Wonka, obviously), which of course was most deeply immortalized by Gene Wilder in 1971’s Willy Wonka and the Chocolate Factory.\n20. Spider-Man: Across the Spider-Verse\nRelease date: June 2\nDirected by: Joaquim Dos Santos, Kemp Powers and Justin K. Thompson\nStarring: Shameik Moore, Hailee Steinfeld, Jake Johnson\nThe Scoop: Think you’ve seen every Spider-Person there is to see? Think again. The follow-up to the Oscar-winning Into the Spider-Verse is going to introduce Miles Morales (Shameik Moore) to a plethora of arachnid humanoids taken from every conceivable iteration of Marvel’s wall-crawling hero. But amidst all the Spider-mania, you can expect the same grounded, emotional storytelling that distinguished our previous trip through the Spider-Verse. Also, plenty of ham… Spider-Ham, that is.\n19. Napoleon\nRelease date: TBA\nDirected by: Ridley Scott\nStarring: Joaquin Phoenix, Vanessa Kirby, Tahar Rahim\nThe scoop: It’s somewhat amazing there haven’t been more movies produced about the crusading French military leader Napoleon Bonaparte, given how storied his conquests are in history (Bill and Ted’s Excellent Adventure, aside). Enter Ridley Scott, the tireless 85-year-old who knows a thing or three about historical war epics (Gladiator, Kingdom of Heaven). Playing Bonaparte, meanwhile, in this Apple TV+ film is Joaquin Phoenix, who’s been relatively quiet since laughing his way to an Oscar for 2019’s Joker.\n18. John Wick: Chapter 4\nRelease date: March 24\nDirected by: Chad Stahelski\nStarring: Keanu Reeves, Donnie Yen, Bill Skarsgård\nThe Scoop: Tick tock, Mr. Wick. Keanu Reeves is back and deadlier than ever in the fourth chapter of John Wick’s ongoing saga. Once again, the unstoppable assassin has to find new allies (including Hong Kong superstar Donnie Yen) and face new foes (including ex-Pennywise Bill Skarsgård) as he punches, kicks and shoots his way to freedom. Never fear: He’ll take a licking and keep on Wick-ing.\n17. Rustin\nRelease date: TBA\nDirected by: George C. Wolfe\nStarring: Colman Domingo, Chris Rock, Glynn Turrman, Audra McDonald\nThe scoop: Colman Domingo has slowly but steadily become one of the most respected actors in Hollywood thanks to his potent work in projects like If Beale Street Could Talk, Zola and Euphoria. At long last Domingo gets top billing in Rustin, reteaming with his Ma Rainey’s Black Bottom director George C. Wolfe for this biopic about trailblazing gay civil rights activist Bayard Rustin, who organized the 1963 March on Washington. The last time co-writer Dustin Lance Black told a story like this (2008’s Milk), Sean Penn won an Oscar for it.\n16. The Little Mermaid\nRelease date: May 26\nDirected by: Rob Marshall\nStarring: Halle Bailey, Jonah Hauer-King, Daveed Diggs, Jacob Tremblay, Awkwafina, Javier Bardem, Melissa McCarthy\nThe scoop: Let’s hope the racist outrage from 2022 over Disney casting a Black actress (Halle Bailey) as an, ahem, make-believe mermaid, will have washed over by the time spring arrives. Bailey — best known for being one half of the musical pop duo Chloe x Halle — should thrive as the sea-living songstress Ariel, especially with assists from powerhouse songwriters Alan Menken and Lin-Manuel Miranda. And casting Melissa McCarthy as the evil Ursula is just perfect.\n15. Ant-Man and the Wasp: Quantumania\nRelease date: Feb. 17\nDirected by: Peyton Reed\nStarring: Paul Rudd, Evangeline Lilly, Kathryn Newton, Michael Douglas, Michelle Pfeiffer, Jonathan Majors, Bill Murray\nThe scoop: The Ant-Man movies have officially become family affairs. While the title implies it’s already as much the adventures of Hope van Dyne (Evangeline Lilly) and Scott Lang (Paul Rudd), this time they’ll have Scott’s daughter (Kathyrn Newton) and Hope’s folks (Michael Douglas and Michelle Pfeiffer) in tow as they’re — gasp! — sucked into the Quantum Realm. Also notable: the introduction of Jonathan Majors’s Kang, primed to be the Thanos of Marvel’s Phases 5 and 6, leading at least up to 2025’s Avengers: The Kang Dynasty (and likely 2026’s Avengers: Secret Wars).\n14. Creed III\nRelease date: March 3\nDirected by: Michael B. Jordan\nStarring: Michael B. Jordan, Tessa Thompson, Jonathan Majors\nThe Scoop: Adonis Creed flies solo in the first Rocky-verse movie not to feature Sylvester Stallone’s Philly pugilist. But director/star Michael B. Jordan ensures that his alter ego will still have plenty of heavy hitting drama in his corner, crafting a story that finds Adonis reconnecting with a childhood friend (Jonathan Majors) fresh out of prison and ready for a taste of the heavyweight champ lifestyle. It’s gonna be a grudge match to remember.\n13. Asteroid City\nRelease date: June 23\nDirected by: Wes Anderson\nStarring: Tom Hanks, Margot Robbie, Steve Carell\nThe Scoop: With apologies to MGM, Wes Anderson’s latest bit of whimsey really does contain more stars than there are in heaven. Set in '50s-era America, Asteroid City takes place in a remote desert town where a Junior Stargazer convention has attracted such famous faces as Tom Hanks, Margot Robbie, Jeff Goldblum and Maya Hawke. The only actor not in this movie? Anderson regular, Bill Murray, who had to drop out of the film just before shooting started.\n12. The Marvels\nRelease date: July 28\nDirected by: Nia DaCosta\nStarring: Brie Larson, Teyonah Parris, Iman Vellani, Samuel L. Jackson\nThe scoop: Many a Marvel fan has long clamored for an all-female Avenger meetup. While that might not be in the cards anytime soon, The Marvels is a good start, as Carol Danvers (aka Captain Marvel, played by Brie Larson), Ms. Marvel (Iman Vellani, fresh off the success of last year’s extremely fun Disney+ series) and Monica Rambeau (Teyonah Parris, who also impressed in WandaVision) inexplicably swap places (a premise teased at the very end of Ms. Marvel) until they unite to figure out why. With Candyman helmer Nia DaCosta calling the shots, this one should be marvelous.\n11. Shirley\nRelease date: TBA\nDirected by: John Ridley\nStarring: Regina King, Terrence Howard, Lucas Hedges, André Holland\nThe scoop: A biopic about Shirley Chisholm has seemed inevitable ever since the excellent 2004 documentary Chisholm '72. It took nearly 20 years, but the wait is worth it in our book considering it ultimately put Regina King (who’s just been crushing it in recent years in projects like If Beale Street Could Talk and Watchmen) in a position to play the first Black woman ever elected to U.S. congress.\n10. Mission: Impossible — Dead Reckoning, Part One\nRelease date: July 14\nDirected by: Christopher McQuarrie\nStarring: Tom Cruise, Hayley Atwell, Simon Pegg\nThe Scoop: Buckle up, because the first part of Tom Cruise’s two-movie farewell to the Mission: Impossible franchise is finally ready to blow the doors off of multiplexes after a two-year production filled with COVID delays and crazy stunts. Once again tasked with saving the world, super-agent Ethan Hunt goes on another globetrotting adventure that will bring back old allies and antagonists from past M:I movies, while also introducing newbies like Hayley Atwell’s mysterious badass, Grace. Just think, when this series wraps up, Cruise is gonna have to base jump off of cliffs on his own time and dime.\n9. Maestro\nRelease date: TBA\nDirected by: Bradley Cooper\nStarring: Bradley Cooper, Carey Mulligan, Jeremy Strong, Maya Hawke, Sarah Silverman\nThe scoop: Bradley Cooper clearly caught the directing bug after 2018’s Oscar darling Lady Gaga-team-up A Star Is Born. Five years later he’s directing and starring in again, this time playing the seminal American composer and conductor Leonard Bernstein. Carey Mulligan and Jeremy Strong costar, but the film is arguably even more star-studded behind the scenes, with both Steven Spielberg and Martin Scorsese producing.\n8. Fast X\nRelease date: May 19\nDirected by: Louis Leterrier\nStarring: Vin Diesel, Brie Larson, Jason Momoa, Jason Statham, Alan Ritchson, Rita Moreno\nThe Scoop: It’s (almost) the last ride for Dom Toretto and his familia as the Fast and Furious franchise nears the finish line. After director Justin Lin bailed out of the driver’s seat early on in production, Louis Leterrier stepped in to complete the gang’s penultimate adventure, which introduces Jason Momoa and Brie Larson into the ever-expanding universe. But our favorite franchise addition is EGOT legend Rita Moreno as Dom’s abuela. Obviously, he learned all of his moves from her.\n7. The Killer\nRelease date: TBA\nDirected by: David Fincher\nStarring: Michael Fassbender, Tilda Swinton\nThe scoop: There’s nothing like a dark, gritty, violent David Fincher film (Se7en, Fight Club, The Girl With the Dragon Tattoo), and as much as his last film, 2020’s Mank, had to offer, it was none of those things. Dark Fincher returns with this adaptation of Alex Nolent’s graphic novel series about a mysterious, initially unnamed assassin (here played by Michael Fassbender, who’s about to have a year). Also exciting: The film reunites Fincher with his Se7en screenwriter Andrew Kevin Walker.\n6. Guardians of the Galaxy Vol. 3\nRelease date: May 5\nDirected by: James Gunn\nStarring: Chris Pratt, Zoe Saldaña, Bradley Cooper\nThe Scoop: Press play for the final Guardians of the Galaxy mixtape before James Gunn jets off to run Marvel’s Distinguished Competition. The outgoing writer/director has promised plenty of tears and tunes in the gang’s last tour of the galaxy, which will finally reveal the truth of Rocket’s origins and give Drax the definitive farewell that Dave Bautista is so clearly craving. But at least some of these Guardians will live to fight another phase as the MCU’s Multiverse Saga builds to its next Avengers crossover.\n5. Barbie\nRelease date: July 21\nDirected by: Greta Gerwig\nStarring: Margot Robbie, Ryan Gosling, Issa Rae, Simu Liu\nThe Scoop: Get ready to party as Margot Robbie becomes the first big-screen Barbie in a Barbie world, with Ryan Gosling as her Ken. But the real star of this toy-based comedy is co-writer/director Greta Gerwig, now poised to score her first big studio blockbuster after helming art house favorites Lady Bird and Little Women. Forget Barbie’s world — we’re all living in a Gerwig world come this summer.\n4. Killers of the Flower Moon\nRelease date: TBA\nDirected by: Martin Scorsese\nStarring: Leonardo DiCaprio, Jesse Plemons, Robert De Niro\nThe Scoop: Over the course of his storied career, Martin Scorsese has made almost every genre of movie save one… a Western. That changes with Killers of the Flower Moon, a '20s-era drama set against the dusty Oklahoma plains where Texas Ranger Tom White (Jesse Plemons) investigates a series of murders happening within the indigenous Osage tribe. Scorsese regulars Leonardo DiCaprio and Robert De Niro are also part of the Apple TV+ production, which reportedly carries a $200 million price tag. You can be sure every penny will be up there onscreen.\n3. Dune: Part Two\nRelease date: Nov. 3\nDirected by: Denis Villeneuve\nStarring: Timothée Chalamet, Zendaya, Rebecca Ferguson, Josh Brolin, Javier Bardem\nThe scoop: 2021’s Dune (Part One) was so immensely satisfying, it’s strange to think a second part was ever in jeopardy. But praise be to Muad’Dib, we’ll see Paul (Timothée Chalamet), Chani (Zendaya) and company continue their vengeance tour against the conspirators that brought down House Atreides, with new cast members including Austin Butler (Elvis), Florence Pugh, Léa Seydoux and Christopher Walken (!!!).\n2. Oppenheimer\nRelease date: July 21\nDirected by: Christopher Nolan\nStarring: Cillian Murphy, Emily Blunt, Robert Downey Jr., Matt Damon, Rami Malek, Florence Pugh\nThe scoop: Even if you found Tenet to be the rare (and inscrutable) Christopher Nolan misstep, it’s hard to imagine anyone’s excitement is dimmed for the maestro’s star-studded drama that finally puts longtime Nolan ensemble favorite Cillian Murphy in the driver’s seat as “father of the atomic bomb” J. Robert Oppenheimer. Kenneth Branagh, Josh Hartnett, Benny Safdie, Matthew Modine and Gary Oldman also appear, among many other names and faces you’ll recognize.\n1. Indiana Jones and the Dial of Destiny\nRelease date: June 30\nDirected by: James Mangold\nStarring: Harrison Ford, Phoebe-Waller Bridge, Antonio Banderas, Mads Mikkelsen\nThe scoop: Is it just us, or is 80-year-old Harrison Ford working harder than ever? He’s on the new Paramount+ series 1883, will soon be seen in this month’s Apple TV+ series Shrinking and just joined the MCU (Captain America: New World Order). And of course in June he’ll complete his farewell tour after having recently revived his other two most famous roles (Star Wars and Blade Runner), sporting the fedora and whip one last time as everyone’s favorite Nazi-punching archeologist. Just please, please let it be better than Kingdom of the Crystal Skull.\nAlso Opening\nM3GAN (Jan. 6) is the killer-robot doll sensation sweeping the nation; Calmatic’s House Party reboot (Jan. 13) looks way better than it should; Anna Kendrick is trapped in a toxic relationship in Alice, Darling (Jan. 20); Anthony Ramos and Naomi Scott team for the sci-fi drama Distant (Jan. 27); Jennifer Lopez and Josh Duhamel make the most violent rom-com of our time with Shotgun Wedding (Jan. 27); Jonah Hill wants to marry Eddie Murphy’s daughter in Kenya Barris’s You People (Jan. 27); after Pam & Tommy, Pamela Anderson gets to tell her own story in the Netflix doc PAMELA, a love story (Jan. 31); ex-Tommy Sebastian Stan and Julianne Moore are in the New York-set neo-noir thriller Sharper (Feb. 10); Reese Witherspoon and Ashton Kutcher get their rom-com on in Your Place or Mine (Feb. 10); Helen Mirren, Lucy Liu and Rachel Zegler join the magic in Shazam! Fury of the Gods (March 17); Keira Knightley investigates the Boston Strangler (March 17); Woody Harrelson reunites with his Kingpin co-director Bobby Farrelly for Champions (March 24); Adam Sandler and Jennifer Aniston will be racking up more streams on Netflix with Murder Mystery 2 (March 2023).\nBetween Maestro and Chevalier (April 7) starring Kelvin Harrison Jr., it’s a great year for classical music; Phillipa Soo has to choose between Simu Liu and Luke Bracey in One True Loves (April 7); Nicholas Hoult is desperate to leave job killing for Nicolas Cage’s Dracula in Renfield (April 14); the Broken Lizard guys made a stoner Hunchback of Notre Dame movie called Quasi (April 20), sold; The Evil Dead series also moves to the city with Evil Dead Rise (April 21); Khris Davis stars as the famed boxer/grillmaster in a still-untitled George Foreman biopic (April 28); Owen Wilson is Vermont's #1 public television painter in Paint (April 28); Book Club 2: The Next Chapter (May 12) has the most logical sequel title of them all; Jennifer Lopez is an assassin protecting her daughter in The Mother (May TBA); Will Ferrell and Jamie Foxx voice dogs out for revenge in animated Strays (June 9); Pixar’s usual summer release is the Peter Sohn-directed Elemental (June 16); DC’s The Flash (June 23) arrives with some controversy given the problematic behavior of star Ezra Miller; the Jennifer Lawrence comedy No Hard Feelings (June 23) is described as Bad Teacher meets Risky Business.\nJustin Simien’s Haunted Mansion (Aug. 11) doesn’t have Eddie Murphy, but still has stars in spades; Zendaya and Mike Faist (West Side Story) hit the tennis courts in Luca Guadagnino’s Challengers (Aug. 11); David Harbour and Orlando Bloom hit the racetrack in Gran Turismo (Aug. 11); Chris Hemsworth is extracting again in Extraction 2 (Summer TBA); Kevin Hart is a master thief in F. Gary Gray’s Lift (Summer TBA); The Equalizer 3 (Sept. 1) means The Equalizer will be both currently on big and small screens; Kenneth Branagh’s latest Agatha Christie adaptation is A Haunting in Venice (Sept. 15); Megan Fox, 50 Cent and Andy Garcia join the mayhem in The Expendables 4 (Sept. 22); Aaron Taylor-Johnson takes on his third major comic book role with Kraven the Hunter (Oct. 6); Fast isn’t the only ten-quel, behold Saw X (Oct. 27).\nAnna Kendrick and Justin Timberlake are putting their hair in the air again in TrollsTopia Movie (Nov. 17); that didn’t take long for another Young Ghostbusters movie, an untitled follow-up to 2021’s Afterlife (Dec. 20); Julia Roberts and Mahershala Ali team for Sam Esmail’s thriller Leave the World Behind (TBA); Emily Blunt and Chris Evans headline the pharmaceutical thriller Pain Hustlers (TBA); Zack Snyder does an epic space opera with Rebel Moon (TBA); Benicio del Toro and Justin Timberlake team for murder mystery Reptile (TBA); the Jamie Foxx-John Boyega-Teyonah Parris three-hander They Cloned Tyrone finally arrives (TBA); Wes Anderson adapts a collection of Roald Dahl short stories with Benedict Cumberbatch in an untitled Netflix film (TBA).",
  "word_count": 4930,
  "scraped_at": "2026-02-14T13:35:16.413833"
}