{
  "article_id": "83b320675c79",
  "url": "https://www.sthelensstar.co.uk/news/25728433.new-year-honours-list-st-helens-people-recognised-2025/",
  "title": "New Year Honours list : The St Helens people recognised in 2025",
  "date": "20251230T003000Z",
  "domain": "sthelensstar.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FOSTER carers who have dedicated their lives to St Helens children and a woman who has carved out a rugby league career as a player and referee are on the New Year Honours list.\nHonoured with the MBE are Jacqueline Lowe and Norman Lowe, and David Cook and Susan Cook for services to Foster Care in St Helens.\nMeanwhile, former Saints Women and England hooker Tara Jones has been awarded the MBE for services to rugby league.\nJones, who was the first woman to score a try in a senior fixture at Wembley, won every domestic honour in the game with St Helens before hanging up her playing boots after the 2024 Super League Grand Final.\nA trailblazer for women referees, the 29-year-old joined the Rugby Football League’s full time match officials panel ahead of the 2025 season.\nThis year’s honours list includes 1,157 recipients, with 67% living outside London and the South East.\nHalf of all recipients at CBE level and above are women, marking the strongest representation since 2020, the Cabinet Office said.\nAcross the list, 10% come from ethnic minority backgrounds — including 5% Asian, 3% Black, 2% mixed and 1% other.\nIn addition, 5% identify as LGBT+, 15% report a disability or long-term health condition and 36% come from lower socio-economic backgrounds.\nThe oldest on the list is 102-year-old John Hearn, one of four centenarians included, who receives a BEM for services to Judo and to the community in north-east England.\nAt 20, the youngest recipient this year is Olympic gold medal-winning sports climber Toby Roberts from Elstead in Surrey, who becomes an MBE.\nPrime Minister Sir Keir Starmer said: “This year’s honours list celebrates the very best of Britain – people who put the common good ahead of themselves to strengthen communities and change lives.\n“Their quiet dedication speaks to the decent, compassionate country we are proud to be. On behalf of the whole nation, thank you – and congratulations to everyone recognised today.”\nIf there is someone with a St Helens connection who has been honoured and we have not included, please email simon.mulligan@newsquest.co.uk",
  "word_count": 350,
  "scraped_at": "2026-02-14T12:13:35.891442"
}