{
  "article_id": "83e804605fdb",
  "url": "https://metro.co.uk/2024/04/12/emma-hayes-bizarrely-recites-poem-jonas-eidevall-bust-up-20638649/",
  "title": "Emma Hayes bizarrely recites poem over Jonas Eidevall bust - up",
  "date": "20240412T170000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea boss Emma Hayes bizarrely recited a poem when asked if she regretted her behaviour after a bust-up with Arsenal’s Jonas Eidevall.\nHayes appeared to shove Arsenal head coach Eidevall after the Women’s League Cup final and accused him of showing ‘male aggression’ on the touchline after he was allegedly involved in an incident with Erin Cuthbert.\nThat saw Arsenal hero Ian Wright, a big fan of women’s football, publicly criticise Hayes and the fall-out continued on Friday as she and Eidevall faced the media.\nEidevall has called on Hayes to better ‘understand the consequences’ of her words and Hayes has responded by revealing a conversation she had with her son about the clash, which was then randomly followed by an excerpt from a poem.\nHayes said: ‘My son said to me after the game, ‘Mummy, when you push someone in school you’re asked to go and take time out’.\n‘I said to him, ‘You know what darling, you can’t meet aggression with aggression, all you can do is tell the teacher, all you can do is go and explain why you think something’s unfair. That’s all you can do.’\n‘You cannot meet aggression with aggression. I thought it was a really good conversation to have with my son after the final.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nQuizzed if she stood by her post-match comments after the final, Hayes recited a poem – Choose Something Like a Star – which was written by Robert Frost.\n‘So when at times the mob is swayed, to carry praise and blame too far, we may choose somewhere like a star, to stay our minds on and be staid,’ Hayes said.\nAsked to explain why she had read out a poem, Hayes added: ‘I’ve had a fantastic break, I’ve already explained an important analogy with my son and the lessons learned and my focus is on moving forward. I’ve had time to look at my star.’\nWhat did Hayes say after the League Cup final?\n‘I’ve been in women’s football a long time and I don’t think we should tolerate male aggression like we did today. He [Eidevall] received a yellow card but perhaps should have been more. Fronting up or squaring up to a player is something that’s unacceptable. I’ve never been booked in 12 years of my career.’\nMore Trending\nEidevall, meanwhile, responding to Wright’s claim that Hayes’ comments could have ‘finished’ him, said: ‘I think always when you make comments about other people, you have to take into consideration what affects that can have.\n‘That’s why you need to be, especially when you’re a leader, you need to be very good with your words. You need to understand the consequences of your actions and your language.\n‘That’s why I think it’s really, really important that we treat each other with a lot of respect and that we stay at facts as much as possible and don’t get too emotional.’\nMORE: Mikel Arteta hails Arsenal star’s ‘toughness’ after playing with pain\nMORE: Emmanuel Petit warns Chelsea against signing ‘the new Raphael Varane’",
  "word_count": 559,
  "scraped_at": "2026-02-14T12:57:38.149406"
}