{
  "article_id": "8429bbfefbdd",
  "url": "https://chapelboro.com/news/unc/administrative-and-athletics-changes-reviewing-lee-roberts-first-full-academic-year-as-unc-chancellor",
  "title": "Administrative and Athletics Changes : Reviewing Lee Robert First Full Academic Year as UNC Chancellor",
  "date": "20250812T103000Z",
  "domain": "chapelboro.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UNC is nearing the start of a new semester in Chapel Hill – and that means the university also just passed an anniversary of recent importance.\nOne year ago on Aug. 9, Lee Roberts was officially named permanent chancellor, taking full reign over the role after being the interim for eight months in the wake of Kevin Guskiewicz’s departure to Michigan State. UNC System President Peter Hans, who also selected Roberts for the interim job, described the choice based on the former real estate investor’s “calm, steady, focused leadership” and his willingness to “stand behind the core principles of this [university.]”\nAfter an interim stretch painted by tense pro-Palestine and free speech demonstrations that culminated in a high-profile clash with campus police, Roberts had an academic year in 2024-25 filled with significant decisions to further chart his course as the university’s figurehead. Here are some of the key themes and highlights of each before his second school year begins:\nAdministrative Approaches Lead to Positive — and Negative — Attention\nRoberts’ predecessor made a concerted effort to position UNC as the ‘university of the people,’ finding ways to invest resources across the state of North Carolina to further increase its visibility and residents’ interest. Roberts is taking a slightly different approach to achieve the same goal — with a big push to increase enrollment as a core strategy of his administration. While the university updated its admissions practices to comply with the U.S. Supreme Court’s 2023 ruling striking down race-based considerations, it is now also upping the intake to match North Carolina’s growth as a state.\nRoberts’ goal is to add 5,000 students to the undergraduate body within 10 years, with most of those spots going to in-state students. So far, applications are up significantly for UNC, including a 15% application rate increase for the class of 2029. This July, the university also announced it is moving up the date of notification for in-state early-action applicants, allowing them to learn whether they are accepted into Carolina sooner than most other schools.\nWhile those efforts help students, UNC became a flash point of national controversy in faculty and academic circles during its spring semester. The university’s Board of Trustees delayed several votes on faculty tenure cases and promotions within the College of Arts & Sciences, sparking pushback from the faculty council and the American Association of University Professors. While the trustees ultimately moved 33 cases forward during a specially-called, virtual session in June, The Assembly reported in July emails from then-Provost Chris Clemens claimed Roberts agreed to delay votes as a potential cost-cutting measure. The May emails — which just preceded Clemens’ announcement to step down from the position after more than three years — included messages from the provost urging the chancellor to consider the economic impact of changing or eliminating tenure practices.\nRoberts told 97.9 The Hill in May that UNC’s tenure policies had not changed despite the delayed votes. Following the trustees’ July meeting, the chancellor said academic tenure is a “competitive imperative” for the university while acknowledging the board has “a range of views” on the practice.\nHigh-Profile Athletics Moves\nEven if you do not count the abrupt retirement of legendary women’s soccer head coach Anson Dorrance two days after Roberts’ official designation as the permanent chancellor, he has seen several seismic changes within the athletics department. Roberts had a hand in hiring coaching legend Bill Belichick as UNC’s newest head football coach last December after the firing of Mack Brown — and despite the reported irregularities around the process, the program has seen a tsunami-level swell of interest ahead of the fall season. While the preseason expectations from ACC media are tepid, Carolina sold out both season tickets and individual home game tickets, and the season-opener against TCU on Sep. 1 drew a special ESPN broadcast from the field ahead of kickoff.\nThe investment into UNC football aligned with an ongoing shift in college athletics toward more player compensation and the adjustment of spending models. The announcement in July of Athletic Director Bubba Cunningham transitioning to a new role, while hiring Steve Newmark as his successor, is a representation of that shift. Newmark’s background in the business and fundraising side of sports favor’s Roberts’ background more than Cunningham’s and will bring a different perspective to oversee the Tar Heels starting in 2026.\nAnother high-profile athletics move Roberts’ administration is weighing is a literal move for one of the university’s biggest facilities: the Dean Smith Center. Among the working groups Roberts launched while interim chancellor was one to review the campus’ physical master plan. The future of the Dean Dome was among the main topics, with the chancellor telling 97.9 The Hill it faces a roof replacement ranging from $80 million to $100 million. Now, Roberts’ administration and Carolina Athletics are weighing whether to undergo a major renovation or moving the men’s basketball stadium to a new location — with Inside Carolina reporting in February university leaders prefer the Carolina North property. Utilizing that land off Martin Luther King Jr. Boulevard will be a key part of UNC’s future, whether it’s with an athletic facility like a basketball stadium, cricket arena or mixed-use development to generate revenue for the university.\nFederal Government Fallout and Reactions\nLike many of their peers, the UNC System and its flagship campus are facing many changes from the federal level as President Donald Trump and his administration aim to reshape spending practices while influencing higher education circles. Shortly after his inauguration in January for his second term, Trump began signing executive orders and making sweeping policy decisions that forced Carolina to react. An early example is the suspension of requiring curricula with diversity-related components in February, building upon efforts enacted by the UNC System in 2024 to improve “institutional neutrality” by removing the phrases of “diversity, equity and inclusion” in their own policies. Immigration and deportation crackdowns started in the spring, with UNC working with six international students who saw their visas revoked before eventually being reinstated. Roberts maintained his administration would “cooperate with law enforcement and we follow the law” at any level, including Immigration and Customs Enforcement officers if they arrived on campus.\nSignificant cuts to scientific research grants spell future disruption for many projects on campus, if not already creating delays or funding shortfalls. At the first Board of Trustees meeting for the new academic year, Roberts’ administration laid out a plan to trim $70 million from the university’s annual budget in the coming years — crediting the move, largely, as a cost-saving measure amid uncertainty around federal and state funds. The chancellor has “personally spent a lot of time in Washington” since Trump’s return to the Oval Office to lobby on the university’s behalf and share details of the research funded by groups like the National Institutes of Health, the Department of Health and Human Services and more. While UNC has not faced the direct ire of the administration like Harvard, Columbia and even Duke, it has not been spared by the upheaval caused by Trump’s administration.\nUNC’s Reach Beyond Campus\nIn addition to his trips to Washington D.C. to talk with representatives and policymakers about Carolina’s impact on the state, Roberts has found other ways to travel and represent the university. Beyond attending athletics events, he visited Western North Carolina this summer to see communities still recovering from Hurricane Helene last fall and discuss how UNC is aiding disaster relief efforts. Shortly after being named to the permanent job, the chancellor also traveled with The Chamber for a Greater Chapel Hill-Carrboro on its biennial Inter-City Visit — touring Ann Arbor, MI and learning about how its local government, university and other stakeholders operate together.\n“I really thought that was a terrific visit,” Roberts told 97.9 The Hill in October. “I was very impressed with the professionalism [with which Ann Arbor is] dealing with challenges around crime, homelessness, affordable housing. That’s something we can take away: most municipalities are dealing with the same issues broadly around the country, [so] we don’t need to reinvent the wheel. We can apply best practices from other places.”\nFeatured photo via Jon Gardiner/UNC-Chapel Hill.\nChapelboro.com does not charge subscription fees, and you can directly support our efforts in local journalism here. Want more of what you see on Chapelboro? Let us bring free local news and community information to you by signing up for our newsletter.",
  "word_count": 1403,
  "scraped_at": "2026-02-14T14:18:43.202912"
}