{
  "article_id": "84307d2de290",
  "url": "https://www.thenationalnews.com/news/mena/2025/10/17/after-gaza-ceasefire-whats-next-for-benjamin-netanyahu/",
  "title": "After the Gaza ceasefire , what next for Benjamin Netanyahu ? ",
  "date": "20251018T161500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "While the Middle East was on tenterhooks this week waiting to see if the latest ceasefire would hold in Gaza, US President Donald Trump revealed a conversation he had with Israeli Prime Minister Benjamin Netanyahu shortly after the deal was announced.\n“[Netanyahu] called. He said: ‘I can’t believe it, everybody is liking me now,’” the US President told Fox News. “I said: 'More importantly, they are loving Israel again,’ and they really are.”\nMr Netanyahu's opponents in Israel seized on the conversation as yet another example of the Prime Minister thinking first about his own interests rather than those of the country he leads, an accusation that has dogged him throughout the Gaza war.\nNow, a ceasefire is holding, all living hostages have returned to Israel, and at a peace conference in Egypt, world leaders threw their support behind the US President’s regional vision. Mr Trump has been lavished with praise across the Israeli political spectrum.\nThe extent to which this appreciation extends to Mr Netanyahu, whom Mr Trump and his close aides have credited a great deal in recent days, is far less certain.\nThe Israeli Prime Minister has been lagging in polls since the outbreak of the war. He has seen bumps in support at points when Israel appeared to be achieving military successes, but never at levels great enough to significantly stabilise his political future.\nThrough much of the war, polling suggested that most Israelis wanted hostages released as part of a deal rather than continued fighting in Gaza. Now that all the living captives have been freed, it is far from certain that this is associated with the Prime Minister’s work.\n“Netanyahu’s political position is poised to improve somewhat, I would not go further than that,” Israeli pollster and analyst Dahlia Scheindlin told The National.\n“So far, the polls we have show very minimal signs of a slight rise which has not truly affected the overall strength of the coalition. [Mr Netanyahu's] Likud Party has only gone up a tiny bit, at the expense of the other coalition partners mostly,” she said.\nDuring US envoy Steve Witkoff’s address on Saturday to a hostage rally in Tel Aviv, the very mention of Mr Netanyahu’s name elicited loud boos from the crowd, a sharp contrast to the rapturous welcome given to the Trump administration officials on stage. Visibly embarrassed, Mr Witkoff said: “I was in the trenches with the Prime Minister. Believe me, he was a very important part here.”\nWith anger still boiling, the Israeli opposition is trying to present a compelling alternative to Mr Netanyahu. Elections are not due to be held for another year, but could take place much sooner if the coalition buckles under the strain of post-ceasefire politics.\nThe mainstream opposition dialled down its criticism of Mr Netanyahu in the days after hostages were released. Yair Lapid, leader of the centrist Yesh Atid party, said Israel is “about to reinvent itself” and that the “challenges before us also require a new vision”. Former prime minister Naftali Bennett signed off a long post on X praising the war, and slamming Israel’s foreign critics, by saying “change is coming soon”.\n“The opposition has failed to be an opposition this entire time,” Ms Scheindlin said. “They could build momentum by taking bold positions, rather than just going on and on about micro issues.”\nOther than Israel’s tiny far left, the strongest criticism of the government’s current path comes from within the coalition itself.\nFar-right National Security Minister Itamar Ben-Gvir has described the arrangement through which Israel and Hamas exchange the bodies of captives as a “disgrace”. Parliamentarians from Mr Ben-Gvir’s party boycotted Mr Trump’s speech in the Knesset after the deal was struck, as did members of the Likud party.\nHardliners have floated leaving the government if the war ends on terms they find unsatisfactory, in particular if Israel fails to destroy Hamas and resettle Gaza. That could end Mr Netanyahu’s majority in parliament. The hardliners could also choose less dramatic options, such as leaving the government but still voting with it.\nPressure on Mr Netanyahu from both sides does not appear to put him in immediate danger, but none of the underlying criticisms of him have been addressed, in particular his part in the major security failure over the Hamas-led attacks on October 7, 2023. Whether the threat is terminal will become clearer when the Knesset starts its winter session on Sunday.",
  "word_count": 737,
  "scraped_at": "2026-02-14T12:13:14.649520"
}