{
  "article_id": "844a4c1f43d1",
  "url": "https://www.fourfourtwo.com/blogs/fourfourtwo-issue-379-new-issue-lionesses-special-putellas-shevchenko-club-world-cup-guide-rise-of-basque-country-and-hargreaves-answers-your-questions-plus-bonus-euros-preview",
  "title": "NEW ISSUE : Lionesses special , Putellas , Shevchenko , Club World Cup guide , rise of Basque Country and Hargreaves answers your questions PLUS bonus Euros preview ! ",
  "date": "20250523T203000Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NEW ISSUE: Lionesses special, Putellas, Shevchenko, Club World Cup guide, rise of Basque Country and Hargreaves answers your questions PLUS bonus Euros preview!\nGet your hands on the latest issue of FourFourTwo magazine – available in print from Thursday or on your device now!\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nOrder the new issue with free delivery here – just select ‘Summer Issue 379’.\nSubscribe to FourFourTwo today and save! You’ll get 13 issues per year…\nFirst a message from our editor, James Andrew:\nThree summers ago, the Lionesses captured the public’s imagination and attention when they defeated Germany at Wembley to win the Euros.\nThe day of the final, I remember sitting in a London pub where the game was on in the background. As the minutes ticked by and more people took interest, additional TVs were switched on as England pushed for glory, and when Chloe Kelly poked home her extra-time clincher, the whole place erupted.\nSince then, Wembley has seen the ‘sold out’ sign slapped on the door for multiple Lionesses fixtures, while WSL crowds continue to soar with numerous top-tier stadia hosting matches. So, as another competition beckons, the women’s game has another opportunity to grab the hearts of fans.\nIn this issue, we speak to five members of Sarina Wiegman’s side – golden boot-winning Beth Mead, Georgia Stanway, Ella Toone, Fran Kirby and Alessia Russo – who are hoping to defend their crown in Switzerland. We also chat to Wales star Jess Fishlock, who at 38 years young will lead her nation out at their first major tournament, almost two decades on from her debut. Enjoy!\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nEuro 2025 Guide\nGet clued up on the Swiss showpiece with an extra 36-page supplement, also featuring our tips for the golden boot and 25 reasons to love Euro 2025.\nMassive Wallchart\nTrack the Lionesses’ progress from Zurich to St Gallen and beyond courtesy of our colossal poster. You can even fill in each completed group table as you go.\nEngland: Long may they reign\nFor the first time since 1970, an England senior team will attempt to defend their title. The Lionesses haven’t had things all their own way since that wondrous Wembley day at Euro 2022, but they’re determined to retain their crown.\nWales: The wait is over\nIt’s been 19 years since Jess Fishlock made her debut for Wales – now, at 38, she’s led them to their first major tournament, and is eyeing a Euros record…\nSpain: Just let us play\nLa Roja’s World Cup joy was overshadowed by off-field chaos – this time, they, including fit-again Alexia Putellas, want their football to do the talking.\nSweden: The next step\nChelsea winger Johanna Rytting Kaneryd is Sweden’s reigning player of the year – after bagging bronze Down Under in 2023, she fancies an even better medal.\nSheva tells his story\nAndriy Shevchenko fled the Chernobyl disaster to become the world’s best footballer – in his own words, the Ukrainian icon relives a career inspired by Valeriy Lobanovskyi’s clocks and Ian Rush’s boots, and explains why president Volodymyr Zelensky can always count on him.\nClub World Cup crib sheet\nEverything you need to know about the American extravaganza, from Barry Norman and crocodiles to chinwags with John Terry and David James. After so much scepticism, can it establish itself as one of football’s prestigious events?\nFrom The Vault: 1985\nThe Heysel disaster in Belgium brought to an end 11 weeks of turmoil, in which 96 football fans went to watch the sport they loved but never came home. Forty years on, FFT recalls the tragic inspiration for a new fan dawn.\nThe rise of the Basque Country\nAthletic Bilbao and Real Sociedad have gone deep in Europe in recent times, by mining fertile local talent pools. In a four-day trip to the Spanish region, FFT visits those clubs and more to learn how quarries in Euskal Herria continue to thrive.\nOwen Hargreaves answers YOUR questions\nThe former Bayern Munich, Manchester United and England midfielder spills the beans on European glory, injury heartache and hurtful jibes from Cherie Blair.\nAround the grounds in the EFL, non-league and Scotland\nThe Crazy Gang’s last man standing, Dean Lewington, discusses his remarkable, record-breaking longevity, MK Dons retirement and the split that shook football.\nManchester’s other breakaway club: FC United may hog the limelight, but they’ve been around nowhere near as long as Maine Road FC...\nIn Best & Worst, diehard Falkirk fans James and David Maxwell celebrate Kevin McAllister, sinking Paolo Di Canio’s Celtic and Brockville’s stinky loos.\nFleetwood, India, Nepal: Four-time EFL promotion-winning boss Simon Grayson is enjoying South Asia, but hopes the journey will lead to a job back home...\nI wish I was a baller: Several ex-pros have had that wish granted in the new Baller League – they share their experiences of the six-a-side competition.\nThe Mixer\nOur latest round-up of football’s must-have merchandise includes Kaka’s Gordon Gekko-style trench coat, Nurnberg's anniversary shirt, Milan’s groundbreaking women’s collection and the Salah-endorsed watch that’ll set you back £800,000.\nWant to get something in The Mixer? DM Deputy Editor Matt Ketchell\nUpfront\nEx-Chelsea and Brazil man Juliano Belletti names the games that changed his life, while Jules Breach reflects on the impact of the Lionesses’ Euro 2022 win.\nPut your football knowledge to the test with our quiz about Italian talismen and Brazilian goal machines, then peruse My Football where badminton Olympic medallist Gail Emms talks dodging Shearer shots and her mum’s Azteca heroics.\nElsewhere, we debate if Wrexham’s rapid rise through the leagues is a fairytale.\nIn the Players Lounge this month…\nPaul Dickov revisits Manchester City’s last-gasp play-off comeback at Wembley, Egil Ostenstad describes his ‘hat-trick’ against Manchester United and the magic of Matt Le Tissier, plus Liam Ridgewell remembers irking Sir Alex Ferguson.\nPerfect XI\nFormer Nottingham Forest marksman Stan Collymore speaks up for Steve Chettle and insists Lars Bohinen suited his style better than Jamie Redknapp.\nSubscribe to FourFourTwo today! Guarantee the finest football stories and interviews dropping on your doorstep every month.\nGregg Davies is the Chief Sub Editor of FourFourTwo magazine, joining the team in January 2008 and spending seven years working on the website. He supports non-league behemoths Hereford and commentates on Bulls matches for Radio Hereford FC. His passions include chocolate hobnobs and attempting to shoehorn Ronnie Radford into any office conversation.",
  "word_count": 1179,
  "scraped_at": "2026-02-14T13:06:11.305502"
}