{
  "article_id": "84556b42e965",
  "url": "https://www.theguardian.com/world/2025/mar/31/first-edition-myanmar-earthquake",
  "title": "Monday briefing : How a devastating natural disaster has been made worse by Myanmar brutal civil war |",
  "date": "20250331T063000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. The 7.7 magnitude earthquake that hit Myanmar on Friday was the largest in the region for more than a century. When the final toll becomes clear, it is likely to be the deadliest in Myanmar’s modern history. And three days after the quake, hopes of rescuing those still trapped in the rubble will soon begin to fade.\nMyanmar is the victim of a devastating natural disaster – but also a set of interlocking political and military circumstances that badly exacerbate the crisis. Today’s newsletter explains what we know about the toll so far, and how the country’s repressive ruling junta may have made it even worse. Here are the headlines.\nFive big stories\n-\nUkraine | Donald Trump has said he is “very angry” with Vladimir Putin over his approach to a ceasefire in Ukraine and threatened to levy tariffs on Moscow’s oil exports if the Russian leader does not agree to a truce within a month.\n-\nEducation | Nearly 20 councils in England have warned publicly that they are at risk of insolvency because of multibillion-pound debts caused by years of overspends on special educational needs support, the Guardian can reveal.\n-\nHealth | The morning-after pill will be available without charge on the NHS at pharmacies in England, the government has announced in an effort to reduce the “postcode lottery” of free access to the emergency contraception. The pill is already available for free from most GPs and sexual health clinics but some pharmacies charge up to £30.\n-\nUK news | The activist group targeted in an unprecedented police raid on a Quaker meeting house said it had resulted in large numbers of people signing up for a series of new protests. Six women at a gathering of the protest group Youth Demand were arrested after uniformed police forced their way into the Westminster meeting house on Thursday.\n-\nFrance | The future of the far-right leader Marine Le Pen will be decided on Monday when a court hands down its verdict on charges she and party officials embezzled money from the European parliament. If convicted, she could be barred from running for the presidency.\nIn depth: Key questions at critical stage in rescue efforts\nThe epicentre of the 7.7 magnitude quake was near the city of Mandalay, home to more than 1.5 million people. Significant damage was also reported in the Sagaing, Naypyidaw, Magway, Bago and Shan State regions.\nThe damage was worsened by the shallow depth of the quake, at 10km below the earth’s surface. Over the rest of Friday there were two dozen aftershocks, including one major 6.4 magnitude quake 12 minutes after the first, and more felt over the weekend.\nThis explainer by Nicola Davis has more detail on what those magnitude numbers mean, and other factors that exacerbated the damage. Here’s what else we know.\nHow many people have died?\nThe number of deaths confirmed in Myanmar so far stands at 1,700 people, with at least 300 more missing. At least 3,400 more have been injured. But those figures will grow significantly: many areas have not yet been reached by rescue teams. On Saturday, the declared toll leapt from 1,002 to 1,644 within a few hours, and as new areas are reached that pattern is likely to be repeated.\nOne measure of how those numbers have overwhelmed local services came yesterday in reports that crematoria in Mandalay were unable to handle the numbers, with bodies piling up and families forced to cremate loved ones in the street. This piece gives a visceral sense of the challenges on the ground, with one volunteer in the city of Sagaing describing patients forced from the damaged hospital to wait outside in searing heat, with no tents to protect them from the sun.\nThe US Geological Service’s predictive modelling system estimated that the final number could be more than 10,000, partly because many buildings in the affected regions were not robust enough to survive the magnitude of the impact. It could take weeks for the final count to become clear. The USGS also estimated that economic losses could exceed Myanmar’s annual GDP, which stood at $67bn in 2023. These satellite images from Maxar Technologies give some sense of the nature of the damage.\nAt least 18 people have also died in neighbouring Thailand, with another 32 injured in Bangkok – hundreds of miles away from the epicentre – and 83 unaccounted for after the collapse of a 30-storey tower block that was under construction in the capital.\nHow have issues with communications and infrastructure worsened the impact?\nCommunications with many of the affected areas are poor, partly because many of them have been ravaged by the country’s ongoing civil war, with much of the country out of the control of the ruling junta.\nSome of the factors causing that blackout predate the disaster: the military regime has shut off the internet and social media in recent years as part of its efforts to silence dissent. And hundreds of communication towers run by an army-controlled firm, Mytel, were destroyed by opponents of the regime in the aftermath of the February 2021 coup that brought them back to power.\nOver the last few days, even the government’s own websites have been inaccessible. Phone lines are also down, which has made it very difficult to coordinate rescue efforts, and power networks may not be restored for several days.\nHow has the rescue operation unfolded?\nAs the scale of the disaster became clear, Myanmar’s junta chief, Min Aung Hlaing, took the exceptionally rare step of calling for international assistance – a course that the then-dictatorship resisted even in 2008, when Cyclone Nargis killed more than 100,000 people.\nOn Saturday, hundreds of foreign rescue personnel were let into the country, although damage to airports has hindered that process, with the control tower at Naypyidaw’s airport toppled by the quake. There are now teams from China, Russia, India, Thailand, Malaysia and Singapore on the ground.\nBut the ruling military has a track record of blocking humanitarian aid from areas where its opponents are active, Rebecca Ratcliffe reports in this piece, and charities and NGOs are reported to have been blocked from some rural areas where the fighting has been fierce. (Besides what appears to be the deliberate policy decision of the regime, extensive damage to major roads has also hampered those efforts.) The international teams are mostly operating in Mandalay and the capital, Naypyidaw, where the junta retains control.\nMultiple reports have suggested that in many parts of the country, the rescue effort is largely being conducted by untrained local teams without adequate safety protections, equipment or supplies. And official relief efforts in Naypyidaw have prioritised government offices and staff housing above ordinary residential areas, the Associated Press reported.\nThe timeframe for the success of any such operations is extremely limited, with the critical window for finding people alive in the rubble in such disasters generally put at 72 hours. There was a brief moment of relief today when a woman was pulled alive from the rubble of a hotel building – but that milestone will be passed this evening.\nHow has the disaster interacted with the ongoing civil war?\nThe junta is now only in full control of about a fifth of the country, although it retains its grip on the most strategically important urban areas. (This piece on the Conversation is an excellent recent primer on the state of the conflict.) The civil war, which has raged since Aung San Suu Kyi’s government was toppled in 2021, has left the civilian population extremely vulnerable to the impact of this kind of natural disaster, with the health system in crisis and half the population living in poverty.\nAs the junta has sought to fend off a string of advances by opposition forces, it has relied increasingly on air power, its greatest remaining military advantage, and has a record of indiscriminate attacks that have destroyed schools, hospitals and monasteries – and taken many civilian lives. It has not proved willing to abandon those operations in recent days.\nWhile the resistance movement announced a unilateral ceasefire for two weeks with the exception of defensive operations, and offered to send health care professionals to work with international NGOs in regions under the regime’s control, the junta has continued to bomb parts of the country – even near the epicentre of the quake.\nAid operations themselves may also be a means of seeking military advantage, given the junta’s record of blocking aid workers and supplies from regions that it does not control.\n“You have areas in which the most acute needs exist and you have literally aid trying to get in, trucks blocking the way, people being arrested and that has been the pattern of their response to natural disasters in the past,” the UN’s special rapporteur for Myanmar Tom Andrews told the BBC. “I’m afraid I’m fully expecting that that will be the case with this disaster.”\nWhat else we’ve been reading\n-\nThe political caravan has rolled on from the cuts to disability and sickness benefits – but, writes John Harris, the bald fact remains that “[Rachel] Reeves, Keir Starmer and their colleagues are set on immiserating millions of disabled people.” His column eviscerates “the worst domestic policy decision made by any postwar Labour government”. Archie\n-\nNeil Basu was one of the most senior ethnic minority police officers in the UK. Now he’s retired, he reflects on his three decades in the force and his dismay upon reading the Casey report’s findings about the depth of racism and sexism still present: “I was crying when I walked away [after reading it]. I thought I’d wasted 30 years of my life.” Toby Moses, head of newsletters\n-\nAfter the Sudanese army recaptured Khartoum from the Rapid Support Forces militia that seized it two years ago, what details have emerged “paint a picture of a city ravaged by unimaginable horror”, writes Nesrine Malik. Alongside the losses and the relief, she notes, stands the certainty that “the RSF may have lost its jewel in the crown, but the war is far from over”. Archie\n-\nEmma Beddington takes you through her food rules – soup is not a meal, toast is, and most importantly (I think) “‘One person cuts, the other chooses’ is not just for kids sharing cake, it’s a lifelong, universal principle.” Toby\n-\nSolvej Balle had the idea of a protagonist experiencing the same day again and again long before Groundhog Day – but five books and many years later, she is still writing about it. Philip Oltermann’s interview illuminates a very different approach to that same fascinating question: “how can one day be so voluminous?” Archie\nSport\nFootball | Substitutes Omar Marmoush and Nico O’Reilly helped Man City overturn a half-time deficit to win 2-1 at Bournemouth in the FA Cup quarter-finals. In the day’s other quarter-final, Aston Villa had less of a struggle against Preston, winning 3-0.\nRugby union | Theo Dan’s late try gave Saracens a 29-22 win over Leicester, as the club continue their late push for the Premiership playoffs. The club are within two points of the top four, and one of now five teams separated by just four points with five rounds to go.\nFootball | Arsenal cruised to their sixth successive league win against the relegation-battling Crystal Palace with a controlled 4-0 victory in the Women’s Super League. Beth Mead scored a superb double while a first-half finish from Alessia Russo and an own goal from Allyson Swaby completed a dominant afternoon for Renée Slegers’s side.\nThe front pages\n“Trump launches ‘very angry’ outburst at Putin over Ukraine” is our Guardian print splash and the Financial Times leads on a version of that as well: “Trump threatens secondary tariffs on Russian oil if no Ukraine truce agreed”. The Mirror leads with “Harry Netflix demand ‘wrecked’ charity event”. “Harry ‘tried to make charity boss defend Meghan’” says the Mail while the Metro’s take is “Harry’s ‘charity cover-up’”. “Anti-terror tactics to stop people smugglers” says the Times, and the Telegraph has “Ethnic minorities prioritised for bail”. Top story in the Express is “Families £1,100 worse off in April bills surge” while in the i it’s “Starmer warns Trump ‘don’t start a trade war’ as UK set to face tariffs”.\nToday in Focus\nAdolescence: what teen boys really think of girls, influencers and porn – podcast\nFrom misogynist content creators such as Andrew Tate to the ubiquity of pornography, boys face a barrage of toxic influences. We talk to sixth-formers about the pressures and joys they experience\nCartoon of the day | Edith Pritchett\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nAntonia Murphy, a semi-retired psychotherapist, rediscovered her love for water and embraced diving after moving to Edinburgh at the age of 66. Despite never having learned to dive, she joined coaching sessions and quickly fell in love with the sport.\nNow 68, she has advanced to the intermediate group, tackling springboards, somersaults, and even the 7.5-metre platform. Diving has been transformative for Murphy, boosting her confidence, skill, and mental clarity. The camaraderie of her diving peers has also been a crucial support, reinforcing her belief in starting new ventures at any age: “The thing about being over 60 is you can start something new.”\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2248,
  "scraped_at": "2026-02-14T12:43:37.180635"
}