{
  "article_id": "8480885eae20",
  "url": "https://www.easternriverinachronicle.com.au/story/9107315/phoenix-draw-in-priestmans-coaching-return/",
  "title": "Phoenix draw in Priestman coaching return",
  "date": "20251108T084500Z",
  "domain": "easternriverinachronicle.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former Canada manager Bev Priestman has been denied an ideal return to coaching with Wellington Phoenix forced to fight out a 1-1 draw with Canberra United.\nSubscribe now for unlimited access.\nor signup to continue reading\nPriestman took the helm of the A-League Women side for the first time at Sky Stadium on Saturday after being sacked as Canada's manager in July 2024 following the Paris Olympics drone spying scandal.\nThe 39-year-old, who guided Canada's women to Olympic gold in Tokyo, had served a FIFA-imposed one-year ban for her role in flying a drone over a closed New Zealand training session during last year's Games.\nAlso on Saturday, Holly McNamara put on a clinic to fire Melbourne City to a thumping 4-0 grand final rematch win over defending champions Central Coast.\nWhile Adelaide United were unable to turn a dominant performance against Sydney FC into their first win, settling for a 0-0 draw at ServiceFM Stadium.\nWellington started strongly in their season opener, with star Nepalese striker Sabitra Bhandari causing trouble for United goalkeeper Sally James early.\nCanberra found their 18th-minute opener when former Central Coast championship player Brooke Nunn gave away possession to Michelle Heyman in the visitors' attacking half.\nHeyman set up Josie Aulicino, who snuck the ball into the net from the wing when right-back Marisa van der Meer couldn't intercept the cross.\nVan der Meer - on return from two consecutive ACL injuries - found redemption in the 39th minute, reacting the quickest when James failed to clear the ball after a Phoenix corner kick.\nBoth sides had plenty of looks in the second half but neither could pull off the match-winner.\nAt a rain-soaked City Football Academy, rising Matildas star McNamara sent a laser kick through traffic to draw first blood in the 32nd minute and nab her first goal of the season.\nMcNamara then capitalised on a favourable deflection off Mariners midfielder Peta Trimis to set up Shelby McMahon's goal from the right wing a minute into first-half injury time.\nThe McNamara show continued when Baxter Thew gave away a penalty for taking the striker down, and the City gun converted in the 54th minute.\nMcNamara almost pulled off a hat-trick three minutes later, but was denied by Central Coast goalkeeper Sarah Langman before being replaced in the 66th minute by Deven Jackson.\nMcMahon, 17, piled more misery on the reigning champions with the final goal in the 71st minute.\nAt ServiceFM Stadium, Sydney defended astutely to withstand a barrage of Adelaide shots (19 to six) and take a point back to NSW.\nAdelaide's Matilda McNamara flashed a header wide in the 70th minute but otherwise a Sydney defence, headlined by 14-year-old second-gamer Willa Pearson, held firm.\nReds skipper Isabel Hodgson was forced off late with a left knee injury, while Sydney's Jodi Ulkekul dragged a shot wide late in stoppage time, leaving both teams still searching for their first win.\nAustralian Associated Press",
  "word_count": 490,
  "scraped_at": "2026-02-14T13:33:13.515219"
}