{
  "article_id": "8483c3d84f1a",
  "url": "https://www.suffolknews.co.uk/bury-st-edmunds/news/to-see-him-out-there-on-the-pitch-will-be-wonderful-young-9373945/",
  "title": "Bury St Edmunds Westgate Primary School pupil Cleton Long , nine , to sign national anthem ahead of Lionesse Euro 25 qualifier tonight",
  "date": "20240712T104500Z",
  "domain": "suffolknews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Bury St Edmunds Westgate Primary School pupil Cleton Long, nine, to sign national anthem ahead of Lionesses’ Euro 25 qualifier tonight\nA Bury St Edmunds youngster will be stepping out on to the pitch for a prominent role when the Lionesses play a key match this evening.\nCleton Long, nine, will be signing the national anthem in British Sign Language ahead of the England penultimate Women’s Euro 2025 qualifier, against the Republic of Ireland at Carrow Road, Norwich.\nThe Westgate Primary School pupil will join 22 other mascots on the pitch before kick-off at 8pm – but he will be the only youngster signing, rather than singing, the national anthem.\nCleton wears hearing aids and while he is in mainstream school he is supported by Westgate’s deaf unit, as he cannot hear certain high and low pitch sounds.\nHe was diagnosed as deaf when he was aged two, following treatment for leukaemia.\nIt is thought the Year Four pupil’s hearing loss was a side effect of the chemotherapy.\nHis mum Karen said: “He had good speech awareness before he was diagnosed – his hearing was tested straight after his treatment and he could hear, but a year later he couldn’t hear some sounds.\n“He is lucky that he did have speech before he went deaf.\n“Luckily he has a brilliant deaf unit at his school. I cannot praise the staff enough.”\nCleton heard about the mascot opportunity through the West Suffolk Deaf Children’s Society, after it was contacted by the Royal Association for Deaf People last Tuesday.\nThe association was seeking deaf children aged six-10 who use native sign language, with the names of those interested going into a draw the following day.\nOn Thursday, Cleton found out he had been chosen.\nAnd although three youngsters were supposed to be signing, alongside 22 mascots, the family found out on Tuesday that Cleton would be the only child signing tonight.\n“I think he might be a little bit nervous, but he has been really engaging with it,” said Karen.\n“He has been practising the national anthem and he’s got it to a tee. He will be representing all the deaf children in England.”\nKaren said his classmates at Westgate had been ‘ecstatic’ for him.\n“Cleton is counting the sleeps. He loves football and he is making a sign to hold up. He wants to ask for Mary Earps’ gloves,” said Karen.\n“It is very exciting, we are very, very proud. Just to see him out there on the pitch will be wonderful. It will be amazing.”\nThe match will be screened live on ITV1 and streamed on ITVX.",
  "word_count": 437,
  "scraped_at": "2026-02-14T13:05:10.814660"
}