{
  "article_id": "848a197ac84d",
  "url": "https://bleacherreport.com/articles/10145155-uswnt-vs-england-top-storylines-and-box-score-predictions-for-2024-friendly",
  "title": "USWNT vs . England : Top Storylines and Box Score Predictions for 2024 Friendly",
  "date": "20241129T200000Z",
  "domain": "bleacherreport.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Featured Video\nHarper's Rising Stars Game-Winner 🔥\nUSWNT vs. England: Top Storylines and Box Score Predictions for 2024 Friendly\nThe United States women's national team faces its biggest test since the Summer Olympics on Saturday against England.\nThe trip to Wembley Stadium in London to face the Lionesses is part of a two-game European swing in which the Americans will also take on the Netherlands.\nEmma Hayes' side cruised on home soil in three post-Olympic matches, but it was expected to win all of those contests.\nEngland is the No. 2 team in the FIFA women's world rankings behind the USWNT, and it will provide the Americans with one of their toughest matches of the calendar year.\nUSWNT vs. England Info\nDate: Saturday, November 30\nStart Time: 12:20 p.m. ET\nTV: TNT\nLive Stream: Max\nTop Storylines to Watch\nThe USWNT will do battle with England with a short-handed attack.\nLynn Williams is the only striker on the roster with more than 20 international appearances and a double-digit goal tally at the international level.\nSo, Saturday should provide opportunities for Jaedyn Shaw and Alyssa Thompson, among others, to shine up top.\nSophia Smith, Mallory Swanson and Trinity Rodman have done the bulk of the scoring for the USWNT in 2024, but none of them are on the roster due to injury concerns and the recent conclusion of the long 2024 National Women's Soccer League season.\nConversely, England has Beth Mead, Alessia Russo and Chloe Kelly to choose from at forward. They have 60 international goals between them.\nThe Americans will be at a disadvantage in the scoring department, but they will still have Lindsey Horan anchoring the midfield and a majority of their first-choice defenders available.\nHoran, Naomi Girma, Emily Fox and others in defense and midfield will be the most important players on Saturday.\nThe onus will be on defending against an England squad that scored on multiple occasions in three of its last four games.\nThe USWNT has five clean sheets since the start of the Olympics, but it did leak in a goal each in two friendlies against Iceland in October.\nA shutout win would be the ideal outcome in Hayes' return to England. She had managed the Chelsea women's team for the last 12 years before joining the USWNT.\nIt would be more of a statement result than any other post-Olympics final score, but the Lionesses pack a ton more firepower up front and that could be the difference in what is expected to be a close game.\nPrediction: England 2, USWNT 1",
  "word_count": 427,
  "scraped_at": "2026-02-14T12:18:24.062173"
}