{
  "article_id": "84a5ec69771e",
  "url": "https://theathletic.com/4725413/2023/07/27/keira-walsh-england-marshalled/",
  "title": "Keira Walsh is being marshalled more often – but she has adapted her game to remain influential",
  "date": "20230727T130000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "“I think when I was younger I would have thought it was always about trying to keep the ball, playing the perfect pass and trying to score the perfect goal,” says Keira Walsh, the conductor of England’s midfield at this Women’s World Cup.\n“But now, when it comes to those crucial games, it doesn’t matter how you score or how you win. Against Spain (in the 2022 European Championship quarter-final), we didn’t have the most possession — but we won.”\nAdvertisement\nEven with that caveat, moments at last summer’s Euros still came close to perfection. Take Walsh’s long-range assist to Ella Toone for the opening goal against Germany in the final — the pass which transformed her from a household name in women’s football to a household name in British sport.\nBut recent months have seen a need for that pragmatism. Amid injuries, retirements and tactical changes, the Barcelona midfielder is one constant for these transitional Lionesses. England’s 1-0 win over Haiti on Saturday in their group stage opener was terse and dogged; more flawed than fluid.\nWalsh was marshalled by the talented pairing of teenage star Melchie Dumornay and captain Nerilia Mondesir, and had one of her quietest games in an England shirt. Of 75 offers Walsh made for the ball, she only received it 42.7 per cent of the time, as she was marked into the periphery of the match. She was only sixth for touches. It is no secret that Walsh is England’s aqueduct: dam her, and you block their attack.\nAs the graphic below shows, Walsh had to drift into wider positions to evade Dumornay and Mondesir enough to receive the ball, with most of her touches coming in a more advanced left half-space position.\nCompare this to her touch map for the whole of last summer’s Euros. Most came in central areas as she exerted her influence on the tournament.\nWalsh acknowledges teams are trying to shut her down more often — a pattern she noticed towards the latter stages of those Euros.\n“I think I was used to it at Man City, it happened quite a lot in the WSL,” she explained, before rowing back slightly. “I don’t necessarily think it’s just me, I think a lot of teams are trying to stop holding midfielders in general because that’s where football is going now, a lot of teams play through midfield.”\nAdvertisement\nIf the midfield is a game of chess, the last 12 months have made it clear opposing teams see Walsh as England’s queen of the board. In the Euros semi-finals, Sweden employed Kosovare Asllani to keep her shackled.\nHere, as Walsh picks it up, Asllani sprints across to shut her down…\n…and receives support from the central midfielders behind her, blocking off the second level, so Walsh is forced to play it safely to left-back Rachel Daly.\nThough England were eventually comfortable 4-0 winners on the night, Sweden enjoyed significant success in the game’s early stages, forcing Mary Earps into a string of saves. To an extent, a blueprint was being drawn, although each team approached it slightly differently.\nIn the Euros final five days later, Walsh said she found Germany’s decision to go player-for-player difficult. In a 2-0 friendly loss to Australia back in April, this World Cup’s co-hosts opted to set up Sam Kerr and Mary Fowler in a tight pairing when defending in their 4-4-2.\nWhen Walsh received the ball, she would be trapped in a pincer movement by the two Australian forwards.\nThat match was England’s first loss under Sarina Wiegman. Though Kerr — currently out injured — is one of the world’s most talented attacking players, Walsh says this tactic is symptomatic of the way the roles of forwards within the game are changing.\nDefensive midfielders would once have been picked with the aim of shutting down the opposition striker. Now, strikers are being selected, in part, for their ability to press defensive midfielders.\n“When I was younger, and maybe in the younger age groups in England, it was more about stopping the counter-attacks and breaking up play,” Walsh says. “That’s not my strength as a holding midfielder; it’s bringing other players into play and setting up attacks for our team.\nAdvertisement\n“I think the game has changed as a whole, but I’ve got more influence from the Spanish in terms of how they’ve always played, and the Pep (Guardiola) influence has always helped me.”\nHaiti’s approach was perhaps most similar to that employed by Brazil during April’s Finalissima. There, in a 1-1 draw after which England won the trophy on penalties, Brazil used second-striker Bia Zaneratto to close Walsh down.\nAt the weekend, Haiti’s 4-1-4-1 used Dumornay, playing as one of two advanced midfielders, in the same role. As well as being the Caribbean nation’s most potent attacking threat, she produced more pressures than any of her team-mates.\nIn many ways, these approaches are working.\nEngland have not scored from open play in 337 minutes now. Compare that to the fairground ride of last summer, in which they scored 22 times in six matches at the Euros, 18 of them from open play, underpinning Walsh’s importance.\nWalsh attempted the second-most passes, behind only captain Leah Williamson, during that tournament and was top for pass completion rate (88 per cent). She was directly involved in 31 shot-ending sequences and seven goal-ending sequences, ranking in the top two English players for both metrics.\nWilliamson’s absence from this World Cup through injury is a major reason for England’s lack of fluency — when fit, she is the team’s best ball-playing centre-half. As Walsh explained to The Athletic in an interview last year, when she is marked, that leaves space for Williamson to step up and play the pass. Jess Carter, Williamson’s replacement here, is not as assured offensively, though Walsh rejects using this as an excuse.\n“Yeah, people speak about Leah and she’s been a constant for England,” she argues. “But Jess has come in and done a really good job. She stopped a lot of the counter-attacks for us. I spoke about it to Sarina (Wiegman) and there have been a lot of changes. The quality level, for me, hasn’t dropped though.”\nAdvertisement\nAfter a player-of-the-match performance in that Euros final, it would be easy for Walsh to think her game had peaked that day at Wembley. There, she faced Lena Oberdorf, one of the other leading defensive midfielders in the world, noted for her physicality. But Walsh’s gym work — targeted on the specific requirements of her position — is just one way in which she is trying to ensure her career is one of constant regeneration and reinvention.\n“Maybe teams think I don’t like the physical game as much but, from playing in Spain, they are more tactical like that and look to do that a bit more,” she says. “The training we do in the gym is a lot more focused on holding players off when you have the ball.\n“That’s something I’ve got better at and hopefully I can keep improving on in terms of whether players are trying to stop me, I can hold my own.”\nThat certainly occurred against Oberdorf. Walsh told The Athletic that, counter-intuitively, she finds it “easier when a player’s tighter because I can feel them on my back and I know where to turn”.\nHere, during extra time, she feels her German counterpart’s presence…\n…and flicks the ball over her head.\nThis reinvention has not just been physical. Alluding earlier to her world-record move to Barcelona last summer, Walsh says that experiencing the Catalan style directly has added more nuances to her play.\nEarlier this month, she described to The Guardian how she was asked to stay central at City, while Barcelona had “changed what it means to be a No 6”.\nExpanding on that answer on Wednesday, she said: “I think it’s about picking up smarter spaces and dropping into different areas and maybe not staying so set. Maybe it’s about going forward for it to come back to me and getting the sets and finding different ways to get me on the ball rather than a pass from A to B.”\nAdvertisement\nHaving begun her youth career as a right-footed left-back, Walsh likes dropping into that zone to pick up the ball. Despite being only 26, she is now one of the squad’s most experienced players and has been given a degree of licence by Wiegman to find those pockets of space, drawing on her experiences last season with Barcelona.\n“It’s something that Sarina encourages — but obviously within reason,” she says, before laughing. “If I start roaming onto the wings or into the No 9 position, she wouldn’t be too happy about it! But I think because she’s been here a while and has put her tactics and structures in place, there’s a bit more freedom within that. She encourages the more experienced players to coach a bit and put more onus on us on the pitch.\n“If we feel things (during a match) that she can’t, then she is more than happy for us to help and find solutions. I’ve probably noticed that a little bit more at this tournament with her.”\nIn some ways, this explains the relative caution Walsh displayed against Haiti.\nThere, up against the explosive transitional power of Dumornay, the risk of giving the ball away was greater than ever. Though Walsh was not at her most creative, her pass completion was still at 94 per cent, indicating a prioritisation of safety over progression.\n“You don’t want to be running back 60 yards to your own goal every time you’re attacking,” she says. “We spoke about that against Haiti: if we kept the ball better in tighter situations around their box, we wouldn’t have to defend as much.”\nWalsh’s previous World Cup came with difficulties and she received criticism for her performances in then-manager Phil Neville’s midfield. After that 2019 tournament in France, she said she had questioned why she played the sport — though it was striking that her best performance came against the USA, the eventual champions, in a 2-1 semi-finals loss.\nAdvertisement\nThe abiding hope is that this World Cup will lead to better memories, even if England may need to change things around Walsh to achieve that. Though Wiegman does not like to change a winning team, as explored by The Athletic earlier this week, there are options on the table as England search for the best way to replace Williamson’s influence on ball progression.\nAlex Greenwood, who started at left-back against Haiti, is also the best progressive centre-back in the squad and could shift inside for future games. Attacking midfielder Toone, out of sorts in the latter half of the 2022-23 WSL season, might be replaced by a more distributive colleague. Alternatively, Wiegman may borrow a lesson from Barcelona counterpart Jonatan Giraldez, who has, on occasion, moved right-back Lucy Bronze into midfield positions to support Walsh.\n“Bronze covers a lot of kilometres on the pitch and is able to give us a lot both on the offensive and defensive end,” Giraldez said earlier this season. “She gave us the exact energy we needed. I’m sure she can deliver playing on inside positions, too.”\nFor her part, Walsh feels Denmark, their opponents tomorrow (Friday) in the middle group game, could be better for England’s style of play than Haiti were. “I think it probably suits the way we play a little bit more as there will be more spaces rather than teams who sit in,” she says. “That always makes it difficult. As a player, it can be frustrating at times when you’re trying to find those passes and you can’t.”\nSuch is the burden of being England’s pivot.\nDuring the 2019 World Cup, hugely experienced team-mate Karen Carney sought out Williamson and Walsh, telling them to enjoy that tournament because they would be senior players four years later, with the pressure on them. The two best friends did that, hiring scooters with Georgia Stanway to speed around Paris, something Walsh baulks at doing now in Australia.\nWhat Walsh might not have realised then is that the pressure now would not just be psychological — she would endure more than ever on the pitch as well.\nWhen you are a defensive midfielder, this is the contract you sign in stud marks and bruises.\n“For me, I want to be playing in those tighter situations and really testing myself,” she says. “I enjoy the challenge.”\n(Top photo: Joe Prior/Visionhaus via Getty Images)\nFollow the Women’s World Cup on The Athletic for more stories like this delivered to your feed.",
  "word_count": 2112,
  "scraped_at": "2026-02-14T13:01:13.427926"
}