{
  "article_id": "84b93615aa41",
  "url": "https://www.marketscreener.com/quote/stock/FAIR-ISAAC-CORPORATION-5523345/news/Free-Financial-Literacy-Event-Hosted-by-FICO-Comes-to-Columbus-in-Partnership-with-Local-Partners-t-47481757/",
  "title": "Free Financial Literacy Event Hosted by FICO Comes to Columbus in Partnership with Local Partners , the U . S . Soccer Foundation , and Chelsea FC During Pre - Season Summer Tour",
  "date": "20240726T123000Z",
  "domain": "marketscreener.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Congresswoman Joyce Beatty to make appearance at the Chelsea match to bring awareness to financial education\nGlobal analytics software leader, FICO, will host two free credit education events in Columbus on August 3rd - Score A Better Future™ (SABF) for adults and, in partnership with the Central Ohio Youth Sports Collaborative, a Score A Better Future Fundamentals financial education workshop for teens. These events aim to provide Columbus residents with the knowledge and resources necessary to enhance their understanding of their future financial health, including the role of credit and an overview of the FICO® Score, the credit score used by 90% of top US lenders to make lending decisions.\nIn collaboration with Chelsea FC and the U.S. Soccer Foundation, as part of FICO’s ‘Fields of Financial Empowerment’ tour, participants of SABF and Fundamentals workshops will get the opportunity to attend the Chelsea vs Manchester City match for free, held after the workshops at the Ohio Stadium. Congresswoman Joyce Beatty, co-chair of the Financial Literacy and Wealth Creation Caucus, will be present at the pregame ceremony of the Chelsea vs Manchester City match to help kick off the fifth match of Chelsea’s pre-season tour.\n\"FICO's financial literacy events will be a great opportunity to showcase the importance of financial literacy. For Columbus area residents, understanding how to build their credit scores and planning for their financial goals are the first steps towards financial success,\" said Congresswoman Beatty, co-chair of the Financial Literacy and Wealth Creation Caucus.\nThe Fields of Financial Empowerment tour aims to increase access to financial literacy education across the United States, addressing the need to enhance understanding of credit and personal finance through a sequence of workshops. FICO's Score A Better Future program aims to educate attendees on the impact of credit scores on lending decisions, help attendees understand the key components of the FICO Score, strategies for improving financial health understanding, and the myths and facts surrounding FICO Scores. FICO’s Score A Better Future Fundamentals program is designed to educate teens on how to develop good financial habits and understand the role of FICO Scores and credit. With the support of the U.S. Soccer Foundation and local organizations, teens are brought to these workshops to gain valuable financial knowledge.\n“Throughout the Fields of Financial Empowerment tour, we have been privileged to connect with individuals eager to learn how to achieve their financial goals through FICO’s financial and credit education sessions,\" said Jenelle Dito, Client Services at FICO Scores. \"FICO remains dedicated to equipping youth and adults alike with resources for personal finance and credit education, preparing them for a prosperous future.\"\nFICO is dedicated to expanding access to financial literacy education, providing communities across the nation with the tools needed to empower individuals to reach their financial goals.\nThe Columbus SABF event, which is open to the public, will give attendees the opportunity to hear from Money Management International (MMI) and have an opportunity to set up a free consultation with MMI to get their FICO® Score, discuss their credit report, and set a plan to achieve their financial goals.\nOther FICO partners for the event include:\n-\nCentral Ohio Youth Sports Collaborative (local)\n-\nCentral Ohio African American Chamber of Commerce (local)\n-\nFreedom Equity Inc (local)\n-\nColumbus Empowerment Corporation (local)\n-\nWomen's Center for Economic Opportunity (local)\n-\nColumbus Financial Empowerment Center (local)\n-\nConsumer Action (national)\n-\nNational Consumers League (national)\n-\nDiversified Resource Network (national)\n-\nNational Association of Women Business Owners (national)\n-\nSmall Business Roundtable (national)\n-\nSociety for Financial Education and Professional Development, Inc. (national)\n-\nFuture Business Leaders of America (national)\n-\nU.S. Soccer Foundation (national)\nWho: FICO, U.S. Soccer Foundation, Chelsea Football Club, and the Central Ohio Youth Sports Collaborative.\nWhat: Score A Better Future and Score A Better Future Fundamentals are free community education and financial empowerment events by FICO in partnership with national and local nonprofits\nWhen:\nScore A Better Future: Saturday, August 3, 2024 at 1:00 - 2:30 p.m. EDT.\nScore A Better Future Fundamentals: Saturday, August 3, 2024 at 3:00 – 4:30 p.m. EDT.\nWhere:\nThe Ohio Union\n1739 N High St,\nStudent Alumni Council Room Columbus,\nOH 43210\nTo register for the Score A Better Future event or get more information on the program, visit: https://www.fico.com/sabf/workshops-designed-for-you.\nTo learn more about the partnership with Chelsea Football Club, visit: https://www.fico.com/en/newsroom/fico-kicks-national-fields-financial-empowerment-summer-tour-chelsea-football-club-and-u-s\nAbout Score A Better Future ™\nScore A Better Future is FICO’s free credit education program hosted across the country to teach consumers about the key ingredients in the FICO® Score, and connect them to free, one-on-one counseling from certified not-for-profit counselors tailored to their individual financial health and goals.\nScore A Better Future Fundamentals Helps to Bridge the Financial Literacy Gap\nUsed by 90% of the top U.S. lenders, FICO® Scores help millions of people gain access to the credit they need to do things like get an education and make major purchases. Fundamentals helps empower students with financial literacy and the knowledge to achieve their financial goals.\nEducators at all accredited middle and high schools can receive the Fundamentals curriculum and supporting materials through the Fundamentals website, which will also provide the background knowledge and understanding for teachers to successfully educate students while strengthening their own understanding of credit. To learn more about Fundamentals visit https://www.fico.com/sabf/fundamentals.\nAbout FICO\nFICO (NYSE: FICO) powers decisions that help people and businesses around the world prosper. Founded in 1956, the company is a pioneer in the use of predictive analytics and data science to improve operational decisions. FICO holds more than 200 US and foreign patents on technologies that increase profitability, customer satisfaction and growth for businesses in financial services, insurance, telecommunications, health care, retail and many other industries. Using FICO solutions, businesses in more than 100 countries do everything from protecting 4 billion payment cards from fraud, to improving financial inclusion, to increasing supply chain resiliency. The FICO® Score, used by 90% of top US lenders, is the standard measure of consumer credit risk in the US and has been made available in over 40 other countries, improving risk management, credit access and transparency.\nLearn more at https://www.fico.com/en.\nJoin the conversation at https://x.com/FICO_corp & https://www.fico.com/blogs/.\nFor FICO news and media resources, visit https://www.fico.com/en/newsroom.\nFICO is a registered trademark of Fair Isaac Corporation in the U.S. and other countries.\nhttps://cts.businesswire.com/ct/CT?id=bwnews&sty=20240726486322r1&sid=frzb2&distro=ftp\"/>\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240726486322/en/",
  "word_count": 1061,
  "scraped_at": "2026-02-14T12:09:32.824013"
}