{
  "article_id": "84c66fb626a8",
  "url": "https://www.bbc.co.uk/news/uk-england-tyne-64589724",
  "title": "Jarrow : Jill Scott opens first pitch named after Lionesses",
  "date": "20230210T080000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former Lioness Jill Scott has officially opened the first of 23 new grassroots football pitches named after the Euro 2022 winning squad.\nThe Sunderland-born star did the inaugural honour in Jarrow, South Tyneside, which is hoped to inspire the next generation of female stars.\nThe Jill Scott pitch was unveiled at Perth Green Community Centre.\nThe facilities are being funded by the government, the FA and the Premier League's Football Foundation.\nThey will be built in or around the hometowns of the winning players.\n\"It's an absolute honour to have a site that will be used by so many people in the local community named after me in the place I used to play,\" said Scott, who also won I'm a Celebrity... Get Me Out of Here!\nScott retired after England's Euros success, having earned 161 England caps while also playing for Manchester City, Aston Villa and Everton as well as representing Great Britain at two Olympic Games, in 2012 and 2020.\nFollowing her new-found TV fame, the 36-year-old said she was determined to be remembered for her sporting success and is planning a return to the training pitch.\n\"When I walk past people, they're, 'there's that girl from the jungle',\" she said.\n\"I do still want to be known for my football, so I'm going to be getting back on the grass and coaching very soon and I'm really excited about that.\"\nThe retired midfielder recently revisited her old school, Monkwearmouth Academy, and praised staff for helping her achieve her sporting dream.\n'Inspired a generation'\nCulture Secretary Lucy Frazer said: \"The Lionesses thrilled the nation with their historic Euros victory, delivering the nation's first major tournament win in more than 50 years.\n\"They have inspired a generation of women and girls to believe they too can achieve their dreams.\"\nSue Campbell, the FA's director of women's football, added that the victorious England side had \"changed the landscape\".\n\"The success of the team wasn't just about lifting the trophy, it was also about changing the path for women and girls who want to or currently play football up and down the country,\" she said.\n\"Jill Scott has had an incredible career and no doubt inspired many people in her hometown to take up the game, so I'm sure the Jill Scott pitch will be extremely popular.\"\nEngland will head for Australia and New Zealand for the 2023 World Cup this summer as one of the favourites.\n\"I'm so excited for that next generation of players and you know what? I don't have to sit on the fence any more, so I'm going to say England are going to win the World Cup,\" Scott said.\nFollow BBC North East & Cumbria on Twitter, external, Facebook, external and Instagram, external. Send your story ideas to northeastandcumbria@bbc.co.uk, external.\nRelated topics\n- Published8 February 2023\n- Published9 January 2023\n- Published28 November 2022",
  "word_count": 479,
  "scraped_at": "2026-02-14T13:03:23.184877"
}