{
  "article_id": "84c85aa841d4",
  "url": "https://punchng.com/nigerians-never-give-up/",
  "title": "Nigeria Epic Comeback Spirit : Super Falcons Triumph",
  "date": "20250729T010000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When you ask Nigerians to mention one word that describes them appropriately, the word they readily mention is “resilience”. When asked to use more descriptive words, they use different words like never-say-die spirit, can-do spirit, fighting spirit, determination, etc. This trait was replicated over the weekend when the Nigerian female team, the Super Falcons, came from a two-goal disadvantage to a 3-2 win over host nation Morocco. With that, they won this year’s Women’s Africa Cup of Nations, making it a record tenth time.\nTwelve minutes into the match, the Super Falcons had conceded a goal. By the 24th minute, they conceded the second goal. Millions of Nigerians watching the match across the world were disappointed. This type of match was not what they expected from the Super Falcons. Most viewers either walked away from the screen or changed channels. Conceding two goals early in the first half to the host country meant that the Super Falcons could end up being beaten by as many as five goals, as they did to Zambia last week. Even though most Nigerians wanted the female national team to win the cup for the tenth time, they would not feel so bad if the Falcons lost marginally. The loss would still have guaranteed them a spot in the Women’s World Cup. What Nigerians did not just want was an embarrassing defeat.\nThe match ended 2-nil in the first half. The despondency among Nigerians was so bad that a reporter with the Voice of Nigeria filed a report on the website of the radio station that Nigeria had lost the final match two goals to nil to Morocco. The reporter might have felt that it was a lost case. Or perhaps the reporter had checked the online scores and saw two goals against Nigeria and “final” and thought the “final” meant the final scores. But the “final” was referring to the final match. Another reason could be that the reporter was trying to beat a deadline. Imagine the embarrassment of that reporter. Imagine the embarrassment to the establishment.\nBy the second half, the Falcons began the recovery journey. They scored the first goal and then equalised. Two minutes before the end of the match, they scored the winning goal. Those who had concluded that Nigeria had been defeated were pleasantly surprised at the terrific comeback of the Falcons. That victory saved Nigerians the taunts and ridicule that would have been shot at them by many African countries. These days, on social media, it seems as if the whole of Africa is waiting and praying for Nigeria to fail at any competition so that they would be ridiculed. For some unknown reasons, many African countries believe Nigeria is carting away most of the laurels in Africa, especially in entertainment: music, movies, pageants, comedy, sports, etc.\nIn addition to being victorious, Nigerians have a strong social media presence, which they use to their advantage. Many Nigerians are known to tell citizens of other countries that they are small and inconsequential. In response, all the countries make a mockery of Nigeria’s mediocre leadership, terrible electricity supply, poor water supply, derelict facilities, and a strong desire to leave Nigeria for other countries (japa syndrome). These other African countries mock Nigerians as the dwarf of Africa (a reference to Nigeria’s tag line as the giant of Africa).\nNigeria’s terrific comeback is a trait that Nigerians carry with them wherever they are. As one of the most blessed countries of the world, Nigeria punches far below its weight. The country’s wealth, excellent human resources, and passion for success do not reflect in its fortunes. It is difficult to explain how a country that is so blessed and rich ranks among the poorest in the world. It’s hard to explain how a country that produces some of the best brains in the world cannot solve basic problems of electricity supply, roads, education, hospitals, schools, etc. It is, therefore, shocking to many non-Nigerians that people who have these exceptional human resources regularly elect the worst among themselves as leaders. In addition, they proudly defend these mediocre leaders, no matter what they do.\nThe exemplary performance of the Super Falcons was not a flash in the pan for Nigeria. Nigerian football teams have displayed such traits on many occasions. The most memorable was in 1989 when Nigeria’s U-20 team came back in the second half from a four-goal deficit to equalise and beat the USSR in a penalty shootout. It was named the Damman Miracle by legendary football commentator, Ernest Okonkwo. At the CHAN 2014 in South Africa, Nigeria also did a similar thing to Morocco in the quarter final. Morocco led by three goals at halftime. Nigeria eventually equalised, forcing the game into extra time. Nigeria scored an extra-time goal to beat Morocco.\nBut the comebacks that gave Nigeria the highest level of joy were at the 1996 Olympics in Atlanta. Nigeria’s U-23 team faced Brazil at the semi-finals. Twelve minutes to the end of the match, Nigeria trailed by three goals to one. At the nick of time, Nigeria equalised, pushing the match into extra time. Then Nigeria scored the winning goal. In the final, Nigeria faced Argentina. Argentina led Nigeria two goals to one 16 minutes before the end of the match. Nigeria equalised and then scored the winning goal to win the gold medal in football.\nThere are many instances of such comebacks, but these ones are enough to illustrate Nigeria’s capacity for not giving up. Hope is the oxygen that drives Nigerians. Nigerians believe that once there is life, there is hope. We believe in never giving up. But this can be an advantage as well as a disadvantage. As an advantage, it propels Nigerians to success locally and internationally. They don’t see challenges as barriers. They see them as stepping-stones. Once Nigerians make up their minds on what to achieve, they keep at it until they achieve success.\nThe downside in this is that Nigerians allow their political, religious and social leaders to get away with almost anything. They prefer to endure rather than challenge those who are misgoverning them, stealing their commonwealth, dehumanising them and denying them their rights and privileges. Nigerians are willing to take all forms of indignities; they are willing to leave everything to God. Nigerian leaders have discovered this weakness and have continued to exploit it for decades.\nThe two never-failing tools they use to achieve these are ethnicity and religion. To ensure that the followers never unite to have a voice, the politicians play up issues of ethnicity and religion. They end up dividing the people into “We versus they”. With that disunity, the people resigned to fate after some protests. They grumble and complain and leave everything to God.\nThe Super Falcons have brought joy and glory to Nigerians and Nigeria at a critical time in their history. Nigerians are undergoing hard times and anything that can bring some temporary happiness to them is highly needed. But it is important to note that Nigerians deserve a better life than what they currently have. They work so hard to achieve some measure of comfort. They have passed through a lot over the decades. They deserve a turnaround.\n- X: @BrandAzuka",
  "word_count": 1208,
  "scraped_at": "2026-02-14T12:12:27.285871"
}