{
  "article_id": "84ce440261ca",
  "url": "https://www.geosuper.tv/latest/48404-international-transfer-spending-hits-record-high-fifa",
  "title": "International transfer spending hits record high : FIFA",
  "date": "20250903T210000Z",
  "domain": "geosuper.tv",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Reuters\nSeptember 04, 2025\nTransfer spending broke new ground in the close-season window when clubs around the world spent nearly $10 billion on international transfers, global soccer body FIFA said in a report released on Wednesday.\nClubs recorded nearly 12,000 international transfers where total spending on fees amounted to $9.76 billion, FIFA said, representing an increase of more than 50% compared to the same period in 2024.\nWomen's soccer also broke records with more than 1,100 international transfers where the fees exceeded $12 million.\nOrlando Pride signed winger Lizbeth Ovalle, who became the most expensive transfer in women's football when the Mexican moved from Liga MX club side Tigres Femenil for a fee of $1.5 million.\n\"We have observed a transfer market in full swing both in men's and women's football,\" Emilio Garcia Silvero, FIFA's Chief Legal & Compliance Officer, said in a statement.\n\"While this is a relevant development in men's football a year ahead of the FIFA World Cup 2026, the increasing figures in women's football transfers are equally remarkable as they confirm the exponential growth of the women's game at club level.\"\nEngland's Premier League was once again front and centre in the transfer market, spending more than $3 billion in transfer fees in the last three months.\nGerman clubs alone received $893 million from their English counterparts, highlighted by Florian Wirtz's move from Bayer Leverkusen to Liverpool in a deal reportedly worth 116 million pounds ($156.70 million) with add-ons.\nLiverpool also signed Hugo Ekitike from Eintracht Frankfurt while Newcastle United signed German forward Nick Woltemade from VfB Stuttgart in a club-record deal, with both deals reported to be 69 million pounds.\nGermany were second in total spending at $980 million while Italy were third at $950 million. In terms of incoming transfers, England had 535 players come in followed by Portugal (479) and Brazil (425).",
  "word_count": 310,
  "scraped_at": "2026-02-14T13:22:24.187912"
}