{
  "article_id": "84ddc4f84422",
  "url": "https://washingtoncitypaper.com/article/597010/with-groundbreaking-training-program-dc-forensic-nurse-examiners-provides-trauma-centered-care/",
  "title": "With Groundbreaking Training , DC Forensic Nurse Examiners Provides Trauma - Centered Care",
  "date": "20230329T214500Z",
  "domain": "washingtoncitypaper.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "If an adult is sexually assaulted in the District, one group of specially trained nurses is called upon to perform a forensic exam should the survivor wish to receive one. And sexual assault occurs regularly in D.C.\nSince 2013, that group, DC Forensic Nurse Examiners, has served approximately two patients per day, totaling more than 7,825 calls for services from survivors of sexual assault, intimate partner violence, and family violence. Forensic nurses work at the intersection of medicine and criminal justice. They treat patients experiencing health consequences associated with surviving violence while also addressing evidence collection needs. In addition to their medical work, forensic nurses often provide testimony for legal proceedings relative to the alleged crime.\nDCFNE works out of MedStar Washington Hospital Center—the only place in the District where a survivor can receive a sexual assault forensic exam. The organization also houses an outpatient services clinic in its office space, which provides exams for intimate partner and family violence, as well as forensic photography. (DCFNE and their clinic are currently located in temporary office space in Takoma; within the next two months, the organization will relocate to NoMa, where they will share a building with DC SAFE and the Safe Space Shelter.)\n“As forensic nurses we’re all trained to work with people who experience violence,” DCFNE’s clinical programs director, Sarah Bristol, explains. Guided by trauma-informed care, which centers patients’ needs, the survivor guides the entire exam process, choosing the available services with which they’d like to proceed. Consent is asked for at each step. “They can stop, take a break,” says Bristol. “They can change their minds.”\nAcross the country, the specialty training for forensic nurses, sometimes referred to as sexual assault nurse examiners or SANEs, includes a mandatory 40-hour course. Two years ago, DCFNE launched a groundbreaking initiative: Their trainings are now staffed with forensic teaching associates, real people who are hired by DCFNE and trained to have sexual assault forensic exams conducted on them in order to provide critical feedback to novice nurses.\n“The cervix isn’t this perfect round doughnut, like you’re led to believe in school,” says Shanay Tymus, one of DCFNE’s eight forensic teaching associates. “Just having these facilities really helps enhance the practice and makes the nurses more comfortable and more informed and more skilled when actually working with the survivors.”\nTymus trains nurses on pelvic exams, covering everything from photo documentation of physical injuries and examining external body parts to speculum insertion and sample collection. Before becoming a forensic teaching associate, Tymus also went through the class with associates. “I was very apprehensive,” she recalls, “and my teaching associate was really good and let me know: ‘That doesn’t hurt.’”\nDespite clearly stating DCFNE training includes performing exams on real people, Bristol says, some trainees are still shocked when they arrive. But for the most part, “they seem really excited at the opportunity to be able to practice on a real person,” Tymus offers. “Having somebody who can give you that immediate feedback, letting them know when things might be a little bit more painful than others, helping them to make sure that they’re using trauma-informed language at all times. And again, just building that confidence.”\nToday, these teaching associates are the foundation of the training DCFNE—which just celebrated their 10th anniversary in February—offers. Prior to 2013, the city’s Office of Victim Services and Justice Grants, which assists all crime victims and funds the various organizations serving those victims, oversaw what was then the DC SANE Program. Though DCFNE’s executive director Erin Pollitt didn’t join the organization until 2016, she believes the split came about to ensure the city’s forensic nurses could hone their expertise to deliver high quality, reliable services. “The training that goes into doing this work and the oversight that’s required, it just makes sense that nurses would lead a program like this,” she says. “District government employees, they are hardworking, but they are not nurses. And they are not expert nurses in this [field].” (OVSJG is a major funder of DCFNE.)\nPut on roughly twice a year, their main 40-hour training is open to all—DCFNE has trained nurses from more than 20 states and several other countries. But forensic teaching associates are also part of DCFNE’s skills labs and training refreshers, available to both their own nurses and Children’s National Hospital’s forensic nurses, who serve all youth under 13 (teens between 13 and 17 can be treated by either organization). According to Pollitt, DCFNE was “certainly the first,” and remains the only, in the region to have forensic teaching associates in SANE trainings.\nIn other areas of medicine, the teaching associate model isn’t new. Gynecological and urological teaching associates often train medical students how to perform practices such as pelvic exams. Pollitt first learned of the forensic teaching associates model in 2018 while attending Isle Polonko’s best practices session at the International Association of Forensic Nurses conference. Polonko, a pioneer in the field of forensic teaching associates, worked with DCFNE via a grant in early 2020—right before the pandemic took hold—to train the nonprofit’s first class of associates. Pollitt credits its success to Bristol’s continued efforts to grow and maintain the program since its inception.\nThe alternative model in forensic nurse training relies on the hiring of a “medical model” who allows students to practice on their body, under the supervision of a nurse. The teaching associate model is the only one in which the “model” takes an active role in instructing while using their own body. “Before this model, it was a nurse preceptor teaching on a person, which is really objectifying that person,” says Bristol, who calls the teaching associates model “brilliant,” in part, because the associates are “teaching to their own anatomy.” With the variety of associates, trainees get to practice on eight different people with different body types and backgrounds, which prepares nurses to not just perform actual exams but to help the diverse range of DCFNE’s patients.\n“In a lot of media coverage about survivorship and sexual assault in particular, there is this lens that trains very heavily on the experiences of women and the supposition that [it’s] mostly White, middle class women who are experiencing assault, when that doesn’t reflect who we serve, and it doesn’t reflect who’s safe in our exam room,” says DCFNE’s clinical coordinator Bianca Palmisano.\nOf DCFNE’s Fiscal Year 2022 patients who chose to share their race, 76 percent identified as a person of color while 16 percent identified as White. Nine percent of their patients identified as men. Palmisano credits DCFNE’s commitment to making their space and services safe for queer and trans people, as well as people with disabilities, those who don’t speak English, and people who are undocumented. “We know the world’s not a safe place for those folks, but we try really hard to create a little cocoon for them,” Palmisano says.\nDCFNE’s holistic approach to forensic nursing is in line with the gradual shift to prioritizing sexual violence survivors’ overall care above evidence collection. “We can offer so much more than that box,” says Pollitt who began her career as a SANE in 2011. “When I started, and even some places now, put a very large focus on a sexual assault kit that may or may not move forward for testing based on patient’s wishes, and may or may not yield something if it does get tested, and may or may not go forward in the criminal justice system.”\nThough forensic nursing is typically linked with reporting, numbers suggest sexual assault survivors in the District are already seeking out services without involving law enforcement. Metropolitan Police Department’s year end crime data for 2022 lists 158 reports of sexual abuse for the year; in 2021 there were allegedly 181 or 176, depending on which MPD report you look at. Yet DCFNE received 513 SANE requests in FY22 (Oct. 1, 2021 to Sept. 30, 2022). In that time, DCFNE responded to a total of 831 calls for nursing services.\nNumbers shift when it comes to intimate partner and family violence, however. In FY22, DCFNE had 318 calls for domestic violence services while MPD took 9,497 domestic violence-related offense reports and made 4,730 arrests for domestic violence-related offenses in calendar year 2021. In calendar year 2022, MPD took 9,565 domestic violence-related offense reports and made 4,477 arrests.\nAs clinical coordinator, Palmisano heads DCFNE’s outpatient clinic, which opened in 2018 and provides an alternative space that’s both quieter and more private to conduct exams for people who’ve experienced intimate partner violence or family violence. It’s the first step in DCFNE’s goal to expand services beyond hospital settings. Currently they’re talking to local universities about the possibility of offering IPV exams on campuses as well, and they’re hoping that will become a reality in the not too distant future. (Due to limited infrastructure at DCFNE’s clinic and the many government agencies and nonprofits tasked with responding to sexual assault in the city, sexual assault forensic exams are only conducted within DCFNE’s hospital space at Washington Hospital Center for the time being.)\nThough the nurses are confident they can and do make patients comfortable in an emergency room setting, they agree the clinic provides what Bristol calls “little dignities” for patients, such as private bathrooms, flexibility, and privacy, which can be especially useful for people who might want additional support with housing or other complexities surrounding intimate partner violence. “I can make people a cup of tea,” adds Palmisano.\n“There are a lot of people who don’t feel safe or comfortable going into any mainstream medical institution, especially an emergency room—they’ve experienced abuse, or various other things in that situation,” adds Jess Dick, DCFNE’s nurse manager. “I think the more we can be in the community is better for everyone and it might make them feel a little bit safer. In my ideal world, we’d perform exams all over the community, but—one day.”\nDCFNE’s clinic (and services at MedStar) are provided completely free of charge. “We don’t even have a billing department,” says Pollitt. For patients who live with their abuser or are covered under their parents’ insurance, and for whom discretion might be essential, there is no paper trail if they visit the clinic. “The only document that we generate is their medical records,” Pollitt says. “You’re really trying to go under the radar? We can do that here.”\nDick also stresses that seeking out DCFNE services does not require survivors to talk to or engage with the police or report one’s assault, despite how these services are often portrayed on TV. And, since the D.C. Council unanimously passed the Sexual Assault Victims’ Rights Amendment Act of 2019, any survivor wishing to get a sexual assault forensic exam can also ask for a trained sexual assault advocate to accompany them, regardless of whether they want to involve law enforcement.\n“Some people don’t feel safe with the police. They don’t feel like the police are going to do things to help them,” says Dick. “Working with us, we make sure they have their medications, that a physician has seen them, and there’s no serious injuries. And, if it’s a SANE, we can collect those specimens and hold on to them.”\nUnder D.C. law, DCFNE can hold rape kits—the result of a sexual assault forensic exam—and evidence from IPV exams for unreported assaults for two years, leaving survivors a window of time to decide if they’d like to pursue charges in the criminal justice system.\n“Any time that we can not close the door, is something we’re striving for,” Pollitt says when asked why survivors should seek out services if they don’t plan to report the crime. “When I say that, I mean, if you decide ‘I’m not going to document any of this,’ then that kind of does close the door, because if you don’t capture the injuries or the findings, or document them when it happens, then that’s less you can use if you change your mind in the future.”\nIt’s not uncommon for patients to be unsure of what they want to do when they meet with a nurse, but having the documentation and knowing that it’s safely in the hands of DCFNE—rather than government officials—provides a level of comfort, Pollitt says, even if they don’t want to involve law enforcement. “And if they ever need it in the future, they can call on it and retrieve it.”\nAnd they do. “They do reach out years later to have it released for various different reasons,” Dick adds.\nMore immediately, Dick says, there’s a reason nurses do this job: intimate/sexual violence directly impacts people’s health, and documentation and treatment is an important part of a person’s medical record. Aside from the effects on mental health—such as greater risks of depression, post-traumatic stress disorder, and panic attacks—recent studies show that interpersonal violence can impact physical health as well. A 2014 study found a “significantly higher prevalence of … chronic health conditions” among women survivors of sexual assault. And, according to HealthAffairs.org, the physical consequences of intimate partner violence include elevated risk for asthma, gastrointestinal disorders, and frequent headaches. Dick notes that violence can also cause high blood pressure and heart disease, not to mention the risk of sexually transmitted infections.\nIntimate partner homicide is another physical risk of intimate partner violence. In the U.S., according to the CDC, roughly one in five homicide victims are killed by an intimate partner and more than half of women homicide victims are killed by a current or former male intimate partner.\nAside from firearms, strangulation is a leading cause of intimate partner homicide. “Statistically, you’re almost eight times more likely to die from intimate partner homicide if you’ve been strangled,” says Pollitt. It’s “something we’re particularly worried about,” Palmisano adds.\nAlthough there is not always visible evidence of strangulation, forensic nurses are trained to notice signs and ask questions to deduce whether it occurred. All DCFNE patients are screened for strangulation, and of the 111 IPV exams conducted by their nurses in FY22, 54 patients had at least one strangulation attempt in their assault.\n“If it’s happened once, then it’s likely that it’s either going to happen again, repeatedly, or that this is not the first time,” says Pollitt.\nDeath is just the most extreme side effect. Dick notes that it has become more evident that strangulation alone can lead to traumatic brain injuries, often associated with the negative side effects of football. Brain injuries can cause memory loss, depression, increased risk of stroke, chronic traumatic encephalopathy, suicidality, and Alzheimer’s-like syndromes.\nBut sometimes services can be as simple as learning stretches to relieve shoulder pain or getting reconnected to a primary care provider. “We often fill a gap for folks,” says Palmisano. In its 10 years of service, DCFNE has worked to ensure survivors are getting the help they need first and foremost, which has removed some of the apprehension of seeking services because it makes the experience less clinical. Indeed, DCFNE saw a 30 percent increase in calls from 2021 to 2022, exceeding pre-COVID numbers in FY22. Pollitt posits it’s not a sign of increased sexual violence, but an increase in awareness about DCFNE’s services, which she credits largely to Palmisano’s dedication to community outreach throughout the city.\n“I’ve taught people how to splint their pinky toe,” Palmisano continues. “It’s an opportunity to catch all the little, floating pieces that they haven’t had a chance to address.”\nFor Tymus, the forensic teaching associate, even the trainings are centered around starting the healing process. “The way it’s portrayed, especially in the media, is ‘this [exam] is just going to prolong my trauma. This is something else that I’ll have to deal with.’ But how we’re trained to teach the nurses is that this is the first step to navigate away from that trauma.”\n“The entire exam, the survivor has the control to say ‘I wanna stop, I want to continue’ and I think that helps move them towards healing, should they decide to pursue a criminal case,” Tymus continues. “But if they don’t, it’s just about taking back control of your body holistically.”",
  "word_count": 2689,
  "scraped_at": "2026-02-14T12:25:13.787507"
}