{
  "article_id": "85169257cffe",
  "url": "https://www.anglocelt.ie/2025/05/23/home-improvements-from-a-winning-team-at-joe-rowley-windows/",
  "title": "Home improvements from a winning team at Joe Rowley Windows",
  "date": "20250523T153000Z",
  "domain": "anglocelt.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Home improvements from a winning team at Joe Rowley Windows\nJoe Rowley Windows & Doors was once again the proud sponsor of the ‘Team of Year’ at the Anglo-Celt Community & Sports Awards 2025.\nThe local business, which recently opened a new showroom at Church Road in Kilnaleck, specialises in a full range of replacement doors and windows, covering a wide span of budgets, from standard to high-end options.\nUpgrading windows and doors in a home can improve energy efficiency, help save money on bills and, ultimately, make a property warmer and more comfortable. Joe Rowley Windows & Doors, which employs 11 people with three vans on the road, prides itself on quality installations, and with emphasis on bespoke one-to-one customer service.\nBen Rowley, Sales Manager, says the business couldn’t be more proud to come back on board and be part of this year’s awards.\nNominated in the final this year are the ultra dominant McEvoy’s Cavan Eagles, double champions of the National Division One women’s league, who secured promotion to the Domino’s Women’s Super League next season; and the all-conquering Cavan Minor Ladies who captured the ZuCar All-Ireland U18 A Championship for the first ever time when they overcame Kerry.\nAlso shortlisted are Crosserlough GAA who steam-rolled their way through qualifying phases before running out deserving winners over Ramor United to pick up their first SFC crown since 2020; and the St Patrick’s College team that landed an historic third Corn na nÓg (U14.5) title for the school in the last 10 years with a well-deserved win over St Colman’s of Newry.\nJoe Rowley Windows & Doors were nominated for a Green award last year, and took on the mantle as sponsor for 2025. Ben says being asked to sponsor an award again is their way of “giving back” to the community.\n“We are a local company, we’re involved in supporting our community, sponsoring our local club Crosserlough and other events throughout the year. Within our staff we have lads involved, Seamus [Higgins] is involved with Mullahoran Ladies’ management team and there are others too.\n“We ourselves are a team. We have family members and friends who work for us and understand the importance of working together,” explains Ben.\n“So we understand the meaning of teamwork, as a company, as part of a wider community, and we see the value of sport within that as well. It’s all connected.”\nIn 2024 Arva GAA secured two significant victories: the AIB All-Ireland Club Junior Football Championship, and the Cavan Intermediate Football Championship.\nThey also competed in the Ulster Intermediate Club Football Championship, where they lost to Ballinderry.\nFor their incredible efforts, in representing themselves, their town and the county, presented the club with the title for The Anglo-Celt Community & Sports Awards ‘Team of the Year’ 2024.\nBen says there have been some impressive achievements in sport by teams in Cavan over the past 12 months, and all would be “worthy winners” if they are chosen to pick up the ‘Team of the Year’ prize for 2025.\n“I don’t know who is going to win it this year, there are some very strong contenders. Cavan ladies, my own club Crosserlough of which I’m a member. As a county we’ve a lot to be proud of.”\nGrants\nJoe Rowley Windows & Doors engages in contract work for a number of registered installers and one-stop-shops throughout Cavan and the extended region, which can carry out audits of your home and access various grant schemes through the Sustainable Energy Authority of Ireland (SEAI). Grants are available for retrofitting and green technologies.\nProducts supplied and fitted by Joe Rowley Windows & Doors include PVC windows and doors, vertical sliding sash windows and composite doors, stable doors, and aluminium lift and slide and bi-fold doors. They can all be viewed in the showroom where you can learn more about them.\nVisit the showroom\nFor more details check out Rowley’s Windows & Doors is based on Church Road, Kilnaleck. The showroom is open Monday to Friday, 9am to 4pm and by appointment on Saturdays. Check out their Facebook and Instagram pages also. Also email: sales@joerowleywindowsanddoors.com",
  "word_count": 688,
  "scraped_at": "2026-02-14T12:50:26.061769"
}