{
  "article_id": "85205f9ecf5a",
  "url": "https://www.news-herald.com/2024/09/04/more-tv-opportunities-are-helping-fuel-the-rapid-growth-of-womens-college-volleyball/",
  "title": "More TV opportunities are helping fuel the rapid growth of women college volleyball – News - Herald",
  "date": "20240905T044500Z",
  "domain": "news-herald.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By STEVE MEGARGEE\nMILWAUKEE — Just watch us once and you’ll be hooked.\nThat is the message women’s college volleyball programs kept delivering as their sport went relatively unnoticed, struggling to find a television home amid the flurry of football games dominating screens each fall.\n“It was an accessibility issue, not necessarily a passion issue,” Wisconsin middle blocker Carter Booth said. “I think people are very passionate about the sport. We just never really had the platform or the means to get it out there.”\nNow they do – and fans are responding in droves.\nAs NCAA president Charlie Baker noted last year, women’s volleyball has become one of college athletics’ hottest properties.\nThat growth may have been inevitable considering volleyball’s popularity as a participation sport.\nThe number of girls high school volleyball players in 2022-23 hit an all-time high of 470,488, second only to outdoor track and field (486,355), according to the National Federation of State High School Associations. More girls play high school volleyball than basketball in all but nine states.\nThe three biggest crowds for a women’s college volleyball match all happened in the last year, including 92,003 fans attending a Nebraska victory over Omaha at Memorial Stadium. Texas’ NCAA Tournament championship game triumph over Nebraska drew a record 1.7 million television viewers, a 115% increase over the previous year.\n“It just feels like the last two years, that it’s not niche anymore,” Pitt coach Dan Fisher said. “It’s truly mainstream.”\nFisher offered anecdotal evidence as well. He knows fans gathered for watch parties at local bars when his team made its third straight Final Four appearance last fall.\n“Fans are watching it the same way they watch a basketball or football game,” Fisher said. “The last two years, there’s been more of those types of things. When girls come to our camps, they all have shirts with players’ names on them.”\nStanford coach Kevin Hambly believes the tipping point was the emergence of conference networks that needed programming. So women’s college volleyball helped fill time. As the number of telecasts increased, viewers followed.\nIt’s a far cry from when Stanford outside hitter Elia Rubin grew up struggling to find a college match on television.\n“I feel like I’m able to watch every game I want to now,” Rubin said. “That’s cool. Ten years ago or five years ago, that wasn’t the case.”\nMatches are on TV\nNBC will nationally televise three matches this season (Nebraska-Ohio State on Oct. 19, Wisconsin-Purdue on Oct. 26 and Penn State-Wisconsin on Nov. 9). ABC will broadcast a regular-season match for the first time Sept. 22 when Louisville hosts Nebraska. The State Farm Volleyball Showcase – a Labor Day weekend event at Milwaukee’s Fiserv Forum featuring Texas, Minnesota, Stanford and Wisconsin – aired on Fox and FS1.\nThe Big Ten will have 83 matches televised this season – up from 53 in 2021, 55 in 2022 and 64 in 2023. ESPN will show over 2,600 matches across its platforms.\nCoaches want those numbers to keep rising. They know the answer isn’t competing with the NFL or college football. Florida coach Mary Wise says they shouldn’t even try that.\n“But one night a week … could we own that night?” Wise said. “Could it be we go from coast to coast, see one at 6, 8, 10? That’s how we would really build our fan base or expand our fan base.”\nA first step is making the NCAA Tournament’s early rounds more readily available on linear television.\n“It’s hard to get new viewers into the sport without that,” Wisconsin coach Kelly Sheffield said.\nAll first- and second-round matches will be available to stream on ESPN Plus, but the only television coverage of those rounds will be a “whip-around show” ESPN has on one of its networks to take viewers to various sites. For comparison’s sake, every game of the NCAA women’s basketball tournament is televised on one of ESPN’s various channels.\nRoad ahead\nWomen’s volleyball is growing so quickly it might not be hurt as much as other Olympic sports by the $2.8 billion settlement agreement of antitrust litigation facing the NCAA and major conferences. That agreement could lead to cost cutting that puts Olympic sports at risk on some campuses.\n“There’s concern, especially in some of the places where volleyball’s not quite as popular, in some of the regions of the country where we’re hoping that grows and changes,” Hambly said. “But I think I’m more worried about men’s volleyball, to be honest, or beach volleyball.”\nESPN’s coverage of last week’s American Volleyball Coaches Association First Serve Showcase match between Nebraska and Kentucky drew 344,000 viewers, making it the second most-watched live regular-season volleyball match to air on ESPN’s various platforms. More than 30 Division I schools reported attendance records last season.\nThe attendance boosts have encouraged some schools to move selected matches to larger venues. Four of the top six schools in average attendance last season were Big Ten programs: Nebraska (12,603), Wisconsin (7,220), Minnesota (5,010) and Michigan State (4,090).\nWisconsin regularly sells out the 7,229-seat UW Field House and played Marquette last year in front of a near-capacity crowd of 17,037 at Fiserv Forum. This year’s Wisconsin-Marquette match will take place on Wisconsin’s campus at the Kohl Center, with a capacity of about 17,000. Purdue is hosting Wisconsin this year at Mackey Arena, which seats 14,240.\nFan base\nThe young girls who make up much of the fan base should help continue the sport’s growth.\n“They follow us on social media,” said Texas outside hitter Madisen Skinner, the most outstanding player of last year’s Final Four. “They come to our matches. We autograph stuff for them. We do other things like Cameos and videos and personalized things. There’s a lot of different avenues for them to connect with us, which is really cool.”\nYet that player visibility is one area in which women’s volleyball lags behind women’s basketball.\nIowa’s Caitlin Clark and LSU’s Angel Reese were household names by the time they finished their college basketball careers. JuJu Watkins already is reaching that level going into her sophomore season at Southern California.\nVolleyball doesn’t have anyone with that kind of recognition.\n“It doesn’t define our sport that we don’t have a person like that, but I do think it matters,” Booth said. “Caitlin Clark has brought in millions of dollars in revenue and millions of dollars in ticket sales just for being Caitlin Clark. Having someone like that in volleyball will help us get the exposure level we’re wanting to get to.”\nCoaches are hoping for media coverage beyond the matches, stories that could help amplify the sport on social media. A three-part series promoting Texas’ team airs on Longhorn Network this year. ESPN also ran a documentary on Nebraska’s program last week.\n“We could use that boost,” Sheffield said. “At times it feels like there’s ankle weights on us. We still have the ankle weights, but they’re not as heavy as they were.”\nAP Sports Writer Eric Olson contributed to this report.",
  "word_count": 1174,
  "scraped_at": "2026-02-14T12:09:10.649393"
}