{
  "article_id": "8525822406b1",
  "url": "https://www.90min.com/posts/millie-bright-england-must-execute-game-plan-womens-world-cup-final",
  "title": "Millie Bright : England must execute game plan in Women World Cup final",
  "date": "20230819T163000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Millie Bright: England must execute game plan in Women's World Cup final\n- England preparing to take on Spain in Women's World Cup final\n- Lionesses have never made it through to this stage of the competition\n- Euro 2022 winners hoping to get win their second major tournament in just over 12 months\nBy Emily Keogh\nMillie Bright says England must go out and execute their game plan if they're to beat Spain in the Women's World Cup final.\nThe Lionesses have the chance to win back-to-back major international tournaments after making it through to the final for the first time ever, having overcome Australia 3-1 in a scintillating semi-final clash in Sydney.\nEngland, under the guidance of the imperious Sarina Wiegman, were celebrating Euro 2022 success just over a year ago, but now have the chance to establish themselves as one of the greatest international sides of all time.\nIf you had told Bright's nine-year-old self that she would not only be playing in but leading out England at a World Cup final, the Chelsea defender wouldn't have believed you, she says. But that's the reality facing the 29-year-old, who will wear the armband in front of an 80,000 capacity crowd at Stadium Australia.\n“She would have probably said you were being silly, and it was never going to happen, but I guess dreams come true,\" Bright told the assembled media at England's final pre-match press conference. \"I just think it is a really proud moment, and as a squad, we are just really proud of our journey and the tournament and how far we have come.\"\nBright was part of the 2019 side that came up short against the United States in the semi-final of the World Cup - the same fate that senior players Lucy Bronze and Alex Greenwood felt not only on that occasion but also in 2015, when England lost to Japan in the last four.\nNow beyond that stage, Bright continued: \"We are finally getting a shot at the trophy like we always wanted.\n“We have got a game plan that we have to go out and execute. I think everyone knows how big this is. I think it has been players’ dreams for years. We know how passionate our nation is back home and how much they want us to win. But for us, there is a process. We have a game plan to execute. We need to play the game of our lives.”\nREAD THE LATEST 2023 WOMEN'S WORLD CUP NEWS, PREVIEWS & PLAYER RATINGS\nBright assumed the England captaincy after Arsenal's Leah Williamson was ruled out of the World Cup with an ACL tear, but you'd never have known that this was her first time leading the Lionesses at a major tournament.\nIndeed, it's a role that Bright has flourished in rather more than anything. Yet she knows there's a bigger picture in play here, both in terms of the captaincy and for the continued growth of the women's game.\n\"It's massive but it's massive for the team. It's 'we' before 'me.' It's a huge privilege and honour. It will be the biggest moment in our careers. Nothing is individual,\" she said. \"It's a dream come true to be in the World Cup final. Leading the girls out is a special feeling.\n\"But for now, we’re sat here and know that tomorrow we're in the World Cup final is phenomenal, and the growth of the game has been incredible. But for all the people that work behind closed doors that maybe don't always get the recognition, we absolutely appreciate everything that everyone does for the game.\n\"But as players, we don't want to stop here and I think we're always pushing for more.\"\nBright also sent out a message on behalf of England's players, saying of the support they've received: “I think as a group we would like to say thank you, not only to the fans back home but to the fans out here as well.\n\"I think every game has been incredible; I think everyone has seen that first hand. Back home, we have seen the videos; we really appreciate everyone setting their alarm clocks and making the effort to support us.\n\"Even though we are a million miles apart, it is amazing what football can do in really bringing everyone together, but especially our nation. We are really proud. Stick with us one more game.\"\nSarina Wiegman: It's incredible what has happened\nThe support Bright touched on was also acknowledged by England manager Sarina Wiegman, who continues to achieve great things on the international stage.\nThe 53-year-old is appearing in a fourth successive major final, personally speaking, after guiding the Netherlands to Euro 2017 glory and a runners-up finish at the 2019 World Cup.\nBut the support Wiegman has received during her time as England manager is unlike anything she's ever seen, both at home and from the fans who have travelled to the other side of the world.\n“It’s incredible what happened,\" Wiegman said. \"We have felt the support and, support here, but also from the other side of the world in the UK. \"That’s something that you dream of, and we just hope that we play our best game ever tomorrow, and everyone who is watching in the stadium, in the UK, who supports us, enjoys it.\n\"I think when it shows our strength and mentality and the people that we have, obviously we never want that to happen again,\" the Dutchwoman added, referencing the ban that was once imposed on women playing football in England. \"That's been something that we've been very open about, and I don't think we'd ever let that happen again.\n\"With the people that are involved and as players, we are very open about how we feel and what we stand for. And I'd like to think the game has grown so much that that never has to be a thing again.\"",
  "word_count": 992,
  "scraped_at": "2026-02-14T12:56:43.098720"
}