{
  "article_id": "85446c4863f6",
  "url": "https://www.irishmirror.ie/showbiz/celebrity-news/gary-linekers-bbc-career-salary-29402631",
  "title": "Gary Lineker BBC career : Huge salary , deleted tweets and outspoken claims amid backlash",
  "date": "20230308T130000Z",
  "domain": "irishmirror.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gary Lineker's BBC career as he returns to Match Of The Day after fury over suspension\nIn a statement released on Monday morning, BBC Director-General Tim Davie issued an apology to viewers for the row over the weekend drama and confirmed that Gary Lineker would be returning to host Match Of The Day\nGary Lineker is set to return to Match Of The Day on Saturday following his suspension at the weekend, which sparked boycotts across a number of sports programmes from his co-stars.\nThe football legend's controversial tweet - which drew comparisons between the government's new Illegal Migration Bill and Nazi Germany - shouldn't have been a shock to BBC executives as he has never shied away from giving his opinion over the years.\nIn a statement released on Monday morning, Director-General Tim Davie issued an apology to viewers for the row over the weekend and admitted that there was \"potential confusion\" over the \"grey areas of the BBC's social media guidance\". He added that Gary would be returning to Match Of The Day on Sunday.\nThe Match of the Day star, who welcomed a second refugee into his home last year, was suspended after re-sharing a video of the home secretary discussing the bill and wrote: \"Good heavens, this is beyond awful.\"\nAs he received responses to his tweet, one of which saying he was \"out of order\", he added in a separate post: \"There is no huge influx. We take far fewer refugees than other major European countries.\n\"This is just an immeasurably cruel policy directed at the most vulnerable people in language that is not dissimilar to that used by Germany in the 30s, and I’m out of order?\"\nIt was later reported the BBC planned to speak to Gary over his comments and he would be \"reminded of his responsibilities on social media,\" Sky News reported.\nA spokesperson also added: \"The BBC has social media guidance, which is published. Individuals who work for us are aware of their responsibilities relating to social media. We have appropriate internal processes in place if required.\"\nGary later reacted to the response on Twitter as he quipped: \"Morning all. Anything going on?\"\nHe then added: \"Great to see the freedom of speech champions out in force this morning demanding silence from those with whom they disagree.\"\nIn a later tweet he acknowledged his supporters as Lineker wrote: \"I have never known such love and support in my life than I’m getting this morning (England World Cup goals aside, possibly). I want to thank each and every one of you. It means a lot. I’ll continue to try and speak up for those poor souls that have no voice. Cheers all.\"\nMeanwhile, the home secretary said she as disappointed by Gary's comments.\nMs Braverman told BBC Breakfast: \"I'm disappointed, obviously. I think it's unhelpful to compare our measures, which are lawful, proportionate and - indeed - compassionate, to 1930s Germany. I also think that we are on the side of the British people here.\"\nGary's tweet has been liked more than 74,000 times at the time of writing – and retweeted more than 14,000 times.\nFollowing the news that Gary wouldn't front Match of the Day on Saturday, various fellow pundits boycotted their BBC shows this weekend in solidarity with the presenter.\nThere was limited sport programming this weekend, with the BBC apologising to viewers over its schedule.\nMatch of the Day did air on Saturday but without presenters or pundits. The episode - cut down to only 20 minutes - featured Premier League highlights without any commentary.\nFootball Focus, Final Score and Radio 5 Live coverage was cancelled.\nIan Wright and Alan Shearer returned to their punditry duties on Sunday after pulling out of their appearances on Match of the Day.\nThe duo went back into action after their boycott, appearing on Premier League TV for Arsenal's clash with Fulham. They provided punditry for the Gunners' win at Craven Cottage, as well as two other games.\nHowever, this isn't the first time Gary has garnered attention with his upfront opinions...\nOutspoken moments\nGary has repeatedly been outspoken on a number of subjects over the years, including politics.\nIn September 2021, he made a damning assessment of the Labour party.\nAmid the difficulties with the opposition including Andy McDonald's resignation as Shadow Secretary of State for Employment Rights and Protections, he tweeted: \"Seems the Labour Party is constantly in opposition with itself rather than the government.\"\nIn 2018, he butted heads with Johnathan Agnew and told to \"keep his views to himself\" for sharing a string of tweets, airing his views on Brexit.\nFormer cricketer Jonathan wrote: \"Gary. You are the face of BBC Sport. Please observe BBC editorial guidelines and keep your political views, whatever they are and whatever the subject, to yourself.\n\"I’d be sacked if I followed your example. Thanks.\"\nLineker hit back as he responded: \"Jonathan, I'm the face of my own Twitter account. I'll continue to tweet when I like and if folk disagree with me then so be it.\n\"Thank you so much for your concern, which, I imagine, wouldn't be a concern at all if you agreed with me.\"\nIt isn't just politics Gary has found himself hitting the headlines over. In August 2022, Lineker received backlash for his tweet as the Lionesses won the Euros.\nIn reaction to the win, he posted on Twitter: \"The @Lionesses have only gone and done it, and Kelly is England's heroine, bra none.\"\nThe tweet received an immediate backlash with the Match of the Day presenter being accused of \"casual sexism\". Lineker promptly deleted the post.\nLater, Lineker called the backlash \"ludicrous\" as he told The Telegraph: \"It was ludicrous.\n\"But it was just a few people who, I think, weren't watching the football match. So they've automatically thought I was making a sexist comment because women wear bras.\"\nLineker explained that he only deleted the tweet because he feared it was being taken out of context by those who hadn't even watched the game.\nHe added: \"I'm not easily bullied. I think about my tweets all the time. That's why I thought about that one. Because I thought it was quite funny. It was just a play on words, like I do all the time, in most of my tweets when I'm watching football matches.\n\"I just try to be different, which is what I do on TV. I try to do similar kinds of things and I've always done it. And I just think a few people just took it the wrong way. And I understand that.\n\"If I've got 8.5 million followers, every tweet I do, someone will have a pop.\"\nPundit porn prank\nEarlier this year, Gary discovered a phone had been hidden in the BBC studio after coverage of a FA Cup game went into disarry.\nThe programme was interrupted by porn sounds and Gary was left attempting to direct pre-match punditry as the sounds played.\nYet the noises kept coming at regular intervals, leaving fans up and down the country who had tuned into their televisions utterly bewildered.\nA YouTuber, who boasts the account name Jarvo69 aka BMWJarvo, was then unveiled as the prankster as he went live and streamed the stunt to thousands of viewers as he explained how they had managed to tape a phone to the back of the BBC's set ready to play the explicit audio as soon as they called it.\nMatch of the Day host Lineker, meanwhile, saw the funny side and took to Twitter to explain what had been causing the noises, writing: \"Well, we found this taped to the back of the set. As sabotage goes it was quite amusing.\"\nThe BBC later offered a formal apology as a spokesperson said: \"We apologise to any viewers offended during the live coverage of the football this evening. We are investigating how this happened.\"\nHuge BBC salary - and major cut\nIn September 2020, Gary took a £400,000 pay cut as host of Match of the Day for the next five years.\nHe also agreement to be more careful when using Twitter to push his political causes at the time.\nThe deal was announced at the launch of the corporation's report at the time and emphasised how BBC staff would be bound by a strict set of new rules around social media usage.\nBBC's director general Tim Davie said at the time: \"Gary knows that he has responsibilities to the BBC in terms of his use of social media\".\nAt the time, Gary said: \"I love working with the BBC, and am very proud to continue to be a part of their outstanding football team.\n\"I’m looking forward to the next five years – with a European Championship and World Cup on the horizon, it’s exciting times for me and the team.\"\nFollowing the announcement, he also tweeted: \"Oh dear. Thoughts are with the haters at this difficult time.\"\nHe also defiantly replied \"nah\" when told he should be \"terrified\" of the clampdown.\nPiers Morgan feud\nGary has been embroiled in a Twitter feud with outspoken presenter Piers Morgan for years with the pair exchanging nasty blows across social media.\nPiers called out the BBC pundit on everything from his salary, ratings, politics and even his ears.\nA particularly nasty row kicked off in August 2019 when Gary slammed the government's decision to extend the suspension of parliament - two weeks before the UK was set to leave the European Union.\nPiers quipped: \"Says the man who has howled for 3yrs that we should ignore the result of a democratic vote...\"\nGary insisted he never said the result of 2016's EU referendum should be ignored, adding: \"We could though look at the crooked, lying nature of how it was sold to us back then by the elite now dictating (literally) and decide as a democratic country if that’s still what we want.\"\nPiers hit back with: \"Mate, it doesn’t get more elite than you...as BBC licence fee payers know to our cost.\"\n\"Mate, it doesn’t get much more elite than ostentatiously showing off your wealth (you constantly tell me you earn way more than me) with a deluge of pictures by marauding, around the Côte d’Azur on a yacht,\" Gary responded.\nBut Piers still wasn't done, adding: \"I don’t pretend not to be in the elite... and it’s not my fault I earn far more than you, it’s my talent.\"\nPiers has also nicknamed Gary \"jugs\", while Lineker has called Piers \"tubs\" in the past.\nThe pair have had more online spats, but appeared to have made up in January last year with a cosy night together.\nPiers shared a photo of Gary wearing an apron with Chef Gaz written on it and told his followers the Leicester-born star was making him dinner.\nCaptioning the pic in which the controversial host grins holding a glass of red wine he wrote: \"Decided to finally get my BBC licence fee money out of Gary Lineker at his home last night.. have to say, Chef Gaz delivered a quite delicious feast including Gambas al Ajillo and Fillet steak au poivre.\n\"Did everything himself (for 5 of us) and it was all perfectly cooked. Then he proudly showed off his golden boots, before the shock late Leicester result came through to ruin his evening. All in all, a most enjoyable soirée - and definitely worth 43p!\"\nSurprisingly, this time, Piers has been one of Gary's loudest supporters and accused the BBC of \"losing its mind\" by suspending Gary.\nThe former GMB host, who has been vocal about his support for free speech and has condemned the BBC for its reaction to the dispute, suggested that all Match Of The Day crew might as well \"walk out right now\".",
  "word_count": 1970,
  "scraped_at": "2026-02-14T11:59:30.364982"
}