{
  "article_id": "8545894b337f",
  "url": "https://www.mirror.co.uk/news/royals/prince-william-issues-three-word-36322931",
  "title": "Prince William issues three - word statement about future after historic news revealed",
  "date": "20251128T134500Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Prince William issues three-word statement about future after historic news revealed\nPrince William, patron of the Football Association, took to social media to give his three-word reaction to the news a major tournament could be heading to UK shores\nPrince William has issued a personal three-word message in response to historic news announced today. The Prince of Wales took to social media to give his reaction after it was revealed that the Women's World Cup could be coming to the UK in 2035.\nToday, the four UK football associations in England, Scotland, Northern Ireland and Wales officially submitted their bid to stage the 48-team finals to FIFA, with no other bidders in the running for the tournament. In all, 22 stadiums in 16 cities across the four nations have been included in the submission. William, who is a huge football fan and patron of the English Football Association wrote on social media: \"Exciting times ahead!\"\nHe denoted it was a personal message by finishing the message with the letter W for William. It comes after earlier this year, the prince travelled to Switzerland to watch England's Lionesses become European champions with a win on penalties against Spain in the final of Euro 2025.\nHe and daughter Princess Charlotte travelled to the match together and were seen congratulating the players after their emphatic victory.\nThe 2035 bid team said the World Cup finals would represent the biggest single-sport event staged in the country and would be the first World Cup played on British soil since the men’s finals of 1966, which were solely hosted by England.\nIn 2018, William had backed a bid to bring the men's World Cup to England in 2018 and joined a delegation speaking in a presentation to world governing body FIFA about why England should have been given the finals.\nHowever, the bid was unsuccessful with the 2018 tournament being awarded to Russia, with England making it to the semi-finals of that tournament.\nFor the 2035 UK bid, organisers say four and a half million tickets are set to be made available for the tournament, which will follow on from the successful hosting by England of the Women’s Euro in 2022. Prime Minister Keir Starmer said: “Our bid to host the 2035 FIFA Women’s World Cup shows the UK’s passion for football.\n“The Lionesses’ success has inspired girls across our country, and we’ll build on that momentum by welcoming millions of football fans from around the world to a tournament that will benefit communities and businesses in host cities up and down the UK.\n“With significant investment in school sport and grassroots facilities through our Plan for Change, we’re creating opportunities for girls to play for their national team.”",
  "word_count": 453,
  "scraped_at": "2026-02-14T13:06:48.076819"
}