{
  "article_id": "854b14032f7e",
  "url": "https://www.the42.ie/lydia-bedford-brentford-u18s-6083652-Jun2023/",
  "title": "Landmark appointment as Arsenal women assistant takes Brentford U18 reins",
  "date": "20230601T203000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LYDIA BEDFORD HAS been announced as Brentford Under-18s head coach in a landmark appointment.\nBedford has left her position as assistant boss with Arsenal’s women team to become the first female coach to take the reins at a men’s professional side in England.\nThe former Leicester manager is set to work alongside Jon-Paul Pittman, who will join as assistant coach from Forest Green.\nBrentford director of football Phil Giles said: “I’m really pleased that we’ve managed to attract such talented coaches as Lydia and Jon-Paul to our under-18 team for next year.\n“We undertook an extensive recruitment process for these roles. Lydia and Jon-Paul were the two best candidates, and thankfully we were able to finalise their recruitment to the staff.\n“I’m sure they will excel, and we all look forward to working with them through pre-season and beyond.”\nMeanwhile in the women’s football world, Magdalena Eriksson and Pernille Harder have signed for Bayern Munich.\nThe duo recently announced that they would depart Chelsea. Eriksson joined the Blues in 2017 and has made 149 appearances as well as lifting five WSL trophies as captain, while her partner, Harder, has won three league titles since arriving at Kingsmeadow in 2020.\nChelsea and England striker Lauren James has signed a new contract which will keep her at the club until the summer of 2027, while Frida Maanum has extended her stay at Arsenal.\nAnd as she hinted towards in an interview with The 42 in April, Chloe Mustaki will play WSL football next season after penning a new deal at Championship winners Bristol City.\n“We’re really pleased to have secured Chloe’s signature until 2025,” head coach Lauren Smith said. “She’s a talented player and brings some important experience that will be invaluable as we venture back into the Women’s Super League.”\n“I’m thrilled to have signed a new contract with Bristol City,” the Dublin defender added.\n“The coaching and club set-up is brilliant and I couldn’t have asked for a better experience in my first year as a professional footballer. Last season was a dream in many ways, with good people and an exceptionally talented group. I know that Lauren and the staff will want to build on that in the WSL, which makes me incredibly excited for next year.”",
  "word_count": 378,
  "scraped_at": "2026-02-14T12:21:44.908823"
}