{
  "article_id": "856694845e09",
  "url": "https://www.rollingstone.com/culture/culture-features/free-burma-rangers-rebels-myanmar-civil-war-1234710725/",
  "title": "How Free Burma Rangers Is Helping Rebels Fight In Myanmar Civil War – Rolling Stone",
  "date": "20230416T144500Z",
  "domain": "rollingstone.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Zealot or Savior? This U.S. Minister Is Training Rebels in a Civil War\nD ave Eubank makes an exploding gesture with his fist to alert the guerrilla soldiers following him of the danger ahead. “From here until we pass the road, the trail is lined with mines,” he says, scanning the mountainous Burmese jungle for signs of trouble. “Watch where you step.” As his signal relays down the line, conversations fall silent and the air hums with only the sound of heavy breathing and hundreds of footsteps on hard-packed ground.\nEubank picks up the pace, slashing through brush and thorny stalks that tear at his clothing. A former U.S. Special Forces officer and ordained Christian minister, he started the Free Burma Rangers (FBR) in the late 1990s to provide medical care and aid to people resisting the Southeast Asian nation’s military junta, a brutal dictatorship that has crushed dissent and oppressed ethnic minorities for seven decades in what is the world’s longest-running civil war. With a few volunteers and his own wife and kids in tow, Eubank set FBR apart with a relentless commitment to go places other humanitarian groups would not. And that’s built FBR into a movement that fields teams and tracks human-rights abuses across Burma’s front lines and beyond, from northern Syria to Sudan. But critics say Eubank is a Christian zealot who is risking the lives of his family and followers in a vacuum of oversight. They claim FBR is blurring the line between humanitarian work and ideological activism by training and, at times, fighting alongside armed groups while preaching the Gospels of Jesus.\nAt 62, Eubank is still fighting fit, with a lean, compact frame, oversize feet in constant motion, and eyes that seldom blink beneath the brim of his camo hat. On this December morning, he’s leading his biggest mission yet: a two-week trek through eastern Karen State to deliver critically needed aid, scope enemy positions, and test the nerves of 205 new rangers. The crux of the day is crossing a road that links two Burma Army bases and sees frequent government patrols. Eubank has done it dozens of times, but in the past could rely on stealth and the agility of small numbers in the event of a firefight. This year’s group is more than triple the size of any before it.\nIn February 2021, a decade-long period of quasi-democracy ended in Burma (now known as Myanmar) when the military seized back power in a coup. Protesters were gunned down in the streets and opposition supporters arrested, tortured, and disappeared. But unlike past uprisings, this generation is refusing to back down. Revolutionary militias called People’s Defense Forces (PDFs) made up of mostly Burmans, the country’s ethnic majority, are attacking the regime in cities and lowland areas that have never before seen fighting, and bolstering ethnic armed groups in the borderlands. Violence in Burma is, according to Eubank, “at its highest level since World War II.” In 2022, 15 rangers were killed in the field, the deadliest year yet.\nUnder pressure, the junta’s army is doing what it always has but at greater scale: torching villages; executing political prisoners; and deliberately targeting schools, churches, and large civilian gatherings with airstrikes to sow terror. On April 11, officials admitted to carrying out just such an attack on a community hall that reportedly killed at least 165 people, including women and children. To date, thousands have died and more than 3 million people are internally displaced.\n“There is a level of anger and frustration [in the Burma Army] that basically, given the spread of martial law, says you can do what you fucking want and you can get away with it,” says Anthony Davis, a Bangkok-based security analyst. In March 2022, the U.S. government made an official determination that the Burma Army committed genocide and crimes against humanity against the Rohingya minority. That has done nothing to dim the military’s aggression. Reports of rape, torture, and beheadings are widespread. And with violence at an all-time high, demand among resistance groups for the aid and expertise FBR offers has surged.\nAll of which makes crossing this Burma Army road trickier than usual. The junction is a riot of overgrowth and we’re late, raising the odds of running into a government patrol. Although FBR-allied rebel fighters from the Karen National Liberation Army (KNLA) have scouted the area in advance, one enemy base is less than a mile away. On previous occasions, Eubank, who carries a 9 mm handgun under his shirt, has run into soldiers guarding the crossing at night and had to back off.\nOne by one, the long procession of rangers files past. Greenhorns and seasoned instructors and ethnic fighters are mingled with about 30 foreign volunteers, including Eubank’s always smiling, deceptively tough wife, Karen, and three children, who have spent the better part of their lives in the jungle. Daughters Sahale, 22, and Suuzanne (named after Burmese Nobel Peace Prize laureate Aung San Suu Kyi), 20, drive a string of pack horses bearing medical supplies. Pete, 17, strolls past with his pet macaque clinging to his shoulders.\nI follow a KNLA fighter down the road when he notices some of the elephant grass has been trampled and waves me back. The Burma Army appears to have patrolled earlier that morning, and the scouts missed the signs. It’s likely fresh mines have been planted nearby. We retrace our steps back to the junction and keep watch.\nWhen the last ranger finally goes by, Eubank embraces his militia friends and then, in an unusual move for the leader of a relief organization, presses a little cash into their hands. “Christmas present,” he whispers, thanking them in a Karen dialect. Then he starts bounding up the trail toward his place at the front of the line, at once excited and relieved to have slipped the Burma Army again.\nGETTING INSIDE BURMA to report on its ethnic conflicts has never been easy. For decades, the country, home to more than 51 million people and 135 officially recognized ethnic groups, was closed like a tropical North Korea: The government kept a black list of journalists, entire regions were off-limits, and legions of plainclothes security agents tracked one’s every move. Since the coup, travel outside major cities has become next to impossible. Linking up with rebel groups requires crossing borders and hiking from several days to a week through calf-busting mountains with fluid front lines. Travel is, with rare exceptions, on foot, and provisions must be lugged in a backpack. And if something goes wrong, there are no hospitals or medevacs. The combination of time needed, physical rigor, and a general lack of appetite among media outlets has reduced coverage to a trickle, despite the Burma Army’s staggering record of atrocities.\nStarting in late December, I spent three weeks with Eubank and the rangers in the jungle, going on missions and trying to understand what would drive a man to not just lead a crusade in the bush but to also haul his wife and children with him. In nearly two decades of conflict reporting, I’ve never encountered anyone like Eubank — an ardent believer with deeply held conservative values willing to risk his own life and family for a faraway cause. And not only offer much-needed aid and relief to the persecuted and battle-scarred, but also money and muscle. The heroic and unsettling walking side by side.\nI first crossed paths with Eubank back in 2012, en route to northern Kachin State to make a film about the Burma Army’s theft of resources and attacks against civilians. In a deserted airport in China, I passed the Eubanks on their way home after a two-month mission. They wore shirts that read “Free the Oppressed” and carried themselves with the jovial manner of a family on holiday.\nLater I learned Eubank was nicknamed “Mad Dog” and “Father of the White Monkey,” and led an all-volunteer staff of ethnic minorities and foreigners — many of them ex-military — working on the front line. Controversially, some team members carried weapons, ready to fight the Burma Army if they came under attack. Others carried video cameras to document war crimes. Word was the charismatic American triathlete could cover 40-plus miles of hostile terrain in a single day while preaching the good book.\nBurma’s lawless depths have attracted plenty of G.I. Joe wannabe’s with a messiah complex. From a distance, it’s easy to think of Eubank as a Bible-thumping mashup of Colonel Kurtz and Captain Fantastic. But even the most hard-boiled Southeast Asia hands agree that in a world of counterfeits, Eubank is the real deal: a diehard humanitarian who has risked his life time and again to help the most vulnerable in a forsaken place that most Americans can’t find on a map.\n“I admire [FBR’s] commitment, valor, and humanity. They don’t pretend to be anything other than what they are: in solidarity with people being targeted in war,” says Dave Mathieson, an independent analyst who tracks conflict and humanitarian matters in Burma. “One can take issues with militarized approaches to aid, especially when tied with fervent religious beliefs, but when it works so productively with FBR, it can’t be faulted.” Or as Phil Thornton, a veteran journalist based on the Thai-Burma border puts it: “He’s a bit mad, but he does great stuff.”\nFor his part, Eubank dismisses any notion that he’s running a paramilitary operation. “We don’t have the most dangerous job in the world because we’re not trying to fight the Burma Army; we’re trying to avoid them and help people,” Eubank says. “There are organizations that are bigger, stronger, better than us, but if they won’t go, you gotta go,” he adds. “I keep praying, and God keeps sending me.”\nEubank prays aloud more often than anyone I’ve ever met. On the phone, when under attack, for large crowds and passing strangers, even midsentence. Often he’ll be talking in his crisp, rapid-fire cadence and then slip in a prayer that’s only discernible by the closing phrase, In Jesus’ name, amen. Such religiosity can come across as pious and performative when delivered from the pulpit. With Eubank, though, all the prayer somehow feels endearing, a genuine hedge against existential threats that are very real.\nEubank insists that love is the force that drives him to take extreme risks, and also what makes FBR so effective. “[You will] run forward through the bullets, even if you don’t know the person you’re trying to save,” he says. “If I’m shot and I’m bleeding out on the trail and dying and I can’t see my wife and kids again — if I’m not doing that for love, what a disaster.”\nBorn in Texas and brought to Thailand by missionary parents, Eubank spent his childhood in the hills around Chiang Mai. He accompanied his father to remote villages to spread the word, and could shoot a rifle, swim, and ride bareback by the age of five. The war in neighboring Vietnam was ramping up, and it stoked an inborn desire to test himself and, as he says, “get into the fight as soon as possible.” He got into trouble, looked for brawls at school and in the street. His Boy Scout troop was trained by U.S. Special Forces and CIA on leave from the war.\nDetermined to go to war and “fight for freedom,” Eubank went to Texas A&M on an ROTC scholarship and entered the Army. At 22, he commanded a platoon in Panama and was selected for a Ranger unit based in Washington state, where he was later assigned to lead a Special Forces A-team. Between missions, he summited peaks in the Cascades, married and divorced, and began to question life in the military. He met Karen, then a special-education teacher. Leaving the Army 10 years in as a major, he enrolled in seminary and pursued her with the same zeal as everything else.\nIn 1993, Eubank was invited back to Southeast Asia by a tribal leader of the Wa, an ethnic group in northern Burma facing a drug crisis. He took it as a sign from God and told Karen he’d like her to join him as his wife. She agreed, plunging headlong into a life she couldn’t have imagined. “I had never planned to travel overseas,” she says. “And then I’m riding in the back of a huge truck with resistance fighters, guns poking me all over the place.”\nFour years later, the couple founded FBR in response to a Burma Army offensive that uprooted more than 500,000 people. Volunteers had to meet three requirements: be literate, not run away from the enemy if villagers could not, and do the work “for love” since no one is paid.\nHaving kids and bringing them up inside Burma came with risks. But the communities and fellow rangers embraced the Eubank children as their own, cultivating a bond forged in shared danger. While Eubank was out running missions, Karen home-schooled the kids and saved them from vipers lurking in the toilet. She launched a children’s program and expanded it with their help. Over the years, the kids endured life-threatening illness, sniper fire, airstrikes, and the loss of loved ones — but also experiences and perspectives that few contemporaries can share.\n“Growing up here versus America was a blessing we didn’t deserve,” says Sahale. “When I hear the word ‘trauma,’ it’s hard for me because this is our life, and I feel like in this day and age, people use trauma as a way to excuse their behaviors.… Our [ethnic Karen] aunts and uncles smile through their pain — they choose joy and gratefulness — which is inspirational because they have nothing, but they give everything.”\nEvery summer, the Eubanks travel the U.S. to see friends, share their story, and raise money. In between donor meetings and church events, the family motors around in a mud-streaked Toyota rig on escapades that range from skydiving and mountain climbing to bear hunting in Alaska. The kids are known to drop into the Cody Nite Rodeo in Wyoming on borrowed horses and win belt buckles.\nIn October, I met up with the Eubanks outside College Station, Texas, near the end of their annual tour. Suuzanne and Sahale followed their dad’s footsteps to A&M, and a whirlwind weekend kicked off with a rugby match. Eubank paced the sidelines cheering on Suuzanne while calling football patterns for Pete on an adjacent field. “Dave doesn’t like to loiter,” says Karen. From there, Eubank caught a helicopter to a wedding he was officiating in Hill Country.\nThe next day, he’s at it again at back-to-back church fundraisers. Eubank is a gifted public speaker, sincere even when he’s repeating his stump speech for the 10,000th time. After a short video featuring FBR medics at work under fire, he riffs for 20 minutes about the value of sacrifice. “You can live with sorrow, but you can’t live with shame,” he says, with a paternal warmth that strikes a bracing contrast to his war-zone bravura. The program closes with Sahale on guitar, dressed in a native Karen vest, singing a heartfelt homage to a ranger friend killed in Karenni State in July by a Burma Army airstrike.\nSome believers are in tears, hands in the air. “People say, ‘I have faith,’ ” says Willie Medlock, 51, a technician from Wimberley, Texas. “Well, you can say what you want to, but they’re living it.”\nTHE EUBANKS’ WORK has spread from conflict zone to conflict zone. In 2015, a Christian supporter asked if they would go to northern Iraq on his dime to help the embattled Kurdish minority. Islamic State militants were gaining ground, slaughtering villagers and raping women with impunity. Eubank questioned what little FBR could do in the Mideast desert. But he saw parallels in the plight of the Karen and the Kurds, a long-oppressed people and the largest ethnic group in the world without its own country.\nWhen he showed up with Pete, then nine years old, the Kurdish minister of defense was stunned and tried to warn him off. Eubank countered that there were lots of kids in danger who were just as important to him, and FBR’s work was always a family affair. In the ensuing months, Eubank and his team, some of them ethnic volunteers from Burma, provided food and medical support to Yezidis escaping ISIS massacres. They fought alongside Kurdish peshmerga, and assisted in ISIS-ravaged Syrian towns such as Kobani and Manbij. “We were just going boom-boom from Syria to Iraq, one fight to the other,” Eubank recalls.\nBy 2017, all attention turned to liberating Mosul, the seat of the group’s self-proclaimed caliphate. As hundreds of thousands fled, FBR volunteers fought alongside Iraqi Army special forces in block-to-block combat while Karen and the kids cared for the wounded. One of Eubank’s comrades was killed beside him; another took six shots and lived. In one battle, Eubank found himself four yards from a group of ISIS fighters; he was shot in the arm, but says he managed to kill three of them “point-blank” and stay in the fight.\nOne scorching June morning, FBR found a heap of more than 50 bodies on the outskirts of the city — men, women, and children — cut down by ISIS snipers while trying to escape. A young girl, no older than five, her hair tied with pink ribbons, peeked out from under the hijab of her dead mother. The bodies were 150 yards away, and the snipers had a clear shot. Eubank plotted a rescue. Iraqi forces coordinated a smoke barrage with the U.S.-led coalition, and he edged closer behind a tank as bullets pinged off the armor. “If I die doing this, my wife and kids would understand,” he recalls thinking. In a harrowing 12-second dash captured on video, two FBR volunteers provide cover fire as Eubank scoops up the girl and carries her to safety.\nAfter years of operating in the shadows, Eubank was thrust into the spotlight. A Christian leader of a humanitarian group engaging in firefights in a Muslim country would normally raise alarms, but the daring rescue video was featured on cable news and talk shows; newspapers profiled the Eubanks, and a faith-based company made a documentary about FBR. Donations spiked, along with volunteer inquiries.\nEubank calls FBR “ambassadors for Jesus.” Prayer and proselytizing are woven into their work. Some rangers are baptized in camp, but the group does not exclude non-believers. “You can be homosexual, you could be a murderer. You only have to say ‘I don’t think that’s the best behavior, and I’m trying not to do those things,’ and then you can join us,” he says, adding that FBR includes atheists, agnostics, and spirit worshipers.\nMiles Vining, a former Marine and weapons expert who converted to Islam after deployments in Afghanistan, affirms that FBR does not pressure or cast judgment like the missionary groups he grew up around as the son of American diplomats in Thailand. “I got so incredibly sick of them because everywhere I looked I got God crushed down my mouth,” he says. “In FBR, everything is action-based; [Eubank and his family] are showing their faith, saying, ‘Look, this is what propels us, and we want to do good deeds. And if you want some of this, come on in. But if you don’t, that’s OK, too’ — instead of saying, ‘You’re going to hell.’ ”\nStill, the group’s faith-forward, weapons-bearing ethos has drawn critics who question the way FBR operates. “FBR may have saved hundreds of lives or more,” writes Alexander Horstmann, an associate professor of Southeast Asian Studies at Tallinn University, “but the way the organization positions itself as an enemy of the Burma military is problematic, as is its active involvement and overlap with the ethnic-minority armies.” Carrying guns stokes the age-old suspicion that aid groups are arms of intelligence agencies, and can make work more challenging for organizations that are trying to remain neutral. “Not unlike movie-hero John Rambo,” Horstmann notes, “Eubank presents himself as a warrior who comes to places of conflict to liberate innocent civilians from the claws of their oppressors.”\nAlthough medics are allowed to carry guns for self-defense under international humanitarian law, a November 2019 report by Offbeat Research, an open-source investigative group, suggests FBR has gone on offensives alongside Kurdish militias in Syria, citing the group’s own video footage as evidence. (FBR denied that, but did note that its members have worn YPG patches in Syria.) Moreover, FBR trains rebels in skills like battlefield communications and land-mine removal, tactics that have plausible humanitarian applications but more strictly support combat efforts. “The existence of the FBR and their actions across Syria,” the report says, “blur the line of humanitarian aid and targeted activism.”\n“We’re not a militia, but we work in bear country,” says Eubank. He insists that FBR never shoots first, but makes no bones of its support for pro-democratic causes, asserting that the traditional humanitarian approach of neutrality is one that “always favors the oppressor.” He notes the time a U.S. government official chastised him for aiding ethnic armed groups in Burma. The official touted Bosnia as an example where there was a “clear separation” between military and relief work, and a U.S. battalion provided security while food was distributed. “That is good,” Eubank replied. “Please send the U.S. battalion to stop the Burma Army from attacking Karen, and we will gladly provide humanitarian assistance in safety.”\n“In many situations, resistance humanitarians are reaching people faster and better than orthodox humanitarians from neutral international agencies,” writes Hugo Slim, a global authority on the ethics of war at Oxford University. Slim argues that the conventional approach often fails because it becomes bogged down by bureaucracy and requires the consent of predatory regimes, pointing out how aid agencies in Burma are seen as lacking courage, honesty, and ingenuity as they avoid proper recognition of the injustice being carried out around them. Humanitarian resistance, Slim asserts, is both ethical and essential and should be embraced “by [international aid groups] and the governments that fund them.”\nOne veteran rights investigator concedes that he used to be an avowed pacifist who would “butt heads” with Eubank over FBR’s support of ethnic armed groups. But the brute horror of the Burma Army’s campaign convinced him that FBR’s bold approach is essential to relieve mass suffering. “If FBR wasn’t filling those voids,” he asks, “who would be?”\nFBR’S TRAINING CAMP sits in a valley carved by a stream in eastern Karen State. What the Eubanks started with a few bamboo huts and elephant labor has grown into a small village with a free medical clinic, spartan barracks, bunkers and training facilities, and a school for the offspring of volunteers split between “ethnics” (in FBR lingo) and foreigners, a.k.a. galawas (literally “white Indians”). The prevailing vibe is that of a very intense summer camp — one that is sometimes disrupted by Burma Army jets that streak low overhead.\nWhen the Eubanks return in December — Dave, Karen, and Pete from a mission in Syria, Suuzanne and Sahale on break from college — FBR staff and hundreds of ranger trainees line up to welcome them with handmade posters and smiles. The family greets everyone and drops their bags at a two-story cabin plastered with a Bible verse from Philippians and with an office full of yellowed family photos: Eubank on the summit of Denali, and praying with Mike Pence; the girls barrel racing; Pete riding bulls. A “Wall of Heroes” features portraits of 53 rangers killed in the field since FBR was founded.\nFacing a 200,000-strong military armed with Russian jets and attack helicopters has not dimmed the trainees’ spirits. They represent seven of the country’s ethnic groups; about a quarter are seasoned fighters. Another quarter are ethnic Burmans — teachers, students, engineers, poets, and shopkeepers — who have joined PDF militias, a shift that was unthinkable prior to the coup.\nTwenty-year-old Gabaw Htoo is the face of a generation of unlikely revolutionaries. A lanky former gaming addict from the capital, Yangon, he sports milk-bottle glasses, a shorn head, and a bullet necklace he says he won’t take off until the war is over. Htoo witnessed several friends killed in street protests when rubber bullets turned to live ones. After that, he and his crew decided they needed training to “get weaponized” and join the armed resistance. They considered everything from male prostitution to selling weed to raise money for guns, until a friend connected them with rebels in the eastern jungle.\n“We were like aliens,” recalls Htoo in English, honed watching Breaking Bad. He weighed more than 200 pounds with hair that fell down to his chest. “I couldn’t even hold a knife; we were useless, spoiled brats.” Along with harsh terrain and lack of food, he had to overcome prejudices instilled by a racist regime that brainwashed Burmans into believing their superiority over the ethnic minorities: “ ‘Cannibals,’ ” says Htoo. “We grew up with so much propaganda.”\nThe Karen accepted them and taught them how to survive in the bush. Months of jungle slogs, sleeping in the rain, and subsisting on rice and fish paste hardened his body and resolve. His KNLA mentor gave him the nom de guerre Gabaw Htoo (“Bright Light”).\nWhile some tech-savvy people’s militias are jerry-rigging drones and 3D-printing rifles, most of Htoo’s time in the KNLA was spent setting claymore mines and learning how to make homemade bombs with bamboo shafts, not always with good results. “Guys were always blowing themselves up,” he says. “The training was a mess, and our leaders are so disorganized.” Last year, the Burma Army ambushed his unit and killed five of Htoo’s comrades. He escaped into the jungle and, after weeks on the run, linked up with his KNLA mentor, who sent him to FBR for more training — again the barrier between armed rebels and humanitarian-aid group proving permeable — though he still doesn’t have a gun of his own. FBR does not issue weapons to trainees, and only a fraction of rangers have rifles. (Many are “franken-guns’’ held together with homemade parts: Vietnam-era M-16s, captured Burma Army MA3 rifles, and even M-1 carbines of World War II vintage.) “I have a three-year plan,” Htoo says. “The first was for failure, the past year for training, and this year will be for getting guns and fighting.”\nFor all his experience, Eubank likes to temper recruits’ eagerness for combat. He cites a botched attack in the nearby village of Limerplaw in December as a warning. Seventy percent of KNLA grenades failed to explode. When the smoke cleared, the mission had failed, and five fighters were dead and 26 were injured. Eubank exhorts the rangers to assess the enemy carefully and question superiors if they are in doubt about an operation — but above all, to pray first. “If you are going to risk your life or take someone’s life, you must be sure this is God’s mission for you,” he warns. “Otherwise, don’t do it.”\nEubank rises each morning before dawn for a five-mile run and calisthenics. Then he takes care of email and other administrative tasks he loathes, then tours the camp. He’ll “stress test” his kids at random, handing them an M-16 and calling out worst-case scenarios (“You’re in a helicopter, animal’s getting away, and you’ve got a malfunction”). He picks up trash discarded by rangers (“They’re cheating themselves, leaving crumbs for the Burma Army”), and his sudden presence at training stations hits the bone-tired recruits like a jolt of caffeine. On a “ranger run” with the entire class through the mountains, he crests a summit and orders everyone to the ground for pushups. “Easy way or hard way,” he yells out after 20. “Hard way!” comes the response, and Eubank bangs out 10 more.\nDecades of wear and tear have taken their toll, and Eubank’s body is slowing a bit but “his brain and competitiveness are not,” says Dave Small, an ex-Canadian Army officer who has worked with Eubank since he was 15. “He can still out-endure anyone — and that’s just mental. He goes as hard as he can.”\nDuring the annual basketball game between ethnics and galawas, a shirtless Eubank is all hustle. He’s setting picks and stifling his man. But the man guarding him keeps fouling; after one too many, Eubank snaps, grabs him by the shoulders, and throws him to the ground. After the game ends with the foreigners on top, Eubank pulls the ranger he slammed in for a hug.\nLater on, I accompany Eubank downriver to meet Gen. Baw Gyaw, the battle-hardened leader of the KNLA. I struggle to keep pace as Eubank explains that it was Baw Gyaw, a fellow Christian, who granted him the land for FBR’s training camp and free movement across his territory. “None of this would be possible without Baw Gyaw’s blessing,” says Eubank. “He trusts us.”\nWe cross a bamboo bridge and strip camouflage netting off an FBR truck for the drive to Da Bu No. Once home to 5,000 people, the village has become a ghost town of shuttered shops and derelict homes. Repeated Burma Army bombings since the coup have wiped out families, shredded school houses, and leveled a KNLA command center. “Everyone is hiding in the jungle,” Eubank says. “It’s really sad.”\nBaw Gyaw receives us at a teak house surrounded by guards with M-4 rifles. Eubank gives him a big hug and gifts him a Ka-Bar knife and some fresh FBR shirts. A short, stocky man dressed in jungle boots and fatigues, the general has a shrapnel scar on his left temple and changes shirts to reveal additional scars down his chest and stomach, the markings of a lifetime of guerrilla warfare.\nEubank launches into an update on ranger training and efforts to secure outside support for the resistance. Four days earlier, President Biden had signed into law the BURMA Act, hailed by some advocates as the “most significant action” the U.S. has taken for Burma in decades. The bill pledges tighter sanctions against the junta and greater support for pro-democracy groups fighting inside the country. But aid for ethnic armies was not included, and there was no mention of arms. (Though Eubank is friendly with Republican members of Congress, he denies any connection to U.S. intelligence agencies — an assertion that appears borne out by FBR’s low-budget operations and the shoddy weapons used by the rebels.)\nBaw Gyaw is blunt when asked what he needs most: better weapons. The Burma Army receives aircraft and artillery from China and Russia, and there’s only so much his fighters can do against such firepower. “The U.S. should have started helping us a long time ago, before the Chinese got so involved,” says the general. “It’s still a good time to help us.”\nEubank has lobbied Congress for years to back the resistance. But the U.S. is already spending billions in its proxy war in Ukraine; neighboring Thailand has no interest in midwifing the revolution; and China, the only foreign power involved in Burma’s conflicts, would not take kindly to U.S. meddling in its backyard. What’s more, even if there was a will among the U.S. and Western allies to arm the resistance, the jumble of ethnic militias and PDFs lack a central command and a shared strategy to defeat the Burmese military. “Who should the West support? How and with what?” says Bertil Lintner, a specialist on Burma’s affairs and insurgencies in Asia. “I can’t see any significant Western support coming anytime soon.”\nDespite their common enemy, the major armed groups in the borderlands are plagued by disunity. In Karen, the KNLA is also fighting several breakaway Karen proxy forces allied with the regime, which long ago mastered a divide-and-conquer strategy.\n“Burmese resistance movements and political opposition are their own worst enemies,” says Mathieson, who has spent more than two decades studying the country. “Any viable resistance is consistently hobbled by division. Never has a country been betrayed so much by such poor leadership.”\nBaw Gyaw, for his part, believes victory will come in his lifetime. “It’s never easy to unite all the groups, but right now most of us share the same goal, and we are committed to fighting to the end,” he says, buoyed by the influx of ethnic Burmans taking up arms alongside his forces. One of his advisers estimates the Burma Army has lost more than 15,000 men out of a frontline strength of 140,000 since the coup. Many units in Karen are stranded and facing constant harassment, which has made them more dependent on airstrikes.\n“You’ve got to think of [the Burma Army] as this giant bull in a field,” explains Davis, the security analyst. “There’s a lot of little dachshunds running around biting its legs. Sooner or later, the bull is going down and all these dogs are gonna be on its back, and at that point it begins to look like game over.”\n“Barely, imperceptibly, slowly, I think, they are weakening,” Eubank agrees. “The resistance doesn’t have to win, they just have to hold on.”\nON MISSIONS THE RANGERS bring gifts and entertainment to brighten the lives of the children living in harm’s way. So on a sunny morning in the village of Tho Thoo Plaw, gaggles of displaced kids look on as the Eubanks and rangers host a “Good Life Club” workshop, rocking back and forth to a pounding bass line. Volunteers perform backflips and slapstick routines and dance to Kenny Chesney’s “All the Pretty Girls,” before sweatshirts and cookies are handed out. It’s surreal, goofy, and joyous all at once, and Eubank revels in it.\nThe rangers are packing up camp when he gets word that Burma Army jets have bombed Da Bu No — again. Baw Gyaw is unscathed. But a ranger and a pair of volunteers narrowly missed getting killed, and one of FBR’s last four-wheel-drive trucks was totaled. “This is war,” Eubank says. “We’re gonna get them back.” In the moment, he’s more Special Forces operator than relief worker.\nA short walk up the trail, we come to a school and church complex leveled by an airstrike. A Burma Army base looms above the village on a ridge just over a mile away, and fearful locals have cleared out. The Eubanks pray and film social media clips next to a blast crater. Eubank consoles a young boy wandering alone amid the wreckage and gives a wad of money to a man who’s home was damaged. In the field, Eubank is quick to disburse whatever resources he has to whomever he deems in need. In 2022, a $3 million budget was all spent by October. Eubank put an urgent call out to a group of nine Christian supporters and raised an additional million dollars within a week to cover operations for the rest of the year.\nThe ever-present threat of attack has driven villagers to hold their Sunday service in a tarpaulin shack tucked away under a giant stand of bamboo. Eubank stands up and offers to rebuild the church. “You can build it bigger, there’s no budget,” he says. “Me, I ask God, and he says put it in the exact same place. You can build two — one here, one there. And if they destroy it again, we’ll build it again. It’s a contest between hate and love, and because of Jesus, love will win.” Eubank asks everyone to pray on it. Although the fervor has gripped him, his congregation does not look convinced.\nIn the morning, the rangers hold another variety show at the bomb site to rally the community. Music blares and children dance, and for a few hours the war is forgotten, until Eubank announces that one of FBR’s original rangers, Baw Boe, was killed earlier in the day filming a Burma Army offensive in western Karen. Baw Boe was a “padi” (uncle) to the Eubank kids since they were infants, carrying them on his shoulders and teaching them everything he knew about life in the jungle. Suuzanne, usually stoic, is caught off-guard by the news. Eubank apologizes for not telling her first, holding her close as tears stream down her face. Another extended family member lost and the second ranger to die in the new year.\nEUBANK’S STAUNCHLY HELD conservative values fly in the face of his high-risk life on the extreme margins. His war stories are a torrent of near-death experiences that beggar belief: shooting his way out of ambushes, evading Burma Army forces closing in on three sides, or coming face-to-face with an ISIS fighter in a trench — the tales often close with the punchline We almost got smoked. A few admirers half-joked that he wants to die in the jungle. “I’ll put it this way,” says one longtime FBR volunteer, “things tend to happen when Dave is around.”\nWhile the Eubanks make a point of keeping their children away from the front line, the kids have survived just about every threat that comes with operating inside a war zone. This exposure has moved some to accuse the parents of recklessness — though “never,” Eubank points out, “from the people we are standing with under fire.”\nThere was the time in Syria, in 2018, when the family had to travel by public bus through Assad-controlled territory to reach Afrin, then under assault by jihadists. Recognized by mukhabarat agents at a checkpoint and told to wait, Eubank was not going gently to a Syrian prison. He instructed the children to walk off the bus and, if the agents gave chase, throw hand grenades he’d passed out earlier “as far as you can and run for your lives. And don’t worry about me. I’m gonna throw mine, shoot everyone I can shoot, reload, and run.” The Syrians shouted after the family as they stepped into the street and ran more than 400 yards to the safety of a Kurdish checkpoint.\nI ask Eubank if there was ever a moment in hindsight where he felt he’d gambled with his children’s lives. “No,” he shoots back, with the caveat he might have been a beat too slow on deciding to leave that bus in Syria. “I know my kids and what they can do. My daughters, they’re nice. But they will shoot.” And apparently throw grenades.\nMore recently, in the Karen village of Simerplaw, a widow told the Eubanks she’d given up trying to plant rice after the Burma Army shot at her. The family followed her back to the paddy. Eubank and a ranger then crept into the paddy with handfuls of rice sprigs and a volley of gunfire poured in, bullets striking within feet of Karen and the kids at the rear. The episode was filmed and packaged into an FBR report called “Planting Rice Under Fire.”\nGetting shot at for a rice-planting photo-op? This smacked of a stunt. But Eubank explains how there had been cloud cover when he went into the field that unexpectedly lifted and exposed him to the enemy. He maintains that this, too, was “not reckless.” When the Eubanks returned to the village seven months later, the widow, Naw Thraw Gay, presented them with a sack of rice. The Burma Army soldiers who shot at them later defected. A photo of them smiling with the Eubanks appears in FBR’s annual report.\nWhen we reach Simerplaw, Eubank summons Naw Thraw Gay to share her side of the story. I ask what she thinks of the Eubanks? Are they crazy? “No, no,” she says, flashing a betel-stained smile. “They helped and gave us confidence so that we can go on with our lives. We feel braver with them among us.” Indeed, after the shooting incident, she and her neighbors went back to their fields at night to finish planting rice.\nOur next and final stop on the mission loop is Limerplaw, scene of the disastrous KNLA attack on the Burma Army outpost. The trail segues from dense jungle to dry paddy fields punctured by limestone formations that would be swarming with backpackers were it not for the war. Near the village, we drop into the shadow of a sheer rock wall, and the air is rent by a series of booms on the other side. Bursts of gunfire crackle through the valley, and there are rumors the KNLA has initiated another drone attack.\nThe fighting kicks up again when we reach camp. We’re told Suuzanne, Sahale, and Pete arrived an hour before us and headed straight to a cave they have explored since they were kids. Getting to the entrance requires traversing open ground in the direct firing line of the Burma Army outpost. Eubank decides to check on them, concerned but not worried. “They know to hide in the bamboo over there if there’s trouble,” he says, pointing to a band that rings the base of the mountain.\nBypassing the mouth of the cave, Eubank climbs up to a ledge and discovers a rebel hideout that connects down to the main subterranean passage. I follow him up, and the floor is strewn with IV bottles, unexploded rocket-propelled grenades, and torn pants soiled with blood. Stalactites loom above us like daggers. “This is pretty cool,” says Eubank, caught between war and wonder, living out a life he imagined as a boy.\nVoices echo from the cave’s recesses, and Pete soon emerges below with his monkey and other volunteers. Sahale is trailing behind them, singing a song. The kids reassure their father that they ducked into the bamboo when the Burma Army and KNLA started shooting, just as they were taught to. “I know you did,” Eubank replies. “I love you.”\nTHE RANGERS ASSEMBLE the next morning for a final children’s program. Suuzanne and Sahale need to get back to school, and Gabaw Htoo and his fellow rangers must return to far-flung units to apply their training where it’s needed most. Back on a familiar trail, I’m contemplating the warm Coke I’m going to buy at the last KNLA checkpoint when faint rumbles begin to echo across the mountains. A Russian-made Yak-130 jet screeches low overhead soon after, snapping everyone’s gaze skyward. The canopy protects us. The question is, what was just hit?\nAt the checkpoint, Eubank gets a message on the radio: The bombs struck the village of Lay Wah, about 20 miles away, and there are conflicting reports of casualties. It’s late in the day, but he wants to go check it out. Karen, Suuzanne, Sahale, and a few armed rangers jump into the flatbed of an FBR pickup, and Eubank tears off down dirt roads. The engine groans and the Eubank sisters croon “American Pie” and “Country Roads” as we rip around hairpins down to the river. A cable ferry takes us across, and we grind on until we see a truck bearing wounded.\nThe driver confirms that bombs leveled two local churches and a schoolhouse, killing five people, including a mother and her two-year-old girl. In the flatbed, Naw Chi Paw clutches her baby next to her teenage son. Her husband, a Catholic deacon, has been killed. Eubank puts his hand on her arm and says a prayer, then takes her phone number with a pledge to look after them. “We’ll come see you at the clinic tomorrow,” he assures.\nIt’s dark when we reach Lay Wah. Our headlight catches a hobbling water buffalo whose front leg was cut in half by shrapnel. Up on the plateau overlooking the village, the school and churches are blown to splinters. Four craters are surrounded with shards of glass, flip-flops, and splotches of fresh blood. Eubank records the damage on his phone as Suuzanne collects bomb fragments, and an elementary school teacher arrives with more details. Fearing airstrikes, she had already moved her students into the bush for classes. The bombs struck at around 2 p.m. Had the kids been in school, it would have been a massacre.\nAnother villager bids us to follow him into the jungle. A short walk along an ink-black footpath brings us to a clearing bathed in candlelight where five bodies are laid out under sheets — or what remains of them. Unbidden, the man strips away the cloth to show what the airstrike had done. Stumps of legs were all that was left of a church assistant. The pastor, badly mangled, lies next to the deacon, mother and child, both of whom were killed by shrapnel to the head. On the drive out, the water buffalo is groaning on the ground. Eubank dutifully stops and puts the beast out of its misery by shooting it in the head.\n“THIS IS EVIL, MAN. And this has been happening for 73 years,” Eubank says on the drive back. The deaths were cruel and arbitrary, the kind that defies logic or any belief system, and they will make no difference in the outcome of this war. Eubank has seen many lifetimes worth of such killing. If there was one thing that surprised non-Christian friends who know him more than the fact that he was still alive after all these years, it was that he still believed in a God who allows innocents to be slaughtered so brutally.\n“That’s one of the great paradoxes of faith,” he tells me. “I don’t understand that to this day.” He admits that he has “lots of doubts — they just don’t do me any good. The result of an evidently rational response to death and suffering is a hard heart, bitterness, anger, depression,” he goes on. “The opposite is to ask God for help. I’m gonna praise you and say ‘I love you’ no matter what. I practice that. And the result of that is I’m lighthearted, my vision is bigger, I’m bolder, and I have more energy. So which is actually the rational response?”\nA week after I left Burma, Eubank began a two-month mission to Karenni State, scene of the fiercest fighting in the country. Trips to Syria and Iraq would follow, and friends are pushing him to go to Ukraine. Part of him wants to bring FBR to a new frontier, but “we’re just not that big,” he says, torn between a compulsive drive and spreading FBR too thin as the civil war in Burma deepens and the world looks away.\nEubank recalled a time when Armenian friends requested FBR’s help in their fight against Azerbaijan. He was interested, but the trip didn’t work out, which Pete assured him was for the best. “He said, ‘I’m glad we didn’t go, Dad. We’re FBR. We go to the broken places with no rules, like the Wild West — that’s where we belong,’” Eubank says. “And I think he’s right.”\nReporting for this story was supported with a grant from the Pulitzer Center.",
  "word_count": 7813,
  "scraped_at": "2026-02-14T12:03:16.698775"
}