{
  "article_id": "8582a0477f90",
  "url": "https://www.finanznachrichten.de/nachrichten-2026-02/67603548-alignment-growth-kings-league-announces-dollar-63-million-investment-round-to-fuel-global-growth-and-expansion-008.htm",
  "title": "Alignment Growth : KINGS LEAGUE ANNOUNCES $63 MILLION INVESTMENT ROUND TO FUEL GLOBAL GROWTH AND EXPANSION",
  "date": "20260203T173000Z",
  "domain": "finanznachrichten.de",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- Investment led by Alignment Growth reinforces Kings League's world-leading position in creator-led sports\n- Funding will power international growth through organic expansion and select M&A\nBARCELONA, Spain and NEW YORK, Feb. 3, 2026 /PRNewswire/ -- Kings League, the creator-led sports competition founded by Gerard Piqué, today announced a $63 million investment round led by Alignment Growth, a U.S.-based media and entertainment investor, with participation from existing shareholders.\nSince its launch in Spain in 2023, Kings League has established itself as a global phenomenon in creator-led sports. The brand's formula - seven-a-side soccer reimagined for the digital age, with teams and competitions led by superstar streamers, content creators and soccer legends including Lamine Yamal, Neymar Jr. and Kaká, and \"gamified\" rules that guarantee action-packed, unpredictable matches - has driven massive online engagement and redefined how younger generations engage with sport.\nThe investment will support Kings League's next phase of growth, aimed at expanding the Kings League and Queens League platforms globally, including launching in the U.S. This follows Kings League's 2025 launch of new regional leagues in Brazil, France, Germany, Italy and the MENA region, and a new national team World Cup tournament.\nOver the course of 2025, Kings League generated 150 million livestreaming hours watched and more than 13 billion impressions across official social channels, consolidating its position as one of the most-watched sports properties on digital platforms globally.\nGerard Piqué, Kings League's Founder and Chairman - now an entrepreneur following a stellar career in professional soccer with FC Barcelona, Manchester United, and Spain - said: \"Kings League has become a global movement, built natively for the digital generation. Alignment Growth brings exceptional media and entertainment experience, and our partnership will help us continue to grow, bring the Kings League experience to new audiences, and explore diversification into new sports.\"\nDjamel Agaoua, CEO of Kings League, added: \"We have proven that our model works at scale. This funding allows us to accelerate our expansion, continue innovating the format and explore strategic M&A opportunities that support our long-term vision. The ambition is clear: to build the leading global platform for creator-led sports and entertainment.\"\nKevin Tsujihara, Co-Founder and Managing Partner at Alignment Growth who joined the Board of Kings League, said, \"Our investment in Kings League reflects our conviction that digitally native sports properties are uniquely positioned to capture powerful, long-term growth as younger audiences shift how they discover and engage with sports. Gerard, Djamel, and the entire Kings League team have built a truly innovative and global platform combining the world's most popular sport with a creator-aligned business model and we are thrilled to partner with them on this next phase of expansion.\"\nTo date, Kings League has raised more than $160 million in total funding, supporting its rapid global rollout and the development of an ecosystem that now includes seven regional Kings League men's competitions, two regional Queens League women's competitions, and two annual World Cup tournaments, for clubs and national teams. The platform has attracted blue-chip brand partners including adidas, Fortnite, Netflix, Spotify, and Visa, as well as major broadcast and streaming partners such as DAZN and ESPN/Disney+.\nAbout Kings League\nCreated by football icon and entrepreneur Gerard Piqué, Kings League is a global sports-entertainment phenomenon reimagining the world's most popular sport for the next generation. Combining elite football with the energy of the creator economy, Kings League blends fast-paced, seven-a-side action with gamified rules inspired by streaming and gaming culture-delivering a format built for modern audiences. Teams are fronted by leading streamers, content creators, and football legends, creating a unique fusion of sport, digital entertainment, and fan-focused storytelling. Since its breakout launch in Spain in 2023, Kings League has grown into a worldwide ecosystem, with competitions established across Brazil, France, Germany, Italy, MENA, Mexico, and Spain. It has expanded into the women's game with its Queens League competitions and established two annual World Cup international tournaments, for clubs and national teams. For more information, visit https://kingsleague.pro.\nAbout Alignment Growth\nAlignment Growth is a private markets specialist investor in the global Media & Entertainment industry, investing behind high-conviction themes and partnering with category-leading companies and entrepreneurs. Our team's deep industry expertise, operator experience, and direct access to global media, entertainment, tech, and capital markets leaders enable us to identify, access, and unlock differentiated value alongside our partners. For more information, visit: www.alignmentgrowth.com.\nPress Contacts:\nKings League\nNúria Picas - nuria.picas@kingsleague.pro\nKevin McCullagh - kevin.mccullagh@kingsleague.pro\nAlignment Growth\nEmily Claffey / Kate Gorgi\nFGS Global\nalignmentgrowth@fgsglobal.com\nPhoto - https://mma.prnewswire.com/media/2875537/Alignment_Growth_Alignment_Kings_Announcement_PR_Newswire_1600x900px.jpg\nView original content:https://www.prnewswire.co.uk/news-releases/kings-league-announces-63-million-investment-round-to-fuel-global-growth-and-expansion-302677876.html\nGleichzeitig vollzieht sich an der Wall Street ein lautloser Favoritenwechsel. Während viele auf Wachstum setzen, feiern Value-Titel mit verlässlichen Cashflows ihr Comeback: Telekommunikation, Industrie, Energie, Pharma – die „Cashmaschinen“ der Realwirtschaft verdrängen hoch bewertete Hoffnungsträger.\nIn unserem aktuellen Spezialreport stellen wir fünf Aktien vor, die genau in dieses neue Marktbild passen: solide, günstig bewertet und mit attraktiver Dividende. Werte, die nicht nur laufende Erträge liefern, sondern auch bei Marktkorrekturen Sicherheit bieten.\nJetzt den kostenlosen Report sichern – bevor der Value-Zug 2026 endgültig abfährt!\nDieses exklusive PDF ist nur für kurze Zeit gratis verfügbar.",
  "word_count": 846,
  "scraped_at": "2026-02-14T12:38:20.791959"
}