{
  "article_id": "85beeaeaa45a",
  "url": "https://5tjt.com/5townsjewishtimes-document-edited-by-bc/",
  "title": "Women Only JV Spring Basketball - 5 Towns Jewish Times",
  "date": "20250529T050000Z",
  "domain": "5tjt.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Women’s Only JV Spring Basketball\nHALB vs. MDY. MDY led the entire game up until the last few minutes. Emmy Wiener on HALB was unstoppable, scoring 28 out of the 41 points on her team.\nMDY came out strong from the beginning with great defense, causing HALB turnovers and converting them into fast breaks points for MDY. With just about three minutes left, Yeala Cohen on HALB scored two three pointers giving them the lead for the first time. Down 40–41, Elizabeth Cohen #45 on MDY came in clutch scoring a basket and two free throws to give MDY the lead and win the game 45–41.\nSefirat HaOmer Sports Chat\nAt HAFTR, we know that consistency is everything—on the court and in our commitment to mitzvot. That’s a message Athletic Director Joseph “Joey” Hoenig lives by and shares with his student-athletes all year long. But when Sefirat HaOmer arrives, Coach Hoenig finds a truly unique way to blend sports and spirituality—HAFTR style.\nNow in its fourth year, Coach Hoenig’s nightly Sefirat HaOmer Sports Chat has become a beloved tradition across the HAFTR community. What started as a simple reminder has grown into a nightly celebration of mitzvot, sports trivia, and school spirit. Each evening, Coach Hoenig sends out that night’s sefirah count, alongside a photo and short bio of a Jewish athlete, past or present, who wore that corresponding number. The chat is then lit up with photos and shoutouts of other athletes (Jewish or not) who wore that same number (this includes HAFTR athletes, too!). It’s fun. It’s communal. And it’s rooted in something deeply meaningful.\nToday, the sefirah chat reaches over 1,000 people—students, alumni, parents, faculty, and friends. As Coach Hoenig puts it, “Kids are involved in something fun and doing a mitzvah at the same time.” That’s the magic: it’s not just about counting; it’s about connecting. This initiative perfectly reflects HAFTR’s values—combining excellence, creativity, and a passion for Yiddishkeit in everything we do.\nWhether you’re here for the sports or the spiritual growth, Coach Hoenig’s sefira project is a home run. Or maybe we should say, a perfect 49 for 49.\nNBA Eastern Conference Finals: Knicks vs. Pacers\nGame One. “That’s the way the ball bounces.” The Knicks entered the series against the Pacers with an enormous amount of momentum coming off their thrilling victory over the reigning champion Celtics. In fact, by virtue of the Cavs losing to the Pacers, the Knicks secured home-court advantage for the Eastern Conference Finals. Madison Square Garden was standing room only and things lined up for the Knicks to take the next step. The Pacers had other ideas. This game started off fast and competitive as the teams stayed close and traded baskets in the early going. The Knicks took a small lead, but the Pacers answered right back. The score was back and forth and by halftime the Knicks held a seven-point lead. The pace of the game was frenetic and both teams were up for the challenge scoring at lightning speed. By the end of the third quarter the Knicks lead shrunk to three. This is when the tides of the game took massive swings. Jalen Brunson committed his fifth foul of the game and had to sit out for a huge part of the fourth quarter. At that moment the rest of the Knicks rose to the occasion, and they were able to put together a run that gave them a seemingly insurmountable seventeen-point lead midway through the fourth. The crowd was cheering, and the Knicks were flying. With just five minutes left, Brunson came back in the game, the Knicks still had a fourteen-point lead and that’s when the entire complexion of the game changed to create the perfect storm. Everything Indiana needed to happen happened. Aaron Neismith of the Pacers caught fire and took over the game. He made six three-pointers and led a Pacers charge where they outscored the Knicks 20–6 in the last two-and-a-half minutes. The Knicks realized they were getting a taste of their own medicine as previously in the playoffs they had been the ones that were down huge deficits and somehow miraculously pulled out victories from the jaws of defeat. The Knicks had plenty of opportunities to pull this out but costly turnovers and missed free throws in the last seconds proved to be too costly. The Knicks were still ahead by two points with just seven seconds remaining. The Pacers superstar Tyrese Haliburton stepped back and took a wild shot with his toe just over the three-point line. The ball bounced off the back of the rim, went sky high, and somehow it dropped right through the basket for the tying field goal as regulation ended. Initially thought to be a three-point shot was changed to a two-point field goal, tying the game and sending this wild contest into overtime. In OT the Knicks grabbed an early four-point lead but were outscored 13–6 the rest of the way. With just seconds to play and the Knicks down by three, Jalen Brunson and KAT each missed potential three-point game tying shots, the buzzer sounded, and the Pacers came away with a miraculous come-from-behind victory that will go down in NBA history, 138–135, and they now secured home-court advantage for the rest of the series.\nAnd One. The Knicks were up for the challenge and were able to have a 17-point lead in the fourth quarter. They somehow rested on their laurels and did not put away the Pacers when they had the opportunity to do so. Neismith torched them for six threes in that wild fourth quarter. However, after two or even three of those threes the Knicks should have paid extra attention, even double teaming him, to not allow him anymore threes. Their offense got a bit conservative in the end and that combination was the cause of this Knicks meltdown. Brunson scored 43 points and KAT had 35. All Knicks fans would sign up for that for every game. However, you can never stop playing with everything you’ve got for 48, and in this case, 53 minutes. Neismith had the game of his life and Haliburton was the constant thorn in the Knicks side. The Knicks will have to absorb this loss and come back with even more determination to recover from this epic collapse. Game two becomes a quasi-must game for the Knicks as they clearly cannot afford to go down 2–0 heading into Indiana. The silver lining here is that the Knicks played great for most of the game but for that stretch in the fourth quarter. They do have the heart and the grit, and they have the opportunity to get back to their winning ways. This is only game one. Indiana won a road game. Let the series begin.\nGame Two. The Knicks came into game two still reeling from the incredible turn of events in game one that led the Pacers to a miraculous three-point victory in overtime. The Pacers once again raced out to an early ten-point lead midway through the first quarter. Coach Thibs immediately put in his super subs Mitchell Robinson and Deuce McBride (more on that to come) and the Knicks went on their own 10–0 run. From that point on it was a seesaw battle with the Knicks holding a three-point halftime lead. It is important to note that once Thibs started subbing he did not go back to his full starting lineup for the rest of the first half. In the second half, led by center Pascal Siakam, Indiana had a 15–7 run to once again take control of the game. The Knicks led by Jalen Brunson fought back and there was a tie game going into the fourth quarter. After continuous let downs on defense, Thibs sat Towns and inserted Robinson for the bulk of the fourth quarter. He was more concerned with the defensive presence rather than the offensive threat that Towns brings. The Knicks continued to claw their way back and it came down to a final possession down by three. Brunson lofted a three-pointer from beyond the arc, but it was not good, and Indiana raced off the court with a commanding 2–0 lead in the series heading to Indiana for games three and four. The Knicks failed to make winning plays, which has been a continuous theme in the first two games.\nAnd One. Following game two there’s been a lot of discussion regarding the starting five for the Knicks. They have been completely outplayed by the Pacers and there is talk of Thibs shaking up the starting five. One possibility is inserting Mitchell Robinson for Josh Hart. That will certainly give the Knicks an edge on the defensive end as well as rebounding. However, on the offensive end, besides his occasional offensive rebounds, Robinson could pose to be a liability. The other option is for Deuce McBride to start in place of Josh Hart, which would certainly bring a spark of offense. However, that would leave the Knicks with two guards in McBride and Brunson that are shorter than the Pacers and could give the Knicks defensive matchup problems. Either way it is clear that the Knicks are not performing at their optimal levels and one of those culprits is Josh Hart. He brings so much to the table with his uncanny knack of slashing, rebounding, scoring, and assisting, but he has not been able to get on track with this series. This move or non-move is just one aspect for the Knicks to ponder as they face a hostile Indiana crowd for game three. For the Knicks they have performed well on the road throughout the season and especially in the playoffs winning three games in Detroit and two games in Boston. However, teams in NBA history to come back from 0–2 in Conference Finals after losing the first two games at home is none. The Knicks must put all that behind them and just focus on game three and only game three. They have been resilient in the past and this is as close to a must game as they have faced all season long. All they have to do is look over their shoulders to Minnesota who came out in their game three and blasted the prohibitive NBA champ favorite OKC by forty points. All it takes is one game to change the narrative and the Knicks will have to search and dig deep to pull it out and climb back in this series.\nGame Three. A KAT has nine lives. Just when you thought the season was ending, the Knicks are alive and well. They entered game three having never won in Gainbridge Field House, the home of the Indiana Pacers, in the playoffs. Down 2–0 they were facing incredible odds to try and win this game. The contest started out with the Knicks revamping their starting lineup. This is quite a change as Coach Thibs has always been very consistent with his starting lineup and substitution pattern. That all changed on Sunday. Josh Hart, the do everything player, approached Thibs to offer to come off the bench to give another look to the starting lineup. Mitchell Robinson, a defensive presence and rebounder, was inserted into the starting lineup. The Knicks started out strong in trading baskets with the Pacers in the early going with the Pacers holding a four-point lead after one quarter. At the start of the second quarter Jalen Brunson got his usual rest with Deuce McBride coming in as his sub. McBride, unconventionally picked up three quick fouls and had to be substituted out of the game. That’s when Thibs went down the bench. He inserted veteran Delon Wright and Landry Shamet to infuse some life into the Knicks. Coincidentally the Pacers started to separate themselves and went on a run that gave them a 55–35 lead. This time it felt different as the Knicks seemed lost and unable to contain the fast pace of the Pacers. The Knicks somehow were able to go on a short 7–0 spurt to close the second quarter and were only down 13 points at halftime giving them some hope. In the second half the tide started to change. The Knicks hung in, led by OG and Bridges and they cut the deficit to 10 going into the fourth quarter. The Knicks were in the midst of a 25–6 run that carried over into the fourth quarter. This was the time that Karl Anthony Towns officially became a Knick on the court. Due to his ineffective play and some foul trouble, he scored only four points heading into the fourth quarter. Surrounded by teammates who normally do not play such important minutes (Shamet, Wright), KAT took over the game. With a combination of threes, hard drives to the basket, resulting in conventional three-point plays, Towns scored twenty points in the fourth quarter alone. This run by the Knicks was aided by the unrelenting defense and pressure put on by these bench players joined by Josh Hart. With Jalen Brunson on the bench once again with five fouls, the Knicks managed to finally tie the score and take a small lead with just minutes on the clock, stunning the Pacers and the home crowd. When Brunson was inserted back into the game with just under two minutes left, he did what he always does. He hit a clutch basket in the lane and made his foul shots. Josh Hart was all over the court again, doing what he does best. He also hit clutch foul shots. During his run, KAT also made his foul shots. The Knicks would go on to outscore the Pacers 36–20 in the fourth quarter and hold on for a remarkable come from behind win 106–100 and have made their arrival into this series.\nAnd One. The Knicks flipped the script. With their backs up against the wall, the Knicks team came together and put on a performance that they are capable of doing. They reversed what took place in the heartbreaking loss in game one where they blew a 17-point lead and in the process gave the Pacers a taste of their own medicine. They became the first team in NBA history to be down 20 points in three games of the playoffs and come back to win the game. They made their foul shots this time to put the game away. Even Thibs completely outcoached the Pacers Coach Rick Carlisle. The Knicks are now 6–1 in road playoff games this season which minimizes the effect of home court. After three games the Pacers hold a two-point advantage in total point differential. This goes to show how evenly matched these two teams are and that no lead is ever safe. The Knicks have made a statement and can now breathe a sigh of relief that they are back in this series. They also realize how much effort it will take to continue and build on this momentum they created. The Pacers will come back in game four determined not to give the Knicks any breathing room. The Knicks now have the confidence that they can indeed compete and defeat the Pacers. They will look to tie this series up and bring it back to MSG for game five and make it a two-out-of-three series.\nTop-seeded OKC came out of the gate quickly and held serve on their home court to take a quick 2–0 series lead. In game three, on their home court, the TWolves blitzed the Thunder by 42 points! Game four was a much tighter contest with the Thunder winning by two and taking a commanding 3–1 lead in games. The Thunder have been led by the 2025 MVP SGA and supported with a very strong cast of players whose defense can be extremely stifling at times. The TWolves are led by Anthony Edwards who has shown only flashes of his star status so far with former Knick Julius Randle being a big disappointment. The TWolves need to excel on all cylinders if they are to get back into this series. Short of a miracle, the Thunder will most likely close out this series on their home court in game five and punch their ticket to the NBA Finals.\nOur thoughts and prayers are with our brothers and sisters in Israel.\n5 Towns Flag Football playoffs\nWhat a week it was in the 5 Towns Flag Football League. We started the first round of the playoffs, and the games were so close with many games going into overtime. In the pre-1a and first-grade division the boys finished up the season with great playing and the pre-1a boys learning how to play with flash for the first time.\nIn the second-grade division all teams made the playoffs, and the following teams had great victories: the Vikings, Panthers, Eagles, and Patriots all moved on to the semifinals. Dovid Brazil and Shlomo Weider were the MVPs in their games.\nIn the third- and fourth-grade division Morde Shapiro led his Saints squad to a great victory and the Steelers, Vikings, and Seahawks were all victorious.\nIn the fifth- and sixth-grade league the number one seed Vikings won a close match with Mo Friedman making some amazing catches. The Giants upset the number two seed Jets. We can’t wait for next week’s semifinals and championship games.\nHonoring Joey Gordon, the Iron Man of the 5 Towns Hockey League\nThis past week, the 5 Towns Hockey League respectfully paid tribute with a special award to Joey Gordon, just prior to the championship games. Joey demonstrated remarkable dedication by playing nearly every night of the season—whether during his regular game slot or as a substitute—consistently contributing to the league’s success.\nThroughout the season, Joey exhibited his characteristic humility and modesty, always conducting himself with the demeanor of a true mensch. We also extend our sincere gratitude to his father for providing transportation each night, ensuring Joey could participate consistently. We look forward to the upcoming season—save some lollipops for us—and are eager to see what the future holds for this promising young hockey star.\n5 Towns Hockey championships\nStanley Cup—5 Towns Hockey Championship Games\nAs the championship games have just finished we take a look back on what an incredible season this was. The Five Towns Hockey League has experienced a truly exceptional season, marked by intense competition and outstanding athleticism across all participating teams. The level of play throughout the regular season was consistently high, culminating in a postseason that delivered memorable moments and surprising results. The playoffs were especially noteworthy, featuring a series of upsets that defied early expectations. Initially, it appeared that the top-seeded teams would have a straightforward path to securing the championship. However, the underdog teams demonstrated remarkable resilience and skill, ultimately disrupting the anticipated dominance of the top seeds. As of this writing, none of the number one seeds have claimed the championship, underscoring the unpredictability and excitement that define this year’s league playoffs. In the second- and third-grade league, we’d like to congratulate Rabbi Lieberman’s team for an incredible playoff run, upsetting higher-ranked teams round after round to win the championship over Leon Mayer’s team, who put up a great fight. Special congratulations to MVP Shua Terline, who was phenomenal in goal.\nIn the fourth/fifth-grade league, Leon Mayer finally captured the championship with a thrilling 3–2 victory over Elie Errich’s team. Elie did an outstanding job, but Leon’s squad, led by MVP Avraham Mayer, was a force to be reckoned with. We’d also like to thank all the coaches in the league for dedicating their time to help coach and teach the children how to play. Your efforts are truly appreciated!\nBoth championship games were fantastic, and we’re already looking forward to next season! Registration is now open at 5townssports.com.\nJudah Rhine, who has been involved in youth basketball for more than 40 years, is co-director of MVP Camps and administrator of the MJDSBL. He can be reached at [email protected]. Read more of Judah Rhine’s articles at 5TJT.com.",
  "word_count": 3349,
  "scraped_at": "2026-02-14T12:43:23.285638"
}