{
  "article_id": "863613ac2d66",
  "url": "https://www.aa.com.tr/en/world/morning-briefing-july-26-2024/3285786",
  "title": "Morning Briefing : July 26 , 2024",
  "date": "20240726T061500Z",
  "domain": "aa.com.tr",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Morning Briefing: July 26, 2024\nAnadolu’s recap of top stories from around the globe\nISTANBUL\nHere is a rundown of all the news that you need to start your Friday with, including US President Joe Biden and Israeli Prime Minister Benjamin Netanyahu beginning long-awaited closed-door talks at the White House, Baku saying Armenia’s \"provocative actions\" indicate preparations for another war with Azerbaijan, and the Kremlin refraining from commenting on Netanyahu’s proposal for a security pact in the Mideast.\nTOP STORIES\nUS President Joe Biden and Israeli Prime Minister Benjamin Netanyahu began long-awaited closed-door talks that the White House said Biden would use to press for an elusive cease-fire in the besieged Gaza Strip.\nAddressing reporters in brief remarks, Netanyahu said about meeting with Biden: \"I'm looking forward to discussing with you today, and working with you in the months ahead, on the great issues before us.\"\n\"From a proud Jewish Zionist to a proud Irish-American Zionist, I want to thank you for 50 years of public service and 50 years of support for the State of Israel,\" Netanyahu said as Biden prepares to wind down his career.\nBaku said Armenia’s recent “provocative actions” indicate the country’s preparation for another war with Azerbaijan.\n“The military exercises conducted by the United States in Armenia, the provision of lethal weapons to Armenia by France, and the initial phase of military aid in amount of ten million euros provided to Armenia by the European Union under the European Peace Facility encourage the occupying state - Armenia to carry out such provocations and indicate its preparation for another war against Azerbaijan,” said an Azerbaijani Defense Ministry statement.\nThe statement came soon after the ministry reported to have downed an Armenian quadcopter carrying out reconnaissance flights over the Azerbaijani military positions in the country’s northwestern Tovuz region earlier in the day.\nThe Kremlin refrained from commenting on Israeli Prime Minister Benjamin Netanyahu’s proposal to create a security pact in the Middle East, which he dubbed the \"Abraham Alliance.\"\n“It is necessary to understand the details of Mr. Netanyahu’s reasoning before concluding anything,” Kremlin spokesman Dmitry Peskov told reporters in a press briefing in response to a question on the Israeli premier’s initiative.\nDuring an address before a joint session of the US Congress on Wednesday, Netanyahu said such an alliance would be a \"natural extension\" of normalization agreements known as the \"Abraham Accords\" that Israel brokered with Arab states during the Trump administration.\nNEWS IN BRIEF\n- Turkish security forces “neutralized” 94 PKK/YPG terrorists in northern Iraq and northern Syria over the past week, said the country’s National Defense Ministry.\n- Several people were detained in Russia's Dagestan region during a raid on a residential building amid reports about a bomb threat, according to the Interior Ministry.\n- A Chinese and Russian flight near Alaskan airspace was the \"first time\" the US detected a joint flight between the two countries, the head of the Pentagon said.\n- The White House sought to distance itself from Israeli Prime Minister Benjamin Netanyahu's characterization of pro-Palestinian demonstrators as \"Iran's useful idiots,\" saying the remarks are inaccurate.\n- Hamas condemned the torture of six Palestinians, including two women, who were released from Israeli prisons.\n- South Africa’s President Cyril Ramaphosa appointed Mandisa Maya as the country’s first female chief justice, according to a statement from the presidency.\n- Türkiye urged the international community to immediately stop Israeli atrocities to bring peace to the region.\n- Turkish Foreign Minister Hakan Fidan condemned those applauding Israeli Prime Minister Benjamin Netanyahu in the US Congress, branding them as endorsers of a \"bloody criminal.\"\n- Russia and China aim to build a joint Moon station in three stages, and work on five missions to Earth's satellite has already begun, according to an official agreement published on the Russian governmental portal.\n- Greece announced that it signed and sent a Letter of Acceptance (LOA) for 20 F-35 jets to the US.\n- New Zealand has reported Canada Soccer for a flying drone above its women's football training site at the Paris 2024 Olympics.\n- Palestinian resistance group Hamas claimed to have killed and injured Israeli soldiers in an ambush in the southern Gaza Strip.\n- At least 91 journalists have been detained by the Israeli army since the outbreak of the conflict in the Gaza Strip last Oct. 7, according to a local nongovernmental organization.\n- The EU foreign policy chief said the bloc is ready to support all efforts to end the war in Sudan.\n- Four Palestinians were killed and several others injured in a fresh Israeli airstrike in Khan Younis in the southern Gaza Strip, medical sources said.\n- Two Russian and two Chinese aircraft were detected and intercepted by the North American Aerospace Defense Command (NORAD).\n- “Last Generation” climate activists brought Germany's largest airport in Frankfurt to a standstill.\n- Hamas strongly criticized allowing Israeli Prime Minister Benjamin Netanyahu to deliver a speech at the US Congress, accusing him of \"distorting facts\" over his war conduct in Gaza.\nSPORTS\nThe Paris 2024 Olympic Games will officially start with an exceptional opening ceremony across the River Seine on Friday evening.\nIt will be the first time that an opening ceremony of the Olympics will not be held at a stadium.\n\"Paris 2024 is breaking new ground by bringing sports into the city and the same will be true of the Opening Ceremony, set to be held in the heart of the city along its main artery: the Seine,\" the Paris 2024 statement read.\nFrench authorities have detained an 18-year-old suspect in the southern province of Gironde on suspicion of planning an attack in the lead-up to the Olympic Games.\nThe arrest follows the detention of another 18-year-old on Tuesday for similar reasons.\nThe French National Anti-Terrorism Prosecutor’s Office (PNAT) said the newest suspect was apprehended shortly before the opening ceremony which is scheduled for Friday.\nThe Argentine national football team was robbed before their Paris 2024 Olympics match, the head coach said.\n\"Yesterday (Tuesday), thieves entered our training place and we were robbed. Thiago Almada had his belongings, a watch and jewels stolen,\" Head Coach Javier Mascherano, a former Barcelona and Argentina midfielder, said.\n\"We didn't want to say anything after training,\" the 40-year-old added.\nIsrael should not participate in the Paris Olympics, Palestinian Olympic Committee President Jibril Rajoub said, urging the International Olympic Committee (IOC) to reconsider its decision and make the world aware of the atrocities committed in Gaza.\nSpeaking to reporters at Paris Charles de Gaulle Airport, where he arrived for the Paris 2024 Olympics, Rajoub said Israel has lost the right to compete in the Olympics, just as South Africa did from 1964 to 1988 during apartheid.\nHe stated that Israel's Olympic Committee has forfeited its right to participate in international sporting events, referencing the IOC's 1970 decision to expel the South African National Olympic Committee (NOC) from the organization.\nBUSINESS & ECONOMY\nThe recent global technology outage triggered by cybersecurity firm CrowdStrike caused an estimated loss of $5.4 billion to Fortune 500 companies, according to a report by the insurance firm Parametrix.\nThe losses caused by the disruption, excluding Microsoft, affected 25% of Fortune 500 companies, said Parametrix.\nThe most affected sectors were airlines, healthcare, and banking, the report showed, adding that the healthcare industry suffered the highest loss.\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options.",
  "word_count": 1254,
  "scraped_at": "2026-02-14T12:09:35.001028"
}