{
  "article_id": "864ebbc1583c",
  "url": "https://www.the42.ie/sarah-rowe-bohs-6014819-Mar2023/",
  "title": "Sarah Rowe focused on new Bohs career rather than World Cup  narrative  ",
  "date": "20230310T111500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SARAH ROWE INSISTS she is focused on her new career with Bohemians rather than forcing her way into the Republic of Ireland’s World Cup plans.\nThe Mayo multi-sport star has experienced a whirlwind start to 2023, signing for for A-League Women’s club Melbourne Victory in January before a dramatic return to these shores to join Bohemians ahead of the new Women’s Premier Division season.\nRowe appeared to be making a real World Cup push, the Collingwood AFLW ace having previously excelled on the Irish soccer scene. “One can dream,” she told Australian media of the prospect.\nBut the 27-year-old, who is also an accomplished inter-county footballer with the Green and Red, stresses that a call-up to Vera Pauw’s Irish squad is not to the forefront of her mind.\n“It’s a funny one,” she says. “I feel like there has been a narrative created around it.\n“For me, it’s about reaching my potential in soccer. I have enjoyed going back to a sport I love. It’s about working hard, focusing on Bohs. I probably don’t think any further than today and tomorrow really, to be honest.”\nRowe, who made her Bohs debut in last weekend’s win at Treaty United and is now gearing up to face her former side Shelbourne, previously featured at a home-based training session under Pauw’s watch in September 2021, so is on the manager’s radar.\nShe says there has been no recent contact, though. “No, just a couple of years ago when I went into the home-based it was about letting her know if I ever decided to go back to play soccer and asking for advice around that.\n“In terms of playing, I have talked to Dave Connell. He is always someone who has been a real support for me, and Sean [Byrne] obviously at Bohs.”\n“It’s incredible to see what the girls have done,” the Irish underage and one-cap senior international later added. “It’s amazing how excited all the Irish people are by what the girls have achieved. It’s amazing just to see the reward for effort, how hard the girls have worked for the last couple of years to get there.”\nRowe went on to explain how the move to Dalymount came about, and reflected on a rollercoaster couple of months on opposite ends of the world.\n“I had just enquired about the Irish league because the season with Melbourne Victory ends around the middle of April and at that point, you are left without any football. So my thoughts were to come home to play some time in Ireland.\n“I realised that the transfer windows were closing in 48 hours so I had to make a decision pretty quickly. I was really enjoying being in Melbourne Victory in a pro set-up, I learnt an awful lot, we were training every morning from half six to 12 every day. It is great to come home.\n“My first training session, I hadn’t kicked a football in years properly and I was going straight into a pro environment and also straight into a trial. The coach had backed me on word of mouth, he said that, ‘I think your attitude towards wanting to get better [is great]’. The first few weeks, they were definitely difficult. Training soccer, it is very different to AFL. You are more an endurance-based athlete in AFL, but the short, sharp agility focus that is put on soccer players.”\nWhile Aussie Rules and Gaelic football have consumed her life in recent seasons, there was always unfinished business with soccer. In terms making full return after a lengthy hiatus, it was always a case of when.\n“I played two games for Shelbourne two years ago but before that, it was eight years ago. I left to concentrate on GAA after the Ireland U19s were in the European finals. I have always wanted to go back and been thinking about it.\n“It felt like the perfect opportunity this year, because our season dates had changed and our seasons had aligned.”\nRowe remains under contract with Collingwood, with the club’s full support and in constant contact, but is unsure about when she will return amidst uncertainty over the 2023 season start date.\nIt’s likely to be August, but for now, her full focus is on this new chapter with Bohs and reaching her potential. To do just that, the attacker is working closely with Gypsies boss Byrne, who was her manager at Raheny United (pre-Shelbourne amalgamation) and was involved with Connell in her underage Ireland squads.\nFrom video analysis and other “finer details” to training with boys on the FÁS FAI/ETB Player Development Course in Irishtown, no stone is being left unturned.\n“They train four days-a-week, I train with them and then the girls in the evening and then also one-on-one extra sessions,” she explains. “I train six days-a-week generally, take Sundays off. That’s what I’m used to as it was my job in Australia. Being in Ireland semi-professional still feels like this is my job to look after my body.”\nIt will be put on the line this weekend as she faces her former side Shels. It’s shaping up to be an interesting one, and Rowe is relishing her first game at Dalymount Park with her family due to attend.\n“To play against old team-mates is always a funny one,” she concludes. “I think I have built so many good relationships with those girls in Shelbourne that there is no bad blood.\n“Pearl Slattery is just great and we get on so well, so I think it will be a bit of a laugh and a joke more than us going at each other. I’m excited for the first home game more so than anything.”",
  "word_count": 951,
  "scraped_at": "2026-02-14T13:07:53.202265"
}