{
  "article_id": "8655d87a994e",
  "url": "https://www.arsenal.com/news/lotte-miss-out-final-disappointing",
  "title": "Lotte :  To miss out on a final is disappointing  | Interview | News",
  "date": "20260122T023000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lotte Wubben-Moy was disappointed not to reach the final of the Subway Women’s League Cup following Wednesday’s 1-0 defeat at home to Manchester United.\nA goal from Elisabeth Terland pegged us back and we were unable to find an equalising goal, with Olivia Smith seeing a second yellow card in the second half.\n“I think Arsenal Football Club, the team mentality we’ve got, we want to fight for final spots, so to miss out on a final today is very disappointing,” Lotte said after the match. “Disappointing I think in particular because the performance was there. We created so many chances, even when we were down to ten women, we were on top, we had a lot of energy and ultimately, the game’s about putting the ball in the back of the net and we weren’t able to do that today.\n“Going down to ten players, it’s a lot more running, you’re covering a lot more ground. We went man for man, and I thought that actually suited us. We really put pressure on them and they couldn’t really sustain it, sustain the ball that is, under pressure, so it created a lot of opportunities for us when we did turn over the ball.\n“Like I said, I thought we had a lot of energy when we did go down to ten women. It’s a tough one. We went down to ten, with a formation 4-4-1, you kind of lose that pendulum of press that we have, so it does change the game a lot but I think when you look at mentality, you can’t fault that energy that we put in.”\nThe big games keep coming with Chelsea up next at Stamford Bridge on Saturday, before the opportunity to reach the FIFA Women’s Champions Cup final next week.\n“We relish those opportunities you know,” Lotte said. “Like I say, we’re disappointed about not being able to get to a final today, but there are more opportunities. Chelsea on the weekend, a performance that we can build on today. I’ve said it before and I’ll say it again, I believe.\n“I believe in our players and I believe in the forwards and it just takes that next opportunity and I know they’ll bury the ball in the back of the net, take that chance and no better opportunity to do it than on Saturday, and in a final in the Champions Cup, hopefully we can get to.”\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 434,
  "scraped_at": "2026-02-14T12:51:30.935962"
}