{
  "article_id": "8658f38d512c",
  "url": "https://www.prokerala.com/news/articles/a1627811.html",
  "title": "Football : Lotte Wubben - Moy signs new contract with Arsenal Women",
  "date": "20250422T113000Z",
  "domain": "prokerala.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "London, April 22 : Lotte Wubben-Moy has signed a new contract with Arsenal Women, continuing her long-term association with the Lady Gunners. England international defender Lotte has so far made 143 senior appearances for Arsenal, scoring ten goals along the way.\nAged 26, Lotte developed through Arsenal's youth academy before making her senior debut in 2015 at the age of just 16. She then spent time in the USA with the North Carolina Tar Heels, before returning to Gunners in 2020.\nLotte has won the FA Cup and three League Cup titles with Arsenal across her two spells at the club and was voted our 2023/24 Player of the Season following an outstanding campaign.\nMeanwhile, at the international level, Lotte has won 13 caps for England. She was part of the Lionesses squad, which won the 2022 UEFA Women's Championship and reached the FIFA World Cup Final in 2023.\nLotte was also honoured with the Charlton Award in July 2024 for her significant impact on developing the future of football.\n\"I feel a huge amount of pride, excitement, and optimism to once again put pen to paper at this special football club. Arsenal is the club I want to win with, and I feel this new contract comes at a time in my career where my ambitions are matched by my abilities on the pitch. I'm determined to make this next chapter count,\" Lotte said in the statement.\nHead coach Renee Slegers added, \"We're so happy that Lotte has signed a new contract. Lotte is a top defender who has shown significant progression in recent years, and will continue to play an important role as we pursue our shared goal of competing for the highest honours in the game.\"\nDirector of Women's Football Clare Wheatley said, \"We're very proud of Lotte's journey from our academy to our first team, through to this new contract here with us. Lotte is a wonderful role model for all young players – an example of how hard work, strong values, and determination are the platform for success. We know that she will continue to give all of herself to Arsenal Football Club, on the pitch, and of course in her consistent support of our wider community.\"",
  "word_count": 372,
  "scraped_at": "2026-02-14T13:06:33.751517"
}