{
  "article_id": "865bbd7e27d0",
  "url": "https://www.hudsonriverblue.com/uefa-womens-euros-semifinal-preview-spain-vs-germany-gotham-fc-nwsl-esther-gonzalez-akb-ann-katrin-berger/",
  "title": "UEFA Women Euros Semifinal Preview : Spain vs Germany",
  "date": "20250723T081500Z",
  "domain": "hudsonriverblue.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Game Day Essentials\n• Semifinal: Spain (#2) vs Germany (#3)\n• Date and Time: Wednesday, July 23 at 3:00 pm ET\n• Venue: Stadion Letzigrund, Zürich, Switzerland\n• Forecast: Partially sunny, 78F/25C\n• How to Watch: FOX Sports\n• Referee: Edina Alves (BRA)\nIn a clash between two European giants, reigning World Champions Spain take on former World Champions Germany in the 2025 UEFA Women's Euros semifinal to be played today in Zürich.\nSpain enter the matchup with a perfect record in the tournament, topping their group and then easily moving past Switzerland 2-0 in the quarterfinals. On the other side of the field, the Deutsche Fußball-Nationalmannschaft der Frauen faced ups and downs in the group stage to make the knockout before moving past France in a rollercoaster of a game. Germany advanced after a wild penalty shootout and heroic goalkeeping from Gotham FC's own Ann-Katrin Berger.\nGermany are familiar with this stage of the tournament, playing in their record 11th Euros semifinal, while Spain make their first appearance since they debuted in 1997. Despite Spain's dominance in international football over the last few years, Germany is their Achilles heel. Spain are winless against the Germans, falling 1-0 the last time the two faced each other in the 2024 Olympic bronze medal match. In that game, Berger – often called AKB – saved what would have been a game-tying goal struck by midfielder Alexia Putellas in extra time. Germany defeated La Roja in the previous edition of the Euros in 2022, as well, with goals from Klara Bühl and Alexandra Pop leading them to a 2-0 win.\nPutellas is the only Spanish player in the Euros squad to score against Germany — that came in a 2022 friendly that ended in a 1-1 draw. The matchup promises all the drama and fireworks of a game worthy of the Euros semifinals. Here are five things you should you should know about Spain vs Germany.\n1. Top scorer vs top goalkeeper\nGotham fans will be excited for this matchup to play out. It's a long-awaited showdown between two teammates who have more than made their mark in Switzerland.\nSpain's Esther González enters the semifinals as the top scorer at this year's Euros. Her brace against Portugal and a goal each against Belgium and Italy puts her at the top of the Golden Boot Race. It's a familiar position for González, given that her 10 goals in 13 games for Gotham makes her the current goal leader in the National Women's Soccer League as well.\nAKB, on the other hand, is coming off arguably the best goalkeeping performance of the tournament. Her nine saves against France in the quarterfinals, including what would have been a game-ending own goal in the 103rd minute, kept Germany in the game despite being reduced to 10 players in the 13th minute.\nThe two regularly play in tandem while at Gotham, a friendship they'll have to leave at the bench the moment they step onto the pitch today. González will be looking to add to her scoring tally after leaving the quarters with no goal contribution, but AKB has all the tools to prevent her from doing so. Berger's quick reflexes and analytical mind give her the advantage of staying on top of a ball while it's in play and anticipating its movement.\nHowever, let's not be quick to disqualify González. The 32-year-old uses her speed to her advantage, outrunning the opposition's backline to stay ahead of long-range crosses to find a precise shot in the back of the net. She's not afraid to hit a header or go one-on-one with a goalie. Knowing AKB's comfort with putting her body on the line to save a shot, González will have to get creative with her shots, alternating between sharp, low crosses and balls in the higher corners of the net.\n2. To penalty, or not to penalty\nThis year's edition of the Euros has been awash with penalties.\nMost notably, the wild penalty shootout that sent Germany to the semifinals saw them score five of their six penalties, netting several into the bottom corners as well as a bold attempt straight down the middle. Even Berger converted her attempt, nestling her shot into the top right corner. German midfielder Sjoeke Nüsken scored the winning penalty following a penalty she missed earlier in regulation time. Nüsken redeemed herself in the shootout, striking her ball into the bottom right-hand corner.\nNo Spain game has gone to a shootout this tournament, although the squad had two penalties in their quarterfinal matchup against Switzerland, one in the ninth minute and another in the 88th minute. Caldentey tried to convert the first and Putellas the second, but neither player scored. Caldentey missed her penalty by shooting to the far left while Putellas sent one straight into the middle, easily saved by Swiss goalkeeper Livia Peng.\nOfficial Highlights | Spain 2 - 0 Switzerland\nThe women's national team has struggled with penalties on the big stage. La Roja overcame Colombia 4-2 in penalties during the 2024 Olympic quarterfinals, but failed to advance in penalties against Austria during the 2017 Euro quarterfinals. While this year's national team has yet to face a team in penalties, the likelihood of Spanish victory diminishes with the pressure of a shootout.\nSpain will do anything to avoid penalties, which means keeping pressure on Germany's backline in an attempt to take a large lead. If the German defense can hold Spain's star strikers to a draw, they should have the edge in a potential penalty shootout.\n3. Spanish scorers shine\nGonzález is one of nine Spanish players on this super squad to score in this tournament. National team veterans Putellas and Aitana Bonmatí are just as likely to score as they are to assist. Clàudia Pina and Athenea del Castillo comes as close seconds, both scoring two goals each in the tournament so far. Not to mention standout goals from 18-year-old Vicky López and 32-year-old Cristina Martín-Prieto in a group stage match against Portugal show La Roja's goal scoring defies age limits.\nPosition does not limit the Spanish squad, as evidenced by the diversity of players who scored. The dynamic playing style of Montse Tomé's squad inspires goal-scoring combinations that simply click.\nThe flow on the pitch is reflected in the team's stats. Putellas currently leads the tournament in assists with four, while Pina leads in most attempts on target with nine. As a team, Spain leads the tournament in passing with 89.5% accuracy, and in attempts at 101. The unrelenting pace of this Spanish team is trouble for every team at this tournament — none have been able to keep up.\n4. German energy levels\nSpeaking of unrelenting pace, the Germans are at a disadvantage when it comes to energy levels. Their quarterfinal match against France went a full 120 minutes in addition to an 11-goal penalty shootout. That game was played a day after Spain's win over Switzerland: Not only did they leg out an extended game with 10 players, they're coming into this match on shorter rest.\nMore than that, the Germans have been forced to play catch-up throughout the tournament, while the Spanish dictate the tempo in their games.\nSpain have rushed to a first-half lead in every game except in the 2-0 quarterfinal win over Switzerland. They'll look to score early today, and capitalize on that momentum. If the Germans are anything less than 100% fit, they'll fall hard and fast to a relentless Spanish strike.\nOfficial Highlights | Germany 1 (6) - 1 (5) France\nGermany needs to have a strategy in place to counteract Spain's aggressiveness. Top German players like captain Giulia Gwinn and Sarai Linder are out with injury, while Kathrin Hendrich and Sjoeke Nüsken will not play due to suspension. With the amount of top players out and other top German players like Klara Buehl and AKB playing extra minutes, German substitutes will have to step up to the plate to match the intensity Spain's impact subs bring to the pitch.\n5. Spanish brick wall\nThere are very few balls that make it past Spain's midfield. Even fewer make it past Spain's backline. Much of that resistance is thanks to PSG's Olga Carmona. The left-back is instrumental in disrupting her opponent's flow while making complete passes in space she creates. She's one of several defenders in La Roja's backline who have limited the opposition to no more than 2 goals a game.\nGermany will need to follow a similar approach that Belgium and Italy took to nab leads over the tournament favorites: take advantage of corner kicks and fouls. If the Germans can use a set piece to disrupt the Spanish backline, they stand a chance to score within the space provided by a misstep. Saving their energy to act on practiced plays is a must for Germany.",
  "word_count": 1477,
  "scraped_at": "2026-02-14T12:43:58.267297"
}