{
  "article_id": "8668ac2eec3d",
  "url": "https://www.90min.com/features/hayley-raso-push-tottenham-next-level",
  "title": "Hayley Raso : How experienced international could push Tottenham to the next level",
  "date": "20240904T181500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hayley Raso: How experienced international could push Tottenham to the next level\n- The 29-year-old has inked a two-year contract in north London\n- Australian forward spent the 2023/24 campaign at Real Madrid\n- Raso joins rontline that features Bethany England, Jessica Naz and Martha Thomas\nHayley Raso has played in four different leagues across the world and has 14 years of international experience under her belt, so it's no surprise the Australian was a target for Tottenham Hotspur during the summer transfer window.\nThe Lilywhites recently confirmed the 29-year-old winger's arrival on a two-year deal, 12 months after she departed last season's Women's Super League runners-up Manchester City to join Real Madrid.\nRaso played for Everton prior to her spell with City – giving her plenty of experience in England's top flight – and there's no question that she's arriving at a very exciting time for the club.\nA maiden FA Cup final appearance may have ended in defeat against Manchester United, but manager Robert Vilahamn is targeting further improvement after adding Clare Hunt, Amanda Nilden and Ella Morris to the ranks at Spurs - all signings made with long-term growth in mind.\nHere's why 90min may have turned to Raso to push Spurs on...\nInternational experience\nRaso quickly became a regular starter for Australia after making her debut in 2012, and she's gone to score 19 goals in 82 appearances.\nHer importance was highlighted during the 2023 Women's World Cup which saw the Matildas reach the semi-final stage on home soil. Raso played in every game Australia played at the tournament and scored twice, proving to be a decisive player in key moments.\nExtensive experience at the highest level makes Raso an attractive prospect for any team, with Spurs no doubt hoping that her past memories of winning and losing in big moments will stand the club in good stead for the future. At the very least, she'll be able to share plenty of wisdom with the young players coming through the ranks.\nPace to burn\nRaso can play as a winger, striker or central attacking midfielder – versatility that Vilahamn can fall back on when things need to be changed up in-game.\nWith pace to burn, Raso is not only a huge threat for opposition defences down the wing but she's also a willing runner the other way, tracking back to limit the impact of opposition runners and help maintain the shape of the team.\nHer lack of regular minutes at Real Madrid will be a slight concern - 28 appearances saw her in and out of the side - but Vilahamn knows what he's getting with Raso, which should help her hit the ground running in her new surroundings.\nCreativity but not a glut of goals\nOne thing Raso is not renowned for is her goalscoring and that's one area Vilahamn may challenge her to improve in following the departures of Celin Bizet and Grace Clinton.\nBeth England will be the focal point for goals – her record speaks for itself – but Raso will play a key role in providing chances for the former Chelsea striker, getting into pockets of space between the lines in addition to bursting to the byline.\nRaso's best return in a single WSL season is five goals for Everton during 2020/21, so that alone could force Spurs to look for another goal threat to allow her to focus on providing and nurturing the club's young players.",
  "word_count": 576,
  "scraped_at": "2026-02-14T12:42:07.801953"
}