{
  "article_id": "86b8868c017a",
  "url": "https://www.sandiegouniontribune.com/2025/04/11/tom-krasovic-wave-gm-camille-ashton-building-club-after-successful-stint-in-kansas-city/",
  "title": "Tom Krasovic : Wave GM Camille Ashton building club after successful stint in Kansas City",
  "date": "20250411T223000Z",
  "domain": "sandiegouniontribune.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "San Diego Wave general manager Camille Ashton will see bright aspects of her soccer past and present on Saturday, when the Kansas City Current and Wave play in Mission Valley.\nCurrent forward Temwa Chawinga is a global star from Africa who, along with coach Vlatko Andonovski, joined the club when Ashton was Kansas City’s GM. Teams built partly by Ashton reached the National Women’s Soccer League final in 2022 and semifinals in 2024. Led by its top star and coach, K.C. now stands 3-0-0.\nAshton left K.C. last May, joining the Wave a month later.\nSeveral players she’s brought to San Diego (1-1-1) have provided entertaining moments. One is African forward Chiamaka Okwuchukwu, 19.\nIn 2011, the future Wave GM was a versatile All-American on Stanford’s national championship team. She went on to play with three NWSL franchises and in three European leagues.\nEmbracing a learning adventure, Ashton then worked with World Wrestling Entertainment (WWE) in talent development.\nThe mother of a young boy and expecting the birth of her second son this summer, the 34-year-old Ashton answered questions ahead of Saturday’s 7 p.m. match at Snapdragon Stadium.\nWhat excites you about this Wave team?\nA: There’s a lot that does. It’s obviously early. There was a lot of change to this team over the last couple of months. You can see the way we’re trying to play the game. It’s an exciting team to watch and a team that is fighting to win.\nIn what ways is coach Jonas Eidevall, formerly of England’s Arsenal, meeting the expectations you had when you hired him in January?\nA: He’s done a really, really good job in a short amount of time. We had staff still joining throughout the preseason. So it wasn’t like there was a lot of time to put this new group together to build connections and set up processes to start the season. So, he’s really starting to build a foundation. He’s very clear in his expectations and standards.\nWhat’s your scouting report of yourself as a player?\nA: I don’t know (laughs). I haven’t thought about me in a long time. It’s been a minute.\nYou played several positions, right?\nA: That is true. I spent a lot of my career playing multiple positions. I was usually a right back. But I played left back, central-mid. I played like a wing position. So at Stanford, I played every single position except for goalkeeper at some point.\nThat seems conducive to becoming a GM. Broadened your soccer view?\nA: Yes, you certainly learn a lot playing multiple positions throughout your career. So, I don’t think that hurt me, certainly.\nHow did you end up with WWE after your playing career ended?\nA: So, I actually got my master’s in sports management when I was finishing my playing career. And when I started to think about what was next for me, I knew I wanted to stay in sports and be on the management side.\nQuite honestly, at that time, in soccer, and certainly in this league, there really weren’t general managers. The route if I wanted to stay in the game was coaching, and that was never a passion of mine. There really wasn’t this general manager-type role yet that had evolved in the women’s game.\nThe most important thing for me was to be somewhere where I felt like I was going to learn a lot. And I had an opportunity through actually somebody I’d met through my Stanford alumni network that headed all the talent development at WWE.\nIt was a world I knew nothing about, in wrestling, but obviously a very established sports and entertainment entity that I learned so much from. Actually, even though it seems like it couldn’t be more different than soccer and this (NWSL) world — (there were) a lot of parallels in what I learned there in what I was doing. There was recruitment of talent there, and management of a development system, and over 100 athletes from all over the world trained in part of this development system there with 40-plus staff — coaches, medical, performance, nutrition.\nWhat led to the acquisition of Chawinga, who’s from Malawi and played in China and Sweden?\nA: I’m really proud of my time in Kansas City. Right now, Kansas City is certainly a team to beat in the league. Everybody knows who Chemwa is now, maybe not so much when she joined the league. I’m really happy for her.\nMy focus is obviously on San Diego. I’m really excited about this team, and everything we’ve started to build here. I’m excited for this game this weekend, too. …\nWhen I came here, what we spoke about was wanting to build something that was truly sustainable. You can see in this league often a team has success one year and then it’s hard to sustain that.\nAnd so, it was really about building something that’s sustainable where we’re competing for championships year after year. A nice bonus, too, I’m from this area originally (she attended high school in Irvine). This is also home for me, which is a nice cherry on top.\nWe have 15 new staff members. From the summer when I joined, we have 13 new players on this roster. It’s recruitment of players and staff and bringing these players to San Diego. Building connections with people, building a foundation.\nTongue slightly in cheek here, how long until the Wave win their first NWSL postseason championship?\nA: (Laughs). That’s not a fair question to ask. Well, we’re going to do all we can to win one as soon as we can, I can tell you that much. It’s hard to put a timeline on those things. When you look at us this season, we have very clear goals to be playing in November and competing for a title.",
  "word_count": 977,
  "scraped_at": "2026-02-14T12:24:05.657460"
}