{
  "article_id": "86d53ad12d27",
  "url": "https://metro.co.uk/2025/11/13/andrea-medina-21-collapses-suffers-traumatic-brain-injury-champions-league-match-24694290/",
  "title": "Andrea Medina , 21 , collapses and suffers  traumatic brain injury  during Champions League match | Football",
  "date": "20251113T081500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Andrea Medina suffered a ‘traumatic brain injury’ during Atletico Madrid Champions League game against Juventus.\nThe 21–year-old collapsed to the floor after a collision with Italy international Barbara Bonansea.\nMedina received lengthy treatment from the club’s medical staff as she lay motionless on the pitch.\nAfter receiving urgent care, Medina was carried from the pitch on a stretcher before being taken to hospital in an ambulance.\nVeteran English broadcaster Jacqui Oatley had been commentating on the game for Disney+ and described the incident as horrendous.\nShe wrote on X: ‘This is horrendous. We’ve just commentated on Atletico Madrid’s @UWCL game v Juventus for Disney+ and young Spanish left back Andrea Medina suddenly went down – she received urgent lengthy treatment before being carried off.\n‘We wish her all the very best and hope she’s OK.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nProviding an update on the player’s health after the match, Atletico Madrid women said in a statement: ‘Andrea Medina was replaced after suffering a traumatic brain injury.\nMore Trending\n‘The footballer is doing well but has been transferred to a hospital center to undergo additional tests.’\nDespite the apparent severity of Medina’s injury, the high-profile European match was played out to a conclusion.\nThe hosts, ultimately, suffered a costly 2-1 defeat with Juventus owing victory to goals from Emma Stolen Godo and Bonansea.\nAs a result, Atletico dropped to 10th in the Women’s Champions League table with one win and two losses from three games, while Juventus climbed to eighth place.\nMORE: Lionel Messi speaks out on Barcelona return after secret Camp Nou visit\nMORE: Cesc Fabregas praises Mikel Arteta for transforming £32m Arsenal star\nMORE: ‘Got the quality’ – Chelsea star backed to become ‘one of the best in Europe’",
  "word_count": 340,
  "scraped_at": "2026-02-14T13:33:31.375022"
}