{
  "article_id": "8741ec9faa55",
  "url": "https://www.chicagotribune.com/2026/01/13/chicago-stars-ludmila-san-diego-wave/",
  "title": "Chicago Stars send Brazilian star Ludmila to San Diego Wave",
  "date": "20260114T033000Z",
  "domain": "chicagotribune.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Wave vaulted onto the San Diego sports scene in 2021 behind star power that was largely unrivaled in the National Women’s Soccer League. Then Alex Morgan retired, Naomi Girma was sold and Jaedyn Shaw was traded, and the team pivoted to a young, largely international roster for the 2025 season.\nConsider the Wave’s Tuesday morning addition of Ludmila a meshing of the two eras.\nThe Wave acquired the Brazilian forward from the Chicago Stars in exchange for an $800,000 transfer fee and up to $200,000 in additional transfer fees depending on how she fares. San Diego then signed Ludmila to a new three-year contract that runs through the 2028 season.\nLudmila, 31, has scored 81 goals in 185 professional matches, most of them with Atletico Madrid in Spain.\nLudmila joined the Stars in July 2024 and logged three goals in seven appearances that season — including the only goal in a September win over the Wave. Given a full season in 2025, she shined, scoring 10 goals and adding one assist for a Stars team that was missing star Mallory Swanson.\nLudmila was under contract with the Stars through the 2026 season; while salaries aren’t made public, she was believed to be among the highest-paid NWSL players.\n“I scored my first NWSL goal against San Diego and (it) always was a team I admired. I loved the supporters, the energy of the team and the vibes of the city when I visited,” she said. “I’m very happy to be part of this club’s history.”\nWave general manager Camille Ashton said Ludmila — born Ludmila da Silva — “not only brings a lot of talent, but complements the strengths of our exciting roster.”\nThe Wave scored 41 goals in 27 matches a year ago, the fourth-best total in the league, but struggled to score over a long stretch of games in the second half of the season. The emergence of another one-named Brazilian forward, Dudinha, allowed the Wave to qualify for the playoffs, and they lost to the Portland Thorns in the first round.\nThe Wave are hoping Ludmila can help stabilize their attack. She holds the NWSL record for fastest hat trick in league history; it took her just 10 minutes, 9 seconds to score three goals.\nLudmila can score “in multiple attacking roles, giving our coaches more tactical options in different game situations,” Ashton said. “Her creativity and movement will enhance our ability to break down defenses, and we’re confident she will be a valuable asset to the club’s success moving forward.”\nLudmila joins a roster that also includes players from Colombia, France, Canada and Bosnia, in addition to young American standouts Kimmi Ascanio and Melanie Barcenas.\nThe Wave will travel to the Coachella Valley Invitational next month for a few tune-up matches, with their season set to begin shortly thereafter. The NWSL has yet to announce its 2026 schedule.\nLudmila, for one, can’t wait.\n“From the moment Cami and the organization showed interest in me, my focus was clear. I wanted to play for this team and this city,” she said. “I didn’t come here just to play. I came to give my best and fight to win trophies. I’m very excited to show my football in front of all the supporters and score many goals in these colors.”",
  "word_count": 552,
  "scraped_at": "2026-02-14T13:23:37.584519"
}