{
  "article_id": "8778f6f598fa",
  "url": "https://www.thenorthernecho.co.uk/news/23992122.news-shaped-north-east-2023-may-august/",
  "title": "News that shaped the North East in 2023 : May to August",
  "date": "20231228T090000Z",
  "domain": "thenorthernecho.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "As spring turned to summer in the North East, we witnessed local elections, concerts to remember and The Northern Echo launched its knife crime taskforce. Here's a round-up of some of the biggest stories for the North East in 2023 from May to August.\nCelebrating the crowning of a new king and heading to the ballot boxes are just some of the things the North East got up to as the sun came out and the season changed to summer in 2023.\nElsewhere, music lovers were able to attend some unforgettable concerts including North Shields star Sam Fender's emotional homecoming in a two-day stint at St James' Park, Newcastle.\nHere's a recap of some of the most memorable stories in the North East from May to August 2023.\nLocal Elections 2023\nMay 4, 2023\nThere were many changes this May as 2023's local elections proved positive for some and less so for others as the political dynamic of the Tees Valley flipped on its head.\nLabour took control of councils it lost back in 2019, including Hartlepool, Darlington and Middlesbrough.\nIn Darlington, the Tories fell from holding 22 seats to just 14.\nNow-former leader Jonathan Dulston said the results were “really disappointing” and came on the backdrop of “national issues that [the Conservative Party] haven’t quite got a grip of yet”.\nRead the Northern Echo's local election coverage:\n- Labour make gains throughout the Red Wall in local elections\n- Conservatives lose control of Darlington Council in major blow\n- Labour win back Middlesbrough Council after four years\nThe Coronation of King Charles III\nMay 7, 2023\nDespite wind, rain and intermittent sunshine, North East residents kept calm and carried on to celebrate the coronation of the new king in May.\nThe day was filled with music, games, and party food to mark the first coronation of a British monarch since 1952.\nParties including big lunches featuring live music, stalls and picnics also took place across the region as those celebrating were pictured donning the union jack as some even brought out cardboard cut outs of the King and Queen.\nThe Northern Echo launches The North East Knife Crime Taskforce\nMay 9, 2023\nThe North East Knife Crime Taskforce, public forum bringing together organisations including police forces, councils, schools, and campaigners to share information and resources to tackle the problem in the region, was launched in May.\nIt is part of a hard-hitting campaign launched in October 2022 with the backing of Zoey McGill and Tanya Brown, whose 18-year-old sons Jack Woodley and Connor Brown were both stabbed to death in separate incidents.\nAs well as calling on successive Prime Ministers to address the front with powerful front pages, the campaign has:\n- Secured a meeting with Labour leader Keir Starmer\n- Arranged video conference with Crime Minister Chris Philp\n- Called for knife crime education to be part of the National Curriculum\n- Showcased pioneering VR technology used around the country to teach young people about knife crime\n- Supported the launch new knife crime campaigns in the Cleveland and Northumbria Police force areas\n- Submitted legal challenges to overturn court orders so seven teenage murderers can be publicly identified\n- Won the support of Shadow Home Secretary Yvette Cooper who cited a meeting at the Labour Party conference as she announced plans to spend £100 million at 100 centres across the country to tackle knife crime\n- Been highly commended by the Society of Editors at the 2023 Media Freedom Awards\nWest Park, Darlington: Woman claims staff were 'bullying and mocking'\nMay 11, 2023\nA series of articles by Echo reporter Phoebe Abruzzese detailed serious allegations from former patients at Darlington's West Park Hospital.\nA woman who was treated as an inpatient at a North East psychiatric hospital claimed that her stay on the ward was fraught with “bullying and intimidation” and believes that “people have died as a result of the care received”.\nJessica Robson, 27, from Darlington, spent time in the town’s West Park hospital between 2015 and 2017, and was sectioned again in 2022.\nJessica’s allegations against the hospital included that they ignored domestic abuse perpetrated by her partner, that they would mock and bully patients, that she was told she did not “look sick enough” when in crisis, and that lax care meant she barely saw the medical staff.\nA summer of music to remember in the North East\nMay - June 2023\nMay and June were bumper months for music lovers across the region who were able to enjoy gigs by some of the most legendary names in the business.\nFirst, Texan superstar Beyoncé took to the stage at Sunderland's Stadium of Light for a electrifying performance on her Renaissance world tour on May 23.\nFans braved the heat to catch a glimpse of Queen Bey who performed old classics such as Crazy in Love to new favourites like Heated.\nThen, on June 9 and 10, Sam Fender took to the stage at St James' Park for a Toon homecoming like no other in front of a sea of black and white for electric performance that left the crowd wanting more.\nThe crowd went wild for hits including Seventeen Going Under, Howden Aldi Death Queue and The Dying Light.\nThen, with a perfectly fitting Summer Carnival, P!NK rocked Sunderland with a show filled with acrobatics, movement and a buzz of high energy dance routines.\nRead about:\nPlans to house 1,000 asylum seekers on Middlesbrough barge\nJune 6, 2023\nRumours swirled in summer detailing plans to house up to 1,000 migrants on a barge on the coast of Middlesbrough. This was a move that saw politicians' views clash.\nAlec Brown, Labour leader of Redcar and Cleveland Borough Council, likened the barges as belonging to the Victorian era and said the authority had no knowledge of the plans.\nHe said: “I am totally against the principal of housing people seeking asylum in this way – it is something more akin to Victorian times and as a society, we should have a more humane way of treating people while their asylum claims are assessed by the Home Office.”\nPrime Minister Rishi Sunak first spoke of the two new giant vessels in a conference on June 5 in Kent ahead of the launch of the barge Bibby Stockholm - and reports in the national press suggest one of the two could be moored on Teesside.\nSix months on, no barge has been moored in Middlesbrough.\nBen Houchen gets peerage in Boris Johnson resignation honours\nJune 9, 2023\nIn June, Tees Valley Mayor Ben Houchen was handed a peerage in Boris Johnson's long anticipated resignation honours list.\nMr Houchen said: \"As a member of the House of Lords, I will be uniquely placed as being an elected Mayor with a seat in Parliament.\n\"The additional powers I will be given to make and amend laws are something no other Mayor in the country will have. I see this role not as a distraction, but as an incredible opportunity to fight and deliver even more for everyone across Teesside, Darlington, and Hartlepool.\"\nLater that month, Mr Houchen was named Lord Houchen of High Leven, near to both Ingleby Barwick and Yarm where he grew up.\nBlaze erupts at Carliol Square, Newcastle\nJune 28, 2023\nTraffic in Newcastle was brought to a standstill in early July when a fire took over a disused building in Carliol Square, that sits next to the A167 main road that runs through the city centre.\nSmoke could be seen across the city as police quickly set up a cordon and an investigation into the cause of the blaze was launched the following day.\nMotorists were then left to face severe traffic heading through the Tyne Tunnel as commuters tried to get across the River Tyne until the road was re-opened in July.\nNHS celebrates 75th anniversary\nJuly 5, 2023\nThe service that has cared for the nation since 1948 celebrated its milestone 75th anniversary this year. Whilst many hail the NHS as perhaps the greatest jewel on the crown that is Great Britain, some including those who work for the service spoke about the uncertainty of its future.\nA GP, who wished to remain anonymous, described the various factors from funding to staff retention which are putting strain on the service.\nThey said: \"Overall the population is growing and getting older so the pressure on the NHS is increasing too. The funding we receive doesn't match that demand. We are seeing more experienced GPs and doctors retiring early because of the pressures put on them.\n\"The stress has got much worse in recent years. There are so many changes implemented in the different systems of healthcare that you never know what change is coming next.\"\nFor more, read The Northern Echo's coverage of NHS75:\n- After 75 years NHS more loved but more troubled than ever\n- NHS is in a 'crisis', says former MP Dr Paul Williams\n- NHS75: North East MPs views clash on future of service\n- New North East medics worry for the future of the NHS\nTall Ships Races stop in Hartlepool\nJuly 5, 2023\nHartlepool Marina was buzzing with activity as the arrival of the Tall Ships Races to the seaside town for a four day visit to the town with over 100 free performances and gave locals a chance to marvel at the docked ships.\n2023 is the second time Hartlepool have hosted the Tall Ships, the last time being in 2010 and the first time the ships have docked in the North East since 2018 when they came to Sunderland.\nOn the third day of the event, many including Cllr Shane Moore praised the positive response the ships garnered from locals.\nHe said: \"We're here today celebrating the Tall Ships event, and welcoming people to Hartlepool.\n\"It is the first time we've hosted this event since 2010, we're really excited to welcome everybody back.\n\"So far, it has gone absolutely brilliantly, we're seeing so many smiling faces, people from all around the world, not just the UK.\n\"It's lovely to see people enjoying themselves and to see the town alive like this as well.\"\n137th Durham Miners Gala takes place\nJuly 8, 2023\nThousands descended on Durham this summer for the 137th annual Durham Miners' Gala as former miners and supporters of the event came out in force.\nRepresentatives from former pits from across the North East attended, including from Easington in County Durham, Wistow and Selby in North Yorkshire, and more.\nMany of those marching could be seen waving flags in support of unions, whiile hundreds took part in the event.\nAlso present were former Labour leader Jeremy Corbyn and deputy leader Angela Rayner.\nIt was also attended by Paul Novak, general secretary of the TUC, and Stephen Guy, chairman of Durham Miners' Association.\nJeremy Corbyn said: \"It's an amazing day, it's a celebration of the joy, the strength, the hope, the happiness of the communities.\"\nGreenpeace activists arrested at Rishi Sunak's Northallerton home\nAugust 3, 2023\nIn early August people were pictured atop Prime Minister Rishi Sunak's home in Northallerton after after he backed new oil and gas drilling off UK shores.\nPolice officers attended the scene after four Greenpeace demonstrators clambered up onto the roof of the £2m manor house and covered it in “oil-black” fabric in a stunt that lasted for five hours.\nThe following day, North Yorkshire Police confirmed the protestors were released on bail.\nThe force said: “All five suspects who were arrested following the protest in Kirby Sigston on August 3 have been released on conditional police bail to allow for further inquiries to be carried out.\n“The investigation remains ongoing.”\nLionesses reach World Cup final\nAugust 20, 2023\nIt was heartbreak in August for England's Lionesses who suffered an upsetting 1-0 defeat at the World Cup Final against Spain.\nEngland went behind with Spain's Olga Carmona scoring the first and only goal of the game in the 29th minute.\nBefore the big game, The Northern Echo spoke to Darlington's U12 Feethams girls football team in front of the Lioness mural at the Arthur Wharton Foundation in Darlington, who were brimming with excitement and support for the star players.\nFor team manager Chloe Bright, who also plays for Darlington Women, seeing the young footballers get into the game is a special thing to watch.\nShe said: “The girls are absolutely loving getting into it, and they are always really excited for each upcoming game. They have also been getting photos taken in their England shirts as they want to be just like the Lionesses.\n“For women, it is great as we are spending so much time together watching football – it’s what we wanted to be like so now we get to bring the next generation into the game.”\nHere are just a select few Northern Echo front page splashes from May to August.",
  "word_count": 2155,
  "scraped_at": "2026-02-14T12:31:09.360235"
}