{
  "article_id": "879b98701383",
  "url": "https://www.politico.eu/newsletter/sunday-crunch/budget-hijack-lineker-row-rumbles-tech-banking-distress/",
  "title": "Sunday Crunch : Budget hijack Lineker row rumbles Tech banking distress",
  "date": "20230312T170000Z",
  "domain": "politico.eu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good Sunday afternoon. Welcome to another political week.\nTHINGS TO KNOW\nBUDGET HIJACK: Budget week is finally here, but attention in SW1 is not fully focused on what the chancellor will unveil in his blueprint for the U.K. economy this Wednesday. Jeremy Hunt has instead spent the morning fielding questions about the spiraling row over BBC independence and impartiality, while also dealing with a banking crisis with potentially very serious implications for the U.K.’s vital technology and science sector.\nWhat about the PM? Rishi Sunak is currently on his way to the U.S. with a plane load of hacks who have just tucked into sausage baps and fruit sticks. He is due to discuss key details of a new defense agreement with his Australian and U.S. counterparts.\nBBC omnishambles: It’s been hard to miss the row over BBC sports pundit Gary Lineker’s controversial tweets about the government’s new Illegal Migration Bill, and there have been more developments over the weekend, not least the continuing disruption to the BBC programming schedule.\n**A message from SSE: We’re delivering 1000s of green jobs in communities across the country, levelling up our industrial heartlands and accelerating the transition to net zero. Actions, not ambitions are what’s needed to secure our energy future. SSE. We Power Change. Find out more at sse.com.**\nStaying out of it: Sunak attempted to calm a furor over the BBC’s independence last night, insisting the decision to take Gary Lineker off-air this weekend was “a matter for them.” A contrast to the Tory outrage earlier in the week which saw 36 Conservative MPs and peers sign a letter demanding a full and independent investigation into the comments. After the BBC pulled Lineker off air it has been in full-blown crisis mode after football pundits effectively went on strike in solidarity. One staffer told the Sunday Times the situation had become “so farcical” that it wouldn’t have been believable as a plot line in the mockumentary about the corporation, W1A. “The writers wouldn’t have dared do this — it’s too insane and incompetent,” he said.\nHunting the line: This morning, Hunt wouldn’t be drawn on whether Lineker should still present Match of the Day, but he told Sky the BBC needed to sort out its reputation for impartiality. “The reason that it is a great national institution that we all treasure so much is because it is respected for impartiality, so we need to make sure that what comes out of this is that people’s confidence in the impartiality of the BBC is restored,” he said. Hunt told Sky he “profoundly disagrees” with the controversial comments made Lineker.\nUnedifying: Labour is unsurprisingly going for the Tories over the row. On Sky, Shadow Chancellor Rachel Reeves accused the ruling party of indulging in an “unedifying spectacle” with Tory MPs and Tory ministers putting pressure on the BBC. Lineker should not have been taken off air, she said.\nEx-BBC on the BBC on the BBC: The BBC’s Laura K show devoted a lot of time to the row, obvs. Former BBC Director General Mark Thompson told her Lineker’s tweet looked like a “technical breach” of the BBC’s impartiality guidelines. On her political panel, another ex-BBC exec Peter Salmon suggested Lineker might have “outgrown” the BBC job.\nScheduling latest: And after all this, it looks like the row remains unresolved. The BBC’s Dan Roan reported this afternoon’s Women’s Super League match won’t have a pre-match presentation, and Match of the Day 2 will follow last night’s slimmed-back format. Gary Lineker’s son tells the Mirror he will return to Match of the Day, if asked, but that he won’t apologize.\nCourt of public opinion: Snap polling for YouGov suggests more than half of the public think the BBC was wrong to suspend Lineker.\nTECH BANKING DISTRESS: The other big story of the weekend is the fallout from the collapse of Silicon Valley Bank, a big U.S. lender to many startups and technology companies. The government is under huge pressure to act before the markets open Monday morning. Ministers held a roundtable with the industry on Saturday afternoon.\n‘Next few days’: Hunt used his broadcast round to insist while there is “no systemic risk to our financial system,” fallout was a “serious risk” to crucial technology and life-sciences sectors in the U.K. The bank looked after the money of “some of our most promising and exciting businesses,” he told Sky. On the BBC, Hunt said the government would outline plans to deal with the operational cashflow needs of the companies affected “in the next few days.”\nNews from the skies: Speaking to reporters, including Playbook’s Rosa Prince, on his way to San Diego, Sunak said he didn’t believe there was a “systemic contagion risk” from the SVB failure. “We’re working to recognize the anxiety and the concerns customers of the bank have and making sure we can work to find a solution that secures people’s operational liquidity and cashflow needs,” he said.\n‘There’s going to be more’: POLITICO colleagues in the U.S., however, report the SVB collapse has sent shockwaves across Washington, sparking fears that the bank’s failure could threaten the financial system and rattle the economy.\nNot quick enough: Shadow Chancellor Rachel Reeves is unimpressed with that timeline, calling for more urgent action. “Tomorrow morning, [start-up businesses are] going to have calls on them, whether that is wages, whether that is suppliers, whether that is their share prices or their investors saying ‘we no longer have confidence’,” she said. There were “different answers” to the problem, she added, raising the prospect of guarantees, or working with the U.S. government on a rescue for Silicon Valley Bank. Reeves said the collapse was a “wake-up call” that the U.K. had been over reliant on foreign capital for investment.\nHow we got here: There are plenty of Twitter threads around on the Silicon Valley Bank saga, but this piece on the collapse of what was a stalwart of the West Coast tech scene in the Sunday Times is excellent.\nBACK TO WORK BUDGET: While dealing with a banking crisis, Hunt is also gearing up for his budget on Wednesday. The usual trails have been crowded out by the Lineker row, but there is still plenty around on what to expect.\nIt’s all about the kids: With Labour dropping lots of hints it is going to announce a mega-offer on childcare, Hunt unveiled his own policy today. The government plans to pay childcare costs up front for those on the universal credit benefit. The BBC has more of the details. On the BBC, Hunt was quizzed about going further. He said he would like to help everyone, but: “It’s expensive to do it. You can’t always do everything at once.”\nTargeting the over 50s: The Sunday Telegraph meanwhile reports on plans for “skills bootcamps” to get the over-50s back to work. They will be encouraged “to take courses that qualify them to work in the construction and technology industries,” the paper reports.\nCrucial analysis: There are also some big disability benefit reforms coming. As always, the Resolution Foundation’s Torsten Bell is on hand to give a considered verdict on Hunt’s plans so far. As he points out, the package is “much bigger” than expected. His Twitter thread on what has been trailed this weekend is worth a read.\nTrouble ahead? It wouldn’t be a budget build-up without some vocal lobbying from Tory MPs. Calls are mounting for Hunt to pull out of an OECD agreement that corporation tax should never fall below 15 percent, with Liz Truss and Priti Patel leading the charge, according to the Sunday Telegraph. The paper has plenty of other quotes from businesses warning about the impact on U.K. competitiveness of signing up to the agreement.\nCase for the defense: Rightly pushed by Sky’s Sophy Ridge on his tax-cutting zeal when he was trying to lead the party, Hunt insisted he was going to reduce taxes, but cautioned he also had to be “responsible with public finances.” “Businesses need the stability that comes from being responsible, so we will get there gradually, but get there we will,” he said.\nThe B-word: With a national election looming, and inevitable questions about Brexit benefits likely to dominate, Hunt appears to be keen to frame his back to work plan around Britain’s vote to leave the European Union. He told the BBC the Brexit decision had been a “choice” not to fill more than a million job vacancies with “unlimited migration,” something Hunt told Laura K he thinks is the “right choice.”\nWhat would Labour do: Reeves was keen to promote Labour’s own plans for the economy — inspired by U.S. President Joe Biden — to target their National Wealth Fund at tackling geographical inequality. The party has pledged to set up the fund as part of its “Green Prosperity Plan.” Quizzed by Laura K on the potential for a return to protectionism, Reeves said: “Who is going to look after our jobs and industries if it’s not the British government.”\nQUICK-FIRE CATCH-UP\nSTRIKING OUT: Junior doctors begin a three-day walkout tomorrow, and there are warnings about just what a big impact the action could have. Ahead of the action, NHS Medical Director Stephen Powis said: “It is inevitable that the extraordinary pressure caused by what could be the worst strike in NHS history will have a significant and lasting impact on cancer care and routine operations, which will take us some time to recover.” The Sunday Times has his quotes. In the Sunday Telegraph, Health Secretary Steve Barclay said the scope of the strikes “presents a real risk to patient safety which should pose difficult ethical dilemmas for our hard-working junior doctors.” It comes after hundreds of NHS workers took to the streets of London yesterday to demand more funding for the health service.\nSTILL VOTING: Expect questions to be raised this week about why two MPs suspended from the Conservative Party over allegations of sexual misconduct have been voting in the House of Commons using proxies. The Sunday Times has the details.\nSMALL BOATS ROW: All eyes on the Commons tomorrow with the Observer reporting that former Home Secretary Priti Patel is considering a potentially explosive intervention over her serious concerns about the bill. Tory MPs tell the paper they are worried about changes to the way children will be treated when arriving in the U.K. A Home Office official insisted unaccompanied asylum-seeking children will not be detained. Families could however be detained so as not to incentivize people smugglers sending children across with adults. Robert Buckland tells the Sunday Times: “Anything which waters down the government’s previous commitment to end the detention of children in immigration centers would be of great concern.”\nTIKTOK FOR TIKTOK: The Sunday Times hears Britain could join other governments in banning the Chinese-owned social media app TikTok from all government electronic devices. The paper says a security review has raised concerns about the safety of sensitive data. Experts at GCHQ’s National Cyber Security Centre assessed the app.\nBATTLING THE BLACK DOG: William Wragg, the 1922 committee vice-chairman, is the latest Conservative MP to open up about his battle with depression. Wragg told GB News’ Gloria De Piero that going public about his condition had helped him to live with it. The interview airs later today.\nMEDIA ROUND\nAyesha Hazarika on Times Radio (4 p.m. to 7 p.m.): Former Downing Street Director of Comms Craig Oliver (4 p.m.); Conservative women and equalities committee chair Caroline Nokes; Labour MP Ruth Jones; SNP MP Amy Callaghan; the Indy’s Kate Devlin.\nGloria Meets on GB News (6 p.m.): Conservative MP Andrea Jenkyns; 1922 committee Vice-Chairman William Wragg; former Conservative MP Stephen Dorrell.\nThe Andrew Neil Show (Channel 4, 6.15 p.m.): Former Chancellor George Osborne; Former Shadow Chancellor Ed Balls; Treasury minister Victoria Atkins; actor Brian Cox.\nWestminster Hour (BBC Radio 4, 10 p.m.): Conservative MP Katherine Fletcher; Shadow Education Minister Helen Hayes; Resolution Foundation Director Torsten Bell; the Sun’s Natasha Clark.\nWEEK AHEAD\nMONDAY\nDEFENSE: Rishi Sunak to meet U.S. President Joe Biden and Australian Prime Minister Anthony Albanese to discuss the AUKUS defense and military agreement. The updated integrated review of foreign policy is also expected to be published.\nSCOTLAND: SNP leadership contest ballot opens, 12 noon. Sky News to host a leadership debate.\nCOMMONS: Sits from 2.30 p.m. with defense questions followed by the first MP vote on the Illegal Migration Bill.\nCHINA: First session of China’s latest National People’s Congress due to end.\nSTRIKES: Junior doctors to begin their three-day strike over pay and burnout. Amazon staff in Coventry also due to stage a walkout.\nCLIMATE: Intergovernmental Panel on Climate Change to begin week-long meeting in Switzerland.\nTUESDAY\nCOMMONS: Sits from 11.30 a.m. with foreign office questions followed by debates on Ukraine refugee homelessness and the seizure of Russian assets.\nOFCOM: Ofcom boss Melanie Dawes at parliament’s culture, media and sport committee, 10 a.m.\nSCOTLAND: BBC to host SNP leadership debate, 8 p.m.\nWEDNESDAY\nCOMMONS AND ECONOMY: Sits from 11.30 a.m. with the first science and tech department questions followed by PMQs and the budget.\nSTRIKES: Civil servants, London Underground drivers, teachers, university staff and BBC local radio staff to go on strike.\nJUSTICE: Deputy Prime Minister Dominic Raab at Lords committee session on the work of the Ministry of Justice, 10 a.m.\nTHURSDAY\nCOMMONS: Sits from 9.30 a.m. with Cabinet Office questions followed by the business statement and more budget debate.\nSTRIKES: Rail company workers at the RMT union out on strike. West Midlands National Express drivers also strike.\nECONOMY: Treasury Select Committee Chair Harriet Baldwin at the Resolution Foundation, 9 a.m.\nFRIDAY\nSt Patrick’s Day and Red Nose Day\nCOMMONS: Private members’ bills.\nLABOUR: Deadline for Labour National Policy Forum submissions.\nECONOMY: OECD to publish its interim Economic Outlook report.\nLIB DEMS: Lib Dem spring conference begins.\nSCOTLAND: Inverness Courier SNP leadership debate.\nThanks: To Jones Hayden for giving Crunch some Sunday sparkle.\n**A message from SSE: It’s time to make a shift. That’s why at SSE, we’re going big. £7 million a day, big. We’re investing right here, right now into infrastructure projects across the UK to accelerate the transition to net zero – from building the world’s largest offshore wind farm, to leading on new carbon capture and hydrogen technologies. Plus, by building new network links to connect places like Shetland to the mainland national grid, we’re harnessing more of Britain’s renewables potential. It’s because of this investment that we’re delivering 1000s of green jobs in communities across the country, developing enough renewable energy projects to power 2 in 3 UK homes and helping businesses become more sustainable. Visit sse.com to find out more about how SSE is investing more than it’s making in profits today, to build an energy system that’s cheaper, cleaner and more secure. SSE. We power change.**\nSUBSCRIBE to the POLITICO newsletter family: Brussels Playbook | London Playbook | London Playbook PM | Playbook Paris | POLITICO Confidential | Sunday Crunch | EU Influence | London Influence | Digital Bridge | China Direct | Berlin Bulletin | D.C. Playbook | D.C. Influence | Global Insider | All our POLITICO Pro policy morning newsletters",
  "word_count": 2530,
  "scraped_at": "2026-02-14T11:59:27.860413"
}