{
  "article_id": "87cdd51b0cca",
  "url": "https://www.iowapublicradio.org/news-from-npr/2023-09-10/michigan-state-suspends-coach-mel-tucker-after-sexual-harassment-allegations",
  "title": "Michigan State suspends coach Mel Tucker after sexual harassment allegations",
  "date": "20230911T044500Z",
  "domain": "iowapublicradio.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Michigan State suspended football coach Mel Tucker without pay on Sunday, less than 24 hours after allegations became public in a USA Today report that he sexually harassed activist and rape survivor Brenda Tracy during a phone call last year.\nUniversity President Teresa K. Woodruff and athletic director Alan Haller announced the suspension pending the results of an outside investigation into the allegations.\nThe university hired a Title IX attorney to investigate Tracy's complaint and the investigation concluded on July 25. A hearing is scheduled for the week of Oct. 5 determine if Tucker violated the school's sexual harassment and exploitation policy.\nWhen the investigative report was finished, Tucker was told not to have contact with Tracy and that Haller would increase his oversight of him and the program, Haller said at a news conference Sunday evening.\nHaller said he didn't immediately suspend Tucker in July because the entire process of the investigation was not completed.\nSecondary coach Harlon Barnett will serve as the team's interim coach and former coach Mark Dantonio was named associate head coach while Tucker awaits his fate with the program.\n\"I called coach Dantonio this morning and his response was, 'Alan, whatever you need,'\" Haller recalled.\nTucker is in the third year of a $95 million, 10-year contract and if he is fired for cause, the school would not have to pay him what's remaining on his deal.\nMichigan State may fire Tucker for cause if he \"engages in any conduct which constitutes moral turpitude or which, in the University's sole judgement, would tend to bring public disrespect, contempt or ridicule upon the university,\" according to his contract. The school also was able to suspend Tucker, without pay, if he \"materially breaches\" his contract.\nMessages seeking comment were left Sunday by The Associated Press with Tucker, Tracy and Tucker's attorney, Jennifer Belveal.\nTucker is the second Big Ten football coach to find himself at the center of a scandal in three months.\nNorthwestern fired longtime coach Pat Fitzgerald in July after an investigation by the school revealed hazing in the football program. Fitzgerald initially was suspended for two weeks during the preseason, but Northwestern's president decided later to dismiss him with cause after details of the hazing allegations became public through media reports.\nMichigan State is not far removed from another sexual misconduct scandal, one involving former sports doctor Larry Nassar. He was sentenced in 2018 to 40 to 175 years in prison after he admitted to molesting some of the nation's top gymnasts for years under the guise of medical treatment. He was accused of sexually assaulting hundreds of women and girls.\n\"This morning's news may sound like the MSU of old,\" Woodruff said. \"It is not.\"\nWoodruff said today's version of the school takes accusations seriously and investigates them rigorously while providing resources it did not in the past.\nTracy became friends with Tucker over her advocacy work, but that relationship took a turn in April 2022 when Tucker masturbated during a phone call with her, according to USA Today.\n\"The idea that someone could know me and say they understand my trauma but then re-inflict that trauma on me is so disgusting to me, it's hard for me to even wrap my mind around it,\" Tracy told the newspaper. \"It's like he sought me out just to betray me.\"\nTucker acknowledged to investigators last spring that he masturbated during the phone call with Tracy, but he said they had consensual \"phone sex.\"\nThe 51-year-old Tucker is married and has two children.\n\"Ms. Tracy's distortion of our mutually consensual and intimate relationship into allegations of sexual exploitation has really affected me,\" Tucker wrote in a March 22 letter to the Title IX investigator. \"I am not proud of my judgment and I am having difficulty forgiving myself for getting into this situation, but I did not engage in misconduct by any definition.\"\nThe Spartans beat Richmond on Saturday to improve to 2-0 in Tucker's fourth season with the school. Tucker is one of college football's highest paid coaches. He is 20-14 in three-plus seasons at Michigan State, which hired him after he went 5-7 in one year at Colorado.\nShortly after Dantonio retired in February 2020, then-athletic director Bill Beekman hired Tucker, who was a graduate assistant at Michigan State for Nick Saban.\nThe Spartans were 2-5 in Tucker's first season, which was shortened by the COVID-19 pandemic, and won 11 games in 2021, with Wake Forest transfer Kenneth Walker becoming a breakout star during a surprising season in which Tucker was given a raise.\nMichigan State was 5-7 in 2022, a season marred by charges and suspensions for several players for their roles in a postgame fracas in the Michigan Stadium tunnel.\nTracy is known for her work with college teams, educating athletes about sexual violence. She has spoken to Michigan State's football team multiple times.\nCopyright 2023 NPR. To see more, visit https://www.npr.org.",
  "word_count": 822,
  "scraped_at": "2026-02-14T13:09:38.915070"
}