{
  "article_id": "87cffe924be2",
  "url": "https://www.sandiegouniontribune.com/2024/09/18/maria-sanchezs-hat-trick-propels-wave-to-come-from-behind-over-portland-in-concacaf-w-champions-cup-play/",
  "title": "María Sánchez hat trick propels Wave to come - from - behind win over Portland in Concacaf W Champions Cup play – San Diego Union - Tribune",
  "date": "20240919T090000Z",
  "domain": "sandiegouniontribune.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "During a practically scoreless summer, the San Diego Wave tried just about anything in search of a spark.\nThey fired their coach, and then changed interim coaches. They signed players from Europe while allowing others to leave for opportunities overseas. They lost a legend, scrapped a strategy and drew up something completely different.\nWednesday night, as the summer turned to fall, the Wave received the scoring punch they’ve been waiting all season for.\nMaría Sánchez scored all three of the club’s goals in an 18-minute flurry as San Diego beat the Portland Thorns FC 3-2 in a Conacaf W Champions Cup Group Stage match at Snapdragon Stadium.\nWhile the result doesn’t count toward the National Women’s Soccer League standings or improve the club’s playoff odds, it could go a long way toward kick-starting a Wave team that’s scored just 17 goals in 20 regular-season matches.\nSanchez, acquired from the Houston Dash earlier in the season, helped San Diego rally from a two-score deficit in the final 23 minutes. Sanchez began with a left-footed penalty kick in the 67th minute, cutting the Thorns’ lead to 2-1. Her header 90 seconds later on a pass from Delphine Cascarino, a French import signed during the Olympic break, evened the match.\nWith five minutes left in regulation, the Wave’s Amirah Ali fired a shot that hit the hands of a Portland defender. Sanchez received the penalty kick and netted the game-winner.\nBy doing so, Sanchez became the first Mexican international player to score a hat trick in an NWSL-sanctioned match. She has scored five goals for the Wave this season spread across NWSL, Concacaf and Summer Cup matches.\nThe Wave need Sanchez to keep scoring if they hope to make a late-season push. San Diego is without striker Alex Morgan, who retired earlier this month; forward Sofia Jakobsson, who left the club to pursue overseas opportunities; and forward Jaedyn Shaw, who has been limited since returning from the Olympics.\nBy winning Wednesday, the Wave improved to 2-0-0 in Champions Cup group play. The club will return to NWSL competition on Saturday, when it travels to the Chicago Red Stars. At 4-9-7, the Wave sit 12th in the NWSL standings. The top eight teams make the playoffs.\nThe Wave’s next home match is Sept. 28 against the Thorns.",
  "word_count": 383,
  "scraped_at": "2026-02-14T12:17:39.467943"
}