{
  "article_id": "87d0ffe6e2a9",
  "url": "https://liverpooloffside.sbnation.com/liverpool-fc-women-news-results/2023/11/3/23945716/liverpool-fc-women-beard-report-good-injury-news-international-break-ceri-holland-leanne-kiernan",
  "title": "Beard Report : Good Injury News Coming Out Of The International Break",
  "date": "20231104T020000Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Women’s International break is finally coming to a close this weekend, with Liverpool in particular back in action at home on Sunday, hosting Leicester City at Prenton Park.\nBeard Report: Good Injury News Coming Out Of The International Break\nMatt Beard gives us all good news in his latest column ahead of Liverpool’s match on Sunday.\nWhile there were some sticky moments regarding some injuries for players that represented their countries, manager Matt Beard was quick to assuage most concerns in this week’s managerial column for the club.\n“As always when it’s an international break, you are keeping your fingers crossed that all of the players come back injury-free and raring to go again,” Beard wrote.\n“Ceri Holland picked up a calf injury playing for Wales. We had an MRI scan on Monday and we have had some good news. Whether Ceri will be available for Sunday I’m not sure at this moment, but the good news is there is no long-term damage so we will just be careful with her because Ceri is such an influential player for us.\n“It’s been a mad schedule for all of our international players and with all the games we have had on top of that, it’s a lot of football.\n“It’s good as well that everyone has got minutes. Teagan Micah played for Australia, Jenna Clark featured for Scotland against the Netherlands, Marie Höbinger played for Austria and got assists, Missy Bo Kearns captained England U23s, so they all got minutes, which is great because it shows the work they are doing at club level for that to happen.\n“On the injury front, Leanne Kiernan and Shanice van de Sanden completed their first full week of training last week without being modified. So, last week was their first full one back in training so that’s positive. We just need to make sure we load them with their minutes accordingly over the next week, but in saying that we are still probably looking at them needing at least three or four weeks of full training before I can consider them for the first team.”\nInjuries had really been the sore spot for Liverpool as the season has worn on, and even continuing from last season, but Beard recognized that having three strong players working on their returns can only help the squad.\n“Our captain Niamh Fahey is also back on the pitch now but I think either this week or next week we can integrate her with the group again for some training, but because it’s the third time she’s had an issue with the calf we are not rushing her back and we need to make sure she is right and ready before she can be considered again for first-team duty,” Beard continued.\n“The good news for me is to have those three players on their way back into an already talented squad is a great headache for us and creates competition for places.\n“It also allows us tactically to be a little bit more flexible, so whether we go 4-3-3 or 3-4-3, we’ve got a bit more flexibility now. That is a great headache for me to have and if we can have a full squad to select from it will enable us to get minutes into everyone, keep everyone fit and healthy and utilise the depth of the squad we’ve got.”\nThat depth is definitely going to have to come in handy as the winter schedule ramps up. The Continental Cup group stage schedule was finally revealed, and now the club can start properly preparing for the busy season of soccer. Some of that depth has included bringing in three new youngsters from the Academy to start training with the senior squad, and hopefully get up to speed with the Women’s top flight.\n“We’ve just confirmed our Continental Cup group fixtures and it is a tough schedule between now and Christmas, and three or four years ago we might have struggled with it, but I think if you look at it with the depth of squad I have in the group I feel we have the players to cope with it,” the manager added.\n“Also during this international break I have brought three of our youngsters in to train with the squad so we are looking at our academy system and getting some of these young players exposed to the first team.\n“In turn, they can then drive that back down to the academy once they step up to see the difference in that intensity and the demands of being a first-team player.”\nLiverpool’s season resumes on Sunday at Prenton Park with former Everton manager Willie Kirk’s Leicester City coming to town. Leicester sit just above Liverpool on the FA WSL table at the moment, and have proven themselves to be a tough opponent in these first few matches of the season. Beard will be taking no precautions against them.\n“On Sunday we are back at Prenton Park in the WSL when we welcome Leicester City (kick-off 2pm GMT), a tough game this one as they recently beat us in the Continental Cup,” Beard continued.\n“I was really impressed with Leicester’s display against Manchester City. City could have been out of sight in the first 15 minutes but Leicester dug it out and I felt they were really unlucky not to get a point, never mind all three.\n“I really like the way Willie Kirk has got them playing, it’s different. They get at you player for player and they cause you problems and don’t let teams get into a rhythm. We also played them in pre-season so we’ve had a bit of an example of what to expect on Sunday.\n“Willie has done a great job at Leicester and he has not just done that overnight. He had a pre-season with the group and we saw when we lost 4-0 to them at the King Power Stadium last season what he was trying to get his players to do.\n“As always, we know we will have fantastic support from our fans and we want to put a performance on they can be proud of on Sunday.”",
  "word_count": 1028,
  "scraped_at": "2026-02-14T13:28:11.248378"
}