{
  "article_id": "87e60866639d",
  "url": "https://theathletic.com/5068710/2023/11/17/lise-klaveness-fifa-qatar/",
  "title": "Lise Klaveness :  Promises were made about Qatar . If they were not kept , we want to report it  ",
  "date": "20231117T054500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In the coming weeks, Lise Klaveness, the president of the Norwegian Football Association, will travel to Qatar. A year on from the men’s World Cup in the Gulf state, described by FIFA president Gianni Infantino as being the “best ever”, Norway’s leading football executive wishes to see the legacy of the tournament for herself. It will not be a guided tour by the Qatari state.\nAdvertisement\n“It would be easier to just stay home,” says Klaveness in an interview with The Athletic at a central London hotel. “Some people may say, ‘Why is little Norway going to Qatar?’, and we don’t want to be arrogant. But some promises were made. If they are not kept, we want to report it with our platform.\n“Now, the World Cup and the spotlight has gone away from Qatar, which is natural. But we have to have closure for our engagement there and see what was the legacy. What does the International Labour Organisation say? What does Amnesty International say? And the (Qatar) government itself.”\nIn the years leading up to the World Cup in Qatar, there was no shortage of external critics, particularly when it came to the matter of migrant workers and LGBTQI+ rights. Klaveness, however, appeared to be among the most sincerely engaged, while she will also be joined in Qatar by representatives from the Danish federation.\nKlaveness rose to prominence in March last year when, a few weeks into her reign as Norway’s FA, she stood up at FIFA’s annual congress, hosted in Qatar’s capital Doha, and said that “human rights, equality and democracy” had not been considered when FIFA awarded the men’s World Cup to Russia (2018) and Qatar. She also insisted that “migrant workers injured or families of those who died in the build-up to the World Cup must be cared for”.\nSince then, Klaveness has sought to pursue openness in a sport where governing bodies’ operations sometimes appear as transparent as a pint of Guinness.\nIt has not been without consequence. She says she received “warnings”, both directly and indirectly. The gist appeared to be: we don’t work like that around here. Klaveness says: “You are told that it is not smart, particularly if you want to go into positions, because people will not vote for you if you put them under pressure.”\nAdvertisement\nShe says the machinations of world football “do not favour public appearances”. This is because, theoretically at least, executives and federations depend on votes to be granted key positions or host status of major tournaments.\nNorway did not qualify for the World Cup in Qatar but Klaveness attended parts of the tournament and was part of a working group on human and labour rights led by UEFA, European football’s governing body. The Norwegian FA also lodged an official request earlier this year that FIFA clarify its human rights responsibilities and potential remediation relating to the 2022 World Cup, as well as future tournaments.\nKlaveness says she was then encouraged by FIFA to join a sub-committee on human rights and social responsibility. She says the UEFA working group advocated for her to be selected, along with another candidate. Several months passed by without progress, only for her to discover that a different candidate entirely, Dominique Blanc, the President of Switzerland’s FA, was formally nominated ahead of Klaveness. She has no issue with Blanc, who is regarded as one of the more progressive European football executives, but she was left frustrated by the lack of transparency.\n“For half a year, it’s been back and forth and nothing really happened. I think this is part of how the system works. This guy talks to this guy. Then this guy talks to this guy. And in the end, something (else) happens and it’s not a good process. And honestly, we are not naive. We knew that it would be very hard work.”\nIn response, FIFA told The Athletic that the only formal nomination they received from UEFA was for Dominique Blanc and that they did not receive a nomination from UEFA for anyone other than Blanc.\nAmid the obstacles, Klaveness persists. She says: “It’s a responsibility to be transparent. How else can you lead if it’s not made public to some extent? Secondly, it’s very important in a polarised world that it’s not just media and sponsors and supporters who are speaking. It should also be leaders. We make decisions and we have that mandate. And thirdly, although there are a lot of good things with the football industry, I do think it’s in desperate need of change and reform.”\nAdvertisement\nKlaveness, 42, is a former Norway international footballer who earned 73 caps for her country. She has worked as a business lawyer and a football pundit on television, and previously served the Norwegian FA as the first female director of both its men’s and women’s teams. In the world of football, her preparedness to communicate stands out, and none more so than when conversations turn to the effective coronation of the bidders to host the men’s World Cup in 2030 and 2034.\nTo recap, after a meeting of the FIFA governing council in October, it was announced the 2030 tournament would be staged in six countries across three continents, as three South American nations — Argentina, Paraguay and Uruguay — would host an opening game each (marking the centenary of the first World Cup, played in Uruguay in 1930), before the rest of the competition takes place in Europe’s Spain and Portugal and their African neighbour Morocco.\nBy spreading that tournament across three continents, and after the U.S., Canada and Mexico co-host for North and Central America in 2026, FIFA limited the field of nations that could bid for the 2034 edition to Asia and Oceania. It also announced a 25-day deadline under which countries could express interest in hosting that tournament. Saudi Arabia’s crown prince Mohammed bin Salman confirmed his homeland’s desire to stage World Cup 2034 on the same day as FIFA’s statement, while Australia had some interest but pulled away by the end of the month.\nTherefore, while there will be a vote next year of FIFA’s 211 member nations, the process has appeared, to some, to be designed to enable Saudi Arabia to be the venue in 2034 — making it the Gulf region’s second World Cup in four playings — as it will be the only option available to those voting.\nKlaveness says: “We are critical of the process of these awards, not just Saudi, because it has not been transparent and it has not been done in an accountable way. There has to be competition, it has to be a discussion. Everything seems suffocated, so that discussions go away. It’s not good governance. The council made decisions on the day of the announcement of the bid procedures, it locked (in) a lot of things.”\nWhile Saudi Arabia will now undergo the bidding process ahead of next year’s vote, any rigour to FIFA’s assessments appear to be undermined by the fact Infantino essentially announced the hosts for 2030 and 2034 on his Instagram page on October 31.\nView this post on Instagram\nThe question for Klaveness, therefore, is what exactly can be done to bring about reform in a FIFA ecosystem which seems disempowering for dissenting voices.\nAdvertisement\nShe says: “Denmark has spoken out, and I think a lot of federations agree that power is too centred and not transparent enough. There are federations that are willing to move on this, but we need a critical mass of people, not just within leadership.\n“This is why we do interviews like this, as we need a push also externally to get this change. People did a good job with the FIFA reforms but it is the implementation of these regulations that are lacking. This was an obvious opportunity missed and it’s disturbing we didn’t use this opportunity to lift up the human rights statutes as a value. It was sold to us as a reform, and it was the biggest legacy from the Qatar ‘mistake’, if I can call it that. And now it was sidelined.”\nInfantino’s relationship with Saudi Arabia has come under the microscope in recent years, particularly when in 2021 he was part of a promotional video released by the Saudi ministry of sport, while he and Bin Salman also watched the world heavyweight title boxing match between Oleksandr Usyk and Anthony Joshua together in Jeddah, Saudi’s second biggest city, in August last year, before sitting alongside one another at the opening game of the Qatar World Cup three months later. On Thursday, The Times newspaper reported that Saudi Aramco will become a FIFA sponsor, in a further indication of intimate ties between the state and world football’s governing body. FIFA said they do not confirm or deny such discussions.\n“We now have to learn what has happened,” Klaveness says. “What transparency can we demand? How far have central people (from FIFA) gone in working for bidders? And is that in line with good governance?”\nA FIFA spokesman said: “It was widely reported that a number of countries were exploring possibilities of joint bids. These discussions were not triggered or initiated by the FIFA President. FIFA always encourages bids for all its tournaments (men’s, women’s and youth). The selection of venues for the FIFA World Cup takes place through an open and transparent bidding process, with the final decision made by the 211 member associations.\nThe governing body also insisted the bidding processes were approved by the FIFA Council, adding “this wasn’t done without consultation, all confederations discussed and agreed.”\nKlaveness is keen to make clear she sees her work as encouraging good governance, rather than activism. She does not see this battle as the West against the rest, as Infantino sought to portray matters in Qatar. In Saudi Arabia, questions about migrant workers will likely return, due to the level of construction required to stage World Cup 2034, while LGBTQI+ people are discriminated against under law there.\nAdvertisement\n“We have some values that we believe are universal values,” says Klaveness. “Money shouldn’t buy them. Freedom of speech is one of them. We cannot now be afraid to mention the word LGBTQ, because we have a lot of LGBTQ fans and players. It’s a very core business for us. Secondly, all workers should be safe, and that is a precondition for World Cups. It’s not political to me.”\nHer other priority is to ensure that awards such as hosting men’s World Cups are also used as leverage to “escalate women’s football”. In Qatar, for example, the women’s national team appeared to be inactive by the time the men’s World Cup came around last November, having played only 15 official fixtures in a 13-year history.\n“If we don’t work on that, our experience is that it won’t happen by itself,” Klaveness says. “Of course, Norway cannot change that. But at least we will try very hard to make it operative and not just empty politics.”\nGO DEEPER\nSpecial report: Saudi Arabia, the next frontier for women's football?\nKlaveness seeks to drive change in women’s football both at home and abroad. She is diplomatic, saying it is not about dragging down the men’s game, but also insists there are issues that will not be fixed solely by the passing of time.\n“Football is the most popular sport in the world for women, and growing fast. But we are also part of a systematic discriminating system,” she says. “The gap between men and women in football is growing, even though women’s football is growing. So in FIFA, UEFA, everywhere, we have to acknowledge that it’s not just about taking your time and being patient. You have to go into the data and see the differences; not to bring down the men’s football, but to acknowledge a problem.\n“It’s a problem that you don’t have any female representation in boardrooms and a problem that you don’t have any female applicants to the biggest sport for women. Women’s football is often run by people coming from the men’s side. And you would never run the men’s side with people just coming from the women’s side. This is the story for all kinds of jobs; analysts, coaches; and the closer you get to the field, the fewer female applicants you will get. It’s the system. It has been high-risk and no reward for women. My point is we have to acknowledge it as a problem to be solved.”\nShe takes encouragement from the decision by U.S. Soccer to offer Emma Hayes, the newly appointed coach of their women’s national team, a salary in line with that of Gregg Berhalter, who has the same role in the men’s game.\nAdvertisement\nKlaveness says: ‘The United States are in a special situation, because the women’s team have been much more successful than the men’s team. And they have, if you took away the system, been more successful commercially and also filled the stadiums. And so they have to pay their way.\n“The rest of us, like Norway, we haven’t qualified with the men’s team. So we don’t have that money. That’s one thing. And secondly, the wave of audiences are coming to Europe now on the women’s side. So the United States has been a role model on the women’s side for ages. And to do those things, symbolic acts, will push the rest of us. And then those questions you ask will be asked with equal pay from World Cups and equal pay with coaches.\n“The problem for other federations would be the inflation on the rest. Because what about the assistant coach (under Hayes), for example? And where should the money come from? If that happens, it will push some of the rest of us to escalate.\n“Even though such decisions can sometimes be a bit populistic and pressured, this is very important and timely and it has to be some of the big flagships doing it because they have the investment to do it. There are very few countries that can say, in the way the U.S. can, that women’s football will be more popular. It’s very unusual.\n“Soccer is so great in Europe for men. So you have an imbalance and I welcome those decisions even though they push the rest of us. And it is a push we all should feel; federations, clubs, media, sponsors and confederations.”\n(Top photo: Patricia de Melo Moreira/AFP via Getty Images)",
  "word_count": 2413,
  "scraped_at": "2026-02-14T12:05:50.885759"
}