{
  "article_id": "881f7e8f6ab1",
  "url": "https://www.yahoo.com/news/kemp-signs-bills-requiring-school-050034289.html",
  "title": "Kemp signs bills requiring school panic buttons , ban on trans girls in Georgia school sports",
  "date": "20250429T054500Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kemp signs bills requiring school panic buttons, ban on trans girls in Georgia school sports\nGov. Brian Kemp celebrates after signing education bills. Ross Williams/Georgia Recorder\nA bill aimed at boosting safety in Georgia schools and another banning transgender girls from girls’ school sports teams were among a raft of priority education legislation signed into law Monday by Gov. Brian Kemp.\n“As the parents of three daughters, (First lady Marty Kemp) and I know just how important it is to keep our children safe and to give them the best possible start in life,” Kemp said. “That’s why I’m proud to sign these bills that will further safeguard our classrooms, both from those with violent intentions and from out-of-touch political agendas.”\nAs Kemp signed House Bill 268, he was backed by Winder Republican Rep. Holt Persinger, the bill’s sponsor, and other members of the Barrow County community, which includes Apalachee High School. Apalachee High saw Georgia’s deadliest school shooting last year, in which two teachers and two students were killed and another nine were injured.\nThe bill was crafted as a response to the shooting and contains a number of provisions intended to decrease the likelihood of a similar attack. It requires schools to implement a panic button system that would allow employees to instantly contact authorities in case of an emergency. Apalachee began using a panic button system just a week before the shooting, and some have credited the devices with allowing law enforcement to react quickly enough to prevent more people from being killed.\nThe bill also requires schools to share data when a student transfers within five school days. The accused teenage shooter at Apalachee had allegedly been interviewed by the FBI in connection with shooting threats at another district more than a year before the attack, but those allegations did not follow him to Barrow County.\nThe most controversial element of the bill was stripped out before it passed the Legislature. Originally, it would have created a statewide database of students who might pose a threat to school safety. Opponents cited privacy concerns, saying that a student who made an idle threat against a classmate or another immature but harmless mistake could have their future opportunities threatened.\nEducation bills signed by Gov. Kemp Monday\nSenate Bill 1 – Prohibits student athletes from playing on teams designated for the other gender and requires restrooms, locker rooms and sleeping areas to be single-gender at sporting events.\nHouse Bill 81 – Establishes an interstate compact for school psychologists to make it easier for professionals from other states to work in Georgia.\nMore in U.S.\nHouse Bill 307 – Consolidates existing statutory requirements for dyslexia screening to reach students earlier.\nHouse Bill 235 – Allows education workers to receive a leave of absence to donate organs or bone marrow.\nSenate Bill 82 – Encourages local school boards to approve charter school petitions.\nSenate Bill 123 – Mandates the creation of review teams for school systems with high rates of chronic absenteeism.\nHouse Bill 268 – Requires schools to have up-to-date mapping and panic buttons, requires school records for transfer students to be transferred within five days, requires districts to provide anonymous safety reporting programs, creates new safety positions and new offenses for making threats against a school.\nThe panic button portion of the safety bill was originally titled Ricky and Alyssa’s Law after Richard Aspinwall, a teacher and coach who died in the Apalachee shooting and Alyssa Alhadeff, who was killed in the 2018 shooting at Marjory Stoneman Douglas High School in Parkland, Florida.\nMembers of both families were on hand for the signing.\nAspinwall’s father-in-law Kevin Zinke said the ceremony was bittersweet.\n“We’re happy that the governor decided to sign it, but this whole thing has been a rollercoaster ride,” he said. “You’re just happy about something like this, but none of us should be here right now. None of us should be here for this. This could have all been prevented.”\nAlyssa’s parents, Lori and Ilan Alhadeff, have been traveling the country advocating for panic button mandates. Georgia is the eighth state to pass such a law. Ilan Alhadeff called the buttons his daughter’s legacy.\n“She was inherently very protective of everyone around her. She always brought the crowds and was always defensive of everyone in her circle, and this is so nice to see and so vitally important to see that we’re able to save lives. In the Apalachee shooting, it saved lives. A panic alert went off, and if it was not for that, more children and staff could have been killed that day. So this is just a clear example of how it saved lives. If it was there in 2018, our daughter would be here with us today.”\nCoach Aspinwall’s father, who is also named Richard Aspinwall, said he’s glad for the provisions that passed, but he said he hopes to see the database portion become law as well.\n“We’re going to keep working on that. You can’t expect somebody to be blindsided with a problem,” he said.\nSenate Bill 1 was one of the most controversial bills of this year’s session, which ended early this month.\nAlso known as the Riley Gaines Act after a college swimmer who finished in a tie with a transgender swimmer in a tournament at Georgia Tech, the bill bans transgender athletes from playing on team sports designated for their gender identity at all grade levels, including college. It also requires separate restroom, locker room and sleeping facilities for men and women at athletic events and sets up a way to legally challenge schools that violate the law.\nSupporters say the measure will ensure women and girls can find safety and fair play on the field.\n“This common sense legislation is about what is fair and safe for our children,” Kemp said. “Girls should not have to share a playing field, a restroom or locker room with boys. I know I learned a lot of valuable lessons about life on the football field and the baseball diamond growing up, and it’s not right to ask kids today to forgo those lessons when facing someone biologically stronger and faster than them.”\nOpponents call the bill and other legislation taking away rights from transgender people attempts to score political points by going after a vulnerable group.\nThe Georgia High School Association and NCAA already ban transgender athletes from playing in women’s sports, and President Donald Trump signed an executive order earlier this year banning transgender participation in women’s sports.\nBentley Hudgins, state director with the Human Rights Campaign, said GOP legislators shot down Democratic efforts to boost girls’ sports, including Senate Bill 41, which aimed to equalize funding, access and equipment between girls’ and boys’ school sports.\n“Instead of addressing the real problems young women and girls face on the playing field, they chose to bully trans kids and put all girls in harm’s way,” they said. “Their absurd attacks on kids are tired and don’t help anyone. While Republicans play political games and bully transgender children, they cannot and will not steal our joy.”\nClarification: This story was updated at 3 p.m. on April 29 to clarify that Riley Gaines tied for fifth place with Lia Thomas, a transgender swimmer, in the 200-yard NCAA freestyle championship in 2022.",
  "word_count": 1219,
  "scraped_at": "2026-02-14T13:21:06.595291"
}