{
  "article_id": "88223074103f",
  "url": "https://www.cameroon-tribune.cm/article.html/65138/fr.html/guinness-super-league-fc-ebolowa-lifts",
  "title": "Guinness Super League : FC Ebolowa Lifts Trophy",
  "date": "20240527T131500Z",
  "domain": "cameroon-tribune.cm",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Guinness Super League : FC Ebolowa Lifts Trophy\n- Par Dilian WELLENG\n- 27 May 2024 13:34\n- 0 Likes\nThey sealed their unbeaten run with the 4-0 victory over AS Fortuna on Saturday May 25, 2024 to finish top on the standings with 56 points.\nThe 2023-2024 Guinness Super League season concluded in dramatic fashion on Saturday, May 25, 2024, at the Ngoa-Ekelle Stadium in Yaounde as FC Ebolowa secured their first-ever title with 56 points. The undefeated Ebolowa side capped off their remarkable journey with a dominant 4-0 victory over AS Fortuna on the 22nd and last playing day of the competition. However, the title race was not decided until the final whistle, with FC Ebolowa tied on points with their arch-rivals, Lekié FF. Ultimately, FC Ebolowa's superior head-to-head record proved decisive in their favour.\nThe final day was one full of suspense. Lekie FF put down a strong statement with a crushing 8-1 win over Eding Filles in the first match at the Ngoa-Ekelle Stadium, putting immense pressure on FC Ebolowa for the following encounter that was the top match dubbed the “Guinessico”. The kicker of the AS Fortuna-FC Ebolowa game was given by the President of the Cameroon Women’s Football League, Céline Eko, who doubles as the First Vice President of the Cameroon Football Federation (FECAFOOT). FC Ebolowa rose to the challenge magnificently. Led by the phenomenal Flora Kameni, who netted all four goals against AS Fortuna, the team delivered a performance worthy of champions. This strong performance not only secured the title for FC Ebolowa but also earned Kameni a remarkable fourth “Woman of the Guinessico” ...\nCet article complet est réservé aux abonnés\nDéjà abonné ? Identifiez-vous >\nAccédez en illimité à Cameroon Tribune Digital à partir de 26250 FCFA\nJe M'abonne1 minute suffit pour vous abonner à Cameroon Tribune Digital !\n- Votre numéro spécial cameroon-tribune en version numérique\n- Des encarts\n- Des appels d'offres exclusives\n- D'avant-première (accès 24h avant la publication)\n- Des éditions consultables sur tous supports (smartphone, tablettes, PC)",
  "word_count": 341,
  "scraped_at": "2026-02-14T12:48:09.268688"
}