{
  "article_id": "8843b2413257",
  "url": "https://www.arsenal.com/news/every-word-renees-post-leicester-presser",
  "title": "Every word of Renée post - Leicester presser",
  "date": "20250416T020000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Following our 5-1 victory over Leicester City in the Women's Super League, Renée Slegers held her usual post-match press conference at Emirates Stadium.\nOur head coach fielded questions on the performance, Victoria Pelova's first goal back from injury and whether we can take this momentum into Saturday's Champions League semi-final against Lyon.\nHere is everything she had to say:\nOn what pleased her most about the performance:\nThe first game of the block is always a challenging one because everyone comes back from the national teams, been in different continents, played different styles of football with other players. So we had three sessions, which were very good sessions, by the way, but then still going into that first game and then delivering this and showing such togetherness and cohesion, that's what I'm most happy with.\nOn any lessons learned ahead of Saturday:\nAlways learning. Ahead of Saturday that there are actually some similarities between Leicester and Lyon. Of course, different levels, the challenge will be bigger on Saturday but we also saw a lot of different players on the pitch today.\nOn breaking down low blocks:\nYes, but Leicester didn’t really play a low block today. I think they're very brave with their press. They tried to go high on us and they use a player-for-player system, so I don't think we faced a low block so many times this game. But, a way to not play against a low block is to use other moments to attack and I think that's what we've been talking about with the team, and I think we use that really well.\nFor example, that second goal, which is a great team goal, it's a faster attack, so we try to find other ways to play against these teams, to not have to break down a low block. But I think we have found keys as well to break down low blocks when we face them.\nOn Mariona’s ability to break teams down:\nShe’s a very good player herself, but she makes everyone around her better as well. So I think she sets up situations so well. She recognises overload, she recognises the right pass. She can take herself out of situations on the dribble, she's really good at pass and move and everything that happens around her is most of the time a good situation. Having her in the middle of the pitch, being able to impact so much of our game and being creative in those moments from central areas, I think has been very positive for us.\nOn Victoria Pelova’s goal and reaction:\nShe came back from a long-term injury and the players have been supporting her all the way. We were so happy when she was back on the pitch training with us. We were so happy when she made her first minutes back in games and now she's scored her first goal back. So it’s so nice to see how happy the other players are for her.\nThere's a lot of hard work during those months and it's lonely and Vic has been working with the performance and medical team and hasn't been able to play football with the rest. So everyone understands how much it means for Vic and it means a lot to the team as well.\nOn how much confidence we can take into Saturday:\nIt's very positive. It's everything we wanted. So that's good, but we are also realistic and we understand that the challenge on Saturday is going to go up a couple of levels. But I think we did everything we wanted to do today to start the block in a good way and set ourselves up for a good performance on Saturday as well.\nOn Victoria Pelova’s mentality:\nShe loves football. She loves playing football, and that's how she grew up and now, all of a sudden she had to be in the gym, working hard, without a ball, and doing a lot of physical work and I think that's what she has developed, that part of being a professional footballer and developed physically. But she also says, ‘I appreciate being able to play football even more now’ and I think that's what you can see in the way she trains, the way she applies herself, the way she comes out and plays the games as well.\nOn showing the side’s versatility:\nI think so many players do so well today. We have a great squad and even if we we've had consistent starting elevens, it's still very hard to pick those elevens because of the quality we have in the squad, how well players train, so it's always a lot of work around the detail and making the right decisions in choosing the team and today we had a couple of players that we couldn't choose. But the way those players then step in, players that haven't played for a while maybe for us, from the start, very good. I'm very happy with them because it's not always easy to do that. Especially not coming away from, like I said, coming away from the international break and then coming back here and then having to play that role straight away. It's very strong of the players.\nOn Stina Blackstenius’ performance and confidence\nThere's always factors, but I think that there are a couple of things that she does, out of possession, that on such a high level today, things we've been working on with, her the way she comes back in double defense, how hard she works in counter pressure and then of course with her physical profile, how strong a fast she's, she can impact so much. So I think she brings a lot to our game today from that perspective.\nOn her approach to playing Leicester:\nWe have to object this for the block and one of them is to get four out four in the WSL. This was part of that objective and we made the first step today, so this had nothing to do with Lyon. But like I said, we always find it important to start the block really well and set the standards for ourselves, set the tone, and I think we did that today.\nOn Kim Little’s performance and form:\nShe's been so good for us and for her staying at home during an international break and training with low numbers and artificial trainings that we try to make realistic for her, with regards to decision making in spaces, it's never going be the same as playing 11 v 11, for her that transition is also hard coming from an international break into back with the team and playing games. So I'm so impressed with how she's done that.\nYou see it in the way she performs today in the game, but she's been really, really good in training as well. Now, I'm very impressed with her. Kim is 100% in everything she does, and that's why she's at such a high level consistently.\nOn Katie Reid’s performance:\nKatie Reid is a young player who comes from the academy that we believe in strongly. She has such a big skillset with speed, with physicality, with understanding, with good passing details. We believe in her and we are always comfortable when we need her or when the moments are there that we can bring her onto the pitch and she will perform for us and I think that's very impressive. Looking at her age that she's so mature, calm and composed.\nOn if Alessio Russo and Chloe Kelly could make the Lyon match:\nThe health of a player always comes first. We would never, as a club, take any risks that, that aren't fair to the player, of course, and the player always has a say in it. But yeah, of course, these players want to be available. They want to play in these games so bad, so they're doing everything they can. The players, together with the medical team to get ready for the semi-final.\nOn if she’s confident they will be fit for the semi-final:\nIt's looking very good for the two, yes.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1387,
  "scraped_at": "2026-02-14T12:43:34.864999"
}