{
  "article_id": "88600132ea1c",
  "url": "https://www.walesonline.co.uk/whats-on/whats-on-news/madame-tussauds-wants-england-lionesses-27576130",
  "title": "Madame Tussauds wants England Lionesses fans to pick player to be immortalised at waxwork attraction",
  "date": "20230823T130000Z",
  "domain": "walesonline.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Madame Tussauds wants England Lionesses fans to pick player to be immortalised at waxwork attraction\nWaxwork museum Madame Tussauds has launched a public vote to pick which England player should be honoured as one of its famous figures\nMadame Tussauds wants Lionesses fans to pick which England player should be immortalised as a figure at the waxwork attraction. The London museum has launched a public vote.\nSupporters can choose from seven players - or opt for head coach Sarina Wiegman, who took the team all the way to the FIFA World Cup final. Of the players, the options are goalkeeper Mary Earps, Chloe Kelly, Millie Bright - captain of the history-making side - Leah Williamson, Alex Greenwood, Lucy Bronze or Lauren James.\nGeneral manager Tim Waters said: “Like the rest of the nation we’re incredibly proud of the Lionesses. Not only for their success at the FIFA Women's World Cup this year, but for their momentous win in Europe last year and all they have done for their sport-bringing women’s football roaring into the mainstream.\n“They inspire and encourage so many, and we feel it’s only right what they have achieved is commemorated so we’re going to do that in the way that only Madame Tussauds London can. The whole team have been outstanding, and they all brought so much to the World Cup, which makes it really difficult for us to pick who our expert artists should create.\"\nFans can cast their vote at the Madame Tussauds London’s website. The poll will close on Friday, September 8 and Madame Tussauds says the result will be announced \"in the coming year\".",
  "word_count": 271,
  "scraped_at": "2026-02-14T13:04:12.664513"
}