{
  "article_id": "8865925fac62",
  "url": "https://www.cardchronicle.com/2024/1/30/24055844/tuesday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Tuesday afternoon Cardinal news and notes",
  "date": "20240131T001500Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "—Spread check: Clemson by 16.\nTuesday afternoon Cardinal news and notes\nL’s up from Puerto Rico.\n—The NCAA announced Tuesday that it’s shortening the men’s basketball transfer portal window. The portal will be open for 45 days — from the last day of the regular season through May 1.\nSo if you were in the position of being a program that was, I don’t know, going to make a coaching change at the end of the season, you would want to do so as quickly as possible and probably couldn’t afford to wait a couple of weeks just to see a buyout number drop.\n—Jeff Brohm is spending the middle chunk of this week on the road recruiting with three assistants in the state of Florida.\n—Louisville sits at No. 22 in Pat Forde’s way too early college football rankings for Sports Illustrated.\n22. Louisville Cardinals\nJeff Brohm worked wonders in his first season, winning 10 games in part by mastering the transfer portal. He’s done good work in that area again, stocking up on players who should be able to step in and play right away. Texas Tech transfer Tyler Shough arrives and could be an upgrade at that position—if he can stay healthy. The Cardinals lost a couple of early-entry players to the draft at running back and receiver, but do have some depth at both spots. The most intriguing defensive addition is tackle Thor Griffith from Harvard, who was pursued by several power-conference programs.\n—The Louisville swim and dive squads swept Kentucky over the weekend.\n—The CJ preview of tonight’s game against Clemson is here.\n—Former Louisville assistant Sam Purcell notched the biggest regular season win of his short head coaching career as his Mississippi State squad took down reigning national champion LSU Monday night.\nHailey Van Lith looked confused both on and off the court throughout the night.\n—Conversely, this is the happiest she’s looked all year.\n—Matt Norlander’s latest Court Report for CBS says, among other things, that right now Kentucky’s defense simply isn’t good enough to win a national championship.\n—Rajon Rondo was arrested last night in Indiana on misdemeanor gun and drug charges. Bad timing for the “Rajon’s Louisville” banner to go up.\n—The week ahead in Cardinal athletics:\nTuesday, January 30\nMen’s Golf at Sea Best Invitational\nMen’s Basketball at Clemson - 9 p.m. ET\nThursday, February 1\n#18/16 Women’s Basketball vs #22 Syracuse - 7 p.m. ET (KFC Yum! Center)\nFriday, February 2\nTrack&Field at PNC Bank Bellarmine Classic - (Norton Healthcare Sport and Learning Center)\nTrack&Field at New Mexico Collegiate Classic\nWomen’s Golf at Collegiate Invitational at Guadalajara Country Club\n#8/15 Swim&Dive at #6/9 Indiana - 12 p.m. ET\nWomen’s Tennis vs Austin Peay - 3 p.m. ET (Bass Rudd Tennis Center)\nMen’s Tennis at #10 Kentucky - 5 p.m. ET\nSaturday, February 3\nTrack&Field at New Mexico Collegiate Classic\nWomen’s Golf at Collegiate Invitational at Guadalajara Country Club\n#8/15 Swim&Dive vs Cincinnati - 12 p.m. ET (Ralph Wright Natatorium)\nMen’s Basketball vs Florida State - 8 p.m. ET (KFC Yum! Center)\n—Less than a year after its last infractions case concluded, Tennessee is under NCAA investigation again.\n—Athlon has a betting preview of Louisville vs. Clemson.\n—This is a nice way to kill some time if you have that luxury today.\n—The U of L men’s tennis team swept Clemson over the weekend.\n—Former Louisville assistant Clint Hurtt is going to be the new defensive line coach for the Philadelphia Eagles.\n—Louisville is in the top 12 for class of 2025 defensive lineman Wilnerson Telemaque.\n—Class of 2025 QB commit Mason Mims recapped his latest visit to U of L and thankfully didn’t bring up the brief time the recruits spent at the basketball game.\n“It went great,” Mims told Cardinal Authority on Sunday evening. “I had a great time with the coaches, and the recruits. Felt like I built a better relationships with both.”\nDuring his conversations with UofL head coach Jeff Brohm and offensive coordinator Brian Brohm, the message was to keep progressing and be the leader his team needs.\n“Just to keep doing what I’m doing,” Mims said. “Stay in the weight room, keep on improving on the field. They want me to be focused on my team and just be a guy my teammates look to as a leader.”\nWhen Mims committed, he pointed to the opportunity to learn under both coaches as key in his decision.\n“I know going to Louisville to play under those two, they are going to develop me into a better quarterback,” Mims said in November. “They have been around football for so long and so many good quarterbacks, and they were both good quarterbacks. They’ll develop me into a better one.”\n—Saturday’s blowout loss to Virginia was Kenny Payne’s 28th double-digit loss in less than two years. That’s unbelievable.\n—With New Mexico earning its highest ranking in a decade and St. John’s meeting UConn in The Garden Saturday, this is Pitino Week in men’s college basketball.\n—Louisville Report breaks down the game of newest U of L football commit Gradey Anthony.\n—Congrats again to the former Cardinal assistant.\n—Cardinal Authority’s latest Louisville baseball notebook is here.\n—Defector covers the fact that Louisville basketball hasn’t been this bad since the 1930s.\n—Rick Bozich writes that the Cards appear to check out early during their embarrassing loss to Virginia.\n—Louisville Report’s Matt McGavic is predicting a 21-point Clemson victory tonight.\n—Shakin’ the Southland previews tonight’s matchup at Littlejohn.\n—And finally, beat Clemson.",
  "word_count": 921,
  "scraped_at": "2026-02-14T13:39:19.435214"
}