{
  "article_id": "886bf68bafd6",
  "url": "https://www.thenationalnews.com/news/2024/07/28/france-investigates-death-threats-to-israeli-athletes/",
  "title": "France investigates death threats to Israeli athletes",
  "date": "20240728T210000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Follow the latest news on the 2024 Paris Olympics\nFrench police have launched an investigation after three Israeli athletes at the Paris Olympic Games received death threats, Paris's prosecutors office said on Sunday.\nFrench anti-cybercrime officers are also investigating how athletes' personal data, including blood test results and login credentials, was released on social networks on Friday.\nIsrael's National Cyber Directorate said in a statement that, after an investigation, it had come to the conclusion that Iranian hackers were creating social media channels to publish personal information about members of the Israeli delegation and send them threatening messages.\nOn the same day, Israel's foreign minister warned his French counterpart of a potential Iranian-backed plot to target Israeli athletes and tourists during the Paris Olympic Games.\nThe Iranian mission to the United Nations said in a statement on Thursday: \"Terrorist acts have no place in the principles of resistance groups; lies and deceit cannot switch the roles of the plaintiff and the accused.\"\nIsraeli athletes are being escorted to and from events by elite tactical units and given 24-hour protection, officials say. Israel's internal security service, Shin Bet, is helping with security.\n\"Total support for the measures that are being taken by the French authorities,\" an Israeli diplomatic source said.\n\"This sends an important message to individuals and organisations attempting to threaten athletes.\"\nProsecutors said they were probing possible anti-Semitic hate crimes during an Israel-Paraguay football match on Saturday in Paris that featured chants and banners about the Gaza war.\nThe match at the Paris Saint Germain stadium saw fans \"dressed in black, masked and carrying Palestinian flags unfurl a banner saying 'Genocide Olympics'\" and one of them \"made gestures of an anti-Semitic nature\", a separate statement said.\nThe Paris Olympics organisers lodged a complaint with police, the prosecutors' statement added, confirming a story by the Parisien newspaper.\nAn AFP reporter at the stadium said about 50 so-called \"ultra\" fans in the crowd sang chants in French against Israel and about the Gaza war. The chants, in French, included \"Israel Killer\" and \"Israel is killing Palestine's children\".\nThe Israeli anthem was booed by part of the crowd. Some Israeli fans in the stadium chanted back \"Free the hostages\".\nThe fans could be charged with aggravated incitement to racial hatred, the statement said.\nParaguay beat Israel 4-2 in the match.",
  "word_count": 388,
  "scraped_at": "2026-02-14T12:57:45.766577"
}