{
  "article_id": "888d93d23dac",
  "url": "https://www.thenationalnews.com/arts-culture/pop-culture/2025/07/07/eurovision-israel-palestine-italy-germany/",
  "title": "Italy and Germany threaten to withdraw from Eurovision Song Contest if Israel is banned",
  "date": "20250708T031500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Amir Alon, a former member of Israel’s Eurovision delegation has claimed that the public broadcasters of Italy and Germany have threatened to withdraw from next year’s Eurovision Song Contest if Israel is excluded without clear legal grounds, according to the website Eurovision Fun.\nItaly and Germany are reportedly backing Israel's public broadcaster Kan, which maintains editorial independence from the Israeli government.\nSpeaking to Israel’s N12News, Alon said: “As long as the war in Gaza continues and images of the conflict reach European audiences, it will be difficult for countries like Italy and Germany to publicly defend Israel. These two countries are among the contest’s top financial contributors, are in direct communication with the EBU and support Kan. If Kan is excluded, they have threatened to leave the contest as well — something the EBU wants to avoid.”\nOn Thursday, the European Broadcasting Union held a meeting at the BBC headquarters in London to discuss the possible expulsion of Israel from Eurovision. There wasn't any voting, and discussions were postponed until the next meeting in winter.\nAccording to Ynet, the push to ban Israel has been led by Iceland and Slovenia. Meanwhile, Austria, Germany and Switzerland were the only countries to publicly express support for Israel. In a move that surprised many, the BBC reportedly requested that a vote be avoided and encouraged continued dialogue — a gesture seen as a concession to Israel.\nAyala Mizrahi, a lawyer representing Israel on behalf of Kan, told the assembly that Israel values its long-standing participation in the song contest and emphasised the country’s more than 50-year Eurovision history.\nSome past and present Eurovision participants have called for an investigation into whether Israel breached contest rules by promoting Yuval Raphael’s entry with government-funded ads during the most recent competition. However, the EBU has said that this did not violate its regulations.\nThe EBU has consistently maintained that it will not ban Israel, stating that Eurovision is a competition between public broadcasters, not governments, and that Kan has not broken any rules.",
  "word_count": 337,
  "scraped_at": "2026-02-14T13:01:52.210547"
}