{
  "article_id": "88be8b0b4630",
  "url": "https://www.independent.ie/regionals/wicklow/west-wicklow-news/local-notes/blessington-bulletin/a1093355653.html",
  "title": "Blessington Bulletin",
  "date": "20250507T010000Z",
  "domain": "independent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Blessington Bulletin\nParish Draw results\nThe Parish Draw for April took place on April 27 and the following people were the lucky winners of €100, Sean Ascough, Tina and Aidan Cruise, Pat and Marie Mahon, Aine Shirran, Kim and Michael Nolan and Maureen Phibbs. Congratulations to all the winners. The next Parish draw will take place at the end of May.\nDeath\nThe recent death took place of Bridget O’Hagan, Downshire Park Blessington after a long illness. Bridget died in St. Brigid’s Hospice Curragh Co. Kildare.\nBridget was well known in the Blessington and surrounding area having ran a restaurant on the Kilbride Road for a long number of years. For many years farmers attending the local sales used to come to her restaurant for some grub and they always got a very warm welcome from Bridget and some delicious food.\nHer remains were removed to the Church of Our Lady Blessington last Monday afternoon April 28 and her burial took place afterwards in Burgage Cemetery Blessington. There was a very large attendance at her funeral which was most fitting as she was much loved and will be sadly missed by all who knew her. Condolences to her family at this very sad time in their lives.\nGAA Lotto\nBlessington GAA Club held their very latest Lotto Draw on Tuesday April 29 with another new jackpot standing at €3,600 which was not won. Only three lucky punters managed to match even three numbers and they each won €100. The winning number drawn on the night were5,8,22,23. The next Lotto Draw will take place on Tuesday May 13with a brand new jackpot which will be standing at €3,800. Tickets are on sale at the usual local outlets or you can purchase one online. The club would appreciate your support and remember the old saying ‘if you are in you cannot win’.\nParish Lotto\nBlessngton Parish Lotto Draw took place on Thursday April 17 and there was once again no winner of the jackpot. The winning numbers drawn were 3,8,16,25.The jackpot has now survived a number of draws. The next Lotto Draw will take place later in the week and it will have another new jackpot which will be standing at €3,000. Contact the Parish office for details in how to enter the draw or you can check the parish website. All support will be most welcome. It would be a great way to win a nice few euros and who knows you might be the lucky one who scoops the jackpot which no doubt will come in very handy at this time of the year with summer holidays just around the corner.\nLouise retires from Ireland\nBlessington’s Louise Quinn announced her retirement last week from football. The 34 year old has not played since last October when a hip injury ruled her out of the Euro 2025 play -off semi-finals against Georgia. She was hopeful she would be back for the final showdown with Wales but never recovered. Over the years she has done her native Blessington proud. She has played with a number of different clubs since she stared out with Blessington all those years ago. She played for Peamount, UCD, Eskilstuna United Sweden, Notts County, Arsenal. Fiorentina Italy and Birmingham City and was capped for the Republic of Ireland Women’s senior team 121 times which is an amazing record. One of her highlights was playing in an FA Cup final with Arsenal at the famous Wembley against London rivals Chelsea. Another highlight has to be playing for Ireland in the last World Cup in Australia.Have a happy retirement Louise and all the best in the future.\nGAA camp\nHere is a reminder from Blessington GAA Club that booking is now open for Blessington based dual Kellogs Cul camp which will be taking place From July 7- July 11 in the GAA Grounds. These camps book out very quickly so don’t delay. Booking details www.kellogsculcamps.gaa.ie. Please note that the inclusion camp will be open for bookings at a later date so watch this space.\nMusic festival\nHere is a final reminder.West Wicklow Chamber Music Festival will get underway this year from this Thursday May 8- May 18 with its most ambitious and exciting programme to date. There will be an inspired and varied selection of concerts. There will be performances from acclaimed international and Irish artists throughout the Festival. It will take place at Russborough House, St. Mary’s Church and the Tramway Theatre Blessington. Full details about the music festival have been announced on their website. To find out a full list of the artists taking part in the Music festival or to obtain tickets check out their website. It promises to be an event not to be missed.\nWestern Gaels Hurling Club\nWestern Gaels Hurling Club are on the lookout for some new players. They are a juvenile club and cater from U/7’s all the way up to and including U/17’s. Make sure to check out their Facebook Page for times of training. The club has had great success since it was established some years ago. Anyone from Blessington, Manor Kilbride, Valleymount, Lacken and Hollywood are eligible to join up.\nDarkness Into Light\nThere will be no Darkness Into Light event in Blessington this year but a group of people are meeting up at 4,15am at the Square in Blessington on Saturday May 10. Anyone can come along and take part. You can walk or run the 5K. Lets show up and wear something bright.\nFittest Familiy\nIs there any family in the Blessington and surrounding area who has what it takes to win the ultimate? This year the organisers will be mixing things up. They will be bigger, bolder and tougher than ever. The winner will walk away with €15,000 and the title of Irelands Fittest Family. You can apply now at fittestfamily@animotv.ie or you can search RTE Take Part online.\nGreenway\nBlessington’s Greenway is now open every day. It begins at the Avon Blessington and continues all the way down to Poulaphouca. It has been a great success since it opened some years ago and a lot of people walk, run or cycle along it.\nIf anyone out there has never used the Greenway why not head on down and give it a go. It is a marvellous way to keep fit and healthy in to -days world.\nConversation Circle\nBlessing GAA Club will be hosting an Irish Conversation Circle (Ciorcal Comhra) commencing on Tuesday May 13 in Blessington Library at 7.30pm- 8.15pm. It will last for six weeks until June 17. Join them for a chat as GAEILGE. Its free and no registration is required. Call Noreen tel. 087 2858 375 for further t\nLibrary news\nSpanish conversations takes place every second Monday of the month at 10.30am. No booking is required. English Conversation group takes place on Tuesday’s from 12pm – 2pm and Thursday’s from 5pm – 7pm. No booking is required. Chess Club for children is on Fridays at 3pm. No booking is required.\nSocial Club\nThere will be a Social Club in the Coimin centre Blessington on Friday May 30. It will be hosted by The Alzaeimer Society of Ireland. They are looking for some volunteers to give just two hours of their time. They are looking for warm, friendly volunteers to help create a welcoming space for people living with Dementia. If anyone out there is interested in being a volunteer please tel. Teresa Nagle tel. 085 870 6852.",
  "word_count": 1247,
  "scraped_at": "2026-02-14T12:58:17.781803"
}