{
  "article_id": "88c03ae02f1c",
  "url": "https://www.jamaicaobserver.com/2025/09/23/dembele-beats-yamal-ballon-dor-bonmati-retains-womens-award/",
  "title": "Dembele beats Yamal to Ballon dOr as Bonmati retains women award",
  "date": "20250923T080000Z",
  "domain": "jamaicaobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Dembele beats Yamal to Ballon d’Or as Bonmati retains women’s award\nPARIS, France (AFP) — Paris Saint-Germain (PSG) winger Ousmane Dembele won the Ballon d’Or on Monday as a reward for his starring role in the club’s UEFA Champions League triumph last season, while Spain’s Aitana Bonmati claimed the women’s prize for the third year in a row.\nDembele, 28, edged out Barcelona sensation Lamine Yamal to succeed Manchester City and Spain midfielder Rodri, who took the trophy in 2024, as the winner of the most prestigious individual prize in football — an award that for many years had been dominated by Lionel Messi and Cristiano Ronaldo.\nFormer Borussia Dortmund and Barcelona forward Dembele, who was part of the France team that won the World Cup in 2018, scored 35 goals in all competitions as PSG claimed a French league and cup double as well as victory in the Champions League.\nWith Dembele converted into a centre forward following Kylian Mbappe’s departure for Real Madrid, PSG went on to hammer Inter Milan 5-0 in the final in Munich to win the European Cup for the first time in their history.\n“I really don’t have the words. It was an incredible season with PSG,” an emotional Dembele said on the stage at the Theatre du Chatelet in central Paris.\nHe said that his boss Luis Enrique — who won the award for club coach of the year — had been “like a father” to him.\n“It is an individual trophy but it was really the collective that won it,” insisted Dembele, who was one of nine members of the triumphant PSG team from last season to be nominated for the prize.\n“The Ballon d’Or has not really been an objective for me in my career but I worked hard for the team to win the Champions League.”\nThe 18-year-old Yamal, who was a teammate of Dembele’s at Barcelona when he first broke through in 2023, did earlier win the Kopa Trophy for the best player aged under 21 — the second year running he has taken that award.\nDembele was at the ceremony to pick up his prize while his PSG teammates were losing 1-0 in a Ligue 1 game in Marseille at the same time — that match had been scheduled for Sunday but was put back 24 hours due to bad weather in the south of France.\nBarcelona and Spain midfielder Bonmati won the women’s prize by edging out her international teammate Mariona Caldentey, with whom she played in the Spain side who were beaten on penalties by England in the Women’s Euro 2025 final.\nBonmati, 27, also lost the Women’s Champions League final with her club last season, at the hands of Caldentey’s Arsenal.\nBonmati was named Player of the Tournament at the Euros, despite not starting either of Spain’s first two matches as she recovered from a bout of viral meningitis.\n“I am very proud,” said Bonmati who credited her teammates for their role in her personal triumph.\n“I think I am here for the third-consecutive time because of the teams I play in, so all of this is because of them.”\nAlessia Russo, one of the nominees from the triumphant England European Championship team and also of Arsenal, came third.\nBonmati’s run of three in a row follows back-to-back victories for her Barcelona and Spain teammate Alexia Putellas.\nNorway’s Ada Hegerberg and USA star Megan Rapinoe are the only other players to have won the Women’s Ballon d’Or since it was introduced in 2018.\nThe Ballon d’Or is voted for by a panel of journalists, one from each of the top 100 countries in the FIFA world rankings for the men, and from the top 50 for the women.\nVicky Lopez, the 19-year-old forward who is a teammate of Bonmati’s with Barcelona and Spain, was named best young women’s player.\nGianluigi Donnarumma, who excelled in the PSG team that swept all aside last season before moving to Manchester City, claimed the Yashin trophy for best goalkeeper.\nEngland’s Euro winner Hannah Hampton claimed the best women’s goalkeeper award while her international manager, Sarina Wiegman, was named best women’s coach.",
  "word_count": 692,
  "scraped_at": "2026-02-14T12:36:35.678236"
}