{
  "article_id": "88c81d432d1a",
  "url": "https://www.heraldscotland.com/news/23611666.united-states-host-first-32-team-club-world-cup/",
  "title": "United States to host first 32 - team Club World Cup",
  "date": "20230624T104500Z",
  "domain": "heraldscotland.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The United States will host FIFA’s new, expanded Club World Cup in 2025, football’s global governing body has announced.\nFIFA president Gianni Infantino confirmed the 32-team tournament on the eve of the 2022 World Cup final.\nIt is set to feature 12 European clubs, including the last three Champions League winners Chelsea, Real Madrid and Manchester City.\nThe USA will co-host the 2026 World Cup alongside Canada and Mexico.\nThe dates for the new tournament have not yet been confirmed, but it is expected to fill the summertime slot left open by the now-defunct Confederations Cup.\nThe European Club Association has backed the plans but the World Leagues Forum expressed concern over the “unilateral” decision of FIFA to place the new event in the calendar.\n“The FIFA Club World Cup 2025 will be the pinnacle of elite professional men’s club football, and with the required infrastructure in place together with a massive local interest, the United States is the ideal host to kick off this new, global tournament,” said Infantino.\nThe formal launch of the bidding process for the 2030 World Cup has been delayed, with the bidding regulations now not being presented for approval until the next FIFA Council meeting in September or October.\nThe appointment of the hosts by the FIFA Congress has also now been delayed until the final quarter of next year.\nFIFA also confirmed Indonesia would host the Under-17 World Cup. In March FIFA stripped Indonesia of the right to host the Under-20 World Cup over a refusal to host the Israeli team.\nFIFA confirmed its 74th Congress would be held in Bangkok, Thailand, on May 17.\nThe Congress is expected to vote on who should host the 2027 Women’s World Cup. Brazil and South Africa have submitted bids, while there are two combined bids – Belgium, the Netherlands and Germany and the United States and Mexico.",
  "word_count": 312,
  "scraped_at": "2026-02-14T12:45:33.848506"
}