{
  "article_id": "88d469def5b1",
  "url": "https://www.dailysignal.com/2024/11/26/u-s-naval-academy-trial-unconstitutional-use-race-admissions-part-2-3-witnesses/",
  "title": "Trial Testimony Highlights Fraught DEI Issues at Naval Academy",
  "date": "20241126T153000Z",
  "domain": "dailysignal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Can the U.S. Naval Academy continue to use race and ethnicity in admissions decisions, even though the U.S. Supreme Court expressly forbade the use of race in college admissions last year in Students for Fair Admissions v. Harvard and Students for Fair Admissions v. UNC?\nI believe the clear answer is “no,” as I have argued in this article in the Georgetown University Journal of Law & Public Policy. The Supreme Court’s holding should apply to all the military service academies.\nBut that’s the issue that was litigated at trial before a federal district court judge in Baltimore this fall. That’s because the military service academies were not parties to the lawsuits against Harvard and the University of North Carolina, and not subject to the ruling from last year. So, it’s an open legal question.\nThis is the second of three opinion editorials, where I will discuss the testimony of some of the key witnesses of the plaintiffs and the defendants. In the first piece, I discussed the legal arguments of the parties. In the third piece, I will discuss and analyze their closing arguments.\nAs an interesting aside, the trial judge, Judge Richard D. Bennett, who was nominated by President George W. Bush in 2003 to serve on the federal district court in Maryland, served more than 20 years in the Army Reserve and the Maryland National Guard, where he retired as a major.\nHow his service in the military will affect his opinion, if at all, is anyone’s guess.\nBackground\nThe military service academies, which include the U.S. Naval Academy, the U.S. Military Academy (frequently referred to as West Point), and the U.S. Air Force Academy, produce only 18% of all officers in the uniformed services. The bulk of military officers enter the service either via a Reserve Officer Training Corps (ROTC) program at their college or university or through a direct commissioning program.\nOnce on active duty, all officers are assigned tasks and are eligible for promotion based on their comparative performance. Graduates of the military service academies do not have a “leg up” on non-academy graduates in terms of promotion or job placement.\nIn the Navy, 60% of senior officers are not graduates of the Naval Academy graduates. They become officers either through ROTC or get a direct commission after graduating from college. I received a direct commission as an officer in the Navy in 1992 and retired as a captain in 2022 after 30 years of service on active duty and the reserves.\nAnd since the Supreme Court’s holding in Students for Fair Admissions applied to all colleges and universities (with the exception, for now anyway, of the service academies), and they can no longer use race in admissions, college students in ROTC and direct-commissioning programs are not products of race-based admissions programs.\nToday, 82% of all military officers receive their commission from ROTC or direct-commissioning programs.\nPlaintiffs’ Witnesses\nThe crux of the government’s argument is that the Naval Academy needs to continue to use race and ethnicity as a factor in admissions because the military has an “interest in building a diverse officer corps.”\nThe academy admitted that it uses race and ethnicity as a factor in the admissions process, but that it does so in a way that is both constitutional and narrowly tailored to achieve a compelling government interest.\nThe real issues at this trial boiled down to two things: (1) How much of a factor does race and ethnicity play in admissions decisions at the academy and (2) is a racially diverse officer corps vital to the national security of the United States?\nAs in many other trials, this trial featured a battle of the expert witnesses. But unlike many trials where experts take diametrically opposed viewpoints, the experts here quibbled over the extent to which the use of race and ethnicity in the Naval Academy’s admissions process play a large or small role in the admissions process. But as I noted in Part I, the academy admitted that race or ethnicity can be used as a “nondeterminative factor” in all four steps in the admissions process.\nThe government asserted that the “military’s interest in building a diverse officer corps is integral to ensuring national security.” The government claimed that the quest for a diverse officer corps is “both distinct and measurable,” in “stark contrast to the universities’ admissions policies at issue in [the Harvard/UNC cases].”\nThe Naval Academy argues that its use of race in admissions is “narrowly tailored,” that it treats each “candidate as an individual,” that its use of race is a “nondeterminative factor,” that the process is “holistic,” that “race is not used as a negative” or part of a quota. As such, there is “no available, workable alternative.”\nKey Government Witnesses, Experts\nPrior to the beginning of the trial, each side hired expert witnesses, the identities of whom they disclosed to the opposing party. That’s standard practice in all trials, criminal and civil.\nHere, both sides were required to disclose to the opposing side the identities of all witnesses they might call to the stand well before the trial. Each side had the opportunity to depose the opposing side’s witnesses prior to the trial, including expert witnesses.\nThose deposition transcripts were not available to the public prior to the trial. Some witnesses prepared written statements prior to the trial. The experts prepared expert reports prior to the trial also. None of those statements or reports were made available to the public prior to the trial, so my summary of their testimony is based solely on what the witnesses said in open court at trial.\nAs such, my summary will be, by definition, an incomplete record of everything the witnesses provided the court and counsel.\nThe trial judge, based on comments he made from the bench, had clearly read the statements and reports, as he asked some witnesses specific questions that referenced their statements or reports.\nThe trial judge will have the benefit of having read all written materials admitted into evidence prior to crafting his opinion. Unless those statements and expert reports are uploaded into the online court records system (called PACER), the public will have no way of knowing what is contained in those documents.\nThe judge could, and likely will, quote from statements or expert witness reports in his judicial opinion.\nWith those caveats behind us, I will focus on a key witness for Students for Fair Admissions, Dakota Wood, who—in the interests of full disclosure—used to work at The Heritage Foundation. His testimony, in my opinion, crystalizes the issue at the heart of the lawsuit.\nLt. Col. Dakota Wood, USMC (Ret.)\nA 1985 graduate of the Naval Academy and retired Marine Corps lieutenant colonel, Wood served on active duty in the Corps for more than 20 years, served under the renowned military strategist and head of the Pentagon’s Office of Net Assessments Dr. Andrew Marshall, and several think tanks in Washington, including Heritage. Since he retired from the Corps, Wood published more than 85 articles and major reports on military readiness, operations, and related topics. He originated and edited 10 annual editions of the multiauthor volume The Heritage Foundation’s Index of U.S. Military Strength, the only nongovernmental annual assessment of U.S. military strength.\nIn his expert report to the court, Wood reached three main conclusions.\nFirst, that military readiness requires trust in leadership and a shared identity. Officers earn trust of the troops by exceeding objective standards and leading through example: “Any perception, accurate or not, that officers earned their commission or command due to preferential treatment undermines their authority.”\nSecond, the consideration of race in the admissions process at the U.S. Naval Academy “is not essential to military readiness or the legitimacy of the U.S. military.” Wood noted that there is “no evidence that statistical alignment between the racial demographics of the officer corps and the racial demographics of the enlisted ranks or broader society fosters cohesion and lethality, aids recruitment of top talent, increases retention, or bolsters the military’s domestic or international legitimacy.”\nThird, the academy’s use of racial preferences in admissions “imposes readiness costs without having any meaningful impact on the racial composition of the Navy or Marine Corps.”\nAt trial, Wood was asked two basic questions.\nFirst, what is combat or military force readiness? Wood testified that the primary purpose of military forces is to defeat enemy forces in battle. Their readiness to do that enables them to do that effectively. Wood identified certain factors that play into readiness, such as leadership, a disciplined force, which would include unit cohesion, and how well people work together as a team.\nTactical proficiency is crucial to achieve combat readiness, according to Wood. That includes realistic training and a focus on what needs to be done.\nCombat readiness includes the need for proper resources so that the force can accomplish the job.\nFinally, Woods identified manpower, which he called “capacity.” Are there enough people in our military, with the right equipment, who are properly trained and disciplined, who work together as a cohesive team, and are they led properly?\nThe second question was: Does racial diversity, or the racial composition of those forces, have any bearing on those factors? A related question was whether the racial composition between officer and enlisted have any bearing on those factors.\nWood opined that the racial composition or diversity of the force has no bearing at all on combat readiness. To support his conclusion, Wood made two points.\nFirst, there is no evidence, no statistical database, no metric, and no observable difference that he is aware of that the racial composition has any bearing on military readiness. For example, if you had a dozen Navy warships tied up to a pier at U.S. Naval Station Norfolk, if race mattered or had an impact, then you would see clear differences in the readiness of those ships corresponding to the diversity or racial composition of the crew of those ships.\nTo put a finer point on that hypothetical, if one ship had a crew of 80% black, and another ship had a crew of 8% black, and the racial composition mattered, then you would see a difference in engineering readiness, the number of awards a ship got (called “Battle E” awards) for the ship that had more minorities. There are no statistics or studies to show that such a difference exists.\nSecond, Wood noted that it would be impossible to maintain a race-based readiness regime based on personnel assignment policies in the Navy. Crew members, especially in leadership, are constantly rotating on and off ships, in shore units, or in Marine Corps battalions or squadrons. There is a constant churn of personnel in the fleet today.\nWood posed a rhetorical question: If you wanted to affect a certain percentage of racial composition, and you tied that percentage to a desired readiness level, how would you have to adjust personnel policy to maintain the desired racial proportions? From a practical perspective, it would be impossible to achieve the proportional representation that the government says is desired and necessary for national security.\nWhatever the magical ratio is, within the total force and between officer and enlisted, how would you achieve that and maintain it, such that all organizations have the same proportional representation? It is, according to Wood, impossible to achieve in personnel assignment policy. He noted the absence of data that shows any particular ratio is somehow related to a given level of readiness.\nThere is no data that supports the government position. The only thing they have, according to Wood, are assertions that are unprovable by facts.\nOne of Wood’s strongest points was the following: “[M]erit-based systems create a context that forces people to perform to standard. If they pass muster, their credibility cannot be legitimately denied … but equitable outcomes based on personal characteristics like race are wholly incompatible with that standard.”\nWood also noted that the military “reflects the order and priorities of an elected commander in chief, and active-duty military officers are duty-bound to implement them.” He noted, without irony, that “[Defense Department’s] conception of its asserted diversity interests has flip-flopped between administrations” and that some administrations forbid the use of race in admissions and others allowed it.\nThe use of race in admissions at the military service academies is thus not a national security imperative as much as it is a policy preference for certain administrations.\nDefense Expert Witnesses\nTwo witnesses for the government best capture the essence of their case. The first was the testimony of Vice Admiral John V. Fuller, the Navy’s three-star inspector general. The second defense witness was Stuart D. Gurrea, managing director at Secretariat Economists, an economic consulting firm.\nVice Admiral Fuller, USN\nFuller played football at the Naval Academy and graduated in 1987. A black man, Fuller has been on active duty since graduation, and during his 14 years of sea duty, including three tours at sea as a commanding officer, Fuller has had an impressive career. Fuller, who never served in combat, testified that life aboard Navy ships has changed in his long career, mainly because of the nature of operations and advanced technology.\nLike any loyal senior U.S. naval officer, Fuller agreed with the priorities of the current secretary of the Navy, including empowering people, cultivating talent and teamwork, and diversity, equity, and inclusion (DEI). As Wood testified, active-duty officers are required to adhere to the policy preferences of their civilian bosses.\nFuller testified that racial and ethnic diversity at the Naval Academy are important for three reasons. It contributes to unit cohesion; it helps with recruiting and retention; and it helps with “credibility at home and abroad.”\nFuller did not provide a full explanation for his three reasons during his testimony, except to say that the Naval Academy is “an insertion point” for officers in the Navy, and with respect to unit cohesion, having racial and ethnic diversity at the academy was like listening to a “professional orchestra playing” versus a high school band.\nThe analogy, without more support, didn’t work for me, and I suspect won’t do much to advance his argument with the court.\nFuller testified that “unit cohesion is the glue that keeps ships operating safely,” but never connected the dots between unit cohesion in the fleet or Corps and the need for the Naval Academy to use race in admissions.\nFuller also testified that “diversity of the officer corps increases performance” and that a “wide variety of viewpoints helps avoid groupthink,” suggesting by implication that different races have different viewpoints.\nHe did not point to any studies or data that supported either opinion in his oral testimony, and sources I spoke to in writing this piece told me that Fuller’s written statements admitted in court also did not cite any peer-reviewed studies or data to support those opinions.\nWith respect to Fuller’s opinion that using race in admissions helps recruitment at the Naval Academy, he testified that the presence of minorities at the academy allows recruits to “see themselves in that position.” Retention is affected also because minority midshipmen see classmates who “look like you” and who have the “same characteristics.”\nMinority parents of young men and women see minorities at the Naval Academy and minorities in the fleet and Corps who are SEALs, pilots, and admirals, which in turn, according to Fuller, adds credibility. Whether that is in fact true, or how that is true, Fuller did not try to explain during his testimony.\nFinally, Fuller stated that when U.S. naval ships dock in foreign ports of call, and sailors and Marines go ashore, our foreign hosts notice that “we look differently.” They are, according to Fuller, “ambassadors” for America.\nIt was, quite frankly, a simplistic and odd comment, which was not the least bit persuasive. Nor did Fuller even try to explain how the Naval Academy’s use of race in admissions somehow contributes to credibility abroad simply because some sailors and Marines, who happen to be minorities, go ashore at a port call.\nThe plaintiffs’ cross-examination of Fuller was brief, and focused on one topic, the answer to which undercut most of his own argument. The question was this: “You would never assume that anyone of a particular race shares the same perspective with each other?” Fuller replied, “That’s a very broad assumption.”\nPressing the point further, counsel asked, “You would not assume that a white man from Texas has the same perspective on the world or any other, for that matter, as a white man from New York City?” Fuller replied, “So that’s so broad. It depends on the subject.” Getting to the point, counsel pressed further and asked, “You would not assume a black man from New York shares the same perspective of a black man from Oregon, correct?”\nFuller, clearly realizing what was happening, answered, “Broadly speaking. I don’t know the topic. So, it could be on specifics. It could be; it could not be.”\nIt was the “gotcha” moment for the day in court.\nThe judge stepped in at that point and asked Fuller a few questions. The judge asked, “As I understand it, 40% of the flag officers, flag rank officers in the Navy, are U.S. Naval Academy graduates, correct?” Fuller agreed. The judge then asked how many flag officers in the Navy are people of color? Fuller said less than a dozen.\nAfter some back and forth, the judge opined, “It’s been difficult, I gather, to climb up through the ranks and still have diversity in the flag rank corps, correct?” After Fuller said yes, the judge then commented, “So, in short, in terms of the statistics we have here, there hasn’t been a lot of movement since World War II … and here we are, you know, 70 years later, and we might have 12 black admirals in the U.S. Navy out of 230. Not a lot of progress.”\nThis was a comment one would expect from an advocate, not from a judge, who is supposed to withhold judgment or opinion until the conclusion of the case.\nStuart Gurrea, Ph.D.\nGurrea testified for the government. A managing director at a consulting firm named Secretariat, he holds a bachelor’s, master’s and doctorate degrees in economics. He specializes in financial economics, industrial organizations, and econometrics. The purpose of his testimony was to analyze and criticize the expert testimony and report of professor Peter Arcidiacono, the plaintiffs’ expert witness.\nGurrea concluded that Arcidiacono’s expert opinion that the U.S. Naval Academy’s use of race in admissions was pervasive across the admissions process was misleading for six reasons. Gurrea said that Arcidiacono’s report was biased and likely overstated the use of race in admissions, that he relied on erroneous assumptions, that he arbitrarily blended race and ethnicity, that the small number of black applicants have little impact on white applicants, that the hypothesis of what the class would look like if race were not used in admissions is incomplete and misleading, and that the academy does not engage in racial balancing.\nPlaintiffs’ lawyer Adam Mortara cross-examined Gurrea quite effectively. Under a relentless line of questioning, Gurrea admitted that he testifies mainly for the government, that he has been paid over $500,000 to date in this case, that his associates have been paid for this case, but that he doesn’t know the actual amount the government has paid them.\nMortara established that Gurrea has testified as an expert on a host of subjects, including as an expert about economic analysis of the market for spent nuclear fuel rods, in a residential mortgage dispute, class damages in relation to improper property inspection fees, and the valuation of vested shares and fair market value of common stock, among other topics. Gurrea had to admit that he has never published a peer reviewed article in his field, unlike Arcidiacono. He admitted earlier on direct questioning that he never did work on college admissions.\nGurrea, who based his entire testimony on his analysis of Arcidiacono’s methodology (called a logit model with binary outcomes), admitted under cross- examination that he never testified about logit models with binary outcomes, that he never published in academic peer-reviewed literature about binary outcome logit models, and sheepishly acknowledged that the government could have hired David Card or Caroline Hoxby, the two government expert witnesses in the losing cases of Harvard and UNC against SFFA, but chose him instead.\nBy the end of the cross-examination, Gurrea’s testimony, at least to me, had little weight.\nMy Take\nThe government’s case was not persuasive. Fuller, who has had a distinguished career, did not make the case for the use of race or ethnicity in admissions at the academy during his testimony. His oral testimony was unconvincing and paled in comparison to the substantive arguments put forward by the plaintiffs’ witnesses.\nAlthough the trial itself focused on the U.S. Naval Academy, the named defendants include the Department of Defense. Thus, the opinion of the trial judge, depending on how it is written, could cover not only the U.S. Naval Academy, but all the military service academies.\nThe judge indicated that he would issue his opinion this fall. The losing side will have the opportunity to appeal. But there is a wrinkle.\nIf the judge rules for SFFA, and his opinion is written in a way that it covers all of the military service academies, the incoming Trump administration would have the option (which it will likely take) not to appeal the case. The effect would be that the military service academies would not be allowed to use race or ethnicity in admissions. A future administration would then likely be barred under preclusion doctrines from trying to reverse that decision.\nIf the judge rules for the government, then the Trump Justice Department will evaluate whether to switch its position and join SFFA in its appeal to the U.S. Court of Appeals for the 4th Circuit.",
  "word_count": 3653,
  "scraped_at": "2026-02-14T13:44:21.658902"
}