{
  "article_id": "88e04100d47f",
  "url": "https://www.examiner.com.au/story/8225831/top-leagues-haaland-of-the-free/",
  "title": "Reflections on English Premier League football season | The Examiner",
  "date": "20230612T010000Z",
  "domain": "examiner.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Frank Lampard and Steven Gerrard have firmly settled the argument that great players don't always make great managers, Erling Haaland has single-handedly ruined every Fantasy Premier League competition and to say Son Heung-min is a shadow of his former league-top-scoring self would be insulting to shadows.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe English Premier League has come to an end and there is as much excuse for reflection as Richarlison's latest tattoo.\nWhile it would be fun and immensely satisfying to delve into the new depths of ineptitude plunged by Chelsea, it is perhaps more apt to reflect on Manchester City being presented with the league title by the same organisation that is pursuing 115 charges of \"breaching financial rules\" to achieve this.\nAt least such shenanigans do not take place on the continent. Except in Italy where Juventus could rival a bad-tempered Nick Kyrgios for point deductions. Currently, the top five Google searches for Juve are: \"points\", \"points deduction\", \"points deduction appeal\", \"points deduction overturned\" and \"points back\" so it's fair to say this is an ongoing saga nowhere near its final resolution.\nMeanwhile, back in the Premier League and, surprisingly, allowing a team to claim a league and cup double while simultaneously prosecuting them for cheating is not the most hypocritical action of a season with more meaning than an Antonio Conte-Thomas Tuchel handshake.\nThat achievement would have to go to the intriguing case of Ivan Toney, who plays for HollyWood Bets-sponsored Brentford, funded by the profits of a company called SmartOdds, placed bets on Sky Bet Championship games and was prosecuted by the Football Association, once sponsored by Ladbrokes. The FA is reportedly nonplussed over what might have led Toney down such a dark path.\nAn honorary mention should also go to all levels of Australian government for getting ready to jump on the Sam Kerr bandwagon at the upcoming Women's World Cup despite chronic underfunding of the nation's most-played sport.\nBut enough of all this negative, unsavoury stuff and back to the domain of more innocent pastimes like time-wasting, sports-washing, VAR-bashing and referee-bating.\nManchester United's Antony and Liverpool's Darwin Nunez waged a season-long battle to be the most frustrating South American import striker; Newcastle's Joelinton went from misfiring forward donkey to prolific midfield powerhouse in a transformation of Optimus Prime proportions; while similarly-apt movie-related comparisons were drawn between the goal-scoring machine of Haaland and a certain Arnold Schwarzenegger character who promised to be back.\nWith the exception of early-season pace-setters turned late-season stumblers Arsenal, London sides provided the geographical anomaly of the league's Midlands as Spurs, Brentford, Fulham, Palace, Chelsea and West Ham finished in eighth, ninth, 10th, 11th, 12th and 14th respectively.\nEPL staples Everton didn't just flirt with relegation but invited it home, uncorked the wine and suggested the bedroom might be a bit more comfortable. But then, like a lazy student finally writing their assignment an hour before deadline, just got their homework in on time and still managed to pass their test.\nLeicester completed the EPL grand slam by neatly bookending the decade-long achievements of promotion (2014), championship (2016), FA Cup (2021) and Community Shield (2021) with relegation (2023) while big-game hunters Brighton became everybody's second-favourite team, apart from those of us for whom they are first-favourite.\nOn the music front, assorted terrace chants have started to make increasing use of Wings' Mull of Kintyre, Spandau Ballet's Gold, Dj Otzi's Hey Baby (Ooo, ahh) and, unforgivably, Achy Breaky Heart by Billy Ray Cyrus, while Notts Forest playing Just Can't Get Enough after every victory has to be applauded, and not just by us Depeche Mode tragics.\nNeil Diamond's Sweet Caroline has become the default celebration song of choice of late, however, this season has seen the emergence and eventual domination of GALA's Freed From Desire.\nBut back to Chelsea where owner Todd Boehly did little to revive public opinion of American leaders in the wake of Marsch (Leeds), Lasso (Richmond) and Trump (Washington) by splashing out £50m on a five-year contract for Brighton mastermind Graham Potter and sacking him seven months later.\nCombined with the ill-advised dismissal of Champions League-winning coach Tuchel while also spending more money than any other club in history, the Blues were rewarded with such returns as £62 million signing Mykhailo Mudryk's total of zero goals in 15 games.\nAt least Pierre-Emerick Aubameyang managed nine touches before being taken off at half-time against former side Arsenal, even if four of them were from kick-offs.\nAs The Guardian succinctly put it: \"The new owners have spent close to £600m to achieve Chelsea's lowest finish since 1996.\"\nMeanwhile the campaign finished with Ange Postecoglou becoming the first Australian to manage an EPL side - although Celtic's treble-winning tactician's impressive record of taking four different teams to victory in six different title races is unlikely to be extended as he is heading to perennial under-achievers Tottenham.",
  "word_count": 820,
  "scraped_at": "2026-02-14T12:45:58.214044"
}