{
  "article_id": "88eec83b3169",
  "url": "https://www.the42.ie/wsl-irish-2025-6489978-Sep2024/",
  "title": "The Irish stars set for the 2024 / 25 Women Super League season",
  "date": "20240918T181500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE WOMEN’S SUPER LEAGUE [WSL] returns this weekend, with a sizeable Irish contingent set for action.\nIn all, there are 15 Ireland internationals on the books of English top-flight teams. Not all of them will feature in the WSL this season, however, due to loan moves, injury and perhaps other factors.\nThe number of Irish players to feature has seesawed between 10 and 14 in recent seasons, and it is likely to do so again for the 2024/25 campaign.\nThe current crop of 15 are spread across eight of the 12 clubs, with newcomers Crystal Palace and West Ham United housing three a-piece. There are two each at Liverpool, Everton and Manchester City, while Arsenal, Aston Villa and Manchester United have a single Irish representative each.\nThe 24/25 season is officially here and the stakes have never been higher 🤩 pic.twitter.com/7eIM0G9zNB\n— Barclays Women's Super League (@BarclaysWSL) September 16, 2024\nKatie McCabe is the most recognisable of the bunch. Her Arsenal side welcome Man City to the Emirates Stadium in a glamour opener on Sunday, while five in-a-row champions Chelsea begin their title defence against Villa on Friday.\nThere are so many storylines to follow: Can Sonia Bompastor lead the Blues to more success post Emma Hayes? Who can stop them? How will the headline signings fare?\nBut first and foremost, the Irish audience will be interested in the Girls In Green. Here, The 42 looks at the WSL’s Irish contingent for the 2024/25 season.\nArsenal\nKatie McCabe\nAge: 28 (29 on Saturday) | Position: Defender/Winger\nThe Irish captain needs no introduction at this stage. McCabe is a world-class left-sided player and has been key for Arsenal in recent seasons. Jonas Eidevall’s side have been challengers of late but will be hoping to overcome inconsistencies and make a real splash in the league. To do so, the influence and versatility of their Dublin star — who was linked with a move to France this summer — will be needed once more.\nAston Villa\nAnna Patten\nAge: 25 | Position: Defender\nPatten has won six Ireland caps since declaring in April. She has established herself in Eileen Gleeson’s side, scoring her first goal in July’s monumental Euro qualifier win over France at Páirc Uí Chaoimh. Patten has been a solid defensive figure for Aston Villa since joining from Arsenal in 2022; composed in and out of possession and an aerial threat. They’ll hope to improve on a disappointing campaign.\nCrystal Palace\nHayley Nolan\nAge: 27 | Position: Defender\nNolan was instrumental as Palace won the Championship last season. Having joined from London City Lionesses, the Kildare native made her impact felt immediately. She played every single minute — just like the previous season — and Nolan now gets her chance at the top level. The centre-half will also be seeking more international opportunities.\nIzzy Atkinson\nAge: 23 | Position: Winger\nAtkinson joined Crystal Palace in the middle of last season, scoring two goals in 10 appearances as they secured promotion. Like McCabe, the Dubliner is a versatile, left-sided player and generally lines out at full-back or on the wing. She previously represented Shelbourne and Celtic and has won 15 senior caps since making her Ireland debut aged 16.\nAbbie Larkin\nAge: 19 | Position: Attacker\nLarkin also joined the Eagles last winter after a fleeting spell at Glasgow City. Like Atkinson, the teenager burst onto the scene at a young age, making her Irish senior debut at 16 and later becoming Ireland’s youngest player at a World Cup. Larkin starred here with Shelbourne and Shamrock Rovers, and will be targetting more consistency across the water as she continues to develop.\nEverton\nCourtney Brosnan\nAge: 28 | Position: Goalkeeper\nIreland’s number one signed a new deal with Everton this summer, having enjoyed an impressive individual campaign. Brosnan made the most saves (95) in the WSL last season, and securing her services once again was a big coup for the mid-table Toffees. Her rise, for club and country, has been striking in recent years.\nHeather Payne\nAge: 24 | Position: Defender/Winger\nAn Achilles injury saw Payne miss the end of last season and some Ireland games, but she is back fit and ready for another campaign. The Ballinasloe filer is another flexible player, perhaps most effective out wide. She has featured up top for Ireland in the past, but has generally been deployed as an attacking full-back for Everton.\nLiverpool\nNiamh Fahey\nAge: 36 | Position: Defender\nThe Irish centurion and Liverpool captain recently signed a new contract as she prepares for a seventh season on Merseyside. Fahey turns 37 next month, making her Ireland’s oldest player in the WSL by some distance. She has struggled with injury of late but remains pivotal on and off the pitch. Playing is the priority, though Fahey will also “explore opportunities to gain coaching experience” this season.\nLeanne Kiernan\nAge: 25 | Position: Attacker\nKiernan also put pen to paper on fresh terms earlier this month. The Cavan striker excelled when she first joined the Reds and top-scored in the Championship as they were promoted back to the WSL. Injury hell followed thereafter, but Kiernan showed glimpses of her best as she returned at the tail end of last season and for Ireland during the summer.\nManchester City\nTara O’Hanlon\nAge: 19 | Position: Defender/Winger\nThe Dublin teenager joined City on a three-and-a-half year deal from Peamount United in January and is branded a “developing defender” at the top WSL club. O’Hanlon suffered two serious hamstring setbacks in recent months and is yet to feature, but is on the comeback trail. An immediate breakthrough to a star-studded side will be tricky, but the left-sided star is one to keep a close eye on.\nEve O’Carroll\nAge: 17 | Position: Midfielder\nAnother young Irish women’s football that could be in for a huge career is Eve O’Carroll!🇮🇪\n— Rep of Ireland Player Tracker (@reptracker) September 10, 2024\nO’Carroll was born in England to parents from Derry and the 17 year old has also featured for Man City’s first team this pre season.\nA big future ahead for the Ireland u17 star!🌟 pic.twitter.com/WF4hUnobXJ\nThe Ireland U17 international also appears to have a bright future ahead of her. O’Carroll featured for the City first-team in pre-season, and is on the bench for their Champions League fixture tonight. How many first-team opportunities will arise, or might this rising Academy star remain predominantly in the youth ranks for now? O’Carroll is not listed in the women’s squad on the club website, but has really come on the radar this summer.\nManchester United\nAoife Mannion\nAge: 28 (29 next week) | Position: Defender\nMannion has impressed through her nine caps since declaring for Ireland before the World Cup. Her career has not been straightforward though; the combative defender has suffered a series of significant knee injuries. Mannion will be looking to put them behind her and establish herself in the United XI amidst a reboot for the club.\nWest Ham United\nMegan Walsh\nAge: 29 | Position: Goalkeeper\nWalsh has been a back-up goalkeeper since joining West Ham from Brighton & Hove Albion last year. Australia’s Mackenzie Arnold was first-choice until she departed for the NWSL, with new signing Kinga Szemik of Poland since taking the number one jersey. Walsh has drifted out of the Irish goalkeeper picture too, so will need more regular minutes going forward.\nJess Ziu\nAge: 22 | Position: Midfielder\nZiu was hit with another cruel blow this summer as she suffered a second ACL injury in as many years. The Dubliner had been in brilliant form for West Ham and Ireland after her earlier 13-month lay-off, but is now facing another lengthy spell on the sidelines after sustaining the dreaded knee injury again in a behind closed doors friendly last month. She underwent surgery last week, and is unlikely to feature this season.\nJessie Stapleton (on loan at Sunderland)\nAge: 19 | Position: Defender/Midfielder\nStapleton is similarly unlikely to appear in the WSL this season, but for different reason. She arrived at West Ham from Shelbourne last summer and spent the second half of the season on loan at Reading. She scored an important goal to help them retain their Championship status, and has returned to the second-tier on another loan deal with Sunderland for the 2024/25 campaign.\nOpening weekend WSL fixtures\nFriday\n- Chelsea v Aston Villa, Kingsmeadow, 7pm — BBC Two\nSaturday\n- Manchester United v West Ham United, Old Trafford, 12pm — Youtube\n- Brighton & Hove Albion v Everton, Broadfield Stadium, 12.30pm — Youtube\nSunday\n- Arsenal v Manchester City, Emirates Stadium, 12.30pm — Sky Sports\n- Liverpool v Leicester City, St Helen’s Stadium, 2pm — Youtube\n- Tottenham Hotspur v Crystal Palace, Brisbane Road, 2pm — Youtube.",
  "word_count": 1465,
  "scraped_at": "2026-02-14T12:22:55.519973"
}