{
  "article_id": "890323e3f244",
  "url": "https://alcalde.texasexes.org/2024/10/a-volleyball-legend-and-her-fellow-longhorns-are-going-pro-together/",
  "title": "A Volleyball Legend and Her Fellow Longhorns Are Going Pro Together",
  "date": "20241031T213000Z",
  "domain": "alcalde.texasexes.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A Volleyball Legend and Her Fellow Longhorns Are Going Pro Together\nThere's no \"i\" in volleyball.\nIt’s the ultimate team sport. Three different players touch the ball on (nearly) every point. Every player rotates through all six positions on the court. And win or lose, every point is followed by a group hug or huddle.\nOf course, there is still one way that a single player can impose her will and skill and power to become, essentially, the only person on the court. Serve an ace, and hers are the only hands that touch the ball. Do it several times, and both the server and her teammates end up in the zone, going on the sort of run that wins you championships. So it was on Dec. 17, 2023, for Asjia O’Neal, BS ’21, MEd ’22, when The University of Texas women’s volleyball team beat Nebraska for the NCAA title. The Horns were leading the match 1-0 but trailing in the second set 10-7 when O’Neal served four straight aces, kicking off a streak of 11 consecutive winning points that set the table for a 3-0 sweep, with the championship-clinching point coming on another O’Neal ace.\n“Four aces in that run and then one to end it—it definitely was an out-of-body experience,” O’Neal says. It was also a perfect echo of the Horns’ 2022 championship, which had ended on an ace from Keonilei Akana. O’Neal had dreamed of doing the same thing, but figured her winning moment might happen at the net, where UT fans had gotten used to seeing the ponytailed, 6-foot-3-inch middle blocker break the opposition’s spirit for five seasons.\nO’Neal left Austin with the UT program record for career blocks—601, overtaking U.S. Olympian Chiaka Ogbogu, BS ’17—and more than 900 career kills. Somewhere along the way she became known as the “Slide Queen,” for her particularly devastating work on that attack, with its burst of lateral movement, hitting off one foot, and almost flying through the air. Before O’Neal’s first season at UT, volleyball head coach Jerritt Elliott told her she wasn’t going to hit with both feet on the ground all season. That’s how you become royalty.\nAfter the 2022 title, O’Neal could have joined such friends and teammates as Logan Eggleston, BBA ’22, MEd ’24, Life Member; Zoe Fleck, ’22; and Saige Ka’aha’aina-Torres, ’22, in going pro. But having redshirted in 2018—and with the extra year of eligibility that every college athlete got because of COVID-19—she wasn’t ready to leave UT, Austin, or Elliott. It was her time to be the veteran leader on a younger, rebuilding team that was by no means certain to repeat. “Jerritt really challenged me to find myself and come into my own as leader,” O’Neal says. “To be more vocal, and really just take the team under my wing.”\nIt was, as ever, a group effort. Then-junior Madisen Skinner was named the most outstanding player in the Final Four, while setter Ella Swindell and libero Emma Halter also starred. But it was O’Neal’s team. She finished her time in burnt orange that night in Tampa with a golden paper crown upon her head, referencing her nickname. And as she continues her career during an ascendant time for women’s sports in general—and volleyball specifically—O’Neal may yet be queen of all she surveys.\nShe was the only college player on Team USA at the Volleyball Nations League (VNL) in the summer of 2023. Even as the Horns were still playing for that second NCAA title, she became the first overall pick in the first-ever draft of the Professional Volleyball Federation, one of two new circuits looking to elevate the sport in America at the professional level.\nO’Neal played nine matches for the Columbus Fury in 2024 before being called back to the national team in April. That meant another stint in the VNL, but she did not end up in Paris, postponing her dream of making the Olympics until Los Angeles 2028. “I still have to remind myself: First year out of college, [just] being in the running to make an Olympic roster is so cool and special,” she says.\nWith a bachelor’s in corporate communications and master’s in kinesiology, her plan is to eventually become a sports agent, for which she would also go to law school. She’s currently repped by Seven 1, an agency owned by her father, but is proactive about reading her own contracts and picking the brains of everyone on staff there.\nBut this summer still had a big twist in store. Instead of signing a new contract with Columbus, O’Neal is joining her friends Eggleston and Fleck, as well Ogbogu, in coming back to Austin, where the other professional start-up, League One Volleyball (LOVB) begins playing in early 2025. LOVB Austin has also added Ka’aha’aina-Torres; Ogbogu’s fellow 2012 NCAA champions Molly McCage, BS ’16, and Khat Bell, BS ’16; and Juliann Faucette, BS ’11, Life Member.\nTo that old refrain of, “Texas is a volleyball school,” we can now add, “Austin is a volleyball town.”\nThere’s one thing Asjia O’Neal would like to point out to volleyball fans. And, especially, to America’s volleyball TV directors.\n“I do also have a mom, for people who don’t know,” she quips of her mother, Mesha O’Neal. “And she’s always right there next to him.”\n“Him” being her father, Jermaine O’Neal. The longtime Indiana Pacers great played 19 seasons in the NBA, having begun his career with the Portland Trail Blazers straight out of high school—at the time, the youngest-ever player in the league. He was a six-time All-Star, and, oh yeah … one of the players at the center of 2004’s “Malice at the Palace” Pacers–Detroit Pistons brawl. The visual of “legendary NBA player turned doting volleyball dad” was just too much for the media to resist.\nBut, in fact, it was Mesha who was O’Neal’s primary “volley parent” when she began playing in the seventh and eighth grade in Southlake, Texas, running her to practice and club tournaments and hotels, and opening that first wave of recruiting letters, with Jermaine still playing basketball in other states. “My mom and I are best friends,” she says. “I call her, like, five times a day. So I do feel really bad they never acknowledge her during the games. She’s definitely the parent who’s always very encouraging and has kept me motivated and been the shoulder to lean on. My dad is the more aggressive parent who keeps me in check and tells me how it is. They do a great job balancing it out.”\nObviously, O’Neal inherited certain physical gifts from dad: speed, size, reach, and power. Elliott also raves about her “high volleyball IQ,” adding that, on a scale from zero to 100, she’d be in the high 90s for every possible required skill. But having a professional-athlete father also taught her that the talent’s not enough—discipline and hard work are involved. Everyone from Elliott to Eggleston to Columbus Fury coach Angel Perez mentions O’Neal’s intangibles before her serves or blocks or kills.\n“How she plays the game is contagious,” Perez says. “All the teams that I’ve seen her [on] play with that same aggressiveness and that same passion.”\nThat passion is hard-won and well-earned. O’Neal’s toughness was not just shaped on the volleyball court, but in cardiology offices and operating rooms. By comparison, volleyball is easy.\nO’Neal was born with a leaky mitral valve and had already had her chest cracked open for one surgery when she was 13. A non-athlete might have been able to just go on and live a normal life without repairing it. But not playing volleyball wasn’t an option then, and even less of one after her freshman year in Austin, which she endured while often struggling to complete higher-intensity training exercises that left her exhausted, out-of-breath, and baffled why she couldn’t do them.\nAll the possibilities of championships and other accomplishments were very far away for O’Neal in January 2020 as she was wheeled down a hallway at the Cleveland Clinic, flanked by her parents as well as Elliott and athletic trainer DeAnn Koehler.\n“It was very emotional, obviously,” Elliott says. “Putting somebody in a wheelchair, walking into [heart] surgery. It’s not something that you take lightly.”\n“That was so sweet because obviously they didn’t have to do that,” O’Neal says. “They could have just called me. And they were sitting out there for, what, eight hours with my parents? That really is just a testament to how committed everyone in that program is to us. I could have gone to Texas and been the worst player [Elliott has] ever coached in his whole entire life. His care for me and the way that he supported me wouldn’t have changed at all.”\nIndeed, the 24th-year coach wouldn’t have imagined not being there. He is close to both Jermaine and Mesha, and O’Neal considers him a second father figure. “Depending on what type of coach you are, you become an extension of the family if you’re doing it right,” Elliott says. “You’re trying to raise a young woman. You want them to succeed; you want them to fail; you want them to go through all the life skill sets.\n“And you don’t win all the time, so it’s the relationships that are so important. Asjia is super close to me, and she’s super important to me, and she’s somebody I will always have in my life.”\nAnd college is all about the friends you make for life, right?\nTwo months after winning that second championship at Texas, O’Neal already missed her former Texas teammates. Especially the ones who’d left Austin a year ahead of her. And especially Eggleston. The two women first met at a UT volleyball camp for high school players when Eggleston was 16 and O’Neal was 17 (both of them were already committed to the University).\n“I think instantly we were like, ‘Yeah, we’re going to be friends,’” O’Neal remembers, even though they were a class apart and not likely to be teammates for another season. But then Eggleston left high school a year early, and they were immediately inseparable: practice, weight room, lunch, classes, dorm. Even in 2023, they still talked constantly, both when Eggleston was in Turkey for her first pro season and as O’Neal and the Horns navigated the challenge of becoming repeat champions.\n“She’s someone I always can trust both on and off the court,” Eggleston says. “And I think our relationship off the court being so strong made it so much easier to play beside each other.”\nBy early 2024, Eggleston and Fleck (who was playing pro in Germany) had already committed to joining League One Volleyball in 2025. So even as O’Neal began her pro career in Ohio in February, there was an inkling that she might not be with the Fury and the PVF for long. Back then, she danced around the possibility: “Hopefully we’ll all be reunited at some point,” she said. “That’s definitely the goal for me. Down the road.”\nWith LOVB Austin, the road has risen to meet them, and it’s painted a familiar shade. Eggleston, Ogbogu, and 2016 Olympian Carli Lloyd (a Cal Berkeley alum) are the team’s founding athletes, but with O’Neal and five more Texas Exes taking up eight of 14 roster spots, it is truly a multi-generational, burnt-orange dream team. Imagine if we could have watched Ricky Williams, Roy Williams, Derrick Johnson, and Vince Young all play for the Cowboys or the Texans.\n“I knew I wanted to come back to Texas eventually,” O’Neal says. “I just didn’t know when or where specifically. [When] I had the opportunity to come back to Austin, I jumped on it.”\n“It’s something we never thought would happen,” Eggleston says. “When we graduated from Texas, at our last game, we were like, ‘Yeah, this is the last time we’ll probably get to play together, unless it’s Team USA.’ When the opportunity came up, it was a no-brainer.”\nNine of the 12 players from the 2024 U.S. Olympic team that won gold in Paris have signed with LOVB, which is no small thing. One goal of the league is to continue growing the sport at the youth level—LOVB’s roots, with more than 60 clubs around the country. But the other priority is keeping Americans at home instead of playing in European leagues. That means not only paying them competitively, but also having a high enough level of play to give its players the best chances of making or staying on the national team.\nAll of this is happening at a time when college volleyball is more popular than ever, with Texas a big part of that wave. Texas vs. Nebraska was the first NCAA championship game to be aired on ABC, rather than ESPN, and set a viewership record of 1.7 million, more than double 2022’s audience of 786,000—and in a Sunday afternoon time slot that also featured an NFL game between the Cowboys and the Bills. It was the sixth most-watched NCAA championship game of the year, behind FBS football, men’s and women’s basketball, and baseball/softball. That’s right: Texas is a volleyball school, Austin is a volleyball town, and America is a volleyball country.\nIt remains to be seen whether having two pro leagues will be a plus or minus. For now, it means more teams and more opportunities for players, and both leagues have some firepower (both financially and branding/celebrity-wise) behind them. In the long run, it may end up like women’s basketball, where the WNBA eventually prevailed over the ABL, which had started one year sooner. For now at least, LOVB is also a more veteran league than PVF, with each team limited to just one rookie out of college. (Paging Madisen Skinner: Got any plans for January 2025?)\nIn any case, O’Neal has no regrets about starting with the Fury. “It was just really fun to see that people are invested in women’s sports and [in] volleyball specifically, and that I got to be a part of the first year of the first-ever pro volleyball league in America—and be the first draft pick,” O’Neal says. “That’s something that’s going to be in the record books forever.”\nThe fact that LOVB Austin has so many Longhorns is about more than just the marketing opportunity that presents, and more than just the talent of those players. They’re not just getting the championship pedigree of The University of Texas, but the culture and caring and friendships of players who have been coming together to hug and cheer and celebrate after every point for years. It comes back to volleyball being the ultimate team sport.\n“In volleyball, chemistry is definitely required,” O’Neal says. “You really rely on the people around you to do their job, and to do it in a way that blends together seamlessly with each other. In other sports, I think you can have a bunch of really talented people, and the chemistry might not be there, but it still works out just because of the talent. In volleyball, you still need that community environment and a positive team culture.”\nCREDITS: From top, Matt Wright-Steel; Shutterstock; courtesy of Asjia O'Neal (4); Texas Athletics (2); courtesy of LOVB; Matt Wright-Steel",
  "word_count": 2542,
  "scraped_at": "2026-02-14T12:42:47.974466"
}