{
  "article_id": "890d4889507a",
  "url": "https://www.the42.ie/bohemians-fai-cup-final-feature-6845964-Oct2025/",
  "title": "  What Bohs have done for me and my son is unbelievable . This club means everything  ",
  "date": "20251019T114500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "“WHEN I TELL you if I don’t win this final, he won’t be my son any more, I don’t think,” Lisa Murphy says with a nod to eight-year-old Jackson.\nThe Bohemians defensive stalwart laughs, but is deadly serious too.\n“He told me that already. I can’t lose it.\n“I told him I’d go back and play in the FAI Cup final and that was always a dream. That’s been the dream for the last years I’ve been with Bohs.\n“Every heartbreak every year, he’d be like, ‘Mammy you’re not good enough.’\n“Let’s hope we go one step further this year.”\nJackson is his mother’s biggest fan, but harshest critic.\n“I think I have more pressure under Jackson than I do at Bohs! Alban (Hysa, manager) doesn’t give me as much pressure as my son does. I don’t want to let him down. More importantly, I don’t want to let Bohs down.”\nThe Phibsborough club means everything to Murphy.\nA prodigious talent who played for Stella Maris, Shelbourne, Shamrock Rovers and Kilkenny United back in the day, the 30-year-old stepped away from football when she fell pregnant with Jackson.\nMurphy got back playing locally with Kilmore Celtic as she balanced motherhood with her former day job as a butcher, before a nudge from an ex-Shels coach in 2021 ultimately launched the League of Ireland return with Bohemians.\nShe signed under her former Emerging Talent Programme manager Sean Byrne, who transformed her from a free-scoring forward to a no-nonsense defender during an injury crisis.\nAnd Jackson has been with her the whole way, from each and every training session to opening and closing Dalymount Park.\n“The child lives the dream,” Murphy grins.\n“What Bohs have done for me and my son is unbelievable. I can’t thank Bohs enough. It’s hard enough to have a baby but when I tell you they’ve reared him with me. Pat Fenlon on the pitch kicking a ball with my son when he took (the men’s team) over there last year for a bit.\n“These people are unbelievable to me and I can’t thank the club enough. Jackson idolises them. Jackson calls them his family and that will stick with him for the rest of his life.”\nHer passion and love for the club, and what it means to her and her family, is clearer with each and every word she utters.\nSo too, Jackson’s larger than life character.\n\"My Mam is a footballer, don't you know?\"\n— LOI Women (@LoiWomen) March 27, 2023\nLisa Murphy with her son Jackson Harvey, age 6, and Sarah Rowe#LOIW | @bfcdublin pic.twitter.com/QUuQzv5TLy\n“Everyone knows Jackson around Bohs. He rocks into Dalymount Park like he’s playing the match, not me. ‘Are you Jackson’s mammy?’ That’s what I get. Not, ‘Are you Lisa Murphy that plays on the team?’\n“He’s a legend around Bohs already, and let’s hope he can put on a Bohs shirt when he gets older. He’ll walk out with me on Sunday, and I think that will be the proudest moment being a mammy that I can give him. It will be electrifying.”\n“I couldn’t have done it without Bohs,” she adds. “When I tell you, I’ve had stages . . . my mam is very sick at the moment. They’re a great help.\n“Without Bohs, I would have never been able to play football. It’s as simple and plain as that. They accept him. Every manager that comes in, they accept him like he’s part of the furniture now. You’re told that Jackson’s part of the team as well.\n“This club means absolutely everything to me. More importantly, for what they have done for me and my son.”\nLike every football club across the world, it means so much to so many.\nTeenage midfielder Hannah Healy describes Bohemians as “such a community club”.\nTheir mission, stated on the club website, is to “use football as a force for good,” with their campaigning initiatives, which focus on social justice, inclusion, and environmental responsibility, well documented through the years.\nEstablished in and fan-owned since 1890, the women’s team was founded in 2009 and began competing in the Women’s Premier Division as recently as 2020.\nAlban Hysa’s up-and-coming side make their FAI Cup final debut this afternoon, seeking their first major senior silverware.\nRachael Kelly has been there for most of the journey. The captain and goalkeeper is one of three centurions on the women’s team, alongside Murphy who was the first, and Katie Lovely.\n“There’s real excitement. When you connect with the community, then they show up back,” says Kelly, with school visits — including to her own alma mater, St Francis in Coolock — and an U12 blitz for affiliate clubs adding to the buzz through the build-up.\n“You have a lot of people coming up to you just saying, ‘Best of luck’ and, ‘We’re rooting for you.’ You get into Phibsborough, it’s decorated with red and black, it’s quite special. You’ve got little girls now looking up to you, saying, ‘I want to be in a final.’”\nKelly is now aiming to emulate her granddad’s FAI Cup success: Jackie Kelly helped Shelbourne win the 1960 final against Cork Hibernians at Dalymount Park.\n“Football is in the family,” she smiles, the tradition carried through by her father, who played locally, and brother Mark, who represented St Kevin’s FC.\nKelly remembers being photographed with former Bohs striker Paddy Madden on a school visit many moons ago, and watching the Gypsies men’s team in the 2023 FAI Cup final at Aviva Stadium as a squad. Now it is their turn.\n“We’ve seen what it means to people and the club. It’s definitely special. I know a couple of the lads will be here to support us too, so it’s great to have that.”\nBohs have arguably been the best supported club in the Women’s Premier Division this season, and the hope is that carries over as they target a cup upset against Athlone Town at Tallaght Stadium this afternoon [KO 3pm, live on TG4].\nHistory on the line.\nA tilt at a first senior trophy for the club outright since 2009.\nWhat it would mean.\n“For us to win for a club that hasn’t won the cup on both sides for a long time, it would be amazing for the players and club,” Hysa says.\n“It would be a great legacy to be the team that won the first ever women’s cup for the club. That would push the next generation of players.”\nLike Jackson, and all the other young boys and girls watching on.",
  "word_count": 1095,
  "scraped_at": "2026-02-14T13:33:18.804151"
}