{
  "article_id": "8937decca5fd",
  "url": "https://www.cagesideseats.com/wwe/2024/12/3/24311107/wwe-nxt-results-live-blog-dec-3-2024-deadline-go-home-show-eric-bischoff-trick-williams",
  "title": "WWE NXT results , live blog ( Dec . 3 , 2024 ): Deadline go home show",
  "date": "20241204T041500Z",
  "domain": "cagesideseats.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Here’s a place to check results and comment along with the newest episode of WWE NXT, airing live on Tuesday night in the 8 pm ET time slot on CW.\nWWE NXT results, live blog (Dec. 3, 2024): Deadline go home show\nFollow along with this week’s episode, the final stop before the big Deadline event!\nAdvertised for tonight: It’s the last show for the brand before the Deadline premium live event scheduled for this coming Saturday night in Minneapolis.\nThat will include Eric Bischoff coming to town to chat with NXT Champion Trick Williams and his next challenger, Ridge Holland. Plus, two last chance Iron Survivor Challenge qualifiers, both Fatal 4-Way matches: Jaida Parker vs. Wren Sinclair vs. Cora Jade vs. Kelani Jordan and Eddy Thorpe vs. Lexis King vs. Axiom vs. Cedric Alexande, and a whole lot more!\nCome right back here at 8 pm ET when the NXT live blog kicks off once the show starts on CW. A running record of everything that happens will be below this line here.\nEnjoy the show!\nWWE NXT RESULTS AND LIVE BLOG FOR DEC. 3\nNo lyrics today, folks.\nJulia Serano (author of Whipping Girl among other excellent books about the transfeminine experience) has proposed a mass action today and I’m joining in here on the liveblog to the best of my ability— queer rights are under attack both here in the United States and worldwide and I stand with her and with so many other queer folks today to say LGBTQ+ People Are Not Going Back.\nMy life before coming out was dull gray dissociative misery day after day and now there’s color in my eyes and joy in my heart. I went from being a non-person, a stack of interests (among which professional wrestling is only one) keeping time as the walls closed in to being a whole person with a self-image and hopes and dreams.\nAnd now that I’ve wedged that door open I won’t let it close but we all have a responsibility to those in our community who haven’t been able to make that leap to keep the door open, by imploring the elected officials who are supposed to work for us to stand up for us and if they refuse to, to show them the door the next available opportunity.\nEven now, with things so dark and gloomy for us, there’s no doubt in my mind that it is worth it to be yourself, loud and proud, with no compromises. Our industry has more and more folks inside the ring and out who are out and proud and I believe in each and every one of us and I believe we will make it through this and out the other side.\nOn with the show!\nThe show opens up with commentary hyping up our last chance qualifying matches for tonight and getting us right into the action!\nCora Jade vs. Jaida Parker vs. Kelani Jordan vs. Wren Sinclair (Iron Survivor Challenge Last Chance Qualifying Match)\nChaotic early on, Jordan ends up the last woman standing in the ring and wipes Parker and Jade out with a tornillo! Back inside, diving crossbody on Jaida, she gets caught, Cora with a missile dropkick, cover for two! Sinclair looking for an easy win off a schoolboy, denied, Jade blasts her with a back elbow and a springboard stomp to Kelani! Parker cuts her off and sets her over Wren in the corner, double seated senton through both women and we go to break!\nBack from commercial, Tower of Doom, Sinclair making covers... NO DEAL! Parker big thrust spinebuster, Jade breaks it up! Cover of her own for a nearfall and she screams about it! Choking Jordan in the ropes, off the ropes, she sidesteps, catches a boot, reverse roundhouse lays Cora out! Wren with a butterfly suplex, guillotine choke on Jaida, Parker fights out with slaps and Falcon Arrows her... KELANI BREAKS IT UP!\nDuck a kick, land on her feet, big axe kick out of the corner from Jordan, frog splash, Cora breaks it up! Jade talking trash and shoving her, Kelani hauls off but an enzuigiri from Jade sends her to the floor! Small package for two, front kick, Cora putting something together but Jordan lands a handspring lariat!\nKelani up top, 450 splash but Jaida slams Wren into her to break it up! Parker puts her in the corner, Lola Vice shows up for a cheap shot and a brawl with Jaida, somehow Wren falls into a cover...\nWren Sinclair wins by pinfall with an unconscious lateral press on Cora Jade, qualifying for the women’s Iron Survivor Challenge.\nEddy Thorpe is interviewed backstage and says he has a fair chance tonight and he’s going to win Iron Survivor Challenge for him and his people.\nLexis King rolls up to tell him being a loose cannon won’t get him anywhere, Thorpe says he’s not listening to a grown man with daddy issues, King says he’s going to win and puts a hand on his shoulder, Eddy swats it off an storms off and Lexis says tonight is about the king.\nJaida Parker comes yelling out of the entry and demands they take the ropes down now so she can have an NXT Underground match against Lola Vice tonight!\nAnd so we go to break.\nBack from commercial, the ropes are getting taking off the ropes and Jaida Parker is holding a brick and screaming for Lola Vice to come down here and fight right now.\nEnter Ava Raine.\nShe says she’s happy to give her Lola but she’s not letting her have two matches in one night, so the match will happen at Deadline on Saturday!\nVice comes down and talks some trash as well.\nKarmen Petrovic is backstage with Dion Lennox and Brinley Reece.\nShe gets roses from Ashante “Thee” Adonis with an apology card and has a positive reaction to the whole deal. Weird.\nAnyway, we’re going to break.\nBack from commercial, Fraxiom are talking backstage.\nNathan Frazer is half catatonic staring at the TV, and when Axiom gets through to him he talks about the pressure he’s under. Axiom points out they’re under the same pressures, Nathan says of course and they’re gonna get it done.\nNXT Tag Team Championship #1 Contender’s Battle Royal\nChaos early on like every battle royal, crowd starting to thin a little bit, Yoshiki Inamura eliminates Luca Crusifino! Josh Briggs takes Tavion Heights out but then gets eliminated by Gallus! OTM working Channing “Stacks” Lorenzo over and they eliminate him with a huge biel to the floor as we go to break!\nBack from commercial, crowd dramatically thinned, Hank and Tank hanging in there, eliminating Tyriek Igwe! Hank Walker gets dumped and brawls with Igwe and Tyson Dupont and now Gallus is the only team left intact in the match! Desperate brawling, double slam on an OTM guy, Ledger dumped over the ropes but Walker saves his bud!\nCatapulting Myles Borne to the apron, he hangs in there, and they dump Wolfgang and Coffey follows soon after! Lucien Price, Tank Ledger, Myles Borne, your final three trading punches! Ledger a battering ram, fired up, working with Borne to put Price up top! Jockeying for position and Myles has it!\nNo Quarter Catch Crew win, becoming #1 contenders to the NXT Tag Team Championship.\nEric Bischoff is shown walking backstage, presumably fresh from selling some meat out of a truck, and we go to break.\nBack from commercial, Eric Bischoff makes his entrance and gets on the mic.\nHe says NXT is undeniable, and so is the fact that he’s always been on the cutting edge of professional wrestling. He created Nitro to go head-to-head with Raw, revolutionizing the industry, and the feeling was awesome. When he created the nWo and turned them loose on WCW, it revolutionized the industry and the feeling was awesome.\nAnd when he walked through the doors today, that same feeling was awesome. The revolution is happening here in NXT and we get to be part of it.\nHe introduces Ridge Holland and Trick Williams for this summit or whatever.\nHe talks about how Ridge reminds him of guys from his childhood like the Crusher and Dick the Bruiser. And Trick is like the evolution of the revolution, collegiate athlete with power, size, looks, and charisma. Seeing the two of them together, he can’t wait to see what develops.\nHolland says Williams is an insult to the idea of NXT and at Deadline he’s winning the title and when he does, he won’t have to listen to has-been podcast stars or to the crowd, because the future of NXT will be in his hands and when he squeezes it by the throat it’ll go wherever he says it goes.\nTrick says Ridge is built like a fridge and he destroyed Chase U just so he can chase him, but he’s not original. He sees Holland and he’s bland, he’s vanilla, he’s boring. And don’t let the flash fool you, because he’ll take the ice off and give him a cold ass-whooping right now. Ridge wishes he had what he has and he knows it.\nHolland says he doesn’t need what Trick has, and he’s proved what he’s about when he beat Williams in Philly. He has all this flash and the title on his shoulder and yeah, they came up different. Trick played football covered in pads while he destroyed everything in his path playing rugby, a man’s game.\nNo one’s ever told him this before because they get caught up in the aura but Ridge is looking him dead in the soul to tell him that he is soft. He’ll put Trick down and he’ll leave as champion.\nWilliams takes issue with being called soft and decks Ridge, grinding him down with mounted punches! Action to the floor, Holland throws him into the steel steps and then slams him into the announce desk!\nRidge stands by while medics bring a stretcher down for Trick and we go to break.\nBack from commercial, we get a recap of Trick being stretchered out of the arena and are informed that Ava Raine went with him in the ambulance and was unwilling to say whether this means anything for Deadline.\nKarmen Petrovic vs. Nikkita Lyons\nFeeling out, Petrovic up and over, Lyon slings her away and blasts her with a kick! Mounted punches, hip attack in the corner! Karmen with a boot up, an enzuigiri, schoolboy for two! Nikita with a short kick, cover for two, Petrovic with a lariat, kicks, Scorpion Kick, off the ropes, Sling Blade connects... NOPE!\nA little back and forth, Ashante “Thee” Adonis runs interference...\nKarmen Petrovic wins by pinfall with a kick.\nPost-match, Petrovic takes offense to his interference.\nShawn Spears is backstage with Niko Vance and Brooks Jensen.\nHe puts Niko over for his attack last week and tells Jensen they’re playing the long game.\nGigi Dolin and Tatum Paxley are walking and Spears stops them to tell Gigi he’s looking forward to her return match.\nThe girls walk off and Tatum says Shawn is creepy and acknowledges what her saying that means, and we go to break.\nBack from commercial, No Quarter Catch Crew are celebrating their victories.\nCharlie Dempsey puts Wren over for being lucky, she claims everything went to plan, and they commit to bringing the wins home on Saturday.\nGigi Dolin vs. Izzi Dame\nDolin with a snapmare to a reverse chinlock, we see Fatal Influence watching backstage, Gigi gets her down in the ropes, hesitation dropkick, cover for two! Shawn Spears is on the stage watching, Dame reverses a whip to the corner, back and forth, Dolin with a knee, lariats, roundhouse kick connects!\nShort-arm lariat, cover for two, reversed to a crucifix, only two! Izzi with a Hot Shot, but Gigi posts her in the corner! Cobra Twist...\nGigi Dolin wins by pinfall with the Gigi Driver.\nJe’Von Evans is interviewed backstage and he says he thinks Cedric Alexander is winning the last chance qualifier.\nX-Pac rolls up to put him over and say he’s a big fan and Evans geeks out for a moment. Waltman says he was the same age as Je’Von when he beat Razor Ramon and none of his career would have happened without that. He believes in him, Evans says that means a lot and goes to shake his hand but Sean insists on a Too Sweet.\nJe’Von says he’s gonna go crazy on Saturday.\nLexis King makes his entrance and we go to break.\nAxiom vs. Cedric Alexander vs. Eddy Thorpe vs. Lexis King (Iron Survivor Challenge Last Chance Qualifying Match)\n“All Ego” Ethan Page is on commentary for this one, Wes Lee is skulking in the eagle’s nest, and Je’Von Evans is watching in the crowd.\nThorpe and Alexander going hard, Cedric elbows him, of the ropes, drop down, leapfrog, big elbow from Eddy, Axiom breaks it up! Crucifix countered, Thorpe gets him up and King helps Axiom complete the crucifix driver! Leapfrog, roll through, Alexander passes him off the ropes and Lexis lands a tijeras on him before running the ropes and getting cut off by Axiom!\nNobody home, Thorpe throws Axiom into King, clotheslines him to the floor, Cedric picks his leg, schoolboys exchanged. Pass Alexander to the apron, a kick, springboard reverse STO, cover, Axiom steps off him to break it up and also dropkick Lexis back to the floor! Cedric and Axiom trading chops, everybody out to the floor, back inside and down and out and we go to break!\nBack from commercial, everybody jockeying for position in the corner... TOWER OF DOOM! King in the corner with strikes, O’Connor roll on Axiom and a northern lights into the bridge on Alexander, only a nearfall on both of ‘em! Lexis off the ropes, tope con giro connects!\nCedric with a moonsault, Axiom with a step-up tijeras, inside cradle, King kicks out! Knee lift, kick in the corner, up top with Thorpe, avalanche Spanish Fly... NOT ENOUGH! Right into a cross armbar on the break! Alexander breaks it up with a splash! Cedric out to the apron, neckbreaker drop on Eddy, boot to King, uppercut counters the springboard but he gets the Michinoku Driver only for Thorpe to break it up!\nHalf nelson suplex sends Eddy packing, Axiom with Golden Ratio on King... EDDY PULLS HIM OUT OF THE RING AND MAKES THE COVER HIMSELF! IT’S OVER!\nEddy Thorpe wins by pinfall with a lateral press on Lexis King, qualifying for the men’s Iron Survivor Challenge match.\nPost-match, Thorpe and Nathan Frazer jaw at each other while Axiom looks worried at his tag title belt.\nStevie Hunter and Robert Stone video chat with Ava Raine at the hospital and she says as of right now the title match is still on.\nRoxanne Perez is shown walking backstage to send us to break.\nBack from commercial, Cora Jade is whining at Stevie Hunter and Robert Stone.\nShe flounces off and Eddy Thorpe shows up to complain that Ava isn’t here and to say he’s gonna win Iron Survivor because nobody deserves it more than he does.\nRoxanne Perez makes her entrance and gets on the mic.\nShe says one lucky lady will be getting a giftwrapped title shot at Deadline but trust her, it’s not gonna be easy. That’s speaking from experience since she won the very first Iron Survivor Challenge. She knows exactly what it takes, and that’s why it’s so sad that they’re all fighting for second place since nobody beats the Prodigy.\nShe congratulates Wren Sinclair on qualifying because no one believed in her just like no one believed in her, and she could be the next Roxanne Perez except she can’t beat the Roxanne Perez of today. But then there’s Sol Ruca, and she was the first to qualify, always one Sol Snatcher away from victory, but nobody beats the Prodigy.\nIt was supposed to be Giulia, right? Again, nobody beats the Prodigy.\nEnter Sol Ruca, followed shortly after by Zaria, Stephanie Vaquer and Giulia.\nPerez says this is exactly what it’s about but they need to remember they have to get through each other before they get to her.\nOf course, a brawl breaks out (and Wren Sinclair appears from out of nowhere)\nReferees and security swarm to try and break it up.\nWe cut to the locker room where referee Darryl Sharma is calling for medical attention and we see Eddy Thorpe laid out unconscious on the floor.\nThat’s the show, folks.",
  "word_count": 2766,
  "scraped_at": "2026-02-14T13:02:50.715315"
}