{
  "article_id": "8941b98b6c2f",
  "url": "https://punchng.com/caf-reaffirms-morocco-as-host-of-wafcon-2026-rejects-postponement-talk/",
  "title": "CAF Confirms Morocco as Host for WAFCON 2026 Tournament",
  "date": "20260213T173000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Confederation of African Football has confirmed that Morocco remains the host nation for the 2026 Women’s Africa Cup of Nations.\nSpeaking after a CAF Executive Committee meeting in Dar es Salaam, CAF president, Dr. Patrice Motsepe addressed the rumors directly, stating, on Friday, that the tournament will take place on schedule from 17 March to 3 April 2026.\nAddressing rumours over the staging of the 16th edition of Africa’s women’s football competition, Motsepe said, “There is discussion taking place, and a lot of competitons. Morocco came to assist.\n“They were many countries that wanted to host it, but because we didn’t have time and our standards were very high. The WAFCON continues, as we speak now, we still have an engagement with Morocco.”\nMotsepe also stressed the importance of sticking to the agreed timeline. “We can’t change the date because it is part of the qualification pathway for the Women’s World Cup. WAFCON will continue and it will be successful”.\nPUNCH Online reports that the confusion over the host nation erupted after South Africa’s Deputy Minister of Sport, Arts and Culture, Peace Mabe, said the nation would step in for Morocco, citing stadium readiness and prior experience in hosting major events as justification.\nSouth Africa’s Sports Minister Gayton McKenzie clarified the situation, insisting that “no formal decision” had been made to replace Morocco and reaffirming that the North African country remained the official host.\nMcKenzie explained that South Africa’s offer to assist was a contingency plan, not a change in hosting rights. Any formal relocation would require CAF approval and government clearance.\nThe Morocco tournament will also play a role in the qualification process for the 2027 FIFA Women’s World Cup.\nThe 2026 WAFCON will be the third consecutive edition hosted by Morocco, following the 2022 and 2024 tournaments.",
  "word_count": 300,
  "scraped_at": "2026-02-14T12:37:53.503143"
}