{
  "article_id": "898bff0a92bb",
  "url": "https://timesofindia.indiatimes.com/world/us/if-it-happened-there-donald-trump-sends-central-troops-to-quell-protests-in-opposition-ruled-california/articleshow/121731375.cms",
  "title": "If It Happened There : Donald Trump sends central troops to quell protests in opposition - ruled California | World News",
  "date": "20250609T144500Z",
  "domain": "timesofindia.indiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- News\n- World News\n- US News\n- If It Happened There: Donald Trump sends central troops to quell protests in opposition-ruled California\nTrending\nMr Trump – known for strongman-like tendencies like Mr Putin and Mr Jinping – sent in over 2,000 National Guard troops, dressed like Stormtroopers, to quell a popular uprising sparked by workplace raids on labourers who Mr Trump’s officials claim are “illegals” working in America without papers. It was, as one expert put it, a prime example of authoritarian overreach that has become a feature of American autocracy since Mr Trump’s white nationalist Republican Party came to power in the last election.\nNote: The following piece is inspired by Joshua Keating’s If It Happened There, which uses tropes and tones typically employed by American media when reporting on events in other countries. The facts presented reflect the same level of exactitude and accuracy as that of American media outlets when covering foreign affairs.Los Angeles, Mexican for the city of angels, is home to Hollywood – America’s answer to Bollywood – and a city where starstruck aspirants come with the dream of being immortalised on the silver screen. Yet, the city, which falls under America-administered California, an opposition state which overwhelmingly voted for Mr Donald Trump’s rival from the Democratic Party, Ms Kamala Harris, soon came to resemble a warzone.Mr Trump – known for strongman-like tendencies like Mr Putin and Mr Jinping – sent in over 2,000 National Guard troops, dressed like Stormtroopers, to quell a popular uprising sparked by workplace raids on labourers who Mr Trump’s officials claim are “illegals” working in America without papers. It was, as one expert put it, a prime example of authoritarian overreach that has become a feature of American autocracy since Mr Trump’s white nationalist Republican Party came to power in the last election.The flashpoint began in LA’s Fashion District, where federal immigration agents—known locally as ICE—raided a garment factory, with similar operations in numerous surrounding areas.The raid at a Home Depot – a retail franchise with numerous outlets across the country – saw violent clashes between protesters, including unionists and local residents.\nProtesters take cover behind chairs near the Metropolitan Detention Center in downtown Los Angeles, Sunday, June 8, 2025, following last night's immigration raid protest. (AP Photo/Eric Thayer)\nEnd of Article\nFollow Us On Social Media",
  "word_count": 389,
  "scraped_at": "2026-02-14T12:35:27.800497"
}