{
  "article_id": "899f47eaed0f",
  "url": "https://www.thenationalnews.com/business/economy/2025/06/05/arab-economies-debt/",
  "title": "Arab debt explained : Why some Middle East countries keep borrowing at a high cost",
  "date": "20250605T061500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The debt pile in the Middle East and North Africa is growing. State borrowing, considered by many to be a necessity, has steadily increased over the past decade.\nCompounded with their increasing dependence on donor funding, some nations find their foreign policies, and even domestic measures, at the mercy of external actors, possibly at the cost of their own economic growth.\n“For countries like Jordan and Egypt, where aid makes up a substantial part of their budget, US aid is often tied to both political and strategic outcomes – i.e., human rights and their relations with Israel and Iran,” says Ryan Bohl, senior Mena analyst at New York-based intelligence firm Rane Network.\n“Aid from the US is often leveraged for these policy goals.\"\nThis includes Jordan and Egypt establishing ties with Israel at the behest of the US and the expectation that they take in a significant portion of Palestinian and Syrian refugees while their struggling economies bear the burden.\nJordan's decision in 1994 to sign a peace treaty with Israel came after President Bill Clinton's administration promised to forgive $700 million of Jordan's debt along with further relief from US allies. This was a \"key factor in the king's decision making\", according to the Washington Institute for Near East Policy in its 1999 analysis titled America and the Jordan Israel Peace Treaty, Five Years On.\nEgypt signed the Camp David Accords in 1978 and the Egypt-Israel Peace Treaty in 1979. The country became one of the largest recipients of US foreign aid from 1979 to 2003 with about $19 billion in military aid and about $30 billion in economic aid.\nThe US authorised the funds to Egypt \"to promote the economic stability and development of that country and to support the peace process in the Middle East\" according to the Office of the Law Revision Counsel United States Code.\nJordan, the world's second-most water scarce country, must also negotiate the use of its own water resources with the US and Israel as a result of agreements it signed in the 90s.\nJordan relies on US aid for about 3 per cent of its gross domestic product. This is significantly higher than most countries globally, whose reliance on international aid averages 1 per cent.\nAlthough countries in conflict are falling deeper into debt year by year, Lebanon, Sudan, Yemen and Egypt are knocking on the doors of international lenders asking for more financial assistance.\nWhy borrow?\nWhile debt is a popular tool for regional oil-exporting nations to fund their ambitious economic diversification drives and a primary source of financing for their multi-billion-dollar projects, it has a more existential dynamic for oil importers.\nSome countries in the Arab world, including Sudan, Yemen, Lebanon and Syria, are at a stage where they need external support for their economic survival, says Daniel Murray, deputy chief investment officer and global head of research at EFG International.\n“Such countries likely need some external assistance to help rebuild and give them a chance of achieving a degree of economic success in the future. This is not just about being able to issue debt, but it is also about a multitude of factors, including infrastructure, education, political stability and planning,” Mr Murray says.\n“It is unlikely that such countries can achieve economic success without external assistance.”\nCountries looking beyond survival are borrowing to climb out of deficit spending and poverty, and to raise long-term economic growth.\nIn April, the Egyptian government presented its 2025-26 national budget, which projected record spending and revenue, while relying heavily on continued borrowing and subsidy reductions to meet its commitments.\nThe budget forecasts a 23 per cent increase in public revenue, to 3.1 trillion Egyptian pounds ($60.6 billion). The budget aims to reduce the overall deficit to 7.3 per cent of GDP by June 2026. However, expenditure is projected to rise by 19.2 per cent to 4.6 trillion pounds, and the Arab world’s most populous nation plans to borrow an additional 3.6 trillion pounds during the fiscal year to cover costs.\nInterest payments on existing loans will account for 50 per cent of the country’s total expenses in the new fiscal year. The debt-to-GDP ratio will remain above 92 per cent, but Finance Minister Ahmed Kouchouk defended the borrowing plan at the floor of the house, saying it is “necessary to fund critical investments in health care, education and social protection”.\nHowever, Monica Malik, chief economist at Abu Dhabi Commercial Bank, says “reducing government debt will be critical to fiscal sustainability” of Egypt as debt servicing costs accounting for a significant portion of expenditure “limits wider spending” ability of Cairo.\nDebt levels\nTotal external debt in the Middle East and North Africa climbed to $443 billion in 2023, according to the World Bank’s Global Debt Report issued in December.\nThe region's external debt level was at its highest since at least 2013, the furthest year the World Bank data goes back to. Private creditors accounted for 40 per cent of the region's public and publicly guaranteed (PPG) debt at the end of 2023, compared to 36 per cent for multilateral institutions and 24 per cent for bilateral partners.\nEgypt and Morocco held the highest levels of external debt in the region at roughly $168 billion and $69.3 billion, respectively. Lebanon, whose debt-to-GDP ratio is projected to have hit 140 per cent at the end of 2024, held roughly $67 billion in total external debt in 2023, the vast majority of it coming from private creditors.\nJordan ($44.63 billion), Tunisia ($41.297 billion) and Iraq ($20.33 billion) were also among the highest holders of external debt in the region, according to the World Bank report.\nGlobally, low and middle-income nations spent a record $1.4 trillion on servicing their foreign debt, which was roughly a 23 per cent increase from 2020 levels, according to the World Bank data. Total external debt owed by all low and middle-income countries hit $8.8 trillion at the end of 2023, an 8 per cent increase since 2020.\nIn February this year, International Monetary Fund managing director Kristalina Georgieva said the fund had approved about $33 billion in financing for the region since early 2020, including its funding initiatives in 2024 to help curb the impact of conflicts in the region.\nA coalition of Middle East countries and multilateral institutions, including the IMF and the World Bank, in February agreed to establish an informal co-ordination group to provide financial support for the economic recovery of Middle East countries devastated by conflict – with a focus on Syria.\nPrice to pay\nAid-dependent Jordan is a prime example of a sovereign that has borrowed heavily over past decades at its own domestic expense.\nThe country has taken in Syrian refugees in crisis since the civil war broke out in the neighbouring Arab republic. It has also about 2.39 million registered refugees from Palestine with the US asking Jordan and Egypt to take in more. For example in January, President Donald Trump said they will agree to take Palestinians from Gaza.\n\"They will do it. They are going to do it, OK?\", he said at the time, although both Egypt and Jordan rejected the idea.\nIt is a major recipient of foreign financial assistance, as well as aid from the US and loan packages from the IMF to support its economy.\nThe Trump administration's move to cut US aid for Jordan broke a longstanding agreement between the two sides, leaving Jordan's economy suddenly in the lurch and in need of a financial shot in the arm from either its rich oil-exporting peers in the region or lenders such as the World Bank and IMF. Jordan has received $4 billion from the US since 2021 and it was the third-largest beneficiary of US Aid globally until the fund tap was shut.\nThe US and the 28-member EU economic bloc are among the major donors to some of the most distressed economies in the Middle East.\nIn comparison to the US, Mr Bohl says, European assistance tends to be “less strategically stringent”, as it is focused more on outcomes of programmes rather than specific, broad strategic goals, without pushing sovereigns to strengthen or weaken their ties with other nations in the region to advance the donor's foreign policy goals, he adds.\nSome Gulf countries are also becoming involved, with their own objectives. They're looking to these economies in need for investment opportunities. Regional countries periodically receive help from their richer oil-exporting peers in the form of financial assistance and central bank deposits to reduce stress on their foreign currency reserves.\nThis was the case with Syria in May, when it was announced that Saudi Arabia and Qatar paid off Damascus's $15.5 million debt to the World Bank, giving the war-torn country a clean slate for economic recovery.\nThe move could also give Riyadh and Doha a diplomatic foothold in the Arab state, with access to future reconstruction and energy contracts as Syria seeks to rebuild.\nDebt trap?\nAlthough some Mena oil importers remain economically vulnerable to the political whims of donors, and not one country has broken free from year-on-year borrowing, they continue to ask for more.\nLebanon, Jordan, Yemen and others who borrowed over the years to support their economies do not have a visible exit in sight, instead their debt levels have ballooned to the point where they have to borrow more to pay the loans secured earlier.\nEach cycle of borrowing comes with a different set of market conditions, interest rates and are costlier than the debt raised before, so the cycle is perpetuating.\nsenior Mena analyst, Rane Network\nThe financial support packages from multilateral lenders such as the IMF are “technocratic in nature and are typically hinged on economic performance and structural reforms rather than political or strategic outcomes”, Mr Bohl says.\nBut not many counties in the Middle East have successfully managed to the implement those social, economic, fiscal and structural reforms despite successive support packages, analysts say.\nLebanon is a notable example. Under attack from Israel and facing decades of political instability, the country needs recurrent financing to keep its economy afloat.\nThe Lebanese economy went into a tailspin in 2019 when the government defaulted on its Eurobond payments. The financial crisis that followed saw the Lebanese currency losing most of its value and its banking system verging on a complete collapse. The Covid-19 pandemic has exacerbated the country's economic crisis to historic proportions and the recent conflict with Israel has pushed it to the limits.\nIn April 2022, Lebanon reached a staff-level agreement with the International Monetary Fund on a comprehensive economic reform programme supported by a 46-month extended fund facility, proposing access to about $3 billion. However, Lebanese authorities have been accused of dragging their feet on the required reforms.\nThe 2019 economic collapse was blamed on decades of financial mismanagement and corruption by Lebanon's ruling elite, including the former central bank governor Riad Salameh, who has been accused of helping to embezzle hundreds of millions of dollars from the central bank.\n“Many of these countries are in debt traps of their own making, with their political elites choosing subsidies, generous public sector wages, etc, to maintain power … while other countries like Lebanon have functioned with a shadow economy that has benefit only the elites,” says Mr Bohl.\n“It's very hard for the IMF, US, or Europe to force a country to take a loan they don't want – let alone don't need.”\nIs borrowing a broken system?\nThe goal of lending is to get a country to a point where it can engage in global markets in a way that creates a cycle of increasing prosperity.\nWhile Mena countries in economic turmoil have struggled to pay off their loans and reach that state, some countries in South-East Asia, Latin America, and Africa have found success.\n\"It's hard to believe that South Korea, 40 years ago was essentially a developing country,\" said David Bach, president of the IMD Business School for Management and Leadership in Lausanne. Thailand and Vietnam are other examples, as is Georgia, which faced its own particular challenges, he added.\n\"They used to have endemic corruption, a weak economy, and then with its own policies but also external support, it has progressively improved.\"\nYet some NGOs say that the conditions for loans by the IMF and World Bank hinder development and exacerbate inequality by preventing social reform.\n\"Ninety-four per cent of countries (94 out of 100 countries) with current World Bank and IMF loans have cut vital investments in public education, health and social protection over the past two years,\" according to 2024 report by Oxfam and Development Finance International.\n\"I think it's really easy to point the finger at the IMF in particular and say in fact, it's taking advantage of countries that have gotten themselves into a challenging situation,\" says Mr Bach, adding that there's no better alternative.\n\"With all its flaws, the market system has lifted more people out of poverty than anything else we've come up with,\" he added.\nNot a worrying level yet\nAlthough financial needs in the Mena region are sizeable, the level of overall debt is not worryingly high, particularly in the six-member Gulf Co-operation Council , when compared to the global debt level for which policymakers have already started ringing the alarm bells.\nGlobal debt increased by nearly $7 trillion in 2024, reaching $318 trillion – the highest year-end figure on record. Total debt in emerging markets increased by $4.5 trillion in 2024, reaching an all-time high of over 245 per cent of GDP, according to the Institute of International Finance data.\n“We do not anticipate major debt strains in the near term, many emerging markets have experienced a marked deterioration in their debt-carrying capacity in recent years, as the growth differential between emerging markets and mature economies has become less pronounced and government interest expenses continue to rise,” IIF executives including Emre Tiftik, director of sustainability research, global policy initiatives, said in a joint report.\nIn emerging markets of the broader Europe, Middle East and Africa region that includes the GCC, Egypt and Israel, sovereign borrowings will remain close to the peak at about $624 billion, according to S&P data.\nThe IMF total gross public financing needs for Mena emerging markets and low-income countries are projected to reach $268.2 billion in 2025 –the equivalent of above 100 per cent of aggregate fiscal revenues, up from $260.6 billion in 2024.\nMena sovereigns are likely to meet their financing needs by $235.9 billion in domestic and $32.3 billion in external debt issuance in 2025, the IMF said in its Mena outlook report.\nMr Murray of EFG International says the steady increase in Mena debt-to-GDP ratio over the past decade has been in line with the trend elsewhere in the world, partly because global interest rates have been very low, also because governments during the Covid crisis borrowed heavily to support their economies.\nFor Mena region as a whole the debt-to-GDP ratio has increased from a little over 20 per cent in the past decade to a bit under 50 per cent at present.\n“Whilst this is a large increase, it compares favourably with other parts of the world,” he says. This is especially in comparison to US debt-to-GDP that has increased from slightly more than 70 per cent to nearly 120 per cent over the same time period, he adds.",
  "word_count": 2564,
  "scraped_at": "2026-02-14T12:35:52.220181"
}