{
  "article_id": "89a1f62fb597",
  "url": "https://www.perthnow.com.au/lifestyle/stm/21-years-of-stm-a-look-back-at-21-stories-from-21-covers-with-wa-faces--c-20291980",
  "title": "21 years of STM : A look back at 21 stories from 21 covers with WA faces",
  "date": "20251123T003000Z",
  "domain": "perthnow.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "21 years of STM: A look back at 21 stories from 21 covers with WA faces\nEmma Booth (2008, 2012, 2017)\nLife looks very different for Emma Booth since gracing her first STM cover in 2008, looking every bit the Hollywood glamazon as she channelled Marilyn Monroe with bouncy blonde hair and red lips.\nThen, her world was just beginning to shift — she took home an AACTA Award and international representation off the back of the 2007 indie film Clubland.\nThese days, things run at a slower pace, and she’s embracing all the quirks that come with that.\nBooth is in her baking era, for one, and makes a mean sourdough. A swim at her closest watering hole may now result in an alligator encounter — such is life in her new base of Florida in the US with husband Dominick Joseph Luna.\nWhat hasn’t changed, though, is her love of Western Australia, particularly the sandy beaches and winding roads of the South West where she grew up. Back in WA for a short visit, the model-turned-actor and artist was feeling nostalgic about the projects that drew her from home and catapulted her onto sets in the US, UK and even Romania to star alongside Henry Cavill and Michael Fassbender in Blood Creek. “I was doing little Australian films so it was kind of strange to go straight to Hollywood,” Booth, who has appeared on STM’s cover three times, says.“I’ve worked with a lot of big name actors who are genuinely really lovely people … I’ve been honestly very, very fortunate that people have been compassionate and kind and giving — most of the time.”\nBut it was for the gritty Aussie project Hounds Of Love — Perth director Ben Young’s feature directorial debut that followed the lives of a murderous couple John and Evelyn as they hold a young woman captive — that she’s most proud of. It earned her an AACTA for best actress in 2017.\nFor the film, which shot in Perth, Fremantle, Belmont, East Perth, Claremont and Coolbellup, Booth put on weight, wore a wig and dark contact lenses, and even fake teeth. Despite spending chapters of her life as an international model, scouted at age 13 and strutting international catwalks in London, Paris and Milan, Booth isn’t afraid to physically transform and mentally sink her teeth into a meaty part.\n“It’s such a horrific and horrendous story, but it’s actually a really important cause and topic that we were broaching … people were all affected in various different ways by that film, I still get letters,” she says.\n- Jade Jurewicz\nMelanie Greensmith (2022)\nMelanie Greensmith opened the doors to her first Wheels & Dollbaby boutique on Perth’s Hay Street in 1986. The brand’s rockabilly aesthetic went on to become an international success, attracting the attention of big names, including Michael Jackson, Kate Moss and Bob Dylan. Greensmith took the brand to new heights throughout the 90s and Noughties, expanding into retail giants Harvey Nichols and Harrods as the Perth-born brand became a pillar in the fashion zeitgeist.\nWhen STM launched in 2004, Greensmith says it was a “busy time” for both the brand and the local fashion industry.\n“We had our store on King Street, and one in Sydney. It was fun in Perth because we had the Perth Fashion Festival — it was a different era,” she says.\nIn 2017, Greensmith sent shockwaves through the fashion industry by unexpectedly shuttering Wheels & Dollbaby out of a desire to “see life without running a company for a minute”.\n“I built the business really since I was a kid. I didn’t go to business college or university; I had just built it and built it. There was a big change happening and I could feel it,” she says.\nShe lived life freely with her rock star husband Mark McEntee for a few years and managed to dodge the nightmare of running a brand during a global pandemic.\nBut then she got the itch to return — and what better way to announce the comeback than with an exclusive STM cover story featuring model and frequent muse Simone Holtznagel in 2022.\n“I was inspired to make people feel some luxury and glamour after the awful times we have been living through,” Greensmith told STM at the time.\nToday, Wheels & Dollbaby remains in operation, manufacturing here in Western Australia and shipping out orders across the world.\nOn what life looks like today, Greensmith says McEntree and herself split their time between their Cottesloe property and farm in Casuarina, as well as jetting to Los Angeles to catch up with friends often.\nGrateful to continue her passion for designing, Greensmith is about to release a new summer collection, which includes a collaboration with Dita Von Teese for another rendition of their famous, now-collectable, cardigans.\n“(For this new collection) I’ve taken inspiration from the 2000s. I got all my archives out because that’s what the fan girls in America want,” she reveals.\n- Megan French\nNina Kennedy (2021, 2024)\nNina Kennedy never felt so ready.\nReady to embrace the hype that comes with hunting down an Olympic gold medal.\nReady to give herself the emotional clearance required to vault into Australian sporting immortality.\nHer growth in mindset is there to see in glorious colour on two STM covers, three years apart.\nThe first ran on June 20, 2021 and Kennedy is pictured striding out on a beach, her athletic frame splitting the headline Going For Gold.\nThe postponed Tokyo Olympics that followed just a month later produced a chaos cluster: a minor COVID-19 scare forced her out of the Games village and into hotel isolation and an injury led to elimination from the women’s pole vault in the qualifying round.\nThe second, on May 26, 2024, unveiled an athlete at a very different point of her journey.\nShe was already a world champion — controversially shared by mutual agreement with American Katie Moon in 2023 in Budapest — and not only wanted a gold medal at the looming Paris Games. She demanded it.\nThe cover image required no explanation: draped in a gold sequin dress and wearing a confident, if not defiant glance upwards, probably to Zeus, the Olympic god representing sky, thunder and law. The headline said it all anyway: Golden Girl: Nina Kennedy knows winning a gold medal at the Paris Olympics will take everything she’s got. She’s never felt so ready.\n“I remember doing that shoot before Paris. They put me in that gold sequin dress, because I’m gonna win gold. That was the story I was going for,” Kennedy says.\n“If that happened in 2021, I wouldn’t feel comfortable with that, but before Paris, I’d been so open with the media about this is what I’m doing. It’s gold or nothing for me.\n“There was that story with Katie (Moon) and I wasn’t going to share again. So I had to be open that I was going to win it and I didn’t feel pressure from the media. It was more on myself. I really want to do it. So then we got to Paris and it happened.”\nKennedy won the gold medal with a jump of 4.90m, while Moon and Canada’s Alysha Newman tied with 4.85m, taking silver and bronze respectively.\nThe victory made her the first Australian woman to win an Olympic gold medal in a field event, inspiring a new generation of vaulters, high, long and triple jumpers, shot-put, discus, hammer and javelin throwers.\nBut it was anything but an easy process.\nKennedy was the favourite entering the Olympic final on the back of a dominant year in the Diamond League despite dealing with a stress fracture in her back for the third consecutive year, that reduced her to jumping once per week on a modified training program.\nShe woke up on the day of the final with a belly full of nerves, that disappeared as soon as she entered the arena to her choice of song, John Denver’s Take Me Home, Country Roads. She would be singing it again later that night, in a bar, surrounded by family and friends.\n“It was the most nervous I had ever been in my whole life, that whole day leading up. I couldn’t eat,” she says.\n“But as soon as I arrived at the track, I was so calm because I knew exactly what I had to do.\n“I could control what I knew how to control, which was jump high bars really well, because I had practised it for 15 years.\n“I felt more calm on the runway going for that gold medal than I did any moment before that because I felt like I had nailed my routine. I could have gone out and competed at Paris with my eyes closed, because I was so prepared.\n“I’d rehearsed that moment jumping 4.90 in my mind like hundreds of times before. So when it was actually happening, it was like I knew what to do.”\nTiming is everything and the clock turned against her again this year. Kennedy had surgery to fix a hamstring injury, recovered, and then damaged the same muscle in a different area and was forced out of a world championship defence six weeks out.\n“I was almost there and literally at the last minute, I strained a muscle in my leg, so it was heartbreaking,” she says.\n“But at the same time, I did everything I can, the team did everything it could. We’re really proud of that. And look, maybe it was meant to happen. It’s definitely put a fire in me to go out there for the next three years going into LA and just win everything I can.”\nLos Angeles and then, surely not Brisbane in 2032?\n“Maybe. Maybe not,” she says.\n“Katie’s 34 right now, and she’s still winning. So look, who knows? Seven years is such a long time away. My sights are set on LA and we’ll see what happens after that.”\n- Glen Quartermain\nJustin Langer (2005, 2014)\nFamily. Faith. And a scrap.\nJustin Langer’s raison d’être.\nAll three were woven into a masterful feature written by award-winning The Sunday Times journalist Billy Rule for STM’s November 23, 2014 edition.\nA photo of the former Test opener holding a chain of rosary beads ran on the magazine’s cover under the headline Keeping Faith: Justin Langer on Rites, Whites and Inspiration.\n“I reckon after that article ran I got sent 100 pairs of rosary beads from people around Australia,” Langer says.\n“I love rosary beads. I learnt how to meditate in 1993 and there’s a tradition where you hold the rosary beads and with each breath, you go one more bead, and by the end, that’s your meditation cycle.\n“Sometimes it takes a degree of courage to talk about your faith in the world we live in. Faith is important to me, so I’m very happy to talk about it.\n“(Former Australian world champion boxer) Kostya Tszyu, he was a great hero of mine who I learnt a lot from and he used to always walk around with worry beads in his hand.\n“I’ve always been the same with rosary beads.\n“I’m not actually sure what drew me to them. My nana, my mum used them when I was a little boy and maybe that was my introduction to the rosary beads.”\nFamily is everything to Langer.\nAn earlier STM feature that ran on March 13, 2005 featured a photo of the Test batsman on the cover sitting in a hammock with his three daughters — Jessica, Ali-Rose and Sophie.\n“That picture still sits on my desk. I’ve got four daughters now. Gracie wouldn’t have been born then,” he reflects.\n“It was a magical time, 2005. I’m a couple of years off retiring from Test cricket, I’ve got a beautiful little family, and that’s what you do it for, right?\n“Actually what you’re doing it for, you do it for your own personal pride and ego, but ultimately, then it becomes about your family.\n“That brings back great memories, and now they’re all grown up, of course, but that time was a beautiful time.”\nLanger says he tells a story about one of his grandparents at “every corporate speaking gig I do”.\nHis grandfather, Harold Langer, a tough former boxer, was the inspiration for his first book, Seeing The Sunrise.\n“It was a lesson from my grandfather, Harold, who helped me to overcome my fear of heights,” Langer says.\n“He took me to a construction site of this building in East Perth early in the morning when I was about 15 years old. He got me to the top. I was petrified.\n“You know how they say, when you get seasick, you look at the horizon. He got me up the top, and I’m now vomiting and feeling like I’m going to fall over the edge, but there was a sunrise and I had to look up at it and it was beautiful.\n“So he said ‘I’ve taught you a lesson in life, always look to where you want to go, not to where you don’t want to go.”\nLanger played 105 Test matches for Australia between 1993 and 2007, scoring 7696 runs and 23 centuries.\nAfter his dream of wearing the baggy green cap was granted in 1993 he had to scrap for his career. Between 1993 and 2001 he played 41 Tests but was regularly dropped.\n“I miss it so much,” he says, of facing fearsome fast bowlers with the new ball.\nAs a Test opener. As coach of the West Australian team when it was at rock-bottom.\nAs a director on the West Coast Eagles and Mineral Resources boards in recent times. All scraps.\n“I honestly think you learn most when you’re under pressure. You learn a lot about other people when you’re under pressure, but much more important, you learn about yourself,” he says.\n“Unless I put myself under pressure, I’m not going to keep learning about stuff. I’m not learning about myself.\n“When I took over WA … I remember an early training session when the comment was made they’d never trained this hard. And I said, this is about six out of 10. You wait ‘til we start training hard.\n“Coaching Australia, that was a scrap. That was hard work.\n“The West Coast Eagles board of the last few years, you know you’re in the fight. And then the Min Res board, over the last 12 months, you’re in the fight. And that’s good. The more times you fight, the better you get at it.”\nLanger now divides his time as a commentator with Channel 7, including for The Ashes series which started last week (November 19), columnist with The West Australian and coach of Indian Premier League team Lucknow Super Giants and London Spirit in The Hundred.\n“Three years post coaching Australia, I was earning a lot less money, and I was probably 300 times happier,” he says.\n- Glen Quartermain\nRita Saffioti (2017, 2023)\nThe day before this STM shoot, Rita Saffioti spent her Sunday at the opening of the Byford rail extension — one of the last stages of the Metronet project, almost a decade in the making.\nAfter spending a couple of hours posing and chatting, while keeping a weather eye on her emails, a car whisked the Deputy Premier, Treasurer and Transport Minister away to her next engagement. Such is the busy life of one of the State’s most powerful politicians.\nWhen STM first featured Saffioti in 2017, she was photographed at the Roleystone orchard where she grew up, with her three children (Grace, then seven, and twins, Lucia and Alessandro, five). She’d just been sworn into Mark McGowan’s new ministry, which swept into power in a landslide victory, and put in charge of transport, including its flagship rail network expansion.\nThe story, by Connie Clarke, told of Saffioti’s childhood working in the sheds on the farm, of her interest in politics from an early age, and her close family ties; when she moved to Canberra aged 20, to work at the Department of Finance, she unpacked to discover her mother, Giuseppina, had put 12 bottles of homemade passata into her boxes.\nIt also detailed Saffioti’s roller-coaster first term in Parliament, which coincided with Grace’s birth; she inadvertently sparked debate when she asked to take her five-week-old daughter into the chamber if she needed to be fed during a vote, and MPs in the Coalition government threatened to call “stranger in the house”.\nIt was a bruising time. But six years later, when Saffioti featured on the cover again, she was more accustomed to the rough and tumble of politics. This time, she had just been elevated to deputy premier in Roger Cook’s government, shortly after the shock resignation of her long-time friend and colleague, McGowan.\nThe deputy’s role has been “really positive”, Saffioti says, but she admits to being challenged by being Treasurer, even with her experience working with former treasurers.\n“I always thought the role was a tough one … but just the insatiable, incredible demand and all the behind-the-scenes work in the treasury portfolio is probably something I underestimated,” Saffioti says.\nNevertheless, Saffioti nominates the bringing down of two budgets, while extremely stressful, as career highlights, along with the opening of new rail lines and train stations. Although the cost of the Metronet project has ballooned, last week Saffioti announced the last piece of the puzzle, the new Midland station, will open in February.\n“The bigger the challenge, the greater the highlight when you deliver something,” she says.\n“The most rewarding part of my job is when you go out and meet people who are enjoying some of the projects that you’ve delivered. I’ve been fortunate to be the transport minister that started Metronet, and to be the transport minister that’s finishing the projects. That’s very rare in politics.\n“You were there for the planning, and you remember every meeting, every discussion about every intersection, the style of delivery, the look of the stations. And then with something like the elevated rail in Victoria Park and Cannington, where there were a lot of sceptics, to go out and see the thousands of people walking through a new 7km-long park … it gives you a great sense of satisfaction.”\nBut homework waits for no one, not even the deputy premier. Grace is now 15 and in Year 10 at school; Lucia and Alessandro are 13 and in Year 8.\n“It continues to be a balance, in particular when homework starts to get serious,” Saffioti says. “Honestly, some of the stuff they’re doing, I can’t remember doing anything that difficult.\n“It’s a challenging time, especially when you have three children within a close age bracket and what one finds easy, another one finds more difficult, and vice versa.\n“When you’re mentally exhausted from the day, turning your sights to coming in and making sure each kid gets the attention they need to thrive, sometimes it’s hard. But I also know that these are the years that are very, very important, so I really try and make sure I have the headspace to help them, because they deserve it.”\n- Katherine Fleming\nKim Scott (2024)\nIt’s no surprise that Kim Scott — academic, author, winner of two Miles Franklin awards — is a considered conversationalist.\nBut on the day of STM’s shoot, he is also letting his T-shirt do some of the talking. Emblazoned on his chest is the avian symbol of the Wirlomin Noongar Language and Stories Project — a group Scott founded, which works to retell and preserve the words and tales of the Noongar people.\nReclaiming First Nations stories, language and cultural connection have long been at the heart of Scott’s life and work.\nLast year, he featured on the cover of STM as part of his role judging the First Nations Storytelling Prize of The Best Australian Yarn short story competition. It also marked the 25th anniversary of his 1999 novel, Benang: From The Heart, for which he became the first Indigenous author to win the Miles Franklin Literary Award (he won it a second time for That Deadman Dance in 2010).\nFremantle Press reissued Benang as a special edition, as part of the celebrations.\nThe 2012 Western Australian of the Year, State Cultural Treasure, member of the WA Writers Hall of Fame and professor of writing at Curtin University says the continued interest in the book is “gratifying”.\n“Such is my vintage that we’re coming around on 20 and 25-year anniversaries,” Scott chuckles. “The world has changed in that time in some ways, and maybe not in others.”\nScott’s books often involve long conversations with Elders and extensive reading through colonial records; in the 2024 story, he explained that Benang was, in large part, “a response to the archives, the language of our shared history and the weirdness of it”.\n“I was in the archives reading AO Neville’s book … the local history is all talking about the ‘last full-blood Aborigine’ and ‘the first white man born’,” Scott remembered.\n“There was no place for me in those stories … As I was writing Benang, I kept a personal photo of family embracing one another, rather than being separated by colour. You realise the stories that are being told are destructive to who I am and who I want to be, so then you have got to expose the threadbare nature (of those) and rebuild other stories.”\nScott has three books out in recent weeks, including Rivers Flow: Reflections On The Songs Of Archie Roach and Ruby Hunter through Fremantle Press, for which he curated contributions from 23 Indigenous writers nationwide with editor Casey Mulder.\nAnd through UWA Publishing, Scott and the Wirlomin team have released two more bilingual picture books, including Ngalak Yongka Miyak Koorliny, the story of a sacred site where, imprinted in granite, is the shape of a resting kangaroo.\nThere are eight books in total, inspired by creation stories as told to the American linguist Gerhardt Laves in Albany around 1931 and returned to the Noongar people by his family after his death in the 1980s. They are then workshopped into books through consultation with elders, artists and linguists and proceeds return to the project, to be ploughed back into its work.\nScott spends about half his time in Albany, where the project has also seen him become involved in a program in the local prison, which aims to reconnect Indigenous inmates with their language and culture.\n“One of the guys that comes in with me, he spent years inside himself, and he’s got two sons that are there,” Scott says. “It’s a sad situation but there is a lot of love, strangely enough — a lot of love.\n“You go through the cells and you’ve got to wear your security beepers, clinking doors, locks all around you. But being able to run a program that people can get something out of, that lets them reconnect with that old heritage, it opens other possibilities.\n“People position themselves differently as individuals. They ask, how come I’m here? What are the opportunities for healing and connection? You don’t say it like that, but that’s what’s going on.\n“We show them pictures and footage of some of us going on country, to where these stories and songs are connected. The fellas will say, ‘that’s my country, and I want to go there as soon as I get out’. Just hearing people express the desire is great, but the next thing would be to actually help make that happen.”\nWhile in Albany, Scott is also working on major drone shows for Albany’s bicentennial next year, where the choreographed lights will be used to tell Indigenous creation stories from the region. Scott also wrote the 2023 First Lights: Binalup drone show, in conjunction with Fremantle Biennale, which depicted the story of Mammang Koort; the beating whale heart, through rhythmic light above the shoreline.\nScott also wrote and narrated the awe-inspiring Boorna Waanginy: The Trees Speak in Kings Park, as part of Perth Festival.\n- Katherine Fleming\nKav Temperley (2013)\nOne would assume a lot has changed for Kav Temperley — and it has, but it hasn’t. He’s still living in Fremantle, still playing gigs, and he’s about to hit the road again with Eskimo Joe for a special 20 years of Black Fingernails, Red Wine tour.\nAs the frontman and bassist of the ARIA Award-winning trio, Temperley has spent decades at the heart of one of Australia’s most beloved rock bands. Yet despite the fame and longevity, he says the journey has always been about steady, hard-earned growth.\n“It was always these very gradual increments,” he reflects.\n“We weren’t like an overnight band. We were slowly chipping away at it. By the time we were in our mid to late 20s and releasing Black Fingernails, Red Wine, we’d built up a fan base.”\nThat fan base has remained fiercely loyal and this is not something Temperley takes for granted.\n“If you do anything in entertainment or music, you kind of think you’re lucky to last a year or two … so I feel extremely grateful because we’ve got generations of people who have gotten into our band,” he says.\nTemperley is equally proud of what Eskimo Joe’s success helped inspire at home.\n“When Eskies first started, it was pretty outlandish to think you could live in Fremantle and have a career,” he says.\n“But now Fremantle has become this hub where bands like Tame Impala and San Cisco can live and make music. I feel like we had a hand in making that viable.”\nThese days, Temperley runs his own Fremantle studio, producing and composing for other artists including Joan & The Giants, Ella E, Kiara Eve, and Sash Seabourne.\nThe respected songwriter lectures at the Western Australian Academy of Performing Arts and Collarts, as well as being immersed in Artsix, a collaborative project with his wife that brings together musicians, visual artists and technologists to create what they call “dynamic art”.\n“It’s an amazing cross-pollination where art, music and technology come together,” he says.\nThrough it all, his passion for music and his hometown remain constant.\n“Every time we get on stage, we say, ‘we are Eskimo Joe from Fremantle, Western Australia,’” he smiles.\n“And everyone goes, ‘whoa’.”\n- Megan French\nTasma Walton (2008, 2025)\n“I was so excited to see Tasma,” divulged a Blue Heelers fan on set during the STM group shoot, who once upon a Noughties rushed home from school to watch the beloved Australian crime series.\nConstable Deirdre “Dash” McKinley, played by Tasma Walton, was always her favourite.\nIt was through this role of the all-knowing and cheeky Dash that Walton became a household name, snapped up the 1997 Logie for Best New Talent and ignited a successful career in television.\nOn screen, Walton traded Mount Thomas for Summer Bay, but it was her off-screen love story that captured just as many hearts — her romance with fellow West Aussie and popular comedian, Rove McManus.\nThe pair swapped Perth’s winter for a warm beachside ceremony in Broome in 2009, and welcomed their daughter Ruby four years later.\nIn the years since, Walton hasn’t slowed down. She’s appeared in an impressive line-up of Australian series, including City Homicide, Rake, The Twelve, Mystery Road and recently Reckless — shot in her home State.\nThen, swapping bustling sets for isolated hotel rooms, Walton turned her hand to writing her debut novel, I Am Nannertgarrook.\nAppearing on STM’s cover in April (and with longer locks in 2008), Walton shared the emotional and powerful story behind the book — a deeply personal tale inspired by one of her ancestors — and what finally pushed her to sit down and commemorate her in writing.\nIn the months since, the book was a joint-winner of the 2025 ARA Historical Novel Prize and was shortlisted for the Mark & Evette Moran Nib Literary Award.\n“It’s always lovely to get that acknowledgement, especially when it’s a challenging story with so many threads of love and family and a difficult part of our history to explore,” Walton says.\nWhen the time is right, Walton says there will be another book. But for now, she’s back where she feels most at home — on set with friends and community.\n- Jade Jurewicz\nTim Winton (2022)\nAs Tim Winton reflects on the recent release of his 31st book, Ningaloo: Australia’s Wildest Wonder, he ponders the privileged position he finds himself in: being able to make a living since he was a teenager “just from writing literary fiction”.\n“Not everybody gets to be an old person having worked all their life in bare feet and shorts, where you’re essentially your own boss,” he jokes.\nWinton looks back at his working-class background with fondness, saying his parents “couldn’t imagine” he could live the life he has been able to create.\n“Most people have to work a job they don’t enjoy, with people they don’t like, where four weeks of the year they get to do what they really want. So on the days when I’m feeling blue and grumbly I remind myself that my whole adult life, I’ve done exactly what I dreamt of doing since I was a 10-year-old kid telling the world I was going to be a writer,” he admits.\nThe notoriously private author — one of WA’s most celebrated and decorated writers — has spent 25 years being notoriously outspoken in one aspect … studying, defending and advocating for the State’s UNESCO World Heritage-listed Ningaloo.\nThis place of extraordinary biodiversity holds a special place in Winton’s heart and continues to inspire his belief in the importance of fostering environmental responsibility in children.\nFollowing Winton’s three-part ABC docuseries, Ningaloo Nyinggulu, which drew international attention to the area, he says a children’s picture book is the “logical extension” to engage the younger generation. It marks Winton’s first picture book in more than 20 years, and the first non-fiction picture book for children to be made about Ningaloo.\n“Fostering an ethic of stewardship, care and responsibility for the world’s natural places is important,” the four-time Miles Franklin Award winner says.\n“Ningaloo is one part of the world where you can have interactions with mega fauna in the space of one day that you can’t anywhere else in the world: whale sharks, dugongs, whales, sharks, turtles. It’s amazing.”\nThe literary landscape has shifted and reshaped itself many times over the course of Winton’s 40-year career, yet today, he seems more grateful than ever to call himself an Aussie.\n“We’re lucky in Australia that we have a good education system and readers. I wouldn’t be thinking the same way if I was an American at the moment,” he says.\n“Australians are still open, they’re still pretty cosmopolitan, they’re educated, they’re curious, and that’s what’s kept people like me in business. I like to think that people in my trade have also kept the culture alive to sustain that.”\nFor Winton, the legacy he hopes to leave behind inevitably returns to the same place — his enduring passion for the natural world.\n“I’d hope to be a good ancestor; to have been a good steward, and to leave something that helps those who come after us defend their home,” he says.\n- Megan French\nCraig Silvey (2020)\nCraig Silvey was a young writer living in Fremantle when he first appeared in the pages of STM two decades ago.\nHe was celebrating the release of his debut novel Rhubarb, published by Fremantle Press in 2004, hitting shelves.\nToday, he’s one of Australia’s most celebrated storytellers with titles like Jasper Jones, Honeybee and Runt cementing his place in the country’s literary landscape.\n“Externally, things have changed a great deal,” he says. “But I still feel the same sense of excitement and fear. I’m very blessed to have a loyal and generous readership who have kept me buoyant and inspired for over 20 years.”\nThat enduring relationship with readers is what continues to fuel him.\n“Storytelling is intrinsic to me,” he reflects, after a special shoot with STM alongside his literary peer Tim Winton.\n“If I wasn’t a (published) writer, I’d still be writing — it’s how I’ve always made sense of the world.”\nSilvey’s breakout novel Jasper Jones, which charts the story of 14-year-old Charlie Bucktin in 1960s WA, marked a turning point in his career.\n“I starved until that book,” he admits.\n“It established me as a writer of some repute and allowed me to devote myself full-time to writing. There’s a before and after to that book.”\nMore recently, Silvey’s children’s novel Runt captured hearts across generations. “For Runt, I knew I wanted to invite younger readers into that story, but without displacing readers of all ages,” he explains. “There’s no less sophistication or thematic interrogation in these books — I give every book everything I have.”\nThat devotion has extended beyond the page, with Silvey adapting his work for film and television.\n“When you embark upon a film, you’re asking hundreds of people to invest their lives into a story that’s emerged from you,” he says.\n“To emerge with a film that we can all be proud of — one that was ecstatically received — was very fulfilling.”\nDespite the accolades, his process remains grounded and familiar.\n“I still sit at the same desk,” he says. “I still feel as much excitement and intimidation, dread and thrill when I look at a blank page as I ever did.”\nUltimately, Silvey remains driven by the same quiet mission he had when STM first met him: to write stories that help people see themselves — and each other — more clearly.\n“When a reader lends a book the authority of their imagination and their history, they make it their own,” he says. “That’s the power of books: they create a very private world.”\n- Megan French\nIsla Fisher (2005, 2008, 2021, 2025)\nWhen Isla Fisher is dolled up in designer gear, and running in Hollywood’s most exclusive circles, it can be hard to imagine she was once an awkward teen navigating her formative years in Perth.But then she cracks a joke — often at her own expense — and her self-deprecating Aussie charm, quick wit and brazen sense of humour shine through; it’s a reminder that she’s true blue at heart.\nIn the years since graduating from Methodist Ladies’ College, and her early days on Home And Away, Fisher has won over audiences in Confessions Of A Shopaholic, Wedding Crashers, Now You See Me and Hot Rod.\nDespite the career accomplishments, the role she is most proud of is playing mum to Olive, Elula and Montgomery with her then husband Sacha Baron Cohen.\nIn her 2021 interview with STM, Fisher said: “Although motherhood is my favourite topic, I tend not to discuss it publicly. I feel like I want my kids, like all parents do, to live a normal life. All parents are just trying to protect their kids. And I feel like if they wanted to be in the public eye that’s up to them.”\nThe actor has been an STM favourite, gracing the cover four times, the latest in April 2025 where she spoke to Ben O’Shea — post split with Baron Cohen — about her latest project Dog Man.\nMegan Gale (2004, 2005, 2008, 2012, 2013, 2014, 2019)\nWhen Perth-born beauty Megan Gale won a modelling competition at the ripe age of 18, little did she know at the time it would set in train a long-lasting and successful career.\nRising to international fame because of an Italian TV commercial filmed in Sydney in 1999, Gale hit the ground running and hasn’t stopped since, establishing a diverse career as a model, actress, designer, television personality and brand ambassador.\nShe’s graced the covers of endless magazines — including STM, many times — appeared in major feature films, conquered runways and fronted global campaigns, but what is the multifaceted woman doing now?\nThe mum of two, aged 50, balances professional pursuits with family life. She recently reunited with long-time collaborator David Jones as brand ambassador, which saw her strut the runway last month for the launch of the department stores’ rewards program with Qantas.\nThe iconic comeback made national headlines and she described her chic return to the runway as a “truly epic experience” on Instagram.\nGale’s success helped cement Perth as an unlikely but powerful force in the modelling world. The city that produced Gale has also launched global names including Jessica Gomes, Gemma Ward, Nicole Trunfio and Bridget Malcolm.\nHugh Jackman (2004, 2008, 2009, 2011, 2024)\nThere have been many iterations of Hugh Jackman flashing his megawatt grin — or throwing a smoulder — on the cover since his first back in 2004.\nLong-haired Jackman, “ripped, rugged and revved-up” Jackman, and more than a few leather moments too.\nFast-forward to 2024 and his latest cover saw him in a fitted black tee, the results of training for Deadpool & Wolverine on full display, as the then 55-year-old opened up about reprising the iconic superhero role.\nPhysically, the WAAPA graduate has barely changed across the decades, minus hair-length and a few extra life lines on his face. But on-screen Jackman has covered just about every genre imaginable.\nFrom his soaring vocals in Les Miserables and Broadway’s The Boy From Oz, to superhero stardom in X-Men, rom-com heart-throb in Kate & Leopold, and the crowd-pleasing The Greatest Showman — not to mention roles in Australia and The Prestige.\nLately, though, it’s his personal life making global headlines, from his separation from wife of 27 years Deborra-Lee Furness to his new relationship with actor and singer Sutton Foster.\nStill, Jackman remains one of Australia’s most beloved exports, standing proudly alongside fellow icons that have also graced STM’s cover including Perth-raised Sam Worthington and the late, great Heath Ledger.\nKerry Stokes (2008)\nKerry Stokes is a household name in Western Australia — billionaire businessman, media tycoon, passionate philanthropist.\nBut in this STM interview in 2008, Colleen Egan got to know the self-made man behind the public profile, and his incredible rags-to-riches story.\nBorn in Melbourne in 1940 to a poverty-stricken single mother, he was given the name Kerry Stokes when he was adopted by Matt and Irene Stokes as a small child.\nThe couple were devout Catholics, and decent people, Stokes remembered, to the point where they gave away most of their money to various church causes, leaving nothing for the family.\nStokes was a bright child but struggled in the classroom (he would be diagnosed decades later with dyslexia) and at age 14, left school to go to work.\nHe had many jobs, including in a radio factory, a wool store, driving trucks and at a mechanic workshop. But times were still tough; he spent some time living on the streets and aged 19, with nothing to keep him in Melbourne, he moved to Perth.\nIt was here in WA that Stokes found his feet and built his fortune, becoming one of Australia’s most successful businessmen.\nHe worked tirelessly in various jobs, including installing TV antennas and as a property salesman, and made astute investments, including in developing shopping centres with business partners Kevin Merifield and Jack Bendat. Over the years, his diverse interests have included property, construction, mining and resources, energy and pastoral holdings.\nStokes made his first foray into media when he invested in the development of the regional GWN network. Gradually, he acquired more stations, taking a significant stake in Seven in 1995.\nAnd in 2008, the reason he agreed to the in-depth interview with STM — his first in almost a decade — was that Stokes wanted investors in WA Newspapers, owner of The West Australian, to vote to give him a seat on the board.\nFive months later, he was appointed and by the end of the year, he was chairman. That year, Stokes was also awarded Australia’s highest honour, the Companion in the General Division in the Order of Australia (AC).\nWhen West Australian Newspapers acquired Seven Media Group in 2011, forming Seven West Media, Stokes remained chair; he will step back next year when a merger with Southern Cross Media is finalised.\nOutside business, Stokes is known for his extensive art collection, passion for military history, including acquiring and donating medals to the Australian War Memorial, and leadership of the Telethon charity, which has raised more than $778 million for WA children.\nJohn Worsfold (2009)\nSTM’s pages have held the personal stories of many top athletes, including Dockers’ captain Alex Pearce talking about mental health in 2023 and former Eagle Brad Sheppard in 2022, speaking about his push for better concussion protection for players after his medically-mandated retirement.\nBut in 2009, when Walkley Award-winning writer Billy Rule was granted a rare private audience with then West Coast coach John Worsfold for this cover story, it came at a physical cost.\nAs Rule recounted, after three months of negotiations with the club, “Woosha” agree to an interview — during a 6am, 10km run on a clear, dark winter morning.\nAfter two years as an assistant coach at Carlton, in 2002 Worsfold had returned home to Perth, and to the Eagles, with a brief to right the ship after two shaky seasons.\nHe was the man for the job. A driven athlete who played AFL while also completing a pharmaceutical degree. A former club captain, who led his teammates to two premiership flags. A respected leader with dignity and integrity.\nBut despite a premiership in 2006, by the time Worsfold re-signed for two more years in 2009, there was intense scrutiny and public debate about whether he was still the right choice.\nBut as Rule discovered, Worsfold still had formidable drive. As the writer’s fingers grew numb and icy air filled his lungs, Worsfold belted along Oceanic Drive, barely out of breath. Later, he learned the footballer had always been a runner, and each gallop was also an escape. A chance to clear the head of whatever was bothering him.\nAnd there had been plenty for Worsfold to deal with. In the story, he opened up about his attempts to help star player Ben Cousins battle a drug addiction, and the devastating early morning phone call in 2007, when he was told close friend and former teammate Chris Mainwaring had died. His leadership qualities again came to the fore, as he gathered their mates at his house to support each other.\n“We were just shattered,” one of those present told Rule. “A lot of us didn’t know what to do and then a phone call and a text went around from Woosh, saying come over. Once again, he was the leader, making sure everyone was OK.”\nAsked where that propensity to take charge came from, Worsfold shrugged.\n“I really don’t know,” he said, almost apologetically. “Nothing I can put my finger on. My wife asks the same thing. Doing that bit extra and doing it right has just always seemed normal to me.”\nWorsfold retired from West Coast at the end of 2013 but returned to coaching in 2016, joining Essendon in its darkest hour when he replaced James Hird just as 34 past and present players were suspended for a year after the doping scandal.\nAfter finishing at the Bombers in 2020, he worked in the corporate world before rejoining West Coast last year, as its head of football across the AFL, AFLW and WAFL.\nMarite Norris and Violet Maslin (2024)\nIt’s likely it’s Violet Maslin’s wide toothy smile that first grabs you when looking at STM’s 2024 Mother’s Day cover.A cheeky grin so reminiscent of her gorgeous sister Evie from images that are etched into the memories and hearts of West Australians. The second thing that strikes you is the love in her mum, Marite Norris’, eyes. She took part in the exclusive shoot and recounted a story that powerfully articulated her deepest feelings about grief, love and hope after losing her children Mo, 12, Evie, 10, Otis, eight, and their grandfather Nick when the Malaysian Airlines flight MH17 they were aboard was shot down over eastern Ukraine.\n“I hope that my journey can be one that finds joy in honouring those who’ve passed, which essentially is something that chooses to honour humanity itself, in all its crazy splendidness,” Norris said in the 2024 feature story.\n”If this choice is strength, then I guess that strength is something that defines me. It’s also the strength of my kids and dad, holding me up with their golden ropes.” Norris generously shared how The Art Space, and precious daughter Violet, brought colour back into her life after an unimaginable tragedy, an account that earned the writer Jade Jurewicz a WA Media Award.\nDaniel Ricciardo (2010, 2012, 2023)\nWhen Daniel Ricciardo first appeared on the cover of STM in 2010, he was making a name for himself in motorsport, embarking on his career in Formula 1 as the official test and reserve driver for the Red Bull and Toro Rosso teams.\nTo say a lot has happened in the two decades since is a profound understatement.\nThe Perth star — with a grin as famous as his fearless overtakes — became one of the sport’s most recognisable (and most popular) figures, rising to incredible heights with Red Bull Racing between 2011 and 2018.\nHe cemented his place in F1 folklore with his distinctly Australian “shoey” celebrations, his larrikin, funny-guy presence as the grid’s resident joker, and a standout personality on Netflix’s Drive To Survive series.\nAfter leaving Red Bull, Ricciardo embarked on a new chapter with Renault before securing a memorable victory with McLaren at the 2021 Italian Grand Prix. But a difficult spell resulted in Ricciardo stepping away from the team at the end of 2022, terminating his contract early.\nHe returned to the grid midway through 2023, stepping in for Nyck de Vries at AlphaTauri. But despite strong fan support, he struggled to recapture his peak form and was replaced by Liam Lawson after the 2024 Singapore Grand Prix. That same year, he helped to spruik the many charms of his home State, including on the cover of STM, as part of a road trip campaign with Tourism WA.\nToday, the 36-year-old maintains an enigmatic social media presence while running his Enchante fashion label — and growing an increasingly impressive beard.\nNicola Forrest (2020)\nWhen Nicola Forrest took her seat in the bar at the Blue Room Theatre for this interview and shoot in 2020, she joked that she almost feigned an illness to get out of it.\nDubbed the UCB — undercover billionaire — by her friends, Nicola had stayed largely behind the scenes of the business and philanthropic empire she had built with husband Andrew “Twiggy” Forrest.\nShe told how she’d recently chatted with someone over lunch for two hours before they realised who she was; her companion was mortified, she was thrilled.\nBut with this story, Nicola had decided to take a cautious step into the spotlight to talk about one of her passions — support for the arts, via the Minderoo Foundation, after the sector rebuilt post-pandemic.\n“People are hungry for it,” she said. “One of the most powerful things with the arts is its ability to take you out of your everyday and that has never been more needed . . . For mental health, for connection, it is absolutely vital that we have opportunities for people to come together to be touched by something.”\nThe rare, candid interview also revealed a woman who remained allergic to waste even as her wealth grew; eldest daughter Grace gleefully told how her mother still wore a pair of R.M. Williams boots that son Sydney had grown out of a decade earlier.\nBut Nicola was also a shrewd benefactor, who demanded maximum impact and full accountability on investments, with a down-to-earth demeanour and playful, dry humour that helped earn her the nickname, Naughty Nic.\nThree years after this story, in 2023, Andrew and Nicola announced their separation after 31 years of marriage, but continue to oversee their businesses and the foundation.\nThe same year, Nicola set up Coaxial Ventures, which holds 50 million shares in the family’s iron ore and energy giant Fortescue; she and her three children are directors. She also registered a charity, Coaxial Foundation, with a focus on “nurturing human potential” and an initial program to address high-quality early education.\nNicola is also not the only person of the Forrest family to feature in STM’s pages; Andrew was on the cover in 2010, followed by their children, actor Sof in 2017 and Grace, founding director of anti-slavery organisation Walk Free, in 2018.\nNic Naitanui (2008, 2022)\nTwo days. That was the difference between Nic Naitanui playing for Carlton, or stepping into his storied career at the West Coast Eagles.\nWhen he featured in STM in 2008, Naitanui was just 18, playing for Swan Districts and displaying an effortless vertical leap that left even experienced footy talent scouts open-mouthed.\nAlready dubbed a once-in-a-generation player and a cult figure in waiting, Naitanui had been the subject of feverish draft speculation; the Blues would have snared him with the No.1 pic the year before, but he fell just two days short of the minimum draft age.\nIn the story, Naitanui talked about the profound influence of his beloved mother, Atetha (even if she wasn’t a fan of his signature dreadlocks), and even at such a young age, displayed an awareness of the important example he set.\n“When I am out on the street, a few of my mates like to muck around,” the teenager said. “Before I’d just let it go but now, with everyone’s eyes on me and kids watching me who’d probably look up to me in the future, I’d know they have to settle down a bit.”\nNaitanui couldn’t have known then that before long, he would become one of the most recognisable athletes in the country.\nA little over six weeks after this STM cover, Naitanui was picked up by West Coast at No.2 in the draft — and just about every West Australian knows the rest.\nThe ruckman became one of the Eagles’ most beloved and influential players, racking up 213 games across 15 seasons, many full of spectacular marks, memorable goals and his carefully honed taps from the centre bounce.\nBut launching his 1.96m frame eventually took its toll; Naitanui underwent knee reconstructions in 2016 and 2018. But he adjusted his game and went on to become a dual club champion (2020, 2021) and a three-time All-Australian (2012, 2020 and 2021).\nA humble and generous figure, Naitanui was just as influential off-field, embracing his role-model status, including becoming a multicultural ambassador for the AFL.\nHe also featured in STM in 2022, when he and his now-fiancee and then STM wellness columnist, Brittany Bown, announced they were expecting their first child. The couple now have two children, Ezekiel and Zuri.\nNaitanui retired from football in 2023, after an Achilles injury saw him have surgery that would require a long recovery.\n“You never want this day to come, but it always does,” he said at the time. “I’m content in the knowledge that I have given it everything.”\nMechelle Turvey (2024)\nWhen 15-year-old Cassius Turvey was murdered in 2022, beaten as he walked home from school with friends, it sent shockwaves through the community.\nThere were vigils, rallies and protests at the death of the beloved Indigenous teen — and a current of grief and anger, which threatened to spill over.\nBut in the days and weeks that followed, it was the grace, poise and quiet determination of Cassius’ mother, Mechelle Turvey, that shone through.\nStill grieving the recent death of her husband Sam, Turvey led the march in Perth with a powerful speech, calling for calm and non-violence — and the need for proper care for victims of crime and their families.\nIn this 2024 story, shortly after she was named WA Australian of the Year, Turvey told Rebecca Le May how her experiences, including the most difficult ones, had shaped her.\nAs a child, her grandmother would take her out into stormy weather. She never understood why, until her elder confided later that it was to make her strong for the storms ahead.\nAnd as those storms arrived — domestic violence, sexual assault, miscarriage, struggling to find her place and identity — Turvey not only endured, but used her experiences to help others, including six years working with young adults at Acacia Prison.\n“I freely talk about my lived experiences because it’s true healing for myself and, I hope, for others,” she said. “I just don’t want people to feel hopeless and feeling that they’re alone, because they’re not.”\nThe year after Cassius was killed, Turvey agreed to join WA Police, helping to train cadets on communicating more effectively and empathetically with victims of crime. After a session Le May observed, many were so moved they lined up for a hug.\nTurvey said that she derives a lot of joy from making others happy, which she knows is sometimes “not so healthy”.\n“But that’s the way I am. I’m wired like that,” she said.\n“If more people care for other people, even strangers, the world will be a better place. It’s all about choices. Whatever I do is respectfully aligned to Cassius. He never saw colour, religion, high academic versus low academic, and neither do I.”\nSam Kerr (2017)\nWhen Samantha Kerr was home in Perth towards the end of 2017, STM took the opportunity to shoot her for the cover and sit down with the soccer superstar at the home of her parents, Roger and Roxanne.\nThen 24, she was playing for Sky Blue FC in the American National Women’s Soccer League, Perth Glory in the Australian W-League and the Matildas.\nBut her profile had gone supernova in the months before, after the inaugural Tournament of Nations competition. Kerr scored a hat-trick against Japan, thrilling the San Diego crowd with her celebratory flawless backflips, and the Matildas won the tournament by beating Brazil 6-1 — Kerr netted the final goal in the 81st minute of play.\nAs she trained for the Glory later in Yokine, coach Bobby Despotovski said simply that Kerr had everything.\n“She is tremendously fast. Her speed change is astronomical,” he said. “I haven’t seen anything like it, especially in a female footballer. I remember her as a 14-year-old: she was born with that speed.”\nAs a kid, Kerr played AFL and didn’t like soccer at all, but by 12, she needed a sport where a girl could advance. She switched codes and debuted for the Matildas at just 15.\nOf her rising profile in 2017, Kerr admitted that she could do whatever she wanted 10 months earlier; now everyone was paying attention.\n“I actually like it,” she said. “I like that my little cousins are proud to tell people who I am and want me to come pick them up from school.”\nIt was a sign of things to come; two years later, in 2019, Kerr was made captain of the Matildas.\nThey didn’t win the World Cup that year bur Kerr did become the first Australian, male or female, to score a hat-trick at a World Cup. Later that year, she became the highest-paid Australian women’s footballer when she signed a two-and-a-half-year deal worth $2 million with Chelsea. Kerr is also a two-time Olympian, captaining the Matildas to their record-breaking fourth place finish in Tokyo in 2020.\nIn 2023, Matildas mania — and Kerr’s fame — went to another level when they advanced to the World Cup semi-final by beating France in a heart-stopping penalty shootout in Brisbane. They lost to England but the broadcast numbers told the story: it became the most-watched TV program in more than two decades, with an average audience of 7.2 million.\nLater that year, Kerr and her partner, American soccer player Kristie Mewis, got engaged and in May this year, their son Jagger Mewis-Kerr was born.\nKerr had a long absence from the Matildas over the past two years, both from injury and a highly-publicised court case, where she was acquitted of racially aggravated harassment of a police officer in London. She returned to the captaincy in October.\nOther cover stars from 21 years:\nAlec Coles\nTaj Burrow\nJessica Marais\nDanny Green\nErnie Dingo\nCourtney Eaton\nJohn Steffensen\nMelissa George\nStella Donnelly\nSamantha Jade\nBrianna Throssell\nLuc Longley\nPoppy Lissiman\nEamon Sullivan\nKevin Parker\nChloe Hurst\nCody Fern\nCameron Green\nKate Walsh\nJody Fewster\nBrooke Blurton\nRick Ardon & Susannah Carr\nBen Elton\nLuke Steele\nOlivia DeJonge\nMitchell Johnson\nAdam Gilchrist\nAnne Aly\nAnnie Sparrow\nRabia Siddique\nJune Oscar\nSarah Bahbah\nShalom Brune-Franklin\nKylie Radford\nJessica De Gouw\nNarelda Jacobs\nChristine Fox\nLiam Bartlett\nJoel Jackson\nRussell James\nDamien Oliver\nScarlett Stevens\nMandy and Hayley McElhinney\nDaisy Pearce\nMercy Cornwall\nAbbey Gelmi\nKate and Teagan Mulvany\nJai Courtney\nMaggie Dent\nAdelaide Kane\nCameron Green\nJacob Willcox\nJack Robinson\nCarly Lane\nBruce Robinson\nSophie Zalokar\nDennis Glennon\nPeta Murgatroyd\nNat & Sam Butler\nImogen Caldwell\nNikki Stamp\nLiv Cripps\nMeyne Wyatt\nDenise Satterley\nBillie-Jean Hamlet",
  "word_count": 9551,
  "scraped_at": "2026-02-14T12:20:41.493151"
}