{
  "article_id": "89c286aa37f6",
  "url": "https://www.wral.com/news/ap/7e51f-the-latest-ghislaine-maxwell-declines-to-answer-questions-in-house-deposition/",
  "title": "The Latest : Ghislaine Maxwell declines to answer questions in House deposition",
  "date": "20260209T173000Z",
  "domain": "wral.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lawmakers tried Monday to interview Ghislaine Maxwell, but the former girlfriend and confidante of Jeffrey Epstein invoked her 5th Amendment rights to avoid answering incriminating questions.\nShe was questioned during a video call to the federal prison camp in Texas where she’s serving a 20-year sentence for sex trafficking. She’s come under new scrutiny as lawmakers try to investigate how Epstein, a well-connected financier, was able to sexually abuse underage girls for years. The deposition comes as the Justice Department begins allowing members of Congress to review unredacted files related to Epstein files, according to a letter that was sent to lawmakers.\nOther WRAL Top Stories\nPresident Donald Trump has lashed out at questions about the Epstein files, demanding that the country “get onto something else,” but that’s highly unlikely. Many of the documents haven’t been released, and many of those now public were heavily redacted.\nRepublican Rep. James Comey, who chairs the House Oversight Committee, came under pressure to hold the Maxwell deposition as he pressed to enforce subpoenas on former President Bill Clinton and former Secretary of State Hillary Clinton. The Clintons agreed to sit for depositions after Comer threatened them with contempt of Congress — a move Democrats warned would set a precedent for future former presidents.\nThe Latest:\nFeds say they aren’t trying to rush 5-year-old Liam and his father out of the US\nImages of Liam Conejo Ramos wearing a bunny hat and Spider-Man backpack surrounded by immigration officers in Minneapolis stirred outrage over the crackdown.\nTheir lawyer, Danielle Molliver, told the New York Times that the government was attempting to end the father’s asylum case and speed their deportation proceedings as a possibly “retaliatory” move.\nBut Department of Homeland Security official Tricia McLaughlin said in a statement that “they are not in expedited removal,” and “there is nothing retaliatory about enforcing the nation’s immigration laws.”\nThe boy and his father, Adrian Conejo Arias, who originally is from Ecuador, were released from a Texas detention center on a judge’s order and returned to Minnesota. Their lawyer said he crossed the border legally using the CBP One app and that his pending asylum claim allows him to stay.\nMaxwell offers testimony to absolve both Clinton and Trump\nAn attorney for Maxwell told lawmakers that she would be willing to testify that neither President Donald Trump nor former President Bill Clinton were culpable for wrongdoing in their relationships with Epstein, according to both Democratic and Republican lawmakers who exited a closed-door deposition with Maxwell.\nDemocrats argued that Maxwell’s assertion was an appeal to Trump to end her prison sentence. “It’s very clear she’s campaigning for clemency,” said Rep. Melanie Stansbury, a New Mexico Democrat.\nMaxwell has been seeking to have her conviction overturned, arguing that she was wrongfully convicted. The Supreme Court rejected her appeal but she has asked a federal judge in New York to consider what her attorneys describe as “substantial new evidence” that her trial was spoiled by constitutional violations.\nThe Republican chair of the committee, Rep. James Comer of Kentucky, said it was “very disappointing” that Maxwell declined to participate in the deposition.\nJD Vance is visiting Armenia and Azerbaijan, seeking to advance Trump’s peace efforts\nThe vice president and his wife, Usha, landed Monday in Armenia — a country that no sitting U.S. vice president or president has visited before — seeking to advance a U.S.-brokered deal aimed at ending a decades-long conflict with Azerbaijan. They were greeted with a red carpet, an honor guard, and some roadside demonstrators, including one with a sign saying “Does Trump support Devils?”\nThe foreign ministers of both nations initialed a deal at the White House last August, but it remains unsigned by their leaders and unratified by their parliaments. Both nations’ presidents are on Trump’s new Board of Peace, which Trump plans to convene in Washington this month.\nThe deal with the two former Soviet republics would create the Trump Route for International Peace and Prosperity, connecting Azerbaijan with its autonomous Nakhchivan exclave. The land bridge has been a sticking point in resolving a decades-long conflict over the Nagorno-Karabakh region.\nMexico’s president echoes Bad Bunny’s Super Bowl message about American unity\nClaudia Sheinbaum says it’s “very interesting” that Bad Bunny’s “message was about American unity of the American continent,” noting that he named all the South and North American countries, including Mexico and Canada along with the United States. And she said she agrees with the singer’s message, that the best antidote to hate is love.\nAsked at her daily news briefing if she’d like a similar performance when Mexico, the United States and Canada open this year’s World Cup, she said that’s for FIFA to decide, but that “cooperation for development must be the foundation of the American continent’s unity.”\n“If we want to strengthen America, because America is all one continent, it would have to be based on cooperation and (free) trade,” she said.\nSheinbaum has navigated a delicate relationship with the Trump administration, earning his compliments while working under his repeated threats of tariffs and military intervention.\nUS military in Indian Ocean boards an oil tanker it tracked from the Caribbean\nThe Pentagon said Monday that U.S. military forces boarded the sanctioned oil tanker. Video posted on X with the statement showed a helicopter landing on its deck.\nThe Pentagon did not say whether the ship was connected to Venezuela, which faces U.S. sanctions on its oil and relies on a shadow fleet of falsely flagged tankers to smuggle crude into global supply chains. However, the Aquila II was one of at least 16 tankers that departed the Venezuelan coast last month after U.S. forces captured then-President Nicolás Maduro, said Samir Madani, co-founder of TankerTrackers.com.\nThe U.S. did not say it had seized the ship, which the U.S. has done previously with at least seven other sanctioned oil tankers linked to Venezuela.\n▶ Read more\nGhislaine Maxwell declined to answer House questions, citing 5th Amendment rights\nLawmakers tried to depose the former girlfriend and confidante of Jeffrey Epstein on Monday, but she invoked 5th Amendment rights to avoid answering incriminating questions.\nThey spoke during a video call to the federal prison camp in Texas where she’s serving a 20-year sentence for sex trafficking. She’s come under new scrutiny as lawmakers try to investigate how Epstein, a well-connected financier, was able to sexually abuse underage girls for years.\nACLU official says masked patrols streets are meant to terrify\n“It is without precedent in modern American history,” said the American Civil Liberties Union’s Naureen Shah in Washington.\nShe said the idea of masked patrols seeking immigrants on city streets can leave people scared and confused about who they are encountering — which she suggested is part of the point.\n“I think it’s calculated to terrify people,” she said. “I don’t think anybody viscerally feels like, OK, this is something we want to become a permanent fixture in our streets.”\nDemocrats and Republicans are divided over ICE masks\nThere seems to be little common ground over the issue in the debate over funding Homeland Security ahead of Friday’s midnight deadline, when it faces a partial agency shutdown.\nHouse Democratic Leader Hakeem Jeffries told reporters at the Capitol that unmasking the federal agents is a “hard red line” in the negotiations ahead.\nBut Sen. Thom Tillis, R-N.C., said he just can’t agree with Democrats on this point. “You know, there’s a lot of vicious people out there, and they’ll take a picture of your face, and the next thing you know, your children or your wife or your husband are being threatened at home,” he said.\n▶ Read more\nUS Olympians face backlash over politics\n1. Figure skater Amber Glenn: The outspoken LGBTQ+ rights activist said she received threats on social media after she responded to a question about what’s happening in America by saying that the queer community is going through a “hard time” amid the political climate under Trump. “I was disappointed because I’ve never had so many people wish me harm before, just for being me and speaking about being decent — human rights and decency,” Glenn said as her team accepted gold medals Sunday night.\n2. Freestyle skier Hunter Hess said he doesn’t “represent everything that’s going on in the U.S.” — and got slammed by YouTuber-turned-boxer Jake Paul. “From all true Americans If you don’t want to represent this country go live somewhere else,” Paul wrote on X before he joined Vice President JD Vance at the U.S women’s hockey game.\n3. Freestyle skier Chris Lillis referenced Immigration and Customs Enforcement, saying he’s “heartbroken” about what is happening in the U.S. “I think that, as a country, we need to focus on respecting everybody’s rights and making sure that we’re treating our citizens as well as anybody, with love and respect,” Lillis said. “I hope that when people look at athletes compete in the Olympics, they realize that that’s the America that we’re trying to represent.”\nPresident Trump slams Olympians for political remarks\nTrump said it’s hard to cheer for American Olympians who are speaking out against his administration’s policies.\nAsked at a news conference at the Milan Cortina Games how they feel representing the U.S. while ICE agents are detaining immigrants back home, freestyle skier Hunter Hess replied that he had mixed emotions: “If it aligns with my moral values, I feel like I’m representing it,” Hess said. “Just because I’m wearing the flag doesn’t mean I represent everything that’s going on in the U.S.”\n“Hess, a real Loser, says he doesn’t represent his Country in the current Winter Olympics. If that’s the case, he shouldn’t have tried out for the Team, and it’s too bad he’s on it,” Trump wrote on his Truth Social account.\nThe numbers show Trump’s Bad Bunny claims are not true\nTrump, a former reality TV star and dominant social media presence, usually is in touch with ratings and what they mean in the world of entertainment, politics and sports. But his take on Bad Bunny is off. By a lot.\nContrary to Trump’s statement suggestion that Bad Bunny has no appeal, the singer from the U.S. territory of Puerto Rico has been among the world’s most popular artists for years. He was Spotify’s most listened-to artist in 2020, 2021, 2022 and 2025, eclipsing Taylor Swift -- another frequent target of the U.S. president -- with nearly 20 billion streams last year.\nLast week, he took home album of the year at the 2026 Grammys for his “Debí Tirar Más Fotos,” the first all-Spanish language album to win the top prize.\nTrump calls Super Bowl halftime show ‘a slap in the face’\nIn a social media post Sunday night, the president said the Grammy-winning top-streaming megastar Bad Bunny “doesn’t represent our standards of Success, Creativity, or Excellence. Nobody understands a word this guy is saying, and the dancing is disgusting.”\nBad Bunny performed nearly entirely in Spanish, recreating his native Puerto Rico from sugar cane fields to a raucous wedding featuring Lady Gaga. And in a country where masked ICE agents are pulling people from their homes and neighborhoods, his patriotism was political:\nHe carried a football with “Together we are America,” written on the pigskin, and he wrapped up by leading a phalanx of dancers carrying the flags of many Latin American nations and Canada along with the Stars and Stripes, shouting “God Bless America — All of America!”\nBehind him, a screen read “The only thing more powerful than hate is love,” repeating comments he made at the 2026 Grammys.\n▶ Read more\nFBI concluded Jeffrey Epstein wasn’t running a sex trafficking ring for powerful men, files show\nThe FBI pored over Jeffrey Epstein’s bank records and emails. It searched his homes. It spent years interviewing his victims and examining his connections to some of the world’s most influential people.\nBut while investigators collected ample proof that Epstein sexually abused underage girls, they found scant evidence the well-connected financier led a sex trafficking ring serving powerful men, an Associated Press review of internal Justice Department records shows.\nVideos and photos seized from Epstein’s homes in New York, Florida and the Virgin Islands didn’t depict victims being abused or implicate anyone else in his crimes, a prosecutor wrote in one 2025 memo.\nAn examination of Epstein’s financial records, including payments he made to entities linked to influential figures in academia, finance and global diplomacy, found no connection to criminal activity, said another internal memo in 2019.\nWhile one Epstein victim made highly public claims that he “lent her” to his rich friends, agents couldn’t confirm that and found no other victims telling a similar story, the records said.\n▶ Read more\nMasks emerge as symbol of Trump’s ICE crackdown and a flashpoint in Congress\nBeyond the car windows being smashed, people tackled on city streets — or even a little child with a floppy bunny ears snowcap detained — the images of masked federal officers has become a flashpoint in the Trump administration’s immigration enforcement operations.\nNot in recent U.S. memory has an American policing operation so consistently masked its thousands of officers from the public, a development that the Department of Homeland Security believes is important to safeguard employees from online harassment. But experts warn masking serves another purpose, inciting fear in communities, and risks shattering norms, accountability and trust between the police and its citizenry.\nWhether to ban the masks — or allow the masking to continue — has emerged as a central question in the debate in Congress over funding Homeland Security ahead of Friday’s midnight deadline, when it faces a partial agency shutdown.\n▶ Read more\n‘Take the vaccine, please,’ a top US health official says in an appeal as measles cases rise\nCenters for Medicare & Medicaid Services administrator Dr. Mehmet Oz listens as President Donald Trump speaks about TrumpRx in the South Court Auditorium in the Old Eisenhower Executive Office Building on the White House campus, Thursday, Feb. 5, 2026, in Washington. (AP Photo/Alex Brandon)\nA leading U.S. health official on Sunday urged people to get inoculated against the measles at a time of outbreaks across several states and as the United States is at risk of losing its measles elimination status.\n“Take the vaccine, please,” said Dr. Mehmet Oz, the Centers for Medicare and Medicaid Services administrator whose boss has raised suspicion about the safety and importance of vaccines. “We have a solution for our problem.”\nOz, a heart surgeon, defended some recently revised federal vaccine recommendations as well as past comments from President Donald Trump and the nation’s health chief, Robert F. Kennedy Jr., about the efficacy of vaccines. From Oz, there was a clear message on the measles. “Not all illnesses are equally dangerous and not all people are equally susceptible to those illnesses,” he told CNN’s “State of the Union.” “But measles is one you should get your vaccine.”\nAn outbreak in South Carolina in the hundreds has surpassed the recorded case count in Texas’ 2025 outbreak, and there is also one on the Utah-Arizona border. Multiple other states have had confirmed cases this year. The outbreaks have mostly impacted children and have come as infectious disease experts warn that rising public distrust of vaccines generally may be contributing to the spread of a disease once declared eradicated by public health officials.\n▶ Read more",
  "word_count": 2561,
  "scraped_at": "2026-02-14T12:38:08.798859"
}