{
  "article_id": "89d3b85d8553",
  "url": "https://www.donegallive.ie/news/national-news/1300879/watch-the-results-were-in-spite-of-vera-ireland-player-diane-caldwell-speaks-out.html",
  "title": "WATCH :  The results were in spite of Vera  - Ireland player Diane Caldwell speaks out",
  "date": "20230919T100000Z",
  "domain": "donegallive.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "An Ireland women's football player has spoken out against the team's former manager, Vera Pauw, stating the team's recent success was \"in spite of\" her.\nRepublic of Ireland defender Diane Caldwell made the comments at a press conference yesterday (September 18) ahead of this Saturday's Nations League match with Northern Ireland.\nPauw, whose time at the helm has resulted in the team's first qualification for the Women's World Cup, was not offered a contract extension by the Football Association of Ireland (FAI) following the tournament.\nIt is believed the relationship between Pauw and the players influenced this decision.\nHowever, Captain Katie McCabe insisted player power was not responsible for the FAI's decision, stating, \"I feel like there have been a few unfair headlines. This thing of 'Katie v Vera’ is not a thing. We have spoken and she has wished us well. I will always be grateful for what Vera has given to Irish football.\"\nSpeaking at yesterday's press conference, Caldwell said, \"I think there were many areas that could have been better, yes, under her tenure.\n\"I think our preparations for games could have been better, physical preparation, opponent analysis, match tactics, in-game match tactics, changes, systems of play.\nRepublic of Ireland defender Diane Caldwell has sensationally slammed the management of Vera Pauw insisting that their historic run to a first-ever Women's World Cup was due to the players\n— RTÉ Soccer (@RTEsoccer) September 18, 2023\nREAD MORE: https://t.co/A9U1JmISO9 pic.twitter.com/20H6xYUbsg\n\"I think a group of players that were destined for success came together at the right time.\"\nShe continued: \"I think the results, performances that we got, were in spite of Vera being coach.\n\"We approached her many times about professionalising many aspects, but it was hard to get change.\n\"She obviously made myself a part of the leadership group that she created a long with a few other players so she gave us that position to use our voice and to try and talk on behalf of the team.\n\"I think we tried to do that, as a group, the best that we could but obviously at the end of the day she is the coach and she controls everything. You can only say and try to change so much.\"\nThe women's team made headlines nationwide when they qualified for the Women's World Cup in a qualifying match against Scotland (1-0).\nHowever, Ireland's World Cup dreams came to an abrupt end as the team failed to proceed after two matches against Australia and Canada, with just one (albeit spectacular) goal in the whole tournament.\nThey then went on to draw with Nigeria (0-0) in their final match.\nIreland will face Northern Ireland at the Aviva on Saturday, with Caldwell stating, \"It’s going to be phenomenal.\"\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nSubscribe or register today to discover more from DonegalLive.ie\nBuy the e-paper of the Donegal Democrat, Donegal People's Press, Donegal Post and Inish Times here for instant access to Donegal's premier news titles.\nKeep up with the latest news from Donegal with our daily newsletter featuring the most important stories of the day delivered to your inbox every evening at 5pm.",
  "word_count": 573,
  "scraped_at": "2026-02-14T13:50:51.891352"
}