{
  "article_id": "89d7fb5f3bca",
  "url": "https://awfulannouncing.com/nwsl/angel-city-fc-new-york-post-op-ed-elizabeth-eddy-sarah-gorden.html",
  "title": "Angel City FC figures disavow Elizabeth Eddy Op - Ed on NWSL gender rules",
  "date": "20251101T033000Z",
  "domain": "awfulannouncing.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The response has been swift at Angel City FC after defender Elizabeth Eddy published an Op-Ed in the New York Post calling for the National Women’s Soccer League to adopt standards for participation among intersex and transgender athletes.\nEddy’s piece, released on Tuesday after originally appearing as a post on X on Monday, cited action by World Aquatics and the English Football Association to restrict athletic participation on the basis of genetic and biological standards. The veteran defender suggested that solutions for the NWSL range from the presence of ovaries in an athlete’s body from birth to the presence of a “sex-determining region Y,” or SRY, protein in blood.\nMany sports organizing bodies in recent years, particularly after a ruling by the United Kingdom Supreme Court declaring that a person’s gender is legally based upon their biological sex at birth, have moved away from hormone-based requirements to more black-and-white regulations.\nRegarding options for athletes without these female sex markers, Eddy suggested an Open division within the NWSL and other professional tournaments.\n“Just as we built a new space for women to compete in the largest arenas, now we must honor that commitment and make the National Women’s Soccer League for women,” she wrote.\nThe organization released a statement the night after Eddy’s piece appeared, articulating that Angel City FC respects “the right for an individual to express their opinion,” but that “it does not reflect the opinion of an entire organization.”\n“Since our founding, Angel City has remained committed to equity, inclusion, and belonging,” the statement continued. “These principles will always guide how we show up for our team, fans, and community.”\nA statement from Angel City FC. pic.twitter.com/ymF3lBtgW1\n— Angel City FC (@weareangelcity) October 29, 2025\nIn a postgame press conference on Thursday evening, Angel City captain Sarah Gorden led a forceful refutation of Eddy’s Op-Ed alongside goalkeeper Angelina Anderson. The pair did not take questions.\n“That article does not speak for this team and this locker room,” Gorden said. “I’ve had a lot of convos with my teammates, and they are hurt and they are harmed by the article. And also, they are disgusted by some of the things that were said in the article, and it’s really important for me to say that. We don’t agree with the things written for a plethora of reasons, but mostly the undertones coming across as transphobic and racist as well.”\nAs an example of the racism she called out, Gorden referenced the selection of Orlando Pride’s Barbra Banda in the header photo of Eddy’s Op-Ed. A world-class star hailing from Africa, Banda has frequently been the subject of abuse over unfounded allegations around her sex and gender.\n“The article calls for genetic testing on certain players, and it has a photo of an African player in its headline,” Gorden said. “That’s very harmful, and to me it’s inherently racist, because to single out this community as a result of them looking or being different is absolutely a problem.”\nAnderson added detail about the stress that Eddy’s piece placed on the Angel City locker room.\n“I just want everyone to know that we’re doing our best in the locker room to preserve respect and belonging on this team,” she said.\nWhile Eddy’s argument is increasingly commonplace among professional sports organizations around the world, it clearly struck a nerve among her teammates as the NWSL season comes to a close.\nEddy has not spoken publicly since the Post Op-Ed was published.",
  "word_count": 579,
  "scraped_at": "2026-02-14T12:20:51.985682"
}