{
  "article_id": "89e902c2a5eb",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=349863",
  "title": "adidas Originals x Willy Chavarria release the Chavarria Megaride following its debut at Fall / Winter 2026 Paris Fashion Week",
  "date": "20260130T191500Z",
  "domain": "webwire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "adidas Originals x Willy Chavarria release the Chavarria Megaride following its debut at Fall/Winter 2026 Paris Fashion Week\nFor Fall/Winter 2026, adidas Originals and Willy Chavarria reunite for their latest drop with the Chavarria Megaride AG. Available in two colorways, Black and Cream, both silhouettes showcase a design inspired by intergalactic spaces.\nWith its debut on Chavarrias Fall/Winter 2026 Paris runway his fourth collection in collaboration with adidas Originals - this model explores adidas and Willys take on the Megaride Franchise, focusing on unique details such as hits of reflective and suede accents, mesh bases, with Chavarria printed on the tongue.\nCrafted in premium materials that take things up a notch, this drop is an invitation to walk beyond gravity and express yourself with complete freedom. Their textures evoke a density that challenges convention shapes shifts, transforms, and emerges to another dimension.\nBuilt around adidas iconic Megaride cushioning system, the Black colorway features Silver metal mesh on upper translucent TPU overlays, the double adidas logo on the sock liner, reflective and suede accents on toe and heel, translucent Putty Grey with hits of red foam on outsole, and the reflective Chavarria on tongue with reflective accents.\nThe Cream colorway features a Cream mesh base, upper translucent TPU overlays, the double adidas logo on the sock liner, suede accents on toe and heel, hints of red on the outsole, and a matte Chavarria printed down the tongue of the sneaker.\nThe branding throughout remains intentional and restrained, allowing the form, materials, and sculptural architecture of the shoe to lead visually. It extends Chavarrias vision of strength, individuality, and presence through adidas Originals archive of innovation, reimagined for a new cultural moment.\nWilly Chavarria Megaride Copa and Megaride Bones were featured on the Paris runway, with an early preview of an upcoming take on adidas signature Predator football cleat, alongside a range of World Cup merchandise, officially accredited by the Mexican Football Federation and inspired by the iconic football uniforms of the past. Fittingly, the runway featured adidas footballers Marcelo Vieira and Rodrigo Huescas, as well as skater Marcos Montoya, with Tyshawn, Sean Holland, and Steven Menace among those looking on.\nWilly Chavarria presented his Fall/Winter 2026 collection through a cinematic blend of music, theatre, and film that allowed the viewer to experience the looks in movement. The show moved from sharp tailoring to sportswear and streetwear, into cocktail looks, and culminates in red-carpet drama. The collection reflects the breadth of Willys world bridging BIG WILLY hoodies, which will sell at an entry price point, and bespoke gowns. His tailoring flows comfortably between mens and womens figures, while his red-carpet looks are crafted with emotion and precision.\nWilly Chavarria gave the audience a peek into the World of Willy.\nI live in New York City, street level, corner apartment, big windows. Theres barely any separation between the city outside and the world inside my home. I think there. I watch people. I watch them rush to work while I make my coffee. I watch them meet on corners. Enter the restaurant across the street. Kiss goodbye. Argue. Jump in and out of taxis. I watch people fall in love. I watch them fall apart. All of us under the same sun, under the same moon, sharing the same universe, breathing the same oxygen, smelling the same garbage. I feel connected to all of them. Ive seen a woman collapse in the middle of a crosswalk. A heart attack. Strangers ran in. I ran in. We waited together for the ambulance. Willy Chavarria\nThe adidas Originals x Willy Chavarria 2026 Megaride will be available globally on January 30, 2026 at 10AM EST on the CONFIRMED App, adidas.com, and at select retailers. adidas.com/willychavarria@adidasOriginals.\n( Press Release Image: https://photos.webwire.com/prmedia/8/349863/349863-1.png )\nWebWireID349863\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 649,
  "scraped_at": "2026-02-14T12:38:27.684603"
}