{
  "article_id": "8a2e7cbc50b5",
  "url": "https://www.westmeathindependent.ie/2025/03/18/tuesdays-briefing-michail-antonio-gives-positive-update-and-russo-eyes-silverware/",
  "title": "Tuesday briefing : Michail Antonio gives positive update and Russo eyes silverware",
  "date": "20250318T140000Z",
  "domain": "westmeathindependent.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Tuesday’s briefing: Michail Antonio gives positive update and Russo eyes silverware\nBy PA Sport Staff\nWest Ham forward Michail Antonio revealed he is progressing well from serious injuries sustained in his car crash.\nArsenal are preparing to begin their Women’s Champions League quarter-final against Real Madrid, while Chelsea condemned racist abuse directed at defender Wesley Fofana and other players.\nElsewhere, Manchester United announced a season ticket price increase for next season.\nMichail Antonio feels he has been given “another chance” at life and revealed his comeback from a horror car accident is three months ahead of schedule.\nThe West Ham forward shattered his femur in four places on December 7th when he crashed his Ferrari into a tree in Epping Forest.\nAntonio, 34, told Morning Live on BBC One: “From the crash, I’ve been more of an emotional man. I’ve almost died.\n“Physically, I’m getting better but mentally trauma lasts a long time. Now it’s just made me happy and positive in life because obviously, I’ve got another chance at life.”\nArsenal forward Alessia Russo has silverware in her sights as she prepares to take on Real Madrid in the first Champions League quarter-final of her career.\nThe in-form England international is the second-highest scorer in the Women’s Super League this season with 10 goals and has also registered five times in Europe.\nArsenal – the only English club to have won the Champions League, following glory in 2007 – are preparing for Tuesday’s first leg in the Spanish capital, with the return match to come next Wednesday.\n“When you come and sign for Arsenal, you understand the legacy of the club and the history of their successes in winning trophies and I want to be a part of that with this club,” said former Manchester United player Russo.\nChelsea condemned racist abuse directed at Wesley Fofana and other players.\nDefender Fofana shared screenshots on Instagram of online abuse received in the wake of Sunday’s 1-0 Premier League defeat to Arsenal.\n“Chelsea Football Club is appalled and disgusted by the recent rise in online racial abuse towards our players,” the west London club said in a statement.\n“The abuse Wes Fofana has been subjected to following yesterday’s fixture is abhorrent and will not be tolerated.”\nManchester United season ticket prices will increase by five per cent for the third successive year as part of the club’s ongoing drive for financial sustainability.\nUnited chief executive Omar Berrada said the club had “worked hard to come up with a pricing package that is fair and reasonable”.\nManchester United Supporters Trust (MUST) criticised the changes.\n“For several months we have argued long and hard the club need to look at the big picture and freeze ticket prices for next season,” read a MUST statement.\n“Other clubs have done that already and at United it would have sent a powerful message about the need for everyone to pull together to get the club out of the very difficult position it finds itself in.”\nArsenal take on Real Madrid in the first leg of their Women’s Champions League quarter-final.\nBayern Munich host eight-time winners Lyon in Tuesday’s other tie.\nIn Sky Bet League One, third-placed Wycombe can move back into the automatic promotion places – above Wrexham – with victory at Rotherham.",
  "word_count": 547,
  "scraped_at": "2026-02-14T12:49:22.194710"
}