{
  "article_id": "8a689301aa86",
  "url": "http://www.bignewsnetwork.com/news/278241825/daily-world-briefing-may-27",
  "title": "Daily World Briefing , May 27",
  "date": "20250527T011500Z",
  "domain": "bignewsnetwork.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Daily World Briefing, May 27\nChina to jointly usher in new \"Golden 50 Years\" for bilateral ties with Malaysia: Premier\nChinese Premier Li Qiang said Monday that China is ready to work with Malaysia to deepen exchanges and collaboration across various fields, and jointly usher in a new \"Golden 50 Years\" for bilateral ties guided by the principles of mutual respect and trust, equality and mutual benefit for win-win outcomes.\nLi made the remarks when meeting with Malaysian Prime Minister Anwar Ibrahim.\nRecalling that Chinese President Xi Jinping paid a state visit to Malaysia last month, Li said that both sides agreed to build a high-level strategic China-Malaysia community with a shared future and mapped out the strategic direction for the development of bilateral relations. China is willing to work with Malaysia to implement the important outcomes of this historic visit, he said.\nTrump threatens to send Harvard grant money to trade schools\nU.S. President Donald Trump on Monday threatened to divert billions in grant dollars away from Harvard University and give those funds to trade schools across the United States, escalating his clash with the elite institution.\n\"I am considering taking Three Billion Dollars of Grant Money away from a very antisemitic Harvard, and giving it to TRADE SCHOOLS all across our land,\" Trump said in a post on social media. \"What a great investment that would be for the USA, and so badly needed!!!\"\nThe Trump administration has already moved to freeze funding and block Harvard's ability to enroll international students in an intensifying battle over what the president has cast as a failure by the Ivy League university and others to crack down on antisemitism. Harvard is the oldest and richest U.S. university with a 53 billion U.S. dollars endowment.\nEU pledges to strike trade deal with U.S. amid tariff twists\nThe European Commission remains \"fully committed\" to reaching a trade deal with the United States amid tariff twists, according to a senior European Union (EU) official.\nIn a Monday post on social media platform X, European Commissioner for Trade and Economic Security Maros Sefcovic wrote: \"The European Commission remains fully committed to constructive and focused efforts at pace towards an EU-US deal,\" adding that Brussels would continue to stay in constant contact with Washington.\nHis remarks followed his calls with U.S. Commerce Secretary Howard Lutnick and U.S. Trade Representative Jamieson Greer.\nTensions flare as Israeli ultranationalists march through East Jerusalem\nCrowds of young far-right Israeli activists attacked Palestinians in East Jerusalem's Old City on Monday as they marched through the narrow streets to mark Israel's occupation of the eastern part of the city.\nThe annual event, known as the \"Flag March,\" drew mainly ultranationalist religious Jewish youths who waved Israeli flags and blew horns as they passed through the Old City's Muslim Quarter on their way to the Western Wall.\nVideos posted on social media showed dozens of Israeli participants chanting \"Death to Arabs,\" \"May your village burn,\" and \"Revenge,\" while pushing, insulting, and spitting at Palestinian men and women.\nThe parade was held under heavy police presence, with \"thousands\" of police officers, Border Police troops, and volunteers securing the event, according to a police statement.\nIntense tornado whips southern Chile, damaging 250 homes\nChile's President Gabriel Boric was set to travel Monday to the southern city of Puerto Varas after an unusually strong tornado whipped through the town Sunday, injuring 19 people, damaging over 250 homes, and knocking down power lines and trees.\nThe intense tornado surprised the 45,000 residents of the city located at the edge of Lake Llanquihue, close to numerous volcanoes.\nFollowing the incident, Boric announced the government will take emergency measures to expedite the survey of damage to homes and property, and said \"various state agencies are collaborating in the removal of debris.\"\nDozens injured after car drove into crowd at Liverpool parade\nDozens of people, including four children, were injured after a car ploughed into a crowd celebrating Liverpool Football Club's Premier League victory in the British city, emergency services said on Monday.\nA total of 27 people were taken to hospital, and two suffered serious injuries, including one child, the North West Ambulance Service said.\nThe incident is not being treated as terrorism, Assistant Chief Constable Jenny Sims told a press conference.\nA 53-year-old British man has been arrested and is believed to be the driver of the vehicle, according to police.",
  "word_count": 733,
  "scraped_at": "2026-02-14T14:16:55.012774"
}