{
  "article_id": "8a897be4d853",
  "url": "https://www.standardspeaker.com/2025/04/29/wolman-hall-of-fame-to-welcome-10-new-members/",
  "title": "Wolman Hall of Fame to welcome 10 new members",
  "date": "20250429T180000Z",
  "domain": "standardspeaker.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Jerry Wolman Northern Anthracite Hall of Fame will welcome its latest class for induction ceremonies at its 53rd annual banquet on Satruday at Groody’s Catering Hall, Ashland. The event will start with a social hour beginning at 5 p.m. and the program and dinner to follow at 6.\nThe annual Stan Rakowsky awards also will be presented to six graduating seniors from three high schools; Mahanoy Area, North Schuylkill and Shenandoah Valley. In addition, a special Lifetime Award will be presented for the first time in the chapter history, which began in 1972. Former Ashland standout alumnus Tom Hepler, the founder of Our Lad’s Football Draft Guide which started in the spring of 1983 will be honored.\nHepler’s venture was a “true guide for the NFL aficionados” who followed the NFL intently. His insight and accuracy in the scouting department was not just a “Bible” for fans, but the all NFL scouts relied heavily on his expertise and knowledge. Helper’s was the first of many that eventually came onto the draft guide scene.\nHe never remained stagnant and took Our Lad’s Guide to the next level in the computing world, which can be purchased online or a hardcopy. During his first year, Our Lad’s had just 44 subscribers; today there are more than 10,000.\nLong-time Hall of Fame board member and officer, Don Bricker, also will be honored for his more than 50 years of service to the PA Hall of Fame at both the state and local levels as well as for his tenure at North Schuylkill and his attention to all local sports.\nPosthumous honoree\nGerald “Gerry” Williams\nWilliams, a standout three-sport athlete at Shenandoah Valley High School, departed the sports scene much too early, passing on Jan. 27, 2021.\nHe excelled on the football field as a running back, a superstar on the basketball hardwood and a speedy runner for the Blue Devils’ earliest track teams under the tutelage of Lenny Csizek, who fostered the program during his coaching and teaching career at the high school.\nDuring his senior season, the sports scribes dubbed Williams with the nickname “The Ghost” because of his speed and elusiveness lugging the football as a runner. He was also renowned for his skills as a defensive back. Sadly, his senior season was cut short with a leg injury.\nBy the time basketball season rolled around, Williams was ready to lead the Blue Devils under the highly successful coach, Jack Babinchak. Williams had an innate ability to read opposing offenses as a defender in the mid-man role with the Devils harassing press.\nIn his senior season, Williams scored 91 points in his first four games. For the season, he averaged 22.2 points per game. In addition, he set a then-single-game record of 43 points against Schuylkill Haven.\nWilliams’ speed surfaced in track, and his standout career running earned him a Schuylkill League First-Team All-Star selection. His best events were the 220-yard dash, 180 low hurdles, and the long jump. He set school records in the 220-yard dash, which was eventually broken, and the 180 low hurdles. His 180 low hurdles record of 21.6 seconds was never broken because years later the event was discontinued by a metric version and never accurately replaced.\nWilliams went on to attend East Stroudsburg State College, where he played football, but an injury ended his football career during his sophomore season.\nWilliams’ athletic accolades earned him induction into the Shenandoah Valley School District Athletic Hall of Fame in 2012.\nHe was employed by Alcon Research LTD, Sinking Spring, Berks County, as an eye-care device supervisor. He was last employed with Tredegar Film Products, Pottsville, as a supervisor in the manufacturing of plastic film products.\nGerry Williams is survived by two children: son, Gerald Williams. Jr., of Minersville, and daughter, Amy Williams Murphy, who lives in Harrisburg. Williams also has three proud\ngrandchildren: Lincoln, Farrah and Marigold.\nHallie (Roulin) Corby\nHallie (Roulin) Corby was an exceptional talent during the “Golden Days” at North Schuylkill and its terrific girls’ basketball domination under legendary coach Lafay Hope.\nHer versatile skills enabled her to be a part of some of the greatest memories in the Lady Spartans’ proud history. After first honing her skills with the Anthracite Action AAU travel team as a high school freshman in 1993 and transferring those talents to the high school level, Roulin became a 1,000-point scorer during her days in Fountain Springs. She helped pave the way for the Lady Spartans to win numerous championships, including Schuylkill League titles in 1994, 1995, 1996 and 1997.\nRoulin proved to be a versatile player as a forward and center, She scored 14.4 ppg as a junior and bumped her average up to 15.8 ppg as a senior.\nHer North Schuylkill team captured back-to-back District 11 Class 3A championships in both of those seasons. The Lady Spartans reached the PIAA Class 3A title game in Hershey in 1995 and the state quarterfinals the following year. Her excellence on the court led to her being named to the Standard-Speaker All-Area First Team.\nRoulin earned a full athletic scholarship to West Chester University, where she once was No. 2 on the Golden Rams’ rebounding list, behind only Gina Tophoney, a former North Schuylkill star and Jerry Wolman Hall of Famer. Roulin averaged 6.2 ppg and tallied 612 career rebounds, 244 during a single season. She also registered 54 blocked shots in one season.\nRoulin graduated from West Chester with a Bachelor of Science degree in Communications. She went on to play professionally in Europe with the BBC Nitia Bettembourg squad, of Luxembourg, as its only American player from 2001-03, She also coached their developmental JV team in those years.\nRoulin-Corby is married to Jason Corby, a 1997 Pottsville High School graduate. They have two children: Ryan, 12, and Claire, 9.\nRoulin-Corby is employed as a registered nurse on the medical surgery floors for the past 13 years while also in the Medical ICU for four years as a Procedural Peri-Operative at Reading Hospital / Tower Health.\nRachel Hughes Darrah\nA skilled two-sport athlete at North Schuylkill, Rachel Hughes-Darrah earned numerous honors during her time at the school.\nAn excellent track and field athlete. she captured Schuylkill League championships in both the triple and long jumps as a sophomore in 2005.. She then won the silver medal at the District 11 Championships, and qualified for the PIAA Championships at Shippensburg University.\nIn 2006, Hughes-Darrah was a repeat Schuylkill League gold medal winner in the triple jump and long jump, while earning a bronze medal at the District 11 Meet. She went on to finish 14th overall at states.\nHughes-Darrah had another banner season in her final year of high school competition, with yet another District 11 bronze medal in the triple jump and a district silver medal as part of the Lady Spartans 3200 meter relay team. At the state meet, she earned a sixth-place medal in the triple jump.\nFollowing all three of her varsity track seasons, Hughes-Darrah was honored with her selection to the Pottsville Republican/Herald All Area Teams.\nHer athletic prowess was not limited to the track. She was a standout on the vaunted North Schuylkill basketball teams that won three straight Schuylkill League and District 11 championships from 2004 through 2006, the latter team reaching the state quarterfinals.\nFor her basketball accomplishments as a senior, she was selected third-team All-State in Class 3A Squad. In addition, Hughes-Darrah was named to the Standard-Speaker and Shamokin News Item’s All-Area First Team and thew Republican/Herald Schuylkill League Player of the Year.\nHer athletic career continued beyond high school to Susquehanna University, where she excelled as a four-year starter in basketball. Hughes-Darrah was a three-time Landmark Conference Second Team Honoree for her play.\nRachel Hughes-Darrah is married to Mount Carmel head football coach John Darrah and is a teacher in that school district. They live in Wilburton with their children: Jack and Josie.\nChristine Di Casimirro Evancho\nChristine Di Casimirro Evancho was not just a great athlete at the scholastic level, but she continued serve local athletics and education as a coach, an sports innovator, and most importantly, an educator. People who know her best appreciate the passion she showed in all these pursuits throughout her adult life.\nDiCasimirro Evancho graduated from her beloved Mahanoy Area in 1978. She excelled as a basketball and softball star, earning six letters and serving as a captain for both teams. She was chosen to the Schuylkill County North All-Star basketball team, and was the recipient of both the Rotary and the Lions Club Most Valuable Player in both basketball and softball.\nGraduating from East Stroudsburg with honors, DiCasimirro Evancho earned coaching certifications in basketball, softball, and swimming and landed her first coaching position as a volunteer at Stroudsburg High School with the girls’ basketball team. Here, she began a career that would show intensive dedication to her sports, involving detailed study of each activity from the perspective of her work at the collegiate level.\nDi Casimirro Evancho returned to her alma mater in 1982. She had a special passion for teaching basketball and, along with her sister Lisa Broomall, they began the school’s first-ever Junior High Program At one point, the junior high team won 73 straight games, and it was the advent of what was to become a state championship program on the varsity level for legendary coach Joe Alansky, where she served as an assistant. Prior to Alansky taking over the program, she also was an assistant to Ron Lichtenwalner.\nDiCasimirro Evancho was in the forefront of establishing the school’s first-ever swim team. She began by initiating a youth swim program in the community and the concept of a scholastic program blossomed from there.\nHer overall service and coaching resumes have been second-to-none on a scholastic level. She has enjoyed tenures as a softball coach as well as a cheerleading advisor. She was a mover and shaker in establishing the onset of gymnastics at Mahanoy Area.\nCoaching girls’ track and field also was a part of her varied career serving as an assistant to Mary Lou Henninger as the team earned a championship in the Schuylkill League Division II.\nDiCasimirro Evancho served as the school’s Recreational Director, succeeding the late William “Buck” Jones, the legendary Mahanoy Area coach and athletic director.\nDiCasimirro Evancho has also excelled as a teacher. She was named the Chairman of the Health and Physical Education Department at Mahanoy Area and was acknowledged by\nthe Rhoades Foundation, a highly acclaimed honor for her dedicated services in teaching and coaching.\nGarrett Kelly\nGarrett Kelly was one of the most versatile athletes to grace the scholastic scene as star at North Schuylkill High School. He was a unique three-sport athlete earning four varsity letters.\nKelly excelled as a quarterback for the Spartans for three seasons, 2008, 2009 and 2010. It was in his junior season of 2009, when North Schuylkill began to turn a dormant football program into a winner, after winning only three games the previous season.\nWith Kelly at the helm and a team captain, the Spartans rocketed to a 7-4 season, losing in the District 11 championship game on a last-second touchdown. His play earned him a berth on the Schuylkill All-League Coaches All-Stars. He also was recognized as the Pottsville Republican/Herald Player of the Week twice.\nOn the basketball court, Kelly surfaced as a superb player, where he was also selected as the team captain. Kelly was named Player of the Year by two media outlets in 2009; both the Standard-Speaker and Republican/Herald.\nKelly was North Schuylkill’s all-time leading scorer at the time, amassing a total of 1,387 points. He helped direct the team to the Schuylkill League championship in 2009. His team excelled winning four straight Division I titles.\nIn spring, Kelly was just as effective on the baseball diamond. He started all four seasons, performing as a pitcher, third baseman and shortstop. In his senior season he batted an impressive .300.\nKelly (Joyce) Kerr\nWhen one thinks of now-defunct Cardinal Brennan and its legendary girls’ basketball teams, one of the first names to surface is Kelly Joyce Kerr.\nA spindly, adroit swingman, Joyce helped lead the Lady Chargers to greatness, from the time she entered the tiny school at Fountain Springs until her graduation in spring 2005. Head coach Jerry Frieler recognized her talents and immediately elevated her to the varsity level as a freshman.\nThe timing of this move began a series of victories, including a District 11championship. It was an era of greatness for this group at Cardinal Brennan.\nKelly went on to become the school’s all-time scorer, boys included, scoring 1,705 points. Kelly\nhelped spearhead the team to back-to-back District 11 Class A titles in 2003 and 2004. The Lady Chargers unseated the vaunted Marian teams in that two-year span. In addition, the team reached the PIAA Eastern semifinals in three-straight seasons.\nJoyce Kerr’s efforts resulted in awards which began with a four-year first-team nomination to the Republican/Herald and three seasons on the Standard-Speaker first team All-Area squad.\nJoyce Kerr’s basketball prowess earned her a All-State third team honor in her junior year and an Associated Press All-State first-team hod as a senior.\nIn addition, Joyce-Kerr played for the Hazleton Hurricanes AAU Team that finished an impressive 18th nationally at Walt Disney World, Florida.\nJoyce-Kerr’s ability opened the door for her to attend Bloomsburg University and became a three-year starter for the Lady Huskies while participating in one of the best Division II Conferences in the country, the Pennsylvania State Athletic Conference.\nJoyce-Kerr established herself as one of the top scorers during her collegiate career becoming the program’s No. 9 all-time three-point shooter and its No. 14 player in blocked shots. She finished her college career with 782 points.\nKelly continued her basketball resume as a coachat Milton Hershey for five seasons.\nShe is married with two children and is the Managing Director for Expressive Pathways, a non-profit specializing in programs for autistic children.\nMichael V. Kowalick\nA raw-bone, tough hitter, is the best way to describe this standout football player from Cardinal Brennan High School.\nA 1973 graduate, Kowalick played for one of the great coaches in the region – Bill Kirelawich – who went on to coach as an assistant at West Virginia University for three decades.\nKowalick was noted for his toughness during his four years with the Chargers. He was your typical hard-nosed defender, starring at outside linebacker and offensive guard.\nHis three-year run as a letterwinner earned him the respect of his teammates as he was named tri-captain during his senior season. He went onto earn a berth on the Schuylkill County Coaches Dream Team, earned recognition at both of his positions, at the smallest school in Schuylkill County.\nAlong with his prowess on the gridiron, Kowalick stood out on the baseball diamond at Cardinal Brennan.\nBeyond sports, Kowalick also excelled in the classroom. He was selected as Cardinal Brennan’s Scholar Athlete at the Schuylkill County Chapter Football Foundation and Hall of Fame, honored with all the county’s stars at its annual banquet and awards ceremony.\nKowalick attended Bloomsburg University, where he was a two-year letterwinner at outside linebacker for the Huskies football team in 1975 and 1976.\nAfter graduation, he returned home and coached football at his high school alma mater in fall 1977 while still living locally.\nKowalick relocated and immersed himself with youth sports in the Manheim Township area in Lancaster County. He served as a soccer coach with the Manheim Township Youth Soccer Club, where he coached the girls’ team from 1993-1999. He was a league officer, age group\ncoordinator and league vice-president. He was instrumental in running the Manheim Township Labor Day Classic Soccer Tournament; a 115-team tournament with participants from Pennsylvania, Maryland, New York, New Jersey and Virginia. He also served as a tournament director from 1998-1999.\nKowalick’s coaching carried over to the basketball court in the Harrisburg Diocese CYO Basketball League, where he mentored St. Anne’s School (LancasterlLeague officer, including as president. He worked the annual diocesan basketball tournaments for boys and girls and was tournament director from 2002-2005. He also served on the Pennsylvania State CYO Girls’ Grade School Basketball Tournament board and was the tournament director in 2005.\nKowalick also worked more than 1,500 games as PIAA basketball official from 2003-2016.\nJackie (Kowker) O’Prey\nWhen you mention girls’ sports at Mahanoy Area, Jackie Kowker O’Prey, Class of 1988, stands out as one of the best-known two-sport athletes. She had quite a career competing for the Golden Bears’ swim and track and field teams.\nO’Prey’s talent in the latter began to come to the fore when she was a sophomore. O’Prey used her gift to the best of her ability and during that season, she was regarded as one of the finest in the Anthracite Region in the 100-meter hurdles, the triple jump and high jump.\nShe truly stood out throughout her junior season. Her time of 15.7 in the 100-meter event put her as tops in the Schuylkill League. She was a record- setter that season while advancing to the state meet in Shippensburg.\nWhen her senior year arrived, Kowker was recognized as the athlete to beat. She withstood all challengers at both the Schuylkill League District 11 meets. From these victories, she blazed to the PIAA Championships, where she earned a medal.\nHer time in the 100 hurdles (15.7 seconds) and distance in the triple jump (35 feet-6 inches) still stand among the best in those events at her alma mater. She also shares the high jump record (5-3) with four other athletes.\nKowker-O’Prey’s athletic success carried over to East Stroudsburg University, where she earned a letter as a track participant as a freshman, and was eventually recognized as a member of the Pennsylvania State Athletic All-Conference Team in women’s track and field.\nHer dedication to the sport found her coaching at rival Shenandoah Valley and her beloved Mahanoy Area.\nKowker O’Prey is in her 33rd year teaching special education in the North Schuylkill School District. She is the proud parent of two children. Her son is currently serving in the US Army learning to fly Black Hawk helicopters. Her daughter is a freshman at Baylor University and is also with the Army ROTC.\nSteve Trautwein\nSteve Trautwein remains the Mahanoy Area boys’ basketball program’s all-time leading scorer with 1,807 points. Considering the number of outstanding players who have worn a Golden Bears uniform, that itself is quite an accomplishment.\nBut while he is proud of his individual records, he is most proud of his team’s accomplishments. During his junior year (1978-79), Trautwein and his teammates captured the Schuylkill League championship.\nTrautwein also excelled as a track and field star at Mahanoy Area. He posted more track points than anyone in program history. He ran an amazing 10.1 in the 100 yard dash, a record that will always stand, not just because of the change over to metric measurements, but because of the superlative time!\nIn all, Trautwein earned 13 varsity letters in high school: four each in basketball and track, three in golf and two in cross country.\nTrautwein also was stellar in the classroom as well. He was selected as the National Honor Society president and served as his class president for three years. In addition, he was the editor-in-chief of the school yearbook.\nHis scholastic excellence earned him an Ivy League education. He graduated from Brown University with dual degrees in Economics and Organizational Behavior and Management. He went on the University of Pennsylvania to earn his SIFMA Certification from the prestigious Wharton School.\nTrautwein has spent more than 35 years in the financial services industry as both a financial advisor and a mortgage advisor. He currently serves as the Director of Military Lending for the Washington D.C. area’s most respected mortgage bank.\nTrautwein and his wife, Patti (University of Notre Dame, Class of 1989) have lived in Northern Virginia since 2002. Each of their three sons — Jake, Max and Steven — are blessed with basketballer’s height at 6-foot-5 and taller, but have chosen to purse their sports careers on the baseball diamond.\nAnthony “Tony” Vislusky\nThis talented Shenandoah Valley athlete helped wake up the football echoes of yore for the Blue Devils of his generation.\nA true speedster at quarterback and cornerback, Tony Vislusky helped engineer the Devils’ 1996 football team for coach Joe Ruth. The Devils went undefeated during the regular season, captured the District 11 Class A championship and advanced to the Eastern final. There, they suffered their loss against high-profile Southern Columbia in a physical football game, ending their incredible 13-game run. That 13-game win streak equaled the longest in program history, dating back to 1931.\nThe Devils were hardly threatened during Vislusky’s senior season, winning the district title by defeating perennial power Schuylkill Haven. At quarterback, he was a three-year letterwinner gaining a starting berth from his sophomore season and was a two-way starter on defense at cornerback.\nDespite a bruising rushing attack that produced a pair of running backs that combined for more than 3,500 yards, Vislusky was not a game manager, one-dimensional, hand-it-off quarterback. He set a record with 1,390 passing yards and 16 touchdown tosses.\nOne of the finest honors bestowed on any athlete, Vislusky was hailed by his teammates, who to a man, recognized him as a conscientious, motivational leader worthy of their emulation. He was known for his impressive work ethic and notably improved year after year.\nA truly gifted and versatile athlete, Vislusky also starred for Shenandoah Valley’s baseball team. His accomplishments on the gridiron and baseball diamond, earned Vislusky postseason all-star honors from the Pottsville Republican/Herald, the Hazleton Standard-Speaker, the Harrisbutrg Patriot News and the WPPA Radio Sports Network.\nVislusky turned down several college offers to play football, opting instead for a trade school. After six years of trade school, Vislusky received his Journeyman License in Data Communication Construction. He currently works as a Projection Manager for the Aldi grocery chain. He lives in the Harrisburg area with his wife, Melissa, and his stepchildren Abby and Nate.",
  "word_count": 3688,
  "scraped_at": "2026-02-14T13:32:28.648100"
}