{
  "article_id": "8aa5c6cd2aa8",
  "url": "https://www.dailyrecord.co.uk/news/scottish-news/scotland-crime-live-racist-abuse-31855442",
  "title": "Scotland Crime LIVE as girl , 8 , racially abused by kids as mum begs parents to educate children",
  "date": "20240315T113000Z",
  "domain": "dailyrecord.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome to the Daily Record's live crime blog, where we will be keeping you up to date with the most shocking and serious news from around the country.\nFrom the latest at Scotland's High Courts, to what's happening at the end of your road, we will have reporters all over the nation who are dedicated to covering the biggest crime stories every single day.\nToday we are covering a new book revealing Nazi hunters in the US were furious that notorious war criminal Anton Gecas was never prosecuted in Scotland despite being delivered \"on a silver platter\". We are also reporting on a young Dundee FC fan being scarred for life after a flare was thrown during a match where five youths were arrested over pyro incidents.\nAs well as local and national news in Scotland, we will also bring you the major news stories from around the rest of the UK - and from across the globe - so you can be kept up to date on the biggest crime stories as they happen.\nGet alerts on the latest Scottish crime news sent straight to your messages by joining the Daily Record's WhatsApp community here. Alternatively, you can sign up to our daily newsletter.\nKey Events\nPolice officer in hospital after 'train station attack' in Glasgow\nA police officer is in hospital after an alleged attack at Glasgow Queen Street Station on Easter Sunday. The British Transport Police (BTP) cop was called to the station after receiving reports of \"intoxicated members of the public being abusive” at 9pm.\nThe officer attended and was allegedly assaulted. He was rushed to hospital for treatment. His current condition is unknown.\nFootage of the incident shows punters allegedly attacking the BTP officer before dragging him down to the platform. Officers investigating the incident confirmed two men, both in their 20s, have since been charged.\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/scots-cop-hospital-after-attack-32494423\nCreepy Scots nurse who groped colleague in busy hospital dodges jail\nA nurse who fondled a colleague as they worked in a busy hospital ward has narrowly avoided jail. The female victim told a court she \"froze\" when Andrew Cassels \"massaged\" her buttock while she wrote patient notes.\nCassels, 36, of Bearsden, near Glasgow, was found guilty of sexual assault after trial at Hamilton Sheriff Court. Sheriff Michael Higgins said the incident had been “deeply distressing” for the victim and had a “detrimental “ impact on her.\nThe incident happened at Hairmyres Hospital in East Kilbride, Lanarkshire, on November 12, 2019. The married victim, now aged 47, said she was about to have a break and Cassels was taking over from her when he came up behind her and \"massaged or touched [her buttock] in a circular motion three times\".\nThe woman said she was upset but continued working because \"people in the ward were ill and you carry on doing your job\".\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/creepy-scots-nurse-who-massaged-32492916\nPaedo ex-teacher who runs Scots B&B 'should be put on sex offenders' register'\nA convicted paedophile who runs a Scottish B&B should be placed on the sex offenders’ register, insists one of his victims. Gary Bloom, 69, was a primary school teacher in Australia in 1985 when he sexually assaulted 10-year-old Stewart Carter.\nBloom later emigrated to Scotland but after he returned to Australia for a family visit in 2021, he was arrested. Despite being found guilty to three separate charges of indecent assault, he walked free and was able to return to Scotland.\nStewart, now 49, said: \"The fact that Bloom has been allowed to lawfully return to Scotland means it would be sensible for him to be placed on the sex offenders’ register.\"\nStewart contacted Police Scotland about Bloom, who runs a guest house in Aberdeen and was placed on the sex offenders' register in his homeland for life.\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/plea-scots-bb-owner-placed-32483143\nMum whose son died from single punch still makes his bed every week\nA mum has said she still makes her son's bed every day in the hope he'll come home - nine months after he died of a single punch in an unprovoked attack.\nJake Rainton, 23, died at the hands of Ryan Patient, 25, who lashed out while drinking heavily on a stag do. Horse lover Jake had been enjoying a day out with his girlfriend. But he tragically lost his life and him mum has revealed the toll his passing has taken on her.\nDawn McGurty said: \"Jake was a lovely boy, kind and caring and in no way aggressive. He was standing in the street, not even looking at his attacker, when he was floored with a single punch.\n\"Since he died, I have kept his bedroom exactly the same. There is a takeaway pizza box and a bottle of pop. His clothes are all there. I change the bed, every week, just as I always did, kidding myself that one day he might come home. I just cannot bear to accept that he has gone.\"\nRead more here: https://www.dailyrecord.co.uk/news/crime/mum-still-makes-bed-sons-32488688\nSavage teen girl gang arrested after disabled man 'beaten to death'\nA 12-year-old girl and two 13-year-olds have been arrested after the alleged attack of a disabled man who was chased and beaten to death.\nReggie Brown, 64, was allegedly chased by the three young girls down an alley and hauled off a chain link fence he'd been attempting to climb to flee.\nDetectives in Washington DC allege the girls stomped his head on the concrete, pulled his trousers down to his ankles and beat him with his own belt.\nPolice said Brown was found dead on the street just before 1 am suffering from gruesome injuries consistent with assault. An autopsy later confirmed his death as a blunt force trauma.\nRead more here: https://www.dailyrecord.co.uk/news/uk-world-news/savage-teen-girl-gang-arrested-32494075\nHumza Yousaf condemns sickening racist graffiti found near his Dundee home\nHumza Yousaf has warned it is \"increasingly difficult\" to shield his children from racism after he was targeted with Islamophobic graffiti near his Dundee home.\nRacist slurs relating to Humza Yousaf’s Pakistani heritage and his religion were sprayed on the walls and fences of homes in Hamilton Steet, Broughty Ferry, on Monday. It is near where the First Minister lives with his wife and two children.\nYousaf, who became Scotland’s first Muslim and ethnic minority FM just over a year ago, described it as another reminder why a \"zero-tolerance approach to hatred\" was needed.\nRead more here: https://www.dailyrecord.co.uk/news/politics/humza-yousaf-condemns-sickening-racist-32492302\nChild dies after shooting at Finland primary school\nA child has died and multiple people have been injured after a shooting at a primary school in Finland. Police were called to the horror incident at Viertola primary school in Vantaa at 8.08am UK time following reports that several shots had been fired.\nThree children aged 13 were left wounded - tragically one of them later died. Officers confirmed that a suspect, also a child, had been detained. Finnish newspaper Ilta-Sanomat said the suspect was caught in the Helsinki area later in the morning.\nPupils are reported to have hidden as the attack unfolded, while others told their parents on the phone that they had seen what had happened. Teachers are said to have locked children in classrooms to keep them safe.\nArmed officers remain at the scene alongside other members of the emergency services. Local residents have meanwhile been advised to stay away from the area, remain indoors, and told not to open the door to strangers.\nRead more here: https://www.dailyrecord.co.uk/news/uk-world-news/helsinki-school-shooting-horror-three-32491700\nMan charged over 'suspicious' Dundee flat death\nA man has been charged in connection with the death of a 43-year-old in Dundee. Emergency services were called to reports of a man found seriously injured at a property on Charleston Road shortly after 11pm on Saturday.\nHe was rushed to Ninewells Hospital for treatment but lost his fight for life on Sunday, March 31. Police Scotland previously confirmed they are treating the death as \"suspicious\".\nA 43-year-old man has now been arrested and charged and is due to appear at Dundee Sheriff Court today.\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/man-charged-over-suspicious-death-32493028\nSickening Snapchat footage of dead hamster in microwave probed by Scots cops\nA video showing a dead hamster in a microwave is being investigated by police. The sickening footage was taken on Snapchat and shared to Facebook.\nThe video shows what appears to be a dead hamster lying in a microwave. Scots youths can be heard screaming and laughing as the creature lies motionless. One male voice is heard shouting: \"RIP my boy.\"\nA second video taken shows a girl holding the motionless animal in her hands and taking it out of the kitchen before the clip ends. The stunt has been branded “sick” by people who have watched the post on social media.\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/sickening-snapchat-footage-dead-hamster-32481327\nFamilies of Brit backpackers killed in Thailand face fresh heartache over killer's demand\nA bar worker found guilty of bludgeoning a couple of British backpackers to death in Thailand has demanded a review of the case. Burmese migrants Zaw Lin and Win Zaw Tun, both 29, were sentenced to death for killing David Miller, 24, and Hannah Witheridge, 23, in 2014.\nPrison letters show that the duo still maintain their innocence 10 years after the brutal murders on Koh Tao island. In a letter to his legal team, Zaw Lin wrote: \"I have been in prison [for] almost 10 years for nothing, it's unbelievable... Could you please retrial again my case? I've never seen the people who died on the beach at Koh Tao.\"\nThe killers have always said that they were fitted up, and they accused Thai detectives of carrying out a \"botched\" probe. They have been visited by a delegation of solicitors in prison, including a British justice campaigner.\nThe news will heap fresh agony on Hannah and David's families, who have suffered a decade of misery over the murders. David's family have previously criticised online activists supporting the killers.\nRead more here: https://www.dailyrecord.co.uk/news/uk-world-news/families-british-backpackers-killed-thailand-32490673\nInside crisis-hit prison where six inmates died in matter of weeks\nA spotlight has been shone on a scandal-hit prison where six inmates have died suddenly in recent weeks. At least four of the deaths reported at HMP Parc in Bridgend, Wales, are being treated as drug-related, authorities have confirmed.\nOne former prisoner has claimed the privately-run prison is the jail of choice for criminals as \"every drug you can buy outside, you can buy in Parc\". He said: \"Sometimes drugs would get thrown over the wall or a drone would come over.\"\nDeaths over the last few years include one inmate whose kidney cancer was allowed to spread for months despite the prison being told he needed an operation. Others involved staff failing to safeguard inmates.\nRead more here: https://www.dailyrecord.co.uk/news/uk-world-news/inside-crisis-hit-prison-filled-32484310\nMan 'stabbed' in Scots town on Easter Sunday as cops launch probe\nA man has been left seriously injured after reportedly being stabbedon Easter Sunday. Emergency crews raced to the incident on Aitken Street in Airdrie after receiving reports of an assault at 6pm.\nParamedics attended and a 60-year-old man was found seriously injured. It is understood he suffered blade wounds.\nHe was rushed to the Queen Elizabeth University Hospital in Glasgow for treatment. He has since been discharged. Police have launched a probe into the incident and enquiries are ongoing.\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/man-stabbed-airdrie-disturbance-easter-32487951\nScotland's new hate crime law explained\nA new law surrounding the harm caused by hatred and prejudice officially come into force in Scotland yesterday.\nThe Hate Crime and Public Order (Scotland) Act was initially passed by MSPs back in 2021, and it builds upon existing offences for stirring up racial hatred that have been in place across the UK since 1986.\nHowever, the new legislation, which comes into force on April 1, has previously come under fire for potentially being \"weaponised\" for political purposes, as well as drawing criticism from the likes of JK Rowling and Elon Musk that it could damage free speech.\nProponents for the bill have hit out at \"disinformation\" surrounding the legislation, with First Minister Humza Yousaf claiming there is a “triple lock” of protection for speech.\nHere's everything you need to know about the new law in Scotland, and what it covers:\nhttps://www.dailyrecord.co.uk/news/scottish-news/scotlands-new-hate-crime-law-32484940\nYouths arrested after OAP 'shoved to ground' after argument on dog walk\nA pensioner was shoved to the ground by a group of sick youths in a horrifying and unprovoked attack. The woman, 74, was left face down in a field after being assaulted by the yobs while walking her dogs near Ardblair Woods in Blairgowrie.\nAn argument broke out when the OAP encountered the thuggish gang at around 6pm on Saturday, March 30. One of the group filmed the incident as the woman, wearing a yellow jacket, can be seen walking quickly to get ahead of the group.\nWhen the clip begins, the youths can be heard taunting the pensioner, who remains silent as she tries to get past. Several teens are shouting abuse at her when she gets ahead of the group and continues walking away.\nSuddenly, a dark-haired girl runs up behind the woman and firmly pushes her in the back with both hands. The 74-year-old is sent flying into the muddy ground, and is seen lying motionless on the deck with her face buried in the grass. The sick thugs burst out laughing and run away from the scene.\nPolice Scotland have launched a probe into the shocking attack, with officers carrying out patrols in the area, and confirmed on Monday that three youths had been charged in connection.\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/youths-arrested-frail-pensioner-shoved-32485203\nDundee fan, 10, scarred for life after being hit by flare as five youths arrested over pyro incidents\nA young football fan has been left scarred for life after he was struck in the face by a flare during a Scottish Premiership match. Dundee FC supporter Levi Rennie, 10, was in the away end at McDiarmid Park on Saturday for his team's clash with rivals St Johnstone when the terrifying incident took place.\nHis mum Sheree, 49, said she will never forget the smell of her little boy's burning flesh as the horror unfolded. The pyrotechnic burnt Levi's cheek and scorched a hole in his forehead - above his eye - with the schoolboy being told by medics that he could have been blinded in the incident.\nSheree said: \"When we were in the ambulance, he kept asking me, ‘Am I still burning?’ The stench of his skin was so strong and I know that has had a big impact on him. When we got to the hospital, doctors told us that Levi could have lost his eye because the flare just missed it by millimetres.\"\nPolice Scotland confirmed a 15-year-old boy has been arrested in connection with the incident. A further four youths - aged 13, 15, 17, and 17 - have also been arrested in connection with pyrotechnics use at McDiarmid Park on Saturday.\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/young-dundee-fc-fan-left-32486472\nEdinburgh man shaken after youbs 'pull knife' on him after he foiled 'break in'\nAn Edinburgh man has been left shaken after two teen yobs allegedly pulled a knife on him when he confronted them for trying to break into a flat. On Sunday, the passerby spotted two hooded teens with bolt cutters outside a plush tenement in Marchmont in broad daylight.\nThe concerned resident noticed the pair looking suspicious outside the Warrender Park Road property and when he approached them, he claimed they pulled out a knife and threatened him.\nDespite the terrifying threat, the man was able to capture several images of the youths, with one seen holding a pair of bolt cutters.\nPolice were called to the scene following a report of a man being threatened by two males with weapons, and the force are currently probing the incident to establish the full circumstances.\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/edinburgh-man-shaken-teen-yobs-32487434\nXL Bully owners can now apply for exemption certificate ahead of criminalisation\nXL Bully owners in Scotland are now able to apply for a special certificate that will allow them to keep their pets. As of August, it will be a criminal offence to own the banned breed without official exemption authorisation.\nAnd applications are now open for those who wish to keep the controversial dog beyond the summer deadline. The Scottish Government brought in legislation on the back of restrictions being put in place in England, following concerns over a rise in attacks on humans and other dogs.\nA wave of restrictions are already in place, with all XL Bullies to be muzzled and on a lead when in public.\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/xl-bully-owners-scotland-can-32486476\nNazi hunters 'incredulous' Scotland never prosecuted war criminal Anton Gecas\nA new book has revealed how top US Nazi hunters remain “incredulous” that Scotland failed to prosecute notorious war criminal Anton Gecas. Investigators in Washington claim they delivered Nazi Gecas “on a silver platter” and are angry he was never convicted in a Scottish court.\nGecas was accused of commanding Nazi death squads involved in the murder of 32,000 civilians yet he was allowed to live in freedom in Edinburgh until his death aged 85 in 2001. He was a commander with the 12th Lithuanian Battalion, which slaughtered thousands of Jews and Russians with such savagery even German administrators officially complained of their “extreme beastliness”.\nWitnesses say Gecas gave orders in one of the most infamous massacres of the war when thousands of Jewish and Russian men, women and children were murdered in the town of Slutsk in Belarus over two days. They were rounded up and shot in mass executions, dead and wounded laid on top of each other in pits and Gecas would shoot any survivors before the corpses were covered in bleach and burned.\nGecas had come to the attention of the Nazi hunters of the American’s Office of Special Investigations (OSI) as early as 1981. when he was named by another 12th Battalion collaborator it was investigating in the United States.\nNeal Sher, then head of the OSI, flew to Edinburgh to interview Gecas along with officers from Lothian and Borders Police and remarkably he admitted he had been in the 12th battalion and “witnessed” massacres. He said he hadn’t killed because he was a devout Catholic.\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/nazi-hunters-incredulous-scotland-failed-32486418\nHusband and wife charged with historic sex offences against two children\nA husband and wife are due in the dock over child sex offence allegations. The couple were charged with historical offences against two children following a police raid yesterday.\nThe man, 61, and his wife, 57, were detained at their home in Co Down, Northern Ireland, at around 6am on Thursday, March 28. They both face allegations of serious historical sexual offences.\nThe husband has been accused of a number of sexual offences, including historical gross indecency, and faces one charge of rape, while his wife is facing a number of charges related to his alleged offending.\nThey were both interviewed separately at intervals throughout the day in Antrim and were 28-day charged. They were released shortly after 10pm last night and are expected to appear in court on Thursday, April 25, while police officers continue to investigate the allegations.\nRead more here: https://www.dailyrecord.co.uk/news/crime/husband-wife-charged-historic-sex-32470241\nGeorge Gilbey's Gogglebox star mum Linda's 'struggling with rollercoaster of emotions'\nGogglebox star Linda McGarry is struggling with a \"rollercoaster of emotions\" after the death of her son George Gilbey. The 40-year-old is understood to have fallen 80ft to his death while working on Wednesday morning.\nGeorge tragically died at the scene. A colleague has been arrested on suspicion of gross negligence manslaughter.\nFamily friend Geordie Shore star Ricci Guarnaccio, who broke the news of George's death on Wednesday, said Linda has been inundated with messages of condolences.\nRead more here: https://www.dailyrecord.co.uk/news/uk-world-news/george-gilbeys-gogglebox-star-mum-32470669\n300 youngsters storm shopping centre in shocking footage\nHundreds of youngsters stormed a shopping centre in shocking scenes which saw police called in and a dispersal order being issued to the 300-strong gang by officers.\nScores of children, many of whom were wearing school uniform, swept through the complex, with some confronting security guards stationed in the building.\nThe carnage was caught on camera, with footage showing a security guard clashing with a child before he is swarmed by a large group of kids who surrounded him.\nThe crowd was then involved in a stand-off with police officers and security guards, which saw pushing and shoving. Shocking photos of the melee were also taken.\nRead more here: https://www.dailyrecord.co.uk/news/crime/chaos-300-kids-storm-shopping-32468781\nMan charged over 'XL Bully attack' in Glasgow street as Chihuahua dies\nA man has been charged after a beloved pet dog was killed in an alleged street attack involving an XL Bully-type breed. Police have confirmed a 49-year-old man has been charged following the incident in Bridgerton, Glasgow, on March 18.\nAbbie McKinnon had been out walking her Chihuahua Gizmo when another dog and its owner approached them and allegedly set upon the tiny pooch. Tragically little Gizmo died at the scene and heartbroken owner Abbie sustained a wound on her back during the incident.\nA 49-year-old man has been arrested and charged in connection with offences under the Dangerous Dogs Act. He has been reported to the Procurator Fiscal and was due to appear at Glasgow Sheriff Court on Thursday.\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/xl-bully-attack-man-charged-32470024\nGogglebox star George Gilbey's final words before tragic workplace incident\nThe tragic final words of George Gilbey have been revealed after he fell 80ft to his death in a horror incident. Tragically the Channel 4 Gogglebox star died in the early hours of March 27 following a workplace incident in Essex.\nA man has since been arrested on suspicion of gross negligence manslaughter in connection with George's death.\nThe 40-year-old had been working as an electrician in the week leading up to his death and reportedly fell 80ft through a skylight onto concrete at a building site in Essex.\nHis last words have been revealed by a friend who told how George was on the roof of an Essex warehouse when the fatal incident took place.\nRead more here: https://www.dailyrecord.co.uk/news/gogglebox-stars-tragic-final-words-32468238\nCops share CCTV of man hunted over failed robbery in Glasgow\nPolice have released the CCTV image of a man hunted in connection with an attempted robbery that took place in Glasgow.\nCops believe the man pictured may be able to assist with the probe into the failed theft that occured at around 5pm on Tuesday, January 23, on Garrioch Road in Maryhill.\nThe man is described as white, slim build, and aged around 50 years old. He was wearing a black jacket, black trousers and white Nike Air Max 95s.\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/nike-air-max-suspect-hunted-32468451\nMan charged after 'ram raid rampage with stolen lorry' left Scots shops wrecked\nA man has been arrested and charged after allegedly using a stolen lorry to ram-raid two shops in Arbroath. A police probe was launched into the alleged attempted break-in, which saw the entrance to the Mayfield Foodstore completely destroyed.\nPictures from the scene on Mayfield Terrace show the front of the shop caved after allegedly being struck by a vehicle. A second nearby business was also allegedly targeted in the early hours of Friday, March 22.\nA 30-year-old man has since been charged in connection and was due to appear at Forfar Sheriff Court on Monday. He has also been charged in connection with separate incidents in the town on Friday, March 15.\nThe lorry, which belonged to David Hall who owns the Ulearn LGV training Centre, has since been recovered but is said to be a write-off. He previously told the Record that he would have to cancel £5,000 worth of booked work due to the vehicle being unusable.\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/man-charged-after-ram-raid-32468514\nTeenager killed two pals in 'worst crash ever seen' by police\nA teenager killed his two friends in what has been described by police as the \"worst crash they'd ever seen\". Owain Hammett-George, now 19, has been jailed after he crashed an Alfa Romeo into a petrol station in Bishopston, Wales, in May 2022.\nPassengers Kaitlyn Davies and Ben Rogers, both 19, died at the scene while a third passenger, Casey Thomas, then aged 17, sustained serious injuries.\nHammett-George, who was 17 at the time of the crash, had previously pleaded not guilty to charges brought against him. However, he changed his plea last month and admitted two counts of causing death by dangerous driving one count of causing serious injury by dangerous driving.\nAt a sentencing hearing held at Swansea Crown Court on Thursday a packed court was told how Hammett-George was driving at more than twice the speed limit of 30mph leading up to the petrol station.\nRead more here: https://www.dailyrecord.co.uk/news/uk-world-news/teenager-killed-two-pals-worst-32465162\nDoor-cam footage shows man running for his life while being shot at\nRing doorbell footage shows the terrifying moment a man was shot at while running down a street. Police were called to New Chester Road in the Rock Ferry area of the Wirral after reports of gunshots being fired on the main road.\nOfficers got a call at 10.30pm, although the shooting is believed to have occurred around 25 minutes earlier. A video from a Ring doorbell has been shared widely on social media.\nIn the footage, a man can be seen running for his life while another person appears to fire shots at him. A man can be heard shouting in the clip, but it is unclear what is being said.\nA second man, thought to be the shooter, then appears in screen, chasing after the first man. Three gunshots can then be heard as a third man comes into shot.\nRead more here: https://www.dailyrecord.co.uk/news/uk-world-news/ring-doorbell-captures-moment-man-32466626\nDeath probe set for Scots killer who died behind bars after stabbing ex-bodybuilder\nA custody death probe has been set for a Scots killer who went on the run after fatally stabbing an ex-bodybuilder. Marius Bauba was serving an almost 10-year sentence at HMP Shotts, North Lanarkshire, when he was rushed to Wishaw General Hospital in July 2021.\nThe 28-year-old killer died a short time later with police saying there did not appear to be any suspicious circumstances. A Fatal Accident Inquiry hearing will now take place on April 9 at Hamilton Sheriff Court.\nBauba, who stabbed Morgan Dunn in the heart after a row at a house in Ayr, was eventually locked up after boasting cops wouldn’t catch him.\nThe dad-of-one had dodged their attempts by dyeing his hair and checking into hotels in Dumfries, Gretna and Carlisle while using false names. Officers eventually tracked him down 11 days after the brutal killing, which took place on February 8, 2020.\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/prison-death-probe-knifeman-who-32468994\nMum who hurled weedkiller in eyes of police officer dodges prison with restricted curfew\nA mum who blinded a police officer by hurling weedkiller in her eyes has been placed on a curfew for 15 weeks. But Levi Dixon had the nightly curfew period restricted after telling a court she needed time to walk her three dogs in the evening.\nSolicitor David Holmes said: \"Unusually, the social work report invites the court to consider a 30 minute to allow her to take her three dogs out each night.\" Instead, Sheriff Jennifer Bain KC pushed the normal 7pm start time back to 9pm each night after noting the dog walking was positive for Dixon.\nShe said: \"This was a horrible attack on a serving police officer by spraying weedkiller in her eyes. You are lucky it did not cause permanent injury or even loss of sight.\"\nDixon, 33, was given a chance to stay out of prison after a court was told she struggled to deal with authority figures. Perth Sheriff Court was told that Dixon - who previously threatened to firebomb the family home of her brother's killer - has \"oppositional defiance disorder\".\nRead more here: https://www.dailyrecord.co.uk/news/scottish-news/mum-who-hurled-weedkiller-cops-32464244\nSmirking Stephen Bear arrives in court to find out how much he owes Georgia Harrison\nSmirking Stephen Bear gave a thumbs up as he faced Georgia Harrison in court. Georgia arrived at Chelmsford Crown Court for a confiscation hearing to determine how much Bear must repay from his profits made from an explicit video he posted to subscription site OnlyFans.\nDisgraced reality TV star Bear, 34, was jailed last year for voyeurism and for sharing private sexual photos and videos to cause distress. He was freed from prison in January after serving nearly 11 months behind bars.\nBear arrived at court today wearing a pink shirt, crucifix and backless fur-lined loafers. A court heard earlier this month that Bear had made over £22,000 from a CCTV video of him and Love Island star Georgia having sex in the garden of his property.\nAt the time, he claimed to be a billionaire on social media, but police said he was actually heavily in debt. The court heard that the man's main asset was his house, worth £60,000.\nRead more here: https://www.dailyrecord.co.uk/news/uk-world-news/stephen-bear-gives-thumbs-up-32464793",
  "word_count": 4794,
  "scraped_at": "2026-02-14T12:07:30.293126"
}