{
  "article_id": "8aa70f953f21",
  "url": "https://www.usatoday.com/story/news/local/2023/04/18/oklahoma-city-bombing-victims-names-and-faces/5929605001/",
  "title": "Oklahoma City bombing victims : The names and faces",
  "date": "20230517T060000Z",
  "domain": "usatoday.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The names and faces of victims of the Oklahoma City bombing\nThe Oklahoma City bombing committed by Timothy McVeigh killed 168 people. These are the names and faces of those who died on April 19, 1995, in Oklahoma City.\nAmerica's Kids Child Development Center\nBaylee Almon\nBaylee Almon, who celebrated her first birthday the day before the terrorist bomb took her life, is described by family members as having a loving, heart-filled smile. An amateur photographer snapped her photo as a firefighter carried her away from the destroyed building. The photo appeared on the front pages of newspapers and magazines worldwide. Of all the thousands of photos taken at the site, the photo of Baylee captured the horror of the bombing and took it straight to the heart of a sorrowful nation.\nDanielle Bell\nDanielle Bell, 19 months, liked the outdoors and birds. And she liked to smile. \"She was just like an angel from God,\" said her mother, Deniece Bell, 28. \"She always had a smile on her face, and she would do whatever she could to bring one to yours. \" \"She was loved by many people, especially her mom and her grandparents and her uncle,\" her mother said. \"Anyone who knew her will always remember that precious smile, and we'll all miss her and never forget the love and the smile.\"\nZackary Chavez\nZackary Chavez, 3, had attended America's Kids day-care center since infancy. His great-grandfather remembered giving him quarters. \"When you would give him a quarter, he would always take it to his mom,\" Cereaco Hernandez said. Zackary had been cared for by workers at the daycare center inside the Murrah building his entire life. \"He was a cute little guy,\" said Hernandez of Zackary. \"You would try to give him a dollar, and he would say 'No, no - give me a quarter.' \"\nDana LeAnne Cooper\nLike many women of the '90s, Dana Cooper of Moore struggled with her desire to stay at home with her son, Christopher, and her dream of becoming a kindergarten teacher, her husband, Anthony, said. \"She battled with that all the time. Being a student and working, she was afraid Christopher didn't get enough of her time,\" Cooper said, \"but he did. \"\nAs the new director of America's Kids daycare center in the federal building, his wife felt great about being able to take her young son to work with her, Cooper said. Cooper said he dropped the two off at the Murrah Building Wednesday morning, planning to return for them that afternoon.\nDana Cooper, 24, had planned to fly that day to San Francisco for a daycare conference. However, the Coopers' lives were forever altered when a bomb shattered the federal building. Cooper said he was notified Saturday that his son Christopher, 2, was dead. On Sunday, the family received the news that Dana Cooper also had died in the explosion. The grief for his wife and son could not be borne without help from a higher power, Cooper said. \"I could not imagine how anyone could get through something like this without God. \"\nAmerica's Kids owner Melva Nokes said she had known Dana Cooper since she first hired the young woman to work in her Choctaw day-care center. Nokes said even then, as a student at Choctaw High School, the young woman showed signs of promise. \"She would have made an excellent teacher,\" Nokes said. Nokes, with Dana Cooper at the helm, took over operation of the federal building daycare center March 27. Now, just three weeks later, Nokes said it is hard to believe Dana Cooper is gone. She then remembered that cheery voice still on the recording. \"This is exactly like I've lost one of my own children. It hurts that much,\" Nokes said.\nAnthony Cooper said his wife was a student at the University of Central Oklahoma, majoring in early childhood education. Dana Cooper was about a year away from graduation, he said. The couple had been married for five years and had talked about expanding their family. Cooper said he and his wife adored Christopher, whose full 1 name was Anthony C. Cooper II. \"He was a very happy child, very vibrant - Mr. Personality,\" Cooper said.\nHe said his wife loved all children. \"She was the most beautiful person I ever met. Everything she did, she did for the children,\" Cooper said. Former Rose State College instructor Ruth Ann Ball said she had Dana Cooper in several of her early childhood development classes. She was really happy when she learned the young woman had chosen to go on to a four-year college to complete her studies. \"I was glad because I knew she would contribute to the profession,\" Bell said. \"It's very sad to know that she's not here now. Her face has been on my mind. \"\nAnita Fowler, who worked with Dana Cooper several years ago, said the young woman had a maturity beyond her years. \"She's a big loss to child care because she's given very much of herself to the child care community, as much as she could. She was a very good role model for caregivers,\" Fowler said.\nAnthony Christopher Cooper II\nAnthony Cooper said he dropped the two off at the Murrah Building Wednesday morning, planning to return for them that afternoon. Dana Cooper, 24, had planned to fly that day to San Francisco for a daycare conference. However, the Coopers' lives were forever altered when a bomb shattered the federal building. Cooper said he was notified Saturday that his son Christopher, 2, was dead. On Sunday, the family received the news that Dana Cooper also had died in the explosion. The grief for his wife and son could not be borne without help from a higher power, Cooper said. \"I could not imagine how anyone could get through something like this without God. \" Anthony Cooper said he and his wife adored Christopher, whose full name was Anthony C. Cooper II. \"He was a very happy child, very vibrant - Mr. Personality,\" Cooper said. He said his wife loved all children. \"She was the most beautiful person I ever met. Everything she did, she did for the children,\" Cooper said.\nAntonio Ansara Cooper Jr.\nAntonio Ansara Cooper Jr. was just learning to crawl and say \"Da-Da. \" The 6-month-old was a happy baby who never cried and loved to laugh, said his father, Antonio Cooper Sr. \"He'd make himself laugh by playing with his toys,\" the father said. Young Cooper also liked to be thrown up in the air and watch his mother, Renee Cooper, dance. Antonio Cooper Jr. was born Oct. 11, 1994, on his father's birthday. He had attended America's Kids day-care center since December.\nAaron Coverdale\nBrothers Aaron Coverdale, 5, and Elijah Coverdale, 2, were well-loved by their relatives. After the bombing, their father, Keith Coverdale, walked the streets holding photos of his smiling children, asking if anyone had seen them.\nElijah Coverdale\nBrothers Aaron Coverdale, 5, and Elijah Coverdale, 2, were well-loved by their relatives. After the bombing, their father, Keith Coverdale, walked the streets holding photos of his smiling children, asking if anyone had seen them.\nJaci Rae Coyne\nJaci Rae Coyne, the only child of Scott and Sharon Coyne, loved the Itsy Bitsy Spider song. Her mother sang that song to her from the day she was born until the day she died. \"She would run across the room whenever she heard it. But she couldn't quite get her fingers to make the spider,\" said her father, Scott Coyne, 24. Jaci was 14 months old. Her father said Jaci also liked to have her picture taken, and she would hug everyone she met. \"She was an extremely happy baby, full of laughter,\" he said. \"She was just everything to us, and to have her taken from us so foolishly and so irresponsibly...\"\nBrenda Faye Daniels\nBrenda Daniels, 42, was a teacher at America's Kids child-care center on the second floor of the Alfred P. Murrah Federal Building. Originally from Wichita Falls, Texas, Daniels spent most of her life working at child-care centers. However, she had worked at America's Kids less than a year. \"... The focus of her life was kids. My mother loved kids,\" said her daughter, Chastity Pope of Dallas. Daniels lived in Oklahoma City for 13 years.\nTylor Eaves\nEight-month-old Tylor Eaves was just beginning to pull up on things. His grandmother, Gloria Eaves Hardin, thought he'd probably be walking by nine months, just like her daughter Miya, Tylor's mother. Miya Eaves worked at Standard Life, just a few blocks from America's Kids day-care center in the Alfred P. Murrah Federal Building. Tylor was just settling into the routine in the center, where he had started a week before the April 19 blast that took his life. \"He was a happy baby,\" Gloria Eaves recalled. \"He was bossy and spoiled because he liked attention. He wanted to be able to see you all the time.\" Tylor was a big, healthy baby, looking older than his 8 months. \"He was just getting into his personality, and he could get anything he wanted from us,\" Gloria Eaves said, adding that like his mother's side of the family, he had beautiful grayish-green eyes.\nTevin Garrett\nTevin Garrett, 1, was a very happy baby who loved to dance, ride his yellow Lion King bike and slide down his red and blue slide (headfirst). His favorite food was chicken. He was the son of Helena Annette Garrett Scott and the stepson of Vernon Lee Scott.\nKevin Lee Gottshall II\nWhether he was pulling down his curtains, running over his puppy with his walker or spitting green beans at his mother, all he had to do was smile and his parents' hearts would melt. Kevin \"Lee\" Gottshall II was only 6 1/2 months when his life ended on April 19 in America's Kids daycare center. Lee was an active little boy who looked just like his father. He had known nothing but love, a full belly, a dry bottom and many good times, his parents said. He was curious and enjoyed seeing new people and things, and he was always happy and laughing. Lee had six teeth and would show them to everyone who would look. \"We tried to do everything for him, but he gave more happiness in his short time with us than we ever thought possible,\" his parents said in a prepared statement.\nWanda Lee Howell\nWanda Lee Howell always carried a Bible in her purse. \"She told me God comes first,\" Melvin Howell said of his wife. \"I was a little jealous about that because she told me I came second, but I said that it was all right.\" Just three weeks before the April 19 bombing, Wanda Lee Howell, 34, began teaching children in the America's Kids daycare center in the Alfred P. Murrah Building. He said she talked with friends about how much she loved the daycare center because there were so many pretty children. She loved to read to them, Melvin Howell said. Howell has two daughters Tashanna, 14, and Latasha, 10. \"I know she is looking down on us now,\" Melvin Howell said. \"She was a wonderful wife. She is a part of me.\"\nBlake Ryan Kennedy\nBlake Ryan Kennedy, 18 months, was a very independent and friendly child always saying hello and goodbye, his father, Steve Kennedy, said. \"He loved it. He couldn't wait to get there. He didn't know a stranger. He was always happy. He was always smiling. He was the perfect child,\" Steve Kennedy said. Blake had attended America's Kids daycare since he was 6 weeks old, after his mother, Laura, returned to work in the Health and Human Services office in the federal building. Laura Kennedy received only cuts and bruises from the explosion, her husband said.\nDominique London\nDominique London, 2, seemed destined to become a comedian, his grandmother said. A young practical joker, he often would run up to the church podium and turn off the speaker while the pastor was talking, Ernestine Looney said. Dominique was loved by everyone who met him, including the children he spent time with at America's Kids day-care center, she said. \"Everyone was crazy about Dominique. He was just my baby. He had you laughing. All the kids were drawn to him. He was smart. He really was. We just have so many good memories of him,\" she said. Dominique had two brothers, Deandre, 12, Derrick, 9, and a sister Tara, 1. His mother is Tonya London.\nChase Dalton Smith\nBrothers Colton Wade Smith and Chase Dalton Smith wanted to be together all the time, said their mother, Edye Smith. \"They loved each other. They didn't want to go anywhere without the other,\" she said. The Oklahoma City boys died together in the bombing, shortly after Edye Smith dropped them off at America's Kids daycare center at the federal building. The boys' father is Tony Smith. Edye Smith said the boys would be walking down the street and pass someone and Chase would quickly say, \"Hi, mister. How're you doing?\" Also, Barney was their favorite television show. \"They were happy. They were real free-spirited,\" she said. \"They were sweet.\" Chase, 3, and Colton, 2, were the only children of Edye Smith. \"You can never hug and kiss your child too many times,\" she said.\nColton Wade Smith\nBrothers Colton Wade Smith and Chase Dalton Smith wanted to be together all the time, said their mother, Edye Smith. \"They loved each other. They didn't want to go anywhere without the other,\" she said. The Oklahoma City boys died together in the bombing, shortly after Edye Smith dropped them off at America's Kids daycare center at the federal building. The boys' father is Tony Smith. Edye Smith said the boys would be walking down the street and pass someone and Chase would quickly say, \"Hi, mister. How're you doing?\" Also, Barney was their favorite television show. \"They were happy. They were real free-spirited,\" she said. \"They were sweet.\" Chase, 3, and Colton, 2, were the only children of Edye Smith. \"You can never hug and kiss your child too many times,\" she said.\nScott Williams\nScott Williams, 24, of Tuttle would have been a new father in about two months. His wife, Nikki Williams, is expecting their first child, a girl they already had decided to name Kylie. \"He was a wonderful person,\" said his aunt, Linda Lekawski. Williams, a salesman for William E. Davis and Sons Food Inc., was making a delivery to the child-care center at the federal building.\nAthenian Building (Job Corps)\nAnita Hightower\nAnita Hightower, 27, left Fort Worth, Texas, in 1991 to take care of a sick aunt in Oklahoma City. She was a secretary for the Job Corps in an office across the street from the federal building. She had two daughters.\nKathryn Elizabeth Ridley\nIn order to better herself for her two daughters, ages 4 years and 4 months, Kathryn Elizabeth Ridley was enrolled as a student at Guthrie Job Corps. Jacqueline Ridley said her sister-in-law had been on maternity leave from the Job Corps and had gone to the Job Corps recruiting office near the Alfred P. Murrah Federal Building on the day of the explosion. The young woman loved to write and was a very good artist. Sadly, most of her sketches were with her when she was killed, Jacqueline Ridley said. Jacqueline Ridley said her sister-in-law was taking welding classes at Job Corps, in the hopes that this training would help with her artistry. Kathryn Ridley, 24, was always smiling and loved to laugh. The sound of her laughter is what the family will miss most, Jacqueline Ridley said.\nDefense Security Service - 3rd Floor\nHarley Richard Cottingham\nThe game of golf held a special place in the life of Harley Richard Cottingham. A special agent with the Department of Defense Investigative Service, Cottingham recently had completed a trip to Scotland, where he played the historic links at St. Andrews. He also visited England and his ancestral hometowns while on the trip. A native of Omaha, Neb., and graduate of the University of Nebraska, Cottingham served in the U.S. Navy from 1969-1973. He continued his career in government service in 1980 when he joined the Veterans Administration as a Veterans Outreach Counselor. Cottingham, 46, joined the Defensive Investigative Service in 1985 and served in the Omaha and Colorado Springs, Colo., field offices before being assigned to Oklahoma City in 1991. To friends and co-workers, he was a \"positive person ... who was always happy and who was able to raise the spirits of co-workers when they were down. \"\nPeter L. DeMaster\nThe values of \"leadership, commitment, honor and integrity\" learned as an Eagle Scout guided Peter L. DeMaster throughout his life, according to those who knew him best. DeMaster, 44, was a special agent in the Oklahoma City Investigative Field Office of the Department of Defense Investigative Service. He and his wife, Kay Barry-DeMaster, were to celebrate their 13th wedding anniversary April 24. A devoted father to his daughter, Kristen, 21, and stepson, Brian Barry, DeMaster helped his children in their Girl Scout and Cub Scout endeavors. DeMaster earned the admiration of those whose lives he touched. He was described by one friend as \"the kind of man you want your sons to grow up to be like. \" His wife said he considered scouting and achieving the Eagle Scout honor a highlight of his life. DeMaster came to Oklahoma as an AWACS instructor at Tinker Air Force Base. He had worked for the Department of Defense for the past 11 years.\nNorma Jean Johnson\nAt quarter-horse shows, Norma Jean Johnson was known for the smile on her face and her willingness to help all exhibitors. Johnson, 62, had been executive secretary for the Defense Investigative Services since June 1989. Fellow Oklahoma Quarter Horse Association member Mary Camfield said Johnson and her husband, Carlos Johnson, began their involvement with horse shows when their daughter and grandson began showing. \"She learned to be quite a help with the grooming,\" Camfield said. She has four children, five grandchildren and three great-grandchildren.\nLarry L. Turner\nThe sound of music surrounded the life of Larry L. Turner. A special agent with the Department of Defense Investigative Services, Turner played clarinet in the St. John Baptist Church orchestra. Music was his \"first love,\" according to those who knew him best. Turner, 43, also was devoted to his church, where he served as a deacon, Sunday school teacher and in the transportation ministry. Turner and his wife, Dianne, had been married for 22 years. A former Oklahoma state trooper, he had two sons and a grandchild that friends called \"the apple of his eye.\" Turner was a 1981 graduate of the University of Central Oklahoma and joined the Defense Investigative Services as Special Agent in 1986. He belonged to the King David Lodge, and also had been a member of the Black Troopers Association and the Omega Psi Phi fraternity. Remembered for his outgoing personality, Turner also was active in sports, playing tennis, racquetball and golf.\nRobert Westberry\nRobert Westberry, 57, was only two years away from retiring as the special agent in charge at the Department of Defense and Investigative Services. He loved to work on his computer and was dedicated to his family. \"He was an unconditional father. His love was unconditional. His giving was unconditional. His time was unconditional,\" said his daughter, Sue Riley of Columbia, S.C. Born Aug. 18, 1937, in Miami, Fla., Westberry was a highway patrolman in Florida before going into the Naval Investigative Service. Robert and Tillie Westberry had lived in Oklahoma City for about two years.\nDepartment of Agriculture - 5th floor\nOlen Bloomer\nMoore resident Olen Bloomer enjoyed fishing and just watching the birds on his small plot of land at Lake Eufaula. He also loved to play with his grandchildren. Bloomer, 51, was a budget assistant for the U.S. Department of Agriculture. He was admired by his staff for his ability to stay cool under pressure and cut through bureaucratic red tape when emergencies arose. He was an \"average man\" who enjoyed telling jokes and laughing, said daughter Maureen Bloomer. \"He was the ideal of what everyone wants in a dad.\" His wife, Norma Jean Bloomer, died in 1990. His grandchildren called him \"Big Dad.\"\nJames E. Boles\nA native of Mississippi, James E. Boles had worked in four states for the U.S. Department of Agriculture before taking over the reins of the Oklahoma City office in 1991. \"He had some progressive ideas that let us share some information among sister agencies that saved some money. He made the operation more efficient,\" USDA spokeswoman Janna Evans said. Boles, 51, and his wife, Jennifer, married 13 years ago. Their son, James Michael Boles, is 8 years old. Boles also has an adult son, Stephen Boles, 28, who lives in Germany. A family friend said Boles had a small farm where he raised chickens and rabbits. Boles previously worked for the USDA in Mississippi, Florida and Maryland before becoming the local administrative officer. \"Everybody knows him. They're really torn up about it,\" Evans said. Boles served in the Army from 1964-68 as a noncommissioned officer in charge of the 793rd military police battalion in Bayreuth, Germany. He will be buried this week in Utica, Miss.\nDr. Margaret Louise “Peggy” Clark\nDr. Margaret Louise \"Peggy\" Clark loved her horses and loved her kids. She was a veterinary medical officer with the Department of Agriculture and only stopped at her office in the Alfred P. Murrah Federal Building for some last-minute business April 19. Clark's husband is David Spencer, and she had three daughters - Rosslyn, 16, Blayne, 13, and Chelsea, 6. She was active in the Future Farmers of America and 4-H clubs at Chickasha High School, where her oldest daughter attended classes. Before joining the Agriculture Department in 1994, Clark worked as track veterinarian at Blue Ribbon Downs. Her predecessor at BRD - Dr. Brian Espe - also worked for USDA and was seen on television climbing down a fire ladder after the blast.\nRichard Leroy Cummins\nFor the past 15 years, Richard Leroy Cummins had put his love for animals to good use. He was recognized in 1990 for his work on the Midwest Stolen Dog Task Force, which helped curb the theft of pets for sale to research institutions. As a senior investigator for the U.S. Department of Agriculture, Cummins worked to ensure that animal breeders, dealers and exhibitors complied with the standards of humane care and treatment outlined in the Animal Welfare Act. Cummins, 55, joined the USDA in 1965, working on the screwworm eradication program in Douglas, Ariz. Cummins worked in Henryetta and Durant as an animal health technician in the 1980s before joining the Oklahoma City office in 1987. A devoted family man, Cummins leaves behind his wife of 30 years, Frances, daughters Courtney and Nikki, and son Kraig.\nDoris Adele Higginbottom\nShe was never the type of person to back down from a challenge. Doris Adele Higginbottom, 44, joined the U.S. Department of Agriculture as a typist in 1978 and earned a bachelor's degree in English four years later. After brief periods at the Federal Aviation Administration and the San Antionio Express News, Higginbottom rejoined the USDA in 1980. She most recently was a Department of Agriculture purchasing agent. Higginbottom was active in women's issues and was manager of the Oklahoma City USDA's Federal Women's Program. Her husband's name is David and she had two stepchildren, Kelly and Van.\nCarole Khalil\nCarole Khalil, 50, was noted for her eye for detail and her ability to catch minute mistakes. Those qualities helped her excel in her job as an export document examiner for the U.S. Department of Agriculture. Khalil was responsible for ensuring paperwork was in order for the export of animals. She started work for the U.S. government as a clerk for the IRS in 1964. Three years later, she began working for the agriculture department. A native Oklahoman, Khalil lived in Shattuck and graduated from Laverne High School. She attended a business school in Oklahoma City before going to work. She had a daughter, Heather Khalil.\nRheta Ione (Bender) Long\nAn avid fan of Jewel Box Theater productions, Rheta Ione (Bender) Long was scheduled to attend a play the day she was killed. Long, 60, was a Guymon native who attended Panhandle State University before obtaining an education degree from Phillips University in 1955. \"She really didn't have hobbies. She was just really involved in her family and her church,\" said Janna Evans, U.S. Department of Agriculture spokeswoman. Long taught school for about five years and found her reward in teaching children that school and learning could be fun, Evans said. Long began her career in federal government in 1974 as a military personnel clerk for the U.S. Army. In 1978, she transferred to the Fish and Wildlife Service as a clerk. She joined the USDA's Animal and Plant Health Inspection Service in 1982 as a program clerk, Evans said. Because she had a vision disability, Long was assigned to educate workers about the disabled, Evans said.\nDepartment of Housing and Urban Development - 7th Floor\nDiane E. Althouse\nDiane E. Althouse, 45, was four days away from vowing her devotion as an associate of a Catholic abbey, the Rev. Charles Buckley said. Buckley, director of oblates at St. Gregory's Abbey in Shawnee said Althouse's oblation was scheduled April 23, a ceremony of devotion as a Benedictine Oblate Novice. \"She was very much given to her religion,\" Buckley said. Althouse, a member of St. John the Baptist Catholic Church of Edmond, worked at the Housing and Urban Development Department in downtown Oklahoma City. Memorials may be made to St. Gregory Abbey, 1900 W MacArthur Drive, Shawnee, OK 74801 or to the Disaster Relief Fund.\nAndrea Y. Blanton\nAndrea Y. Blanton, 33, worked as a secretary at the Department of Housing and Urban Development. Her husband is Daniel Blanton.\nKim R. Cousins\nChildren, especially her 9-year-old son Corey, were a big part of Kim R. Cousins' life. Cousins, 33, of Midwest City, was born in Ponca City, raised in Deming, N.M., and lived in East Texas before moving to the Oklahoma City metro area in 1985. She was an active member of South Lindsay Baptist Church, where she was a second-grade Sunday school teacher. Cousins also was active in the Parent/Teachers Association and was a homeroom mother at Steed Elementary. She had been married to husband Lyle M. Cousins for less than a year.\nDiana Lynn Day\nNorthwest Church of Christ minister Bill Day Jr. recalled that his sister, Diana Lynn Day, was always the one in his family with laughter, church secretary Gayle Thomas said. \"Probably everybody would tell you that she just always had a smile on her face,\" Thomas said of Day, 38. Thomas said Day was an outgoing and bubbly person who will be missed greatly. Day, who was the mother of Justin, 11, was a Housing and Urban Development program assistant. She and her son lived with her parents, Bill Sr. and Frankie Day.\nCastine Brooks Hearn Deveroux\nCastine Brooks Hearn Deveroux often talked of her faith and how much she had been blessed by God. Deveroux, 49, attended St. John Missionary Baptist Church in Oklahoma City where she was an usher and participated in a prayer group. Her prayer partner, Louise Peters, said Deveroux's comments were always touching and encouraging. \"She was a very lovely, devoted church member,\" Peters said. Deveroux had worked for Housing and Urban Development for seven years.\nJudy Fisher\nFor about four months, Judy Fisher had been exercising her shopping talents. While her husband, Marlon Fisher, was doing most of the physical remodeling of their home, Judy Fisher was busy picking out colors and supervising the project. The remodeling is about three-fourths finished, said her sister-in-law, Angie Jones. The most important part of Fisher's life, however, was her family. She had three children and a stepdaughter, and they often went camping together, Jones said. Fisher, 45, attended Community Bible Church and was involved in a prayer chain group. She worked for Housing and Urban Development.\nLinda Louise Florence\nAlthough she had many special interests, most of Linda Louise Florence's free time was spent reading and teaching her son, John David. Florence, 43, was a secretary for the U.S. Housing and Urban Development Department. She graduated from Putnam City High School in 1969 and had attended Oklahoma State University in Oklahoma City and Oklahoma City Community College. Florence and her husband, David, had been married for 16 years. With a love of traveling, Florence especially enjoyed going to the lake. She also had an interest in photography.\nColleen Guiles\nColleen Guiles, 59, of Oklahoma City, was an underwriter for the Housing and Urban Development Department. She had been a real estate broker in south Oklahoma City.\nGene Hodges, Jr.\nHis interest in sports and young people led Gene Hodges Jr., 54, to coach boys soccer for 5-year-olds. He also coached Little League baseball in Norman where he had lived since 1973. Hodges' government career extended more than 30 years. He was a supervisor for the Housing and Urban Development Department. Hodges was married to Deb Hodges and had four children.\nCarolyn Ann Kreymborg\nShe loved to learn and was working on her second degree in computer science at the University of Central Oklahoma. She also loved gardening and was especially fond of azaleas. Carolyn Ann Kreymborg, 57, died in the explosion with her daughter, Michelle Reeder. They attended an azalea show in Oklahoma City as their last activity together. Kreymborg, who was interested in art and enjoyed going to art museums, was an automation clerk for the Department of Housing and Urban Development. Her husband is James Kreymborg.\nTeresa Lea Lauderdale\nTeresa Lea Lauderdale, 41, was a realty specialist with the Department of Housing and Urban Development. She loved people and people loved her, her family said. Lauderdale, of Shawnee, had a selfless habit of placing the needs of others above her own and diligently worked to raise funds for worthy causes sponsored by the Federal Women's Program. Described as a dedicated mother, Lauderdale taught her sons, Brian, 19, and Greg, 16, compassion, trust, thoughtfulness, integrity and, most of all, love. Lauderdale had worked in the Oklahoma City HUD office for 13 years.\nMary L. Rentie\nMary Rentie was the type of person who put others before herself. Her only brother, Greg Leasure, said Rentie was one year and two days older than him. \"When she started walking, she took care of me,\" he said. Rentie had a good sense of humor, enjoyed quilting and was a wardrobe seamstress for some theater productions . \"She got real involved in quilting in the last few years and just loved it,\" Leasure said. Rentie worked for the Department of Housing and Urban Development on the seventh floor of the federal building. She had worked for HUD for about six years. The 39-year-old Bethany resident and her husband, Ben, have two daughters, Melissa and Melody.\nJames A. McCarthy\nJust four months ago, James A. McCarthy, 53, was transferred to Oklahoma City. McCarthy previously worked in the Kansas City office for the U.S. Housing and Urban Development Department. McCarthy had a wife and three children.\nBetsy Janice McGonnell\nThe choir at St. Michael's Episcopal Church in Norman held a special place for Betsy Janice McGonnell. An active member at St. Michael's, she served her church in a variety of ways, including lending her voice to the choir. McGonnell, 47, also had served on the church vestry. A native of Oklahoma City, McGonnell was a graduate of Northwest Classen High School and the University of Oklahoma. She worked in Single Family Loan Management for the department of Housing and Urban Development. Previously, McGonnell had been employed in the office of personnel management.\nPatricia Nix\nHer family never lost hope that she would be found. Patricia \"Trish\" Nix's family saw a television news camera videotape shot shortly after the explosion of a woman resembling Nix sitting on a curb. A photo taken from the video was shown by family members to Housing and Urban Development workers and hospitals in an effort to find their loved one. Nix, 47, of Edmond, was a financial adviser for HUD. She also was a member of MetroChurch and collected antiques.\nTerry S. Rees\n\"Teddy bears were collectibles for Terry S. Rees, 41. Rees loved to travel to teddy bear and crafts shows, friends and family members said. She was supervisor of public housing for the Department of Housing and Urban Development. Rees was married to Bob Chumard.\nJohn T. Stewart\nJohn T. Stewart, 51, of Midwest City, enjoyed breeding and racing horses, as well as woodworking. Stewart was employed by the Department of Housing and Urban Development and worked 27 years for the government. Stewart was in the National Guard. His brother, E.H. Stewart, of Shawnee, described him as, \"easygoing.\" \"He minded his own business, looked after his own family,\" Stewart said. His wife's name is Jean and they had three children.\nJohn K. Van Ess\nFour days before the explosion, John K. VanEss, 67, and his entire family - including children and grandchildren - gathered for a family portrait. It was the first time the family had done that, a friend said. VanEss attended Oklahoma A&M on a basketball scholarship and in his first year there, played on a national championship team coached by the legendary Henry Iba. VanEss would have retired from his longtime job at the Department of Housing and Urban Development at year's end. He is survived by his wife, four children and four grandchildren.\nJo Ann Whittenberg\nJo Ann Whittenberg, 35, was known for the Italian cream and 7-Up pound cakes that she took to work and bake sales. She was a program assistant at Housing and Urban Development. \"She was just a genuinely sweet person who was concerned about everyone,\" said her mother, Lee Ann Whittenberg. Born Feb. 6, 1960, in Oklahoma City, Whittenberg also has a twin sister. In addition, Whittenberg was never late.\nDepartment of Housing and Urban Development - 8th Floor\nTed Allen\nAs father of six children ranging in age from 4 to 22, Ted Allen spent many hours coaching youngsters in basketball and soccer. An avid gardener, he took great pride in his lawn care and vegetable crops at his Norman home. Allen, 48, was an urban planner for U.S. Housing and Urban Development. When he died April 19, Allen was writing state-by-state regulations for homeless housing programs. A graduate of East Tennessee State University, Allen attended graduate school at the University of Tennessee in Knoxville. He served as planner for local governments in Alabama and North Carolina before joining HUD in Dallas. Transferred to Oklahoma City in 1980, Allen left HUD in 1982. He spent eight years as city planner in Moore before rejoining HUD four years ago.\nPeter Avillanoza\nMusic was one of the joys of Peter Avillanoza's life. He played a variety of musical instruments and loved to compose and sing Hawaiian songs. A strong supporter of the community, Avillanoza was a football and baseball coach and taught judo at the YMCA. A native of Honolulu, Avillanoza was a former police officer and firefighter in Honolulu. He earned a bachelor's degree in criminal justice and a master's degree in public administration. He was transferred to Oklahoma City from California to become the director of the Office of Fair Housing and Equal Opportunity shortly before the bombing. Before the transfer, he worked in the HUD offices in San Francisco, Orange County, Calif., and Hawaii. He also worked for the Department of Justice. He had 6 Children and 14 Grandchildren.\nDavid Neil Burkett\nA graduate of Moss High School, David N. Burkett loved to attend ball games across the state to support his former school. Burkett, 47, also traveled across the United States working with Indian tribes as a leader for the reorganization of the Native American Department. He worked as a financial analyst for community development in the Department of Housing and Urban Development.\nDonald Earl Burns, Sr.\nDonald Earl Burns Sr., 62, worked as a construction analyst for the Department of Housing and Urban Development. He was a former football coach at Douglass High. School and taught woodworking for many years. As a coach at Douglass, Burns guided the lives of such future stars as Albert Chandler and Raymond Hamilton, both of whom played for the Oklahoma Sooners and the New England Patriots. \"He affected the lives of all his players in a positive way,\" Chandler said. \"Coach Burns was a great character builder for young men. He was very influential in both my academic and athletic careers. \"He'll surely be missed by all.\" Chandler said Hamilton is now a defensive line coach with the New York Jets. \"Raymond has called to express his sympathy,\" Chandler said.\nKimberly Kay Clark\nShe thrived on adventure and enjoyed long-distance biking and traveling. Kimberly Kay Clark, 39, was a legal assistant for the Housing and Urban Development Department and a petty officer first class in the U.S. Naval Reserve. She was born in Hong Kong on Feb. 24, 1956, and was adopted by Tommie and Agatha Lee Clark and became their \"China Doll\" on Aug. 14, 1962. She was engaged to marry Namat Moini of Oklahoma City.\nSusan Jane Ferrell\nCats, traveling, people and dancing - four of Susan Ferrell's loves. She had three cats, put a lot of miles on her feet in Europe, was always there to help a friend and loved to dance. Her mother, Sally Ferrell, said, \"Susan had an incredible passion for dancing.\" This included jazz, ballet, and belly dancing, which Susan called \"Cultural Heritage Eastern Dancing.\" She delighted in being a member of the Jewels of the Nile dancing troupe. Ferrell, 37, was an attorney for U.S. Housing and Urban Development.\nGeorge Michael Howard\nGeorge Michael Howard, 45, had transferred to the Department of Housing and Urban Development office in Oklahoma City on April 3 to escape the crime and high prices of San Francisco, and to be closer to his ailing father in Dallas. Howard, who was one-quarter Cherokee, was a community development planning representative for HUD's Office of Native American Programs. His wife, Perla Howard, also works for HUD and has a master's degree from Oklahoma State University. They were married in Stillwater. Perla Howard said her husband was as generous as he was impulsive. Last Christmas he took two fatherless neighborhood kids to see \"The Nutcracker.\" \"It was something he just decided he was going to do,\" she said. \"He said every child should see that ballet in their youth.\" Friends remembered him as a caring neighbor and a no-nonsense worker who was devoted to his job.\nAntonio “Tony” Reyes\nDora Reyes remembers her husband as a \"very generous, very outgoing, very friendly\" person. Antonio \"Tony\" Reyes, 55, of Edmond, was an equal opportunity specialist for the Department of Housing and Urban Development. The retired Navy senior chief petty officer was working on the eighth floor. His son, Michael Reyes, 30, a HUD asset manager on the seventh floor, survived a four-story fall. Antonio Reyes was involved in the area's Hispanic communities and organizations, his wife said. Antonio and Dora Reyes also have a daughter, Delia Marie Northup.\nLanny L. Scroggins\nCoaching and playing ball with his two boys topped Lanny L. Scroggins' list of favorite activities, followed by fishing. Scroggins' wife, Cheryl, described him as a wonderful, multifaceted person who loved music of all kinds and many outdoor activities. Scroggins, 46, of Oklahoma City, was an avid OU football fan. He loved working on cars, and as a young man he enjoyed drag racing. He also enjoyed all types of water sports. He had been a federal employee for 23 years, serving with several agencies in various accounting and financial management positions. At the time of the blast, he was working at the Department of Housing and Urban Development. A decorated Vietnam veteran, Scroggins served in the First Air Cavalry. Medals he received included the Bronze Star and the Army Commendation Medal for Heroism.\nLeora Lee Sells\nThough she hailed from Nebraska, Leora Lee Sells was a wholehearted Sooner. She and her husband, Roy Sells, went to almost every University of Oklahoma home game in almost every sport. They had only missed five football games during their marriage. Sells, 58, had sung in the choir at Our Savior Lutheran Church for more than 30 years. She also was a Sunday school teacher and at one time had been a youth counselor for her church. \"She was central to the congregation,\" said the Rev. Peter Tremain, pastor. Sells, a legal secretary for Housing and Urban Development, also was known for her friendliness when answering the telephone.\nJules Valdez\n\"He was always willing to work, always willing to put forth an extra effort. \" That's how a fellow Rotarian described Jules Valdez, 51, of Edmond. Valdez worked in the Indian Affairs division of the Department of Housing and Urban Development. A 1991 Edmond City Council candidate, he was a member of St. John the Baptist Catholic Church, the Edmond Central Rotary Club, Leadership Edmond, the Edmond Area Chamber of Commerce and the Oklahoma Bar Association. He and his wife, Virginia, have a daughter, Marisa.\nDavid Jack Walker\n\"He was a wonderful father,\" Janet Walker said of her husband, David Jack Walker of Edmond. \"He loved his three girls more than any father could. He never hung up the phone without saying, 'I love you.' \" The environmental specialist with Housing and Urban Development was \"a funny man with a big heart,\" his wife said. \"He laughed all the time.\" Walker, 54, was a lifetime member of the First Baptist Church of Nicoma Park and was actively serving on the building committee. In addition to his three daughters, he had a stepson and two grandsons.\nMichael Don Weaver\nMichael Don Weaver met his wife, Donna, while both were attending the University of Oklahoma. He proceeded to add the fun to her life for the next 21 years. For the last five years he had served as general counsel for the Department of Housing and Urban Development. Weaver, 45, was in his office when the bomb destroyed the building. Weaver will be missed during the family's annual get-together, where he played co-host for the \"Clique Awards\" along with his brother Greg. Weaver's laughter, dry sense of humor and role of the \"straight man\" will always be remembered by his family.\nFrances Williams\nFrances Williams, 48, had worked as a secretary with Housing and Urban Development for eight years. \"She was an excellent mom and grandmother,\" said her daughter, Dawn Mahan. She said her mother was an active member at her church, Crossroads Cathedral. Mahan said that her mother's favorite pastimes included playing with her three grandchildren and eating sweets, especially cake. \"I love her and will always miss her,\" Mahan added. \"We will reunite one day.\" Williams is survived by a brother, two children and three grandchildren. Her mother is Mozelle Bibb.\nClarence Eugene Wilson\nClarence Eugene Wilson, who was chief legal counsel for Housing and Urban Development, had served as a councilman for the city of Forest Park. His sister-in-law said he was a caring person who helped everybody. Wilson, 53, was the first black to earn a Bachelor's degree in Pharmacy from the University of Oklahoma before studying law at OU. Wilson has a son, Clarence Wilson Jr. Other survivors include: two brothers, Thomas L. Wilson and George F. Wilson; two sisters, Bernice McGee and Patsy Jones. Wilson was born on August 8, 1945 in Lawton, OK. He was the fourth of five children born to James and Estella Wilson. Both parents and one son, Mark, preceded him in death.\nDepartment of Housing and Urban Development - 5th Floor\nPaul Broxterman\nHe had spent nearly half of his 43 years in government service work. Employed by the Department of Housing and Urban Development, Paul Broxterman was working as a criminal investigator through the inspector general's office when the April 19 bombing occurred. Broxterman served in the Navy from 1971 to 1977 and spent part of that time in Vietnam as a radio man on the USS Enterprise. He later worked as a tax examiner for the Internal Revenue Service, as a criminal investigator for the Bureau of Indian Affairs and as a special agent for the U.S. Department of Agriculture. Broxterman was a member of the Potawatomi Tribe and was active in American Indian activities. He is survived by his wife, Cammy; sons Aaron and Jerod; and daughter Cassandra.\nDrug Enforcement Administration - 9th floor\nShelly Bland\nFamily came first to Shelly Turner Bland, said her husband, Gary. An asset forfeiture specialist for the Drug Enforcement Agency, Shelly Bland, 25, was devoted to her daughter, Jordan Elizabeth, Gary Bland said. \"One of her greatest qualities was that she was a wonderful mother,\" Gary Bland said. \"She loved her little girl very much. \" Gary Bland said Shelly's \"best friends\" were her family, especially her mother, her sister and her aunt. \"She loved the family. She was family-oriented,\" Bland said. Shelly and Gary Bland had been married for less than a 1 year. They were wed on June 3, 1994.\nCarrol June “Chip” Fields\nThe 30-year federal government employee was someone people could count on, her co-workers said. Carroll \"Chip\" June Fields, 48, was the lead support person in the U.S. Drug Enforcement Agency's Oklahoma City office. She was honored with the DEA Administrator's Award for Distinguished Service in 1994. Fields was a 1965 graduate of Shawnee High School. She and her husband, Ronald L., have a 21-year-old son, Ronald W.\nRona Linn Kuehner-Chafey\nShe was the type of person \"who kept the drawer full of candy,\" said Cleveland County Sheriff Dewayne Beggs. Rona Linn Chafey, 35, had worked for Beggs as a dispatcher before being assigned duty as a secretary in the Federal Building about two years ago. Because of her proficiency, Beggs said her talents should be used by the Drug Enforcement Administration in Oklahoma City on a special task force. She was able to keep information confidential, and she was dedicated to her work. \"She was a person who really liked her job. I never saw her without a smile. She was always up, very light and a kind person,\" Beggs said. Chafey was a graduate of Bethany High School and had attended Oklahoma City Community College and Rose State College. She was a jovial person who did not mind pulling a few pranks on people sometimes. She was married to Raymond Chafey and their children are Misty Monet Chafey and Nicholas Brooks Chafey.\nCarrie Ann Lenz and baby\nCarrie Ann Lenz, 26, of Choctaw and unborn son Michael James Lenz III died in the bombing disaster. Lenz was a contract employee of Dyncorp, and was assigned with the U.S. Drug Enforcement Administration in Oklahoma City. A member of the Draper Park Christian Church, she was a 1986 graduate of Moore High School and received a bachelor's degree in advertising from Central State University in Edmond in 1990. She was an honor student every year. She was married to Michael J. Lenz Jr.\nKenneth Glenn McCullough\nKenneth Glenn McCullough, 36, was an agent for the Drug Enforcement Agency for five years, continuing a life of service to his country that began with his tenure as a member of the Corps of Cadets at Texas A&M University in College Station, Texas. He served in the Army from 1980-86, then worked for the Department of Defense from 1986 until he went to work for the Drug Enforcement Administration. Donations may be made to the Kenneth McCullough Memorial Fund at First Baptist Church in Edmond for his children's education.\nFederal Employees Credit Union - 3rd floor\nWoodrow Clifford Brady\nWoodrow \"Woody\" Clifford Brady, 41, of Oklahoma City was a publisher of children's books. Brady was a customer at the Federal Employees Credit Union on the third floor of the building when the blast occurred. He was buried at St. Paul's Cemetery in Meeker.\nKimberly Ruth Burgess\nDescribed as a loving and caring wife, Kimberly Ruth Burgess married her longtime love, Damon W. Burgess, in November 1993. The couple moved to Oklahoma City, where they resided at Tinker Air Force Base. Burgess, 29, a 1983 graduate of Evergreen High School in Colorado, was the administrative assistant to the chief executive officer of the Federal Employees Credit Union. After attending the University of Northern Colorado, she moved to Denver in 1985 and managed a Red Cross Shoe Store. She moved to Columbia, S.C., in 1988 and worked for the Charleston Naval Shipyard Federal Credit Union. In 1992, she returned to Denver where she worked for the Public Service Employees Federal Credit Union. She is survived by her husband Senior Airman Damon W. Burgess; parents David W. and Ramona R. Klaus of Evergreen, Colo.; brother Michael J. Klaus of Parker, Colo., grandmother, Eileen Mosbarger of Clancey, Mont.; grandmother Paula Klaus of Lake Elsinore, Calif., a number of loving uncles, aunts, cousins and a host of extended family and loving friends.\nKatherine Ann Finley\nFor 21 years, Katherine Ann Finley had been working her way up through the ranks at the Federal Employees Credit Union. Finley, 44, began working there as a teller and had served as the credit union's vice president for the past 10 years. She was born and raised in Oklahoma City.\nJamie Lee Genzer\nJamie Lee Genzer, 32, of Wellston, was a loan officer for the Federal Employees Credit Union. She was born Sept. 12, 1962, in Shawnee, to Jerome E. & Nancy A. (Hammons) Fialkowski. She was a graduate of Mount St. Mary's High School and a member of Our Lady of Sorrows Catholic Church of Chandler, Ok. She moved from Midwest City to Wellston in 1994 where she was a member of Band Parents and PTA. She was also a member of the Sweet Adelines where she sang bass. She was a member of the Cameo's Quartet. She also was on the board of directors of the America's Kids Day Care in the Murrah Building. She is survived by her two children, Kyle & Krista Genzer of the home; her parents, Jay & Nancy Fialkowski of Midwest City; her brother, Jef Fialkowski and wife, Lori of Edmond; her sister, Anna Marie Perdue & husband, John, of Wellston; maternal grandparents, Agnes & Lee Jones of Edmond; several nieces, nephews, aunts, uncles & cousins.\nSheila R. Gigger and baby\nSheila R. Gigger Driver, 28, was a resident of Oklahoma City. She was a student at Langston University and was making a deposit at the Federal Employee Credit Union in the federal building at the time of the explosion.\nLinda Coleen Housley\nMaking stuffed animals and collecting clowns were two of Linda Coleen Housley's favorite hobbies. Housley, 53, worked as a loan officer in the Federal Employees Credit Union. Before going to work for the federal credit union, she worked for the Woods Credit Union. A graduate of Putnam City High School, Housley lived in the Oklahoma City area most of her life. She attended Highland Baptist Church in Moore. Her husband's name is Gary and she has three children and two stepchildren.\nRobbin Ann Huff and baby\nGod and family came first in Robbin A. Huff's life. She and her husband, Ronald, were looking forward to the birth of their first child in June. Huff, 37, of Bethany, was a loan officer at the Federal Employees Credit Union and loved working in her flower garden. \"Just as Robbin chose each angel to be a part of her special collection, we know God has chosen her to be a special part of his choir of angels,\" her family wrote for her obituary.\nChristi Jenkins\nHer children and her church. That was Christi Jenkins' life, said her pastor, Ben A. Baldridge, of New Life Tabernacle, United Pentecostal Church of Edmond. Jenkins, 32, was a teller at the Federal Employees Credit Union, where she had worked for nine years. For the last five years, she was a devoted member of the New Life Tabernacle church, where she rarely missed a service, Baldridge said. \"She was one of the most dedicated mothers and church members,\" the pastor said. \"Her life was her children and her church.\" Her husband, Aldo Jenkins, is a deacon in the church. She taught Sunday school, was a greeter at the church and was active in the ladies' ministry to sick people, Baldridge said. The couple had four children: Shimar, 16; Shawna, 14; Shelby, 13, and Scott, 11. \"Christi was hardworking, diligent and always smiling. That describes her best,\" Baldridge said. \"She was just a caring person.\" A memorial fund for Christi Jenkins has been established. Donations should be sent to New Life Tabernacle, PO Box 693, Edmond 73083.\nAlvin Justes\nThey weren't really close. Hadn't been in years. Still, they were brothers. So Harvey Justes, living on the family farm in East Bernstadt, Ky., immediately thought of his brother, Alvin, when he heard about the April 19 bombing in Oklahoma City. But it wasn't until a month later that he learned that his brother probably was dead. \"It was really a blessing that whole time, not knowing\" that his brother probably had been in the Alfred P. Murrah Federal Building, Harvey Justes said. Their sister, Violet, had tried unsuccessfully to contact Alvin since the day of the federal building bombing. After a month, she figured it was time to tell the police. Authorities disclosed May 23 that they suspected Alvin Justes, 54, was victim No. 168. \"That's been a big worry, just the wondering,\" Harvey Justes said Monday night upon being informed that a body believed to be his brother's had been recovered. He was a regular customer at the Federal Employees Credit Union, and an employee who survived said she saw Justes moments before the explosion. It was easy to understand why it took so long for him to show up on the \"missing\" list. Justes had no family in Oklahoma City and there were few people who noticed him missing. He lived nearby, traveled by bus and owned no vehicle to be recovered after the blast. Alvin Justes left home for Oklahoma at age 19 - perhaps to satisfy his curiosity about Indians, his brother said - served time in the military during the Vietnam War, then returned to Oklahoma. He had been disabled for several years, the result of breathing in toxic fumes at some point in his work career, Harvey Justes said. He described his brother as a \"loner\" who hadn't returned to Kentucky since their father's funeral in 1982. \"I'm sure I'll miss him,\" Harvey Justes said. \"I hadn't seen him in a long time, but I always knew he was there. \"\nValerie Koelsch\nValerie Koelsch of Bethany often said she had three families - her God-given family, her church family and her Federal Employees Credit Union family. Koelsch, 33, was the credit union's marketing director. She attended St. Patrick Catholic Church, where she was involved in many of the church's ministries. In 1993, she went to World Youth Day in Denver to see the pope. She later was quoted in a story in The Oklahoman saying that she disagreed with surveys that showed many American Catholics disregard church teachings. \"I think that's way off base,\" Koelsch said in the story. \"I don't think that's true, for me at least.\"\nCatherine Mary “Kathy” Leinen\nAfter 13 years as a collection officer with the Federal Employees Credit Union, Catherine Mary \"Kathy\" Leinen was looking forward to the day she could retire. Retirement would mean more time to travel and to camp, which she loved. She also enjoyed working on crafts with her husband. Leinen, 47, was married to Henry Carlile. Her family said she was the light of their lives.\nClaudette Meek\nOffering assistance to others was one of Claudette Meek's primary goals. Vice president of financial services at the Federal Employees Credit Union, the 43-year-old Meek often helped credit union members secure loans and assisted with forms. A Federal Employee Credit Union employee for more than 13 years, Meek also had worked as a loan officer and a head teller. Florence Rogers, credit union chief executive officer and president, said Meek had an infectious laugh, was loved by her employees and conducted pep rallies instead of meetings. Meek attended Southgate Baptist Church, 809 SW 4 in Moore. She and her husband, Mike, had a daughter, Michelle, and a son, Robert.\nFrankie Ann Merrell\nFrankie Ann Merrell, 23, was a loving mother to her only child, a person who loved life and always gave of herself. If any of her friends or their families needed help, Merrell was there. \"She would go out of her way to help them,\" a friend said. She was described as of the most caring individuals a person would ever meet and an outstanding mother of her 2 1/2-year-old daughter, Morgan Taylor Merrell. Merrell, 23, was a teller at the Federal Employees Credit Union for three years. Born Oct. 25, 1971, in Fort Smith, Ark., she graduated from Putnam City High School. Her husband, Charles Wayne Merrell, said she was a devoted wife, and was pulling her life back together after the death of her father a year ago. An educational trust fund has been set up for her daughter. Memorials may be sent to the Morgan Taylor Merrell Trust Fund, Bancfirst, Attention: Bud Ham, PO Box 26788, Oklahoma City 73126-0788.\nJill Diane Randolph\nJill Diane Randolph, 27, was committed to her church, where she was active in the Singles Twenties Group and the Bible Study Fellowship, said her sister. Randolph's sensitivity, sense of humor, caring and love for her family and friends, and especially her cat, Rascal, were outshined only by her devotion to her Christian faith, her family said in a classified obituary. She had worked as an accountant in the Federal Employees Credit Union since December 1993.\nClaudine Ritter\nClaudine Ritter had friends around the United States and 1 was always helping others, her cousin, Marilyn Harrington said. In fact, Ritter was constantly taking trips just to visit her elderly aunts and uncles hundreds of miles away. \"She'd go just to be with them, then take them places,\" Harrington said. \"She was the kindest person, and she loved her three grandchildren dearly. \" Ritter, 48, of Moore, had been a collection officer for the Federal Employees Credit Union since February 1987. Ritter was raised in Atwood and joined the Army in 1965. She maintained active and reserve status. She attended Rose State College and Central State University, where in 1982 she earned a bachelor's degree in accounting. She also obtained her teaching certificate.\nChristine Nicole Rosas\nShe was the \"kind of person who always wanted to give to others before getting anything for herself\" is the description of Christine Nicole Rosas, 22, as given by her husband, Chris Rosas. She had only worked five full days as a receptionist at the Federal Employees Credit Union before the explosion. Before that, she worked for five years at Southwestern Bank. A 1990 graduate of Moore High School, Christy \"always made people happy,\" said her husband. Christy loved taking care of her family, which included son Shane Michael Rosas, 5, and adored her friends. In lieu of flowers, a special fund has been established for Shane Rosas. It is the Christy Rosas Trust Fund, Southwestern Bank and Trust, P.O. Box 19100, 6000 S Western, Oklahoma City 73144.\nSonja Lynn Sanders\nSonja Lynn Sanders, 27, had an outgoing personality, said her mother, Sheila Stroud. She loved her job at the Federal Employees Credit Union, where she worked for six years and had recently received a promotion. She and her husband, Mike, lived in Moore with their daughters, Brooklynn Nicole, 3, and Savanna Marie, 22 months. Sanders was a 1985 graduate of Moore High. She was an active member of Southgate Baptist Church in Moore. She was attending college and working toward a degree in banking and business. Sonja's sister, Kristi, is married to the brother of Sonja's husband.\nKaran Sheperd\nShe was one of the favorite loan officers in the Federal Employees Credit Union. About a year ago, loan officer Karan Shepherd saved a first-time car buyer $3,000, said Florence Rogers, chief executive officer of the Federal Employees Credit Union. A girl was trying to buy a car and as Shepherd processed the application she decided to call the dealer directly, Rogers said. Shepherd was able to talk the dealer down by $3,000. Shepherd, 27, joined the credit union in the Alfred P. Murrah Federal Building in October 1988. She had attended Moore High School and Draughon School of Business. Shepherd had two daughters, Brittany Miller, 10, and Gabby, 4. Shepherd and her husband, Jay Shepherd, live in Moore and enjoyed attending the girls' T-ball games, Rogers said. Other survivors are nephew Eric Truelove of the home; father Paul R. Howell of Oklahoma City; mother Shirley Howell of Oklahoma City; two sisters, Vicki Truelove, Muskogee, OK, and Lana Nowicki, Oklahoma City; a niece & nephew, Shylie & Christopher Nowicki of Oklahoma City; maternal grandparents, Eddie & Iva Dunn of Oklahoma City; maternal great grandmother, Agnes Smith of Oklahoma City; father & mother-in-law, Don & Dixie Shepherd of Oklahoma City, and numerous other relatives and friends. In addition to her family, Karan is survived by a special friend, John R. Strain, who was always there to help her.\nVictoria J. Texter\nHer VISA card program was such a model of excellence, Victoria J. Texter, 37, had recently been interviewed by a national credit union magazine for a story that now will serve as a tribute to her. Texter was the VISA coordinator and a backup computer operator at the Federal Employees Credit Union, where she had worked the past 14 years. A native of Chicago, Texter had lived in Oklahoma City since 1981. Her husband, Jim, said she had been attending Rose State College, taking a variety of physical education courses. She was a member of Sunnylane United Methodist Church, United Methodist Women and American Business Women's Association. Texter enjoyed making porcelain dolls and growing perennial flowers in her garden. A memorial fund has been established at her church, and a college trust fund for her son, James Texter III, 15, has been set up at the Federal Employees Credit Union.\nVirginia Thompson\nHer children say their mother raised them alone and taught them discipline, independence and self-sufficiency, instilling a work ethic in them early. Virginia Thompson, 56, of El Reno, had been employed by the Federal Employees Credit Union since January. Before that, she had worked 25 years at the Rock Island Credit Union in El Reno. She was the mother of two sons and a daughter - Ken, Phil and Shelly. She always got to work at 8 a.m. each day and as receptionist took incoming calls for the credit union. \"Logic would tell you she would be answering the phone at her desk at 9:02,\" Phil said. Ken recalled his mother as \"the most giving person I've ever met in my life,\" and Phil said his mother was a \"phenomenal woman, one who could literally almost do anything.\" During the past year, Ken said he saw in his mother \"a kind of peace,\" that she had done her best with her children and they were doing OK.\nTresia Worton\nPersonality - Tresia Worton had it and shared it. \"She was a real fun girl. She had a wonderful personality. She just bubbled,\" said Florence Rogers, chief executive officer of the Federal Employees Credit Union, where Worton, 28, was a teller at the time of the bombing. Rogers, a survivor of the blast, remembers that peppy personality being primary in Worton's hiring last October. \"She was so persistent. She kept calling and calling us for a job, and finally we took a chance on her. \"And she was perfect. She was very proud of her job. Worton, who was single and lived in Oklahoma City with her adopted Lhasa apso, will be buried in Midland, Texas, where her parents reside.\nGeneral Services Administration\nSteven Douglas Curry\nSteven Douglas Curry, 44, of Norman, was on the job as a building mechanical inspector for the General Services Administration when the blast hit. Curry was an avid fisherman and hunter. He also was very active in Calvary Free Will Baptist Church, including serving as a deacon and as a coach of a church basketball team. He had lived in Norman since 1974 and served in the Navy from 1970-74. Born in Oklahoma City in 1950, Curry moved to Choctaw in 1958 and graduated from Choctaw High School in 1969. He married Kathleen Williams on March 8, 1974, in Norman. The couple have a son and daughter.\nMichael Loudenslager\nMichael Loudenslager, 48, of Harrah, was employed as planner/estimator on the first floor of the Murrah building in the area of General Services Administration (GSA). He was at work during the explosion. He was also an Oklahoma County Reserve Sheriff (Mounted Patrol), a member of the U.S. Marshall Posse and a Mason and Shriner. \"His family and horses are his life,\" said Diana, his daughter. Loudenslager and his wife, Bettie, have two children, Diana and Kyle.\nOklahoma Water Resources Board Building\nRobert N. Chipman\nA \"prince of a guy,\" is how Edmond Memorial High School Principal Larry Maxwell describes Robert N. Chipman. \"He was a great guy to be around and work with,\" Maxwell said. \"It's a shame that has to happen to someone like that, (someone who) has such a positive outlook on life. \" Chipman, 51, had been with the Oklahoma Water Resources Board as a financial analyst six months. He was married to Gloria J. Chipman, and they have two daughters, Catherine M. Chipman Talbert and Julie A. Szabolcsi; and one son, Carl C. Chipman.\nTrudy Rigney\nTrudy Rigney, 31, of Broken Arrow was a senior studying geography at the University of Oklahoma. Rigney had worked her way through personal obstacles and health problems to get where she was, her faculty adviser said. She was serving an internship as an assistant with the Oklahoma Water Resources Board when the blast hit. She is survived by an 11-year-old son.\nRescue Worker\nRebecca Anderson\nRebecca Anderson, 37, \"gave the ultimate gift to mankind\" when she collapsed and later died rescuing survivors at the bombed federal building. \"She gave her life helping other people. \"She was safe. She could have stayed home,\" her husband, Fred Anderson, said. Rebecca was a practical nurse at Brookwood Nursing Center. Her children are Hilary Johnson, 15; Gabe Johnson, 18; Rachael Harrold, 12; and Britton Harrold, 10.\nSocial Security Administration - 1st Floor\nTeresa Alexander\nTeresa Alexander, 33. A wife and mother of three, Teresa Alexander was always on the go. Alexander, of Oklahoma City, had gone alone to the Alfred P. Murrah Federal Building to get a Social Security card for her 8-month-old son Sean. She worked two full-time jobs: as a nurse's assistant at Baptist Medical Center and as a pool supervisor at the Marriott Hotel. Still, she found time to be a Girl Scout leader and attend regular functions at St. Eugene Catholic Church with her husband, Martin, and their children, Michael, 15, Latress, 13, and Sean. Alexander's sister, Marian Spears, said she also was involved in St. Eugene's Catholic School. Dentist Stephen Chastain attended church with Alexander and knew the family well. He helped start the Teresa Alexander Family Assistance Fund. \"Teresa was quiet, very humble, never said a bad word about anybody,\" Chastain said. Donations to the family assistance fund set up in her name can be sent to: Teresa Alexander Family Assistance Fund, c/o First Fidelity Bank, Box 82189, Oklahoma City, OK 73148-0189.\nRichard Allen\nIn college, Richard Allen played center and served as co-captain for the Panhandle State University football team. He attended school on a full athletic scholarship. Allen, 46, of Yukon worked as a claims representative for the Social Security Administration. Before going to work for Social Security in 1973, Allen was stationed with the 65th Military Police Platoon at Dugway Proving Grounds in Utah.\nPamela Cleveland Argo\nPamela Cleveland Argo, 36, of Oklahoma City, loved life. Argo, a data entry specialist at Presbyterian Hospital, was the second person positively identified as a fatality in the April 19 explosion. Friends say Argo began her day like she did most days, \"full of life\" and with everything planned. She had a 9 a.m. appointment at the Social Security Administration in the Murrah Building. She loved black clothes and bright red lipstick, stylish hats and big jewelry. Her favorite biblical passage was the Beatitudes. She also delivered homebound meals and assisted AIDS foundations and Feed the Children. She and her sister, Christi Young, had just planted 75 gladiola bulbs in her yard.\nSaundra G. Avery\nSaundra \"Sandy\" Avery loved to work with the children at her church. She attended Life Christian Center, where she played in the orchestra and bell choir. Avery, 34, of Midwest City, was a development clerk at the Social Security Administration. She also was taking sign-language classes at night school.\nCalvin Battle\nCalvin Battle, 62, was a quiet man, but not when it came to sports, said his daughter,Janet Battle. \"He liked the pro teams and he was a die-hard OU fan,\" she said. On April 19, Battle and his wife, Peola, went to the Social Security office in the Alfred P. Murrah Federal Building to apply for disability assistance because he had recently suffered a stroke. Peola Battle also died in the explosion. Calvin Battle had worked as a machinist for Corken International, his daughter said. She said her father did not judge people, but was very accepting of everyone he met. \"And he loved the Lord,\" she said. Battle attended the Church of the Living God Temple 234. He and his wife had been married 39 years. He had four daughters and a son.\nPeola Battle\nA person \"who never met a stranger,\" Peola Battle, 51, of Oklahoma City, made friends wherever she went, said her daughter, Janet Battle. Janet Battle said her mother and father, Calvin Battle, had gone to the Murrah building to apply for disability assistance for Calvin, who recently had suffered a stroke. Since her husband could not drive, Peola drove him to his appointment. Calvin Battle also was killed in the bombing. Janet Battle described her mother as a \"Christian lady\" who attended Greater Mount Carmel Baptist Church. Janet Battle said her mother and father raised four daughters, including herself.\nOleta Biddy\nOleta Christine Biddy always had a smile on her face, said her sister-in-law, Doris Jennings. People seemed to love being around her, as shown by the 1,000 who attended her funeral Monday at the First Baptist Church of Tuttle. \"She was just a fabulous person,\" Jennings said. \"I said when she married my brother that I could have been jealous because my parents thought she was so wonderful, but she was. \" Biddy, 54, also enjoyed working in the church nursery. She was a service representative for the Social Security Administration. Her survivors include her husband, Henry, two sisters and a son and daughter-in-law.\nCassandra Kay Booker\nCassandra Kay Booker \"was a sweet, caring person,\" said her mother, Gloria Graves. \"She would reach out to everybody and always be there for you when you needed her. \" Platt College has established an annual scholarship in her name and many have donated money toward a trust fund for her four children. Booker, 25, was applying for Social Security cards for two of her children at the time of the bombing.\nCarol Bowers\nCarol Louise Bowers, 53, was an operations supervisor for the Social Security Administration. She was born in Chandler, OK on Oct. 4, 1941. In September 1963, she married Jerry Bowers, who operates B&B Plumbing in Yukon. Relatives said Carol Bowers was the kind of person who bubbled and spread joy wherever she went. She was a longtime worker at Social Security who did all she could to help her clients and loved working there, they said. She always answered the phone with a happy voice. A minister said her husband, Jerry, told him they \"got married (in 1963) and grew up together.\" They also were active in the Corvette Association.\nPeachlyn Bradley\nShe was only 3 years old, but she acted like she was 23, her aunt Donnia Banks said. Peachlyn Bradley \"touched everyone she met,\" Banks said. Bradley's great-grandmother, Mary Hill, said the girl \"was the laugh of everything.\" Peachlyn died in the bombing along with her grandmother, Cheryl Bradley Hammons, and her 3-month-old brother, Gabreon Bruce. The family, including Peachlyn's mother, Dana Bradley, 20, had gone to get a Social Security card for Gabreon. Dana is now recovering after her leg was amputated. Dana's sister, Felicia Bradley, 23, was with them, too, and also is recovering from injuries.\nGabreon Bruce\nThree-month-old Gabreon DeShawn Lee Bruce was a \"lovable\" baby, said his great-grandmother, Mary Hill. The family enjoyed holding him, and Hill said she had held the baby exactly one week before the April 19 bombing. Gabreon's mother, Dana Bradley, 20, had taken her son to the Social Security office to obtain a card for him. Gabreon's grandmother, Cheryl Bradley Hammons, was killed in the blast, and Dana and Gabreon's aunt Felicia, 23, were injured.\nKatherine Louise “Kathy” Cregan\nKatherine Louise (Kathy) Cregan, 60, was a widow devoted to her three sons, William, Regis and Christopher, her two grandsons, Sean and Jonathan, and her three granddaughters, Rachel, Carrie and Michelle. She was fond of telling friends how much she loved to spoil them. Her two dogs, Yorkshire terriers Max and Jason, also received a great deal of her attention. Cregan, 60, was born Nov. 15, 1934, in West Memphis, Ark. She was a longtime resident of Oklahoma City and a graduate of Classen High School. She worked as a claims representative for the Social Security Administration for 13 years.\nAshley Meagan Eckles\nAshley Megan Eckles, 4, had gone with her grandparents, Luther and LaRue Treanor, to the Social Security office on the ground floor of the Murrah building. Her grandfather was to retire in May and he had a 9:15 a.m. appointment at the Social Security office. They arrived a little early and were in the building when the bomb exploded at 9:02 a.m. Ashley's aunt, Lois Treanor, said, \"Ashley was a happy child who knew no strangers. She had a big heart.\" Ashley is survived by her mother, Kathleen Eckles Treanor; her stepfather, Mike Treanor; and two brothers David, 9, and Zachary, 7.\nDonald Lee Fritzler\nDonald Lee Fritzler, 64, and his wife, Mary Anne Fritzler, 57, of Oklahoma City had celebrated their 35th wedding anniversary the day before the federal building explosion. The Fritzlers were married April 18, 1959. Don was especially known for his work designing churches. He attended high school in Hooker and graduated from the University of Oklahoma, where he received a bachelor's degree in architecture. He served as a principal in architectural firms, including Fritzler and Associates, which he had headed since 1980. Mary Anne had taught high school in the Oklahoma City and Midwest City-Del City school districts for 14 years. She attended Southeast High School in Oklahoma City and OU, where she received a bachelor's degree in business education. In 1982, Mary Anne joined her husband at Fritzler and Associates, where the two worked side by side.\nMary Anne Fritzler\nDonald Lee Fritzler, 64, and his wife, Mary Anne Fritzler, 57, of Oklahoma City had celebrated their 35th wedding anniversary the day before the federal building explosion. The Fritzlers were married April 18, 1959. Don was especially known for his work designing churches. He attended high school in Hooker and graduated from the University of Oklahoma, where he received a bachelor's degree in architecture. He served as a principal in architectural firms, including Fritzler and Associates, which he had headed since 1980. Mary Anne had taught high school in the Oklahoma City and Midwest City-Del City school districts for 14 years. She attended Southeast High School in Oklahoma City and OU, where she received a bachelor's degree in business education. In 1982, Mary Anne joined her husband at Fritzler and Associates, where the two worked side by side.\nLaura Washington Garrison\nLaura Garrison, 61, had worked hard for her family all her life, but preparing retirement papers at the Social Security office brought her to the Alfred P. Murrah Federal Building. She had helped lay to rest one sister a month earlier. She had a special bond with one of her brothers, William, who suffered a neck injury as a young man during a football game. \"Laura would come down to the hospital at least three days a week to take care of him,\" said Samuel L. Washington, another brother. \"She was a quiet sister, devoted to her job and her family.\" Garrison was a Luther High School graduate. She lived in California for a while, but did not want to raise her three children on the coast and returned to Oklahoma. An admissions clerk at Oklahoma Memorial Hospital, Garrison planned to retire in July. She and her husband, Fred, have two daughters, Tracy Rushing, 39, and Kerry Hatcher, 35; as well as one son, Harold Taylor, 34.\nMargaret Betterton Goodson\nWhether cruising the countryside as a member of the Happy Bottoms Motorcycle Club or planting trees or watching birds - especially blue jays - Margaret Betterton Goodson thrived outdoors. Goodson, 54, lived in Oklahoma City and was a claims representative with the Social Security Administration, working with the disabledbecause she \"wanted to help people.\" She had spent nearly 20 years with the federal government. Goodson's passions included her motorcycle club's travels, with her favorite trip a ride to Mena, Ark. \"She always talked about how beautiful it was there,\" said Debbie Gomez, her daughter and one of two children, along with son Keith Betterton. She was married to Ron Goodson.\nEthel Griffin\n\"She was very outgoing, and she had the tenacity of a bulldog.\" That is the description of Ethel Griffin, 55, as given by her son, Bob Griffin, a minister from Independence, Mo. \"She knew right from wrong, and she was raised in an era where people knew the difference between right and wrong,\" he said. Ethel Griffin was a claims representative for the Social Security Administration. \"She was about 25 feet inside the glassed area where the bomb blast occurred,\" Bob Griffin said. An Edmond resident since 1976, Ethel Griffin and her husband, Bruce, a design engineer in Guthrie, were married 26 years. Their other son, Richard Griffin, lives in Shawnee, Kan.\nCheryl Bradley Hammon\nCheryl Bradley Hammons spent her life taking care of people, said her mother, Mary Hill of Oklahoma City. \"That is what she loved to do,\" Hill said. She also loved dancing and knitting. Hammons, 44, worked as a nurse at Four Seasons Nursing Home, where she had many friends. She also had been a nurse at Presbyterian Hospital and Oklahoma Medical Center. She was a pleasant person who smiled and joked a lot but could also be serious, said her sister, Donnia Banks.\nRonald Vernon Harding, Sr.\nThe last time Clarice Harding saw her son, Ronald Harding, alive was Easter Sunday, a day she now cherishes. \"While visiting my sister at a nursing home I dozed off to sleep,\" she said. \"When I woke up, Ron was standing over me smiling.\" She said her son ate dinner with her and a granddaughter after leaving the nursing home. Harding, 55, was a claims representative for the Social Security Administration. He also was an accomplished musician who played five instruments - clarinet, saxophone, flute, violin, and cello. He had been a member of the Earl Pittman All-Stars jazz band for more than 10 years. She said he also was active in his church, Greater Cleaves Memorial Church in Oklahoma City, where he had been recently selected as a steward. Ronald Harding, the oldest of Clarice Harding's children, had two brothers and a sister. Harding is survived by his wife and four children - two girls and two boys.\nThomas Lynn Hawthorne, Sr.\nThomas Lynn Hawthorne Sr., 52, died as he lived - helping others. A son said the Choctaw resident was at the Social Security office in the Alfred P. Murrah Federal Building when the bomb exploded on the morning of April 19. Hawthorne Sr. was trying to help a retired United Rubber Workers union member who had moved to Oklahoma clear up a problem with the retiree's federal benefits, family said. \"In a way, that made it easier,\" Thomas Hawthorne Jr. said, \"because if he had to die now, at least he died as he lived. \"\nDr. Charles Hurlburt\nDr. Charles Erwin Hurlburt, 73, was raised in Africa where his parents were missionaries. His wife, Anna Jean, 67, grew up in Texas. At the time of their deaths, he was a retired professor of dental radiology at the University of Oklahoma, and she had worked as a licensed practical nurse at Deaconess Hospital for 22 years. The couple met and married as they were attending Wheaton College in Illinois, son-in-law Michael Palmer said. The Hurlburts went to Africa as medical missionaries for five years before settling in Oklahoma. They were longtime members of the Metropolitan Baptist Church. \"They were genuinely uncommon people. Some of the things they had going for them was a zest for their relationship with the Lord, music, and they laughed a lot. Those are some of the gifts they left us,\" Palmer said. The two apparently had gone to the Social Security Administration office to follow-up on paperwork, Palmer said. Their trip was not discovered until the day after the explosion when a daughter, also a nurse at Deaconess, found Social Security documents near a phone at the couple's Oklahoma City home. The Hurlburts had four daughters and sons-in-law, Barbie and Ronnie Trent, Oklahoma City; Sherry and Kent Elliott, Temple, Texas; Dawn and Jonathon Barber, Birmingham, Ala.; and Betty and Michael Palmer, Birmingham, Ala. They also had nine grandchildren.\nAnna Jean Hurlburt\nDr. Charles Erwin Hurlburt, 73, was raised in Africa where his parents were missionaries. His wife, Anna Jean, 67, grew up in Texas. At the time of their deaths, he was a retired professor of dental radiology at the University of Oklahoma, and she had worked as a licensed practical nurse at Deaconess Hospital for 22 years. The couple met and married as they were attending Wheaton College in Illinois, son-in-law Michael Palmer said. The Hurlburts went to Africa as medical missionaries for five years before settling in Oklahoma. They were longtime members of the Metropolitan Baptist Church. \"They were genuinely uncommon people. Some of the things they had going for them was a zest for their relationship with the Lord, music, and they laughed a lot. Those are some of the gifts they left us,\" Palmer said. The two apparently had gone to the Social Security Administration office to follow-up on paperwork, Palmer said. Their trip was not discovered until the day after the explosion when a daughter, also a nurse at Deaconess, found Social Security documents near a phone at the couple's Oklahoma City home. The Hurlburts had four daughters and sons-in-law, Barbie and Ronnie Trent, Oklahoma City; Sherry and Kent Elliott, Temple, Texas; Dawn and Jonathon Barber, Birmingham, Ala.; and Betty and Michael Palmer, Birmingham, Ala. They also had nine grandchildren.\nRaymond Johnson\nA member of the Seminole Nation, Raymond Lee Johnson, 59, was active in several American Indian organizations. He was working as a volunteer in the Social Security office with the Older Native American Program. He was a former council member and a past member of the Oklahoma Indian Education Association and held memberships in the National Indian Education Association and the National Congress of American Indians. Johnson was born in Lawton and raised in Wewoka before graduating from Seminole Junior College and East Central University in Ada. His children live in Shawnee, New Lima, Yukon, Durant, Wewoka, Oklahoma City and Choctaw. He served in both the U.S. Air Force and U.S. Army and was a member of the 45th Infantry Division of the National Guard.\nLaKesha R. Levy\nLakesha R. Levy was intelligent and a budding comedian. Karen Johnson of New Orleans said her niece was focusing on her medical-related job aspirations, but she had a wonderful sense of humor and could easily have excelled as a comic. In one of their last telephone conversations, Johnson said Levy mentioned she had dreamed she was a stand-up comedian. Johnson said her niece's dream came as no surprise since she always kept the family laughing. Levy always had a joke to tell and brought smiles to everyone's faces, Johnson said. Levy, 21, of Midwest City, was an Airman 1st Class training to be a lab technician at Tinker Air Force Base. She had gone to the Alfred P. Murrah Federal Building to obtain a Social Security card, relatives said.\nAurelia Donna Luster\n\"Their love was just unbelievable. \" An imprint on the memory of a family friend and Guthrie neighbor Vern Epperson, that is how Aurelia Donna Luster, 43, and Robert L. Luster Jr., 45, will be remembered by at least one man. For many, Donna, as known by her friends, and Robert will be known as the financially troubled couple who lost their lives in the bomb blast while trying desperately to provide for six children. The children, ranging in age from 7 to 22, were initially left homeless, victims of a landlord's eviction order which spurred Robert and Donna Luster to make a trip downtown, where they planned to apply for further Social Security disability funding. Now the children are left without parents. Since the tragedy, intense community support has provided the surviving family members with a 1 new home in which to carry out the teachings of their parents - valuable teachings according to Epperson. \"They were a real loving family,\" Epperson said. \"I don't think you'd find a more loving couple toward each other and their family. It was truly special. From the smallest children on up, it was just incredible love. \"\nRobert L. Luster Jr.\n\"Their love was just unbelievable. \" An imprint on the memory of a family friend and Guthrie neighbor Vern Epperson, that is how Aurelia Donna Luster, 43, and Robert L. Luster Jr., 45, will be remembered by at least one man. For many, Donna, as known by her friends, and Robert will be known as the financially troubled couple who lost their lives in the bomb blast while trying desperately to provide for six children. The children, ranging in age from 7 to 22, were initially left homeless, victims of a landlord's eviction order which spurred Robert and Donna Luster to make a trip downtown, where they planned to apply for further Social Security disability funding. Now the children are left without parents. Since the tragedy, intense community support has provided the surviving family members with a 1 new home in which to carry out the teachings of their parents - valuable teachings according to Epperson. \"They were a real loving family,\" Epperson said. \"I don't think you'd find a more loving couple toward each other and their family. It was truly special. From the smallest children on up, it was just incredible love. \"\nRev. Gilbert Martinez\nThe Rev. Gilberto Martinez, 35, always said he wanted to see his church filled. And he got his wish, but not in any way he had ever envisioned. Instead, his congregation, family and friends filed by to pay their respects Tuesday at El Tabernacle De Fe Church in Oklahoma City before his funeral service, which is today at Faith Tabernacle. Born in Brownsville, Texas, Martinez was a minister and member of the Oklahoma District Assemblies of God and was a teacher in the Oklahoma City public school system. He and his wife, Martha, have two sons and three daughters.\nCartney Jean McRaven\nAirman 1st Class Cartney Jean McRaven, 19, had returned from a four-month deployment in Haiti two weeks before the Bombing of the Alfred P. Murrah Federal Building. Four days before the bombing, on April 15, she married Senior Airman Anthony Shane McRaven. The couple were planning a large formal wedding in December. On the morning of April 19, McRaven was in the Social Security office at the Murrah building, reporting her name change. McRaven was a native of Watertown, S.D. She was a member of the 3rd Combat Communications Group, 32nd Combat Communications Squadron. She and her husband were both stationed at Tinker Air Force Base. The couple spent much of their spare time helping in a local Salvation Army soup kitchen. \"We stand back in tears and disbelief and ask, `Why? ' \" said a press release issued by her unit.\nDerwin Miller\nDerwin Miller, 27, moved to Oklahoma City soon after graduating cum laude in 1980 from the University of Arkansas-Pine Bluff with a psychology degree. He was a member of the Alpha Phi Alpha Fraternity in college. Miller was a claims examiner in the Social Security Administration. He was buried in Lone Oak, Ark., Tuesday, five days after what would have been his 28th birthday. A family friend said Miller and his family are well-known and respected members of the small community. Miller is survived by a daughter, his parents, two brothers and a sister.\nEula Leigh Mitchell\nJoe Mitchell of Oklahoma City had just a few incidental questions for his wife, Eula Leigh Mitchell, to complete his application for Social Security retirement benefits. But he never made it to the reception area of the Social Security offices in the Alfred P. Murrah Federal Building to ask her. The explosion separated them. Leigh Mitchell, 64, an employee of Manhattan Cleaners and a Sunday school teacher in her church, loved animals and especially the birds around her home. Her family described her as a friend to many, particularly the elderly friends that she loved to take care of and shop for. Her husband of 26 years was injured in the blast.\nEmilio Rangel Tapia\nEmilio Rangel Tapia, 50, of Oklahoma City was a customer at the Social Security office. Tapia attended the Tabernacle of Faith Church at SE 29 and Pennsylvania. A friend said Tapia's son, Manuel, had come to Oklahoma City from Mexico for his funeral service and to take his body home for burial. A funeral home spokeswoman said Tapia was buried in San Felipe Cemetery in San Felipe, Guanajuato, Mexico.\nCharlotte Andrea Lewis Thomas\nCharlotte Andrea Lewis Thomas, 43, had worked for the federal government for 17 years. For the past three years, Thomas produced the Black Awareness program for the Social Security office. Thomas graduated from Douglass High School and received her bachelor of arts degree from Oklahoma State University.\nMichael George Thompson\nMichael George Thompson, 47, was a quiet man deeply devoted to his family. He was an accomplished painter and musician who loved animals and enjoyed building things, such as a storage barn in the back yard of his Yukon home. He also liked to tinker with the Volkswagen he rebuilt by hand. Thompson, a Vietnam veteran, was an employee of the Social Security Administration. He had been honored by the Social Security Administration headquarters in Baltimore for his help in improving the agency's service delivery to clients in need.\nLaRue Treanor\nLaRue and Luther Treanor of Guthrie were married June 28, 1959. LaRue, 56, loved to sing in the Seward Road Baptist Church choir, and Luther Treanor, 61, had a habit of tapping on pastor Rex Haymaker's office window each Sunday on his way from the parking lot to the church. The Treanors and their granddaughter Ashley Eckles, 4, went to the federal building for Luther's appointment to check on his Social Security retirement. The Treanors have four children, Mike, Mark and Brad Treanor, and Debbie Price.\nLuther Treanor\nLaRue and Luther Treanor of Guthrie were married June 28, 1959. LaRue, 56, loved to sing in the Seward Road Baptist Church choir, and Luther Treanor, 61, had a habit of tapping on pastor Rex Haymaker's office window each Sunday on his way from the parking lot to the church. The Treanors and their granddaughter Ashley Eckles, 4, went to the federal building for Luther's appointment to check on his Social Security retirement. The Treanors have four children, Mike, Mark and Brad Treanor, and Debbie Price.\nRobert Walker Jr.\nNeither a heart attack suffered last year nor the loss of his father could slow Robert Walker Jr. \"He never slowed down,\" said his wife, Judith Walker. \"He was just so active, and he was really a wonderful man. \"I just wish everybody had had the chance to meet him.\" Walker, 52, was a claims representative with the Social Security Administration, and his caring nature made a lasting impression on those he served, she said. The Walkers had been married for almost nine years, and both worked for the Social Security Administration. They were transferred to Oklahoma City from Albuquerque, N.M., three years ago. It was a good fit, Judith Walker said. \"We were in love with Oklahoma City. \" Walker continued his long association with the Boy Scouts in Oklahoma City. An Eagle Scout and 46-year member of the organization, Walker served as Assistant District Commissioner of the Will Rogers District and Unit Commissioner for Troop 84. Walker also pursued an avid interest in computers.\nJulie Marie Welch\nJulie Marie Welch, 23, of Oklahoma City had been working as a Spanish interpreter for the Social Security Administration. Her goal was to be a Spanish teacher to help improve global understanding. Welch graduated with a degree in Spanish from Marquette University in Milwaukee, Wis., where she was on the dean's honor list. She spent a year as a foreign exchange student in Pontevedra, Spain, during high school, and studied for one year at the Marquette en Madrid during college. Born Sept. 12, 1971, in Oklahoma City, she attended Windsor Hills Elementary and Wiley Post Elementary, Hefner Junior High and graduated from Bishop McGuinness High School. Welch was planning to marry an Air Force lieutenant.\nWilliam Stephen Williams\nWilliam Stephen Williams' best friend, Warren Vieth, a news editor for the Los Angeles Times' Washington Bureau, wrote that he remembered the two forming a garage band during their teenage years. The two became friends in second grade while growing up in Kingfisher. Vieth said he last heard from Williams on April 7 through an E-mail computer message asking for help with a song he was writing. Williams was struggling with the verses but he liked a chorus he had written: \"Grab the world and shake it now, or maybe you never will. \" Vieth said, \"Looks like the world reached up and grabbed Steve before he could finish his song. \" Williams, 42, of Cashion, was an operations supervisor for the Social Security Administration. His wife's name is Barbara and he had three daughters.\nSharon Louise Wood-Chesnut\nSharon Louise Wood-Chesnut was one of those people friends knew they could turn to during times of difficulty. An Oklahoma City native, the 47-year-old Wood-Chesnut grew up in the Del City area and obtained a business degree before moving to Louisiana. She later returned to her hometown to work in the Social Security office, where she was known as a friendly, cheerful person who worked well with people. She was a member of Christ Lutheran Church, where she served in several capacities, particularly those which required a good worker, planner or director. Wood-Chesnut had a daughter, Nikki Chesnut, and two stepchildren, Lonny Chesnut of Lafayette, La., and Laurie O'Field of Houston, Texas.\nU.S. Marine Corps Recruiting — 6th Floor\nBenjamin L. Davis\nSgt. Benjamin L. Davis, 29, was a good kid, a U.S. Marine comrade said. \"He was always motivated. Even when he answered the telephone,\" a Marine at an Oklahoma City recruiting substation said.\nRandy Guzman\nMarines have a reputation of sticking to the job, no matter how difficult. And that's exactly where rescue workers digging through the ruins of the bombed-out federal building found Marine Capt. Randy Guzman. He was encased in rubble but still seated behind his desk at the Marine Corps recruiting station. But a friend said Guzman didn't fit the gruff demeanor sometimes attributed to Marines. \"He was real nice, personable and got along with everyone,\" said a friend and fellow recruiter. Guzman, 28, grew up in Castro Valley, Calif., and moved to Oklahoma City in July 1993 to oversee the recruiting station. He was single but had a fiancee and planned to get married soon, his friend said. Guzman and his friend had played basketball at the Tinker Air Force Base gym just an hour before the bombing. \"He said, 'OK, you guys, I gotta go to work.' And that was it,\" his friend said. \"It makes me sick that he's gone.\"\nU.S. Army Recruiting Battalion - 4th Floor\nLola Bolden\nArmy Sgt. 1st Class Lola Renee Bolden, 40, of Birmingham, Ala., had been stationed in the Oklahoma City Recruiting Battalion for four months. Bolden is survived by a 21-year-old daughter and two sons, Ricky Hill, 13, and Jonathan, 11. The 15-year Army veteran worked in the fourth-floor recruiting station in the federal building. The single mother had transferred from Colorado to Oklahoma in January. Her son Ricky described his mother as kind and funny, and said she would have pillow fights and \"stuff\" with her kids.\nKaren Gist Carr\nKaren Gist Carr was a \"people\" person who embraced life. \"She just made living a 24-hour vocation,\" said the Rev. Leslie Brown, pastor of First Christian Church in Midwest City, where Carr attended. Carr, 32, was an advertising assistant for the Army recruiting office. In addition to her full-time job, she was an aerobics instructor at the Downtown YMCA and at Rose State College. She also was a member of the Mid-Del Toastmasters Club. Carr and her husband, Gregory Carr, had just celebrated their eighth anniversary eight days before she was killed in the explosion.\nPeggy Louise Holland\nA Kentucky native Peggy Louise Holland, 37, became a welcome addition to the Oklahoma City area in 1987 when she assumed responsibilities in public information and command information programs for the Army. Most recently a computer specialist for the Army Recruiting Battalion in Oklahoma City, Holland gave much of her time to children at Knob Hill Baptist Church as a Sunday school teacher, children's choir teacher and vacation Bible school teacher. She was also secretary of the Coolidge Eyes and Ears Neighborhood Watch Association. She and her husband Richard have two children, Erica and Kylie.\nJohn C. Moss III\n\"He was very good at his job; he had found his niche. And he was very happy in Oklahoma City,\" the sister of John C. Moss III said. Moss, 50, was a civilian employee in the Army recruiting office where he served as chief of public affairs. \"He was a funny, witty, popular man who had a lot of friends,\" his sister, Marjorie Moss Hendrix, said. Moss played football at Warren High School, where he graduated in 1961. While serving in Vietnam as a Marine, he was burned when a fuel tank exploded. \"He survived that and a lot of other close calls,\" Hendrix said. He had been a civilian employee for the Army the past 16 years after a brief stint as a high school English teacher.\nVictoria Lee Sohn\nShe had an \"illustrious career,\" giving 16 years to the service of her country, and was remembered with outstanding compliments. \"Placing all others' needs above her own, she unselfishly gave her care and concern to all whose lives she touched,\" read the obituary for Master Sgt. Victoria Lee Sohn, 36, of Moore. \"Vickey was a perfectionist, striving for and achieving a level of accomplishment surpassed by none.\" Sohn is survived by her husband, Sgt. 1st Class Gregory P. Sohn. She also is survived by her five children, Gregory Jr., Jessica, Stephen, Victoria Marie and John Michael. \"Vickey, above all else was a beloved wife, and a devoted mother of five children.\"\nDolores M. Stratton\nDolores M. Stratton, 51, of Moore was a good friend, mother and grandmother. She was a military personnel clerk for the Army recruiting office. Her husband is retired Air Force Master Sgt. Charles \"Chuck\" H. Stratton. They have a daughter, Michelle Sawyer; a son, Jay Sawyer; and two stepdaughters, Kim Fairclough and Kelly Stratton.\nKayla Titsworth\nKayla Titsworth, 3, was at the Murrah Building with her family in the Army's Recruiting office when the bomb exploded. Sgt. William Titsworth was at the U.S. Army Recruiting Battalion to report for his new assignment in Oklahoma City after transferring from Fort Riley, Kan., said Col. John Meyers, director of public affairs for the Army Recruiting Command in Fort Knox, Ky. Titsworth, his wife - Gloria Titsworth, who is Kayla's mother - and Kayla were in the office's processing unit, probably filling out paperwork, at the time of the bombing, Meyers said. William and Gloria Titsworth survived the blast.\nWanda Watkins\nWanda Watkins, 49, of Oklahoma City could crochet circles around most people. She was a civilian who worked for the Army as a clerk in the recruiting office. Watkins loved to dance, was an Elvis fan and collected records and liquor bottles, although she didn't drink. She also will be remembered for her good sense of humor and the colorful flowers in her garden.\nU.S. Customs Office - 5th Floor\nPaul Douglas Ice\nHe was one of the first special agents assigned to the U.S. Customs Service Oklahoma City office seven years ago. Paul Douglas Ice, 42, of Midwest City was a senior special agent in the U.S. Customs Service office. \"The death of a member of the Customs family is always a sad occasion,\" said John Hensley, special agent in charge. \"The death of Senior Special Agent Ice is especially tragic under the circumstances.\" Ice was a native Oklahoman who performed investigative duties for the Oklahoma City office. Ice had two daughters, Sarah and Nicole of the Oklahoma City area. In lieu of flowers, the family asked that donations be made to the Paul Ice fund, Draper Park Christian Church Memorial fund, 8500 S Walker Ave.\nClaude Medearis\nAfter serving as a U.S. Customs agent along the Mexican border between Eagle Pass and Del Rio, Texas, Senior Special Agent Claude Medearis moved to the Oklahoma City office in 1992. Medearis, of Norman, recently was promoted to senior special agent in charge of the Oklahoma City office. His daughter is Catherine Alaniz, whose husband was killed in the Persian Gulf War. The family requests donations be made through a foundation that assists families of customs agents killed or injured in the line of duty. Donations can be sent to Claude A. Medearis Oklahoma City fund, Roger von Amelunxen Foundation Inc., 83-21 Edgerton Blvd., Jamaica, N.Y. 11432, Attention: Karen Donnelly.\nU.S. Secret Service - 9th Floor\nCynthia Brown\nCynthia Lynn (Campbell) Brown, 26, worked as a special agent for the Secret Service on the ninth floor of the Alfred P. Murrah Federal Building. This was her first assignment as an agent. Brown, whose hometown is Sherman, Texas, had worked in Oklahoma City for about 14 months. Just six weeks ago, she married Ron Brown at Grace United Methodist Church in Sherman, Texas - the same church where her funeral was held. Brown was a graduate of Baylor University in Waco, Texas, and also had attended Grayson County Community College in Sherman.\nDonald Ray Leonard\nAfter retiring this year, Secret Service agent Donald Ray Leonard planned to travel and play more golf with his sons. Leonard, 51, enjoyed sailing, fishing and golf. He also loved his career in law enforcement. During his 20 years with the Secret Service, Leonard was responsible for protecting seven U.S. presidents and various political candidates and dignitaries. He received numerous awards for his service. He was a member of the National Native American Law Enforcement Officers Association and a supporter of the Oklahoma Zoological Society, the Cowboy Hall of Fame and Native American Movement. He and his wife, Diane, have three sons, Brad, Jason and Tim.\nMickey Maroney\nMickey Maroney, 50, a Secret Service agent, was born in Wichita Falls, Texas. He played defensive end for the University of Arkansas Razorbacks during the football team's 1964 national championship season and during 1965 and 1966. He had spent nearly half his life - 24 years - working for the government. Maroney was at work when the blast hit.\nLinda Gail McKinney\nLinda Gail McKinney was \"one of those very special people that God puts on Earth,\" said her husband, Dan. \"She was outgoing and friendly and never met anyone she didn't like. \" McKinney was born in Ada on Aug. 10, 1947. She was a 1965 graduate of McLish High School and attended Draughn School of Business. She loved arts and crafts and was especially fond of quilting. She also enjoyed fishing, her husband said, \"if I baited the hook for her. \" She was employed as office manager for the Secret Service on the ninth floor of the Alfred P. Murrah Federal Building.\nKathy Lynn Seidl\nRelatives described Kathy Lynn Seidl this way: A gracious and caring wife. A beautiful mother. A precious and loyal daughter. A dear sister. A special aunt. Seidl, 39, lived in Midwest City, where she graduated from high school. She worked as an investigative assistant for the Secret Service. She and her husband, Glenn, have a son, Clinton Glenn.\nAlan G. Whicher\nSeven months ago, Alan G. Whicher left the White House for the supposedly quieter confines of Oklahoma, where he was assistant special agent in charge of the Secret Service's field office. Minutes before the explosion, the 40-year-old Edmond resident had called his wife of 20 years. Before Oklahoma, he oversaw Clinton's security detail as assistant to the special agent in charge of the presidential protection division. Their children include Meredith, 17; Melinda, 16; and Ryan, 12.",
  "word_count": 17769,
  "scraped_at": "2026-02-14T12:14:58.686648"
}