{
  "article_id": "8ab813c4d871",
  "url": "https://www.westmeathexaminer.ie/2023/01/12/july/",
  "title": "JULY | Westmeath Examiner",
  "date": "20230112T163000Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "2022 Sports Review: JULY\nThe highlight of July 2022 was the Tailteann Cup final in Croke Park on July 9. A decent Westmeath crowd travelled to Headquarters to watch Westmeath defeat Cavan to win this new competition for the first time. In a tough encounter, a spectacular late goal from sub Kieran Martin proved the difference as the Lake County prevailed 2-14 to 1-13, to ensure a place in the Sam Maguire Cup reckoning for 2023. Ronan O’Toole kicked five points from play, while John Heslin also hit 0-3 to become Westmeath’s new all-time championship top-scorer, ousting Dessie Dolan from the top spot. For all the apathy about it at the outset, there was a certain magic about the new competition as it drew to its conclusion, and this was reflected in the massive crowds of supporters who turned out in Mullingar to welcome Jack Cooney’s charges home on a sunny Saturday night. Magnificent!\nAs well as the men, July brought an end to inter-county competition for the Lake County’s women, with the intermediate camogie side held by Laois in a result not sufficient to ensure their qualification. Denise McGrath, the form player of the year for Westmeath, scored two goals but manager Diarmuid Cahill said that Laois’s defensive nous prevented them from getting the result. In ladies’ football meanwhile, Westmeath lost 1-13 to 1-9 to Cavan in their relegation playoff to bid farewell to the All-Ireland Ladies’ SFC. The minors were also defeated in their Leinster ‘C’ final by Wicklow in a high-scoring game.\nThe end of the inter-county season saw players return to their clubs, and in early July the outstanding league finals were decided. Garrycastle and St Joseph’s won the Division 4 and 5 league finals, while there were Division 1 and 2 LGFA wins for Garrycastle and Mullingar Shamrocks respectively. Delvin also edged a classic Division 2 camogie league final against Castlepollard.\nThe county championships kicked off later in July, including three rounds of football and two of hurling, with the second round of football taking place on the week of the hugely successful All-Ireland Fleadh in Mullingar. In the SFC, champions St Loman’s, Mullingar and pretenders The Downs were the early pacesetters, with the Black and Ambers battering Mullingar Shamrocks in round three. However, The Downs laid down a marker with a victory over Loman’s in round two, with Luke Loughlin and Tom Tuite impressing. Tyrrellspass also made a decent start to their Section ‘B’ campaign. At intermediate level, Shandonagh, Tubberclair, St Mary’s Rochfortbridge and Ballymore all registered early victories.\nOn the hurling front, SHC ‘A’ holders Raharney comfortably won their opener against Castlepollard, while Clonkill and Lough Lene Gaels were held by Castletown Geoghegan and newcomers Cullion respectively. Round two saw wins for Castlepollard, Castletown and Clonkill, with goals from Niall Dowdall and Adam Loughlin ensuring that the Loughegar men edged Raharney. In the SHC ‘B’, favourites Delvin opened their campaign with two wins, with Fr Dalton’s also enjoying early success.\nElsewhere in GAA, Croke Park awarded Westmeath’s senior footballers a €60,000 holiday prize on foot of their Tailteann Cup win; Bunbrosna GAA held their ‘Royal Run to Bun’ fundraiser; the Westmeath camogie championships were launched, as the ladies’ football club competitions got under way; Club Iarmhí held a very successful golf classic at Mullingar Golf Club; Robbie McCarthy Snr won a Leinster silver medal at the Leinster DMAS softball final; and Lough Lene Gaels Hurling Club dedicated its new pitch to the memory of former hurler Darren Mortimer, who died in a road accident in 1999.\nIn soccer, the big story of the month was Aidan Keena’s involvement with Sligo Rovers as the Bit O’Red book their place in the Europa Conference League Qualifiers. Keena scored in a 2-1 away win over Welsh side Bala Town, and although Bala won the return game 1-0, Sligo won on penalties, with Keena among the scorers. In the second qualifying round, Sligo travelled to Scottish Premier League side Motherwell and won 1-0 thanks to a goal from Keena. Rovers won the home leg 2-0 to set up a third round qualifying tie with Norwegian side Viking Stavanger in August. Keena’s form was rewarded by Sligo with a new two-and-a-half year contract.\nLocally, Mullingar Town secured a sponsorship deal with O’Sullivan’s Menswear, Mullingar, while Real Football Academy, Mullingar’s U12 side knocked Parkvilla FC out of the cup, with a number among their ranks taking part in the NECSL Emerging Talent Programme. On the American football fields meanwhile, Westmeath Minotaurs made history by recording their first ever championship victory, beating Limerick Vikings 16-13 after a nail-biting conclusion in Belfast.\nOn the boxing front, Olympic BC, Mullingar were top of the class at the Monkstown International Box Cup with 11 gold medals plus the retention of their Best Boxing Club title; some weeks later, four of the club’s boxers, Calvin Doyle, Niamh Keogh, Alfie Jordan and Ryan Jenkins, won national cadet titles. In golf, Mullingar Golf Club’s Lady Captain’s Prize to the Men drew a substantial entry, and Bishop Michael Smith’s Prize to the Ladies competition entered its 39th year.\nIn motorcycling, the elite of road racing converged on Westmeath in July for the Races of the South at Walderstown. Michael Dunlop, Michael Sweeney and Mike Browne shared the spoils in the main races, but Mullingar’s Thomas Maxwell was in the mix as well. Derek McGee, returned from injury, unfortunately had to withdraw from the reckoning due to Covid. Elsewhere in motorsport, the Westmeath Examiner interviewed up and coming rallycross star, Michael Connell.\nOn the cycling front, Coralstown resident and France native Xavier Arnold returned to mountain biking after a 16-year absence with a win in the Gravity Enduro Ireland series. Lakeside Wheelers Cycling Club staged the Mullingar Grand Prix, with 140 riders involved and Daire Feeley winning the A1 race. Meanwhile, Mullingar’s Blánaid Adamson was awarded a VHI parkrun hero award, and two Ballymore girls, Leah Connell and Jane Ryan, put in remarkable displays to emerge as medal winners at the Summer Long Course Swimming Championships at the National Aquatic Centre.\nIn athletics, veteran Mullingar Harriers race walker Sean McMullin won a bronze medal at the World Masters T&F and Harriers excelled at the National Juvenile T&F. The Harriers trio of Diarmuid Fagan, Aisling Lane and Andrew Glennon had a difficult job getting to Jerusalem for the European U18 T&F, but did their club and country proud in the searing heat. Aisling and Oisín Lane both won national race walking titles at the National U20 and U23 T&F in Tullamore, while another Harrier, Aidan O’Donoghue, won a national pentathlon silver medal. Meanwhile, Kilbeggan man and Tullamore Harriers athlete Michael Murphy talked about his return to distance running after a heart scare, and the Mullingar 10-Mile Road Race made a welcome return.\nElsewhere in sport, Robbie McCarthy Jnr launched his 60x30 handball season with a win over Tommy Hynes in Wexford, while Multyfarnham’s Mick Naughton won an Emerald Masters 60x30 Leinster final; four Westmeath girls, Julianna Duffy (Mullingar), Sibeal Egan (Moate), and Isla and Ruby Brennan (Bunbrosna) excelled in the National Minimus Championships in Kilkenny – a combination of equestrian and athletic prowess; Mullingar Sailing Club held its annual junior sailing course; Caroline McDonald and Jocelyn Navarro of Mullingar Badminton Club represented Ireland at a Four Nations International Graded final in Cardiff; and Hurricane Georgie won the €100k AXA Midlands National at Kilbeggan Races. At a race meeting at Kilbeggan later in the month, stable staff went on a temporary strike in order to obtain free bottled water from course management during the savage July heat.",
  "word_count": 1267,
  "scraped_at": "2026-02-14T12:14:26.515372"
}