{
  "article_id": "8aba53b5b823",
  "url": "https://indianexpress.com/article/world/nikki-haleys-rock-is-watching-her-campaign-from-a-distance-9144662/",
  "title": "Nikki Haley  rock  is watching her campaign from a distance",
  "date": "20240205T071500Z",
  "domain": "indianexpress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Stay updated with the latest - Click here to follow us on Instagram\nPremium\nThis is an archive article published on February 5, 2024\nWhen Nikki Haley conceded her deflating third-place defeat in the Iowa caucuses this month, the first person she thanked was nearly 8,000 miles away.\n“I want to say to my husband, who is deployed, who I know may or may not be watching this right now — Michael, I love you,” she said, standing in front of a row of American flags. “What keeps me going at night is that we sleep under the same stars.”\nIt was an unusually personal and almost saccharine note for a politician known for her tough exterior. But it was hardly out of place.\nEven in his absence, Maj. Michael Haley, a National Guard member serving a voluntary, yearlong deployment in Africa, has played an outsize role in his wife’s increasingly lonely attempt to snatch the Republican nomination from former President Donald Trump.\nIn nearly every stump speech, Nikki Haley describes her husband and his military career as one of her motives for running. She frequently refers to his struggles after returning from a war zone in her promises to improve health care for veterans. She suggests that his work has informed her foreign policy.\nYet, despite this prominence, Michael Haley himself remains something of a blank slate. While other candidates’ spouses — with the notable exception of Melania Trump — logged miles across Iowa and New Hampshire last year trying to humanize their other halves, he has avoided the intense scrutiny, as well as the public speaking, photo ops and interviews, that comes with campaigning.\nThose who know him say this is just as he likes it. A former foster child who met his wife when he was 19, Haley has largely orbited her ambitions since.\nWhile her career marched upward, his meandered; he worked for her parents and ran a struggling bartering venture before he found the military. More recently, he was involved in a casino deal and currently has an ill-defined role with a small defense company.\nUntil this year, he has always campaigned at her side, though largely out of the spotlight.\nStory continues below this ad\n“He’s perfectly content as a rock Nikki leans on in the background,” said Rob Godfrey, who worked as a spokesperson for Nikki Haley during both of her campaigns for South Carolina governor as well as most of her time in that office.\nMichael Haley rarely speaks to the news media and declined a request for an interview. When asked about his deployment in June, he told The Associated Press that he “can’t help but to think giving one year, along with my fellow soldiers, as many have done before me, to secure a life of freedom for my family, is well worth all that comes with it.”\nNikki Haley has turned to her husband as “a touchstone on important issues” at key moments in her career, Godfrey said.\nIn the days after a racist gunman killed nine people at a historically Black church in Charleston, South Carolina, Haley decided to push to remove the Confederate flag from the Statehouse grounds after consulting with her husband, Godfrey said.\nStory continues below this ad\n“There was no question: Nikki wanted to talk to the person she trusted the most about what to do,” Godfrey said.\nMichael Haley’s politics appear to mirror his wife’s; in the past, he has occasionally taken to social media to criticize her political opponents or Democratic officials.\nFriends describe him as a golfer, a football fan and an avid hunter who relishes posting pictures of alligators he has bagged. The couple’s son, Nalin, a college senior, described his father in an interview with The New York Times as a prankster and a lover of “the typical dad jokes.”\nHis father watched every debate from Camp Lemonnier, the sprawling military base in Djibouti where he is deployed, Nalin Haley said, and he has a habit of turning photos of his family or his wife’s staff into memes that he shares online. “Sometimes they are really funny, or they are really bad,” he said. “There is no in between.”\nMichael Haley, 53, did not have an easy start in life. His biological father was an alcoholic who had trouble with the law. He spent his earliest years in Ohio, living in a house that often had no electricity or running water, Nikki Haley wrote in her 2012 book, “Can’t Is Not An Option.”\nStory continues below this ad\nHis mother suffered a severe brain injury when he was 3, and he went to a foster home with two of his sisters, while the oldest two siblings were placed in another home.\nThe next year, he and his younger sister, Lee Anne, were adopted by Bill and Carole Haley. Bill was the manager of a steel mill, and Carole was a schoolteacher. It would be 15 years before Michael tracked down the rest of his brothers and sisters, Haley wrote.\nMichael Haley met his future wife in college, when she was a freshman studying accounting at Clemson University and he was enrolled at Anderson University, a small Christian school nearby.\nAt the time, he went by the same first name as his adoptive father, Bill. But Nikki Haley recounts in her memoir that soon after they started dating she told him, “You just don’t look like a Bill.” She instead chose to call him by his middle name, Michael, and it stuck, she wrote.\nStory continues below this ad\nThe couple encountered resistance from her parents, who are Sikh immigrants from India and wanted their daughter to marry someone with the same religion. But in 1996, two years after he proposed, they married in separate Sikh and Christian ceremonies and eventually settled in Lexington, South Carolina.\nBoth worked for her parents’ clothing business, Exotica International. He managed the menswear department, while she did the books. As she took to politics, he invested in the bartering franchise. As they raised their two children — Nalin has an older sister, Rena — the family business struggled, and money was tight.\nIn 2006, when Nikki Haley was a first-term state representative, Michael Haley finished his college degree and soon thereafter joined the South Carolina Army National Guard as a 36-year-old second lieutenant, older than most new officers.\nThe military gave him a steady purpose and a modest income. In 2007, he took a full-time job as a federal military technician, working in human resources on policies to promote diversity in the guard and protect against discrimination based on race, gender or disability.\nStory continues below this ad\nHe stayed in the job when he became the first gentleman of South Carolina — the state’s first — in 2010, after an ugly campaign in which Nikki Haley was forced to deny accusations of marital infidelity. He used the role to advocate issues close to home — changes to adoption laws and veteran services — but kept his focus largely on his family.\n“He is not a retail politician,” said Ted Pitts, a friend and fellow guard member, who is also a former state representative. “He’s devoted to the family and puts out a lot of time and effort to make sure the family is taken care of.”\nIn 2012, the third-deadliest year for U.S. troops during the war in Afghanistan, Michael Haley raised his hand for a mission focused on teaching farmers in the country to grow and sell crops other than opium. While many National Guard deployments are mandatory, this one was strictly voluntary, said Dwight Bradham, a retired major who helped oversee the agribusiness team’s work.\n(When the news of his deployment broke, Nikki Haley took to Facebook, posting lyrics to the 1988 ballad by the hair-metal band Poison, “Every Rose Has a Thorn.”)\nStory continues below this ad\nMichael Haley, then a captain, deployed in January 2013 to Helmand province. While he was not in a combat unit, he did have a few brushes with roadside bombs. “People had some brain rattle there from the explosions,” said Lt. Col. Scott Ward, who is now retired but served as the commanding officer of the agricultural mission.\nEveryone knew who he was, but he “didn’t sit back and try to get special treatment because of who his wife is,” Bradham said. “He’s a soldier.”\nNikki Haley frequently describes her husband’s reentry as difficult. “When Michael returned from Afghanistan, loud noises startled him,” she said in an ad released in December. “He couldn’t be in crowds. The transition was hard.”\nFriends describe Michael Haley, who earned a bronze star in Afghanistan, as slipping into his next role without obvious signs of stress. When Nikki Haley became the ambassador to the United Nations in 2017, he joined his wife at diplomatic events and dinners, as well as on official trips overseas.\nSince the couple’s return to South Carolina in late 2018, he has kept a lower profile. Friends say he is closely involved in taking care of her parents. Financial disclosures show that he runs a company that manages income from his wife’s speeches and book sales, as well as a family investment portfolio.\nStory continues below this ad\nIn 2022, The Wall Street Journal reported that he was among several politically connected figures with stakes in a company that received a share of slot machine profits from a tribal casino in North Carolina. Others with stakes included John B. Clyburn, a brother of Rep. James Clyburn, D-S.C., and Patti Solis Doyle, a Democratic political operative, the newspaper reported.\nWallace Cheves, a developer who spearheaded the project, said that Michael Haley was given his stake in exchange for cybersecurity services.\n“He was a consultant of a consultant that worked with the tribe,” Cheves said in response to questions.\nFinancial disclosures show that he also has a stake worth as much as $500,000 in Allied Defense, a company registered with the federal government as a veteran-owned “military armored vehicle, tank and tank component manufacturing concern.” But it does not appear to have any federal contracts.\nThe Haley campaign declined to comment on his cybersecurity background or to disclose information about his involvement with the defense firm.\nHaley was deployed again in June, this time to Djibouti, a base for counterterrorism operations in Africa. He joined the 218th Maneuver Enhancement Brigade as a planning officer for the mission. Because he did not belong to the unit, it was an assignment that he would have had to request, according to multiple former guard members.\nThe deployment has meant that he has missed much of his wife’s campaign — her weeks of glad-handing, her standout debate performances, her poor showing in Iowa, her New Hampshire loss and now the intense pressure from fellow Republicans to quit.\n“There is never a good time for a deployment,” Nikki Haley posted on social media after seeing off her husband, along with several hundred other soldiers, in a ceremony at the Citadel, a military college in Charleston, in June.\n“How blessed are we to live in a country where men and women are willing to sacrifice and serve to defend our freedoms?” she wrote.\nStay updated with the latest - Click here to follow us on Instagram\nAdvertisement\nLoading Taboola...\nLive Blog\nPHOTOS\nTop Stories\nAdvertisement\nMust Read\nAdvertisement\nBuzzing Now\n- 01\n- 02\n- 03\n- 04\n- 05\nAdvertisement",
  "word_count": 1909,
  "scraped_at": "2026-02-14T13:29:53.788869"
}