{
  "article_id": "8abf720c2224",
  "url": "https://www.nytimes.com/athletic/6492868/2025/07/15/euro-2025-roundup-goals-defence-wingers/",
  "title": "Euro 2025 roundup : Goals aplenty while wingers dominate and defences struggle",
  "date": "20250715T130000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Athletic has live coverage of the England vs Spain final at the 2025 UEFA Women’s Euros.\nEuro 2025 has shown that everyone can get on the scoresheet. But what does that actually say about the football?\nThe Athletic’s Michael Cox watched every match to bring you the moments you may have missed. Here are some early patterns and a best XI from the final round of group-stage matches.\nAdvertisement\nEveryone gets their moment\nThere’s something satisfying about every side at a tournament scoring a goal. It is often an interesting side story going into the third round of group matches, seeing whether some of the strugglers can give themselves a moment of joy.\nAnd, happily enough, not only did every Euro 2025 side score a goal, but every side scored in the final round of group games, too.\nIceland, already eliminated, went ahead against Norway thanks to Sveindis Jonsdottir’s close-range finish, although they ended up losing 4-3. Belgium also had nothing to play for, but pulled off an impressive 2-1 victory over Portugal with a late winner from Janice Cayman. Poland, in their first major tournament, recorded a deserved 3-2 win against Denmark. Wales got thrashed 6-1 by England, but Hannah Cain celebrated her late consolation goal with gusto. Their previous goal at the tournament was an equaliser against France, but a VAR delay mitigated their celebrations. That was Wales’ moment.\nEvery side at the tournament scored a goal that was, at the time, crucial — either to go ahead or to equalise. In a well-attended competition with supporters travelling in good numbers from almost every nation, everyone had, at some stage, something to cheer.\nThis is a tournament of wingers\nSpain are playing by far the best football at this tournament. They are, perhaps uniquely, set up to pass their way through the middle of the pitch, with wide players moving inside to combine with the midfielders.\nBut this style of football looks beyond most other teams in the competition — increasingly, this feels like a tournament of wingers.\nThe most striking example are France, whose pairing of Sandy Baltimore and Delphine Cascarino dominated England in their opening game. After being rested for the Wales game, they returned to the side against the Netherlands — the wingers were subdued in the first half but after the Dutch pushed forward at 2-1 up in an attempt to boost their goal difference, Cascarino’s speed on the run turned the game France’s way.\nSweden’s brightest player has been right-winger Johanna Rytting Kaneryd, who combines particularly well with midfielder Filippa Angeldahl. Germany have offered minimal creativity from the No 10 position, where both Linda Dallmann and Laura Freigang have been tried, but their wing pairing of Klara Buhl and Jule Brand offers tremendous running power.\nAdvertisement\nEngland have thrived by switching the ball out quickly to Lauren Hemp. Perhaps most significantly, Lauren James found little space against France when playing as a central No 10, but has looked more dangerous playing from the right. Similarly, Caroline Graham Hansen was quiet for Norway when used through the middle, but looked back to her best when reverting to a position out wide.\nIn all, this isn’t a tournament of No 10s — there simply isn’t enough space between the lines. The key attackers are, Spain aside, positioned out wide.\nDefences are struggling\nThe rate of 3.7 goals per game in this tournament is the highest on record for a European Championship group stage. This has been boosted by some wild final group matches where teams had nothing to play for, so they went on the attack (such as Iceland and Belgium). Equally, there have also been matches where teams desperately needed goals, so they left the back door open (see Portugal and Netherlands).\nAnd goals, in general, are good. But having celebrated goals already, let’s consider the opposite: have teams forgotten how to defend?\nThe general pattern from this tournament is that full-backs are all about flying forward rather than being able to stop opposition wingers. In the middle, it’s been difficult to identify many truly outstanding centre-backs, with the possible exception of Nathalie Bjorn of Sweden, the side with the best defensive record. They conceded one goal, every other team conceded at least three.\nPerhaps there will be more commanding defensive displays in the knockout stage, when outstanding defenders face outstanding strikers. So far, the defending has largely been poor — epitomised by Germany.\nThey boast a brilliant striker in Lea Schuller, two fearsome wingers, technical quality in the No 10 role and tenacious midfielders — but none of their defenders look particularly reliable. Their full-backs leave an absurd amount of space behind them (Sweden’s equaliser in their 4-1 win in Zurich is one example) and there’s little evidence of good connections between the four. Oh, and at right-back, first-choice Giulia Gwinn left the tournament after the first match because of injury, and her stand-in Carlotta Wamser was dismissed for a goalline handball against Sweden, so things might get worse in their quarter-final against France.\nAdvertisement\nTeam of the round\nLivia Peng (Switzerland): None of the 16 goalkeepers kept a clean sheet on matchday three, but Peng was only beaten by a penalty and made a couple of very good saves.\nElisabetta Oliviero (Italy): She popped up with the opener against Spain and made several good runs as Italy concentrated their attacking down the right.\nNathalie Bjorn (Sweden): A strong tackle in the build-up to Sweden’s second goal in the win over Germany sums up her style at this tournament: always determined to use her physicality and win the ball high up the pitch.\nNoelle Maritz (Switzerland): Another fine performance on the left of a back three, Maritz is generally considered an old-school defender. She has attacked with great determination throughout this tournament.\nKerstin Casparij (Netherlands): A surprise pick on the left, considering she’s generally a right-sided defender, but Casparij proved capable of crossing with her left foot, and did a good job stopping the dangerous Cascarino for the first hour. She could do little about Cascarino’s sensational long-range hit, and even the penalty awarded against her late on seemed harsh.\nKika Nazareth (Portugal): It’s a great shame the 22-year-old Barcelona midfielder wasn’t fit to start her side’s first two games. Her directness in possession was striking throughout Portugal’s 2-1 defeat to Belgium, and her ball for Telma Encarnacao is one of the assists of the tournament.\nLia Walti (Switzerland): A true captain’s performance when Switzerland were under huge pressure. Her team-mates constantly looked to her for inspiration, giving her the ball even when she was under pressure. Walti’s quick feet and positivity allowed her side to advance up the pitch.\nElla Toone (England): When England dominate possession against weaker sides, Toone is the perfect No 10, always harrying high up the pitch and making runs into the box. Against Wales, she scored, assisted, and completed 100 per cent of her passes. According to Opta, whose records go back to 2013, this is the first instance of this happening in the women’s Euros.\nAdvertisement\nJohanna Rytting Kaneryd (Sweden): Another starring performance down the right flank. The Chelsea winger was involved in the moves leading up to the third and fourth goals, and exploited the huge amount of space left behind by Germany’s advancing left-back Sarai Linder.\nTessa Wullaert (Belgium): Quietly, one of the most impressive attackers in the group stage, always peeling off into the channels and sending through-balls in behind. Scored an impressive opener in the 2-1 win over Portugal, was involved in almost all her side’s best attacking moves, and her set-piece delivery was excellent, having been woeful in Belgium’s opening game.\nSigne Gaupset (Norway): In a heavily changed Norway side, the relatively unknown 20-year-old came into the side on the left flank, scoring two goals and setting up another two for Frida Maanum. Given Guro Reiten has been quiet, head coach Gemma Grainger should consider starting her against Italy.\n(Top photo: Miguel Medina / Getty Images)",
  "word_count": 1336,
  "scraped_at": "2026-02-14T12:58:47.370927"
}