{
  "article_id": "8ad61394b930",
  "url": "https://www.cardchronicle.com/2023/11/8/23952606/wednesday-afternoon-cardinal-news-and-notes-louisville-cardinals",
  "title": "Wednesday afternoon Cardinal news and notes",
  "date": "20231108T220000Z",
  "domain": "cardchronicle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "—Spread check (football): Louisville by 20.5.\nWednesday afternoon Cardinal news and notes\nGlow Game Magilla is about 24 hours away.\n—Louisville jumped two spots to No. 11 in the new CFP rankings that were released Tuesday night.\n—The AP previews Thursday night’s game between Louisville and Virginia.\n—Damien Barker John and Sander Roed of the Louisville men’s soccer team were each named second team All-ACC on Wednesday, while Josh Jones earned third team honors.\n—U of L men’s soccer is the NCAA Team of the Week.\n—John Michael Hayden’s Cardinals will play at Clemson tonight at 8 p.m. in the semifinals of the ACC tournament. You can watch the game live on the ACC Network.\n—Big Red Louie makes three bold predictions for the Louisville-Virginia game.\n—Remember when everyone thought the FBI deal was going to get Bill Self fired? Instead, he just signed the most lucrative contract for a college basketball coach ever.\nNobody talks, everybody walks.\n—Matt McGavic goes behind enemy lines with a Virginia writer.\n2. With Tony Muskett dealing with an ankle injury, Virginia might have to go back to Anthony Colandrea at QB. What does each QB bring to the table, including their impact on the offense?\nVirginia has two highly capable quarterbacks in Tony Muskett and Anthony Colandrea and we’ve seen the UVA offense click at a high level with either player in the game. Colandrea is an electrifying player, often improvising and pulling off improbable throws outside of the pocket. He’s a highlight reel machine, but also struggles with freshman mistakes, throwing seven interceptions to match his seven touchdowns passes. Muskett is more under control and while maybe not as likely to deliver eye-popping plays like Colandrea, he’s a better manager of the offense and more accurate on short and medium-range throws. His experience and poise late in the UNC game was particularly impressive.\n—The four returnees from last year’s 4-28 basketball team are using the season as motivation.\n—In front of 931 fans last night (not a joke), DePaul opened its 2023-24 season with an 82-74 loss to Purdue Fort Wayne.\nDec. 9. Wintrust Arena. Game of the Century.\n—Pat Forde previews the looming showdown between Michigan and the Big Ten.\n—I thought it was B.S. too but it looks like they really do (sort of) practice the play that resulted in the game-winning basket on Monday night.\n—The matchups on the first week of the college basketball season aren’t great.\n—Louisville Report has the Cards at No. 2 in their weekly ACC power rankings.\n—New U of L football commit JoJo Stone will be on with the Third Banner Podcast crew tonight.\n—The Derek Smith Invitational is returning next month.\n—Could Virginia be another trap game for the Cards?\n—Michael McCammon of Cardinal Authority previews the Cards versus the Cavs.\n—The Cleveland Browns signed former U of L offensive lineman Geron Christian to their active roster on Tuesday.\n—The man was the best.\n—Former Louisville Football great Michael Bush has been named to the 2023 ACC Honors Class, the league announced Tuesday.\n—This year’s Cardinal defense is one of its most dominant over the last three decades. Just like everybody predicted.\nU of L’s defense doesn’t have any player who ranks among the top 200 on the Big Board of Pro Football Focus’ 2024 NFL draft prospects.\nThe Cards are just fine without a dominant player.\nThey rank second nationally behind only Michigan in the fewest number of opponent red-zone attempts with 15. They’re sixth nationally in opponent third-down conversions, allowing first downs 28.2% of the time.\nThey lead the ACC and are seventh nationally in run defense, giving up 88.8 yards per game. And they rank in the top 15 nationally in total defense and scoring defense.\nLouisville is allowing 282.2 yards per game. If that stands for the remaining three games, it would mark only the third time in program history since 1990 that U of L kept opponents below 300 total yards per game.\nThe Cards defense hasn’t allowed a touchdown in three home games. They’ve been so dominant that they have made U of L coach Jeff Brohm’s coin flip strategy easier. He believes deferring to the second half is an advantage, especially when the defense can get a stop on an opponent’s first drive.\n—Cardinal Authority looks at where U of L football stands in the national stats.\n—The first Publix in Kentucky is set to open on Jan. 10, 2024.\n—The Yum Center provides the best women’s basketball environment in the ACC.\n—Mark Lieberman’s video breakdowns are great.\n—Louisville has been dominant at home so far this season, a trend the Cards hope continues Thursday night.\n—U of L is one of the best athletic programs in the country when it comes to promoting its men’s and women’s sports equally.\n—Card March time for tomorrow’s game is 5 p.m.\n—And finally, Streaking the Lawn has a really good preview of tomorrow night’s game at L&N Stadium, one which ends with a prediction of a 42-17 Cardinal victory.",
  "word_count": 842,
  "scraped_at": "2026-02-14T12:06:07.394710"
}