{
  "article_id": "8b2a06b7f9ae",
  "url": "https://www.thelocal.es/20240229/world-champions-spain-beat-france-to-win-womens-nations-league",
  "title": "World champions Spain beat France to win Women Nations League",
  "date": "20240229T134500Z",
  "domain": "thelocal.es",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Spain continued their golden run of form as they prepare for a first ever appearance at the Olympics in Paris later this year.\nThe world champions secured a title at the first attempt for coach Montse Tomé, who replaced controversial boss Jorge Vilda after he was sacked following the World Cup and ex-football federation president Luis Rubiales's forcible kiss on the lips of forward Jenni Hermoso.\n\"In September things were strange, we faced it, we tried to solve it,\" Tomé said of the fall-out following the Rubiales scandal when she took over.\n\"September is a long time ago and now we're in a different time.\n\"I like to focus on the positive and I feel that this team has given me a lot.\"\nHopes are high that France, coached by Herve Renard, can challenge for the Olympic title on home soil, but they were completely outplayed by Spain.\n\"I faced Spain at the 2018 World Cup with Morocco, against a midfield of (Andres) Iniesta, Isco and (Sergio) Busquets. I had the impression that I saw the same thing this evening,\" said Renard.\nSpain dominated the early stages, coming close to breaking the deadlock in the 26th minute when centre-back Irene Paredes powered a header from a corner just wide.\nBonmatí strikes\nThe hosts did forge ahead just after the half-hour mark as France were cut open down their left-hand side, with Ballon d'Or winner Bonmatí arriving unmarked in the centre to volley home Olga Carmona's cross from close range.\nSpain almost doubled their advantage in the final seconds of the first half, as Laia Aleixandri headed wide, with appeals for a penalty for a possible deflection off France defender Amandine Henry's arm waved away.\nBut Tomé's side wasted little time in making it two after the break, as Mariona Caldentey swept Ona Batlle's low ball into the bottom corner in the 53rd minute.\nFrance never threatened a fightback, failing to muster a single shot on target in the match.\nParedes had another header saved by France goalkeeper Pauline Peyraud-Magnin as Spain pushed for a third, but they had to settle for the most straightforward of two-goal victories.\n\"Six months ago we won the World Cup and now the Nations League, what more could you ask for?,\" Barcelona star Bonmatí told RTVE.\n\"It's quite incredible everything we have achieved... This team has no ceiling -- World Cup, now Nations League and now for the Olympics.\"\nLater on Wednesday, Germany saw off the Netherlands 2-0 in the third-place play-off in Heerenveen to join Spain and France, who did so automatically as hosts, in qualifying for the Olympics.\nTwo second-half goals in the space of 11 minutes from Klara Buhl and Lea Schuller decided a tight game.\nGermany, 2016 gold medallists in Rio de Janeiro, failed to qualify for the 2020 Tokyo Olympics where Canada won the title.",
  "word_count": 475,
  "scraped_at": "2026-02-14T12:47:32.790850"
}