{
  "article_id": "8b40435ac864",
  "url": "https://www.cnn.com/2024/02/09/opinions/taylor-swift-super-bowl-swiftie-heaven-bass/",
  "title": "Opinion : The Super Bowl is here . Are we ready for it ? ",
  "date": "20240209T134500Z",
  "domain": "cnn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Editor’s Note: Amy Bass (@bassab1) is professor of sport studies at Manhattanville College and the author of “One Goal: A Coach, a Team, and the Game That Brought a Divided Town Together” and “Not the Triumph but the Struggle: The 1968 Olympics and the Making of the Black Athlete,” among other titles. The views expressed here are solely hers. Read more opinion on CNN.\nSunday’s Super Bowl will gift different things to different people, magnifying the manner in which the National Football League (NFL) has transformed its sport into a bona fide entertainment industry. While this is nothing new, the addition of Taylor Swift — and the adulation, condemnation, and profit generation that follow her and her merry band of Swifties wherever she goes — to the mix has made things far more interesting than predictions about who will win on the gridiron, a vivid demonstration yet again of how sport can be about sport, but it also tells us so much more.\nTo be sure, some viewers will tune in Sunday to see a spectacular display of American capitalism — ads featuring Budweiser’s famous Clydesdales, Christopher Walken behind the wheel of a BMW and the likes of Martha Stewart, Snoop Dogg, and Willie Nelson peddling Bic lighters. Music lovers will wait for the moments when Allegiant Stadium in Las Vegas converts to a concert venue, with a halftime show featuring Usher, Reba McEntire taking on the national anthem alongside Oscar-winner Daniel Durant, Andra Day performing “Lift Every Voice and Sing” and Post Malone giving us his rendition of “America the Beautiful.”\nAt the purported center of all of this, and surrounded by a maelstrom of predictions, analysis and commentary, the Kansas City Chiefs will attempt to defend their championship title against the San Francisco 49ers. But regardless who wins the game on Sunday, something more than the NFL season is coming to an end: Chapter 1 of Taylor Swift’s football era.\nAnd while I, for one, am not ready for it, it might be a good time to take a hot minute and unpack all that has happened since September 24, which marked the first time Taylor popped into a stadium in, as one of my students quipped, “her off-season.” She cheered on Chiefs’ tight end Travis Kelce from his family’s private suite in Arrowhead Stadium, an arena she knows all too well from her historic Eras Tour, a tour whose first leg had the economic impact of a Super Bowl at each of its 20 stops — 53 concerts in all.\nSwiftie power is real\nSwifties, Taylor’s rabid fan base (full disclosure: I’m the problem, it’s me) known for its spending power as much as for its devotion, were on it, vetting Kelce’s suitability in the wake of all of the breakups that “Mother” has outlined in so many songs and deciding, with 21st century fiber internet speed (ie: TikTok), that he understood the assignment. The NFL and those that broadcast it agreed, gleefully jumping into the fun in those early days, repeatedly showing Taylor alongside Donna “Mama” Kelce and Brittany Mahomes. Commentators made their first adorable puns, inserting her lyrics into their play-by-play calls and loving how Travis and Taylor left together after the game in, as Travis slyly joked to his brother Jason in their “New Heights” podcast, his “getaway car.”\nSales of Travis’s #87 Chiefs’ jersey skyrocketed some 400% in the days that followed, igniting a retail fervor that has grown bigger than the whole sky, from shirts proclaiming “I’m in my Football Era” to middle schoolers donning sweatshirts in the Chiefs’ colors to support “Taylor’s boyfriend.”\nBut with the money also came the blame, especially when the Chiefs (briefly) spiraled into a mid-season slump. Despite head coach Andy Reid properly and judiciously taking full responsibility for the losses, especially the team’s overall struggling offense, sport pundits and fans alike began to complain how Taylor dominated game coverage. Commentator Skip Bayless dubbed Taylor “a distraction” and sports gadfly Clay Travis blamed Kelce’s “worthless Pfizer shots” (more on that later) and asked if Taylor was “the Yoko Ono of the Chiefs dynasty” — a stance he’s doubled down on in the days leading up to this Sunday’s game.\nSports fans usually eat stats for breakfast, lunch and dinner and don’t complain when cameras show shots of coaches pacing or face-painted fans dancing or Mama Kelce sitting next to NFL commissioner Roger Goodell to watch her sons battle it out at last year’s Super Bowl, her customized shirt featuring both teams now sitting in the Pro Football Hall of Fame. Many fans were happy to jump right on board the blame-Taylor train, ignoring the fact that the Chiefs won 9 of the 12 games Taylor attended, Travis passed Jerry Rice for most receptions in the postseason and Taylor averaged just 25 seconds onscreen per 3+ hour game.\nHaters and their hypocrisies\nSo now we know: it takes less than half a minute to unleash a misogynistic storm from all those “dads, Brads and Chads.”\nNewsmax host Greg Kelly went so far as to shame Swifties for their devotion, deeming their behavior at her concerts a sin, “totally over the top worshiping this woman…elevating her to an idol.”\nHas Kelly met a Buffalo Bills fan? Or talked to anyone at a Trump rally for that matter?\nWhat a message to send to these girls and women who started tuning into Chiefs games to catch these (very) few glimpses of Taylor supporting her new love: Hey, girl — you are taking up too much space in our world. Football is for us. Not you. You can’t sit here.\n(Sidebar: seven years ago I wrote about the Super Bowl and one lonely soul in the comments section wrote “She’s just spouting what her boyfriend said about the game.” So, to be clear: even before Taylor, these people were passionate that we women didn’t know nothin’ about that football.)\nTo be equally clear: Taylor isn’t ruining the NFL. She’s recast this institution, with its toxic baggage — CTE, domestic violence and a team with a moniker so offensive that it no longer exists — as a love story. If anything, the NFL — which really likes making money and is really good at it — should be showing Taylor more love than it already is.\nAs the NFL sees its fan base grow so much older (but apparently not wiser), the multibillion dollar increasingly global league is smart enough to embrace the young, female fans following the action to stay abreast of the Swift-Kelce relationship. Alongside its highest regular-season viewership among women ever and prior to the Chiefs defeat of the Baltimore Ravens for their Super Bowl spot, safe estimates of Taylor’s financial impact on the NFL hit approximately $330 million.\nAt this point, the NFL should be selling its own official Taylor Swift shirts — Jason Kelce would make a great model — and interviewing her at halftime about her thoughts on the instant replay reversal play clock. The so-called Swift Effect, which, again, has added millions upon millions of dollars to the NFL’s already considerable coffers and been deemed “wonderful” by Goodell himself, might end up saving football, not ruining it. Goodell said at a pregame press conference in Las Vegas that “my daughters and all of our family are Swifties… Taylor is obviously a dynamo. Everything she touches, obviously there are people following. And so we count ourselves fortunate and we welcome it.”\nThis is about more than football, or even money\nBut it’s more than the money. As the Swifties gleefully triggered their male partners on TikTok by claiming that Taylor was putting Travis “on the map” and flexed their muscles by sending the Kelce brothers to the top of the charts with for their terrible Christmas carol, the political far-right came out in full force against the newly minted relationship between Miss Americana, who once inspired over 35,000 people to register to vote with a single Instagram post, and her Pfizer Prince, who has long been despised by the far-right for appearing in promos for Pfizer to encourage the public to get Covid-19 boosters and flu shots, not to mention once taking a knee in support of Colin Kaepernick and partnering with Budweiser (now shunned by conservatives for its ad featuring Dylan Mulvaney).\nConservative political (so-called) mouthpieces and conspiracists, including one-time GOP presidential hopeful Vivek Ramaswamy, have lost their damn minds over the Swift-Kelce relationship, obviously in disbelief that a woman is capable of this much power without some kind of backing from some imaginary deep state. Their idea? Taylor Swift is a mastermind Pentagon asset and America’s dominant love story is a Democratic psy-op pro-Biden election plot.\nI hope that at the very least, if true, the Democrats will grant Coach Reid an ambassadorship as a show of appreciation when all is said and done.\nThe far right’s reaction to Taylor’s football era is a lesson that people are who they show us they are, and sometimes they make it super simple: we should believe that they believe what they say they believe. Except now, instead of landing on the front page of supermarket checkout land tabloid rags, these ridiculous theories are posing as newsworthy political dialogue — right up there with those who think Trump won the 2020 election.\nIt’s a shame these folks didn’t get to know Taylor a bit better before they donned their tin foil hats, because as many a Swiftie will try to convince you: she’s doing all of this. You want conspiracy theories? Take a dive into Swiftie math, which revolves around the number 13, the date Taylor was born (and so much more), and makes baseball stats look like kindergarten: Super Bowl 58 (5 + 8 = 13), which, if she shows up (after a flight from Tokyo that is approximately 13 hours and has been deemed more than doable by Japan’s Embassy, who incorporated no less than three album titles in its official statement), will be Taylor’s 13th NFL game this season, is taking place on February 11 (2 + 11 = 13) with the Chiefs facing the 49ers (4 + 9 = 13), whose quarterback, Brock Purdy, wears — wait for me — 13. Oh, and San Francisco was the #1 seed and Kansas City was the #3 seed and, well, you know how to do this now, right?\nGet Our Free Weekly Newsletter\n- Sign up for CNN Opinion’s newsletter\n- Join us on Twitter and Facebook\nSo now we wait for the next chapter, the next era, wondering if Taylor and Travis will provide us with a “marry me Juliet” moment or a breakup that will lead her to write the next installment of “Dear John.” But regardless, this woman who has released 14 (soon to be 15) albums in under two decades, reshaped the music industry, plays guitar and piano, has sold over 200 million records, has students at Harvard and Stanford studying her, and just passed the likes of Frank Sinatra, Paul Simon and Stevie Wonder for the most Album of the Year Grammy Awards? Let her sit with you, football fans. Respect her. Because 13 + 87 is 100. And that’s a perfect score.",
  "word_count": 1873,
  "scraped_at": "2026-02-14T12:41:14.408316"
}