{
  "article_id": "8b52b3511130",
  "url": "https://www.cityam.com/exclusive-wsl-facing-row-with-clubs-over-in-game-manager-interviews/",
  "title": "WSL facing row with clubs over in - game manager interview plans",
  "date": "20250808T151500Z",
  "domain": "cityam.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Exclusive: WSL facing row with clubs over in-game manager interviews\nWomen’s Super League chiefs are facing a row over demands that clubs make their managers available for broadcast interviews during matches next season.\nAt least three clubs are understood to have objected to the radical proposal, which would apply to each team at least once per season.\nThere has also been disquiet at what some feel is a move that is being imposed on them without sufficient consultation. WSL chiefs are understood to dispute that.\nSome of the three clubs, who include some of the WSL’s most powerful, have suggested offering other coaching staff up for in-game interview as a compromise.\nWhile commonplace in rugby union, in-game manager interviews have not been widely used in football, where the action tends to feature fewer pauses.\nThe WSL is looking to innovate with its broadcast output as it enters the first season of a new five-year contract with Sky Sports and the BBC which will see almost every fixture televised.\nIt comes amid pressure to capitalise on another spike in domestic interest in the women’s game, after the Lionesses successfully defended their Euros title last month.\nThe WSL declined to comment but sources close to the league indicated that in-game manager interviews were one of several innovations being considered.\nThere is appetite at the league to build on the women’s game’s reputation for being more accessible than the men’s, with broadcasting seen as one way to demonstrate that.\nWSL set to begin record-breaking TV deals\nThe WSL’s new TV deals are the most lucrative in women’s club football and worth a reported £65m over five years. Broadcasters are also covering production costs, taking the estimated overall investment to around £100m.\nSky Sports will show up to 78 games in the 2025-26 season and the BBC up to 21. It means that as many as 99 of the 132 fixtures will be on TV in the UK, with the remainder to be shown for free on YouTube.\nClubs have already capitalised on the increased investment with record-breaking transfers. Last month Olivia Smith became the game’s first £1m signing when she moved from Liverpool to Arsenal. It continued a trend of spiralling fees.\nThe WSL is also set to innovate with its spectator experience in the coming campaign, with seven of the 12 clubs set to trial allowing the consumption of alcohol in stands. Drinking in the stadium bowl has been banned in the men’s professional game since the 1980s.\nThe new WSL season begins on 5 September, when champions Chelsea host Manchester City at Stamford Bridge.",
  "word_count": 433,
  "scraped_at": "2026-02-14T12:23:30.952801"
}