{
  "article_id": "8b5664f31868",
  "url": "https://www.afl.com.au/news/1459708/2025-jill-lindsay-scholarship-recipient-announced",
  "title": "2025 Jill Lindsay Scholarship recipient announced",
  "date": "20251204T090000Z",
  "domain": "afl.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The AFL is pleased to announce the Sydney Swans' Football Operations Manager, Stephanie Maiolo, as the recipient of the 2025 Jill Lindsay Scholarship, awarded at the AFL Women’s Summit on Tuesday, December 2.\nThe annual summit, attended by women from across the AFL industry, was hosted by Sarah Ashmore and featured key speakers including AFLW pioneer and West Coast Eagles AFLW Senior Coach Daisy Pearce, KIC CEO and co-founder of Smiling Mind Janey Martino, AFL Executive General Manager People Sarah Fair, AFL Executive General Manager Football Operations Laura Kane and AFL Executive General Manager Customer, Commercial & Technology Bec Haagsma.\nEstablished in 2011, the Jill Lindsay Scholarship supports the development and career aspirations of talented women regarded as rising stars within the AFL industry.\nThis year’s scholarship was presented to Stephanie by Executive General Manager Customer, Commercial & Technology, Bec Haagsma, who congratulated her on receiving the prestigious honour.\nExecutive General Manager People, Sarah Fair, said Stephanie exemplifies the high calibre of women who are helping shape the AFL’s future.\n“On behalf of the AFL, I congratulate Stephanie on being the deserving recipient of the 2025 Jill Lindsay Scholarship,” Fair said.\n“Stephanie has been involved at the Sydney Swans Football Club for eight years, initially joining as an Events Intern before progressing into a core member of the football department as Football Operations Manager.\n“Stephanie is an emerging leader in her field, and we’re thrilled to support her growth and career aspirations as she deepens her impact across the industry.\n“The Jill Lindsay Scholarship is an important initiative that recognises talented women who are shaping the future of our game, giving them a powerful platform to support their ambitions and realise their potential.\n“This year’s outstanding group of applicants across the AFL and our Clubs, reflects the strength of talent across our industry and highlights why continued investment in the next generation of women leaders is so important.”\nStephanie said she was honoured to receive the award and thanked those who have supported her throughout her career.\n\"I feel extremely proud and honoured to receive the Jill Lindsay Scholarship for 2025. Jill Lindsay was a pioneer for women in the AFL and championed all around her. To be mentioned in the same sentence as someone who was as respected as Jill, is an incredible honour.\"\n\"I would also love to take a moment to thank the Sydney Swans Football Club. From the very start of my career, I have always felt supported and encouraged to achieve my goals. The club is full of so many talented and wonderful people and I’m so grateful I get to call it my workplace. The leadership and camaraderie that exists at the Swans is something very special and I feel very lucky to be a part of it.\"\nAbout Jill Lindsay:\nJill Lindsay served the AFL for 41 years in various roles including VFL Park match day manager and VFL membership manager before being appointed Grounds Operations Manager in 1991. On February 7, 2011, Jill passed away after losing her battle with cancer.",
  "word_count": 509,
  "scraped_at": "2026-02-14T12:59:05.114964"
}