{
  "article_id": "8b82e4cc32f3",
  "url": "https://www.the42.ie/klopp-esl-6257798-Dec2023/",
  "title": "Klopp says court ruling will give Uefa a  bit of a shake  while Postecoglou criticises ESL idea",
  "date": "20231222T204500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LIVERPOOL MANAGER JURGEN Klopp believes Thursday’s landmark court ruling in Europe will have given Uefa a “shake” and prevent it from adding more matches to the calendar without any challenge.\nThe European Court of Justice said Uefa rules which blocked the formation of the European Super League in 2021 were contrary to EU law.\nThat led backers of the Super League to declare victory and immediately unveil plans for new men’s and women’s competitions.\nWhile Klopp agreed with the Reds’ statement saying their interest in the Super League had been discontinued, he was more interested in the court ruling highlighting that bodies like Uefa and Fifa must not govern in self-interest, and must have a framework of transparent, objective, non-discriminatory and proportionate rules.\n“I like that we get a little bit of understanding that people in Uefa and other FAs cannot just do what they want – putting in competitions with more games and no one has a real say in it,” he said today.\n“I like that they get a bit of a shake – ‘OK, you cannot exactly do what you want’.”\nFrom next season the Champions League will feature eight games instead of six in a new 36-team league phase, plus the prospect of a two-leg play-off for 16 of those sides vying for the final eight berths in the first knockout round.\nUefa would argue that the new format was extensively consulted on with the European Club Association – of which Liverpool are a member – plus the leagues, national football associations and players’ unions.\nTottenham manager Ange Postecoglou, meanwhile, says ideas like the European Super League often come from people who are “detached from what this game is all about”.\nSpurs were one of six English clubs who were signed up to the original Super League in 2021 before swiftly withdrawing amid fan protests.\nAll six Premier League teams involved last time have already distanced themselves from any attempt to revive the ESL.\n“The response it got the first time around is a pretty good indicator of where it sits within the footballing fraternity in general,” the Australian said.\n“That’s always a pretty decent barometer. I always think with these concepts they’re always done in a room with people who sometimes are detached from what this game is all about.\n“It won’t surprise anyone that I’m fairly conservative with these things. I’m a traditionalist. I don’t like the game changing too much, I don’t like rules changing too much.\n“But I guarantee you I won’t be in that room when these kind of concepts are put together. But you have a fairly good barometer of what the most important people – the fans – felt about it and football people in general, so we’ll see what the outcome is.”",
  "word_count": 464,
  "scraped_at": "2026-02-14T12:46:22.254001"
}