{
  "article_id": "8b8907400f35",
  "url": "https://www.nationalaccordnewspaper.com/fifa-sanction-against-south-africa-rekindles-nigerias-world-cup-hopes/",
  "title": "FIFA sanction against South Africa rekindles Nigeria World Cup hopes",
  "date": "20251001T063000Z",
  "domain": "nationalaccordnewspaper.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A FIFA ruling against South Africa has given Nigeria’s 2026 World Cup qualification campaign a fresh lifeline — but football stakeholders are warning that it will mean nothing unless the Super Eagles rise to the occasion.\nThe world football governing body penalized South Africa for fielding ineligible midfielder Teboho Mokoena during their 2-0 win over Lesotho in March. The result has been overturned in favour of Lesotho, who have now been awarded a 3-0 forfeit victory. In addition, the South African Football Association was fined 10,000 Swiss Francs (approx. ₦10 million).\nThe development dramatically alters the outlook in Group C, breathing new life into Nigeria’s previously fading qualification hopes.\nWith the adjusted table, South Africa now leads with 17 points, followed by Benin (14 points). Nigeria and Rwanda are tied on 11 points, but Nigeria holds a slight edge on goal difference (+2 vs Rwanda’s +1).\n*Stakeholders React: “This Is a Lifeline”*\nFormer Nigeria Women Football League chairperson, Aisha Falode, described FIFA’s sanction as a rare opportunity for Nigeria — but warned against false hope.\n> “Football isn’t just about passion; it’s governed by rules,” Falode told the News Agency of Nigeria (NAN). “South Africa broke those rules and must face the consequences. That said, we must not assume this guarantees our qualification.”\nShe also raised concerns about Lesotho’s delay in challenging the eligibility issue, suggesting that FIFA might need to dig deeper to uphold the integrity of the qualification process.\n> “Silence from Lesotho is curious. Was it ignorance, or complicity? FIFA should investigate further,” she said.\nFalode stressed that qualification is now within reach — but only if Nigeria defeats Lesotho and Benin in the final fixtures.\nBoboye: “It’s Still In Our Hands”\nVeteran coach Kennedy Boboye agreed that the sanction changes the dynamics but insisted that Nigeria’s destiny lies in its own performances — not FIFA’s rulings.\n> “The deduction doesn’t mean anything if we don’t take care of business,” Boboye said. “The Super Eagles must show hunger and consistency in these last two matches.”\nHe was also critical of the team’s earlier results, arguing that poor home performances have left Nigeria depending on external factors.\n> “If we’d handled earlier games properly, we wouldn’t be in this position. Every match from here on is a must-win.”\n*Odidika: “We’re Still Chasing Because of Poor Attitude”*\nSouth Africa-based coach Emmanuel Odidika was more direct in his criticism. He called the FIFA ruling a “wake-up call” and said it exposes the deeper issues within Nigeria’s current squad.\n> “This decision should have sealed our qualification. Instead, it highlights how much we’ve underachieved,” he said.\nHe slammed the lack of urgency among some Super Eagles players and accused a few of prioritizing personal distractions over national duty.\n> “Too many players are mentally absent. Some are more focused on brand deals than playing for the badge. That’s unacceptable.”\nWhile he praised the performances of Calvin Bassey and Terem Moffi, he was disappointed with the form of Wilfred Ndidi, Ademola Lookman, and William Troost-Ekong.\n> “We need leaders on the pitch, not just names on paper,” he added.\n*All Eyes on the Final Stretch*\nDespite differing tones, all three stakeholders agree: Nigeria’s qualification depends solely on two victories — away to Lesotho and home against Benin. The Super Eagles must now focus on execution, discipline, and unity.\n> “This is the time for results, not regrets,” Falode concluded. “The World Cup is not given — it’s earned.”\nAs the group table stands on a knife’s edge, the path is clear: Win or miss out.\nNAN",
  "word_count": 594,
  "scraped_at": "2026-02-14T12:44:24.646045"
}