{
  "article_id": "8b92e3532e97",
  "url": "https://www.ksl.com/article/50732350/utes-move-up-to-no-11-in-latest-ap-top-25-rankings",
  "title": "Utes move up to No . 11 in latest AP Top 25 rankings",
  "date": "20230917T191500Z",
  "domain": "ksl.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Estimated read time: 2-3 minutes\nThis archived news story is available only for your personal, non-commercial use. Information in the story may be outdated or superseded by additional information. Reading or replaying the story in its archived form does not constitute a republication of the story.\nSALT LAKE CITY — Thank you, Florida.\nThat's the message Utah should send to their SEC friends after the Gators provided some more substance to Utah's resume three weeks into the season. Florida beat a ranked Tennessee team at home Saturday night, making Utah's win over Florida that much more impressive in retrospect.\nThe season is still young, but resume-building never takes a week off.\nUtah took care of business at home against in-state FCS program Weber State, even if it wasn't the most \"dominant performance or our best football,\" according to head coach Kyle Whittingham. The win helped move the Utes up one spot in the Associated Press Top 25 rankings to No. 11.\nThe Utes got a bump in the rankings largely due to Tennessee, who was previously ranked 11th last week, falling 12 spots to No. 23 this week after suffering its first loss of the season to Florida. With the win, the Gators moved up to No. 25 in the rankings.\nUtah remains one of eight teams ranked from the Pac-12 — the most out of any conference — and is now the fourth-highest ranked school in the conference. USC, which had a bye week, remains at No. 5, followed by Washington (8), Oregon (10), Oregon State (14), Colorado (19), Washington State (21) and UCLA (22).\nColorado narrowly staved off defeat against in-state rival Colorado State with a come-from-behind victory that took two overtime periods to get it done — all without dynamic two-way player Travis Hunter, who was taken to an area hospital after suffering an undisclosed injury on a hit during the game.\nBut the Pac-12 now shifts to conference play, and some of these teams will start beating up on each other.\nIn a week where few teams looked dominant, including much of the previously ranked Top 25, Georgia maintained its spot at the top of the rankings with 57 first-place votes. But as has been the case each week, the first-place votes continue to be spread out among other teams, with Michigan earning two first-place votes, Texas with three votes, and Florida State with one.\nBehind the Bulldogs in the rankings is No. 2 Michigan, No. 3 Texas, No. 4 Florida State and No. 5 USC. Outside of USC, each of those teams struggled at times in their respective game before escaping the week with a victory.",
  "word_count": 441,
  "scraped_at": "2026-02-14T13:51:09.410254"
}