{
  "article_id": "8bb1e99cc477",
  "url": "https://www.birminghammail.co.uk/news/showbiz-tv/itv-coronation-street-pulled-air-27768266",
  "title": "ITV Coronation Street pulled from air and viewers say  youre messing us about  ",
  "date": "20230922T133000Z",
  "domain": "birminghammail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ITV Coronation Street pulled from air and viewers say 'you're messing us about'\nCoronation Street won't air from 8pm as usual - with ITV instead airing England's Lionesses.\nITV Coronation Street has been pulled from air tonight as fans react to the news. Coronation Street won't air from 8pm as usual - with ITV instead airing England's Lionesses.\nTaking to Facebook after Corrie confirmed the schedule change, announcing it would be airing just Monday, Tuesday and Wednesday this week, ITV viewer Jill said: \"Thanks for that. Missed last night's so must catch up online. Never noticed.\" Paul said: \"Hasn’t been worth it. I’m sorry but zzz. Get shut of this Ryan storyline, Stephen's reign and few others.\"\nJohn said: \"Stopped watching it years ago due to messing times about. Can't say I've missed it.\" Cath said: \"What happened to last night coronation street,it's not on catch up.\" Sandra said: \"Stopped watching 2 years ago after nearly 60 years. Utter rubbish rubbish. Doom gloom & violence. No thank you. Just our household opinion!\"\nREAD MORE Barclays issues £235 warning to customers and says 'people have to adapt'\nIan said: \"Oh no. The world will collapse if there isn't the correct number of hours of coronation Street on every week.\" Kath said: \"Football again then or maybe rugby ...so fed up with it we had that all weekend , what's up with the sports channels why must it be put on itv and for the whole evening.\"\nBut Fiona said: \"Cannot believe how worked up some sad people get over a soap opera! For goodness sake, sure you will survive!\" Tracie said: \"Rugby change day again like last time but my series link saying Monday Wednesday Friday. Update since yesterday my series link change to record tonight.\"\nLive UEFA Women’s Nations League will take its place as England take on Scotland on ITV this evening. Corrie will next be back on our screens on Monday (September, 25), airing in the usual slot of 8pm til 9pm. Coronation Street usually airs on Monday, Wednesday and Friday at 8pm on ITV.",
  "word_count": 347,
  "scraped_at": "2026-02-14T13:03:49.745142"
}