{
  "article_id": "8bc20b259d34",
  "url": "https://www.twtd.co.uk/ipswich-town-news/48480/sunday-date-for-bristol-rovers-cup-clash",
  "title": "Sunday Date For Bristol Rovers Cup Clash - Ipswich Town News",
  "date": "20241206T193000Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Friday, 6th Dec 2024 17:42\nTown’s Emirates FA Cup third round tie against League One Bristol Rovers at Portman Road will be played on Sunday 12th January with a 3pm kick-off as it is being shown live overseas.\nBlues boss Kieran McKenna was asked for his thoughts on the cup draw at today’s press conference but says he hasn’t given it too much thought at this early stage.\n“That’s an early question,” McKenna smiled. “We’re not thinking past the next game. I saw the draw, was glad to get a home game.\n“We’ll start to think about Bristol Rovers once we start to get through Fulham and the busy Christmas period.”\nThe Blues and Rovers famously met in the competition in the fifth round in 1978 with Town on their way to winning the trophy for the only time.\nFollowing a 2-2 draw in the snow at Eastville, the Blues won 3-0 at Portman Road in the replay.\nSince then, the clubs have been drawn against one another three further times in the FA Cup. In the fifth round in 1979, the Blues won 6-1 at Portman Road, six years later Town were victorious 2-1 in the third round at Eastville.\nThe teams met at Rovers' current home the Memorial Stadium in 1998, again in the third round, and drew 1-1, again in snow, with the Blues winning the replay 1-0 at Portman Road.\nMore recently, as well as League One clashes, the teams met in the Carabao Cup in August last year, the Blues running out 2-0 winners with Jack Taylor, on his debut, and Sone Aluko, his final goal in professional football, on target.\nThe Rovers squad includes former Blues Grant Ward and James Wilson, and one-time loanee Luke Thomas.\nPhoto: Action Images via Reuters\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nI am getting fed up of how modern football is treating fans who actually go to games. Recent examples:\n- We have another Sunday match this weekend because Bournemouth played on TV last night.\n- ITFC v Bournemouth (2pm) clashes with the ITFC Women v Bournemouth (1pm) FA Cup match on Sunday meaning fans have to choose between the teams.\n- Yesterday the draw for the expanded Club World Cup was taken, a competition no one wants.\n- Wolves wore black shirts at Everton. Tottenham wore blue shirts at Bournemouth.\n- VAR took about four minutes to decide an offside at the weekend.\nNow il just watch it on the box,\nNo transport on a Sunday,\nThat said - whether it affects attendance will somewhat depend on whether all these people moaning they can't get tickets are genuine fans or just Premiersh*t glory hunters...\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 471,
  "scraped_at": "2026-02-14T12:10:09.333891"
}