{
  "article_id": "8bdcb427af53",
  "url": "https://www.latimes.com/socal/daily-pilot/news/newsletter/2023-11-08/tn-dpt-me-timesoc-latest-news-in-orange-county-tustin-fire-destroys-ww2-hangar-timesoc",
  "title": "Locals mourn loss of WWII - built Tustin hangar to inferno :  History just went up in flames  ",
  "date": "20231108T183000Z",
  "domain": "latimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Locals mourn loss of WWII-built Tustin hangar to inferno: ‘History just went up in flames’\n- Share via\nGood morning. It’s Wednesday, Nov. 8. I’m Carol Cormaci, bringing you this week’s TimesOC newsletter with a look at the latest local news and events.\nOne of two enormous hangars on the site of the former Marine Corps Air Station in Tustin was destroyed yesterday in a fire that was battled by 70 OCFA firefighters on 11 engines, five fire trucks and water-dropping helicopters.\nThe structures they were trying to save were built in 1942 and were constructed largely of Oregon Douglas fir, 2 million board-feet of wood. Their dimensions are awe-inspiring: 17 stories high, more than 1,000 feet long and nearly 300 feet wide.\nThey were, in fact, two of the world’s largest free-standing wooden structures, I learned from this vivid report on the blaze by Los Angeles Times reporters Hannah Fry and Alexandra E. Petri, with assists from staff photographer Irfa Khan and former staff writer Ben Brazil.\nThe hangars were large enough to house in their heyday “military helicopters and blimps armed with machine guns and bombs, so dwarfed by the buildings they looked like toys sitting inside,” according to the story.\nThe fire broke out just before 1 a.m. Tuesday in the north hangar, the one that was incinerated. In their coverage, the Times reporters delved not only into the history of the hangars, which are both listed in the Register of National Historic Places, but also found out just how much they have been appreciated by the community.\nOne of the witnesses they interviewed was Tustin resident Debbie Baker, 70, who was awakened around 1:30 a.m. to helicopters flying above her home. Stepping outside, she could see one of the hangars engulfed in flames. She was fighting back tears as she spoke to a reporter.\n“The buildings acted as a reminder of the county’s origins and its military history even after the base closed in 1999,” Baker said. “For years those hangars welcomed us home. It’s what made this community special.”\nJohn Gaita, 64, who was stationed at the former Tustin Air Base in the 1990s drove from Laguna Niguel on Tuesday morning and was found surveying the scene from a nearby shopping center.\n“History just went up in flames,” Gaita said.\n“This is not the end for what we call the north hangar that was envisioned,” Tustin Mayor Austin Lumbard said. “It’s not the dignified treatment that it deserves.”\nOfficials are investigating the cause of the fire.\nMORE NEWS\n• A federal judge last week overturned a statewide ban on gun shows and ordered the O.C. fairgrounds to resume booking the popular shows. According to a report by Daily Pilot staff writer Sara Cardine, U.S. District Court Judge John W. Holcomb granted a preliminary injunction overturning Senate Bill 264, which prohibited gun shows at the Costa Mesa fairgrounds beginning in 2022, and Senate Bill 915, which extended the prohibitions to all state-owned lands this January. A group of gun advocates led by Utah-based company Crossroads of the West, which has hosted gun shows at the Costa Mesa fairgrounds for nearly 30 years, claimed in an August 2022 lawsuit filed with the U.S. District Court the bills infringe upon their constitutionally protected rights.\n• An Orange County Superior Court judge on Tuesday rejected a temporary restraining order request to halt the recall election of Santa Ana Mayor Pro Tem Jessie Lopez, City News reported, so the recall vote will go ahead on Nov. 14. The question of whether the recall proponents secured enough signatures by using the city’s current electoral map instead of the one Lopez was elected under in 2020 will be decided in January.\n• Disneyland workers are primed for a salary bump after winning living-wage legal battle, according to this story by L.A. Times reporter Gabriel San Román. The California Supreme Court said in late October they would decline to hear an appeal by the Walt Disney Co. in a long-running class-action lawsuit that alleged it was wrongfully skirting a living-wage ordinance passed by Anaheim voters in 2018. The decision cemented a July appellate court ruling that found the law applied to Disney’s two Anaheim theme parks and resort workforce.\nPUBLIC SAFETY\n• An Arizona man, Richard Paul Rodriguez, was arrested on suspicion of murder of a woman whose body was found in the trunk of a car parked outside his parents’ home in Huntington Beach, police said Tuesday. The woman was identified as 54-year-old Christi Lynn Romero. Police in Holbrook, Ariz., had issued a bulletin on Monday about Romero going missing and identifying Rodriguez — her estranged boyfriend — as a suspect in the case.\n• Shannon Beador of “Real Housewives of Orange County” pleaded no contest Thursday to DUI crash Sept. 16 in Newport Beach. In a plea bargain, Beador was sentenced to 40 hours of community service, placed on three years of informal probation and ordered to participate in a nine-month first offender alcohol program.\n• A man and woman were killed in a fiery crash into a bank branch in Tustin early Monday. City News Service reports a patrol officer spotted a Camaro race past him “in excess of 90 mph,” at First and Yorba streets Monday morning just after midnight, according to Lt. Ryan Coe of the Tustin Police Department. When the officer got to Newport Avenue and First, the car had crashed into a U.S. Bank branch at 13300 Newport Ave., and the front end had burst into flames, Coe said.\nLIFE & LEISURE\n• The Hawaiian seafaring canoe Hokule‘a stopped in Newport Beach for a six-day visit on its trans-Pacific journey last week. According to this informative feature story by my Daily Pilot colleague Lilly Nguyen, the Hokule‘a’s latest voyage began along the coast of southeast Alaska in June and was originally expected to take four years to complete. The goal was to span an estimated 43,000 nautical miles, 36 countries and archipelagos, nearly 100 indigenous territories and over 300 ports. But the trip is being interrupted due to the recent wildfires in Hawaii and the uncertainty of the El Niño weather pattern over coming months. Polynesian Voyaging Society chief executive officer and navigator Nainoa Thompson told Nguyen the giant canoe would be returning to Hawaii for a while before resuming its adventure at a date uncertain.\n• Tarzan’s gone from Disneyland’s Adventureland Treehouse, with the new and improved attraction set to open this Friday. L.A. Times game critic Todd Martens provides a preview of the Adventureland Treehouse Inspired by Walt Disney’s Swiss Family Robinson (yes, that’s the full name, Martens notes) and lists the five things a visitor should expect to experience on their climb through its limbs.\nSPORTS\n• The International Surfing Assn. World Para Surfing Championship is taking place in Huntington Beach for the first time this week. An event-record 184 competitors will compete for 27 countries, event officials told the Daily Pilot. The competition runs daily through Saturday, from 7 a.m. to 5 p.m.\n• In Pop Warner action, the Newport Mesa Patriots routed Fullerton 32-7 at Tustin High Oct. 29 for the prestigious Orange Empire Conference Division 2 Orange Bowl title. The big win for the 12-and-under football team was the cap to a perfect 10-0 season. “Winning a title is one thing, but staying perfect is another,” coach Joe Urban told the Daily Pilot. “This group definitely came out every week and they practiced hard and played hard every Saturday and championship Sunday.”\n• Angels standout Shohei Ohtani, expected to win his second MVP in three years, is officially a free agent. L.A. Times sportswriter Sarah Valenzuela offers her list of seven things baseball fans should know as the sweepstakes to sign Ohtani begins.\n• UCI Irvine, the Big West conference winner, and UCLA, the defending national champion, will open the NCAA women’s soccer tournament Friday in Westwood. Kickoff is set for 6 p.m. The meeting will be the second of the year between the two schools, with UCLA winning the first 4-0 in August. Irvine (8-7-6), which has won the last three Big West titles, will be appearing in the NCAA tournament for the fifth time, according to this L.A. Times story by Kevin Baxter.\nCALENDAR THIS\n• The Heroes Hall Museum and Education Center at the Orange County Fairgrounds will host its annual Veteran’s Day commemoration on Saturday, from 2 to 4 p.m. The event will include a post-9/11 veteran-pinning ceremony and the unveiling of a new plaque honoring fallen heroes and veterans who served during that time. Admission and parking will be free. Food and beverages will be provided by the Orange County Employees Assn., and attendees will be able to decorate dog tags and write postcards to troops. Those who have served following 9/11 and are interested in being honored should visit this registration site. For more information, call the Heroes Hall Museum at (714) 708-1613.\n• An O.C. cancer counseling nonprofit will be the beneficiary when Plauzzable and Comedian/Cancer Survivor present a live online stand-up comedy show Saturday, Nov. 18 at 5 p.m. Funds raised will go to Fran’s Place Center for Cancer Counseling in Brea, which provides free licensed, professional therapists to assist cancer patients of all ages, in English and Spanish. The evening of laughter will be hosted by comedian Grace Fraga and feature her fellow comedians Alex Hooper, Mary Kennedy and Jason Stuart. Tickets are $25 and can be purchased at Plauzzable.com, which is also the platform that will present the live show. (You can create a free account at the site to purchase tickets.)\n• “Flowers for Algernon” will be staged by the Estancia High School drama department Nov. 16 through 18. The play is based on the novel by Daniel Keyes and reenvisioned on the stage by David Rogers. It will be performed at the campus’ Barbara Van Holt Theater, with shows starting at 7 p.m. Tickets are available online at estanciadrama.com and at the door. Student tickets are $10, and general admission is $15.\n• Looking ahead: The Rossmoor Woman’s Club’s annual Holiday Home Tour is scheduled from 11 a.m. to 4 p.m. Sunday, Dec. 3. Tickets for the community fundraiser are $25 for adults (children under 12 free) and include self-guided tours of six Rossmoor homes, refreshments, carolers, Santa, a chance to enter a gift basket raffle and a wine pull. For tickets and more information, see the club’s website.\nKEEP IN TOUCH\nThank you for reading today’s newsletter. If you have a memory or story about Orange County, I would love to read and share it in this space. Please try to keep your submission to 100 words or less and include your name and current city of residence.\nI appreciate your help in making this the best newsletter it can be. Please send news tips, your memory of life in O.C. (photos welcome!) or comments to carol.cormaci@latimes.com.",
  "word_count": 1820,
  "scraped_at": "2026-02-14T13:38:45.048961"
}