{
  "article_id": "8beb222b9c95",
  "url": "https://www.manchestereveningnews.co.uk/whats-on/whats-on-news/i-play-manchester-city-ive-32456159",
  "title": "  I play for Manchester City and Ive had abuse for supporting trans rights - but it only encourages me  ",
  "date": "20250921T150000Z",
  "domain": "manchestereveningnews.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "'I play for Manchester City and I've had abuse for supporting trans rights - but it only encourages me'\n'I think we’re taking a few steps back at the moment'\nIt was, by all accounts, only ever going to be a defiant move.\nManchester City player Kerstin Casparij walked out onto the pitch at the Joie Stadium during the Barclays Women’s Super League match against Everton earlier this year with a wristband representing the colours of the trans flag.\nWithin fifteen minutes of the game beginning, Kerstin, who has been with the club for three years now, scored the match’s opening goal - kissing the wristband in response. It also proved to be the club’s only goal, resulting in a 1-1 draw back in April.\n“I always knew that if I scored, I was going to kiss that wristband,” Kerstin tells the Manchester Evening News. “It was all meant to be.”\nStay connected with our City Life newsletter here\nBut, after the game, Kerstin, 25, began receiving ‘horrid’ and transphobic messages on social media not to congratulate her on scoring for her team, but asking why she was openly supporting the trans and non-binary community during a football game.\n“I lost about 300 followers right away,” the midfielder, who is originally from the Netherlands, explains. “But I was actually quite glad about it because if people are going to be transphobic, then I want them to know that I don’t appreciate that.\n“I wasn’t necessarily hurt or upset that they unfollowed me, but it did make me realise that there are still a lot of people out there who are transphobic and actually agree with those who don’t believe they should have equal rights.”\nThe match was played just a week after the Supreme Court ruled that the legal definition of a woman should be based entirely on biological sex. The move could have a profound effect on the rights of transgender people across the UK and could also affect what legal rights trans women have as women.\nKerstin, who also plays for the Netherlands national team, said the messages she received from online trolls were just a tiny snapshot of what she imagines trans people have to face on a regular basis.\n“Some of the messages were horrid,” she explains. “But one thing I love about the queer and LGBTQ+ community is that they stood up to the hatred. There were people stepping into the fire to defend trans rights and so that all the comments were just smothered in love.\n“I thought it was really heart-warming to see a lot of people come together in solidarity and to support - and a lot of allies were involved in that too.”\nSince the match five months ago, Kerstin said she has heard of how her small gesture of support has not only made people feel visible and seen, but has also encouraged others to learn more about the struggles facing the trans community today.\n“The conversation in the changing room afterwards was really cool,” Kerstin said of how her teammates responded. “Everybody was asking me questions about it and we were all able to have a very heartfelt conversation. It was really heartwarming to see everyone was so encouraging.”\nWearing the wristband led Kerstin, who has been dating her partner Ruth for two years, to make contact with the Manchester-based organisation LGBT Foundation. Last week, she was announced as a patron for the charity and will specifically help raise awareness of the importance of visibility and inclusion for LGBTQ+ women.\n“I think that whole experience really taught me that, actually, we still have such a long way to go,” she explains. “I think we’re taking a few steps back at the moment and I want to help change that.”\nLGBT Foundation, who described the footballer as a ‘powerful role model for queer people’, will work with Kerstin on the charity’s programmes, services, and events - ranging from domestic abuse support, sobriety classes, and sexual health workshops - as well as helping to raise vital funds to ensure that all women have safe and welcoming spaces.\n“I’m incredibly proud to be described as a young role model,” Kerstin says. “I’m so grateful to be working with them. Going back to when I was born, there is a big difference in representation and acceptance to then and now.\n“I want to be the role model I wanted to have when I was young and growing up and trying to find my way within my identity. It’s also very wholesome for me because I’m able to give back to my community, and keep paving the way for generations to come. It’s very powerful, it’s very inspiring.\n“And, I think, we should have more people speaking out about the issues faced within the LGBTQ+ community and especially the trans community. As far as I am aware, I was the only one to wear the wristband, so I’m really trying to show people within women’s sports, or English Women’s Sports, that speaking out about something that is considered potentially controversial is incredibly important. It really is not that scary - especially if more and more people do it.”\nKerstin’s newly-appointed patron role also saw her march in the Manchester Pride parade last month for the very first time. As part of the LGBT Foundation procession, she was joined hand-in-hand with her partner Ruth.\n“It was incredible to see all the support from the hundreds of thousands of people that gathered there to show up,” she said. “Despite all of this that’s happened, it actually made me feel quite hopeful about the future.\n“To see young families and their kids so happy and encouraging other people to be themselves just made my heart so full. And to have my girlfriend there with me, who supports me and helps me out and who inspires me every single day, was just really amazing.\n“It’s a reminder that there are a lot of people on our side. We’ve just got to keep that spirit up, be bothered about what is happening around us and genuinely care about things that may not always directly involve us.”\nFor more information and advise on support available, you can visit the LGBT Foundation website or call their helpline on 0345 3 30 30 30.\nJoin our Manc Life WhatsApp group HERE",
  "word_count": 1059,
  "scraped_at": "2026-02-14T12:43:38.737550"
}