{
  "article_id": "8c212704b6cf",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=332588",
  "title": "Game Changer . NAB Show Launches New Sports Summit : The Future of Sports Rights and Fan Experience",
  "date": "20250115T173000Z",
  "domain": "webwire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Game Changer. NAB Show Launches New Sports Summit: The Future of Sports Rights and Fan Experience\nNAB Show registration opens. Featuring key industry players including AWS, IMAX, Microsoft, NFL.\nRegistration is open for the 2025 NAB Show set to bring the global media and entertainment industry together April 5-9, 2025 (Exhibits April 6-9) at the Las Vegas Convention Center. The highly anticipated event will feature key industry trends including sports, artificial intelligence (AI), the creator economy, streaming and cloud virtualization. New this year, the Sports Summit: The Future of Sports Rights and Fan Experience is a three-day program exploring the tech and trends transforming the fan experience and driving new revenue streams.\nA cornerstone for media companies, live sports draw millions of real-time viewers across streaming platforms, television, radio, and social media. The 2025 NAB Show will connect industry leaders and equip businesses with the actionable insights and strategies needed to thrive in this dynamic ecosystem, showcasing how cutting-edge technologies like real-time analytics and immersive fan experiences are redefining content delivery. Additionally, the rise of athlete-owned media ventures and transformative changes like the NCAA NIL rule are creating new licensing opportunities and reshaping the media rights landscape.\nThe Sports Summit includes show floor sessions and an exclusive paid conference that will delve into the lucrative sports sector, where annual U.S. sports rights revenues are projected to rise from $29.54 billion in 2024 to $34.72 billion by 2027, according to S&P Global Market Intelligence.\nImmersive Activations and Cutting-Edge Sports Education\nThe 2025 NAB Show will offer an unparalleled mix of immersive experiences and insightful programming:\n- Engaging Audiences through On-Air Talent: Discover how the National Football League (NFL) and other industry leaders leverage on-air talent to elevate content, build fan loyalty and enhance audience connections. Speakers include Tracy Perlman, SVP Player Operations at the NFL.\n- Womens Sports Growing Radio and Podcasting: Womens sports were predicted to generate $1.28 billion globally in 2024, according to Deloitte, which is a 300% rise in three years. This panel features industry leaders including Jessie Katz, head of iHeart Womens Sports.\n- My SportsCenter: Powered by Microsoft, this activation will demonstrate how AI can deliver a fully customized sports broadcast tailored to individual viewer preferences.\n- AWS F1 Simulators: Experience interactive activations where fans can feel like theyre in the action.\n- Sports Wagering Pavilion: Discover the latest tools and tech for engagement and how to monetize the fan experience.\nAn Unparalleled Opportunity for Connection and Growth\nNAB Show has led the charge in innovation for media and entertainment, and this year is no exception. Live sports are captivating audiences in unprecedented ways and unlocking fresh revenue opportunities for the media and entertainment industries. The Summit coupled with trailblazing companies on the exhibit floor are reshaping the way that fans are engaging and experiencing sports, said Karen Chupka, executive vice president and managing director, NAB Global Connections and Events.\nKey Exhibitors\nThe show floor will showcase a dynamic lineup of key brands, especially those exhibiting products and solutions for the sports industry including AWS, ARRI, Avid Technology, Blackmagic Design, Canon, Ross Video, Sony and Verizon Business. Attendees can also discover innovations from hundreds of Exhibitors across the show floor including Grass Valley, Insta360, LiveU, Panasonic Connect and Vizrt, alongside cutting-edge solutions from Exhibitors like Zixi and Zero Density.\nThe Ultimate Industry Destination\nNAB Show is where creative storytellers and broadcasting innovators converge to transform media and entertainment. The 2025 event is set to deliver an unparalleled experience for 65,000 attendees from content creation to distribution to monetization for the broadcast, media and entertainment community showcasing 1,300 Exhibitors, eight stages of dynamic education and ten professional conferences.\nRegister for NAB Show today. Covering the event? Register as press and stay updated on the latest show news by adding your name to our media list.\nAbout NAB ShowNAB Show is the preeminent conference and exhibition driving the evolution of broadcast, media and entertainment, held April 5-9, 2025 (Exhibits April 6-9) in Las Vegas. Produced by the National Association of Broadcasters, NAB Show is the ultimate marketplace for next-generation technology inspiring superior audio and video experiences. From creation to consumption, across multiple platforms, NAB Show is where global visionaries convene to bring content to life in new and exciting ways. Learn more at NABShow.com.\nAbout NABThe National Association of Broadcasters is the premier advocacy association for Americas broadcasters. NAB advances radio and television interests in legislative, regulatory and public affairs. Through advocacy, education and innovation, NAB enables broadcasters to best serve their communities, strengthen their businesses and seize new opportunities in the digital age. Learn more at www.nab.org.\n( Press Release Image: https://photos.webwire.com/prmedia/7/332588/332588-1.png )\nWebWireID332588\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 800,
  "scraped_at": "2026-02-14T14:16:25.454113"
}