{
  "article_id": "8c5fcb22aba5",
  "url": "https://metro.co.uk/2026/02/12/ukrainian-winter-olympics-star-disqualified-helmet-memory-war-victims-26849621/",
  "title": "Ukrainian Winter Olympics star disqualified from skeleton over  helmet of memory  for war victims",
  "date": "20260212T100000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ukraine’s Vladyslav Heraskevych has been kicked out of the Winter Olympics for refusing to stop wearing his helmet commemorating his countrymen and women killed in battle with Russia.\nHeraskevych wore the helmet in all of his training runs but less than an hour before the first round of the men’s skeleton competition on Thursday, the International Olympic Committee have confirmed he will no longer be involved.\nThe 27-year-old will not be allowed back into the athlete’s village following the decision.\n‘Having been given one final opportunity, skeleton pilot Vladylsav Heraskevych from Ukraine will not be able to start his race at the Milano Cortina 2026 Olympic Winter Games this morning,’ a statement from the IOC said.\n‘The decision followed his refusal to comply with the IOC’s Guidelines on Athlete Expression.\n‘It was taken by the jury of the International Bobsleigh and Skeleton Federation based on the fact that the helmet he intended to wear was not compliant with the rules.\n‘The IOC has therefore decided with regret to withdraw his accreditation for the Milano Cortina 2026 Games.’\nHeraskevych has confirmed he plans to appeal the decision with the court of arbitration for sport.\nHe told reporters after learning of the decision: ‘It’s hard to say or put into words. It’s emptiness.’\nSpeaking to BBC Sport, he said: ‘Yesterday was amazing training. I could be among the medalists in the event but suddenly because of some interpretation of the rules which I do not agree with, I am not able to compete. Other athletes in a similar situation were able to compete and they didn’t face any sanctions.\n‘I believe they [athletes on his helmet] deserve to be here because of their sacrifice. They deserve to be here today and I want to honour them and their families.’\nMore Trending\nHeraskevych’s helmet shows 24 images of athletes killed since Russia’s invasion of Ukraine in February 2022.\nHe and the Ukrainian delegation have argued the helmet does not violate any laws as as it serves as a tribute.\nMORE: Morrisons launches £15 Valentine’s Day dine‑in deal – and the menu looks incredible\nMORE: Does Keir Starmer ‘agree with Reform’? Readers discuss",
  "word_count": 359,
  "scraped_at": "2026-02-14T13:23:08.081342"
}