{
  "article_id": "8c6174ffc60c",
  "url": "https://www.thelocal.fr/20250321/french-films-with-english-subtitles-to-see-in-april-2025",
  "title": "French films with English subtitles to see in April 2025",
  "date": "20250321T144500Z",
  "domain": "thelocal.fr",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The cinema club Lost in Frenchlation holds regular screenings of French films with English subtitles, with the aim of allowing French language beginners to appreciate the richness and diversity of French cinema.\nThe films are usually a mixture of new releases and classics. Here's what is coming up in April:\nMagma – Friday, April 4th\nWhat? Hollywood released two volcanic disaster movies in 1997 – Dante’s Peak and Volcano. Then, they went dormant on the whole exploding mountain, lava danger thing. Nearly 30 years later, French director Cyprien Vial has reawakened the genre. Marina Foïs and Théo Christine star as a vulcanologist and her protege fighting to save islanders on Guadeloupe as La Soufrière – which last erupted in 1976 – threatens to blow.\nWhen? Arrive for drinks at 7pm – the screening starts at 8pm and is followed by Q&A with director Cyprien Vial.\nWhere? L’Entrepôt, 7 Rue Francis de Pressensé, 75014 Paris.\nTickets? Tickets – costing between €6 and €9.50 – can be bought here.\nLumière – l’Aventure Continue (Lumiere! The Adventure Continues) – Sunday, April 6th\nWhat? Thierry Frémaux, director of the Cannes Film Festival and the Institut Lumière, has selected 114 universally celebrated masterpieces or previously unknown golden discoveries, restored them in 4K and assembled them to celebrate the legacy of film-making pioneers, the Lumière brothers.\nWhen? Lumière Ciné-Balade tour starts at 12 boulevard des capucines at 5pm, drinks at 7pm, screening at 8pm.\nWhere? Luminor, 20 Rue du Temple, 75004 Paris.\nTickets? Tickets – costing between €7.50 and €11.50 – can be bought here. For the two-hour Ciné-Balade walking tour, tickets – at €18 – are here.\nÀ Nos Amours (To Our Lovers) – Tuesday, April 8th\nWhat? Sandrine Bonnaire won the first of her two César awards – in her starring debut – playing a promiscuous teenager unable to feel love in this challenging and uncompromising 1983 coming-of-age drama.\nWhen? Women of Paris Tour at 5pm, drinks at 7pm, screening at 8pm.\nWhere? L’Epée de Bois, 100 Rue Mouffetard, 75006 Paris.\nTickets? Tickets – costing between €5 and €9.90 – can be bought here. For the two-hour Women of Paris walking tour, tickets – at €18 – are here.\nOn Ira – Sunday, April 13th\nWhat? Enya Baroux’s gentle, thought-provoking and touchingly humorous examination of end-of-life care and the right to die follows an 80-year-old woman battling terminal cancer who fools her dysfunctional family and her kindly caregiver into taking her to Switzerland so that she can end her life on her own terms.\nWhen? Drinks at 7pm, screening at 8pm.\nWhere? Luminor, 20 Rue du Temple, 75004 Paris.\nTickets? Tickets – costing between €7.50 and €11.50 – can be bought here.\nRiverboom – Wednesday, April 16th\nWhat? Afghanistan, 2002. Three young reporters embark on a journey that will change their lives forever in this found-footage road movie documentary. Introducing Serge, a moralist journalist and workaholic; Paolo, a photographer as jovial as he is oblivious; and Claude, a Swiss typographer with a wimpy attitude who’s trying his hand at filmmaking.\nWhen? Drinks at 7pm, screening at 8.15pm.\nWhere? Jeu de Paume, 1 Place de la Concorde, 75008 Paris.\nTickets? Tickets – costing between €7.50 and €11.50 – can be bought here.\nMa Mère, Dieu et Sylvie Vartan (Once Upon My Mother) – Friday, April 18th\nWhat? Leila Bekhti stars in Ken Scott’s 60s-set comedy drama based on a true story as a mother of six who refuses to accept doctors’ diagnosis that her son will never walk – instead defying apparently insurmountable odds to guide him to a life she thinks he deserves.\nWhen? Drinks at 7pm, mini concert of Sylvie Vartan songs at 8pm, followed by the screening of the film.\nWhere? Cinema Balzac, 1 Rue Balzac, 75008 Paris.\nTickets? Tickets – costing between €5.50 and €11.50 – can be bought here.\nMercato – Thursday, April 24th\nWhat? Noted football fan Jamel Debbouze stars as a down on his luck football agent who has seven days to save his skin before the transfer window closes in this tense thriller that takes Jerry Maguire as a very basic starting point and adds a razor’s edge.\nWhen? Drinks at 7pm, screening at 8pm followed by a Q&A with director Tristan Séguéla.\nWhere? L’Arlequin, 76 Rue de Rennes, 75006 Paris.\nTickets? Tickets – costing between €9.50 and €12.20 – can be bought here.",
  "word_count": 727,
  "scraped_at": "2026-02-14T13:18:37.010649"
}