{
  "article_id": "8c672eaa963d",
  "url": "https://vnews.com/2025/12/19/big-green-try-to-make-winning-routine/",
  "title": "Big Green try to make winning routine",
  "date": "20251220T020000Z",
  "domain": "vnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "If there wasn’t a template for coaching success at Dartmouth College in the modern era of college athletics, Taylor Schram has certainly created one.\nWhen Schram took the helm of the women’s soccer program in December 2022, she was the first coaching hire for new athletic director Mike Harrity, who had started himself just that summer. Schram, who was a standout player at Penn State a decade ago, had never been a head coach at any level.\nPrior to her arrival, the program was moribund, notching only three wins in Ivy League play in the two seasons since play resumed following the disruption of COVID.\nAnd in Schram’s first two seasons at the helm, results were not much better. The team won a combined total of three Ivy League games.\nBut this season, the Big Green broke through. The team defeated league powers Harvard on the road for the first time in 20 years and Columbia for the first time in 11 years. Dartmouth finished in second place in the Ivy League, its best result in more than a decade.\n“Since I’ve arrived, Mike and I have had just a really strong partnership in committing to this vision that we had for Dartmouth women’s soccer, and it started obviously with investing in developing the culture — elevating the culture around competitiveness in our program,” Schram said.\nDartmouth went on to win the Ivy League postseason tournament championship, which included its first win over Princeton since 2013. The triumph meant that for the first time in 20 years, the team qualified for the 64-team NCAA championship tournament.\nSchram said this season’s success was a culmination of multiple factors.\n“It takes time to see all of those different variables come together, and I think this season, you really started to see the shift happen, culturally, talent-wise,” she said.\nSo it made sense that Harrity would try to ensure Schram would stay in Hanover for the long-term.\nThis week, Dartmouth announced that Schram, whose official title is the Stacy Branca Family Head Coach of Women’s Soccer, had signed a multi-year contract extension. (The college did not provide financial details about Schram’s contract. According to a Department of Education database on equity in athletics, the average full-time head coach of a women’s team at Dartmouth made nearly $125,000 in the 2023-24 school year.)\n“From her first day, Taylor has demonstrated a deep commitment to developing our student-athletes both on and off the field, and a relentless drive for excellence,” Harrity said in a statement announcing the extension. “Her vision for Dartmouth Women’s Soccer and her passion for developing talent and character align perfectly with Dartmouth’s values.”\nThere are some other green shoots for the Big Green athletic department, including the men’s hockey team, which has made the conference semifinals the past two seasons and is off to an 11-1 start this season.\nBut women’s soccer and men’s hockey are just two of dozens of athletic teams that Dartmouth fields. And many of them remain at the bottom of the Ivy League in terms of results.\nFor Harrity, creating more turnaround stories like women’s soccer starts with the proper mindset: “This unwavering, deeply held belief that we’re going to do it here — why not Dartmouth — we absolutely can be champions.”\nA resurgence in athletics at Dartmouth could be in progress — even if there have been fits and starts.\n“Look, we have a lot of work to do, absolutely,” Harrity said. “But I believe that everybody recognizes that it is a new day.”\nLosses on and off the field\nThe years surrounding the COVID-19 pandemic were challenging for all collegiate athletic programs, but it proved to be a particularly trying time for the Big Green, and not just because of canceled seasons.\nIn the summer of 2020, during the peak of the COVID shutdown, Dartmouth announced that, effective immediately, it was eliminating five athletic programs: men’s and women’s swimming and diving, men’s and women’s golf, and men’s lightweight rowing.\n“I can assure you that these decisions were made with great care and with the long-term interests of the learning experience provided by Dartmouth Athletics front and center,” President Phil Hanlon said in an email at the time to the Dartmouth community.\nHowever carefully considered those decisions may have been, that attempt to eliminate the programs ultimately ended in a successful Title IX complaint against the college.\nThe college was forced to backtrack, and the sports were reinstated in January 2021. Harry Sheehy, who had been the college’s athletic director, retired soon after.\nThe Big Green returned to play in fall 2021 under interim athletic director Pete Roby, who remained in the job until the following summer, when Harrity took over.\nIn many ways, the 2022-23 academic year was a nadir for the Dartmouth Athletic Department from a competitive standpoint.\nThe football team, which had been a lone bright spot for much of the past decade, had its worst year in recent memory, going 3-7 in 2022. The men’s hockey team managed just five wins for the season, and the baseball team won just three in spring 2023. The women’s basketball team went 2-26 overall and 0-14 in the Ivy League. The lone bright spot was volleyball, which in 2022 had its best record in the past 10 seasons.\nOf course, the biggest loss came in March 2023 when longtime football coach Buddy Teevens was gravely injured when he was struck by a pickup truck while riding a bicycle near the family’s home in Florida. He died from his injuries that fall, casting a pall across campus.\nTurning the corner?\nIn addition to hiring Schram, one of Harrity’s earliest personnel decisions was what to do about Reid Cashman. After the 2020-21 season was lost to COVID, the men’s hockey program, long a point of pride for the college, had managed just 12 wins across two seasons with Cashman behind the bench. There was plenty of speculation that Cashman, who had been hired by Sheehy, would not be long for the job.\nInstead, Harrity rewarded Cashman in 2023 with a contract extension.\nIn the two seasons since, the team has advanced both times to the ECAC semifinals. Last season, the Big Green had the best record of any Ivy League hockey team for the first time since the 1979-1980 season, and the coaches were named Ivy League staff of the year.\nThis season, Dartmouth has its best start since the 1940s and is currently 11-1.\nCashman attributed part of his squad’s recent success to what he described as a transformation at the college, with the introduction of personnel such as Harrity, Senior Deputy Athletics Director and Chief Operating Officer Kristine Fowler, and others.\n“There’s been a shift of mindsets and maybe expectation, but also support and supporting athletics to have success,” he said.\nFor coaches, that support can be felt through investments in facilities such as Thompson Arena, which is undergoing renovations, and through paying to fill staff positions, among other things.\nFootball head coach Sammy McCorkle has been part of one of the college’s few consistently strong programs the past decade, including five Ivy League titles since 2015.\nMcCorkle, who has been around the college since 2005, said he also has seen a shift toward better support for athletics in recent years.\n“There’s no doubt, of course, recently, with Mike and with (President Sian Beilock), it’s definitely been an emphasis on making sure they provide us with the resources and the things that programs need to be successful,” McCorkle said.\n“It goes all the way up to relationships developing with the admissions, financial aid, and the resources and the money that is put into athletic programs to help them succeed,” he added.\nOther programs have shown signs of life.\nMen’s basketball finished .500 last year and, like women’s soccer this season, qualified for the four-team Ivy League championship tournament for the first time.\nLast spring, men’s lacrosse had its most wins since 2006; women’s rowing made the NCAA championship for the first time since 2011; and this winter, women’s basketball has an 8-2 record so far, the program’s best start since the 1989-90 season.\nOver the past three seasons, coaches or coaching staffs have been awarded 15 coach or staff of the year accolades.\nStill, college athletics are about more than winning, especially at an institution such as Dartmouth, where sports are supposed to be an extension of the student experience.\nFor Harrity, that has meant expanding the program known as Dartmouth Peak Performance. DP2 is “a comprehensive program designed to position student-athletes to achieve the highest levels of physical, intellectual, and personal growth during their careers at Dartmouth,” per the college’s website.\nIts creation predates Harrity, but he was keen to enhance it.\n“It’s an infinite game, it’s not like we’re ever going to wake up one day… and say OK, this is done, we’ve done all we can to maximize our students’ potential,” Harrity said. “It’s human development — that’s the fun of it.”\nOver his tenure, the athletics department has added more than 11 full-time positions for DP2, spanning strength and conditioning, athletic training, nutrition, mental health, career development, and more.\nStill, some programs remain in flux.\nFor all the excitement about the women’s team, men’s soccer finished 3-8-3 this fall, and head coach Bo Oshoniyi, who amassed a record of 34-55-20 since he started in 2018, will not return. The college has not named his replacement.\nAnd the baseball team, which has scuffled the past three seasons, will have a new manager for the first time in 36 years after Bob Whalen announced his retirement in July.\nBlake McFadden, who has been with the team since 2018 as a pitching coach, has been given the job on an interim basis, but it is unclear if he is Harrity’s choice for the long term.\nWomen’s hockey, which has a storied tradition at Dartmouth, hasn’t recorded double-digit wins since 2014-15.\nAnd field hockey only has two Ivy League wins in the past five seasons, both of which came in 2023.\nHarrity acknowledged that every program is different, but when one is struggling, he and his staff try to get to the root of the issue.\nOne way all programs can try to improve is by seeking answers from within.\n“We have spent a lot of time trying to create opportunities for our coaches to share ideas with each other, to sharpen each other’s approaches,” Harrity said\nThese opportunities occur in organized ways, such as recruiting seminars and regular meetings among head coaches, or in more informal ways, such as coach-to-coach interactions.\n“There’s always a common ground, and I think it’s always fascinating to hear what other people are doing and what might be working for them,” said Women’s hockey Head Coach Maura Crowell.\nSchram shared that notion on collaboration: “I think that is one of the key ingredients to the secret sauce here at Dartmouth.”\nUltimately, when it comes to athletic success at Dartmouth, Harrity recounted a story that Teevens had told him:\nOther schools that recruited against Dartmouth would ask players why they would want to come to Dartmouth, because it’s out in the woods.\n“He said, ‘You know what, we’re going to embrace that we’re in the woods and we’re going to talk about that and let me tell you about what in the woods means,’ ” Harrity said.\n“He just flipped it on its head, and I loved that…and those are the coaches who are successful.”",
  "word_count": 1917,
  "scraped_at": "2026-02-14T12:20:39.097806"
}