{
  "article_id": "8c681b23b472",
  "url": "https://www.wcvb.com/article/judge-denies-white-stadium-lawsuit-franklin-park-march-22/60283245",
  "title": "Judge denies nonprofit lawsuit to stop Mass . stadium renovation project",
  "date": "20240323T023000Z",
  "domain": "wcvb.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Judge denies nonprofit lawsuit, allows White Stadium renovation project to proceed\nA Boston judge denied a private nonprofit stewardship organization's bid to prevent Boston's incoming National Women's Soccer League franchise from making Franklin Park's White Stadium from becoming the team's new home.\nThe Emerald Necklace Conservatory and twenty individuals filed a lawsuit last month against the city of Boston, Boston Mayor Michelle Wu, Boston Unity Soccer Partners LLC and others to stop what they called the proposed privatization of White Stadium and 1.5 acres of surrounding public parkland in Franklin Park.\nWhen it was announced an NWSL expansion team was coming to Boston in September 2023, Boston Unity Soccer Partners and Wu said the franchise will share White Stadium with Boston Public Schools athletic teams.\nIn December 2023, Boston Unity Soccer Partners sent a project notification form to the Boston Planning & Development Agency that outlines the group's plans to redevelop White Stadium.\nThe renovations proposed by Boston Unity Soccer Partners include a weather canopy with a leaf motif, curving staircases and balconies, a restaurant and a beer garden. There is also the potential for a geothermal well system to be built under the field.\n\"Renovating a 75-year-old, 10,000 seat, outdoor stadium with necessary structural and system upgrades to bring it into compliance with building and safety codes is expensive,\" the ruling from Superior Court Judge Sarah Ellis said. \"BUSP was the only entity that responded to the city's (request for proposals.)\"\n\"The proposed project would upgrade White Stadium significantly from its current, dilapidated condition,\" the ruling said. \"The proposal does not alter White Stadium's identity as a (Boston Public Schools) athletic stadium, expand the footprint of White Stadium, nor develop areas of Franklin Park outside the stadium property.\"\nThe judge said the Emerald Necklace Conservatory and plaintiffs failed to show how a renovated White Stadium would cause them irreparable harm.\n\"Any delay could result in rising costs associated with the proposed project, reducing the buying power of the $50 million the city has been allocated to the renovation,\" the decision said. \"The city may suffer irreparable harm should a preliminary injunction enter halting the progress on the proposed project.\"\nThe venue currently has stadium seating for approximately 10,000 spectators. Boston Unity Soccer Partners plans to expand the capacity to approximately 11,000 spectators.\nThe Emerald Neck Conservancy claimed the city agreed to the deal without enough public input, and it also questions whether the city has the authority to enter White Stadium into a long-term lease.\nEllis said there are valid concerns about how using the renovated stadium as a professional sports venue could impact traffic around the park and neighborhood, but suggested those issues should be addressed as part of community meetings in the future.\n\"The concerns expressed about game day impacts are valid, but it is legally premature to address these concerns by way of a preliminary injunction now, two years before defendants anticipate the stadium will host a BUSP game,\" the decision said.\nWu said in a written statement that she was \"thrilled\" to see the court's ruling against what she called a \"frivolous lawsuit\" that would have blocked \"ongoing community engagement to deliver a generational investment in White Stadium and Franklin Park.\"\n\"For the first time since the stadium’s opening, the city has a committed partnership to invest in and sustain the improvements that our students, park lovers, and neighbors deserve — while dramatically expanding the hours of usage for BPS sports and community events,\" the mayor's written statement said.\nBoston Unity Soccer Partners said it was \"grateful\" that Friday's court ruling understood \"that the communities around Franklin Park and White Stadium should not have to wait any longer for the decades of neglect and underuse to be addressed.\"\n\"Residents of the neighborhoods around Franklin Park have significant concerns about the plan to turn control of White Stadium over to a professional sports team rather than renovating it as a public stadium for the sole benefit of BPS students and the local community,\" Melissa Hamel, a plaintiff and resident of Jamaica Plain, said in a written statement reacting to the judge's decision.\n\"People have concerns, absolutely. And we as a coalition have concerns about the plan,\" Sandy Bailey, the board vice president of the Franklin Park Coalition, said.\nBailey said the coalition wants to see some of those traffic issues and continued public access to the stadium and the areas of the park around it addressed. \"Those are very important concerns and we look forward to being able to advocate for those as the city proposal goes forward now.\"\nWhite Stadium, formally known as George Robert White Schoolboy Stadium, was erected in 1945 and cost $2 million to build, according to the Franklin Park Coalition.\nThe new NWSL team is expected to begin playing in Boston in the spring of 2026. The team's name and team crest are expected to be revealed in 2024.",
  "word_count": 818,
  "scraped_at": "2026-02-14T12:17:14.106159"
}