{
  "article_id": "8c86003505b3",
  "url": "https://hyperallergic.com/974112/top-50-exhibitions-around-the-world-2024/",
  "title": "Top 50 Exhibitions Around the World in 2024",
  "date": "20241221T044500Z",
  "domain": "hyperallergic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Top 50 Exhibitions Around the World in 2024\nFrom lesser-known artists to big names, our staff and contributors compiled our favorite shows around the globe in a year of exceptional art.\nArt can thrive in the most unfathomable times; 2024 was a year filled with global conflict but it was also a year of exceptional exhibitions. From Botticelli’s rarely seen drawings to sculptural revivals of archaic myths, contemporary takes on traditional crafts, and a world of plastic put to good use; from the story of a disability arts movement to artists’ interventions in institutional collections, to a much-needed mash-up of art and sports; and of course, from past artists with a vision to present-day artists with a loud and clear voice, Hyperallergic’s staff and contributors gathered together a list of our favorites from around the globe. Also, make sure you check out our list of the best New York shows of the year. —Natalie Haddad, Reviews Editor\nBotticelli Drawings\nLegion of Honor, San Francisco, November 19, 2023–February 11, 2024\nCurated by Furio Rinaldi\nA year later, I can’t stop thinking about last winter’s Botticelli Drawings, a show about an Italian Early Renaissance artist that feels a little too timely. While advertising and fashion have long embraced Botticelli’s sweetness — pretty swaying ladies in diaphanous clothes, flowers, and shells — the Legion show offered a poignant reminder of the darker path of his life’s journey (to sort of quote Dante, whose Divine Comedy Botticelli famously illustrated) under the sway of the dangerous and charismatic zealot Girolamo Savonarola. The drawings bring us tantalizingly close to the artist himself, a man as clouded by intimations of darkness, and seeking some salve of beauty, as we are today. —Bridget Quinn\nDaido Moriyama\nThe Photographers Gallery, London, October 6, 2023–February 11, 2024\nCurated by Thyago Nogueira\nThis exhibition, brilliantly curated by Thyago Nogueira, head of contemporary photography at São Paulo’s Instituto Moreira Salles, where it originated in 2022, traveled to C/O Berlin in 2023. The London iteration was smaller than the previous surveys. And yet, perhaps thanks to its intimacy and the use of wallpaper surrounding visitors with a plethora of images, it felt even more pointed, underscoring Moriyama’s edgy, brooding aesthetics and prodigious output. As Nogueira stressed throughout this traveling show, Moriyama, who first emerged in 1960s Tokyo, bristled at the naïve humanism commonly evidenced in photojournalism, in which the image was to confirm a single coherent truth. From his dark, granular, Xerox-like pictures of car crashes and notorious celebrities to his late, intensely personal road diaries, the artist has favored subjectivity, fragmentation, and mystery. —Ela Bittencourt\nCelia Álvarez Muñoz: Breaking the Binding\nNew Mexico State University Art Museum, Las Cruces, New Mexico, October 20, 2023–March 2, 2024\nCurated by Kate Green and Isabel Casso\nCelia Álvarez Muñoz can turn just about any material, or any turn of phrase, into an artwork. But the power of her conceptual artwork lies in what she chooses to include and how she uses it. This 40-year career retrospective, which originated at the Museum of Contemporary Art San Diego and made its final stop at the Philbrook, included a riveting selection of the artist’s multimedia translations of her memories and experiences living on the US/Mexico border, with an emphasis on her installations. A gallery-sized unfurling of several of her books and a video installation that broke free of the binding to present “pages” as images on the walls were showstoppers. —Nancy Zastudil\nCoexisting with Darkness\nMystetskyi Arsenal, Kyiv, Ukraine, November 9, 2023–March 31, 2024\nCurated by Anton Usanov and Natasha Chychasova\nFrom the fall of 2023 to spring 2024, the Mystetskyi Arsenal in Old Kyiv hosted Coexisting with Darkness, an exhibition that reflected on Russia’s destruction of the power grid. Even as bombs and missiles rained on the capital of Ukraine, it attracted 5,000 visitors in the two months following its opening — yet another demonstration that in wartime art becomes a vital necessity, as we have known ever since the Golden Age of Athens in the 5th century BC, following the Persian Wars. Coexisting with Darkness offered a diversity of sensorial experiences that transcended the visual plane, including humming generators and the smell of gas that evoked the Ukrainian cities targeted by the Russians, but anybody from Gaza, Lebanon, Syria, or any number of other conflict-ridden parts of the world could at once recognize the cues and relate to it. The war also reoriented the flagship cultural institution's interest toward in contemporary Ukrainian art as part of a broader decolonization project. —Avedis Hadjian\nShe Laughs Back: Feminist Wit in 1970s Bay Area Art\nUniversity Library Gallery, Sacramento State University, Sacramento, February 6–April 13, 2024\nCurated by Elaine O'Brien\nOne of the dumber longstanding accusations against feminism is that it’s humorless. She Laughs Back was a reminder of how effectively feminist art wields humor as a weapon. Comprising nearly 100 artworks by 19 artists, it also situated Northern California as central to the development of feminist art, with work such as one of Dori Atlantis’s iconic photographs of the “C.U.N.T. Cheerleaders” (1971), done when she and Nancy Youdelman worked alongside Judy Chicago in the Feminist Art Program at California State University, Fresno (the first feminist art program anywhere). Special standouts included feminist comics from Trina Robbins — who died just before the show closed — and Joan Moment’s fabulous “Condom Relief Series No. 1, 1971” (refabricated in 1993), 96 translucent condoms laid out on gauze. The piece riffs on the formalist obsession with the grid with earthy humor and maybe a little shot (pun intended) at the masculine pretensions of much Minimalist art and art criticism. —BQ\nEntangled Pasts, 1768–now: Art, Colonialism and Change\nRoyal Academy of Arts, London, February 3–April 28, 2024\nCurated by Dorothy Price with Sarah Lea, Esther Chadwick, Cora Gilroy-Ware, Rose Thompson and Alayo Akinkugbe\nWith many UK institutions commissioning investigations into their own colonial pasts, the Royal Academy’s Entangled Pasts: 1768–now: Art, Colonialism and Change not only highlighted its academicians who benefited from the slave trade and colonialism, but sought out the lives and stories of Black persons overlooked by history, and paired these findings with emotive and moving responses from contemporary artists. Arranged non-chronologically, the show explored themes including appropriation and displacement, in which archival items from the RA’s story, such as cash books detailing work by sitters for life drawings, were paired with pieces from its collection. This new context invited us to consider the changing perceptions and roles of displaced people over time and, crucially, how we should go forward collectively as a society. —Olivia McEwan\nFukuda Heihachiro: A Retrospective\nNakanoshima Museum of Art, Osaka, Japan, March 9–May 6, 2024\nOrganized by the museum\nNature is a constant in Fukuda Heihachiro’s subtly stunning work. Born in 1892 in Oita, Japan, the artist was a tireless observer and interpreter of the quiet worlds around him. This expansive exhibition traced Fukuda’s full trajectory, from his earliest Taishō era screens and paintings to his increasingly bold and colorful mature works, where a lively sense of poetry and decoration merge. Crucially, the retrospective (and its excellent catalog) included many of the artist’s sketchbooks, where Fukuda’s graceful studies of plants, birds, children’s drawings, food, and especially water — the artist was an avid fisherman — reveal an ever-curious, ever-evolving master. —Lauren Moya Ford\nThe Time Is Always Now: Artists Reframe the Black Figure\nNational Portrait Gallery, London, February 22–May 19, 2024\nCurated by Ekow Eshun\nWith The Time is Always Now: Artists Reframe the Black Figure the National Portrait Gallery was determined to address the historical dominance of White male society figures in its collection, while thrusting itself into the main stage of contemporary art-making, presenting portraits from 22 African diasporic artists working today. Curator Ekow Eshun’s intention was to enable White visitors to “[see] from the viewpoint of Black artists and the figures they depict.” Showcasing these voices emphasizes the importance of Black experience and identity in a predominantly White society as an ongoing and urgent issue. —OM\nFirelei Báez\nLouisiana Museum, Humlebæk, Denmark, October 5, 2023–May 20, 2024\nCurated by Mathias Ussing Seeberg and Assistant Curator Amalie Laustsen\nThe ciguapa, a folkloric creature from Dominican culture, appears enigmatically in Firelei Báez’s work. It traverses the world with its feet turned backward, making it hard to locate, thus serving as a symbol of survival. Báez brings to life defiance through the sheer variety of color in her work, often in stark contrast to the staid world maps of colonial planners. In “Encyclopedia of gestures (Jeu du monde),” the painting features a bright, plumed figure crouching over the 17th-century board game Le Jeu du Monde (Game of the World). The purpose of the game was to travel from the outer regions of the world to its center, which in this case was France, then on its way to usurping the Dutch as the world’s superpower. The show’s title evoked the possibility of memory as a form of resistance to written history, which is so often told through the lens of power, and Báez beautifully presented how vibrant cultural resistance can be. Like the ciguapa, she proved in this show that the tools of liberation can be found in coloring outside the lines. —AX Mina\nExteriors: Annie Ernaux and Photography\nMEP – Maison Europeene de la Photographie, Paris, February 28–May 26, 2024\nCurated by Lou Stoppard\nFrench writer Annie Ernaux, who won the 2022 Nobel Prize for Literature, is known for her acute depictions of fleeting, mundane life, which writer Lou Stoppard took as an inspiration for the immensely gratifying Exteriors. From the edgy instantaneity of Daido Moriyama and Henry Wessel, whose offhand portraits of strangers nevertheless hint at deep distress and physical trauma, to the melancholy of Hiro’s “Shinjuku Station” (1962), depicting dejected riders on a crowded train, and Dolorés Marat’s “Woman with Gloves” (1987), capturing a lone woman’s descent down the metro, Exteriors is an homage to close observation. Accompanied by excerpts from Ernaux’s writings, the exhibition underscored the tension between anonymity and encounters experienced in large cities. —EB\nUnravel: The Power and Politics of Textiles in Art\nBarbican Centre, London, February 13–May 26, 2024\nCo-organized by the Barbican, London, and the Stedelijk Museum, Amsterdam\nAn eclectic global showcase of artwork made from fabric and fibers, Unravel: The Power and Politics of Textiles in Art features 50 artists from about 30 countries. Exploring a massive web of interconnected human experiences — including political violence, loss and grief, identity and community, ancestry and survival, love and hope — the exhibition casts light on the terrible and beautiful alike. Wending through these works, which are, by turns, wrenching, tender, and galvanizing, textile techniques serve as both medium and metaphor. The show underscores the vast range of what textiles and fiber art can be and reveals powerful possibilities for protest and resistance. —Julie Schneider\nFrans Hals\nRijksmuseum, Amsterdam, February 16–June 9, 2024\nCurated by Friso Lammertse and Tamar van Riessen\nAmid the stoicism and seriousness emerging from the patronal studios of the 17th century Low countries, the Dutch Golden Age titan (and foil to Rembrandt) Frans Hals stood out by delighting in the absurdity of the human condition, and having no qualms about showing it. Between his paintings \"The Regents\" and \"Malle Babbe,\" what this exhibition, in fact, revealed was that Hals's bold brushstrokes actually were upending social mores. Hals unabashedly equated the upper class and (so-called) social outcasts by portraying them all in similar states of debauchery and duress — in the end suggesting that everyone, regardless of status, is deserving of memorialization and respect. A pretty revolutionary, and lasting, gesture, particularly for the time. —Julie Baumgardner\nRosana Paulino: Amefricana\nFundación Malba, Buenos Aires, March 22–June 10, 2024\nCurated by Andrea Giunta and Igor Simões\nRosana Paulino’s 80-work survey at MALBA was a formidable reckoning of slavery’s legacy and enduring violence in Brazil. Leading visitors from Paulino’s sown fabric collages to monumental installations like “Parede da memória” (1994–2015), the exhibition centered her strategy of stitching, or suturing, diverse fragments of history. Images from her own family albums and centuries-old photographic records are printed onto various textiles and brought into dialogue with embroidery, botanical drawings, and myriad other vestiges of a fraught past that, Paulino suggests, has been inadequately considered. Though primarily concerned with the experience of Afro-Brazilian individuals — and Black and mixed-race women in the country in particular — the show has an urgent resonance in Argentina, whose acknowledgment of racism has arguably barely scratched the surface. Tellingly, Amefricana was the first solo exhibition of a Black artist at the Buenos Aires institution. —Valentina Di Liscia\nPaul Pfeiffer: Prologue to the Story of the Birth of Freedom\nMuseum of Contemporary Art Los Angeles, November 12, 2023–June 16, 2024\nCurated by Clara Kim and Paula Kroll\nCritics rightly read this show as a critique of sports, spectacle, and entertainment, but it also transformed the museum into a cathedral. The room-sized diorama of a vertigo-inducing, one-million-seat stadium, “Vitruvian Figure” (2008), was the altar. Photos of athletes defying gravity, stripped of logos and branding, were the tapestries. Disembodied cheers in “The Saints” (2007) were the voices of angels. I saw the people Pfeiffer brought into his projects to reenact sporting milestones as the congregation. Instead of obscuring the volunteers, the artist credits every participant in his didactics. Their names sprawl across the walls like donor plaques in a brand new church. —Renée Reizman\nRick Dillingham: To Make, Unmake, and Make Again\nNew Mexico Museum of Art, Santa Fe, October 6, 2023–June 16, 2024\nCurated by Katie Doyle\nRick Dillingham was a ceramic artist whose name I had never heard and whose work I had never seen until this exhibition. His artistic activities ran the gamut — the museum describes him as a scholar, author, collector, curator, and art dealer. He died from AIDS complications in 1994. He broke the pot down, both literally and figuratively, shattering and reassembling his reductive clay sculptures, then applying pigments; the exhibition showcases a creative approach that some people may see as appropriation, alongside a selection of works that influenced him, such as clay pots from the Indigenous communities and makers he knew. I sincerely wish I would’ve spent more time with this sleeper show because certainly there’s more to uncover. Luckily, the museum holds Dillingham’s archives, including his letters, glaze recipes, photos, and slides, in addition to numerous artworks, for future explorations. —NZ\nClaudia Joskowicz: Every Building on Avenida Alfonso Ugarte—After Ruscha\nHerbert F. Johnson Museum of Art, Ithaca, New York, January 27–June 23, 2024\nCurated by Kate Addleman-Frankel\nInspired by Ed Ruscha’s Every Building on the Sunset Strip (1966), a now-iconic book project that featured a photograph of every building on, you guessed it, the Sunset Strip in Los Angeles, Joskowicz turns that same framework into a two-channel video installation recording a major avenue in the Indigenous-majority city of El Alto, Bolivia. The museum’s immersive display was effective and the artist even managed to capture moments, like soldiers in riot gear in one instance, demonstrating how life has an odd way of creeping into art. A really beautiful project. —Hrag Vartanian\nI'll Be Your Mirror: Reflections of the Contemporary Queer\nVarious venues, Detroit, Michigan, May 31–June 30, 2024\nCurated by Patrick Burton\nWhen I’ll Be Your Mirror, the second edition of the Mighty Real/Queer Detroit biennial, opened this past summer, the fact that it existed was cause to celebrate. When I was going to college in Detroit, many years ago, it was a different, dangerous environment. As it turned out, the biennial was filled with impressive works by local and national artists. In particular, Wayne State University’s Elaine L. Jacob Gallery presented a deftly curated selection in a range of media. Probably one of the country’s more under-sung university galleries, it’s played host to several shows over the years that would have garnered more attention in a higher-profile city. This was one such show. Among a number of standout works, a small, understated painting by Hugh Steers still lingers in my mind. —NH\nJonathan Baldock: Touch Wood\nYorkshire Sculpture Park, West Bretton, England, September 23, 2023–June 30, 2024\nOrganized by the institution\n“Touch grass” has become part of the internet’s lingo du jour, a reminder to get out and experience nature. Baldock’s Touch Wood brought to life some of the ways of nature that many modern societies have lost touch with, reviving myths like the Green Man, a symbol of birth and resurrection, here infused with contemporary queerness. In “They tried to bury me, They didn’t realise I was a seed,” Baldock sculpted a vase with the Green Man’s face, his tongue sticking out as a ceramic flower emerges into the sunlight. Four textiles placed in the center of the gallery represented the four seasons but also, importantly, symbols that were found scratched in church surfaces around the UK. It’s touching (wood) to look back on these textiles in particular, because they contain the phrase “You Enrich This World,” referencing a line from Shon Faye’s book The Transgender Issue: Trans Justice Is Justice for All (2022): “your existence enriches this world.” —AXM\nImagined Fronts: The Great War and Global Media\nLos Angeles County Museum of Art, December 3, 2023–July 7, 2024\nCurated by Timothy O. Benson, curator, Robert Gore Rifkind Center for German Expressionist Studies\nA single exhibition can never capture the whole visual history of World War I, but Imagined Fronts offered a broad overview of various national and cultural perspectives without neglecting the visual dynamism of the era’s art (thanks, in large part, to the holdings of LACMA’s Rifkind Center for German Expressionist Studies). Bringing archival materials together with artworks in multiple media — painting, drawing, documentary photography, propaganda posters, film, theater design, and more — LACMA had the means to go in depth, and did in a big enough way that some college-age gallery attendants seemed to be taking their first interest in the war that ushered the world into modernity. Although the usual artists and objects, like the Berlin Dadaists, German Expressionist filmmakers, and oft-seen posters, were on view (fair enough, for relevance), attention to the contributions of Indigenous, Arab, and other under-recognized combatants was refreshing. And, as I wrote in my review in July, it was a rare chance to see a haunting Otto Dix drawing in LACMA’s collection that speaks to nothing if not the trauma of war. —NH\nParis 1874: Inventing Impressionism\nMusée d'Orsay, Paris, March 26 – July 14, 2024\nCurated by Sylvie Patry and Anne Robbins\nMusée d'Orsay’s robust exhibition, organized on the 150th anniversary of the birth of Impressionism, conveyed the movement’s contentious spirit and diverse aims by zeroing in on its early days, when artists such as Édouard Manet and Auguste Renoir were still as likely to vie for a spot in the official Salon as to rebel against it. From taboo subjects, such as prostitution, to voyeurism and spectacle, the Impressionists in the d’Orsay show, including Renoir, Degas, and Monet, and non-Impressionist artists exhibiting alongside them, such as Cezanne, scandalized the public with their first independent show (a commercial flop) in April 1874. The critics rejected even the more understated portraits, for instance, Renoir’s “La Parisienne” (1874) and Berthe Morisot’s “The Cradle” (1872), also in this exhibition. Paris 1874 traced the varying fortunes of subsequent Impressionist salons and its artists, while bearing out the newcomers’ boldness, by contrasting them with a number of official Salon paintings, which hewed to stricter naturalism and to mythical, pastoral themes. —EB\nWoven Histories: Textiles and Modern Abstraction\nNational Gallery of Art, Washington, DC, March 17–July 28, 2024\nOrganized by the National Gallery of Art, Washington, DC; the Los Angeles County Museum of Art; and the National Gallery of Canada, Ottawa. This iteration of the exhibition was curated by Lynne Cooke.\nThis touring exhibition is sure to become one that scholars, artists, activists, and art lovers return to over and over, not only for its exploration of “the centrality of cloth and fiber in the history of modern art” but for its deep dive into abstraction’s powerful presence across cultures in an increasingly globalized, technology-obsessed world. Whether I was looking at pieces by Ruth Asawa, Shan Goshorn, Harmony Hammond, Ellen Lesperance, Neri Oxman/The Mediated Matter Group, Lyubov Popova, or any others of the nearly 160 works on view, I was filled with an overwhelming sense of awe at how artists have embraced textiles as tools for social and cultural expression and resistance. The show is currently on view at the National Gallery of Canada in Ottawa and then travels to MoMA. —NZ\nSelva Aparicio: In Memory Of\nDePaul Art Museum, Chicago, March 14–August 4, 2024\nOrganized by DePaul Art Museum, curated by Ionit Behar\nSelva Aparicio’s first museum solo exhibition confirmed the Barcelona native, now Chicago resident, as an emerging master of the memorial, on par with Doris Salcedo and Maya Lin. Her sculptures, graceful elevations of discarded and collected materials, often arduously worked, can be transcendently beautiful, as in a faithful reproduction of Catalonia’s largest rose window, with old lettuce leaves in place of stained glass. An upright piano filled with dozens of wasp nests combined the homey and the hellish, as did a white crochet blanket woven with hundreds of honey locust thorns. The therapeutic potential of great labor infused a mourning veil fashioned from 1,365 magicicada wings stitched together with hair, likewise the area rug from her childhood home, chiseled directly into the gallery floorboards throughout the duration of the show. Aparicio, coming by her commitment to death and trauma with unfortunate personal honesty, provided a merciful focal point for the grief of all. —Lori Waxman\nChristina Ramberg: A Retrospective\nArt Institute of Chicago, April 20–August 11, 2024\nCurated by Thea Liberty Nichols and Mark Pascale\nThe first comprehensive survey in nearly three decades of Christina Ramberg’s fetishistically fantastic paintings should clarify that one of the lesser-known Chicago Imagists has always been the most exciting. First she pictured women squeezed into the lacy undergarments of yesteryear, every sheen and thread individually rendered, every bulge of flesh impossibly smoothed, every torso contorted to fit the frame. Next, she turned gleaming brown hair into bonbons, urns, carved chairbacks, and bondage wraps for headless torsos. On to clothing, which she made of flesh, and flesh, of clothing. Echoes of S&M, comics, medical illustrations, decorative patterns, and mannequins reverberate in her personal archive of thrift-store dolls, scrapbooks, and diaries, generously revealed in an exhibition and catalog spanning her art student days in the 1960s through her too-early end, in 1995, from a neurodegenerative disease. —LW\nLoie Hollowell: Space Between, A Survey of Ten Years\nThe Aldrich Contemporary Art Museum, Ridgefield, Connecticut, January 21–August 11, 2024\nCurated by Amy Smith-Stewart\nBrooklyn-based Loie Hollowell’s first survey included three groups of paintings and drawings that demonstrate her taste for time-based abstractions that cohere the world around her into attractive forms. Building on the legacy of early 20th-century modernist painting, she freely quotes everything from Tantric imagery to the Light and Space movement, and all with a sense of hopefulness that endows her art with a visual splendor. A wonderful survey exhibition by an artist we are sure to see a lot from in the years ahead. —HV\nSurrealism: Other Myths\nNational Museum, Warsaw, May 10–August 11, 2024\nCurated by Hanna Doroszuk\nAgainst the common wisdom that Surrealism took hold primarily in Western Europe, the ambitious Surrealism: Other Myths presented over 60 Polish artists working across painting, drawing, photography, and film who, while not officially part of the movement, nevertheless placed an emphasis on the subconscious and dreams, and experimented with its pioneering techniques, such as montage and automatism, to uncanny effect. Particularly impactful was the section dedicated to the readymade, which included a wide range of surrealist boxes and art objects, from Marek Piasiecki’s 1950s and ’60s dismembered dolls and Wladyslaw Hasior’s ’70s sculptural insects to the eerie ’80s sculptures alluding to anatomy like breasts and vaginas by Erna Rosenstein, to, finally, Dominika Olszowy’s “Nocturne” (2024), a dreamy domestic environment inhabited by twig-sprouting teacups and headless statues. —EB\nTamuna Sirbiladze: Not Cool but Compelling\nBelvedere 21, Vienna, March 22–August 11, 2024\nCurated by Sergey Harutoonian and Vasilena Stoyanova\nHad Tamuna Sirbiladze lived longer, Not Cool but Compelling might have been a retrospective of an established artist rather than an introduction for many to a formidable talent. When Sirbiladze died of cancer-related causes in 2016, she left behind a body of searing paintings, in many cases reflecting the most intimate parts of the psyche. This incredible, thoughtfully curated exhibition offered a chronological tour through her artistic evolution. For me, and likely others who were unfamiliar with the artist, it was a revelation. It’s unfortunate that Sirbiladze is not here to see her art appreciated, but the more it’s exposed, the more her deeply expressive paintings will forge connections with those who encounter them. —NH\nFour Chicago Artists: Theodore Halkin, Evelyn Statsinger, Barbara Rossi, and Christina Ramberg\nArt Institute of Chicago, May 11–August 26, 2024\nCurated by Mark Pascale, Stephanie Strother, and Kathryn Cua\nThis tightly curated exhibition overlapped with museum’s Christina Ramberg: A Retrospective. The pairing was revelatory because it focused on a major, under-recognized artist and explored the communal spirit that characterizes Chicago’s art history and its artists’ determination to pursue visions that had nothing to do with trends in the New York art world, and that scene’s emphasis on lineage, progress, and the universality of geometry. By rejecting hierarchies and the artistic standards established by critics Clement Greenberg and Harold Rosenberg, the Chicago art world offered an alternate vision of how artists from various generations can interact. Educated at the School of the Art Institute of Chicago during different eras, all four artists were committed to drawing and creating meticulous work on a modest scale in a wide range of mediums and technique, including paint on Plexiglas, photograms, prints, and quilting. The exhibition — thoughtfully curated by Mark Pascale, Stephanie Strother, and Kathryn Cua — also included “untitled” (c. 1970), an exquisite corpse drawing by Philip Hanson, Christina Ramberg, and Evelyn Statsinger. That forgoing of the artist’s ego for a joint effort was a welcome reminder of what is possible. —John Yau\nSuzanne Valadon: A Modern Epic\nMuseu Nacional d’Art de Catalunya, Barcelona, Spain, April 19–September 1, 2024\nOrganized by the Museu Nacional d’Art de Catalunya in collaboration with the Centre Pompidou-Metz and the Musée d’Art de Nantes. Curated by Eduard Vallès and Philip-Dennis Cate.\nDuring my visit to this monumental show, one museum-goer sat on the floor with colored pencils and a sketchbook in front of “The Blue Room,” a 1923 painting of a woman in repose, smoking a cigarette. It wouldn’t be the first time an artist took inspiration from Suzanne Valadon, the unflappable self-taught French painter who rendered herself and other women with bold brushstrokes and aplomb. Though her role as a model for Henri de Toulouse-Lautrec, Edgar Degas, and other men overshadowed some of her oeuvre after her death, A Modern Epic laid bare the staggering range of her artistic skill while situating her within the bohemian landscape of early 20th-century Paris. (Case in point: She and composer Erik Satie briefly dated, and their side-by-side portraits of one another confirmed that they chose their respective pursuits wisely.) Valadon’s tender portraits of women thinking, resting, and spending time together subvert that ubiquitous pattern across art history of men painting their projections onto women. Her 1924 “Woman in White Stockings” is unbothered and assured; her 1927 self-portrait doesn’t feel the need to put on a smile. When I reached the reading room at the end of the exhibition, I found that I wanted to pick up a pencil, too. —Lakshmi Rivera Amin\nGeorge Grosz: The Stick Men\nHeckscher Museum of Art, Huntington, New York, May 11–September 1, 2024\nCurated by Karli Wurzelbacher, Pay Matthis Karstens, and Alice Delage\nGeorge Grosz: The Stick Men was a really good small exhibition that explored the German Expressionist’s life in Long Island, weaving some of his politics with the post-World War II amnesia of the era. Organized with the Das Kleine Grosz Museum in Berlin, The Stick Men drawings were the focus and the curators used them to explore Grosz’s complicated political ideas and how these artworks of hollow men sought to portray the contradictions of life in the West. —HV\nMatisse: The Red Studio\nFondation Louis Vuitton, Paris, May 4–September 9, 2024\nOrganized by Ann Temkin, The Marie-Josée and Henry Kravis Chief Curator of Painting and Sculpture, The Museum of Modern Art, and Dorthe Aagesen, Chief Curator and Senior Researcher, SMK – National Gallery of Denmark; with the assistance of Charlotte Barat, Madeleine Haddon, and Dana Liljegren; and with the collaboration of Georges Matisse and Anne Théry, Archives Henri Matisse, Issy-les-Moulineaux, France\nThis exceptional exhibition reunited Henri Matisse's 1911 painting of his studio with the actual artworks depicted in it. A massive undertaking, the show was originally organized by and displayed at New York's Museum of Modern Art in 2022. There was, however, an added magic to seeing it in Paris, not too far from Matisse's atelier in Issy-les-Moulineaux. Positioned at the center of the gallery, \"The Red Studio\" (acquired by MoMA in 1949) served as a pictorial index of the surviving works flanking it. The second half of the show contextualized the painting with tidbits about how it was rejected by the Russian patron who originally commissioned it and belonged at some point to a British nightclub owner. Hats off to the curators and researchers involved in assembling this enchanted time capsule and feat of curatorial work. —Hakim Bishara\nMickalene Thomas: All About Love\nThe Broad, Los Angeles, May 25–September 29, 2024\nCo-organized by the Hayward Gallery, London, United Kingdom and the Broad, Los Angeles, in partnership with the Barnes Foundation, Philadelphia. This iteration of the exhibition was curated by Ed Schad.\nIn Eartha Kitt’s throaty rendition of Antonio Machín’s song “Angelitos Negros,” the late performer implores, “Painter / If you paint with love / Paint me some black angels now.” In one room of her retrospective at The Broad, Mickalene Thomas displayed an eight-channel video work named after the song that mixes found archival footage of Kitt with contemporary footage Thomas captured of herself and some of the women she regularly paints. Looking back on the exhibition now, as so many of us are wondering how to weather the fickle and violently changing winds of this world, that piece especially stands out in the way that it echoes across time and Thomas takes up Kitt’s charge. The show, now at the Barnes Foundation in Philadelphia and traveling to London and France in 2025, offers a glimpse into the artist’s body of work, charting a determined and devoted path of love, care, curiosity, and recognition of women, and in particular, Black women. Her steady focus stands in contrast to that of political and corporate leaders, along with the countless sycophants chasing their favor, who constantly recalculate who among us is entitled to our full humanity, rather than insisting that it’s always all of us. —Alexis Clements\nSaints, Sinners, Lovers and Fools: Three Hundred Years of Flemish Masterworks\nMontreal Museum of Fine Arts, June 8–October 25, 2024\nCurated by Katharina Van Cauteren\nIn 2024, as fools kept rushing in where angels fear to tread, a Flemish painting show in Montreal exploring the many guises of the fool became hauntingly prescient. Antwerp’s bourgeoisie surrounded themselves with painting of folly, perhaps believing that these vivid portrayals might coax them into wiser choices. Standout pictures include Jan Massys's painting of fools embracing, Jan Sanders van Hemessen's rare portrait of an aging female jester, and Frans Verbeeck's magnum opus of a peasant bacchanal. After the bloody massacre and sacking of Antwerp in 1576, euphemized as the Spanish Fury, the Antwerp art market collapsed and this widespread artistic preoccupation with fools essentially died with it. By spotlighting the Flemish fool as a unique moment in art history with several ravishing pictures, the show gave a whole new meaning to suffering fools gladly. —Daniel Larkin\n2024 Inaugural Exhibition\nThe Campus, Hudson, New York, June 30–October 27, 2024\nCurated by Timo Kappeller in partnership with NXTHVN\nWhat do you get when you pack six tenacious New York City galleries into an abandoned high school in Hudson? The result of this unlikely experiment, now officially known as The Campus and unveiled this summer, was surprisingly less cliquey than it sounds … perhaps even … wholesome? Beyond the project’s intrinsic spirit of camaraderie, its debut show, nonchalantly titled 2024 Inaugural Exhibition, was notable for its thoughtful juxtapositions: works by Lara Schnitger and Yinka Shonibare across a sprawling gym, sculptures by Francesca DiMattio and photographs by Talia Chetrit sharing an intimate classroom. A section devoted to the Studio Fellows of the Connecticut nonprofit XTHVN felt fresh, breaking up the familiar roll call of mid-career and established names. The exhibition may be a harbinger of more collaborative undertakings in the notoriously ruthless art world. —VD\nThe Plastic Bag Store: a tragicomic ode to the foreverness of plastic\nMASS MoCA, North Adams, Massachusetts, May 9–November 3, 2024\nOrganized by the museum with the artist\nThe power of plastic is non-negotiable: Our entire planet is utterly dependent upon it and our society could not function without it. Among the most outstanding art events of my cultural year was a visit to MASS MoCA to experience The Plastic Bag Store by Robin Frohardt. Commissioned by Times Square Arts, this outrageous project premiered in New York City in 2020 and has since traveled to Los Angeles, Chicago, Austin, Adelaide, and North Adams. Consisting of an elaborate sculptural installation, a live site-specific performance, and a video screening in a cavelike room filled with plastic bags, and ending with a visit to a faux museum of plastic, The Plastic Bag Store was an unforgettable Gesamtkunstwerk. The show left me gutted and chuckling at once, both mentally wrecked by the sheer in-your-face reality check of plastic overkill (literally everything is affected by plastic) and giggling at the delightfully inventive orchestration of plastic to make the point (indeed we are screwed). Frodhardt, an award-winning theater and film director, is a magician in her ability to transform common plastic bags into a full-scale art installation while weaving in comical charm and a critical edge to playfully comment on over-consumption and convenience. —Taliesin Thomas\nJohn Akomfrah’s Listening All Night to the Rain at the Great Britain Pavilion\nGiardini at the Venice Biennale, Venice, Italy, April 20–November 24, 2024\nCurated by Tarini Malik\nOut of all the pavilions at this year’s Venice Biennale, Akomfrah’s installation was the most political, and aesthetically sophisticated. It used technology as a way to chart collective memory and soundscapes that sometimes reveal themselves in what can feel like sonic archeology. Each “canto” was a bead in a necklace of insights that floated in my imagination. —HV\nSculpting with Light: Contemporary Artists and Holography\nGetty Center, Los Angeles, August 20–November 24, 2024\nCurated by Virginia Heckert\nIn 1975, critic Hilton Kramer called Holography ’75, a show at the then newly opened International Center for Photography, a “dismal demonstration of the distance … between advanced technological invention and the serious artistic mind.” Nearly 50 years later, Sculpting with Light demonstrated how modern and contemporary artists instrumentalize the maligned form’s otherworldly kitsch to address the rapid aesthetic shifts of today’s innovation gristmill. Relics of visual culture took on a haunting glow in the exhibition: John Baldessari’s “It’s Alive” (1997–98) shows a shot of Boris Karloff in 1931’s Frankenstein, his face frozen in a reanimated stare, and Ed Ruscha’s “The End #1-#4” (1998/2016) features the serifed text of an outdated credit sequence hovering eerily over a white background. The holograms on view don't necessarily prove Kramer wrong; instead, they reveal how even the most cutting-edge technologies will eventually become art: historical, self-contained, and a little scary. —Claudia Ross\nCarrie Mae Weems: Remember to Dream\nHessel Museum of Art at Bard College, Annandale-on-Hudson, New York, June 22–December 1, 2024\nCurated by Tom Eccles\nThis summer and fall two excellent exhibitions were concurrently on display at the Hessel Museum of Art at Bard College, but the Carrie Mae Weems show in particular was truly spectacular. Made up of Weems’s lesser known pieces, the show took up nine of the museum’s galleries, each focused on one body of work, and it allowed for visitors to immerse themselves in the complexity of the artist’s ideas. The early photo work Family Pictures and Stories (1978–84) charts what may be the earliest influences on her ideas, and it just appears to be another layer in the artist’s interest in reflecting social realities through intimate and mundane objects. With each series, Weems appears to turn personal stories into the stuff of legend. —HV\nHo Tzu Nyen: Time & the Tiger\nHessel Museum of Art at Bard College, Annandale-on-Hudson, New York, June 22–December 1, 2024\nOrganized by the Singapore Art Museum and Art Sonje Center, Seoul, South Korea in collaboration with the Hessel Museum of Art and Mudam Luxembourg—Musée d’Art Moderne Grand-Duc Jean. This iteration of the exhibition was curated by Lauren Cornell and Tom Eccles.\nThe exhibition program at the Hessel Museum at Bard College in Upstate NY is among the strongest in the region, and this year was no exception, with several outstanding shows, including Ho Tzu Nyen: Time & the Tiger. Born in Singapore in 1976, Ho is widely regarded as a leading interdisciplinary artist of his generation, working in a diverse range of media, including video, digital animation, writing, and performance. His dynamic installations comment on the realities, histories, and fictions of his native Southeast Asia. Time & the Tiger featured five immersive multimedia stations spread throughout the museum’s gallery spaces, each presenting mixed footage from historical events, documentaries, music videos, and other vehicles for cultural narratives. Ho’s ongoing exploration of identity offers a poignant critical examination of how personal and cultural stories are both imagined and performed. —TT\nHaegue Yang: Flat Works\nThe Arts Club of Chicago, September 18–December 20, 2024\nCurated by Janine Mileaf\nThis sleeper show was a joyous cultural celebration of paper cutting and how a contemporary artist is transforming the medium, while embracing its long history. Very un-Matisse-like in their layered temperament, Yang’s works mine folk and decorative traditions to create Rorschach-like forms that plumb the depths of what can feel like psychologically charged imagery. —HV\nBeatriz da Costa: (un)disciplinary tactics\nLos Angeles Contemporary Exhibitions (LACE), September 7, 2024–January 5, 2025\nCurated by Daniela Lieja Quintanar and Ana Briz\nBeatriz da Costa saw that every living thing could be creative, including vermin. She turned pigeons, cockroaches, and mice into artistic collaborators. The birds in “PigeonBlog” (2006–8) measured pollution, the cockroaches in “Zapped!” (2004–6) toyed with surveillance, and the mice used in medical research writhing in pain across the series Dying for the Other were choreographed dancers of sorts, dying from the same cancer that ate de Costa from the inside out. Her life was brief, but she was a workhorse, and she produced enough art to earn this small retrospective. The exhibition, a sentimental marriage of art and engineering, demonstrated that she spent every moment tinkering, teaching, and thriving. —RR\nThe Dance of Life: Figure and Imagination in American Art, 1876–1917\nYale University Art Gallery, New Haven, Connecticut, September 6, 2024–January 5, 2025\nCurated by Mark D. Mitchell\nThis was an inspirational exhibition that reminded visitors that the United States once fostered populist arts that promoted democracy and its associated institutions. This large show focuses on three public buildings that commissioned major site-specific works in the post-Civil War era (Boston Public Library, Library of Congress, Pennsylvania State Capitol) and we are given a full range of sketches and oil studies by those and other major American artists (Edwin Austin Abbey, Edwin Blashfield, Daniel Chester French, Violet Oakley, Augustus Saint-Gaudens, and John Singer Sargent). The effect is immersive and rich, providing insight into the evolving language of democracy in a country that had just a few decades before surfaced from a deadly national conflict. Experiencing the immense beauty of Edwin Austin Abbey’s large oil on canvas study for “The Hours” at the Pennsylvania State Capitol alone is worth a visit, but there are numerous other incredible works to behold, like Henry Siddons Mowbray’s “Muse of Electricity,” which was commissioned for a New York mansion and evokes the classical style of so much of the democratic imagery emerging during the era. While the US might be in the throes of oligarchs at the moment, it’s a good reminder that democracy is something we all engage with and fight for. —HV\nCrip Arte Spazio: The DAM in Venice\nCREA Cantieri del Contemporaneo, Venice, April 16, 2024–January 10, 2025\nCurated by David Hevey\nRunning concurrently with the Venice Biennale, whose theme was “Foreigners Everywhere,” this exhibition brought to life the work of a community often othered to the point of foreignness: the UK’s Disability Arts Movement in the 1970s. Jason Wilsher-Mills’s “I Am Argonaut,” a large fiberglass and acrylic sculpture, explored the experience of becoming disabled during puberty, with written statements about his experience etched along the figure’s body. Simon Roy’s graphic novel illustrations featured major figures like Deborah Williams, who pushed for the Disability Discrimination Act 1995 and Equality Act 2010. Prescient but also timeless was Ker Wallwork’s Merg, an animated short story set in London about the bureaucracy of care — and lack thereof — told predominantly through paperwork. As Williams is quoted saying: “It was an inaccessible society that disabled us, not the crip body.” —AXM\nVan Gogh: Poets and Lovers\nNational Gallery, London, September 14, 2024–January 19, 2025\nCurated by Cornelia Homburg and Christopher Riopelle\nGreat artists come round again and again, as if on an ever-revolving carousel. The trick is to present them afresh: new themes and new insights; surprising juxtapositions; works wrested from galleries perhaps reluctant to lend, or from the ferocious grip of private collectors who fear separation from their most treasured possessions. Curator Cornelia Homburg achieved all these ambitions in a show that wowed the most hardened of critics. One of the two key thematic elements was van Gogh’s lifelong fascination with poetry, announced in the exhibition’s very first gallery, which presented his only portrait of the young man van Gogh chose to characterize as The Poet — he was a Belgian painter called Eugène Boch — and a view of the public garden where he imagined great poets from antiquity wandering and conversing. —Michael Glover\nJeremy Frey: Woven\nArt Institute of Chicago, October 26, 2024–February 10, 2025\nOrganized by the Portland Museum of Art, Maine and curated by Ramey Mize and Jaime DeSimone. This iteration of the exhibition was organized by Andrew Hamilton.\nWith striking silhouettes and hypnotic textures, high-craft sculptures dazzle in Jeremy Frey: Woven. This show marks the sculptor's first museum exhibition in his two-decade career, and his artistic voice shines through bright and clear, in harmony with those of his ancestors. Some 50 of the seventh-generation Passamaquoddy basket maker’s vessels take the spotlight (several of which have recently joined major institutional collections), alongside a selection of elegant relief prints based on basket designs. A lush, wordless 11-minute video shadows the artist through each stage of making a basket, following in the footsteps of his predecessors: Felling a slim brown ash tree in Maine’s northern forests, splitting and dyeing thin strips of wood, weaving with nimble hands. Embedded with open-ended reflections on the environment and art, legacy and land, the exhibition situates Wabanaki basketry squarely in the realm of the art museum and Frey as a contemporary artist to watch. —Julie Schneider\nPreoccupied: Indigenizing the Museum\nBaltimore Museum of Art, April 21, 2024–February 16, 2025\nCurated by Dare Turner and Leila Grothe\nI’m not sure if calling this an exhibition is correct, considering that there are many aspects to this project, which includes community interventions and conversations that are not visible to most visitors, but the resulting exhibits distributed around the museum and organized by curator Dare Turner add up to an impactful and wide-ranging display of contemporary Native American and First Nations art by some of the leading practitioners today. The project includes a solo presentation by Dana Claxton, which was an absolutely stunning show in itself; as well as one by Dyani White Hawk, perfectly arranged in the Modern galleries; Laura Ortman, located in a quiet corner so you can enjoy the immersive quality of the work; Nicholas Galanin, who shines when allotted the space; and so many others, including the truly superb video program — I can’t remember the last time an hour of viewing flew by in a museum gallery. Even group shows like Illustrated Agency were a delight as the list of artists (Wendy Red Star, Julie Buffalohead, Rose B. Simpson, Alan Michelson, and to name a few) was perfectly chosen. Once you get past the notion that Preoccupied is “one” show, and allow yourself to wander throughout the institution, it is a worthwhile exploration that foregrounds Indigenous North American art as foundational to contemporary art on this continent. —HV\nGet in the Game: Sports, Art, Culture\nSan Francisco Museum of Modern Art, October 19, 2024–February 18, 2025\nCurated by Jennifer Dunlop Fletcher, Seph Rodney, and Katy Siegel\nArt and sports occupy separate and rarely intersecting spheres in the American imagination (@artbutmakeitsports is a notable exception), but as a lifelong superfan of both, I've long thought about the connection between the \"unnecessary\" but ubiquitous existence of art and sports across human history and cultures. Aiming to illuminate that connection, SFMOMA’s expansive show feels as sprawling and teeming as a football stadium — and it’s just as fun and filled with talent. My favorites include Catherine Opie’s 2012 nude portrait of swimmer Diana Nyad’s near abusive tan lines, Hank Willis Thomas’s “Guernica” (2016), composed of famous players’ basketball jerseys, Maurizio Cattelan’s “Stadium” (1991), a working foosball table for 22 players (that you’re allowed to play), and Tabitha Soren’s “Net Impact” (2024), in which piercing portraits of young baseball players, bone fragments, and sport-specific netting strongly imply that sports and religion share their own close connection. —BQ\nBroken Boxes: A Decade of Art, Action, and Dialogue\nAlbuquerque Museum, September 7, 2024–March 2, 2025\nCurated by Ginger Dunnill and Josie Lopez\nThis group exhibition gave me a new appreciation for a curatorial format that, for me at least, can often feel forced or just plain boring. Featuring works by 23 artists who participated in the Broken Boxes Podcast, the show resists thematic homogeneity by highlighting each artist according to relationships rather than aesthetics. Here, the artists’ voices are literally amplified, creating an ambient soundtrack for the show and offering visitors multiple perspectives on art making and meaning. With sculptures, installations, films, and more that embody topics like mental and physical health, Indigenous sovereignty, and migration, I was compelled to visit multiple times, eagerly trying to commit it all to memory. —NZ\nSci-Fi, Magick, Queer L.A.: Sexual Science and the Imagi-Nation\nUSC Fisher Museum of Art, Los Angeles, August 22, 2024–March 15, 2025\nCurated by Alexis Bard Johnson\nScience fiction fandom, occult societies, and queer organizing are the three areas that structure this exhibition, but all are rooted in the drama and fantasy endemic to Los Angeles. Spanning the 1930s through the ’60s, the show expertly balances archival materials and fine art to tell interweaving stories without neglecting the extraordinary art that came out of countercultural groups like the LA Science Fantasy Society and Ordo Templi Orientis. Co-organized with USC’s vast LGBTQ+ repository, ONE Archives, the show is a rabbit hole of otherworldly, occult, and extraterrestrial tales that I didn’t want to leave — and that doesn’t even touch on its glam aesthetic. Extended into 2025 (though closed until January 14), anyone with even a passing interest in the subject matter should see it if they can. —NH\nThe Living End: Painting and Other Technologies, 1970–2020\nMuseum of Contemporary Art (MCA) Chicago, November 9, 2024–March 16, 2025\nCurated by Jamillah James and Jack Schneider\nThis ambitious display seems eager to chart how technology has extended painting in new ways. It’s a fascinating show in which archival work contextualizes so much of the art. The more recent artists’ wanderings are just as interesting, albeit incomplete and sometimes soliciting headscratching. Overall it’s a delight to investigate and find connections between art projects that span decades and communities. Even on an entire floor of the museum it feels like this show is just the beginning of a far larger exploration that I hope is expanded.\nAs an added bonus, a must-see display of works by Arthur Jafa in the MCA’s collection is on view. It was one of the finest ways to survey those works I’ve yet to see. Do yourself a favor and check out both. —HV\nBy dawn's early light\nNasher Museum of Art at Duke University, Durham, North CarolinaAugust 1, 2024–May 11, 2025\nOrganized by Xuxa Rodríguez, Patsy R. and Raymond D. Nasher Curator of Contemporary Art, with support from Julianne Miao, Curatorial Assistant\nWhere are we now, some 60 years after the Civil Rights Act of 1964 and the Voting Rights Act of 1965? That's the question this exhibition examines through a selection of outstanding works from the Nasher's collection. Artists include Hank Willis Thomas, Nari Ward, Fred Wilson, Jaune Quick-to-See Smith, Barkley L. Hendricks, Mel Chin, Scherezade García, and many other greats. The answer to this loaded question is elusive and incomplete as it's still soaked in blood and tears. —HB",
  "word_count": 8253,
  "scraped_at": "2026-02-14T12:52:43.174305"
}