{
  "article_id": "8c87f91d50ce",
  "url": "https://scvnews.com/nov-21-via-hosts-the-ai-shift-redefining-how-business-works/",
  "title": "SCVNews . com | Nov . 21 : VIA Hosts  The AI Shift : Redefining How Business Works  ",
  "date": "20251029T011500Z",
  "domain": "scvnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "[Sign Up Now] to Receive Our FREE Daily SCVTV-SCVNews Digest by E-Mail\nInside\nWeather\nCalendar\nToday in\nS.C.V. History\nS.C.V. History\nFebruary 13\nThe Valley Industry Association will host the November luncheon: “The AI Shift: Redefining How Business Works” on Friday, Nov. 21, 11:45 a.m. – 1:30 p.m.\nThe luncheon will be held at the Dr. Dianne G. Van Hook University Center, 26455 Rockwell Canyon Road, Room 258, Valencia, CA 91355.\nAI is no longer a future concept, it’s a fundamental shift reshaping how businesses operate, compete and connect. In this fast-paced, insight-driven keynote, business consultant and digital marketing expert Alison Lindemann breaks down what it means to be AI-ready. Learn about the skills, strategies and mindset that help teams adapt and thrive.\nYou’ll gain fresh insights from a national small-business AI study, explore the rise of autonomous AI agents and see what search and websites might look like by 2030.\nWalk away with clarity, confidence and actionable steps to bring AI integration from buzzword to business advantage.\nPrepare. Predict. Prosper. — The future belongs to those who are AI-ready.\nPlease R.S.V.P. at www.via.org/events/via-luncheon/.\nReservations are Required.\nMembers and sponsored guests: $50.\nNon-members: $60.\nLunch will be served.\nPlease reserve no later than Friday, Nov. 14.\nComment On This Story\nCOMMENT POLICY: We welcome comments from individuals and businesses. All comments are moderated. Comments are subject to rejection if they are vulgar, combative, or in poor taste.\nREAL NAMES ONLY: All posters must use their real individual or business name. This applies equally to Twitter account holders who use a nickname.\nREAL NAMES ONLY: All posters must use their real individual or business name. This applies equally to Twitter account holders who use a nickname.\nYou can be the first one to leave a comment.\nLOCAL BUSINESS LINKS\nLOCAL BUSINESS HEADLINES\n02-11-2026\nFeb. 18: Public Invited to Participate in Third Urban Water Management Plan Community Workshop\n02-09-2026\nFeb. 17-24: Pause SCV Outdoor Water Use\nFINANCIALS OF LOCAL INTEREST\n05-29-2020\nDonaldson Co. Declares Cash Dividend\nMARKETS & METALS\nCURRENCY CONVERTER\nLatest Additions to SCVNews.com\nState Senator Suzette Martinez Valladares has announced the introduction of SB 1060, legislation establishing a statewide standard requiring large residential alcohol and drug rehabilitation facilities to be located at least 1,000 feet away from public or private elementary schools, secondary schools and daycare centers.\nOvertime and penalty kicks were not good to our Foothill League boys soccer squads in the playoffs on Feb. 11. And the result was that only one of five teams, yes, the one that did not have to go to overtime, collected a victory. None of the Foothill League girls teams had to go to overtime, and two out of four came away with victories on Feb. 12.\n<strong>1999</strong> - SCV & AV split off from 805 area code to become 661 [<a href=\"https://scvhistory.com/scvhistory/sg031305-manzer.htm\" target=\"_blank\">story</a>]<br>\n<a href=\"https://scvhistory.com/scvhistory/sg031305-manzer.htm\" target=\"_blank\">\n<img src=\"https://scvhistory.com/gif/pacific_telephone.jpg\" alt=\"Pacific Telephone\" style=\"margin-top:6px;width:110px;border:0;\">\n</a>",
  "word_count": 481,
  "scraped_at": "2026-02-14T12:20:58.209527"
}