{
  "article_id": "8cac5c1b0850",
  "url": "https://www.yardbarker.com/college_softball/articles/injury_reveal_adds_to_texas_tech_pitcher_nijaree_canadys_lore/s1_13132_42280681",
  "title": "Injury reveal adds to Texas Tech pitcher NiJaree Canady lore",
  "date": "20250603T231500Z",
  "domain": "yardbarker.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "x\nTexas Tech Red Raiders pitcher NiJaree Canady's legend continues to grow.\nOn Tuesday, one day after pitching another complete game to send Texas Tech to its first Women's College World Series championship round, manager Gerry Glasco told reporters that the Red Raiders ace has been dealing with a hamstring injury since February. (h/t ESPN)\nCanady has thrown every pitch for Texas Tech during its unprecedented run. Per ESPN's Jake Trotter, Canady is the first WCWS pitcher to throw every pitch for a team that reached the finals since former UCLA ace Rachel Garcia (2019).\nEntering Monday's semifinal against four-time defending champion Oklahoma, Canady had thrown 362 consecutive pitches this postseason. She threw another 106, including 75 strikes, in the 3-2 walk-off win.\nComing into tonight, NiJaree Canady has thrown 3️⃣6️⃣2️⃣ consecutive pitches for Texas Tech, every pitch of Super Regionals and the WCWS.\n— ESPN (@espn) June 2, 2025\nAdditionally, she has thrown 6️⃣7️⃣1️⃣ consecutive pitches for her teams at the WCWS pic.twitter.com/Mts8ingSOE\nSince Game 1 of the Super Regionals on May 22, Canady has a 0.80 earned run average, allowing four earned runs and 16 hits in 35 innings.\nThose would be absurd numbers if Canady was fully healthy. Considering her hamstring injury, Canady's performance this postseason is one of the greatest in recent history.\nIt will be an even more remarkable accomplishment if Texas Tech completes the job and wins its first WCWS title. The Red Raiders play Texas in the best-of-three finals, with Game 1 on Wednesday.\nCanady has already earned her historic $1M name, image and likeness deal she signed earlier this year, but her ability to weather her hamstring injury and remain dominant is further proof that the Red Raiders' NIL collective, The Matador Club, made a shrewd investment.\nWhat Canady is accomplishing is one of the best current stories in sports. If we didn't see it with our own eyes, it would be hard to believe. That's what legends are made of.\nMore must-reads:\n- Texas Tech stuns Oklahoma to reach WCWS final\n- Texas Tech's $1M ace ready for WCWS final vs. Texas\n- The 'Active NBA All-Star leaders' quiz\n+\nGet the latest news and rumors, customized to your favorite sports and teams. Emailed daily. Always free!",
  "word_count": 376,
  "scraped_at": "2026-02-14T13:32:15.362328"
}