{
  "article_id": "8cafcff83f37",
  "url": "https://www.thesun.co.uk/tech/23544542/amazon-alexa-sexist-womens-world-cup-lionesses-england-australia/",
  "title": "Amazon Alexa accused of  sexist  response to simple question about the Lionesses",
  "date": "20230818T110000Z",
  "domain": "thesun.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "AMAZON’S Alexa has been accused of being sexist after it failed to answer a basic question about the Lionesses.\nAn academic was shocked to discover the digital voice-powered assistant was unable to respond when asked about the team’s semi-final win during the Women’s World Cup on Wednesday.\nAlexa was simply asked “for the result of the England-Australia football match today” but failed to respond.\nDr Joanne Rodda, from the Kent and Medway Medical School, said she was only able to get a proper answer by specifying that she was referring to women’s football.\nShe told the BBC it shows that “sexism in football was embedded in Alexa”.\nRead more about Alexa\nAmazon has now fixed the issue, describing it as an “error”.\nThe firm said the information Alexa uses comes from a variety of sources.\nAI designed to provide automated systems with key context when selecting information got it wrong, the company told the BBC.\n“[It’s] pretty sad that after almost a decade of Alexa, it’s only today that the AI algorithm has been ‘fixed’ so that it now recognises woman’s World Cup football as ‘football’,” Dr Rodda said.\nMost read in Tech\n“Out of interest, I just asked Alexa who Arsenal football team are playing in October.\n“It replied with information about the men’s team, and wasn’t able to give an answer when I asked specifically about women’s fixtures.”\nThe Lionesses beat Australia 3-1.\nThey’ll take on Spain in Sunday’s nail-biting final.\nWhat is Alexa?\nIf you've never heard of Alexa, here's what you need to know...\n- Alexa is an “intelligent” personal assistant built by Amazon.\n- You can find her on several different devices, including Amazon’s Echo speakers.\n- Alexa responds to voice commands, and can talk back to you.\n- She can perform thousands of different tasks, including telling you about the news or weather.\n- But she can do more complex things too, like ordering a pizza or arranging an Uber taxi pick-up.\n- To activate Alexa, you need to say “Alexa” to an Amazon Echo speaker.\n- Because she’s powered by artificial intelligence, Alexa is constantly getting smarter.\n- Alexa will also get more used to your voice, and better understand what you want her to do over time.",
  "word_count": 375,
  "scraped_at": "2026-02-14T13:00:25.606473"
}