{
  "article_id": "8cffbe1e8cd5",
  "url": "https://www.burntorangenation.com/2023/10/13/23916634/longhorns-daily-news-bijan-robinson-texas-oklahoma-red-river-rivalry",
  "title": "Longhorns Daily News : Bijan Robinson on Texa loss to OU :  I was hurt . It was a bad day for me . ",
  "date": "20231014T033000Z",
  "domain": "burntorangenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Bijan Robinson ended his Texas Longhorns career with a big win last year over the Oklahoma Sooners in the programs’ annual Red River Rivalry. But that doesn’t it mean it didn’t hurt the Texas alum last weekend as he watched Oklahoma narrowly beat Texas.\nLonghorns Daily News: Bijan Robinson on Texas’ loss to OU: ‘I was hurt. It was a bad day for me.’\nPlus: Texas volleyball takes on Houston this weekend\n“It was definitely a tough one because I know we made some mistakes that, if we didn’t make them, we would’ve won the game. But that last drive, they went down the field, scored. I was hurt. It was a bad day for me,” Robinson said, according to Inside Texas.\nRobinson wasn’t alone.\nWHAT THEY’RE SAYING ABOUT THE LONGHORNS\nAustin American-Statesman: 13 eye-popping Texas Longhorns stats for Friday the 13th\n247Sports: Horns247 Staff Roundtable: Revisiting preseason win projections for Texas in 2023\nInside Texas: Looking at how Savion Red has run the Wildcat this season\nInside Texas: Insider notes on progress and upside members of the 2023 class\nInside Texas: Quinn Ewers’ improvement stands as one of the biggest reasons behind Texas’ 5-1 start\nICYMI IN BURNT ORANGE NATION\nRECRUITING ROUNDUP\n247Sports: Texas women’s hoops lands major commitment from Bryanna Preston\n247Sports: Where Texas commits, targets stand in the updated Top247 rankings\n247Sports: Texas Farm System: Midseason update of our up-and-coming Longhorns to keep an eye on for 2024\n247Sports: TXHSFB Week 8 prospect preview: Katy Jordan-Katy Seven Lakes\nInside Texas: Recruiting Humidor: Texas on the road, new targets, latest WR/LB/Edge news\nBIG 12 BREAKDOWN\n247Sports: Morning Brew: Just like that, after miracle win by Houston, WVU no longer an obstacle in Texas’ path\nInside Texas: Looking around the Big 12 with the Longhorns on bye\nOur Daily Bears: Baylor men’s basketball picked 4th, Ja’Kobe Walter Freshman of the Year in Big 12 preseason poll\nFrogs O’ War: Keys to Victory: TCU vs BYU\nFrogs O’ War: Frogs O’ War Roundtable: BYU Cougars\nFrogs O’ War: Men’s Basketball: TCU selected 5th in 2023-24 Big 12 preseason poll\nFrogs O’ War: Press Conference Recap: TCU vs. BYU\nThe Smoking Musket: Time Expired: West Virginia loses heartbreaker in Houston\nThe Smoking Musket: The good, the bad, and the ugly of the Dana Bowl\nWide Right & Natty Lite: 2023 Iowa State Football Preview: Cincinnati\nBring On The Cats: What I Got Wrong: Offense\nWHAT WE’RE READING\nSB Nation: Russell Wilson is terrible, and the Broncos are stuck with him\nSB Nation: Pat McAfee is right to pay Aaron Rodgers, but it’s still messy\nSB Nation: 8 NFL coaches on the hot seat, ranked from smoldering to pants on fire\nNEWS ACROSS LONGHORN NATION AND BEYOND\n- Texas volleyball takes on the Houston Cougars on Saturday at 1pm Central, and then against on Sunday, at 12pm Central.",
  "word_count": 476,
  "scraped_at": "2026-02-14T13:38:49.778442"
}