{
  "article_id": "8d52a2a53c18",
  "url": "https://www.bbc.co.uk/sport/football/66726386",
  "title": "Jorge Vilda sacking: Ex-Spain manager on his exit after World Cup win",
  "date": "2023-09-06T08:53:10.000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "Former Spain head coach Jorge Vilda says being sacked weeks after winning the Women's World Cup was \"unfair\".\nThe Spanish Football Federation (RFEF) dismissed Vilda on Tuesday, with Montse Tome named his successor.\nVilda's exit came amid the fallout after the behaviour of RFEF president Luis Rubiales at the World Cup final.\n\"In sporting terms, I am going to accept all the criticisms, but on a personal level I think it has been unfair,\" Vilda, 42, told Cadena SER., external\n\"It has been a special year. Nothing has ever been said directly but indirectly things have been said that do not suit me. Things have been said that are not true.\"\nSpain beat England in the World Cup final on 20 August but the win was overshadowed by Rubiales kissing forward Jenni Hermoso, which she has said was not consensual.\nMost of Vilda's coaching staff resigned and 81 players refused to play for Spain in the aftermath.\nRubiales has refused to resign but has been provisionally suspended by Fifa, football's world governing body, with Pedro Rocha appointed interim president.\nIn a statement, the RFEF did not give a specific reason for Vilda's dismissal, saying he had been \"a promoter of the values of respect and sportsmanship in football\".\nHowever, the RFEF has been exploring whether it could sack Vilda - considered a close ally of Rubiales - since last week.\nThe RFEF called the move \"one of the first renewal measures\" announced by Rocha.\nVilda, who had been in charge of the national team since 2015, survived a player revolt in September 2022, when the RFEF said 15 players had submitted identical emails saying they would not play for Vilda unless \"significant\" concerns over their \"emotional state\" and \"health\" were addressed.\n'Las 15' - as the players became known - denied claims they had asked for Vilda, who has always had the support of Rubiales, to be sacked, but Spain's World Cup campaign had a backdrop of tension amid reports of concerns over training methods and inadequate game preparation.\nOf those 15, just three ended their exile and were in the squad as Spain beat England in the World Cup final in Sydney last month.\nVilda, who won 75 of his 108 matches in charge of Spain and has taken the side to second in the Fifa world rankings, added: \"I am as well as can be after being fired after being world champion 10 days ago. I have been fired, I think, unjustly.\n\"It was a brief meeting with Pedro Rocha and the vice president of Equality. The explanation given is that there have been 'structural changes'.\n\"I have a clear conscience. I have given 100% and I don't understand it, I didn't see my termination as deserved.\"\nVilda was spotted applauding Rubiales at the RFEF's extraordinary general assembly last month, during which the under-pressure president repeatedly insisted he would not resign and that he would offer Vilda a new deal.\nHowever he has since criticised his behaviour.\n\"I will never applaud anything sexist. I didn't know very well why I was going to that Assembly. I thought there was going to be a resignation,\" said Vilda.\n\"The president is valuing your work and announcing your renewal, I applauded that. I also applaud Rubiales' management of the women's football, with a budget that has multiplied by four. When 150 people around you applaud it is very difficult to be the only one who doesn't.\"\nSpain's national sports tribunal (TAD) has opened a misconduct case against Rubiales after he kissed Hermoso.\nVilda claims he did not see the kiss take place because of his position in the line as the Spanish players collected their medals and says he is yet to speak with her.\n\"The images surprised me,\" said Vilda.\n\"I've known Jenni [Hermoso] for 16 years, I know she's having a hard time.\"\nTome 'will do well' with my legacy - Vilda\nFormer midfielder Tome - who was part of Vilda's coaching team - is set to lead Spain into a new era after becoming the first woman to hold the position.\nShe won four caps for her country during her playing career and her first assignment comes later this month as Spain feature in Women's Nations League qualifying fixtures against Sweden and Switzerland on 22 and 26 September.\nVilda said: \"Montse Tome has well deserved this, I have congratulated her. I think she has the ability to do very well. She was chosen by me for the coaching staff.\n\"In addition, she has a well-rounded team, the greatest legacy I can leave is our recognisable style of play, the methodology... to be able to play this way. That's where we are at - let her take advantage of it. She is prepared and she is going to do it well.\"\nWill Jessie and Tom rekindle the old flame? Award-winning comedy Starstruck returns\nBoot Dreams: Now or Never: Roman Kemp and Bruno Fernandes give rejected players a second chance at the game they love",
  "word_count": 835,
  "scraped_at": "2026-02-14T11:17:44.929564"
}