{
  "article_id": "8d5500e247f4",
  "url": "https://www.npr.org/transcripts/g-s1-28932",
  "title": "Republican ads on transgender rights are dominating the airwaves : NPR",
  "date": "20241019T110000Z",
  "domain": "npr.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SCOTT DETROW, HOST:\nVoters consistently say issues like the economy and reproductive rights are their top concerns in this election. But in the closing weeks of the campaign, Republican ads focusing on transgender rights are dominating airwaves all over the country. NPR political correspondent Susan Davis reports.\nSUSAN DAVIS, BYLINE: If you've seen a Trump campaign ad lately, there's a good chance it's this one.\n(SOUNDBITE OF POLITICAL AD)\nUNIDENTIFIED NARRATOR #1: Kamala was the first to help pay for a prisoner's sex change.\nVICE PRESIDENT KAMALA HARRIS: The power that I had - I used it in a way that was about pushing for the movement, frankly, and the agenda.\nUNIDENTIFIED NARRATOR #1: Kamala's agenda is they/them, not you.\nDAVIS: The Trump campaign has recently dropped at least 17 million on ads highlighting Harris' support during her 2019 presidential campaign for access to gender affirming-medical treatment for transgender people. It's part of a broader Republican strategy casting the Democratic Party as taking transgender rights to extremes. According to data compiled by AdImpact for NPR, these ads have aired more than 30,000 times, including in all seven swing states, and with a particular focus on NFL and college football broadcast audiences.\nJESSICA TAYLOR: I do think it's just emphasizing that sort of cultural divide that we do see in sport.\nDAVIS: That's Jessica Taylor, a nonpartisan election analyst with the Cook Political Report. She says the issue can appeal to men and swing suburban women, and polling backs that up. Recent NPR/PBS NewsHour/Marist polling showed 61% of Americans say transgender athletes should only be allowed to play on teams that match their birth gender. In races where small shifts matter, divisive social issues can move the needle.\nTAYLOR: If it moves a small sect of voters, that could still be key.\nDAVIS: Republicans are making similar bets in House and Senate races that'll help determine control of the next Congress. The Senate Leadership Fund, a super PAC affiliated with Senate minority leader Mitch McConnell, is bombarding Ohio with at least 15 million in ads attacking incumbent Senator Sherrod Brown on these very issues...\n(SOUNDBITE OF POLITICAL AD)\nUNIDENTIFIED NARRATOR #2: But Brown voted multiple times to allow transgender biological males to participate in girls sports.\nDAVIS: ...As well as 3 million in recent ads in Wisconsin, against incumbent Democrat Tammy Baldwin, the first gay person elected to the Senate.\n(SOUNDBITE OF POLITICAL AD)\nUNIDENTIFIED NARRATOR #3: Baldwin supported providing puberty blockers and sex change surgeries to minor children.\nDAVIS: Trans-related ads are also targeting Democrats in at least eight competitive house races. Kelley Robinson is the president of the Human Rights Campaign, which advocates for LGBTQ rights.\nKELLEY ROBINSON: We've seen this before. When MAGA extremists are under attack and feeling like they're not going to win, they go to this old playbook of trying to sow fear and transphobia in our communities.\nDAVIS: Robinson noted Republicans also ran trans-focused ads in 2022 and 2023 elections that largely fell flat with voters. But Trump wasn't on the ballot then, and Harris isn't aggressively responding now. Her campaign pointed NPR to comments spokesman Michael Tyler made last month on Fox News, where he said these issues are, quote, \"not what she's proposing or running on.\" Robinson is unbothered by the lack of Democratic response on the air.\nROBINSON: I'm not looking for them to kind of engage in the fearmongering. I'm looking for them to show that they're candidates that can pull this country together and that won't use divisiveness as a political tactic.\nDAVIS: These ads are expected to remain on the air until Election Day.\nSusan Davis, NPR News, Washington.\nCopyright © 2024 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.",
  "word_count": 675,
  "scraped_at": "2026-02-14T12:10:38.743014"
}