{
  "article_id": "8d6bf76fbf96",
  "url": "https://www.express.co.uk/showbiz/tv-radio/2063281/disney-warning-1k-tv-licence-fine-UEFA",
  "title": "Urgent Disney+ warning exposed which could cost viewers £1 , 000",
  "date": "20250602T160000Z",
  "domain": "express.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Urgent Disney+ warning exposed which could cost viewers £1,000\nDisney+ is bringing fans brand-new live football coverage this year - but one hidden rule could end up costing viewers a small fortune.\nDisney+ has scored a massive new football deal on its platform —but it comes with a pricey catch for viewers who aren't careful. The streaming giant has secured exclusive rights to the UEFA Women’s Champions League across Europe, meaning from October 2025, subscribers will be able to stream every match live, with no extra cost to their monthly fee. But there's a major caveat: fans will still need a valid TV licence or risk being slapped with a fine of up to £1,000.\nEven though the matches will air via a prepaid streaming platform, watching live content legally in the UK still requires a TV licence. If you're caught watching without one, you could face prosecution and fines of up to four figures. TV Licensing warns: “Not paying for a TV Licence could lead to a £1,000 fine if we find that you have been watching, recording or downloading programmes illegally. The maximum fine is £2,000 in Guernsey. Plus any legal costs and/or compensation you may be ordered to pay.”\nThe warning comes as Disney+ announced it will stream all UEFA Women’s Champions League matches from the 2025/26 season to 2029/30. It’s the first time a major entertainment streamer has exclusively hosted the tournament.\nThe Disney+ announcement read: “Disney+ will be the home of the UEFA Women's Champions League across Europe from next season, allowing fans to watch every match live at no extra cost.”\nThe service confirmed this is part of a new five-year deal, adding: “This development follows a five-year deal in which The Walt Disney Company has secured live rights to the competition from 2025/26 to 2029/30.”\nThe new format will also bring significant changes to the tournament. It went on: “As the only place fans can watch all live matches in the competition, coverage on Disney+ will launch in October 2025, marking a new era for the UEFA Women's Champions League with the introduction of the 18-team League phase format.”\nDon't miss: Beloved Disney legend dies after cancer battle as daughters pay touching tribute\nDon't miss: The 'most underrated' war film that could become 'an all-time great masterpiece'\nDon't miss: The incredibly cheap city with two Disney parks and beautiful sandy beaches\nKarl Holmes, General Manager of Disney+ EMEA, said: “The UEFA Women’s Champions League is the very best in football performance, dedication, and passion.\n“Bringing this incredible tournament to Disney+ customers and audiences speaks to our commitment to delivering a huge range of bold and dynamic entertainment.\"\nHe added: “As women's football continues to grow with audiences worldwide, we're proud to offer the thrill and excitement of every single match to Disney+ customers across Europe, at no extra cost.”\nTV Licensing has reiterated that while most on-demand content remains exempt, any live-streamed programming—regardless of platform—still requires a TV licence.\n“You need to be covered by a TV Licence to watch live on streaming services – such as ITVX, Channel 4, YouTube, Amazon Prime Video, Now, Sky Go, Netflix and Freely,” it states.\nThe cost of a TV licence increased on April 1 from £169.50 to £174.50 per year—still significantly less than a potential fine.\nStreaming platforms are increasingly investing in live broadcasts, with Netflix recently airing Tudum LIVE, a global fan event shown in real time. However, viewers are reminded that live streaming—regardless of platform—still falls under TV licensing laws.",
  "word_count": 587,
  "scraped_at": "2026-02-14T12:50:02.334376"
}