{
  "article_id": "8d6e2f8ec737",
  "url": "https://localnews8.com/news/national-world/cnn-world/2023/12/15/fifa-fast-facts-3/",
  "title": "FIFA Fast Facts - Local News 8",
  "date": "20231215T234500Z",
  "domain": "localnews8.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA Fast Facts\nCNN Editorial Research\n(CNN) — Here is a look at FIFA (Fédération Internationale de Football Association), international soccer’s governing body and organizer of global tournaments including the World Cup.\nOther Facts\nWhen FIFA was founded in 1904, there were seven member countries: France, Belgium, Denmark, the Netherlands, Spain, Sweden and Switzerland.\nFIFA’s six confederations represent different regions of the world: UEFA (Europe), CAF (Africa), CONCACAF (North and Central America), CONMEBOL (South America), OFC (New Zealand and South Pacific island nations) and AFC (Asia).\nIn addition to the World Cup, which takes place every four years, FIFA organizes the FIFA Club World Cup, which began in 2000. Seven men’s teams participate: winners from each of the six confederations, plus the winning team from the host country.\nTimeline\nMay 21, 1904 – FIFA is founded in Paris, to promote international football (soccer) tournaments.\n1905 – England, which has its own Football Association dating back to 1863, becomes a member nation. The British initially resisted joining FIFA.\n1913 – The United States Football Association, now called the United States Soccer Federation, joins FIFA.\nJuly 13-30, 1930 – Uruguay hosts the first World Cup. Thirteen teams compete and Uruguay wins the tournament, defeating Argentina. Team USA places third.\n1975 – Joseph “Sepp” Blatter of Switzerland joins FIFA as director of technical development programs, serving under President João Havelange of Brazil.\n1981 – FIFA’s executive committee names Blatter general secretary of the organization.\nNovember 16-30, 1991 – China hosts the first Women’s World Cup. Team USA defeats Norway in the final match.\nJune 8, 1998 – Blatter is elected president of FIFA, defeating Swedish soccer stalwart Lennart Johansson.\nMay 21, 2001 – A company closely affiliated with FIFA, International Sports Media and Marketing (ISMM) is declared bankrupt in Swiss Court. ISMM was the parent company of International Sports and Leisure, which sold World Cup television rights and negotiated corporate sponsorships. FIFA brings charges against ISMM, claiming company executives diverted a $60 million payment from a licensee and deposited it in a secret bank account.\nJuly 7, 2001 – During a FIFA meeting in Buenos Aires, Blatter delivers a lengthy report about the impact of the ISMM bankruptcy on the organization and he pledges to usher in a new era of transparency.\nFebruary 28, 2002 – Farah Addo, vice president of the CAF confederation, tells the Daily Mail he was offered $100,000 to help Blatter win the election in 1998 but he turned the money down. He says 18 other officials accepted payments from Blatter’s associates in exchange for votes. Blatter fires back that the allegations are baseless, with a statement on FIFA.com.\nMarch 7, 2002 – FIFA’s executive committee authorizes an internal investigation into the organization’s finances.\nMay 3, 2002 – In a review not released to the public, FIFA General Secretary Michel Zen-Ruffinen claims there is such widespread corruption within the organization, criminal charges may be warranted, according to the Los Angeles Times. The newspaper reports five top officials demanded Blatter step down. He vowed to fight the charges.\nMay 10, 2002 – Members of FIFA’s Executive Committee file a formal complaint against Blatter with Swiss authorities. Blatter issues a statement in response, “I remain unperturbed by the prospect of a possible investigation.”\nMay 29, 2002 – Blatter is reelected FIFA president, defeating Issa Hayatou of Cameroon, 139-56.\nMay 31, 2002 – FIFA’s Executive Committee withdraws its complaint against Blatter. Zen-Ruffinen, the author of the report alleging criminal misconduct, resigns.\nOctober 6, 2004 – The Executive Committee approves a code of ethics.\nJune 9, 2006 – FIFA establishes an ethics committee to address allegations of bribery, match fixing, betting and other illegal practices.\nSeptember 15, 2006 – Former Olympic champ Lord Sebastian Coe of England is appointed chairman of FIFA’s new ethics committee.\nOctober 20, 2010 – Two members of FIFA’s Executive Committee are suspended after a British newspaper reports they offered to sell their World Cup votes.\nNovember 18, 2010 – FIFA confirms the suspension of four additional officials for suspected ethical breaches.\nNovember 29, 2010 – Ahead of the vote for the host countries of the 2018 and 2022 World Cup tournaments, the BBC reports three senior FIFA officials who will participate in the selection process took bribes from International Sports & Leisure during the 1990s. One of the officials, Ricardo Teixeira, is the former son-in-law of former FIFA President João Havelange.\nMay 24, 2011 – Chuck Blazer, an American member of the executive committee, accuses FIFA officials Jack Warner and Mohamed Bin Hammam of bribery. He alleges the two gave money to members of the Caribbean Football Union to cast ballots for Bin Hammam in his campaign to become FIFA’s new president. On May 29, Warner and Bin Hammam are suspended.\nJune 1, 2011 – Running unopposed, Blatter is elected to a fourth term as FIFA president. He announces a change in the process of selecting World Cup host countries. Instead of having the small, 24-member executive committee pick future World Cup hosts, the full FIFA congress will participate, with one vote for each member nation.\nJuly 17, 2012 – FIFA announces former US Attorney Michael J. Garcia and former German prosecutor Hans-Joachim Eckert have been appointed chairmen of the ethics committee, tasked with probing various allegations of wrongdoing.\n2013 – As Brazil preps for the 2014 World Cup, at least five workers die in construction accidents. Thousands of protesters clash with police during the early summer and the unrest continues throughout the year leading up to the soccer tournament.\nMarch 2014 – The International Trade Union Confederation, a labor rights group, publishes a report, “The Case Against Qatar.” The ITUC projects 4,000 migrant laborers will die before the 2022 World Cup.\nMay 21, 2015 – Amnesty International calls on FIFA to step up its efforts preventing the exploitation of migrant workers building World Cup stadiums in Qatar. The human rights group reports the Qatari government has failed to implement many of the worker safety protections it had previously promised. FIFA responds with a statement: “FIFA has repeatedly urged publicly and with the highest authorities in Qatar that fair working conditions for all workers in Qatar are imperative.”\nMay 27, 2015 – Nine FIFA officials and five soccer marketing executives are charged with racketeering, wire fraud and money laundering, after a lengthy investigation by the US Department of Justice (DOJ). Swiss police conduct an overnight raid at FIFA headquarters in Zurich to arrest several of the officials. Soon after the raid, authorities in Switzerland announce they will begin their own investigation into the bidding process for the 2018 and 2022 World Cup games.\nMay 29, 2015 – Blatter is elected for a fifth term as FIFA president.\nJune 2, 2015 – Blatter says he will resign in 2016, acknowledging the organization needs “a profound overhaul.” Meanwhile, New York prosecutors release a 40-page court transcript with an admission from executive committee member Chuck Blazer saying he took bribes over the course of nearly two decades, including a payment that swayed him to vote for South Africa rather than Morocco as the 2010 World Cup host country.\nSeptember 17, 2015 – FIFA suspends General Secretary Jérôme Valcke amid allegations he participated in a scheme involving illegal World Cup ticket sales. Valcke’s attorney says his client has been falsely accused.\nSeptember 25, 2015 – Swiss authorities announce they are investigating Blatter, looking into suspected financial mismanagement related to an illegal payment. Blatter’s attorney tells CNN “no mismanagement has occurred.”\nOctober 8, 2015 – FIFA’s Ethics Committee suspends Blatter for 90 days. Valcke and UEFA President Michel Platini are also banned for 90 days.\nDecember 3, 2015 – Two more high ranking FIFA executives are arrested by Swiss police for allegedly taking millions of dollars in bribes. Separately, the DOJ announces its corruption probe has expanded, unsealing a 92-count indictment naming 16 new defendants in the case, all affiliated with FIFA’s North and South American confederations.\nDecember 21, 2015 – FIFA’s ethics committee suspends Blatter and Platini for eight years. During a press conference, Blatter promises to appeal the ban.\nJanuary 9, 2016 – FIFA dismisses Valcke as general secretary. Dr. Markus Kattner is chosen as the acting replacement.\nFebruary 12, 2016 – FIFA announces that its Ethics Committee has banned Valcke for 12 years from any football-related activities on a national and international level, effective immediately. The ban is later reduced to 10 years.\nFebruary 25, 2016 – Blatter and Platini lose their appeals to vacate their eight-year bans. However, the presidential committee does reduce the bans for both men to six years, stating that “some strong mitigating factors for Mr. Platini and Mr. Blatter were not taken into account when establishing the sanction.”\nFebruary 26, 2016 – FIFA announces numerous reforms to help repair the organization’s reputation. The reforms include limiting the organization’s president to three terms in office, while a new 36-member council will replace the executive committee. Later in the day, after two rounds of voting, world football’s governing body elects Gianni Infantino as the new president of FIFA. Infantino, of Switzerland, has been the general secretary of the European governing body UEFA.\nMay 13, 2016 – FIFA announces that Fatma Samba Diouf Samoura of Senegal will be FIFA’s new general secretary. Samoura will be the first woman and first African to hold the job.\nJune 3, 2016 – Lawyers representing FIFA claim that Blatter and two ousted officials paid themselves $80 million in raises and bonuses between 2011 and 2015. FIFA says that its ethics committee will look into the matter.\nSeptember 9, 2016 – FIFA’s ethics committee announces that it is investigating allegations of bribery, corruption and conflict of interest violations involving Blatter as well as two other former officials.\nNovember 10, 2016 – Rafael Esquivel, the former president of the Venezuelan soccer federation, pleads guilty to racketeering, wire fraud and money laundering related to bribery schemes that involved the awarding of contracts for media and marketing rights to international soccer competitions.\nDecember 5, 2016 – The Swiss Court of Arbitration for Sport upholds Blatter’s six-year ban from FIFA, which he had appealed. He says that he accepts the court’s decision and will not try to get a higher court to reverse the ruling.\nDecember 8, 2016 – FIFA faces legal action in Switzerland over allegations it has been jointly responsible for the mistreatment of migrants who are working on projects for the 2022 World Cup in Qatar.\nNovember 21, 2018 – FIFA announces that it has ousted Sundra Rajoo, a member of its ethics committee. Rajoo is accused of financial misconduct after an investigation by the Malaysian Anti-Corruption Commission.\nJune 5, 2019 – Infantino, running unopposed, is reelected as president of FIFA.\nFebruary 20, 2020 – Valcke is charged by the Office of the Attorney General of Switzerland with accepting bribes, several counts of aggravated criminal mismanagement and falsifying documents related to the awarding of media rights for various World Cups and Confederations Cups. In October, Valcke is found guilty of forging documents, but acquitted of accepting bribes and criminal mismanagement.\nMarch 24, 2021 – Blatter and Valcke are found guilty of various ethics violations and issued a new ban of six years and eight months from all football-related activities.\nAugust 24, 2021 – Following a six-year corruption investigation into bribery schemes in multiple world football organizations, the US DOJ awards $201 million to FIFA, CONCACAF, CONMEBOL and other affected entities. The DOJ determined the organizations had been victims of decades-long bribery schemes that have corrupted football and stunted the game’s development. A DOJ statement says FIFA, CONCACAF, and CONMEBOL will distribute funds from the reward into a newly created World Football Remission Fund, which will be established under the FIFA Foundation.\nNovember 2, 2021 – Blatter and Platini are indicted for fraud in Switzerland, according to the country’s attorney general. On July 8, 2022, they are both acquitted.\nMay 18, 2022 – US Soccer reaches a historic deal to become “the first Federation in the world to equalize FIFA World Cup prize money” awarded to both its men’s and women’s national teams for participating in World Cups.\nMay 19, 2022 – FIFA announces that the upcoming men’s World Cup in Qator will feature women referees for the first time in the event’s history. Stéphanie Frappart from France, Salima Mukansanga from Rwanda and Yoshimi Yamashita from Japan are included on the list to referee the event, which will begin in November.\nMarch 16, 2023 – Infantino is reelected for another term as president of FIFA.\nDecember 11, 2024 – FIFA announces Spain, Portugal and Morocco will joint host the 2030 men’s World Cup and Saudi Arabia will host the 2034 edition. Several members of the European Parliament and various human rights organizations express concerns over Saudi Arabia hosting due to the country’s record on human rights.\nMarch 5, 2025 – Infantino confirms that the 2026 men’s World Cup final, set to be played at MetLife Stadium in New Jersey, will include a halftime show for the very first time.\nNovember 5, 2025 – FIFA introduces the FIFA Peace Prize – a new annual accolade given to someone who FIFA says has taken “exceptional and extraordinary actions for peace and by doing so have united people across the world.” On December 5, US President Donald Trump is presented with the award.\nThe-CNN-Wire\n™ & © 2025 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.",
  "word_count": 2242,
  "scraped_at": "2026-02-14T12:05:30.368488"
}