{
  "article_id": "8d71d8b69e36",
  "url": "https://www.abc.net.au/news/2024-07-15/matildas-canada-loss-is-no-red-flag-shows-process-progress/104098680",
  "title": "Matilda Canada loss is no red flag : it shows the process of progress",
  "date": "20240715T073000Z",
  "domain": "abc.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "analysis\nMatildas' Canada loss is no red flag: it shows the process of progress\nThey say there are two things that nobody wants to see how they get made: laws and sausages.\nYou can probably add national football teams to that list, too.\nThe life of a national team manager is arguably one of the most difficult in the sport. You're handed just half a dozen international windows each year — totalling around 12 weeks — within which you must squeeze training camps, competitions, travel, and recovery.\nThese are the only opportunities you get to work with your players in real life; to teach them new tactics and systems, embed new styles and philosophies, dig down into the finer details.\nThese are players, mind you, who you cannot buy or trade yourself, but who are yours simply by the accident of their birth, and so you must make the best out of what you have.\nTheir development is largely out of your hands, too. It's the clubs that do the work here, for the most part, and serve you up a player who has built the mind frames and muscle memories of whichever coaches that moulded them elsewhere.\nHow much can you really achieve, then, within such circumstances? With the ubiquity of club football seeping into so much of our lives, have our expectations on national teams to perform magic become too high, too unrealistic? If so, what is the sign of a good national team, then?\nThis seems to have been the foundational question driving conversation and criticism around the Matildas under the past four years of Tony Gustavsson's tenure. What exactly are we looking for? Why? And how, given all of the above, can they get there?\nFans rarely get a glimpse behind the curtain of national team training camps. We see friendlies, yes, and major tournaments, of course, but those performances are always a little (or a lot) more polished than what they look like the rest of the time.\nOn Saturday night, Matildas fans snatched one of those rare glimpses of the other side of national team development: a 'B' international friendly against Canada, played at a training venue in Spain, in front of nobody except team-mates, staff, and a couple camera operators.\nThere were probably not that many more people watching it live from back home given its early-morning kick-off time and status behind the paywalled Paramount+ streaming service: the first time a Matildas game has not been simulcast on free-to-air under their current agreement.\nAnd watching the game itself, you can understand why these games are almost always played with the curtain drawn. We saw how the sausage gets made.\nMissing a number of key starting players, including captain Steph Catley, forward Caitlin Foord who pulled out in the warm-up, and back-up goalkeeper Teagan Micah, the Matildas were already forced to mix-and-match their team over the course of this match.\nFoord's absence opened the door for Sharn Frier, the young Brisbane Roar winger, combining with Cortnee Vine down either wing. They chased the ball more than they touched it, and whenever they did, they were soon suffocated by the more experienced Canadian defenders.\nFor the opening 20 minutes, Australia struggled to get any kind of control of possession, regularly losing out in tackles or misplacing passes that they would usually nail. Their decision-making was half-a-beat slower, their touches slightly too long or short, their reaction times a bit off. Canada looked stronger, fitter, faster, hungrier.\nThere was a reason for that: the players had been pushed through intense training sessions in the week leading up to the game, deliberately fatiguing their bodies to mimic what the upcoming Olympic schedule — with games just three days apart from each other — will be like.\nCanada will be in Paris as well, of course; desperate, you'd imagine, to defend their Tokyo gold medal to make up for their group-stage exit at the World Cup last year.\nThe Matildas also weren't going into this game to win it, necessarily. They were there to rehearse; to put on their costumes and play make-believe, using the prop of Canada to pretend they were facing Germany, Zambia, and the USA.\nIn addition to its behind-closed-doors vibes, Mackenzie Arnold's nonchalant hand of apology after spilling the ball that led to Canada's equaliser was proof enough of how unserious a game this was in the traditional winning sense.\nThat's not to say it wasn't useful, though. Gustavsson used every outfield player available to him across the 90 minutes, trying different combinations of players, structures, and speeds.\nThey worked on playing out from the back and on long, direct balls in transition. They tried a few formation shapes with varying points and styles of attack, and practised taking the energy out of a game towards the end. This is how the sausage gets made.\nAnd it's one the Matildas haven't had quite like this, perhaps ever. Their rise as a team on the international stage has been facilitated by their footballing complexity and maturity; their ability to shape-shift in and out of different systems, to play possessive and counter-attacking football, to defend compactly and attack electrically when the pressure or the occasion calls for it.\nBut they've had to learn to do these things over years and years of these small windows together, criss-crossing the world to take part in their biggest and hardest-ever schedule, tiring their brains and bodies out, doing the ugly stuff that nobody else gets to see.\nIt's fitting that Canada was the team Australia faced in this of all games given they've provided us with a useful barometer for the Matildas' progress under Gustavsson.\nTheir two-match friendly loss to Canada in September of 2022 was a turning-point for the squad, who then went on to win nine of their next 10 games — including wins over England and France — in the build-up to the World Cup proper.\nThose two losses saw a number of these younger, emerging players reach individual cap milestones, and a change of focus from experimentation to preparation for the tournament. Come the group stage, the Matildas' 4-0 win over Canada (their biggest ever scoreline over them) was shades different to their last meeting, although the players were largely the same.\nCanada provided Australia with another reality-check last December, winning a two-match friendly series against them once more. But that was a camp more about the distant future than the near one, with players such as Remy Siemsen, Amy Sayer, Sarah Hunter, Courtney Nevin, and Charlize Rule all starting in their 5-0 loss, before the more senior squad went down 1-0.\nThose games, like the one on Sunday morning, was a sign of bigger processes being worked through underneath the hood of this team.\nWhen Gustavsson was first hired, he was handed Football Australia's inaugural Women's Performance Gap report, which detailed some concerning data around the lack of depth of the Matildas. One of his key jobs as head coach was to try and close that gap. And the most recent Canada match showed just how much he has done so.\nAccording to the updated report, 23 players have debuted for the Matildas in the past four years: an increase of 15 on the previous World Cup cycle. Seven of those debutants are now regulars and were selected in the 2023 World Cup squad, with six called up to this year's Olympic team. It's been the biggest introduction of debutants for the Matildas in over a decade.\nAnd the amount of international experience these players have received has been marked, too. Of the World Cup players who debuted under Gustavsson, all but one of them (Kaitlyn Torpey, who earned her first cap earlier this year) have more than 10 appearances. Most have over 20, with Mary Fowler and Kyra Cooney-Cross sitting just below or above 50.\nThe average age of the team has been lowered to 23 with the introduction of more players inside the 20-25 bracket, establishing a stronger core of younger players who will hopefully make the transition into the next generation of Matildas smoother once the current core retires.\nAnd finally, the amount of international matches they've played against high-quality and diverse opponents has also increased, with over half of their games in the past cycle coming against nations ranked inside the top 10, including double the amount of games against European sides and a team from every other confederation as they prepared for last year's World Cup.\nTheir results at major tournaments have reflected this process: two fourth-placed finishes at the Tokyo Olympics and World Cup, the furthest Australia had ever gone in either tournament, all while setting goal-scoring, clean-sheet, and major win milestones.\nThe development isn't stopping here. As we saw on Sunday morning, players like Frier and Winonah Heatley — the least experienced members of the entire squad — took to the field, too.\nAnd while it didn't count towards their official caps, their very presence there, like the presence of so many emerging players before them, forecasts the future of this team, just as Canada games over the past three years have forecast the team we have today.\nSo while it may not have been pretty from the outside, this is how the sausage gets made.\nThe feast proper begins in 10 days, with an opening Olympic group game against Germany, followed by Zambia and the USA.\nThat will be when we know whether all the mess was worth it.",
  "word_count": 1583,
  "scraped_at": "2026-02-14T12:09:45.130043"
}