{
  "article_id": "8d83b141deb0",
  "url": "https://www.justarsenal.com/arsenal-women-academy-beat-chelsea-interest-to-sign-england-u17-fullback-sophie-harwood/371792",
  "title": "Arsenal Women Academy beat Chelsea interest , to sign England U17 fullback , Sophie Harwood",
  "date": "20240721T191500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal Women Academy beat fellow WSL academy teams to the signing of versatile English fullback Sophie Harwood. The 17-year-old signed her Arsenal contract this week after quitting Southampton.\nFollowing her headline swoop, which has sparked much discussion among women’s football fans, the fullback has spoken to\nOnline Gooner about her move to Arsenal.\nSo why Arsenal?\nThe England U-17 star has revealed that watching players from the Arsenal academy seamlessly transition into the first team, and the welcoming nature of their coaches, convinced her that Arsenal was the right club for her. She believes there’s a pathway for her to progress at Arsenal.\nShe revealed, “Arsenal are a big club, but I wanted to go to the club that I felt would develop me the most and had a good pathway. I just think the coaches were really welcoming, and the players, so I think it’s the right move for me.\n“I think what Arsenal are doing with academy players breaking through really inspired me to be an Arsenal player. Like I said, the coaches are very welcoming, and I felt it was the club for me.”\nWSL champions Chelsea were also reported to be interested in the player, as per BBCSport’s Emma Sanders.\nAt Arsenal, Sophie will be hoping to establish herself with the Arsenal Women’s U-21, with whom she’ll be looking to break into the first team. She is currently recovering from an injury; back in February, doctors discovered she had a stress fracture in her foot. She’s nearing her return from injury, but even so, it is likely she’ll have a slow start to life at Arsenal, as she fully rehabiltates.\nWhat a coup for Arsenal, huh Gooners?\nMichelle M\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….\nMore Stories / Arsenal Women",
  "word_count": 319,
  "scraped_at": "2026-02-14T12:22:58.792052"
}