{
  "article_id": "8d83e3912dee",
  "url": "https://www.businessinsider.com/up-and-coming-professionals-to-know-in-advertising-technology-2023-4",
  "title": "Up and Coming Professionals to Know in Advertising Technology",
  "date": "20230419T171500Z",
  "domain": "businessinsider.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- Insider named its second annual list of up-and-coming advertising tech talent.\n- The group represents a range of roles at adtech companies, publishers, retailers, and advertisers.\n- They are helping the ad industry grab new opportunities, like retail media and streaming TV ads.\nThe uncertain economy has prompted many companies to cut back their marketing and ad spend, but there's still demand for top talent who can solve some of the advertising industry's toughest problems, and seize some of its newest opportunities.\nAdtech companies are jockeying against each other to capture market share in streaming TV advertising, servicing the needs of content owners like Netflix, Warner Bros. Discovery, Disney, and NBCU. They're also trying to strike gold in retail media, a relatively new category that could represent a $26 billion market for adtech companies, according to Morgan Stanley.\nBut in order to have a chance at winning out, adtech firms need talent who can build top-tier solutions. The early- and mid-career professionals on this list are spearheading some of these big initiatives.\nThe list is based on peer nominations, products, and campaigns they have worked on, their influence at their companies, and their potential to be industry leaders. We considered nearly 90 people from adtech companies, publishers, and advertisers.\nHere are the 27 rising stars of adtech, listed alphabetically by last name.\nAmina Asim, associate director of audience intelligence, RPA\nAsim, who has a Ph.D. in media, technology, and society from Northwestern University has reinvented the agency's audience insights division by changing the way it captures data.\nThe practice creates detailed audience profiles and personas using third-party research tools, and then integrating that with clients' first-party data. The audience targets that Asim's team have created have generated between an 80% and 170% increase in conversion rates, across more than 50 campaigns.\nAsim is helping the ad agency RPA build an ID-based audience platform to help clients prepare for the end of third-party tracking cookies on the web in a privacy-compliant manner. This year she's also working on building an audience insights platform to help RPA identify key data sources such as behavioral signals and attitudinal research.\nAsim had a wide range of experience before joining RPA. She was a a 2019 Aspen fellow where she created and presented policy on real-world tech issues such as data privacy, deepfakes, ad fraud, and foreign country cyberattacks on US companies. She produced a documentary film on the transnational impact of the multibillion dollar China-Pakistan Economic Corridor development project, which was broadcast on VICE News in 2021. And prior to joining RPA, she was a senior program manager for worldwide content operations at Amazon Prime Video.\nGaby Baden, senior account director, Emodo\nBaden's specialty lies in nailing requests for proposals that brands issue when looking for adtech companies to run campaigns. Her work winning new accounts for the adtech firm Emodo resulted in $5.2 million in revenue in 2022. Her sales teams beat their yearly quotas by 73% last year, according to the company.\nFor example, Baden successfully sold a new native ad format to an automotive brand by pitching the artificial intelligence technology that powered the format.\nShe spearheaded a partnership with measurement firm Pathformance, which tracks sales lift of native ads for packaged goods brands. She also ran the firm's first campaign with rebate app Ibotta that drove sales for a dairy brand.\nBaden is also an editor and tweaks Emodo's marketing materials to help sales reps pitch, and she works with the finance and operations team to set rate card prices.\nKatie Beltz-Long, head of US demand sales, Beachfront\nBeltz-Long has been instrumental in bringing innovation to Beachfront's partnerships in order to drive organic growth.\nFor example, she worked with Kroger Precision Marketing to make Beachfront's connected TV and online video ad inventory available to advertisers on Kroger's self-serve ad platform. And she worked with FlowCode to integrate its QR code technology into Beachfront's ad units.\nShe also plays other key roles internally for the company. Beltz-Long created and leads Beachfront's internal culture committee, which aims to improve employee welfare through activities, policies, and perks. Through the committee, she implemented the company's unlimited paid time off and referral bonus policies.\nBeltz-Long frequently lends her expertise to industry panels and articles at events like StreamTV Growth and with trade titles like FierceVideo and Beet.tv.\nKey projects for Beltz-Long this year include enhancing Beachfront's contextual signal offering, allowing CTV ad buyers to target and measure by network, genre, and channel. Additionally, she's working on helping data providers apply data-driven deals with CTV publishers, rather than through demand-side platforms, to offer those publishers and data companies more control of their data.\nLaura Foster, vice president of product marketing, Innovid\nFoster leads product marketing for all of Innovid's products, developing both internal and client-facing materials and messaging. She works on positioning Innovid's TV products around big topics in the ad industry like currency, the open internet, and privacy regulations.\nWhen Innovid went public in 2021, Foster crafted the company's messaging for Wall Street. Leading up to the IPO, she helped develop the TV tech firm's tagline, core statement, website, billboards and banner ads, and created presentations for the New York Stock Exchange.\nAnd when Innovid acquired measurement firm TVSquared last year, Foster helped combine the companies with pitch decks for advertisers and helped position the company's combined TV measurement product InnovidXP as a rival to other competing adtech firms. InnovidXP has since won deals with Fox Corporation and The Trade Desk.\nFoster is also involved in ad organizations including ThinkLA, the Coalition for Innovative Media Measurement, and the Performance Marketing Alliance.\nGrant Germano, director of marketing technology strategy, Bloomberg Media\nGermano is building Bloomberg's marketing tech stack. As third-party cookies go away, his work helps the publisher use its first-party data for acquiring subscribers.\nIn the past year, Germano rolled out a customer data platform and a marketing mix modeling approach that tracks the publisher's marketing investments.\nWithin two months of rolling out the consumer data platform, Bloomberg Media's audience match rates increased by more than 500% and customer acquisition costs decreased by 61%, according to Bloomberg Media. Overall, the audiences Germano created have 150% higher conversion rates than other audiences, the publisher said. And the media company's percentage of annual subscriptions compared to monthly subscriptions grew from 13% to 33% since launching in 2022.\nGermano is also an active member of the martech and measurement committees within the trade organization the Association of National Advertisers.\nMichael Greene, svp of global vertical strategy, Criteo\nCriteo in recent years has been trying to shed its image as an adtech firm focused on retargeting by diversifying its offering. Greene joined the company in 2017 and has been a pivotal team member shaping Criteo's retail media strategy, where he works with clients like Best Buy, GroupM, and Lowe's.\nThis year he was a key player in supporting Criteo's acquisition of Brandcrush, an Australia-based startup that manages in-store retail ad campaigns. He's now helping to integrate Brandcrush's capabilities into Criteo's legacy platform. Another big goal this year is to secure more partnerships with last-mile delivery providers, after seeing success with Criteo's partnership with Deliveroo.\nMuch of his work also involves industry education. He's contributed to major reports from Insider Intelligence, Forrester, and IDC about how marketers can navigate the evolving retail media space, plus he's a member of the IAB Retail Media Committee.\nGreene sits on Criteo's Extended Leadership Strategy Committee, a group of 24 leaders and other staffers, to help shape the future of the company. He's a sponsor of Criteo's efforts to seek accreditation from the Media Rating Council for its retail media measurement. Meanwhile, he is a mentor on Criteo's Leadership Journey Program for a dozen high-potential employees.\nRob Hazan, senior director of product, streaming TV, Index Exchange\nHazan leads a team of product managers at the publisher-focused adtech firm Index Exchange, who are responsible for ad products across streaming TV and online video. He also works closely with TV and video publishers to help design new features to help them increase revenue.\nHazan is currently the co-chair of the IAB Tech Lab Security Foundations Working Group and plays an active role in the Tech Lab's Advanced TV Working Group and the Programmatic Supply Chain Working Group. IAB Tech Lab working groups create industry standards and refine areas like measurement and transparency.\nFor example, Hazan collaborated with other IAB Tech Lab members to develop the OpenRTB 2.6 specification. The spec allows connected TV media companies to present their inventory in a more accurate way and give ad buyers more insight about the ads they're buying — such as whether they appear at the start or end of a commercial break.\nHazan is part of the company's \"Index Explains\" program, an external training series where its executives aim to parse and break down the complexities of programmatic advertising. Outside of adtech, Hazan builds and races cars. He also recently completed training to become an instructor to teach the next generation of race car drivers.\nMagda Houalla, director of marketing strategy, Aspire\nSix years ago, Houalla joined Aspire — a company that connects brands with influencers — as its customer success manager. Since then, she's been promoted three times and is currently the company's first-ever director of marketing strategy. In her current role, Houalla works closely with platforms like Meta and TikTok to build best practices and services designed to help brands.\nThis also puts Houalla in a prime position to get the best results from her clients' influencer marketing campaigns. For instance, last year, she worked with big brands like HelloFresh, Brooklinen, and Walmart to build their influencer marketing programs from scratch. Her campaigns have helped the online athleisure brand YogaClub net 15.4 million impressions and $128,000 in \"earned media value\" — a metric that shows how much social media placements are worth.\nHoualla has also taken spearheaded thought leadership. She's demystified the TikTok platform by hosting strategy webinars, and built a consulting service within Aspire so small businesses can work with her or another member of her team to figure out an influencer strategy.\nMandy Hunsicker Adams, senior director of Retail Media+, The Home Depot\nThe Home Depot is one of the many retailers taking the dive into ad-selling, and Hunsicker Adams has helped develop ad products that drove double-digit growth.\nFor instance, she expanded Home Depot's ad products for non-endemic advertisers, or advertisers that don't sell products through Home Depot. She also worked on product offerings for influencers and affiliate marketing. Besides contributing to individual projects, Hunsicker Adams has also rebuilt the way Home Depot's retail media division manages its ad product, and she's developed a multi-year roadmap.\nThere's already a lot on that roadmap in the near term. Currently, Hunsicker Adams and her team are working to expand Home Depot's creative ad offering, like adding video capabilities. She and her team are also looking to push Home Depot-powered ads off its owned-and-operated sites, and to make sure its ads can hit even larger audiences. And they're testing digital activations in Home Depot stores.\nAlex Johnson, senior vice president of data and technology solutions, MediaLink\nJohnson is on-hand to advise C-suite executives at top brands, global media companies, retail media networks, and martech and data companies on developing data strategies and commercial models.\nFor one Fortune 500 beverage brand, for example, Johnson helped the company map out an enterprise strategy for first-party data. That included defining plans for a proof of concept customer data platform and then guiding the brand, a consumer data platform, a tech implementation consultant, and two media agencies through a successful pilot and rollout.\nClient demand for Johnson' deep expertise and knowledge helped MediaLink's data and technology solutions practice grow revenue by 50% year-over-year. This year he is helping more brands transform their precision marketing capabilities, such as by designing a centralized audience intelligence center for a client and by creating a roadmap for one to in-house the company's programmatic, search, and paid social advertising.\nJohnson is a member of the American Advertising Federation's Digital Media Committee, formed in 2021 of 30 industry experts. The committee works to provide AAF members access to an expert think tank, recommendations, and educational content.\nNoah Jones, client services manager, Momentum Commerce\nThroughout 2022, Jones took on some of the toughest tasks at Momentum Commerce, from onboarding new team members to helping two major clients have blow-out success selling on Amazon.\nIn July, he assumed responsibility over the agency's accounts for Lego and footwear company Hey Dude, and Momentum built a team to help him manage these key clients. So Jones had to quickly onboard two new direct reports. Both were new to Momentum, and one didn't have any experience working with Amazon's ad tools. But Jones mentored both and they excelled — so much so that one of his direct reports was even promoted within her first year at the agency.\nLego and Hey Dude also had a lot of success in 2022.\nJones and his team helped Hey Dude have its best year on Amazon, growing sales 78% year-over-year — 9% above its sales target. The success of his work with Hey Dude is one of the reasons why Jones was promoted to manager of client services last October.\nAnd Jones and his team also had to implement some major changes in Lego's Amazon ad strategy. This included creating 1,000 new campaigns for Lego, and helping it find new ways to evaluate the effectiveness of its Amazon advertising. As a result of his efforts, Lego had one of its biggest fourth quarters on Amazon, in terms of revenue from orders that were placed by customers. During that time, Lego's revenue grew 19% year-over-year in the toys and games category, much greater than the 9% growth rate seen by its peers in the same category.\nMark Kennedy, senior adtech sales executive, Amazon Advertising\nKennedy works to drive growth in Amazon Advertising's consumer packaged goods vertical.\nHe's been particularly focused with onboarding clients to Amazon's data clean room solution and has been leading the publication of case studies to showcase how Amazon's adtech and Amazon Web Services can be combined to boost engagement with customers.\nOutside of Amazon, Kennedy runs Glio Leo, a charity that aims to raise awareness of brain cancer and help people who have been diagnosed with glioblastoma. He carried on the charity from his wife, Shelby, who died from brain cancer last year.\nUnder his leadership, Glio Leo has partnered with the Siena College Student Nurses Association for a Catwalk for a Cure fundraiser. The charity also partnered with The Fashion Institute of Technology on a project to design sleek, functional tote bags for people with disabilities and also to raise awareness of Glio Leo.\nSimon Lee, audio marketplace operations director, Triton Digital\nLee wants to make more audio ads available for programmatic buying.\nHe works with Asia-Pacific publishers, including Nova Entertainment and Mediacorp, to connect ad inventory into exchanges. His work helped lift Triton Digital's exchange to grow 50% in 2022.\nIn addition to onboarding media companies to Triton Digital's platform, he helps advertisers make creative and targeting strategies for digital audio ads.\nBeyond radio, he's focused on making ads for music services and podcast networks more programmatic.\nLee is currently zeroing in on emerging markets like Japan, Korea, and Singapore and helping publishers navigate challenges in digital audio like brand safety, privacy, and measurement. He plans to pitch a privacy product that allows publishers to collect listeners' data using consent this year.\nFaye Liddle-Moore, global head of brand studio, Outbrain\nLiddle-Moore leads Outbrain's foray into creative advertising.\nShe works with brands like Audi and Doritos to create custom ad campaigns. Her in-house studio team's remit is broad — from using research like behavioral insights to making creative for brands. For example, Liddle-Moore worked with direct-to-consumer brand Elvie to make a mobile ad that allowed people to swipe and scroll on an animated picture of the brand's breast pump product.\nShe also led a fundraising campaign supporting the recent earthquakes in Syria and Turkey on Outbrain's platform. People who saw the ad could donate to nonprofits like Save the Children International and Unicef USA.\nLiddle-Moore is an instructor for Outbrain's education program Outbrain Academy that teaches marketers about the company's products. She has led courses for more than 7,000 marketers, according to the company.\nBefore heading up the brand studio, Liddle-Moore led Outbrain's UK-based sales team for seven years.\nSam Marc, senior director of addressable solutions, PubMatic\nMarc has achieved a great deal during her three-year tenure at PubMatic. She launched the company's audience business and this year expanded her scope to support all of the company's addressability efforts.\nIn her cross-functional role, in which Marc leads a team of four, she focuses on helping both buyers and sellers of advertising with their targeting and optimization strategies. She also delivers company-wide sales enablement training.\nMarc has played a direct role in developing and promoting PubMatic's carbon-efficient auction packages, which help ad buyers reduce the amount of carbon their ad campaigns produce. This year, she's also helping to grow PubMatic's retail media offering.\nMarc has also represented PubMatic at industry events including AdMonsters Ops, Digiday's Publishing Summit, and IAB conferences. Marc is involved with both the IAB's Addressability and Measurement Committee and its Attention Task Force.\nDan Mayer, VP of media platform, Kroger Precision Marketing/84.51°\nWhen Mayer started at Kroger Precision Marketing in early 2020 to direct its data science division, retail media was still new. Mayer needed to prove that buying ads through Kroger, which was not known as a big ad seller, would actually deliver results.\nAs of July 2022, Kroger Precision Marketing is one of the top three retail media networks, not including Amazon, according to ad agency Tinuiti. \"They've been making major advances, backed by Kroger's loyalty card program that is and continues to be powerful, delivering on accurate and timely shopper insights,\" Tinuiti wrote in a blog post.\nMayer was promoted in August 2022 to his current VP position, where he supervises a new team focused on developing products that can manage ads, provide analytics, and that work across numerous publishers.\nHis mandate for 2023 is to take advantage of the surging retail media opportunity and to allow Kroger Precision Media to expand even further.\nRenee Mok, associate product manager, Roku\nAssociates at Roku are typically early in their careers, and don't yet have the responsibilities of overseeing products. However, it took 26-year-old Mok only a year at the company to become a product lead for the campaign management feature of Roku's DSP, or ad-buying platform. She became the streaming giant's first-ever associate product manager.\nThis was a challenging process, as Roku didn't have any structured programs for staffers who wanted to become associate product managers. Mok has since taken on a leadership role, advising people who want to eventually become product managers themselves.\nMok's mandate as an associate product manager is also large. Every week, about 300 new campaigns are created on this DSP, and Mok has to make sure the platform is effective at handling every aspect of each campaign, from buying the ads, activating them, and reporting on the results.\nMok is also trying to help the TV ad industry acclimate to buying on streaming platforms. She once worked buying traditional linear TV ads, so she is able to tap that experience to assist people who are used to traditional processes — where deals are managed manually — get familiar with buying in a digital environment.\nEllen Mulryan, senior director of retail data partnerships, The Trade Desk\nThe Trade Desk is betting big that it can bite off a sizable chunk of the retail media market, which Morgan Stanley estimates will grow to $130 billion next year, with adtech vendors grabbing $26 billion of that.\nMulryan is working to make sure The Trade Desk can reach its lofty goals. In her current role, she's expanding The Trade Desk's nascent retail media offering, developing solutions that let retailers offer ad products powered by behaviors from their loyalty program members. To accomplish this, Mulryan has brokered partnerships between The Trade Desk and retailers like Sam's Club and Albertsons.\nMulryan is also experienced in product development. She helped Walgreens develop its self-service programmatic offering — which lets advertisers buy digital ads themselves — and its clean room solution — which provides a secure area where advertisers can use a retailers' data to power their ads.\nShe has also helped Dollar General expand its retail media network to make sure brands can reach customers in underserved and rural marketplaces.\nFor this year, Mulryan seeks to deepen The Trade Desk's retail partnerships, and she's hoping to unlock retail advertising in streaming TV environments, so advertisers can incorporate audiences of shoppers in their upfront negotiations.\nCecilia N'zaou, head of product marketing, InMobi\nN'zaou helps app developers make money from lost revenue caused by Apple's App Tracking Transparency privacy update.\nShe leads the product marketing and sales enablement teams that run ads for more than 40,000 app developers, including Activision and Zynga.\nOne way she's helping app developers navigate Apple's privacy feature is with a product called UnifID that allows app developers to work with ID vendors like LiveRamp and ID5 to serve targeted ads. Last year, she led the launch of the product with client pitches and webinars that walked through how the product works.\nN'zaou is currently working on privacy and addressability efforts for publishers in light of upcoming privacy regulations in the US this year.\nBeyond her role at InMobi, N'zaou is part of the diversity, equity, and inclusion board for industry group The Women In Programmatic Network.\nTess O’Brien, VP and head of buy side revenue, Comcast\nO'Brien, an ex-pat from Australia, has had a meteoric rise in the six years since relocating to New York City and working at FreeWheel.\nShe started there in 2016 as a senior associate helping evaluate the company's long-term strategy. Today, she is a VP-level exec, leading a team of 13 people tasked with building the company's buy-side business in the US and cultivating relationships with big holding company agencies and local agencies. This is a crucial initiative for FreeWheel's growth. For years, the adtech company had focused on working with ad sellers; its push to offer technologies and services for ad buyers is much newer.\nEight months ago, O'Brien was charged with overseeing one of FreeWheel's biggest buy-side products in the US, the ad buying platform Beeswax, which it acquired in 2020. O'Brien developed the strategy to bring Beeswax's technology into the FreeWheel organization. And last year, she was a key component in launching FreeWheel's product that lets advertisers plan their buys across both linear and streaming TV.\nO'Brien also places a premium on mentorship. She serves as co-chair of the Women in Advertising and Media resource group at FreeWheel, and she's a mentor at Build NYC, which helps high school students from under-served communities.\nNidhi Patel, US lead of data strategy and martech, EssenceMediacom\nPatel joined EssenceMediacom's data and technology team roughly one year ago, where she was tasked with transforming how the agency's clients could use data to predict which audiences would perform best for their advertising campaigns.\nShe's already proven she can execute.\nFor one big jewelry retailer for instance, Patel built a custom model that improved conversions by 57%, increased return on ad spend by 30%, and decreased the cost of these conversions by 55%.\nShe's also working to improve the skills of staffers at EssenceMediacom. She oversaw the launch of a program in September last year which aims to level up 80% of the agency's media planners so they can execute campaigns using data-driven audiences by the end of 2023.\nPatel is also an active teacher outside of her work at the agency. She mentors young professionals in the Columbus, Ohio area. And she is an adjunct professor in marketing analytics at Franklin University, according to her LinkedIn.\nMarie-Clare Puffett, marketing and insights director, IAB Europe\nPuffett spearheads the European trade organization's frameworks, standards, and programs for developing sectors of the ad industry.\nMost recently, she oversaw the launch of a working group dedicated to helping marketers better understand retail advertising. The group is made up of representatives from 40 companies and is tasked with educating and creating recommendations for how retailers, advertisers, and adtech companies buy and sell retail media. She also worked on a retail advertising report created between IAB Europe and Microsoft that looked at what advertisers are currently doing with retail media and where they plan to grow.\nIn April, Puffett hosted and chaired an IAB Europe event dedicated to retail media that covered topics like measurement and standards for the sector.\nPrior to her work with retail media, Puffett created and led IAB Europe's programmatic trading committee.\nEdward Rozycki, software engineering manager, EDO\nIf video measurement company EDO needs to construct some complicated data system, Rozycki is the person for the job.\nLast year, he built a custom solution for a Fortune 50 consumer tech brand that used AI to identify when and where its video ad campaigns were running. The system automatically emailed the brand's media team when the ads aired. Previously, that team needed to spend hundreds of hours watching TV to verify their ads had been broadcast. Rozycki's solution also flagged when ads ran for a shorter-than-expected time, giving the brand a proof point to request make-goods.\nRozycki also created a solution to record Amazon Prime's \"Thursday Night Football\" and identify ads, so they could be logged the next morning for client reports. This let EDO provide insights extremely quickly. Rozycki also designed and built EDO's ad database that covered the major ad-supported streaming services, including Hulu and Disney Plus.\nThis year, he's looking to build products that expand EDO's measurement capabilities to help clients make their ad spend go even further. For example, he will have to merge data related to creative, media, and audiences to create identifiers EDO's teams can use to get better insight into how ads are performing. One system Rozycki built, called Ad EnGage, will let Disney Advertising know how effective ads are across Disney Plus, ESPN Plus, and Hulu.\nThough only 28-years-old, Rozycki is also an effective manager, and last year, the engineering team he oversees doubled from five to 10 people.\nDeepthi Venkitaramanan, senior product manager, LiveIntent\nVenkitaramanan is helping LiveIntent push into new areas.\nLiveIntent is most known for email marketing tools that allow publishers to sell ads within email newsletters. Venkitaramanan is responsible for developing the adtech firm's identity and resolution products that help publishers match data from anonymized email addresses with web behavior to target ads.\nVenkitaramanan's particular strength lies in her research, scoping, and engineering skills. She spearheads communicating LiveIntent's new products with the industry, and works with engineering teams in Denmark and Germany. She is also a member of the Interactive Advertising Bureau's Prebid Addressability Group.\nIn the past year, Venkitaramanan's work has included a framework that allows publishers to pull together the IDs that they work with. She also helped launch an app on Salesforce's AppExchange that allows publishers to check the accuracy of customer data.\nVenkitaramanan is currently working with LiveIntent's machine learning and data science teams to find ways to improve the performance of email marketing campaigns and is researching how LiveIntent's technology may plug into customer data platforms and mobile measurement partners.\nJack Watt, adtech product manager, Minute Media\nWatt is building out Minute Media's in-house adtech.\nIn the past 18 months, he has helped build a supply-side platform that allows publishers to sell programmatic ads directly from Minute Media, which owns web properties like The Players' Tribune, Mental Floss, and 90min.\nMinute Media also sells adtech to other publishers. Since launching its supply-side platform in September, Watt has helped onboard more than 130 publishers to the product. He helps market Minute Media's technology to other adtech companies like demand-side platforms that advertisers use to buy ads.\nWatt is constructing an internal ad server for Minute Media that is planned to roll out during the fourth quarter and connect with the company's video ad buying platform.\nHannah Williams, impact manager, Good-Loop\nGood-Loop encourages viewers to watch video ads by having brands donate to charity once the ad is over. Williams works to onboard Good-Loop's charity partners and assess the value the company brings to them.\nWilliams has been a close partner to The Nature Conservancy, for example, helping to activate ad campaigns that have driven more than $600,000 in donations to the charity.\nWilliams has also played a key role in developing Good-Loop's green media technology. She produced research that led to the creation of Good-Loop's Green Ad Tag, which allows advertisers to measure and reduce the carbon emissions produced by their online advertising.\nA key focus for Williams this year is working on reducing Good-Loop's own carbon footprint and working to establish a path for it to become a net-zero company. She's also leading efforts to review the Good-Loop's policies and procedures to ensure the company is accountable for its campaigns and to avoid so-called greenwashing or purpose-washing.\nKristen Williams, svp of strategic partnerships, Magnite\nWilliams is responsible for leading the team responsible for growing relationships with tech vendors across identity, data, measurement, and attribution. She has a cross-functional role and participates in several working groups inside and outside the company, including the Coalition for Media Measurement and the TV Data Initiative.\nWilliams was involved in Magnite's 2022 acquisitions, the measurement platform Carbon and the cryptographic software company Nth Party. She also played a key role in brokering Magnite's multi year deal with LG Ad Solutions, to give Magnite's ad buyer clients access to automatic content recognition data from opted-in LG smart TVs in the US.\nWilliams' team, which has doubled in the past year, are expanding Magnite's measurement and attribution program, certifying Comscore, iSpot, Nielsen, Innovid, and VideoAmp as currencies to be used across Magnite's connected-TV inventory.\nLooking ahead, Williams is going to focus on building out Magnite's audience solutions in preparation for the death of the third-party cookie. She will be particularly looking at developing Magnite's clean room compatibility and determining how data from these privacy-focused environments can best be activated.",
  "word_count": 5055,
  "scraped_at": "2026-02-14T12:02:53.857604"
}