{
  "article_id": "8dc592116cb9",
  "url": "https://www.justarsenal.com/how-positive-are-you-feeling-that-arsenal-women-can-win-the-wsl-for-the-1st-time-since-2019/360517",
  "title": "How positive are you feeling that Arsenal Women can win the WSL , for the 1st time since 2019 ? ",
  "date": "20240220T210000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Our Arsenal Women have played 14 games this season and have 8 more to play in the Barclays Women’s Super League. With Chelsea sitting on top of the table and Manchester City following closely behind them on equal points, it does leave Arsenal fans questioning if we can still win the WSL this season.\nArsenal currently sit in 3rd place on 31 points, while Chelsea and City are sitting on 34 points, with Chelsea only on top due to goal difference. It doesn’t seem like a lot of points to make up, and being just a win away should excite Arsenal fans because with football, obviously anything can happen! Considering how well both Chelsea and City have performed this season, it does leave us on the outer and waiting for a result to go our way.\nChelsea lost to Manchester City at the weekend, bringing us and City that much closer to the title holders. Chelsea have obviously been the team to beat this season, but after our win against Manchester United this weekend, we’re back in a position where just two games could change the whole season.\nWe face off against London rivals Tottenham next weekend in what could be a massive game for us. If we can manage to take away the three points, we then face off against Chelsea at Stamford Bridge, in a game where we could minimise the gap, and hopefully push for the title.\nObviously a lot can happen in football and we’re not only relying on our own results, but the results around us to go our way too. But Arsenal Women a great side who have showed they can produce in the big games, and from now on, every single game has to be looked at like a final and we can’t lose any points.\nHopefully the win against United brings us the confidence we need to keep pushing, and although it’s going to be a hard road, and a difficult 8 games remaining, we are definitely still in with a chance to go all the way. Eidevall has got our women playing well together and, with goals coming from all over the pitch, we could creep up behind Chelsea and City and make a stride to the top.\nIt’s been a long time since we won the League but for me, it feels like our year, and that might be a bit bias of me, but I think we have the right side and the right people in charge to do it this year. We’ve got more than enough quality to go forward and, as I said, it will be hard but I have 100% faith we can do it.\nWhat’s your thoughts Gooners? Are you feeling positive?\nDaisy Mae\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 490,
  "scraped_at": "2026-02-14T12:22:26.421734"
}