{
  "article_id": "8dc8663959c7",
  "url": "https://www.bbc.com/news/articles/c3d49y5k30ko",
  "title": "Guinness World Record : Irish footballer sets longest throw - in",
  "date": "20250509T123000Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Irish footballer breaks longest throw-in world record\nRepublic of Ireland international Megan Campbell said \"anything is achievable\" after she broke the Guinness World Record for the longest ever throw-in by a female footballer.\nThe London City Lionesses player set the new record at 37.55m.\nThat is over two metres further than the original record of 35m and 10m longer than a blue whale.\nThe Irish international said her new record \"shows there are no barriers\".\n\"If you have a goal and you have a mindset to want to go out and achieve that, then it's possible.\"\nLongest Throw In - Guinness World Records\nAllow Google YouTube content?\nCampbell took on the challenge of throwing past a mannequin placed 35m away at her London City Lionesses training ground in Kent.\n\"To get the opportunity to be able to have a certificate to say I can throw the ball really far is quite cool. I'm honoured.\"\n\"It's an amazing achievement for me personally to have that now, as the first ever\", she told Guinness World Records.\n\"You've got to be someone that people can look up to and want to achieve things from, so of course I want someone to go on and beat my record\", she added.\nShe said her throw developed when she was in her early teens, playing for a boys' team and even then it was longer than her teammates.\n\"When I come up against an opponent now, it's no secret I have a long throw\", she joked.\nCampbell has represented Manchester City, Liverpool and Everton and has over 50 caps for the Republic of Ireland.\nAt the start of May, she helped her side, London City Lionesses, win promotion to become the first fully independent women's club to play in the Women's Super League, the top division in England Women's football.\n\"I think female football at the moment is on the rise. It's an upwards trajectory and I don't think there's a ceiling.\"\n\"From when I was a kid to now, the game has changed dramatically.\"\nIn a post on social media, she wrote: \"A @GWR holder.... Crazy\".",
  "word_count": 351,
  "scraped_at": "2026-02-14T12:43:28.346882"
}