{
  "article_id": "8dd68e329a99",
  "url": "https://www.themaneland.com/2023/1/20/23564566/the-state-of-the-mane-land",
  "title": "The State of The Mane Land",
  "date": "20230120T224500Z",
  "domain": "themaneland.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Uncategorized\nThe State of The Mane Land\nToday was a difficult day for The Mane Land. As many of you may know, Vox Media reportedly laid off 7% of its workforce today due to “economic downturn” and the casualties included most of SBNation’s NHL sites and all MLS blogs and nearly — if not all — of the network’s soccer podcasts. These cuts should not affect our coverage between now and the end of February, however, after that things are a bit more murky.\nI started The Mane Land as a free WordPress site back on Sept. 23, 2014 and we moved to SBNation officially on Nov. 24, 2014. We gained the trust of SBNation management back then with our quick growth in pageviews and on social media, and that trend has continued in our more than eight years of existence. In that time, we have added coverage of the NWSL’s Orlando Pride and the club’s developmental team, Orlando City B. We added a podcast to our offerings on Dec. 4, 2014, which I hosted in the beginning with Andrew Marcinko. We had 20 different combinations of hosts in our first 70 episodes, but the last 252 have been hosted by myself and David Rohe.\nWe have had 90 people who have been part of our staff over the years either as writers, editors, photographers, graphic artists, social media managers, or moderators — or some combination of those roles. Some of those people have gone on to work for the club we cover regularly. Some have gone on to become communications professionals for NWSL teams or writers for the Orlando Sentinel, Soccer By Ives, or the MLS website. I’m very proud that our little blog played a role in those folks landing such great and exciting gigs.\nThe reason I started this site was to express my passion for Orlando City SC and to meet and exchange thoughts, ideas, and arguments with others who shared that passion. While that mission has been realized, with thousands of social media followers and daily readers of this website, and lots of friends made along the way, it has not concluded. That mission still exists.\nMy intention is for The Mane Land to continue. I have no idea at the moment what that will look like, but there are some options and I’ll begin that journey in a few days, after taking some time through the weekend to process today’s events. This includes the continuation of The Mane Land PawedCast. It appears, at least at the moment, that Vox is going to be cool about letting us keep the name we created. This is important to me, because I not only named our site (prior to joining SBNation), but also Minnesota United’s site, E Pluribus Loonum, bears the name that I suggested in our SBN Soccer Slack chat, so I’d like those to live on.\nWhat I can tell you right now is that I have a worst-case scenario in mind to continue covering Orlando City, the Orlando Pride, and OCB as best we can. My hope is that all current TML staff come along with me, but if today has taught me anything, it’s that anything can (and does) happen. We also plan to keep our current social media channels on Twitter and Facebook as they are now, although a new logo is likely going to be needed.\nAt some point, when it is appropriate, we will make an announcement about the future of The Mane Land and The Mane Land PawedCast. I hope to have that in place by the middle of February.\nJust in case this whole thing implodes, and we are never heard from again after Feb. 28, I wanted to thank every single person who has read a story on this website, listened to an episode of the PawedCast, left us a comment, sent us an email, met up with us at, before, or after a match, followed us on social media, or somehow interacted with us in any way I haven’t yet mentioned. You have no idea what it means to me, or to all of us.\nWhile SBN has paid me a modest monthly stipend through the years, it hasn’t begun to cover the hours I’ve spent trying to make this the best Orlando City website I possibly could, and most of our staffers are completely voluntary. I’ve kept at it (and I assume the other TML staffers have, too) because I still have that same passion for telling the story of Orlando City SC. I still love discussing the club, sharing the stories behind the matches, the coaches, the players, etc. I would do this (and have done it) for free. It would be a lot cooler if I didn’t have to, but we’ll see where it goes.\nSo, the question I’ve been asked repeatedly today is: “Is there anything I can do to help?” And the answer is that I’m not sure, but it’s very likely that yes, you can. The simplest solution for us is to just find a new host and hope we get control of the domain name at the end of February or slightly alter our domain. Domain registration and hosting and podcast hosting don’t have to be expensive, but there is still some expense involved and, more importantly, there’s the loss of income on top of it.\nAs I said, it’s a modest stipend (and some of our contributors get even less), but it’s still something, so going from a net positive to a negative isn’t a great option. To that end, we may end up doing something like a GoFundMe to pay for it or have a Patreon subscription section or some kind of “tip jar” — such as Buy Me a Coffee — to help offset costs. That’s where you can help (if it comes to that). Alternately, if you own a business, especially here in the Orlando area, and you’d like to advertise with us on the podcast, at our new home, or both, we can certainly talk about what that might look like, and it’s a business expense. So, there are some things folks can do to help.\nIn all honesty, one of the biggest pain points about ending our time at SBN is image licensing. So just having folks join us as photographers would help.\nThanks again for your support, understanding, and patience. We’ll get word to you about our next steps as soon as we have something to report.\nI need a beer.\nPodcasts\nPawedCast Episode 515: Orlando City Transfers, Preseason Schedule, OCB Signings, and More\nWe’re back to discuss Orlando City’s transfer news and rumors, OCB roster additions, and the preseason schedule.\nOrlando City has gathered for preseason camp ahead of the 2026 season, and we’re still here to talk about it. How long that continues to be the case may unknown at this point, but we’re trending in the right direction, so if that continues, you’re stuck with us for a while longer.\nThe Lions have had various comings and goings since our last show, and we discuss the movement in and out of the roster. We thought Carlos Coronel was going to be the new Orlando City starter in goal, but he fled to Brazil, so we welcome Canadian international Maxime Crepeau to the City Beautiful. It’s not as splashy an addition, but it could be just as effective a roster move if he can regain his form from his Vancouver and LAFC days.\nWe also discussed the additions of Tiago, Luis Otavio, and Braian Ojeda. On the other hand, departures took place as well, such as Nico Rodriguez being loaned to Atletico Nacional and the reports that Luis Muriel may be finalizing a deal to move on. We chatted about what those moves mean in the grand scheme of things. Kyle Smith went home and we are glad he’s still playing but sad to see him in another team’s uniform.\nThe preseason schedule was a bit underwhelming, but we ran through it quickly.\nOur mailbagbox was a little light, and it proved to us how little we know about the Polish national team. Remember, if there’s anything — and we do mean anything — you want us to address on the show, just ask us by tweeting it to us at @TheManeLand with the hashtag #AskTMLPC, or hitting us up on Bluesky Social with that same hashtag.\nFinally, we talked a bit about the recent moves OCB has made, including the addition of a Brazilian striker. Former OCB forward Shak Mohammed is off to Nashville, while OCB/OCSC left wing Yutaro Tsukada showed up to preseason camp with a wedding ring. Congrats to Yutaro!\nNote: we are now in our off-season podcast schedule, which is guaranteed to give you at least one episode per month but we will only be weekly if/when news warrants it. We’ll also return for at least one more show to say goodbye if things don’t work out for us to continue, but we are hoping it doesn’t come to that!\nBe sure to rate and review our show wherever you get your podcasts. Remember, we’ll read any five-star reviews we get on Apple Podcasts on the next show.\nIf you’d like to support our independent writing and podcasting efforts, we’d love to have you as a subscriber or donor over at our Buy Me a Coffee site.\nHere’s how No. 515 went down:\n0:15 – An update on our staffing crisis is more hopeful than the last one, and we go through the various arrivals and departures.\n30:16 – The mailbagbox seeks help for Orlando City from Poland and wants to know which position we’d least like to see the club make a Designated Player signing.\n41:52 – OCB news, a new home for Shak, and Tsukada ties the knot.\nUncategorized\nA Few Words About the Future of The Mane Land\nTML needs help to continue bringing you coverage of Orlando City, the Orlando Pride, OCB, and all things soccer related in the City Beautiful.\nFor the last 11 years, The Mane Land has worked hard to provide daily content telling the story of Orlando City SC, the Orlando Pride, OCB, and any other soccer-related events we can get to in the Central Florida area. We love doing that, but we’re at a critical stage in being able to do so. Staff has been difficult to replace in recent years, and we’ve come to a point where some of us have not only been stretched to an unsustainable limit, but we’ve been going at that rate for multiple years without a break.\nTo that point, TML is now at a critical juncture where we must have more contributors who can cover live events in order to survive in our current format (and possibly at all). For the past few years, we have had only two primary game night writers covering three teams, and we are unable to continue at that pace, regardless of how much we enjoy doing it.\nTo continue as an entity, we’re going to need anywhere from two to four new contributors who can pitch in with game-night coverage of Orlando City/Orlando Pride matches. Additionally, another copy editor is essential, while two more would be preferred.\nWe’d like to continue into 2026, but if we can’t get the additional help we need, the current plan is to shut down at the end of the 2025 calendar year. The minimum we need to carry on would be two new live event writers and a copy editor.\nWhat does this mean? Well, if you’ve ever thought it would be cool to cover soccer matches (it is) or thought about joining us, now is the time to volunteer. If you enjoy soccer and talking about this club with your friends, you might be perfect for our team, because if you can talk about soccer, you can probably write about it as well. Writing is just talking on a screen with your fingers, after all.\nTo get started, please write to us at themaneland@gmail.com and let us know how you’d like to contribute — writing, editing, etc.\nIt is important to note that we do this out of a love for the beautiful game and these positions are on a voluntary basis. However, if freed from the shackles of such an overwhelming schedule, my goal is to spend more time creating strategic partnerships and promoting our membership platform that could combine to bring in revenue that would go toward compensating staff writers. Additionally, some of our staff members have gone on to more financially rewarding opportunities as a result of their time with us. You never know what this experience will lead to. Like anything else in life, you’re likely to get out of it what you put in.\nThe good news is that we have already reached out to our Founders and our Buy Me a Coffee subscribers about this subject, and several have shown an interest in helping, so we are in the process of exploring those potential contributors at the moment.\nWe Are Currently Seeking:\n- Match writers – You don’t need a degree in journalism or English to write for us. If you like to talk about soccer, you can probably write about it as well. Staff writers contribute regularly to our game coverage, which could be in the form of recaps, player grades pieces, five takeaways posts, etc. We have a need for this on both the Orlando City and Pride sides, and you can do both if you want. If you’re not local to the Orlando area, you can cover road matches via the broadcast/stream.\n- Editors – Can you spot a subject/verb disagreement from a mile away? An editor position may be for you! How often do you get to correct people without anyone shaming you for it? This position will edit copy for submitted stories, make headlines punchier and more SEO-friendly, and ensure the story has a properly cropped/centered photo that helps tell the story. Typically you’ll only be on “desk duty” one or two evenings per week when it fits your schedule. You may also write stories if you wish!\nAbout TML\nOur little blog became an idea and then an independent WordPress site in late September of 2014, and went live on SBNation in December of that year. When SBNation stopped funding nearly all of its MLS blogs a few years ago, we went independent again, and we’ve long been the only outlet providing daily coverage of Orlando City’s teams. Even the club doesn’t post new content to its website every day!\nFAQ\nWhy shutter the site at the end of December? Why do you need help now when the season doesn’t start for a couple of months?\nPreparing to cover three teams requires advance planning. Each year, we put together a publication schedule to ensure all our bases are covered. This includes what will run (a placeholder or sometimes the specific piece) on every day of the year, which obviously doesn’t take into account breaking news or extra features that people want to do. Setting up this publication schedule also includes noting when major soccer events are coming, known USMNT/USWNT scheduled matches, MLS and NWSL deadlines, player birthdays, important milestones and anniversaries, and more. We also put together volunteer sign-up sheets for grades and takeaways posts. That setup work is all for naught if we don’t have the bodies to physically cover the team when the season starts. Also, it’s easier to pull the plug on our LLC at the end of a calendar year. None of us want to stop, but we have to be realistic about being able to continue covering the team as we have.\nWhy not just scale back and cover what you can? Do you have to cover every game?\nI don’t have a good answer for this other than I would not feel right about putting my name on a product I don’t believe in. I don’t ever want our audience to have to guess whether or not they’re getting a game recap or any follow-up analysis from a given match. In my opinion, we have never had the personnel to fully provide what I envision. For example, I want to add more video content, player grades and recaps for the Pride games, and to bring back weekend Lion Links and OCB match previews. And we should have a lot more features and analysis pieces! In short, we’re already doing the bare minimum that I’m comfortable with. And, I have to be honest: if there was a game coming up with no one to cover it, knowing me, I’d probably just do it myself, and I already know I can’t continue the pace of the past few years. I have to save me from myself sometimes.\nCould The Mane Land continue in a different form?\nI have toyed with the idea of turning TML into a newsletter. This might be a daily that includes a Lion Links-type section and opinion/analysis of club news. It would not include match coverage or any kind of regular news. I almost pivoted to that when SBNation stopped funding us, but we decided to make a go of it as an independent outlet. The problem with the newsletter style is that I can’t do it daily every single day or it would be no different than the situation I’m in, so some help would still be needed. Some of that could come from the current TML staff, but I’m not sure all of it could, and the newsletter format is not for everyone, so we’d be leaving part of our audience behind. I’m not sure it’s the way to go.\nIs new management or investment needed?\nPossibly. I am willing to sell the name and logo and turn over all our passwords for someone else to take over the operations, which would free up a considerable amount of my time. I’m even willing to continue on as a writing and editing contributor, because I love covering the club. Some of the other staff might as well. But I would not be interested in covering every single match. I’m not a kid anymore, and I have a regular job, a family, and other side gigs that require my attention.\nWill you still do the podcasts if the site shuts down?\nNo. I think if we decide to shut down, it will be across the board. I much prefer our written content, and that’s the reason I started our outlet to begin with. I feel the podcasts complement our coverage and give us more of an opinion platform and a way to discuss matches in a deeper, richer way, but I’m not interested in doing only the podcasts. That said, others on our staff might want to continue and I’m OK with that.\nContact us at themaneland@gmail.com today to get started as a new contributor!\nPodcasts\nPawedCast Episode 506: Cincinnati Rewind, OCB-Carolina Core, Columbus Preview, and More\nThe Lions claimed a late draw at Cincy and now host Columbus while OCB’s playoff hopes hang by a thread.\nOrlando City left it late again. Tyrese Spicer reprised his role from the Nashville game by providing the assist for a goal late in stoppage time, but this time it was a different goal scorer and a road draw instead of a home win. Alex Freeman played great against FC Cincinnati, so it was fitting that he literally pulled a point out of thin air on a Sunday night that saw the Lions squander numerous good opportunities to score while allowing the hosts only one Kevin Denkey strike.\nWe look back at the key moments, players, and plays of a critical road match, check our score predictions, and make our selections for Man of the Match, splitting the vote\nThis week’s mailbagbox asked us a pair of trivia questions and added an individual question for each host. Remember, if there’s anything — and we do mean anything — you want us to address on the show, just ask us by tweeting it to us at @TheManeLand with the hashtag #AskTMLPC, or hitting us up on Bluesky Social with that same hashtag.\nOCB got two points at Carolina Core FC when it needed three, but it did enough to stay alive in the postseason race but there is no margin for error. The Young Lions fell behind by two goals, battled back to get level, conceded again, and once again equalized on the road. Carlos Mercado then helped his team win the penalty shootout on his birthday to claim the extra point. OCB must beat FC Cincinnati 2 on Sunday at home and get help to reach the postseason.\nFinally, Orlando City returns home with another game against a good team from the Buckeye State, as the Columbus Crew visits Inter&Co Stadium on Saturday. Whether Diego Rossi plays or not, the Crew are always a difficult opponent. We break down the series history, look at the battle ahead, provide our key matchups, and make our predictions for the final score.\nBe sure to rate and review our show wherever you get your podcasts. Remember, we’ll read any five-star reviews we get on Apple Podcasts on the next show.\nIf you’d like to support our independent writing and podcasting efforts, we’d love to have you as a subscriber or donor over at our Buy Me a Coffee site.\nHere’s how No. 506 went down:\n0:15 – Orlando City didn’t seem to want to put the ball in the net, but maybe that’s because it wasn’t yet the death of stoppage time. Earlier goals are OK too, guys!\n27:55 – The mailbagbox offers trivia, but no prizes if we get them right.\n39:11 – OCB was listening to Meat Loaf and thinking two out of three ain’t bad, and the senior Lions prepare for Columbus.\n-\nLion Links2 weeks ago\nLion Links: 1/30/26\n-\nOrlando City1 week ago\nThe Orlando City Off-Season Blues\n-\nOrlando City2 weeks ago\nOrlando City’s Defensive Unit Primary Concern Heading Into Regular Season\n-\nLion Links1 week ago\nLion Links: 2/4/26\n-\nOpinion2 weeks ago\nLikes and Dislikes from the Third Week of Orlando City Preseason\n-\nOrlando City1 week ago\nOrlando City Preseason Notes: Jansson Undergoes Surgery, Lions Sign Nolan Miller\n-\nLion Links2 weeks ago\nLion Links 2/2/26\n-\nLion Links2 weeks ago\nLion Links: 2/3/26",
  "word_count": 3750,
  "scraped_at": "2026-02-14T12:23:50.444253"
}