{
  "article_id": "8dec3864ab15",
  "url": "https://www.justarsenal.com/arsenal-v-southampton-match-preview-predicted-lineup-and-score-prediction/392979",
  "title": "Arsenal v Southampton : Match preview , predicted lineup and score prediction",
  "date": "20250525T163000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal will be on the road for the final time this season as they head to the south coast to take on Southampton. It is the final day of the campaign, so the Gunners will be hoping to end on a high. This match will bring the curtain down on what has been a disappointing season by our standards. Nonetheless, Arsenal will go in search of their first win at St Mary’s since January 2021.\nA win is frankly expected against a side that has amassed just 12 points all campaign. The game itself is without jeopardy as UEFA Champions League football is already guaranteed for Arsenal. However, Arsenal have the opportunity to break a century-long record this afternoon. If they manage to emerge victorious, they will become the first team to register 14 consecutive final-day victories in the English top flight. They are currently level with Liverpool at 13, with the Reds setting the record between 1907 and 1924. Arsenal’s streak began at the end of the 2011-12 season and they now have the opportunity to become outright holders.\nOpportunity for history and clean sheet glory\nDavid Raya will also be hoping for a clean sheet. He is currently level with Forest’s Matz Sels at 13 and will aim to win the Golden Glove consecutively.\nDate: Sunday, 25th of May\nKick off: 4 PM (UK time)\nVenue: St Mary’s Stadium, Southampton, Hampshire, England\nReferee: Darren Bond\nVAR: James Mainwaring\nTeam news\nMikel Arteta will be boosted by the return of Mikel Merino. The Spaniard will be available after serving a one-match ban last time out. One player who will miss out, however, is William Saliba. The Frenchman picked up a hamstring injury against Newcastle and will sit out the final game of the season. Jurrien Timber will also be absent after undergoing ankle surgery during the week. Arteta himself will serve a touchline ban after receiving his third yellow card of the season.\nPredicted lineup\nKai Havertz made a surprise return last week from the bench. With Merino back, Arteta will need to decide between the two, and possibly even Leandro Trossard, on who leads the line at centre-forward. Saliba’s absence means we will likely see the left-footed duo of Riccardo Calafiori and Jakub Kiwior at the heart of defence. Overall, Arteta is expected to go strong as Arsenal aim to finish the campaign positively.\nPredicted XI:\nDavid Raya\nBen White\nRiccardo Calafiori\nJakub Kiwior\nMyles Lewis-Skelly\nThomas Partey\nMartin Ødegaard\nDeclan Rice\nLeandro Trossard\nKai Havertz\nBukayo Saka\nScore prediction: 4-0 win for Arsenal\nDo you think we’ll get the win today Gooners? It would be nice to end the season on a high, especially after Arsenal Women won the the Champions League yesterday!\nCOYG!\nBENJAMIN KENNETH\n_____________________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 534,
  "scraped_at": "2026-02-14T12:50:21.558202"
}