{
  "article_id": "8df6c71a2f75",
  "url": "https://www.irishmirror.ie/whats-on/music-nightlife-news/irish-gig-guide-alternative-eurovision-32782498",
  "title": "Irish gig guide : The Alternative Eurovision , Annie Mac & Toddla T and all of this week biggest gigs",
  "date": "20240510T171500Z",
  "domain": "irishmirror.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Irish gig guide: The Alternative Eurovision, Annie Mac & Toddla T and all of this week's biggest gigs\nWe preview all of the must-see concerts and music events being held around Ireland over the coming days\nWe look ahead to all of the biggest gigs taking place around the country over the week ahead, including a star-studded gig being held in protest against the participation of Israel in this year's Eurovision, along with an arts festival held in one of Dublin's 'coolest neighbourhoods'.\nShine on Palestine: The Alternate Eurovision\nAxis Ballymun and Leisureland Galway, Tonight, €15 (Ballymun); €35 (Galway)\nEurovision has traditionally been a huge LGBTQ+-friendly celebration in the calendar, and the song contest has really leaned into the camp and spectacle in the last decade or so — making this event even more poignant and powerful.\nHosted by drag icon Panti Bliss in Dublin, Shine on Palestine is a protest against the participation of Israel in the event in light of the ongoing slaughter in Gaza.\nIn Dublin, artists include Amir Abu Alrob, Catherine Ann Cullen, Zapho, Niyl, Tobi Balogun, Sive, Jess Kavanagh, Sorcha Fox, and many others, with speakers including MEP Clare Daly.\nThe Galway event is hosted by leading LGBTQ figures XNTHONY and Breda Larkin, with artists including Sharon Shannon, Mundy, and John Spillane, joining in the coast-to-coast support for Palestinian culture and resistance.\nIf you can’t make either of the gigs, the event will be live streamed during the TV Eurovision broadcast.\nPhizzfest\nVarious venues, Dublin - Tonight-Sunday, various prices\nPhibsboro in Dublin’s northside has featured a few times in Time Out as one of the world’s coolest neighbourhoods, for “combining old-school charm and contemporary buzz… feeling at once lived-in and lively”, mentioning its coffee shops, pubs and restaurants, snooker halls, sporting history and community spirit.\nThat community spirit has been shining through since 2009 at Phizzfest, the annual arts festival that celebrates local creativity.\nAs usual, this year’s festival features music, theatre, literary events, film, talks and workshops. And given local team Bohemians’ impact in sport and culture, there’s an embedded Festival of Football History that includes talks, guided tours and exhibitions.\nMusic-wise, there’s a night of electronic music at the Bernard Shaw, Phibsborough Bopping Centre, while the Shaw also hosts a Brazilian dance party.\nAll Saints Parish Church welcomes the faithful for a few highlights, including art-rockers Fizzy Orange and Ireland-based Syrian musician Mohammad Syfkha, one of the year’s most acclaimed artists.\nIf the church isn’t even intimate enough, Phibsborough Bopping Centre Acoustic Sessions at The Hut will be an even nicer chill.\nAlso on the programme, the Charro event features traditional Mexican songs, and REIC blends music and poetry.\nSee Phizzfest.ie for the full programme.\nGodflesh\nThe Academy, Dublin - Saturday, €33.50\nDolans, Limerick - Sunday, €33.50\nFor the last 35 years, the punishing sound of Godflesh has petrol bombed its way into all forms of extreme music, influencing industrial metal, noise, dark dub and abstract hip-hop.\nJustin Broaderick, C.G. Green and their panel-beating drum machines and sample banks emerged in 1989 with their debut album Streetcleaner, a blast of caustic riffs and nihilistic blasphemy and rage, channelling Ministry, Swans and bad comedowns.\nThey’ve been creating this colossal mechanised industrial onslaught, with the odd side step into live drums and hip-hop touches, but always drilling into toxic depths.\nOn recent albums Post-Self and A World Lit Only By Fire they explored some dirgy shoegaze elements, but on 2023’s PURGE, they’re back to nerve, shredding noise, with ALL CAPS song titles like LAZARUS LEPER and YOU ARE THE JUDGE, JURY AND EXECUTIONER.\nEar plugs for this one, or face a very hissy white noise wake-up call next morning.\nRoad to the Great Escape\nVarious venues, Dublin - Monday-Tuesday, €16 per venue per night (two-day passes sold out)\nThe Great Escape in Brighton is one of the UK’s premier showcase festivals for emerging, buzzworthy acts — a model that Ireland Music Week has embraced and adapted in recent years.\nIt’s a chance to see bands up close in smaller venues, with a concentrated hype machine fuelled by managers, bookers, PR agents, and journalists hoping to discover the next big thing.\nEven more pared down, The Road to the Great Escape is a more bite-sized preview sample of acts at the main TGE. The music this year is spread across Whelan’s, Grand Social and Workman’s Club, with a mix of Irish and international artists.\nIrish acts include folk trio Amble, singer-songwriter Sarah Crean, Irish-Italian indie-pop act Big Sleep.\nThe global scene is represented by Australian pop-duo Cat & Calmell, Chinese-Vietnamese-British rapper Jianbo, Birmingham indie act Overpass and New Jersey singer-writer-producer Joe P.\nTickets to Road to the Great Escape are available on Ticketmaster.\nAnnie Mac & Toddla T postmatch after-party\nMono, Dublin, Wednesday, €40 (match ticket)\nPhibsborough’s Bohemian FC have become way more than a soccer club in Dublin, notably in the last few years being vocal social justice activists and celebratory cultural historians.\nTheir one-off jerseys go viral on launch, highlights including the Bob Marley jersey to mark his only Dublin gig at Dalymount Park, as well as Thin Lizzy and Fontaines DC jerseys, the ‘Refugees Welcome’ top and one created from the infamous Dublin Bus upholstery pattern.\nNext week marks their biggest gesture in years — inviting the Palestine women’s team for a friendly against Bohs on the 76th anniversary of the Nabka, the forced expulsion of 750,000 Palestinians during the 1948 Arab-Israeli war.\nThe game doesn’t stop after the final whistle, as Bohs are also throwing a party in their bar Mono, featuring a back-to-back set from Dublin DJ and BBC Radio One legend Annie Mac and her DJ and producer husband Toddla T.\nAnnie Macmanus spent many years breaking the biggest dance scene records on Radio One, while touring and curating international festivals, but has recently launched her Before Midnight early clubbing project.\nToddla T is also a Radio One DJ who’s also worked on many underground albums, including his own projects, and with artists like Roots Manuva, Roisin Murphy, Stormzy, Skepta and Hot Chip.\nDespite Annie’s rebranding, something tells me this one will go on way after midnight for some.\nMatchday tickets, which grants you access to the co-DJ set in the Mono Bar after the final whistle, are available on Bohs' website here.\nSign up for our daily newsletter to get the latest news direct to your inbox\nJoin the Irish Mirror’s breaking news service on WhatsApp. Click this link to receive breaking news and the latest headlines direct to your phone. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice.",
  "word_count": 1132,
  "scraped_at": "2026-02-14T13:39:50.795531"
}