{
  "article_id": "8e200dd5a7e3",
  "url": "https://bleacherreport.com/articles/10085808-australia-vs-france-top-storylines-odds-live-stream-for-womens-world-cup-2023",
  "title": "Australia vs . France : Top Storylines , Odds , Live Stream for Women World Cup 2023",
  "date": "20230811T143000Z",
  "domain": "bleacherreport.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Featured Video\nHarper's Rising Stars Game-Winner 🔥\nAustralia vs. France: Top Storylines, Odds, Live Stream for Women's World Cup 2023\nThe marquee matchup of the 2023 FIFA Women's World Cup quarterfinals pits co-host Australia against France on Saturday (3 a.m. ET, Fox, FoxSports.com and Fox Sports app).\nBoth sides cruised into the final eight with multi-goal victories over Denmark and Morocco.\nAustralia produced six goals in the last two games, even with star forward Sam Kerr dealing with a calf injury.\nFrance put away 10 tallies in its last two contests to reach the final eight, and it looks like a squad who could hoist the country's first major women's title.\nBoth sides are after their first World Cup title, but each nation will have to go through three battles to hoist the trophy. England likely awaits in the semifinals and then Spain or Sweden will advance to the final from the top half of the bracket.\nMatch Odds\n1 of 3Money Line\nAustralia (+260; bet $100 to win $260)\nFrance (+110; bet $100 to win $100)\nDraw After 90 Minutes (+215)\nTo Advance to Next Round\nAustralia (+140)\nFrance (-175)\nOver/Under\nOver 2.5 Goals (+130)\nUnder 2.5 Goals (-160)\nFrance Enters in Terrific Form\n2 of 3France is cruising at the moment.\nLes Bleues scored six goals on Panama in their Group F finale and they rolled four tallies past Morocco in the round of 16.\nThey have a Golden Boot contender in Kadidiatou Diani, who is tied with Sweden's Amanda Ilestedt for four goals. They are the highest scorers left in the tournament. Japan's Hinata Miyazawa produced five goals before Japan's quarterfinal elimination.\nThe presence of Eugenie Le Sommer, France's all-time leading scorer who has three goals in the tournament, alongside Diani will be a lot for the Australian defense to handle.\nFrance has one of the best set-piece threats in the world in defender Wendie Renard, who has 35 international tallies.\nFrance has not made it past the World Cup quarterfinal since 2011, and it only has one other major tournament semifinal appearance from UEFA Euro 2022.\nLes Bleues are in the best form of any team in the bottom half of the bracket, and if they continue their performances from the last two games, they could be too much for Australia to control.\nSam Kerr's Status to Be Determined\n3 of 3Australia needs its star player, Sam Kerr, to be on the field in some capacity on Saturday.\nMatildas manager Tony Gustavsson addressed the forward's status on Friday, per The Equalizer's Jeff Kassouf.\nKerr appeared off the bench for a 10-minute cameo in the round-of-16 win over Denmark. She has been sidelined with a calf injury since the tournament opener.\nKerr is one of the most prolific forwards in the world. She has 63 goals in 122 international appearances and is a star for Chelsea at the club level.\nAustralia is a much better side when Kerr is on the field, and it needs her to help take down one of the top teams in the world.\nAustralia has done well in Kerr's absence from the starting XI, as Hayley Raso and others picked up their attacking output. The co-host scored multiple goals in each of its last three games.\nThe home crowd in Brisbane should help Australia get off to a great start, with or without Kerr, but if she is in there, the Matildas will receive a massive boost that could help them past France.\nA win without Kerr is still possible, but the task will be more difficult\nGambling problem? Call (877-8-HOPENY) or text HOPENY (467369).\nIf you or someone you know has a gambling problem, crisis counseling and referral services can be accessed by calling 1-800-GAMBLER (1-800-426-2537) (IL/IN/MI/NJ/PA/WV/WY), 1-800-NEXT STEP (AZ), 1-800-522-4700 (CO/NH), 888-789-7777/visiting ccpg.org/chat (CT), 1-800-BETS OFF (IA), 1-877-770-STOP (7867) (LA), visiting OPGR.org (OR), or calling/texting TN REDLINE 1-800-889-9789 (TN) or 1-888-532-3500 (VA).\nOdds and lines subject to change. 21+ (18+ NH/WY). AZ/CO/CT/IL/IN/IA/LA/MI/NH/NJ/NY/OR/PA/TN/VA/WV/WY only. Eligibility restrictions apply. See draftkings.com/sportsbook for full terms and conditions.",
  "word_count": 673,
  "scraped_at": "2026-02-14T13:26:27.133681"
}