{
  "article_id": "8e2651614771",
  "url": "https://www.syracuse.com/orangewomen/2026/01/dominique-darius-has-the-jersey-number-the-name-and-the-game-to-match-her-nfl-father.html",
  "title": "Dominique Darius , shaped by NFL father , finds her own path to SU :  Where Im supposed to be  ",
  "date": "20260105T150000Z",
  "domain": "syracuse.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Syracuse, N.Y. — Donovin Darius had one request as he approached his house after picking his daughters up from school: “Let’s break the world record today.”\nAs they rounded a corner near the house, Darius remembered there was a roughly 200-meter hill. There, he’d drop his kids off and drive alongside them as they tried to set new personal best times running up it.\nHis youngest daughter, Dominique, explained there was an added benefit, too.\n“He’s like, ‘If you run this hill, we’ll go get ice cream,’ ” Dominique said. “So, me and my sister, we get out that car, we run that hill and we’d go get ice cream.”\nSitting down for an interview in the John A. Lally Athletics Complex more than 15 years later, Dominique realizes ice cream wasn’t the only benefit.\n“That’s how he tricked us into being active,” said Darius, a fifth-year guard who has helped turn the Syracuse women’s basketball team back into a winner.\n“And so now, we’re always competitive. We’re always trying to outdo each other because he enabled that in us when we were younger.”\nDonovin, who starred as a safety for the Syracuse football team before becoming a first-round pick by the Jacksonville Jaguars in the 1998 NFL Draft, never pushed Dominique to follow in his steps at SU.\nBut after stints at UCLA and USC, Dominique, like her father once did, dons the No. 20 and is helping spark the Orange (13-2, 3-1 ACC) as their starting point guard.\nDonovin knew Dominique would be his “baby” as soon as she was born. Her full name is Dominique Alexis Darius — with her initials spelling out “DAD.”\nWhile noting that he loves all three of his daughters, Donovin said Dominique is the one he’s closest to and that their personalities are 85-90% alike.\n“One of the things I always tried to do was ask questions and work as hard as I could — and that’s what I wanted to instill in them,” Donovin said. “That’s something Dominique definitely has.”\nWhile Donovin has watched Dominique become “little double D,” he wasn’t always there every step of the way. When Dominique was 8, Donovin and her mother, Alemnesh, separated.\nDominique primarily lived with her mother in New Rochelle, New York, while Donovin moved back to Jacksonville, Florida. Donovin spent nine seasons playing for the Jaguars before playing his final NFL season for the Miami Dolphins.\nDonovin spent most of his time with Dominique during the summer and when school was on break.\n“As a father who is a 24/7 dad, who wants to be a part of everything, knowing that daughters need their dad, it always hurt that I could not be right there,” Donovin said.\nGrowing up, Dominique viewed Donovin as a “regular dad.” She feels bad saying it, but she and her sisters didn’t care that he played in the NFL.\nDominique said Donovin, an All-American and Big East Defensive Player of the Year in 1997, never made a big deal about being a professional athlete, which she said humanized her view of athletics.\n“In her stardom, I knew what it was like having that type of journey, but I also know what it was like to allow individuals to help you process what it is that’s best for you,” Donovin said.\nStarring at Blair Academy in high school, Dominique was rated the No. 26 player in the 2021 class, per ESPN. It led to her committing to UCLA, where she enrolled a semester early in January 2020.\nHowever, she said she wanted a “change of scenery” six games into the 2022-23 season, leading her to transfer to USC midway through the campaign.\nOnce she was again eligible for the 2023-24 season, Dominique said she expected to be in the rotation, but a preseason injury altered her playing time once she was healthy.\n“My dad was like, ‘Just trust the process. When your time comes, you’ll be ready, but until then, you gotta keep working,’ ” Dominique said.\nUp to that point, her basketball journey often felt like climbing an impossible hill. Dominique said she wanted to stop playing multiple times throughout her collegiate career.\nThe lowest point, she said, was the 2023-24 season at USC because her team was doing so well — led by freshman phenom JuJu Watkins, the Trojans fell in the Sweet 16 — but she wasn’t on the court helping.\nFollowing the season, Donovin felt USC was trying to push Dominique to transfer. He said his daughter wanted to contribute as part of the Trojans’ rotation for the 2024-25 season — which was slated to be her final year of eligibility — but that the program had a different outlook.\nRather than pushing his daughter to enter the transfer portal, Donovin said he encouraged Dominique to look at the situation differently. He advised her to maximize her time at USC and to consider being a servant leader.\n“I always tell my daughters this: I say, ‘You know what, I want to earn a right to be in your life by adding value to you,’ ” Donovin said.\nDominique stayed with the Trojans, but once she found out she wouldn’t be in the rotation before the season started, she asked if she could redshirt. The coaching staff agreed.\n“I would say that last year was the biggest year that she could have ever had that contributed to what it is that she’s doing right now,” Donovin said.\nWith her final year of eligibility remaining, Dominique entered the portal in the spring. One of her first calls was to SU head coach Felisha Legette-Jack, whom her father has known for over two decades. Legette-Jack had also recruited Dominique when she was at Blair Academy.\nDonovin gave Legette-Jack a testimonial as an “elite” coach, but Dominique’s gut is why she committed to the Orange.\n“My dad is the type of father where he’s gonna help me, but he’s not gonna make no decision for me,” Dominique said.\nAs she evaluated where she wanted to spend her final season, Dominique said all she wanted was an opportunity. Legette-Jack has given her that, along with captaincy, a starting role and confidence.\nDominique is SU’s second-leading scorer at 12.6 points per game after averaging 3.6 across her previous two stops. Meanwhile, her 3.6 assists and 2.2 steals per game lead the Orange.\nIn the preseason, Legette-Jack said that Dominique has the “keys to the Mercedes.” The Orange’s fourth-year head coach added she was hoping the point guard could take them “somewhere special.”\nAfter winning just 12 games last year, Syracuse has already exceeded that total following Sunday’s 73-58 victory at Wake Forest.\nThe team looks equipped to get back to the NCAA Tournament.\n“This is where I’m supposed to be,” Dominique said. “For the past year, I’ve been telling myself this is exactly how the year was gonna go.”\nFor Donovin, it’s full circle because Syracuse is where he graduated and where he met his wife.\nHe watches Dominique — mostly on the ESPN app — but he was in attendance for last week’s game against Duke wearing a custom T-shirt that says “The ‘Real Double D #20′ ″ at the top. In the middle of the shirt is a photo of Dominique from this season and the words “I’m Just Her Dad” underneath.\nDominique’s path to Syracuse hasn’t been linear. But in finding a place and a coach who believes in her, she’s finally showcasing her skill.\nAnd as SU chases Legette-Jack’s championship aspirations, Dominique is guiding her teammates up the hill alongside her.\nMore Orange women's coverage\n- Syracuse women’s lacrosse box score vs. No. 1 North Carolina\n- Syracuse women’s lacrosse falls short of upset bid against No. 1 North Carolina\n- Where to watch Syracuse women’s lacrosse vs. North Carolina for free today\n- Syracuse AD John Wildhack’s successes fly under the radar. His failures are impossible to miss",
  "word_count": 1322,
  "scraped_at": "2026-02-14T13:23:58.343131"
}