{
  "article_id": "8e2888f75f8a",
  "url": "https://economictimes.indiatimes.com/news/international/us/champions-league-2023-ahead-of-second-leg-clash-with-real-madrid-three-liverpool-players-miss-training/articleshow/98638175.cms",
  "title": "Liverpool players : Champions League 2023 : Ahead of second leg clash with Real Madrid , three Liverpool players miss training",
  "date": "20230314T160000Z",
  "domain": "economictimes.indiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On the other hand, Diaz participated in a distinct training session by himself before the rest of the team joined the AXA Training Centre.\nBefore heading to Bournemouth, Klopp gave an update on the potential return of Gomez, Diaz, and Thiago. He stated that Gomez may be able to train at the start of the following week, while Diaz could return during the upcoming week. Following the international break, both players can play. However, Thiago's status is uncertain, as none of them has trained with the team yet, and Klopp stated that they will assess how their recovery progresses in the next few weeks before providing further updates.\nLiverpool's chances of advancing to the Champions League quarter-finals appear slim after suffering a 5-2 defeat at home to Carlo Ancelotti's team, making it necessary for the Reds to accomplish a near-impossible feat. They won't be in action until after the March international break, following their trip to Madrid. When they do return, they will face away games against Man City and Chelsea, followed by a home match against league leaders Arsenal, all within the space of eight days.\nLiverpool will travel to Madrid on Tuesday afternoon after training, and it remains to be seen whether Thiago and Gomez will be part of the travelling squad. Klopp is set to provide an injury update at his latest pre-match press conference from the Bernabeu at 7 pm UK time on Tuesday evening.\nFAQs\n- When was Real Madrid founded?\nMarch 6, 1902 - When was Liverpool FC founded?\nJune 3, 1892\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.",
  "word_count": 324,
  "scraped_at": "2026-02-14T11:59:23.389762"
}