{
  "article_id": "8e500a8145c9",
  "url": "https://punchng.com/netflix-beyonce-make-splash-despite-nfl-ratings-fall/",
  "title": "Netflix , Beyonce make splash despite NFL ratings fall – Punch Newspapers",
  "date": "20241227T210000Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Netflix’s debut NFL broadcasts on Christmas Day received positive reviews and record streaming ratings but still attracted fewer viewers than the linear broadcasts last Christmas.\nThe streaming giant’s first venture into the USA’s biggest sport excited the sports business world which has been waiting years for Netflix to enter the market.\nThe company paid a reported $150 million per year for a three-year deal for the Christmas Day games.\nNetflix had previously dabbled in live sports content via one-off tennis and golf events and last month’s boxing contest between Mike Tyson and Jake Paul.\nThe boxing broadcast was plagued with buffering problems as the service struggled to cope with the massive audience and raised concerns about the NFL debut.\nBut there were few reported problems with the broadcasts of the games between the Kansas City Chiefs and Pittsburgh Steelers and the Baltimore Ravens and Houston Texans.\nNetflix mostly used CBS staff for the broadcast including their on-screen talent but the broadcast was given a Super Bowl feel with a half-time show from Beyonce during the Houston game.\nAccording to data from ratings firm Nielsen, the peak US audience during Wednesday’s back-to-back games came during the Beyonce performance when 27 million viewers were watching.\nNielsen said the Ravens-Texans game drew 24.3 million AMA (Average Minute Audience) while the Chiefs-Steelers attracted 24.1 million AMA.\nThe previous NFL domestic record for streaming was the 23 million on NBC’s Peacock for the Chiefs-Miami Dolphins playoff game last season.\nAmazon Prime also stream NFL games and their best audience came earlier this season for the Green Bay Packers- Detroit Lions game which drew 17.3 million.\nBut while the numbers for the Christmas games shows streaming is now catching up with linear broadcastings reach, they still fell a little short of last year’s festive season broadcasts on television.\nThe Las Vegas Raiders-Chiefs game on CBS in 2023 drew 29.2 million AMA.\n“This was still an excellent outcome. The NFL knew moving games from Fox or CBS to Netflix could result in lower viewership. However, dropping from a per-game average viewership of 28.4 million in 2023 to 24.2 million in 2024 is a better outcome than many would have expected given the circumstances,” wrote sports business analyst Joe Pompliano in his ‘Huddle Up’ newsletter.\n“The NFL received $150 million from Netflix, significantly more than the cable networks would have paid for the same two games. And it also served as a good test of whether the NFL should include Netflix when renegotiating its next media rights deal,” he said.\nIt is that prospect of Netflix entering bidding wars with rival streamers and traditional broadcasters that has long excited leagues looking to boost rights sales revenues.\nSo far Netflix has avoided the temptation to bid for season-long rights for any sport although this month they announced a deal for the US rights to broadcast FIFA’s Women’s World Cup football tournaments in 2027 and 2031.\nThe Netflix NFL games were broadcast internationally and details of how watched those games were outside of the USA will be released on December 31, Netflix said.\n“We’re thrilled with our first Christmas Gameday on Netflix with NFL games being streamed to a global audience,” said Hans Schroeder, NFL executive vice president of media distribution.\nChristmas Day sport in the USA has traditionally been the preserve of NBA basketball and their ratings for games on linear television were significantly below Netflix’s NFL games with the five games averaging 5.25 million viewers.\nAFP",
  "word_count": 578,
  "scraped_at": "2026-02-14T12:33:37.200719"
}