{
  "article_id": "8e88e3112378",
  "url": "https://www.dallasobserver.com/arts/photos-friscos-jaedyn-shaw-leads-the-us-womens-team-past-china-18059259",
  "title": "Photos : Frisco Jaedyn Shaw Leads the US Women Team Past China",
  "date": "20231212T201500Z",
  "domain": "dallasobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Audio By Carbonatix\nYou can’t help but notice the crowd. You are at a sporting event pitting the national teams of the world’s two great superpowers against one another and the crowd is very young and predominantly female. If looking around didn’t give it away, the high-pitched screams surrounding every scoring opportunity surely will. They are screaming and shouting and doling out advice; she’s open, pass it!\nLast Tuesday night, the U.S. Women’s National Soccer team played a friendly against the People’s Republic of China, and they owned this crowd. Every time they stepped out on the pitch, they provided a potential alternative narrative to young women. Oh sure, you could be a cheerleader or a popstar or the homecoming queen, but if you want to, you could also be a world-class professional athlete.\nLet’s go back nine years ago, or half a lifetime ago for 19-year-old Jaedyn Shaw. Shaw was one of those girls, watching as the women’s team ran off an unprecedented string of successes in world competition. She bought into the dream, and she was a good player. Better than good. At 14 she had a commitment with a college team. At 15, she was invited to train with Paris Saint Germaine, and at 17, the National Women’s Soccer League was bending its age rules to let her play professionally in the States. In her first game with the San Diego Wave, she scored the game winner.\nOn this night, she was back home in Frisco playing in front of 50 family and friends, and thousands of young girls with the same dream. Late in the first half, the ball bounced out of a crowd of players and rolled toward Jaedyn Shaw, who’s 19 years old and going through her first training stint with the national team. The world slowed down as she stepped forward and pounded a low shot just inside the post for a goal. It’s the game winner, a dream come true for Shaw, and maybe the start of a journey for one of those young girls out in the crowd.\nThe U.S. prevailed in the match, two goals to one. This was not a life-or-death match. It’s a friendly, a training opportunity for the clubs, and an exhibition for the fans. For the U.S. squad it’s a critical time, though. After a multi-decade string of winning almost every time they played, the team had a disappointing result in the last World Cup competition. They looked a little off – uninspired, and maybe a little old.\nThe U.S. team brought in Emma Hayes as its new manager. Older players such as Julie Ertz and Megan Rapinoe are stepping down. Before this match, U.S. soccer honored two-time Women’s World Cup Champion Ali Krieger, who played over 100 matches for the club. The team that in so many ways blazed the trail for women’s soccer are looking over their shoulders and seeing the rest of the world catching up, and really you couldn’t give them a bigger compliment.\nIn the run-up to next summer’s Paris Olympics and the next World Cup, the team needs to bring in a new generation of players. Players with big talent, big hearts, and yes, big dreams. Jaedyn Shaw seems to fit that profile. Ten years from now, one of those girls in the stands might be joining her.",
  "word_count": 558,
  "scraped_at": "2026-02-14T12:16:52.265225"
}