{
  "article_id": "8e925b6eaf4e",
  "url": "https://fethiyetimes.com/fethiye-times-news-week-ending-21st-september-2025/",
  "title": "Fethiye Times News – Week Ending 21st September 2025",
  "date": "20250922T104500Z",
  "domain": "fethiyetimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome to our pick of last week’s news from Fethiye and around Turkey.\nCurated from various news sources.\nNEWS\nFethiye’s “Clean Fethiye” Campaign is Growing!\nFETHIYE, MUĞLA – The Clean Fethiye campaign, launched by Fethiye Municipality, is reaching more people every day.\nThis time, the Fethiye Municipality Cleaning Services Department organised a three-day garbage collection walk along the historic Lycian Way, together with young people from various cities in Turkey. The event was held under the slogan “Leave No Trace in Lycia, Erase No Trace” and supported by the Fethiye Chamber of Commerce and Industry and the All Inventors Invention Innovation and Research Association (TÜMMİAD). Volunteers also joined municipal teams in collecting litter along the world-renowned hiking trail.\nFethiye Municipality Cleaning Services Director Mahmut Bayraktar expressed his gratitude:\n“We thank our caring young people. Let’s not forget: Fethiye belongs to all of us. Please don’t leave your trash haphazardly.”\nThe campaign highlights the importance of protecting Fethiye’s natural and cultural heritage while inspiring both residents and visitors to take responsibility for the environment.\nSource: Fethiye Belediyesi\nMusic Workshop Brings Joy to Autistic Children in Fethiye\nFETHIYE, MUĞLA – Fethiye Municipality hosted a meaningful event for autistic children at Niyazi Mete Autism Park, where music and rhythm created a joyful experience.\nThe programme, titled “Interdisciplinary Journey of Music” and led by rhythmotherapy instructor Yıldız Çokcoşkun, gave children the chance to explore rhythm and music in an engaging and inclusive way.\nThe event was also attended by Autism Park instructors, Çiğdem Karaca, President of the Lycian Women’s Initiative Production and Business Cooperative, and Adem Kazan, a distinguished educator and artist from the Fethiye Municipality Cultural Center. Parents showed great interest in the programme, which produced colourful and heartwarming moments.\nFollowing the event, Cooperative President Çiğdem Karaca said:\n“Music is a powerful tool for the participation, development, and happiness of our autistic children in social life. We are proud that our municipality is leading such events. The smiles on our children’s faces are worth everything.”\nShe also thanked the rhythm instructors and all the Autism Park staff for their efforts.\nAutism Park Manager Süleyman Yavuz added that similar activities will continue regularly, with ongoing efforts to strengthen the social participation of autistic individuals.\nSource: Fethiye TV\nFire in Fethiye Olive Grove and Maquis Forest Extinguished\nFETHIYE, MUĞLA – A fire that broke out in an olive grove and maquis forest in the Fethiye district was brought under control and extinguished thanks to the rapid response of firefighting crews.\nThe fire began in the Çalıca area of the Karaçulha neighbourhood, where residents noticed smoke rising from the maquis forest and alerted the 112 Emergency Call Center. Firefighters, forestry teams, and police were quickly dispatched to the scene.\nDriven by strong winds, the flames spread rapidly, reaching the nearby olive grove. Ground crews worked intensively to bring the blaze under control, successfully extinguishing it before it could cause further damage.\nThe fire caused material damage to olive trees and the surrounding maquis vegetation. Authorities have launched an investigation to determine the cause of the incident.\nSource: https://www.fethiyetv.com/fethiyede-zeytinlik-ve-makilik-alanda-cikan-yangin-sonduruldu\nAn Unforgettable Karaoke Night for Children in Seydikemer\nSEYDİKEMER, MUĞLA – Seydikemer Municipality gave local children a night to remember with a lively Karaoke Night held on Friday, September 19.\nThe event took place at the 2nd Stage Marching Band area, next to Sidyma Cafe, and was filled with colour, music, and excitement. Children enthusiastically took to the stage to sing a variety of songs, delighting both themselves and their families, who shared in the joyful atmosphere.\nThe smiles and laughter of the young participants created a heartwarming scene throughout the evening.\nFollowing the event, Seydikemer Mayor B. Önder Akdenizli expressed his gratitude:\n“The smiles on our children’s faces are worth everything. We all had a wonderful time together at this event, which we organized for them to have a great time. I thank all the children and their families who participated.”\nThe municipality announced that similar family-friendly activities will continue to be organised to bring the community together and create memorable experiences for children.\nSource: Fethiye TV\nMirrors Installed on Movable Barriers for Traffic Safety in Fethiye\nFethiye Municipality Public Works Traffic Teams installed mirrors to increase the safety of a movable barrier on Dispanser Street, which is difficult for drivers to spot.\nA significant step has been taken to improve traffic safety in the Fethiye district of Muğla.\nFethiye Municipality Public Works Traffic Teams have completed the installation of a mirrored warning system to ensure the safety of a movable barrier on Dispanser Street, which is difficult for drivers to spot.\nMunicipal officials stated that the application will allow drivers to see the barrier more clearly, especially at night and during rush hour traffic.\nPassenger Ferry Collides with Cargo Ship in Istanbul’s Bosporus, Twelve Injured\nISTANBUL – A passenger ferry operating the Beşiktaş–Üsküdar route collided with a Panama-flagged cargo vessel in the Bosporus on Friday, leaving twelve people injured, authorities said.\nThe ferry, identified as Kamil Sayın, struck the cargo ship Artvin while crossing the strait, prompting an immediate response from the Coast Guard and the Directorate General of Coastal Safety. Officials confirmed that no passengers fell into the water, but two people aboard the ferry sustained injuries serious enough to require hospital treatment.\nThe ferry was safely brought to Paşalimanı Pier, while the cargo ship was escorted by safety teams to a secure anchorage point for inspection and damage assessment.\nAuthorities said an investigation into the cause of the collision is underway.\nSource: Daily Sabah\nScores of Flamingos Arrive in Bursa Delta for Winter\nBursa, Turkey – A spectacular procession of pink-feathered flamingos has arrived at the Kocaçay Delta in Türkiye’s western province of Bursa, marking the start of their wintering season in one of the region’s most important wetlands.\nMigrating along the Eurasian-Mediterranean flyway, flamingos move between shallow, saline wetlands according to seasonal shifts in water levels and food availability. In Türkiye, the most frequently observed species is the greater flamingo (Phoenicopterus roseus), distinguished by its tall frame and pale pink plumage.\nThe Kocaçay Delta provides an ideal winter habitat with its mosaic of shallow wetlands, offering both safe feeding grounds and protected resting areas. Flamingos feed by inverting their heads and filtering water through their bills to capture algae, plankton, and small invertebrates, while their long legs and webbed feet allow them to wade efficiently through shallow waters.\nElsewhere in Türkiye, Tuz Lake has long served as a central breeding site for flamingo colonies, while the Gediz Delta functions as a key stopover point during migration thanks to its brackish waters and abundant food sources. Greater flamingos typically build conical mud nests above ground to protect their eggs, with parents usually laying a single large white egg and raising their chicks in communal groups known as “kindergartens.”\nDespite their adaptability, experts warn that the species faces growing threats. Irregular rainfall, drought, and rising evaporation can shrink wetlands, reduce food access, and even trigger mass chick mortality when breeding grounds dry out prematurely.\nLocal cooperation between farmers, water managers, and conservationists is seen as crucial to protecting feeding areas. Controlled eco-tourism initiatives, such as observation towers and guided tours, are also helping to raise awareness while supporting the local economy.\nConservation experts stress that the long-term survival of flamingos depends on safeguarding every wetland along their migration routes. “Without protection across the entire chain of habitats, the resilience of flamingo populations cannot be guaranteed,” they note.\nSource: Hürriyet Daily News\nSPORT\nThank you to Brian Lloyd for the Fethiyespor weekly update.\nFethiyespor secured a hard-fought 1–0 victory in their midweek Ziraat Türkiye Cup 2nd round match.\nFollowing the evening training session on Friday, the club celebrated the birthday of football player Nurettin Çakır. Fethiyespor extended their best wishes to Çakır, wishing him health, success, and happiness.\nThe team will now turn their focus to their next fixture — a home game on Sunday, 28 September, with kick-off scheduled for 19:00. Supporters are encouraged to attend and cheer the team on.\nMatch Result\nFethiyespor drew their away match against 1461 Trabzon FK on 21st September, with a final score of 2-2. Following recent matches, Fethiyespor moves up to 12th place in the league tables.\nJoin the Fethiyespor Yabancilar group on Facebook for more news and updates\nYou can also follow Fethiyespor on Twitter and Instagram\nTurkish Lira (TL) exchange rates\nThe British Pound bought 55.75 TL by the close of business on Friday. The week before it was selling for 55.94 TL.\nThe US Dollar bought 41.37 TL by the close of business on Friday. The week before it was selling for 41.32 TL.\nThe Euro bought 48.60 TL by the close of business on Friday. The week before it was selling for 48.49 TL.\nSource: exchangerates.org.uk\nWeather Forecast\nHere’s your weather forecast for the week ahead.\nSource: Living Earth",
  "word_count": 1475,
  "scraped_at": "2026-02-14T12:36:40.212357"
}