{
  "article_id": "8ebea9d26466",
  "url": "https://www.thenationalnews.com/business/markets/2025/09/12/dubai-investments-considers-ipo-for-flagship-industrial-park/",
  "title": "Dubai Investments considers IPO for flagship industrial park",
  "date": "20250912T184500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Dubai Investments is considering listing one of its units, amid the continued momentum of initial public offerings in the region.\nChief executive Khalid bin Kalban indicated an initial public offering for Dubai Investments Park (DIP) is being planned in February, and its flagship industrial park would be floated in 2026, according to a Bloomberg report on Friday.\nThe company, however, declined to further comment to The National. A representative of Dubai Investments said “nothing has been formally” decided and did not confirm the figures reported.\nThe diversified global investment company, with about Dh22.7 billion ($6.2 billion) of assets as of the end of June, is likely to sell a 25 per cent stake in DIP, using the proceeds for expansion, with similar plans for its other parks, Mr bin Kalban was quoted as saying by Bloomberg.\nThe IPO could value DIP at between Dh8 billion and Dh10 billion, the report added, citing sources.\nEarlier this year, Mr bin Kalban told The National that Dubai Investments plans to take four of its subsidiaries public amid the continued momentum of IPOs in the region.\nAt the time, he did not elaborate on which company units would be listed and when, but said they would consider which was the “better one to start with”.\nBourses in Dubai and Abu Dhabi have experienced a sustained IPO momentum in the past few years as the UAE, the Arab world’s second-largest economy, grows amid diversification efforts.\nThere were seven IPOs across the UAE in 2024, accounting for 47 per cent, or $6.2 billion, of total Gulf proceeds last year, according to a PwC report.\nLast year saw the highest Gulf IPO volumes on record, with 53 listings across the region and a total of $13.2 billion raised, the report said.\nThe secondary share sale, or free float, segment has also gained traction as UAE companies look to boost liquidity and diversify their investor base to be included in international indices.\nInclusion in international indices, such as the MSCI, usually supports increased liquidity for a company’s shares and can help to attract regional and global institutional investors.\nRecent free floats include Mamoura Diversified Global Holding's sale of 75 per cent of its stake in Dubai telecom operator du this week, which is expected to raise Dh923 billion, and Abu Dhabi National Oil Company raising $317 million from the share sale of its Adnoc Logistics and Services unit.\nAdnoc Gas will be added to the FTSE Emerging Index later this month, after its inclusion in the MSCI Emerging Markets Index in June.\nDubai Investments, established in 1995, had nearly 16,000 investors at the end of June, according to its website. Its shares were up 2.8 per cent to Dh2.94 during midday trading on Friday on the Dubai Financial Market.\nIts portfolio includes interests in real estate, building materials and construction, education, health care and financial services, in addition to subholding companies that target other sectors.\nDubai Investments Park, which began operations in 1997, covers 23 square kilometres and hosts more than 4,200 companies, latest data from its website shows.",
  "word_count": 511,
  "scraped_at": "2026-02-14T12:12:11.173377"
}