{
  "article_id": "8ecb166666a3",
  "url": "https://www.thechampaignroom.com/2023/3/12/23632550/illinois-women-heading-to-first-ncaa-tournament-since-2003-fighting-illini-ncaa-big-ten",
  "title": "Illinois women heading to first NCAA Tournament since 2003",
  "date": "20230313T011500Z",
  "domain": "thechampaignroom.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "History for Shauna Green and Illinois women’s basketball.\nIllinois women heading to first NCAA Tournament since 2003\nShauna Green has done the impossible.\nThe first-year head coach has guided the Illini to the promised land, with Illinois selected on Sunday for its first NCAA Tournament since 2000.\nIllinois earned a No. 11 seed in the Greenville Region 1 and will face No. 11 Mississippi State in the First Four on Wednesday. The winner plays No. 6 Creighton on Friday.\n2022-23 Season To This Point\nAfter the retirement of five-year head coach Nancy Fahey after last season, Josh Whitman was put in position he knows very well: being responsible for hiring head coaches that have the ability to turn programs around. He’s done it for men’s basketball and football with Brad Underwood and Bret Bielema, and on March 21, 2022 he did it again with Shauna Green.\nCoach Green immediately lit a fire under this program and turned it into a winning culture with only five returning players from the previous season — FIVE. As Deion Sanders would call it, Green brought her luggage with her.\nHer “luggage” included talented coaches Calamity McEntire, DeAntoine Beasley and Ryan Gensler, who together under Green are a combined 101-42 between Dayton and Illinois. Green wasn’t done unpacking until she brought in North Carolina State transfer Genesis Bryant and two Dayton transfers in Brynn Shoup-Hill and Makira Cook to go with returning starters Adalia McKenzie and Kendall Bostic.\nRegular Season\nThe Illini, with a revamped roster and coaching staff, tied last year’s win total after they ripped off a seven-game winning streak to start the season, before eventually losing to Delaware by three in the Daytona Beach Invite Championship. That win streak was highlighted by a 100-38 win over McNesse State on Field Trip Day in Champaign.\nIllinois’ first test of the season came against No. 4 Indiana on the road in its Big Ten opener. This is when we knew we had something special on our hands. Behind Makira Cook’s 33 points, the Illini were a last-second shot away from their first road win over a top-5 team in program history.\nIllinois after that loss would rattle off yet another seven=game winning streak to ring in the new year. Big wins included beating Butler on the road, Bryant’s triple-double on Florida Atlantic, Braggin’ Rights over Mizzou, and four Big Ten wins that shot the Illini up the standings.\nHowever, the Illini were still being slept on — until they won their biggest game of year against No. 10 Iowa on New Year’s Day. A game that featured NPOY candidate Caitlin Clark on the other side of the ball came down to the wire. A packed State Farm Center that bled into the 200s level got to witness Illinois pull off a résumé win over the eventual Big Ten Tournament champions.\nSlept on no more, Illinois was ranked for first time since Nov. 27, 2000.\nIllinois did not have much time to celebrate its new ranking, however, due to a quick turnaround with No. 3 Ohio State. The Illini were determined to show everyone that they belonged, and show they did — at least in the first three quarters. The Illini had Ohio State on the ropes late in the third quarter with a 17-point lead, but Ohio State’s pressure got to them as their late lead slipped away to the Buckeyes. A heart-wrenching loss, but knowing we had the top=three team scrambling gave Illini fans some closure to the implosion.\nThe Illini would quickly bounce back with their first win as a ranked team in 22 years over Minnesota.\nRound two was set against No. 24 Illinois and No. 6 Indiana as the Illini looked for another statement win at home. Adalia McKenzie for the Illini was on a mission, scoring fast and furious out of the gate. But a rough second quarter that bled into the third hurt the Illini. Although Indiana got sloppy late in the fourth, the comeback ended just short for Illinois.\nAfter a win against Northwestern, Illinois suffered an uncharacteristic home loss to Purdue, which saw them lose their Top 25 ranking. They would go on to split the next two against both Michigan schools, but would counter it with back-to-back wins over Nebraska and Minnesota.\nWith four games left on the regular season schedule there was one that stood out from the others. Illinois had a road date with Diamond Miller and the No. 8 Maryland Terrapins. Senior Jada Peebles, with help from Brynn Shoup-Hill, were igniting the Illini offense from the tip. Makira Cook would join in on the fun with 29 points, but sloppy play overall by Illinois allowed Miller to capitalize off its mistakes.\nIllinois would close out the regular season going 2-3, clinching its first 20-win season since 2008. Senior Night saw the Illini honor seniors Geovana Lopes and Jada Peebles (who has the opportunity to come-back next season if she so chooses).\nBig Ten Honors\nMakira Cook was awarded First-Team All Big-Ten by Coaches and Media, with Genesis Bryant and Kendall Bostic receiving Second-Team All Big-Ten by Coaches and Media. Bostic also received the Sportsmanship award for the second consecutive season. Finally, Adalia McKenzie was an All-Conference Honorable Mention in the Big-Ten.\nWhat about Coach Green? Sadly, the coach who led the way to tie the conference record for best one-year win improvement (+10) did not receive Coach of the Year honors. In any other league she would have been more than deserving, but in a league full of talented coach staffs it’s understandable why she fell short.\nBig Ten Tournament\nIllinois (22-9, 11-7 Big Ten) was granted a first-round bye after finishing sixth in the conference. Its first matchup was against Rutgers, who defeated Northwestern the previous round. Rutgers stood no chance against the Illini. Firing off all cylinders to start the game, the Illini could not be stopped as the cruised to an easy win.\nIn the quarterfinals the Illini ran into a familiar foe — Maryland. A team they once had the beat on that eventually fell through stood in the way of Illinois’ potential trip to the semifinals.\nMaryland came out with its full-court pressure, which the Illini seemed somewhat ready for — but over time it wore them down. Sloppy passes with miscommunication allowed Maryland to run away in the first half. The second half, however, the Illini came out of the aggression outscoring Maryland. Their efforts in the second could not erase their mistakes in the first, as the Illini were bounced from the Big Ten Tournament.\nLooking Ahead\nThis is an Illini team at full-strength no on wants to face. With tremendous gamesmanship they have proven that they can hang with anyone in the tournament.\nThe backcourt of Cook and Bryant is going to be a huge part of Illinois’ success in March. Kendall Bostic is a huge force in the paint averaging 9.9 rebounds a game, and the tenacity of Adalia McKenzie in the interior is soul-crushing to any team. At any moment teams can be burnt from outside by any combination of Shoup-Hill, Jayla Oden, and Jada Peebles.\nThis women’s team is the best prepared team Illinois has ever-had, and under Shauna Green — the sky’s the limit.\nLet’s do things #OneWay & go 1-0.\nMost Popular\n- How to Watch Illinois vs. Indiana: Game Time, TV Channel, Online Streaming and Odds\n- ‘I want to help Coach Bielema win’: Illinois introduces new DC Bobby Hauck\n- Illinois’ Kaden Feagin to change positions, become tight end\n- Terrence Shannon Jr. lights it up in G League tune-up\n- Don’t drink the poison: Why Illinois must trade fatigue for focus",
  "word_count": 1285,
  "scraped_at": "2026-02-14T12:45:13.753600"
}