{
  "article_id": "8efd280bade8",
  "url": "https://www.juneesoutherncross.com.au/story/9133672/matilda-fires-as-mariners-down-wanderers-in-alw/",
  "title": "Matilda fires as Mariners down Wanderers in ALW",
  "date": "20251214T104500Z",
  "domain": "juneesoutherncross.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Emerging Matildas midfielder Izzy Gomez has led A-League Women champions Central Coast to a 2-1 win over Western Sydney and into fourth on the table.\nSubscribe now for unlimited access.\nor signup to continue reading\nBut Wanderers teenager Tahlia Younis stole the show with a goal of the season contender in the dying minutes.\nThe Mariners, who had a shaky start to the season after losing multiple championship-winning players and coach Emily Husband, have started to find their feet under new boss Kory Babington.\nSunday's win sets up a blockbuster with league leaders Canberra United on Saturday at McKellar Park.\n\"We're confident, we've been winning now and we've got our scoring boots on and we'll just see how next week goes,\" Gomez told Paramount Plus.\nNew Wanderers recruit Chloe Logarzo Berryhill started and played 67 minutes as she attempts to force her way back into the Matildas squad ahead of the Asian Cup before retiring.\n\"I'm quite disappointed in my performance today - my touches were horrible and it was not acceptable,\" Logarzo Berryhill told Paramount Plus.\n\"That's obviously a disappointing result for us, a disappointing way that we played but definitely going to go back into training to figure out our defensive shape and do one better next week.\n\"I've got sights on the Asian Cup and if I play well, it'll be a by-product of that.\"\nOne-cap Matilda Gomez, who has grown into the season, impressed at Wanderers Football Park with a physical, aggressive midfield display.\nFor the opener in the 18th minute, Isabella Coco-Di Sipio nipped in behind Wanderers midfielder Amy Chessari and cleverly used the outside of her right boot to loop a brilliant goal past goalkeeper Shamiran Khamis.\nTen minutes later, a poor Wanderers defensive clearing header from Alana Cerne fell to Gomez, who took an excellent touch and rifled it home.\n\"I'm just thriving in this culture so it's making me play well. I'm feeling free so just getting those goals in,\" Gomez said.\nThe Wanderers had a golden chance go begging in the 76th minute, with Poppie Hooks' header brilliantly cleared off the line by Mariners skipper Taren King.\nYounis, 17, gave the Wanderers a lifeline when she received the ball from Holly Caspers outside the box and launched a wonderful, bending strike that gave Mariners goalkeeper Annalee Grove no hope.\nGrove was booked for time wasting as the Mariners desperately held on.\n\"We were comfortable in the first half but second half they brought the fire and we were just under the pump. But we held them off and glad to get the three points again,\" Gomez said.\nThe last-placed Wanderers now have a bye and next play Adelaide away on December 27.\nAustralian Associated Press",
  "word_count": 454,
  "scraped_at": "2026-02-14T12:50:36.319368"
}