{
  "article_id": "8f050bfc2ae9",
  "url": "https://www.theoaklandpress.com/2024/10/05/fall-festivals-spooky-halloween-events-are-plentiful-in-downriver-dearborn/",
  "title": "Fall festivals , spooky Halloween events are plentiful in Downriver , Dearborn",
  "date": "20241005T190000Z",
  "domain": "theoaklandpress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The hazy, lazy days of summer have passed.\nWith the freshness of fall, Dearborn and Downriver are revved up for all sorts of go-tos and getaways for vacationing out-of-town visitors and local folks on staycations and daycations.\nHere’s a roundup of fall fun, from autumn festivals to arts, culture, history, outdoor experiences, children’s activities and dining delights.\nFestive fall\nHarvestFest – Head to Southgate Oct. 5 for the annual, free celebration, including a bounce house, touch-a-truck (10 a.m. to 1 p.m.), face painting (11 a.m. to noon), children’s craft activities (noon to 1 p.m.), balloon animals (1-2 p.m.), a scarecrow competition, music, a pumpkin patch, food trucks, artisans and a chance to chat with law enforcement professionals.10 a.m. to 3 p.m., Market Center Park, 13631 Eureka Road, Southgate.\nHuron Township Applefest – Carnival games, a bounce house, crafts, a pie contest and a fiddler contest are among the highlights. 9 a.m. to 7 p.m. Oct. 5 and 10 a.m. to 6 p.m. Oct. 6. Garden Level, 37229 Huron River Drive, New Boston. 734-753-3378. info@applefest.com\nFamily Fall Festival – Dearborn’s oldest building – the Commandant’s Quarters – will host Fall Into Dearborn: Brews and Boos from 6-11 p.m. Yard games, putt-putt golf, music, a tarot reader, a silent auction and food from area businesses. 21950 Michigan Avenue, Dearborn. 313-585-3000.\nSoutheast Michigan Craft Beer & Wine Festival – A heated tent on Oct. 12 will host the 7th annual festival, featuring wines, brews, meads and kombucha tastings. Admission is $40 in advance, $45 at the door and $5 for designated drivers. Tickets include 15 tokens for beer and wine samples. The event is limited to attendees 21 and older. Sponsored by the Huron Township Rotary Club. 5-9 p.m. Oct. 12 Lajko Park, 22700 Huron River Drive, Huron Township. semibeerfest.com\nFall Harvest Festival – A pumpkin patch, a craft beer tent, hayrides, a petting farm, live music and food trucks round out an autumn afternoon on the island. A $5 per-person fee will be charged to attend the event from 1-6 p.m. Oct. 19 at Centennial Farms. 734-675-2364. grosseilerecreation.com\nApple Charlie’s South Huron Orchards – Apples. U Pick ‘em. Cider. Pies. Pumpkins. Gourds. Ice cream. An animal farm. For many, a visit to Apple Charlie’s is an autumn tradition. 38035 S. Huron Road, New Boston. 734-753-9380.\nSpooky stuff\nThe Henry Ford — One of autumn’s hottest tickets is the annual Hallowe’en in Greenfield Village Experience. For 16 evenings in October, the historic Dearborn destination is transformed for strolling guests to take in themed attractions while mingling with more than 50 costumed characters, including the Grim Reaper, Peter Pan and Alice in Wonderland. Special lighting and illuminated jack-o’-lantern paths take visitors through 18th- and 19th-century activities for corn husk craft making, Halloween yard games and beer brewing. Take a train ride through the Village on the Hallowe’en Express. And, new this year, the Village is screening the 1910 film “Frankenstein” with live character interactions and is cranking up its Town Hall experience with a “Wolfman Jack” deejay. 4-9:30 p.m. Oct. 3-6, 10-13,17-20 and 24-27. thehenryford.org\nTrick or Treat Trail – Bring a bag and wear a costume to collect goodies handed out by local business and volunteer groups. Participants under 18 must be accompanied by an adult. 1-3 p.m. Oct. 13. Brownstown Event Center, 23345 King Road, Brownstown Township. 734-675-0920.\nNightmare on Fort Street – Swing by the Bandshell from 1-4 p.m. Oct. 19 for games, a costume contest for children, treats and pumpkin decorating presented by Lincoln Park Parks and Recreation. 3240 Ferris Ave., Lincoln Park. 313-386-1817 or events@citylp.com.\nSpooktacular – Soak up the scary scene in downtown Flat Rock. Free and open to the public Oct. 19, the 10th annual Spooktacular event features an inflatable bounce house, trunk or treat at 3 p.m., costume contests for dogs at 4 p.m. and children at 4:30 p.m., and a balloon clown. Huron River Drive, between Telegraph Road and Garden Boulevard.\nHallow-Palooza – Pick a time slot and head for Taylor’s Halloween celebration, featuring a stroll through Heritage Park and a petting farm with more than 50 treat stops. Also: a pumpkin carver, deejay, doughnuts and cider. Taylor children admitted free with an adult and a valid Taylor ID, but pre-registration is required. A $5 fee for non-Taylor children. Six time slots available on Oct. 25: 4-4:30 p.m., 4:30-5 p.m., 5-5:30 p.m., 5:30-6 p.m., 6-6:30 p.m., and 6:30-7 p.m. A big screen movie is planned for 7:30 p.m. Heritage Park and Sheridan Pavilion, 12111 Pardee Road, Taylor. cityoftaylor.com.\nWitches Night Out – Shop and stop for vendors, giveaways, strolling cocktails, a gift card raffle and a performance by the Lake Eerie Hexenbrut dancing witches. 4-9 p.m. Oct. 26. Downtown Trenton. Sponsored by The Vintage Market Mercantile and Freckles & Grit.\nWitches of Wyandotte – Participating downtown locations promise fun for your visit, including shopping specials. Noon to 5 p.m., Oct. 26. Wyandotte.\nTrunk or Treat – Local businesses will hand out treats and food trucks will be at the ready from 5-7 p.m. Oct. 27. Canned foods will be collected for the Saint Philip Food Pantry. Kennedy Recreation Center Parking Lot, 3101 West Road, Trenton.\nPumpkin Smash – Don’t trash it. Smash it. Compost your jack-o-lanterns from noon to 4 p.m. Nov. 2 at Council Point Park, 3123 River Drive, Lincoln Park.\nCool stuff, kids’ stuff\nA moo-ving experience – Visitors can visit the cows at the Calder Dairy & Farm in Carleton, where milk is produced for home delivery and to Calder stores in Lincoln Park and Flat Rock, and to other retailers. There is a viewing room and interactive activities for all ages. The farm is open to the public most days. 9334 Finzel Road, Carleton. 734-654-2622.\nPull in, kick back – Spring, summer, autumn, winter. No matter the season, Dearborn’s Ford Wyoming Drive-In is showing movies until, well, deep into the night. Call it a throwback to the good old days. It’s much like drive-ins used to be, only bigger. There are five screens and night owls should know some movies don’t begin until after 2 a.m. Open seven days a week. Enjoy the popcorn, hot dogs, nachos and funnel cake fries. And, yes, this is a pet-friendly venue (just use a leash and be sure to clean up). 10400 Ford Road, Dearborn. 313-846-6910.\nAlpaca – Sweet animals, and soft souvenirs are there for the touching at Gibraltar Bay Alpacas. Feed treats to fluffy friends on your visit. “Buttery soft,” is how owner Richard Steffke describes the alpaca fleece in gift shop products, including socks, sweaters, stuffed bears – and more. There is no admission fee, but donations are encouraged at the working farm operated since 1970 by Steffke and his wife, Gail. Visitors welcome from 10:30 a.m. to 4:30 p.m. Wednesdays through Sundays. 8545 Groh Road, Grosse Ile (adjacent to the Grosse Ile Municipal Airport). 734-675-6220.\nRoll on – Bring your roller skates (with toe stops on quad skates or heel breaks on inline skates) or rent a pair at United Skates of America in Lincoln Park. Hours of operation vary.1419 Southfield, Lincoln Park. 313-381-7465.\nRev’d Up Fun – Ready for action? How about bumper cars, a zipline, ax throwing, laser tag … and more? Rev’d Up fun is at 19830 West Road, Woodhaven. 734-307-3711.\nGame on – Plenty of activity at World of Games in Southgate, including “smash bowling” with a football, ax throwing, feather bowling, cornhole and other pursuits. World of Games, 13751 Eureka, Southgate. 734-250-8558.\nSportway – Come to play at Sportway: miniature golf, batting cages, go karts. 19640 Allen Road, Brownstown Township. 734-479-0340.\nAll aboard – Train rides and pony rides are available at the Heritage Petting Farm in Taylor. Cost is $5 per person. 12803 Pardee, Taylor. Pony rides are Oct. 5 and 6; Train rides are Oct. 12 and 13. The Boo Barn is operating Oct.19 and 20 (advance tickets required). cityoftaylor.com. 734-374-5946.\nGet Out – Greenway getaways serving more than 20 communities and offering more than 100 miles of water and land trails are available through efforts championed by the nonprofit Downriver Liked Gateways. Trails reach within a half-mile of every home, according to the group. For details and a map of the “people powered” recreation: downriverdtrails.org.\nHistory and culture\nThe Henry Ford – Hockey fans can chill out this fall with an exhibition tracing the evolution of ice hockey. Opening Oct. 13 in the Henry Ford Museum of American Innovation, “Hockey: Faster Than Ever” promises to showcase “the remarkable technical advancements and scientific breakthroughs that have shaped the sport over time.” Also planned are interactive activities for attendees to test their reflexes and shot speed in hitting targets. Visitors will be able to snap a selfie with an ice resurfacing machine, explore displays of skates and gear from the 19th and 20th centuries, and interact with a specially designed Stanley Cup touchscreen. The exhibition also includes selected Red Wings and Team USA items, and a locker room with jerseys and gear from NHL star players. 20900 Oakwood, Dearborn. 9:30 a.m. to 5 p.m. daily and weekends, except for Thanksgiving and Christmas. The exhibit in The Gallery by General Motors runs through Jan. 5, 2025. Admission with a museum ticket or membership. Preview showings for members Oct. 11 and 12. thehenryford.org.\nArab American National Museum – Founded almost two decades ago, this Dearborn museum is the first and the largest devoted to Arab American history and culture. Exhibits feature the history of Arab Americans from arrival in the 19th century, including documents, oral histories, artifacts and artwork.13624 Michigan Ave., Dearborn. 313-582-2266. Arabamericanmuseum.org\nVintage American Glassware Show and Sale – Dealers from across the nation will gather in Dearborn for the 51st annual show. Sponsored by the Michigan Depression Glass Society, comprising more than 150 collectors of American-made glassware from the 1920s to 1960s. Ford Community & Performing Arts Center, 15801 Michigan Ave. Dearborn. 10 a.m. to 5 p.m. Nov. 2 and 10 a.m. to 5 p.m. Nov. 3.\nFord Rouge Factory Tour – Take a spin through a working factory by viewing the Dearborn Truck Plant, home of the best-selling F-150 truck. The plant is not fully active on some dates, depending on production schedules. For tickets and to confirm days of operation, check schedules on thehenryford.org.\nCivil Rights in America – This year marks the 60th anniversary of passage of the 1964 Civil Rights Act. Trace the history and history-making impact in by viewing “To Establish the Rule of Justice: 60 years of the 1964 Civil Rights Act.” Henry Ford Museum of American Innovation. 20900 Oakwood, Dearborn. 313-982-6001. thehenryford.org.\nIslamic Center of America – Built in 2005 and open to visitors, the center was created to promote education, understanding and comprehensive Islamic services. 19500 Ford Road, Dearborn 313-593-0000. Icofa.com\nAutomotive Hall of Fame – Exhibit galleries and exhibitions capture the history, impact and men and women who put America on wheels, 21400 Oakwood Blvd., Dearborn. 313-240-4000. Automotivehalloffame.org\nOn the waterfront\nFrom the mouth of the Rouge River to Lake Erie, the Downriver area offers a unique waterfront vista distinguished by freighters, islands, bridges and Canada.\nHere are some places to kick back and enjoy the view:\nBelanger Park, River Rouge – In the heart of an industrial city, the 9.5-acre park is a waterside retreat with access for fishing, boating, picnicking and views of the Detroit skyline and freighter traffic. A working lighthouse is a memorial to lost Great Lakes mariners.\nDingell Park – At the foot of Southfield Road and Jefferson Ave., Dingell Park is popular for fishing, recreational boat launching and freighter watching. Offshore from the park is Mud Island.\nBishop Park – Picnic shelters, playground equipment, basketball courts and a fishing pier share space on the popular, 12.2-acre park on Van Alstyne from Elm Street to Vinewood. The park is adjacent to the downtown Wyandotte business district.\nBASF Waterfront Park – Enjoy a brick promenade, viewing decks, a rowing launch, trails and an amphitheater. Some 20 acres on the Detroit River, south of Eureka Road, Wyandotte.\nElizabeth Park – This venerable park in Trenton is among the most pleasant settings for an autumn day. Covering more than 160 acres with more than 1,300 feet of riverwalk for river watching and fishing, the park also hosts picnic shelters, athletic fields and a marina. 4250 Elizabeth Drive, Trenton.\nDetroit River International Wildlife Refuge – With hundreds of species and birds, the riverfront refuge in Trenton offers self-guided, daytime tours and plenty of quiet space to enjoy what is described as “place where wildlife and humans can meet.” Restrooms and equipment lending are available from the John D. Dingell Jr. Visitor Center, including fishing poles and binoculars. 5437 W. Jefferson, Trenton. 734-365-0219.",
  "word_count": 2119,
  "scraped_at": "2026-02-14T13:40:39.890794"
}