{
  "article_id": "8f127cbbd146",
  "url": "https://www.farmersjournal.ie/another-fine-mess-for-watty-grahams-745750",
  "title": "Another fine mess for Watty Grahams",
  "date": "20230126T013000Z",
  "domain": "farmersjournal.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The go-to catchphrase for GAA administrative malfunctions is that Laurel and Hardy favourite, “Another fine mess you’ve got me into”.\nIn fact, while that was the title of one of their films, it is among a number of cinematic misquotations that has found itself come into popular parlance – the usual phrase uttered by Hardy was, “Another nice mess...” .\nThere’s certainly nothing nice about the fallout from last Sunday’s All-Ireland Club SFC final between Dublin Kilmacud Crokes and Watty Graham’s, Glen from Derry.\nCrokes were victorious in the game by two points, but they had 16 players on the pitch near the end as Glen sought a late goal.\nIt probably says something in terms of how we have become so used to GAA teams and personnel going down the appeals route that, in the aftermath of the game, it was refreshing to hear Malachy O’Rourke say that Glen wouldn’t be looking to challenge the result.\n“I don’t think that’s how the club operates,” he said.\n“We had our chances, we gave it our best shot. Look it, that shouldn’t happen. I can’t speak for the club but I just think we’ll accept we got beat on the day.”\nPerhaps he said that in the expectation that the GAA would order a re-fixture or Crokes would offer one. In any case, on Monday a statement from Watty Graham’s revealed that they had sought clarification from the GAA, who told them that a second game would not be taking place without an appeal being lodged.\nIt was a far-from-satisfactory situation and the club should never have been put in that position.\nHurling\nThere was no doubting Leinster’s victory over Ulster in the other final, as Ballyhale Shamrocks overcame Antrim’s Dunloy to claim the hurling title for the third time in four years – and they only lost last year’s final to a last-minute goal by Ballygunner’s Harry Ruddle.\nTo consistently come out on top in a county like Kilkenny and then go on to Leinster and All-Ireland glory is quite an achievement, especially as clubs tend to go through peaks and troughs in terms of players coming through.\nRight now, Ballyhale are like what Kilkenny were like in the late 2000s – or Limerick are now – and that’s as high a compliment as can be paid to any hurling team.\nThere were 22,890 spectators at Croke Park – quite good for a late January setting, though I think the majority view is that taking the senior club finals away from St Patrick’s Day did dull their prestige somewhat, even if the rationale was fairly sound.\nAnother side-effect of the increased number of games at GAA headquarters in the winter months (the four junior and intermediate finals the weekend before, as well as Leinster club championship and All-Ireland camogie and ladies’ football games before Christmas) is that the pitch is taking more traffic than previously.\nIt looked in less-than-great shape last weekend, though while GAA stadium director Peter McKenna admitted that it looked “tired”, he said that the various tests had shown that it was at a playable level.\nThis weekend, it hosts the Dublin-Kildare game as the Allianz Football League begins but after that there will thankfully be a period of recuperation.\nThe old joke that it was harder to get off the Ireland rugby team than get on it certainly doesn’t apply any more.\nThere was some surprise at the exclusion of Joey Carbery from the Ireland squad for the Guinness Six Nations Championship, which begins next weekend, especially as Jack Crowley – who plays in the centre for Munster with Carbery at out-half – included along with captain Jonathan Sexton and Ross Byrne, who has pulled off something of a resurgence at Leinster.\nUltimately, the fact that Ireland can afford to go without Carbery underlines the strength of the competition for places and, as coach Andy Farrell outlined when he spoke to the media on Monday, the door is never fully closed.\nHe said that Carbery had been provided with feedback, which is good management, and it is up to the player to show that he can take it on board and use it to make himself better. If he does, the benefits will be there for Munster and Ireland.\nProffessionalism\nProfessionalism has served to make things more ruthless – the announcement last week that Jacob Stockdale would not be receiving a new central IRFU contract underlined that, as it doesn’t seem so long ago that he was scoring tries for fun on the way to helping Ireland win a grand slam.\nIt’s not all on the player if things drop off – injuries can have a huge effect, especially in a sport as attritional as rugby – and it just shows that you have to make the most of the opportunities when they come.\nWith six Women’s FA Cup wins, Doncaster Rovers Belles are third on the competition’s roll of honour.\nAll six victories came between 1982 and 1994, before the merger with the local men’s team added ‘Rovers’ to their name. The Belles’ last two wins, 1992 and 1994, sandwiched the first for Arsenal, who are top of the roll of honour with 14.\nNowadays, Doncaster play in the fourth tier of English women’s football while the top of the Women’s Super League features the same names as in the Premier League.\nIt’s probably better for the safeguarding of women’s football to have the teams aligned to clubs that will ensure the long-term viability and Shamrock Rovers rejoining the Women’s National League here is something with more positives than negatives.\nBacked by strong resources, Rovers have made a splash with the announcement of signings such as Stephanie Roche, Áine O’Gorman and Savannagh McCarthy, ensuring that they are likely to be a force straightaway.\nEqually, the in-built high profile that comes with the Rovers brand should help with the promotion of the game in south Dublin, but going up against clubs that are backed by League of Ireland operations makes life that bit harder for DLR Waves and Peamount United.\nSuch is the nature of sport – nobody ever got anything for free – and, like the Ireland rugby team, the competition should bring out the best.",
  "word_count": 1041,
  "scraped_at": "2026-02-14T12:59:56.473484"
}