{
  "article_id": "8f132ed22df3",
  "url": "https://mondoweiss.net/2025/08/canada-must-boycott-davis-cup-match-with-israel/",
  "title": "Canada must boycott Davis Cup match with Israel",
  "date": "20250809T170000Z",
  "domain": "mondoweiss.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In mid-July, over thirty countries met in Colombia to discuss sanctions against Israel for its ongoing campaign in Gaza. In line with international law, twelve of those countries resolved to immediately ban arms sales to Israel and appraise all public contracts for complicity with companies profiting from Israeli occupation and genocide. Those countries also reiterated their commitment to prosecute individuals guilty of war crimes in Gaza. The other countries at the meeting indicated the possibility of signing on to these forms of sanction by mid-September.\nCanada, which has just announced that it may conditionally recognize a Palestinian state in September, was not among either group.\nInstead, at just about the same moment in mid-September that others will further contemplate sanctions and a growing number of nations will acknowledge Palestinian sovereignty, Canada will host Israel in a tie of the the Davis Cup international tennis tournament in Halifax.\nAs Canadian scholars of exploitation and harm in sport, we consider that decision to be an egregious and indefensible violation of Canada’s responsibility to international law and a basic commitment to human rights.\nIt must be reversed.\nHow can Canada consider inviting a country onto our tennis courts that has effectuated atrocity?\nBetween October 2023 and January 2025, Nature reports that 84,000 people have died in Gaza as a consequence of Israel’s campaign of reprisal for Hamas attacks on October 7, 2023, more than half of whom were children, women aged 18-64, or people over 65. More recently, at least 800 people have been killed between May and July 2025 by Israeli troops and American mercenaries at GHF ‘aid’ sites as they desperately seek provisions due to Israel’s deliberate blockade of Gaza, which has produced conditions of ever-worsening mass starvation. At this moment, the UNRWA has said that they have “enough food for the entire population of Gaza” for three months sitting at the Egyptian border, forcibly denied entry to Gaza.\nUnsurprisingly, these events have been widely characterized as a genocide by those with scholarly expertise in the area.\nSport is no mere triviality amid this horror. As of late June 2025, the Palestinian Football Association has recorded the deaths of 785 Palestinian athletes and athletic officials at the hands of Israel, including 437 footballers (Palestine’s most popular sport), since October 7, 2023. At least nine additional deaths have been documented in July 2025. In an academic journal article currently under review, we have characterized this systematic practice of targeting Palestinian athletes, coaches, and sporting infrastructure by Israel as athleticide, a modality of genocide designed to undermine and erase a people’s identity through the destruction of one of their most popular and visible forms of cultural expression.\nIn fact, amid growing global condemnation of Israel’s actions in Gaza, sport has become a key battleground in the campaign to hold the Israeli state accountable. As the regime faces a deepening crisis of legitimacy, calls to sanction Israel in international sport have intensified. This includes what has been called “sport hasbara” – the strategic use of sport to promote a positive image of Israel and deflect criticism of its policies.\nOne recent example of this practice is the organized NBA player trips to Israel in the mid 2010’s, led by Israeli NBA players or those who have played in Israel. Although nominally apolitical, the purpose of these trips has in fact been characterized by organizer and former NBA player Omri Casspi in the Israeli media as ‘combatting’ the BDS movement. As Casspi explained, “for most of them it is their first time in Israel. They are here and now they get to see who we really are…Some of them thought that people here were running around and shooting each other in the street. And now they see how different the reality is versus what they thought is going on here. It is a lot of fun to see them playing with the local kids, and it was a really moving experience to be at the Western Wall.”\nLike most Israelis, members of the Israeli Davis Cup team slated to play in Canada have served in the Israel Defence Forces (IDF). Daniel Cukierman, the top-ranked player on the team, has said of the IDF in an interview prior to October 7, 2023, “I think Israel is a special place for someone to grow up an athlete because we have the Army…. being Israeli means serving in the Army and we take pride in that, despite the disadvantages it can cause to an athlete developing their career.” Cukierman’s father Edouard – who immigrated from France specifically to enter the army as an 18-year-old, and was an IDF spokesperson for 15 years following his service – is a venture capitalist and ‘international advocate for Israel’ who funds startups in the high tech sector, as well other companies that “become vital cogs in the well-oiled IDF machine”.\nBy welcoming this Israeli team onto Canadian soil to participate in competition, Canada has elected to tacitly endorse Israel’s nearly two-year-long relentless assault on Gaza–and in effect participate in the production of sport hasbara.\nYet, it is not too late to reverse course.\nThere is considerable precedent for sports as a site of political boycott and resistance to human rights violations. From 1964 until 1988, South Africa was banned by the International Olympic Committee (IOC) because of its system of Apartheid, which in part prohibited non-white people from representing the country in sports. Similarly, the IOC and FIFA have taken recent stances against Russia’s imperialist campaign in Ukraine, banning the national team from participation in major international events.\nStill, to date, there has been a Palestine Exception to the application of these principles by the IOC and FIFA, despite major public campaigns and legal efforts to the contrary.\nNevertheless, there have been examples of athletic protest specifically against Israel.\nArab and Muslim countries boycotted Israel in athletic competitions as early as the 1970s. Iranian athletes specifically have refused to compete against Israelis since 1979. More recently, former Irish national basketball captain Rebecca O’Keeffe called for her team to boycott a match against Israel. While the call was ultimately not fully heeded, the team did refuse to shake hands and take part in pre-game formalities, including the Israeli national anthem.\nCanada doesn’t just have a moral obligation to follow these examples; it is actually required to do so by international law.\nAccording to the International Court of Justice’s 2024 Advisory Opinion on Israel and the Occupied Territories, all UN member states – including Canada – have an obligation not to render aid or assistance to cultural activities that sustain or maintain the unlawful occupation. It is plain that international sporting competitions are prime examples of cultural activities that legitimize Israel’s position in the world order as it violates international law. Similarly, in UN Special Rapporteur Francesca Albanese’s recent report on economic complicities in the genocide, she makes it abundantly clear that “corporate relations with Israel must cease until the occupation and apartheid end and reparations are made.” This principle applies directly to Tennis Canada.\nCanada thus has a clear moral and legal obligation not to host Israel in any international sporting competition, including the Davis Cup–a fact at least implicitly acknowledged by its own Foreign Minister in a recent shared statement with 24 other states and the EU that concludes, “We are prepared to take further action to support an immediate ceasefire and a political pathway to security and peace for Israelis, Palestinians and the entire region.”\nWe have no doubt officials with Tennis Canada were dismayed to see their team’s draw, knowing that it would put them in this difficult position. Withdrawing from the competition out of protest would be a challenging financial decision and a profoundly disappointing one for competitive athletes who strive to have opportunities like this over entire careers. That is not a decision any athletic organization ever wants to have to make.\nBut let’s be real here. No humane person could possibly suggest that those downsides outweigh the illegal and immoral alternative: tacitly endorsing and thus actively abetting ongoing genocide.\nYet, as of now, that is the choice that has been made by Tennis Canada.\nIt’s time to redress it.",
  "word_count": 1362,
  "scraped_at": "2026-02-14T12:12:24.866954"
}