{
  "article_id": "8f5929a3b041",
  "url": "https://www.arsenal.com/news/january-transfer-window-round",
  "title": "January transfer window round - up",
  "date": "20230201T124500Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In a hectic month behind the scenes, we saw 24 players either arrive, depart or return to London Colney during the January transfer window across the various levels of the club.\n10 of those came on deadline day alone, and if you need a reminder on all the comings and goings during the month, we've wrapped everything up below:\nMen’s\nThe first arrival for the men’s team saw Leandro Trossard swap Brighton & Hove Albion for north London. The Belgian international winger made an instant impression by playing a part in our winning goal against Manchester United on his debut, and starred against Manchester City in the FA Cup.\nFollowing him through the door was Jakub Kiwior, fresh off his displays for Poland at the 2022 World Cup. The 22-year-old centre-back - who can also play as a defensive midfielder - arrived from Italian club Spezia after impressing in Serie A over the past 18 months.\nThen on deadline day, we completed the signing of Italian international Jorginho from Chelsea. The midfielder crosses the capital to provide us with additional options in the middle of the park, as well as offer plenty of experience having put together a glittering CV during his time in Italy and England.\nIn terms of departures, we saw a trio of loan exits on the final day of the window. Cedric Soares joined Fulham, while Sambi Lokonga also found himself remaining in the Premier League with Crystal Palace.\nMeanwhile, Marquinhos headed to Norwich City as he aims to gain further experience of English football, after making six appearances for us since his summer arrival.\nWomen’s\nOur first January signing was Dutch playmaker Victoria Pelova. Vivianne Miedema’s compatriot played against us when we met Ajax in the Women’s Champions League qualifiers in September and since becoming a Gunner, she’s already bagged two assists and a goal in her full club debut.\nHotly-tipped Danish teenager Kathrine Kuhl was next to join our ranks. The technically gifted midfielder arrived from Elitedivisionen side FC Nordsjælland and has been capped on multiple occasions for the Danish national side. What’s more, Kuhl is already off the mark for us, featuring in both our opening domestic cup ties and producing a Player of the Match performance in the latter.\nCanadian goalkeeper Sabrina D’Angelo was our last winter arrival, coming from Vittsjö GIK from the Damallsvenskan. She impressed on her debut, keeping a clean sheet against Aston Villa in the Continental Tyres Cup quarter-finals.\nOur summer signing from Barcelona, Gio Queiroz, also returned from a loan spell at Everton, and the Brazilian winger made an impressive first appearance for us in the FA Cup against Leeds United.\nWhen it came to departures, we said farewell to a club legend. After 270 appearances, three WSL titles and four FA Cups, Jordan Nobbs made a permanent move to Aston Villa, marking the end of an incredible 12-year career in the red and white.\nJapan international Mana Iwabuchi also departed for Tottenham Hotspur after two years with us.\nAcademy\nAfter being recalled from his loan spell at Stoke City, Harry Clarke was our one and only academy player to make a permanent switch following his move to Ipswich Town - the club we signed him from as a youngster.\nA few players found new temporary homes in the Championship, with Brooke Norton-Cuffy signing for Coventry City while Miguel Azeez ended his time at Ibiza and moved to Wigan Athletic, where he was joined by Omar Rekik on deadline day. However, Salah-Eddine Oulad M'hand was recalled from his stint at Hull City.\nTaylor Foran headed to Hartlepool United to gain his first taste of professional football, as will Kido Taylor-Hart and Billy Vigar who both joined League One side Derby County, and Nathan Butler-Oyedeji at Accrington Stanley.\nThree goalkeepers also headed to pastures new for the remainder of the season. Having impressed for Crewe Alexandra over recent months, Arthur Okonkwo headed to Sturm Graz in Austria, Ovie Ejeheri swapped Chelmsford City for Finnish side SJK Seinajoki, while Tom Smith also made the step up to the Football League by moving to Colchester United.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 713,
  "scraped_at": "2026-02-14T12:21:33.575004"
}