{
  "article_id": "8f5ce53416d6",
  "url": "https://www.brandonsun.com/local/2025/05/15/lets-do-something-may-15-2025",
  "title": "Let Do Something May 15 , 2025 – Brandon Sun",
  "date": "20250515T084500Z",
  "domain": "brandonsun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Let’s Do Something — May 15, 2025\nAdvertisement\nTo get your event featured in a future edition of Let’s Do Something, please send an email to carthur@brandonsun.com with “Let’s Do Something” in the subject line.\nRead this article for free:\nor\nAlready have an account? Log in here »\nWe need your support!\nLocal journalism needs your support!\nAs we navigate through unprecedented times, our journalists are working harder than ever to bring you the latest local updates to keep you safe and informed.\nNow, more than ever, we need your support.\nStarting at $15.99 plus taxes every four weeks you can access your Brandon Sun online and full access to all content as it appears on our website.\nSubscribe Nowor call circulation directly at (204) 727-0527.\nYour pledge helps to ensure we provide the news that matters most to your community!\nTo continue reading, please subscribe:\nAdd Brandon Sun access to your Free Press subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $20.00 plus GST for four weeks. After four weeks, your payment will increase to $24.00 plus GST every four weeks.\nTo get your event featured in a future edition of Let’s Do Something, please send an email to carthur@brandonsun.com with “Let’s Do Something” in the subject line.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 15/05/2025 (275 days ago), so information in it may no longer be current.\nTo get your event featured in a future edition of Let’s Do Something, please send an email to carthur@brandonsun.com with “Let’s Do Something” in the subject line.\nTODAY\n• Day — Westman Wilderness Club Event: Evening bike ride in Brandon. Please contact Judy at 204-720-7892 (phone or text) or email judy.bartel@gmail.com.\n• 1 p.m. — Moose Hide Campaign Day takes place at Princess Park. The Men’s Resource Centre of Brandon is proud to support Assiniboine College in standing up against violence toward women and children. Meet at the MRC (153 Eighth St.) at 1 p.m., then we will head over to Princess Park together before the walk starts at 2 p.m. Stick around after for a free community barbecue. Let’s walk in support of healing, respect and safer communities for everyone.\n• 5:30 p.m. — City of Brandon Parks and Recreation is offering a Watercolour for the Beginner Workshop from May 15 to June 19, 5:30 p.m. to 6:30 p.m. at the Cultural Resource Centre (638 Princess Ave., Door B). Perfect for those new to watercolour or looking to refine their skills. Register at tinyurl.com/42y6yz22. Limited spaces available.\n• 6 p.m. — Cruise Night takes place in downtown Brandon on Rosser Avenue between Sixth Street and 13th Street from 6 to 9 p.m. People wishing to show their vehicles should enter the event at the intersection of Rosser Avenue and 13th Street. All vehicles are welcome. Free to participants and spectators. Presented by Brandon & Area Car Enthusiasts (BACE), Kelleher Ford, Cal Jackson of Integral Realty and Off The Wall Signs.\n• 6:30 p.m. — Fusion Credit Union presents the Westman Lip Sync Battle in the Grand Salon at the Victoria Inn (3550 Victoria Ave.). Join us for one of the most unforgettable corporate events of the year. Watch local teams go head-to-head in the ultimate showdown of lip-syncing legends. Doors open at 6:30 p.m.; battle begins at 7:45 p.m. Tickets are $35 for individual; $280 for a table of eight. For tickets, visit support.brandonuw.ca.\nFRIDAY\n• 9 a.m. — The Brandon Farmers’ Market takes place every Friday at The Town Centre (800 Rosser Ave.), with fresh produce, baking, jams and jellies, pickling, crafts, beeswax candles and more until 4 p.m. This farmers’ market runs year-round.\nSATURDAY\n• 10 a.m. — May long weekend in Sandy Lake will feature an old-fashioned street market at 127 Main St. until 2 p.m. each day.\n• 10 a.m. — “At the Farm Gate” spring market takes place at Onanole Rec Centre until 3 p.m. Regional and local goods, arts, farm produce and baked goods. Free admission.\n• 10 a.m. — Western Fortunes Inc. presents “Don’t Give a Buck Barrel Race” at the Virden Outdoor Rodeo Grounds (900 Fifth Ave. South) this weekend. Toonie runs at 10 a.m.; barrel racing at 1 p.m. Wedding fundraiser barrel race in honour of Janet Rankin and Ory Brown.\n• 11 a.m. — Vincent Massey Car Smash and barbecue fundraiser for Safe Grad will be held in the Giant Tiger parking lot until 4 p.m. (last waivers at 3:30 p.m.) Supported by Mothers Against Drunk Driving. No open shoes. 16+ event. $5 for one minute; $10 for three minutes; $20 for five minutes. Rain date May 31.\n• 1 p.m. — The Brandon Hills Model Railway Club meets every Saturday at the Commonwealth Air Training Plan Museum (H-hut) from 1 to 4 p.m. Free admission, but donations are welcome. Contact Barry at 204-724-7603; Erich at 204-761-1244 or Tony at 204-761-2631.\n• 7:30 p.m. — The Royal Winnipeg Ballet School’s “On the Edge Tour,” celebrating 85 years of artistic excellence, takes place at the Western Manitoba Centennial Auditorium. Tickets available at wmca.ca or by calling 204-728-9510.\n• 8 p.m. — Join Winnipeg Paranormal Group for the first time at the Brandon General Museum (19 Ninth St.), where history has many questions. Together we will try to find answers and see if the paranormal exists. Winnipeg Paranormal Group will bring its equipment, teach you how to use it and help you investigate this 100-year-old building with many secrets. Minimum age requirement is 16. Tickets on sale at 3common.com/event. Registration at 8 p.m., with event starting at 8:30 p.m. For more information, you may email wpgparanormal@gmail.com.\nSUNDAY\n• 8 a.m. — Western Fortunes Inc. presents “Don’t Give a Buck Barrel Race” at the Virden Outdoor Rodeo Grounds (900 Fifth Ave. South) this weekend. Pre-booked TOs at 8 a.m.; barrel racing at 1 p.m.\n• 10 a.m. — May long weekend in Sandy Lake will feature an old-fashioned street market at 127 Main St. until 2 p.m.\nMONDAY\n• 10 a.m. — Join us for line dancing at Seniors for Seniors (311 Park Ave. East). Level 1: easy beginner, no experience, Mondays from 10 to 11:30 a.m. or 6 to 7 p.m.; Level 2: advanced, some experience is recommended, understanding of basic steps and terminology, Mondays or Wednesdays from 1:30 to 3:30 p.m. Drop-in classes or punch cards can be purchased. Members, $3.50; non-members, $4.50. For more info, call Marilyn at 204-679-8081.\n• 11 a.m. — Western Fortunes Inc. presents “Don’t Give a Buck Barrel Race” at the Virden Outdoor Rodeo Grounds (900 Fifth Ave. South). Breakaway roping 11 a.m.; team roping 2 p.m. Wedding fundraiser roping in honour of Janet Rankin and Ory Brown.\n• 1 and 3:30 p.m. — Steppin’ Time Dance Studio’s Encore Celebrating 30 Years of Dance Performances in all styles of dance will be held at the Western Manitoba Centennial Auditorium. Tickets available at wmca.ca or by calling 204-728-9510.\n• 2 p.m. — Rural Manitoba Football League presents the Challenge Cup 2025 — RMFL vs. Saskatchewan at École secondaire Neelin High School (1020 Brandon Ave.). Team Sask. vs Team Toba with kickoff at 2 p.m.\n• 6:30 p.m. — UCT Bingo takes place every Monday at 205 College Ave. Doors open at 4 p.m., with early-bird start at 6:30 p.m. and regular games at 7:10 p.m. Canteen available. Proceeds stay in Brandon for needs in the community.\n• 6:30 p.m. — Women in Harmony rehearses on Mondays at Trinity United Church in Brandon (1515 Sixth St.). If you would like to check out a rehearsal to see if singing barbershop music with a dynamic and welcoming group of women is for you, join us Mondays at 7 p.m. For more information, call Naomi at 204-724-5152 or email womeninharmony1975@gmail.com.\nTUESDAY\n• 6 p.m. — Steppin’ Time Dance Studio’s Encore Celebrating 30 Years of Dance Performances in all styles of dance will be held at the Western Manitoba Centennial Auditorium. Tickets available at wmca.ca or by calling 204-728-9510.\nWEDNESDAY\n• Noon — Women with Cancer support group meets the third Wednesday of the month for lunch in the Blue Room at Pizza Place/Huggy’s at noon. For more information, contact Helena at 204-726-8315.\n• 1:30 to 3:30 p.m. — The Brandon Embroiderers meet weekly to share their love of needlework, learn new skills and stitch together. All levels and abilities are welcome to attend. Call Dianne at 204-725-1445 or Darlene at 204-727-1624 for more information.\n• 1:30 p.m. — Come and join us for line dancing at Seniors for Seniors (311 Park Ave. East). Level 2: advanced; some experience is recommended, understanding of basic steps and terminology. Mondays or Wednesdays from 1:30 to 3:30 p.m. Drop-in classes or punch cards can be purchased. Members, $3.50; non-members, $4.50. For more information, call Marilyn at 204-679-8081.\n• 6 p.m. — Steppin’ Time Dance Studio’s Encore Celebrating 30 Years of Dance Performances in all styles of dance will be held at the Western Manitoba Centennial Auditorium. Tickets available at wmca.ca or by calling 204-728-9510.\n• 7:30 p.m. — Please join us at an “opener” Spring Concert of the 19th Clear Lake Chamber Music Festival in the Lorne Watson Recital Hall. Dedicated to the 150th anniversary of Maurice Ravel and featuring Alexander Tselyakov, piano. Adults $30 in advance or $35 at the door; seniors/students $20 in advance or $25 at the door. Tickets are available at the door or in advance by text or phone to 204-922-4924 or 204-727-9631 or email burba@brandonu.ca.\nAT THE CLUBS\n(Note: Information subject to change after print deadline).\n• Lady of the Lake (135-B 17th St. North) — Re-Imagined plays their own interpretation of popular songs on Friday at The Lady at 8 p.m. $10 cover at the door. Upcoming: May 23, Roots 10 Collective. Tickets $15 — sorry, sold out.\n• The 40 (210 18th St. North, Brandon) — Look Music Services has the DJs spinning on Friday. No cover. Then join us on Saturday for Ramskull with Evil Piece and Manitou. Doors open at 9 p.m.; bands at 10 p.m. $10 cover. These are 18+ events and photo ID required.\n• Sand Hills Casino (777 Sand Hill Dr., Carberry) — Roulette takes to the stage on Friday and Saturday in the Oasis Bar and Grill. Live and always free.\n• Georgie’s Lounge at the Keystone Motor Inn (1050 18th St.) — Every Friday and Saturday from 8 p.m. to midnight, there is karaoke in Georgie’s Lounge.\n• Eastside Eatery (1451 Richmond Ave.) — This Friday at The Hall is Open Mic Night. 7:30 p.m. sign up. $5 cover. Bring your friends, bring your company, bring your energy. Reserve at table by calling 204-725-5226.\n• Chez Angela Bakery and Café (Unit C, 29 10th St., Brandon) — Free music Fridays from 6:15 to 7:30 p.m. This week: Ester & Carlos\n• Black Wheat Brewing (402 10th St.) — Join us every Saturday for “Music of the Decades.” Come for the tunes; stay for the fun.\n• Great Western Roadhouse (1125 18th St. at Canad Inns) — Avoid the bad weather and spend time at The Roadhouse with DJ Red on Friday.\n• Houstons Country Roadhouse (3130 Victoria Ave.) — It’s a Glow Party on Saturday at Houstons. Featuring Relapse. Free entry until 11 p.m.\n• The Dock on Princess (1133 Princess Ave.) — Join us on Tuesday at The Dock for Trivia Night at 6 p.m. Teams of four. Give us a call or send a message to book your spot. 204-726-1234 or email erin@thedockonprincess.com\nMUSEUMS AND GALLERIES\n• Daly House Museum (122 18th St., Brandon) — Built in 1882, original home of Brandon’s first mayor, Thomas Mayne Daly. Artifacts include a collection of late 19th-century and early 20th-century furnishings, First World War memorabilia. Hours: Tuesday to Saturday, 10 a.m. to noon and 1 to 4 p.m. (September to June). Admission: $7 adults; $6 seniors and youth (6-18); family (up to two adults and three children), $13; children under five, free. For more info, visit dalyhousemuseum.ca or call 204-727-1722.\n• Art Gallery of Southwestern Manitoba (Unit 2, 710 Rosser Ave., Brandon) — Manitoba’s oldest centre for visual art and one of Canada’s first since 1907. The AGSM boasts two exhibition spaces, an art school and gift shop that supports more than 60 local Manitoba artists. “Prairie Thunder” in the Main Gallery now until June 7, featuring Indigenous women artists from across the Prairies and curated by Stacey Koosel and Marie-Anne Redhead. Join us on Thursday from 6-7 p.m. for a tour of this exhibition with the curators in person at the gallery. Hours: Tuesday to Friday, 10 a.m. to 5 p.m.; Thursday, 10 a.m. to 9 p.m.; Saturday, noon to 5 p.m.; closed Sunday and Monday. Entry to the gallery inside The Town Centre parkade in the northeast corner. For more information, visit agsm.ca.\n• 26th Field Regiment RCA/XII Manitoba Dragoons Museum (within the Brandon Armoury, 1116 Victoria Ave. Please use 11th Street door) — Open Tuesdays from 9 a.m. to 4 p.m. and closed for lunch. Also open by appointment by calling 204-717-4579. Visit our websites: 26fdregmuseum.ca or 12mbdragoons.com.\n• Brandon General Museum and Archives (19 Ninth St., Unit 101) — Attractions include the Brandon History Hall, Manitoba Telephone History, the BJ Hales Natural History Collection and rotating exhibits celebrating Brandon’s roots. Guided visits are Tuesday to Saturday, noon to 4 p.m. Admission by donation. Booking in advance is strongly recommended. Phone 204-717-1514 or email bgmainfo@wcgwave.ca.\n• Commonwealth Air Training Plan Museum (CATPM) (Brandon Municipal Airport, Highway 10, 1.6 kilometres north of Brandon) — Canada’s only air museum solely dedicated to the preservation of those who trained and fought for the British Commonwealth during the Second World War. Summer hours for the museum are 10 a.m. to 4 p.m. Our gallery has new interpretive displays explaining the BCATP. Visitors will be invited to travel back to the 1940s while touring a Second World War-vintage hangar serving as a display for aircraft, vehicles and hundreds of artifacts from that era. RCAF members who lost their lives during the Second World War are honoured on the museum’s RCAF Second World War Memorial Wall. For more information, call the museum at 204-727-2444 or visit us on Facebook.\n• Royal Canadian Artillery Museum (Building N-118 Patricia Rd., CFB Shilo) — We opened our new temporary exhibit, marking the 110th anniversary of the start of the First World War. The main features of the exhibit include a trench wall, First World War artillery and two machine-gun pits. Open 10 a.m. to 4 p.m. Monday to Friday. Admission: $10 for adults; $5 for seniors and students; children under 6, free. Phone 204-765-3000 (ext. 3570) or email RCAMuseum@forces.gc.ca.\n• Killarney’s Heritage Home for the Arts (44 Water Ave., Killarney) — Killarney Turtle Mountain Arts Council’s gallery is in the Heritage Home for the Arts. Gallery hours are Tuesday to Saturday, 1 to 4 p.m.; closed all statutory holidays. Special tours can be arranged by calling 204-554-0023. You can also visit Killarney-Turtle Mountain Arts Council on Facebook, @killarneyarts on Instagram or our website at killarneyarts.com.\n• ArtsForward (293 Mountain Ave., Neepawa) — ArtsForward is the central arts venue in Neepawa in visual, literary, performing and material arts. Hours: 9 a.m. to 4:30 p.m., Monday to Thursday; 8:30 a.m. to 4 p.m. on Friday; closed on weekends.\n• Virden Pioneer Home Museum (390 King St. West, Virden) — Opens May 20. Come enjoy our wealth of local history as you explore what life looked like in Victorian Canada. For more information, email virdenpioneermuseum@wcgwave.ca or call 204-748-1659.\n• Arts West Travelling Gallery — Features work by Westman region artists on exhibition at the Western Manitoba Centennial Auditorium (205 20th St.) until May 26. Hours: 10 a.m. to 4 p.m. Monday to Friday. Work on display was chosen from entries to the 2024 Westman Juried Art Show.\nUPCOMING EVENTS\n• May 22 — 365 Group for cancer survivors, caregivers and those who love them meets at Murray House (521 Frederick St.) the fourth Thursday of each month at 1 p.m. Please call Larry 204-728-0221 or Anne 204-728-9958 to register or for more information.\n• May 22 — Steppin’ Time Dance Studio’s Encore Celebrating 30 Years of Dance Performances in all styles of dance will be held at the Western Manitoba Centennial Auditorium at 6 p.m. Tickets available at wmca.ca or by calling 204-728-9510.\n• May 23 — Westman Youth For Christ presents its third annual art exhibition fundraising event, “Inspired By Nature,” showcasing the work of many Manitoba artists. Enjoy and evening of art, music and snacks with friends as well as the opportunity to purchase art for a great cause. Event takes place at the Firehall Event Venue (637 Princess Ave.) from 6:30 p.m. to 9 p.m. Tickets available at yfc.ca/westman/art-exhibition-and-sale\n• May 23 — Our Journey 2025 — Celebrating Indigenous Student Success takes place at the Riverbank Discovery Centre. Pipe ceremony at 8 a.m.; registration 9 a.m. followed by Journey activities. Grand entry at 11 a.m.; lunch at noon; games at 1:30 p.m.; supper 4 p.m.; second grand entry at 5:30 p.m.\n• May 23 — The Glenboro Ag Society presents Smoke Your Face Off meat smoking competition to help raise funds for their Animal Husbandry Scholarship, presented to a graduate of Glenboro School every year. This is a two-part event starting off with the publicly judged meat smoking competition. Doors open at 5 p.m. and event runs from 5:30 p.m. to 7:30 p.m. Followed by a social at 8:30 p.m. Music by Beef DJ Services. Event tickets and social tickets are sold separately. Event tickets are $25; social tickets $10. To enter the competition as a “smoker,” call Ernie Bezaire at 431-541-4167.\n• May 23 — The Counselling Centre for hope, healing and encouragement celebrates 40 years of service with a concert featuring Tom Jackson, Brandon’s own Prairie Blend, The Good Hearted Warriors (Akicita Cante Waste) at Knox United Church at 7 p.m. Doors open at 6:40 p.m. Tickets are $20. For more information and tickets, call 204-726-8706.\n• May 23-24 — For the fourth consecutive year, Professional Bull Riders (PBR), Canada’s elite Cup Series returns to Brandon. The PBR Mazergroup Chute Out takes place in Westoba Place at the Keystone Centre at 7 p.m. This year, the event has expanded to two days. The PBR Mazergroup Chute Out will have added significance as the lone PBR Canada Cup Series event in Manitoba for the 2025 season. Tickets available at ticketmaster.ca/professional-bull-riders-tickets/artist/848537\n• May 23-24 and 30-31 — City of Brandon presents the fourth annual City-Wide Yard Sale weekend. May 23 and 24 will feature sales west of 18th Street. On May 30 and 31, it will be east of 18th Street.\n• May 23-25 — PrairieCon XLIV takes place at the Keystone Centre over the weekend. Join us for a weekend of role-playing games, miniature games, collectible card games and board games. We will also feature events such as our annual Dungeons and Dragons tournament, our game auction, and a cosplay contest. Also raffles and draws. Doors open on May 23 at 11 a.m.; gaming start at noon; facility closes at midnight. There are no scheduled meal breaks, you need to fit your own meal breaks in. Doors open on May 24 at 8 a.m.; gaming at 9 a.m.; Cosplay time TBA; auction at 6 p.m.; closes at midnight. Doors open on May 25 at 8 a.m.; gaming 9 a.m.; facility closes at 6 p.m.\n• May 24 — Westman Wilderness Club Event: Kayak or paddle the Assiniboine River with Dennis from Kirkham’s Bridge downstream to the Riverbank Discovery Centre in Brandon. Contact Dennis for more details at 204-922-4920.\n• May 24 — Roots 10 Collective take the stage at Poor Michael’s Emporium (corner of Highway 10 and Albin Avenue, Onanole). Tickets are $25 in advance. For more information or to reserve tickets, call 204-848-0336.\n• May 24 — Westman Gardeners Club is holding a plant and yard sale from 9 a.m. to 2 p.m. at the Central Community Centre (529 Fourth St.). Shop for annuals, perennials, herbs, house plants, gardening books and miscellaneous items.\n• May 24 — The Brandon Garden Club is hosting its annual plant sale fundraiser in the Dome Building on the Keystone Centre grounds from 9 a.m. to 3 p.m.\n• May 24 — The Riverbank Discovery Centre Farmers Market takes place every Saturday, May 24 to Sept. 27 from 9 a.m. to 2 p.m. at 525 Conservation Drive. Come join us under the trees for an amazing variety of vendors this summer!\n• May 24 — Canadian Wrestling’s Elite will be making a stop in Rivers on the “Point to Prove Tour” to fundraise for the Rivers Firefighters. Featuring TNA Legend “Cowboy” James Storm and a steel cage match! Doors at the Riverdale Community Centre (101 Main St.) will open at 6 p.m. with bell time at 7 p.m. Tickets are $15 in advance; $20 at the door. Kids 12 and under $10. Advance tickets available at CB Aspire Salon, Rivers Legion or any Rivers firefighter.\n• May 24 — Fur and Claw Market are hosting a spring market in the UCT Pavilion at the Keystone Centre from 11 a.m. to 4 p.m. Free entry.\n• May 24-25 — MBMX (Grassroots Motocross) Round 2 will take place at the TransCanada Motocross Park (west of Brandon on the Trans-Canada Highway). May 24, open practice from 10 a.m. to 4 p.m.; May 25, Race Day from 8 a.m. to 5:30 p.m.\n• May 25 — The YMCA Strong Kids Run raises funds to give children access to the Y’s facilities and programs. Takes place in downtown Brandon with four different timed events: 5K, 10K, 15K, and 20K as well as a 1K Family Fun Run, 5K walk and a 10k walk. The race starts outside the YMCA located at 231 Eighth Street. Registration is now open. Visit ymcabrandon.ca/programs/strong-kids-run\n• May 25 — The Road Rebels fourth annual Car Show and Poker Derby barbecue will be held at Dinsdale Park on First Street from 11:30 a.m. to 8 p.m. In support of the Elspeth Reid Family Resource Centre and Crocus Plains Secondary School Scholarship Program. Registration at 11:30 a.m. with a noon start. Return by 4 p.m. to pick your cards. Car show and barbecue starts at 4 p.m. Music and emcee by Double Clutchin’ Dave. Free viewing to the general public from 4 to 8 p.m. Everyone welcome, cars, trucks, motorcycles, special interest vehicles. Route is approximately 200 to 250 kilometres.\n• May 25 — Westman Dreams For Kids Children’s Country Fair will be held at the Keystone Centre grounds from 10 a.m. to 4 p.m. Features crafts, horse and wagon rides, inflatables, sports, science, petting zoo, cookie decorating and much more. And it is free for families to attend.\n• June 21 — The ever popular Lobsterfest returns to Shilo. Join us for a delicious stead and lobster dinner with live music and amazing prices in Building L-25. Doors open at 5:30 p.m.; meal at 7 p.m.; band Crossfyre at 9 p.m. Tickets are on sale now until they sell out. Only 800 tickets available. Tickets are available at all three messes, mess office, RCA Museum, Cursed Coffee and 340 Esso on Shilo Road or in Brandon at Smitty’s in the Shoppers Mall, Sobeys West End or in Carberry at the Carberry Legion. Free transportation from Brandon: Bus leaves from McDonald’s at 18th Street and Richmond Avenue at 5 p.m. and 6:30 p.m. Return trip departs CFB Shilo at 11 p.m. and 12:30 a.m.\n» The Brandon Sun",
  "word_count": 3960,
  "scraped_at": "2026-02-14T12:58:16.022370"
}