{
  "article_id": "8f666b71d167",
  "url": "https://www.newstatesman.com/politics/media/2025/05/gary-lineker-they-think-its-all-over-it-is-now",
  "title": "Gary Lineker , they think it all over . It is now . ",
  "date": "20250524T110000Z",
  "domain": "newstatesman.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When I visited Gary Lineker at home in west London in November last year, to interview him for my final issue as editor of the New Statesman, I found him in reflective mood and deeply troubled by the war in Gaza. He had announced that he was leaving the BBC and would stop presenting Match of the Day at the end of the current football season. As it turned out, it was to be more of an extended farewell than a final goodbye because he would continue to present live football coverage for the corporation, culminating in the 2026 World Cup, which is being held in the US, Canada and Mexico. Lineker was finally going but in his own way and on his own terms.\nBut it hasn’t turned out liked that: Lineker will leave the BBC this evening after presenting his final edition of Match of the Day live from Salford. He lost control of his own choreographed departure after reposting on Instagram an anti-Zionist video that featured a rat emoji, a Nazi-era anti-Semitic trope. He deleted the post and profusely apologised after he realised what he had done – he said that he hadn’t noticed the rat – but it was too late: even Tim Davie, the long-suffering director-general of the BBC, understood that Lineker could not continue to be employed by the corporation after this latest firestorm of outrage.\nOne would have thought that Lineker would have learned from previous controversies to be more cautious about anything he posted on social media, especially on the issue of Israel-Palestine. He was not. “Gary has immatured with age,” one of his friends told me. “He is living his life backwards. As he gets older, he sounds more and more like a student.”\nLineker has a different explanation. He said that when he was a footballer, he was selfish and insular, like many players, and lacked the empathy he now has. Politics existed in a life elsewhere. Back then he concentrated on scoring goals and earning as much money as he could, moving from Leicester to Everton (when they were league champions) to Barcelona to Spurs, before finishing his career in Japan. Had he been playing today, he would probably have ended up in Saudi Arabia, scoring goals in front of a few thousand fans but earning many millions a month tax free in the desert heat.\nWhen we met, Lineker couldn’t understand why there had been such media interest in his decision to leave Match of the Day: this was the first interview he’d given since the news of his departure had been confirmed after prolonged speculation; there was chatter about disagreements with the BBC’s new head of sport, Alex Kay-Jelski, who had joined from the Athletic, an online sports site. He reportedly wanted to reinvigorate, or refresh, or revitalise Match of the Day. Or perhaps he simply didn’t want to work with Gary Lineker, who over the years had become inseparable from the show and had evolved into an extremely competent frontman but one with a penchant for bad puns. “I’m just the presenter of a football highlights show,” he told me.\nLineker knows he is much more than that: as a former England football captain who played at Barça under Johan Cruyff; as the highest paid broadcaster at the BBC; as a podcast impresario, co-founder of the independent production group Goalhanger; as a serial endorser of corporate brands such as Walkers crisps, he is, as Matthew Syed has written, “one of the most successful individuals in the UK, a master in the art of reinvention”. He is also one of the most envied and reviled – because of his totemic status at the BBC and willingness to challenge to breaking point its guidelines on presenter impartiality.\nSpeaking to Lineker, I got the sense that, even now, he could not fully understand why he wasn’t free to speak out on what he called “humanitarian” issues. He was not a BBC politics presenter or newsreader. He did not work in news. He was a football highlights show presenter! The right-wing press were obsessed with him, he said – “I don’t know if it’s anything sexual or anything like that!” He did not seem to understand that the issue here was not one of free speech or even his trenchant opposition to Benjamin Netanyahu; it was about his role at the BBC and its charter commitment to impartiality.\nHe had been following on social media a young girl, Renad Attallah, who was trapped with her mother inside Gaza. His eyes filled with tears as he spoke about her: he cried often when looking at images of death and suffering in Gaza. “If something happened to her, I’d genuinely… she’s a brilliant little chef, and so sweet, you think [he whispers]: fuck, how could people kill these people? How can they do that? How can you even contemplate – it’s fucking awful.”\nAs we sat at the high windows in his front room looking out over rough common nearby, he pushed back against those who’d accused him of anti-Semitism and said that what had happened in Gaza, since the full-scale war began following the Hamas atrocities of 7 October 2023, was worse than the Iraq War. “I’m anti-Israel government. I’m not in the slightest bit anti-Semitic. I’m not anti-anybody. I am anti-bad people, and there are really bad people involved in this. Eventually, whether it’s five years’, ten years’, 20 years’ time, I think we’ll look at that [the war in Gaza] and we’ll see it the same way as Iraq times ten. I do, I just genuinely do.”\nHe said he felt helpless – and enraged. “It’s just got worse and worse, hasn’t it? There’s nothing we can do… I mean, it’s awful. I don’t know how you can be on a side on this, other than the side of the children and the side of the women and the innocent people that are being killed constantly now. Yes, same sympathies on October 7, and before October 7 there were things that happened, but what’s going on now is just…”\nBefore Lineker joined Match of the Day, the programme had been presented by Desmond Lynam, a suavely composed broadcaster who never said anything remotely political. Lineker watched and studied Lynam carefully. He noticed how he introduced the programme by welcoming viewers: “Thank you for joining us this evening.” He liked that inclusive “us” and admired Lynam’s urbane style and coolness under pressure during live broadcasts. He sought to emulate him. Lynam is impressed by how Lineker refined his style but, at first, he said recently, he’d found him “a bit humble and a little naive. He didn’t project very well.”\nFor all his accomplishments, the naivety remains. I didn’t find him at all grand or self-celebrating in our interview last year. He answered questions candidly and even guilelessly. If there was a deeper calculation, I was not aware of it. A shrewder, more sophisticated operator would surely have been more circumspect on social media and not have blundered so abjectly as he has in recent weeks.\nReflecting on his extraordinary success in multiple careers, Gary Lineker said: “I don’t believe in gods and stuff… but I wonder if there’s a planet somewhere that’s got PlayStation and there’s someone playing me who’s a really good player! I’ve had the most amazing life. Because if I drop dead tomorrow [we were speaking a few days before his 64th birthday on 30 November], I’m thankful to my PlayStation friend.”\nOn this occasion, the friend misfired. Perhaps he didn’t see the rat. They think it’s all over. It is now. At the BBC, at least.\n[See more: Rafael Nadal, the king of Paris]",
  "word_count": 1289,
  "scraped_at": "2026-02-14T12:50:26.159525"
}