{
  "article_id": "8f7bc2f3e669",
  "url": "https://www.thisdaylive.com:443/index.php/2024/03/23/nff-charges-falconets-to-focus-on-world-cup-after-african-games-gold-medal-loss",
  "title": "NFF Charges Falconets to Focus on World Cup after African Game Gold Medal Loss",
  "date": "20240323T183000Z",
  "domain": "thisdaylive.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Latest Headlines\nNFF Charges Falconets to Focus on World Cup after African Games’ Gold Medal Loss\nPresident of Nigeria Football Federation, Alhaji Ibrahim Musa Gusau has implored players and officials of the U20 girls, Falconets to put behind them the loss of the African Games women’s football event gold medal to Ghana and work assiduously towards making a huge impression at this year’s FIFA U20 Women’s World Cup.\nGusau spoke against the background of the Falconets’ 1-2 extra-time defeat by the Black Princesses of Ghana in the final match of the 13th African Games women’s football event played in Cape Coast on Thursday night.\n“You played well and showed good skills and team work all the way to the final, but your best was not good enough to retain the gold medal. There is no need and there will never be any gain crying over spilt milk. The onus is now on you and the coaches to focus on the FIFA World Cup finals coming up later this year.\n“In truth, the NFF and Nigerians expected you to retain the gold medal, having scored eight goals and conceded none until the final match. That is gone now and the World Cup beckons. Your collective objective should be to win the World Cup trophy for the first time. The NFF will give you all the support to prepare adequately and face the world’s best in Colombia,” Gusau toldthenff.com.\nThe Falconets have participated in every edition of the FIFA U20 Women’s World Cup since the competition was launched as an U19 tournament in Canada in 2002. They have now qualified for this year’s championship after overpowering the U20 girls of Tanzania and Burundi in the African qualifying series.\n“In 2010 and 2014, though they lost on both occasions to Germany. They were in the semi-finals in Japan in 2012, and at the last edition in Costa Rica, they reached the quarter-finals.\n“There has been some consistency in our performance over the years and it is time to take the step up and claim the title. That can only be done by hard work, focus and self-belief. The hard work must start right now.”\nThis year’s FIFA U20 Women’s World Cup finals will take place 31st – 22nd September in Colombia.",
  "word_count": 378,
  "scraped_at": "2026-02-14T12:31:56.721481"
}