{
  "article_id": "8f7e8bed18fa",
  "url": "https://barbadostoday.bb/2023/06/01/shaw-earns-contract-extension-with-man-city/",
  "title": "Shaw earns contract extension with Man City",
  "date": "20230601T064500Z",
  "domain": "barbadostoday.bb",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester City’s red-hot Reggae Girl striker Khadija “Bunny” Shaw has been rewarded for an outstanding season with a two-year contract extension, which will keep her in England’s northwest until 2026.\nThe 26-year-old banged in 31 goals in 30 appearances in all competitions, helping the City to a fourth place finish in the Women’s Super League on 47 points, barely missing out on the European places.\nChelsea tallied 58 points to be crowned champions, two clear of second placed Manchester United.\nShaw has now tallied 50 goals for the club since her arrival from French side Bordeaux in 2021 on a three-year contract.\n“I’m delighted to continue my journey with this amazing group,” said Shaw, born in Spanish Town in Jamaica’s southeast.\n“Everyone made me feel welcome from the first day I came here. I enjoy the way we play and I’m at a stage now where I understand the way we play and I can only get better and grow.\n“I think here at City is the perfect place for me. I put all my effort and time on the pitch and obviously for the position I play and the quality I have around me, I know I’m going to be in positions to score goals. “\nShe continued: “I’ve always said Manchester feels like home away from home too. I enjoy coming into the City ground every day and training with the group, vibing with the girls and I also have family here, so Manchester has felt like home ever since I arrived.\n“I just want to thank our fans for everything, all the love and support they’ve given me since I arrived. I’ll just try my best to continue repaying them on the football pitch.”\nDuring the season, Shaw won two Player-of-the-Month awards and only recently nabbed the club’s Player-of-the-Season honour.\nShe also won City’s goal of the season for her strike against Arsenal last April and earlier this year was named CONCACAF Women’s Player-of-the-Year.\n“Bunny’s growth and development as a player over the past two years, but particularly this season, has been fantastic and we’re thrilled to see her extend her contract with us,” said head coach, Gareth Taylor.\n“She has thrived having had the opportunity of extended runs in the team throughout the current campaign and has shown on a regular basis what a talent she is and why we brought her to the club.\n“She scored goals regularly in France and America prior to joining us, and has now shown what she’s capable of in England too which says a lot about her ability. She is still a young player though who wants to improve and is hungry for success, and we’re only scratching the surface with her which is a very exciting prospect as we aim to develop her even further over the next three years.” (CMC)",
  "word_count": 473,
  "scraped_at": "2026-02-14T12:39:30.319619"
}