{
  "article_id": "8fb14c0a6660",
  "url": "https://www.thedp.com/article/2023/03/top-10-athletes-penn-quakers-history",
  "title": "The top 10 greatest athletes in Penn history",
  "date": "20230302T054500Z",
  "domain": "thedp.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Penn is a school well-known for its successful alumni in fields ranging from business to politics to entertainment, but it has also produced a steady stream of esteemed athletes throughout the years. We take a look at the 10 best athletes to ever don the Red and Blue, with emphasis given to their time at Penn.\n10. Julie Ann Staver — lacrosse/field hockey, Class of 1974\nPlaying in the wake of Title IX’s passage, Staver was Penn’s first great female athlete. Being named an All-American in both lacrosse and field hockey, Staver later went on to captain the U.S. women's national field hockey Olympic team two times. To this day, the Starver Award is annually awarded to the Penn player who, like Staver, best excels in both sports.\n9. Mark DeRosa — baseball/football, Class of 1997\nWhile the current MLB Network analyst is best known for his 16-year professional baseball career that saw him hit 100 home runs, before he made the big leagues, he made a big impact on campus. The two-sport athlete quarterbacked the football team to back-to-back Ivy League championships — the first of which capped off an undefeated season. On the diamond, he notched 133 hits over three seasons as a shortstop for the Quakers before being drafted by the Atlanta Braves after his junior year.\n8. Matt Valenti — wrestling, Class of 2007\nThe all-time winningest wrestler in Quaker history, Valenti was three times a first-team All-Ivy selection and became both the third and fourth national champion in program history when he won in 2006 and 2007, respectively. Valenti holds a share of the record for most wins in a season at 36 — a mark he achieved twice. Since graduating, Valenti has remained involved in Penn Athletics, from serving as an assistant coach on the wrestling team to his current position as an associate athletic director.\n7. Nia Akins — track and field/cross country, Class of 2020\nA recent grad, Akins’s list of career accomplishments rivals the Nile River in length. Holding an astounding eight program records, the 800 meter was Akins’ calling card at Penn as she recorded the second-fastest time in NCAA history at 2:00.71. In a truly dominant stretch from 2018-19, Akins finished 14th in the Ivy Heptagonal Championships. For good measure, when the middle distance stalwart wasn’t dominating in track and field, she also earned All-Ivy accolades in cross country.\n6. Ernie Beck — basketball, Class of 1953\nHaving held the all-time scoring record for 67 years (despite only playing three seasons), the 6-foot-4 guard was perhaps an even better rebounder than he was a scorer — leading the nation in boards in 1951. The NBA Champion’s 22.3 career points per game average and 1,557 total rebounds remain program records. Now in his nineties, Beck remains a regular attendee of Palestra games and was on hand to see his total points record fall to A.J. Brodeur, another phenomenal Quaker who just barely missed the cut for this list. Beck can take solace in the fact that he played 37 fewer games than Brodeur over his Penn career, but still sits atop of the record books — making his scoring mark all the more impressive.\n5. Katy Cross — soccer, Class of 2005\nThere is no name more synonymous with Penn soccer than Katy Cross. Easily the best player in program history, she holds four of the top five spots on both the single season goal and assists leaderboards. In a true testament to her dominance, the sole four-time first-team All-Ivy honoree in Penn soccer history boasts 133 career points — 49 more than the second place mark of 84.\n4. Justin Watson — football, Class of 2018\nBefore he became the first Penn alum to play in and win a Super Bowl, the man known as “JWat” had one of the most dominant careers of any Quaker in history. The certified freak athlete holds the Penn receiving triple crown, having finished his career first all-time in receptions, receiving yards, and receiving touchdowns. A model of consistency, Watson holds the Ivy League record for most consecutive games with a reception at 40 (the maximum possible) and is first all-time in conference history in receiving yards with 2,675. Powering Penn to back-to-back Ivy championships in 2015 and 2016, Chiefs fans can only hope he brings the same magic to Arrowhead next year.\n3. Diana Caramanico — basketball, Class of 2001\nNot only is Caramanico the most dominant player in Penn women’s basketball history, she is arguably the most dominant in Ivy League history as well. Her 2,415 career points rank first all-time in the conference, and her 1,207 rebounds and 210 steals are the most ever for a Penn player. The only All-American in program history, she led the Quakers to their first Ivy title and first NCAA Tournament appearance as a senior, a year highlighted by her 42-point outburst against Albany — another program record.\n2. Alvin Kraenzlein — track and field, Class of 1900\nThe most influential athlete in Penn history, Kraenzlein achieved success in his sport by pioneering the straight-leg hurdling technique. This revolution led Kraenzlein to extraordinary success at Penn, as he broke three national records and was a seven-time All-American. His crowning achievement came in the 1900 Paris Olympics — where he won gold medals in four events: the 60-meter, the 110- and 200-m hurdles, and the broad jump. To this day, this stands as the most individual titles by a track athlete at one Olympics.\n1. Chuck Bednarik — football, Class of 1949\nThis selection will come as no surprise to anyone who read our story on the greatest athlete from every Ivy League school, or to anyone who is familiar with Bednarik’s story. Before embarking on an illustrious 14-year NFL career with the Philadelphia Eagles, “Concrete Charlie” excelled for Penn on offense, defense, and special teams — more than earning the moniker of the “60-minute man”. A Maxwell Award winner and three-time consensus All-American, Penn’s greatest athlete is memorialized with a fittingly gargantuan statue inside the Franklin Field concourse.",
  "word_count": 1014,
  "scraped_at": "2026-02-14T12:38:58.738093"
}