{
  "article_id": "8fdc370df31a",
  "url": "https://dailytrust.com/40-year-old-onome-ebi-not-ready-to-hang-up-boots/",
  "title": "40 - year old Onome Ebi not ready to hang up boots",
  "date": "20231021T030000Z",
  "domain": "dailytrust.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Super Falcons ageless captain, Onome Ebi, is no doubt a highly accomplished female footballer who has made a substantial impact on women’s football in Nigeria and abroad.\nBorn on May 8, 1983, Ebi started playing football at an early age and showed her talent and love for the game right away. Her dedication and commitment to the game eventually yielded lofty fruits as she has become one of the most successful female football players in the world.\nSince 2003, Onome has established herself as a mainstay in the defence of the Super Falcons, winning as many as 109 caps in an illustrious career that has seen her emerging as the only African player, male or female, to feature in six FIFA World Cups.\nShe was a member of the Super Eagles squad to the 2003, 2007, 2011, 2015, 2019 and 2023 editions of the World Cup. She was also a member of the team for the 2008 Beijing Olympic Games.\nMore Nigerian wrestlers will qualify for Paris Olympics – CG Customs\n‘Nigeria under threat of vaccine-derived polio’\nIn the same vein, Ebi was also a member of the Nigerian squad in the 2008, 2010, 2012, 2014, 2016 and 2018 editions of the African Women’s Championship, winning the tournament four times 2010, 2014 2016 and 2018.\nBefore she began to lace her boots for the Super Falcons, Ebi made her professional debut in 2001 with Omiridiran Babes where she spent eight years before switching over to another NWFL side, Bayelsa Queens.\nAfter a brief stint with the Queens of Bayelsa, Ebi moved abroad to play for several clubs in different countries. She first played for Piteå IF and Djurgårdens IF in Sweden’s Damallsvenskan from 2009 to 2010.\nFrom 2010 to 2022, she played for Duvenciler Lisesispor and Atasehir Belediyespor in Turkey, Sunnan SK in Sweden, ZFK Minsk in Belarus, Henan Jianye in China, then back to ZFK Minsk before her last club FC Levante Planas in Spain.\nAt 40 years, many had thought Ebi would call time on her career after the controversy that greeted her inclusion in the list of Super Falcons for the 2023 FIFA World Cup in Australia and New Zealand but the dark-horse continues to gallop on.\nOnly recently, she signed a short-term contract with NWFL side, Naija Ratels where she is to earn a monthly salary of N1.5m. In fact, she is now the highest paid player in the history of women football in Nigeria. And the Super Falcons Captain and her newest employers are excited about the deal.\nDuring her unveiling by Naija Ratels in Abuja, the central defender who loves to use jersey number 5 said she was fulfilling her dream of coming back to play in the league and inspire young female footballers.\n“After almost 13 years of playing football outside the shores of Nigeria, I have come to realise that one of the best decisions I’ve ever made is coming back to play in the Nigerian Women Football League. I’m feeling extremely happy.\n“The slogan of my new team is “One Day At A Time.” Here I am, fulfilling my lifelong dream of coming back to play in the Nigerian League one day at a time, and it is all adding up gradually.\n“My desire to beam the light on young girls is being fulfilled effortlessly. For the first time in my life, I feel fulfilled that I’m bringing all that I’ve ever achieved as a footballer back to where it all started, back to the Nigerian league.\n“I’m fulfilling my lifelong dream of being a part of another young girl’s life, an opportunity I never had with my football idols like Florence Omagbemi and many others whom I would have loved to train with, take pictures with, and play in the same league with them.\n“The calls and messages have confirmed that my decision was received with open arms across the globe. My lifelong dream of giving back to our own league where I played for 10 good years before travelling is finally being achieved. Seeing the joy on the faces of these young ladies who want to be like me is very reassuring.\n“In addition to the value my presence is adding to Naija Ratels players, my ultimate goal is to make my presence felt by players in other teams. The joy in my heart is priceless,” she said.\nThe president of Ratels Sports Development Foundation (RSDF), Barr. Paul Edeh, in appreciation of the player, announced that apart from her monthly salary, Ebi will be given a plot of land in Life Camp, which is a highbrow area in Abuja.\nHe said “I’m particularly elated today because what Onome brings to the club is beyond just playing football. Her presence will also motivate other players of the club to bring out their best and aspire to be the best, play for Super Falcons and so on.”\nIn an exclusive interview with Trust Sports, the Chairperson of Naija Ratels, Mrs. Alisson James-Jegede, said Ebi in her humane and exemplary behavior, approached Naija Ratels when they were in Lagos and indicated her desire to play for them. She further said the young girls are already excited training with her.\n“Onome approached us in Lagos and shared her dream of playing for a young team like ours to help develop. She will be with us for one season but we will remain a family afterwards as we already have a bond.\n“Our players are always eager to train even beyond training hours. I don’t just see the excitement but I feel it. Even when training is over, they don’t want to leave,” she said.\nIn another exclusive interview with Trust Sports, the immediate past Chairperson of NWFL, Aisha Falode, said Ebi’s return to the league is commendable as it will give the younger players the required motivation to excel.\n“Onome is not the first to return to the league. However, she must be commended for taking the bold step to come back to the league where she once played and developed her skills before moving to Europe.\n“She has played her role in the Super Falcons where she played in six World Cups and in the Nations Cup where she won titles for the country. She is a legend and will mentor these players to greater heights as her presence will also improve the status of the league.\n“She has seen it all in Europe and has achieved a lot, so it’s commendable of her to come back to give back to the league. It is just like Ahmed Musa who returned briefly to the league some time ago,” she said.\nOn her part, the captain of Naija Ratels, Paulina Ali, said she and her team mates are already getting inspired playing alongside the legendary Super Falcons defender.\n“Onome is a legend who is here to inspire us. We definitely want to be like her. Her presence in the league will inspire us to want to do more. We will tap from her wealth of experience.\n“Right now, our morale is very high and we are super excited that we have her in our team. My team mates are eager to learn from her as she is already inspiring us,” said Ali\nThe accolades being showered on Ebi are well-deserved because she is much more than a gifted footballer. She’s a real role model for Nigerian female athletes, shattering stereotypes and opening doors for greater prospects.\nShe has gained respect and appreciation both domestically and internationally for her perseverance and dedication. For the upcoming generation of Nigerian female football players, she is no doubt a great inspiration.\nUPDATE NEWS:\nNigerians can now invest ₦2.5 million on premium domains and profit about ₦17-₦25 million. All earnings paid in US Dollars. Rather than wonder, click here to find out how it works.",
  "word_count": 1307,
  "scraped_at": "2026-02-14T12:40:52.568193"
}