{
  "article_id": "90055441fe9f",
  "url": "https://www.abc.net.au/news/2025-03-11/fowler-manchester-city-manager-sacked-days-before-cup-final/105035300",
  "title": "Mary Fowler Manchester City manager Gareth Taylor sacked days before League Cup final",
  "date": "20250310T224500Z",
  "domain": "abc.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mary Fowler's fine domestic season at Manchester City has been hit by unexpected turmoil after the English Women's Super League club sacked their manager, Gareth Taylor.\nHe has been replaced on an interim basis by former City boss Nick Cushing.\nTaylor signed Fowler for City in 2022 and has gradually overseen her blossoming into an integral part of the team. This has been the Australian international's best season in Manchester with 10 goals in 28 matches, almost all of them as a starter.\nHowever, City's form has not been as impressive. While the dismissal comes at a shock time with City due to play Chelsea in the Women's League Cup final this weekend, the club are fourth in the WSL, outside the three Champions League qualifying places.\nCity are in the Champions League quarter-finals, in which they also play Sam Kerr's Chelsea, and the FA Cup semi-finals in which they are to play Manchester United.\nFormer City forward Taylor was appointed as boss of the women's side in 2020, succeeding Cushing, and oversaw them winning the FA Cup that year and the League Cup in 2022.\nThey were WSL runners-up last season, finishing behind Chelsea on goal difference on the final day of the campaign.\nThis term they won six of their first seven league games, but then lost four in six, and the gap to leaders Chelsea stands at 12 points.\nCushing was City boss in their debut WSL season in 2014 and led them to the title two years later, which remains the only time they have won it.\nHe also steered the team to an FA Cup and two League Cup successes before departing in 2020 to work in men's football at New York City FC, where he had been head coach for the last two seasons before being sacked in November.\nAAP",
  "word_count": 306,
  "scraped_at": "2026-02-14T12:43:02.956470"
}