{
  "article_id": "9011a38e3615",
  "url": "https://www.aljazeera.com/news/2023/4/20/middle-east-round-up-sudan-descends-into-chaos",
  "title": "Middle East round - up : Sudan descends into chaos",
  "date": "20230420T174500Z",
  "domain": "aljazeera.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Middle East round-up: Sudan descends into chaos\nHere’s a round-up of Al Jazeera’s Middle East and North Africa coverage this week.\nFighting rages in Sudan, Tunisia’s crackdown on the opposition ramps up, and hundreds released in a Yemeni prisoner swap. Here’s your round up of our coverage, written by Abubakr Al-Shamahi, Al Jazeera Digital’s Middle East and North Africa editor.\nThe generals in Sudan turned their guns on each other this week, and in far too many cases, it was the civilians who were getting killed. Warfare isn’t new to Sudan – the conflict in Darfur has attracted a lot of attention over the last 20 years – but fighting on this scale in the capital, Khartoum, is unprecedented. At the time of writing, more than 300 people had been killed, many of them civilians, the healthcare system was being decimated and the fighting on residential streets in Khartoum, and elsewhere in the country, had resulted in some fighters commandeering people’s homes. It’s been bedlam.\nRecommended Stories\nlist of 3 items- list 1 of 3Sudan’s generals reject negotiations as ceasefire fails\n- list 2 of 3Who is Ghannouchi, the Ennahdha party leader arrested in Tunisia?\n- list 3 of 3Dozens killed in crush at Ramadan charity event in Yemen\nIt also wasn’t supposed to be like this. Sudan’s army, and a paramilitary group known as the Rapid Support Forces, had been negotiating over the idea that the RSF ought to be absorbed into the country’s standing military. The eventual dissolution of the RSF was seen as one of the final steps in a supposed transition to a civilian government, a transition called for by popular demand following the overthrow of long-time leader Omar al-Bashir after protests in 2019. Al-Bashir’s forced removal had led to an initial transition to civilian rule that was itself upended by a military coup, led by the army and General Abdel Fattah al-Burhan, and the RSF, led by General Mohamed Hamdan “Hemedti” Dagalo, who together orchestrated the takeover in October 2021.\n[READ: The soft-power campaign of Sudan’s RSF leader ‘Hemedti’]\nSince then, Sudan’s protest movement has been fighting hard to restore civilian rule. But there was always a lingering sense that the soldiers would never give up power easily. Now, al-Burhan and Hemedti, one-time allies of convenience, are at each other’s throats, shooting up Sudan for control of whatever will be left standing.\nTunisia Arrests Opposition Leader Ghannouchi\nBack in 2011, the sight of Rached Ghannouchi arriving in Tunis was a sign of the profound change that the revolution in Tunisia had brought about. Ghannouchi’s Ennahda Party, which he had led while in exile for more than 20 years, quickly became the biggest party, ruling as part of a coalition, even if critics were still wary because of its roots in political Islam. Ghannouchi himself became speaker of parliament, and politics settled into the sort of jockeying common to many countries that enjoy a vibrant and democratic electoral system. Here was the success story of the Arab Spring.\nBut for many Tunisians, political gains failed to translate into economic gains. If anything, things got worse. Enter Kais Saied, a populist academic who ran for the presidency in 2019, and to many people’s surprise, won. Initially backed by Ennahda, he quickly revealed his authoritarian tendencies, suspending parliament in 2021, and pushing through a new constitution that empowered his own position as president.\nAnd now, after months of arrests of opposition figures, Saied has finally moved against Ghannouchi. The leader of Ennahda was detained on Monday as part of an investigation into “provocative comments”. Party officials told Al Jazeera they had been ordered to shut down their offices after they’d been raided. By Thursday, Ghannouchi had been sent to jail, and ordered to stand trial on charges of plotting against state security. Saied now appears likely to move against other opposition forces—and Tunisia appears to be a long, long way away from that victory for democracy in 2011.\nYemen Prisoner Swap\nThe headline is that almost 900 prisoners have been freed by parties to the war in Yemen, a further sign that confidence-building measures are continuing, and that the end of the conflict may finally be nearing (although, in my opinion, that is still a long way off). Covering this event, my eyes immediately went to the images of the prisoners stepping off planes, smiles on their faces, but with pain in their eyes, hugging their loved ones.\n[READ: Dozens killed in crush at Ramadan charity event in Yemen]\nEach one of those hundreds of prisoners has a story to tell, many of years spent away from home, in likely horrible conditions, unsure of whether they would ever see freedom again. Some of them were high-ranking figures, including Yemen’s former defence minister, as well as relatives of former Yemeni presidents. Others were journalists, sentenced to death. All emerged joyous, but many were clearly shadows of their former selves.\nAnd Now for Something Different\nThe players (and the fans) might be fasting, but that doesn’t stop the football. This is Gaza’s Ramadan League, an annual tradition where amateur footballers battle it out to win a coveted trophy. This year’s final was between Rail Stars and Tadamon. On a pitch that wasn’t even regulation-sized, the match was watched by hundreds of spectators, and with a commentator keeping track on the sidelines. It was intense. And, mercifully, offered some sense of normalcy.\nBriefly\nRefugees claim cancer link with gas flaring in Iraq | Egypt agreed to supply arms to Ukraine after US talks: Report | Qatar and UAE move to restore diplomatic relations | Saudi foreign minister meets Syria’s al-Assad in Damascus | US military says it has killed senior ISIL leader in Syria | Kuwait crown prince calls new elections | Ethiopia recruits 500,000 women for domestic work in Saudi Arabia | IMF wants Egypt to make reforms before bailout: Report | Iran issues prison sentences for 2020 downing of Ukraine airliner | Fire in Dubai apartment block kills 16 | Thousands of Israelis protest against judiciary reforms | Congress members urge probe into use of US weapons by Israel | Palestinians cross checkpoints for Friday prayers at Al-Aqsa | Arab League discusses Syria’s return to the organisation | Algerian Parliament approves law tightening control over media |\nQuote of the Week\n“You try to be a role model for your children, and then strangers come, and they arrest your children or beat them in front of your eyes. How do you react? … Do your children think, ‘Our mother and father can’t protect us’? This is occupation, we can’t protect our children from them.” | Laila Issawi, from occupied East Jerusalem, describing how six of her seven children have been detained in the past by Israel. One son, who was 14 at the time, was shot dead by Israeli soldiers during a protest in 1994.",
  "word_count": 1146,
  "scraped_at": "2026-02-14T12:02:49.544660"
}