{
  "article_id": "90123e01ff02",
  "url": "https://laist.com/news/how-to-la/la-womens-teams-la-sparks-angel-city-fans",
  "title": "I was late to pro women sports fandom . The Sparks and Angel City welcomed me anyway",
  "date": "20240918T004500Z",
  "domain": "laist.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "My first Los Angeles Sparks game was so much more fun than I’d expected. In truth, that’s in large part because I really didn’t know what to expect. Until the last couple of years, the WNBA wasn’t something I paid much attention to.\nLast year, I watched some of the NCAA women’s basketball tournament for the first time, and did this year too, with my sister. It was super exciting and got me interested in the WNBA too.\nI went to my first game this summer, and the Sparks, despite being in last place in the league, beat the top-ranked New York Liberty. I got to see incredibly talented players who I’d just watched win medals at the Paris Olympics — like Sabrina Ionescu, Brianna Stewart, and Dearica Hamby — practice and play in person.\nThen, there were the celebrity sightings — Leslie Jones, Jason Sudeikis, and Rosie O’Donnell among them. The atmosphere was like a party, with a DJ and an amazing dance crew whose members are all over 40. And Jones, who I knew was a mega Sparks fan, was up on the Jumbotron screen in the fourth quarter to hype up the crowd.\nSeeing fans wearing shirts that read, “Everyone watches women’s sports,” and “I watched women’s basketball before it was cool,” I kept wondering why it had taken me so long to take notice of women’s professional sports.\nA fan in the making\nFor so many reasons, I should have been a fan much sooner.\nIn 1997, when the WNBA debuted and I was a preteen, I was on my grade school’s girls basketball team. Admittedly, I didn’t really love playing the sport myself. I played basketball (and volleyball and softball), mostly, because my friends were doing it and because I had fun being part of a team.\nGrowing up in Anaheim, I went to Angels’ baseball games with my friends and family. I was excited when a Rams football player visited our second grade class and when we took a field trip to see the Ducks hockey players practice. But the only women’s pro sports I remember watching were gymnastics or figure skating, rarely, on TV.\nIn an old yearbook I found, the text over our girls’ basketball team photo read, “Future WNBA Players.” In reality though, the WNBA wasn’t really on my radar until recently.\nAnd I’m not alone when it comes to feeling like I’ve only recently woken up to how fun it can be to watch women’s basketball, and women’s sports in general.\nIncreased attention for women’s sports\nFan interest in women’s sports has increased over the last decade and seen a notable uptick in the last couple of years — from record-setting viewership of the FIFA Women’s World Cup final back in 2015, to 2024’s record-breaking women’s NCAA college basketball championship game, which drew a larger TV audience than the men’s game for the first time ever.\nThat’s had a spillover effect for the WNBA, with superstar rookies — like Caitlin Clark and Angel Reese — drawing big crowds and boosting ratings this year. When it comes to the Sparks specifically, the team saw a 30% increase in season ticket sales this year compared with 2023.\nInterest in the National Women’s Soccer League is still making gains too. Soccer fans successfully rallied to bring the Angel City Football Club to L.A. in 2020, and the 2023 Women’s World Cup generated the most revenue in the tournament’s history.\nThis summer, I met a wide range of Sparks and Angel City fans — some who were new to supporting the teams, and others who’d been fans of women’s pro basketball and soccer for decades.\nIn Angel City FC’s case, since the team itself has only been playing since 2022, really everyone is a pretty recent fan, though many of them are longtime soccer-lovers (including some fans of L.A.'s last, short-lived women's pro soccer team, the Los Angeles Sol). And even in the short time that ACFC has been around, it’s seen a lot of growth in terms of both fan and investor attention.\nAs a newcomer, I expected to feel a little out of place heading out to my first pro games, but the atmosphere and fans at both BMO Stadium (which Angel City shares with Major League Soccer's Los Angeles Football Club) and Crypto.com Arena (which the Sparks share with the Lakers and Kings) were super welcoming.\nAs Angel City FC’s co-founder and president Julie Uhrman put it before a recent match, “women’s sports fans are the best sports fans in the world.”\nHer reasoning?\n“Because historically, and even to today, we make it really hard for them to be sports fans. We make it hard for them to find the games on television. We make it hard for them to come to games. And that's changing,” Uhrman says. “The reality is they've always been there. We're just making it easier now.”\n\"Women’s sports fans are the best sports fans in the world.”\nAs for when Uhrman noticed a change: “It began, I believe, following the 2019 U.S. Women's National Team World Cup where we won again. We saw it again at the World Cup this past year and again with the Olympics where when you get the opportunity to see these female athletes, you see how incredibly talented they are and then you realize they play in your backyard.”\nThe ‘ultra fans’\nAngel City is also very intentional about creating a welcoming environment. “That's one thing that I'm so proud of the Angel City team for creating is an environment that is fun, inclusive, diverse, and welcoming,” Uhrman says. “So whether you're family, or you're older, or you're part of the LGBTQ community, everyone feels like they have a place here.”\nThe community feeling, Uhrman added, all begins with the team’s supporters, or “ultra fans.”\nAngel City has six independent supporter groups, all with their own group names, logos, and social media accounts. They have their own section in the stadium (with seats that are less expensive because you don’t get assigned seats and many fans choose to stand). Supporter groups come up with chants for the team, and some of them play drums during the match to hype up the crowd.\nOutside of the matches, the supporter groups organize tailgates and plan game watches, different activities, and community service events.\nAll of the members I spoke with were friendly and welcoming. Ruby Badio with supporter group Mosaic 1781 told me her advice to anyone who wants to join, is to check out the groups’ social media accounts, send them a DM, or just come to a game early and meet people in person. Mosaic 1781 even has a buddy system that they use for newcomers who might be coming to a game solo.\n“That way you don’t feel alone,” Badio said. “We kind of teach you the ropes.”\nThe player perspective\nWhen it comes to the Sparks, as a member of the media, I was able to talk to a couple of players ahead of a recent game. I wanted to get their perspective on the recent renewed interest in the league and ask what fan support means to them.\nAzurá Stevens, who’s been in the WNBA since 2018 and with the Sparks since 2023, said she’s seen an increase in interest over the years since she was a rookie: ”Definitely in the viewership and just how much attention we're getting as a league…It's exciting.”\nMore on women's sports\nHer fellow Sparks forward Dearica Hamby agreed. Hamby started out in the WNBA in 2015 playing for the San Antonio Stars, and like Stevens, has also been with the Sparks since 2023.\n“I’ve kind of been on both sides of the spectrum,” Hamby said. “I played in San Antonio for a few years. We were at the AT&T Center [now the Frost Bank Center], and there were literally like 200 people in there. So to kind of be a part of the growth and to literally live it, it's been a humbling experience.”\nWhen describing the support she’s seen from Sparks fans, Hamby said: “I think they're definitely loyal. You know, we're going through a rebuild right now, but we still see the same court side people every game.”\nAt the game I went to, I met some Sparks fans who — like me — had only started coming to games this year and others who’ve been supporters for decades.\nDebbie Johnson told me she’s had season tickets for 20 years and encourages anyone who hasn’t been to a Sparks game in person, to check it out for themselves.\n“The players are exciting and I just enjoy being at the game,” Johnson said. “It’s been tremendous. So much fun and joy.”\nWhat to know if you're a newbie fan\nWe asked our LAist followers on Facebook for their advice to new fans about attending games at BMO Stadium or Crypto.com Arena. Here’s some of their tips:\nWhen heading to BMO Stadium…\n- “Best food at BMO is right outside the stadium. There’s usually a food cart serving amazing birria tacos outside the northeast entrance. Birrieria ChiVazquez.” — Arik Kadosh\n- “If you do drive to BMO avoid the MLK exit on the southbound 110. It is so slow getting off there that you can easily miss the beginning of your game. Parking a few blocks away is much cheaper than using the ‘official’ lots.” — Jessica Yarger\n- “Best way to get to BMO is by taking the E Line (formerly Expo Line). Why hassle with parking?” — Brenda Thomas\nWhen heading to Crypto.com…\n- “Call it Staples [Center] and take the Metro!” — Peter Prietto-Murray\n- “You can park for cheap at the Fig at 7th shopping center if you validate your ticket at Target, then walk across the street to the 7th St Metro Center, where it's a short ride to BMO, Crypto or the Coliseum. There are also some decent places to eat at Fig at 7th” — Dan Saborio\nMy tip: Remember to check bag policies! BMO requires clear bags and Crypto.com only allows small clutches.\nWhile the Sparks’ last home game is today (Sept. 17), there’s also an away game on Sept. 19. And there’s still time to catch an Angel City match this season. You can check their schedule here.\nAnd if you’ve never been to a game before, take a lesson from a latecomer like me — after you do, you’ll wonder why you hadn’t sooner.",
  "word_count": 1752,
  "scraped_at": "2026-02-14T12:33:21.127653"
}