{
  "article_id": "9017cf65adf1",
  "url": "https://www.twtd.co.uk/ipswich-town-news/46853/ipswich-town-6-0-sheffield-wednesday--match-report",
  "title": "Ipswich Town 6 - 0 Sheffield Wednesday - Match Report - Ipswich Town News",
  "date": "20240316T193000Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Saturday, 16th Mar 2024 17:10\nOmari Hutchinson and Ali Al-Hamadi both netted twice and Cameron Burgess and Nathan Broadhead once each as Town thrashed Sheffield Wednesday 6-0 at Portman Road to record their biggest victory of the season and climb back to second in the Championship. Hutchinson got the ball rolling in the 15th minute, Burgess added the second on 37, then Broadhead made it three in first-half injury time. Hutchinson made it 4-0 three minutes into the second half, before sub Al-Hamadi added the fifth and sixth on 80 and 90 as Town ran riot against the Owls.\nTown made three changes from the team that lost 2-1 at Cardiff last week with Axel Tuanzebe, Hutchinson and Broadhead coming into the side.\nTuanzebe was in at right-back for Harry Clarke and Broadhead on the left of the attacking three for Jeremy Sarmiento, who both dropped to the bench, while Hutchinson replaced Conor Chaplin, who missed out on a place in the squad for a league game for the first time this season having suffered a minor knock in training.\nFor Wednesday, former Blues loanee Dominic Iorfa, Michael Ihiekwe, Will Vaulks and Ian Poveda came into the team as they switched to a back four from their usual back five for Pol Valentin, Akin Famewo and Liam Palmer and Bambo Diaby, who dropped to the bench.\nTown almost created an early opportunity, Broadhead just putting too much on a through ball for Hutchinson and visiting keeper James Beadle claimed.\nWednesday carved out their first opportunity in the seventh minute, Poveda getting away down the left and crossing for Ike Ugbo, who sliced his effort high and wide from the edge of the box.\nBut it was Town who had started the stronger and on 10 Kieffer Moore rose high to nod a Sam Morsy cross towards the far post but Owls keeper Beadle claimed.\nFollowing the Blues’ first corner of the game on 11, the ball fell to Hutchinson on the edge of the area but the on-loan Chelsea man slipped as he hit his shot and Beadle was untroubled.\nWednesday threatened again on 13, Anthony Musaba crossing from the right and Djeidi Gassama flicking a header over at the near post.\nHowever, the Blues had largely been in control and on the quarter hour they went in front. Following a patient build-up on the right, Burns cut back to Hutchinson, who rolled his man on the edge of the box as he allowed the ball across his body, then hit a low left-foot shot on the turn which beat Beadle to his left, the Jamaica international’s seventh goal of the season.\nTown continued to dominate, indeed their control of the game and threat increased following the goal with Hutchinson causing the visitors significant trouble with his running and close control.\nHowever, on 28 Morsy lost the ball in the Wednesday half, the Owls broke and then Massimo Luongo, facing his old club, was unable to clear on the edge of the box and Poveda was able to get in a sharp shot, which Vaclav Hladky did very well to get down and turn past his right post.\nOn the half-hour, Gassama battled round the outside of Tuanzebe but saw his effort saved by the advancing Hladky, but in any case the linesman’s flag had been raised.\nThe game was surprisingly open for one only half an hour old with both teams having set-up with an attacking intent.\nIn the 32nd minute, Ihiekwe was shown the game’s first yellow card for a foul on Moore just outside the box. Broadhead took the ball on into the box but slipped as he shot and his effort deflected behind.\nMoments later, Hutchinson joined Ihiekwe in referee Leigh Doughty’s book for foul on Marvin Johnson on halfway, which looked harsh on the Town goalscorer, who had appeared to win the ball.\nA minute later, Burns forced a corner down the right but subsequently went down with a hamstring injury. The winger was treated on the pitch but was quickly led down the tunnel and will now almost certainly be ruled out of the Wales squad for their Euro 2024 play-offs.\nFrom the flag-kick, and with Town still down to 10 men, the Blues doubled their lead. Leif Davis sent it over and Moore headed onto the bar at the near post. Burgess tried to get his head on the loose ball, it fell to Tuanzebe, who tried to find space to apply a final touch and it deflected to Burgess, who slammed home his first goal of the season.\nTown, who brought on Kayden Jackson ahead of the restart, went looking for a third and on 43 Davis was found in space on the left of the box but his shot from an angle was saved by Beadle.\nA minute later, Gassama blazed over for the Owls, but it was a rare foray forward by the visitors by this stage and in the first minute of four additional minutes, Town made it 3-0.\nMoore battled for the ball in the centre circle, turned and brought it forward before feeding Jackson to his right and the sub sent over a superb curling cross which reached Broadhead at the far post from where the Wales international smashed in his 12th goal of the season to move him level with Chaplin as the club’s top scorer.\nThere was no time for any further action and the final whistle was greeted by a huge cheer from Town supporters.\nIt had been a near-perfect half from the Blues with Burns’s injury the only negative. Wednesday had come with a very attacking line-up, something which usually plays into Town’s hands, particularly at Portman Road, with the Blues thriving when a game is open.\nAnd that proved to be the case with Town able to play their football and dominate, creating chances throughout and scoring three goals, two very well worked from open play and another from a set piece.\nWednesday had one or two opportunities themselves but with Hladky forced into only one real save.\nThe visitors made two changes at the break, presumably to tried to tighten things up with Momo Diaby replacing Barry Bannan and Valentin taking over from Gassama.\nBut Town started the second half as they had ended the first with Hutchinson shooting deep into the Sir Bobby Robson Stand from the left of the area.\nAs the clock ticked past the 47-minute mark, there was a round of applause for fan Matt Newman, who recently died of a brain tumour aged 47.\nAnd towards the end of the minute, the Blues scored their fourth goal. Town broke down the left from inside their own half before Broadhead fed Hutchinson on the right of the box, from where the youngster shot across Beadle and into the net for his second of the game - his first senior brace - and his eighth of the campaign.\nOn 53, Wednesday swapped Poveda for Wilks with the Owls already looking a well-beaten side.\nSoon after, Luongo tried to catch Beadle off his line from the touchline by the dugouts but the keeper just about made it back and palmed it wide.\nMoore shot over five minutes later with the Blues fully in control and looking likely to add to their goals with every attack.\nThe Wednesday backline repeatedly failed to clear a Jackson cross from the right on 56, then two minutes later Moore shot over following a run.\nJust before the hour mark, a Hutchinson shot from the edge of the box looped over off a defender.\nOn 64, Jackson was sent away on the right in space with Broadhead breaking down the middle with no one near him, however, the sub’s cross was cut out. A minute later, Wednesday switched Ugbo for Michael Smith.\nWith the game won, Town made a double change on 72 with Sarmiento and Ali Al-Hamadi replacing Broadhead and Moore.\nThe subs were quickly into the action with the Iraqi international taking the ball across a defender to the right of the box but scuffing his shot well wide. Moments later, Jackson was found in a similar area but his volley similarly slid off his foot and well wide. In the 77th minute, the Owls switched Iorfa for Famewo.\nThree minutes later, it was 5-0. Sarmiento unleashed a powerful strike from just outside the area, Beadle saved down to his right but couldn’t hold on and Al-Hamadi tapped his third goal for the club into the net from close range.\nMallik Wilks shot well over for the Owls on 84, but with the Blues so comfortable since the break that they were afforded the luxury of replacing both their central midfielders a minute later, Lewis Travis and Jack Taylor taking over from skipper Morsy and Luongo, who had once again been hugely impressive.\nIn the final scheduled minute, Town made it 6-0. Hutchinson broke into the area on the right, beat a man, then cut back to Al-Hamadi, who had the simplest of tasks to tap his second goal of the game into the net from a couple of feet.\nThe fourth official indicated an additional three minutes in which Town continued to look for goals before referee Doughty’s whistle confirmed the Blues’ biggest win of the season.\nWednesday’s approach played into Town’s hands and Kieran McKenna’s men made them pay in front of plenty of ex-players from the club’s golden eras, including Ray Crawford and Frans Thijssen, putting in their most complete performance of the season, showing trouncebackability rather than bouncebackability following last week's reverse at Cardiff.\nThe game was effectively won in the first half, although with Wednesday having a couple of opportunities themselves, but the second period was all Town.\nOnce the fourth goal went in, Owls heads dropped, there were arguments going on between defenders, and it became a case of how many the Blues were going to score and it might well have been even more than six.\nThere were outstanding performances throughout the side but with Hutchinson perhaps the best, while Morsy was dominant in midfield.\nA great way for Town to return to winning ways after last week’s disappointment at Cardiff, the biggest win since the Exeter thrashing which confirmed promotion at the end of last season, with the Blues now having lost only one of their last 35 in the league at Portman Road.\nThe Blues last won 6-0 in the Championship in February 2011 when Connor Wickham netted a hat-trick at Doncaster, while Town last scored six at home in this division when they walloped Bristol City in November 2007 with Jon Walters bagging a treble that day. It was Wednesday’s biggest league defeat in 16 years.\nTown are back up to second in the table, two points in front of Leeds, who host Millwall tomorrow, and one behind leaders Leicester, who are at Chelsea in the FA Cup.\nThe men aren’t in action next Saturday due to the international break but Ipswich Town Women play their first ever game at Portman Road against Chatham Town.\nTown: Hladky, Tuanzebe, Woolfenden, Burgess, Davis, Morsy (c) (Travis 85), Luongo (Taylor 85), Burns (Jackson 38), Hutchinson, Broadhead (Sarmiento 72), Moore (Sarmiento 72). Unused: Walton, Clarke, Edmundson, Harness.\nSheffield Wednesday: Beadle, Iorfa (Famewo 77), Ihiekwe, Bernard, Johnson, Vaulks, Bannan (c) (M Diaby 46), Poveda (Wilks 53), Musaba, Gassama (Valentin 46), Ugbo (Smith 65). Unused: Dawson, Palmer, B Diaby, Cadamarteri. Referee: Leigh Doughty (Lancashire). Att: 29,325 (Sheffield Wednesday: 1,945).\nPhoto: Matchday Images\nPlease report offensive, libellous or inappropriate posts by using the links provided.\nWell done all just what we needed with the international break and lets hope Neil Harris continues his wonders at Millwall (bet he doesn't).\nWell Done All. Happy Saturday Evening for sure.\nToday individually and collectively\nOmari fabulous skills\nMassimo best match for weeks\nMorsy a composed driving skippers effort\nDefence solid, Axel powerful\nWednesday woeful but we were not dragged down to that level\nSarmiento can truly a hit a ball and Ali shows how to get in the position to score\nNo one less than 8/10\nOur central midfield worked tirelessly and Wednesday couldn't cope with the. Only downer on the afternoon was Wes Burns injury which apparently is his hamstring and not good for him or fro the remaining games.\nYou need to login in order to post your comments",
  "word_count": 2069,
  "scraped_at": "2026-02-14T12:07:27.671604"
}