{
  "article_id": "9039eaeff0fc",
  "url": "https://www.theguardian.com/world/2025/sep/02/first-edition-school-new-year-teacher-recruitment",
  "title": "Tuesday briefing : It a new school year , but the same old problems persist for Britain schools | united kingdom news",
  "date": "20250902T064500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. It’s back-to-school week, and the daily ritual (or, perhaps, panic) begins as uniforms are being donned and lunchboxes packed across the UK to start a new year. My sympathies to you teachers setting early morning alarms, and parents dragging children out of bed after six weeks of lie-ins.\nLast year, Keir Starmer promised to leave “no stone unturned to give every child the very best start at life”, but how is that going? More than half a million GCSE students in England will start the year with no physics teacher, while many kids from poorer families feel they cannot afford to have their children study geography or languages, new Guardian reporting shows.\nThese are just a few things that reveal bigger issues about the lack of opportunities for millions of bleary-eyed children getting up for school this week. For today’s newsletter, I spoke to Guardian education correspondent Sally Weale about how inequality is embedded into the system, and whether Labour is doing enough to tackle it. First, the headlines.\nFive big stories\n-\nAfghanistan | The Taliban has called for international aid as Afghanistan reels from an earthquake that killed more than 800 people and left thousands injured.\n-\nIsrael-Gaza war | A plan circulating in the White House to develop the “Gaza Riviera” as a string of high-tech megacities has been dismissed as an “insane” attempt to provide cover for the large-scale ethnic cleansing of the Palestinian territory’s population.\n-\nPolitics | Darren Jones, the chief secretary to the Treasury, has been moved to a new senior role in Downing Street as Keir Starmer attempts to get a grip on delivery before what is likely to be a tumultuous autumn for the government.\n-\nHealth | A three-minute brainwave test can detect memory problems linked to Alzheimer’s disease long before people are typically diagnosed, raising hopes that the approach could help identify those most likely to benefit from new drugs for the condition.\n-\nUK news | Prominent women including cultural figures, politicians and campaigners have signed a letter criticising rightwing attempts to link sexual violence in Britain to asylum seekers. Signatories include the musicians Paloma Faith, Charlotte Church and Anoushka Shankar.\nIn depth: ‘Some four-year-olds are already on the back foot by the time they start school’\nA significant challenge for some schools starts not in the classroom but with recruitment. One-quarter of English state schools have no specialist physics teachers, with maths, biology or chemistry teachers typically being roped in to do the job, according to research by the Institute of Physics. Many of these teachers have not studied physics beyond the age of 18, and may themselves have only studied the subject to GCSE level.\n“Recruitment of new teachers, and then retention of teachers you’ve already got, has been very difficult for quite a long time,” said Sally Weale. Take physics: people with science degrees are likely to have a lot of better-paid employment opportunities in the private sector. “Certain school subjects have been particularly badly affected, and physics is a big one. Most head teachers I talked to said the physics teacher is a big issue for them. Very often they haven’t got one.”\nPay for teachers is typically poor, and it’s a tough job with long hours, and generally no opportunities for working from home. “You are in front of 30 students, you have to be at the top of your game all the time,” said Sally.\nStudents in schools without specialist physics teachers are half as likely to go on to study A-level physics. More than 300 schools in England have none taking it, the report found. Unsurprisingly it is typically kids in the poorer areas who are worst affected.\nNot only does this negatively impact opportunities for individual students, it also make it difficult to recruit scientists and innovators in key sectors such as quantum, photonics, nuclear and semiconductors, the report found.\n‘Baked-in inequality’\nSecondary school pupils from low-income families are “bounced out” of studying subjects like geography and languages because of concerns about the cost of field trips and excursions abroad, according to a survey of children in England. Fears about extra costs prevent almost a quarter of children on free school meals from choosing certain GCSE subjects.\n“The reality is that some subjects just are no-go areas for lower-income families,” said Sally. “I remember when there would be school trips and parents would just say, ‘Sorry, we can’t afford it.’ I think it’s always been part of what’s going on in schools, but these differences have become much more acute.”\nOther subjects with additional costs are music, which can require lessons and instruments; food and nutrition, due to the cost of ingredients; and PE, because of extra kit and equipment. Nine per cent of pupils who did not receive free-school meals said the cost – or concerns about the cost – prevented them from studying these subjects, according to Survation for the Child Poverty Action Group (CPAG).\n“Kids from the poorest backgrounds are always at such a huge disadvantage. It’s not just what subjects they can study and it’s not just physics teachers,” said Sally. “They could be living in areas where it’s hard to attract good teachers, or they don’t have access to the same enrichment, or their families have less capacity to support them. This is something that I’m writing about all the time, and have been ever since I started this job over 10 years ago. It’s a kind of baked-in inequality that is very hard to deal with, and it’s basically about poverty.”\nWhat is the attainment gap?\nThis year, A-level results in England reached a record high outside the pandemic era, However, the stark regional divide between London and the rest of the UK, particularly the north-east and East Midlands, has widened. This is down to a range of factors, including investment in London schools during the Blair government, the higher pay and attractiveness of working in London for teachers, and gentrification of the city.\nThe attainment gap between poorer students and their wealthier peers had been closing from about 2010 onwards, but that progress began to stall in 2018, probably because of funding pressures on schools, said Sally. Since Covid, the gap has grown and though there have been small signs of improvement recently, the gap remains far bigger than before the pandemic.\n“Covid blew it all out of the water. The government would say there’s some evidence the attainment gap is closing slightly, but it’s still absolutely huge,” Sally said. “Disadvantaged four-year-olds are already on the back foot by the time they start school.”\nWhat is Labour doing?\nSince Labour has come in it has expanded free school meals, including introducing free breakfast clubs into all primary schools in England. From this week, working parents who earn up to £100,000 a year will be entitled to 30 hours’ free childcare a week during term time for children from the age of nine months until they start school. “Critics would say it barely scratches the surface,” said Sally.\nLabour’s flagship child poverty strategy will not be published until autumn. The decision to push back the strategy comes amid concerns about the cost implications of ending the two-child limit on universal credit. Experts say scrapping the benefit limit would be the single most effective way of reducing child poverty – an estimated 100 children are pulled into poverty every day by the limit, meaning up to 20,000 could be affected by a six-month delay.\n“Everybody is waiting to see the sort of child poverty strategy. I think that will be key to how their success is regarded,” said Sally. “At the heart of that is the two child benefit cap. The general feeling is that it needs to go, and it’s responsible for keeping too many families in poverty. Poverty is an enemy of opportunity.”\nWhat else we’ve been reading\n-\nIs Donald Trump a dictator? Adam Gabbatt surveys the US president’s inflammatory actions – from deploying the national guard to his compulsive use of executive orders. He speaks with political scientists about where Trump currently sits on the spectrum of between democracy, authoritarianism and outright dictatorship. (From more by Adam, sign up to his Week in Trumpland newsletter here.) Craille Maguire Gillies, newsletters team\n-\nMore and more people are blocking out the news because it fills them with dread. This piece examines the emotional toll of “doomscrolling”, and gives tips on how to stay engaged and not fall into a pit of negativity – if you can face reading it. Phoebe\n-\nDr Velislava Hillman is persuasive about how AI in education is a lot less revolutionary than big tech companies might make it seem. “What is sold as the ‘democratisation’ of education may be entrenching further inequality,” she writes, as the elite opt for human tutoring and the less-privileged are offered mass, app-based instruction. Craille\n-\nSome great news from conservationists who have found Mexico’s jaguar population has increased 30%. The main thing they’ve done is protect natural areas to keep these beautiful cats away from cattle ranchers. “Mexico and the world need good news,” said one of the conservationists. Here’s to that. Phoebe\n-\nPerhaps I am not a better cook after listening to episode 20 of the four-part podcast Home Cooking, but I am certainly charmed by the sibling-like camaraderie of its hosts, Samin Nosrat and Hrishikesh Hirway. Craille\nSport\nFootball | Liverpool broke the British transfer record to sign Alexander Isak for £125m from Newcastle on deadline day but were foiled in an attempt to end a stunning window with a deal for Marc Guéhi. Transfer roundup\nGolf | Europe will defend the Ryder Cup later this month with 11 of the 12 players who saw off the United States in Rome two years ago after captain Luke Donald unsurprisingly opted for experience with his wildcard picks.\nTennis | The All England Club is not looking to change the format of the Wimbledon mixed doubles competition for future editions of the Championships despite the success of the “reimagined” tournament at the US Open.\nThe front pages\n“PM tries to regain policy control from Treasury in No 10 shake-up” says the Guardian and the Telegraph depicts Rachel Reeves as “Smiling through the pain” after being “frozen out by Starmer”. The i paper’s version is “Starmer seizes grip of budget after Treasury ‘mistakes’ hit Labour in polls” and the Financial Times has “Starmer acts to arrest slide with shake-up in Downing St”. The Express runs with “Farage’s ‘I’ll get rid of you’ threat to PM”. The Daily Mail fumes “‘One in, one out’ fiasco: 3,567 in, zero out”. “Refugees to be stopped bringing in families” – that’s the Times. “I’d be safer in Somalia” – the Metro says its interviewee wants to be sent back. “Ban the vapes” is the top story in the Mirror which says experts are warning of irreversible harm to young brains and hearts.\nToday in Focus\nNorth Korean defector on why Kim Jong-un has sent troops to Ukraine\nWhen Hyun-Seung Lee was 17 he was conscripted into the North Korean army. Meals were basic and conditions were poor. Reports emerged in October last year of North Korean soldiers fighting for Russia in Ukraine. Hyun-Seung Lee, now living as a defector in the US, believes they will be gaining invaluable experience.\nCartoon of the day | Ben Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nTina Woods started clubbing in her mid-50s, after having an “epiphany moment” on a dancefloor. “The joy I felt – the mind, body and soul connection – was like a lightning bolt,” she says in this week’s edition of A new start after 60. After a few years of clubbing came another epiphany: wanted to be a DJ.\nDancing and DJing has also helped her connect to herself. “I’m finding myself again, in a funny sort of way. Psychologically, emotionally, sexually. Everything about who I am as a woman,” she says.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2044,
  "scraped_at": "2026-02-14T13:22:41.807664"
}