{
  "article_id": "905ea9ed1334",
  "url": "https://www.abc.net.au/news/2025-01-20/three-hostages-released-during-israel-gaza-ceasefire/104836878",
  "title": "What we know about the three Israelis released on the first day of the ceasefire",
  "date": "20250120T034500Z",
  "domain": "abc.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "What we know about the three Israeli hostages released on the first day of the ceasefire\nThree women have become the first hostages to be released as part of a ceasefire deal between Israel and Hamas, reuniting with their loved ones after 15 months in captivity.\nUnder the first phase of the initial six-week ceasefire, a total of 33 Israeli hostages are to be released in exchange for the Palestinian held in Israeli jails.\nJust hours after they were freed, 90 Palestinian prisoners and detainees were released as part of the deal.\nThe women were among about 250 taken hostage by Hamas when the militant group launched a terror attack on Israel on October 7, 2023.\nIsraeli authorities say 1,200 others were killed in the Hamas raid.\nIsrael's subsequent offensive on Gaza has killed more than 46,000 Palestinians, according to the Gaza health ministry.\nThe ceasefire between Israel and Hamas came into place on Sunday, but another round of prisoner and hostage exchanges are not expected until this weekend.\nHere's what we know about the three hostages released so far.\nEmily Damari, 28\nEmily Damari, a British-Israeli dual national, was one of the three women to be released.\n\"After 471 days Emily is finally home,\" said her mother, Mandy Damari, who has campaigned tirelessly for her release since she was kidnapped by Hamas militants in October 2023.\nIn the footage released by the Israeli military, Emily smiled and embraced her mother as she held up a bandaged hand.\n\"I want to thank everyone who never stopped fighting for Emily throughout this horrendous ordeal, and who never stopped saying her name,\" her mother said.\n\"While Emily's nightmare in Gaza is over, for too many other families the impossible wait continues,\"she added.\nEmily was born in Israel after her English mother moved there in her 20s. Her father is Israeli.\nShe is a fan of pop superstar Ed Sheeran and Premier League football club Tottenham Hotspur, whose fans have often chanted her name during matches since she was captured.\nEmily was at home in Kfar Aza, a kibbutz in southern Israel where she grew up, when Hamas gunmen stormed her home, injuring her hands and legs during the attack.\nHer dog Choocha was killed with a gunshot to the neck, said her mother.\nA video released by Hamas showed the three hostages receiving \"gift bags\" consisting of a certificate to mark their time in captivity.\nLoading...Her mother relentlessly lobbied Israeli and UK leaders for her return.\nEmily was the last British hostage being held in the Gaza Strip. Some of the other hostages however have links to the UK.\nBritish Prime Minister Keir Starmer said Emily's release, alongside two other Israeli women, was \"wonderful and long-overdue news after months of agony for them and their families\".\n\"I wish them all the very best as they begin the road to recovery after the intolerable trauma they have experienced.\"\nRomi Gonen, 24\nRomi Gonen was kidnapped from the Nova music festival in southern Israel on October 7, 2023.\nThat morning, Romi's mother, Merav, and her eldest daughter spent nearly five hours speaking to her as militants marauded through the festival grounds.\nRomi told her family that roads clogged with abandoned cars made escape impossible and that she would seek shelter in some bushes.\nThen she said words that continue to echo in her mother's head every day.\n\"Mommy I was shot, the car was shot, everybody was shot. … I am wounded and bleeding. Mommy, I think I'm going to die,\" her mother recounted Romi as saying in a press conference a few weeks after the abduction.\nLoading...Over the past 15 months, Romi's mother has been one of the most outspoken voices advocating for the return of the hostages, appearing nearly daily on Israeli news programs and travelling abroad on missions.\nIn Tel Aviv, hundreds of Israelis cheered and wept in a square outside the defence headquarters as a live broadcast from Gaza showed the three women getting into a Red Cross vehicle surrounded by Hamas figures.\nDoron Steinbrecher, 31\nDoron Steinbrecher was also released after 15 months in captivity.\nDoron's family said in a statement that \"our heroic Dodo, who survived 471 days in Hamas captivity, begins her rehabilitation journey today\".\nDoron is a veterinary nurse who loves animals, and a neighbour to Emily Damari in Kibbutz Kfar Aza. Doron holds both Israeli and Romanian citizenship.\nAt 10:20 am on October 7, 2023, Doron called her mother. \"Mom, I'm scared. I'm hiding under the bed and I hear them trying to enter my apartment,\" her brother, Dor, recalled.\nShe was able to send a voice message to her friends. \"They've got me! They've got me! They've got me!\" in the moments of her abduction.\nThat message was key in helping her family understand that Doron had been kidnapped.\nDoron was featured in a video released by Hamas on January 26, 2024, along with two female Israeli soldiers.\nHer brother said the video gave them hope that she was alive but sparked concern because she looked tired, weak, and gaunt.\nA doctor at the Sheba hospital said all three ex-hostages were in \"stable condition\".\nThe Hostage and Missing Families Forum campaign group hailed their return as \"a beacon of light\", while Prime Minister Benjamin Netanyahu said they had emerged \"from darkness\".\nABC/wires",
  "word_count": 888,
  "scraped_at": "2026-02-14T14:16:17.252933"
}