{
  "article_id": "906cf3d2e440",
  "url": "https://www.justarsenal.com/a-happy-alessia-russo-is-on-a-stunning-10-out-of-10-for-arsenal-women-best-free-transfer-ever/382916",
  "title": "A happy Alessia Russo is on a stunning 10 out of 10 for Arsenal Women - Best free transfer ever ? ",
  "date": "20241217T150000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Alessia Russo is a girl on the rise. Everything seems to suggest the England Lionesses star is at the peak of her form, and nothing is holding her back.\nKudos to interim manager Renee Slegers. In addition to seeing this Arsenal team play the Arsenal Way, dominate possession, and punish opponents, Renee Slegers has also found a way to get the best out of some Gunner stars.\nAlessia Russo, before Renee took over, was having another poor season in red and white, but that changed. In her 10 appearances under the Dutch tactician, she has scored 10 goals.\nIn addition to her goals, the former Manchester United star has won four consecutive player of the match awards in Arsenal’s last four appearances.\nAlessia said on Sky, “I’m feeling good. I’m enjoying my football, and I play my best when I’m happy.”\nRegarding the Arsenal striker, Renee admits, “She is doing really, really well; she gets at the end of it but also does a lot of hard work in other phases of the game out and in possession.\n“Very pleased with her, she works really hard, but credit to the rest of the team for setting up situations where Alessia can get on the end of things and bring her to her strengths. We do it together as a team.”\nSigning Alessia Russo on a free transfer has never seemed like a better deal than it does now. Alessia Russo’s performance has been so impressive that after Arsenal’s 1-0 WSL win over Liverpool, where her goal decided the tight contest, someone joked that the Arsenal men should borrow her, as she could easily score from open play (something they’ve struggled to do).\nConfidence is like a drug; once you’re high on it, you’re unstoppable, and with Alessia finding her confidence, we can trust she will continue to soar, and she’ll fire this Arsenal team to glory this season?\nMichelle M\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 351,
  "scraped_at": "2026-02-14T12:42:37.712936"
}