{
  "article_id": "90829599f6b9",
  "url": "https://www.islingtontribune.co.uk/article/gunners-clinch-conti-cup-with-late-extra-time-winner",
  "title": "Gunners clinch Conti Cup with late extra - time winner",
  "date": "20240404T160000Z",
  "domain": "islingtontribune.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gunners clinch Conti Cup with late extra-time winner\nBoss pays tribute to fans’ ‘passion’ and ‘loyalty’ as Arsenal seal second silverware win in a row\nThursday, 4th April 2024 — By Steve Barnett\nArsenal lift the FA Women’s Continental Tyres League Cup for the second season in a row after beating Chelsea at Molineux [Daniela Porcelli/SPP]\n“PASSION”, “loyalty” and “support” were among the buzzwords ringing around Molineux on Sunday after Stina Blackstenius’ last-gasp extra-time winner saw Arsenal beat Chelsea 1-0 to lift the FA Women’s Continental Tyres League Cup for the second season in a row.\nJonas Eidevall paid tribute to both his players and the fans after seeing the Gunners grind out a win in Wolverhampton.\n“I’m very proud, happy and a little bit tired, because it’s obviously a taxing game,” said the Arsenal boss.\n“The first half was for the coaches, the second half and extra-time was for the audience. It was an entertaining game, very small margins and we fought hard. We were on the better side of it today.\n“We were a high-performing team in a tough situation. It’s an even game. We learned a lot last time we played them and I think we prepared for a lot of situations with players that really understood the game plan to take a lot of responsibility and accountability on the pitch. I think it was almost like a complete team performance.\n“To work with a group of players and staff like this, and also the fans and being a part of that is a huge privilege.”\nThanking the supporters for spending their Easter Sunday cheering on the squad, Eidevall added: “They’re such a big part of what we’re building at this football club. It was a big part of the motivation today, to reward them for all of the hard work, passion, loyalty and support and give them silverware. They deserve that and I hope they’re happy with it and can celebrate it with us.”\nThe latest chapter between Arsenal and Chelsea remained goalless after 90 minutes, and seemed to be heading all the way to penalties until, with just minutes left on the clock, Blackstenius produced a moment of magic in front of 21,462 spectators – a new Women’s League Cup record attendance.\nThe Swede collected the ball in the box following good work out wide by Caitlin Foord, maintained her balance while shuffling her feet and then, when the briefest of opportunities arose, Blackstenius side-footed her shot through, rather than past, Blues goalkeeper Hannah Hampton. It proved enough to earn Arsenal a record seventh Conti Cup, while ending Chelsea’s hopes of landing a quadruple in the process.\nThe celebrations were, at first, a little muted as fans awaited an update on Arsenal midfielder Frida Maanum, who collapsed off the ball during second-half stoppage time. The concerns grew as the Norwegian international received treatment on the pitch before leaving on a stretcher wearing an oxygen mask. Thankfully the club later confirmed that Maanum was stable and had travelled back to London with the team. She will continue to be closely monitored by the club’s medial team.\nThe Arsenal players now have a little extra time to revel in their silverware success as they don’t play again until a week on Sunday (April 14) when they host Bristol City in the Women’s Super League.\nEchoing last season’s achievements, it seems likely Arsenal will balance the joys of winning the cup with the frustrations of finishing third in the WSL table.\nIf Eidevall can add one more voguish phrase to the list of buzzwords – consistency – then maybe this time next year the Gunners could be staring down the barrel at an even bigger prize, namely the WSL title.",
  "word_count": 622,
  "scraped_at": "2026-02-14T12:22:38.017939"
}