{
  "article_id": "90b9702f5c35",
  "url": "https://www.standard.co.uk/comment/nihal-arthanayake-spartan-spirit-spurs-arsenal-b1108814.html",
  "title": "Nihal Arthanayake I pray the Spartan spirit in Spurs will see off Arsenal",
  "date": "20230922T123000Z",
  "domain": "standard.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s the hope that thrills you! I pray the Spartan spirit in Spurs will see off Arsenal\nThat club on the red side of north London has ruined more weekends for me than bad weather, misbehaving kids, food poisoning and hangovers put together.\nIt was in November 2010 that my beloved Spurs last beat them in the league at their place. Before that, it was in May 1993 that we overcame them at Highbury. The national census comes around more often than us beating Arsenal at their home ground.\nAs fellow Spurs fans often say: “It’s the hope that kills you.”\nLast season, my silos of hope were depleted. Five games into the new campaign, however, and I feel that they are full to the brim, but with a caveat: because I am a middle-aged man, and not an eternally optimistic teenager like my 15-year-old son, I am still harbouring the affliction known simply as “Spursy”.\nIt is that irritating sense that at any moment we can snatch defeat away from the jaws of victory and revel in a kind of fatalism that ruins weekends. But with each passing week, our new manager (Big) Ange Postecoglou makes me feel less pessimistic about the future.\nAfter every press conference or interview with a player talking about him, and obviously the results on the pitch, my longterm Spurs-itis seems to be being cured by a weekly dose of Angebiotics.\nOn September 4, I received a WhatsApp message from a lovely man at Tottenham Hotspur Football Club which read, “Hi mate. Hope all is well. Up for hosting another fan forum?”\nIt has been six years since I last sat onstage in a building next to an unopened, but virtually finished, new stadium and hosted an in conversation with the chairman Daniel Levy, the then-captain Hugo Lloris, the then-manager Mauricio Pochettino, and 250 Spurs fans. It was a celebratory night with a manager we loved, of a team playing the football we all wanted to see.\nAfter that, things did not go well at Spurs. Last season was the nadir of the post-Pochettino decline, but because of how we have been playing so far this season my response to that WhatsApp was, “****, yes yes yes yes yes yes, **** YES!”\nJust over two weeks after that initial message I stood in a suit in the “NFL Suite” at the Tottenham Hotspur Stadium, awaiting the arrival of the Spurs Women’s captain Beth England, the women’s team manager, Robert Vilahamn, Levy, the captain, Heung-min Son and the great man himself, Ange Postecoglou.\nAs Ange entered the room we were introduced and had a conversation about the Greek community in Melbourne that he grew up in, before he ventured over to Robert and Beth.\nIt was a surreal experience. I have interviewed some of the biggest names in the world from Sir Paul McCartney to Sir Billy Connolly and Sir Elton John. But there is something about having a conversation with the manager of the football club you love that brings a new level of nervousness to the proceedings. He has changed everything about Spurs in the short time he has been there.\nRead More\nHe has instilled a belief and camaraderie among the players that gives them a Spartan-like air of invincibility. Like swashbuckling swordsmen they attack with flair, bravery and a confidence that led to Sonny telling the fans’ forum event: “I’m pretty sure they [Arsenal] don’t want to face us at this moment”, which led to a huge round of applause.\nThe north London derby has always been for me a nerve-shredding, anger-inducing, social media-avoiding afternoon of stress, especially when it is the away leg. I have a visceral dislike of that club, one that my son does not share as he didn’t have to endure the peak Wenger years and the “Invincibles” season — a nuclear-level gloatfest for every Arsenal-supporting friend of mine. Since we moved from London to Manchester seven years ago, Arsenal has largely been an irrelevance to my son. Not for me though.\nAfter sitting less than six feet away from Sonny and Big Ange this week and seeing their passion, I believe we will take the game to Arsenal on Sunday with a relentlessness they will find hard to cope with. The febrile atmosphere will not unsettle our boys as they stick to a way of playing and determination to win that saw us beat Sheffield United in the 101st minute last weekend.\nBy 4pm on Sunday perhaps our mantra will change from “It’s the hope that kills you” to “It’s the hope that thrills you”! Come On, You Spurs!\nNihal Arthanayake is a presenter on BBC Radio 5 Live.",
  "word_count": 783,
  "scraped_at": "2026-02-14T13:50:23.776641"
}