{
  "article_id": "910d72afb2be",
  "url": "https://www.arsenal.com/news/arsenal-women-play-more-wsl-games-emirates",
  "title": "Arsenal Women to play more WSL games at Emirates",
  "date": "20230510T110000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "We are delighted to confirm that Arsenal Women will play an increased number of Barclays Women’s Super League matches at Emirates Stadium next season.\nJonas Eidevall’s side will play five WSL games in N5 over the course of the 2023/24 campaign, up from three league matches this season.\nWe set a new record attendance in the Barclays Women’s Super League when we played Tottenham Hotspur at Emirates Stadium in September 2022, with over 53,000 tickets sold on that occasion.\nThis was followed by the visit of Manchester United in November, with a crowd of over 40,000 spectators, while our final WSL match took place in January 2023 against Chelsea, in front of more than 46,000 supporters.\nWe also played five UEFA Women’s Champions League matches at Emirates Stadium this season, culminating in a historic sold-out crowd of over 60,000 for our semi-final second leg against Wolfsburg. Subject to our qualification for the 2023/24 edition of the competition, all matches from the group stage onwards will also take place at Emirates Stadium.\nIn total, over 240,000 tickets have been purchased to watch Arsenal Women at Emirates Stadium this season.\nArsenal CEO, Vinai Venkatesham said: “We’re delighted to confirm that our women’s first team will play five WSL games at Emirates Stadium next season.\n“We’ve received fantastic support at Emirates Stadium this year, setting a new record attendance in the WSL and achieving a memorable sell-out for our recent UEFA Women’s Champions League semi-final against Wolfsburg earlier this month.\n“It’s wonderful to see the support for the team at Emirates Stadium, Meadow Park and on the road week in, week out. This latest announcement ensures that as many supporters as possible can enjoy the matchday experience with us, as we continue to support the sustainable growth of women’s football.”\nMore information regarding season tickets will be communicated in due course, however we can confirm that we will be offering five-game packages to enable supporters to secure their seats for all our WSL games at Emirates Stadium next year.\nRegister below to hear more:\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 368,
  "scraped_at": "2026-02-14T12:21:57.502788"
}