{
  "article_id": "912ddd0ff414",
  "url": "https://www.standard.net.au/story/8292811/finals-success-culmination-of-bloods-hard-work/",
  "title": "Terang Mortlake prepares for WVFFL youth girls preliminary final against Horsham | The Standard",
  "date": "20230802T040000Z",
  "domain": "standard.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A focus on culture and a positive playing environment is translating into finals success for Terang Mortlake's junior girls football program.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Bloods' under 18 team won their first-ever final this past weekend, knocking off Warrnambool in an Western Victoria Female Football League elimination final.\nIt is now preparing for a preliminary final against Horsham, with the winner to progress to the grand final against minor premier South Warrnambool.\nBloods coach Nathan Jones, who has re-signed for the 2024 season, said the elimination final win was a great result for the club and wider community of women's football in Terang and Mortlake.\n\"Everyone's quite ecstatic to be honest,\" he said. \"It was our first finals win since we've been in the competition since 2019.\"\nJones praised a community approach for the team's success, with plenty of family support on the sidelines on Sunday.\n\"Early days, it was pretty hard going trying to get a team... but many hands make light work,\" he said. \"We've got a really good squad at the moment, we've got 28 girls on the list.\n\"We've got a really good culture going at the moment, girls feel safe and happy.\n\"It's just about making it fun and enjoyable and (we) let the result take care of itself.\"\nThe coach also highlighted the work of women's football manager Noel McConnell.\n\"He's very passionate about women's football, he was there right from the start,\" Jones said of McConnell. \"He's a pretty integral part of our team.\"\nJones said his team's strong start against the Blues, along with its intensity and pressure, were key ingredients in the 40-point win.\n\"Our girls are great to coach, everyone's really receptive, everything we've been working on throughout the year is starting to click now,\" he said. \"Our ball movement is getting a lot better and decision making under pressure.\"\nTeam captains Annabelle Glossop and Sophie Curran, both immersed in the Greater Western Victoria Rebels program, led from the front.\nGlossop kicked a game-high four goals, while Curran, in her first game back from a key injury, was a key player in defence.\n\"Annabelle, she's our focal point up forward,\" Jones said. \"She provides a really good target and good on-ground leadership.\n\"We had Sophie come back for her first run in quite a while and it was good to have her in the back line to settle things down and provide that leadership.\"\nJones said he would keep his messages ahead of Sunday's preliminary final against the Demons simple.\n\"Just our intensity and pressure,\" he said. \"Locking the ball in our forward 50 is pretty important and getting the backs to press up. Just simple messages, can't over-complicate things too much.\n\"We're obviously hoping to win and meet South Warrnambool in the grand final but we've just got to get through this week first.\"\n- Terang Mortlake plays Horsham at Stawell's North Park from 12pm, Sunday.\nMORE SPORT\nOur journalists work hard to provide local, up-to-date news to the community. This is how you can access our trusted content:\n- Bookmark https://www.standard.net.au/\n- Make sure you are signed up for our breaking and regular headlines and newsletters\n- Follow us on Facebook, Twitter, Instagram and LinkedIn\n- Tap here to open our Google News page\n- Join our Courts and Crime Facebook group and our dedicated Sport\n- Facebook group\n- Subscribe",
  "word_count": 570,
  "scraped_at": "2026-02-14T13:26:39.861961"
}