{
  "article_id": "914b5776cf63",
  "url": "https://www.afaqs.com/news/mktg/kickin-it-corporate-standard-chartered-cup-scores-big-for-brand-bonding-8583317",
  "title": "Kickin  it corporate : Standard Chartered Cup scores big for brand bonding",
  "date": "20250102T030000Z",
  "domain": "afaqs.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In December 2024, India hosted the Standard Chartered Cup (SC Cup), one of the global corporate football events. Organised by Standard Chartered Bank, the tournament spans seven cities, engaging corporate teams in a five-a-side, 10-minute format. The winning team from India will get a trip to Anfield, the home of Liverpool FC.\nStandard Chartered has supported Liverpool FC's men's and women's teams for 14 seasons as their Main Club Partner. This longstanding partnership offers unique experiences to clients and employees worldwide, reflecting the shared values of excellence and community impact.\nIn an interview with afaqs!, Sumeet Singla, head of corporate affairs, brand, and marketing for India & South Asia at Standard Chartered Bank, discussed the SC Cup’s India edition and the benefits of the Liverpool FC association.\nEdited excerpts:\nStandard Chartered and Liverpool FC have shared a 14-year partnership. How has it evolved over the years?\nLiverpool FC and Standard Chartered have one of the longest Premier League partnerships, dating back to 2010. This 17-season partnership runs until May 2027. We are the second longest-running Front of Shirt sponsor in the Premier League.\nLiverpool FC is a global brand with a long history and a huge fan base in Standard Chartered's key markets in Asia, Africa, the Middle East, Europe, and the Americas. Standard Chartered, too, has 170 years of history with a presence in the world’s most dynamic markets.\nOur partnership with Liverpool FC provides incredible money-can’t-buy opportunities and experiences for our clients, colleagues, and the communities where we operate.\nThe partnership provides us an opportunity to accelerate visibility of our brand, improving recognition across our footprint and around the world.\nSumeet Singla, Standard Chartered\nThe partnership between Standard Chartered and Liverpool FC has also supported several of the bank's global sustainability and community investment programmes, including Futuremakers by Standard Chartered, which empowers disadvantaged youth to learn, earn, and grow. Further, the format also brings our clients and employees together across key cities in India, which helps reinforce the relationships with both clients as well as our colleagues.\nThe Standard Chartered Cup brings together clients, staff, and football enthusiasts across multiple markets. How does this event align with the bank's broader branding and marketing goals in India?\nAt Standard Chartered, sports such as football and marathons are seen as a unifier, as they bring employees and clients together and help reinforce the brand’s relationship with them.\nFor employees, the Standard Chartered Cup is an opportunity to foster a sense of camaraderie with colleagues outside of the office premises. With our clients, the cup creates a positive impact and deepens the brand recall, as the event over time has become one of the biggest corporate football tournaments in India.\nThe tournament also symbolises Standard Chartered’s continued commitment to deepening the brand connection in India.\nWe have a rich legacy in India that spans more than 165 years, and India is one of the key markets for the group. We are a cross-border bank for our clients and also wealth managers for the wealthy and affluent.\nSumeet Singla, Standard Chartered\nFootball is often associated with teamwork and resilience. How do these values resonate with Standard Chartered’s identity and ethos?\nFootball is the world’s most popular sport, and hence it brings together people and cultures across the globe. Teamwork and leveraging the strengths of each player are at the core of this sport.\nEach player has a designated role (be it as a forward, defender, or midfielder) while staying connected for the sole purpose of scoring a goal. Similarly, Standard Chartered Bank has, for over 170 years, acted as a super connector bank for its clients and the world’s most dynamic markets.\nThe bank, with this vast and interconnected network, has played an important role for its clients. Whether it’s growing wealth through cross-border investments, financing business innovation, or helping them plan for the future they want, the bank always looks to go beyond expectations. Because we’re Standard Chartered, and we’re here for good.\nHow has Standard Chartered positioned football as a brand engagement tool in a market like India where cricket reigns supreme?\nFootball is the world’s most popular sport. In India, football has a sizeable following, particularly for marquee clubs like Liverpool FC, and our association with Liverpool helps enhance connections for both brands.\nAmong Standard Chartered Bank’s top 7 markets, India is ranked one for Liverpool FC internet-connected followers at 106.7 million, as well as for social and digital followers at 7.2 million.\nSumeet Singla, Standard Chartered\nFor close to a decade, Standard Chartered and Liverpool FC have used their partnership to focus on health and fitness, foster team spirit, drive client engagements, and reinforce employee engagements.\nWith more than 407 million Liverpool FC followers across the world—many in Standard Chartered’s markets across Asia, Africa, and the Middle East—we believe the association also brings excitement and joy to our colleagues and clients.\nThe SC Cup 2024 spans seven cities in India. Could you share the logistical and marketing efforts involved in pulling off an event of this scale?\nThe Standard Chartered Cup 2024 involved organising events across seven cities in India. In every city, corporates participated in 5-a-side, 10-minute matches. The winners of the city editions will play each other for the eventual India edition winner title.\nThe winning corporate team from India travels to Anfield—the iconic home of Liverpool FC. Additionally, employees from various cities participate in matches exclusively for our colleagues.\nThe logistics involve different teams, not just from India, but even from the group, working together. Our wealth and retail branch teams work on inviting our clients across respective cities to send in their teams for participation.\nThe marketing team is involved in ensuring visibility by leveraging various platforms, such as internal communication, social media, and earned media.\nSumeet Singla, Standard Chartered\nThe integrated communication approach helps us amplify the event across key stakeholders that further pushes brand visibility and recall.\nHow do rewards like a trip to Anfield strengthen client relationships and brand recall?\nWe believe a trip to Anfield—the iconic home of Liverpool FC—is the ‘money-can’t-buy’ coveted opportunity for the winning client team of SC Cup India 2024.\nAs part of the winning prize, the client team gets an opportunity to witness a live match and get an exclusive stadium tour, including a behind-the-scenes entry to the dressing room of the home team and the iconic Player’s Tunnel.\nThey also get a chance to meet LFC legends during the Anfield trip. These are moments that clients cherish for a long time and help strengthen our relationship with them and, in turn, eventually help the overall brand.",
  "word_count": 1102,
  "scraped_at": "2026-02-14T12:43:19.415813"
}