{
  "article_id": "916eaac64dab",
  "url": "https://www.theguardian.com/world/2023/apr/24/first-edition-ofsted-inspections",
  "title": "Morning briefing : Why teachers and campaigners want Ofsted to change its ways",
  "date": "20230424T061500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. After the death of primary school headteacher Ruth Perry, there has been an uproar from the education sector about the way Ofsted inspects schools in England. Perry took her life while waiting for a report from the schools watchdog which downgraded her school from “outstanding” to “inadequate”, with her family describing her death as “a direct result of the pressure caused by the school inspection”. At the time, Ofsted described inspections as “hugely important” in holding schools to account, and said that it was continuing to support Caversham primary school, where Perry worked.\nThis tragedy has intensified the conversation around reforming the body which has, for much of its three decades of existence, been in an unhappy relationship with the people and institutions it inspects. Its inspections are viewed by many as punitive, part of an opaque system of inconsistent evaluations with the power to derail entire careers. Even the head of Ofsted has admitted that there is “a culture of fear” around school inspections. In the wake of Perry’s death, there are now calls from various corners of the education sector for fundamental reforms of the agency.\nFor today’s newsletter, I spoke to the Guardian’s education editor Richard Adams about the criticisms levelled at Ofsted, and what a future without it might look like. That’s right after the headlines.\nFive big stories\n-\nNHS | Ambulance crews in England are spending 1.8m hours a year – the equivalent of 75,000 days – dealing with patients with mental health problems, new NHS figures reveal. The National Audit Office reported in February that 1.2 million people were waiting to receive care and treatment from NHS community mental health services.\n-\nLabour | Diane Abbott has been suspended as a Labour MP after the former shadow home secretary played down suggestions of racism against Jewish people, Gypsy, Roma, Traveller people and Irish people in a letter she wrote to the Observer.\n-\nSudan | The UK has evacuated British embassy staff and their families from Khartoum, however James Cleverly, the foreign secretary, has said that diplomatic efforts to support other British nationals trapped in Sudan are currently “severely limited”.\n-\nImmigration | More than 830 UK healthcare professionals from leading medical bodies, including the BMA and the Royal College of Obstetrics and Gynaecologists, have signed a letter to the prime minister expressing “grave concerns” about the governments scheme to send asylum seekers to Rwanda.\n-\nSocial care | Nationwide polling for the Guardian has found that trust in care homes has fallen. Nine out of 10 older people believe there are not enough care staff and half have lost confidence in the standard of care homes since the start of the pandemic.\nIn depth: ‘Nobody is happy at this point, apart from the Department for Education’\nWhat does Ofsted actually do?\nA number of different areas fall under Ofsted’s scope, including inspecting education in prisons, local authority children’s services, and apprenticeship settings. Its main, and biggest, task as an independent agency, however, is examining more than 20,000 primary and secondary schools and colleges in England.\nRoughly, this is how things go: every three to four years, depending on the school, Ofsted will ring and let them know that a group of their inspectors will be coming the next day to spend a few days interviewing teachers, senior staff, governors and – in some cases – students. They look at everything from the curriculum, to leadership, to the way classes are taught and then they write up a report. Within 30 days the school will find out how they did, along with a grade: outstanding, good, requires improvement, and inadequate.\nSchools that are doing particularly poorly are placed in special measures. “There are [subcategories], but cumulatively the school gets one overall grade, which is the major cause of controversy,” Richard explains.\nThe main criticisms\nTeachers and those who work in education have long held gripes about Ofsted, but since the pandemic it seems as though that relationship has soured further.\nOfsted’s priorities seem to change with little explanation, so it can feel difficult to know what schools should be aiming for. “As a result there’s a lot of concern about what Ofsted wants to see,” Richard says. “There is an industry of consultants, in some cases former Ofsted inspectors or former headteachers who have been through the process, that schools can hire. In some schools they will conduct mock inspections, and tell them what they need to change in order to impress Ofsted.”\nWhile Ofsted has said that schools do not need to do this kind of preparation, the advantages for doing so appear clear. There is Richard explains, a “vicious cycle” where wealthier schools, for example those who hire consultants, continue to get higher ratings. In turn, “if the school is graded as outstanding it will be easier to hire teachers and you will get more parents wanting to send their children there”.\nAlthough they are only one or two words, Ofsted grades have huge ramifications. The pressure of avoiding the lowest two grades can be crushing, and an “inadequate” rating could spell the end of a headteacher’s career. When a school does have significant problems, like safeguarding risks, Ofsted go in rapidly and change happens very quickly, but for many schools without such serious issues, it can be a slow process to improve, all while struggling to hire teachers and retain students. “It’s very off-putting and in many instances will lead to the headteacher losing their job,” Richard says.\nIs change likely to happen soon?\nCriticism of the inspectorate has reached a fever pitch, with many in the sector raising serious concerns about the agency. “The problem is nobody is happy with Ofsted at this point, apart from, possibly, the Department for Education,” Richard says. The National Governors Association, the main teaching unions, the Labour party and the Liberal Democrats – as well as a significant number of teachers – have called for fundamental reforms of Ofsted. Richard says it’s not surprising that so many have weighed in. “As time has gone on, the desire for reform has got larger and more radical.”\nSince the death of Ruth Perry, calls have been made to pause inspections, which Ofsted has rejected. Its chief executive has proposed some changes, including a review into how the inspectorate ensures the wellbeing of school staff, in particular headteachers – measures described as “totally inadequate” by Perry’s family. Fundamentally, though, the main thing that everyone wants is for the current system of one-word grades to be replaced.\nThe Labour party has proposed “what they describe as a report card, which would be a brief summary of an inspection report that would summarise the school in a small number of categories,” Richard says. Other critics say that there should be more of a collaborative model, where whoever is inspecting works with the schools to give them more agency and more opportunity to improve.\nThe point of these changes is simple: one word grades can be reductive and do not give schools room to improve. “It is massively demoralising to be labelled inadequate,” says Richard. Very few schools are genuinely deserving of that label, he says – rather “they’re often weak in one or two areas, but that’s not the same as being completely inadequate.”\nA new system for inspections will probably only come with a change of government, but many teachers feel that they cannot wait, says Richard. “The cliff edge between the different ratings is too great, especially when a bad rating can have such devastating consequences for schools, teachers and students”.\nWhat else we’ve been reading\n-\nZoe Williams’s interview with Molly Ringwald about her second act in France and identifying with exploited actor Maria Schneider – and translating a memoir about her – is brilliantly done. Hannah\n-\nLeyland Cecco spoke to Indigenous people in Canada who have been dealing with leaks from an oil sands operation that has contaminated their water. “We’re not talking about compensation. I don’t want compensation. I want them off our traditional land,” said Alice Rigney, an elder in Athabasca Chipewyan First Nation. Nimo\n-\nEmma Beddington’s tale of “housebarrassment” during a visit from her French in-laws is typically entertaining – even if it turned out there were sadly more shameful things awaiting them in the UK. Hannah J Davies, deputy editor, newsletters\n-\nIn the Observer, four young novelists share their stories on living and working during a national housing crisis, recounting horror stories of exorbitant price hikes, difficult landlords and cramped house shares. Nimo\n-\nICYMI: Harper’s sent author Lauren Oyler on Gwyneth Paltrow’s Goop cruise, and she wrote 10,000 astonishing words about it. Hannah\nSport\nFootball | West Ham eased relegation concerns with a vital 4-0 victory against AFC Bournemouth. Meanwhile, Newcastle rose to third in the Premier League, six points and two places ahead of a Spurs team that they beat 6-1 at home. A Jacob Murphy goal just 61 seconds into the match set up a blitz that saw 5 goals conceded by Spurs in the first half alone.\nLondon marathon | Dutch Olympic track champion Sifan Hassan won the women’s race during her marathon debut. Hassan, 30, won a sprint finish in 2 hours, 18 minutes and 33 seconds. In the men’s race, Kenyan athlete Kelvin Kiptum powered past his opponents winning in 2hr 1min 25sec – the second-fastest time in history and a course record for London.\nSnooker | Four-time world champion John Higgins established an 8-0 lead over England’s Kyren Wilson in their second-round clash at the World Snooker Championship.\nThe front pages\nThe Guardian leads with “Armed forces evacuate UK embassy staff from Sudan”. The Telegraph reports “UK citizens ‘abandoned’ amid feeble response to Sudan crisis”.\nThe i says “Abbott loses labour whip over ‘offensive’ race comments”. The Times leads with the same story under the headline “Corbyn ally sparks new Labour row over racism”. The Financial Times reports “US urges South Korea not to fill China shortfalls if Beijing bans Micron chips”.\nThe Mail splashes with a new campaign demanding the return of VAT-free shopping for UK visitors with “Time to scrap the tourist tax”. Finally, the Mirror quotes “Ex-Tory voter” Rod Stewart in its headline “Rod: Give nurses a rise now”.\nToday in Focus\nEmbracing a childfree life\nHelen Pidd, the Guardian’s north of England editor, had always wanted to be a mother. The moment she realised that her third round of IVF had failed was devastating. “I couldn’t see beyond how sad I felt,” she tells Hannah Moore. Since then, she’s been trying to imagine what the next part of her life might look like by speaking to people who are childfree by choice.\nCartoon of the day | Edith Pritchett\nSign up for Inside Saturday to see more of Edith Pritchett’s cartoons, the best Saturday magazine content and an exclusive look behind the scenes\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nAt the age of 80 Margaret Thompson took to the skies, paragliding for the first time in her life. For many, it’s a terrifying feeling being suspended in midair, but for Thompson all she remembers is feeling free, “like you are up in heaven somewhere there, watching everyone down below.”\nShe did her second paraglide five years later, raising £2,500 for Moorfields Eye Hospital in London and a hospice in Belfast, with the help of social clubs run by the Presbyterian church she attends in the city. Now 86, Thompson plans to do her third flight when she is 90.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day – with plenty more on the Guardian’s Puzzles app for iOS and Android. Until tomorrow.",
  "word_count": 1982,
  "scraped_at": "2026-02-14T12:02:44.769178"
}