{
  "article_id": "9172eae12fce",
  "url": "https://www.yorkpress.co.uk/news/25719331.yorks-lord-mayor-cllr-martin-rowleys-christmas-message/",
  "title": "York Lord Mayor Cllr Martin Rowley Christmas message",
  "date": "20251225T104500Z",
  "domain": "yorkpress.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "York's Lord Mayor Cllr Martin Rowley looks back on the year as he wishes York a Merry Christmas and Happy New Year.\nAs I sit and look back over the last year, there is much to be happy about. As a city we have celebrated a number of significant events. The 80th anniversaries of VE and VJ Day, the 300th anniversary of the Mansion House, and The Women’s Rugby Union World Cup.\nContinuing the Sporting theme, both the Football Club and the Rugby League Club have had success with the latter gaining promotion to the Super League for next season.\nAs a Civic Party we have been very busy since taking up the roles in May. So far, we have competed over 390 engagements which includes visits to 40 of the 64 schools and colleges in York.\nWe have been humbled to see ordinary people doing extra ordinary things within the community. We have celebrated with local businesses, cut ribbons, and recognised the very best that York has to offer.\nWe’ve also had a number of more sombre events. Several key figures in the city have passed away this year including former Lord Mayors and Sheriffs as well as individuals who have served the city with selfless commitment.\nYork is better for their input and legacy.\nAs we look to Christmas, we recognise that God’s gift to the world came as a baby born in a stable to lowly parents, yet his impact on humanity continues to echo through eternity. The prophet Isiah called him the ‘Prince of Peace’.\nOur hope is that you would find that peace in all that you and your family do. And so, on behalf of myself, the Lady Mayoress, the Sheriff and the Sheriff’s Consort, may I wish you a very Happy Christmas and a peaceful and prosperous New Year.",
  "word_count": 306,
  "scraped_at": "2026-02-14T12:37:15.547997"
}