{
  "article_id": "917bf9b86927",
  "url": "https://english.news.cn/europe/20230911/4ff51761920c41b5b27346ec38a68544/c.html",
  "title": "Luis Rubiales resigns as Spanish football federation president - Xinhua",
  "date": "20230911T050000Z",
  "domain": "english.news.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "MADRID, Sept. 10 (Xinhua) -- Luis Rubiales resigned as president of Spain's football federation (RFEF) late on Sunday night.\nRubiales had come under increasing pressure to step down from his post after his behavior at the end of Spain's 1-0 win against England in the Women's World Cup final in Australia three weeks ago, when he was filmed making obscene gestures from the directors' box and then gave an unconsented kiss to Spain player Jenni Hermoso during the post-game rewards ceremony.\nThe 46-year-old was suspended by FIFA from his post for 90 days on August 26th, just 24 hours after he insisted that he would not resign in an incendiary press conference at the RFEF headquarters, and it was confirmed last week that he will face a criminal investigation for sexual assault after Hermoso pressed charges against him.\nLast week also saw the RFEF, now under the temporary leadership of former vice president Pedro Rocha, publish a communique criticizing Rubiales and calling for him to step down, while Jorge Vilda was also sacked as the coach of Spain's national women's team.\n\"It is evident that I will not be able to return to my position. Insisting on staying and holding onto it would not contribute anything positive to the federation or to Spanish football, because among other things there are factional powers that would impede my return,\" wrote Rubiales in his communique, in a clear reference to demands from the Spanish government that he step down.\nRubiales said another reason for his decision was to avoid damaging Spain's joint bid with Portugal and Morocco to host the 2030 FIFA World Cup.\nThe decision means the RFEF will now have to hold elections for a new president. ■",
  "word_count": 287,
  "scraped_at": "2026-02-14T14:07:48.246198"
}