{
  "article_id": "917d557eeb61",
  "url": "https://www.argusobserver.com/news/former-centennial-high-school-standout-drafted-third-overall-in-nwsl-draft/article_89071a56-9c19-11ed-b512-7f00a9c9b871.html",
  "title": "Former Centennial High School standout drafted third overall in NWSL draft",
  "date": "20230125T193000Z",
  "domain": "argusobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former Centennial High School and Boise Timbers-Thorns Emily Madril standout prepares to take a shot on goal while playing for the Florida State Seminoles during the 2022 season. Following the 2023 NWSL draft, Madril will compete for the Orlando Pride as a professional soccer player.\nAs a subscriber, you can share up to 3 articles each month with friends for free. Just click “Gift this Article” on this page, then copy the link or enter their email. Gifts are exclusive to subscribers, reset monthly, and each article can be redeemed once.\nBOISE — On Jan. 12, former Centennial High School and Boise Timbers-Thorns standout Emily Madril was drafted third overall in the 2023 National Women’s Soccer League, NWSL, draft. After growing up in Boise, Madril competed for Centennial her freshman year before moving to Florida to compete for Navarre High School for the remainder of her high-school career.\nIn Florida, she netted 107 goals while dishing out 70 assists, and won Florida Dairy Farmer Miss Soccer and FHSAA 4A Player of the Year her senior year — according information from the Idaho Press.\nKeep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language. PLEASE TURN OFF YOUR CAPS LOCK. Don't Threaten. Threats of harming another\nperson will not be tolerated. Be Truthful. Don't knowingly lie about anyone\nor anything. Be Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person. Be Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts. Share with Us. We'd love to hear eyewitness\naccounts, the history behind an article.\nCANYON COUNTY — A teenager died Feb. 10 from injuries in a crash in Canyon County when his vehicle was hit by a semi-truck near the intersection of Wagner Road and Highway 20/26. Read more2-vehicle crash in Canyon County kills teen\nMalheur Education Service District\nSpecial to the Argus Observer\nUpdated\nONTARIO – Professional development is a crucial element to success for any organization, and new grants will help early learning teachers across three counties improve their skills implementin… Read moreMalheur ESD gets $57K in grants for early learning\nCANYON COUNTY — Two vehicles with people from Ontario in them were involved in a four-vehicle crash on Interstate 84 on Feb. 6, with the crash killing a 20-year-old woman from Homedale. Read moreHomedale woman, 20, dies in 4-vehicle crash on I-84\nONTARIO — Have you heard rumors about Buffalo Wild Wings coming to Ontario or Nyssa? Several positions for that restaurant in Ontario and Nyssa have been posted on Next Hire Portal. However, p… Read moreDon’t bet buffaloed by that job listing",
  "word_count": 439,
  "scraped_at": "2026-02-14T12:14:17.953687"
}