{
  "article_id": "917fb5eb13fb",
  "url": "https://greatbendpost.com/posts/085ed100-7c1b-42e8-9a31-9720938d419f",
  "title": "Friday Sports Headlines and Scores presented by Barton Community College",
  "date": "20260102T144500Z",
  "domain": "greatbendpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NEW ORLEANS (AP) — Trinidad Chambliss passed for 362 yards and two touchdowns, and Lucas Carneiro kicked his third field goal of the game with 6 seconds left to put No. 6 Mississippi in front for good in a 39-34 victory over third-ranked Georgia in a College Football Playoff quarterfinal in the Sugar Bowl. In an unusual twist, Ole Miss was awarded a safety on its final kickoff when Georgia’s return team tried a cross-field lateral that hit the pylon. Gunner Stockton ran for two TDs and rallied Georgia from a 10-point, fourth quarter deficit before Chambliss drove the Rebels for Carniero's decisive 47-yard kick in less than a minute.\nPASADENA, Calif. (AP) — Fernando Mendoza threw three touchdown passes, Indiana’s defense thoroughly throttled Alabama, and the top-seeded Hoosiers roared into the College Football Playoff semifinals with a 38-3 victory in the 112th Rose Bowl. Mendoza passed for 192 yards in his first game since winning his school’s first Heisman Trophy, but the hard-nosed Hoosiers won the Rose Bowl for the first time in school history by dominating the Crimson Tide at the line of scrimmage. Indiana scored the game’s first 24 points before pouring it on with fourth-quarter rushing TDs from Kaelon Black and Roman Hemby, wrapping up a jubilant win in the 112th edition of the Granddaddy of Them All.\nMIAMI GARDENS, Fla. (AP) — Oregon dominated Texas Tech with a 23-0 victory in the College Football Playoff quarterfinal at the Orange Bowl. Matayo Uiagalelei caused a fumble that set up a touchdown, and Jordon Davison rushed for two scores. Dante Moore threw for 234 yards, and Atticus Sappington kicked three field goals. Oregon, now 13-1, will face either Indiana or Alabama in the Peach Bowl on January 9. Texas Tech, which finished 12-2, struggled offensively, turning the ball over four times. This win marks Oregon's first shutout of an AP-ranked opponent since 2012.\nMIAMI GARDENS, Fla. (AP) — When Indiana met Oregon in October, the game served as the best test yet of whether the Hoosiers were a one-year wonder or a program that was here to stay. They met that challenge with a double-digit win that snapped Oregon’s 18-game home winning streak. Next week comes a rematch with a trip to the national title game at stake. A pair of Big Ten blowouts — Indiana 38, Alabama 3 and Oregon 23, Texas Tech 0 — set up Oregon-Indiana, Part 2 in the national semifinals at the Peach Bowl next Friday. Miami will play Ole Miss, a 39-34 winner over Georgia.\nWEST PALM BEACH, Fla. (AP) — Presidents often find solace in golfing, and Joint Base Andrews in Maryland is a favorite spot because it's close to the White House and has built-in security. Known as \"the president's course,\" Andrews has hosted presidents dating back to Gerald Ford. Barack Obama played it more than 100 times. Then there's Donald Trump. He's an avid golfer but doesn't play Andrews, preferring courses his family owns. Now, he's planning a major renovation project for the golf courses at Andrews with legendary champion Jack Nicklaus serving as architect. The White House says the project's cost, and when work will start, hasn't been determined — nor has who will pay for it.\nA person familiar with the negotiations tells The Associated Press that right-hander Tatsuya Imai and the Houston Astros have agreed to a $54 million, three-year contract. Imai gets a $2 million signing bonus and salaries of $16 million this year and $18 million in each of the final two seasons. He can earn an additional $9 million in escalators based on innings. A 27-year-old righty, Imai went 10-5 with a 1.92 ERA last season for the Pacific League’s Seibu Lions. He struck out 178 batters in 163 2/3 innings. He is a three-time All-Star.\nBATON ROUGE, La. (AP) — New LSU football coach Lane Kiffin attended the No. 5 Tigers’ women’s basketball game on Thursday night as his former team — Mississippi — was taking on Georgia in a College Football Playoff quarterfinal game at the Sugar Bowl. Kiffin and women’s basketball coach Kim Mulkey emerged from the tunnel holding hands before the Tigers faced No. 11 Kentucky. Kiffin and Mulkey’s appearance on the court drew a roar from the crowd, and Mulkey raised her left hand to point at Kiffin while the pair responded by raising their joined hands in the air. Kiffin’s appearance at the LSU game came at just about the same time as his old team, Ole Miss, was kicking off its CFP game. LSU lost the game 80-78.\nOWINGS MILLS, Md. (AP) — Lamar Jackson says he’s expecting to play when the Baltimore Ravens take on the Steelers in Pittsburgh for the AFC North title Sunday night. Jackson returned to practice Wednesday and was a full participant, but he didn’t talk with reporters at the podium until Thursday. He said he’s feeling good after missing last weekend’s game at Green Bay because of a back injury. That was the fourth game this season Jackson has missed, the first three because of hamstring problems. The Ravens need a win this weekend to make the playoffs after they entered the season as a popular Super Bowl pick.\nPASADENA, Calif. (AP) — Alabama quarterback Ty Simpson says a cracked rib sidelined him in the second half of the Crimson Tide’s 38-3 loss to top-seeded Indiana in the Rose Bowl. Simpson got hurt when an Indiana player’s helmet hit him in the torso and caused a fumble after he made a courageous scramble through the Hoosiers’ defense for a first down late in the first half. He had an X-ray at halftime that revealed the injury, Simpson said after the College Football Playoff quarterfinal ended. Simpson acknowledged that he might have tried to do too much on that play after he came up one yard short of a first down on an earlier run.\nSAN ANTONIO (AP) — The San Antonio Spurs say an MRI showed center Victor Wembanyama sustained no ligament damage in his injured left knee, and their All-Star center will not play Friday in Indiana. The Spurs said Thursday that Wembanyama’s status is day-to-day. He did not travel with the team to Indiana, and instead will rehabilitate the injury in San Antonio. Wembanyama hyperextended his left knee with just under 11 minutes remaining in San Antonio’s 134-132 victory over the New York Knicks on Wednesday. Wembanyama said he felt fine after the game and expected to play Friday against the Pacers, but said San Antonio’s medical staff could decide otherwise depending on tests.\nFinals\nNATIONAL HOCKEY LEAGUE\nFinal Ottawa 4 Washington 3\nFinal Utah 7 N-Y Islanders 2\nFinal Toronto 6 Winnipeg 5\nFinal Tampa Bay 5 Los Angeles 3\nFinal Montreal 7 Carolina 5\nFinal OT Pittsburgh 4 Detroit 3\nFinal Chicago 4 Dallas 3\nFinal Seattle 4 Nashville 1\nTOP-25 COLLEGE FOOTBALL\nFinal (5)Oregon 23 (4)Texas Tech 0\nFinal (6)Mississippi 39 (2)Georgia 34\nFinal (1)Indiana 38 (11)Alabama 3",
  "word_count": 1164,
  "scraped_at": "2026-02-14T12:44:38.707690"
}