{
  "article_id": "918da126107f",
  "url": "https://weaintgotnohistory.sbnation.com/2024/5/1/24146577/liverpool-4-3-chelsea-women-super-league-post-match-reaction-review-highlights",
  "title": "Liverpool 4 - 3 Chelsea , Women Super League : Post - match reaction",
  "date": "20240502T001500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea Women knew they couldn’t just sit around and wait for Liverpool to start making mistakes before pushing for a goal. At the same time the hosts aren’t it the job of handing us away wins just so we keep up with Manchester City in the Women’s Super League title fight.\nLiverpool FCW 4-3 Chelsea FCW, Women’s Super League: Post-match reaction\nCrushed.\nMidfield clashes there were slightly favouring Chelsea, turned into the Blues keeping the ball in Liverpool’s defensive third. After winning a corner, today’s starting no.9 Catarina Macario assisted Aggie Beever-Jones for her 10th goal of the season.\nRight after that, Sjoeke Nüsken got very close to doubling our lead. Too bad the shot was parried by Liverpool goalkeeper Teagan Micah, and then cleared away from danger.\nFollowing Nüsken’s close shave, Chelsea allowed Liverpool to get too close to a tying goal. Battles for possession were lost in attack and midfield, and the Reds got a couple of counter-attacks and even open plays that forced captain Millie Bright — starting today for the first time since returning from an injury that kept her off contention for five months — and Hannah Hampton to intervene.\nGoing back to the tunnels at half-time, it felt Chelsea needed to do more than just “weather the storm” if they were to get out of this match against Liverpool with the full three points.\nUnfortunately, the Blues just couldn’t resist the hosts’ pressure. In the same way we scored the opener, Liverpool got the tying goal via Sophie Haug.\nThe Blues tried to answer in kind, but what we saw instead was Liverpool getting closer and closer to the comeback. And again, on a corner kick, they finally got what they were looking for with Erin Cuthbert scoring an own goal for them.\nOur attacking line’s lack of “edge” in front of the goal made it for a pretty easy lead defence for Liverpool. They even got some good counter-attacking opportunities on the back of Chelsea throwing the attacking kitchen sink at them.\nBut we still had ABJ on the pitch.\nAt the same time, Liverpool were still very dangerous on the counter. And Leanne Kiernan made sure we’d pay dearly for that, less than a minute after ABJ’s tying goal.\nChelsea still got themselves a tying goal again with a own goal from shot-stopper Teagan Micah.\nHowever, Liverpool’s fourth — and winning — goal meant we were almost surely getting ourselves out of the WSL’s title race for good.\n- Lauren James not in the squad and having a foot scan, according to Emma Hayes in an interview to Sky Sports before kick-off.\n- Didn’t expect to have Millie Bright back in the starting lineup so quickly after her recovery. As long as she’s fit and able to play, we’re taking it!\n- Give ABJ more starts, and she will give you more goals.\n- Tragic football from Chelsea once they got the lead. It was obvious Liverpool were going to score eventually, and they did right after half-time.\n- On paper, this Chelsea team should be cruising towards a win against Liverpool. What we’re seeing instead is this team crashing out of the title race thanks to their own misgivings.\n- Next up: Bristol City at home in the Women’s Super League.\n- KTBFFH.",
  "word_count": 552,
  "scraped_at": "2026-02-14T12:41:52.683801"
}