{
  "article_id": "919a05379086",
  "url": "https://cartilagefreecaptain.sbnation.com/tottenham-hotspur-women/66742/spurs-women-international-break-roundup",
  "title": "Spurs Women : International Break Roundup",
  "date": "20251102T063000Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "International break is over, and Tottenham Hotspur Women made it through (mostly) unscathed. It only cost me a few years off my life, and a few nails that I bit while waiting to hear whether Eveliina Summanen and Tōko Koga had been injured in untelevised games. Here’s how it all went down!\nSpurs Women: International Break Roundup\nAnyone else spend international break cosplaying the sweating emoji or just me?\nWe learned early in the break that Jess Naz was called up to replace the injured Jess Park. Excellent experience for Jess, though she didn’t make it off the bench. Here’s hoping she continues her upward trajectory and makes her way back into appearances for England. Elsewhere, Tinka Tandberg was an unused substitute for Norway, as was Amanda Nildén for Sweden.\nA few of our players saw more action, and most of them came away unscathed. Lenna Gunning-Williams collected a handful of substitute minutes for England U23s, and youth goalkeeper Sophie Jackson started two games for England U19s, Clare Hunt played a full 90 minutes in both of Australia’s games, while Charli grant appeared as a substitute in Australia’s 3-0 defeat to England. Martha Thomas grabbed an assist for Scotland in their 4-3 loss to Switzerland, and Lize Kop did well to keep clean sheets against Canada and Poland with three saves in each game.\nEveliina Summanen started for Finland in the much anticipated (by me, at least) matchup against Olivia Holdt’s Denmark. Eveliina left the match just before halftime with what Finland later reported was a rib injury. Olga Ahtinen replaced her, but Denmark went on to win 6-1 (with Olivia Holdt grabbing an assist in the 10 minutes she was on the pitch. Olga and Olivia were both unused substitutes in Denmark and Finland’s final game.\nMartin Ho confirmed Eveliina’s rib injury in his press conference (“a little bit of a fractured rib, if you want to call it that” - Martin,,, what do you mean). Apparently she’s been training through it and they’ll assess her availability ahead of the game. This is so much better than what we all originally assumed when we heard Eveliina left that game early. However, it’d be really cool if we could sign another DM so we didn’t have to (checks notes) play Eveliina through a broken rib. Good lord.\nTōko Koga also gave us a bit of a scare when she went down under a heavy challenge against Italy. I don’t think many of us were able to watch this game live so we had to rely on reports that she’d received medical attention and was substituted immediately after. I did all sorts of ungodly things to try to watch this game back and figure out how injured our star center back really was, but it was all for naught - it turned out Tōko was totally fine, and she even went on to start Japan’s next game. She was withdrawn at halftime but has been training ever since, and there’s no reason to think she’s not perfectly fit.\nReturn to WSL action\nSpurs return to action against Liverpool on Sunday, November 2nd at 7:00 AM ET/12:00 PM UK time. Liverpool have not started the season strongly – they currently sit in 11th place out of 12 and have yet to register a point. On the pitch, they haven’t looked as unfortunate as their results might suggest, but they’ve lost multiple key players to long-term injuries and had to deal with the devastating passing of their former head coach Matt Beard. You can read more about what Martin Ho has to say about the game here.\nIf you’re looking to watch a few of our young stars and our new and improved, actually enjoyable style of football, you can tune in on SkySports+ or on the WSL’s Youtube channel. Catch you on the flip side!",
  "word_count": 643,
  "scraped_at": "2026-02-14T14:21:26.703655"
}