{
  "article_id": "91a836ec5cec",
  "url": "https://www.thenationalnews.com/news/mena/2025/06/03/rsf-chief-threatens-to-attack-army-held-city-of-al-obeid-in-sudan/",
  "title": "RSF chief threatens to attack army - held city of Al Obeid in Sudan",
  "date": "20250603T120000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The commander of Sudan's paramilitary Rapid Support Forces has threatened to attack the army-held city of Al Obeid in North Kordofan, advising residents to stay at home and avoid potential military targets.\nIn a video posted online, Gen Mohamed Dagalo ruled out holding negotiations with the country's armed forces, which has fought against the RSF in a civil war that has ravaged the country since April 2023.\n\"The time for bargaining has ended. There will be no negotiations with those who kill their people with air power and refuse to admit to their crimes,\" Gen Dagalo said, referring to air strikes carried out by the armed forces. \"We are ready for a political solution but not with murderers and criminals.\"\nWith the army this year retaking control of the capital Khartoum and areas to the south of the city, the focus of the war has shifted to the vast Darfur and Kordofan regions of Sudan.\nThe RSF controls virtually all of Darfur and parts of Kordofan, where it has allied with a powerful rebel group that controls large areas of the region.\n\"We tell the army, we will come after you if you use Al Obeid as a base from which you bombard and penetrate Darfur and Kordofan. Our forces are ready,\" said Gen Dagalo, a one-time ally of armed forces commander Gen Abdel Fattah Al Burhan.\nSudan's armed forces and allied militias have made little progress in their attempts to dislodge the RSF from areas of Darfur and Kordofan in the past two months.\nThe paramilitary, whose forerunner is the notorious Janjaweed militia, claims to have destroyed 70 per cent of fighting vehicles used by a mobile army and militia force in Kordofan. The RSF also said it has regained control of areas in northern Kordofan recently captured by the army.\nThe army, which rarely reports on casualties or loss of territory, pushed the RSF out of most of the capital in March and cleared the remaining pockets of the paramilitary group on the fringes of the city last month.\nBut the RSF has responded with a series of drone attacks on the army's wartime capital of Port Sudan on the Red Sea. The strikes have damaged the city's port, army and air force bases, fuel storage tanks and power transformers. Drone strikes blamed on the RSF have also hit similar targets to the south and north of the capital.\nThe civil war began when tension between Gen Al Burhan and Gen Dagalo turned into open warfare. The conflict has become a struggle between two commanders vying for control of the country.\nThe war has killed tens of thousands of people, displaced about 13 million and left more than 25 million facing acute hunger, famine conditions are reported in areas across the impoverished nation.\nThe UN refugee agency said on Tuesday that the number of Sudanese who had fled the country has passed four million and that the scale of displacement was \"putting regional and global stability at stake\".\nTwo UN agencies, meanwhile, said on Tuesday that five people were killed and several others injured when a UN convoy ferrying food to families and children in Sudan's famine-hit city of El Fasher in Darfur was attacked overnight.\nA statement by the the UN children's agency Unicef and the World Food Programme did not say who was behind the attack and called for an urgent investigation into the incident.\nA Unicef representative said the attack took place in Al Koma, North Darfur, as the convoy waited for approval to proceed to El Fasher.\nFamine conditions have been reported in El Fasher and nearby displacement camps. The city has been under siege from the RSF since May last year.\nAl Shafie Ahmed reported from Kampala, Uganda",
  "word_count": 625,
  "scraped_at": "2026-02-14T12:11:23.141137"
}