{
  "article_id": "91ae62155ece",
  "url": "https://www.theguardian.com/thefilter/2026/feb/06/best-galentines-day-gifts-uk",
  "title": "The 31 best Galentine Day gifts your pals will love | Friendship",
  "date": "20260206T154500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Galentine’s Day may not be an official holiday (yet), but we’re on board with any opportunity to show your friends some love. For the uninitiated, the concept is simple: 13 February is earmarked as a day to get together with your besties and celebrate your friendship. It’s not so much the antithesis of Valentine’s Day, more a reminder that romantic love is not the only type of love there is.\nSo, if you’re planning a get together with your closest pals and want to show your appreciation with a gift (or maybe you just want to buy a pick-me-up for yourself), we’ve rounded up 31 fun and thoughtful ideas. Whether it’s a home pottery kit, a boxercise set, cosy slippers or a bundle for pickle lovers, our suggestions will help you find something to empower, treat and celebrate them.\nThe best Galentine’s Day gifts for 2026\nNote to self\nPapier wellness journal\nWhen life gets hectic, self-care can fall to the bottom of the priority list. This journal is filled with prompts to help them track and set wellness goals, and will encourage them to check in with themselves.\nTray cool\nLékué heart ice cube tray\nThis heart-shaped ice tray is cute and useful – and will make them smile every time they make an iced coffee at home.\nHot to pot\nHome pottery kit\nThis beginner-friendly pottery kit comes with clay, tools, paints and everything you need to create ceramics at home. Perfect for a friends’ night or a gift to encourage their creativity.\nGet shirty, in a good way\nMystery female football player shirt\nOne for the football fanatics. Each box contains a shirt with a female star player’s name on the back, randomly selected from a club or nation from around the world.\nMoments of reflection\nCalligraphy engraved compact mirror\nThis engraved compact mirror is useful, personal and a little bit luxe. The perfect pop-in-a-handbag size, and a more grownup alternative to using their phone as a mirror.\nCaffeine and cartoons\nPeanuts x Grind cafetière\nThis Snoopy cafetière from a Peanuts collaboration with Grind is joyful. The colour pops are pure Memphis Design, and the sight of Snoopy snorkelling in the coffee will inject some fun into their morning. The enamel mugs are a delight, too.\nFor more, read our guide to the best cafetières, tested\nPrints? Charming\nBlue mother of pearl photo frame\nA beautiful frame containing a photo of a fond memory is always a fail-safe gift. Oliver Bonas does beautiful dopamine-decor frames – this checked blue and mother of pearl one is particularly pretty.\nA friend indeed\nBad Friend: A Century of Revolutionary Friendships\nGiving your bestie a book called Bad Friend may seem like a not-so-thinly veiled insult at first glance, but this nonfiction book by cultural historian Tiffany Watt Smith explores the concept of female friendship through history, with interviews and memoir.\nJim-jam joy\nPink and red striped poplin pyjama bottoms\nThese adorable striped pyjama bottoms in quintessential Valentine’s Day colours will have them wanting a cosy night in with a romcom.\nFor more, read our guide to the best women’s pyjamas\nStyle statement\nBrass crescent and black disc earrings\nBuying jewellery for a friend can be tricky – even when you think you know their style, it’s easy to get it wrong. So keep it classic and simple – these black and brass earrings fit the bill perfectly.\nA touch of cloth\nSet of four cocktail napkins\nLinen cocktail napkins will save on paper waste and make a lovely gift – these food-and-drink-themed ones are quirky and cute. We love the pasta shapes.\nCan buy me glove\nEverlast boxercise kit\nA new hobby and way to release pent-up anger? Sign us up. This boxing set comes with pads and gloves so you can spar together – keeping fit and letting off steam at the same time.\nLove for their lips\nGisou honey-infused lip oil\nA lovely lip oil that feels nourishing like a balm, but gives shine and colour like a gloss. The perfect little pick-me-up for the friend who doesn’t leave the house without a lip treatment.\nFor more, read our guide to the best lip balms\nHair-raising gift\nMetal french hair pin\nFrench hair pins make it easy to achieve a chic up-do, even if you’re useless at home styling. This simple silver metal one will go with every outfit. There are tons of tutorials online that make it easy to perfect a sleek and sophisticated twist.\nI should cocoa\nKnoops hot chocolate flakes\nCold February days call for a delicious and soothing cup of hot chocolate. Knoops chocolate flakes come in various cocoa percentages, so you can tailor it to your friend’s taste. Melt them straight into hot milk for an indulgent treat.\nBeautiful brownies, boxed\nCake or Death ultimate bakery selection\nCake or death – that’s a pretty easy question. These indulgent, letterbox brownies are handmade in Devon and posted everywhere; we sampled the ultimate bakery selection, which are fudgy and gooey but crunchy in the right places. The pink leopard-print packaging is a treat, too.\nOnce a bottle, now a bag\nRecycled laptop sleeve\nFemale-owned brand Kind Bag makes brightly coloured bags and accessories using recycled plastic bottles. This laptop sleeve comes in various jazzy patterns that will provide an instant hit of dopamine.\nKeep charm and carry on\nEspresso martini beaded bag charm\nBag charms can add sparkle to an otherwise plain handbag. Anthropologie has lots of quirky options. We love this espresso martini design, equal parts classy and fun.\nHappy hands\nL’Occitane shea butter hand cream, 150ml\nThis L’Occitane shea butter hand cream is a “handbag essential”, according to our beauty writer Sarah Matthews, who rated it the overall winner in her test of the best hand creams. Made with a moisturising mix of shea butter, argan and coconut oil, it’s “beautifully soothing, softening and protective without feeling greasy”.\nTreat for their feet\nCalzedonia crossover pilates socks\nThese crossover pilates socks feel much more elegant than your standard grip socks. They come in black, khaki or grey leopard print and will have them rushing to book their next class.\nFrills to beat the chills\nRed gingham hot-water bottle\nThis red gingham hot-water bottle with a frill edge is completely charming: a cosy bed companion that won’t hog the duvet.\nFor more, read our guide to the best hot-water bottles\nLiving la Frida loca\nFrida Kahlo cross-stitch kit\nAnalogue activities like cross stitch are the key to reducing screen time, and their repetitive nature promotes mindfulness. This kit is beginner-friendly, and each stitch builds to reveal a picture of feminist icon Frida Kahlo.\nLove triangle\nNavy triangle scarf\nThis triangle scarf is a subtle and chic way to spice up their outfit, while protecting their neck from the cold. The navy with the pop of electric blue feels statement but so wearable.\nFor more, read our guide to how to dress stylishly in cold weather\nWords of inspiration\nFeminist History for Every Day of the Year\nKate Mosse’s book is filled with daily doses of inspiring stories, quotes, poems and pictures, all focusing on amazing women throughout history – from Malala Yousafzai to Billie Eilish.\nWhole choc a love\nCharbonnel et Walker red velvet heart chocolate truffles\n“Heart-shaped boxes of chocolates, like classic 90s romcoms, are good cheesy. This is the love token of champions,” says Jess Cartner-Morley. This one comes filled with milk and dark chocolate truffles that are almost too pretty to eat.\nFor more, check out Jess Cartner-Morley’s February style essentials\nSay it with bubbles\nNeom de-stress bath foam, 200ml\nYou can’t beat a nice bubble bath. This foam from female-founded brand Neom has a relaxing lavender, jasmine and Brazilian rosewood scent that will help them decompress, while marshmallow, aloe leaf, coconut and sweet almond oils will leave their skin supple and soft.\nLights to lift the gloom\nMini mindful moments candle set\nFilled with honey-scented candles with a 20-minute burn time, this set encourages the recipient to light a candle and take a moment out of their day to practise mindfulness.\nFor more, read our guide to the best scented candles\nArt works\nPaint and sip kit, margarita\nThis bundle comes with two premixed cocktails and a cocktail-inspired print with paints and a brush – everything needed for an evening of painting and sipping at home. You can choose from espresso martini, margarita and passion fruit martini.\nKeeping toes toasty\nYoko wool slippers\nA treat for the feet: these cosy slippers have a wool lining to keep toes extra toasty.\nFor more, read our guide to the best slippers\nStylish storage for essentials\nStriped ruffle pouch\nThis striped pouch with frill trim is adorable, and it solves a problem – it keeps all your essentials together so they don’t get lost inside your bag.\nPreserve your friendship\nThe pickle lover bundle\nThis lovely tomato-logo tote comes stuffed with three packs of pickles, three packs of pickle-flavoured crisps, and (perhaps more surprisingly) three bottles of pickle juice, ideal for mixing into dirty martinis … or just sipping straight. Cheers!",
  "word_count": 1517,
  "scraped_at": "2026-02-14T12:38:15.672943"
}