{
  "article_id": "91bed634b097",
  "url": "https://www.nytimes.com/athletic/6878133/2025/12/18/africa-cup-of-nations-2025-predictions-winner-players-to-watch-and-more/",
  "title": "Africa Cup of Nations 2025 predictions : Winner , players to watch and more",
  "date": "20251218T061500Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The 2025 Africa Cup of Nations (AFCON) gets underway in Morocco on Sunday, with the Ivory Coast attempting to defend the title they won in dramatic style less than two years ago.\nThe tournament runs from December 21 to January 18, 2026, and will be played out across nine stadiums in six cities in the North African country.\nAdvertisement\nThe hosts are among the favourites, but competition will be fierce and all eyes will be on Mohamed Salah following the events of recent weeks at Liverpool. The 33-year-old has yet to win AFCON.\nThe Athletic will have extensive coverage of the event, including live match blogs, post-game briefings and, of course, our trademark in-depth reporting from our journalists on the ground.\nHere, Simon Hughes, Jay Harris, Carl Anka, Max Mathews, Nick Miller and Ahmed Walid look ahead to the tournament and outline how they expect things might unfold.\nWhat are you most looking forward to about this AFCON?\nHughes: Warmer weather, good food, beautiful coastlines, fresh mountain air and the solitude of the desert. Oh, and a bit of football. AFCON has become my favourite international tournament for all sorts of different reasons. I’ll explain properly through my coverage but very briefly, it always provides news stories — yet it moves at a different pace, jerking from calm to confused in a moment. You have to strap yourself in. It is not easy. It is almost always awkward. This should be embraced. I can’t wait for all of it.\nHarris: There is nothing quite like it. Every edition is full of drama and surprises. Players you have completely forgotten about suddenly become superstars, such as former Middlesbrough and Birmingham City forward Emilio Nsue, who was the top scorer at the last AFCON. Three months after the tournament, FIFA ruled that Nsue, who was born in Spain, had never been eligible to play for Equatorial Guinea and should not have played. But in March this year, FIFA declared he was finally allowed to represent them — 12 years after he made his debut. That situation sums up AFCON perfectly — brilliant and bonkers at the same time.\nPlus, events over the past couple of weeks mean it will be fascinating to watch every move Salah makes.\nAnka: In a word: parity.\nAFCON 2023 has a claim to being one of the greatest 24-team tournaments in the history of the men’s game, and a lot of that comes down to the increasing competitiveness of the “smaller” nations. In October, FIFA president Gianni Infantino told the 54 members of the Confederation of African Football (CAF) that his organisation had invested more than $1billion (£750m) in African football development since 2016. Couple that extra cash with rule changes that make it easier for dual-nation players to switch allegiances and we are seeing stronger teams across the board.\nAdvertisement\nAFCON always packs a surprise, but the level of competitiveness has taken on another level as Comoros, Equatorial Guinea, Botswana and others steadily improve from tournament to tournament. AFCON is perfect for those who like upsets and underdog wins.\nMathews: How can I sum this up in just a few paragraphs?\nWell, the tournament being shown on Channel 4, free-to-air TV in the UK, will bring plenty of festive cheer for football fans and could inspire a new generation. The first AFCON over the Christmas and New Year period will provide plenty of vicarious, escapist joy for fans in chilly climes.\nThe drama, the storylines, the ranting, the fans, the creative team nicknames (Cameroon’s Indomitable Lions is a standout), the football. Salah putting his Liverpool saga behind him, Ivory Coast defending their title. Did I mention the drama?\nPlus, of course, when neutrals or doubters are swept along and realise why the Africa Cup of Nations is one of the most unique, joyful and significant tournaments in the sport.\nMiller: The crowds. Of all the countries where I’ve watched football, Morocco arguably has the best and most fervent fans. It feels mad that they have only hosted one other AFCON, and that was back in 1988. The atmosphere, like with all tournaments, will be shaped by how the host team performs, but if Morocco go deep, then it could be one of the great occasions.\nWe shouldn’t view any tournament as big as this as a precursor to anything, but this AFCON will be a little taste of what we might see at the 2030 World Cup, which Morocco will co-host with Spain and Portugal (and the brief gaggle of South American countries crowbarred in by Infantino to ensure Saudi Arabia gets 2034… but that’s a whinge for another day).\nWalid: The stories, the football and the vibes.\nEven if you are an African like me, the tales produced by AFCON are unbelievable — nothing beats its script.\nAdvertisement\nIvory Coast’s triumph in the previous edition is just one example of how the unimaginable can become reality. Youcef Belaili’s redemption arc with Algeria in 2019 after a two-year drug ban was something out of Hollywood. Or what about Gedo’s super-sub appearances off the bench to win Egypt their third AFCON in a row in 2010?\nIn recent years, the gap between the top nations in Africa and the next tier has shrunk, bringing us highly contested matches.\nAs for the vibes, AFCON is on a planet of its own.\nA big talking point will be…\nHughes: Can Morocco deal with the pressure of being the favourites as well as the host when sections of the public are increasingly cynical about football’s role in civic society, evidenced by protests against stadium building? The country’s performance at the World Cup in 2022, when they reached the semi-finals, was unexpected. Having disappointed at the last edition of AFCON in Ivory Coast, it now feels like they need to deliver, for reasons not just relating to sport. Oh, and Salah has been in the news recently. What will he do next?\nHarris: Nigeria’s reaction after failing to qualify for a second successive World Cup. Head coach Eric Chelle looked completely powerless as they were eliminated by DR Congo in last month’s World Cup play-off. Will he have had enough time to work out what went wrong? Or will Nigeria continue to underwhelm? To make the situation even worse, captain William Troost-Ekong retired from international duty after the play-offs, talented 20-year-old defender Benjamin Fredrick is ruled out with a knee injury and Ola Aina is also absent following hamstring surgery.\nAnka: Salah. The 33-year-old has twice reached the AFCON final (in 2017 and 2021), but there is pressure on him to lead his team to success and join other Egyptian greats such as Ahmed Hassan and Mohamed Aboutrika. His ongoing situation with Liverpool complicates things. Can he put the club football noise aside and deliver a brilliant tournament?\nMathews: How some of the biggest and most prominent countries fare amid severe fault lines in team unity, including anger over selection decisions, big squad omissions and issues with their national federations. See: Nigeria and Cameroon in particular. I’m predicting there will be a gargantuan crash out for one of the favourites in the group stages. As a sidenote, it’s a shame Ghana aren’t here. Their players and supporters are woven into the fabric of the tournament and the continent.\nAdvertisement\nMiller: Victor Osimhen. The Galatasaray striker has a solid case to already be considered Nigeria’s greatest centre-forward, with due respect and deference to Rashidi Yekini, Yakubu and others. But the one thing hanging over him is that he doesn’t quite have a ‘signature’ performance for the national team: admittedly, he’s only really significantly played at one AFCON before, but if he scores the goals he’s capable of and Nigeria go all the way, the debate will have fewer dissenters.\nWalid: How Morocco perform on home soil. For all of their impressive performances, AFCON has been their stumbling block. They have not done well at the tournament in recent years, reaching its semi-finals only once since 1990 and making last-16 exits in two of the past three.\nMorocco have won AFCON only once, in 1976, and were runners-up in 2004. They finished in fourth place when they hosted in 1988. Can they rise to the occasion this time?\nWho will win it?\nHughes: It is tempting to say one of the north African nations because of form, talent and familiarity with the conditions, as well as local pressures, but I’m looking elsewhere. In 2000 and 2002, Cameroon won successive titles with penalty shootout victories in both finals. Egypt then won three in a row between 2006 and 2010. Can Ivory Coast go back-to-back? Their record in qualifying for the World Cup was almost impeccable but there were a few surprise squad omissions earlier this month. I also think Senegal will do well. They have a relatively clear path to the final if they win their group and have one of the most exciting young players on the continent in midfielder Lamine Camara.\nHarris: There is a tendency to overlook South Africa because they do not have a superstar like Nigeria (Osimhen), Morocco (Achraf Hakimi) or Egypt (Salah). South Africa have one of the best domestic leagues on the continent. Mamelodi Sundowns have won the past eight titles in a row and lost the two-legged CAF Champions League final against Egyptian side Pyramids before appearing at the Club World Cup in the summer.\nA large portion of South Africa’s squad play for Sundowns or Orlando Pirates, which means they have a deep understanding of each other’s game, rare at the international level. They were eliminated by Nigeria in the semi-finals of AFCON 2023 and then topped their group for World Cup qualifying. They have been performing at a high level consistently for a couple of years and should make a strong impression in Morocco. However, head coach Hugo Broos’ comments about defender Mbekezeli Mbokazi on the eve of the tournament, which were labelled “racially suggestive and sexist” by one of the country’s political parties and for which he has since apologised, will surely have threatened the team’s harmony.\nAnka: It should be Morocco.\nAdvertisement\nThe north African nation’s youth sides and women’s teams have gone from strength to strength since the completion of the Mohammed VI Football Academy in 2009 (their version of France’s Clairefontaine or England’s St George’s Park). Morocco’s journey to the 2022 World Cup semi-finals captured the imagination, they won this year’s Under-20 World Cup and also hold the African Nations Championship (an AFCON-style tournament but only for players based in their national league competitions).\nAnd yet… this is AFCON. A tournament where early favourites can often run out of steam early, and a different challenger can spring a surprise. My personal bet for this is DR Congo, who reached the semi-finals of the 2023 tournament and are riding the wave of besting Cameroon and Nigeria in the most recent round of World Cup qualifiers.\nMathews: Morocco and Algeria will be strong, as will the less individually talented but arguably more cohesive South Africa. But I’m surprised no one has said Senegal.\nThey were one of the unbeaten teams in qualifying, conceding just three goals from 10 games, and have a very strong spine, comprising the Saudi Arabia-based trio of Edouard Mendy, Kalidou Koulibaly and Mane. They beat England in June — Thomas Tuchel’s only defeat in 10 games — and have a tantalising mix of youth and experience.\nLeft-field shout? Cameroon put aside the melodrama, with high-profile goalkeeper Andre Onana and former captain Vincent Aboubakar left out and federation president Samuel Eto’o sacking manager Marc Brys. Young stars, including Aboubakar Nagida (Rennes), Carlos Baleba (Brighton & Hove Albion), Karl Etta Eyong (Levante) and Christian Kofane (Bayer Leverkusen), could inspire them to success against the odds.\nMiller: Morocco? It’s always slightly silly to apply form to any international tournament, not least AFCON, but they battered their opponents in World Cup qualifying (eight games, eight wins, 22 scored and just two conceded). Combine that record with home advantage, and we should probably make them favourites.\nWalid: The heart says Egypt, but the mind begs to differ.\nHossam Hassan’s side are loaded with attacking talent, but Egypt haven’t been tested under their new head coach.\nAdvertisement\nMorocco are surely the favourites based on their recent performances and the quality of their individuals. As for the west African teams, Senegal and Ivory Coast will be strong contenders as usual, but Nigeria’s off-pitch issues could hinder them.\nI am going with Algeria because it’s almost like a home AFCON for them too, they have an experienced coach in Vladimir Petkovic and a mixed squad between those who won the 2019 edition and new upcoming talent.\nWhich country could be a surprise package?\nHughes: Tunisia qualified for the World Cup, accumulating more points (28 from 10 games) than any other African nation, albeit from one of the weaker groups. The most important players in their starting XI have experience at mid-ranking clubs from some of the best European leagues and they are not to be underestimated, even if a weakened squad performed badly at the Arab Cup. They should nevertheless head to Morocco with plenty of confidence, buoyed by a 1-1 draw with Brazil in France last month. I also expect Mali to be competitive. They have good players and an experienced coach.\nHarris: Gabon finished second in their World Cup qualifying group, one point behind Ivory Coast. They won eight games and lost only once. They were knocked out by Nigeria in the World Cup play-off semi-finals but should have capitalised on their superiority before extra time.\nThey are in a tough group that includes Cameroon, Mozambique and holders Ivory Coast. There will be greater pressure on Cameroon and Ivory Coast to perform, so I have a sneaky feeling Gabon will surpass expectations, backed by fantastic travelling support. It helps that Cameroon are in crisis after sacking Brys. His replacement, David Pagou, has omitted key players from the squad, including Andre-Frank Zambo Anguissa. Cameroon could surprise us — for all the wrong reasons.\nAnka: Tunisia had a 2023 tournament to forget, finishing bottom of their group with a trio of shock results. But they have rallied under head coach Sami Trabelsi, winning nine out of his 14 games since he began his second stint in charge in February. Their squad contains several players from Esperance Tunis, and that familiarity gives them a quiet competency that should steer them through Group C and beyond.\nMathews: Uganda only finished a point behind South Africa in AFCON qualifying, while Mozambique have two long-standing veterans in Domingues, a 42-year-old midfielder, and 37-year-old centre-back Mexer, plus the pacy, exciting Sporting CP winger Geny Catamo.\nAdvertisement\nElsewhere, Zambia outperformed Ivory Coast to qualify, and Angola and Comoros could pick up eye-catching wins and throw their weight around in the knockout stages, too.\nMiller: Tunisia were the other standout team in World Cup qualifying, so it will be really interesting to see if they can challenge Nigeria for top spot in their group. Burkina Faso are worth keeping an eye on too: they’ve got a reasonably friendly draw and have some really talented players, most obviously (to English/European eyes, at least) Dango Ouattara of Brentford.\nWalid: DR Congo. Even without Newcastle United’s Yoane Wissa, they have a squad that, on its day, can surprise even the best nations in Africa.\nThey recently reached the inter-confederation play-offs for the 2026 World Cup, where they will face the winner of Jamaica versus New Caledonia. They have lost only one match in 2025, a 3-2 World Cup qualifier defeat against Senegal in September.\nUnder Sebastien Desabre, who has been DR Congo’s head coach since 2022, they finished fourth in the last AFCON and have been improving year on year.\nWhich player will really make a name for themselves?\nHughes: Slowly, attention is falling on the talent emerging from South Africa, who should also be considered among the favourites after finishing third in 2023. The team has changed slightly since but some of the younger players are among the most exciting on the continent. Central defender Mbokazi, 20, has agreed to join Chicago Fire from Orlando Pirates after the tournament, while his team-mate at Pirates, Oswin Appollis, 24, offers energy and a goal threat from midfield. Mbokazi’s decision to move to the United States, however, was not welcomed by national coach Broos, who has been cited for alleged racism and sexism, which he denies and apologised for.\nHarris: Noah Sadiki, who turns 21 a few days before the tournament starts. He has been impressive for Sunderland this season and can play across multiple positions. DR Congo are well coached by Desabre and Sadiki should flourish with support from Cedric Bakambu, Aaron Wan-Bissaka and his club team-mate Arthur Masuaku.\nAdvertisement\nAnka: Senegal’s Lamine Camara has been playing football with a ‘ready for the Premier League’ glow for much of the calendar year. The 21-year-old is the sort of intelligent, hyper-mobile, defensive midfielder that English clubs are increasingly basing their early build-up around. A good AFCON and World Cup could lead to Monaco receiving major bids.\nMathews: Young players, such as 20-year-old Eliesse Ben Seghir (Morocco), and Assane Diao, 20, and 17-year-old Ibrahim Mbaye (both Senegal) could flourish.\nPlus, keep an eye on a pair of Bayer Leverkusen wonderkids, attackers Ibrahim Maza (20, Algeria) and Kofane (19, Cameroon). I enjoy how technical midfielders Azzedine Ounahi of Morocco, Algerian Anis Hadj Moussa and Egypt’s Emam Ashour play, too.\nMiller: This might depend on the definition of ‘making a name’, but Ivory Coast’s 19-year-old winger Yan Diomande is getting some very good reviews in Germany, where he plays for RB Leipzig.\nWalid: Algeria have one of the best African talents, Mohamed Amoura, who plays for Wolfsburg in the Bundesliga.\nHe is a versatile forward who can operate through the centre or down the wing. His pace and ability to bypass defenders are complemented by his fine finishing. In World Cup qualifying, Amoura was Africa’s top scorer, with 10 goals.\nAt 25, he is at the right moment in his career to shine.\nWho will be the player of the tournament?\nHughes: Whichever big player turns up for the nation that wins it. This leaves Hakimi (Morocco), Salah (Egypt), Franck Kessie (Ivory Coast), Osimhen (Nigeria) or maybe even Mane (Senegal) in contention, though his influence is waning. An alternative bet would be Ivory Coast’s Diomande. The 19-year-old only made his international debut this year but has scored twice in four appearances from wide positions.\nHarris: If Nigeria go far in the competition, then it could be Osimhen. They seem to be incapable of winning without him. I don’t think it will be Hakimi because of his injury concerns heading into the tournament.\nAdvertisement\nMaybe it will be someone from Senegal. They won AFCON 2021 and were eliminated at the last edition by the hosts and eventual winners Ivory Coast in a penalty shootout. Senegal were unbeaten in World Cup qualifying and only conceded three goals in 10 games. Mane is the obvious choice but I’m going for Iliman Ndiaye.\nAnka: I have absolutely no idea. AFCON is a tournament where footballing superstars find it harder to get the benefit of the doubt from match officials. Great players have turned up, got kicked to pieces and meekly exited stage left. Nigeria’s Troost-Ekong won the award in 2023, but few outside his country would have called that before a ball was kicked.\nPredicting this is a fool’s errand… but if Morocco win as the hosts of the tournament, it could be Hakimi.\nMathews: I expect it to be an inspirational, talismanic figure from a side that reaches the final. Maybe South Africa goalkeeper Ronwen Williams, DR Congo defender Chancel Mbemba, Nigeria’s heartbeat in midfield Alex Iwobi, or the gifted Brahim Diaz for Morocco.\nMiller: Eeesh, it could be anyone, but it will probably be a star man for the winners, so the narratively-consistent choice from me would be a Moroccan player. How about Brahim, a relatively recent recruit who only switched allegiance from Spain to Morocco last year?\nWalid: If I am putting all my eggs in the Algeria basket, then it’s going to be Amoura.\nHowever, just to diversify my odds of getting something correct, I’ll pick Salah. At 33, this AFCON might be Salah’s last opportunity to carry his nation to the coveted trophy he has yet to win.\nRecent events have taken his Liverpool career in a direction a few would have predicted, so he will want to prove his worth on the pitch. There isn’t a better way than winning AFCON with Egypt.\nWho will finish as the top scorer?\nHughes: Morocco should, at the very least, go deep into the tournament, leaving opportunities for their best attacking players. Ayoub El Kaabi, 32, has been prolific for Olympiacos across three club campaigns. Following an injury to Hamza Igamane, who has been similarly impressive this season for Lille following his move from Rangers in the summer, Morocco will need El Kaabi to show up.\nAdvertisement\nHarris: Keep an eye on Osimhen and Salah. Morocco’s Youssef En-Nesyri probably has a great chance. Maybe we shouldn’t ignore Nsue after his goalscoring heroics at AFCON 2023.\nAnka: Osimhen has 31 goals in 46 games for Nigeria, but only one in eight AFCON appearances. Two goals against Gabon in Africa’s World Cup qualifying semi-final temporarily put to rest claims that he does not turn up on the big stage for his country. This tournament will be a chance for him to banish such speculation for good.\nMathews: A grizzled, experienced striker for one of the stronger nations.\nEn-Nesyri (Morocco), Baghdad Bounedjah (Algeria) or Haller (Ivory Coast). Manchester City and Egypt forward Omar Marmoush is another fine player.\nMiller: Captain Obvious here, but Osimhen… or perhaps Amoura, who is taking over/has already taken over the mantle of Algeria’s key man from Riyad Mahrez.\nWalid: Amoura – watch this guy explode.",
  "word_count": 3665,
  "scraped_at": "2026-02-14T12:37:38.472401"
}