{
  "article_id": "9228ad5603fa",
  "url": "https://www.etonline.com/taylor-swift-and-travis-kelces-relationship-timeline-212215",
  "title": "Taylor Swift and Travis Kelce Relationship Timeline",
  "date": "20231227T084500Z",
  "domain": "etonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On July 26, 2023, Travis Kelce famously revealed on his podcast that his plan to give Taylor Swift his number had been fumbled.\nWhile it may feel like Taylor Swift and Travis Kelce's love story began in the blink of a crinkling eye, it's been more than a year since that fateful day in July 2023 that the football pro attended one of her Eras Tour shows, setting into motion a romance seemingly beyond both of their wildest dreams.\nWhat's more is Friday, July 26 marked yet another special anniversary in Taylor and Travis' tale as it was the day a year ago that Travis -- as Taylor later put it in an interview with Time -- \"very adorably put me on blast on his podcast.\"\n\"Which I thought was metal as hell,\" she told the magazine. \"We started hanging out right after that.\"\nAs a reminder, Travis revealed on his podcast with brother Jason Kelce that his plan to give Taylor his number on a friendship bracelet at one of her Eras Tour shows had been foiled. \"I was disappointed that she doesn't talk before or after her shows because she has to save her voice for the 44 songs that she sings,\" Travis said at the time, \"so I was a little butthurt I didn't get to hand her one of the bracelets I made for her.\"\nOf course, as Swifties know all too well now, that did not stop a romance from blooming between the two as they stepped out as a couple just a few months later -- and have been going strong ever since.\nTheir high-profile couple continues to dominate headlines after a year of public outings, world travel and professional milestones. Between Swift's blockbuster Eras Tour and Kelce's wide-ranging career endeavors, a source told ET on June 14 the couple is committed to making their relationship a priority.\n\"Taylor and Travis make sure that the current long-distance aspect of their relationship doesn't last very long. They both move their schedules around if it's feasible and try to carve out as much time as they can to see each other, as well as each other’s families and friends,\" the source said. \"They prioritize each other and do anything and everything to make each other happy. Their relationship is genuine and they both want to make it work, so it does.\"\nThe source added, \"Taylor and Travis definitely see a long-term future together and things are continuing to move in that direction. Their shared values and love of family keeps them connected.\"\nHere's everything we know about the singer and sports star's relationship so far.\nIt Started With a Friendship Bracelet\nIn July 2023, Travis revealed on his and his brother Jason Kelce's podcast, New Heights, that he was unsuccessful when he attempted to give Taylor a friendship bracelet after the Eras Tour concert at Arrowhead Stadium. The singer performed at the stadium on July 7 and July 8 of that year.\n\"I was disappointed that she doesn't talk before or after her shows because she has to save her voice for the 44 songs that she sings,\" Travis said. \"So I was a little butthurt I didn't get to hand her one of the bracelets I made for her.\"\nRevealing his plan at the time, Travis admitted that his bracelet had his phone number on it.\n\"If you're up on Taylor Swift concerts, there are friendship bracelets,\" Travis said. \"I received a bunch of them being there, but I wanted to give Taylor Swift one with my number on it.\"\nThat didn't exactly work out, as Travis noted, \"She doesn't meet anybody, or at least she didn't want to meet me, so I took it personal.\"\nJason, who plays for the Philadelphia Eagles, told his brother not to take it personally, as she was probably still upset about the Chiefs beating the Eagles at this year's Super Bowl.\n\"She probably just hasn't gotten over the Super Bowl yet,\" Jason quipped. \"She's a big Eagles fan, so maybe she just made something up and didn't want to talk to you.\"\nShaking Off the Rumors\nTwo months passed without an update about Travis' attempt to reach out to Taylor, though fans began to speculate if there was a connection. At the beginning of September, a source confirmed to ET that although he has a crush on Taylor, there was no romance ...yet.\n\"Travis has been into Taylor for a while and definitely has a crush on her. He is a simple guy that is very funny, charismatic, chill, and loves playing football,\" the source said at the time.\nIn a post-game interview that same week, Travis playfully brushed off an interviewer's question when pressed about the validity of his attempt to get Taylor's number.\n\"I said what I said. And I meant what I said when I said it. And you know what, it is what it is. I'm not gonna talk about my personal life,\" he said.\n\"Travis has never shied away from his desire to give dating with Taylor a try, which he even said during a press conference a few months ago after seeing Swift in concert,\" another source told ET at the time. \"Travis and Taylor are taking things slowly, and not rushing into anything serious. Both are very career-focused, so the focus is on that for now, but that's not going to stop them from enjoying life when it's the right moment.\"\nShe's In the Bleachers... Well, the Suites\nOn Sunday, Sept. 24, 2023, fans were shocked to see Taylor inside Arrowhead Stadium in Kansas City as the Chiefs took on the Chicago Bears. During the game, Taylor made it clear that she was rooting for the home team -- and their tight end -- as she rocked a Chiefs jacket and KSUBI denim shorts while she sat next to Travis' mom, Donna Kelce, in the NFL player's suite.\nTaylor brought a lot of energy to the stadium and was seen giving chest bumps, high fives, and doing plenty of shouting, especially when Travis scored a touchdown.\nAn eyewitness at the game told ET that Taylor was \"just so very normal, just watching the game casually with Mama Kelce.\"\nPost-Game Party and PDA\nFollowing the 41-10 victory that Travis and his team claimed, there was much to celebrate -- and Taylor got in on the action. In a video that circulated on social media, Travis and Taylor walked side-by-side as they exited the stadium and hopped in his getaway car.\nTaylor was on hand with Travis as their night continued at the popular family eatery Prime Social Rooftop, a trendy restaurant in Kansas City. She was even spotted packing on a little PDA with the tight end.\n\"Travis bought out the restaurant for his family and team. Taylor arrived, wearing a denim dress, and was seen snacking, having some cocktails and dancing alongside Travis,\" an eyewitness told ET. \"The two were very affectionate with one another but kept things fun and lighthearted. Travis' teammates also showed up to the after-party, as well as his mom and dad, Donna and Ed. The party lasted until 2 a.m.\"\nTaylor even got the seal of approval from Travis' teammate, Patrick Mahomes, after meeting her at the party.\n\"Yeah, I met her. She's really cool, good people,\" the Kansas City Chiefs quarterback said in a press conference on Sept. 27, 2023. \"But like Trav said, man, I'm going to let them have their privacy and just keep it moving.\"\nIn the afterglow of the game, sales of Travis' jersey have reportedly shot through the roof, even more than Mahomes.\nA Night to Remember\nTravis wasn't able to get away from the chatter as he and Jason filmed their first New Heights episode since Taylor's cameo at the big game.\n\"Shout-out to Taylor for pulling up, that was pretty ballsy,\" he said. \"I just thought it was awesome how everyone in the suite had nothing but great things to say about her. You know, the friends and family. She looked amazing, everybody was talking about her in a great light.\"\nHe added, \"To see the slow-motion chest bumps, to see the high fives with Mom, to see how, you know, Chiefs Kingdom was all excited she was there -- that s**t was absolutely hysterical and it was definitely a game I'll remember, that's for damn sure. And then we just slid off in the getaway car at the end. Took my Chevelle to the game.\"\n\"Shout-out to Taylor for coming through and seeing me rock the stage,\" Travis concluded.\nWelcome to Kansas City\nIn the hours following their public debut, a source revealed to ET that Travis and Taylor had privately spent time together. She was also seen at Travis' house with his family ahead of the game in Kansas City.\n\"Travis and Taylor have a lot in common and they are having a great time getting to know each other. They have similar values. She likes that he pursued her and it has been easy and exciting for both of them,\" the source said.\nHaving just wrapped the first leg of her Eras World Tour, the source added, \"Taylor is enjoying some time off from touring and it’s been fun hanging out with Travis during this break. Taylor wants a guy that’s into his career, does his own thing, but is also supportive and understands her, and Travis fits those qualities.\"\nKeeping Them Guessing\nDespite all of the chatter, Travis refused to confirm or deny if he and Taylor are new romantics.\nOn the New Heights podcast, Jason celebrated Travis for the results that followed him \"shooting his shot,\" and gave him the floor to speak on his and Taylor's status.\n\"You gotta shoot your shot,\" Jason quipped.\n\"You miss 100 percent you don't take, baby,\" the Catching Kelce star cracked, before getting serious.\n\"So yeah. I think what's real is that, you know, it is my personal life and I want to respect both of our lives,\" he shared. \"She's not in the media as much as I am doing this show every single week and having fun during the NFL season on other guys' shows, like [The Pat McAfee Show] and any other show that I go on from here on out, you know ... I'm enjoying life. And I sure as hell enjoyed this weekend, so everything moving forward, I think me talking about sports and saying 'all right now' will have to be kinda where I keep it.\"\nWelcome to New York\nOn Oct. 1, 2023, Taylor brought loads of star power to the NFL when she and her famous friends attended the Kansas City Chiefs and New York Jets game at MetLife Stadium in East Rutherford, New Jersey.\nThe \"Welcome to New York\" singer brought along to the game Sophie Turner, Blake Lively, Ryan Reynolds, Hugh Jackman, Sabrina Carpenter, Queer Eye's Antoni Porowski, and her backup singer and friend, Melanie Nyema. Patrick's wife, Brittany Mahomes, was also seated in the same section.\nAt one point, Taylor was spotted sharing a sweet embrace with Mama Kelce.\nIt was another exciting game for the Chiefs, who beat the Jets 23-20. But after this game, Travis and Taylor went their separate ways, with the singer leaving with Sophie and the NFL star presumably jetting back to Kansas City.\nHe was, however, spotted leaving Taylor's apartment in New York City just hours before the game, and later liked an article on social media about the singer's presence at the sporting event.\nBack In Kansas City\nAfter skipping Travis' game against the Minnesota Vikings, the singer was back in the stands at Arrowhead Stadium on Oct. 12 to root the Chiefs in their game against the Denver Broncos.\nSwift was spotted getting on a golf cart at Arrowhead Stadium before kickoff, sporting a black dress and a Chiefs-themed jacket, which she wore hanging off one shoulder.\nShe was later seen enjoying a drink while sitting in a box seat. Then, during the game, after Kelce made an impressive catch and picked up 40 yards, Swift gasped, jumped out of her seat, and loudly cheered for her beau.\nShe once again spent the game hanging out with Donna in a private box suite. The women smiled as they watched the pregame festivities on the field and waited for kickoff.\nIn the heat of the Chiefs' 19-8 victory over the Broncos, Taylor gleefully embraced her new friend, Brittany Mahomes, wife of Chiefs' quarterback Patrick Mahomes.\nThe pair -- who have hung out a few times in the past few weeks amid Taylor's rumored romance with Travis -- watched much of the game at Arrowhead Stadium side-by-side, cheering and rooting on their team.\nDate Night Debut After Their SNL Cameos!\nOn Oct. 14, 2023, the cute couple made their date night debut -- their first official public outing since sparking romance rumors -- and even showed a little PDA.\nwere spotted holding hands as they arrived at the Saturday Night Live after-party. Travis was the perfect gentleman as he held Taylor's hand while she exited the truck.\nShowing off their style in the rainy weather, the \"Look What You Made Me Do\" singer wore a long trench coat over black pants and a cropped shirt ensemble. Swift also held a black purse. Kelce wore brown pants and an embroidered jacket with a white T-shirt and white sneakers.\nTheir appearance at the party came after both made separate cameos on SNL during the show's season 49 premiere, hosted by Pete Davidson.\nTravis appeared at the end of the first sketch of the night, which poked fun at the NFL's constant coverage of him and Taylor's romance.\nFor her part, Taylor introduced musical guest Ice Spice, ahead of her second performance.\nAn eyewitness told ET that the SNL cast celebrated the season premiere's after party at Catch Steakhouse in the Meatpacking District in NYC, and Taylor and Travis were on hand for the festivities. According to the eyewitness, the pair arrived at the celebration around 2:20 am holding hands.\n\"Taylor and Travis seemed to really be having a great night and looked happy to be with each other,\" the eyewitness says. \"They kissed throughout the evening.\"\nInside the party, another source told ET, \"Taylor and Travis looked very comfortable and happy together. They were kissing openly and weren’t shy with their PDA. When Taylor first arrived, she spent time with Ice Spice and Ice Spice’s friends.\"\nDate Night Part Deux\nThe \"Blank Space\" singer and the NFL pro hit the streets of New York City for another evening out. The couple were all smiles as they left the Waverly Inn restaurant hand-in-hand.\nTaylor didn't let the autumn breeze keep her from showing off her long legs in a black leather mini skirt, which she paired with a sheer long-sleeved top, and black boots. The singer kept her hair pinned back and had her signature red lipstick on display.\nFor his part, Travis showed off his usual swag in a matching light denim set, which he layered over a black T-shirt.\nAs they left the restaurant -- to the surprise of some fans -- the pair were all smiles and holding hands. Travis even held Taylor's hand as he helped her into their getaway car.\nRooting For the Chiefs\nThe \"Anti-Hero\" singer made her return to Arrowhead Stadium in Kansas City, Missouri, to cheer on Travis Kelce on Sunday, Oct. 22. Taylor and Brittany Mahomes once again sat side-by-side as they rooted for the Chiefs in their game against the Los Angeles Charges.\nBrittany also brought along her and Patrick's baby boy, Bronze. As the game got started, Taylor was spotted holding her camera in the direction of Brittany and her little boy, who smiled for the camera as his mom held him on her hip. In more clips, the trio was game day ready, as they danced, chatted and cheered.\nMeanwhile, Taylor showed her team spirit in a Chiefs crewneck and a black skirt. The GRAMMY-winning singer's signature red lip was the perfect complement to her look. She also paid subtle tribute to Travis by rocking a friendship bracelet sporting his jersey number, 87.\nPacking on the PDA In Argentina\nTaylor kicked off the South American leg of her Eras Tour on Nov. 9 in Argentina, with a three-show run at the Estadio Monumental (a.k.a. River Plate Stadium) in Buenos Aires.\nSince the Chiefs had a bye week, Travis flew down to Buenos Aires to check out the show, and was in attendance during the night of her shows.\nTaylor surprised her beau with a lyric change to her song \"Karma,\" making a direct reference to him to the shock and excitement of fans. The singer was in the middle of her performance when she belted out, \"Karma is the guy on the Chiefs, coming straight home to me.\" Immediately after Swift sang that line, the entire crowd went wild.\nAfter the show, Taylor and Travis also packed on some adorable PDA when she ran off the stage and jumped into his arms to give him a kiss -- as seen in a video posted online that quickly went viral.\nMatchmakers\nTravis offered some clues about how the couple's romance really began in an interview with WSJ. Magazine, published in November 2023.\n\"There were definitely people she knew that knew who I was, in her corner [who said]: 'Yo! Did you know he was coming?' I had somebody playing Cupid,\" Travis revealed to the magazine, admitting that he only learned of that story later, after he was shocked to discover a notification from Taylor on his phone.\n\"She told me exactly what was going on and how I got lucky enough to get her to reach out,\" he shared.\nThe matchmakers, apparently, were Taylor's young cousins, who are fans of the Super Bowl champion.\n\"She'll probably hate me for saying this\" Travis spilled, \"but when she came to Arrowhead, they gave her the big locker room as a dressing room, and her little cousins were taking pictures... in front of my locker.\"\nTalking With 'Time'\nThe pop icon offered a candid reflection on the high-profile romance in an interview with Time in early December, as the magazine's 2023 Person of the Year honoree.\n\"This all started when Travis very adorably put me on blast on his podcast, which I thought was metal as hell,\" she said. \"We started hanging out right after that. So we actually had a significant amount of time that no one knew, which I'm grateful for, because we got to get to know each other... By the time I went to that first game, we were a couple. I think some people think that they saw our first date at that game? We would never be psychotic enough to hard launch a first date.\"\n\"When you say a relationship is public, that means I'm going to see him do what he loves, we're showing up for each other, other people are there and we don't care,\" she declared. \"The opposite of that is you have to go to an extreme amount of effort to make sure no one knows that you're seeing someone. And we're just proud of each other.\"\nShe is aware, however, of the criticism surrounding how the NFL has handled coverage of her appearances at a handful of recent games. \"I don't know how they know what suite I'm in,\" she said. \"There's a camera, like, a half-mile away, and you don't know where it is, and you have no idea when the camera is putting you in the broadcast, so I don't know if I'm being shown 17 times or once... I'm just there to support Travis... I have no awareness of if I'm being shown too much and pissing off a few dads, Brads, and Chads.\"\nTravis Returns the Praise\nThe Kansas City Chiefs tight end had the support of the singer during his game against the New England Patriots on Dec. 17, and couldn't help but gush over her star power on an episode of his New Heights podcast.\n\"I mean, you don't see an entire home team fanbase go insane for somebody wearing the opposite team's colors,\" Travis told his brother and co-host. The Patriots called attention to their famous visitor by showing her on the jumbo screen at one point, prompting a visceral reaction from the home crowd. \"Just shows you how amazing that girl is. They went absolutely insane when they showed Taylor on the screen, yes.\"\nChristmas on the Grid Iron\nThe pair spent their first Christmas as a couple at Arrowhead Stadium as the Chiefs took on the Raiders, and Taylor was in the stands, rocking some x-mas themed Chiefs gear, to show her love and support. The singer also brought her parents -- Andrea and Scott Swift -- along on Christmas Day as a family to watch.\nA source told ET that \"Taylor is planning to spend a lot more time at Travis’ house in Kansas City while she is on a break.\"\nThe source continued, \"They’re both very excited to be together, and Travis is making sure that Taylor feels comfortable and at home. They have mutual respect and admiration for one another, and their feelings for each other are sincere.\"\nLooking Ahead\nAt the start of 2024, with Taylor set to resume her Eras Tour and Travis setting his sights on another Super Bowl, a source told ET that the couple had been thinking about their future together.\n\"Taylor and Travis are doing really well,\" the source said in January. \"They try to spend as much time as they can together. Travis also makes it a point to make sure Taylor feels as comfortable as possible at his home. They have discussed their future as a couple and are excited at the idea of it.\"\nThe pair rang in the New Year with a kiss in Kansas City, while Taylor continued to be a mainstay at Kelce's Chiefs games. She also traveled to Buffalo, New York, to see them score a victory over the Bills and meet Travis' brother, Jason Kelce, and sister-in-law, Kylie Kelce, for the first time.\nIt was then that Jason famously stole the show by ripping off his shirt, chugging a beer, and cheering for his brother's touchdown.\n\"[Kylie] was already telling me to be on my best behavior because we were meeting Taylor,\" Jason later explained on the siblings' New Heights podcast. \"She was like, 'Do not. Be on your best behavior.' I was like, 'Kylie, when I met you, the first day I met you, I was blackout drunk and fell asleep at the bar.' This is part of the charm. This is part of the Jason Kelce charm. I want to make my best first impression... This is my best chance.\"\nThe admission sent Travis into a fit of hysterics, responding, \"That s**t was classic.\"\nAs it turns out, Jason's plan apparently worked.\n\"Ah, man, well,\" Travis continued. \"Tay says she absolutely loved you.\"\nThree Little Words\nTaylor and Travis shared another highly public display of affection after the Chiefs won the AFC title over the Baltimore Ravens, clinching their Super Bowl LVII spot. The singer flocked to the turf after the game and planted a celebratory kiss on her man.\nIn videos shared on social media, the couple could be seen exchanging \"I love yous\" during the festivities on the field.\nA Big Win\nAfter plenty of speculation about whether or not Taylor would be able to make it to watch Travis play in Super Bowl LVIII (she had an Eras Tour performance in Tokyo the day before) she was of course on hand to watch Travis and the Chiefs win their second consecutive Lombardi trophy, with a 25-22 overtime victory over the San Francisco 49ers.\nTaylor and pals Ice Spice and Blake Lively joined Travis' family and friends in a box at Allegiant Stadium in Las Vegas to watch the closely contested championship, and she rushed the field to congratulate him after the big win.\n\"Thank you for coming, baby,\" cameras captured Travis telling Taylor after a sweet kiss and hug on the field.\n\"Oh, I cannot believe that,\" Taylor responded. \"I can't believe you. How did you do that?\"\n\"Was it electric?\" he asked, to which she sweetly replied, \"It was unbelievable.\"\nChanging the Game\nFollowing his Super Bowl win, one of Travis' pre-game interviews with Fox Sports reporter Laura Okmin made the rounds again. In the clip, the tight end marveled at the impact his relationship has had, in helping to bring together football fans and Swfties.\n\"I'm very aware,\" Travis said of the phenomenon. \"Obviously that is mostly because Taylor's in my life now and we got her a part of Chiefs Kingdom, and sure enough that brought an entire entourage of human beings that just love to support her and love to support everything that she's about, so it's been a fun ride up to this point. It has been beautiful to see the father and daughter stories that have come about because of all this.\"\nTravis emphasized that he remains \"focused\" on football and \"making sure that I'm accountable\" on the field, explaining why he keeps a \"guarded approach\" to addressing his relationship.\n\"But at the same time,\" he added, \"I know what me and Taylor have is special, so I get it.\"\n'A Different Man'\nKansas City Chiefs defensive backs coach Dave Merritt opened up about \"Swelce\" in a post-Super Bowl interview on The Sports Shop With Reese & Kmac, admitting that Taylor \"actually affected the team in a positive way.\"\n\"Everybody was excited that Travis was happy. So when my player, my brother, is happy beside me, that helps me and that encourages me,\" Merritt said of their romance, noting that since they got together, Travis \"came in there a different man.\"\n\"She won a Super Bowl in her first year in the NFL,\" he joked. \"How about that?\"\nThe backlash Taylor received from some football fans even brought her closer to the team, Merritt said.\n\"Upon meeting her, I felt like she actually added to what it was that we were trying to do,\" he shared. \"Because there were so many people that were hating the fact that she was being shown on TV, that you know what, you're part of our family because you're now with Travis, so therefore you're our little sister or you're whatever it may be, you're part of family.\"\nTraveling Trav\nAfter the Super Bowl, it was time for Travis to support Taylor, as he jetted to both Australia and Singapore to support Swift on her Eras Tour stops -- with a pit stop in Las Vegas, Nevada, with his teammates in between.\n\"Traveling Trav is my f**king nickname,\" the athlete chuckled during an episode of his New Heights podcast. \"Not because I move around a lot but because I can't f**king dribble a basketball.\"\nAmid their jet-setting romance, a source told ET that Taylor was \"happier than ever and so in love\" with Travis.\n\"She likes that Travis is so proud of her and that he isn't afraid to show his love for her publicly,\" the source said.\n\"She is in a great place and having the best time performing, making music, and feeling free to live her life more openly,\" the source added. \"Travis is enjoying being on tour with Taylor and is happy to support her.\"\nAs for what's in store for the couple, the source said that \"Taylor views Travis as a true partner and someone she can have a real future with.\"\nBahamas Bliss\nFollowing the Super Bowl media madness and during a break in the Eras Tour, the couple made a quick tropical getaway for some R&R and some PDA.\nThe couple was snapped looking totally loved up while on vacation together in the Bahamas. In photos published by Page Six, Taylor and Travis could be seen enjoying a dip in the ocean and sunbathing on the beach. In one shot, the couple kissed in the water while Taylor held a drink in her hand.\nRare Downtime\nFollowing their Bahamas trip, a source told ET that \"Taylor and Travis are soaking up their downtime together. They are appreciating the here and now and the love they share with one other. When they're able to just chill out, they love to hang out with their friends and family, travel, see new things together, and enjoy their privacy.\"\nThe source added, \"They are grateful to have each other along for the ride and advocate and support each other across the board. While they're enjoying this moment, they're looking forward to what the future holds too. They want to continue to grow together and be happy and healthy. Their friends and family are still as supportive as ever.\"\nMaking Music\nAhead of his Kelce Jam music festival, Travis opened up to ET about being inspired by Taylor's musical tastes.\n\"It's definitely been fun to experience her taste in music, for sure,\" Kelce told ET. \"She's so amazing at what she does. And to find that creativity to see where she likes to pull things from and just, really, how she listens to music is very eye-opening for me. It's been fun to hear her take on it.\"\nFollowing the release of her 11th studio album, The Tortured Poets Department, Taylor will perform at London's 90,000-seat-Wembley Stadium on June 21-23 and then again on Aug. 15-19.\n\"She'll be all over Europe,\" Travis raved. \"There won't be a bad show, I promise you that.\"\nWhile the NFL star has already soaked up the Eras Tour in Argentina, Sydney, Australia and Singapore, inquiring minds wanted to know if he'll pack his bags and make the trek across the pond.\n\"Oh, you know I gotta go support,\" he told ET. \"You know it.\"\nDancing in the Desert\nThe happy couple had a super cute outing on the first weekend of Coachella 2024, packing on the PDA in numerous fan videos as they supported friends like Jack Antonoff and Lana Del Rey during their sets.\n\"Taylor and Travis were so excited to go to Coachella together,\" a source told ET. \"They wanted to be there to support their friends and just have fun. They had the best time at the festival and were in their own world even though so many people were around them. They are very in love and in sync in so many aspects of their lives, and it’s very sweet to see.\"\nTheir presence at Coachella didn't go unnoticed, as Taylor and Travis immersed themselves in the festival spirit, embracing the music, the vibe, and each other.\nAnother source added, \"Travis has always loved going to Coachella, and having Taylor by his side made it all the better. The happy couple enjoyed the weekend’s festivities, supporting Taylor’s famous friends during their live sets. The two are continuing to explore their relationship by supporting each other’s endeavors and doing what every other couple does, and that’s go on dates. This is one of many adventures yet to come for the duo.\"\n'The Alchemy' and 'So High School'\nWhen Taylor dropped her 11th studio album on April 19, The Tortured Poets Department, fans were delighted to find a love song chock full of football references, with many speculating it may have been inspired by her romance with Travis.\n\"So when I touch down / Call the amateurs and cut 'em from the team / Ditch the clowns, get the crown / Baby, I'm the one to be / 'Cause the sign on your heart / Said it's still reserved for me / Honestly, who are we to fight the alchemy,\" Swift sings on the chorus.\nIn the bridge, Taylor appears to reference a huge win -- not unlike the Kansas City Chiefs' numerous victories on their way to Super Bowl LVIII.\n\"Shirts off, and your friends lift you up, over their heads / Beer stickin' to the floor, cheers chanted 'cause they said / 'There was no chance trying to be the greatest in the league' / Where's the trophy? He just comes, running over to me,\" she declares.\nThere's also a cheeky map reference in the first verse, which could be a callback to the early days of her relationship with Travis.\nObservant Swifties also speculated that a few of Travis' family members were also been graced with lyrical shout-outs -- including Travis' dad, Ed Kelce.\nOn \"So High School,\" she sings about the joy of a new romance that has her feeling like a teenager. The lyrics hint at a lover with a wicked sense of humor, not unlike her current boyfriend.\n\"I feel like laughing in the middle of practice again / To that impression you did of your dad again,\" she sings on the song's second verse. For his part, Travis has been known to deliver impressions of his dad, Ed, on his podcast, New Heights.\nOn the song's chorus, Taylor declares, \"And in the blink of a crinkling eye / I'm sinking, our fingers entwined / Cheeks pink in the twinkling lights / Tell me about the first time you saw me / I'll drink what you think and I'm high / From smoking your jokes all damn night / The brink of a wrinkle in time / Bittersweet 16 suddenly.\"\nShowing Up for Each Other\nFollowing the release of The Tortured Poets Department, a source told ET that her boyfriend \"couldn't be more supportive and is pumped for Taylor.\"\n\"He knows how much this means to her and thinks she's extremely talented,\" the source said. \"Taylor and Travis admire each other's creative processes and work ethic. They cheer each other on, respect each other's opinions, and are open and communicative.\"\nAnother source said, \"Travis is so supportive of the entire album and loves that he is a part of Taylor's story.\"\nThe source added, \"He is a Swiftie through and through, and is very proud of her.\"\nIn May, Kelce was spotted inside Paris La Défense Arena alongside Gigi Hadid and her rumored beau Bradley Cooper, enjoying the final Eras Paris show. It was the first time Kelce had been in the audience since Swift largely revamped her live show, adding several songs from The Tortured Poets Department to the set list.\nAmong the songs added to Swift's TTPD set is \"So High School.\" Eagle eyed fans caught Kelce's sweet reaction to seeing Swift perform it live.\nAs the singer transitioned from her performance of \"But Daddy I Love Him\" into \"So High School,\" Kelce's energy appeared to pick up while Hadid -- who was standing next to him -- appeared to offer him a knowing nudge. With Kelce's eyes fixed on stage, he danced along and pointed from his eyes to Swift's as she sang the line, \"Every time I look at you.\"\nFans were also quick to note that Swift appeared to blow a kiss in Kelce's direction before she began the song.\nA source told ET, \"Taylor's 87th show had significance not only for the reference to Travis' football jersey number, but because of the many Easter eggs hidden in the show about Travis. This was also the first time Travis was able to hear songs live that are rumored to be about him, and he was thrilled.\"\nDuring the highly anticipated \"Surprise Songs\" portion of Swift's show, she sang another new one rumored to be about the couple's relationship. As Swift performed \"The Alchemy,\" Kelce was seen emulating Swift's famous \"heart hands\" gesture in response.\nThe supportive relationship certainly goes both ways. A source told ET on May 13 that, \"The two are making it a point to celebrate each other’s achievements, and show up when it matters most.\"\nPrior to her shows in Paris, Swift was seen on Kelce's arm at Patrick Mahomes' 15 and the Mahomies Foundation Gala in Las Vegas, Nevada, on April 27.\nAccording to an eyewitness, Taylor and Travis \"walked in holding hands and were affectionate all night\" while supporting Mahomes' charity initiative. The eventgoer added that throughout the night, there was \"lots of kissing and just overall happiness between them. The support is there for one another.\"\n\"The two seem to be in good spirits and definitely in love,\" said the eyewitness.\nDuring the gala, Travis surprised audience members in a last-minute shakeup when he took the stage to adorably raffle off one more item and shout out Taylor who helped pull off one of the hottest ticket items on the docket.\n\"I was just talking to my significant other and we might have another auction item that wasn't on the docket,\" he said slyly. \"Has anybody heard of the Eras Tour?\"\nGetting Serious\nOn May 17, a source told ET that Swift and Kelce's friends and family were anticipating potential nuptials between the pair.\nThe source told ET, \"Taylor and Travis are doing amazing, and their loved ones see an engagement coming sooner than later. They make a great match and there's no question about that.\"\nWeeks later, Kelce sat down for an interview on Good Morning America and addressed his future.\n\"I'm so fortunate and so grateful [for] everything that's come my way in life,\" he said on GMA. \"I feel like I'm on top of the mountain, even after winning the Super Bowl and having the off-season that I'm having. And just looking forward to what's next in life, man…I'm so grateful. So appreciative. And yeah. Livin' the dream, baby.\"\nDuring a press conference on June 11, Kelce was asked directly about his girlfriend after he previously appeared by her side in a video while she was cooking.\nThe clip led a curious reporter to ask Kelce about his favorite dish to cook with his \"significant other.\"\nKelce, with a smile, replied, \"That's a good question. I'll keep the answer to myself, but I thoroughly enjoy cooking with her. I'd rather keep it personal.\" However, as he wrapped up the press conference, Kelce couldn't resist giving a special nod to Swift's culinary talents.\n\"Taylor makes a great Pop-Tart and cinnamon roll,\" he said, eliciting laughter and excitement from the media.\nPrioritizing Their Relationship\nOn June 14, a source told ET how the duo has managed to keep their long-distance relationship healthy.\n\"Taylor and Travis make sure that the current long-distance aspect of their relationship doesn't last very long. They both move their schedules around if it's feasible and try to carve out as much time as they can to see each other, as well as each other’s families and friends,\" the source shared. \"They prioritize each other and do anything and everything to make each other happy. Their relationship is genuine and they both want to make it work, so it does.\"\nThe source added, \"Taylor and Travis definitely see a long-term future together and things are continuing to move in that direction. Their shared values and love of family keeps them connected.\"\nA Royal Meetup\nAhead of Swift's first night performing at London's Wembley Stadium, the singer and her beau chatted backstage with Prince William and two of his three children, Prince George and Princess Charlotte. Swift shared a selfie of the encounter on Instagram, marking the first time she'd posted a pic with Kelce on her page.\nA-List Dancing\nDuring night two of Swift's three-night London stop, the celebs were out in full force. In one fan video, Kelce can be seen dancing in the VIP tent to Swift's \"Shake It Off\" alongside stars including Tom Cruise, Greta Gerwig and Kelce's brother, Jason Kelce. Mila Kunis, Ashton Kutcher, Liam Hemsworth, Hugh Grant and more celebs also partied the night away alongside Kelce.\nAfter the epic night, Grant took to X to praise Swift and Kelce.\n\"Dear @taylorswift13, You have an incredible show, an amazing and v hospitable team and excellent if gigantic boyfriend (#tequilashots.),\" Grant quipped of Kelce. \"Thanks so much from one ageing London boy, wife and thrilled 8 year old #halfgirlhalfbracelet.\"\nLondon Boy 2.0\nSwift closed out her London shows in dramatic fashion, by inviting Kelce up to the stage with her. Kelce stepped onstage matching Swift's other dancers in a tuxedo and top hot, carrying his girlfriend as more than 80,000 fans watched on. The tight end proceeded to stand by as Swift's dancers stripped her of her dress and revealed a white two-piece set underneath, fanning himself and smiling from ear to ear.\nBefore exiting the stage and letting Swift belt out \"I Can Do It With a Broken Heart,\" Kelce adorably pretended to apply makeup to his girlfriend's face, grinning as Swift pretended to be over the whole situation.\nA source told ET of Kelce's appearance, \"Taylor and Travis have recently discussed Travis making an appearance onstage at the Eras tour, when timing was right, and they finally made it happen.\"\n\"Travis was so excited to support Taylor onstage, and Taylor couldn't be happier to feature him, especially during such a fun, pivotal scene in the show,\" the source said. \"Travis only had one night of rehearsal, the evening before he performed onstage, and didn't miss a beat. Taylor was beaming from ear to ear as Travis took on the dapper role. The two are hoping he can make a cameo again in the future.\"\nAfter the show, Swift and Kelce partied until 4 a.m. alongside pals Sophie Turner and Ellie Goulding. Hours later, Swift took to Instagram to reflect on her epic weekend. After praising the crowd and the artists who joined her onstage, Swift addressed Kelce's sweet cameo.\n\"I’m still cracking up/swooning over @killatrav’s Eras Tour debut,\" she gushed. \"Never going to forget these shows. Can’t wait to do it 5 more times in August.\"\nTeardrops on My Guitar His Face?\nDuring Swift's third and final show in Amsterdam on July 6, 2024, nearly a year after Kelce first attended an Eras Tour show in July 2023, a fan spotted the football pro in the stands rubbing his eyes -- and purportedly wiping away tears -- as his famous girlfriend performed a mashup of songs believed to be dedicated to him, including \"Mary's Song (Oh My My My)\" from Taylor Swift, \"So High School\" from The Tortured Poets Department, and \"Everything Has Changed\" from Red. After applauding her, the athlete held up his hands while making the shape of a heart.\nFor more on Taylor and Travis' romance, check out the links below.\nRELATED CONTENT:",
  "word_count": 7092,
  "scraped_at": "2026-02-14T14:08:15.034736"
}