{
  "article_id": "924d7bece51c",
  "url": "https://economictimes.indiatimes.com/news/international/us/uefa-europa-league-quarter-final-draw-see-date-time-and-streaming-information/articleshow/98526497.cms",
  "title": "europa league : UEFA Europa League Quarter - Final Draw : See date , time and streaming information",
  "date": "20230309T203000Z",
  "domain": "economictimes.indiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The draw will take place just after the Champions League quarter-final draw, which is scheduled to begin at 11 am GMT. The route to the final will also be mapped out on the same day, with a draw to determine the semi-final fixtures.\nUEFA's official website will provide a free live stream of the Europa League quarter-final draw. Eight teams, including Arsenal, Manchester United, Roma, and Sevilla, could make it to the quarter-finals, with the identity of the teams being confirmed after the second legs of the last-16 ties are completed on March 16.\nThe Europa League quarter-final draw is an open or free draw, with no restrictions such as seeding or country protection. That means any team could potentially face any other team in the quarter-finals, including the possibility of Premier League sides Arsenal and Manchester United facing off against each other.\nThe four quarter-final matches will be numbered from one to four for the semi-final draw, which will follow immediately afterwards. Then, a draw will also be held to see which side of the draw will have the \"home\" status in the final.\nThe quarter-final fixtures will take place in April and the first leg is scheduled for April 13 and the second leg a week later on April 20. The semi-final matches will also be two-legged affairs. The first leg will be on May 11, followed by the second on May 18.\nThe 2023 Europa League final will be held on May 31, providing teams with a few weeks to prepare for the game. The Europa League may be UEFA's second-tier club competition, but it still attracts many of Europe's biggest clubs and is a highly coveted trophy for all participating teams.\nFAQs:\n- Who won the 2021-22 UEFA Europa League?\nEintracht Frankfurt - What does UEFA stand for?\nUnion of European Football Associations\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.",
  "word_count": 373,
  "scraped_at": "2026-02-14T12:51:50.391072"
}