{
  "article_id": "925fadbd6d66",
  "url": "https://patriotpost.us/digests/102884-mid-day-digest-2023-12-13",
  "title": "Mid - Day Digest",
  "date": "20231213T204500Z",
  "domain": "patriotpost.us",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mid-Day Digest\nTHE FOUNDATION\n“We should be unfaithful to ourselves if we should ever lose sight of the danger to our liberties if anything partial or extraneous should infect the purity of our free, fair, virtuous, and independent elections.” —John Adams (1797)\nIN TODAY’S DIGEST\n- Voters Admit to Mail Ballot Fraud in 2020 Election\n- Executive News Summary\n- COVID Vaccines Create Disruptive Proteins in Quarter of Recipients\n- Ukraine: Time to End It\n- Competition for the Girl Scouts?\n- Not-So-Scary Truth About Climate Change\n- DAILY FEATURES: Videos, Best of Right Opinion, Short Cuts, Memes, and Cartoons.\nON THE WEB\n- Jack DeVine: About That Threat to Democracy…\n- Linda Moss Mines: Another Virginia Boy\n- RNC: Bidenomics Has Failed\nFEATURED ANALYSIS\nVoters Admit to Mail Ballot Fraud in 2020 Election\nThe way to secure our elections is simple: Voting should be in person with photo ID on Election Day.\nNate Jackson\n“One-in-Five Mail-In Voters Admit They Cheated in 2020 Election.” That’s the five-alarm headline for a new survey by Rasmussen Reports and The Heartland Institute.\nAccording to another Rasmussen/Heartland poll, nearly one in five Democrats also want Donald Trump to be imprisoned, exiled, or executed if convicted for his claims of election fraud. Executed? Sheesh.\nDo you know what the difference is here? Trump failed in his legal and sometimes cockamamie attempts to overturn the results of the 2020 election. The voters who committed fraud succeeded.\nSome 21% of Rasmussen respondents “say they filled out a ballot, in part or in full, on behalf of a friend or family member, such as a spouse or child,” while “19% of those who cast mail-in votes say a friend or family member filled out their ballot, in part or in full, on their behalf.” Rasmussen adds, “Furthermore, 17% of mail-in voters say that in the 2020 election, they cast a ballot in a state where they were no longer a permanent resident.”\nThese are just the people who admit to illegal activities, too — the real numbers could be far higher. That said, Rasmussen’s automated (non-human-voice) polling methodology tends to elicit truthful responses because every respondent hears the exact same question asked in the exact same way.\nEither way, this is no small matter. The Heartland Institute’s Justin Haskins called the survey results “nothing short of stunning.” No kidding. The Narrative™ about the 2020 election was as utterly false as the 2016 lie about Trump’s collusion with Russia.\n“For the past three years,” Haskins notes, “Americans have repeatedly been told that the 2020 election was the most secure in history. But if this poll’s findings are reflective of reality, the exact opposite is true. This conclusion isn’t based on conspiracy theories or suspect evidence, but rather from the responses made directly by the voters themselves.”\nWith his trademark caps lock key turned on, Trump took to Truth Social to call it “THE BIGGEST STORY OF THE YEAR,” and he might not be wrong. In fact, had he and his administration done more about it when then-Attorney General William Barr was warning that the mass mail-in ballots of 2020 were “playing with fire,” Trump might still be president.\nMight. Rasmussen does add a significant caveat: “Nearly equal percentages of Democrats, Republicans and unaffiliated voters admitted to fraudulent activities.” However, a far higher number of Democrats cast ballots by mail, and younger voters and minorities — who skew heavily Democrat — were “significantly more likely to admit to engaging in fraudulent election activity” than were older or white voters.\nIn 2020, Democrats across the country realized they could win more elections by changing the rules by using the coronavirus pandemic as an excuse and then screaming about “voter suppression” if anyone reined it back in. Rules changes included vastly expanding mail-in ballots with woefully inadequate verification, which a bipartisan 2005 report from the Commission on Federal Election Reform, chaired by former President Jimmy Carter and former Secretary of State James Baker, warned “remain the largest source of potential voter fraud.” Other nations don’t seem to be so deluded as to let their elections be determined by mail.\nAnd we do mean determined.\nAs our Mark Alexander wrote just three months ago:\nOf the votes cast in 2020, 43% (66 million ballots) were cast by mail — and a majority of those were in states where authentication of the person receiving and casting the ballot is not required. Of all those who voted in person, 66% voted for Trump versus 42% for Biden — which is to say that 58% of Biden ballots, almost 47 million votes, were cast by mail.\nIf even a few percent of those voters committed fraud — say, by illegally voting absentee in a particular swing state — it could have changed the election result. Remember, Biden won by 43,000 votes in three swing states, which is precisely why the Left has renewed attacks on the Electoral College.\nMemo to the Left: The election system created by the Founders in the Constitution is not the problem. Rigging elections with mail-in ballots is.\nAmericans are increasingly guilty of civic ignorance and are becoming more dishonest while gradually abandoning the objective truth and moral guidance of Christianity — and states mail out ballots for any reason, including nine states that do it in bulk without voters even asking for ballots.\nWhat could go wrong?\nIf Republicans don’t begin shouting about election integrity from the rooftops, they deserve the defeat they are by default accepting.\nExecutive News Summary\nPitiful Hunter speaks, Israel snubs Biden’s plan, Ford halves Lightning production, NY Dems steal seats, and more.\nDouglas Andrews, Thomas Gallatin, & Jordan Candler\nCross-Examination\nPoor, poor, pitiful Hunter speaks! Hunter Biden exposed himself this morning on Capitol Hill, taking to a microphone and railing against “MAGA Republicans” for having unfairly picked on him. “For six years,” he whined, “I’ve been the target of the unrelenting Trump attack machine shouting, ‘Where’s Hunter?’ Well, here’s my answer: ‘I am here.’” He was there, alright, but only long enough to denounce those MAGA Republicans. Then he disappeared, skipping his agreed-upon deposition before the House Oversight Committee. We suppose this qualifies as acceptable behavior for a Biden, but only because they’ve set the bar so low. Setting aside the hookers and the blow and the money-grubbing and the narcissistic nude selfies and the schtupping of his deceased brother’s wife, Hunter recently took to a podcast to blast his GOP critics as “motherf***ers” who are “trying to destroy a presidency” and “trying to kill me.” This is what a shrink might call projection. This morning, with attorney Abbe Lowell at his side, he gave us a more carefully worded screed: “Let me state as clearly as I can: My father was not financially involved in my business, not as a practicing lawyer, not as a board member of Burisma. Not my partnership with a Chinese private businessman, not in my investments at home nor abroad, and certainly not as an artist.” He went on to say how proud he is of his degrees from Georgetown and Yale Law School, and how mean his MAGA Republican critics have been to impugn his character and invade his privacy and mock his struggle with addiction. “There is no fairness or decency in what these Republicans are doing,” he continued. “They explain naked photos of me during an Oversight hearing.” Strangely, he neglected to mention that he’s now under multiple indictments from the Biden Justice Department. There’s an old legal expression that Hunter and his legal team seem to be employing here: When you have the facts, you pound the facts. When you have the law, you pound the law. And when you have neither, you pound the table.\nIsrael snubs Biden’s plan: While Joe Biden likes to talk of bringing Unity™, what he has done during his time in office is encourage more division not only across the country but even within his own party. Is it any wonder then that Israeli Prime Minister Benjamin Netanyahu wants little to do with the Biden administration’s postwar plan for Gaza? On Tuesday, the two leaders clashed as Biden insisted that Israel cannot be allowed to control Gaza and that an eventual two-state solution must be the long-term goal. Biden even threw Israel under the bus by claiming, “They’re starting to lose [U.S. and European Union] support by indiscriminate bombing.” Netanyahu quickly rejected Biden’s plan: “After the great sacrifice of our civilians and our soldiers, I will not allow the entry into Gaza of those who educate for terrorism, support terrorism, and finance terrorism. … I will not allow Israel to repeat the mistake of Oslo.” That was a reference to the 1993 Oslo Accords that established the Palestinian Authority, which was subsequently overtaken by Hamas in 2007. Netanyahu is right to be wary of embracing any deal that offers the promise of a two-state solution, which the Palestinians have never agreed to pursue. Furthermore, he sees a Democrat Party divided over support for Israel versus Gaza and cannot trust that the Biden administration would actually prioritize Israel’s sovereignty rights.\nFord halves Lightning production: Beginning in January, Ford Motor Company will effectively cut the production rate of its all-electric F-150 Lightning trucks in half. Ford’s electric vehicle plant in Dearborn, Michigan, where it makes the Lightning, will drop its production of the truck from 3,200 per week to roughly 1,600 a week. The reason? The basic economic principles of supply and demand. According to a Ford spokesman, “We’ll continue to match production with customer demand.” Ford’s production cut comes on the heels of the automaker canceling some $12 billion in EV investments. While Ford has continued to see sales of its Lightning grow, hitting a record high in November of 4,400 sold, it’s far from a significant percentage of its overall truck sales. Through the third quarter of this year, Ford had sold 561,110 F-Series trucks, and of those, combined with October and November sales, just 20,365 were Lightnings.\nCOP28 waffles on fossil fuels: Earlier today at the COP28 Summit in Dubai, government ministers from nearly 200 countries agreed to a deal that calls for a movement away from fossil fuels. It was a lukewarm victory for the green movement, especially after a previous proposal went down in flames amid heated and widespread backlash. As CNBC reports, “The latest proposal published by the UAE earlier on Wednesday called for ‘transitioning away from fossil fuels in energy systems, in a just, orderly and equitable manner, accelerating action in this critical decade, so as to achieve net zero by 2050 in keeping with the science.’” Still, a funny thing happened on our way to a fossil fuel-free future. As PJ Media’s Rick Moran writes, “Squabbling delegates … have failed to agree on a plan to phase out fossil fuels, leaving the issue in limbo and calling into question the entire COP process as a venue to deal with climate change.” That phaseout plan was what the greens were looking for, but sanity seems to have prevailed. At least for the time being.\nSununu endorses Haley: Nikki Haley reeled in New Hampshire’s biggest endorsement when the state’s popular and charismatic governor finally made it official: “We are all in on Nikki Haley!” said Chris Sununu at a raucous campaign event yesterday. Haley, though, has a lot of ground to make up. Forty days away from the primary, she’s polling at just under 19% in the Granite State, well behind Donald Trump at 44% but comfortably ahead of Chris Christie at 13% and Ron DeSantis at a woeful 9%. It’s no surprise that Sununu didn’t endorse Trump. He doesn’t like the former president, a reality that might have something to do with his family’s decades-long connection to the Bushes. “People know that we have a country to save,” said Haley at a New Hampshire diner this morning, “and they know that it’s time for a new generational leader. Wouldn’t it be nice if we had a ‘Live Free or Die’ country?” Sununu added: “This isn’t just, ‘Let’s get behind a candidate that can win.’ That’s obvious. This is really getting behind the best-qualified person to be president of the United States.” What he meant to say, of course, was that Haley is the best-qualified person besides Trump. And we’re not so sure Haley can win — not when she’s trailing Trump nationally by 48 points. Haley, however, touts her head-to-head numbers against the decrepit incumbent, Joe Biden, noting that she’s beating him in one poll by 17 points. But that cuts both ways: What centrists and moderates find appealing in a candidate is often at odds with what primary voters find appealing. And primary voters are the ones who decide presidential primaries.\nWhat the heck happened to Georgia? A stunning new battleground poll from CNN shows Donald Trump leading Joe Biden 50-40 in reliably blueish Michigan, a state Biden carried 51-48 in 2020. It’s the latest in a steady stream of bad polling news that has the Democrats in full freakout mode. The same CNN poll, however, showed something equally stunning in the other direction: Whereas Trump leads Biden by 10 points in Michigan, his lead in normally red Georgia is just half that, 49-44. So what gives? Has Georgia really become less reliably red than Michigan? Consider Georgia’s blue creep during the past quarter-century: Trump lost Georgia by 0.2% in 2020 after having won it by 5% in 2016. Romney won it by 8% in 2012, McCain won it by 5% in 2008, and Bush won it by 16% in 2004 and by 12% in 2000. Perhaps part of that trend is due to Georgia having swapped spit with Hollywood in recent years, thereby attracting a more “progressive” cohort of voters. And perhaps part of it is due to the undoing of the Great Migration of the 20th century — the return of blacks from the Rust Belt back to the South as economic decay afflicts the blue states of the Midwest and the Northeast while job opportunities abound in the red states of the Sun Belt. Another possible explanation for Michigan’s shift is the “throw the bums out” attitude of citizens under Democrat Governor Gretchen Whitmer, while Georgia prospers under the steady and competent Republican governorship of Brian Kemp.\nNew York Democrats steal seats: New York Democrats have successful orchestrated a district map coup, as the state’s Court of Appeals agreed to throw out the current court-ordered map and order the redrawing of a new one. The trouble is, the new redrawn redistricting map will have to pass New York’s Democrat-controlled legislature. Back in 2014, the Empire State passed a constitutional amendment that banned the partisan gerrymandering of election districts and created a 10-member bipartisan redistricting commission. However, when the commission deadlocked over a new district map, the Democrat-run state legislature stepped in and gerrymandered its own redistricting map. With the court ruling, Democrats are now in position to effectively guarantee that their gerrymandered map — likely resulting in Republicans losing at least four House seats — will be the one agreed to, at least temporarily. This is a coup since the court effectively green-lighted the Democrats’ map even as the issue works its way through the appellate courts. Though the Democrats’ gerrymandered redistricting map will likely be thrown out in the end, it will be too late for a change before the 2024 election.\nWisconsin pro-life firebomber arrested: Last year, a pro-life center in Madison, Wisconsin, was firebombed by a member of the militant pro-abortion group Jane’s Revenge. DNA evidence at the scene led to the arrest of a 29-year-old biochemist by the name of Hridindu Sankar Roychowdhury, who eventually pleaded guilty to the crime. Roychowdhury is now facing a minimum of five years to a maximum of 20 years in prison. He is set to be sentenced in February. Roychowdhury should be classified as a domestic terrorist since the DOJ’s National Security head Matthew Olen observed that he had “used an incendiary device in violation of federal law in connection with his efforts to terrorize and intimidate a private organization.” There have been more than 100 attacks on pro-life centers and organizations across the country since the U.S. Supreme Court overturned Roe v. Wade, but so far the only pro-abortionist charged with any of these crimes is Roychowdhury.\nHeadlines\nHouse GOP advances impeachment inquiry resolution, teeing up vote (The Hill)\nBiden’s latest tall tale involves a brain aneurysm, a helicopter, and Ronald Reagan (Daily Wire)\nBiden admin sends billions to California’s over-budget, behind-schedule “train to nowhere” (Fox News)\nInflation slowed to a 3.1% annual rate in November (CNBC)\nADL reports staggering 337% increase in anti-Semitic incidents (Hot Air)\nVirginia Democrat featured in streamed sex acts online says she’s the victim (Fox News)\nTexas woman denied abortion of baby with fetal anomaly leaves state to obtain one (Daily Wire)\nHamas officials begin to flee foreign countries amid fears that Israel is about to kill them (Daily Wire)\nHumor: With Alex Jones returning to X, journalists concerned they’ll no longer be only source of misinformation (Babylon Bee)\nFor more editors’ choice headlines, click here.\nCOVID Vaccines Create Disruptive Proteins in Quarter of Recipients\nThe truth comes out, yet politicians and scientists continue to whistle past the graveyard.\nEmmy Griffin\nUK-based publication The Telegraph is reporting that a quarter of COVID mRNA vaccine recipients experienced an unwanted “nonsense protein” that is aggravating their immune system’s response to the vaccine.\nIt’s a temporary reaction, and the genetic gobbledygook created by the vaccines roughly 25% of the time seems to be harmless in this vaccine. However, there is a real fear that in subsequent mRNA vaccines that this nonsense protein could become a rogue protein. Rogue proteins are the culprits behind degenerative diseases such as Parkinson’s, Alzheimer’s, and multiple sclerosis.\nThis insistence that the COVID mRNA vaccines are totally harmless even with this protein “glitch” seems like a dubious claim. Hot Air’s David Strom echoes this sentiment, stating: “With billions of doses having been distributed, it seems very unlikely to me that the researchers can categorically state that none of the nonsense proteins did anything harmful. The claim, in fact, seems quite implausible since they freely admit that in future mRNA vaccines this could easily not be the case.”\nOne might also ask, why report about the “nonsense proteins” at all if they are harmless? Perhaps, as Strom also speculates, scientists are still under tremendous pressure to happy-talk the mRNA vaccines to maintain political peace.\nIt’s also pretty telling that this information was brought to public attention from a UK-based publication. It’s almost as if American media would rather stuff all controversy about the vaccines under the rug. That, and Americans are so over COVID at this point that many will shrug at yet another story about bad vaccine side effects. Really, the biggest issue with COVID vaccines is not that there were side effects; it’s the dictatorial mandates and bully tactics of the leftists to force the hands of those who didn’t want to take the vaccine. That must not be forgotten.\nThe mRNA vaccine technology was always an experiment. It was a Hail Mary pass during an uncertain time.\nLet’s take a walk down memory lane. The COVID vaccines were developed with an assist from President Donald Trump and Vice President Mike Pence spearheading Operation Warp Speed, which essentially was reducing government hurdles to production and approval.\nThis was Trump’s initiative, ergo Democrats claimed at the time they wouldn’t dare touch a vaccine that Trump had a hand in creating. When President Joe Biden came to office in January 2021, that vaccine became victory laurels for President Biden, who immediately started bullying states into dictating the distribution of the vaccines.\nMost of us who were following the latest news on COVID’s ravages — particularly out of countries like Italy — knew in March 2020 that COVID was mostly affecting the elderly and immunocompromised. Yet this was not how the vaccines were distributed. Vocation was the first determining factor, but it didn’t take long for power to get to the heads of Team Biden and Dr. Anthony Fauci.\nBy September 2021 — less than a year after Biden took office — the president started declaring that vaccines should be state mandated (by law the federal government cannot issue such mandates). In a speech with possibly the worst optics of this presidency (which is saying something), Biden declared that those who were still hesitant about getting a COVID vaccine were causing the pandemic to continue. “This is a pandemic of the unvaccinated,” he thundered.\nThat rhetoric spurred companies to start enforcing vaccine mandates. People had to obtain vaccine passports and proof of vaccination to continue working at certain companies or to travel anywhere. Many people were also forced to put on a mask — even toddlers. The military discharged thousands of warriors because they refused to comply with the vaccine mandate, only now offering a weak mea culpa.\nAlso in late 2021, enforcers came after school children even though schools were not superspreaders of the virus. In fact, most children suffered only mild symptoms, but there were talks that bureaucrats were going to add COVID vaccination as a coming-back-to-school prerequisite, which then turned into threats of making the vaccine requirement permanent.\nAs this was going on, vaccine side effects were starting to come to light. First, there was an ever-growing spate of young healthy men and women experiencing serious heart problems after taking the mRNA vaccine and its boosters. They had heart problems such as myocarditis, pericarditis, and cardiac arrhythmia that led to heart attacks and heart failure.\nNext, studies started to come out about pregnant women and the COVID vaccine consequences for their unborn and future children. The mRNA vaccines have been known to disrupt a woman’s menstrual cycle and show up in the breast milk that is being given to her tiny baby. (Perhaps other unknown side effects are still to be documented.) These studies came out in late 2022. As this writer stated at the time, the truth about the COVID vaccine and its side effects has been a slow trickle, and lots of it is not so good.\nThree years after the vaccines were made, companies like Pfizer are starting to face a reckoning.\nLate last month, Texas Attorney General Ken Paxton announced that the Lone Star State was suing Pfizer specifically for misrepresenting the efficacy of the COVID vaccines and the subsequent boosters. Pfizer claimed that its vaccine was 95% effective in preventing COVID. This over-representation of the efficacy of the vaccine was quickly debunked by real life. Ironically so, in some cases, like when quadruple-vaxxed President Biden still got COVID not once but twice.\nMost of the American population is cooling down on COVID vaccine boosters. People know the vaccines aren’t working the way that politicians, Big Pharma, and leftist alarmists promised they would. According to the Centers for Disease Control and Prevention, just 17% of the population in late 2023 is even bothering to get a booster.\nAs more information continues to trickle out about the vaccines and their side effects, one thing is for certain: mRNA technology in general and the COVID vaccine in particular need more tweaking to prevent unintended consequences. Furthermore, mandating the vaccines was a stupid and reckless move that preyed on a scared population and further divided the country. Thanks, President Unity™.\nUkraine: Time to End It\nWith Russia and Ukraine at a stalemate, and with Volodymyr Zelensky in need of more billions, the time is right for a negotiated settlement.\nDouglas Andrews\nIf Congress doesn’t cough up $61 billion more to Ukraine, and if it doesn’t do so before heading off on holiday break, Joe Biden says they’ll be giving Russian President Vladimir Putin “the greatest Christmas gift they could possibly give him.”\nMaybe it’s just us, but this doesn’t seem like the best way to win friends and influence people. In any case, Biden’s warning was a none-too-subtle swipe at Republicans, who are increasingly disinclined to trust him in matters of finance or foreign policy, and who aren’t at all eager to keep writing blank checks for a black hole of a foreign war. Still, that didn’t stop Ukrainian President Volodymyr Zelensky from making his third trip to the U.S. this year with tin cup in hand.\n“Putin is banking on the United States failing to deliver for Ukraine,” said Biden. “We must prove him wrong.” Then he vowed to Zelensky, who was standing at the lectern to his right, “I’ll not walk away from Ukraine and neither will the American people.”\nThat’s a bold promise to make on behalf of the American people, especially when it comes from a president so deeply unpopular.\nBiden’s teleprompter must’ve been in the repair shop yesterday afternoon because he simply stared down at his prepared remarks during the presser, rarely looking up at any point during his speech. One word that kept coming up, though — both in Biden’s speech and in Zelensky’s — was “freedom.” Clearly, this was arranged in advance, and shrewdly so. Few words in the English language wield as much power.\nPerhaps Biden’s best barb came when he noted that the Russians themselves are cheering the American intransigence: “If you’re being celebrated by Russian propagandists,” his handlers wrote, “it might be time to re-think what you’re doing. History will judge harshly those who turn their backs on freedom’s cause.”\nWhen asked by a Ukrainian journalist about next year’s NATO summit and what Zelensky hoped to see come out of that summit, he wisely punted to Biden. “NATO will be in Ukraine’s future,” said Biden, “no question about that. But as we said … Ukraine will become a member of NATO when all allies agree and conditions are met. Right now, we have to make sure they win the war.”\nWhat Biden is proposing is a $110 billion package of funding for Ukraine, Israel, and “other national security priorities,” as the Associated Press put it. Ukraine’s share of the loot would be $61 billion, and that would come on top of the $113 billion that Congress already committed to the country in January — money which the Biden administration says has nearly run out.\nWe know what you’re thinking: chump change. And, in a way, you’re right, especially given that our nation is nearly $34 freaking trillion in debt. But, hey, a hundred billion here, a hundred billion there, and pretty soon we’re talking about real money.\nOhio Republican Senator J.D. Vance, for one, isn’t overly enthusiastic. As he put it Monday, if you want to secure your own southern border before helping Ukraine to secure its border with Russia, you’re cast as “a Putin puppet,” adding: “I think it’s disgraceful. I think it’s grotesque.”\nAnother Republican senator, Arkansas’s Tom Cotton, had a similar take about the importance of securing our southern border: “Joe Biden seems to care more about other countries’ borders than he does our own.” Cotton, who unlike Vance favors support for Ukraine, nonetheless notes that the people streaming across our southern border are not nursing mothers with babies; they’re military-age males, and that’s why even the FBI is alarmed.\nZelensky is in a tough spot. The American people are largely sympathetic toward his country and its war with Russia, but they’re largely sick of funding it. And they’re especially sick of funding Ukraine’s teachers and professors and other civil servants. And given the way Joe Biden has managed things, it’s easy to understand Zelensky’s frustration. “Biden has essentially slow-walked us, back-peddled us, incrementally provided Zelensky just enough to keep from losing but not enough to help him win,” said Florida Republican Congressman and former Green Beret Michael Waltz. “How can we in good conscience go home to our constituents, tell them that they need to dig deeper in their pockets for tens of billions of dollars more, when we have no strategy, we’re stuck in a stalemate … and our own border is out of control?”\nThere’s that word again: the border. We’re sensing a trend. “I just don’t think Democrats appreciate, specifically, how committed Republicans are to securing our southern border,” said Missouri Senator Eric Schmitt.\nAs for the stalemate, the question now becomes: Do we fully fund Ukraine and fight for Russia’s utter defeat, or do we try to stop Putin where he is and ensure that Ukraine, while not made whole again, is still a viable country? As Waltz says, “Those are two different questions.” The Federalist’s John Daniel Davidson advocates for stopping Putin where he is, writing:\nIt’s becoming increasingly clear that the war in Ukraine is an unwinnable quagmire, and that for all the calls we hear for a ceasefire in the Israel-Hamas conflict, what’s really needed is a ceasefire in Ukraine, where the solution today is more or less what it was before Russia invaded Ukraine in February 2022: a negotiated settlement. …\nThe United States isn’t going to risk World War III to guarantee Ukraine’s 1991 borders, and the sooner Senate Republicans and the Biden administration make that clear to Zelensky, the sooner we can start working out what a post-war settlement could look like for Ukraine and Russia.\nIt’s hard to imagine a negotiated settlement involving Joe Biden, but who knows? Maybe the Russians are ready. Nebraska Congressman Don Bacon says that with our help, Ukrainian forces have taken 300,000 Russians off the battlefield with about 130,000 killed. And with the Javelin missiles we’ve been sending, the Ukrainians have also destroyed about half of Russia’s tanks.\nCongress is scrambling to get something done before its members head home for the holidays, but a Christmas miracle appears unlikely.\nGiven this fiscally perilous time, we think that’s a good thing.\nCompetition for the Girl Scouts?\nThe Leftmedia promotes a fringe, racially exclusive Girl Scouts-like organization to push its woke narrative.\nThomas Gallatin\nAs if the Girl Scouts didn’t have enough competition on their hands from the Boy Scouts of America opening their organization to accept girls, watch out because here comes the alternative group called Radical Monarchs “gaining fans in US cities!” At least that’s what the Leftmedia is claiming.\nSo, what is this organization known as the Radical Monarchs? Well, if you thought the Girl Scouts had a leftist bent, then you ain’t seen nothing yet. The Radical Monarchs are effectively a neo-Marxist, racially exclusive group. To put it another way, they are anti-white communists.\nAccording to Bloomberg, “First established in 2014 in the San Francisco Bay Area, Radical Monarchs is a troop for Black and Brown girls — as well as children who identify as nonbinary — from 8 to 11 years old.” So, it’s not exclusively for girls, but whites need not apply.\nWe know you’re wondering when you might catch a glimpse of these Monarchs out in front of your local grocery story selling cookies. Well, they’re more likely to be handing out copies of the Communist Manifesto, since they are supposedly “an alternative” to the 1.7-million-strong Girl Scouts that are “gaining steam.”\nThe near-decade-old Radical Monarchs boast a whopping 104 current members across the entire country. At this rate of growth, it’ll take a century before the Girl Scouts even realize the Radical Monarchs exist.\nIndeed, there are at least 10 other Girl Scout alternative organizations with higher membership numbers than the Monarchs, including AWANA, American Heritage Girls, and Frontier Girls. Furthermore, none of these organizations handicapped their growth potential by eliminating the largest racial demographic in the country from participating.\nThe real question is, why are Leftmedia outfits like Bloomberg, ABC News, and PBS even covering the existence of this minuscule organization that amounts to little other than a woke club for black and brown girls?\nOne reason is to raise the profile of this radical leftist group that seeks to indoctrinate young girls into becoming the next generation of woke social justice warriors. Furthermore, it serves to push the Left’s critical race theory narrative of an America that is too white and doesn’t contain enough non-white safe spaces for people of color.\nIn truth, what the Leftmedia is doing is pushing leftist propaganda. This group’s existence would hardly have made a story in the local paper let alone gained any national recognition. The Leftmedia is intentionally inflating its relevance as part of a dubious narrative it desperately wants people to unquestioningly accept as legitimate.\nNot-So-Scary Truth About Climate Change\nThe way to deal with climate change is to adjust to it.\nJohn Stossel\nUnited States Special Presidential Envoy for Climate John Kerry says it will take trillions of dollars to “solve” climate change. Then he says, “There is not enough money in any country in the world to actually solve this problem.”\nKerry has little understanding of money or how it’s created. He’s a multimillionaire because he married a rich woman. Now he wants to take more of your money to pretend to affect climate change.\nBjorn Lomborg points out that there are better things society should spend money on.\nLomberg acknowledges that a warmer climate brings problems. “As temperatures get higher, sea water, like everything else, expands. So we’re going to maybe see three feet of sea level rise. Then they say, ‘So everybody who lives within three feet of sea level, they’ll have to move!’ Well, no. If you actually look at what people do, they built dikes and so they don’t have to move.”\nPeople in Holland did that years ago. A third of the Netherlands is below sea level. In some areas, it’s 22 feet below. Yet the country thrives. That’s the way to deal with climate change: adjust to it.\n“Fewer people are going to get flooded every year, despite the fact that you have much higher sea level rise. The total cost for Holland over the last half-century is about $10 billion,” says Lomberg. “Not nothing, but very little for an advanced economy over 50 years.”\nFor saying things like that, Lomberg is labeled “the devil.”\n“The problem here is unmitigated scaremongering,” he replies. “A new survey shows that 60% of all people in rich countries now believe it’s likely or very likely that unmitigated climate change will lead to the end of mankind. This is what you get when you have constant fearmongering in the media.”\nSome people now say they will not have children because they’re convinced that climate change will destroy the world. Lomborg points out how counterproductive that would be: “We need your kids to make sure the future is better.”\nHe acknowledges that climate warming will kill people.\n“As temperatures go up, we’re likely to see more people die from heat. That’s absolutely true. You hear this all the time. But what is underreported is the fact that nine times as many people die from cold. … As temperatures go up, you’re going to see fewer people die from cold. Over the last 20 years, because of temperature rises, we have seen about 116,000 more people die from heat. But 283,000 fewer people die from cold.”\nThat’s rarely reported in the news.\nWhen the media doesn’t fret over deaths from heat, they grab at other possible threats.\nCNN claims, “Climate Change is Fueling Extremism.”\nThe BBC says, “A Shifting Climate is Catalysing Infectious Disease.”\nU.S. News and World Report says, “Climate Change will Harm Children’s Mental Health.”\nLomborg replies, “It’s very, very easy to make this argument that everything is caused by climate change if you don’t have the full picture.”\nHe points out that we rarely hear about positive effects of climate change, like global greening.\n“That’s good! We get more green stuff on the planet. My argument is not that climate change is great or overall positive. It’s simply that, just like every other thing, it has pluses and minuses. … Only reporting on the minuses, and only emphasizing worst-case outcomes, is not a good way to inform people.”\nCOPYRIGHT 2023 BY JFS PRODUCTIONS INC.\nVIDEOS\nBig Business and Big Brother — We are on the brink of the biggest merger in history. If we don’t stop it, our constitutional rights could become a relic of the past.\nLeft vs. Right: Freedom — Politicians on both the Left and the Right say their side values freedom more than those across the aisle. But how can this be? Because the Left and the Right have different definitions of “freedom.”\n‘It’s Okay to Say [You Were Wrong]’ — Rep. Dan Crenshaw questions the CDC director on hidden Chinese biolabs.\nFrench Farmers’ Poop Protest — French farmers started a demonstration by spraying manure and dumping tires at the agriculture building.\n‘I Was Disappointed in Your Answers’ — Rep. Andy Biggs blasts federal agency witnesses about empty office buildings and federal telework policies.\nRIP, Bidenomics — Democrats want to ditch the term “Bidenomics.”\nBEST OF RIGHT OPINION\nFor more of today’s columns, visit Right Opinion.\nSHORT CUTS\nThe BIG Lies\n“I had a cranial aneurysm. … President Reagan was nice enough to send … Helicopter One to take me down [to Walter Reed], but it couldn’t fly.” —President Joe Biden\n“[Republicans] are asking for very severe, very draconian immigration policy changes.” —Senator Chris Murphy (D-CT)\n“I feel like the underlying trend lines in inflation are good. We’ve seen grocery prices come down. We’ve seen prices at the pump come down. We’ve seen some of the core areas moving back down to pre-pandemic levels.” —National Economic Council Director Lael Brainard\nHot Air\n“We are again witnessing another moment in which the persuasive force of evidence, and with it Earth’s future, hangs in the balance — all because some extremist political voices, holdout nations, and vastly vested interests have declared war on facts and science; all because they distort, for political and personal gain, what science and common sense dictate we humans must do in order to put our house in order.” —climate czar John Kerry\n“There’s a mental health crisis around the world … that we hear people talking about. I think that one of the main reasons for that is that young people look at the fact that we are not yet solving the climate crisis. … Solving the climate crisis is a poly-solution. We know what to do.” —Al Gore\nA Blind Squirrel Finds a Nut\n“Elite universities … have gone from being centers of excellence to institutions pushing political agendas. … Good intentions have morphed into a dogmatic ideology and turned these universities into places where the pervasive goals are political and social engineering, not academic merit. … They should abandon this long misadventure into politics, retrain their gaze on their core strengths, and rebuild their reputations as centers of research and learning.” —CNN’s Fareed Zakaria\nFor the Record\n“I have confirmed now from multiple sources that the search committee that led to President [Claudine] Gay’s appointment excluded non-DEI eligible candidates from the process.” —Harvard alumnus and billionaire hedge fund manager Bill Ackman\n“Even if Harvard’s Claudine Gay and MIT President Sally Kornbluth step down, and even if the presidents of the top 200 leftist universities all resigned, it wouldn’t solve the problem. … Anti-Semitism will continue to fester on these campuses after they are gone unless and until we deal with the neo-Marxist indoctrination that is being pushed on our children and grandchildren at these colleges and universities.” —Gary Bauer\n“Regarding the current pool of women heading Ivy League universities, there are very smart women in the academic marketplace, but apparently they have to dumb down the pool when the selection process comports with the leftist DEI narrative.” —Mark Alexander\n“As secretary of state, MIT canceled my campus speech about the CCP because it ‘risked offending’ Chinese students. Now these schools justify rampant antisemitism because of a ‘commitment’ to free speech?” —Mike Pompeo\n“Anti-Zionists claim that Israel’s origins are illegitimate. Of all the world’s 200-plus countries, the only country anti-Zionists declare illegitimate is also the only Jewish one. That’s pretty much all you need to know about their motives.” —Dennis Prager\nUseful Idiot\n“[Israel’s] starting to lose … support by indiscriminate bombing that takes place.” —Joe Biden\n“I think [Israeli Prime Minister Benjamin Netanyahu] has to change … this government in Israel is making it very difficult for him to move.” —Joe Biden\nNon Compos Mentis\n“It’s been 65 years [days] since the deadliest day of the Jewish people since the Holocaust. 65 years [days].” —Joe Biden\n“We also need Ukraine to make changes to fix the broken immigration system here — we also need Congress to make the changes to fix the broken immigration system here at home.” —Joe Biden\nBelly Laugh of the Day\n“We for sure gonna lose if we don’t have Joe [Biden].” —Congresswoman Jasmine Crockett (D-TX)\nDumb & Dumber\n“With lax Republican gun laws across the country, we’ve gotta take very seriously anybody who’s making any kind of violent threats, especially genocidal threats. Having said that, where does Elise Stefanik get off lecturing anybody about anti-Semitism when she’s the hugest supporter of Donald Trump, who traffics in anti-Semitism all the time?” —Congressman Jamie Raskin (D-MD)\n“I think what you’re seeing … is absolutely the result of capitalism and what happens in capitalism to the people at the bottom rungs. The biggest driver of why folks are on the street is because they lost their jobs, income or were evicted from their homes, usually for not being able to pay the rent. So you have major landlords literally causing folks to lose their homes, and real estate speculation making it impossible for folks to find an affordable place to live.” —San Francisco Supervisor Dean Preston\n“I’m a Michigander. This is football season. I don’t usually compliment Ohio, but hats off to the people of Ohio who rejected all the [abortion] misinformation and codified this right for women in that state just south of us.” —Michigan Governor Gretchen Whitmer (D)\n“Anyone who’s worked as a journalist at the [New York Times] knows that journalists there are absolutely allowed to loudly espouse political opinions, you just have to espouse the right political opinions. Right wing opinions are fine, left wing opinions are not.” —The Washington Post’s Taylor Lorenz\n“My own personal ethics on life are, I think, enough to keep me going on the right path.” —Anthony Fauci on no longer being a practicing Catholic\nPolitical Futures\n“It doesn’t make any difference to the public whether this case gets tried before or after Election Day. It makes a difference to Democrats.” —former prosecutor Andrew McCarthy shooting down Trump special prosecutor Jack Smith’s rationale for attempting to bypass the normal appeals process\n“Ron DeSantis is running as the true-blue conservative in the race for the Republican presidential nomination. And he’s learning the hard way that Republicans don’t nominate true-blue conservatives. … It’s not that Republican voters aren’t generally conservative. It’s simply that they’re not thoroughly, consistently and single-mindedly conservative.” —Daniel McCarthy\nTODAY’S MEME\nFor more of today’s memes, visit the Memesters Union.\nTODAY’S CARTOON\nFor more of today’s cartoons, visit the Cartoons archive.\nPlease join us in prayer for our nation — that righteous leaders would rise and prevail and we would be united as Americans. Pray also for the protection of our Military Patriots, Veterans, First Responders, and their families. Please lift up your Patriot team and our mission to support and defend our Republic’s Founding Principle of Liberty, that the fires of freedom would be ignited in the hearts and minds of our countrymen.\nThank you for supporting our nation’s premier online journal of Liberty.\nSemper Vigilans Fortis Paratus et Fidelis",
  "word_count": 7271,
  "scraped_at": "2026-02-14T12:05:32.672698"
}