{
  "article_id": "927f76e658cd",
  "url": "https://www.castanetkamloops.net/news/World/515910/The-Latest-Donald-Trump-wins-US-presidency-GOP-reclaims-Senate-majority",
  "title": "The Latest : Donald Trump wins US presidency , GOP reclaims Senate majority - World News",
  "date": "20241106T193000Z",
  "domain": "castanetkamloops.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Latest: Donald Trump wins US presidency, GOP reclaims Senate majority\nThe latest on Trump win\nRepublican Donald Trump was elected the 47th president of the United States on Wednesday, an extraordinary comeback for a former president who refused to accept defeat four years ago, sparked a violent insurrection at the U.S. Capitol, was convicted of felony charges and survived two assassination attempts.\nWith a win in Wisconsin, Trump cleared the 270 electoral votes needed to clinch the presidency.\nRepublicans reclaimed control of the Senate, picking up seats in West Virginia and Ohio. Top House races are focused in New York and California, where Democrats are trying to claw back some of the 10 or so seats where Republicans have made surprising gains in recent years.\nHere’s the latest:\nSen. Mitch McConnell credits Republicans’ election success in the Senate to ‘candidate quality’\nOutgoing Senate Republican Leader Mitch McConnell credited his party’s Senate election success to “candidate quality,” saying it was “absolutely essential.”\nIn past election cycles, Republican Senate candidates have emerged from the populist, right-wing of the party but many struggled to win statewide votes. This year, Senate Republican leaders made a concerted effort to recruit mainstream candidates who offered broad appeal.\nThere has been intense friction within the GOP between the camps largely headed by Donald Trump and McConnell. A recent biography revealed that the longtime Senate leader has privately excoriated Trump, especially for his efforts to overturn 2020 election results.\nWhile McConnell credited Trump’s campaign operation for the victory, he also chalked up the election results to frustrations with the current Democratic administration.\n“If you’re looking for a simple answer, I think it was a referendum on the current administration, in part. People were just not happy with this administration and the Democratic nominee was a part of it,” McConnell said.\nSenate Republican Leader Mitch McConnell: It’s a ‘happy day for the GOP’\nOutgoing Senate Republican Leader Mitch McConnell called Wednesday a “happy day for the GOP” as he congratulated Donald Trump for his victory and credited it to “a sharper operation this time around.”\nMcConnell said he hopes Republicans’ majority in the Senate may still grow as races in battleground states are decided.\nSenate Republicans will decide next week who the next majority leader will be.\nCISA director: ‘No evidence of any malicious activity’ affecting the security, integrity of the election\nJen Easterly, director of the U.S. Cybersecurity and Infrastructure Security Agency, on Wednesday praised the work of state and local election officials and the hundreds of thousands who served as poll workers on Election Day.\n“As we have said repeatedly, our election infrastructure has never been more secure and the election community never better prepared to deliver safe, secure, free, and fair elections for the American people,” Easterly said. “This is what we saw yesterday in the peaceful and secure exercise of democracy.”\nThe nation’s capital — and its construction workers — are already preparing for a transfer of power\nFor all of the heady talk of democracy and the peaceful transfer of power from one administration to the next, a presidential transition also involves things that are less conceptual — and more mundane.\nThat includes construction of all the temporary structures for the presidential inauguration.\nIn front of the White House, workers had fenced a section of Pennsylvania Avenue and Lafayette Park as they constructed the Presidential Inaugural Parade Reviewing Stands. The temporary pavilion is where Trump and his family will take in the parade as it winds in front of the White House on Jan. 20.\nOn the National Mall, work has also begun on the inauguration platform, from where Trump will be sworn into office and address the nation. Nearly four years ago, on Jan. 6, Trump supporters rushed the Capitol and used pieces of the half-built structure to attack police officers. Workers on the site had to flee.\nThis year, members of Congress from both sides of the aisle gathered in September to drive the first nails for the structures, symbolizing the unity they aspired to forge amidst a divisive presidential campaign.\nHarris campaign invites supporters to a post-election event at Howard University\n“We invite you to join the Harris-Walz campaign for an event with Vice President Kamala Harris today at Howard University in Washington, D.C.,” read the text. “Doors will open at 1:00 PM.”\nHarris was scheduled to speak at Howard on Tuesday night and the atmosphere at the event was jubilant as initial results rolled in. As the night dragged on and it became clear that Harris would not defeat Trump, her supporters grew dour.\nCedric Richmond, Harris’ campaign co-chair, then told the audience they “won’t hear from the vice president tonight.”\nIn Melania Trump’s hometown, there is a cake named in her honor\nIn Melania Trump’s hometown in Slovenia, locals are proud that one of their own will once again become the U.S. first lady.\nDonald Trump’s victory in the U.S. presidential election has been followed closely in Sevnica, a town nestled in a valley by the Sava river where Melania Trump grew up under Communism as Melanija Knavs.\n“We are very proud that Mrs. Melanija has become the first lady again, that she will perform her role with honor and dignity, just like in the previous mandate,” Sevnica mayor Srecko Cvirk said.\nSevnica previously — and proudly — advertised itself as Melania Trump’s hometown, so much so that a local party shop created a cake in her name eight years ago.\nThe “Melanija” is made of green nuts, caramel, almond cream and white chocolate mousse.\n“It is white because of the White House,” said the shop’s manager, Franja Kranjc.\nFormer President Bush congratulates Trump\nIn a statement, former President George W. Bush said he and his wife, Laura, “join our fellow citizens in praying for the success of our new leaders at all levels of government.”\nSome top former Republican officials, including Bush’s vice president, Dick Cheney, had endorsed Harris. But Bush remained neutral.\nBush also thanked “President Biden and Vice President Harris for their service to our country.”\n“The strong turnout in this election is a sign of the health of our republic and the strength of our democratic institutions,” said Bush, who called the election a “free, fair, safe, and secure election.”\nHow do the 2024 numbers compare to 2020?\nPresident Joe Biden and Vice President Kamala Harris received a record of over 80 million votes to win the White House in 2020. They beat Donald Trump and Mike Pence, who received over 74 million votes.\nThis year so far, the Democratic ticket has received only 66 million.\nMeanwhile. Trump and Vance have received over 71 million votes as of Wednesday morning.\nIn 2020, Biden and Harris won the majority of the Electoral College with 306 votes, the identical margin Trump won back in 2016. This year, Trump clinched the nomination with 277 electoral votes, with 37 votes still up for grabs.\nRepublican Kevin Kiley wins reelection to U.S. House in California’s 3rd Congressional District\nRepublican Rep. Kevin Kiley won reelection to a U.S. House seat representing California on Wednesday, defeating Democrat Jessica Morse.\nKiley, a first-term congressman, had captured the seat in 2022 by arguing that California was in turmoil under Democratic rule in Washington and Sacramento. The 3rd Congressional District stretches across much of the state’s eastern border and includes Sacramento’s northeastern suburbs. Former President Trump narrowly carried the district in the 2020 presidential election. The Associated Press declared Kiley the winner at 10:48 a.m. EST.\nAfter election loss in Montana, Sen. Jon Tester says he called Republican Tim Sheehy to congratulate him\nTester also thanked his supporters and said he’d go back to working on his farm.\n“Look, I’m very, very blessed,” he said. “I’ve had a great 18 years in the United States Senate. I’ve met some incredible people along the way and had the opportunity to do some great things to help move this state forward, move the country forward.”\nWisconsin’s Senate race remains close\nWisconsin’s hotly contested race for U.S. Senate between Democratic Sen. Tammy Baldwin and Republican Eric Hovde, who was backed by President-elect Donald Trump, remained close Wednesday morning.\nBaldwin had a lead of 0.9% based on unofficial results, which is just within the 1% margin that would allow for Hovde to request a recount if he pays for it.\nMorocco’s king calls Trump’s win ‘a tribute to his patriotism’\nMorocco’s King Mohammed VI on Wednesday expressed “sincere congratulations” and “best wishes” to President-elect Donald Trump, referencing the latter’s 2020 decision to back Morocco’s stance in the disputed Western Sahara.\n“Mr. Trump’s resounding success in these elections is a tribute to his patriotism and rewards his commitment to upholding the best interests of the United States,” the king wrote in a letter published by the state press agency, MAP.\nThe 61-year-old monarch said Moroccans were grateful for Trump’s move to shift the United States’ longstanding position in the Western Sahara, a disputed territory that Morocco considers its southern provinces and the United Nations considers “non-self-governing.”\nHe added that Morocco — which normalized relations with Israel as part of the 2020 Abraham Accords — was committed to allying with the United States to address “increasingly complex regional and global challenges.”\nMorocco hopes Trump follows through on the State Department’s yet-to-be-fulfilled 2020 commitment to build a consulate in the disputed territory.\nUS stock market and bitcoin surge on Trump’s return to office\nInvestors are betting on what Trump’s return to the White House will mean for the economy and the world.\nThe Dow jumped 1,200 points, or 2.8% early Wednesday and major stocks including Elon Musk’s Tesla and bitcoin soared.\nTrump Media & Technology Group, the company behind the Truth Social platform, also surged.\nRepublicans seek to add to their Senate majority in Pennsylvania’s race\nPennsylvania’s U.S. Senate race between three-term Democratic Sen. Bob Casey and Republican challenger David McCormick could help Republicans pad their newfound majority in the chamber in a battleground state contest that remained uncalled by The Associated Press on Wednesday.\nMcCormick led vote counting Wednesday morning by about 50,000 votes, or less than 1%, but a significant number of votes remained uncounted. In a statement Wednesday, Casey’s campaign said, “There are more votes that need to be counted in areas like Philadelphia and it’s important that every legal ballot will be counted. When that happens we are confident the senator will be reelected.”\nIt’s the first time Casey has shared the same ballot as Donald Trump, who won Pennsylvania for a second time in 2024 after winning it in 2016.\nCasey, the son of a former two-term governor, is a stalwart of the state’s Democratic Party, having won six statewide elections going back to 1996.\nMcCormick is making his second run for the Senate after losing narrowly in 2022’s Republican primary. He left his job as CEO of the world’s largest hedge fund to run.\nDemocratic incumbent US Rep. Susan Wild concedes in competitive Pennsylvania House race\nThree-term Democratic Rep. Susan Wild has conceded in in her race against Republican Ryan Mackenzie in a hotly contested Pennsylvania congressional district, though The Associated Press still hasn’t called the race.\nRepublicans had targeted the seat as a possible flip that would boost their prospects for keeping the House majority.\n“I congratulate my opponent on winning this seat, and I am going to do everything to ensure a smooth transition, because the people of this district deserve nothing less,” Wild said in her statement.\nWhat could Trump’s win mean for Europe?\nDozens of European leaders will be assessing a new global outlook during a one-day summit in Hungary’s capital on Thursday, with the knowledge that the election of Donald Trump as the next U.S. president could have far-reaching consequences for the continent.\nDespite myriad economic problems and two wars in the neighborhood, all eyes will be glued on Washington to see whether Trump’s return will cause political strife throughout the continent, much like his first presidency did.\nRead more about how trans-Atlantic economic relations might change\nWhat are Trump’s plans for a second administration?\nDonald Trump has promised sweeping action in a second administration.\nThe former president and now president-elect often skipped over details but through more than a year of policy pronouncements and written statements outlined a wide-ranging agenda that blends traditional conservative approaches to taxes, regulation and cultural issues with a more populist bent on trade and a shift in America’s international role.\nTrump’s agenda also would scale back federal government efforts on civil rights and expand presidential powers.\nBolsonaro hopes Brazil will ‘follow the same path’ following Trump’s win\nBrazil’s far-right former President Jair Bolsonaro said on the social platform X that Trump’s imminent return to the White House marked “the triumph of the people’s will over the arrogant designs of an elite who disdain our values, beliefs, and traditions.”\nHe said Trump’s victory was historic and would empower right-wing and conservative movements across the globe, and he hoped it would inspire Brazil to “follow the same path.”\nBolsonaro lost his reelection bid in late 2022 and a little over two months later, his supporters stormed the capital in a bid to restore him to power. It was widely seen as an echo of the U.S. Capitol insurrection two years earlier, and Bolsonaro is now the target of several investigations.\nA unified Republican grip on Washington would set the course for Trump’s agenda\nBut if Democrats wrest control of the House, it would provide an almost certain backstop, with veto power over the White House.\nTrump, speaking early Wednesday at his election night party in Florida, said the results delivered an “unprecedented and powerful mandate” for Republicans.\nHe called the Senate rout “incredible.” And he praised House Speaker Mike Johnson, who dashed from his own party in Louisiana to join Trump. “He’s doing a terrific job,” Trump said.\nVote counting in some races could go on for days and control of the House is too early to call.\nNorwegian group: Trump’s election means US ‘will no longer be a driving force’ in climate fight\nNorwegian Bellona environmental group said that “with the election of Donald Trump, the United States will no longer be a driving force globally to reach the 1.5 Celsius target,” referencing the international goal of trying to limit future warming since preindustrial times.\nThe outcome means the European Union “must take the global leadership role in the climate fight, and to a significantly greater extent ensure the defense of Europe’s strategic interests,” the group said.\n“The EU will now become significantly more important for climate, technology development and restructuring in the next four years,” Frederic Hauge, founder of the Oslo-based organization, said in a statement.\nOn Ukraine’s front and in Kyiv, hope and pragmatism compete when it comes to Trump’s election\nSoldiers in a Ukrainian artillery battery on the front lines of the country’s east were only vaguely aware of American election results pointing to Donald Trump’s victory Wednesday — but firm in their hopes for the next president of the United States.\nTheir entrenched artillery battery fires on Russian forces daily — and takes fire nearly as often. Just the other day, one of their overhead nets snared a Russian drone.\n“I hope that the quantity of weapons, the quantity of guns for our victory will increase,” the unit’s 39-year-old commander, who goes by the name Mozart, said in the hours before Trump’s win was confirmed. “We don’t care who is the president, as long as they don’t cut us off from help, because we need it.”\nThough Trump’s election throws into doubt American support for Ukraine — and ultimately whether Kyiv can beat back Russia’s invasion — the soldiers who use their Starlink connection to the internet sparingly learned of the results from Associated Press journalists.\nSlovakia’s prime minister congratulates Trump on his victory\n“We respect the choice of American people,” Prime Minister Robert Fico said at a news conference on Wednesday.\nFico, who is known for pro-Russian views, said the result of the election is “certainly a defeat of liberal and progressivist ideas because the new American President is a conservative. We think he’ll focus on the economy issues in the United States.”\nFico said what’s of importance is that “everybody is waiting for the first steps in regards of the war in Ukraine.”\nFico added that Trump might reduce or halt the military aid for Ukraine or propose an immediate cease-fire to open the way for negotiations between Ukraine and Russia.\nFico ended his state’s military aid for Ukraine.\nHow are markets responding to the election results?\nFutures markets in the U.S. surged early Wednesday, with the Dow climbing 2.85% and the S&P 500 rising nearly 2%.\nBitcoin, which many see as a winner under a Trump presidency, hit all-time highs above $75,000.\nTesla, the company run by Trump surrogate Elon Musk, spiked 12% before the opening bell while other electric vehicle makers slumped.\nBanking stocks also moved solidly higher, with expectations of a pullback by regulators overseeing markets under Trump.\nUS humanitarian group urges Trump, Congress to ‘reject policies that demonize immigrants and asylum seekers’\nThe International Rescue Committee, a large humanitarian aid organization, urged the Trump administration to “continue America’s traditions of humanitarian leadership and care of the most vulnerable.”\nThe New York-based nonprofit also urged the new administration and Congress to “reject policies that demonize immigrants and asylum seekers,” and noted that the U.S. program to resettle refugees has saved lives and strengthened the fabric of the United States.\nIRC is led by Britain’s former top diplomat, David Miliband, and says it provides relief services to people affected by crises in more than 40 countries.\nBarriers broken and history made in several congressional races\nWith their victories, several candidates are set to be firsts.\nNew Jersey Rep. Andy Kim, a Democrat, won his race to become the first Korean American elected to the Senate.\nDelaware State Rep. Sarah McBride, a Democrat, won her race to become the first openly transgender person elected to Congress. The former Obama administration official was elected to the Delaware General Assembly in 2021.\nDemocrat Angela Alsobrooks won her race and is set to become Maryland’s first Black senator. Alsobrooks is currently the county executive for Maryland’s Prince George’s County, one of the most prosperous Black-majority counties in the nation.\nRep. Lisa Blunt Rochester, a Democrat from Delaware, broke barriers again, becoming the first woman and first Black person elected to the Senate from the state. Seven years ago, when she was elected to the House, she was the first woman and first Black person to represent Delaware in the House. It will be the first time that two Black women will serve simultaneously in the Senate.\nNorth Dakota elected its first woman to Congress. Republican Julie Fedorchak, running for the House of Representatives, won her race handily in the deep red state. She’s currently a member of the state’s public service commission.\nBernie Moreno, a Republican from Ohio,defeated incumbent Sen. Sherrod Brown to be the first Latino from the state elected to the Senate.\nBitcoin hits new high as investors bet Trump’s victory will benefit cryptocurrencies\nBitcoin jumped nearly 8% to a record $75,345.00 in early trading on Wednesday, before falling back and was recently trading at around $73,700.00.\nTrump was previously a crypto skeptic but changed his mind and embraced cryptocurrencies ahead of the election.\nHe pledged to make America “the crypto capital of the planet” and create a “strategic reserve” of bitcoin. His campaign accepted donations in cryptocurrency and he courted crypto fans at a bitcoin conference in July.\nHe also launched World Liberty Financial, a new venture with family members to trade cryptocurrencies.\nAbortion proposals win in 7 states\nDespite major losses for Democrats in the Senate and White House, the party’s central campaign issue surrounding protecting reproductive rights fared much better across the country as abortion rights advocates won on measures in seven states.\nThe last state to pass such a measure by early Wednesday was Montana, where abortion rights advocates pushed to enshrine abortion rights until fetal viability into the state constitution as a safeguard against future rollbacks. Though there’s no defined time frame, doctors say viability is sometime after 21 weeks.\nIn three others — Florida, Nebraska and South Dakota — voters rejected measures that would have created a constitutional right to abortion.\nMontana enshrines abortion rights\nMontana voters chose to protect the right to an abortion in their state constitution.\nThe ballot initiative sought to enshrine a 1999 Montana Supreme Court ruling that said the constitutional right to privacy protects the right to a pre-viability abortion by a provider of the patient’s choice. Though there’s no defined time frame, doctors say viability is sometime after 21 weeks.\nThe Associated Press declared the amendment was approved at 6:01 a.m. EST Wednesday.\nRepublican Ryan Zinke wins reelection to U.S. House in Montana’s 1st Congressional District\nRepublican Rep. Ryan Zinke won reelection to a U.S. House seat representing Montana on Wednesday.\nZinke will serve a second term in the western Montana district, which was drawn after the state received an additional congressional seat from the 2020 census. Zinke faced a rematch against Democrat Monica Tranel, who fell a few points short of winning the seat in 2022. Zinke was U.S. interior secretary in the Trump administration for nearly two years before resigning while facing several ethics investigations. Zinke served as Montana’s lone U.S. House member from 2015 through early 2017, when he resigned to become interior secretary. The Associated Press declared Zinke the winner at 6:28 a.m. EST.\nRepublican Tim Sheehy wins election to U.S. Senate from Montana, beating incumbent Jon Tester\nRepublican Tim Sheehy won the U.S. Senate seat in Montana on Wednesday, defeating three-term incumbent Jon Tester and flipping a closely watched Senate seat.\nTester was the only Democrat holding statewide office in Montana, which has voted for the Republican candidate in every presidential contest since 1992. Sheehy, a former U.S. Navy SEAL, ran as a Trump-supporting conservative in a state where the president-elect is immensely popular. The Associated Press declared Sheehy the winner at 6:26 a.m. EST.\nIn Kamala Harris’ ancestral village, disappointment\nThere was a sense of disappointment in Thulasendrapuram, a tiny village in southern India, where Kamala Harris’ mother’s family has ancestral ties and where people were rooting for the Democratic nominee for president.\nResidents in this village, who were keenly following the election results on their smartphones, were left silent as initial enthusiasm faded, even before the presidential race call, but many said they were proud that she put up a good fight. The villagers were hoping for a Harris victory and had Tuesday held special Hindu prayers for her at a local temple where Harris’ name is engraved in a list of donors. Some were also planning to blast off fireworks and distribute sweets had she won.\n“We are sad about it. But what can we do? It was in the hands of the voters of that country. They made Trump win. We can only wish Trump well for his victory,” said J. Sudhakar.\nAs results became clearer, a gaggle of reporters that was stationed outside the village temple also quickly scattered away. The village — site of a brief media spectacle and euphoria since Tuesday — became almost deserted.\nFIFA’s president congratulates Trump\n“We will have a great FIFA World Cup and a great FIFA Club World Cup in the United States of America! Football Unites the World” FIFA president Gianni Infantino wrote on his Instagram account in a message of congratulations to Trump.\nInfantino had tried to build close ties to the first Trump administration, making at least two visits to the White House and joining then-President Trump at a dinner event in Davos, Switzerland during the World Economic Forum in January 2020.\nThe United States will host most of the games at the 2026 World Cup in men’s soccer.\nInvestors react to Trump’s victory in US election by buying on the German stock market\nThe Dax rose significantly by 1.5% to 19,544 points in early Xetra trading, German news agency dpa agency reported.\nRobert Halver, Head of Capital Market Analysis at Baader Bank said that “since Donald Trump stands for the economy, it can be assumed that stock markets around the world will go up. With one exception: China, because he (Donald Trump) will definitely impose tariffs at least on China. That will certainly make life difficult for the Chinese.”\n“The nice thing is that European stocks, German stocks and export stocks can also benefit. Because we are still so well positioned in the industrial sector that we are helping America to become big again in the industrial sector, so to speak,” he added.\nNo info on whether Putin will congratulate Trump, Kremlin says\nAhead of the presidential race call, Kremlin spokesperson Dmitry Peskov said he had no information on whether Russian President Vladimir Putin plans to congratulate Donald Trump but emphasized that Moscow views the U.S. as an “unfriendly” country.\nPeskov reaffirmed the Kremlin’s claim that the U.S. support for Ukraine amounted to its involvement in the conflict, telling reporters: “Let’s not forget that we are talking about the unfriendly country that is both directly and indirectly involved in a war against our state.”\nAsked if Putin’s failure to congratulate Trump could hurt ties, Peskov responded that Russia-U.S. relations already are at the “lowest point in history,” adding that it will be up to the new U.S. leadership to change the situation. He noted Putin’s statements about Moscow’s readiness for a “constructive dialogue based on justice, equality and readiness to take mutual concerns into account.”\nPeskov noted Trump’s campaign statements about his intention to end wars, saying that “those were important statements, but now after the victory, while getting ready to enter the Oval Office or entering the Oval Office, statements could sometimes change.”\nControl of the US House is still up for grabs\nRepublicans have taken the White House and Senate, but the House is still very much in play.\nWith nearly 60 House elections still undecided, either party could gain control of the chamber. For Democrats, a House majority is the last hope of gaining a toehold in Washington and putting a check on Donald Trump’s power. Yet if Republicans win a House majority, they’ll be able to implement Trump’s agenda with more ease, including extending tax cuts, funding hardline border measures and dismantling parts of the federal government.\nStill, it might take some time before House control is decided. Neither party so far has a convincing advantage in the tally of key House races. There are tight races all over the country, including many in slow-counting California.\nTrump is elected the 47th president\nDonald Trump was elected the 47th president of the United States on Wednesday, an extraordinary comeback for a former president who refused to accept defeat four years ago, sparked a violent insurrection at the U.S. Capitol, was convicted of felony charges and survived two assassination attempts.\nWith a win in Wisconsin, Trump cleared the 270 electoral votes needed to clinch the presidency.\nThe victory validates his bare-knuckle approach to politics. He attacked his Democratic rival, Kamala Harris, in deeply personal — often misogynistic and racist — terms as he pushed an apocalyptic picture of a country overrun by violent migrants.\nThe coarse rhetoric, paired with an image of hypermasculinity, resonated with angry voters — particularly men — in a deeply polarized nation. As president, he’s vowed to pursue an agenda centered on dramatically reshaping the federal government and retribution against his perceived enemies.\nRepublican Mike Lawler wins reelection to U.S. House in New York’s 17th Congressional District\nRepublican Rep. Mike Lawler won reelection to a U.S. House seat representing New York on Wednesday.\nLawler is one of several Republicans who flipped traditionally Democratic New York districts in 2022. The 17th District contains the northern part of wealthy Westchester County and extends north and west to include suburban Rockland County and the Hudson Valley’s Putnam County. He defeated former Democratic Rep. Mondaire Jones, who lost his seat after redistricting in 2022. The Associated Press declared Lawler the winner at 5:30 a.m. EST.\nRace to control the House intensifies with Michigan flip\nRepublicans have flipped a House seat that was previously held by Democrats, giving them a valuable pickup in a frenzied race for House control.\nAt this point, practically every seat matters when it comes to building a House majority. In Michigan’s 7th district, Republican Tom Barrett picked up a seat that Democratic Rep. Elissa Slotkin vacated to run for U.S. Senate. Barrett, a former state senator, defeated another former state lawmaker, Democrat Curtis Hertel.\nOn the campaign trail, Barrett didn’t back away from his record of supporting abortion restrictions in the statehouse, but he also described abortion access as a settled issue in Michigan.\nZelenskyy says he appreciates Trump’s ‘peace through strength’ mentality\nUkrainian President Volodymyr Zelenskyy says he appreciates Trump’s commitment to “peace through strength” as the Republican presidential nominee closes in on the electoral votes needed to win the White House.\n“I recall our great meeting with President Trump back in September, when we discussed in detail the Ukraine-U.S. strategic partnership, the Victory Plan, and ways to put an end to Russian aggression against Ukraine,” said Zelenskyy on X. Zelenskyy said that Ukraine is interested “in developing mutually beneficial political and economic cooperation that will benefit both of our nations.”\n“We look forward to an era of a strong United States of America under President Trump’s decisive leadership,” said Zelenskyy.\n“I appreciate President Trump’s commitment to the ‘peace through strength’ approach in global affairs. This is exactly the principle that can practically bring just peace in Ukraine closer. I am hopeful that we will put it into action together,” he said.\nEuropean Commission president says she’s looking forward to working with Trump\nThe European Union’s top official says she’s looking forward to working with Trump again as the former president is on the cusp of victory in the U.S. presidential race.\nEuropean Commission President Ursula von der Leyen said that the E.U. and U.S. “are more than just allies. We are bound by a true partnership between our people, uniting 800 million citizens.”\n“Let us work together on a transatlantic partnership that continues to deliver for our citizens. Millions of jobs and billions in trade and investment on each side of the Atlantic depend on the dynamism and stability of our economic relationship,” she said in a statement.\nThe tariffs that Trump slapped on steel and aluminum exports during his last term roiled the bloc’s economy.\nMore World News\n- Slow start halts RocketsWHL - 10:30 pm\n- Seal lounging on rutterBC - 10:16 pm\n- Air Force, SAR team upNelson - 9:40 pm\n- Whimsical birdhouse makerSquamish - 9:30 pm\n- No injuries in house fireKelowna - 9:19 pm\nUnited Nations\nWorld Health Organization\nUNESCO\nWorld Trade Organization\nNATO\nEuropean Union\nThe Commonwealth\nFrancophonie\nOlympics\nGoogle Earth",
  "word_count": 5170,
  "scraped_at": "2026-02-14T13:18:23.954238"
}