{
  "article_id": "9292af0d91df",
  "url": "https://greatbendpost.com/posts/c463247d-02fb-46f4-a134-89f8440bba95",
  "title": "Several Factors Affecting Decline in Girls Basketball Participation",
  "date": "20260212T210000Z",
  "domain": "greatbendpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By TIM LEIGHTON AND JORDAN MOREY\nNFHS\nDuring her final three years at Flambeau (Wisconsin) High School, Beth (Alberson) Schmidt was on top of the girls basketball world. She was an integral part of Flambeau’s run of three consecutive Wisconsin Interscholastic Athletic Association Division 4 championships. She was coached by her Hall of Fame father and played in front of an adoring community that filled gymnasiums and arenas with unbridled enthusiasm and support.\n“Girls basketball was so alive; it was overpowering,” Schmidt said in an interview last month with High School Today. “When I left the high school game, I firmly believed that it would always be that way.”\nIt has not.\nSchmidt now sees girls basketball through the lens of Flambeau’s head coach. It is a troubling, frustrating view that has seen participation in girls basketball dip dramatically – not only in her community but across the nation.\nFrom 1979 to 2008, girls basketball was the top sport in participation for girls, according to NFHS Athletics Participation Survey data. In 2009, track and field took over the top spot.\nIn 2015, girls basketball slid to third behind track and field and volleyball, respectively, and, in 2022, soccer moved into the No. 3 spot and pushed basketball down one notch.\nNFHS survey data show that from 2000 to 2025, girls basketball participation declined by at least 21 percent nationwide, falling from 451,600 student-athletes across 16,526 schools to 356,240 athletes across 18,208 schools. During its three-peat championship run from 2006 to 2008, Flambeau, with a current enrollment of 147 students, had more than 30 participants in the girls basketball program. Fast forward to now, and Schmidt has 10 participants, all on the varsity squad.\nFacing a December 1 deadline to alert its conference for scheduling purposes, Schmidt was unsuccessful in her attempts to encourage other students to try basketball. Like many schools across the nation, the result was the cancellation of sub-varsity schedules.\n“It is heartbreaking,” said Schmidt, a business education teacher. “I was not successful at encouraging others. I won’t give up, though. Maybe girls thought I was going to be too tough on them as a coach. I think students know the history of our program but don’t necessarily feel it. I plan to get back into the gym with the littles and show them the positive path of girls basketball.”\nIn her travels through the school and community, Schmidt, a mother of her own “starting five,” sees signs that have contributed to the decline in girls basketball participation.\nAs she did when she was young, Schmidt doesn’t see girls constantly cradling a basketball, playing in driveways or initiating pickup games. She sees students seemingly forced into decisions about sports specialization at a young age and a world filled with what she calls “distractions.”\nIn the post-pandemic era, Schmidt said many families are maxed out on debt, putting more pressure on students to have jobs. Cellphones, clothing and other essentials once supported by parents, according to Schmidt, have become the responsibility of students.\nSchmidt understands those strains. She grew up on a dairy farm and was responsible for milking cows day and night. After school, practices and games, that responsibility was still waiting for her.\nDespite the staggering decline, Schmidt is committed to restoring the program’s strength and vibrancy in the community. She said the focus is on youth, working on fundamentals and reminding them that basketball is fun, rewarding and a positive, education- based experience.\n“Kids don’t need to make decisions in third grade about their playing future,” she said. “I think we are on the cliff; it is messy. But I also believe the pendulum will swing the other way. Our community is still here. We need to give them a reason to come back and rally around our efforts.”\nNational View\nParticipation in girls athletics is up overall, according to historical NFHS survey data, revealing that students aren’t leaving sports — good news by most measures.\nBut where are they going? The meteoric rise in girls wrestling, flag football and volleyball – both in schools and clubs – are natural assumptions. So, too, is softball, which has become a year-round sport.\n“The encouraging thing is that they’re not leaving sports, right?” said Monica Maxwell, an NFHS director of sports who oversees girls basketball. “We have more options, and we have more kids being active, doing something.”\nMaxwell said it has been a struggle to revive girls basketball participation numbers in the post-pandemic era, and the issue has become a common discussion point at national conferences.\nTime and money are increasingly being funneled into single- sport specialization, a trend that remains one of the key concerns surrounding girls basketball participation.\nAccording to the 2024 National Youth Sports Parent Survey by the Aspen Institute’s Project Play, 48 percent of parents said they feel some or a lot of pressure to have their child specialize in one sport, with 53 percent justifying that pressure because their child wants to play high school sports. The survey also found that 21 percent of parents report their child plays their “primary” sport nine to 12 months annually.\nDespite 58 percent of high school coaches encouraging their players to participate in multiple sports, many families are opting to focus their time and money on one, the survey found. The average U.S. sports family spent $1,016 on their child’s “primary” sport in 2024, which is a 46 percent increase compared to 2019.\nOne result of all the pressures to excel in one sport? Nearly 70 percent of kids quit organized sports by age 13, the American Academy of Pediatrics reported.\nAll of those factors have played into fewer girls playing basketball at the younger levels, and the topic of declining sub-varsity competition routinely comes up during national discussions.\n“I think more of the concern is at the developmental stage where you have the girls that are going from middle school, and then, because there’s not a JV team, they have to go straight to varsity, and they might not have that ability to play varsity ball,” said Sarah Hayes, associate commissioner with the South Carolina High School League and a member of the NFHS Basketball Rules Committee. “I think there’s a larger concern for the small number of JV girls teams, because the schools that have JV teams are like, ‘Who do we play?’ Some teams were only playing maybe five or six games in a season because a lot of schools around them are not fielding JV teams.”\nHayes’ view echoes what’s happening across the country — girls are dropping basketball at younger ages and not picking it back up in high school, even at historically strong programs.\n“We’ve been on this hill for a while now in Kansas,” said Jeremy Holaday, an assistant director with the Kansas State High School Activities Association. “We have perennial powerhouses that don’t even have enough participants for freshman teams and barely junior varsity.”\nFocusing on the middle and elementary school levels might be the key. “I think the focus is how do we gain their interest at that middle level so that we can, at least, get them excited about potentially growing into something special with their friends,” said Missy Smith, an Oregon School Activities Association (OSAA) assistant executive director. “Because at that age, when you’re 12- 13, you’re going to do what your friends do. I don’t think people are like, ‘Oh my gosh, we’re in a crisis,’ but the year-over-year declines are very concerning.”\nTo increase participation opportunities, the OSAA approved a rule last year for its smallest classification, permitting six quarters of combined play between junior varsity and varsity squads. The association’s other five classifications remain at five quarters.\n“We had heard that a lot of schools were playing only half a game for their sub-varsity teams because they wanted to make sure they had enough kids for the varsity game,” Smith said. “That has alleviated some of that so they’re getting to play more.”\nSmith also pointed to the pandemic-era growth of volleyball, both indoor and beach, at the club level. In the 2019-20 NFHS participation report, approximately 2,000 fewer students played girls basketball in Oregon.\nThe national surge in girls wrestling has also played a role, state association executives said. Girls wrestling topped 74,000 participants for the first time during the 2024-25 school year — a 15 percent increase from the previous year, and a record 40 sanctioned girls state wrestling championships were held nationwide.\n“I also really think that wrestling has done a number, in a great way,” Smith said. “All of a sudden, the skill set is new to everyone. It’s exciting. It’s something different. I think it pulled kids in that direction.”\nWhat is the Answer?\nIt appears the solution exists at the youth level. Minnesota- based Kevin Anderson, the longtime girls basketball historian for the Minnesota State High School League, has studied the rise in participation following the passage of Title IX and the recent decline.\nAnderson cited drops in youth participation around sixth and seventh grades, with another decline around ninth grade. Those dips, he said, are a prelude to what is happening at the high school level.\n“Across the nation, we need to encourage youth basketball to stay local at the younger grades,” he said. “There is no need to be in a traveling league in second or third grade. When players are told at that age that they won’t make the next level, that is disheartening. They take that message as basketball isn’t for you. That isn’t the messaging we want.”\nAnderson encouraged youth basketball leaders to take a general approach to coaching, emphasizing fundamentals, skill development and fun. Playing too many games too early can derail confidence.\n“At that age, you do not necessarily know who is going to grow,” Anderson said. “A successful coach, a successful organization, can be measured by how many players return the following year. This is fixable with the right approach at the targeted levels.”\nDanielle LaRoche King, athletic director at The Brearley School in New York City and former athletic director and wellness director at Ithaca High School, said officials, parents and coaches need to dial down the intensity at lower levels and focus on what matters most.\n“I think it’s really important for coaches to foster relationships with the players and foster relationships with each other for the team and have team building,” King said. “I think basketball may have gotten a little too intense for seventh- and eighth-graders, and the coaches are yelling and the parents are demanding. I think we should take it back a notch and make it a little bit more ‘come and let’s see your skill. Let’s have some fun.’\n“... Especially at the fifth-, sixth-, seventh- and eighth-grade levels, it’s not about scoring 30 points. It’s about learning the game, appreciating the game, and then once they’re hooked and you can really see the talent, that’s when they can accelerate and play club or play at a high level in high school. But for third through eighth grade, it should be an opportunity to build relationships with teammates and have fun. I would say the same thing about other sports. It’s not as fun because it has gotten so intense for students.”\nThe “Caitlin Clark Effect” is also viewed as a potential catalyst for renewed participation.\nJust more than a year ago, the Cedar Rapids (Iowa)-based Gazette reported a 38 percent decline in Iowa girls basketball participation since the 2007-08 school year. Clark played high school basketball at Dowling Catholic in West Des Moines before a celebrated collegiate career at the University of Iowa and now with the Indiana Fever of the WNBA.\n“It is going to come from the first-, second-, third-, fourth- and fifth-graders,” University of Iowa women’s basketball coach Jan Jensen told the Gazette. “It’s about the fundamentals . . . dribbling, pivoting, lowering the hoop so they can shoot the right way.”\nMaking connections with youth is also crucial.\n“There has to be the beginning of a relationship between the head coach and the younger kids, and it can’t just be summer camps,” Iowa Girls High School Athletic Union assistant coach Gary Ross told the Gazette. “The coach and the high school kids have to be connected with the younger kids.”\nTim Leighton is communications coordinator for the Minnesota State High School League and a member of the High School Today Publications Committee. Jordan Morey is manager of communications and media relations at the NFHS.",
  "word_count": 2089,
  "scraped_at": "2026-02-14T12:21:03.569601"
}