{
  "article_id": "9292aed3b544",
  "url": "https://www.cinemablend.com/streaming-news/how-to-watch-love-island-uk-online-and-stream-season-9-from-anywhere",
  "title": "How To Watch Love Island united kingdom Online And Stream The Winter Edition",
  "date": "20230110T210000Z",
  "domain": "cinemablend.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How To Watch Love Island UK Season 10 Online And Live Stream Last Episode From Anywhere\nThe final is tonight with our top four decided\nYour Daily Blend of Entertainment News\nYou are now subscribed\nYour newsletter sign-up was successful\nHow to watch Love Island UK Season 10\nWatch Love Island UK Season 10: preview\nEight weeks of taut, tanned twenty-somethings is drawing to a close following Love Island UK's return for its tenth season. Having crowned Kai and Sanam earlier in the year for the series' second winter instalment, another couple will be crowned the winners this summer with a £50k prize to split between them. Couple up with your TV screen this summer and make sure you know how to watch Love Island UK Season 10 online from anywhere.\nWith the final dates under our belts, many an 'L' bomb dropped, and couples becoming exclusive (whatever that means) left, right, and center, now it's time to find out who will be the winners of Love Island UK Season 10.\nWe bid farewell to Messy Mitch and Ella B, leaving our top four down to Whitney and Lochan, Ella and Tyrique, Jess and Sammy, and Molly and Zachariah. But only one couple can claim that £50,000 prize money.\nLight up that firepit and plump the Beach Hut pillows one more time. Find out all the details on how to watch Love Island UK Season 10 wherever you are below as another summer of love draws to a close.\nWatch Love Island UK Season 10 online in the UK\nI've got a text! Love Island UK officially touched down for its summer season on June 5 with new episodes are airing every night at 9pm BST on ITV2. That includes Saturday night Unseen Bits specials. Now in its final week, tune in and watch the final on Monday, July 31 at 9pm BST.\nITV2 is a free-to-air channel in the UK, though it requires a TV licence to watch live. However, you don't need one to watch catch-up TV, which you can do so via ITVX, ITV's on-demand streaming platform.\nSign up is free for an ITVX account. All you need is an email address and a UK postcode (e.g. B1A 1AA).\nYour Daily Blend of Entertainment News\nAbroad? Use a VPN using the instructions below to access ITVX back home\nHow to watch Love Island UK from anywhere\nIf you're a UK citizen on vacation or working overseas, you can still watch Love Island UK just as you would at home.\nWhile ITVX is for licence fee-paying Brits and blocks access from IP addresses outside of the UK, there's a handy piece of software called a VPN which can change your IP address to make it look like you're accessing streaming services from any country in the world.\nFor example, UK citizens in the States can subscribe to a VPN, join a UK based server and tune into all the programmes on ITVX from anywhere in the world, just like you would back home.\nWatch Love Island UK as if you were at home with a VPN\nOffering a 30-day money back guarantee, try out ExpressVPN, the best VPN for unblocking many of the major streaming services including ITVX and 9Now, and stream from any device, including your mobile or tablet, laptop, TV, or gaming console. Run into any problems? ExpressVPN has an excellent customer support team on hand 24/7.\nStep-by-step of using a VPN to unblock:\n1. Choose a VPN and install it - our go-to recommendation is ExpressVPN\n2. Connect to a server - for ITVX, for example, you'll want to connect to a server based in the UK\n3. Go to the live stream you wish to access - for Love Island, head to ITVX.\nWatch Love Island Season 10 in the US\nHulu has always been the casa for all things Love Island UK and Season 10 episodes have begun arriving on the Disney owned service earlier than usual, leaving the States just a couple of days behind like the rest of the world.\nTo watch Love Island UK on Hulu you only need its on-demand plan, starting from $7.99 a month (or $14.99 a month to ditch commercials). That's after a very generous 7-day Hulu free trial. Don't forget you can also bundle Hulu together with the House of Mouse service for a great value Disney Plus price of just $9.99 a month, too.\nRemember, if you're a Brit abroad, you can always port yourself back home and watch concurrent with the UK using a VPN.\nWatch Love Island UK Season 10 in Australia\nThose in Australia have always been well served for all islander action. New episodes of Love Island Season 10 will arrive on Channel 9's on-demand streaming service, 9Now on every day at 6pm AEST. Episodes began arriving on June 7, leaving Australia just a couple of days behind the UK schedule.\n100% free to use, watch Love Island UK through 9Now. All you need to do is sign up with your email and password.\nRemember, 9Now locks its content to Aussies only. So if you're from Down Under but away from home, you can simply sign up to a VPN to appear right back at home.\nWatch Love Island in New Zealand\nWant to watch Love Island UK in New Zealand? Love Island has found a new home for Kiwis. Previously arriving on Neon TV, which you have to pay for, you can now watch Love Island UK on free service, TVNZ+.\nJust a few days behind the UK schedule, episodes began to drop on TVNZ+ on June 7.\nSigning up is easy and 100% free to do. Simply pop in your details including an email address and password – no zip code required!\nWatch Love Island UK in Canada\nSadly, Canada hasn't had an official broadcaster for Love Island UK for the last few years. While you could once watch the latest recouplings and dumpings on CTV and Hayu, now there aren't any options for Canadians.\nOf course, if you're an American traveling north of the border but want to access Hulu back home, you can do so with a VPN (or equally if you're a Brit wanting to stream ITVX).\nEverything you need to know about Love Island UK Season 10\nWho are the Love Island UK Season 10 contestants?\n- Ruchee Gurung is a beautician, 24, from Sutton*\n- George Fensom is a business development executive, 24, from Bedford*\n- Catherine Agbaje is a commercial real estate agent, 22, from Dublin*\n- Mehdi Edno is a communications manager, 26, from Bordeaux*\n- Molly Marsh is a musical theater performer, 21, from Doncaster\n- Tyrique Hyde is a semi-professional footballer, 24, from Essex\n- Ella Thomas is a model, 23, from Glasgow\n- Mitchel Taylor is a gas engineer, 26, from Sheffield*\n- Jess Harding is a aesthetics practitioner, 22, from West London\n- André Furtado is a business owner, 21, from Dudley*\n- Zachariah Noble is a personal trainer, 25, from Lewisham\n- Whitney Adebayo is an entrepreneur, 25, from Camden Town\n- Sammy Root is project manager, 22, from Kent\n- Leah Taylor is a business owner, 27, from Manchester*\n- Charlotte Summer is a dental nurse, 30, from Bournemouth*\n- Scott van-der-Sluis is a footballer, 22, Wales*\n- Mal Nicol is a picture researcher, 25, from Edinburgh*\n- Montel McKenzie is an account manager, 25, from East London*\n- Kady McDermott is a former islander from Season 2, 27, from Hertfordshire*\n- Tink Reading is a project manager, 26, from Birmingham*\n- Gabby Jeffrey is a creative assistant, 24, from Tyneside*\n- Danielle Mazhindu is a recruitment assistant, 25, from Liverpool*\n- Amber Wise is a student, 19, from Buckinghamshire*\n- Abi Moores is a flight attendant, 25, from Hamphshire*\n- Benjamin Noel is a fitness business owner, 26, from London*\n- Lochan Nowacki is an account manager, 25, from Windsor\n- Elom Ahlijah-Wilson is a masseuse and fitness trainer, 22, from London*\n- Zachary Ashford is a senior sales executive, 27, from Manchester*\n- Ouzy See is a footballer and model, 28, from Edinburgh*\n- Kodie Murphy is a social media marketer, 20, from Birmingham*\n- Ella Barnes is a championship dancer and model, 23, from Kent*\n- Josh Brocklebank is a financial advisor, 26, from Essex*\n*islanders who have been dumped from the villa\nWho is currently in a couple on Love Island UK Season 10?\n- Sammy and Jess\n- Zachariah and Molly\n- Tyrique and Ella\n- Whitney and Lochan\nWant to find out what this year's gang is all about? Meet Season 10's islanders below:\nWho will host Love Island Season 10?\nAfter taking up the reins from Laura Whitmore earlier this year for the franchise's second and last winter iteration, Maya Jama will once again host Love Island UK Season 10. She proved very popular in her new role, with the much-loved narration of Scottish comedian, Iain Stirling, also returning for Season 10.\nWhere is Love Island UK Season 10 being filmed?\nFollowing a stint in South Africa for its winter series, Love Island UK will once again return to the familiar shores of Majorca for its instalment of steamy, hot summer romance.\nThe villa is near Sant Llorenc des Cardassar. This is the villa that was built for last year's season of the reality dating show and is the fourth villa to be constructed for the show.\nWhat has happened so far on Love Island UK Season 10?\nLove Island UK Season 10 launched on June 5 – and it sure kept us on our toes with plenty of explosive changes to its usual formula. Introduced in last summer's season, neither the boys or girls got to choose who they fancied coupling up with. Instead, the public voted on who should be paired up with who. In the launch, though, we saw the boys and girls mix early with Jess and Ruchee entering together, followed by Mitchel, André, and Ella.\nMaya Jama entered the villa to deliver the news islanders would neither be choosing who they coupled up with, nor would they be coupling up with anyone already in the villa. A shame, seeing as André had already been making eyes at Ella, and Jess seemed to be taking a fancy to gas engineer, Mitchel.\nLet the line-up commence. George and Jess formed the first couple. Molly matched Mitchel in her striking red bikini and ended up being coupled up with him, while Catherine and André formed the third couple. Ruchee didn't seem too pleased to be coupled with Frenchman Mehdi, while Ella and Tyrique's coupling up made for some awkward TV as the model insisted she had met the semi-professional footballer before in a club.\nSome couples seemed to hit it off immediately (Mitchel and Molly), others were already cooling off (Ruchee revealed Mehdi wasn't her usual type), and Tyrique was already making mad moves towards Catherine. What better way to build up tension than a game of beer pong.\nEnter the swaggering hips of Maya Jama, revealing the real dares were yet to come. Gathering around the firepit for the first time, Maya asked the girls to step forward who weren't happy in their couples. Both Jess and Ruchee took the plunge, rewarded with Season 10's first bombshell, personal trainer Zachariah, who was left to choose which girl he wished to swipe away from one of the boys. And it wasn't just the girls who stepped forward he was allowed to consider.\nZachariah had his grafting shoes on as he pulled all the girls individually for a chat in the 24 hours he was given to make his decision. While he named Ella, Ruchee, and Catherine as his top three, he ultimately chose to couple up with Catherine, leaving Andre vulnerable.\nRubbing salt in the wound, Zachariah and Catherine were immediately whisked off on their first date - though Andre can take some comfort that it was only sat on the terrace with some chocolate strawberries. Andre wasn't moping for long, though. The next day saw Andre receive a text to go on a date with the season's second bomshell, Whitney.\nA far more romantic set up, the two shared some fizz while overlooking the ocean. Seeming to hit it off, the wig business owner didn't seem to be able to move past the fact there was a four year difference between the pair with Andre just 21 to her 25. We've got tunnel vision for Andre and Ruchee's love story developing, anyway.\nBack in the villa, Jess was friend zoned by Tyrique, who then planted one on Ella - their first kiss outside of a challenge. Not the only one for firsts, Mitchel and Molly also shared a romantic moment on the terrace. While the pair might seem married off, though, a night of games sent everyone into a tailspin as Zachariah and Molly shared multiple, long kisses that put them both on each other's radar.\nIt certainly put Mitchel on edge – and it didn't get much better with the arrival of bombshell, Sammy, who asked three girls on a date. Situated in the Hideaway, Ella was first to go on a date, followed by Molly. Then, to the villa's and viewer's shared joy, Jess was the final girl to meet the project manager from Kent.\nThe episode also saw Molly getting upset hearing everyone felt she and Mitchel were closed off, assuming they were both on the same page that it was still early days. Mitchel wasn't best pleased to hear about this, explaining he had tunnel vision for Molly and that he would be taking a step back if she chose to keep her options open.\nWith the first recoupling ceremony of the season on the horizon, Molly seemed split between Sammy and Mitchel, with Jess prepared to save Mitchel if it came down to it. In the end, though, Molly chose to couple up with Mitchel, leaving Jess to swipe Sammy. Ultimately, the recoupling ceremony saw George not coupled up and subsequently was the first islander to be dumped from the island. Considering reports that previous flames had come out as saying George showed coercive behavior, could this have been producers meddling to get the unpopular boy out amid viewer complaints?\nThe recoupling ceremony also saw Whitney choose Mehdi and all our dreams come true with a Ruchee and Andre union – though Andre did later say his preference still lay with Catherine.\nSomething could very well be on the horizon for the pair that originally coupled up on day one, though, as Zachariah turns his head back to Molly and expresses an interest he'd still like to get to know her. In a challenge themed around bankers, rather than kissing Catherine who he was coupled up with, Zachariah planted one on Molly and left all islanders shocked by his muggy behavior. This lead to a pretty tense conversation at the all-denim party, in which he refused to apologize to Catherine.\nMolly and Zachariah didn’t stand much of a chance with the arrival of Charlotte and Leah. The two latest bombshells took three boys on a date, all three tasked with creating one dish for a three course dinner date. The girls both chose Mitchel, Zachariah, and Tyrique as their dates, while the rest of the islanders watched on from the terrace. Ella and Molly were particularly sour faced, with Molly securing a kiss with Zachariah on the terrace immediately after. Marking your territory, much?\nMeanwhile Mehdi and Whitney, having been taking it slow, went on their first date, with a connection blossoming on a tandem bike no less. Back in the villa, though, things were starting to prove frosty with Ella unhappy to see Tyrique having chats with new girl Leah.\nWhat better time to put a spanner in the works than a surprise recouping in which the boys will pick. Not before the new bombshells have had their say. While Leah chose Tyrique, Charlotte chose Zachariah. Ella and Ruchee were ultimately left single and vulnerable, with the safe islanders having to choose which girl to dump immediately from the island.\nElla's connection with Tyrique saw her saved by her fellow islanders, meaning Ruchee was the second islander to leave the villa. But was it worth it? Tyrique continued to get to know Leah, giving neither of them a straight answer on who he was leaning towards and leaving Ella absolutely seething. In fact, the couple may have called time after another fiery argument saw Ella kissing her teeth and strutting away from Tyrique.\nNot the only love triangle going on, Molly gave it to Mitchel straight that she was no longer interested in him – no matter how hard he pushed – and was seen muscling in on Zachariah and Charlotte's gym session like a spare part.\nFollowing a bit of a ball game, Jess was named 'Woman of the Match' and secured herself a date with a real life footballer, Scott, leaving Sammy a little bit jealous. Scott wasn't a bit of Jess, though. Instead, Jess and Sammy seemed to admit their feelings for one another were strong. He was still pulling Leah for chats, though.\nCrack on, pal, because apparently Tyrique has made a decision. Funny that, with the arrival of Scott. While Ella was back to smiling like a Cheshire Cat, it didn't stop her from informing Tyrique she'd like to get to know Scott. Safe to say Ty was not best pleased. But it looked as though Scott could be feeling Catherine with their shared connection of Dublin.\nA public vote left Zachariah, Sammy, and Andre vulnerable, alongside Catherine, Charlotte, and Leah, and the safe islanders were left to decide who would be dumped. The girls sent Andre home, while the boys chose Charlotte.\nWhile there were tears, Catherine quickly started getting to know Scott, with their fellow islanders also seeming to crack on in light of the close shave dumping. Medhi got his hands dirty and gave Whitney a full body massage, while Scott also chose to pull Ella for a chat, leaving her and Tyrique to come to blows again.\nAll seemed to be smoothed over very quickly, though, with a surprise daytime recoupling taking place that saw the two reunite. Molly and Zachariah also finally got to form a couple, with Scott ultimately choosing to couple up with Catherine. Mehdi chose Whitney though wasn't best pleased by her awkward laughter during his speech. Leah was also left upset after Sammy's speech about Jess referred to Leah as a 'small test'.\nAfter tearfully confiding in Molly, Leah chose to speak directly to Sammy about it, who quickly jumped on the defence. Meanwhile the girls let Jess know what exactly was going on, namely that he had maybe played down to Jess how much he had been flirting with Leah and pulling her for chats, only to not let her know he was focusing on Jess.\nUnfortunately, it was a huge bump in the road for Jess and Sammy, who came to blows multiple time with little resolution. To send a spanner in the works, in swaggered Maya Jama with another twist for Season 10, asking the islanders to vote in their couples. Ultimately the islanders voted for Jess and Sammy, and Leah and Mitchel. The two couples became single and were told they were unable to couple up with each other again in during the next recoupling. They also had the opportunity to go on dates with two new islanders, Montel and Mal.\nElsewhere, Mehdi and Whitney shared their first kiss and, of course, it was very...French. Go figure. Catherine and Scott also shared a smooch on the terrace.\nNever happy in paradise for long, a game of \"Never Have I Ever\" threatened to rock the boat with Molly and Zach as he admitted he had cheated on girlfriends multiple times. In his defence, he did say he was \"looking forward to when he was with a girl he didn't want to cheat on.\" Aw, so sweet. Molly seemed sedated anyway, especially following their roller-skating date.\nMedhi pulled Leah for a chat to let her know he was interested in getting to know her. To his credit, he also kept Whitney in the loop about this, but her walls instantly went up, unsure how he could continue to get to know her at the same pace as well as another girl. However, another recoupling ceremony saw new boy Montel sweep Leah from under Medhi's nose with girls picking the boys.\nNew girl Mal chose Sammy, with Jess looking unhappy from afar. Unable to recouple with him anyway, she chose to recouple with Mitchel. Otherwise, everyone stuck to the same couples with no big twists. Well, until the producers decided to throw in a Love Island alumni anyway.\nOriginally taking part in Season 2, the chaotic Kady McDermott walked into the villa as the next bombshell. And what a bombshell she was. Barely given 24 hours to get to know everyone, Kady was asked to choose who she wished to couple up. Surprise surprise, she chose Zach. Molly then received a text telling her as she was now single, she would be dumped from the island immediately. What a twist!\nNo time like the present for the heart rate challenge. The girls and the boys performed for each other endeavouring to get each other's heart rates up. While Mal gave it the paw, Medhi was getting up close and personal with four girls, leaving Whitney disrespected. Zachariah ultimately got the most girls' heart rates up, but the girls won the challenge overall. Obviously.\nWhitney and Medhi came to blows multiple times following his mad moves in the challenge, with Medhi showing some serious red flags as he told a calm and collected Whitney to calm down and not give him attitude. Meanwhile, Mal and Sammy shared their first kiss outside of a challenge and Zachariah seemed to quickly forget Molly as he got lost in Kady's blue, blue eyes.\nA text chimed in the villa and Ella and Tyrique went on the first date. Considering the boy had literally just told Ella he missed the game (and they've fought about whether or not they were closed off over and over again) no one was more surprised than us for Tyrique to announce his door was closed.\nThe pillowtalk was also flowing for Catherine and Scott as the pair admitted they were very focused on each other. Not all sunshine and rainbows, though. Zach pulled Kady for a chat on the terrace and got completely pied when he went in for a kiss. Awkward.\nIt's okay, though. The next day saw the return of the \"Kissing Challenge\" with Zach getting the only 'proper' kiss from Kady. Jess reigned supreme though, getting the highest overall score from the boys. In fact, Sammy, blindfolded, rated Jess the highest, the very definition of unfinished business. Good news for Jess because a public vote saw the least popular boy and girl dumped from the villa. Mal and Mehdi left, leaving Sammy and Whitney single.\nWhitney was left pretty devastated after struggling to let her walls down with Medhi, only for them to progress and then for him to leave the villa. That said, she was quick to bounce back (and so she should!), exploring connections between her and Zach following that kiss in the \"Heartrate Challenge\", as well as Montel.\nFirst though, the newly Whitney and Sammy must prepare a two course meal for the rest of the islanders to varying degrees of success (or not). Sammy did manage to get his flirt on with Jess though as he served her and Mitchel their dessert, with the door very much back open between the two after they were voted least compatible and forced to separate. Meanwhile, the conversation didn't appear to be quite flowing between Kady and Zachariah with Mitchel stirring up trouble as he told Kady Zachariah said he found her dry. Yikes.\nOf course, all this got back to Zach pretty sharpish and he and Mitchel had it out. Once again, Mitchel squirmed like the shit stirrer that he proves to be time and time again. As if that wasn't enough, as the singletons of the island, Whitney and Sammy were able to choose someone to take on a date. Kady was left overjoyed when Whitney picked Zach, while Sammy chose Jess. Their date ended with a kiss, while Zach admitted to Ty that conversation flowed more easily with Whitney than Kady.\nIslanders had also been gossiping about Catherine and Scott once again, leaving Scott seething that people weren't perceiving his feelings as genuine for Catherine. He had it out with the whole villa by the fire pit, which also led to a conversation between Kady and Whitney, as Kady felt she was out of the loop in regards to any feelings Whitney had towards Zach. With the air somewhat clear, what better time than now to open the doors to Casa Amor.\nWith a intimate performance with international star Ne-Yo, he then took the girls out the front under the guise of getting a photo with them. Popping them into a car, they went off to Casa Amor and left the boys behind.\nA nice touch in Season 10 saw Casa Amor just a stone's throw away from the main villa, allowing the boys to hear their excitable screaming as they arrived. Soon the Casa Amor bombshells joined the girls, including Ouzy who Ella already knew from a modelling job they did together prior to coming into the villa. Interesting, considering her and Tyrique are the only couple who've said their fully closed off.\nThe boys had to wait until the following day to meet the girl Casa bombshells and were surprised with the return of Molly alongside five new girls. Zach was left speechless, unable to defend himself as Molly seethed over the mad moves she had witnessed on TV after she'd left, having outwardly said she would be waiting for him.\nThe Casa Amor drama didn't stop there. Catherine has been getting pretty close with Elom. In fact, the pair shared a kiss in broad daylight! She'd barely even finished her breakfast. Mitchel and Abi bonded over their love of a good air fryer, and Lochan and Leah talked about their favorite dog breeds.\nCatherine wasn't the only one lips'ing with Sammy planting one on both Amber and Gabby with only minutes in between the two. In his defence, he's just trying to figure things out... The terrace also saw plenty of action (standard) with Mitchel and Abi sharing a kiss. Montel also shared a kiss with Tink, which he said he regretted. But there was an awful lot of cover movement later on in the bedroom.\nAll good things must come to an end though with the most explosive post-Casa Amor recoupling ever. The biggest shockers were Catherine returning with Elom, leaving Scott single and bitter. Kady also got a lovely surprise with the return of Molly, who Zachariah chose to recouple up with. Montel tried to cover his tracks and remain with Leah, but Tinks wasn't having any of it. And the biggest shocker of them all – Ella returned hand-in-hand with Ouzy, leaving Tyrique heartbroken.\nWhile Ty initially said they were done, and chose to flirt with Kady, endeavoring to make Ella jealous, the two ended up making up with Ella dead'ing it with Ouzy. Ouzy subsequently came a little bit out of his shell and started moving in on Kady. Sammy, after some pressure from Jess, called it off with Amber in an effort to show Jess he wanted to give her 100%.\nEnter Movie Night... Not so much the two kisses shared with Amber and Gabby in Casa Amor, Jess was more upset to see Sammy tell Mal he had more feelings for her in the space of three days than he did the weeks he'd known Jess. No longer in the villa, yet Mal is still causing a spanner in the works between the pair.\nLeah and Montel also haven't recovered from Montel's Casa Amor antics with Movie Night rubbing salt into the wound. Snaky behavior from Mitchel didn't go down well with the boys either, while Ty egging on the boys in Casa left a bitter taste in the girls' mouths. The boys also weren't particularly happy with Mitchel, who's clip showed some particularly snaky behavior.\nFollowing Scott's bust up with Leah on Movie Night after she claimed none of the girls were interested in Scott during Casa, the Welshmen made his moves on Abi, with Mitchel remaining as cool as a cucumber – especially after their paddle-boarding date.\nMeanwhile, Montel did a big romantic gesture to apologize and win back Leah's heart, gathering all islanders around as he confessed his feelings from the terrace.\nWith Jess and Sammy all made up, a recoupling ceremony couldn't come soon enough, allowing the pair to once again share a bed, with Sammy declaring in his speech he'd like to be exclusive with her. They weren't the only lovebird, with Tyrique and Ella recoupling, too. Whitney and Lochan also appear to be on the right track, along with Catherine and Elom. Kady and Ouzy formed a couple, too, with the pair appearing to hit it off after Ella returned to Ty.\nA public vote once sent shockwaves through the villa, though, as they were asked to vote on the most compatible couple. Receiving a text, Whitney revealed Catherine and Elom received the least amount of votes and were being dumped immediately. Waving them off, another text chimed through the villa, revealing Leah and Montel, Jess and Sammy, and Kady and Ouzy were also at risk of being dumped, with Leah and Montel ultimately vacating the villa.\nAnother curveball saw the arrival of two new bombshells, Ella B and Josh. Turns out Ella B knew Tyrique from pre-villa life and had her eyes on the now officially closed off footballer. Her 'Battle of the Ella's' vision was pretty short-lived though, with both Ty and Ella T cutting her down a peg or two.\nInitially having a date with Mitch, while Josh tried to pursue Jess, with all doors closed to Ty, Ella B kept her sights set on Mitch, who was all too happy to get to know yet another bombshell. This left Abi feeling pretty mugged off after she'd deaded things with Scott in order to put all her eggs in Mitch's basket.\nA recoupling saw Ella B swipe Mitch away, while Josh stole Jess away from Sammy, right as the pair were getting back on track. Very quickly, though, Jess said all eyes were on Sammy, leaving Josh to try (and fail) to connect with Amber, who opted for the day bed over sleeping next to him following the week's second recoupling.\nNow branded Muggy Mitch, the boy was moving mad between Ella B and Abi, telling them both what they wanted to hear, not remembering that girls talk. Enter a game of 'Snog, Marry, Pie', which saw Mitch receive a whole lot of pies. Other notable moves in the game saw Zach and Kady lock lips twice, causing a significant crack between the seemingly unbreakable Molly and Zach.\nWhat better timing than a VIP party with special guest Rita Ora. Performing a few of her classics including 'Anywhere' and grabbing a quick selfie with the islanders, they were then in for a rude awakening with the arrival of Maya Jama. Revealing the results of the public vote in which viewers were asked to vote for their favorite couple, in a fun twist Maya Jama first announced the winners of the vote and our favorite couple – Queen Whitney and King Lochan.\nThe couple with the least votes and therefore dumped immediately from the island was Amber and Josh. Kady and Ouzy and Mitchel and Ella B were revealed to be in the bottom, too, with Whitney and Lochan ultimately left to choose who would go home. In the end, they chose to save Mitchel and Ella B, wanting to give the fairly new couple a chance to blossom.\nNot all seemed to agree with Whitney and Lochan's choice, leading to more arguments between Abi, Mitchel, and Ella B, the former of which is adamant she no longer has feelings for Mitchel, even though everyone keeps telling her she does...\nThe drama of the night before seemed to be mostly smoothed over as Molly and Zachariah finally made up – but not before Molly got annoyed that Zach was giving her space after she...asked for space. In less confusing news, Ty told Ella he loved her for the first time, and it was very cute.\nAs ever, producers threw a potential spanner in the works with the Honesty Challenge. Some of the most standout results were that Ella and Ty received the most votes for being the most attention seeking couple, while Whitney and Lochan were deemed the most smug. Who wouldn't be after finding out they were the publics fave?\nUnfortunately this lead to a huge argument between our girls Whitney and Ella, with Whitney calling Ella selfish, upset that Ella had deemed her smug inside the challenge, but never said otherwise outside of a challenge. She was also pretty annoyed that Ella took showers before everyone else. Trying to fix a broken friendship, the two went on a friends date, but things didn't seem to improve. After some time out, though, the girls later reunited in the evening.\nAfter a night in the Hideaway, Sammy asked Jess to be his girlfriend. That's before meeting the family, with parents, siblings, and besties arriving in the villa the following day. A great time for Scott to decide he might not be feeling things with Abi due to him being a slow burner... We've heard that one before.\nWith one week to go, the islanders showed off their talents in the annual 'Love Island Talent Show'.\nNo shortage of drama, we were then treated to a new Love Island instalment called 'The Grafties'. Not unlike 'Movie Night' clips were certainly rolled with awards up for grabs including 'Mad Moves' and 'Most Snakey'. There was a whole lot of drama that stemmed from the night, namely between Abi and Mitchel, and subsequently Mitchel and Scott. It was mostly ironed out, though unfortunately Mitchel's was never going to be put in his place, proved right when Scott ultimately dead'd it with Abi.\nFollowing a public vote on the most compatible couple, Abi and Scott, Mitchel and Ella B, and Molly and Zachariah ended up in the bottom three, with Abi and Scott ultimately sent home with safe islanders having to choose who to dump.\nFollowing the dumping, Molly received a text announcing the remaining couples would go on their final dates. The twist? At the end of their dates they would have to choose a couple they deemed least compatible, with whoever received the most votes at risk of being dumped before the Love Island final.\nWe suspect Mitchel and Ella B could be on the way out, especially with Mitch shooting himself in the foot by telling the boys he felt Ella B was fake. Uh...Messy Mitch is back, then.\nWell, Mitch and Ella B were the first to go on their final dates with a very early wake up call – and Mitch seemed to have forgot all about thinking Ella B was fake the night before... Uh... Having a romantic breakfast in a stunning lagoon, accompanied by a cellist, the pair decided to be exclusive, and voted Whitney and Lochan as least compatible.\nNext to go on their dates were Molly and Zach. Not sure how the final date dream fit into Zach's preferences, but the pair went to a Barbie dream house vibe villa with flamingo floaties, and pink everything. While eating sushi, Zach told Molly he loved her and it was all very, very sweet. They voted for Mitchel and Ella B as least compatible, alongside Ty and Ella, and Sammy and Jess.\nTy and Ella went on a romantic candlelit dinner with dancer and ended up joining Sammy and Jess in the 'boyfriend girlfriend' club. Meanwhile, back in the villa, Whitney informed Ella B of Mitch's 'fake' comments before he had a chance to discuss it with her himself. Well, he did have an entire date in which to bring it up...\nElla B was left very upset, of course, with Mitchel downplaying his comments and pushing that he'd only said 'it was too good to be true'. Roll the tapes, babes. It's all good, though, because they're almost definitely being voted out ahead of the final, right?!\nWhitney and Lochan went on a yacht for their final date (it's giving bougie) with the pair ready to take it to the next step, although we'll admit we're not sure what that 'next step' was actually clarified as.\nJess and Sammy also had a romantic dinner with some ballroom dancing, though Jess claimed Sammy had no rhythm. While no 'L' bombs were dropped, the two are already in a relationship and discussed future plans, including ditching the fake nails and going travelling.\nWith only two more episodes to go (including the final), Sports Day is on the way, as well as the reveal of the islander's votes on which couple is least compatible.\nAlice is CinemaBlend's resident eCommerce Editor, here to tell you about the best streaming services like Disney Plus and Apple TV Plus, and how to watch the hottest TV shows and movies. Begrudging Love Island fan and always thrilled about the latest book to screen adaptation. With six years experience in the commercial writing space, Alice has been writing about consumer tech and software for 4 years, previously writing for Trusted Reviews before joining the Future family.",
  "word_count": 6333,
  "scraped_at": "2026-02-14T13:35:07.923580"
}