{
  "article_id": "92ba51c00558",
  "url": "https://www.justarsenal.com/beth-mead-says-the-england-women-should-be-proud-despite-final-defeat/347255",
  "title": "Beth Mead says the Lionesses should be proud despite Final defeat",
  "date": "20230825T161500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When the England Lionesses return to feature in other competitions like the UEFA Women’s Nations League, the Women’s EUROS, or even the next Women’s World Cup, Arsenal Women’s forward Beth Mead wants to be part of that England team, as she believes she can fire them to glory as she did in the Euros in 2022.\nAfter years of dreaming of silverware, the Lionesses last year tested their glory by lifting the Women’s Euros. Under Sarina Wiegman’s guidance, they were excellent. One player who stood out in that competition was Beth Mead. Her goals fired England to glory; she was scoring left, right, and centre. She scored six goals in six games and provided six assists; she was Euro 2022’s best player after winning the Golden Boot award.\nI’m convinced England would have had a better chance of beating Spain in the final if they had her in their World Cup squad; however, an ACL injury she picked up versus Manchester United in a WSL clash last November saw her sidelined for months, and she was unable to be fit in time to make it to this year’s elite competition. Like many, she’s disappointed her Lionesses teammates didn’t win the World Cup; however, she is proud of their achievement, and she promises to be back with a bang to help them win other competitions they are to participate in.\nAs quoted by the Mirror, she said, “I’m super proud of how the Lionesses have done throughout this tournament. They’ve gone through adversity, injury, and formation changes and still got themselves to a World Cup final.\n“I know they’ll be feeling heavy-hearted, disheartened, and disappointed right now, but I know when the dust settles, they’ll be super proud of what they’ve done, and I’m certainly right behind them in being super, super proud.\n“They’re just incredible humans and a pleasure to watch and follow. Fingers crossed. I come back into the set-up at some point, and we have lots more trophies and a lot more to show come from this Lionesses team.\n“I’m looking forward to getting involved, getting amongst it all, and hopefully winning some more trophies in the near future.”\nHearing such claims from her should be comforting to the Gooners, as before she goes on to shine on the international stage, she would have to have dazzled game after game in club football with Arsenal.\nCOYGW!\nMichelle Maxwell\nFollow Michelle on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 429,
  "scraped_at": "2026-02-14T13:04:08.181680"
}