{
  "article_id": "92cbaf6f38e2",
  "url": "https://www.mirror.co.uk/news/world-news/world-cup-finalists-iran-targeting-36672747",
  "title": "Footballers  killed and targeted in Iran  ahead of FIFA World Cup",
  "date": "20260208T161500Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EXCLUSIVE: Footballers 'killed and targeted in Iran' ahead of FIFA World Cup\nFIFA urged to step in as 2026 World Cup finals qualifiers Iran accused of deliberately targeting football players in recent protests\nFootball players in Iran - who have qualified for this year’s World Cup finals - are being deliberately targeted and killed, it was claimed. There are now demands that FIFA must step in immediately to put pressure on authorities to stop further bloodshed.\nAnd there is desperate concern over two players in particular who are currently being held in Iranian jails. They both face the death penalty.\nAmir Ghaderzadeh, is a 19-year-old striker for top-flight club Sepahan Isfahan. And Mohammed Hossein Hosseini, a 26-year-old player who used to turnout for Persepolis, but was banned from playing by the Iranian authorities after taking part in protests.\nThe pair have become symbols for a generation of footballers and sports athletes that are falling victim to the brutal regime of Iran. University research fellow in sports and social sustainability, Zohreh Abdollahkhani, told the Mirror: “They are at imminent risk of execution.\n\"It is nothing new that the Islamic Republic is killing Iranian football players but the numbers, the level of brutality and their age group has been unprecedented. We are talking about 19-year-old kids.” Abdollahkhani, who is based at the University of South-Eastern Norway, has urged FIFA to intervene.\nHe said: “Several of our prominent football figures have written to FIFA about the case, but no reply - nothing from FIFPro either. These organisations have to say something about the cases. \"Their whole legitimacy rests on being the voice of the athletes at risk. FIFA have a responsibility. You cannot act like nothing is happening in your football community in Iran.\n“They are accountable. FIFA are going against their own statutes. Even the lowest possible commitment that FIFA have claimed is not met by FIFA itself.”\nThe Iranian authorities have also been targeting football players and officials. In January, Rebin Moradi, a youth player of Saipa FC, was shot dead in Tehran at the age of 17.\nThe list of casualties also includes Saba Rashtian, a women’s football assistant referee, and Mohammad Hajipour, a goalkeeper for Iran’s beach soccer team.\nOmid Ravankhah, the manager of Iran's U-23 team, had his passport revoked when entering Iran. Ravankhah was outspoken and his side refused to sing the national anthem at the recent U-23 Asian Cup in Saudi Arabia. His whereabouts are unknown. Some former Iran internationals, led by Ali Karimi, former Asian player of the year and Bayern Munich star, have out spoken out against the repression.\nIn a letter addressed to FIFA, they wrote: “Football, as the most influential social phenomenon in the world, cannot and must not remain silent in the face of executions, killings, arbitrary arrests, and threats against athletes.” Anti government protests exploded in Iran at the end of last year and some estimates said up to 30,000 people were killed.\nThe Iranian authorities admit 3,117 people were killed but outside agencies fear the death toll could be ten times higher.The demonstrations started with shopkeepers in Tehran complaining about huge inflation increases. But they quickly spread across the country and the government ordered a complete internet blackout.\nFIFA was approached for comment.",
  "word_count": 544,
  "scraped_at": "2026-02-14T12:38:11.125762"
}