{
  "article_id": "930c6b772ed0",
  "url": "https://www.nzz.ch/english/un-soldiers-in-lebanon-are-powerless-between-the-fronts-ld.1840839",
  "title": "U . N . soldiers in Lebanon are powerless between the fronts",
  "date": "20240726T073000Z",
  "domain": "nzz.ch",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In southern Lebanon, the U.N. peacekeeping force is powerless between the fronts\nThe border war between Israel and Hezbollah is heading toward an escalation – despite the fact that the United Nations was actually supposed to secure peace in southern Lebanon. Can they still achieve anything at all? On the road with the Blue Helmets.\nIt's half past eight in the morning, but the sun is already beating down mercilessly on the hills of southern Lebanon. At the headquarters of the Italian U.N. soldiers in Chamaa, three armored jeeps are ready for patrols. They are just waiting for the escort vehicles from the Lebanese army, one of the officers tells us. «It's about to start.»\nAntonio is at the wheel of one of the cars, with Luigi next to him. The two soldiers are from Naples. Just a few days ago, Italy was knocked out of the European Football Championship by Switzerland. «Well you know, we just played like crap,» says Antonio, shrugging his shoulders. Then he starts the engine.\nIn the meantime, two Lebanese army personnel carriers have arrived in front of the gate. The Italians join them. Then the convoy rolls off, over country roads and rolling hills, through villages and hamlets, into the immediate border area between Israel and Lebanon, where the most dangerous war in the Middle East is currently raging.\nUNIFIL has faced repeated criticism\nFor months, Israel's army and Hezbollah – the heavily armed, Iranian-backed Shia militia that started a border war with the Israelis last October in support of Hamas in Gaza – have been firing at each other here. Since then, bombs have been raining down on villages and fields in Lebanon. And across the border, in Israel, rockets and drones are hitting kibbutzim and army bases.\nIt is ghostly kind of war, waged by remote control. There are no Hezbollah positions or fighters to be seen anywhere. The only military personnel visible on the streets are the soldiers belonging to UNIFIL – the United Nations Interim Force in Lebanon. These troops, which include Antonio and Luigi, were supposed to keep the peace. But that is an almost impossible undertaking.\nThe approximately 10,000 men and women from over 40 countries who serve with UNIFIL are not only caught in the crossfire themselves. They also cannot do anything against the Israeli army or Hezbollah. Accordingly, the troops, which have been stationed here since 1978 and massively increased in size after the last war between Israel and Hezbollah in 2006, have repeatedly faced harsh criticism.\nTheir mission failed, critics claim, because the U.N. soldiers did not succeed in keeping Hezbollah away from the border and preventing the war. Both Israelis and Lebanese often accuse the Blue Helmets of being biased. Occasionally, their soldiers have even been attacked – most recently in 2022, when an angry mob killed an Irish soldier in southern Lebanon.\nThe real power lies with Hezbollah\n«We're soldiers, and we do our duty,» says Antonio as he steers the jeep along an empty road. A short time later, the convoy reaches the village of Yarine – or what is left of it. The vehicles stop, and the soldiers get out. Destroyed houses line the road on both sides. A Qatari television team, which is also accompanying the patrol, film some of the destruction.\nOfficially, UNIFIL is not only supposed to monitor the situation on the border and report any violations of the 2006 cease fire – but also to help the Lebanese army to gain control of the border area. But the soldiers of the weak Beirut army have hardly any say here. The real power in the Shiite-majority south lies with Hezbollah.\n«Nevertheless, it is important that we are there,» says UNIFIL spokesperson Andrea Tenenti a few days later at a meeting in Beirut. Despite the fierce fighting, his troops carry out up to 450 missions every day, he says. «We patrol on our own or together with the Lebanese army. And we try to support the population.»\nMany of the inhabitants of villages in the south have fled because of the war. They are staying with relatives or in makeshift shelters, such as a school in the southern Lebanese coastal town of Sur, which lies on the other side of the combat zone. The Blue Helmets supply the civilians there with food and medicine at irregular intervals.\nSuddenly the alarm goes off\nThe refugees are friendly toward the peacekeeping force. «At least the U.N. soldiers take care of us,» says a field worker called Hasan, who fled to Sur from the destroyed border village of Ramyah. «Unlike the state, which completely left us hanging.» Hasan, who only wants to give his first name, has had enough of the war after more than 10 months. Like all displaced families, Hezbollah pays him $200 a month in support money, he says. «But that's not enough for my 11 children.»\nHezbollah is invisible and omnipresent at the same time, despite the fact that the U.N. Security Council adopted Resolution 1701 after the war in 2006 – when the U.N. mission, which had been rather weak until then, was increased. It stipulated that Hezbollah must vacate the south of Lebanon and surrender its weapons. But the resolution was never implemented. Instead, the Shia militia has become ever stronger and has even expanded its positions in the border zone despite UNIFIL’s presence.\n«We do not have the mandate to disarm Hezbollah,» says UNIFIL spokesperson Tenenti. «Our task is to support the Lebanese army.» The Blue Helmets have narrow limits. They may only use their weapons for self-defense or to protect the population. House searches are prohibited, and they are not allowed to enter private property. So they have little choice but to continue patrolling and reporting in the midst of adverse circumstances.\nBut even this is becoming increasingly difficult. When the small convoy arrives at the base of a unit from Ghana close to the border around midday, the alarm suddenly goes off. Fighting has broken out again along the Blue Line – the official name of the provisional border between Israel and Lebanon. The Italians are stuck at the Ghanaian post for over six hours.\nEven the turtles have a bunker\nMeanwhile, Hezbollah and the Israelis are firing at each other in the surrounding hills. First smoke rises from the Israeli side of the border. A little later, Lebanon is struck as well. White stripes appear in the sky. Shortly afterward, fires break out on the hills. The Ghanaian officers observe the scene from a watchtower. «That looks like phosphorus,» says Divine Asorkor, one of the soldiers. The soldiers are not allowed to go there and check the attacks.\nDuring the so-called alert level 2, they are not allowed to leave their bases. At alert level 3, the Blue Helmets have to go into their bunkers. «It was terrifying at first. We've got used to it by now,» say the Ghanaians as they show us the cramped shelters. Today, they can at least stay in their barracks, where there is coffee and Ghanaian food. A replay of the European Championship match between France and Portugal is on TV.\nThe situation calms down in the late afternoon. The patrol can continue. The jeeps struggle along dirt tracks along the border line. A few meters away is a high concrete wall, behind which Israel begins.\nBase 131, a small Italian observation post, is located right next to the border wall, where platoon leader Omar al-Gohary is holding out with around 30 soldiers. The post is often hit by splinters and ricochets, the officer tells us. «We spend hours in our bunkers because of that.» The soldiers have even built a small shelter for the turtles they keep as mascots.\n«We can only do what our mandate allows us to do»\nDespite the shelling, the U.N. soldiers have not considered vacating their post. However, should the war escalate, this would probably be unavoidable. «We are always prepared for that,» says Gohary. He doesn't want to reveal any more. Contingency plans are in place for all scenarios, says Tenenti, the UNIFIL spokesperson.\nHe expects UNIFIL to remain in South Lebanon despite all the difficulties. «Before the fighting began in October, we helped a lot to calm things down,» says Tenenti. They held regular meetings between Israeli and Lebanese soldiers and marked the borders, he tells us. «It was relatively quiet here for 17 years, despite the fact that the two countries have technically been at war since 1948.»\nThis is another reason why UNIFIL plays a role in any future plans. Behind the scenes, the U.S. is currently trying to mediate between Israel and Hezbollah. In the process, they are once again discussing the expansion of the Blue Helmet mission in southern Lebanon. Once again, it is supposed to ensure that a possible cease fire agreement is respected – and monitor a possible withdrawal of Hizbullah.\nBut how can they succeed in the future where they have failed in the past? These are questions that politicians need to answer, says Tenenti. «We can only do what our mandate allows us to do.» It is unlikely that the U.N. Security Council – where the Americans, Europeans, Russians and Chinese are currently irreconcilably opposed to each other – will be able to agree on a more robust mandate for the U.N. force. Similarly, countries such as Italy, Spain or Ghana are unlikely to want to deploy their troops against Hezbollah.\nThe last patrol\nBy now it is early evening and the Italian patrol is on its way home. Antonio and Luigi drive their jeep along a gravel road. At some point, the Mediterranean Sea comes into view. It shines like a silver cloth in the light of the setting sun. For the Italians, this is their last patrol. They will be replaced in a few days.\nAntonio is going on vacation with his mother, he says, to Greece. When asked if he likes Lebanon, he says he doesn't really know – after all, he has hardly ever been outside the south. But the country seems to be a beautiful place, he adds, despite all its problems. «I want to come back here one day,» says Antonio. «But not as a soldier, as a tourist.»\nFor more articles in English, visit our homepage or sign up for our free newsletter.\nLatest articles\nBelow, you’ll find links to a selection of our free content. If you’d like access to all of our premium content via the full version of our newsletter, please upgrade here.\nGlobal reporting. Swiss-quality journalism.\nIn today’s increasingly polarized media market, the Switzerland-based NZZ offers a critical and fact-based outside view. We are not in the breaking-news business. We offer thoughtful, well-researched stories and analyses that go behind the headlines to explain relevant events in the U.S., in Europe and worldwide. To produce this work, the NZZ maintains an industry-leading network of expert reporters around the globe who work closely with our main newsroom in Zurich.\nSign up for our free newsletter or follow us on Twitter, Facebook or WhatsApp.",
  "word_count": 1852,
  "scraped_at": "2026-02-14T12:09:34.571447"
}