{
  "article_id": "930c8d01cdc4",
  "url": "https://www.sconeadvocate.com.au/story/8793641/olivia-higgins-balancing-jillaroos-debut-and-teaching/?cs=305",
  "title": "Olivia Higgins : Balancing Jillaroos debut and teaching | The Scone Advocate",
  "date": "20241018T010000Z",
  "domain": "sconeadvocate.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Olivia Higgins' first phone call after being named in the Jillaroos squad last week was to dad Craig.\nSubscribe now for unlimited access.\nor signup to continue reading\nOne of the next calls was to her primary employer, requesting four weeks of leave to represent Australia in the women's rugby league Pacific Championships.\nThe home-grown Knights hooker planned to be back at Newcastle High School, where she works full-time on a temporary contract as a PE teacher in the support unit, this week.\nHiggins is poised to make her international debut alongside Knights teammates Yasmin Clydsdale and Tamika Upton in Brisbane on Friday night after being named in the No.14 jersey for Australia's opener against Papua New Guinea.\nThe moment will cap a pleasantly unexpected five-month period for the 32-year-old, who made her State of Origin debut for NSW in May and is thrilled to earn a national call-up after a strong NRLW campaign.\nBut representative honours for NRLW players also come with sacrifices.\n\"I've been trying to work out what leave I need to take and let my principal know that I'm going to be away after already having so much time off this year,\" Higgins told the Newcastle Herald before heading into Jillaroos camp.\n\"You almost feel a little bit guilty but then you have to be a bit selfish as well because it's not an opportunity that comes around often.\n\"My school are unbelievable. My principal is so supportive and lets me do what I need to do.\n\"But it is hard for a lot of girls, even in the Jillaroos because we do have to sort out work and some of that is leave without pay, which is hard because you're not paid instantly for footy either. It comes after the tournament, so there's things you need to sort out there.\"\nLeave without pay to play\nNRL and NRLW players in national squads for the Pacific Championships will be paid $3000 per week.\nIt's not a matter of equality, says Rugby League Players Association (RLPA) general manager of player and football operations James Buhrer, but one of financial vulnerability.\nThe minimum wage for an NRLW player rose from $30,000 in 2023 to $34,000 this year for a 20-week season. It is set to rise each year until $50,600 in 2027.\nIt means most players have other jobs to supplement an NRLW income.\n\"While there is equal payments, the difference between the female athletes and the male athletes is the overwhelming majority of all female athletes playing in the Pacific Championships would be taking leave and most likely leave without pay, just because most of them have likely run dry of paid leave,\" Buhrer said\n\"So, while there's equal payments and the players are incredibly appreciative of having the opportunity to represent their nation, it's important to acknowledge that there is a sacrifice still there. While they are representing their nation, they're putting the international game up in lights and continuing the growth of the game.\n\"What it does do is it puts them in pretty insecure work situations because not all employers are happy to provide leave without pay, having that inconsistency of having someone there.\"\nBuhrer said taking leave without pay was not an isolated international issue.\nScheduling of NRLW matches on Thursday nights and Saturday mornings this season often meant players were taking leave in the protected weekday hours of 8am to 4pm for travel and preparation.\n\"Recently we worked through this with the NRL and pleasingly we got agreement on per diems for the Thursday night matches,\" Buhrer said.\n\"So, any of the Thursday night matches that took place this year, players that had to take that Thursday off work and were out of pocket by result would receive per diem in that amount to cover it.\n\"We believe, realistically moving forward, that's got to be the standard until they're full-time athletes, until they're being paid full-time.\"\nPlayers' commitments are set to increase next year with the NRLW expanding from 10 teams to 12.\nWomen's sport has boomed in the past five to 10 years with the introduction of NRLW, AFLW and WBBL in cricket.\nBefore all of those began, the A-League Women (ALW) was established in 2008.\nBuying the boots\nThe national women's soccer competition was once a global front-runner for women's sport but is slipping behind overseas leagues and other domestic codes.\nThe 2024-25 instalment kicks off in two weeks' with Newcastle Jets captain Cassidy Davis lining up for her 12th consecutive season.\nDavis holds the record for the most consecutive A-League appearances, men or women, and has played more games for the Jets than any other female with 153 games across 11 seasons.\nThis season will be the first one she has not had to buy her own football boots thanks to SupportHer Co, which is an initiative of Regional Development Australia (RDA) Hunter.\nThe government-funded not-for-profit organisation collaborates and partners with businesses to help level the playing field for girls and women in sport.\nDavis is one of five Jets ALW players who SupportHer Co have aligned with local businesses. Each business has sponsored three sets of boots to their allocated player.\nIt is a small step but a welcome one for 30-year-old Davis, who has juggled her ALW commitments with work and study.\n\"What SupportHer Co are doing is quite amazing and we're lucky to get that boot sponsorship, which is awesome,\" Davis said.\n\"I've never had anything like it before and they all can't believe the fact that we don't get our own boots.\n\"You have to spend so much money on boots because we train so often, and these days they wear out so easily.\n\"It sounds so silly, that we're professional athletes and we have to buy our own boots.\"\nDavis has experienced first-hand the gradual growth in the women's game from 12 rounds to a full home-and-away format across 22 rounds for the first time last year. There will be 23 rounds in the 2024-25 season.\nThe long-overdue expansion has also meant an increased commitment.\nAnd while the pay has dramatically increased from the $50 match payments in Davis' first contract in 2013-14, there is still a long way to go until players can be considered full-time paid athletes.\nThe minimum wage for an ALW player in 2023-24 was $25,000 for a 35-week season. For an A-League Men's player aged 23 or older on a 12-month contract it was $63,750.\nThe women's minimum wage will increase by just $750 this season and the next.\nThe days are long, sometimes starting at 5.30am if a morning gym session is scheduled and not finishing until after training at night.\n\"The expectation and the level is just getting higher and higher, so you're not really seeing the growth in pay but you're seeing the growth in expectation and commitment,\" Davis said.\n\"It gets harder every year. For all of these girls who are working full-time, it's so mentally draining. You're not asking for $100,000. You're just asking to be looked after.\n\"Something needs to be done. To jump $750 in a season is ridiculous.\n\"The minimum wage has grown and the games but I still feel like we're so far away. When you compare us to other sports, we are getting ripped off.\"\nThe Professional Footballers Australia (PFA) A-League Women report 2023-24 identified the competition was being overlooked by top-level players in favour of more financially attractive overseas leagues and was losing players early due to unsustainable career dynamics.\n\"The players self-reported satisfaction with their 'life balance' was at a record low in 2023-24 as expanding football commitments clashed with supplementary employment,\" the report stated.\nDavis has just earned a Bachelor of Education (Primary) degree, which has taken a decade to complete.\n\"It's very relieving now I can work part-time and I can focus on football for these next two to three years hopefully, see how my body holds up,\" Davis said.\n\"So that's nice. But if I had a full-time football wage, it would be even better. I just hope that before I retire I can at least experience a good wage and a full-year contract rather than 35 weeks.\n\"It would be nice to be a full-time athlete for at least a year, but we just need more people to realise what we go through and how hard it is.\"",
  "word_count": 1395,
  "scraped_at": "2026-02-14T12:10:41.158382"
}