{
  "article_id": "932b20b08431",
  "url": "https://www.theargus.co.uk/news/25233745.brighton-aldridge-community-academy-rated-good-ofsted/",
  "title": "Brighton Aldridge Community Academy rated good by Ofsted",
  "date": "20250612T131500Z",
  "domain": "theargus.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A school that was rated “inadequate” has turned things around and been praised for creating an “aspirational culture”.\nBrighton Aldridge Community Academy (BACA) is celebrating after receiving a “good” rating in all areas following an Ofsted inspection in April 2025.\nThe inspection judged the school’s quality of education, behaviour and attitudes, personal development, and leadership and management as consistently good.\nThe academy, in Lewes Road, Brighton, has come a long way since being given the lowest rating three years ago, when Ofsted inspectors raised concerns over bullying and ineffective safeguarding.\nBut inspectors now say the school provides a welcoming environment where pupils have “positive attitudes to learning” and feel safe.\n“To say we’re proud is an understatement,” said principal Jack Davies.\n“This is a huge achievement and a testament to the hard work, resilience, and belief of our entire BACA community.\n“BACA really is a school where everyone can thrive and achieve; it’s something we’ve believed for a long time, and it’s brilliant to have that recognised externally too.\n“We hope this result is seen by our school’s families as a real endorsement of the brilliant all-round education that students are receiving - and that it inspires prospective students to come and see everything BACA has to offer.”\nThe education watchdog commended the school’s continued drive to improve and praised its commitment to bringing learning to life for students, with the report highlighting that the school has “worked hard to build an aspirational culture”, and that it offers “an ambitious curriculum”.\nOfsted said students thrive in the learning they encounter at BACA beyond the classroom and value “the school's diversity, enjoying events such as celebrating the food of different cultures”, as well as benefiting from “very strong links with the local community”.\nThe report also said parents are \"very positive about the improvements in their children’s experiences at the school\".\n“The school has continued its effective improvement drive since the last inspection, focusing its efforts on the most important weaknesses,” the report said.\n“The school has provided the right training and development for staff. This has led to clear improvements in key areas of the school’s work.\n“The quality of education has improved so that pupils’ learning builds securely on what they know. As a result, they are now achieving well in subjects across the curriculum. Leaders and staff are ambitious to do more.\n“They are taking the right action to ensure that pupils’ current levels of achievement are fully reflected in their GCSE results.”\nAs part of the Ofsted visit, inspectors spoke to city councillor Ty Goddard in his capacity as chair of the East Brighton Trust - a community group that has worked closely with the school.\nReacting to the news, he said: \"I'm absolutely delighted for the school and the school community. I think it's fantastic and it shows that with focused leadership, a great teaching staff and support from the community, this is the turnaround school.\"\nBACA is part of the Aldridge Education Multi-Academy Trust and offers elite cricket and football academies.\nJane Fletcher, chief executive of Aldridge Education, said: “We’re really pleased with the result of this inspection. The resilience and commitment of BACA’s team has shone through, and this is a proud day for all involved.\n“What is so clear to me is that the Aldridge values are present from the moment you walk through the doors of BACA. Everyone is welcome – no one is left behind – and there is a real sense of focused and engaging learning going on in every classroom. That’s what makes an Aldridge school, and we’re looking forward to supporting BACA to go from strength to strength.”\nIt comes amid more good news for the academy, as Mark Robinson OBE, who coached the England women’s team to World Cup victory in 2017, has been appointed to oversee the school's cricket programme, in partnership with Sussex Cricket.\nMr Robinson said: \"My mum was a teacher on an estate in Hull, and fought hard to give students equal opportunities, and it makes me proud.\n\"I'm following in her footsteps to try and create a difference, and make sure cricket is available for everybody.\"",
  "word_count": 694,
  "scraped_at": "2026-02-14T12:35:13.160042"
}