{
  "article_id": "937464342f3a",
  "url": "https://www.boston.com/news/local-news/2025/08/13/white-stadium-opponents-unveil-alternative-plan-they-say-is-cheaper-as-wu-forges-ahead/",
  "title": "White Stadium opponents unveil alternative plan they say is cheaper as Wu forges ahead",
  "date": "20250813T200000Z",
  "domain": "boston.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Opponents of Mayor Michelle Wu’s plan to redevelop White Stadium in Franklin Park are not giving up, despite suffering a major loss in court earlier this year and the fact that the city is hoping to begin construction soon.\nA group that has led the opposition unveiled alternative plans for the project Tuesday, touting it as a way to save tens of millions of taxpayer dollars while keeping the stadium reserved for public use. That group, the Emerald Necklace Conservancy, has been marshaling opposition to the plan for more than a year alongside an advocacy group known as the Franklin Park Defenders.\nAdvertisement:\nThe city’s plan centers around a public-private partnership between the city and a new professional women’s soccer team. Boston will pay for roughly half of the construction costs, while the team picks up the rest. The soccer team would use the stadium for home games and practices, while Boston’s student-athletes would have access to the facilities for a number of activities.\nBoston and the team signed a 10-year lease agreement late last year, and demolition work began soon after. The demolition process is now complete, and the city is working to finalize construction bids. But construction cost estimates have already jumped significantly once and are expected to keep increasing. Wu, who is in the middle of a reelection campaign, has been hesitant to share updated estimates.\nAdvertisement:\nThe current plan being pursued by the Wu administration would cost too much, sideline Boston Public Schools students, decrease green space, take away from the historic nature of the park, and potentially cause transportation headaches around Franklin Park, the conservancy and other opponents argue.\nThe conservancy has promoted alternative stadium designs in the past and rolled out an updated version this week. It would only cost $64.6 million to redevelop the stadium under their alternative plan, the group said. The Wu administration’s latest public estimate is that the city would pay $91 million, but that came last December and a number of global factors are likely to make the price tag go up.\nEmerald Necklace Conservancy President Karen Mauney-Brodek called the group’s recent alternative design a “gold-standard” that would give the BPS Athletics Department everything it needs.\n“Despite the demolition of the old White Stadium, there is still a clear path forward for an alternative fully-public stadium that avoids the high cost and many flaws of a professional sports venue in Franklin Park. We’re excited to share all the details of this design and cost estimate for the public to evaluate,” Mauney-Brodek said in a statement.\nAdvertisement:\nThe conservancy’s plan would allocate $39.6 million to rebuild the stadium’s west grandstand, $9 million for the east grandstand, $10.1 million for site improvements, and $5.9 million for track and field improvements. The conservancy shared a detailed cost estimate breakdown from the company Vermeulens Inc.\nThe group hired architectural design firm Landing Studio to develop the alternative plan and published renderings that show how it would differ from the city’s plan.\nDot Fennell and Beth Santos, BPS parents who gathered more than 600 signatures in support of Wu’s plan, issued a statement criticizing the conservancy and the alternative plan.\n“After more than two years of public meetings and their resounding defeat in court, it is time for ENC to accept that the renovation is happening. We call on ENC to listen to the BPS students, coaches, after school organizations, park advocates, and community members who have endorsed the project and are ready for an inspiring new chapter for BPS athletics and White Stadium,” they said.\nThe team will be known as Boston Legacy FC after its initial name and rollout marketing campaign were panned by fans.\nKraft and Wu trade barbs\nWhite Stadium was originally built in 1949 and was last renovated in the ’80s. Before the recent demolition, it sat dilapidated in the heart of Franklin Park. Various proposals to revitalize the stadium have fizzled out under previous mayoral administrations, but Wu appears determined to make rebuilding White Stadium a signature achievement of her time in City Hall.\n“We are moving forward,” Wu told reporters at an unrelated event Tuesday. “We are on track with construction, and it’s going to be a spectacular opportunity for our young people to really, finally have the experience of the city investing in them and giving them the facilities they deserve as a city-wide hub for athletics, for open space, and for community building.”\nThe stadium is a major talking point in this year’s mayoral race. Wu’s opponent, Josh Kraft, has seized on frustrations with the project and positioned himself as an ally to the conservancy in its efforts to halt construction.\nEarlier this summer, Kraft shared “internal city estimates” that purportedly showed that the stadium would cost $170 million in taxpayer dollars. Wu said that that estimate was far from accurate and only reflected an “absolute worst-case scenario.”\nRecent polling shows Wu with a commanding 30-point lead, and Kraft is hoping to make up ground as Election Day nears. He is keeping up a drumbeat of criticism, saying that the project shows how Wu is not an effective manager and is out of touch with residents.\nAdvertisement:\n“Mayor Wu’s plan prioritizes a professional sports team over the very students and communities this stadium was built to serve. For decades, Black and Brown neighborhoods have been told to ‘wait their turn’ for investments in public infrastructure, only to see public resources diverted to projects that benefit those with power and access. As mayor, I’ll work with residents, BPS families, and groups like the Emerald Necklace Conservancy to create a renovation plan that keeps White Stadium public, meets the needs of our communities, and delivers real equity — not just in speeches, but in our city’s budget,” Kraft said in a statement Wednesday.\nWu says that the city’s plan is the result of a robust public outreach process and that Kraft is peddling in “misinformation.”\n“This is a project that has been shaped by dozens of community meetings, by thousands of residents who work very closely with the Franklin Park Coalition who are the stewards of the park, with BPS students and coaches and athletes, with neighborhood association leaders,” Wu said. “These are the voices that Kraft and a small group who continue to try to sabotage and slow down this project are ignoring.”",
  "word_count": 1057,
  "scraped_at": "2026-02-14T12:20:24.605736"
}