{
  "article_id": "93a14e8f5159",
  "url": "https://www.rockmnation.com/2025/5/25/24435998/rock-m-digest-vol-2-issue-17",
  "title": "Missouri Tigers Rock M Digest : Vol . 2 , Issue 16",
  "date": "20250525T124500Z",
  "domain": "rockmnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Welcome to Rock M Digest, a weekly column that I sometimes write where I, Madame Editor, share with you my must-read picks for the Rock M Nation content of the previous week or two.\nRock M Digest: Vol. 2, Issue 17\nIt’s back!\nRock M Recs\nThe senior, now a mother of daughter Oakley, is ready for her first season as a Tiger after a tumultuous 2024 | By Dylan Heinrich\nI was really excited for everyone to get to read this one, as Dylan did a great job of capturing the special relationship between Hailey Chambliss and Mizzou head soccer coach Stefanie Golan, as the senior prepares for her final season while also being a new mom. He writes:\nBut by and large, her biggest supporter has been Coach Golan. As the head coach of the program, she has served as a beacon of stability amidst a life filled with change for Chambliss. At first, Hailey had no idea if she’d ever be able to play soccer again. But under the guidance of Golan, she has quickly worked her way back to becoming a major player for the 2025 season.\n/cue Mr. Brightside | By Nate Edwards\nCome for the Edwards family history lesson, stay for the colorful language — I toned it down a smidge — and Nate’s surprising takes on kU head coach Lance Leopold.\nAt its core, to me, college football is at its best when traditionally decrepit teams finally make a hire that can turn it around via scheme, culture, and duct tape and paper clips, and the fact that it’s stupid kansas that is our most recent entry into the lore is incredible and infuriating.\nLet’s take a look at how Mizzou’s SEC road opponents are feeling during the offseason. Who is on the hot seat? Who has sky-high expectations? | By Dan Keegan\nIn the first of this two-parter from Dan, he’s checking on the vibes of some of the teams the Tigers will face this season. First up— four SEC road teams. OU is circling the wagons, Auburn vibes are questioning what they paid for, Arkansas is asking if we’re still doing this, and Vandy is running it back. What world do we live in now that VANDY has the best vibes?\nThe vibes are sky high for Vanderbilt these days. Last year, the team took down Alabama and Auburn and won a bowl game. Cult hero quarterback Diego Pavia is back, as is NFL prospect tight end Eli Stowers. The team is top ten in Bill Connelly’s returning production metrics.\nDo I hear…. expectations?\nThis commit brings the Tigers to NINE guards on the roster for next year | By Dylan Heinrich\nAnybody need a guard? Mizzou Women’s Hoops has got them in spades in its first season under Kellie Harper. While the new rook comes from a mid-major (WCC), I really like this addition as it seems like she really can hoop. And no, her time near the beach didn’t overlap with other new Tiger, Jevon Porter, who played there for two seasons before heading to Loyola Marymount. #themoreyouknow\nChloe Sotell had several high-scoring outbursts, including 20-plus points against New Mexico (24), Loyola Marymount (22) and San Diego (20). The first two came courtesy of the long ball, finishing with 6 threes in each game. That outing against San Diego was one with a healthy combination of scoring at all three levels.\nShe routinely plays 30-plus minutes a night, showing no signs of tiring. While Sotell likely won’t be expected to play that much at Mizzou, that sort of motor can be crucial when looking at the intangibles of someone’s work effort.\nThe spring semester is done, so what are some “wants” for Mizzou football this summer? | By Nathan Hurst\nNathan urges us all to basically just chill the f out this summer, as this is the time year for zen. It should be quiet for your favorite team, though, he says, it sure would be nice to get a jump on some high school recruiting, as the Tigers have just 3 (!) 2025 commitments and he’s really shooting for... read the piece to find out.\nWhen programs big and small are making the news cycle for weird (see Tennessee and Nico Iamaleava,) crazy (see North Carolina, Bill Belichick and his romantic entanglements) or outright criminal things (see Georgia just about any week of the year,) very little good can come from a college team making waves over the summer.\nFor the first time we got to hear from Liza Fruendt, Kenzie Kostas and Jennifer Sullivan in their new roles | By Dylan Heinrich (Special thanks to Quentin Corpuel for the Otter file)\n“There’s just not gonna be a ton of staffs out there that have not one but two former players [Kostas and Fruendt], and they’re decorated players,” assistant coach Jennifer Sullivan points out. “Having them speak to recruits about why they can play for Kellie is going to be a big, big deal. So I’m excited for recruits to get a chance to get first-hand knowledge of what it’s like to play for Kellie.”\nQuotables\n“Kellie’s the only person that I would have done it for, hands down,” Sullivan said. “To have the opportunity to work with her again and help her rejuvenate the fan base and program here. The timing for me and my family was right, and this opportunity was right. So [I’m] really excited about the opportunity here.”” —Dylan Heinrich, Mizzou WBB coaches chat\n“When Billy Hoyle stepped onto the asphalt court for the first time in White Men Can’t Jump, Sidney Deane didn’t think much of him. The whole premise of the existence of Hoyle is that nobody thinks he can play because he’s a white boy. As a former white boy baller, the struggle is real. Something I’m sure Jacob Crews can relate to as well.” —Sam Snelling, Mizzou Basketball Player Review: Jacob Crews\n“The flowers are blooming around Jesse Hall, the mid-Missouri humidity is moving in and campus staffers and faculty are still humming Pomp and Circumstance under their breath. It is officially summer in Columbia as the students have evacuated, the faculty have absconded and us townies have begun rejoicing for the coming months of reduced traffic and restaurant wait times... While serious college football fans, yours truly included, would probably prefer to just skip the summer and get to the good stuff this fall, let’s all try and live in the present. (breathe in, breathe out)” — Nathan Hurst, Summer Wish List\n“While the NCAA Softball world circles around the coming WCWS, Larissa Anderson must be scratching her head as to what she’ll do with the team next year. Because Sunday saw something of an exodus of big names from the Tigers roster (as Madison Walker and Taylor Pannell announced their intents to transfer).” — Josh Matejka, Mizzou Softball feels sting of portal\n“I can’t wait for the first big hit, first 3rd-down stop, or first Mizzou touchdown score and hear the mass of Missouri faithful roar and sway in the cathartic justice of watching kansas get its ass kicked by Mizzou.” — Nate Edwards, kU preview\n“Do you know what it’s like to go 1-5 in one-score games? Of course not, what a preposterous question to ask, we of the enlightened Eli Drinkwitz cult of “69.2% winning percentage in one-score games... but seriously how bad was that 2024 experience, you stupid Jayhawkers?” —Nate Edwards, kU preview (honorable mention)\n“Dawn Sullivan and the Tigers return several notable players from that squad, including SEC Libero of the Year and Honorable Mention All-American Maya Sands and All-SEC Second Team setter Marina Crownover. The team also had one of the best transfer portal classes in the country, bringing in Tyrah Ariail from USC at middle blocker and Honorable Mention All-American Caylen Alexander at outside hitter from Hawai’i.” — Matthew Gustafson, Mizzou VB v. Stanford on ESPN this fall\nHot Shots: Softball Edition\nJust because the season pretty much sucked doesn’t mean that we didn’t have some awesome photographs to make up for it. Here’s a collection of the ones I liked best from Mike Baniewicz, Cal Tobias and freelancer Sam Simon.\nListen Up!\nDive Cuts\nMajority Rules: S1 Ep30 “The Everybody Loves Abigail Episode”\nBefore the Box Score S6 Ep44 “The Risks of HS Recruiting”\nOde to Around the Horn\nDISCLAIMER: No, this has nothing to do with Mizzou, but I don’t care.\nOne of my favorite shows of my life ended its run on Friday, May 23 after 23 years and 4,953 shows. When I lived in North Carolina, I watched about every episode. When I go see my parents for Christmas, it was always on. And while I became a more casual viewer the last couple years as my workload got too heavy and, well, I was at work til 5 and would have to add it to my to-do list, that honestly, I was never going to get to. So I watched clips here and there on socials when my faves were on.\nThis show was important to me not only as a future sportswriter, but as someone who just loves sports in general. Between this show and PTI (another Steger Family favorite), I could catch up on all I needed to know in little bitesize nuggets. And for ATH, it introduced me to the best of the best, many cast members who I still follow and read/listen to this day. Without this show, I wouldn’t have necessarily discovered Tim Cowlishaw, Bill Plaschke, Woody Paige, Kevin Blackistone, J.A. Adande, Clinton Yates, David Dennis Jr., Bob Ryan, Jackie MacMullen, Kate Fagan, Izzy Gutierrez, Sarah Spain, Bomani Jones, Mina Kimes, Harry Lyles, Jemele Hill, Martenzie Johnson (MIZ!), and my personal favorite, Pablo Torre.\nThe Final Horn: Why sports TV will never be the same without ‘Around the Horn’— Chris Bumbaca (USA Today)\nAs ‘Around the Horn’ ends, Tony Reali debates what went wrong — Ben Strauss (Washington Post)",
  "word_count": 1667,
  "scraped_at": "2026-02-14T13:20:28.883868"
}