{
  "article_id": "93a45af80fae",
  "url": "https://www.azernews.az/business/214573.html",
  "title": "FIFA reveals record $7 . 36B spent on international transfers",
  "date": "20230909T163000Z",
  "domain": "azernews.az",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA reveals record $7.36B spent on international transfers\nFIFA, the world football's governing body, confirmed on Friday that clubs spent an all-time high $7.36 billion on international transfers during the summer window, Azernews reports, citing Anadolu Agency.\n\"An all-time top figure of USD 7.36 billion was spent on transfer fees in the 2023 mid-year window, which represents an increase of 47.2% compared to the 2022 mid-year period and 26.8% compared to the previous mid-year record set in 2019,\" FIFA said in a statement.\nEngland led the transfer list in the 2023 mid-year period (June 1 – Sept. 1 2023) when it came to spending on transfer fees -- $1.9 billion --, the number of incoming transfers, and the number of outgoing transfers, FIFA reported.\nSaudi Arabia came second in spending with a total of $ 875.4 million, ahead of France ($ 859.7 million), Germany ($ 762.4 million), Italy ($ 711.0 million) and Spain ($ 405.6 million).\n\"Agent fees also reached a new high, with USD 696.6 million paid during the mid-year window, bringing the total for 2023 to date to USD 853.0 million, which is 36.9% higher than in the whole of 2022 and more than in any other year,\" FIFA added.\nAlso, spending on transfer fees in women's football increased remarkably to $3 million, doubling last year on transfer fees.\n---\nFollow us on Twitter @AzerNewsAz\nHere we are to serve you with news right now. It does not cost much, but worth your attention.\nChoose to support open, independent, quality journalism and subscribe on a monthly basis.\nBy subscribing to our online newspaper, you can have full digital access to all news, analysis, and much more.\nYou can also follow AzerNEWS on Twitter @AzerNewsAz or Facebook @AzerNewsNewspaper\nThank you!",
  "word_count": 291,
  "scraped_at": "2026-02-14T13:09:48.419687"
}