{
  "article_id": "93cec4db95c5",
  "url": "https://www.stamfordmercury.co.uk/news/a-nostalgic-trip-down-memory-lane-to-look-at-news-from-days-9316154/",
  "title": "Stamford , Rutland , Bourne and the Deepings news from up to 200 years ago in Mercury Memories",
  "date": "20230611T093000Z",
  "domain": "stamfordmercury.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Stamford, Rutland, Bourne and the Deepings news from up to 200 years ago in Mercury Memories\nWe take a look at what was making the news up to 200 years ago.\nOur Mercury Memories is produced thanks to the support of the Stamford Mercury Archive Trust.\n10 years ago\nJune 7, 2013\nStamford's largest employer Cummins Generator Technologies is axing 45 jobs from its workforce just six months after cutting 95 jobs.\nThe firm, which is based in Barnack Road, Stamford, broke the news to staff on Wednesday and said it was due to the “continued downturn in market demand”.\nCummins said it had entered into a 30-day consultation with affected staff, who work on the shop floor in manufacturing, and the unions.\nA spokesman said: “These actions are difficult and will impact a number of people who have worked for Cummins for many years but are necessary to respond to the sustained economic conditions being seen in Europe and ensure the long term success of Cummins and all its stakeholders.”\nThe firm, which manufactures generators and parts, employs about 680 people across its two sites in Barnack Road and Ryhall Road. In November, the firm announced a 30-day consultation on cutting 95 jobs, which is said was linked to “short-term economies”.\nMP Nick Boles fears Stamford Hospital could close as a result of enormous financial problems and has called for someone else to take it on.\nMr Boles fears the cash crisis faced by Peterborough and Stamford Hospitals Trust means plans to revamp Stamford Hospital to create a health campus could be shelved.\nIn March, health watchdog Monitor started a review into the trust, which is facing a £54m deficit after taking out a private finance initiative to build the new Peterborough City Hosptial.\nThe results of the review are expected to be released today.\nBut on Wednesday, ahead of those results, Mr Boles wrote to chief executive of the NHS Sir David Nicholson and Monitor, issuing an ultimatum: if the current hospital trust cannot carry out its plans, then another health trust should take on Stamford Hospital.\nHe said: “The fear I have is that although the interim management have the best of intentions for Stamford, they are not going to be in the driving seat because the financial crisis is so great.\nThese decisions are being taken in London by the head of the NHS and others and it would be very easy for the whole future of Stamford Hospital to get lost in these big, difficult but necessary, decisions.”\nA pub chain giant is set for a move to Stamford after its plans to open a £1m venue were given the go-ahead this week.\nJD Wetherspoon was given the green light to move into the current Mercury office in Sheep Market at a South Kesteven District Council development control committee meeting on Tuesday.\nCouncillors on the committee voted 13 to one in favour of the plans.\nThe firm is now waiting for the venue to be granted a licence before work starts.\nJD Wetherspoon spokesman Eddie Gershon said: “We are delighted that planning permission has been granted.\n“The company is extremely keen to open a pub in Stamford and this is a big step towards that.”\nAs part of the plans, the ground floor of the building will be transformed into a family-friendly pub.\nIt will comprise a bar area, kitchen, disabled and male toilet facilities, an enclosed refuse store and staircases to the cellar and the first floor.\nThe existing forecourt will be turned into an outdoor seating area and the first floor will house the female toilets, staff room, office, store room and plant room.\nAccess to the pub would be through the existing reception and most deliveries would be made from Bath Row.\nAccording to the application the new pub would create 50 jobs.\n25 years ago\nJune 5, 1998\nThis year's Stamford Festival parade of floats already has a healthy number of entries - but there is room for more.\nFund-raising group Stamford Kiwanis are organising the parade – the major event which traditionally launches the festival.\nThe theme for 1998 is World of Sport. People are invited to take part in the colourful parade. Floats, including one organised by the Mercury featuring the Mercury Virgin balloon, will process around the streets of Stamford on Saturday, July 4.\nRoadworks in the North Street/East Street area will be halted to allow the parade to pass through on the way to the recreation ground.\nKiwanis spokesman Peter Ludlow is enthusiastic about the volume of entries already, and expects more groups to register as July approaches.\nHe said: “At the moment we have 14 entries booked for the parade, in addition to the three bands, breakdown vehicles and St John Ambulance.\nA public inquiry will be held at Oakham next month to decide whether a landowner can open a controversial camp site and caravan park next to Rutland Water.\nRichard Bee plans to use farmland between Manton and Edith Weston for the development, but his proposal has encountered solid resistance from councillors and conservation groups.\nObjectors believe the 80-pitch caravan park – at Lyndon Top Farm – will spoil views, cause traffic problems on country lanes and pose a possible threat to nearby wildlife.\nThese worries were backed by Rutland County Council on Tuesday, when its development control committee votes to threw out the plan 7-0.\nThe application will now be decided at a three-day planning inquiry beginning on July 7.\nDuring Tuesday's debate Coun Jane Bews said: “In Rutland Water we have a unique asset – a still relatively unspoilt area. The reason it is enjoyed is because it is unspoilt. I believe this proposal will endanger the whole reason for people coming.”\nCouncil leader Kim Lee claimed the plan would “drive a coach and horses” through the Rutland Water Local Plan which seeks to confine such developments to designated areas.\nMr Bee submitted a plan for a 165-pitch caravan park last year, but it was also turned dowm. He declined to comment after the meeting.\nA couple who read in the Mercury about a village shop threatened with closure have taken it over.\nVal Fisher and Mick Harrison saw the story of Bulwick's village store needing new tenants – just as they were thinking about turning their hands to small-time retail.\nVal said: “We had been tentatively looking around for a village shop when we read about Bulwick's and saw it as an ideal opportunity. We applied and were lucky enough to get it.\n“I'm used to shop work anyway – my parents ran a post office store – and I love living and working in a village, so this is ideal.”\nThe couple moved to the shop, owned by Bulwick Estate, from Morcott two weeks ago and have been busy settling in.\n“Everybody has been really friendly and welcoming to us, which is really helpful,” said Val.\nThey are now running two businesses at once as Mick operates a project managing and conveyor belt installation service with Val's help from the shop.\n“We definitely like to keep busy,” laughed Val, who already has plans to expand the services the shop offers.\n“I am already looking at doing some new things with the shop, like dry cleaning and shoe reparing hopefully.\n“We have to remember that we are a community store providing a service – and that is what we intend to do.”\n50 years ago\nJune 8, 1973\nThe Cod War still means little more to most of us than a news flash on the radio, or a report in the morning papers.\nBut, for a young Ryhall midshipman, clashes with Icelandic gunboats out on the Norwegian Sea, are becoming a way of life.\nWilliam Fairbairn (19), whose parents, Lt Col and Mrs D. P. Fairbairn live at The Firs, Ryhall, is a midshipman on the frigate Jupiter.\nHe joined the Navy in September 1971 after leaving Radley College, near Abingdon, Berks.\nWriting home to his parents from just off the North Icelandic coast, William has recently described to them something of events there.\n“The Cod War has hotted up somewhat and we have been protecting the fishing fleet off Iceland from gunboat attack,” he says in a letter written last week.\nOne of the events in which William was involved was when the frigate went to the rescue of the trawler Everton which had been holed by the Icelandic gunboat Aegir.\n“The holes above the waterline had been plugged with canvas and wood,” he told his parents, “but the two below were not accessible.”\nRoyal Navy divers went down to plug then and do repair work.\nMartin-Markham, the Stamford firm threatened with closure only four months ago, has been saved.\nIts remaining employees will all keep their jobs – and, say the firm, they are planning to expand.\nAn announcement on Friday morning that Martin-Markham had been taken over by Simplex of Cambridge – a member of the huge GEC group – ended weeks of speculation about the firm's future.\nThe company confirmed in February, rumours that they would have to close “due to a number of adverse factors.”\nA hundred workers faced losing their jobs. But even then talks had started to see if there was a way of saving the agricultural machinery firm in Ryhall Road.\nThe deal that settled its future was signed on Thursday having been finalised the previous week.\nMartin-Markham's new general manager, Mr Bill Reed, said: “A separate company will be formed here, although it will take a week or two to establish.”\nHe added that the firm would now be going under the name of Martin-Markham (Simplex) Ltd.\nA warning that the Welland Valley – described as being “one of the most important physical features around Stamford” - may have its beauty destroyed was given by a Kesteven County Council officer, on Wednesday.\nMr M. Gibson, the acting county Planning Officer, who was appearing at Wittering parish hall, on Tuesday and Wednesday, at a public inquiry into the creation of an overhead power line from Bainton to Stamford, was objecting to the line being built north of the Stamford-Peterborough railway line.\nHe said: “This area, from Hudd's Mill to Uffington Park, is particularly attractive.\n“There is enormous recreational potential in this area and the Kesteven County Council are anxious that the area is not destroyed by the sight of a line of pylons running through the heart of the water meadows.\n“Areas of the Welland Valley which are visually attractive should be conserved and developed as scenic areas rather than be despoiled.”\nMr Gibson went on to say “If the powerline is built north of the railway line then the intimate rural character of the locality will be destroyed.\nThe line is planned by the Central Electricity Generating Board, and because of public opposition to the positioning of the line, they have planned two alternative routes.\n100 years ago\nJune 8, 1923\nIndoor Garden Party – Owing to the inclemency of the weather on Thursday afternoon, the missionary garden party, which was to have been held in the garden of Mr. H. Deer, took place in the Wesleyan schoolroom, Stamford. Mrs. H. Goodyear (Great Casterton) presided, and the opening ceremony was performed by Miss Gladys Archer, who spoke of the work of the Women's Auxiliary of the Wesleyan Methodist Missionary Society, in aid of which the effort was being held. Quite a good number attended the tea, and later in the evening an excellent concert, arranged by Mrs. Sims, was much appreciated. The proceeds amounted to £9.\nStreet Mishap – An accident which might have resulted fatally, but fortunately only administered a severe shock, occurred in Red Lion-square, Stamford, on Friday, shortly after one o'clock. A lady driving a car from the direction of Scotgate towards St. John's-street was compelled, to avoid an old man leading a horse, to swerve well to the left, and in doing so the car mounted the pavement and pinned a young lady who was passing against the wall of the London City and Midland Bank. Providentially, she escaped bodily injury.\nBurghley House Re-opened – Commencing June 12th, Burghley House will be re-opened to visitors on Tuesdays, Thursdays and Saturdays, and also on Bank holidays.\nFootball In A Poor Way – There was a moderate attendance at the adjourned annual meeting of the Town Football Club, in Stamford Town Hall, on Friday evening, the Mayor (Mr. J. W. Pepper) presiding. Mr. J. J. Bentham (treasurer) presented the financial statement for the season 1922-23. The total income amounted to £910 9s. 10d., and thus included subscriptions of £82 7s. The receipts rom Northants. League matches were £406 12s. 2d., and from Peterborough League matches £20 17s. 1d. The expenses in connection with the former League were £539 9s, 6d., and Peterborough League £30 17s. 5d. The season commenced with a deficit of £39 10s. 7d., and closed with one of £78 9s. 3d. The season's total expenses amounted to £988 19s. 1d. Various means of raising funds were discussed, and Mr. C. Knighten, chairman of the Supporters' Club, stated that they had £10 in hand which was at the disposal of the Town Club. It was decided to run a reserve team in the Peterborough First Division next season. On the motion of the Mayor, a vote of thanks was passed to Mr. F. D. Donovan, the retiring secretary.\nBourne\nEmployment Committee Disbanded – At the last meeting of the Juvenile Advisory Committee, a resolution was passed to the effect that, having regard to the closing of the branch employment office at Bourne, and that so little scope existed for the Committee, the members recommended that it be disbanded. Notification has now been received that the Ministry of Labour has adopted the Committee's proposal of disbandment, and a letter of thanks has been forwarded to the members of the Committee.\nSudden Death – On Tuesday morning, Mr. W. H. M. Fisher, of Hereward-street, died under sudden circumstances. Deceased complained of not feeling well, and his wife went for Dr. Gilpin soon after 3 a.m., but before the doctor arrived life was extinct. The cause of death was heart failure. Deceased who was a labourer, leaves a wife and children.\n150 years ago\nJune 6, 1873\nStamford and Rutland Infirmary – The Weekly Board of Governors wish us to state that the alterations in the interior having been completed, inpatients will be admitted on and after June 10. The original construction of the passages leading to the wards had proved on many occasions very inconvenient, particularly when patients in a dangerous condition had to be removed. The new arrangements, suggested by Dr. Newman and recommended by the medical staff, will prove very advantageous.\nNorthampton and Rutland Militia – Major Lord Brownlow Thomas Montague Cecil is granted the honorary rank of lieutenant colonel; Major Richard Trevor Clarke is granted the honorary rank of lieutenant-colonel; Captain Robert James D'Arcy is granted the honorary rank of major; Captain William Kerr is granted the honorary rank of major, and is permitted to continue to wear the uniform of the regiment on his retirement.\nWe are informed that the magnificent Wisteria at Uffington House gardens, which for years has been the admiration of floriculturists, is now in splendid blosson, the racemes being very large and hanging in thick clusters, and the colour a rich lilac.\n“Via Spalding.” To prevent vexation and injury it ought to be more generally known that at least at one station on the East Lincolnshire line north of Boston tickets for Stamford marked “via Spalding” are issued for the train which reaches Spalding at 8.55 a.m. - 15 minutes after the departure thence of the train for Bourn and Essendine. On Whit-Monday significant inquiries were made at the Water-street station as to the arrival of the next train from Spalding; and a gentleman who had in East Lincolnshire taken a ticket for Stamford “via Spalding” on his way to the west of England would no doubt find his ticket more than useless. Perhaps the railway company has on hand a very large stock of tickets for the old, and until recently expeditious, route “via Spalding,” or it may be that the managers think a saunter of four hours while waiting for “the next train” is likely to prove invigorating.\nThis morning Mary Ann Olive, housekeeper to Mr. R. B, Tiffin, of Wisbech, land surveyor, was apprehended at Stamford by P.c. Gray on a charge of stealing a watch and chain, four gold rings, a work box, and a silver spoon.\nSt. Leonard's Priory – We are sorry to notice that one of the buttresses of the west front of this building – one of the oldest specimens of architecture Stamford can boast of, some portions of it dating from the time of William the Conqueror – shows signs of speedily falling en masses, unless steps be soon taken to re-built it. The corresponding buttress too, bulges in the centre. On Monday while levelling the ground near the west front the workmen came upon a stone coffin close to what was once the prinicipal doorway of the nave: it contained bones disposed in such a manner as to induce the belief that it had previously been unbared and its contents rudely handled; indeed it is not unlikely that this is a coffin which in 1833 was found “about 18 inches below the surface, near the centre arch,” and which on being then opened was found to contain a female skeleton wrapped in a cloth of wool and horsehair. The lid of a small coffin has also been turned up.\n200 years ago\nJune 6, 1823\nThe fair at Stamford on Monday was a very brisk one, particularly for sheep: lamb-hogs advanced in price 4s. a head. Good beasts also sold at improved prices; and in the horse fair the dealers purchased freely.\nYesterday se'nnight, Mrs. Spencer, a poor widow of Williamson's Callis in this town, 75 years of age, was thrown down in St. Mary's-street, by two dogs which began fighting as she was passing on the foot pavement, and she had the misfortune to have one of her thighs broken – a visitation which at her time of life is likely to prove fatal. It is hoped this shocking accident will be a caution to those inconsiderate persons who are in the habit of encouraging dogs to fight in the streets.\nOn Thursday the 29th ult. Mr. Thomas John Brummitt, of Laughton, near Falkingham, was elected Master of the Free-school at Sibsey.\nOn Monday last, as Mr. J. Ogden, a respectable horse-dealer, of Caldecott, near Uppingham, was proceeding homeward on horseback from a neighbouring village, he was accidentally thrown from his horse with such violence as, it is feared, fractured his skull. He was unable after the fall to render himself any assistance, and consequently remained in a deplorable state for several hours before he was discovered. Every exertion has since been used to forward his recovery, of which, however, but small hopes are entertained.\nOn Thursday the 29th ult. Mr. Sylvester Rogers was chosen a Magistrate, and Mr. Robt. Turner, jun. and Mr. Samuel Ridge, Burgesses of the Corporation of Grantham. Mr. Rogers succeeds the late Mr. Chettle, and was nominated to serve the office of Alderman for the next year.\nThe long-pending cause between the South Holland Drainage Trustees, and the tenants of Chas. Butler, Esq., was finally disposed of on Tueday the 27th ult. upon a motion for a new trial. The Court of King's Bench upon argument confirmed the verdict given in favour of the Trustees at the last Lincolnshire assizes, and established the assessment upon Mr. Butler's estate.\nAt Crowland market yesterday there were upwards of 350 sheep and 150 beasts of the first quality, and they met with very rapid sale, there being many butchers, jobbers, and general purchasers, not only from the neighbouring towns, but from far distant places. The eminent dealers Scheffington, from Leicestershire, Watson, from St. Ives, and others, were present. The market increases in all respects beyond the most sanguine hopes which has been previously formed.\nA handful of wheat ears was on Monday last plucked out of a field of wheat in Gedney Marsh, where there are 24 acres of the corn in ear.\nThe Huntingdonshire Yeomanry Cavalry assembled on Tuesday for six days' duty at Huntingdon.\nHuntingdon races are fixed for the 5th, 6th, and 7th of August.\nA Married middle-aged Man, free from any incumbrance, who has had much experience in Farming, and is thoroughly conversant with the Management of both High and Low Lands, is in want of a Situation as Bailiff to any respectable Land-owner, or to undertake any active business connected with the general superintendence of land or stock.\nSatisfactory references will be give for character, and the advertiser can be well recommended. Personal application, or letters addressed to Mr. Bontoft, bookseller and printer, Horncastle, will be duly attended to.",
  "word_count": 3504,
  "scraped_at": "2026-02-14T13:24:40.422144"
}