{
  "article_id": "9405aed75ffd",
  "url": "https://www.thenationalnews.com/arts-culture/art-design/2025/06/13/va-disability-and-design-exhibition-inclusion-accessibility/",
  "title": "The V & A exhibition by disabled artists that wants to reclaim the narrative with humour",
  "date": "20250613T191500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "One of the pieces in the new Disability and Design exhibition at London’s V&A South Kensington is a short film by disabled performance and video artist Katherine Araniello which parodies an advert made by UK TV’s Channel 4 for the 2012 Paralympics.\nNamed Meet the Superhumans, the original advert’s premise was how inspirational and resilient disabled sportspeople are, depicting them as strong and invincible. In Araniello’s satirical version of the advert, she can be seen smoking and stuffing her face with junk food to the same hyper-catchy soundtrack as the original advert.\nHer mock interviews as an inspirational athlete in a wheelchair are delivered deadpan to camera and riddled with tropes and superlatives along the lines of: \"It was the toughest race of my life\", \"I never let my disabilities hold me back\" and \"I have inspired a future generation of sporting excellence\".\nIt’s a deeply funny yet deadly serious reminder that disabled people shouldn’t have to be superhuman to be worthy of respect, attention or care. “And it’s a way of saying, ‘Hang on, this isn’t how I want to seen’,” says Natalie Kane, curator of the exhibition that opened on Saturday at the museum’s original South Kensington branch.\n“It’s important to challenge when we don’t feel represented,” Kane tells The National, and comedy or humour is a tool that some disabled artists have used successfully to do that.\nDivided into three sections – Visibility, Tools and Living – the exhibition includes 170 objects from the spheres of design, art, architecture, fashion and photography.\nUnlike a lot of other exhibitions dedicated to design and disability, the pieces here are made or conceived by disabled people and highlight aspects of living and working with disability that are personal and intimate but also often political and quietly revolutionary.\nThere’s Conor Foran’s Dysfluent magazine, which gives brilliant graphic form and a visual identity to stammering by repeating certain letters or stretching parts of them.\nOther standout pieces include Maya Scarlette's incredible hand-sewn Notting Hill Carnival costume inspired by Sandro Botticelli’s The Birth of Venus. Scarlette is a fashion designer with ectrodactyly, meaning digits in her hand or feet are absent.\nThere's also a moving performance piece by Carmen Papalia, who calls himself a non-visual artist. In the piece, Papalia replaces his white cane with a brass band, the latter guiding him though a Vancouver park via a site-reactive musical score and sound cues – when an obstacle is near, the music becomes more shrill.\nThe results of these works, which highlight the need for collaboration and support are joyful, unexpected and, at times, fraught.\nDisability is not a problem that needs to be fixed posits the exhibition. Rather, disabled people are the experts when it comes to expressing their identities and designing for their own needs, hacking and subverting everyday objects in ingenious ways.\nA great example of the latter are the low-tech but clever adaptations made by septuagenarian disabled woman Cindy Garni in the US, who added a cable tie to the zip of a purse to help open it, or a stick-on-wall-hook to the screw top lid of a pot of beauty cream to do the same.\nIn the same vein, the McGonagle Reader is an audio-assisted tactile voting device created for people with low vision. But there’s also the adapted bike of Palestinian cyclist and founder of paracycling team Gaza Sunbirds, Alaa al-Dali, who was shot by an Israeli sniper in Gaza in 2018. It’s a timely and poignant reminder that access to disability rights or activism is even more difficult (and often impossible) for people living under war or the brutality of occupation.\nThe exhibition hones in on the moments when technology or sustainability aren’t always the silver bullets we think they are. For instance, the policy to phase out plastic straws that has been problematic for disabled people who require a lot of support as plastic straws are stronger, safer and more hygienic.\nOr the robotics or GPS elements non-disabled designers have tried to add on to the white cane that have proven unpopular and even dangerous. One modification to the cane that did stick was when a foldable version was produced in the 1950s after a woman asked for a cane that would fit in her shopping bag.\nBut it’s not just the content of this exhibition that takes a disability-first approach, the design and organisation of the exhibition does as well. For one thing, visitors are repeatedly reminded to touch objects and, where possible, it’s the original object and not just a 3D copy. It feels awkward but it is a useful reminder of how two-dimensional and exclusionary many exhibitions can be.\nThe other is that the show begins with a rest space filled with modular chairs, some with armrests, some without, for different sorts of physical support. Round tables, for example, are much better than square or rectangle tables for deaf people to gain full vision of people who use sign language. There's also an inviting blue and white bench by Finnegan Shannon inscribed with the words: \"Do you want us here?\"\nThere are further seating options dotted around the exhibition, including an inviting chaise longue in the last room, in what is an obvious attempt to address the startling and deeply exclusionary lack of seating in so many exhibitions.\nFurther attempts to make the space as accessible as possible include a tactile key to the different exhibition sections. But there are also mirrored doorway arches that help deaf people understand what is around the corner in a given space. Or low stools that can be pulled out so that people of all heights can enjoy the displays fully.\nThere are also a range of ways of experiencing the exhibition including tactile maps, audio descriptions, sign language, large print and online audio options.\nThe idea is that the museum, which like many older institutions is grappling with accessibility issues, is accruing knowledge and training in this area and creating a legacy for the future.\n“It shouldn't be that a show about disability is the only show where you get access principles,” says Kane. “The aim is for this design thinking to be applied to future exhibitions.”\nDesign and Disability exhibition is running at V&A South Kensington until February 15, 2026",
  "word_count": 1046,
  "scraped_at": "2026-02-14T12:11:18.523096"
}