{
  "article_id": "94169d5f2047",
  "url": "https://thebeatdfw.com/4179391/deshaun-watson-facing-new-sexual-assault-allegations-from-houston-area-woman/",
  "title": "Deshaun Watson Facing New Sexual Assault Allegations from Houston - Area Woman",
  "date": "20240912T061500Z",
  "domain": "thebeatdfw.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Deshaun Watson Facing New Sexual Assault Allegations from Houston-Area Woman\nWarning: Contains graphic descriptions of an alleged assault, which some readers may find disturbing.\nHOUSTON — Former Houston Texans quarterback Deshaun Watson is back in the spotlight after a lawsuit filed Monday in Harris County accuses him of sexually assaulting a Houston-area woman in October of 2020.\nThe civil lawsuit, asking for $1 million in damages, alleges Watson sexually assaulted the woman during an encounter at her apartment. The lawsuit alleges the woman suffers from panic attacks, nervous breakdowns, depression, anxiety and trouble sleeping. Tony Buzbee’s law firm is representing the woman, who remains anonymous as “Jane Doe.”\nAccording to the lawsuit, Jane Doe and Watson met at a bar in the Galleria area in July of 2020, while Watson was a member of the Texans. One of Watson’s friends approached her, asking for her number on Watson’s behalf. She gave her number to the friend and Jane Doe and Watson texted each other several times over the next few months.\nRelated: Deshaun Watson’s Facing Another Sexual Misconduct Lawsuit From A Massage Therapist\nRelated: Deshaun Watson Suspended 11 Games, Fined $5M By NFL\nRelated: Grand Jury Declines To Indict Deshaun Watson On Sexual Assault & Harassment Allegations\nWatson allegedly asked the woman to meet in the Galleria in October of 2020, which she refused due to being hesitant to be seen with him in public. She invited him over to her apartment for dinner. According to the lawsuit, she “knew nothing of Watson’s proclivities.”\nUpon getting to her apartment, Watson called her, aggressively screaming because he couldn’t find her apartment and claimed he “doesn’t have time for this.” Once inside, Jane Doe asked Watson to wait in her living room as she finished applying her makeup in the bathroom. In an attempt to calm him down, she tried conversing with the quarterback from the other room, but he didn’t respond to anything she said.\nOnce she left the bathroom, Jane Doe found him lying naked on her bed, “lying face-down on his stomach,” according to the lawsuit.\nWatson “aggressively” demanded she massage his buttocks, which terrified her, according to the lawsuit. When she went to massage his back instead, Watson became frustrated and turned over, “revealing an erection.” He then began demanding she massage him from his knee to his groin. The lawsuit goes on to detail that Jane Doe was fearful for her safety:\n“Jane Doe froze in fear, unsure of how to refuse Watson’s advances without jeopardizing her safety,” according to the lawsuit. “Confused and scared, she reiterated to Watson that she wasn’t a masseuse.”\nWatson allegedly asked the woman what she wanted to do instead, but before she could answer he grabbed her and raped her, the lawsuit states.\n“We are reviewing the complaint, and we will look into the matter under the personal conduct policy.” – Brian McCarthy, NFL spokesperson\nJane Doe initially feared for her safety if she attempted to stop the assault, but was able to get away from Watson and grab a heavy piece of decor to protect herself from further harm, according to the lawsuit. She yelled at him to leave her apartment, claiming he left angry.\nAccording to the lawsuit, she did not come forward initially due to Watson’s celebrity status and fear of retaliation. She felt she was ready to come forward, but again became fearful of retaliation based on the treatment other women who came forward faced from Watson’s defense team and the public.\nJane Doe attempted to resolve the incident with Watson prior to filing her lawsuit, but failed to make any progress in the endeavor, according to Click 2 Houston.\nOf the nearly two dozen lawsuits filed against Watson, accusing him of inappropriate behavior and harassment, this is the first lawsuit to accuse him of sexual assault.\nThe allegations have had a significant impact on Watson’s NFL career, as the Texans refused to play him during the 2021-22 season. The Texans moved on from Watson in the spring of 2022, trading him to the Cleveland Browns. An NFL investigation led to a suspension of 11 games and a $5 million fine for violating the league’s personal conduct policy, according to NFL.com.\nThe NFL announced Tuesday it has no plans to place Watson on the Commissioner’s Exempt List, due to nob criminal charges being filed against him and their review into the incident has just begun.\n“We are reviewing the complaint, and we will look into the matter under the personal conduct policy,” league spokesperson Brian McCarthy said in a statement on Tuesday.\nTo date, Watson has not been arrested or charged with a crime related to any of the allegations he has faced. Two Texas grand juries have declined to indict him.\nJane Doe is asking for a jury trial and for Watson to cover all legal expenses.\nDeshaun Watson Facing New Sexual Assault Allegations from Houston-Area Woman was originally published on theboxhouston.com",
  "word_count": 826,
  "scraped_at": "2026-02-14T14:15:04.540666"
}