{
  "article_id": "9417c55c1e50",
  "url": "https://www.dw.com/en/how-irelands-players-forced-change-and-won-a-world-cup-spot/a-64961741",
  "title": "How Ireland players forced change and won a World Cup spot – DW – 03 / 13 / 2023",
  "date": "20230313T123000Z",
  "domain": "dw.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How Ireland's players forced change and won a World Cup spot\nJuly 19, 2023Canada, Nigeria and Spain are among those at war with their own federations as the Women's World Cup begins. The fight is familiar to Aine O'Gorman and Louise Quinn, whose Ireland team offer an example of how to move on.\nWith her country having fallen short of another World Cup, Ireland's Aine O'Gorman was done.\nAfter 12 years, 100 caps and a long battle for equality with her own federation that caught the world's attention, O'Gorman called time on her international career in 2018.\nFive years later, she's starting to think about a World Cup debut in front of 80,000 fans in, and against, Australia on the opening day of the tournament, on Thursday. But perhaps more importantly, her courage — and that of her teammates back in 2017 — has changed the landscape for women playing in Ireland.\n\"I always thought it was possible to have a professional setup in Ireland,\" she told DW a few days after she scored a last-minute winner for the re-formed Shamrock Rovers in the first round of the newly professionalized Women's National League in early March. \"I think it takes someone just to lead the way.\"\nThough she was referring to her club, the league and its administrators, O'Gorman's part in the widespread changes that have led Ireland to the biggest stage is not to be underestimated.\nPlayer power\nShe was one of the leading faces and voices of the Irish squad that reluctantly threatened to boycott a 2017 match against Slovakia in protest of their treatment by the Football Association of Ireland (FAI). Players complained publicly of having to change in public toilets on the way to matches and share tracksuits with youth squads.\nThat protest and press conference, which drew global media attention, was one of the key factors in a revolution in women's football in Ireland. Subsequently, a raft of institutional changes, including the resignation of controversial former CEO and UEFA Executive Committee member John Delaney, led to an equal pay deal signed in 2021.\nFor Louise Quinn, another veteran of the Irish squad at the forefront of the battle in 2017, the spirit forged in that adversity remains a driving force.\n\"We stuck together, everyone was singing from the same hymn sheet, and we just wanted better for ourselves and better for women's football,\" the 33-year-old told DW at Ireland's World Cup training base near Brisbane. \"That bond is unbreakable. Whether you've had one cap, over 100 caps, it doesn't matter. Once you've come into this team, you're an Irish player for life.\nThat the Irish pair would be at a World Cup on the other side of the world at a modern facility and with ample preparation time would have been unthinkable six years ago.\n\"Conditions have improved massively, we have the full backing of the FAI and great sponsors on board. But it's still hard to believe that we're going to a World Cup,\" added O'Gorman.\nThat's particularly true for her. Having quit the international scene five years ago, the 33-year-old was tempted back in 2020 by the changes at the FAI and the overtures of Dutch coach Vera Pauw. Now her country's third most-capped player, O'Gorman was picked by Pauw for the 1-0 playoff win over Scotland last year that made Irish footballing history.\nThat Ireland, and O'Gorman, could find a path forward from the depths of 2017 seems particularly pertinent in a World Cup year that's been dominated by stories of international sides fighting their own federations. France and Spain were involved in huge public disputes between players and staff, a pay dispute threatens to undermine Nigeria, while Canada's players wanted to go on strike against their own federation. They were subsequently backed in their position, which bears some similarity to Ireland's in 2017, by world champions the USA and European champions, England.\nWorldwide impact\nO'Gorman is disappointed to see such prominent countries still fighting the same battles she and her teammates won but sees hope in the Irish victory.\n\"I don't think we were really aware of the impact until it all kicked off and we got the global support,\" she said. \"Anything is possible, I think, when you stick together and have the same goal to better their conditions.\"\n\"The fact we've even seen the USA have to go through a CBA [collective bargaining agreement] and the Canadian team going through what they are ... that's the world champions and the Olympic champions. It shows you have to keep pushing and improving on it.\"\nThe stand that O'Gorman and her teammates took back then was also about future generations, she added. She is one of only two domestic-based players in an Ireland squad that will also face Nigeria and Canada in Group B, with the rest spread around the English, German, American, Scottish and Belgian leagues.\nShe hopes that won't be the case for long, with clubs like Shamrock Rovers offering \"more opportunity now for players to stay in Ireland and play at a good level.\"\nPreparations for their World Cup opener against hosts Australia on Thursday are ramping up, and so is the anticipation down the coast in Sydney.\n\"We're playing in an 80,000 seater stadium [Sydney's Olympic stadium] in the first game and we're expecting probably half of that to be full of green. So it's going to be a really special occasion and one that us players are cannot wait for.\"\nIt's hard to argue that Ireland haven't earned it.",
  "word_count": 923,
  "scraped_at": "2026-02-14T12:45:13.255990"
}