{
  "article_id": "9428c541ac80",
  "url": "https://www.enca.com/enca-news-bite-26-january-2026",
  "title": "eNCA News Bite - 26 January 2026",
  "date": "20260126T180000Z",
  "domain": "enca.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Stay informed in just a few minutes with News Bite, your fast, reliable update on South Africa and the world.\nIn today’s episode, Major General Anthony Gopal is in the hotseat as the Madlanga Commission resumes, with the inquiry opening its first hearings of the year. The commission is investigating allegations of interference and corruption within the criminal justice system, with a focus on alleged political meddling in the disbandment of the Political Killings Task Team. Gopal, the Acting Deputy Commissioner for Crime Detection in KwaZulu-Natal, told the commission that suspended Police Minister Senzo Mchunu had access to case dockets linked to politically motivated killings.\nIn the United States, Minnesota Governor Tim Walz has called on Donald Trump to withdraw ICE, accusing immigration enforcement officers of an “organised campaign of brutality” after another deadly shooting in Minneapolis. Walz’s comments follow the killing of 37-year-old ICU nurse Alex Pretti, who was shot by ICE agents while filming an arrest and attempting to shield a female observer. Authorities say ten shots were fired in five seconds, while the White House insists agents acted in self-defence. Protests have since erupted across the city.\nAt the Beitbridge border post, more than 50 children have been intercepted travelling without parents or guardians, prompting South Africa and Zimbabwe to step up efforts to combat the trafficking of undocumented minors. Border Management Authority commissioner Mike Masiapato has warned that parents and facilitators could face jail time.\nIn Durban, frustrated residents have formed a new political movement, saying they are tired of failing basic services in one of South Africa’s biggest tourism hubs. The eThekwini Ratepayers Political Movement plans to contest the upcoming local government elections, arguing that service delivery failures have pushed citizens to organise politically.\nIn other news, we’re keeping an eye on…\n· The suspect in the DJ Warras murder has been denied bail in the Johannesburg Magistrates Court and will remain in custody until February.\n· Tiffany Meek is back in court for a pre-trial hearing, facing charges linked to the killing of her 11-year-old son Jayden-Lee in Roodepoort.\n· In the Western Cape, the case against Bheki Manxiwa, accused of a mass murder in Philippi East, has been postponed. The 19-year-old faces nine counts of murder and attempted murder.\n· In Mozambique, more than 125 people have died in catastrophic floods, with over 640,000 affected as swollen rivers submerge towns and major roads. International rescue teams from South Africa, Brazil and the UK are assisting.\n· On the markets, the rand continues its rally against the US dollar, strengthening to nearly R16 and gaining more than 14 percent year-on-year.\nSPORTS\n· Sunrisers Eastern Cape have been crowned SA20 champions, chasing down a target of 159 to beat the Pretoria Capitals by six wickets at Newlands. Captain Aiden Markram and Matthew Breetzke anchored the run chase, while Dewald Brevis’ century proved not enough for the Capitals.\n· In football, Manchester United secured a dramatic 3–2 comeback win over Arsenal in the English Premier League, continuing their mini-revival under caretaker manager Michael Carrick.\n· Closer to home, Kaizer Chiefs have kept their CAF Confederation Cup campaign alive with a 1–0 win over Zesco United in Zambia.\n· At the Australian Open, Novak Djokovic advanced to the quarterfinals without playing, after Jakub Mensik withdrew due to injury. Carlos Alcaraz powered through in straight sets, while Coco Gauff and Aryna Sabalenka booked their places in the final eight of the women’s draw.\nThat is your News Bite for 26 January 2026. For developments on these stories and more, visit enca.com or watch eNCA on DStv Channel 403.",
  "word_count": 600,
  "scraped_at": "2026-02-14T12:38:38.965743"
}