{
  "article_id": "94964cd930e1",
  "url": "https://www.thecrimson.com/article/2023/9/22/wsoc-update-092122/",
  "title": "Set for Massive Conference Opener , Harvard Women Soccer Improves to 5 - 2 - 1 | Sports",
  "date": "20230922T050000Z",
  "domain": "thecrimson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "News\nJeffrey Epstein, Gerald Chan Coordinated on Proposed Tsinghua University Campus in Boston\nNews\nHarvard Faculty Cut A Grades by Nearly 7 Percentage Points in Fall\nNews\nSeven Harvard Affiliates Named 2027 Schwarzman Scholars\nNews\nPublic Health Faculty Slam Harvard’s Removal of FXB Center Director Mary Bassett\nNews\nA Double-Edged Sword? Double Concentrations Create Both Pressure and Opportunity for Harvard Students\nThen-junior defender Taylor Fasnacht drives the ball out of the defensive zone during Harvard's Nov. 5 game against Columbia in 2022, where the Crimson defeated the Lions 5-0. By Zing Gee\nBy Alexander K. Bell, Crimson Staff Writer\nAfter returning from a trip to California which included a last minute 3-2 loss to Long Beach State (5-3-2) and a hard-fought 1-1 draw with Pepperdine (2-2-5), Harvard women’s soccer looked ecstatic to be back at Jordan Field. With four games in the span of ten days, Harvard posted three consecutive home wins before falling on the road at St. John’s in a tense 4-3 thriller. The Crimson scored 15 goals across those four games and recorded shutouts against North Carolina State (1-5-3) and Samford (4-2-3), leaving the team with a great deal to think about heading into the start of the Ivy League season this Saturday with a key matchup against rival Brown.\nHarvard vs. Syracuse, 5-2\nOn its return to Cambridge, Harvard set a high tempo from the opening whistle in its matchup against the Orange (2-6-1). Only 12 minutes into the game, the early Crimson pressure was rewarded.\nAfter being set free by a long ball down the right flank from senior midfielder Gabby DelPico, senior defender Smith Hunter blitzed to the endline to deliver a cross into the box. Senior forward Ava Lung broke free from her mark at the back post and rose high to decisively head the ball into the back of the net, putting the Crimson up 1-0.\n“It was exciting,” Lung reflected. “It was a really great build up play overall starting from the back. Smith made a great run down the side and I got to the back post in time so, it is an exciting feeling, the first goal of the season, for sure.”\nSyracuse responded immediately, forcing senior goalkeeper Anna Karpenko to make a save. However, less than three minutes after the first goal of the contest, Harvard found itself on the break again, this time attacking up the middle of the field.\nWith a sequence of quick passes, first-year forward Ólöf Kristinsdóttir played the ball into junior midfielder Hannah Bebar. With her back to goal, Bebar took two quick touches to the right, creating enough space between her defender to swivel and smash a shot into the bottom right corner. The goal was the first of the season for the 2022-23 unanimously selected All-Ivy First-Team midfielder. Bebar showed her class again ten minutes later, pouncing on a low cross at the back post to fire her second goal of the game into the roof of the net and put the Crimson up 3-0 25 minutes in.\nHarvard opened the second half similarly to how it started the first. In the 57th minute, first-year midfielder Susie Long gathered a ball from Kristinsdóttir on the edge of the 18 yard box. Taking one touch to set herself, Long belted a curling left-footed strike over the outstretched Syracuse keeper, who could do nothing but watch the ball fly into the back of her net. The emphatic goal sent Long running to the Crimson bench to celebrate, with a Harvard win all but certain.\nThe Orange pulled back two goals in the 67th and 73rd minute, but the Crimson rounded out a 5-2 win with a 78th minute goal by sophomore forward Audrey Francois off a second assist of the game from Lung. The five goals against Syracuse marked the most Harvard has scored against an ACC opponent since 1996.\nAdvertisement\nHarvard vs. North Carolina State, 2-0\nHarvard continued its stretch of home games three days after the win over Syracuse against fellow ACC opponent North Carolina State. On a rainy Sunday afternoon in Cambridge, the two teams went at it early, both creating chances, but without a goal. However, in the 21st minute, the game was suspended due to severe weather. The delay lasted for nearly two and a half hours, with the two teams resuming play around three hours after the initial 12:30 pm kickoff.\nThe Crimson came out ready to play and dominated offensively for the duration of the first half. With five minutes left in the first half, DelPico was brought down inside the penalty area. The Brockton, Mass. local stepped up to the spot and coolly shot the ball into the bottom left corner past the Wolfpack keeper who guessed the correct direction, but was unable to reach the powerful shot.\nTen minutes after halftime, Harvard was on the offensive again. Junior midfielder Josefine Hasbo chipped a pass over the NC State defense into Bebar, who fed a ball into the feet of DelPico. DelPico spun with the ball and released a sweet left-footed strike curling away from the Wolfpack keeper and into the far-side of the goal. The composed finish set the Crimson up for a convincing 2-0 win, as its defense refused to allow NC State a shot on goal for the duration of the game.\nDelPico has been in strong form lately. Her brace against North Carolina State and pair of assists against Syracuse earned her Ivy League Offensive Player of the Week Honors as well as a place on the College Soccer News National Team of the Week.\n“I think just having seen her grow and seeing her over the past five seasons now, it's really special to see how she's making such a positive impact on our team,” reflected Lung when asked about DelPico’s recent performances.\nHarvard vs. Samford, 5-0\nHeading into its Thursday night matchup with the Crimson, Samford had only allowed two goals in eight games this season. In the first ever meeting between the two teams, Harvard added five goals to that tally enroute to its biggest win of the season.\nThe Crimson recorded three first half goals from Lung, Hasbo, and Hunter while limiting the Bulldogs to just two shots. Kristinsdóttir added a fourth in the 76th minute, before junior forward Nicola Golen sealed the 5-0 win with a well taken penalty in the 81st minute. The goal for Kristinsdóttir was her third of the season. Kristinsdóttir is one of four players from Iceland playing for Harvard this year.\n“It's been fun, I've been really enjoying myself,” Kristinsdóttir said. “The team chemistry and the team spirit is really good. We've been a little unfortunate on some results, but that's just something we need to keep working and keep improving. I think we're improving every game, so we're always getting closer to our goal.”\nAdvertisement\nWith the win against Samford, Harvard has now scored 26 and conceded four in its past seven home games, giving it an impressive +22 goal differential at Jordan Field.\nHarvard vs. St. John’s, 3-4\nAfter three-consecutive wins at home, Harvard hit the road to take on St. Johns (5-1-2) in Queens, N.Y. The match sprung to life in the 28th minute when Kristinsdóttir opened the scoring against the Red Storm and then doubled her tally, and the Crimson lead, less than five-minutes later with another pin-point shot off of a Hasbo assist.\nIf Harvard caught St. John’s off guard with the two-quick-goals, the Red Storm certainly returned the favor. In the 38th minute, St. John cut the deficit to one after a saved shot fell into the path of junior midfielder Lauryn Tran. Exactly 50 seconds after that goal hit the net, the Red Storm tied the game off of another quick break. With less than a minute remaining until the half-time break, Harvard gifted St. John a penalty kick which graduate midfielder Jessica Garziano converted to take a 3-2 lead into the break.\nHarvard came out from half-time determined to get back into the game. Only a minute into the second half DelPico pounced on a mistake from the St. John’s goalkeeper, bringing the score level at 3-3.\nOn the 62nd minute mark, Tran scored her second of the game to put the Red Storm in the driver's seat once again. Despite outshooting its opponents 17-8, the Crimson couldn’t find a reply and lost the game 4-3.\n“I think that St. John's was able to provide us with a new challenge that we hadn't faced yet this season,” said Lung. “Obviously, this week, we looked at that and watched the film on it, and we're ready to learn from it. We know what we need to do to improve on those aspects.”\n“I think that again, although it's not the result that we wanted to end our non-conference play, it will help us a lot going forward into the Ivy League,” she added.\nDelPico (4G, 4A), Hasbo (4G, 4A), and Kristinsdóttir (5G, 2A) currently lead the team in points with 12 each, followed closely by Lung with (2G, 4A) and 8 points. Harvard will look to continue its excellent home form when it kicks off its Ivy-League campaign with a match-up against the three-time defending champion Brown this Saturday, September 23 at 7:00 PM EST on Jordan Field.\n“We are really, really excited. It's always great to play them and to play them this year in front of a home crowd will be especially exciting. I think we're really looking forward to it, especially as the Ivy League season opener,” said Lung.\nAdvertisement\n— Staff writer Alexander Bell can be reached at [email protected].\nWant to keep up with breaking news? Subscribe to our email newsletter.\nHave a tip for The Crimson? Share it confidentially.\nAdvertisement\nAdvertisement\nAdvertisement",
  "word_count": 1634,
  "scraped_at": "2026-02-14T12:15:15.777878"
}