{
  "article_id": "94aa2c596aaf",
  "url": "https://www.90min.com/erin-cuthbert-multi-year-contract-extension-chelsea",
  "title": "Erin Cuthbert pens multi - year contract extension with Chelsea",
  "date": "20250312T154500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Erin Cuthbert pens multi-year contract extension with Chelsea\n- Cuthbert signed with the Blues back in 2016 from Glasgow City\n- The midfielder has won 12 major trophies over 250 appearances for the club\n- 'I have fallen in love with the club and they have fallen in love with me'\nChelsea midfielder Erin Cuthbert has signed a new deal that will see her remain at the club until the summer of 2027.\nCuthbert signed for the west London outfit in 2016, and has since become Chelsea's second-longest serving player behind captain Millie Bright. The Scottish midfielder surpassed 250 appearances for the Blues this season.\nDuring her Chelsea tenure, Cuthbert has become one of the most decorated players in global football. She has played an integral role in six Women’s Super League (WSL) titles, four FA Cups and two League Cups.\n\"It's been eight years, but the feeling of playing for this club never goes away,\" Cuthbert told the club after penning her new deal.\n\"It's a good time to reflect on how far I've come over the last eight years. If you had said to the girl who joined Chelsea eight years ago that she would still be here, I wouldn't have believed you. I have fallen in love with a club and they have fallen in love with me. That's special.\"\nHead of women's football, Paul Green, said: \"Erin is one of the leaders in the team and now in her prime. She has been a key player in our success over the last eight years and recently surpassed 250 appearances for the club, which is testament to her reliability and consistency.\n\"We have seen her develop into one of the best central midfielders in the world and look forward to seeing her continue to progress in the upcoming years.\"\nThe Scottish midfielder has made 74 appearances on the international stage for her country, scoring 23 goals along the way. Cuthbert has starred in two major tournaments: the 2017 European Championships and the 2019 World Cup.\nThe 26-year-old will have the chance to chase more silverware with the west-London club as they come up against Manchester City in the final of the Subway Women's League Cup this Saturday at Derby County's Pride Park Stadium.",
  "word_count": 376,
  "scraped_at": "2026-02-14T12:35:03.599327"
}