{
  "article_id": "94b0d9920665",
  "url": "https://www.justarsenal.com/victoria-pelova-is-now-settled-and-ready-to-be-a-star-for-the-arsenal-women/353490",
  "title": "Victoria Pelova is now settled and ready to be a star for the Arsenal Women",
  "date": "20231116T160000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Victoria Pelova in fine form for Arsenal Women!\nThe 24-year-old, Dutch midfielder, Victoria Pelova, joined Jonas Eidevall and his Arsenal squad in January this year from the Dutch side Ajax. Since joining our Gooner women, she has been very impressive and even more so this season. Having a full preseason with the Arsenal Women and the Arsenal staff has clearly done her the world of good.\nPelova also had a very good Women’s World Cup tournament in Australia and New Zealand, where she helped her country go all the way to the Quarter finals where they were knocked out by the World Cup winner’s, Spain. Pelova herself picked up an assist against (at the time reigning World Cup champions) the USA but also got an assist in their Quarter final with Spain where The Netherlands and Pelova were narrowly knocked out by a late winner from Spain.\nComing back from the World cup, to her first full pre-season with the Arsenal squad seems to have been a great boost for her club football. Although we didn’t get that long or that many matches it seems to have made a big impact on how she’s playing with the group and now that the dust seems to be settled on a new season, Pelova looks to be at her very best.\nPlaying a huge part in Arsenal Women’s unbelievable comeback against Leicester City on the weekend, scoring a great goal and bagging two assists! After a beautifully worked move from back to front, Pelova managed to get on the end of a perfect pass from Cloe Lacasse. Only 15 minutes later Pelova put the ball through to the feet of Stina Blackstenius who buried the ball into the net to make it 5.\nIn the dying minutes of extra time, Pelova again puts an incredible ball through the Leicester defence onto the run of Lina Hurtig who smashed the ball past the Leicester City keeper to make it 6 and end the night with an incredible turnaround result. Pelova with an outstanding individual performance and pure will to try get her side back into what looked to be a bad day at the office.\nArsenal Women look to face off against Brighton on Sunday and the Gooner Women’s fans will be hoping Pelova can continue her good form, looking to be a key part of Eidevall’s set up going forward and a huge boost for our Gooner Women.\nWhat’s your thoughts on Pelova so far this season?\nDaisy Mae\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 448,
  "scraped_at": "2026-02-14T13:01:22.516609"
}