{
  "article_id": "94c6f8003994",
  "url": "https://www.lbc.co.uk/news/mohamed-al-fayed-labelled-monster-lawyers-representing-accusers/",
  "title": "Mohamed Al Fayed labelled  monster  and compared to Jimmy Savile by lawyers representing ... ",
  "date": "20240920T110000Z",
  "domain": "lbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mohamed Al Fayed described as ‘monster’ and compared to Jimmy Savile by lawyers representing his accusers\nMohamed Al Fayed has been described as a ‘monster’ by lawyers representing former Harrods employees who say they were victims of rape and sexual assault.\nListen to this article\nBarrister Dean Armstrong KC, representing Al Fayed’s accusers, described him as presiding over a ‘vast web of abuse’ and saying “I have many years of practice... I have never seen a case as horrific as this.”\nMr Armstrong said of the former Harrod's boss, who died last year at the age of 94: \"This case combines some of the most horrific elements of the cases involving Jimmy Savile, Jeffrey Epstein and Harvey Weinstein.\n\"Savile because in this case, as in that, the institution, we say, knew about the behaviour.\n\"Epstein because in that case, as in this, there was a procurement system in place to source the women and girls - as you know there are some very young victims.\n\"And Weinstein, because it was a person at the very top of the organisation who was abusing his power.\n\"We will say plainly, Mohammed Al Fayed was a monster.\"\nFive women alleged they had been raped by Mr Al Fayed, who died last year at the age of 94.\nHarrods' current owners said they are \"utterly appalled\" by the allegations of abuse perpetrated by the late billionaire, adding: \"As a business, we failed our employees who were his victims and for this, we sincerely apologise.\"\nAl Fayed used to own Premier League Fulham, today a spokesperson said: \"We are deeply troubled and concerned to learn of the disturbing reports following yesterday's documentary. We have sincere empathy for the women who have shared their experiences.\n\"We are in the process of establishing whether anyone at the club is or has been affected. Should any person wish to share information or experiences relating to these allegations, we encourage them to contact the club at safeguarding@fulhamfc.com or the police.\"\nBarrister Bruce Drummond told the press conference it is \"one of the worst cases of corporate sexual exploitation\" that he and \"perhaps the world has ever seen\".\nHe said: \"This is one of the worst cases of corporate sexual exploitation that certainly I, and perhaps the world has ever seen.\n\"It was absolutely horrific and I can't stress that word enough.\"\nHe added that \"the system that procured them was enabling the abuse\".\nMr Drummond said some of Mr Al Fayed's accusers have ended up in \"psychiatric care\".\nHe added: \"This should never have happened and Harrods must accept responsibility for the damage these women have suffered.\"\nOne of his alleged victims, who went by the name Natacha, told the press conference the billionaire businessman was \"highly manipulative\".\nShe said: \"Mohamed was clever and highly manipulative.\n\"He behaved like a father figure, often saying 'call me papa', often talking about his family and children, as if to make me feel safe around him.\"\nShe continued: \"Unbeknownst to me, I had walked into a lion's den, a layer of cover-ups, deceit, lies, manipulation, humiliation, and gross sexual misconduct.\n\"The chairman preyed on the most vulnerable, those of us who needed to pay the rent and some of us who didn't have parents to protect them.\"\nScotland Yard’s former head of royalty protection has revealed that he warned the late Queen about Al Fayed’s ‘salacious reputation.’\nDai Davies disclosed that police were first made aware of accusations against Al Fayed in the 1990s.\nHe said he warned an adviser to Queen Elizabeth II about his concerns - as Princess Diana, William and Harry were going on holiday with Al Fayed and his son Dodi before Diana’s death in 1997. He says his advice was ignored.\nMr Davies said: “Why wasn’t something done about it? There are clearly other victims out there.\nRead more: Inexperienced police 'lacking confidence' to use force - as assaults on officers soar\n“Why was it decided that they were not worthy of prosecution?”\nHe told the Daily Mail: “In 1997 there were already allegations he had been bribing MPs to table questions in the House and he had a salacious reputation. There were concerns about his persona as a dirty old man.\n“ There were allegations I was aware of that Al Fayed had sexually assaulted women then paid them off. I had no compunction in warning the Queen about this individual.\n“I advised the Queen, through Lord Fellowes [her private secretary], not to let the boys go away on holiday with him because of the allegations I was aware of – that he was a salacious attacker of women. “\nIn a statement, Harrods said: \"The Harrods of today is a very different organisation to the one owned and controlled by Al Fayed between 1985 and 2010, it is one that seeks to put the welfare of our employees at the heart of everything we do.\n\"This is why, since new information came to light in 2023 about historic allegations of sexual abuse by Al Fayed, it has been our priority to settle claims in the quickest way possible, avoiding lengthy legal proceedings for the women involved.\n\"This process is still available for any current or former Harrods employees.\"\nMr Al Fayed was born in the Egyptian city of Alexandria and came to London in the 1960s and set about building a business empire.\nHe took control of Harrods in 1985 and later expanded his business interests to include the Paris Ritz and Fulham Football Club.\nThe tycoon was rarely out of the newspapers, with his most public attack on the House of Windsor and the Establishment over the death of his son and heir Dodi - alongside Diana, Princess of Wales, in the world's most famous car crash.\nHe spent a decade after the lovers' 1997 deaths in Paris's Alma tunnel repeatedly claiming that they were murdered in a plot by the security services and the Duke of Edinburgh.\nBut he was forced to reluctantly concede defeat after a high-profile six-month inquest in 2007 and 2008.\nThe billionaire's relationship with the royal family was depicted in season five of The Crown, where Mr Al Fayed, played by Salim Daw, was seen getting to know Diana.\nMr Al Fayed had previously been accused of sexually assaulting and groping multiple women, but a 2015 police investigation did not lead to any charges.",
  "word_count": 1065,
  "scraped_at": "2026-02-14T14:14:42.756391"
}