{
  "article_id": "94f3996e1098",
  "url": "https://theamericanscholar.org/renaissance-man/",
  "title": "Renaissance Man - The American Scholar",
  "date": "20251201T053000Z",
  "domain": "theamericanscholar.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Renaissance Man\nDoctor, writer, musician, and orator: Rudolph Fisher was a scientist and an artist whose métier was Harlem\n“Let Paul Robeson singing Water Boy and Rudolph Fisher writing about the streets of Harlem … cause the smug Negro middle class to turn from their white, respectable, ordinary books and papers to catch a glimmer of their own beauty.” So wrote Langston Hughes in his landmark 1926 essay “The Negro Artist and the Racial Mountain.” Today, Paul Robeson—singer, actor, athlete, lawyer, antiracism icon—needs no introduction. But who was Rudolph Fisher?\nYou would not have had to ask in 1926. Rudolph John Chauncey Fisher was one of the brightest figures of the Harlem Renaissance. Hughes described him as the “wittiest of these New Negroes of Harlem whose tongue was flavored with the sharpest and saltiest humor. … [He] always frightened me a little, because he could think of the most incisively clever things to say—and I could never think of anything to answer.” Although his star has been eclipsed by Zora Neale Hurston, W. E. B. Du Bois, Alain Locke, and Hughes himself, Fisher once blazed at the center of this pantheon as a masterly author of short fiction and novels; as a polymath who excelled in science, music, and oratory; and as a physician.\nMy interest in Fisher’s life and work dates from the 1960s, when I began college well equipped to undertake premedical studies. I had the requisite high standardized-test and AP scores, yet I was met with discouragement at every turn. Professors ejected me from classes because they did not believe that my AP scores had in fact qualified me for higher-level coursework. Counselors showed me medical-school catalogs announcing that Negro applicants were not considered. Those same counselors repeatedly told me that my goal was unrealistic because there had never been a Black woman doctor. It sounds incredible now, but I believed them: I had never met one.\nI determined instead to somehow combine my loves of medicine and literature to write about science. I didn’t tell any counselor of my new ambition—I had learned my lesson—but I had been infected by doubt, and confidence was scarce.\nI focused on medieval and 18th-century English literature, but the year before graduation, I was reminded that I needed to take at least one American literature class. I chose a course on the Harlem Renaissance taught by Margaret Perry, who was preparing an edited volume of Rudolph Fisher’s short fiction. Her course was a revelation, and I will forever be grateful to her for introducing me to an elite stratum of African-American literary and scientific achievement that had been conspicuously absent from my education and intellectual life. Fisher, I realized, was the very real embodiment of my aspirations.\nThere was no question of my reaching his heights, of course, but he showed me what could be done and demonstrated the insignificance of race, which loomed so large in people’s assessment of me. What resurrected my hopes and energies was Fisher’s confident model, true to his goals and gifts. For the first time, I hoped that in my own modest way, I could be true to mine.\nFisher’s name and oeuvre are inseparable from Harlem, but he was born in Washington, D.C., on May 9, 1897, to Baptist minister John Wesley Fisher and schoolteacher Glendora Fisher. At the time of his birth, Rudolph had a teenage brother, Joseph, and an adolescent sister, Pearl. He was still a young boy when the family moved to Manhattan, to a spacious apartment in a German immigrant neighborhood at Seventh Avenue and West 33rd Street. West Indians, Great Migration refugees from the South, and native New Yorkers dwelt there in convivial equilibrium for years—that is, until August 1900, when a white police officer was killed following an altercation with a Black man. A mob of violent whites swiftly descended on the neighborhood, assaulting Black residents with clubs and demanding lynchings. Most of the assailed fled to Harlem.\nThe Reverend Fisher, however, heeded his church’s call to move to Providence, Rhode Island. There he established the Macedonia Baptist Church in another European immigrant neighborhood. In New England, Rudolph proved a popular and prodigious student as well as a gifted pianist. He eventually enrolled at Classical High School, where he studied German, participated on the debate team, and sang Schubert lieder in his fine baritone. His gifts for literature and oration emerged early, and fellow students dubbed him a “silver-tongued orator” and “the genius of the class.”\nBut no one called him Rudolph. His good-natured but rapier-sharp wit earned him the nickname Bud, after cartoonist Bud Fisher, creator of the era’s ubiquitous Mutt and Jeff series.\nStellar grades led to Bud’s 1915 admittance to Brown University as one of two African-American scholarship students. As he thrived in academia, his family maintained warm, respectful relations with its Teutonic neighbors despite growing frictions between America and Germany. Outside the neighborhood, however, longstanding racial violence roiled Providence’s streets, abetted by the arrival of Great Migration refugees who gained access to schools, jobs, and housing that had previously been the exclusive domain of the white population.\nRhode Island, the smallest state in the union, is often regarded as placid and staid, but this image belies the outsize history of racial subjugation and strife suggested by its original name, the State of Rhode Island and Providence Plantations; not until 2020 did voters finally approve a constitutional amendment to drop the words and Providence Plantations. In 1824, a white mob in Providence attacked the Black neighborhood of Hard Scrabble as the town watch refused to intervene. The city’s population quadrupled between 1850 and 1900, with immigrants transforming its largely WASPy character. By the time the Fishers arrived, white mobs, undeterred by police, had repeatedly attacked its flourishing Black neighborhoods. After the police killed a Black man under suspicious circumstances in 1917, 1,800 Black citizens marched on City Hall to demand justice. Strident calls for Black Rhode Islanders to arm themselves were tempered by calls for calm from the Reverend Fisher and other members of the Black clergy.\nAmid this turmoil, Bud took a singular stance, predicated on both the Christian values promulgated by his minister father and his optimistic faith in logic. He was just 20 years old and a sophomore at Brown, but he organized a daylong public forum for the city’s residents to discuss and debate the best way to achieve positive change. His agenda for this formal workshop, which was replete with a program of inspirational music, gave representatives from all sides the opportunity to make their cases and air their grievances. Bud’s deliberate, cerebral response presaged his future pattern of inclusive optimism in the face of racial tension.\nIn 1917, the United States entered World War I, and Bud’s brother, Joseph, soon joined the Army in Europe. By May, the Selective Service Act of 1917 was passed, conscripting all men between the ages of 18 and 45, including students. During his junior year, Bud trained with other Brown students, donning a uniform to engage in military exercises as they awaited their call to arms. Some seniors were already at the front; not all would return.\nAround the time Bud began his senior year, an even more horrific foe leered: the 1918–20 influenza pandemic. Nobody was safe, whether on the battlefield or back home: young and old, enfeebled and healthy. And though everyone suffered, evidence abounds that African Americans had an especially hard time, with de jure racial segregation barring access to hospitals. As with Covid-19 a century later, the 1918 pandemic wrought higher rates of disease and death among African Americans. Providence’s overwhelmed hospitals shut their doors, and Brown University locked its campus gates, imposing a quarantine enforced by armed guards. Roughly one in every three people on the globe was infected, and some 50 million to 100 million people died, making this one of the deadliest pandemics in recorded history, rivaled only by the plague of Justinian and the Black Death. As deaths mounted and fear spread, the armistice that ended World War I on November 11, 1918, seemed a hollow denouement, although Joseph returned home in December to a jubilant welcome.\nOne of those stricken by influenza was the Reverend Fisher, who was wracked by coughing, weakness, and fever for weeks, then months. When these symptoms did not abate, Bud confided to friends that he was troubled and frustrated by his inability to help his father. What he could do, he decided, was become a physician and wage war not only against disease but also against racial marginalization.\nThese goals seemed well within reach. Besides the honors English and biology degrees he would soon earn at Brown, Bud was graduating Phi Beta Kappa, Delta Sigma Rho, and Sigma Xi. He had distinguished himself as a writer, a polyglot, and an orator, delivering speeches that won several senior oration prizes.\nOne accolade, the Caesar Misch Prize, was awarded for a speech Bud delivered in flawless German. Some parents expressed outrage, arguing that Bud had to have been a native speaker of German (some Afro-Germans had made their way to the United States in the 1920s) and had thus exploited an unfair advantage over their own “American” children. How else to explain Bud’s impeccable accent and perfect command of idiomatic German? This early example of “birtherism” was quickly put to rest, but it was all the more absurd given that Bud had grown up in Providence and that his family was well-known there.\nBrown University’s June 1919 commencement was a somber affair. A grave march played by a brass band replaced the usual jubilant pomp as Bud, the valedictorian, led fellow graduates to the site where an honor guard placed 42 stars commemorating the Brown students and faculty members who had died from the war and disease. Bud ascended the podium to deliver his valedictory address, “The Emancipation of Science,” expounding on a subject that would dominate his life’s work—his belief in the compatibility, even unity, of morality and science:\nAs thinking Christians, we strive not to bring men to heaven, but to bring heaven to men, and with that the aim of science is identical. It is the oneness of purpose that brings science and religion into harmony—a harmony which permits science to devote its energies not to self-protection, but to the making of life worth living. … Science is at last free to serve mankind. Is there any finer liberty than that?\nBud remained at Brown another year to complete the master’s degree in biology that would satisfy his medical school application requirements, and his proud father supported his career decision, although both knew that obtaining the necessary financial support would require prayer and inventiveness.\nSix weeks later, however, the Reverend Fisher died.\nTo support the family, Bud’s mother, Glendora, moved back to New York City to work at the Colored Orphan Asylum in the Bronx, and his sister, Pearl, enrolled in a Baltimore teacher’s college.\nIn 1920, Bud earned his master’s degree in biology and applied to medical school, an ambition that presented an assortment of challenges. African Americans had studied and practiced medicine since well before Emancipation, but few mainstream schools of medicine would admit Black applicants. Meanwhile, Black students were disparaged as undisciplined, insufficiently intelligent, and prone to sexual and moral misconduct. Many schools refused applications on the grounds that Black men posed a sexual threat to white women patients. Graduate Black physicians were routinely accused of being unskilled purveyors of illicit alcohol, drugs, and abortions.\nMarginalization by the powerful American Medical Association was another hurdle for early-20th-century Black physicians. AMA membership was then necessary to achieve official proficiency in a specialty, to earn board certification, or to practice in a mainstream hospital, and many AMA chapters, as well as the constituent societies that fed them, did not accept Black physicians as members. In 1910, 3,600 Black physicians were in practice, although few had access to research, specialty training, or hospital privileges. (Even Harlem Hospital had no Black physicians until Bud’s friend Louis T. Wright joined the outpatient department in 1919.) And it was in 1910 that the AMA commissioned Medical Education in the United States and Canada: A Report to the Carnegie Foundation for the Advancement of Teaching. Known as the Flexner Report, this document was ostensibly intended to standardize and elevate medical education, using Johns Hopkins Medical School as a template. What it also did was denigrate Black physicians and Black medical schools and successfully recommend the closure of all but two of them—Howard and Meharry. A 2020 JAMA study found that the consequences were long-term: The shuttering of most Black medical schools in America resulted in 35,315 fewer physicians entering the practice.\nBud faced a barrier even more immediate than racism: money. He had easily gained admission to Howard Medical School, in Washington, D.C., but in an era that predated colorblind scholarships, becoming a physician was largely the province of men whose families could afford to support them in the prolonged fiscal adolescence that was medical school.\nHow would he pay?\nThe answer appeared in the form of a tall, thoughtful Rutgers student with a deep, resonant voice. At a regional Phi Beta Kappa meeting in the spring of 1920, Bud immediately recognized the only other Black attendee—Paul Robeson. The two had met briefly once before, but as they spent that evening together in deep discussion, they discovered much in common, including fathers who were ministers, a broad interest in literature and world affairs, and a passion for music.\nThe equally impecunious Robeson had been accepted to Columbia Law School, and the two of them seized on a plan: Why not perform together as musicians over the summer, making a circuit of the East Coast to earn money for the coming academic year? When the duo went to New York, performing at Harlem’s all-Black cabarets, Bud fell ever more deeply in love with the neighborhood’s vibrant culture. This is how he earned the tuition for his first year of medical school: by singing, playing the piano, and arranging music. Once Bud was ensconced in Howard Medical School, he supplemented his meager funds by working as a campus night watchman. He also economized by living with Pearl in nearby Baltimore.\nOnce again, Bud excelled in his studies, and free from the wartime obligations that had haunted his undergraduate career, he found time to frequent lectures and salons hosted by intellectuals such as W. E. B. Du Bois and Alain Locke, a Harvard philosophy PhD who in 1907 had become the first African-American Rhodes Scholar and would later be recognized as the “philosophical architect of the Harlem Renaissance.” Bud gravitated to him first as a mentor and later as a peer. Bud also embraced the back-to-Africa movement of Marcus Garvey, announcing to friends, and later in the 1924 Howard Medical School yearbook, that he planned to practice in Egypt after he finished training. He played intramural football and, more significantly, embarked on a rich literary life, sitting at the feet of Locke and attending the Saturday night salons hosted by the staff of The Stylus, Howard’s literary magazine. There, he forged lifelong friendships with Langston Hughes, Jessie Fauset, Countee Cullen, Wallace Thurman, May Miller, and especially his kindred spirit, Stylus editor Zora Neale Hurston. Neither Bud nor Hurston felt the need to confine their writings to works and characters that would “uplift the race,” and neither shied away from rich portrayals of lower-class Black life that many other writers found embarrassingly “primitive.” With their shared literary sensibilities and ambitions, they forged an intimate bond that was to flower when both moved to Harlem after graduation.\nBud’s musical earnings barely lasted the first year, and despite his excellent grades, there seemed no way to fund his next year of medical school. So he wrote to the dean, proposing that he be allowed to teach medical and nursing students their required biology courses, such as embryology. After all, he wrote, he had a master’s degree in biology. The dean accepted the offer with alacrity, and thus Bud became a paid instructor in the medical school where he was already a student.\nOn a blustery day in late 1921, at the Washington home of his friend John George, Bud met a schoolteacher named Jane Ryder. Jane was bright and beautiful, tall and willowy. She laughed easily and could match his wit. Bud was enchanted. Seventy-two years later, at the age of 99, Jane would vividly recall that first meeting:\nI remember coming downstairs and I was carrying these roses and when we got downstairs … these two fellows were there and they were standing to greet us. Bud was so big, and it was a blizzard day. He had on this huge overcoat. It was so big, and of course I guess I must have made quite an impression because as I remember, I was dressed for the summertime and I had on this summer outfit and this vase of beautiful roses. When he accepted the introduction to me he just gazed at me as I remember, and very formally bowed and spoke. I thought: “Oh boy! What do we have here?”\nThey spent the afternoon together, and Bud took her to a show and dinner that very night. “It was quite an afternoon and evening,” Jane recalled. “So that was that, and after that I saw quite a great deal of him.”\nThey were married in September 1923. Bud hadn’t yet decided on a specialty, but that changed when Howard professor B. Price Hurst persuaded him to enter the nascent field of radiology. Bud’s decision would inform his writing as well as his practice.\nThe next year, Bud graduated summa cum laude from Howard Medical School. Almost simultaneously, his first short story, “The City of Refuge,” was published in The Atlantic Monthly. The story chronicled the deception, manipulation, and fall of the gullible young rube King Solomon Gillis, a refugee from the South eager to make his fortune in the Harlem he envisions as a mecca of Black freedom and power—where even the police officers are Black men. Solomon is quickly set upon and manipulated into criminality by predatory Black “advisors.” “The City of Refuge” introduced what was to be a common theme of Bud’s short fiction: how the perils of modernity threatened pilgrims of the Great Migration. The naïfs who populate Bud’s stories often flee the oppressive South to seek refuge in the Promised Land of Harlem but find its fabled Black autonomy, abundance, and dignity either wholly illusory or alloyed with spiritual degradation, deception, and danger.\nBeginning in 1924, Bud interned for a year at Washington’s Freedmen’s Hospital, founded by the Union Army in 1862 to provide medical care for those who escaped enslavement during the Civil War. By the end of July, he had completed his residency and qualified as a radiologist.\nThe Fisher family had been scattered during the five years since the Reverend Fisher’s death, but as Jane recalled, “Glendora aimed to have all her children together, without asking us anything about it.”\nIn October 1925, a brownstone on St. Nicholas Avenue near 145th Street became the site of the Fishers’ reunion when Bud and Jane moved into an eight-room apartment that they shared with Glendora and Pearl, who had recently arrived from Baltimore. Though Joseph and his wife declined Glendora’s invitation to join them, Paul Robeson lived on the building’s top floor with his wife, Eslanda. He and Bud quickly resumed their nightly forays into Harlem’s clubs, dance halls, and speakeasies.\nBud received a National Council Foundation Fellowship for study at Columbia University, supporting his research into radiation’s effects on bacteriophages, the viruses that were used to treat infectious diseases before Alexander Fleming’s 1928 discovery of penicillin launched the era of antibiotics. After publishing his findings in the Journal of Infectious Diseases, he promptly won another fellowship, which funded his research into ultraviolet rays. He published his results in the Proceedings of the Society of Experimental Biology and Medicine. Bud simultaneously practiced medicine at Mount Sinai and Montefiore hospitals, and as his medical career flourished, he would rise at four a.m. to steal time for his literary pursuits.\nFifteen of his short stories and essays appeared in publications such as Opportunity, The Crisis, Story, McCall’s, and The Atlantic Monthly, as well as in Harlem Renaissance anthologies like Fire. He enjoyed literary friendships with Hubert Delany, Langston Hughes, Wallace Thurman, and especially his confidantes Hurston and Carl Van Vechten. The New Negro movement now blazed not just in Harlem but also in Paris, Chicago, and the Caribbean.\nThe year 1926 brought Bud and Jane a son, whom they named Hugh and whom Bud jocularly dubbed their very own “New Negro.” Bud established both a private medical practice on Long Island and a radiologic laboratory in Harlem. He was elected head of the department of roentgenology (another word for radiology) at the International Hospital in Jamaica, Queens, defying the oft-invoked contention within medical circles that Black physicians lack the acumen to manage medical staffs and hospitals. In this and other ways, Bud and other Black doctors shouldered a dual responsibility. As historian of medicine Adam Biggs writes:\nNot only were [Black doctors] tasked with meeting the varied healthcare needs of African American communities, but [they] played a major role in facilitating the larger cause of racial improvement. Embodying the Progressive Era ideals of character, discipline, refinement, and purity, New Negro doctors emerged in this period as representative “race men” and prominent symbols of hope to black communities suffering from the pangs of Jim Crow discrimination.\nBud’s chief ambition had become not medicine or music but Harlem itself, as he said in a radio interview in 1933: “I intend to write whatever interests me. But if I should be fortunate enough to become known as Harlem’s interpreter, I should be very happy.” By every meaningful measure, he succeeded. The New York Times did indeed anoint him as “Harlem’s chronicler,” writing that “one feels, smells and tastes [Fisher’s] Harlem; its people come alive and one cares about them.”\nWith a light, ironic touch and a sense of satirical realism, Bud had lodged Harlem in the nation’s literary imagination the way Sinclair Lewis breathed life into the imaginary Midwest of Wheatsylvania and Hurston portrayed a rural Florida largely untroubled by whites. What bucolic Ohio was to Sherwood Anderson, what urban Dublin was to James Joyce, Harlem was to Rudolph Fisher.\nBy the mid-1920s, however, Bud was questioning his ability to gain the attention of critics and publishers who could open doors to influential outlets and allow him to produce book-length works. He confided his literary aspirations to Carl Van Vechten, the New York Times music and dance critic, author of seven novels, and close friend and literary executor of Gertrude Stein. Not only was Van Vechten connected to the New York literary scene, he also had many close friends among the Harlem Renaissance set and nursed a deep affinity for Harlem culture.\nToday, Van Vechten is perhaps best known as a prolific photographer. His collection of portraits of Jazz Age New Yorkers and other cultural icons included dozens of Harlem Renaissance figures. Van Vechten also promoted the careers of many of his subjects, including Robeson, Hurston, and Hughes. Others, however, such as Du Bois, distrusted him and what they considered his patronizing penchant for the primitive: They derided his “slumming.”\nIn the spring of 1926, Bud confessed to Van Vechten that because medicine absorbed so much of his time and because he had a family to support, he feared he would never be able to venture beyond the short story into the longer works he yearned to produce. Van Vechten said that he understood this anxiety, but he had every confidence that Bud would achieve his literary ambitions, including the novels within him. In May, Van Vechten helped catalyze this by inviting Bud and Jane to dinner at his home, where they hit it off with publishers Blanche and Alfred Knopf. The Knopfs admired Bud’s writing and in 1928 published his first novel, The Walls of Jericho, about the tensions culminating in the burning of the home of a Black lawyer who had the temerity to move into a white section of Manhattan.\nBud had a chance to return Van Vechten’s support after the 1926 publication of the latter’s perilously titled Nigger Heaven. Du Bois spoke for many when he castigated the floridly sexual melodrama as degrading. Although Hughes and Locke joined Bud in defending Van Vechten, the work cost him the respect and support of some Harlem friends. In some corners, Van Vechten became persona non grata. He was even banned from one corner of Harlem heaven: the Smalls’ Paradise nightclub.\nAlthough the frictions Bud portrayed in his fiction were often drawn from the headlines of the time, they rarely centered on Black-white tensions. He focused instead on intraracial conflicts among the various African-American groups striving for a toehold in the modern city—poor and rich, Caribbean and African, the Southern rube, the Northern sophisticate “striver,” the Great Migration refugee from the oppressive South. His superb ear for the music of each group’s speech and the slangy dialogue of the day is spot-on, but he also realized that much of this lingo, this “Harlemese” argot, would be lost on white readers. So in The Walls of Jericho, he provided an extensive glossary. Here uninitiated readers would learn, for example, that a dicty is an African-American snob of the middle to upper class and that a rat is not a loose-lipped Mafioso but any lower-class Black person, including one with impeccable morals.\nLimning these class frictions remained all but taboo within the New Negro movement, which supported “racial uplift,” expressed deep discomfort with the “Negro primitive,” and professed fidelity to Du Bois’s concept of the “Talented Tenth.” This ideal often slid into an endorsement of eugenics, as when Du Bois lamented that the “mass of ignorant Negroes still breed carelessly and disastrously, so that the increase among Negroes, even more than the increase among whites, is from that portion of the population least intelligent and fit, and least able to rear their children properly.” As a consequence, many Harlem Renaissance writers turned a blind eye to the undereducated lower classes. Portrayals of porters, maids, and laborers in pool halls and speakeasies, many felt, did little to elevate the image of the New Negro.\nIn reviewing The Walls of Jericho, Du Bois chided, “Mr. Fisher does not yet … write of himself and his own people; of Negroes like his mother, his sister and his wife. His real Harlem friends and his own soul nowhere yet appear in his pages, and nothing that can be mistaken for them. The glimpses of better class Negroes which he gives us are poor, ineffective make-believes. One wonders why?”\nDu Bois took issue with Bud’s failure to lionize the Negro crème de la crème—in short, with Bud’s refusal to be a racial propagandist. I don’t apply the propagandist label lightly: It is one from which Du Bois himself did not shy, declaring in his 1926 essay “Criteria of Negro Art” that “all Art is propaganda and ever must be, despite the wailing of the purists. I stand in utter shamelessness and say that whatever art I have for writing has been used always for propaganda for gaining the right of black folk to love and enjoy.”\nIn contrast, Hurston wrote to novelist Dorothy West in 1937 that “[Fisher] is greater than the Negroes rate him generally. That is because he is too honest to pander to our inferiority complex and write ‘race’ propaganda.”\nBud didn’t want to expunge whites from Harlem streets any more than he wanted to prevent them from understanding his fiction. But one of his best-known essays, “The Caucasian Storms Harlem,” indicts the growing white “tourist” presence in Harlem. Why?\nFirst, it is important to understand that the essay’s title was not Bud’s, but was imposed by its editor, H. L. Mencken. Bud’s original title was “The Complexion of the Negro Night Clubs”—no overt indictment of Caucasians. The essay had been purchased by Harper’s Bazaar, which set it in type and supplied Bud with a galley but did not publish it. Instead, Mencken published the essay in his magazine The American Mercury, under his preferred title. A letter in the Brown University archives reveals that an editor notified Bud of these changes but did not consult with him in advance: The changes were presented as a fait accompli.\nBut Bud’s 1927 essay does amply express his dismay and resentment over Harlem’s colonization by whites. He explains that not so long before, he and his friends had made Harlem their own, playing at and frequenting its all-Black musical haunts like the Stork Club, where they dined in a sea of familiar Black faces. They walked the colorful streets while rubbing shoulders with Black literati, lawyers, numbers runners, showgirls, and nuns. But returning to the neighborhood after five years, following his time in D.C., he now found this “home” often hostile to Black Harlemites.\nOn taking a table at his favorite cabaret, where he had expected to encounter members of his old set, Bud writes, he was astonished to discover that he was the only Black customer, and not a particularly welcome one. The formerly Black clubs were now wholly white. The famous Stork Club barred Black customers, in one infamous scandal ejecting the toast of Jazz Age Paris, Josephine Baker.\nBud lamented that too many whites, lacking Van Vechten’s genuine attraction to and respect for Black culture, now flocked uptown to chase the baser aspects of Harlem life. Attracted by illicit alcohol, women (and likely men) of easy virtue, and drugs, these dilettantes of sin often vanished with the morning into their respectable, monied, downtown lives, taking back with them reinforced prejudices about Black culture that they shared widely, sometimes in print.\nIf Bud was criticized for failing to use his fiction for the purposes of class uplift, his kindred spirit Hurston was being similarly censured for “exposing” aspects of African-American culture that some Black critics deemed unflattering. The Crisis, published by the NAACP, castigated Hurston’s literary depictions of voodoo as “sensationalist” and an example of “Negro primitivism” undertaken “in order to advance her own literary career.” The Journal of Negro History agreed that her anthropological and literary work on voodoo was “an indictment of African American ignorance and superstition.”\nHurston had done doctoral work in anthropology at Columbia, but the disparagement of her scientific perspective was not unusual. In 1913, James McKeen Cattell, editor of the influential journal Science, wrote, “There is not a single mulatto who has done creditable scientific work.” Such statements were not true. But they helped conceal African Americans’ contributions to science and technology during the Harlem Renaissance.\nAlthough Bud was arguably the most accomplished scientist and doctor of the movement, he was not the only one. Poet Henry Binga Dismond was a physician. Nella Larsen, who was half Danish, taught nursing at the New York City Department of Health and collaborated with her husband, Elmer Imes, a writer and physicist whose work provided an early verification of quantum theory. Paul Robeson’s accompanist May Chinn left her piano studies at Columbia to study medicine, becoming an oncologist who helped develop important techniques, such as the Pap smear. Then there were the African-American laboratory “garçons,” unsung Black scientists long whispered of in research circles who were immortalized in Sinclair Lewis’s novel Arrowsmith and whose stories have only emerged in recent decades. Surgical innovator Vivien Thomas, subject of the HBO movie Something the Lord Made, is the best-known example of such marginalized African-American medical innovators. Although hired and paid as a janitor at Johns Hopkins, Thomas partnered there with surgeon Alfred Blalock and cardiologist Helen B. Taussig to develop the Blalock-Thomas-Taussig shunt, used to treat cyanotic heart disease in infants.\nAll of these figures toiled against considerable odds. After all, champions of the New Negro knew that the “old negro”—a golem of brute strength and mental inferiority—was the product of racist myths “proven” by the medical science of the era. Racism, medical mistreatment, segregation, enslavement, and even lynching were predicated on illogical but potent medical mythologies concerning Black physiology, behavior, and character. The Harlem Renaissance writers who were also scientists or physicians often worked to counter this “science.”\nBud did so in a series of detective stories and novels featuring the Holmesian duo of Dr. John Archer and African-American police detective Perry Dart. Archer, Bud’s alter ego, ventriloquizes his creator’s scientific theories in the novel The Conjure-Man Dies—one of the first African-American detective novels, which discusses, among other things, blood typing and X-rays—and in several short stories. In “John Archer’s Nose,” for example, Archer laments the reason why his Black patients (in this case, a child with status lymphaticus, a thymus enlargement) shun curative radiology:\n“Could have cleared it up over night. What I couldn’t treat was the superstition of the parents. … The kid should have had X-ray treatments. Melt the thing away. … Most spectacular thing in medicine. But the old man wouldn’t hear of it.”\nThe young protagonist of another short story, “Skeeter,” harbors similar “superstition”: “Skeeter knew all about X-rays. They were mysterious and miraculous contrivances whereby you could see right through everything and everybody … all a man’s innermost secrets. No doubt by turning them on one’s head you could see all of one’s thoughts, also …” By the scene’s end, Skeeter runs, panicked, from the radiologic treatment room.\nBut the lure of the modern can play one false, and we know today that Archer, and by extension Bud, was wrong about the “enlarged thymus” diagnosis that he champions in the story and about the contention that X-rays, “the most spectacular thing in medicine,” would have cured the child. Bud was also wrong in attributing his patients’ fear of radiation to their “superstitious” natures. In truth, African-American fears about radiation therapy and its harms were far from baseless. They were rooted in well-documented medical biases.\nShortly after Wilhelm Roentgen’s 1895 discovery of X-rays, and without objective evidence, physicians asserted that dangerously higher doses of radiation would be necessary to examine and treat Black bodies because of their thicker, coarser skin and bones. By 1911, exceedingly high radiation doses were trained on Black patients to bleach their skin white, with disastrous medical results. The practice is satirized in George Samuel Schuyler’s 1931 novel Black No More. In Schuyler’s book, a doctor develops a process of “electrical nutrition and glandular control” by which African Americans can be made white, and the merciless sarcasm with which Schuyler limns the likely societal results spares no one. Schuyler portrays the social and economic disaster wrought on the country when the pool of Negroes to exploit dries up—ruining not only the government and institutions based on white hegemony but also African-American organizations such as the NAACP.\nThe Great Depression ultimately silenced the Harlem Renaissance: Many Black writers had depended on the patronage of white supporters, who now found themselves without disposable income. For Bud, however, the physician was patron to the writer, so his literary output remained unaffected. Even when the economic downturn forced him to close his medical practice and laboratory, the publication of The Conjure-Man Dies resulted in good sales, and his Dr. Archer character came at a propitious time, at the intersection of a waning Harlem Renaissance and an emerging golden age of detective fiction.\nSpurred by the popularity of The Conjure-Man Dies, Harlem’s Lafayette Theater commissioned a play based on the novel. Bud was writing the script in 1933, but he never finished: Suddenly, he was prostrated by a mysterious intestinal ailment, often thought to have been cancer caused by his decades of radiation exposure, although the late Calvin H. Sinnette—Bud’s biographer and himself a medical doctor—contested this, and I have found no evidence to support such a diagnosis.\nInstead, the recorded diagnoses included chronic gallbladder infection and a liver abscess. Bud’s friend Louis T. Wright of Harlem Hospital took over his care at Edgecombe Sanitarium in Harlem, and Bud underwent several operations.\nIn late December 1934, he collapsed again. Wright attended him personally through the long hours of Christmas Day, but on December 26, Bud died. He was only 37.\nAmid the flurry of telegraph messages sent to Jane Fisher was one from Zora Neale Hurston: “The world has lost a genius. You have lost a husband and I have lost a friend.” Officers of the famed 369th Infantry Regiment “Harlem Hellfighters,” in which Bud held the rank of lieutenant, graced his funeral with full military honors. Attendees included scores of physicians, writers, and common folk from Harlem and beyond. Medical student–turned–operatic star Jules Bledsoe sang an arrangement of Bud’s own religious music.\nRudolph “Bud” Fisher was laid to rest in Woodlawn Cemetery, in the Bronx, in the plot where his mother, brother, and son are also buried. In the years afterward, his sister, Pearl, and his son, Hugh, did much to manage his literary estate and keep his works in the public eye. But after Hugh died in 1964, most of Bud’s work fell out of print. After long decades of undeserved obscurity, his oeuvre has been reissued, to be discovered by new generations of readers. Italian, French, Turkish, and Portuguese translations have appeared, and the Library of Congress reissued The Conjure-Man Dies in 2022 as part of its Crime Classics series.\nI find it profoundly satisfying to celebrate Rudolph Fisher today as a genial polymath of rare achievement. Yet I think his significance, ironically, lies in the fact that he was not alone. It is important to remember not only his legacy but also the contributions of his fellow scientific and artistic adepts of the Harlem Renaissance—May Chinn, Louis T. Wright, and Henry Binga Dismond among them—to say nothing of the thousands of African-American physicians who practiced and elevated medicine despite the staggering number of barriers arrayed against them.",
  "word_count": 6339,
  "scraped_at": "2026-02-14T12:13:00.428179"
}