{
  "article_id": "94fea027520e",
  "url": "https://www.si.com/college/nebraska/volleyball/dave-feit-a-pivotal-time-for-huskers-volleyball-john-cook-dani-busboom-kelly",
  "title": "Dave Feit : A Pivotal Time for Nebraska Volleyball as a Torch is Passed",
  "date": "20250130T164500Z",
  "domain": "si.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Dave Feit: A Pivotal Time for Nebraska Volleyball as a Torch is Passed\nIn this story:\n\"What a ride it's been.\"\nThose words, in a tweet announcing John Cook's retirement, shocked Husker Nation on Wednesday afternoon. Twenty-one minutes later, as we were still processing what had just happened, Dani Busboom Kelly was announced as Nebraska's new head coach.\nThere is a lot to unpack and explore, so let's dig in on a few topics:\nI cannot stop thinking about the parallels between Nebraska volleyball and Nebraska football.\nBoth programs had their groundbreaking coach. The one who not only knew he could win championships here but actually went out and did it. Bob Devaney and Terry Pettit* were pioneers who put Nebraska firmly on the map.\n*Personally, I don't think we fully appreciate everything that Pettit did to take volleyball from glorified club sport to state-wide obsession, but that is a separate conversation for a different day.\nWhen Devaney and Pettit retired, they put their programs in the hands of a loyal assistant. Tom Osborne and John Cook both coached for 25 seasons, winning multiple national championships and taking their programs to unprecedented heights. Both retired at a relatively young age (Cook is 68, Osborne was 60) when it appeared they could continue coaching for several years (more on that in a bit).\nOsborne famously handpicked his successor (Frank Solich), who was the presumptive choice for the job. Cook has been a vocal supporter of Busboom Kelly, and I'm sure his voice was heard when a succession plan was discussed with his athletic directors (Troy Dannen, and Trev Alberts before him)\nSolich and Busboom Kelly are both products of their respective programs. Fearless Frankie the fullback played for Devaney in the 1960s and was a longtime assistant under Osborne. Dani Busboom was a setter and libero for Cook, helping him win his second national championship in 2006. As a Nebraska assistant for five seasons, she was on the bench for championship #3 (2015) and helped recruit the players for Nebraska's most recent title in 2017.\nIt's almost eerie how similar the tracks are between Nebraska's two premier programs.\nBut there's a big difference between Solich and Busboom Kelly.\nWhen he was promoted after the 1997 season, Frank Solich's head coaching experience was limited to high school (Omaha Holy Name and Lincoln Southeast) and four seasons with Nebraska's freshman team. This is not the time nor place to relitigate Frank's time as Nebraska's coach, so I'll simply note that he was fired for - in the opinion of his A.D. - not maintaining the standard the previous two coaches had set.\nBut Busboom Kelly's path to becoming Nebraska's head coach is vastly different. She has spent the last eight seasons as the head coach at Louisville. She has built that program into a power, first in the ACC (four conference championships), and then on the national stage. She took the Cardinals to three Final Fours and coached in the national championship match twice in the last three seasons.\nThere is a lot of pressure on the shoulders of the homegrown national champion who is coming home to take over a storied program. Wait, this analogy is about Solich, not Scott Frost. To be sure, Dani is walking into a pressure-filled fishbowl with a ton of high expectations. But she won't be learning on the job.\nNo disrespect toward Frank Solich (or any of his successors), but Dani Busboom Kelly is significantly more qualified to take over a program of Nebraska's caliber than any of the six football head coaches who have followed Tom Osborne.\nWhy is Cook retiring now?\nI don't think anybody - even those who are deeply tied to the volleyball program - saw Cook retiring now.\nHad Nebraska won the national championship in 2023, I expected Cook to walk away after a storybook season. It would have given the ESPN all-access documentary a Hollywood ending. But when he came back for 2024, I assumed he would stick around until his greatest recruiting class (Harper Murray, Andi Jackson, and Bergen Reilly) graduated after the 2026 season. I never thought a heartbreaking loss in the 2024 Final Four would be his final match.\nSo why now? I have three theories:\n- Cook wanted to bring Dani back to Nebraska before Louisville became her permanent home. Even a volleyball novice like me could see the powerful program Busboom Kelly was building. Her contract famously had a large buyout for every school - except for Nebraska. But was there a point on the horizon where she would decide that Louisville was where she wanted to finish her career? And was the day getting closer?\n- Cook wanted to leave the cupboard full for Dani. Revisiting that football analogy, there is one other big difference between Solich and Busboom Kelly. Osborne left at the end of a tremendous championship run, when many of the core players (Scott Frost, Ahman Green, Aaron Taylor, Grant Wistrom, Jason Peter, etc.) were leaving too. The 1998 team (9-4) lacked the established talent of the teams before or immediately after it. With Cook retiring now, Busboom Kelly is inheriting a roster that should be ranked - at worst - #5 in the preseason polls.\n- It was time. Cook is 68. He has grandkids, a ranch in Wyoming, and horses to tend to. He's earned the right to walk away on his terms.\nThe transition was amazingly smooth.\nThe timing of the announcements - and orchestration between the two programs - is impressive. There were no leaks. No rumors. When is the last time you could say that about a Nebraska coaching search? Do we have to go back to Osborne-Solich once again?\nAt Busboom Kelly's request, Cook met with Nebraska's players at the same time she was meeting with her team. I'm very impressed by her high attention to detail and desire to treat the players the right way. That is a positive first impression.\nIt has already been announced that top assistants Jaylen Reyes and Kelly Hunter are being retained. Although a coaching change reopens the transfer portal for Husker players, I don't expect a lot of movement.\nDon't read too much into Jordan Larson's departure from the program.\nOn the surface, it's easy to see this timeline and make some assumptions:\n- Friday: Cook and Busboom Kelly are seen together at the LOVB professional volleyball match in Omaha where Larson is playing.\n- Monday: Nebraska announces that Larson \"has decided to move on from being part of (the Nebraska) coaching staff\".\n- Wednesday: Cook announces his retirement. Twenty-one minutes later, Busboom Kelly is announced as the next head coach.\nLook at those dots! They would be so easy to connect!\nExcept, I do not believe Dani Busboom Kelly has anything to do with Jordan Larson leaving the Nebraska program.\nThe LOVB Omaha team has five former Huskers (and one Louisville Cardinal) on the roster. Their opponent (LOVB Madison) has the other two Cardinals in the league. It makes perfect sense for both coaches to be there. Did Busboom Kelly have other conversations with Cook and/or Troy Dannen while she was in town? Given the timing, that certainly seems likely.\nAs for Larson leaving the Nebraska staff, it makes sense to me. Consider Larson's last nine months: Assistant at Nebraska. Training for the Olympics. Leave for Paris to help the U.S. win the silver medal. Come back home and continue coaching while training for the start of a new professional volleyball league that she is the face of.\nI'm exhausted just typing that paragraph. Larson was burning the candle at both ends.\nHere's the thing: If Jordan Larson wants to be a volleyball coach, she’ll be able to do that for another 30+ years. But her window to be a professional volleyball player is not going to stay open nearly as long. She’s an elite athlete and tremendous competitor, but time is undefeated.\nIn her 16-year pro career, Larson has played for teams across the globe (Puerto Rico, Russia, Turkey, China, and Italy). Now, for the first time since she was a college senior in 2008, she can truly play at home in front of family, friends, and fans. For as Larson still has her drive and physical ability to complete (and it is obvious that she does), she owes it to herself to continue her pro career. Trust me, teams will still be very interested in having Jordan Freaking Larson as a coach after she retires as a player.\nI know there was a portion of Nebraska fans (not necessarily avid volleyball fans) who assumed that Larson would be heir apparent when she joined Cook's staff. Politely and respectfully, I'll say that was not the plan. Even if Busboom Kelly were not interested in leaving Louisville, there are plenty of ripe apples on the John Cook coaching tree that would have been plucked before getting to Larson.\nI don’t mean that to be disparaging toward Coach Larson. But it is meant to be honest. She currently lacks the experience needed to run one of the best programs in the country. Peyton Manning is a god in Tennessee, but the Volunteers aren’t going to hire him as their next head coach. It’s the same thing here.\nAs much as Husker fans love to fill coaching vacancies with former Husker greats (\"Grant Wistrom and Jason Peter should be co-defensive coordinators!\"), I would hope we have learned our lesson about the risks of hiring first time head coaches for high profile jobs.\nJohn Cook's legacy is enormous.\nIs John Cook the greatest coach at the University of Nebraska - ever? Without exploring the resumes of other contenders (Osborne, for one), Cook has a very strong case.\nUnparalleled on-court success. Four national championships, 15 conference titles, a ridiculous .875 winning percentage at NU (.834 overall), and the many All-Americans, Olympians, and legends he coached.\nHe grew the program to new heights. When Terry Pettit was building the program, you could get into a volleyball match for free if you showed a ticket stub from a football game. Today, volleyball has sold out 339 straight matches, with tickets incredibly hard to find, despite playing in an 8,000-seat arena that is the jewel of the sport.\nHe had an immeasurable impact on the sport of volleyball. In 2023, Nebraska drew a world record 92,003 fans for a volleyball match held inside a football stadium. The day was an inspirational (and emotional) celebration of women's sports. Nebraska currently holds the all-time attendance record in at least 18 different buildings across 13 states. Girls all across the state (and in my house) dream of playing for Nebraska.\nAnd that's just scratching the surface.\nLegendary.\nNo pressure, Dani.\nLet's close by looking at some things that will happen in Dani Busboom Kelly's life over the next seven months. In no particular order (and likely missing several key milestones), she will:\n- Move back home to Nebraska\n- Meet and work to retain her Nebraska roster\n- Hire the rest of her staff\n- Check in on the Beach Volleyball season that starts February 21. (Jaylen Reyes is the head coach of the Beach team)\n- Conduct spring practices, and potentially, play an exhibition match.\n- Give birth to their second child. Their son turns 3 in late April.\n- Turn 40 on May 5th\n- Start practices for the 2025 season\n- Coach her first match for Nebraska against Pitt - one of her former ACC rivals, and a perennial Final Four team - at Pinnacle Bank Arena in late August, replacing an all-time great coach.\nYou got this, DBK!\nMORE: Volleyball State: Lincoln Arneal & Jeff Sheldon Join I-80 Club, Deliver First Episode of the New Era\nMORE: Nebraska Athletic Director Troy Dannen: 'Not Going to Call It a Spring Game' for Husker Football\nMORE: Troy Dannen: Hiring Dani Busboom Kelly a 'No Brainer' for Nebraska Volleyball\nMORE: Adam Carriker Gut Reaction: John Cook Retires & Dani Busboom Kelly Is Nebraska's New Volleyball Coach\nStay up to date on all things Huskers by bookmarking Nebraska Cornhuskers On SI, subscribing to HuskerMax on YouTube, and visiting HuskerMax.com daily.\nDave Feit began writing for HuskerMax in 2011. Follow him on Twitter (@feitcanwrite) or Facebook (www.facebook.com/FeitCanWrite)",
  "word_count": 2049,
  "scraped_at": "2026-02-14T13:19:55.027020"
}