{
  "article_id": "9507fff79ceb",
  "url": "http://thepeninsulaqatar.com/article/28/09/2024/mexicos-men-and-women-sweep-to-homeless-world-cup-triumphs",
  "title": "Mexico men and women sweep to Homeless World Cup triumphs",
  "date": "20240928T124500Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nImage: Angelica Ibarra Rodriguez / Homeless World Cup website\nSeoul: Mexico won both the men's and women Homeless World Cups on Saturday in Seoul, in an event partnered by FIFA for the first time.\nMexico's men beat England 6-5 in the final at Hanyang University in Seoul, shortly after the women's team secured a 5-2 victory against Romania.\nThe country's women players, some carrying Mexican national flags, rushed on to the field to embrace their teammates after the men's team secured their victory.\nLithuania were third in the men's event, while Poland took bronze in the women's.\nThis year's tournament was the first edition hosted in Asia since it began in 2003.\nImage: Angelica Ibarra Rodriguez / Homeless World Cup website\nBilling itself as helping participants change their lives for the better through football, the Homeless World Cup sparked a feel-good documentary starring Bill Nighy, plus a 2023 Korean movie called \"Dream\".\nThis year's tournament featured 52 teams from 38 countries worldwide and was the first since FIFA signed an agreement to partner organisers the Homeless World Cup Foundation.\n\"FIFA is excited to contribute, because we share the view of the Homeless World Cup Foundation that football is a force for good,\" FIFA president Gianni Infantino said last month.\nFIFA, as well as providing trophies and medals, streamed the event free on the FIFA+ platform.\nThere was free admission to matches, which comprised two halves of seven minutes.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\nHans Zimmer to perform live in Doha\n-\nDelegation from Joaan Bin Jassim Academy for Defence Studies visits QNA\n-\nAssistant Undersecretary for Special Education Affairs visits Juthoor Early Education Centre",
  "word_count": 302,
  "scraped_at": "2026-02-14T12:33:00.328990"
}