{
  "article_id": "951b4f16c27c",
  "url": "https://www.thisdaylive.com/index.php/2023/02/20/victor-alewo-adoji-my-plans-for-kogi-east-senatorial-district/",
  "title": "Victor Alewo Adoji : My Plans for Kogi East Senatorial District – THISDAYLIVE",
  "date": "20230220T053000Z",
  "domain": "thisdaylive.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Latest Headlines\nVictor Alewo Adoji: My Plans for Kogi East Senatorial District\nIn this interview with THISDAY, Victor Alewo Adoji, who hails from Okula-Aloma in the Ofu local government area of Kogi, a senatorial candidate of Kogi East in the March 11 election, talks about the socio-economic-political development of Kogi and the nation. He is contesting on the platform of the PDP. Excerpts:\nWhy do you want to go to the senate?\nNigeria’s total public debt profile was more than N50 trillion as of December 2021. If reasonable adjustments are made for banditry and terrorism, rising insecurity is largely linked to frustration and economic marginalisation of youths and young adults. Nigeria has about 90 million unemployed youths and around 20 million out-of-school children. You can see there is no wonder that Nigeria has the highest rate of extreme poverty and the unenviable designation as ‘the poverty capital of the world’. Added to these, very high and increasing public debts and worsening inflation further satirise output. Despicably, Nigeria currently devotes almost 90 per cent of revenue to debt-servicing occasioned by an initial and lingering misreading of the dire situation as a revenue problem which explains but does not justify the resort to unrestrained borrowings. Our myriad challenges in Kogi East are cast in a similar mould. Specifically, from the salient issues of unifying our assorted array of interests, creating a common purpose, understanding each other, appropriating our collective failure, and establishing a shared identity to the more palpable issues of upending extant multidimensional poverty/inequality amongst our citizens and onboarding the Igala/Bassa nation into the national equation. I decided to oblige these facts to give a picture of how bad our situation is and, on that basis, aver that our disturbing predicament as a people and a country are a result of two factors: terrible or non-existent oversight/override on the part of the parliament.\nSecondly, destructive partisanship that condones bad leadership and regards political party loyalty far and above national health and progress.\nIn plain language, I am suggesting failure at the parliamentary level. Inferably, without a well-informed legislator who should churn out the enabling laws and exercise needed oversight/override, it is impossible to get a handle on the economy, our social engagements and poor management of our collective patrimony. Oversight/override, which are also major responsibilities of the legislature, are meant as the ‘clearing house’ for inadvertent executive missteps. But is that what we have now? Certainly not, which is why people like me aspire to go in and disrupt the system to the benefit of most people and our bleeding country.\nHow do you rate the performance of the current occupier of the office?\nA lawmaker should be accessed by the number and quality of bills (passed into law) and the value of oversights, particularly as they relate to the collective desires of an impact on their constituencies. Any other addition should be viewed as a secondary, if not tertiary, contribution to the core purpose. Against this backdrop, I believe we have been terribly short-changed by incompetent representation and have therefore lost grounds. When elected, I hope to foremost disrupt the infrastructure holding in place the plenty of anomalies in the national space as they affect our onboarding into the national framework, which can only come about by enthroning an uncompromising and an unsequestered representative who is unconditionally accountable to the Igala-Bassa people and agenda. We should reckon with Senators who have usurped the duties of local government chairmen and who are in cahoots with the executive to emasculate the third tier of government. Why else do you think there is so much suffering at the grassroots? The resources meant for that level of government no longer get to them, which is why one of the bills I will sponsor will be that which will empower INEC, not SIEC, to conduct the local government elections. Only then can we birth real autonomy for that tier of government. Other senators will continue to bandy boreholes, SDG gifted transformers, ‘keke Marwa’, donation of rice and Indomie noodles, motorcycles, painted classroom blocks and other such projects as achievements. I will be a senator, not a local government councillor or council chairman.\nVirtually all candidates will say what you have said. What would you do differently if elected senator?\nWhen elected senator, one of my immediate endeavours would be around the disturbing political dynamics that mostly hinder the various institutional arrangements for providing social and public services in Nigeria, particularly as they affect Kogi East. The fundamental difference would be the approach with regard to non-state actors who provide similar services in the country because the provision of social-public services is a complex undertaking that characteristically entails several state and non-state players. Our dismal performance as a nation makes a case for non-state actors to play a major role in public service provision; for example, recall the phenomenal impact of the transitions from NITEL to the existing GSM companies and the transition from largely public sector-controlled banks to private-sector-owned DMBs. In order words, we need to take the government out of the lives of the people as much as possible, especially in areas that are not directly related to national security.\nThere exists valid and verifiable evidence that public-private partnerships work best where there is a good fit with policies, laws and institutions all co-existing in a structured manner. A manner that can provide and sustains some good balance between operational independence and state involvement. Of course, sectoral characteristics and the complexity of particular services are major determinants of the extent of legislative engagement and involvement. The interface works efficiently if the partners are informed, inquisitive and committed; a case in hand is the inability of the electricity sector to get off the starting block till this moment literarily, even after a huge injection of N2.9 trillion, $500 million and outstanding debt to commercial banks of close to N900 billion.\nChoices about which public services to deliver, to what degree and to whom, and how to offer them, are all essentially political. These choices have consequences for various social groups and communities, and what the Igala-Bassa stand to gain and lose from such decisions is largely defined by the quality of representation. I assure you that I won’t be a seat-warmer or an ‘I concur senator’ when elected as your senator. I will stand for the people, and if others stand to me, I will stand out. And if they stand out also, I will be outstanding for the people.\nThe tolls from our imprudence have been enormous, and the implications, as seen in the unalluring state of affairs, are unambiguous even to the most unperceptive of minds. This account, in large part, for our perplexing lack of good progress and the disorderliness therefrom, represents a profound challenge to our identity, our values, and our collective resolve and endangers our push towards a common purpose. This must not fester, and it would be my duty to act according to the oath of office I will swear to.\nAnd you think the 2023 election provides the silver bullet?\n2023 provides a huge opportunity. I daresay 2023 is more about painstakingly actioning the decision that affects not only our future but also our children, grandchildren, and the survival of our ethnic nationality. Accordingly, I beckon you to a progressive communion where everyone is involved, valued and assured a role and a place in the drive to our redemption. We must reckon that great nationalities, including our nationality, do not evolve by a eureka moment in which they transmute abruptly. They essentially figure out what has to be done and take deliberate steps to either rebuild or build the future they seek. All said, this is almost entirely in our hands, and I respectfully implore us to continue the push towards changing our narrative as a virile ethnic nationality even beyond the forthcoming 2023 polls.\nWhat do you think is the main problem with Nigeria’s economy, and how will you address that as a senator?\nAt the Davos forum of 2009, the Prime Minister of the Peoples Republic of China, Wen Jiabao, obliging his views on the 2008 economic meltdown occasioned by the collapse of the Lehman Brother and ushered in the biggest financial crisis since 1929, said in an attempt to comprehend the catastrophe better he had ‘re-read’ Adam Smith’s The Theory of Moral Sentiments as opposed to the renowned Wealth of Nations. Invariably, the Prime Minister was saying the underpinning of the economic (and resulting political) problem was largely moral in nature and value-based. Everything considered, any of the challenges and problems we are faced with have their roots in our self-aggrandising indiscretion, an assortment of profiteering, our collective inaction, lack of institutional coverage and overreach and the massive recognition accorded to self-serving idiosyncrasies.\nOur economic problems are largely sociological and psychological. For instance, why should my quality as a person be adjudged by the adornment of design clothing or apparel? We proudly confess spending summer in Europe, America, Dubai or elsewhere but condemn the scorching sun in Lagos, Kano or Borno. Eating a bowl of pounded yam with fisherman’s soup in a restaurant is viewed as antisocial, yet it is class to inch up fats at McDonalds. Let’s fix our mindsets, and false positives, which are largely moral, sociological, and psychological issues first, and then the economy will literarily fix itself. Imagine the amount with spend on foreign consumables, travels for leisure, pleasure, education, or health and think for a moment the leakage therefrom and what its retention can do for our economy.\nAs you have mentioned, there’s the scourge of youth unemployment and restiveness. How will you address these issues?\nI am told one of our former Presidents once said youths whose parents support their oppressors in any form, shape or size should insist on a DNA check. In a similar breath, one wonders how and why some youths will show any form of support for such bullies and administrators of our prevailing adversity. That said, it is unfortunate that when we talk about youths of today, what easily comes to mind is thuggery, fintech crimes, cultism and other such vices. For the most part, these emphases are overstated purposely to feather the nest of those who are tired and should leave the stage for other co-owners of our communion and commonwealth. The demographic that constitutes over 70 per cent of our total population cannot be ignored, reduced or painted in the same brush by such generalisations. It was not like that in the past, and this phase created by some self-serving and self-seeking, relatively privileged members of society must fade away unconditionally.\nFor me, when I see youths, I see creativity, enterprise and industry, which was why a couple of years ago, in concert with one of the best talent hunters I know, himself a young adult, we activated a pilot scheme of creative wealth creation using the auspices of soccer. In less than two years, some of our boys are now earning foreign currencies while the Igala United football club, which we deployed as the vehicle, is now a National League Division 2 club.\nEncouraged by the outcome of this intervention, I undertake to leverage existing policies and sponsor bills that will amplify these milestones and make further inroads, especially in Nigeria’s creative and entertainment industry but with special consideration accorded to Kogi East. The Nigerian Entertainment goldmine is said to be worth about $10.5 billion. The global creative industry is worth $2.2 trillion and accounts for nearly 50 million jobs worldwide. With the right policies and laws and the advantage of the youth bulge, Igala-Bassa youths can particularly tap into and account for a sizeable chuck of this market. This will be one of my greatest foci, and I undertake to do everything to integrate the youths and enlist them as critical stakeholders in Project Nigeria.\nFor instance, Nigeria is currently experiencing a youth bulge which the legislature and policy are ostensibly ignorant about. Empirical research suggests that there is a strong correlation between poorly managed youth bulge, armed conflicts, poverty, inequality and underdevelopment. Therefore, creating employment and engagement for the youths is a matter of engendering conducive enterprise and educational policies. China understood the era and moved by initiating policies that helped to harness their youth potential by creating laws and policies (a parliamentary responsibility), the encouraging environment within which small businesses could flourish. In the process, 269 million youth population were truly empowered to own and run small businesses.\nIn other words, we must be deliberate in encouraging and supporting our youths and young adults to unleash their entrepreneurial and creative talents in these areas so that they can become economically independent and fast-track the process of surmounting the scourge of unemployment and the evil loosely regarded as poverty. My hope is that, with the support of my parliamentary colleagues, we shall, through policies and laws, institutionalise youth enterprise against the current disposition of weaponizing their indiscretion and stamina.\nIf we succeed, the youths will ultimately become net employers of labour and proudly engage in our nation’s socio-political and socioeconomic lives as respectable and responsible stakeholders.\nYou have spent a good chunk of your life in Lagos and yet desire to serve your Kogi East people. How much of Kogi East’s economy and people do you know?\nUpfront, I should have it on record that I am in the top t0 brackets of people of Igala-Bass origin who are not resident at home but visit the hinterland at the slightest opportunity. I have taught in Igala land. I have friends across the length and breadth of the land. My father was from Ofu. My mother is from Olamaboro. My wife is from Dekina, and I am of the Achadu lineage. Who can be more Igala than me? Kogi East is home to about 2,100 communities and about as many hamlets. With a population of over two million people and vast arable lands, the Igala-Bassa people are predominantly subsistence farmers. Albeit, with potential for commercial quantity production and export, the residents subsist on crops including cassava, cashew, rice and yam. There is also widespread endowment of soya beans, benniseed, oil palm and fish.\nAs a region, we consume all we produce and buy more to augment our consumption deficit. In other words, there is a constant outflow of resources away from Kogi East, stripping the region of the benefit of circulation of money and the compounded benefit therefrom.\nKogi, particularly Kogi East, is the highest cashew-producing state and region in Nigeria, respectively, exporting about 100 metric tonnes out of the 220 metric tonnes of cashew nuts exported by the entire country annually. While the export and the proceeds therefrom are good for purposes including reflating the Igala-Bassa economy, the export of cashew also entails the export of jobs and some small and medium-scale companies along the value chain. When I become your senator, I shall leverage policies and laws to insist that the cashew nuts are washed and semi-processed in Kogi East for onward export. I assure you that this policy alone will create hundreds of jobs with several accompanying trickling effects.\nNigeria’s total cashew export from 2017 to 2019 stands at over N122 billion, and Kogi East should have accounted for up to 30 per cent of this amount; that is a whopping N27 billion. To achieve this, I shall influence coalescing smallholder farming to amplify the bargaining power of the farmers, pursue policies that will make capital available to the farmers to upgrade and set up processing plants and source for their partnerships with investors so they are able to build modern storage facilities to mitigate the huge income losses attributable to poor storage and distribution facilities. This is just using cashew as a treatise. The same will apply to other crops and agricultural endeavours of our people under the broad heading of agripreneurship.\nOutside the well-known issues of underdevelopment, unemployment and poverty, which are a national menace, what other problems specific to Kogi East do you intend to address if elected senator?\nWell, from your question, which insists I focus on some specifics, off the top of my head, I can call to focus on some dire needs in some areas. Firstly, establishing a bureau for records and analytics to end the era of working in limbo will be paramount while leveraging the advantage of our location as a nexus to influence the opening-up of Kogi-East through influencing the building of bridges between Idah and Aganabode, Bassa and Shintaku, and the one from Abejukolo to Toto in Nasarawa state. The roads through Ibaji that terminates in Anambra/Enugu will also be a topmost priority.\nBefore then, it is imperative to highlight a few of the several problems besetting the Igala-Bassa people and the entire Kogi East senatorial district. Prior to the 2022 flood, which overran large swathes of the state, Ibaji was home to 91 communities before seven communities were obliterated by flood as of 2012; we are waiting for new figures. A well-researched 2021 study published in the Journal of Environmental Science, Toxicology and Food Technology reports that over 85 per cent of Ibaji people are negatively impacted by floods almost year-on-year, while livelihood losses peaked at 72 per cent at some point. Ibaji is clearly an endangered people and a constellation of communities at the edge of society. May I also state that it was in a bid to address such challenges the federal government established the Ecological Fund in 1981. The Fund has the prime objective of pooling funds solely devoted to ecological challenges (such as in Ibaji) to mitigate serious ecological problems and their accompaniments. The states (including Kogi state) and local governments (including Ibaji LGA) receive allocations for ecological purposes as part of the monthly allocation from the Federation Account, implying that there exist provisions for both incremental and strategic interventions to the Ibaji problem which all the three tiers of government have ostensibly failed to address.\nTo make matters worse, over the last five years, the federal government approved and awarded over 280 projects under the Ecological Fund Office (EFO) to improve the living standards of people like the Ibaji people across communities in the country. Ibaji was not considered or regarded as deserving of attention: A very unambiguous case of failure on the part of the extant representatives, especially at the national and state levels.\nAt the Bassa end, there is this unending avoidable conflict that has terribly fractured the social and economic lives and livelihoods of the people. I use this opportunity to unequivocally denounce the disgraceful decline of Bassa land into a war theatre. The warring situation in Bassa land is unfortunate and condemnable, and we must do anything and everything humanly possible to stop the carnage. To this end, I strongly call for an immediate termination of hostilities by all actors in the conflicts in favour of a resort to engagements, discussions, negotiations and resolutions of the crises by both direct and indirect actors.\nI plead for uncommon understanding on all sides and appeal to percussors and war merchants who fan the embers through their misinformation and disinformation to give peace a chance. It is unimportant to arrogate the powers of ascribing faults to anyone or any group at this time, and all peace lovers must genuinely get involved and not just pretend all is well or assume all will be well upon the faulty premise that they are not directly impacted yet. There is also the issue of erosion in Idah, Ankpa and Ugwolawo in Ofu, to mention a few. While the topography and soil nature of these areas are clearly a catalyst for gully erosion, it also makes it easy to establish drainages with suitable gradients to the rivers that run through these local governments.\nTherefore, it would be one of my major cries and in fact, sing-songs to the federal government and international meteorological/ecological/environmental agencies to come to the aid of these communities. In the end, there may also be inherent in the erosion threat an opportunity to create jobs by adopting an integrated agronomic and engineering practice purposively meant to protect the soil and reduce run-off but will be done and maintained by citizens who have to be paid. Also, re-afforestation or agro-forestry practices, which imply an interface between the agricultural and forestry use of land in the affected areas, maybe another income spinner.\nYou’re running against a sitting senator, a member of the ruling APC. What are your chances of victory?\nAyn Rand once said, ‘when you see that in order to produce, you need to obtain permission from men who produce nothing – When you see that money is flowing to those who deal, not in goods, but in favours – When you see that men get richer by graft and by pull than by work, and your laws don’t protect you against them but protect them against you – When you see corruption being rewarded and honesty becoming a self-sacrifice – You may know that your society is doomed’. The current holder of the office clearly does not have the capacity to upturn the concerns captured in Ayn Rand’s very informed averment. The current officeholder does not seem to know the difference between being a local government chairman and a senator. Even more, he has supported all anti-people bills/laws and can no longer said to serve the interest of the people. From his vote against the new electoral law to the one against increased women’s participation in our socio-political economy to the pending water resource bill, he cannot be said to be fit for that office. If he deems himself fit to be entrusted a second time, I am available to meet him for a debate, even in his house, moderated by anyone of his choice to give him the opportunity to justify his odious claims.\nMore so, the 2023 election at the Kogi East senatorial is not between I and the outgoing senator or anyone for that matter. Like all other elections in 2023, it is a demand to take a giant leap away from politics as usual and declare through votes our collective resolve for a better life for all of us and generations after ours. Clearly, the 2023 election is a vote between poverty and prosperity; retrogress and progress; a future of despondence and a future of hope; democracy and the Moloch called plutocracy. It is a vote between unemployment at 11 per cent or $3 per cent. It is a vote between a bag of rice at N8000 or N45,000. It is a vote between a declaration that one is stupid or wise.\nAs for my chances, I am one of the lucky ones who will benefit from the terrible misadventure called the APC. Aligned with my widespread acceptance, my chances are exceedingly bright, especially because the people know that one can never solve problems with the same kind of thinking that created them in the first place; APC and its agents can never change. Let me quickly add that I am proud of the PDP, but I must put on record that I regard my people far and above partisanship and other considerations, which is why it is to them, regardless of affiliations, differences, interests, and biases that I bring the fate of our tomorrow as a people and a nation.\nNigeria’s unity is a major issue in the 2023 elections. What are your concerns in this regard?\nLet me state foremost that of the eight billion people on the planet, less than four per cent (that’s about 320 million) have immigrated from their countries of birth. Inferably, over 95 per cent of citizens remain in their home countries. You see why we must fix our country, as there are no provisions out there for all of us. If God deems it fit for all the 250 tribes and different religions to live together as one in Nigeria, who are we to question or challenge the supremacy by killing each other because he/she is from the same ethnic group as ours or he\\she doesn’t practice same religion same as ours. Due to our differences as humans, it is pertinent to note that we are bound to make mistakes or hurt one another. I bet you violence has never been an option in resolving conflict and never will. Rather, it makes issues more terrible.\nThat said, Nigeria continues to grapple with how to ensure unity in diversity among its various regional, religious, and ethnolinguistic groups. Government after government have applied different strategies aimed at achieving unity in diversity or national integration. From the establishment of the National Youth Service Corps through the implementation of the Federal Character principle to the ‘gentleman agreement’ on the zoning of political power positions, Nigeria keeps trying to achieve a unification of its enormous diversities. The plethora of efforts notwithstanding, integration remains a big challenge in Nigeria with an escalating propensity for fractionalisation typified by resort to ethnic sentiments on issues of significant national importance and hence the unrelenting call for a renegotiation of the terms of our union under the broad name of “restructuring”. This is clearly a result of our failure to achieve genuine unity in diversity.\nWe do not have a choice but to evolve ways of strengthening and deepening the political culture of democracy and federalism as mechanisms for managing diversity and pursuing a public interest in a plural society. A fundamental challenge of democracy and federalism in Nigeria has less to do with constitutional design than with cultivating and nurturing a democratic culture, which binds and restraints all. We must turn the searchlight on the material, cultural, normative, and social anchors and pressures that will strengthen political culture generally in state and society and serve at the same time to make the constitutional and political architecture of democracy and federalism much more durable and incorruptible.\nIn my view, the lack of unity in Nigeria is an indication of poor management of our differences and not a natural unwillingness to co-exist; this makes the problems/issues associated with our lack of genuine unity temporary and surmountable. However, it must start with all tiers of government mainstreaming the importance of other ways of life, beliefs and peculiarities among Nigeria’s diverse social, cultural and religious groups. Nigeria as a nation must be truly and publicly committed to encouraging partnerships and dialogues among the various nationalities to avoid Stiglitz’s qualification of an “evil nation”. Stakeholders across the nation and from all zones of the country should make clear that no interest or people, influential, powerful and/or powerless, can use any paradigm whatsoever to justify a strategy or policy of cultural superiority.\nWe as a nation can achieve much from diversity if the right mechanisms are adopted to blend our differences to yield positive outcomes for us. If diversity unites us as one Nigeria, then we to embrace one another with love and respect each other’s culture, norms, values, and religion.\nHow do you rate the preparedness of the INEC ahead of the February 25 and March 11 elections?\nI closely monitored the elections conducted in Ekiti and Osun states in which BVAS machines were deployed, and I can confidently say INEC did a fantastic job in those elections. However, a lot has happened between then and now and professional politicians being what they are, would and could have gone all over the place with the active connivance and support of dubious officers to see how to compromise the process.\nINEC has assured that their systems are impregnable, but I wonder what those who are buying off PVCs from hapless citizens or copying the voter card numbers would do with them. There are also reports in the media of attempts to preload some BVAS machines ahead of elections. All these are in the realm of rumours, but the good thing is that the umpire knows it is being closely watched by all Nigerians.\nWhat about issues of security on election day?\nThe issue of insecurity, before and during the elections, is the creation of rejected politicians. This outmoded crop of politicians resorts to violence purposely to scare the electorates from exercising their franchise while assuring their insignificant crowd of supporters security on election day. A few days ago, the PDP House of Representatives candidate was attacked by APC thugs before they were repelled by the mammoth crowd of citizens who said they had had enough of the killings, mayhem and threats chorusing everyone dies someday. However, I must commend the speed with which the police and the military were deployed to restore calm and hope that this would be a regular line of action throughout the election period. President Buhari has promised non-involvement of the security agencies in the 2023 elections other than to provide security to all parties and for the process. We shall hold him to it despite the desperation on the part of the APC in Kogi state.\nWe know that compromises exist in the ranks of those charged with the onerous responsibility of protecting lives and property. They, too, are being impacted by the prevailing hardship, and those who ignore the lessons of history will be punished by God. It has happened in the past, and God is still on His throne. We must also keep an eye on non-state actors deployed by the state under the instrumentality of vigilante or any other guise. During the 2019 elections, young Daniel Usman was gunned down in cold blood at a polling unit in Anyigba while Mrs Salome Abu was burnt to death in her house in Ochadamu, a bestiality that was validated by certain people forcibly rail-roaded to represent her in hallowed places. To date, I am unaware of any condemnation of these killings by our current crop of the so-called representative whose indiscretions have seemingly emboldened the saying that ‘might is right’. Nonetheless, as has been said in many quarters, the vote is the most powerful instrument ever devised by man for breaking down injustice and destroying the terrible walls which imprison men and in Kogi east, we shall deploy it to our benefit.\nA few months to the 2023 elections, the naira was redesigned, and despite protests against the naira swap and scarcity, the president affirmed the policy to vote buying. What are your thoughts?\nBetween N2.5 and N3.2 trillion outside the bank industry is a no-no. The fact that the APC governors and their several acolytes are the ones shouting the loudest allows for the logical conclusion that these monies are largely within them. If they had applied the same energies during the almost 10-month-long ASUU strike, our children would not have been home even a month. The president is the chief security officer of the country, and if he says he has good intelligence upon which he approved the CBN policy, then he has. I am confident that the CBN working with the commercial banks will ensure reasonable liquidity is available for some of us who do not have the misfortune of warehousing billions in stolen funds. In the end, the system cannot weaponize poverty, objectivize the citizens and buy their conscience with stolen wealth. We are all impacted, but we must all make sacrifices if we must upend those keeping us in bondage because occasionally, it is the waves of unpopular decisions such as the Naira redesign that we find true direction.",
  "word_count": 5247,
  "scraped_at": "2026-02-14T12:14:03.295139"
}