{
  "article_id": "951ce38e6098",
  "url": "https://bernews.com/2023/06/fifa-concacaf-to-collaborate-on-marketing/",
  "title": "FIFA & Concacaf To Collaborate On Marketing",
  "date": "20230615T140000Z",
  "domain": "bernews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA & Concacaf To Collaborate On Marketing\nFIFA and Concacaf have agreed to take their cooperation to the next level by promoting and marketing all major upcoming official Concacaf national team competitions together with the FIFA World Cup 2026.\nA spokesperson said, “This ground-breaking initiative will provide brands and prospective partners with a unique opportunity to truly impact the global game at a hugely important moment in its growth in North America, and the entire Concacaf region, over the next three years with compelling national team football tournaments.\n“Included in the commercial opportunities that FIFA and Concacaf will be showcasing to global and regional brands in the coming months are opportunities to partner with the following competitions:\n- Concacaf W Gold Cup [February 2024]\n- Concacaf Nations League Finals [2023/24 and 2024/25 editions]\n- Concacaf Gold Cup [2023 & 2025]\n- FIFA World Cup 2026\nFIFA Chief Business Officer, Romy Gai, said: “The FIFA World Cup 2026 will be unique in terms of the impact it will have not only on the host countries, but on the entire Concacaf region and the whole world. Three countries, 16 cities, 48 teams and 104 matches will provide the biggest sports platform yet, of a scale never been seen before. This collaboration between FIFA and Concacaf will enrich the thrilling journey for the North American fans, local communities and for football even further – as we build towards the FIFA World Cup 2026, the greatest show on earth.”\nConcacaf Chief Commercial Officer, Heidi Pellerano said: “Over the next three years Concacaf will deliver a compelling range of men’s and women’s international competitions, and an entirely new club ecosystem, that showcases the very best of football from across our wonderful region. We have Nations Leagues, Gold Cups, the new Champions Cup and more, and this presents a tremendous opportunity for brands and potential sponsors to be part of a series of major football events in the region ahead of the biggest World Cup ever in 2026. I want to thank FIFA for their cooperation in this ground-breaking partnership.”\nThe spokesperson said, “FIFA’s Partnerships & Media division and Concacaf’s commercial department began working together in 2022 to develop a strategy to market unique joint commercial opportunities for Concacaf national competitions and the FIFA World Cup 2026. Brands will have the opportunity to have a presence and integration at hundreds of elite national team matches involving the very best teams in the region and from across the world.\n“The first ever FIFA and Concacaf Upfront event, to engage further with brands on the unique partnership opportunities, kicks off in Las Vegas, USA, on Thursday, 15 June 2023 during the Concacaf Nations League Finals.”",
  "word_count": 447,
  "scraped_at": "2026-02-14T12:45:45.322893"
}