{
  "article_id": "9544fdc524fd",
  "url": "https://www.thenationalnews.com/news/mena/2025/01/17/renewed-hope-for-justice-in-lebanon-as-officials-summoned-over-beirut-port-blast/",
  "title": "Renewed hope for justice in Lebanon as officials summoned over Beirut port blast",
  "date": "20250117T114500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The lead judge investigating the 2020 Beirut port blast has summoned 12 officials from the port authority, army, security branch and customs for questioning, renewing hopes of justice for victims of Lebanon's deadliest civilian disaster.\nThe summonses issued on Thursday night by judge Tarek Bitar, whose work has been repeatedly hamstrung by legal challenges and threats, requires the officials to appear before him next month.\nThe move came days after parliament elected former army chief Joseph Aoun as president, ending more than two years of political deadlock, and the nomination of Nawaf Salam, formerly president of the International Court of Justice, as prime minister-designate to lead the formation of a new government.\nSpeaking after he was nominated on Tuesday, Mr Salam pledged to seek justice over the port explosion, which killed more than 220 people, injured thousands and flattened large parts of the Lebanese capital. The blast was triggered by a fire in a warehouse where a huge stockpile of ammonium nitrate fertiliser had been haphazardly stored for years.\nNo senior officials have been held accountable for the explosion, which was widely regarded as a symptom of decades of corruption and mismanagement by Lebanon’s ruling elite.\nMany Lebanese see Mr Aoun and Mr Salam as beacons of hope, separate from the entrenched political class.\n“We have hope by the president, which is something good, [but] it's not only by having a good president, we have to change the whole system,” said Mariana Fodoulian, who lost her 29-year-old sister Gaia in the blast.\nAttempts to establish accountability for the disaster have been stalled by legal challenges and blocks placed by members of the judicial system, which is deeply politicised.\nIn early 2023, the-then public prosecutor Ghassan Oueidat blocked Mr Bitar's efforts to resume the investigation after he was charged.\nMr Oueidat had accused the judge of overstepping his authority and ordered the release of all individuals detained over the explosion, including the former head of the Beirut port authority.\nHezbollah, a political party and armed group that has held sway over Lebanese politics but was significantly weakened in the recent war with Israel, has accused Mr Bitar of bias and demanded his dismissal, while senior officials named in the investigation filed a flurry of lawsuits to prevent it from going forward.\nMr Oueidat and his successor had also barred the judicial police from working with Mr Bitar.\nThe UN rights chief Volker Turk called for the “resumption of an independent investigation into the explosion” during a visit to Lebanon on Thursday.\n“I repeat that those responsible for that tragedy must be held to account and offer the support of my office in this regard,” he said.\nMP Melhem Khalaf, a constitutional expert and former head of the Beirut Bar Association, expressed happiness that the port investigation was resuming, but said that was not the point.\n“It's not about feeling, it's about action,\" he said.\n“All of us want this approach. We want to respect the process. It's a cornerstone of the state. If not we will lose democracy and the rule of law.”\nMr Khalaf had taken to sleeping in the parliament chamber since January last year to protest against the repeated failure of his fellow MPs to agree on a candidate for president. He finally left the building, suitcase in hand, after Mr Aoun was elected last Thursday.\nHe described Lebanon's new leaders as “very qualified” and said he was happy with their profiles.\n“Look, we will be happy if they apply the rule of law. We need our rule of law, that's what we need. We need a state of law, we need a state of justice,\" Mr Khalaf told The National.\n\"In this approach we can create hope for the people, for the families … and to build a democratic state.\"",
  "word_count": 633,
  "scraped_at": "2026-02-14T12:11:12.629392"
}