{
  "article_id": "954825744fed",
  "url": "https://www.rnz.co.nz/news/sport/504119/phoenix-women-sign-american-to-replace-wisnewski",
  "title": "Phoenix women sign American to replace Wisnewski",
  "date": "20231206T230000Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Wellington Phoenix have signed an American college player for the remainder of the A-League season as they look to bolster their injury hit squad.\nForward Isabel Cox has put pen to paper just days after finishing her fifth season at the University of North Carolina (UNC).\nThe 22-year-old is an injury replacement for midfielder Grace Wisnewski, who ruptured the anterior cruciate ligament in her left knee last month.\nThe Tar Heels women's team has won 21 National Collegiate Athletic Association (NCAA) championships, the fifth most of any sporting programme in NCAA division one history.\nCox played alongside the likes of England and Arsenal striker Alessia Russo at UNC and came agonisingly close to adding to the Tar Heels' legacy.\n\"I loved Chapel Hill,\" she said. \"It was definitely a great four and a half years playing here.\n\"I wish I could have left with a national championship. We were really close. We made it to the final twice, the final four one year and the elite eight this past year.\n\"It was a really fun time and we won the ACC championship in my freshman year.\n\"I feel like I made really good connections with my teammates, and it's definitely been a great experience.\"\nThe North Carolina native is ready to make her first foray into professional football and believes she will bring some unique attributes to the Phoenix.\n\"I'm tall, I'm 5'10, and I like to think that I'm fast.\n\"I love to cross the ball in and find good seams to pass to people, but my favourite thing to do is get the ball, face up and take someone on one versus one.\"\nAnd she believes the 'smallball' style the Nix are playing under new head coach Paul Temple will suit her.\n\"I've been watching highlights of the team and I think I'll definitely be able to add a lot to this team and work with these players really well.\n\"I think the Phoenix fits my style of play a lot.\"\nCox has decided to forgo the National Women's Soccer League (NWSL) draft to sign with Wellington.\n\"I think more and more top college players are considering the A-League now,\" Temple said.\n\"We saw it in the league last year with Madison Haley, where she wasn't out of the NWSL and came from college, and did really well for Sydney FC and has now got a move to the WSL (Women's Super League).\n\"Isabel's been in a really good programme and quite possibly could have gone into the NWSL draft, but players are seeing that unless you're one of the very top draft picks it's hard to get minutes in the NWSL because of the quality of that league and the standard of the players in each squad.\n\"So, they're looking at other opportunities overseas and the Americans look really kindly on the A-League and think this is a really good place to come.\"\nCox has been on the club's radar since pre-season.\n\"I really liked her straight away as a player and thought she'd be a great fit for our style of play, but at that point we'd just finished signing our squad, so we didn't have any room.\n\"I went back to the agent and just said 'can you keep me posted on her over the course of the season in the U.S. because you never know what might happen with injuries etc'.\n\"As fate would have it we've been able to now go back to her and bring her in because we need to bring some players in to replace Grace and Chloe [Knott] and now Marisa [van der Meer].\"\nCox will arrive in Wellington next week.",
  "word_count": 613,
  "scraped_at": "2026-02-14T12:40:31.213981"
}