{
  "article_id": "9554600fe763",
  "url": "https://www.afl.com.au/news/1266774/2024-afl-financial-result",
  "title": "AFL releases 2024 AFL Financial Result",
  "date": "20250210T053000Z",
  "domain": "afl.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The AFL has today forwarded its 2024 financial results to the Presidents and Chairs of the 18 clubs, in the lead-up to next month's Annual General Meeting.\nThe AFL reported an underlying operating surplus of $45.4 million in 2024, compared with an underlying operating surplus of $27.7 million in 2023 - an increase of $17.7 million. This result includes the AFL's controlled state subsidiaries and Marvel Stadium.\nIn his review of the year, AFL Commission Chair Richard Goyder thanked the collective industry, including the 18 AFL clubs and the game's fans, for delivering a record year across all major metrics.\n\"The collective effort from our football community, from our clubs, our players, coaches and officials, our committed broadcast and corporate partners and especially our football fans, delivered one of our biggest football calendar years of all time,\" Mr Goyder said.\n\"It was a landmark step for our game in 2024 with the official launch of the Tasmania Devils FC as one of the highpoints in football history. Our newest club formally launched their colours and logo and drew more than 200,000 Foundation members by the close of the year.\n\"Since the announcement of the club in 2023, total participation in the state is up 27%, with the largest increase in Auskick of 38%, and we have committed to invest $360 million into Tasmania over the next 10 years, to both help establish the club and drive local participation across the state, as those boys and girls can then hopefully pull on the AFL or AFLW Tasmania Devils guernsey at the highest level.\n\"The record-breaking interest in the Devils stood alongside a new record membership tally for the game, our largest-ever attendance tally for a single season, continued strong growth in both participation and viewer numbers and two outstanding seasons for our elite men's and women's competitions.\n\"The 2022 Commission decision to invest 10 per cent of the game's total assessable revenue into game development is already paying dividends for our future. More than 582,000 registered participants were part of our game in 2024 – an increase of more than 10 per cent on 2023 and came off the back of initiatives such as the new Superkick format which sought to create a bridge between Auskick and community football.\n\"We also continued to support the development of facilities at community level while adding more than 100 new community ovals to support the growth in participation. It remains vital for the game's long-term health that we ensure we have access to open space for our next generation of girls and boys to play our game.\n\"I want to thank the boards and staff of the 18 clubs, our players, umpires and our own AFL Executive and team, for the work they did to ensure football grew around the country while still remaining accessible and affordable to families at a time when cost of living pressures have increased.\n\"Most of all, I want to thank our members and supporters for their passion and commitment to their clubs and everyone who watched the games and supported us collectively across both the NAB AFL Women's Competition and the Toyota AFL Premiership Season.\"\n\"As a business, we will continue to look closely at our long-term planning for our competition structure, support for our elite clubs, attracting talented athletes to be part of our AFLW and AFL competitions and investing into facilities for our fans and our grassroots clubs as well as continuing to support the 200,000 volunteers who make our game possible to so many.\n\"The game is strong across Australia thanks to every fan and every person who chooses to be involved in our sport, and there is a place for everyone in our game.\"\nTotal attendance for the 2024 season across both home and away and finals matches was a new record 8,289,788, eclipsing the previous mark of 8,139,925 from 2023.\nFourteen clubs improved their average crowd compared with 2023 while the Grand Final (100,013) between the Brisbane Lions and the Sydney Swans was the largest crowd in competition history for a match involving two non-Victorian clubs.\nTotal AFL Club membership reached an all-time record 1,319,687 members in 2024, surpassing the record of 1,264,952 that was set in 2023, representing an increase of 4.3 per cent. Thirteen clubs broke their previous membership record – Adelaide Crows, Brisbane Lions, Collingwood, Carlton, Fremantle, Geelong Cats, Gold Coast Suns, GWS Giants, Hawthorn, Port Adelaide, St Kilda, Sydney Swans and Western Bulldogs.\nOne in every 21 Australians is currently a member of an AFL club.\nAFL Chief Financial Officer Matthew Chun said the financial results were a testament to the planning and discipline of the industry.\n\"As an industry, we have worked hard to build the revenue base while at the same time increasing distributions to clubs, players, investment in game development and the running of AFLW,\" Mr Chun said.\n\"Our balance sheet remains strong. The co-ordinated effort to reduce the industry cost base and protect revenues means the AFL was able to report a cash surplus for the financial year and our focus remains on the rebuilding and strengthening of the industry balance sheet.\n\"The Covid-19 pandemic exhausted our reserves, and over the last three years we have been disciplined in ensuring we replenish that fund, to not only protect us against any unforeseen future event but to give us opportunity to invest in growth opportunities that can continue to financially support the long-term growth of the football community.\n\"While a new broadcast deal comes in this year, it is important that we continue to drive cost discipline to ensure that we are able to continue to invest in all levels while ensuring the game remains affordable and accessible for everyone.\"\nIn line with this objective, in 2024, the AFL held the price on all entry level tickets for all matches at all venues across all four weeks of the 2024 Toyota AFL Finals Series, including the Toyota AFL Grand Final. Entry level tickets for weeks one to three of the finals series have now remained at 2016 prices – a nine-year price freeze.\nFree access was provided to Gather Round tickets for all members, Kids Go free nationally across the school holiday period in July and Round 24 in Victoria, a price freeze on footy food at Marvel Stadium, and under 18s continuing to be free at all NAB AFLW matches.\nFurther, the AFL has again this year frozen the price of all GA ticket prices at the MCG and Marvel Stadium for the seventh season in a row.\nKey AFL financial summary\nThe AFL's operating revenue increased by $72.3 million due to a combination of contractual increases in broadcasting revenue, improved returns from Marvel Stadium, sponsorship and other consumer related revenues.\nThis revenue was used to fund the following investments:\n• $420.8 million to AFL clubs (up from $393.8 million in 2023)\n• $92.3 million to Game Development (up from $89.7 million);\n• $63.7 million in running the AFLW competition (up from $57.2 million);\n• $49.9 million to the AFLPA which includes contribution to player development, Injury and Hardship programs and Retirement fund (up from $41.5 million);\n• $12.6 million to infrastructure comprising of elite and community facilities and contributions for stadia redevelopments (down from $14.4 million); and\n• $1.3 million to corporate and social responsibility initiatives (up from $0.9 million).\nExpenditure increased by $27.5 million due to a combination of revenue-related increases including the higher level of depreciation of Marvel Stadium post the completion of the Marvel Stadium upgrade.\nDistributions increased by $36.6 million, largely due to the Collective Bargaining Agreement across Men's and Women's and increased Game Development investment following the Commission's resolution to commit a minimum of 10% of assessable football revenue to community football.\nThe AFL's cash balance at the end of the financial year increased from $164.0 million to $186.7 million.\nThis movement is due the operating result of $45.4 million and offset by other working capital movements of -$22.7 million\nThe total payments to AFL Executives equated to $10.8 million (down $2.8 million year on year), compared to $13.6 million in 2023.\nAfter all revenue, operating expenditure and distributions, the AFL recorded an underlying operating surplus of $45.4 million, compared to an underlying operating surplus of $27.7 million in 2023.",
  "word_count": 1381,
  "scraped_at": "2026-02-14T12:11:06.254123"
}