{
  "article_id": "959bfebed18d",
  "url": "https://www.90min.com/best-goalkeepers-ea-fc-25",
  "title": "Best goalkeepers in EA FC 25",
  "date": "20240924T040000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Best goalkeepers in EA FC 25\n- Glut of elite-level goalkeepers in EA FC 25\n- Multiple goalkeepers rated as highly as 89 in new game\n- Christine Endler the sole female keeper in the top ten\nThe idea of goalkeepers as merely shot-stoppers is a concept that's drifted out of vogue and football is currently blessed with an array of multi-faceted number ones.\nIn truth, the majority of those who dabble in the virtual world of EA FC 25 aren't too fussed with a keeper's ability to play with the ball at their feet. For gamers, that supposedly antiquated goalkeeper ideal of stopping shots is all-important.\nEA Sports take various aspects of goalkeeping, including diving, handling, kicking and reflexes, when determining the overall rating of a goalkeeper and you're not going to be shy of elite-level options when cultivating your Ultimate Team.\nHere are the highest-rated goalkeepers in EA FC 25.\n10. Mike Maignan - 87 OVR\nLiverpool may have recently exposed a fragility from set-pieces, but there's no denying Mike Maignan's status as one of the very best in the world at what he does.\nCultured in possession and boasting cat-like reflexes, the Frenchman typically steers clear of errors. Many Milan fans would argue they upgraded on Gianluigi Donnarumma after Maignan's brilliance became clear and he's now France's number one following the retirement of Hugo Lloris.\n9. Emiliano Martinez - 87 OVR\nCristiano Ronaldo 'stans' have Emiliano Martinez to thank for ruining the tedious GOAT debate. Lionel Messi's World Cup triumph likely never would have occurred if it wasn't for the Aston Villa keeper's heroics.\nAn Argentine national hero with a bit of a mad streak, Martinez's rise from Arsenal cast-off to premier shot-stopper has been nothing short of remarkable.\nA stellar 2023/24 campaign with Aston Villa means Martinez has earned a +2 upgrade in EA FC 25 and his card is impressively well-balanced.\n8. Gregor Kobel - 88 OVR\nGregor Kobel was already regarded by EA as one of the very best in the world last year, but the Switzerland international's role in Borussia Dortmund's journey to the Champions League final means he's been rewarded with another upgrade.\nKobel starts EA FC 25 with an 88-rated card which means he's finally usurped Manuel Neuer as the best goalkeeper in the Bundesliga.\nKobel was responsible for bailing BVB out on numerous occasions last term, with his remarkable ability for pulling off the spectacular seeing him dominate highlight reels.\n7. Christiane Endler - 88 OVR\nA mini-spoiler here: Christiane Endler is the sole female representative on this list.\nThe experienced Chilean goalkeeper has fierce competition from Mary Earps, but many would regard Endler as the very best at what she does in the women's game.\nShe's starred for the once-dominant Lyon since joining the club in 2021 and has previously been described by former USWNT shot-stopper Hope Solo as a \"one-in-a-million\" goalkeeper.\nThere are few, if any, chinks in Endler's armour.\n6. Jan Oblak - 88 OVR\nA perpetual steady presence, Jan Oblak may not be as dominant as he once was, but the Atletico Madrid stalwart is still hugely respected by EA.\nThe Slovenian superstar has constantly been regarded among the very best in the world and is typically a pretty easy pick-up for Ultimate Team lovers intent on crafting a mean and nasty La Liga outfit.\nOblak and his steady hands usually avoid infamy and sequences of chaos, with the serenity he provides between the posts instilling an overwhelming sense of calm among the Atleti backline.\n5. Ederson - 88 OVR\nEderson's rating is aided by his monster 91 kicking which pays homage to his borderline revolutionary ability to boot a football very far with outstanding accuracy.\nHis distribution remains supreme and the best in the game, but the Manchester City stopper is starting to get caught out a little more often than he once did. Retaining focus and concentration can be difficult given how much his team typically dominates matches and he's not a keeper who can win games on his own.\nStill, Ederson is an excellent goalkeeper and his 64 speed means he's among the niftiest glovemen in the game.\n4. Marc-Andre ter Stegen - 89 OVR\nThe majority of Barcelona supporters would regard an 89 rating for Marc-Andre ter Stegen, a stylish goalkeeper with a similar profile to compatriot Neuer, as incredibly generous.\nThe German is not the goalkeeper he once was, even if he can produce moments and performances which remind fans of his vintage brilliance. A long-term knee injury means he won't play much before the release of EA FC 26.\n3. Alisson - 89 OVR\nLiverpool's transformative shot-stopper isn't the most refined in some departments, but he's perhaps the very best in one-on-one situations and an extraordinarily consistent goalkeeper.\nHis significance to the Reds remains undoubted, even if he's missed plenty of time in 2024 due to various injury setbacks.\nAlisson was a major factor in the club's success under Jurgen Klopp, with his ability as a sweeper ensuring Liverpool's often aggressive defensive line isn't relentlessly caught out.\n2. Gianluigi Donnarumma - 89 OVR\nAn imposing goalkeeper who was destined for stardom as a teenager, GIanluigi Donnarumma's apex arrived at Euro 2020 when he was crowned Player of the Tournament following Italy's triumph.\nThere are holes in Donnarumma's game which suggest an 89 rating is a little too lofty, but the Italian is nonetheless a supreme shot-stopper who's racking up plenty of collective honours in the French capital.\n1. Thibaut Courtois - 89 OVR\nAn anterior cruciate ligament tear meant Thibaut Courtois missed a large chunk of last season and he has been downgraded to an 89 from a 90. Still, the Belgian is the joint-best goalkeeper in EA FC 25 and the overwhelming majority would argue Courtois is a far superior goalkeeper to Donnarumma.\nHis heroics helped Real Madrid to a 14th Champions League crown in Paris and Carlo Ancelotti didn't hesitate in bringing him back into his starting XI down the stretch last term despite the impression Andriy Lunin made in his absence.\nThe imposing shot-stopper is as close to complete as any goalkeeper is, especially in a traditional sense. There are better ball players, but nobody has been more effective at stopping the other team from scoring than Courtois has in recent years.\nHe produces when it matters most, with something quite special often being required to breach his defence.",
  "word_count": 1072,
  "scraped_at": "2026-02-14T12:33:08.495370"
}