{
  "article_id": "95b23d56bcb0",
  "url": "https://www.spokesman.com/stories/2023/dec/20/idaho-loads-up-on-linemen-tight-ends-for-a-total-o/",
  "title": "Idaho loads up on linemen , tight ends for a total of 28 signees",
  "date": "20231221T041500Z",
  "domain": "spokesman.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Idaho loads up on linemen, tight ends for a total of 28 signees\nMOSCOW, Idaho – Following a Football Championship Subdivision recipe for success coach Jason Eck said was invented by nine-time national champion North Dakota State and adopted by defending national champion South Dakota State, Idaho loaded up on linemen and tight ends among the 28 freshmen it announced in early recruiting Wednesday.\nIdaho took six offensive linemen, four defensive linemen and four tight ends.\nThe Vandals hit on two of three recruiting targets in Spokane, wide receiver Aaron Kinsey (6-foot, 185 pounds) of Rogers High, and defensive back Jayden Wilkinson (6-0, 188) of East Valley High). Idaho lost out on one unnamed player to Eastern Washington, Eck said.\nIdaho signed 10 players from Washington, five from Idaho and four from Oregon. This is in line with a goal to make the Northwest its recruiting base, Eck said.\nAmong notable additions is running back Markhi McKinnon (5-11, 215) of Desert Edge High School. In a Phoenix area league, he rushed for 1,789 yards as a junior to be Arizona’s leading high school runner. Playing only eight games as a senior, he ran for 1,000 yards to lead Desert Edge to a second-place finish in the state championship.\n“He’s a big, physical guy and can run through tackles,” Eck said.\nAmong the offensive line recruits, Idaho signed three-star tackle Nathan Knapik (6-7, 250) of Kennewick High. He is the brother of Vandals’ All-Big Sky Conference honorable mention offensive lineman Ayden Knapik. He received an offer from Washington State.\nIdaho also signed Sone Falealo (6-6, 290) of West Anchorage (Alaska) High; Gabe Staszak (6-6, 265) of South Medford (Oregon) High; and Ryan Kawalek (6-3, 285) of La Center (Washington) High.\nThe Vandals checked a pair of recruiting goals with twin brothers Gus (6-4, 215) and Wiley (6-3, 215) Donnerberg of West Linn (Oregon). Gus is a tight end and Wiley an edge rusher.\nIdaho took one quarterback, Holden Bea (6-3, 200) of Washougal (Washington) High. Bea’s sister Skylar Bea and cousin Jaiden Bea are on the UI women’s basketball team, and his sister Beyonce Bea is playing for WSU this year and is a former All-Big Sky Conference standout for the Vandals.\nBesides finding Falealo in Alaska, the Vandals signed defensive lineman Titus Ringor (6-3, 285) from James Campbell (Hawaii) High, and tight end Everson Harker (6-6, 215) of Raymond (Alberta) High. Those places aren’t recruiting hotbeds, so there’s no serious competition from other schools to sign players.\n“I like those recruiting battles where you have got to beat nobody,” he said.\nThe in-state recruits are offensive lineman Leon Evans (6-4, 245), Eagle High; kicker Owen Forsman (6-0, 190), Lakeland High; tight end Cal Huish (6-5, 225), Eagle High; safety Matt Irwin (6-0, 175), Owhee High; and tight end Aiden Nixon (6-5, 218), Timberline High in Boise.\nForsman, Ringor, Nathan Knapik and Wilkinson will all enroll at Idaho in January and go through spring football with the Vandals, Eck said.\nAs Idaho’s coaches met with recruits this year, they did not field inquiries about the recent phenomenon of name, image and likeness (NIL) money-making opportunities for players.\nAccording to Eck, it is not yet a major topic in FCS high school recruiting.\n“I haven’t had one recruit ask me that,” he said.\nIdaho will continue to build its roster when recruiting opens again Jan. 3. Between then and the start of classes Jan. 10, the Vandals will have recruits on campus. In this cycle, they will look to fill specific needs at long snapper, receiver and cornerback.\nIdaho may pick up additional players through the transfer portal in April.",
  "word_count": 608,
  "scraped_at": "2026-02-14T13:10:13.061717"
}