{
  "article_id": "95dadec31270",
  "url": "https://www.noozhawk.com/prep-college-athletes-coaches-of-year-honored-at-sb-athletic-round-table-program/",
  "title": "Prep , College Athletes , Coaches of Year Honored at SB Athletic Round Table Program | Local News",
  "date": "20230523T073000Z",
  "domain": "noozhawk.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Santa Barbara Athletic Round Table honored the top high school and college athletes in each sport and named coaches of the Year at its Evening With the Athletes program on Monday at the Majorie Luke Theater.\nSBCC football’s Craig Moropoulos was named the College Coach of the Year, while San Marcos baseball’s Wes Ghan Gibson received High School Coach of the Year honors.\nMoropoulos guided SBCC to a magical season. The Vaqueros posted a school-best 10-1 record, won their first outright conference championship since 1991 and their second-ever state bowl game victory and the first since 1982.\nGhan Gibson took San Marcos baseball to its first-ever CIF-SS championship game. The Royals also reached the quarterfinals and semifinals for the first time and won a third straight Channel League title.\nThe SBART also handed out special awards. Those recipients were:\nSue McDonald, Open Athlete of the Year\nDave and DeAnna Odell, Masters Athletes of the Year\nJordon Dyer, Russ Hargreaves Memorial Award\nKelsea Vallance, San Marcos, James Ranta Memorial Award\nLuke Hoover, San Marcos, SBART Founders Award\nKyle Yao, Dos Pueblos, Russ Morrison Memorial Golf Scholarship\nOwen Weddington, San Marcos, Larry Crandell Memorial Award\nAquatics athletic Sophia Panossian of San Marcos received the Phil Womble Ethics in Sports Scholarship.\nChris Powers was awarded the Special Olympics Mayor’s Trophy.\nHere is the list of the athletes of the year from each season.\nFall Athletes of Year\nHIGH SCHOOL FOOTBALL\nQu’Ran Gossett, Bishop Diego: He was a beast of a running back for Bishop Diego, leading the Cardinals to the CIF Division 3 semifinal. He rushed for 2,000 yards, set county record for rushing yards in a game with 404 yards against Simi Valley, and he tied the record of 6 touchdowns in game.\nGIRLS VOLLEYBALL\nEliana Urzua, Bishop Diego: Her powerful hitting and all-around game led Bishop to a second straight league title and the second-round of the Division 5 playoffs. There were some matches this season where she led in kills and assists.\nGIRLS GOLF\nSagarika Manian, Dos Pueblos: She repeated as the Channel League individual champion, edging teammate Victoria Chen by one stroke. In team competition, she posted the low score for DP with a 46 at La Cumbre CC to help the Chargers edge San Marcos for the Channel League title by two shots.\nBOYS WATER POLO\nJerrard Burford, Santa Barbara High: He was the leading scorer for the Channel League-champion Santa Barbara Dons, who qualified for the Division 1 playoffs. Burford, who was especially big in the crosstown games, was the co-MVP of the Channel League.\nGIRLS TENNIS\nNatasha Gil, San Marcos: After winning the Channel League singles title the previous two years, she switched to doubles in the league tournament and added that title to her list of accomplishments. She also led the Royals to an undefeated league season.\nBOYS CROSS COUNTRY\nEamon Gordon, Dos Pueblos: He finished third in the CIF-SS Division 3 finals, helping the Chargers qualify for the State Championships for the third year in a row. He also won the County Cross Country Boys Individual title.\nGIRLS CROSS COUNTRY\nPhoebe Wolfe Lyons, Dos Pueblos: She dominated the local races and repeated as the county champion. She finished third in the Division 3 prelims at Mt. SAC to help the team qualify for the finals.\nCOLLEGE WOMEN’S VOLLEYBALL\nMacall Peed, UCSB: She was the Big West Libero of the Year and all-region selection. She had 466 digs on the year, which helped her surpass 1,000 digs in her career.\nWOMEN’S SOCCER\nReece Davidson, Westmont: She scored 18 goals and led Warriors to the NAIA quarterfinals. She became first player in the history of the storied women’s program to record three hat tricks during the season. She was honored as the GSAC Player of Year.\nWOMEN’S CROSS COUNTRY\nSage Holter, SBCC: She placed fourth at the State Meet and ran the 2nd fastest time by a SBCC runner in the last 15 years at the meet. Her time on the 5000-meter course was just 2 seconds behind the record.\nMEN’S CROSS COUNTRY\nZola Sokhela, Westmont: He earned his 13th career NAIA AllAmerican honor, after finishing 36th overall at the national championships. He was named NAIA Cross Country West Region Men’s Athlete of the Year. He won the GSAC individual championships with a career-best time in the 8k, and finished in the top 10 in five races during the season.\nMEN’S SOCCER\nLeroy Zeller, UCSB: He was wall between the posts for the Gauchos. He had a program-tying six straight shutouts and was named co-Goalkeeper of Year in Big West.\nMEN’S WATER POLO\nSam Nangle, UCSB: He was a handful for defenses, scoring a team-best 37 goals and drawing 45 exclusions. At the defensive end, he had 15 field blocks. Nangle was Named to All-Golden Coast Conference team.\nWOMEN’S GOLF\nCarlee Steven, SBCC: She earned All-State honors for the second straight year after finishing sixth at the Women’s Golf State Championships. She qualified for State by placing 7th at the So Cal Championships. Steven was the Western State Conference runner-up.\nWOMEN’S WATER POLO\nClaire Daland, SBCC: She earned all-state honors after finishing the season with 68 goals which was second on the squad. She added a team-high 85 steals, which was fourth in the state. Her play led Vaqueros to their second state title.\nCOLLEGE FOOTBALL\nBrandon Smith, SBCC: The exciting running back set the single-season record with 16 touchdowns and twice had games of 200 yards rushing, including a school record 260 vs. Glendale. He finished season with 1,231 yards, second all-time in SBCC history.\nWinter Sports\nBOYS BASKETBALL\nCo-Players of Year Luke Zuffelato, Santa Barbara High and Babacar Pouye, Cate:\nZuffelato, the Dons’ sophomore guard, was picked to the Division 4AA All-CIF team. He was the leading scorer on the South Coast, averaging 23.2 points. He also average 7.2 rebounds, 1.4 steams and one block per game. His efforts helped the Dons finish third in a tough Channel League and reach the second round of the playoffs after missing the postseason the previous year.\nPouye recovered from an early season injury and became an all-around force for Cate. The 6-8 senior forward was named to the Division 4A squad. He averaged 20.3 points, 14.7 rebounds, 2.5 blocks and 2.5 assists per game, and led the Rams in the 4A quarterfinals, where they lost against eventual champion Long Beach Jordan. He is headed to Bates College to continue is basketball and education career.\nGIRLS BASKETBALL\nMichelle Arellanes, San Marcos: She was a force at both ends of the court. A standout three-point shooter, Arellanes could also take to the hoop and draw fouls. She also played great defense for the Royals, often making steals and key moments of a game. She was an All-Channel League first-team selection. She averaged 16 points, 6 rebounds, 3 assists and 3 steals per game.\n“She stepped up this season when the team had challenges with injuries and asked to play a position that wasn’t her natural position,” said coach Tiffany Sims. “She has left an exceptional mark within the SM girls basketball program.”\nGIRLS WATER POLO\nAva Stryker, San Marcos: Her last name is so fitting to what she does in her sport. Stryker scores goals. She was the leading scorer for the Channel League-champion Royals, who played in highest CIF division. Stryker is in the mix with U.S. Water Polo. She played with the senior national team on a few occasions, including a trip to Australia during the winter. She won a world championship gold medal last summer with the U.S. Youth National Team. She’s head to USC in the fall.\nGIRLS WRESTLING\nPepper Marks, Santa Barbara: This student athlete made local high school sports history. She is the first girl to win a CIF championship during her junior year and she repeated the feat this year. She is the first to qualify for the CiF State championships and finished sixth in her weight class; She is the first girl wrestler on the South Coast to earn All-American honors at the High National Championships in Virginia Beach, Va. She signed with Southern Oregon University, which just won the first NAIA Championship for women’s wrestling.\nBOYS WRESTLING\nJacob Dominguez, San Marcos: He dominated his 106-pound weight class and repeated as Channel League champion. There were times, he’d wrestle up two weight classes to help the Royals win dual meets. He fought off an injury and placed third in the CIF Divisional Championships and qualified for the Masters Meet.\nBOYS SOCCER\nCo-Players of Year, Justin Hess, Leonel Olivo, San Marcos:\nThese two were the impact players at opposites ends of the field, helping San Marcos win a third straight Channel League championship with a 13-0-1 record.\nOlivo was the finisher in front of the goal, while Hess cleaned things up defending the goal. They were the Offensive and Defensive MVPs in the Channel League.\nGIRLS SOCCER\nSiena Urzua, Bishop Diego: The Cal Poly-bound Urzua did it all for the Cardinals. She defended, played in the midfield and scored goals. A tremendous athlete, she was part of Bishop Diego’s CIF championship team in her junior year. She also won a CIF title in volleyball.\nMEN’S BASKETBALL\nAjay Mitchell, UCSB: Mitchell was something special. He was the kind of player who could take over games. With tremendous vision and savvy , he would dissect a defense, drive to the hoop and finish the play. His play helped the Gauchos set a program record for wins with 27, win the Big West Tournament and advance to the NCAA Tournament. He averaged 24 points in the Big West Tournament. For the season, the sophomore point guard averaging a team-high 16.4 points and 5.1 assists per game, won both the Big West Player of the Year and Tournament Most Valuable Player awards.\nWOMEN’S BASKETBALL\nStefanie Berberabe, Westmont: “I tell people I’ve run out of adjectives and words to describe what this young woman does on the court,” said her coach Kirsten Moore. Berberable became Westmont’s all-time leading scorer and did it in nine less games than the previous leader. She places in the top-10 in 16 statistical categories. She is Westmont’s all-time leading scorer with 1,752 career points, is second in both career assists (601) and in career steals (325). She has played in more games (134) than any other Warrior and for more minutes (3,896). She ranks third in career points per game at 13.1. And, ranks fifth in career offensive rebounds with 260 and ninth in total rebounds. She is a 3-time first-team All-American. But, more importantly “there is such a purity of heart about her,” said Moore. What she was doing was for the good of her teammates and the whole team.”\nMEN’S SWIMMING\nKyle Brill, UCSB: He repeated as champion in the 200 IM at the Mountain Pacific Sports Federation Championships in a school-record time of 1:44.99, and won the 400 IM in a season-best time of 3:46.20. He was runner-up in the 200 backstroke. He was named first-team All-MPSF and was a three-time MPSF Athlete of the Week.\nWOMEN’S SWIMMING\nMaelynn Lawrence, UCSB: She won MPSF championships in the 200 butterfly and 400 IM; swam the second fastest 200 butterfly in the conference , 1:59.8. She also took fourth place in the 500 freestyle and won a 1000 free race in a dual meet against Bakersfield. She received earned All-MPSF honors.\nSpring Sports\nHIGH SCHOOL BASEBALL\nCole Schoenwetter, San Marcos: Cole had a huge senior year. He pitched in San Marcos’ first CIF final, went 6-1 with a 0.99 Earned Run Average with 103 strikeouts in 61.2 innings. His pitching led the Royals (22-7 overall, 11-1 Channel League) to their first-ever CIF quarterfinals and semifinals appearances and a third consecutive Channel League title. He’s the team leader in hits, doubles and slugging percentage. He struck out 10 and allowed one hit in six innings of 2-0 CIF quarterfinal win at Redlands East Valley.\nSOFTBALL\nBella Nuño, Dos Pueblos: She had a batting average of .500 (51/102), hit a school-record 18 homers, had 38 RBIs, 8 doubles and 3 triples. On defenbse, she had a.974 fielding percentage at shortstop.\n“Bella’s impact and value to the team cannot be measured,” said coach Mike Gerken. “She is a star among stars of our very talented senior class. Bella set the tone for the entire team by modeling excellence every day. Our success between the lines and in the dugout has a lot to do with a star that does not act like a star.”\nBOYS VOLLEYBALL\nCo-MVP: Raglan Kear, Santa Barbara, Hansen Streeter, San Marcos:\nTaking over a position that has produced several Division 1 college players, Raglan stepped up to become the dominating outside hitter for a Dons team that kept improving and won the league title. The team advanced to CIF D2 quarterfinals. He finished the season with 205 kills, 41 service aces, 25 blocks and 46 digs. He was named all-tournament at the Best of the West and the Karch Kiraly Tournament of Champions.\nHansen was “Mr. Smooth” for San Marcos. His setting and decision making were instrumental in the Royals winning 30 matches, capturing the Dos Pueblos Invitational and reaching the CIF D2 semifinals. Said one of his teammates after a CIF playoff win: “He ran the show, that’s what he’s supposed to do and that’s what he does best.”\nGIRLS BEACH VOLLEYBALL\nLucy Speier/Chloe Hoffman, Dos Pueblos: They senior partners won the first Channel League pairs title and led the Chargers to the team title and the CIF Division 1 quarterfinals. They suffered only one loss in the regular season at No. 1 spot and reached the final four of the first CIF Pairs Championship.\nBOYS TENNIS\nJoey and Charlie Friedman, San Marcos: They are 30-0 overall and went 20-0 in league. They have lost a total of 36 games over the course of the season, including playoff games and lost only 14 games in league. They swept their opponents in the CIF Sectional to advance to the Round of 32 in the individual tournament. Beyond the tennis court, they both have above a 4.4 GPA and challenge themselves regularly with AP classes\nBOYS GOLF\nCo-Players of Year Leo Metzger, San Marcos and Teddy Vigna of Dos Pueblos:\nMetzger led San Marcos to its 13th CIF golf championship and first since 2016. He tied for medalist honors at the team finals at River Ridge in Oxnard with a 4-under 68. The UC Davis-bound golfer also led the Royals to the Channel League title. In addition, he was all-tourney at Palm Springs Invite, finishing 9th out of 250 golfers; led a three-player San Marcos team to the title at the Spanish Hills Invitational in Camarillo. He qualified for U.S. Amateur in a playoff; and won the Santa Barbara City title.\nVigna won a super competitive Channel League individual title with an 11-under score against some very good competition. He shot 4-under 68 on the last day at Soule Park. He shot a 71 at Glen Annie, helping DP to school record 5-over 360. He shot a 65 at Glen Annie this season.\nBOYS TRACK\nCo-Players of Year: Andreas Dybdahl, Santa Barbara and Sebastian Sutch of Cate:\nDybdahl is headed to the CIF State Championships in the 1600. During the season, he finished in top 3 in the 1600 in six meets. He was second in the Open Race at the Arcadia Invitational, third at the Mt. SAC Relays, second at the Channel League finals and third at the CIF-D2 Prelims, qualifying him for the finals. In the Division 2 finals, he finished in second place with the third fastest time among all divisions and qualified for the Masters Meet.\nSutch won CIF-SS Division 4 titles in the 800 and 1600, setting school records in both, and ran on a fourth-place 4×400 relay. He qualified for the Masters Meet in the 800 and 1600 and made the State Championships in the 1600.\nGIRLS TRACK & FIELD\nMakenzie Fauver, San Marcos: She went undefeated in 100 and 300 hurdles during league season. She was a big point producer for the Royals in meets, scoring in the high jump, triple jump and relays. She qualified for the CIF-SS D2 finals in both hurdles races and in the 4×400 relay. Fauver is headed to Westmont.\nBOYS SWIMMING\nNikko Carrillo, Dos Pueblos: He finished second in the 100 backstroke and third in the 200 IM at the CIF-Southern Section Division 2 finals and qualified for the State Meet in both. He won both events in the Channel League and was on a league-winning 200 medley relay team. He is headed to Wagner University in New York.\nGIRLS SWIMMING\nSierra Tallman, San Marcos: She finished in the top 9 in two individual events at the CIF Division 1 finals: sixth in the 100 freestyle and seventh in 200 free. She also swam on a fourth-place 400 free relay and a fifth place 200 free relay and qualified for the State Meet. She was on a league record-setting 200 free relay in the Channel League finals and was league champion in the 100 breaststroke. At the State Meet, she was 13th in the 200 free and 7th in the 100 free and was on a 10th-place 400 relay team\nBOYS LACROSSE\nHarry McAdam, Cate: The senior attacker led the Rams to their first CIF-SS Quarterfinal. He scored 31 goals and had 33 assists for 64 points, and picked up 37 ground balls.\nGIRLS LACROSSE\nEllie Tunnell, Cate: She is a four-year starting varsity player and captain this year. She led the team in draws, averaging 6 draws per game. She also averaged 3 goals. In the midfield, Tunnell was the connection between the attack and defense, using her speed and support passes.\nCOLLEGE BASEBALL\nBrady Renck, Westmont: He led the Warriors to the GSAC and NAIA Opening Round Tournament titles. He’s a repeat All-GSAC selection and a Gold Glove winner, holds a team-leading .392 batting average and leads the Warriors in both hits and extra-base hits.\n“Brady Renck’s prolific career culminated with this senior campaign,” said coach Tyler LaTorre. “His numbers don’t tell the whole story about how important he is to the success of our Warrior Baseball program. An incredibly tough out and outstanding defender, Brady’s legacy at Westmont is truly special.”\nCOLLEGE SOFTBALL\nMaddie McNally, UCSB softball: She was the Big West batting champion with a .414 average. She had four triples and 10 doubles, drove in 21 runs, scored 44, stole 11 bases, had 24 multi-hit games, a 12-game hitting streak, helping the Gauchos finish the season with 11 more wins than a season ago, and post more than 20 wins since (26-22) 2017 for their first winning season since 2017. Maddie was first-team All Big West and was named All-Pacific Region First Team.\nMEN’S GOLF\nRyan Gay, SBCC: The sophomore led SBCC to the WSC Championship. He was the lowest scorer on the team and the medalist at the WSC Finals. He placed 7th at the So Cal Regionals, and qualified for State Championships as an individual. SBCC finished fifth as a team.\nWOMEN’S SWIMMING\nIsabella Urlando, SBCC: She won the three Western State Conference titles and captured state titles in the 100 backstroke and 200 back. She set a state record in the 200 back with a time of 2:01.56. She also finished 2nd in the 100 butterfly at state and swam on three-top 3 relay teams at the state finals\nMEN’S VOLLEYBALL\nRyan Wilcox, UCSB: An AVCA All-America Honorable Mention and All-Big West First Team pick, he is the only player to compete in every set. Wilcox ended the regular season with 291 kills, the second-most in a season throughout his career. He also earned the most digs in a season with 160. He also led the team in aces with 31.\nWOMEN’S WATER POLO\nCaitlyn Snyder, UCSB: She earned her third career all-conference selection, being voted to the All-Big West Second Team. The redshirt senior had 55 goals plus a conference-leading 46 assists. She ranked fifth in steals, and won more sprints than any other Big West player. Her six-goal day against Cal State Fullerton is tied for the most goals in a single game in UCSB history.\nMEN’S TENNIS\nPhilip Jordan, UCSB: He earned First-Team All-Big West honors in both singles and doubles. Jordan played at the top of the lineup for the Gauchos all season, 19 of his 21 singles matches were played in the No. 1 slot where he recorded a 14-5 record. In doubles, Kai Brady and Jordan played every match at the No. 1 position together earning an 11-4 record. He was a 3-time Big West Player of the Week.\nWOMEN’S TENNIS\nAmelia Honer, UCSB: She was named Big West Player of the Year, while also collecting First Team honors in both singles and doubles. The sophomore went 16-1 overall and a perfect 9-0 in Big West singles. She also went 4-1 against nationally ranked-opponents during the season. Honer earned an automatic qualifying position for the NCAA woman’s tennis singles tournament and in doubles as well with partner Kira Reuter. They went 13-3 at the No. 1 doubles position, and a perfect 4-0 against nationally ranked opponents.\nMEN’S TRACK & FIELD\nZola Sokela, Westmont: He won GSAC Championships in the 400-meter run and the 1500. He ran another NAIA A-Standard time of 3:51.00 to win the 1500.\nWOMEN’S TRACK & FIELD\nMalia Benson, UCSB: The sophomore and former softball player, transferred from the University of San Diego and set the UCSB record in the women’s javelin with a throw of 164 feet, 5 inches to win at the UCSB Invitational. She was third at the Stanford Invite, first in the Challenge Cup Classic, seventh at the Mt. SAC Relays and third at the Fresno Invite. She won the Big West title on her first throw of 50.8 meters\nCOLLEGE BEACH VOLLEYBALL\nEmma Crabb/Olivia Medina, SBCC: The Vaqueros’ No. 1 team led the team to its first State Team Championships. They qualified for pairs championships and reached the Round of 16.",
  "word_count": 3687,
  "scraped_at": "2026-02-14T12:39:33.878636"
}