{
  "article_id": "95e7a3d44f33",
  "url": "https://www.fcbarcelona.com/en/club/news/4226722/three-fc-barcelona-nominees-for-laureus-awards",
  "title": "Three FC Barcelona nominees for Laureus Awards",
  "date": "20250303T123000Z",
  "domain": "fcbarcelona.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Three FC Barcelona nominees for Laureus Awards\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link\nFC Barcelona will once again be a prominent feature at the Laureus World Sports Awards, which recognise the best sports clubs and athletes of the previous year. There are no fewer than three blaugrana nominees across the different categories, namely Aitana Bonmatí, Lamine Yamal and Barça Women.\nAitana aiming for second win\nAitana Bonmatí was already named as the winner of the Sportswoman of the Year award last year, and after helping the team to the domestic double and the Champions League in 2024, as well as second Ballon d'Or among her many individual honours, she has to be one of the favourites this time again. But there is some stiff competition out there, including US gymnast Simone Biles.\nLamine Yamal the young gun\nLamine Yamal has had such an extraordinary 2024 that he was an obvious candidate for the Breakthrough of the Year prize. He is such a household name these days that it seems amazing to think that 2024 was his first complete year as a senior player, which he began at the tender age of 16, setting all kinds of national and continental records and starring in Spain's European Championship winning side.\nHaving already won the Golden Boy and Kapa Trophy, to add this prize to the collection his rivals include French basketball sensation Victor Wembanyama and German football club Bayer Leverkusen.\nBarça Women up for team gong\nFC Barcelona Women have enjoyed yet another all-conquering year, including the second Champions League in a row, but that too face stiff competition from the likes of Real Madrid's men, the US basketball team and Formula One's McLaren.\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link",
  "word_count": 316,
  "scraped_at": "2026-02-14T12:49:35.044961"
}