{
  "article_id": "95ffd1935d0c",
  "url": "https://www.perthnow.com.au/opinion/ben-oshea/ben-oshea-its-unlikely-luis-rubiales-would-plant-a-kiss-on-the-lips-of-the-spanish-mens-teams-striker--c-11653366",
  "title": "Ben OShea : It unlikely Luis Rubiales would plant a kiss on the lips of the Spanish men team striker",
  "date": "20230825T193000Z",
  "domain": "perthnow.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ben O’Shea: It’s unlikely Luis Rubiales would plant a kiss on the lips of the Spanish men’s team’s striker\nThe Matildas’ incredible success at the World Cup, on and off the field, gives hope that we have just experienced a watershed moment for women’s sport.\nThe final of the tournament threw a splash of cold water on those hopes.\nThis is not any reflection of the game itself, mind you, which was a riveting contest between Spain and England that was eventually (and deservedly) won by La Roja.\nThese two teams played with skill and fierce determination.\nThe stakes were high, the game was physical, there was drama, and the effort and commitment on display was immense – it was everything elite sport should be.\nAs anyone who has watched this tournament could’ve predicted.\nSo, why didn’t Prince William make a decent effort to be there? Queen Letizia of Spain and her 16-year-old daughter managed it.\nAs the president of the English Football Association, you best believe Wills would’ve moved heaven and earth to see the English men’s team if they made a World Cup final.\nBut apparently, he couldn’t make it to Stadium Australia to support the English women’s team, in the country’s first World Cup final appearance since 1966, because it was such a long flight for such a short visit, and thus environmentally unsound.\nOr it was diplomatically inappropriate, because his old man, Charles, was yet to visit Australia since becoming King.\nJust like England striker Lauren Hemp’s shots on goal in the Lionesses’ 1-0 defeat on Sunday, William’s excuses missed the mark.\nThe Lionesses have only lost once in 38 games under coach Sarina Wiegman, and, based on that record of success, it seems logical that the Prince of Wales would’ve pencilled in the date of the final months ago.\nTo spurn the team at the last minute with a token video message of support, using his daughter as a prop, speaks volumes for his respect towards women’s sport.\nStill, one can be reasonably sure the English players would rather their FA president skip the final than rock up and behave like his Spanish counterpart.\nLuis Rubiales also showed why women’s sport is getting less than equality, after he used the trophy presentation as an excuse to put his hands on the back of Spanish striker Jenni Hermoso’s head, and plant a kiss on her lips.\nLater in the changerooms, Rubiales was captured on video saying the Spanish football federation would send the team to party in Ibiza, where he would marry Hermoso.\nIt’s unlikely he’d extend the same offer to the star of the Spanish men’s team.\nEven though Hermoso later played down the incident, quite reasonably wanting to turn public attention to the players’ achievement on the pitch, the optics of Rubiales’ behaviour are horrible to all the young girls and women watching a showpiece of women’s sport.\nAgainst a backdrop of disturbing allegations against Spanish coach Jorge Vilda, the optics are even worse.\nThe players at this World Cup have emphatically proven the worth of elite female sport – and it shines a harsh spotlight on Prince William, Rubiales and any other bloke who doesn’t recognise it.",
  "word_count": 534,
  "scraped_at": "2026-02-14T13:04:08.243312"
}