{
  "article_id": "961d6f953e10",
  "url": "https://www.news-press.com/story/news/local/2023/03/13/fgcu-archives-filled-with-historic-items-tied-to-the-campus-and-beyond/69934389007/",
  "title": "FGCU archives filled with historic items tied to the campus and beyond",
  "date": "20230313T124500Z",
  "domain": "news-press.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Behind the scenes: From bones to books, FGCU's archives are full of surprises\nDuring a recent visit to the Florida Gulf Coast University's Archives and Special Colletions, located in the Wilson G. Bradshaw Library at the Fort Myers campus, this thought crossed my mind: Indiana Jones would love this place.\nJonah Hinebaugh, a visuals journalist for the Naples Daily News and The News-Press, joined me on a February afternoon for a unique behind-the-scenes look at the incredible array of items that are in FGCU's archives and special collections.\nThe items we saw, located on the library's third floor, represent hundreds of historic artifacts in the archives, or what the FGCU website calls \"the official repository of records for Florida Gulf Coast University and serves as its institutional memory.\"\nMelissa Minds Vandeburgt and members of her team gave us a tour of the archives and a closer look at some of their favorite pieces in the collections.\nVanderburgt is the Director of Academic & Community Engagement and Head of University Archives and Special Collections.\nHere are seven very special items we viewed:\n1-'Vote for Women' armband\n- COLLECTION: Racial and Social Justice\n- The armbands (1 1/2 x 24 inches) were worn by Suffragettes during parades and rallies leading up to the passing and ratification of the 19th Amendment in 1920.\n- The Racial and Social Justice Collection covers various racial and social movements that span from the late 1800s to present-day issues.\n- MORE: See web page for this item\n2-FGCU football helmet\n- COLLECTION: University Archives\n- In 2011, FGCU hired an analytics firm to estimate if it could support an NCAA football team. The firm reported that FGCU would need to expand its athletics facilities and relationships with other regional colleges to be inducted into a division conference. Nevertheless, the firm offered a 6-year plan to launch the football program. The first three years focused on scholarships and recruitment, while the next three saw the team competing in small matches. Ultimately, President Wilson Bradshaw determined it wasn’t feasible at that time.\n- MORE: See web page for this item\n3-Jar of dirt from FGCU groundbreaking\n- COLLECTION: University Archives\n- On Nov. 28, 1995, university faculty and community members gathered to celebrate the official campus groundbreaking of Florida’s 10th public university, forever changing the landscape of Southwest Florida’s history. Some of the original land from FGCU’s groundbreaking was collected in order to remember the historic moment.\n4-Meaning of Civil Rights: A letter written by Eleanor Roosevelt\n- COLLECTION: Racial and Social Justice Collection\n- A typed letter signed, to \"Harry,\" Washington, D.C., February 19, 1944.\n- The letter was written on White House stationery.\n- Excerpt: \"Something has to happen to people's souls before they are going to give the rights of citizenship to all the people of our country, regardless of color or creed. That does not mean you have to ask them to dinner. It only means giving them the rights that go with citizenship.\"\n5-Non-human primates skull\n- COLLECTION: Maples Collection\n- The non-human primate skeletons are part of the Dr. William R. Maples (1937-1997) Collection. Maples was a world renown forensic anthropologist, who oversaw the C.A. Pound Human Identification Laboratory at the Florida Museum of Natural History. Some of his most notable cases include Fransisco Pizarro, the Romanov family, Joseph Marrick (known as the Elephant Man), and the ValuJet Crash in the Everglades in 1996.\n6-Artists books\n- COLLECTION: The Artist Book Collection\n- Artists’ books are a medium of expression that employs the structure of a book as inspiration while challenging the conventional contents of a printed volume. Artists’ books are produced in limited numbers and are classified as works of art, typically produced by a single creator. The Artist Book Collection at FGCU’s Archives and Special Collections features books from the 1970s to present day.\n- \"100 Skies\" by Geoffrey Hendricks and Henry Martin features 100 beautiful watercolors of sky by Hendricks reproduced on 50 two-sided cards, interspersed with 50 short texts by Henry Martin, and wrapped up in a lovely linen pocket.\n7-Apollo 1 - The Calm Before the Fire\n- COLLECTION: Charles A. Ray Photojournalism Collection\n- Command Pilot Virgil “Gus” Grissom, Senior Pilot Edward H. White, and Pilot Roger B. Chaffee are interviewed by the press at Cape Canaviral in January of 1967 a few days prior to their death in a cabin fire during a launchpad test for the Apollo 1 mission.\n- Photojournalist Charles Ray documented the second half of the twentieth century with an unerring eye and an incomparable nose for news. Through his lens, the public experienced the drama of presidential campaigns, the passion of the civil rights movement, and the adventure and tragedy of NASA's race for space. Charles Ray documented our nation's growing pains, including the bloody clashes between police and journalists covering the civil rights protests of the 1960s, and the tragic end of Camelot.\n- MORE: See web page for this collection\nDonating to the Special Collections at FGCU\nIf you have something you are interested in donating the FGCU's Special Collections, here is a link to a web page on the arhvives site for more information.",
  "word_count": 866,
  "scraped_at": "2026-02-14T13:45:33.221180"
}