{
  "article_id": "9632cbfec9e4",
  "url": "https://thestandard.org.nz/open-mike-13-06-2023/",
  "title": "Open mike 13 / 06 / 2023",
  "date": "20230612T193000Z",
  "domain": "thestandard.org.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Written By:\n- Date published:\n6:00 am, June 13th, 2023 - 131 comments\nCategories: open mike -\nTags:\nOpen mike is your post.\nFor announcements, general discussion, whatever you choose.\nThe usual rules of good behaviour apply (see the Policy).\nStep up to the mike …\n- Comments are now closed\n-\nNZ a “wet and whiny place” according to Baldrick Mark Luxon.\nhttps://www.stuff.co.nz/national/politics/132301337/christopher-luxon-calls-nz-a-very-negative-wet-whiny-inwardlooking-countryWell it certainly might be if you happen to be a poor farm beast subject to the mud slurry of “winter grazing” or a Groundswell/Fed Farmers moan fest.\nYes, we have had a bit of rain…Climate Disaster related…but he wants to give the farming faithful still more time out from taking responsibility.\nhttps://www.stuff.co.nz/national/politics/130144119/national-promises-to-repeal-potential-farming-emission-changesMr Luxon seems to be attempting a version of his hero SirKey’s Hermit Kingdom meme. Hawaii might be more suited to this miserablist–please keep him on Natzos until October 14.\n-\nI kinda agree with him , as a farm worker and dog trialer I rub shoulders with lots of wealthy people, fuck they moan alot,and some of them a just angry people,\nI offered to swap places with them but none of them have taken my kind offer up 😉\n-\nOnya mate! I rate that you maintain your \"left\" . And..sense of humour…essential\n) Keep on-\nIt would be false of me to claim that I'm openly left in these circumstances, partly due to cowardice, also a boys got to eat, and arguing with stupid people is pointless.\nThat said the left is the only option of a thinking person who doesn't vote for self interest imho.\n-\nMatey I know its not cowardice…and… I can relate to the other 2. Ive tried to engage with some people…not even rich and/or right wing , for whom actually voting would be in their best interests.\nHard work….and/or not interested. But..gotta try.\nAnyway…you are Rural, and what i've seen got a lot of sense.\nI like your last sentence\nThat said the left is the only option of a thinking person who doesn't vote for self interest imho.\nI do know of Rural's with similar thinking down South.\n-\n-\n-\nPriceless bwaghorn.\n-\n-\nNegative, wet, whiny, inward looking? He's been spending too much time in the National caucus.\n-\n-\n-\nBe a good thing if the whole quote was published to give it in context. Here it is:\n\"We have become a very negative, wet, whiney, inward-looking country and we have lost the plot and we have got to get our mojo back,\" Luxon said to one farmer.\nNot to much I disagree with to be honest.\n-\nWell, still not quite in the JFK, Obama or Jacinda league…\n-\nOh tsmithfield, don’t go spoiling everyone’s fun. People are getting off in their darkened room on what they thought was said rather than what actually was said. Let them be.\n-\nAnd nuzzling farmer nethers by kicking the emissions can down the paddock by five years is the epitome of positive, dry, stoicism.\n/\n-\nMagical thinking kiwis\nonce were magic\n-\n-\n-\nYr first two sentences sounds like you are describing The Disinformation Project.\n-\n-\n\"We have become a very negative, wet, whiney, inward-looking country and we have lost the plot and we have got to get our mojo back,\" Luxon said to one farmer.\nHas Luxon taken to reading the Standard ?\n-\n'Mojo'- magic charm, talisman, a spell. Just what we need…… Bald Lemon Luxon singing the Blues. \"I got my mojo workin' but it just don't work on you.\"\n-\nNegative, wet, whiney is a clear self-description of the National and ACT parties and their voters, but inward-looking is an accusation directed at Labour, the Greens and their voters.\nThe unfortunate truth is of free trade agreements with the EU and the impressively good deal with the UK.\nAnd the PM is leading a trade mission to China.\nAnd we also have the Fifa Women's World Cup here in July.\nQueenstown airport is looking to expand and Christchurch airport wants to build another at Tarras.\nThe inward-looking claim is nothing more than a cynical political lie which some people revel in swallowing.\n-\nMOJO back .\nYeah baby yeah!!\n-\nI hunt down the cd compilations they used to have on their covers..\nQuality stuff..\n-\n-\nNew Zealand is ranked by none other than the World Bank as the best country in the world for ease of doing business. What is Luxon's problem?\nhttps://graphics.wsj.com/table/DoingBusiness\n-\nHis problem is he wants to be pm, and he'll say and do anything to get there!!\n-\nYou might want to have a look at the date for your numbers.\nThe World Bank stopped calculating that number several years ago. You may find that the numbers you are quoting are from the days when Winston Peters still ruled the roost.\n-\nIts dated 2019 on another site….after 2 years of the Labour government….NZ has probably gone further ahead since\n-\n\"probably gone further ahead\"\nNow that is the confidence we need. I don't know whether I would bet on it though.\n-\nSo positive left wing comment, draws whiney negative right wing response!!!luxon was right\n-\nNew Zealand topped the Ease of Doing Business rankings in 2017, 2018, 2019, and 2020.\nA very positive result, but (apparently) some of the World Bank's 'Ease of Doing Business' rankings are a bit suspect – what do you expect from a bank.\nhttps://en.wikipedia.org/wiki/Ease_of_doing_business_index#ControversiesWorld Bank’s scandal-hit ‘Doing Business’ seeks redemption with revamp [9 March 2023]\nhttps://bakertillysr.nz/services/specialist/expand-your-business-into-new-zealand/\n-\nThank you for this comment. I hadn't been aware that they were reviving this exercise. It had, as your link shows, started smelling rather more than a reliable exercise should. It was also being done using information that really couldn't be relied on and which was often nothing but guesses.\nThat isn't saying that New Zealand was corrupt in the way that China was but the evaluation done, for all countries, was pretty rudimentary and wasn't always based on up to date figures. Trying to cover all the countries in the world and doing it every year meant that if they didn't have a new number there was, as I understood it, a tendency to just assume nothing had changed since last year or the last year you did have something, if you didn't have an updated value readily available.\nBy the way the World Bank isn’t really a bank.\n-\nBy the way the World Bank isn’t really a bank.\nLikening the World Bank to a real bank would be unkind.\nGetting to Know the World Bank [26 July 2012]\n10 Biggest Banking Scandals Of 2012 [27 December 2012]\nWe need a proper Commerce Commission inquiry into bank profits [5 March 2023]\nWhile I have the highest respect for Sir John Key, he was chairing our biggest bank, and most profitable company, within a year of leaving politics. No politician, let alone an ex-prime minister should be allowed to do that. The OECD standard is to wait at least three years.\n…\nThe fourth question is why the New Zealand operations of Australian-owned banks are consistently more profitable than their home market.Relative to incomes, Australian-owned banks have reliably made about 20% more from the average Kiwi customer than their Aussie equivalent. How is this possible, and why is this accepted by politicians and regulators?\nhttps://en.wikipedia.org/wiki/ANZ_(bank)#Controversies\nThe establishment of the commission followed revelations in the media of a culture of greed within several Australian financial institutions.\nhttps://en.wikipedia.org/wiki/National_Australia_Bank#Hayne_Royal_CommissionA 'culture' of greed? Say it isn't so!\nhttps://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/\nhttps://en.wikipedia.org/wiki/Barings_Bank#Corruption\nCrooks, kleptocrats and crises: a timeline of Credit Suisse scandals [21 February 2022]\nThe collapse of Credit Suisse earlier this year came just in time\n-\n-\n-\n-\n-\n-\n-\nBut no reflection on the role opposition parties, and their proxies have played in making us like that. Relentless negativity makes for a whiney, wet country.\n-\n-\nIt seems deliberate and straight out of the Jong Khee emotionally abusive dad handbook.\nHe must be banking on enough people feeling naughty and worthless, and in need of a good smacking, to get him over the line.\nThis is definitely the strategy of Luxton's mentor, who openly spoke of only needing a certain number of voters.\n-\nKey resigned at the end of 2016, it's halfway through 2023 now dear boy.\n-\nUh huh…he resigned as NZ PM for reasons never satisfactorily explained–“to spend more time with the missus and kids” was more or less the offical line.\nBut, John Phillip Key has never resigned as a representative of international Finance Capital–which he has been most of his adult life. He is regularly roped in for this or that conference or toffs gathering like other ex senior politicians, and he injects himself into current events, e.g the swingeing “Hermit Kingdom” meme.\nGone and not forgotten.\n-\nGee. I changed \"he\" to \"she\" and \"Key\" to \"Ardern\" and \"International Capital\" to whatever the nutters on the other side of politics claim and it looked just the same as the moans made about Ms Ardern after her sudden resignarion.\nBoth stories seem equally ridiculous.\n-\n-\nBut you can still feel his cold, dead hand on everything Luxton does. It's either convenient or naive to imagine Key is not consulted regularly. He did do an opinion piece/interview lambasting our ambition this weekend at the same time egg head restates the wet, whiney, inward-looking line.\n-\nHe may be long gone…but the hangover lingers…\nAnd luxon is trying to do a key redux…\nAnd it is kinda painful to watch…\nHe wants to take nz back to 2016…\n-\nProbably further back than 2016, back to when the little woman where breeding and feeding their men .\n-\n-\n-\n-\n-\nSo Waikato Uni gave Steven Joyce a million bucks for\nselling the wider university story” to key audiences.\nBecause he's a storyteller extraordinaire, I presume. They must've been impressed with the stories he told when he was a cabinet minister. Don't hold your breathe waiting for that \"wider university story\" to appear in the media. Media prefer narrow stories.\nStill, if an enterprising journo finds someone who did actually buy his story, they could report how enthralling it was, eh? Then a uni prof economist would have the basis for a social science research project: surveying all such people, to measure the cost-effectiveness of the big spend. Universities are accountable to nobody, of course, but at least folks would see how many were thrilled by Joyce's tale-spinning.\n-\nStephen Joyce does appear to be a bit of an old school con-man. The infamous “Stevie’s Hole” in 2017 appeared to cost NZ Labour several vital percent in the General Election.\nSome Economists agreed with Joyces claim of a missing 11$bill, and more did not, but he got the media channel headlines and the perception was created.\nTEU–Te Whanga a-Nui-a-Tara members at the university are falling behind as this type of largesse is ladled out to Mr Joyce’s consulting company.\n-\nSeems like it’s these consultants ruining education…\n-\nWaikato must be mad or stupid. Joyce is a dinosaur-remember his RONS?\n-\nLikely the old boys n girls club at play with Stevie cultivating the sector leveraging his time when he was the minister.\nWhat a basket case that institution is.\n-\n-\n-\nThe National party are not serious people.\n-\nTl;dr – Russian's history is agin them so grassroots protest is unlikely, a coup is likely, and then it'll be back to business as usual with the West.\nMeanwhile, Russia's neighbours will remain between the rock and the hard place they've been in post-USSR collapse. But now they'll know just how dangerous their terror-state neighbour is.\n·\nThere will be no \"popular uprising\" in russia Hundreds of thousands of ru have perished, their economy continues to degrade, and there are hints of succession planning (e.g. statements by Nadezhdin and Zatulin). 1/\nhttps://twitter.com/MuKappa/status/1667916593714667523\nhttps://threadreaderapp.com/thread/1667916593714667523.html\n-\nThe sixth Labour Government's track record on poverty reduction gets expert analysis here: https://thespinoff.co.nz/politics/12-06-2023/the-two-poverties\nMax Rashbrooke points to one negative stat: \"the social housing waitlist has spiralled upwards from 8,000 in March 2018 to 24,000 today.\" Labour apologists would probably claim that the escalation isn't entirely due to Grant's budgets during those years.\nThey will likely seek refuge by blaming global inflation. They won't be honest enough to blame neoliberalism or Labour's adherence to that failed ideology.\nLabour does deserve credit for the upward trend in recent years in that MSD graph for 1947-2023 (ratio of benefits to average take-home pay). Fascinating to see how Muldoon maintained Kirk's socialism in his first term, then did a sharp reversal in 1979 – probably due to the winds of change blowing a whiff of Thatcherism at him.\n-\nHey Dennis, good to see you back round these parts.\nIn respect to yr comment about Labour's adherence to the failed ideology of Neo-Liberalism, I wanted to ask you (or any other eader) for a title of the sort of system that has: strong government capacity for building infrastructure, a desire for local manufacture of clothing, textiles, pharmaceuticals etc.\nA system that is a little more inwards looking, that can build national resilience and not be reliant on foreign shipping companies dropping stuff off to us while it is profitable for them to do so. A political system that wouldn't close Marsden Point and wouldn't allow Glenbrook to start atrophying so it becomes unviable.\nSorry, a lot in that outburst and I understand if ya don't want to acknowledge it.\n-\nYour phrase national resilience is a useful pointer, eh? I don't have anything better to offer as framing, tbh. Seems the world is trending towards interdependence – but that term is too abstract to serve as a meme/label. It can serve as ideology.\nMy Green trajectory points toward bioregionalism rather than nationalism, but nations will persevere as umbrella structures due to inertia. Comparative advantage will persist in guiding states as they shift in their economic policies. The case for retaining the elements of Muldoon's think-big strategy depends on pragmatic tweaking or clever economic design plus transformation.\nI agree that \"a little more inwards looking\" is a sensible shift but having been globalist in outlook since adolescence I see activist foreign policy as essential (on a non-aligned basis). Could be Hipkins intends to frame our role similarly on his visit to China. He has done way better as PM than I expected, so good luck to him!\n-\nI am part way through Danyl McLaughlin's piece in the Listener (no link sorry, someone scanned it and sent it to me). \"lost opportunities and gradual failure driven not by ideology but a lack of it\". Sums up Hipkins and co nicely.\nI am over 'the market deciding' in respect to our education, health, housing, infrastructure etc. It's all a race to the bottom and we folk love a bargain.\nIt ain't serving us well.\n-\n\"lost opportunities and gradual failure driven not by ideology but a lack of it\". Sums up Hipkins and co nicely.\nThat is very perceptive gsays.\nI too think we have lost our ideology and the only ideology is to get back to govern after the election. The number of policies that have been thrown either on the scrap heap or the recycling pile is sad.\n-\n-\n-\n-\nCovid was a major distraction…Labour gave vast quantities of money to businesses to stay afloat (many took it when it wasn't needed) that could/would have been used to build social housing instead.\n-\n-\nThe regressive, condescending, gammon boot certainly fits.\n-\nShe should go and have babies\n-\nSteven Joyce, what a bloody Hypocrite\n( NZ Herald today )\nHas there is ever a politician in this country to be bigger arsole I have yet to see.\nA greedy, money hungry bastard, he is.\n-\nJust want to re-up the mods here at TS. You do excellent work.\nLook at what passes for \"commentary\" at TDB. I got dungeoned (and have since been let back) for pointing out the vitriol in the posts and comments (and I admit engaging in it a bit of it myself) but the ones like below are perfectly fine, as long as they stroke Martyn:\nFuck those stupid cunts at the standard beginning with Weka are making fucking it all up stupid greed and envy narratives. Martyn is correct these wealth taxes should be aimed at the productive capacity it should be directed at speculation and asset stripping. But all good. I think if Marama for one can hold back on the all cus men are evil narrative and sit down with some….\netc. etc.\nHere I learn stuff, esp with the good articulate comments from those I agree and disagree with.\n-\nI, for one, am happy to be a \"s.c.\" at the Standard.\n-\nBut all good. I think if Marama for one can hold back on the all cus men are evil narrative and sit down with some….\nI think this is a rather nice Freudian slip 'cus men'. I don't like cuss men actually and would welcome someone holding back all the porn and bad language…..ah me! What a pity that he didn't mean that.\nTouching that he feels Marama would be capable of throwing away the trans narrative for one second and focusing on housing or family violence.\n-\n-\nTotally – it feels like yelling into the wind when commenting; but the worst thing about that kind of bluster for me is that it's alienating. It pits left against left making us look squabbly and ridiculous, when we have a much more formidable group of minds to get through to, if we were to amicably disagree but advance the common argument.\n-\n-\n-\nneeds better trolls.\nAlso looks like a wee bit of concerted sock puppeting going on.\nhttps://twitter.com/Publicwrongs/status/1667988948864598\n-\nAgain concentrating on the messengers and not the message.\nIf this is not what is meant in the policy then someone should say something. NOW.\nI am not au fait with the figures but the idea was that retired people past their capacity to bring in a huge bucks by working and maybe living on National Super*, were going to be expected to pay huge figures just to remain in their own homes.\nSo we have this egalitarian madness of affecting everyone rather than on concentrating on fixing what we have now and then looking at what extra we need to do.\n*Standard NZ Super Rates (for tax code M)\nfrom https://sorted.org.nz/guides/retirement/this-years-nz-super-rates\nQualifying as\nWeekly rate Annual rate\nSingle: living alone\n$496 $25,811\nSingle: sharing\n$458 $23,825\nMarried, civil union or de facto couple: one partner qualifies (and the other is not included)\n$382 $19,855\nMarried, civil union or de facto couple: both partners qualify\n$764 pw $39,709\nMarried, civil union or de facto couple: one partner qualifies and the other is included\n$726 $37,744\n-\nAgain concentrating on the messengers and not the message.\nNo, it's exactly focused on the message. The maths is obviously wrong.\n-\n-\nTheir maths is incorrect.\nBut the scenario that was brought up by George yesterday (.https://thestandard.org.nz/this-is-what-ending-poverty-looks-like-in-new-zealand/#comment-1953928), brings to mind another common situation where one partner dies years before the other in retirement.\n\"The Green Party will introduce a 2.5% Wealth Tax on net assets – things like properties or shares. Couples who jointly own assets will only pay the Wealth Tax on assets above the $4 million threshold (minus mortgages and other debt). For an individual, the tax will only apply to assets above $2 million.\"\nThe $4 million threshold appears to be reduced to $2 million on that death.\nNot only do they have reduced income, but any perceived value over $2 million will be taxed.\nGiven that property value increases have been inflationary and not related to material improvements, it means that there will be some who will not be able to afford the Wealth Tax on their homes they have paid for, and pay rates on. They may have lived in those properties for their whole married lives, and through no fault of their own, will now be compelled to move.\nThis failure to exclude the family home is poor policy. It also assumes that no personal sacrifices have been made to get to that position, and that the young couple living in a similar house with a big mortgage paying interest to a bank, is considered to be more justified to live in their house with no further costs – than a pensioner who has completed their mortgage.\n\"Almost all family homes in Aotearoa come under the threshold for the Green Party’s proposed Wealth Tax, whether individually or jointly owned. The Wealth Tax will be paid by 0.7% of New Zealanders – the wealthiest few property owners in the country, who can afford to contribute more. The Wealth Tax will be designed to ensure it is workable for people who own more than $2 million in assets but have only a modest income. These people, who are often retired, will be able to defer payment of the net wealth tax until their asset is sold. This is similar to the approach many councils already allow with rates payments.\"\nAlmost ALL family homes. I want to know how this figure was ascertained, and why people are required to borrow or defer to pay for a home they have likely paid extra over the years to acquire. Also would like to note that rates already tax people on their property values.\n\"The net wealth tax would cover most forms of wealth and assets, like property, shares, and bonds. These assets have known values because they are traded often. High value property such as artworks will also be included and can be valued on the basis of what they are insured for. \"\nProperty values are volatile at present. So, the value is not really known or stable. No mention made of bank deposits or term investments.\n\"Everyday household goods like furniture, appliances, electronics, and vehicles with values less than $50,000 will be excluded for simpler application of the Wealth Tax.\"\nJewellery, precious metals, lego collectibles and a vast amount of other speculative investments appear not to be captured under this policy. Is there a concern that perhaps this encourages people to avoid solid investments in their own homes and businesses, and go into volatile speculation?\n\"Māori land under the Te Ture Whenua Māori Act would be exempt and so would the assets of Post-Settlement Governance Entities, such as land returned under a Treaty Settlement or vested in a Treaty Settlement Entity.\"\nWell, apparently a policy can't be made without including a divisive criteria.\nThe scenarios in this policy document while feasible, are contrived and not reflective of those who will be affected by this policy.\nA speculative tax policy would perhaps be better. If we include KiwiSaver portfolios – many working people will be close to passing the threshold by retirement with that and a family home.\nThis policy does seem to be punitive against those who are savers and not spenders, by assuming the ability to save has come from gross excess.\n-\n-\n-\n@arkies link doesn't specify that the wealth tax is due EVERY year.\nActually, even the Green's full policy document doesn't ensure that is clear.\nBy the time retirement comes for many – this threshold may have been well breached. Especially if you are speaking of a working couple that have been putting money into KiwiSaver since it began. There is no indication that the policy will increase thresholds in line with inflation.\nIn order to pay a wealth tax of ‘only’ $25,000 (one of the examples given) – they may have to keep working to earn the approx $29K a year to pay that tax back. If values increase (while property materially depreciates) those earnings have to increase, and come with a secondary cost that it diverts money away from repairs and improvements, that are often beneficial to the elderly.\nIf house prices plummet – once again – there is no return of taxes, or change in material buildings.\nActually, the more I look at this tax policy – the more I think it is ill-conceived.\n-\n-\nI think the underlying assumption is that those with \"wealth\" have accumulated it under a form of inheritance, passive income or exploitative practices. There is also an assumption that those with \"wealth\" have lived lives of excess or of discretionary purchase or service options.\nThat assumption is incorrect.\nWouldn't it make more sense to address those loopholes in tax policy?\nEnsuring speculative property development was always taxed?\nEnsuring exploitative businesses and labour practices were readily identified and stopped? etc\n\"If someone has a free hold house worth say $2.5m, and they can't afford to pay the $12,500/year in wealth tax, why would they not just defer payment until the house is later sold?\"\nIf someone lives in a similar home that is rented, they will be materially living in a similar home to those that own their own home, but not compelled to move, or take on a form of debt in order to remain.\nWhat assumptions must be made about the individuals in either scenario to justify that compelled donation to the government?\n-\nThere is one nation in the OECD without a CGT, wealth tax or estate tax/gift duty.\nNot surprisingly the nation has a problem with property values too high to incomes and with too much focus on growing wealth by owning property, rather than the productive economy.\nAnd from this comes a problem with poverty and dealing with costs such as rising rent cost, or high mortgage cost and or debt level on property purchase.\nYet then the claim of an onerous burden, to the point of hardship, if those who have over $2M of net wealth (individually) are subject to a wealth tax when compared to those who rent (they pay tax on the income they earn to afford to rent).\nSeriously?\nThere will be no hardship because they can defer the charge until the property is sold. It's no more hardship than a property falling in value with a market correction. It's just a decline in their paper wealth.\nFor mine objection is class based, those with wealth seeking to secure it in its entirety to pass onto the next generation.\n-\n-\n-\nPeople in relatively modest houses in close-in suburbs to major cities can have property worth close to that. Some of properties in traditionally wealthy Wgtn suburbs like Kelburn, Oriental Bay Khandallah are having other less favoured suburbs now close on their heels.\nSome people like me and two of my female friends are singles (through widowhood/divorce) so not even another person around to raid their Super.\nThe family home needs to be exempted.\nAll other valuables need to be included, property, shares, collections, jewellery, gold……\n-\nMeh in nations with CGT there was the exemption of the family home, then there came the MacMansion to gather up CG wealth without tax liability. Then either CGT was reformed to include the family home when it was way above the median value, or they brought in a wealth or estate tax.\n-\nYou would be surprised at how many single people now own houses now worth say $1.5 -1.8m…these may get to $2m by the time we are much older. Some have other assets that would be caught.\nThe three women I mentioned earlier have no mortgages. I have been in my home since 1974 and one of the others was a new build in 1970. None of these have been built, occupied or had mortgages paid off other than with the earnings of the hard working owner/s let alone by underhand or exploitive means.\nIf you are not au fait with the figures then why are you responding to the policy as if you are?\nWhen the wealth tax was mooted some time ago (2-3 years?) I did a fair bit of work running various scenarios through, & saw that it was a crock that unfairly imapcted at a low level on people who were asset rich and cash poor. When I saw the figures that had been done recently, and Ok you say they may be lacking it did seem that very little had changed or beeen refined.\nI am not sure why the level is set so low.\nI am not sure why the first port of call wasn't to find ways to rein in those (911?) who are paying less tax than someone earning $25,000.\nThe tax brackets are woeful, with bracket creep and we don't tax or catch the really wealthy. I feel that death duties or a stamp duty/transaction tax on sales would be fairer rather than coming down hard on people who have worked hard, have not been able to structure their own tax affairs along the way to minimise tax (ie by being wage & salary earners) and who will probably worry themselves sick at not being able to pay the tax and not being able to leave to children/grandchildren/charity.\nThen there has been nothing said about the effect on the charitable sector. Many people who do not have children make huge donations to charities on their death. In Wellington we have the example of Margaret Doucas who left millions to animal welfare groups including the SPCA.\nWe have Lloyd Morrison the founder of Infratil who has funded several ambulances/medics for Wellington Free Ambulance.\nRather than taxing people who are cash poor, going through life, why is this not left until after death and a one step wash up similar to death duties. It sounds as though if it was charged yearly and presumably interest charged as well, that a person who dies 20 years later will not have very much left. I have based this on the fact that the amounts charged each year will more than likely increase yearly by the rate of inflation or the real estate inflation.\nI don't like it, the starting rates are too low, the family home should be exempted. Why is the policy not aimed at the truly wealthy, landlords or those 911 people on megabucks paying PAYE at a lesser rate than a wage earner on $25,000?\nIf the wealth tax has as an aim to break up the big estates, as in the 1890s then this is not the way. If this is to extract $$$ during the life of an asset it may have some benefits for the Govt but can penalise owners. It is a grab by the Govt of private wealth, without exploring if there are better ways first. It does not logically follow to me that this form of tax is needed to pay for UBI.\nI guess if the idea captivates we may find better options from the other parties.\n-\n-\nno-one is going to take their millions from them. They're just not.\nOk are you saying that people who are intending to leave all their assets to charity such as the Doucas' and Lloyd Morrisons of this world will not have to pay this wealth tax.\nBecause if you are then I think that it a very good idea. These two people in Wellington have had a huge effect.\nThe more ambulances that others supply the less that has to be raised to keep Wellington Ambulances free to users. The way we treat animals tells us much about our humanity.\nI see that it would be wonderful if on death an estate going to charity would have this wealth tax abated in some way. perhaps say 50% to charity means 50% abated off the tax. Because when you think about it an asset of $2m going to charity is much better than say $150,000. If the charity is chosen well more of the actual money will get to the end users. A point that Ian Taylor was making.\n-\nGiven the amount is at the 0.7% of the population level and might rise to over 1% later, is it too low?\nCouples won't be paying till $4m. The impost is greater on those singles owning.\nA consideration as to determining impact would be whether the amount is adjusted to the market/indexed or not.\nAt the extreme property might rise to $3M over time. Initially there would be no wealth tax. Then a little and finally peaking at $1m at 2.5% – $25,000 pa.\nMy conclusion is that the estate would be worth well over $2m on the house sale after making all the charges made\n5 years zero, c10 years $10,000, c5 years $25,000 – little over $200,000. Interest costs within $100,000. Way less than the CG during the period.\nSo to your claim of\nIt sounds as though if it was charged yearly and presumably interest charged as well, that a person who dies 20 years later will not have very much left.\nTotal nonsense.\n-\nYeah right…..probably was an exageration but what is not an exageration though is that the impact is greater on singles than a couple, as you have said.\n-\n-\nIn a fundamental sense, instead of policies that provide ways to improve the options and wellbeing of those that are struggling, it is a policy that believes redistribution – using nominal thresholds – of personal assets is a solution.\nThis policy makes a lot of assumptions, and it's only after reading it and having questions about the blanket assertions of it – that I can actually say – I see how such policies get the accusation of \"envy politics\".\nThe consistent failures of successive governments to address the regulatory and policy drivers of poverty, housing, and the cost of living rises is ignored.\nThis policy instead assumes those that made it through with assets – are the ones that should pay. I have numerous examples within my acquaintance that do not fit those assumptions. Relatives with access to free housing, on benefits for years, often have more discretionary spending than working households. This is not to say that this is the situation for all beneficiaries, but the point is, poverty needs to be measured in material and well-being, and balance of income vs outgoing terms as well as in nominal terms.\nIt also pre-disposes governments to benefit from allowing housing inflation to continue, as there will be a financial cost to any significant housing deflation – as it will be predicated on property values in many cases. As I am someone who sincerely believes bringing house prices down will significantly improve the balance between income and outgoings – thereby addressing poverty in one way – this is a real concern. If house prices do fall – then the wealth tax received for paper profits – becomes even more unjustifiable.\nSome of those who work and own properties do so with costs to their material and mental well-being.\nI mentioned this possibility in a Standard post a few weeks ago:\nAlso, the press release is low on details on calculations, and it does strike me that the demonisation of landlords, is perhaps making it's way to the critique of anyone who owns property. I guess we'll see.\n.https://thestandard.org.nz/why-a-capital-gains-tax-is-necessary/#comment-1947494\nWell, I can see it.\nI guess others see a resource for covering failed government policies.\n-\nThe average value of a house is under $1M. This threshold is $2m single and $4m couple. If impacts on circa 1% of homeowners – as per 0.7 total (c65% who own their home).\nThe complicating factor is trusts (is there some sort of threshold?).\nThe consistent failures of successive governments to address the regulatory and policy drivers of poverty, housing, and the cost of living rises is ignored.\nWe had little cost of living inflation for two or three decades (apart from power and housing). And a fairer incomes and taxation regime is part of reducing poverty.\nIt also pre-disposes governments to benefit from allowing housing inflation to continue, as there will be a financial cost to any significant housing deflation – as it will be predicated on property values in many cases. As I am someone who sincerely believes bringing house prices down will significantly improve the balance between income and outgoings – thereby addressing poverty in one way – this is a real concern.\nIf the government wants to increase levels of home ownership (which Labour Greens and TPM do) – which prevents hardship and impost on government when people retire from work, they have motive to hold down property values.\nIf house prices do fall – then the wealth tax received for paper profits – becomes even more unjustifiable.\nIt is seen as justifiable elsewhere in the OECD, and property markets rarely fall in nominal value over time, but sometimes in real value (for several years or so) – and then only because they have become overvalued.\n-\n-\n-\n-\n-\nEdit: …Given that property value increases have been inflationary and not necessarily related to material improvements\n-\nNonsense.\nThe tax is only on property worth over $2M (individual).\nAnd it is not hard to charge unpaid rates and wealth tax against the home and collect the money when it is sold.\n-\nI can't be the only one brought up with the value of not going into debt if it can be at all avoided.\nI was also brought up on the aspects of Aesop's fable of the grasshopper and the ants. While I have acquaintances that have benefited from unrealised capital gains on housing, I also know of others that have accumulated what you consider excessive wealth through excessive long hours of work and sacrifice.\nPutting in 60 hour weeks into their businesses, and giving up time with their children in order to provide for them in later life.\nThe threshold takes no account of this difference, nor of the responsibilities of individuals or couples for others.\nIt also assumes that no provision for the others has been made by anyone at all during their lives. It is only the government that can provide – and it will do so by taking monies from those who own private assets over what they consider moral. (But most likely relates to their calculations to what they needed to get the funds for their policy).\n-\nHow many avoid debt when buying a property? How many increase the mortgage to fund a renovation/improvement?\nThe idea that those owning property worth over $4m couples or $2m single face a burden with a debt charge against the property, when that is less than the untaxed CG growth of the property, is absurd.\nI have no opinion about what amount of wealth is excessive, I do however acknowledge we are currently unique in the OECD in having no CGT, wealth tax or estate tax/gift duty.\nand it will do so by taking monies from those who own private assets over what they consider moral.\nTotal nonsense, it's taxation. It appears that those who have – the top 1% are the ones who whine the most.\n-\n-\n-\n-\n-\n-\nI wanted to make this clear so you can form a picture in your mind of the couple sitting on a freehold properties worth $5,000,000 being asked to pay $25,000 in tax to support a safety net for the lest well off. This is not dangerous or radical. It's actually good and sensible.\nGood, quick simple explainer thread here: https://twitter.com/Tim_Batt/status/1668035800263708672\n-\n\"I wanted to make this clear so you can form a picture in your mind of the couple sitting on a freehold properties worth $5,000,000 being asked to pay $25,000 in tax to support a safety net for the lest well off.\"\nAn alternative way of making this clear, is to call it an annual compelled donation to the government.\n-\n-\nIf you think that makes it clear…\n-\n-\n(PS. How did you get your emoticon to wink on the other side? In awe of your skill)\n-\n-\n-\n-\nWhat is any tax if not a compelled payment? How else do we fix accelerating inequality and insufficient funding of public services? Sounding awfully taxation-is-theft libertarian here.\nedit: snap weka\n-\nMight be sounding that way. But don't people who will be affected ALREADY pay tax on their income, and rates on their property values? I haven’t suggested excluding those forms of taxation.\nBecause this tax is in ADDITION to income tax, it must be considered in terms of it's impact on the motivation to save and be frugal, and not just assume such wealth comes from a form of exploitation and indicates a material wealth and excess discretionary spending – rather than a paper one.\n-\n-\n\"The policy position doesn't assume that wealth comes only from exploitation. It assumes wealth comes from a range of factors, including excessive capital gains on housing\"\nDoesn't equate to material improvement.\n-\nWhy does that matter?\nThe last 30+ years of increases in housing valuations doesn't equate to material improvement either. Those who own these houses that have rapidly increased in price didn't do anything material to generate that extra value, they just happened to buy at the bottom of the market.\nedit: snap again weka\n-\nHas anyone addressed the issue of the calculation of nett wealth for the Greens proposed tax?\n- Will there be an IRD form to complete annually.\n- How will property valuations take place.\n- Will that be contestable – I can just see people wanting their nett worth below the thresholds for the wealth tax.\nPardon me if this has been explained elsewhere.\n-\nSurely it won't only be property – the art collection, or vintage cars, or wine cellar can easily run into hundreds of thousands.\nHowever, those are likely to be 'pre-valued' for insurance purposes. Property is often under insured (as we've seen during the recent climate and natural disasters) – and the Council valuations are basically just a guess based on the location, size of section and number of bedrooms.\n-\nThe policy position doesn't assume that wealth comes only from exploitation. It assumes wealth comes from a range of factors, including excessive capital gains on housing, and the kind of large wealth that can be built up from privilege that relies on collective resources but doesn't pay its way.\nI can't help thinking that if this the crux of the issue and its raison d'etre it is more about the politics of envy than anything else.\nPhrasing such as the para above is not going to 'win friends and influence people' who may have felt that a tax like death duties or something similar when they are gone was Ok as a way to leave something behind to do good for the wider populace.\nI think any wider dissemination or discussion needs to build on the basis of doing good rather than seemingly punishing people for being alive when economic conditions over which they had no control, were such that did not prevent excessive (my bold) capital gains. Let alone the 'privilege' I guess from having a family that has different priorities.\nThis sounds a mean spirited & punishing reason for introducing a wealth tax. Especially one which may catch the family home.\n.\n-\nMy childhood home was in a state housing area. My parents bought it when it became available.\nI remember my mother mentioning in her late fifties that they had finally paid off the mortgage.\nDirectly across the street were state houses that remained in Housing NZ. One of the families lived there for over two decades. We lived in similar houses in terms of size and quality, went to the same schools and played together.\nThis house is now worth about two million. AFAIK the walls will still be uninsulated. My mother is now widowed. If she was still living there after the death of my father, she will be expected to find money or accumulate debt to pay the wealth tax.\nThe family living on the other side of the road, in much the same house – will not be subject to that requirement.\nSo, as you say, the widowed person can choose to sell, reduce assets and move from a neighbourhood where they are known and have support systems in place. Or they can \"choose\" to accumulate debt, in the sanitised form of deferred payments, which is something that many older people have lived their lives avoiding.\n@arkie mentioned:\n\"The last 30+ years of increases in housing valuations doesn't equate to material improvement either. Those who own these houses that have rapidly increased in price didn't do anything material to generate that extra value, they just happened to buy at the bottom of the market.\"\nLong term home owners do not benefit from paper profits. It doesn't insulate houses, fix roofs, pay for maintenance or rates.\nAddress the failure of not taxing speculative housing transactions appropriately, rather than assume all property owners are materially better off when property values rise. Those who own single properties are often not as both insurance costs and rates rise.\n-\n-\n-\n-\n\"annual compelled donation to the government.\"\ni.e. to society, or the community. Sounds good.\n-\n-\n-\n-\n-\nThere is going to be very well organised and funded opposition to any attempt to redistribute wealth (even slightly). This astroturfing is just the earliest beginning, I suspect.\n-\nThe Bannon model; never mind the merits or otherwise, just confuse and distort.\n“The Democrats don’t matter,” he had said to me over our lunch. “The real opposition is the media. And the way to deal with them is to flood the zone with shit.”\n-\n-\n-\nPlease let us know where the party is so the Hawkes Bay and the Coromandel can attend!\nAt least 20 years of telling the rest of us to ggf and now they want us to pick up their tab too.\n-\nThe latest insanity from Gender Ideology.\nI am a woman – not a \"non man\".\nSorry admin – I don’t know how to resize the image.-\nThe world has gone quite potty.\n-\nIt's a private research university with an endowment of $9Billion. Surely they can say what they want?\nhttps://en.wikipedia.org/wiki/Johns_Hopkins_University\n-\nThis is going to get real.\n1. The word gay has been taken from woman – some identified as gay women. It is now only, gay men.\n2. The word lesbian is not associated with women, even though word gay is with men.\n3. Gay (men) do not include the non binary, but lesbian does.\n4. The inclusion of non binary, apart from women in the lesbian group – indicates inclusion of those born male who identify as non binary if they prefer female partners. Why? Because anyone born female who identifies as non binary and prefers female partners is a lesbian already.\nI suppose the logic is if they accept people who have not transitioned as transgender women, why not the non binary born male as well.\nThey have made a compelling case for self ID as a development leading towards the primacy of the gay male in his identity and the subordination of the lesbian woman in hers.\nThus identified, in their own way, that their liberalism is one that will be subject to a counter-offensive because it is not a secure position to stand on.\nStandard Operating Procedure\nA non binary woman, born female, who prefers female partners is a lesbian woman.\nA non binary man, born male, who prefers female partners is only going to interest bi-sexual women, not lesbian ones. And not as a lesbian, but as a person they might find more interesting than cis gender heterosexual men. Thus seen as bi-sexual women friendly.\nA person born male and who transitions to the female form, and who prefers female partners – might interest bi-sexual women and even be a partner to a lesbian woman, as someone lesbian women friendly. But not qualify for a lesbian identity, or group except as someones guest/partner or honorary (a bit like how the transsexuals were accepted without question pre gender ID).\n-\nMore dodgy editing at RNZ\nhttps://twitter.com/CranmerWrites\nSurely some senior heads at RNZ need to role ASAP ?\n-\nI've got zero idea what the issue is. Hard to get upset by this unless you are an Israeli sympathiser.\n-\n'I've got zero idea …..'\nThat's been evident for some time.\n-\nAnd that comment is a Higher Standard? Yeah right.\n-\n-\n-\nHere's the article as published by Reuters so no, nothing at all dodgy about RNZ editing.\nCranmer, however….\n-\nReally?\nThe edits\n- removing the word militant (to describe armed Palestinian groups – left referred to as as gunmen of).\n- \"Hamas, the elected government of the blockaded Gaza Strip.\" It has been reverted to say, \"Hamas, which runs the blockaded Gaza Strip.\"\nThe only thing is that there is this thing called accuracy – the last Palestinian elections were in 2006 and Hamas won. They were later removed from government in the West Bank by forces loyal to PA President Abbas in 2007 (there have been no elections since). The West and Israel recognise Abbas only.\nAbbas was a fool and allowed Hamas to stand in elections for PA governance without signing up to the Oslo Accords.\n-\n-\n6 min guardian explains drivers of Australia's rental crisis and possible solutions\nWould love to see a similar back-of-the-envelope for NZ.\n- Comments are now closed",
  "word_count": 8276,
  "scraped_at": "2026-02-14T12:00:33.829464"
}