{
  "article_id": "963479389401",
  "url": "https://today.appstate.edu/2023/09/26/chancellors-scholars",
  "title": "10 first - year App State students named Chancellor Scholars for 2023 – 24",
  "date": "20230926T231500Z",
  "domain": "today.appstate.edu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "“This class of Chancellor’s Scholars personifies App State’s commitment to academic excellence, leadership and service. These students exemplify a commitment to academic and community engagement. I look forward to the real and powerful differences they will make within their chosen disciplines.”\nApp State Chancellor Sheri Everts\nBOONE, N.C. — Ten first-year students were selected as this year's recipients of Appalachian State University's Chancellor’s Scholarship — the university’s oldest and most academically competitive merit-based scholarship, designed for students with ambitious academic goals. The 2023–24 academic year marks the 39th anniversary of the Chancellor’s Scholars Program.\n“This class of Chancellor’s Scholars personifies App State’s commitment to academic excellence, leadership and service. These students exemplify a commitment to academic and community engagement. I look forward to the real and powerful differences they will make within their chosen disciplines.”\nApp State Chancellor Sheri Everts\n“This class of Chancellor’s Scholars personifies App State’s commitment to academic excellence, leadership and service,” said App State Chancellor Sheri Everts. “These students exemplify a commitment to academic and community engagement. I look forward to the real and powerful differences they will make within their chosen disciplines.”\nThis year’s recipients:\n- Jake Aroll, of Concord.\n- Walker Lamme Floyd, of St. Marys, Georgia.\n- Charlotte Fuselier, of Baton Rouge, Louisiana.\n- Grace Guevarra, of Fayetteville.\n- Harley Locklear, of Laurinburg.\n- Zadyn Moore, of Concord.\n- Kaylie Morales, of Wilmington.\n- Kelsie Peck, of Fort Mill, South Carolina.\n- Brooklyn “Brook” Caroline Settle, of Hays.\n- Hope Spurlock, of Salisbury.\nChancellor’s Scholars have demonstrated exceptional academic performance, ambitious academic goals, leadership, service and creativity. During their time at App State, the scholars serve as leaders both within App State’s Honors College and across campus.\nDetails of the Chancellor’s Scholarship\nThe four-year program of study covers full institutional costs (tuition, fees, room and board, and book rental). Additionally, Chancellor’s Scholars are provided with numerous classroom and experiential research opportunities, as well as academic mentoring in a living-learning community and study abroad opportunities.\nIn addition to coverage of full institutional costs, Chancellor’s Scholars receive:\n- Study abroad opportunities around the world — with 200 study abroad programs available.\n- Support for research, conference attendance and scholarship through App State’s Office of Student Research.\n- Access to research support and personalized, professional mentoring through the Honors College.\n- Opportunities to engage in service-learning courses and programs — both locally and throughout the world — through App State’s Office of Community-Engaged Leadership.\n- Chancellor’s Scholars participate in small, discussion-based, interdisciplinary courses and produce original research as part of their honors theses.\nAbout the 2023–24 scholars\nAroll chose to attend App State primarily because of its university community, stating, “Everyone I have interacted with at App State, so far, has made me feel so welcome and comfortable.”\nThe Chancellor’s Scholarship will allow Aroll to focus entirely on furthering his education, he shared, adding that the study abroad opportunities offered through the scholarship program will enable him to expand his worldview.\n“I look forward to being in new environments and studying among different cultures,” said Aroll.\nHe aspires to pursue a career in construction management and is majoring in building sciences with a concentration in construction management.\n“Since I was little — whether it was playing with Legos or making bird houses — I have always loved building things, and I feel that construction management is the perfect way to turn that passion into a career,” he shared.\nAroll is a graduate of West Cabarrus High School in Concord, where he was a member of the varsity wrestling team, Beta Club and the National Honor Society. He was also active in community service, volunteering at the hospital Atrium Health Cabarrus and his local church, and leading a peanut butter and jelly drive for his local food pantry.\nFloyd, who is pursuing a Bachelor of Arts in history at App State, said he was inspired to attend the university after visiting the Boone campus. “I was astounded by how beautiful the campus and surroundings were and how generous the faculty were with their time,” he shared.\nHe also credits the App State alumni he has met for influencing his decision to attend the university — “All of them have had nothing but fond recollections of their time there,” he said.\nWith the support of his Chancellor’s Scholarship, Floyd plans to study abroad in Chile to learn about Chilean history and society. He hopes to use this experience abroad, he said, to help bring awareness to overlooked or misunderstood cultures.\n“What we think about our past shapes our conception of reality, and who can change those thoughts can change the world,” he shared. “My passion is for bringing history to the public eye, and this scholarship will absolutely let me do that.”\nFloyd is focusing his studies on modern history, particularly that of Latin America, Israel and the Jewish nationalist movement of Zionism.\nA painter and graduate of Cartersville High School in Georgia, Floyd participated in many extracurricular activities, including organizing art auctions to raise money for his school’s art department and helping to create the school’s first visual arts scholarship. He also volunteered for the National Park Service’s Cumberland Island National Seashore and Advocates for Children, which serves children and families who have been the victims of abuse and neglect.\nFuselier is pursuing an App State bachelor’s degree in political science with a concentration in international and comparative politics.\nShe said she decided to come to App State because of its “welcoming atmosphere and incomparably friendly faculty,” and she chose her field of study to gain a better understanding of the internal workings of political structures and government bodies.\nFuselier, who aspires to attend law school after graduating from App State, said her Chancellor’s Scholarship will allow her to not only experience her undergraduate college career without the burden of student debt, but will also provide her with “countless resources to help me succeed once I graduate.”\nAs a student at St. Joseph’s Academy in Baton Rouge, Louisiana, Fuselier was the founder and co-president of the Women’s Empowerment Club and a member of the French Club, Film Club, National Honor Society, Art Club, Beta Club and Mu Alpha Theta — a national mathematics honor society for high school and two-year college students. She also served as a Student Ambassador and as a tutor for middle school students.\nGuevarra is majoring in studio art at App State and shared that, from a young age, she always knew she wanted to be an artist.\n“There are some things people can’t live without doing every day — whether it be writing, running, playing guitar or, in my case, making art,” she said.\nHer Chancellor’s Scholarship will afford her a well-rounded academic experience, Guevarra said, and expose her to new cultures through the study abroad opportunities it provides.\n“I hope my study abroad experience will inspire my research and art, as well as help me build fundamental skills for my future career,” she said.\nDuring her first trip to App State’s Boone campus, Guevarra “immediately felt a sense of belonging,” she shared. “(App State) is a thriving community with faculty who are passionate about your learning experience — all amid the beauty of the mountains.”\nAt Seventy First High School, Guevarra was president of the Art Club, an ambassador of Seventy First’s School of the Arts and a member of Cumberland County’s Academy of Scholars. She also was a camp manager and volunteer for the All-American Fencing Academy in Fayetteville and volunteered at NCAA fencing competitions.\nWhen she first stepped foot on App State’s Boone campus, Locklear felt at home, she said, describing the campus as a “beautiful, warm and welcoming atmosphere.” She was also attracted to App State’s nationally recognized Walker College of Business, through which she is pursuing a major in marketing.\nThe Chancellor’s Scholarship has helped alleviate Locklear’s concerns around student debt, she said, and has given her “outstanding opportunities to grow beyond my preconceived boundaries.”\nThe numerous opportunities provided through the scholarship, such as studying abroad and being a part of the Honors College, will allow Locklear to “set myself up for a career and seek out goals that I once deemed impossible for myself to achieve,” she shared.\nThrough a future career in marketing, Locklear hopes to “make a difference in the way consumers are seen by companies, and vice versa, by breaking the walls of distrust and material gain that have been built over numerous generations,” she said.\nWhile a student at Scotland High School, Locklear was a member of the Beta Club, Anchor Club, Future Business Leaders of America (FBLA) and National Honor Society.\nThe environmentally conscious nature of App State attracted Moore to the university, he said. “I love everything about wildlife, especially in the mountains, so attending a university that is dedicated to protecting that was a major factor in choosing my college.”\nMoore is majoring in biology with a concentration in cellular/molecular biology at App State. He is excited to explore multiple topics of research alongside App State faculty, he said, including aging studies with drosophila (fruit flies) and innovations with lab-grown meat.\nHe plans to supplement his passions for biology, wildlife and sustainability with study abroad experiences supported by his Chancellor’s Scholarship, which will allow him to learn from different cultures and engage with a larger diversity of organisms and people, Moore said.\nMoore graduated from Cox Mill High School, where he served as a peer tutor and was a member of the National Honor Society, Science National Honor Society and Beta Club. Moore also played baritone saxophone in the school’s wind ensemble and was a member of the varsity wrestling, football and track and field teams.\nA first-generation college student, Morales shared that, growing up, she never thought she would be able to attend college. App State’s Chancellor’s Scholarship has made her dream of higher education possible, she said — “as well as my mom’s dream for me to achieve a higher education.”\nMorales, who aspires to become a journalist, said she was attracted to the university for its digital journalism degree program.\nTwo strong women influenced her to pursue journalism, Morales said — her mom and news broadcaster Robin Roberts of Good Morning America.\nFrom a young age, Morales has looked up to Roberts, she shared, and after learning more about Roberts and her battle with triple-negative breast cancer, Morales said she gained an even deeper admiration for Roberts, particularly the strength she showed during a difficult time.\nMorales’ mother — a single parent — pushed her journalism dreams aside to focus on raising her young daughter, shared Morales.\n“I chose digital journalism as my field of study so I can make sure that the sacrifice that my mom made many years ago would not go to waste, and so that I can be a person as strong as Mrs. Robin Roberts,” she said.\nAs a student at John T. Hoggard High School, Morales was a member of the Drama Club, Writing Club, Yearbook Club, American Sign Language Club, Mental Health Matters Club and SAVE Promise Club. She was also involved in the school’s Gay Straight Alliance and National Honor Society chapter and was president of the Anime Club.\nPeck said she was drawn to the “sense of community and belonging” at App State, as well as the “endless research opportunities that App State provides.”\nA chemistry-certified chemist major at App State, she shared that she is passionate about the environment and hopes to become involved in climate research.\nShe plans to pursue graduate studies after graduating from App State and said her Chancellor’s Scholarship will serve as “a catalyst for my success at App State and my future education as it will provide me with the resources I need to flourish.”\nShe added, “Also, the international studies experience provided through the scholarship will allow me to learn about other cultures and gain a more global perspective on current issues.”\nA graduate of Nation Ford High School in Fort Mill, South Carolina, Peck served as a chemistry tutor for her peers and was a member of the National Honor Society, Mu Alpha Theta and Safe Zone, an LGBTQ+ club. Additionally, she was an officer in the Women’s Self-Defense Club and vice president of the school’s Science Olympiad team. She also volunteered at her local humane society through the Beta Club.\nSettle has had her eyes on App State since she was in elementary school, she said, adding that App State is “the perfect place to help me pursue my passion and further my education while making great memories along the way.”\nSettle grew up in Hays, in Wilkes County, and said that with each visit to App State’s Boones campus, she felt at home. She is majoring in elementary education at App State, with a concentration in social studies.\nAfter volunteering at various local elementary schools, Settle decided she wants to dedicate her life to educating and uplifting children, she shared.\n“It is my passion to ignite a love for learning within the hearts of my future students, so that they will develop critical thinking skills and learn life lessons that will transform them into exceptional leaders and unique individuals who are readily able to face the world,” said Settle.\nThanks to her Chancellor’s Scholarship, Settle will be able to focus on academics while still having the opportunity to participate in App State’s many student organizations and clubs, she shared.\nAt North Wilkes High School, Settle served as senior class president and was involved in numerous extracurricular organizations, including Beta Club, Key Club, Future Teachers of America and Yearbook Club. She also played on the school’s varsity tennis and basketball teams, as well as the track and field team, and was a member of First Light Church Youth Group, Fellowship of Christian Athletes and United Teens in Action.\n“Being a recipient of the Chancellor’s Scholarship will open the door for the personal and academic growth I seek, exposing me to different scenarios that I wouldn’t experience otherwise,” shared Spurlock, who has yet to declare their App State major.\nWhen exploring their higher education options, Spurlock sought “an environment that is friendly, supportive and would ultimately help me grow as a person,” they said, adding, “I chose App State because it chose me.”\nSpurlock said the App State students and staff who assisted her during the application process were a great influence on their decision to attend App State.\n“They showed me how dedicated and compassionate they could be, while still challenging me to think outside of the box,” said Spurlock.\nA graduate of North Rowan High School in Spencer, Spurlock was a member of the National Honor Society, Art Club, Drama Club, Equality Club and Philosophy Club. Spurlock also practiced karate.\nWhat do you think?\nShare your feedback on this story.\nAppalachian State University offers students the opportunity to receive a world-class education at an affordable rate, with an average of $25 million awarded to incoming, current and transfer students each year based on need, as well as academic and athletic achievement. On average, about $4.9 million in outside aid is awarded to App State students annually. App State’s Office of Student Financial Aid and University Scholarships assists students in learning about and applying for these university scholarship opportunities and also shares information about non-App State scholarships.\nThrough its nationally recognized undergraduate, graduate and online programs, App State prepares students to become globally minded, responsible members of society who engage with and actively contribute to their communities. Strengthen your academic focus, discover your passions and take the next step in your life’s journey.\nMore than 500 students are enrolled in Appalachian State University's Honors College, which serves a diverse group of high-achieving, high-potential, highly motivated students from all majors. The Honors College helps students develop independent and creative thinking and high-level research skills; promotes interdisciplinary inquiry; and nurtures cultured and caring exchanges of ideas. The college’s enhanced academic experience prepares students for success in graduate or professional school and for leadership roles in their lives, communities and careers.\nAbout the Chancellor’s Scholarship\nThe Chancellor’s Scholarship is Appalachian State University’s oldest and most academically competitive merit-based scholarship. It is awarded to the highest achieving students who have earned entry into App State’s Honors College. The scholarship is designed for students with ambitious academic goals — those who seek graduate or professional post-baccalaureate degrees to become physicians, Ph.D. holders and more. Chancellor’s Scholars enter a four-year program of rigorous study that covers full institutional costs (tuition, fees, room and board, book rental) and provides study abroad opportunities beginning in the first year, numerous classroom and experiential research opportunities and academic mentoring in a living–learning community. The scholarship is open to any major. Learn more.\nAbout Scholarships at App State\nAppalachian State University offers students the opportunity to receive a world-class education at an affordable rate, with an average of $25 million awarded to incoming, current and transfer students each year based on need, as well as academic and athletic achievement. On average, about $4.9 million in outside aid is awarded to App State students annually. App State’s Office of Student Financial Aid and University Scholarships assists students in learning about and applying for these university scholarship opportunities and also shares information about non-App State scholarships. Learn more at https://scholarships.appstate.edu.\nAbout the Honors College\nMore than 500 students are enrolled in Appalachian State University's Honors College, which serves a diverse group of high-achieving, high-potential, highly motivated students from all majors. The Honors College helps students develop independent and creative thinking and high-level research skills; promotes interdisciplinary inquiry; and nurtures cultured and caring exchanges of ideas. The college’s enhanced academic experience prepares students for success in graduate or professional school and for leadership roles in their lives, communities and careers. Learn more at https://honors.appstate.edu.\nAbout Appalachian State University\nAs a premier public institution, Appalachian State University prepares students to lead purposeful lives. App State is one of 17 campuses in the University of North Carolina System, with a national reputation for innovative teaching and opening access to a high-quality, cost-effective education. The university enrolls more than 21,000 students, has a low student-to-faculty ratio and offers more than 150 undergraduate and 80 graduate majors at its Boone and Hickory campuses and through App State Online. Learn more at https://www.appstate.edu.",
  "word_count": 3056,
  "scraped_at": "2026-02-14T13:09:20.121483"
}