{
  "article_id": "96633cec4b41",
  "url": "https://www.thenationalnews.com/news/mena/2024/08/09/photo-essay-ancient-secrets-unearthed-in-vast-turkish-cave-city/",
  "title": "Photo essay : Ancient secrets unearthed in vast Turkish cave city",
  "date": "20240810T073000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Through a basement door in south-eastern Turkey lies a sprawling underground city that historians believe dates back to the ninth century BC. Archaeologists stumbled on the subterranean city when an excavation of house cellars in Midyat, near the border with Syria, led to the discovery of a labyrinth of caves in 2020.\nMore than 50 rooms have been cleared, with each one connected by 120 metres of tunnel carved out of the rock. But that is only a fraction of the site, which spans an estimated 90 hectares, which would make it the largest underground city in the southern Anatolia region.\nMidyat conservation director Mervan Yavuz, who oversaw the excavation, said it may be the largest subterranean city in the world. \"To protect themselves from the climate, enemies, predators and diseases, people took refuge in these caves, which they turned into an actual city,\" he added.\nHe has traced the city's beginnings to the reign of King Ashurnasirpal II, who ruled the Neo-Assyrian Empire from 883 to 859 BC. Mr Yavuz always suspected the city, known as Matiate in ancient times, existed. \"In the 1970s, the ground collapsed and a construction machine fell down. But at the time we didn't try to find out more, we just strengthened and closed up the hole,\" he explained.\nConflicts and conquests may have given those living near Matiate a reason to take refuge underground. \"Before the arrival of the Arabs, these lands were fiercely disputed by the Assyrians, the Persians, the Romans and then the Byzantines,\" said Ekrem Akman, a historian at the University of Mardin.\nMr Yavuz said Christians and Jews may have used Matiate as a hiding place to practise their religions during Roman rule. \"Pagans, Jews, Christians, Muslims, all these believers contributed to the underground city of Matiate,\" he said.",
  "word_count": 300,
  "scraped_at": "2026-02-14T12:09:22.609521"
}