{
  "article_id": "9667cf3abea4",
  "url": "https://www.dailymail.co.uk/femail/article-13610999/Which-team-Premier-League-WAGs-England-face-against-premiership-teammates-Netherlands-squad-supportive-partners-used-cheering-side.html",
  "title": "England players face off against their premiership teammates in The Netherland squad , and their supportive partners are used to cheering for the same side",
  "date": "20240710T080000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England players face off against their premiership teammates in The Netherlands' squad, and their supportive partners are used to cheering for the same side\n- WAGs who previously cheered the same team will be supporting opposite sides\n- READ MORE: Meet Slovakia's very glamorous WAGs\n- Tune in to MailOnline's live blog for England vs Netherlands by clicking here\nWhen England face off against The Netherlands this evening - the Three Lions' wives and partners are sure to be in the stands supporting their loved ones.\nAnd the same goes for their rivals, who will have a host of glamorous WAGs, including models and business owners.\nBut as England tries to secure a place in the final and bring home the trophy as the Lionesses did in 2022, they will be up against members of their own Premier League teams.\nPartners of football stars that may have sat together for matches and cheered on the same team will now be donning opposing football shirts as their boyfriends, fiancés and husbands battle it out to the end.\nThe Dutch WAGs have already started meeting up in Germany, going for matcha drinks and catch-ups together whilst their partners are in training.\nHere, FEMAIL has put together a list of some WAGs that will be donning English red and white and others who will opt for the vibrant Dutch orange in the upcoming game.\nLiverpool\nEngland\nTrent Alexander-Arnold and Iris Law\nTrent is currently thought to be dating model and actress Iris Law, who met after shooting together for fashion brand Guess in April.\nThey are thought to have swapped phone numbers and have been getting to know each other since their intimate shoot, which saw Iris photographed wrapped around Jude.\nTrent and Iris now follow each other on social media, with MailOnline revealing that Trent has been liking Iris's social media snaps - and she's liked his back.\nThe smiley pair have since been snapped strolling around London, holding coffees and smoothies as they chatted.\nTrent and Iris now follow each other on social media and the pair are now liking each other's photos\nTrent is currently thought to be dating model and actress Iris Law, who met after shooting together for fashion brand Guess in April\nThe 23-year-old is the daughter of British heartthrob Jude Law and Sadie Frost\nThey visited Portobello Road and stepped into 281 Portobello, a trendy shopping arcade before getting into a people carrier.\nAn onlooker said: 'They looked very relaxed and happy and were just strolling around like two ordinary young people having a nice time. You'd never have thought that they are very rich and famous, and most people didn't even spot them.\n'They popped into a café to get their drinks and as it was a nice day, were just having an enjoyable walk.'\nThe 23-year-old is the daughter of British heartthrob Jude Law, best known for his role in the festive film, The Holiday, and Closer. Her mother is actress Sadie Frost, who starred in Dracula and Love, Honor and Obey.\nJoe Gomez and Tamara Tia Gomez\nJoe met Tamara Tia Gomez whilst the pair were still at school in south London and they have been together ever since.\nTamara, Joe's wife is pictured posing on the stands as she watches England play at the Euros\nTamara and Joe have recently celebrated their three-year anniversary of married life\nTamara has a degree in business management and studied in London whilst Trent went to Liverpool to play for the team at 18 years old\nThey first locked eyes on the 75 bus, as they both took it back home after finishing school. They then started chatting on Blackberry messenger and got to know each other better before going out.\nTamara has a degree in business management and studied in London whilst Trent went to Liverpool to play for the team at 18 years old.\nThe couple used to see each other every weekend, despite the fact they were hours away from each other and on opposite ends of the country.\nThe childhood sweethearts tied the knot in July 2021 at the prestigious Coworth Park, a five-star resort in Ascot.\nThe couple have recently celebrated their three-year anniversary of married life, with Tamara marking the celebration by sharing a selfie they took on the big day.\nShe is currently in Germany supporting her husband's team as they go head-to-head with the Netherlands in the semi-finals on Wednesday.\nThe Netherlands\nCody Gakpo and Noa van der Bij\nCody's girlfriend is Noa van der Bij and the pair have currently been dating since around December 2020.\nCody's girlfriend is Noa van der Bij and the pair have currently been dating since around December 2020\nNoa and Cody shared a sweet snap of them together as a family with young Samuël donning a mini Liverpool kit, with number 18 on the back\nShe has worked as a booker for Cachet Models ever since completing her studies in management at Avans University of Applied Sciences\nShe has worked as a booker for Cachet Models ever since completing her studies in management at Avans University of Applied Sciences.\nNoa has almost 45,000 followers on Instagram and often shares holiday snaps of her in exotic places such as Dubai, Monaco and Sardinia.\nThe couple welcomed their first child in April named Samuël Seth Gakpo, who often joins Noa in the stands, cheering on Liverpool.\nNoa and Cody shared a sweet snap of them together as a family with young Samuël donning a mini Liverpool kit, with number 18 on the back.\nBut whilst Noa may be used to sitting with the other WAGS to cheer on the Liverpool team, this week she will be cheering on the Netherlands as her partner goes head-to-head with his teammates.\nRyan Gravenberch and Cindy Peroti\nCindy does often shares snaps of her poolside with her footballer beau in hot countries such as Mykonos, Dubai and Ibiza\nRyan moved to the Liverpool team from Bayern Munich in September last year along with his long-term girlfriend Cindy Peroti\nShe has uploaded pictures of her donning the tangerine-coloured scarf in the stands as she cheers on England's competitor\nRyan moved to the Liverpool team from Bayern Munich in September last year along with his long-term girlfriend Cindy Peroti.\nIt is unknown what Cindy does for a living, but she often shares snaps of herself poolside with her footballer beau in hot countries such as Mykonos, Dubai and Ibiza.\nWhen Ryan announced the news that he would be joining Liverpool's squad, Cindy shared a snap of them posing with his new red shirt and wrote: 'A new beginning'.\nBut she has now changed her cherry red attire for vibrant orange, as she supports her boyfriend's team, the Netherlands, in the Euros this year.\nShe has uploaded pictures of her donning the tangerine-coloured scarf in the stands as she cheers on England's competitor.\nVirgil van Dijk and Rike Nooitgedagt\nVirgil has known his wife Rike almost all of his life as they grew up together in Breda, a city in the Netherlands.\nThe couple began dating when they were just teenagers and now live in Liverpool with their dog.\nVirgil has known his wife Rike almost all of his life as they grew up together in Breda, a city in the Netherlands\nRike Nooitgedagt is pictured sporting orange for the Netherlands at the World Cup in 2022\nShe worked as a fashion sales manager but quit her job in 2013 to follow her boyfriend's career when he was signed by Celtic F.C.\nShe told The Sun: 'I worked as a sales manager and sold different fashion brands to the stores in Holland.\n'I loved it but had to resign to follow my man everywhere football takes him to.'\nAccording to The Sportslike, they had their first daughter Nila in 2014 and welcomed their second daughter Jadi in 2016.\nBrentford\nEngland\nIvan Toney and Katie Bio\nIvan and Katie have had an up-and-down relationship, with the pair splitting temporarily in 2022 before getting back together again\nKatie is a businesswoman and a fashion dealer and owns her own company\nIvan and Katie have had an up-and-down relationship, with the pair splitting temporarily in 2022 before getting back together again.\nAlthough it is not known when they started dating, the couple share two children together and welcomed their first son Ivan Toney Jr. in 2019.\nKatie then gave birth to another boy, Ikari, in 2022 and the trio can be seen at football games, supporting Ivan.\nShe is also a businesswoman and a fashion dealer, owning her own company called Luminaire, which mainly operates in the UK and focuses mainly on home decoration.\nNetherlands\nMark Flekken and Dannee Flekken\nMark Flekken is currently married to beautician Dannee Flekken and they share two children together\nMark, a goalkeeper for Brentford and the Dutch national team, is currently married to Dannee Flekken.\nThe couple share two children together, Noé, four, and Leva, two, and live in west London after he moved to join Brentford last year.\nThe pair are thought to have tied the knot in 2018 and it is believed that Dannee is a beautician, according to German tabloid Bild.\nNot much is known about Dannee, who tends to stay out of the limelight.\nBayern Munich\nEngland\nHarry Kane and Kate Goodland\nKate grew up just three streets away from Harry in a semi-detached, four-bedroom home with her mum Kelly and dad Gary, who owns a steel and tool business.\nThey met aged four when they attended Larkswood Primary school in Chingford, East London.\nThe football fanatics went on to attend Chingford Foundation School, where David Beckham had been a pupil.\nWhen Beckham opened his football academy in Greenwich in 2005, a small number of pupils were given the chance to attend and both Harry and Kate, then 12, successfully put themselves forward.\nKate grew up just three streets away from Harry in a semi-detached, four-bedroom home\nThe couple would often go around each other's houses and both had a huge interest in sports, but Kate was more focused on academics.\nShe now works as a fitness instructor and has a degree in Sports Science - as well as almost 300,000 followers on Instagram, often posting sweet snaps of both football and family life.\nThe couple finally started dating when they were 16 and attended the school prom together.\nHarry told Esquire magazine in 2015: 'We went to school together, so she's seen my whole career.'\nThe England captain signed a professional contract with Tottenham at the age of 16. A few years later, he and Kate moved into their own home together.\nHarry popped the question in July 2017 during a romantic trip to Nassau in the Bahamas, before they jetted off abroad to a secret location to get married.\nThey welcomed their first child Ivy, six, in 2017 and their second, Vivienne, five, in 2018.\nTheir son Louis was born in 2021, and now, little Henry, who was born on August 20 last year, has overtaken as the youngest member of the Kane clan.\nThe England captain signed a professional contract with Tottenham at the age of 16 and a few years later, he and Kate moved into their own home together\nHarry and Kate's children Ivy, Louis and Vivienne are pictured wearing number 9 jerseys\nThe duo also share two Labradors: Brady and Wilson - both named after American football quarterbacks: Russell Wilson of the Denver Broncos, and Tom Brady, formerly of the New England Patriots, who is Harry's sporting hero.\nAs a sweet nod to his love for his wife and growing family, Harry is known to famously kiss his ring finger after every goal he scores.\nThe family moved into a £30million hilltop mansion in Germany after moving to Bayern Munich last year.\nBut whilst Kate and Annekee Molenaar, who is engaged to Matthijs de Ligt, may be used to cheering for the same team, on Wednesday they will be battling it out to make the final in the Euros and bring home the trophy.\nThe Netherlands\nMatthijs de Ligt and Annekee Molenaar\nMatthijs and Annekee started dating in 2018 and she often shares loved-up snaps with the Dutch footballer online.\nHe popped the question during a romantic getaway to Greece and the couple posted it to their accounts and wrote 'She said yes!'\nAnnekee works as a model and often shares images from her shoots on her Instagram account\nMatthijs and Annekee started dating in 2018 and she often shares loved-up snaps with the Dutch footballer online\nAnnekee has been a constant presence by his side for the past six years\nThe couple tied the knot a month ago and she told Vogue Germany: 'With the European Championship in Germany this summer, it seemed to be impossible to plan a big wedding.\n'But we wanted to finally make it official and become wife and husband! That’s why we first celebrated in a small circle.'\nAnnekee works as a model and often shares images from her shoots on her Instagram account, along with her sporting football t-shirts of her husband's team.\nShe has been a constant presence by his side for the past six years and supported him when he jetted to Germany to support his move to Bayern in 2022.\nManchester City\nEngland\nKyle Walker and Annie Kilner\nKyle and Annie started dating when they were just teenagers, with her telling The Sun that it was 'love at first sight'.\nThey wed in a secret ceremony in 2021 and had a close, intimate ceremony with friends and family.\nThey were together for nine years before splitting up when she found out that he had an affair with Lauryn Goodman.\nLauryn had a brief fling with Kyle in 2019 before they had a son the following year called Kairo.\nAnnie is a model and is signed to Mode Model Management and has previously modelled lingerie and has been featured in Zoo magazine\nHe was conceived while Walker was temporarily split from Annie, then his long-term girlfriend.\nBut in October 2022 he slept with Lauryn again and had a second child - a daughter - in the summer of 2023.\nAnnie reportedly threw him out of the family home around Christmas time.\nHowever, in January this year, it was revealed she was six months pregnant with their fourth child, Rezon.\nIn the same month, Annie announced that their marriage was over.\nShe said on social media at the time: 'I am posting this in response to growing recent media enquiries about my marriage to Kyle and in an effort to protect my family against the intensity of the media spotlight.\n'Sadly, after many years of marriage and three wonderful children together, I have decided to take some time away from Kyle.\n'I do not wish to comment on the position any further. For now, I ask that the privacy of myself and our three young children is respected during this difficult time.'\nAnnie is pictured with her son and the father of her child, Kyle walker during an England Euros match\nKyle revealed everything to Annie in 2020 and according to the outlet, she told her friend: 'He's a fool for risking his family for this. When he told me I was heartbroken. I also felt physically sick. All the air in your body leaves you.\n'I couldn't believe what I was hearing. Not only had he cheated on me but she was pregnant with his baby.'\nAnnie and Kyle share four children together and she flew over to Germany to support Kyle as she did not want to let Lauryn 'dictate her and her children's movements,' a source told MailOnline.\nThey added: 'She doesn't pay much attention to the noise around her and her husband's marriage and is working privately with Kyle to navigate the office pitch issues.\n'Being in the public eye is something they understand due to Kyle's role in football so she just gets on with it, always with her children at the forefront of her mind.'\nA spokesperson for Kyle and Annie said: 'Kyle is purely focused on bringing home the trophy for the millions of fans watching at home and in the stadium. He will not be distracted by any off pitch activity.'\nAnnie shares sons Rezon, two months, Roman, 11, Riaan, seven, and Reign, five, with Kyle, and the family all appeared at a match against Serbia last month.\nLast week, England Manager Gareth Southgate gave his players some down time today and allowed them to meet up with their partners and families following the nail biting 2-1 victory over Slovakia in Gelsenkirchen.\nBut while almost all of the WAGs attending the match have remained in Germany for the family day, Annie left soon after the final whistle with the four children she shares with Kyle to board a private jet back to the UK.\nA source told MailOnline: 'Annie and Kyle didn't have much to say to each other once the game was over and she left as soon as she could.\n'He's not very happy about it because whatever's gone on between them, he does love his kids a lot and was looking forward to spending some time with them.\n'She's been flying in for the games, mainly for the sake of the kids and has only missed one. But given the way things are between her and Kyle, she isn't ready to play happy families.'\nAnnie is a model and is signed to Mode Model Management and has previously modelled lingerie and has been featured in Zoo magazine.\nThe mother-of-four has also made appearances on The Real Housewives of Cheshire.\nJohn Stones and Olivia Naylor\nJohn and Olivia met on a night out during a night out in Manchester, after splitting from Millie Savage, with whom he shares a daughter.\nOlivia has been snapped supporting John at the World Cup in Qatar in 2022 and the couple welcomed a son together last year.\nJohn and Olivia met on a night out during a night out in Manchester when he split from his ex\nOlivia works as a beautician and the pair live in a mansion in Cheshire, purchased for £3.4m in 2016\nShe celebrated when Manchester City won the Premier League in May and will see John go up against his teammate Nathan Ake on Wednesday\nSpeaking of when they first met, a source told the Sun: 'They met during a night out after John was single. There was an instant rapport.\n'Olivia was pregnant at the time and they discovered they had mutual friends. They make a nice couple and seem happy.'\nOlivia works as a beautician and the pair live in a mansion in Cheshire, purchased for £3.4m in 2016.\nJohn left Millie in 2018 and she claimed he told her he was 'done' and that he didn't love her anymore.\nSpeaking with the outlet, she said: 'You see these girls in the nightclubs who throw themselves at footballers.\n'John has moved on with one of those girls and I feel bullied ever since by his wealth and power.'\nOlivia has been in Germany supporting the England team along with her two children who were pictured wearing John's t-shirts at the matches.\nShe celebrated when Manchester City won the Premier League in May and will see John go up against his teammate Nathan Ake on Wednesday.\nPhil Foden and Rebecca Cooke\nPhil and Rebecca have been together since they were teenagers and are thought to have met whilst they were studying at school.\nIt was recently announced that Phil had to rush home for a 'pressing family matter' as it was later revealed that Rebecca went into labour with their third baby\nPhil and Rebecca (pictured 2022) have been together since they were teenagers and are thought to have met whilst they were studying at school\nShe tends to keep out of the limelight and not much is known about Rebecca, who he shares three children with.\nThey have a son named Ronnie, a daughter named True and another child who was born less than two weeks ago.\nIt was announced that Phil had to rush home for a 'pressing family matter' as it was later revealed that Rebecca went into labour with their third baby.\nRebecca does not appear to be active on social media, however, the pair manage Ronnie's Instagram account, which has four million followers.\nThe Netherlands\nNathan Ake and Kaylee Ramman\nNathan and Kaylee tied the knot in a beautiful beach ceremony at the San Marroig country estate in Spain in 2022.\nBut whilst she may be used to sporting bright blue, she has traded in her t-shirt for vibrant orange to support her husband's national team.\nThe couple met at school and made their relationship official in 2011, according to Sports Brief and got down on one knee nine years later, in 2020.\nKaylee enjoys food, fitness, fashion and travelling and often shares snaps of herself and Nathan either at matches or on holiday abroad\nThe duo had their daughter in 2022 and revealed to the Telegraph that they had their baby induced before Nathan left for the World Cup, so he could be at the birth and spend a couple of days with his new child.\nHe said: ''We decided to induce the baby, so I could be at the birth.\n'It was supposed to come on the 20th, but then no chance for me. So it came just before I left and I managed to have a couple of days with the baby before meeting up with Holland.'\nKaylee studied at the International School of The Hague and then went on to study further in Amsterdam, pursuing fashion design after graduating.\nKaylee, who is a vegan, used to own her own jewellery business called Status Medal, but she founded JUA June last month.\nNathan and Kaylee tied the knot in a beautiful beach ceremony at the San Marroig country estate in Spain in 2022, here they are pictured at a Euros match together\nHer new venture is swimwear made from recycled, sustainable or natural materials. It states on the website: 'In partnership with our factory, we support initiatives in women's education and environmental conservation, reflecting our dedication to making a broader positive impact.'\nShe enjoys food, fitness, fashion and travelling and often shares snaps of herself and Nathan either at matches or on holiday abroad.\nKaylee shared a snap of her along with other WAGs Sterre van Bakel, Noa van der Bij and Jaimy Kenswiel sharing lavish, healthy matcha drinks as they continue to watch the Netherlands team in Germany.\nAston Villa\nEngland\nOllie Watkins and Ellie Alderson\nEllie has been enjoying supporting her partner Ollie as he plays for England during the Euros this year, after missing out in 2022.\nShe has been cheering on his name since the pair started dating in 2018 and the couple live together in Birmingham, as Ollie plays for Aston Villa.\nVilla is supported by Prince William, who watched the England team's match against Switzerland on the weekend.\nEllie, who is from Berkshire, has a diploma in interior design and often shares her lavish lifestyle online\nEllie has been enjoying supporting her partner Ollie as he plays for England during the Euros this year, after missing out in 2022\nShe has been cheering on his name since the pair started dating in 2018 and the couple live together in Birmingham, as Ollie plays for Aston Villa\nShe is a regular at Villa Park and often follows her boyfriend around to show her support for his career.\nEllie, who is from Berkshire, has a diploma in interior design and has a twin sister, Sofie, who regularly features on her social media.\nIt is currently unclear what she does for a living, but her Instagram shows her enjoying a glamorous life, jetting off to various locations abroad with her family.\nOllie and Ellie share two children together and the pair announced that they had their second child, called Marley, last April.\nEllie gave birth to their first daughter, Amara May, in September 2021 and her kids often join her at football matches.\nThe Netherlands\nIan Maatsen and Emely Tuinder\nIan and Emely often share lavish snaps of themselves abroad, whether that is jetting around exotic waters in a yacht and sunbathing on the deck or taking a romantic stroll along a beach.\nWhilst it is unclear what Emely does for work, she certainly looks glamorous for her 27,000 followers on Instagram, often sharing snaps from her travels.\nThey were on holiday in Greece when Ian got a phone call to step in for Teun Koopmeiners, who could no longer play due to injury.\nEmely Tuinder is pictured donning bright orange, the Dutch team's signature colour\nIan and Emely often share lavish snaps of themselves abroad, whether that is jetting around exotic waters in a yacht or strolling along a beach\nWhilst it is unclear what Emely does for work, she certainly looks glamorous for her 27,000 followers on Instagram, often sharing snaps from her travels\nHe cut his holiday in the sun with Emely short and flew to Germany to start training with the Dutch squad.\nEmely shortly followed, sharing snaps on her Instagram outside the stadium less than a week ago.\nShe often attends sits in the stands and has watched her boyfriend throughout his time on loan to many football teams across Europe.\nIan was signed by Aston Villa less than two weeks ago, after being on loan for several clubs in previous seasons, including Borussia Dortmund.\nHe previously played for Chelsea and will therefore now be up against another ex-teammate of his, Conor Gallagher, who is dating Aine May.\nConor and Aine got together roughly five years ago and the loved-up pair have been enjoying their time together ever since\nConor and Aine live together along with their adorable Chow Chow dog Freddy\nConor and Aine got together roughly five years ago and the loved-up pair have been enjoying their time together ever since.\nThe blonde beauty currently works as a model and splits her time between London and Ireland, alongside jetting out to cheer on her boyfriend at matches.\nThe couple live together along with their adorable Chow Chow dog Freddy, who has his own social media account and is often spotted sporting England shirts.\nBut whilst Aine and Emely may have spent matches watching their partners against other teams, they will now be watching them battle it out for a place in the finals on Wednesday.\nTottenham Hotspur\nEngland\nJames Maddison (axed) and Alexa Kennedy\nAlthough James has been axed from England's football team for the Euros this year, he will watch his teammate Micky van de Ven play against them for a place in the final.\nAlex and James began dating in 2020 and the pair have been inseparable since. They announced their relationship to the world when they donned matching pyjamas on Christmas Eve of that year.\nAlexa, who is a model, moved back from Los Angeles that year where she enjoyed hiking up Runyon Canyon and watching US sports, like baseball\nAlex and James began dating in 2020 and the pair have been inseparable since\nShe enjoys sharing her life as a mother-of-three on Instagram, along with showing off her holidays abroad\nAlexa, who is a model, moved back from Los Angeles that year where she enjoyed hiking up Runyon Canyon and watching US sports, like baseball.\nIn 2021, the couple welcomed their son Leo and then last year Alexa gave birth to twins, Delilah and Rome.\nShe enjoys sharing her life as a mother-of-three on Instagram, often posting snaps with her family spending quality time together.\nThe Netherlands\nMicky van de Ven and Sterre van Bakel\nAlthough James Maddison won't be taking to the pitch on Wednesday, his Spurs teammate Micky van de Ven will be, along with his girlfriend Sterre by his side.\nSterre studied marketing and communications at Summa College and Communications at Avans University of Applied Sciences\nSterre often shares snaps of her in stylish and chic ensembles as she watches her boyfriend play for the Spurs and now the Netherlands national team\nShe currently works as a consultant for Unique, a HR company based in the Netherlands, and used to work in marketing.\nShe studied marketing and communications at Summa College and Communications at Avans University of Applied Sciences, the same place of education that Noa van der Bij attended.\nShe often shares snaps of her in stylish and chic ensembles as she watches her boyfriend play for the Spurs and now the Netherlands national team.",
  "word_count": 4784,
  "scraped_at": "2026-02-14T12:57:59.019811"
}