{
  "article_id": "966a4654d5bc",
  "url": "https://www.newstatesman.com/long-reads/2023/03/long-shadow-iraq-war",
  "title": "The long shadow of the Iraq War",
  "date": "20230318T060000Z",
  "domain": "newstatesman.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "His name was Loren Marlton-Thomas. He was a bomb hunter. As a corporal from 33 Engineer Regiment, the Sappers, he was based at Carver Barracks in Wimbish, Essex, close to the old Quaker town of Saffron Walden, and that summer he had one of the loneliest and most perilous jobs on the tour of Afghanistan. He was the leader of an advanced search unit in Helmand province and his mission, as part of the Nato command combating the Taliban insurgency against the US-backed government in Kabul, was to find improvised explosive devices (IEDs), which were maiming and killing British soldiers. Nearly one hundred of them had died over recent months.\nCorporal Marlton-Thomas relished the fierce challenge of his work and was proud that his interventions saved lives – the lives of his comrades, as well as of Afghan servicemen and local civilians. But he had no illusions: he understood the dangers as he led his unit along the rough tracks and wadis of Helmand. The IED hunters were admired for their rare courage: where they went, others could follow, follow even into the Valley of Death, especially into the Valley of Death, as the area between Sangin and Gereshk was known.\n[See also: The Iraq War exposed the liberal delusion of remaking the world]\nWaking early on this Sunday morning, Marlton-Thomas felt the familiar churn of anticipation in the pit of his stomach. This was what his body was telling him: he was going out on patrol again. The Taliban and the armed drug cartels were an omnipresent threat, elusive, implacable enemies; IEDs were being used indiscriminately, not only to kill British soldiers but to weaken their resolve. The previous Sunday Marlton-Thomas had been interviewed by BBC television for a Remembrance Sunday programme and he was cheered to know that his brother, Fraser Marlton-Thomas, the Queen’s senior footman, and their mother Anne were watching back in England.\nThe day’s task was to clear a path in the area around Gereshk, in the vicinity of Patrol Base Sandford. It was named after Lance Corporal Paul Sandford, killed by a sniper in 2006; he was 23. The base was located 90 minutes from Camp Bastion, Britain’s largest overseas military base.\nWhat was Corporal Marlton-Thomas looking for as he moved through the monotonous landscape? He was searching for disturbances in the parched soil, trackside irregularities, mounds and broken surfaces – markers of unusual human activity. He moved slowly, meticulously, as he always did, his men following close behind. They knew one false step could be fatal.\nIt was autumn 2009 and for the 28-year-old Marlton-Thomas, who’d grown up in the persistent rain and damp of the north-west of England, it felt like a fine summer day in Lancashire. In the peak summer months in Helmand, in the dusty, arid landscapes of the Upper Gereshk Valley especially, the temperatures rise above 38˚C, and the soldiers have no choice but to endure the heat.\nEven on this November day, Marlton-Thomas could feel the sweat gathering beneath his helmet and pooling in his armpits. He could sense the dry heat rising and almost hear the silence around him, so intense was his concentration as he scanned the landscape, alert to every possibility and sound. Just behind him was the ATO team (ammunition technical officers) who defused the explosive devices his unit discovered.\nThat day the clearance team was led by Warrant Officer Ken Bellringer of the Royal Logistics Corps, who had spent several weeks training in the test lanes at Camp Bastion. So far on this tour they’d defused three main types of IED – the time-delayed device, the victim-operated device and the command-initiated, remotely detonated device.\nMarlton-Thomas felt secure in the convoy of armoured vehicles that had set out from base camp, but out on foot patrol, leading from the front, he simply did not know: the uncertainty had its own peculiar, thrilling intoxication. Sometimes he liked to think of himself as an explorer in some undiscovered land. He was going where others could not, a path-finder, a path-maker, clearing the way ahead. Out there the Taliban insurgents were everywhere and nowhere. He knew they wanted him to die and the British and Americans to leave in abject defeat and humiliation. But where were they?\nLike all Sappers, Marlton-Thomas was a multi-skilled tradesman: soldier, combat engineer, accomplished blacksmith. He’d previously served on two operational tours, in Northern Ireland and Iraq. No one had made him join the army as a 16-year-old, straight from school. Originally, he’d wanted to be an infantry soldier but his late father, Chris, a civil engineer, persuaded him to join the Engineers, so that he would have a trade to call on for the rest of his working life.\nWhen he was at home with family, Marlton-Thomas never talked about his experiences on patrol; he never mentioned IEDs and bomb hunting. He wanted to protect his wife, as well as his brother and mother, from the reality of what he did, from the extremity of it, the true dangers. He didn’t want them to know – and he couldn’t really explain, in any event – just how it felt to be alone in the gathering silence, when the boundary between life and death was membrane-thin. There were long, silent days when he was sure he could hear blades of grass moving in the faintest of breezes.\nOn this six-month tour, Marlton-Thomas knew what was expected of him and all who were deployed alongside him on Operation HERRICK 11. He offered constancy, expertise, determination, vigilance. His wife said he was “army-barmy”. His friends and comrades called him “Loz” or “MT”. His mother called him “my Loren”. Fraser called him “my brother”. He was a Sapper and searcher. Leader and team player. He was a bomb hunter.\n[See also: In its pursuit of Russian regime change, the West is doomed to repeat the errors of the Iraq War]\nWarrant Officer Ken Bellringer was moving methodically along a narrow irrigation channel through a churned-up field when Marlton-Thomas, just a few metres ahead, abruptly stopped. He seemed agitated; he twisted and turned. What had he found?\n“Mate,” Marlton-Thomas called out. “I’m stuck. Really, I’m stuck!”\nBellringer chuckled more out of nervous surprise than amusement. Stuck – how could he possibly be stuck? He edged closer, expecting to discover that his comrade’s feet were submerged in thick mud but couldn’t quite process the sight before him: Marlton-Thomas seemed to be standing in a rabbit hole, and yet he could not move his feet. On closer inspection, Bellringer saw that the hole had unnaturally straight edges; no wild animal could have made it. With mounting alarm, he realised what had happened: Marlton-Thomas had stood on an IED. There was still time to act but not much, because the device had been disturbed; they were in what the army classifies as a Category A situation. “A Category A situation is where EOD [explosive ordnance disposal] operations commence regardless of the risk to the operator’s life,” Bellringer told GQ magazine. “We’re told if there is nothing you can do, and you know categorically a device is about to go off – imagine it’s a movie and you can see the timer counting down – then you’re supposed to get out of there yourself, perhaps say you’re just going to get a piece of equipment.”\nBellringer chose not to get out of there. He stayed on and searched for a wire to the device but there was nothing. He knew the IED had been disturbed but it could just as easily have malfunctioned. He would not leave his comrade behind. He reached under Loren Marlton-Thomas’ arms and prepared to lift him by the elbows.\n“Here we go,” Bellringer said. The explosion resounded across the valley.\n[See also: After Iraq: the great unravelling]\nBellringer sustained catastrophic injuries to his lower abdomen. His legs were blown off above the knee; his pelvis and testicles were shattered; muscles were ripped apart in his arms and he lost fingers on each hand. The next day, having been stabilised and put into an induced coma at Camp Bastion, he was flown to England and transferred to the Queen Elizabeth in Birmingham, the hospital where servicemen and women wounded in Afghanistan were treated. (It was here that Malala Yousafzai was ultimately taken after she was shot in the head by a Taliban gunman.) Bellringer, who had a wife and two school-age children, was considered to be the most severely wounded British survivor of the Afghanistan war: years of treatment and suffering, psychological and physical, lay in wait.\n“I was thrown through the air but when I landed, I had no pain,” he recalled. “I kept my eyes shut. I think something in my head was telling me I didn’t want to see the damage – I knew instinctively that my legs had gone. The last thing I remember was someone in the helicopter taking hold of my head and saying: “We’ve got you, you’re safe.”’\nMarlton-Thomas was blown into a nearby canal, where he lay below the surface of the water until the next morning when a search team of divers found him. At the inquest, it was revealed that an order to abort the mission over concern that signals from soldiers’ radios could trigger IEDs was never received by Marlton-Thomas’ unit. If that message had got through, he would have stopped, but he carried on. A bomb hunter to the end.\nIt was Sunday evening and Fraser Marlton-Thomas was in his room at Buckingham Palace – “the office”, as the Royal Family call their London residence – when he received a message asking him to contact his cousin James, a lieutenant colonel in the army air corps.\n“I immediately thought something had happened to Nanna [his grandmother],” Fraser said. “Then he told me. I said, ‘Fuck off, James – he’s not dead. It’s Loren. No one’s going to kill him.’ I’d only seen him the week before on television. He looked fit, tanned, happy. How can it be? I put the phone down. I said to my friend: ‘My brother’s dead.’” The next day the Queen came to see Fraser. “She was very sympathetic. She was so sorry. He was one of her soldiers, and he was my brother.”\n[See also: James Bluemel interview: “We learn nothing”]\nLoren Marlton-Thomas was a cousin of my wife – his parents, Anne and Christopher, were guests at our wedding – and we were told about his death in a phone call. A few days later we watched televised coverage of the repatriation of Marlton-Thomas’ body through the Wiltshire market town of Wootton Bassett. There was a second hearse carrying Rifleman Andrew Fentiman, a Territorial Army soldier who had been shot and killed on the same day, while on patrol near Sangin. The repatriation ceremony had special significance because it was the hundredth to pass through the town.\nThe two soldiers’ bodies were flown into RAF Lyneham in Wiltshire early on the morning of 20 November, where Fraser, Anne, and Loren’s wife Nicola and other members of the Marlton-Thomas family were waiting. The bodies were taken from the plane to a chapel at the base. “We went to see the coffin and were given time to say a few words to Loren,” Fraser recalled.\nFrom Lyneham the hearses carrying the Union flag-draped coffins were driven to the John Radcliffe Hospital in Oxford, passing en route through Wootton Bassett, where townspeople, many formally dressed as if for a funeral, were lining the long, narrow high street in what had become a familiar ritual of public mourning. The cortege stopped at the town’s war memorial and there Anne laid flowers on the roof of the hearse carrying her son’s coffin. The bell in the 15th-century St Bartholomew’s Church tolled solemnly. “It was lovely what people did, coming out to mourn,” Fraser said. “It all started with one person and grew and grew, and in the end the whole world knew about this little English town.”\n[See also: Arthur Snell interview: “Many world problems stem from the Iraq invasion”]\nThe repatriations through Wootton Bassett began in April 2007 because of an accident of geography: the town is directly on the route from RAF Lyneham to the special armed forces department of pathology at the John Radcliffe Hospital. The runway at RAF Brize Norton was under repair and so the fallen soldiers were flown into Lyneham instead.\nThe first repatriation through the town was of two young soldiers killed on patrol in the vicinity of Saddam Hussein’s former presidential palace in Basra, in south-eastern Iraq, where the British were struggling to contain a Shia insurgency. Ballistic evidence suggested that both soldiers were killed by the same sniper using the same weapon. A few days later, four more British soldiers were killed by an IED just outside Basra, and they too were repatriated through Wootton Bassett.\nThe first corteges did not stop on the high street and were noticed perhaps by only a few members of the local branch of the Royal British Legion; no one can recall for sure who was there that day. But soon something unusual was happening in the town, and more and more people were coming out to honour the soldiers as they passed through. Even when Brize Norton reopened, the repatriations continued through Wootton Bassett for a period, and the grieving families also started coming; it was as if the whole town was weeping.\nBefore too long visitors from elsewhere were arriving on “repat” mornings; there were collection tins for military charities in nearly every shop and pub window. Foreign media began turning up to report on these ceremonies of mass mourning, just five miles from Swindon. The repatriations caught the attention of President Obama, who said “the small British town of Wootton Bassett” represented “the best of British character”.\nReverend Canon Thomas Woodhouse, chaplain of the King’s Chapel of the Savoy within the Duchy of Lancaster, was vicar at St Bartholomew’s Church throughout the years of the repatriations. “In the early stages there was no plan – the whole thing was so ad hoc,” he told me. “I don’t think anyone can truly claim credit for starting it. People will try to, but lots of people had the same idea at about the same time. Even the tolling of the church bell as the cortege passed was an accident. It just happened that a repatriation was taking place on a Monday when we had bell ringing and that day someone just decided to toll the bell. It’s a long, narrow high street and it rang as if into a silent cavern – the sound just ricocheted. Afterwards, we realised it was amazing. And thereafter, at every repatriation, as the cortege approached the church, the bell would toll until it had passed and was leaving the town.”\n[See also: The long search for Iraq’s missing]\nThe British are committed to acts of remembrance. Nearly every village and older town across the realm has a memorial to the dead of the two world wars. Wherever the British have been and settled in the world, they have left behind gardens of remembrance in the form of the Commonwealth War Graves Commission’s cemeteries; the Falklands War marked the first time in Britain’s military history that the bodies of British soldiers were repatriated. As the military historian John Keegan has written, the dead of the British empire and Commonwealth of the two world wars are buried in 134 countries, from Algeria to Zimbabwe. The Commission maintains as many as 2,000 cemeteries throughout the world and cares for 23,000 individual graves or plots in non-military cemeteries. It also commemorates the many hundreds of thousands whose bodies were never recovered, or who were found but could not be identified. A central belief of English identity, Keegan wrote, is that: “England is a garden, and that to be English is to be a gardener; that in life they are best at home in a garden; and that, in death, a garden is where they belong.”\nThe repatriation ceremonies in Wootton Bassett were quite different from the more familiar, grand, dignified state-organised services of national remembrance for all rather than individuals. The Wootton ceremonies did not come from orders of the state and did not take place in churches or gardens of remembrance; they happened spontaneously, in public, in the high street. Until 2000 the town had a memorial hall rather than a cenotaph; the stone war memorial – raised hands carrying the weight and burden of the globe – was built following local fundraising efforts and would become the focal point of the liturgy of the repatriations.\nWhat we witnessed in Wootton Bassett during those four years of the repatriations was nothing less than an act of national commemoration. But it was unofficial, of the people and for the dead soldiers and their families; political leaders did not come and the royal family were not represented. “No one organised it, no one requested it,” the Royal British Legion’s former national president, Lieutenant General Sir John Kiszely, said. “It happened because it was the right thing to do.”\nEvery repatriated man and woman, of all faiths and none, was treated the same, but there were moments of difference. The families of dead Gurkhas would place flowers directly on the coffins rather than on the roof of the hearses as the cortege paused at the war memorial, and they would also sing. On one occasion, when the body of a military dog-handler was repatriated, hundreds of people brought their dogs in solidarity. “It was so silent in the town during repatriations you could hear people’s footsteps. On this occasion the silence was broken by barking dogs,” Thomas Woodhouse said.\n“What happens in Wootton Bassett is not a revolution and does require coordination, but it is still a spontaneous mass movement,” wrote the historian Hew Strachan. “If the prime minister needs evidence of ‘big society’ in operation, this might be it. However, he may also have cause to regret it rather than to welcome it. Publicly grieving the dead while the war is still going on has the potential to create problems for policy. The government fears its potential impact on public support for a conflict whose rationale has never been secure.”\nStrachan said that Britain had no grasp of how to mourn the soldier who had died in a war that was discredited by defeat, as the French and Germans had, or in a war that was considered unjust, as so many considered the Iraq War to be. “The meaning of Wootton Bassett is freighted because, for all the political neutrality of its acts of commemoration, they mark a politically contentious war.”\n[See also: Jack Straw: the Iraq War split the West and aided Putin]\nIn early January 2010 a group called Islam4UK announced that it would stage a demonstration in Wootton Bassett. The group’s leader, Anjem Choudary, was planning to parade empty coffins through the town to remind the British of the Muslims “murdered by merciless” coalition forces in Iraq and Afghanistan. If you wanted to spark a race war this would be how.\nIslam4UK was in effect another incarnation of al-Muhajiroun, a militant Islamist network. Other related names used by the group included Al Ghurabaa, Muslims Against Crusades, Shariah4UK, Call to Submission, Islamic Path, the London School of Sharia and Need4Khilafah.\nA former Wootton Bassett mayor and councillor Chris Wannell spoke for many locals when, distressed that the town itself was becoming a source of contention and a site of political conflict, he said, “We don’t do what we do at Wootton Bassett for any political reason at all, but to pay our respects to those who have given their lives for our freedom. We are a Christian country and a traditional old English market town who honour very much our Queen and country. We obey the law and pay respects to our servicemen who protect our freedom.”\nAl-Muhajiroun (“the emigrants”) was co-founded by Anjem Choudary and Omar Bakri Muhammad in the 1990s. Omar was a Syrian-born Muslim Brotherhood preacher who, after his expulsion from Syria, lived in Beirut, where he joined Hizb ut-Tahrir, which agitates for caliphism, the creation of a caliphate in the Middle East under sharia law. Later, after being expelled from Saudi Arabia, Omar was given asylum in London, where he set up a branch of Hizb ut-Tahrir (today the group is most active in the English Midlands). After splitting from it, he created al-Muhajiroun just as the Balkan Wars and the atrocities in Bosnia were radicalising a generation of European Muslims.\nUnlike Omar, Anjem Choudary was born in England, in 1967, the son of a market trader of Pakistani heritage. He dropped out of medical school and then studied law at Southampton University and after his embrace of Salafism, he would appear as a robed, bearded and bespectacled antagonist in political discussions on British television. For Choudary, a passionate advocate of instituting sharia law in Britain, Islam was at war with the secular West and with the kufr, or unbeliever: there could be no compromise in this clash of civilisations. He was imperious and articulate and, because of his legal training and mastery of counter-terrorism laws, he seemed untouchable – until one day he wasn’t. He was finally convicted, under the Terrorism Act 2000, for inciting his followers to join Islamic State in Syria and Iraq. He was sentenced to five and a half years in prison in 2016 and released on licence in October 2018.\nBefore the 11 September 2001 attacks in the US and the London bombings of 7 July 2005, in which 52 people died in coordinated early morning suicide strikes carried out by four young British Muslims on public transport, Britain had been considered a safe space by, and for, Islamist dissidents and radical preachers. An unofficial “covenant of security” is assumed to have existed between Muslim groups and the British authorities in the 1990s: the dissident preachers, many of them exiles from persecution in Arab states, were free to proselytise and recruit, so long as there were no attacks on British targets from within Britain. As in the Victorian period, when Karl Marx worked in the great Reading Room of the British Museum and Pyotr Kropotkin wrote for the anarchist-communist journal Freedom, revolutionaries and dissidents relished the liberty and anonymity of life in the metropolis. This was the climate in which al-Muhajiroun flourished in the late 1990s and into the 2000s, becoming an incubator for terror, right up until the London suicide attacks; a quarter of convicted terrorists in Britain are reported to have been linked to the network.\nThe New Labour government initially showed little interest in and understanding of al-Muhajiroun’s activities and its malign intent, and the group was deemed by the intelligence services MI5 and MI6 to be an inconsequential, even eccentric threat, clowns rather than criminals. It was much more than that: Mohammed Sidique Khan, the Leeds-born leader of the London bombers, trained at a terrorist camp established by the Pakistan branch of al-Muhajiroun in the North West Frontier Province.\nBy late 2009 al-Muhajiroun was using yet another name, Islam4UK – the original group had finally been banned in Britain in 2008 – and the Wootton Bassett repatriations provided an ideal opportunity for Choudary to mobilise. Among those provoked was Tommy Robinson, a recidivist, football hooligan and de facto leader of the English Defence League (EDL). Aggressive nationalists, EDL activists were self-styled defenders of the embattled English nation, as they saw it, their main enemy being the alien presence of Islam in Europe. Which explains why, on a cold, snowy day in early January 2010, the EDL staged a pre-emptive counter-demonstration against Islam4UK in Wootton Bassett.\nWith frozen slush on the pavements, a couple of hundred EDL members congregated at the town’s war memorial. Some of them wrapped themselves in a huge cross of St George, the national flag of England since the early modern period, as if seeking both its affirmation and protective warmth. They spent the rest of the afternoon on a desultory pub crawl, their movements tracked by police officers. In many ways it was a comically low-key provincial event, more Monty Python than political protest, and yet it hinted at something darker: rising antagonism between English far-right nationalists and radical Islamists, and it was being played out on the high street of a quiet market town in rural southern England, the countryside so central to a particular cherished vision of English national identity. England as a garden.\nFearing greater unrest, and possible violent clashes, in and around Wootton Bassett, the Labour government responded to the proposed Islam4UK march by banning Anjem Choudary’s group under new legislation outlawing the “glorification” of terrorism. “Wootton Bassett has a special significance for us all at this time, as it has been the scene of the repatriation of many members of our armed forces who have tragically fallen,” Prime Minister Gordon Brown said in a statement. “Any attempt to use this location to cause further distress and suffering to those who have lost loved ones would be abhorrent and offensive.”\nIn an article for the Cambridge University student paper Varsity, Beth Staton, who’d grown up in the town, complained that it was being romanticised, even mythologised, as a kind of arcadian English idyll. It was nothing of the kind:\nI’ve lived in Wootton Bassett for twenty years, and seen several repatriations… The town has reached the point where it cannot be removed from politics. Wootton Bassett is a typical English town; my home is a place of interesting people, dodgy politics, and tacky high streets, not a benign embodiment of little England. We cannot succumb to this lie; if it becomes entrenched in national consciousness, it threatens to breed a destructive and sinister hatred.\nIn the event, the Islam4UK march never took place, but the controversy surrounding what might have happened delighted Choudary: it had “successfully highlighted the plights of Muslims in Afghanistan globally”, he said, and he promised the group would rise again on “another platform with a new name”. For Tommy Robinson, the EDL rally was one more step along the long road that would eventually see him back in prison.\nFor Reverend Woodhouse, the aborted Islamist protest march had one big benefit: it served as a “powerful expression of unity”, bringing together local Christian churches and the Wiltshire Islamic Cultural Centre. “The repatriations were about the deaths of all people, not just some, because all deaths in war are tragic,” he said. “It doesn’t matter what nationality or creed you are. Until that point there hadn’t been an easy way of having a cross-religious conversation in the town and we ended up with much closer links.”\n[See also: Being right about the Iraq war has made the left insufferable]\nIn the years after the invasion of Iraq and that country’s descent into perpetual conflict, you longed to turn away from the truth of what was happening in the region, to wish it wasn’t so. You wanted to turn away from the images of suffering and the carnage, the suicide bombings and sectarian bloodlust, the displacement and exile of millions of people, the harrowing loss of life. The destruction of the Baathist state created chaos and the ideal conditions for insurgency to flourish. “Following Saddam’s fall, Iraq became a theatre of revenge, each murder inspiring another and then another,” wrote the American war correspondent Dexter Filkins in his book The Forever War. “Sometimes it felt like the sounds of bombs and the call to prayer were the only sounds the country could produce, its own strange national anthem.”\nThrough all of this, and because of their roadside vigils, the people of Wootton Bassett, in their modest, dignified manner, made sure we would not turn away. They made sure we recognised the human cost of reordering the world, of trying to impose Western values on those who would resist them. They made sure the returning dead servicemen and women were not left to expire offstage, unacknowledged by all except those who loved them most. As the corteges of the repatriated passed along the Highway for Heroes, as it became known, and as the months went by, the Wiltshire town started to be a destination, even a place of pilgrimage. In October 2008 an armed forces parade was held in Wootton Bassett. Question Time, the BBC’s flagship current affairs programme, broadcast a special edition on the Afghanistan war from the town. Prince Harry, in a private capacity rather than as an official representative of the royal family, attended a Remembrance Day service at St Bartholomew’s – many of those in the church did not even know he was there, so low-key was his presence. Prince Charles, together with the Duchess of Cornwall, also came to the town to bless the flagpole (a recent gift) and to lay a wreath at the war memorial. Princess Anne, honorary air commodore of RAF Lyneham, was a visitor. Others were less welcome – Nick Griffin of the British National Party was received with indifference.\nThe bodies kept coming home. I sometimes thought of these dead soldiers as the returning ghosts of Britain’s foreign policy misadventures, haunting our unquiet present, their fate a poignant testament to the sacrifice of duty but also to the fraudulent ways in which the war in Iraq had been prosecuted and conducted. Publicly grieving the dead while the war was going on did pose problems for policy, as Hew Strachan wrote. In time public support for the wars (but never the troops) collapsed. The soldiers themselves protested that they were being sent inadequately equipped into combat zones.\nShortly before he was killed, Andrew Fentiman from Cambridge, who was repatriated alongside Loren Marlton-Thomas, posted a blog in which he revealed he and his comrades had not been issued with the required protective equipment. “We are still waiting on these new body armour and helmets that were promised to us,” he wrote. “You would have seen the story splashed all over the news, they said they would be ready for us but we hope they will arrive soon.”\nBy the time the equipment arrived, it was already too late for Rifleman Fentiman.\n[See also: The US is readying itself for another moral crusade, this time against China]\nIn July 2016, seven years after it was commissioned, the Chilcot Inquiry into the Iraq War concluded, in a 2.5 million-word report, that the British armed forces had been humiliated in Iraq because of inadequate strategic planning before and after the invasion. The dismantling of an entire state had created the conditions for anarchy. The regime of Saddam Hussein had not posed an urgent threat to British interests at the time of the invasion and there had remained peaceful alternatives to war. The Blair government had been too certain in its judgement that Saddam possessed weapons of mass destruction and the intelligence reports that it used to make its case for war were flawed. The safety and the effectiveness of British combat troops were compromised by serious shortages of vital equipment, and the military was overstretched because it was embroiled in unsustainable parallel operations in Iraq and Afghanistan.\nNone of this offered any consolation to the family of Corporal Loren Marlton-Thomas. “My mother has never got over it,” his brother Fraser told me. “A mother should never bury a son. How can you? I can’t get over it either. But I saw it from a different angle. He was doing his job. Where did the courage come from?”\nSometimes when I watched news reports or read about the repatriation ceremonies during those years, I was reminded of Robert Lowell’s poem “Waking Early Sunday Morning”. Lowell, a pacifist, had participated in the march on the Pentagon in Washington DC, in 1967, to protest the Vietnam War. On the eve of the march, he read the poem, which contains some of his finest lines, to an audience of anti-war protesters. In the graceful, elegiac final stanza, the poet envisages future generations being caught up in endless foreign conflicts because the US was doomed by its great power and sense of manifest destiny to fulfil the lonely role of world’s policeman. Lowell urges us to pray for the young people who are destined to die in future wars, as indeed thousands of troops would die in America’s “forever war”.\nLoren Marlton-Thomas had woken early on that final Sunday morning of his life in Helmand province, and as a dedicated soldier he’d died in a foreign war in a land his country should have known better because of its imperial history in South Asia.\nDuring his final year in power, Barack Obama discussed the moral limits of American power and used a pointed phrase to describe his world-view: “tragic realism”. In a New York Times interview, he cited the opening to VS Naipaul’s novel A Bend in the River, set in an unnamed African country the reader assumes is the Democratic Republic of Congo, formerly Zaire: “The world is what it is; men who are nothing, who allow themselves to become nothing, have no place in it.”\nObama said he reflected on the meaning of that sentence and Naipaul’s uncompromising vision when “thinking about the hardness of the world sometimes, particularly in foreign policy, and I resist and fight against sometimes that very cynical, more realistic view of the world. And yet, there are times where it feels as if that may be true.”\nLike the philosopher-theologian Reinhold Niebuhr, who deeply influenced his thinking on foreign policy, Obama acknowledges the existence of evil in the world but also the difficulties and dangers inherent in confronting it. As a young politician, Obama opposed the Iraq War because he understood the risks of attempting to impose, through violence and conquest, Western values of freedom and democracy. He understood the need to show humility in the exercise of power.\nGreat power carries the burden of great responsibility and demands restraint – perhaps at times far too much restraint, in the case of Obama’s later response to the Syrian tragedy. In the absence of a strategy, the Obama administration laid down its red lines against the use of chemical weapons. When the Assad regime transgressed by ordering a chemical weapons attack on rebel-held Ghouta in the suburbs of Damascus in August 2013, killing hundreds, Obama seemed frozen. US equivocation opened the way for Vladimir Putin’s Russia to become, over time, the dominant foreign power in Syria, and the Assad dictatorship did not fall.\nSometimes the absence of war has nefarious consequences, and this is surely what Obama meant by tragic realism. The world is what it is. It resists being reordered.\n[See also: The road to war in Iraq]\nIn his response to the Chilcot Inquiry, Tony Blair accepted responsibility for the failures of Allied post-invasion planning but staunchly defended the original decision to invade and occupy. With his voice hoarse and weakening, he was described as resembling a “broken man” by some commentators during the press conference at which he replied to Chilcot. Yet when we met not long afterwards, in his London office, Blair was anything but broken: he insisted to me that the arc of history bends towards progress and enlightenment. He expressed no regrets for taking Britain to war in Iraq, and for facilitating the fall of Saddam.\nFor Blair, the 11 September attacks had been a profound shock but also an opportunity for Britain to redefine its role in the world. He used the horrific attacks to leverage influence over the new Bush administration and, as he saw it, to draw the world’s one essential superpower away from hermit security.\n“Every American president I’ve ever dealt with has always come to power with an essentially domestic programme,” Blair told me. “And all of them have ended up, because this is America’s inevitable role in the world, being highly engaged in global affairs.”\nI later asked Jeremy Hunt, when he was foreign secretary in the May government, what Blair had got so wrong in Iraq. Hunt described what happened as a profound breakdown in trust. The Iraq War was a disaster, he said, a lesson in humility and the limits of Western power. “It was not just a foreign policy misjudgement but a breach of trust, because Blair used his presentational skills to persuade people of something that turned out not to be true, namely the existence of weapons of mass destruction.”\nOnce again, a covenant between the people and the political class had been broken – a pattern repeated over the last twenty years. As George Eliot put it, “What loneliness is more lonely than distrust?”\nThe governed were losing trust in the governors.\n[See also: Leader: The Iraq War and its aftermath]\nOne summer day, Lieutenant Daniel Clack of 1st Battalion The Rifles (1 Rifles) was leading his team on patrol around the village of Dactran in southern Afghanistan. The next day a shura, or consultation, was scheduled to take place with tribal leaders. As the patrol approached the village it activated a roadside IED. Lieutenant Clack – “Clacky” to his rugby-playing friends – was killed and five of his men were injured. A graduate of Exeter University whose family lived in Woodford Green, on the Essex/north-east London borders, Clack had been commissioned into the Rifles on completion of his officer training at Sandhurst. Aged just 24, and engaged to be married, he was a leader of exceptional promise and had been an officer for less than a year. On 18 August 2011 he was the 167th, and last, British soldier to be repatriated through Wootton Bassett.\nA couple of weeks later, a sunset ceremony was held in the town to mark the end of the repatriations at RAF Lyneham – it was the day before the runway was decommissioned – and their return to RAF Brize Norton, across the county border in Oxfordshire. Members of the Royal British Legion, many visiting from other branches, lined up around the war memorial and raised their standards; a lone trumpeter played; Laurence Binyon’s beautiful poem “For the Fallen” was read aloud by a veteran; the Union flag, flown at half-mast on repatriation days, was lowered from its pole and removed; and as many as 5,000 people of all ages gathered on the high street for the sombre ceremony, which was televised nationally. Among the crowd, unnoticed by most, was Prime Minister David Cameron, “not officially there but just loitering at the back”, as Thomas Woodhouse described it.\nAt the end of the sunset ceremony, Reverend Woodhouse collected the Union flag and took it back to the church. There it was blessed overnight on the altar before being transferred to Carterton, a town in the prime minister’s Oxfordshire constituency. “The flag was given to me and that evening it was like Moses [and the Red Sea], the crowd just parted before me as I walked in silence to the church,” Woodhouse recalled. “The final ceremony released us: we didn’t ask to do what we did, we stepped up and nothing had gone wrong. It was an extraordinary period but one of the strengths of the town is that we just get on with getting on. Life didn’t stop but the repatriations became a crucial and unexpected part of our lives. We were witnessing at first hand, and responding to, people in deep mourning. Any conversation about the rights and wrongs of the wars happened behind closed doors – because the focus in those moments was the grieving families. We just accessed it at our own level and nobody did anything that could be perceived by the outside world as cashing in.”\nFor this reason, he delayed a much-needed redecoration of St Bartholomew’s, which would have required a fundraising campaign, until after the runway at RAF Lyneham had been decommissioned and the repatriations through the town ended.\n[See also: How do you cope after a western invasion? We hear from Iraqis rebuilding their lives]\nA few months after the sunset ceremony the town was officially renamed Royal Wootton Bassett, the first to be honoured with the prefix “Royal” for a century. Lyneham was finally closed as an RAF station at the end of 2012. Two years later the Cameron government ceased all combat operations in Afghanistan, though a contingent of British troops stayed on as part of a transnational Nato mission engaged in diplomatic, logistical and humanitarian activities for another seven years until the final, chaotic US-led retreat. By the time Donald Trump left the White House, the US had squandered in excess of $2trn on its military operations in Afghanistan and 2,448 American service personnel had died, with nearly 21,000 injured. As many as 69,000 Afghan soldiers as well as 47,000 civilians had also died in the conflict. The Taliban had offered an unconditional surrender in December 2001, which the Americans rejected. By 2021 Afghanistan was a fully fledged “narco-state”, the world’s largest producer of illicit heroin, and the Taliban controlled much of the opium trade.\nTowards the end of his first hundred days in the White House, Joe Biden announced that, ahead of the 20th anniversary of the al-Qaeda attacks of 11 September 2001, all US troops would be withdrawn from Afghanistan. The conflict was never intended to be a “multi-generational undertaking”, he said in a televised address, and it was “time to end America’s longest war… time to end the forever war”.\nThere was nothing but doubt in his expressions of confidence and his tone betrayed the reality on the ground: the Taliban had as many as 75,000 full-time fighters and hundreds of Afghan soldiers were being killed every month. The Taliban had not been defeated and its leaders were emboldened. The Americans were preparing to cut and run, resulting in the instant reconquest of the country by the Taliban and the creation of the self-styled Islamic Emirate of Afghanistan, ruled by sharia law. As the Islamist group’s fighters closed in on Kabul, the remade Afghan state was revealed to be a fiction and President Ashraf Ghani and other national leaders simply fled to the airport, abandoning the country and its people to their dismal fate, including many who had worked alongside the Americans and their Nato allies.\nThis was a profound humiliation for the Biden administration and total defeat for the hubristic Western project of nation-building. “In Afghanistan no one feels capable of stopping the movement of history, with all its struggles and calamities,” wrote Bruno Maçães as he prepared to leave Kabul a few days before it fell to the Taliban on 15 August 2021.\nToday the former site of Patrol Base Sandford is an opium farm; more than half of the opium in Afghanistan is cultivated in the fertile areas around the Helmand River. Sangin is the de facto capital of the illicit trade, and fields of opium poppies flourish where Corporal Loren Marlton-Thomas died after his boots became trapped in an IED and his comrade Warrant Officer Ken Bellringer refused to abandon him and went to his aid.\nWhat did Loren die for? We can say this for sure: he died leading from the front, in a land he could never know nor understand.\n[See also: Russia and the new language of war]\nOne cold, cloudy spring afternoon I wandered alone along Wootton Bassett’s high street. With the exception of St Bartholomew’s Church and the Grade-II listed museum, with its distinctive tapered oolite columns, formerly the town hall, the town is an unremarkable mix of pubs (there are a lot of them, reflecting its distant past as a staging post on the Bath to London road), fast-food restaurants, charity shops, hairdressers, chemists, more traditional outlets such as an independent butcher, greengrocers and newsagents, and towards the bottom of the hill, on the road out to Lyneham, an infant school, a Methodist church and some older residential housing. Further up the hill, I paused outside the entrance to the tatty town council offices. On display in a bay window were some of the many gifts received by the council on behalf of the town during the repatriations – commemorative shields, a Nato plaque, a framed score from the Royal Marines, a soldier’s hat. These were the only mementos I could find in the high street of the extraordinary events in this most ordinary of English towns.\nIt had been another world back then – before Brexit, of course, and the pandemic – and yet, in many ways, we still live in the long shadow of the Iraq and Afghanistan wars. The legacies of those wars inform how we think about Britain’s role in the world and how we think about our armed forces, and they tell us something important about who we were back then and who we are now.\nFor England is a country in which the soldiers themselves, “our boys and girls”, have never been more esteemed and our armed services never more trusted – and this at a time when people were rapidly losing trust in politicians. (According to the 2019 Hansard Society’s Audit of Political Engagement, the military was the institution most trusted to act in the public interest.)\nThe conviction that Iraq was a “bad” war has hardened since the repatriations through Wootton Bassett ended: we like our soldiers but increasingly we don’t like sending them into harm’s way. In August 2013 the House of Commons rejected the Cameron government’s proposal to take substantive military action against the Assad regime after the chemical weapons attack in Damascus, the moment Obama’s red lines were crossed. The vote “reflects the reality that Britain and the rest of Europe are neither able nor willing to play a substantial role in these other regions that will define the 21st century”, lamented Richard Haass, a senior US diplomat.\n“I get it,” Cameron told the Commons after he lost the Syria vote. This was not simply an admission of political defeat by an exasperated prime minister: it revealed something deeper about the anxieties of elites in this new, emerging era. Britain’s role in the world was changing again. We were not who Tony Blair had believed we were or who Cameron wanted us to be. We were entering not exactly a new age of isolation but our horizons were narrowing. No British politician dared now speak of reordering the world.\n[See also: George Bush’s Iraq War gaffe is unintentionally revealing]\nIn 2006 General Sir Richard Dannatt, Chief of the General Staff of the British Army, warned in a newspaper interview that, through lack of care and investment, the Labour government was undermining the “military covenant” between the nation and its armed forces over issues such as soldiers’ pay, conditions, accommodation and equipment. Blair discussed whether to sack the general after his intervention, but he knew public opinion was turning against him over the number of casualties incurred in wars perceived to have no clear purpose or definition of victory. In his interview, General Dannatt had called for the withdrawal of British troops from Iraq. He knew the mission had failed.\n“The original intention was that we put in place a liberal democracy that was an exemplar for the region, was pro-West and might have a beneficial effect on the balance within the Middle East,” he said. “That was the hope. Whether that was a sensible or naive hope, history will judge.”\nHistory has already judged – and, to paraphrase David Cameron in different circumstances, we get it!\nThe ultimate meaning of the Wootton Bassett repatriations remains ambiguous, however: the ceremonies of mourning venerated the dead soldiers without ever seeking to celebrate or claim as just the wars in which they died. The military was becoming increasingly politicised and British society more militarised – England footballers started wearing red poppies on their national team shirts and the names of the fallen were read out weekly in parliament; but the public was more reluctant than ever to support war-fighting interventions.\nBritain had been humbled and chastened: we were three years away from the Brexit vote. Small wonder then that in August 2011 Cameron mingled at the back of the crowd during the sunset ceremony rather than speak from the podium. For him, as for Blair, it must have felt like “never glad confident morning again”. Or perhaps that realisation finally arrived for Cameron, the insouciant county set charmer, on the morning after the European referendum when he resigned outside Downing Street, bringing an abrupt end to his six-year premiership. “I was absolutely clear about my belief that Britain is stronger, safer and better off inside the EU,” he said. “… But the British people made a different decision to take a different path.”\nAfter the short address, Cameron, whose government had made no preparations in the event of a vote for Leave, turned his back on the assembled media and hummed a tune to himself as he went back inside 10 Downing Street, which he and his family would soon be forced to vacate, his political career finished.\nOne warm afternoon during the years of the repatriations, Reverend Woodhouse was leading an outdoor communion service for three hundred children at a church primary school, just off the high street, when a low-flying RAF Globemaster C-17, a transport aircraft used for operational and humanitarian missions in Afghanistan, appeared above Wootton Bassett. He fell silent and turned to peer up at the brilliant blue sky. The children also fell silent and, as he did, watched the plane gracefully follow the line of the high street as it prepared to land at RAF Lyneham. “I stopped the service and I said, ‘We are just going to turn and look at the sky.’ We watched this plane come across the town and out of sight into Lyneham knowing that about an hour and a half later a body would come past the school.”\nThe service continued but the prayers were affected by what they’d seen, the majestic Globemaster in a cloudless summer sky. “I wonder now if any of those three hundred young people remember that moment as I do, and whether it has had any lasting effect on them,” Thomas Woodhouse said. “It was serendipity – the plane coming in to land at just that moment, everything so still – and incredibly moving.”\nA soldier’s final journey: to come home to England.\nThis is an edited extract from the new edition of Jason Cowley’s “Who Are We Now? Stories of Modern England”, published in paperback on 31 March (Picador)\n[See also: The A-Z of the Iraq War]\nThis article appears in the 15 Mar 2023 issue of the New Statesman, The Iraq Catastrophe",
  "word_count": 8460,
  "scraped_at": "2026-02-14T13:45:12.869602"
}