{
  "article_id": "966fff45c9b3",
  "url": "https://www.mirror.co.uk/3am/celebrity-news/inside-englands-lionesses-sleek-stylish-30726255",
  "title": "Inside England Lionesse sleek and stylish homes and rollercoaster love lives",
  "date": "20230819T113000Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Inside England's Lionesses' sleek and stylish homes and rollercoaster love lives\nAs the Lionesses prepare for their World Cup match against Spain in Australia on Sunday, their plush houses and romantic relationships have hit the headlines\nAs the England Women's Football team gear up for their World Cup match against Spain on Sunday, soccer fans everywhere are desperate for more intel on the talented players – including where they live and who they're dating.\nThe Lionesses don't get to spend much time in their own homes with their busy schedules, but that doesn't mean they've scrimped on personalizing their respective abodes. Many of them live in midsized houses with modern decor and sleek furnishings, suggesting there might be a shared passion for minimalism across the team. A number of the players are also in committed relationships, which likely serve as a solid support for the talented women in their demanding careers.\nAlex Greenwood and Jack O'Connell\nLioness left-back Alex Greenwood is living with partner Jack O’Connell, whom she met as a teenager. The 29-year-old, who previously played for Sheffield, has gushed about his talented girlfriend in the past but has also acknowledged that he's quick to give her constructive feedback and advice.\nShow your support for The Lionesses as they bid to win the World Cup with this Nike away strip. The eye-catching away shirt really stands out with a retro pattern that brings to mind many iconic moments from England's history on the football pitch.\n“Obviously I’m super proud of her,\" Jack told Sky Sports. I’m her biggest critic as well. I think the standards she sets herself, she’s got more to come… I get goosebumps when I speak about it.” Alex has kept most of her home life off social media, but a handful of posts have revealed that she has a cushy grey sofa and white-washed walls in her living room.\nMillie Bright and Levi Crew\nChelsea defender Millie Bright has been in a relationship with Levi Crew, a London-based athletic performance coach, for over three years now. The athletic couple live a quiet life together in a beautiful Surrey house with their two French bulldogs, Zeus and Hera. Millie shared photos of her newly renovated kitchen by Howdens Journey in June, giving fans a tour of its sleek unit complete with a coffee machine and even a pull-out bin for her dogs' food.\nCrew also comes from a highly sporty background, having graduated from Sheffield Hallam University with a Nutrition, Health, and Lifestyle degree in 2014. He played rugby during his college years before embarking on a career in online coaching. Millie has previously hailed her boyfriend on social media, referred to him as a 'king' in a sweet birthday post.\nLauren Hemp and Ellie Butler\nManchester City player Lauren Hemp, 23, has reportedly been dating fellow football star, Ellie Butler, since 2021. While the talented sportswomen have not confirmed their relationship, they have popped up on each other's social media profiles on number of occasions over the past two years. Ellie has posted of photos on Instagram of her at matches cheering for Lauren, who has called the 21-year-old 'her love.'\nKeira Walsh and Lucy Bronze\nLiga F club's Keira Walsh and Lucy Bronze are reportedly also a couple, having been teammates since 2014 when they both joined Manchester City. Their sporting careers have paralleled over the past decade, with both women being signed to the same Barcelona club in 2022.\nNeither Keira, 26, or Lucy, 31, have confirmed their romance, but it's been widely speculated that the two are dating after appearing across each other's social media profiles multiple times over the past few years.\nIt's also understood that Keira and Lucy live together in Manchester with their adorable puppy, Narla. Their spacious kitchen has appeared on their social media accounts in the past, revealing their modern taste and neat nature.\nREAD MORE: FA chief opens door for Sarina Wiegman to replace Gareth Southgate as England managerChloe Kelly\nManchester City forward Chloe Kelly has been in a relationship with boyfriend Scott for over four years. The sporty couple live together in Manchester with their adorable pet dog, Otis. She has previously said she unwinds from her busy training schedule by spending quality time with Scott, who reportedly works as a greenkeeper at a golf club.\nWhile they have yet to give the public an official tour of their home, fans have caught glimpses of its modern design a handful of times in the past. The couple has kept things simple with a grey carpeted staircase and a wrap-around grey sofa, as well as beige walls and and grey floorboards.\nGeorgia Stanway and Olly Ashall-Bott\nAttacking midfielder for the English national team, Georgia Stanway, is another member of the Lionesses currently in a relationship. The 24-year-old has been dating English rugby player Olly Ashall-Bott since 2022, after reportedly first being approached by the English rugby player on Instagram. The couple spend a great deal of time apart due to their busy training schedules, but when they do hang out, they like to go on fishing trips. It's understood they took up the outdoorsy pastime during lockdown, and have continued to take to the lakes and sea together since.\n\"Literally the second time of going, Georgia caught the biggest fish ever - she's so competitive in everything she does,\" Olly told the Times in 2022.\nAs of 2023, Georgia lives in her own apartment in Germany after moving to Bavaria to play for Bayern Munich.\nWant to get your hands on a FREE poster to support the Lionesses? Click here!\nEngland reach World Cup Final: LIVE reaction as Lionesses book final clash with Spain\nNike's England National Team Collection features kits, jackets and much more\nWhere to buy new England Lionesses World Cup 2023 home and away kit",
  "word_count": 972,
  "scraped_at": "2026-02-14T12:56:42.751283"
}