{
  "article_id": "96729ac2213c",
  "url": "https://theathletic.com/5158830/2024/01/01/uswnt-olympics-emma-hayes-newco-2024/",
  "title": "A revitalised USWNT , Olympic ambitions and a new elite structure – what to come in 2024",
  "date": "20240101T094500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "With a record-breaking World Cup, the Women’s Super League breaking away from the FA and drama in qualifying for the Olympics, 2023 was a big year for women’s football.\nBut will 2024 top it? What can we expect from another summer tournament this year? And what will happen now that the WSL and Women’s Championship (WC) are about to change?\nGO DEEPER\nTeam GB, the 2024 Olympics and why failing to qualify matters\nThe Athletic’s Charlotte Harpur, Michael Cox and Chloe Morgan spoke with Sophie Penney about their 2024 moments to look out for on our dedicated women’s football podcast, Full Time Europe.\nAdvertisement\nListen in full to the episode below, on Apple Podcasts and Spotify, or read the edited conversation below…\nSophie Penney: There were a lot of moments in 2023 that will have repercussions for 2024, including the Women’s Nations League (WNL) games, which are acting as qualifiers for the Olympics.\nCharlotte Harpur: I’m looking forward to seeing France compete at the Paris Olympics but things will be really tough for them. They’ve topped their WNL group comprising of Austria, Norway and Portugal, with five wins and a draw. They play Germany in the WNL semi-finals on February 23 and that will be their biggest test so far.\nWhen manager Herve Renard was appointed, he and the French Football Federation agreed on two key objectives: to reach at least the World Cup semi-finals (but they lost to Australia in the quarter-finals) and also to make it to the semi-finals at the Paris Olympics.\nWe know what a home advantage can do — as we saw for England in the 2022 European Championships — so France will be strong contenders, especially since Renard will have more time to embed his philosophy and develop deep personal connections with his squad than he did before the World Cup.\nPenney: With Chelsea manager Emma Hayes moving to the USWNT, do we think they are going to be the main team to watch at the Olympics?\nMichael Cox: They will be better than they were at the World Cup. They lacked any kind of cohesion, identity or footballing nous. They seemed like a bunch of very talented individuals with a few good, young players.\nThey were good in defence — Naomi Girma was the outstanding centre-back of the tournament.\nThey’re going to take a big step forward and it’s exciting to see what Hayes can do with the team. Hayes has been really successful in the WSL but she’s been successful with one team, so seeing her in a different environment is going to be really interesting.\nGO DEEPER\nFull Time: The big questions around Emma Hayes heading to USWNT\nPenney: Hayes leaving will surely have a massive impact on the WSL, too.\nChloe Morgan: It felt like a dark day across the WSL when Hayes’ departure to the USWNT was announced. She’s one of the icons of the game, having been with Chelsea for 11 seasons and winning so much silverware (six WSL titles and five FA Cup titles).\nAdvertisement\nIt’s going to have a big impact on the WSL and the club. Hayes has overseen the careers of so many players — she’s been that consistent, solid person for them and we’ve not seen anything like it in terms of managerial reign in the WSL.\nOff-field, it’s going to be a big loss too. Hayes is one of the people that you go to for a big voice on women’s football issues — for example, the comments from Joey Barton, speaking about improving facilities or pay.\nGO DEEPER\nSilenced, angry and unsupported - the week women in football were attacked\nHayes has also been at the forefront of innovation in the women’s game — Chelsea were one of the first clubs to track players’ menstrual cycles or look at factors contributing to anterior cruciate ligament injuries.\nI don’t doubt she’ll continue to be vocal once she’s in the U.S. I was watching the USWNT Netflix documentary Under Pressure last month and it takes you through every one of their games at the World Cup and how they’re facing much-improved competition. It’s going to be really interesting to see, tactically, how Hayes manages the USWNT when, for the first time, she doesn’t have access to her players week in, week out.\nGO DEEPER\nUSWNT docuseries leaves World Cup revelations behind, focuses on players' humanity\nPenney: Do you think there will be a lot of change at Chelsea?\nHarpur: The foundations will stay consistent. General manager Paul Green, who has been a pillar for Chelsea (having been at the club since 2013), will be staying. There’s huge security for the club in terms of recruitment but also short- and long-term plans.\nGreen took over media duties when Hayes was ill (undergoing an emergency hysterectomy in October 2022). Assistant manager Denise Reddy is likely to work with Hayes for the USWNT, so that will bring about a big change in the coaching staff.\nWe don’t know whether more staff will go with Emma, but a new manager is going to have to get on board with the Chelsea philosophy. The character, their leadership style and recruitment will depend on what the club want.\nAdvertisement\nIt will be interesting to see what the players do. Guro Reiten has just signed a new contract until 2025 (with an option to extend to 2026). If one player signs, that encourages more players to sign. But we know that Sam Kerr and Fran Kirby are out of contract and Hayes is a big pull factor.\nChelsea have time, but they have to get it right. They need to find someone who is tactically astute and knows the game well, but who is personable and can treat players as individuals.\nWe know that Kerr needs different instructions and a different management style from Lauren James, for example. A lot of change and uncertainty is on the horizon for Chelsea.\nCox: Reiten was one of the best players in the WSL last season, coming up with some important goals in key moments. Her staying on is a big deal for Chelsea.\nIt’s a good thing that Hayes is moving on. She’s been so successful and so dominant. But, at a time when the women’s game has grown massively, there’s a danger that just one person can come to dominate the entire sport and take all the attention.\nShe’s been so successful in the WSL and has also been a commentator for a lot of the Lionesses games, it almost feels as if the rise of women’s football is starting to be inextricably linked with Hayes. It’s good to refresh the league.\nThey’re big boots to fill and whoever comes in at Chelsea will have a difficult job, but it may also make the league a bit more competitive if Chelsea drop off…\nPenney: Could it be a bad thing if Chelsea become less competitive since they’re driving the standards, pushing other teams up to that level?\nCox: It’s really important to have balance. When you’ve had one team winning the WSL for years in a row, there’s a danger of the whole sport being concentrated around one or two teams.\nFor the league to get better, we need other sides to have more of a chance at competing. You want to see Aston Villa, Liverpool or Tottenham Hotspur with a chance of winning the league.\nIf you’re trying to get new fans involved and they support a team who is just going to finish fifth or sixth every year, there’s a risk they drift away from the game.\nAdvertisement\nPenney: The WSL and WC are about to come under new owners next season with NewCo taking over — what’s going to happen?\nHarpur: NewCo is short for ‘new company’ and is a working title at this stage. In July 2022, it was announced that the WSL and WC would transition from being solely owned by the Football Association (FA) to being an independent entity, somewhat like the Premier League. NewCo will be the company that runs the professional women’s game.\nThe negotiations for the formation of NewCo were fraught. The WSL wanted the majority say in the commercial deals, structure etc. The WC clubs were fighting to get a foot in the door.\nGO DEEPER\nWhat must change in the new WSL era: 'Fans don't know whether they're coming or going'\nMorgan: At this stage, all we really know is that WC clubs will receive 25 per cent of the revenue and the WSL clubs will receive 75 per cent. The money the WC clubs receive will definitely boost the amount of money they can pay players and use to upgrade the facilities. Some of the WC clubs are playing in grounds that are difficult to access.\nA priority should also be improving the quality of the FA Player (the FA’s online match-streaming portal) so that more WC games can be shown, to help attract audiences. I’d love to see the WC get more recognition because it is part of the wider professional infrastructure.\nThe WC feeds into the WSL and is a good source of homegrown talent and a way for young WSL players to get game experience. Manchester City goalkeeper Khiara Keating was on loan at Coventry in the WC not so long ago and now she’s City’s starting goalkeeper.\nIt’s a good product and needs to be viewed as such in its own right.\nHarpur: There’s also been a lot of discussion around sorting a fixed broadcast slot for the women’s game. The men’s TV schedule is saturated but there is conversation about whether the Saturday 3pm blackout will be wiped for the women’s game.\nAdvertisement\nThere have also been calls for expanding the league, but I’d be hesitant to expand it too much because you want to ensure that there’s consistency and certain standards. Expanding the league would mean more games and content, which would most likely lead to being able to negotiate a better TV rights deal (which is going out to tender in early 2024).\nThe NewCo CEO Nikki Doucet is a former investment banker with a big task on her hands. But she’ll also have a new board to help her.\nCox: I’d like to see stricter limits on squad sizes. There’s a real danger that some of the big clubs will hoard players who then end up not playing that much. If you look at Arsenal’s squad — they’ve had a lot of long-term injuries so they’ve had to invest in new players, but they’ve got 26-27 really good quality players who are just not going to see any action if everyone is fit.\nHarpur: Same for Chelsea. You’ve got to guard against overplaying players and preventing injuries, but it’s not a good situation where some of the players who aren’t even making the bench could easily start for a mid-table WSL side.\nGO DEEPER\nWith Hannah Hampton joining Chelsea, why are they the only WSL side to have five goalkeepers?\nWe have to be careful that not all the attention and success is going to the four biggest clubs. We want to attract people to support West Ham or Tottenham but that will be difficult if they only have access to third-tier players because the second-tier players are backups for the big clubs.\nGO DEEPER\nVlatko Andonovski interview: 'A moment there that I was like, ‘Do I really love this game anymore?'\n(Top photo: Harriet Lander – Chelsea FC via Getty Images)",
  "word_count": 1921,
  "scraped_at": "2026-02-14T12:22:30.933622"
}