{
  "article_id": "968707d3b69c",
  "url": "https://www.thenationalnews.com/business/2025/06/03/ibm-and-inclusive-brains-team-up-to-develop-mind-controlled-computing/",
  "title": "IBM and Inclusive Brains team up to develop mind - controlled computing",
  "date": "20250603T074500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A new partnership between IBM and Inclusive Brains could bring mind-controlled computing closer to everyday use.\nBy combining artificial intelligence, quantum computing and non-invasive neurotechnology, the companies aim to redefine how the brain communicates with devices.\nIt was announced on Tuesday that the tech giant and the French neurotechnology start-up, which specialises in non-invasive brain-machine interfaces (BMIs), have entered a joint study agreement to explore how advanced technology can improve the classification of brain activity patterns.\nThe study will use IBM’s Granite foundation models to “generate and review code, to then create benchmarks to test hundreds of thousands of machine learning algorithmic combinations, in order to help identify the most efficient algorithms for classification and interpretation of one’s brain activity”, it said.\nThe study will also explore the use of quantum machine learning techniques to classify brain activity, as well as methods for automatically selecting the most effective algorithms tailored to each person. These algorithms will be used to support “mental commands” – actions triggered without speech or physical movement – to control digital workstations.\nUnlike invasive devices such as Elon Musk’s Neuralink or Synchron, which recently partnered with Nvidia and requires surgical implants, Inclusive Brains’ multimodal interface interprets brainwaves, facial expressions, eye movements and other physiological signals to infer intent and translate it into action.\nThe research marks a step towards building more adaptive interfaces for users with disabilities, as well as those working in cognitively demanding environments.\nThe results from the study will be published as open science to support wider research and public understanding.\nThe collaboration also draws on existing ethical guidelines for the use of neurotechnology and neural data, including frameworks previously endorsed by IBM.\n“We are particularly proud to engage with innovative start-ups such as Inclusive Brains and to contribute to a technology that supports advancing health care for the benefit of the general population, by providing access to IBM’s AI and quantum technologies in a responsible manner,” said Beatrice Kosowski, president of IBM France.\nProf Olivier Oullier, chief executive and co-founder of Inclusive Brains, said: “Our joint study with IBM will help Inclusive Brains develop technology for deeply personalised interactions between machines and their users.\n“We're transitioning from the era of generic interfaces to that of bespoke solutions, crafted to adapt to each individual's unique physicality, cognitive diversity and needs.”\nThe announcement also notes Prof Oullier’s new academic role as visiting professor in the department of human-computer interaction at the Mohamed bin Zayed University of Artificial Intelligence in Abu Dhabi.\nInclusive Brains has been testing its systems in medical settings. In partnership with orthopaedic surgeon Dr Sebastien Parratte, of the International Knee and Joint Centre in Abu Dhabi, its Prometheus BCI interface has been used in operations to “provide real-time measures of the level of stress, attention and cognitive load of the surgeon\".\nThe aim is to evaluate how such data might support concentration and reduce errors in high-pressure environments.\nThe company has demonstrated its technology publicly, including when a woman with physical and cognitive impairments controlled a robotic arm to allow her to carry the Olympic torch in France last year. The technology was also used to send a tweet to French President Emmanuel Macron and contribute a text amendment to a bill in the French Parliament.\nFounded by Prof Oullier and Paul Barbaste, Inclusive Brains develops interfaces that respond to the physical and cognitive characteristics of users. Its current research explores how such systems could help with decision making and concentration, and reduce strain from prolonged use of technology.",
  "word_count": 587,
  "scraped_at": "2026-02-14T12:11:23.302933"
}