{
  "article_id": "96b53de8a437",
  "url": "https://www.bbc.co.uk/sport/football/65452423",
  "title": "Arsenal proud despite  hurt  from late Wolfsburg defeat in Women Champions League semi - final",
  "date": "20230502T054500Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal proud despite 'hurt' from late Wolfsburg defeat in Women's Champions League semi-final\n- Published\nConceding a goal in the final seconds of extra time in their Women's Champions League semi-final was a crushing blow for Arsenal, but amid the hurt was a sense of immense pride for manager Jonas Eidevall.\nArsenal have had to show resilience in abundance this season, defying the odds to reach the last four after injuries to key players threatened to derail their European challenge much earlier.\nThey lost captain Kim Little, defender Leah Williamson and forward Caitlin Foord in recent weeks, having begun the new year without key strikers Beth Mead and Vivianne Miedema because of anterior cruciate ligament (ACL) injuries.\nSo when they lined-up at Emirates Stadium on Monday night with tired legs and a thin bench, Arsenal knew it was a tall order to beat two-time champions Wolfsburg for a place in the final.\nHowever, having come from behind to beat Bayern Munich in the quarter-finals, then again to draw 2-2 with Wolfsburg in the first leg of their semi-final, belief remained.\nWhat followed was a dramatic 120 minutes - both teams scored twice in normal time, before Wolfsburg substitute Pauline Bremer crushed Arsenal hearts with a winner in the final seconds of extra time to put them through 5-4 on aggregate.\n\"It's tough, no doubt about it,\" said Eidevall. \"It was a game of such fine margins that were not on our side.\n\"We are allowed to be hurt and feel empty, but we're also allowed to feel proud of the performance and the occasion with our supporters. There is a lot of emotions in the brain.\"\nWinger Katie McCabe added: \"I'm quite speechless. I'm just so proud of the girls. We gave absolutely everything out there. We ran for each other, we walked for each other, we came back into the game.\n\"We've instilled that belief that we can challenge and go on in these sorts of tournaments.\"\n'We made it the tightest of margins despite injuries'\nArsenal had the support of the vast majority of 60,063 fans at Emirates Stadium - a record crowd for a domestic women's game in England.\nBut there was a collective intake of breath when defender Lotte Wubben-Moy lost possession on the edge of her own box in the final seconds of extra time, gifting Wolfsburg an opportunity to score, which they gladly took.\nWubben-Moy looked understandably distraught at full-time as she joined team-mates in a lap of the Emirates to applaud their support.\n\"I told [Wubben-Moy] to keep her head high. I told her there is no need to apologise. Mistakes happen in football,\" said Eidevall.\n\"We are there for each other. We learn. Sometimes attackers also do mistakes. It's part of the game. She was absolutely fantastic. She has been lately as well. We are there for each other.\"\nWubben-Moy's costly mistake was one of several key moments in a game which swung in momentum and could have been won by either team.\nThe video assistant referee (VAR) intervened on three occasions - denying Wolfsburg a penalty for a potential handball by Wubben-Moy in the opening two minutes, ruling out Stina Blackstenius' goal after the restart, and confirming Jen Beattie's late equaliser.\nArsenal's McCabe also hit the crossbar in extra time after Lina Hurtig was denied from close range, while Wolfsburg's Bremer could have scored minutes earlier than she did.\n\"You can make up a narrative of knowing the results but I prefer not to do that. It is small margins,\" said Eidevall.\n\"It has to be a very tight offside, a very close free-kick on that corner when they scored, a close situation with Lina [Hurtig's] opportunity in extra time.\n\"Sometimes it goes against you and it's terrible. That's sport. I like to look at it in the way that we got to a Champions League semi-final and we made it the tightest of margins with all the injuries we had.\n\"I am so proud of the staff and players that we were able to do that.\"\n'Tough' to qualify for next season\nAttention must now turn back to the Women's Super League (WSL) where Arsenal remain in a battle to qualify for next season's Champions League.\nOnly the top three in England will compete in Europe and Arsenal sit fourth, two points behind Chelsea, having played one game more.\nWith injuries still to contend with - substitute Laura Wienroither adding to the concern when stretchered off after just 18 minutes of action against Wolfsburg - it does not get any easier for Arsenal.\n\"We need to try and qualify for the competition next season,\" said Eidevall. \"It's a tough WSL. We're in a tough situation to get our feet and heads back from here.\n\"We're hurting but we have a really important game against Leicester [on Friday]. If that can be the standard for how teamwork can be applied then that is a really good foundation.\n\"We need to finish this WSL season as strong as possible. We have done some great things this season but I am always thinking to the next game. We need to push.\"\nWhich pair will finish first? A frenetic race across Canada without phones and flights\nBound by fate, a car accident and a dog! A warm-hearted Aussie rom-com about a flawed, funny couple getting it all utterly wrong",
  "word_count": 895,
  "scraped_at": "2026-02-14T12:21:57.787003"
}