{
  "article_id": "970e6e28195f",
  "url": "https://www.wsjm.com/2024/02/12/mahomes-earns-mvp-after-throwing-game-winning-td-pass-in-overtime-kc-wins-25-22/",
  "title": "Mahomes earns MVP after throwing game winning TD pass in overtime ; KC wins 25 - 22 – ",
  "date": "20240212T114500Z",
  "domain": "wsjm.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NFL – National Football League – Super Bowl\nSunday\nSuper Bowl LVIII, Allegiant Stadium, Las Vegas, NV\nKansas City Chiefs 25, San Francisco 49ers 22 – OT\nChiefs 25, 49ers 22 – OT – Mahomes rallies Chiefs to second straight Super Bowl title, 25-22 over 49ers in OT\nPatrick Mahomes, Travis Kelce and Andy Reid have made the Kansas City Chiefs a dynasty. They’re already thinking three-peat. First, they had to become the NFL’s first back-to-back Super Bowl champions in 19 years. Mahomes made sure of it, leading another super comeback on the NFL’s biggest stage in America’s showcase capital. Mahomes threw a 3-yard touchdown pass to Mecole Hardman in overtime, and the Chiefs rallied to beat the San Francisco 49ers 25-22 on Sunday, becoming the NFL’s ninth repeat Super Bowl champs. With pop star Taylor Swift watching boyfriend Kelce from a suite, the Chiefs captured their third title in five years and joined some of the league’s greatest franchises. The NFL’s first Super Bowl in Las Vegas was a sloppy, mistake-filled affair that was mostly boring until the back-and-forth fourth quarter and OT. It was the second of 58 Super Bowls to be tied after regulation, and the first played under new overtime rules that ensured both teams got the ball. The Chiefs (15-6) trailed 22-19 after Jake Moody kicked a 27-yard field goal on the first possession of overtime, but Mahomes rallied the Chiefs, completing another impressive comeback in a rematch of the Super Bowl four years ago. Mahomes wasn’t at his best early and threw an interception. But with the game on the line, he was a magician once again. He finished 34 of 46 for 333 yards and two TDs. Mahomes, to no ones surprise was named MVP, it’s the third time the Chiefs quarterback has won the award.\nNFL – Taylor Swift kisses Travis Kelce on the field after his Chiefs beat the 49ers\nTaylor Swift keeps finding herself on the winning side. She kissed boyfriend Travis Kelce on the field after his Kansas City Chiefs won the Super Bowl over the San Francisco 49ers. And she celebrated with his family and many of her famous friends including Blake Lively and Ice Spice when the CHiefs scored the winning touchdown in overtime. Swift had to fly halfway around the world to make it to the game in Las Vegas after a series of concerts in Tokyo. Right before that, she won album of the year for a record fourth time at the Grammys.\nNFL – 49ers’ decision to take the ball first in overtime will be debated for a while\nSan Francisco’s decision to take the ball first in overtime of the Super Bowl will be debated for a while. The 49ers drove for a field goal, then lost 25-22 when Patrick Mahomes guided Kansas City 75 yards the other way for the winning touchdown. San Francisco’s drive ended when the 49ers kicked a field goal on fourth-and-4 from the 9. If they’d known three points wouldn’t be good enough, they could have gone for a touchdown in that spot. Instead it was the Chiefs who knew exactly what they needed to do to win the game.\nNFL – Super Bowl ads keep it heavy on the celebrities, light on the politics\nThe Kansas City Chiefs were crowned victorious over the San Francisco 49ers in this year’s Super Bowl — and, off the field, big-name advertisers competed for viewers’ attention with celebrity-filled, glitzy messages. Airing a Super Bowl commercial is no easy feat. On top of the reported $7 million price tag for a 30-second spot during the game, brands enlist the biggest actors, invest in dazzling special effects and try to put together an ad that more than 100 million expected viewers will like — or at least remember. On Sunday, scores of advertisers tapped into light humor and nostalgia to give game breaks a mostly “feel good” energy. Still, there were also a few serious and somber moments.\nNFL – Review: Usher shines at star-studded 2024 Super Bowl halftime show\nUsher emerged at Las Vegas’ Allegiant Stadium for the 2024 Super Bowl halftime show, an immediate confirmation of his position as the ideal halftime performer: one with timeless, well-known hits, masterful choreography, and a devoted audience. He started with “Caught Up,” moving into “U Don’t Have to Call,” \"Superstar,” and “Love in the Club.” Then Alicia Keys joined in front of bright red piano for her song “If I Ain’t Got You,” which morphed into “My Boo,” Usher losing a glove in an apparent tribute to Michael Jackson — notable for a performance during Black History Month. “They said I wouldn’t make it,” he told the crowd, dedicating the set to his “mama.”\nNFL – Despite loss, Niners early favorites to win next season, Lions 4th best odds\nDespite a crushing Super Bowl loss, the 49ers are favorites to be next year’s NFL champions. San Francisco has +450 odds to get its record-tying sixth Super Bowl title next season, per FanDuel Sportsbook. The Chiefs, seeking a three-peat, are next at +750, followed by the Ravens (+900), Lions (+1200) and Bills (+1200).\nNBA – National Basketball Association\nTonight\nIndiana Pacers at Charlotte Hornets, 7:00 p.m.\nChicago Bulls at Atlanta Hawks, 7:30 p.m.\nNCAAWBB – Women’s College Basketball\nYesterday\n(12) Notre Dame 98, Florida State 94 – 2 OT\n(5) Ohio State 86, Michigan State 71\n(12) Notre Dame 98, Florida State 94 – 2 OT – Citron, Watson deliver in 2nd overtime\nSonia Citron scored seven of Notre Dame’s 10 points in the second overtime period, Kylee Watson came up with a key steal in the final seconds and the No. 12 Fighting Irish finally finished off a 98-94 come-from-behind victory against Florida State. Citron hit a 3-pointer to give Notre Dame a 91-90 lead and later hit a fastbreak layup to tie it at 93. The score was tied at 94 through much of the final minute before Citron drew a foul on Ta’Niya Latson with 4 seconds left. Citron made both free throws for a 96-94 lead. Watson was credited with the steal when she knocked the ball away on the FSU inbounds and Hannah Hidalgo grabbed it, was fouled and made 2 free throws to finish it.\n(5) Ohio State 86, Michigan State 71 – Taylor helps No. 5 Ohio State rout Michigan State 86-71\nCeleste Taylor scored 20 points to lead four players in double figures as No. 5 Ohio State rolled to an 86-71 win over Michigan State on Sunday. Rebeka Mikulasikova added 19, Jacy Sheldon 18 and Taylor Thierry 12 for the Buckeyes (21-3, 12-1 Big Ten), who led by as many as 33 points in the second half. Theryn Hallock had 18 points and Julia Ayrault 10 for Michigan State (17-7, 7-6).\nGolf – Nick Taylor wins Phoenix Open with birdie on 2nd hole of playoff\nNick Taylor made an 11-foot birdie putt to beat Charley Hoffman on the second hole of a playoff after birdieing three of the last four in regulation Sunday, capping another wild week at the Phoenix Open with his second memorable victory. Taylor closed with a 6-under 65 to reach 21-under 263, with the 35-year-old Canadian forcing the playoff with a 9-foot birdie putt on the par-4 18th. Both players birdied the extra hole and hit the green on No. 18 a second time, and Taylor birdied the hole for the third time in less than an hour. He won his fourth PGA Tour title. Last year, he took the Canadian Open with a 72-foot eagle putt on the fourth extra hole.\nMHSAA – Michigan High School Athletic Association\nSaturday\nBoys Basketball\nPortage Central 71, Brandywine 64\nTonight\nBoys Basketball\nEdwardsburg at St. Joseph, 7:00 p.m.\nOur Lady of the Lake at Covert, 7:30 p.m.\nFennville at Michigan Lutheran, 7:30 p.m.\nBuchanan at Eau Claire, 7:15 p.m.\nLawton at Cassopolis, 7:30 p.m.\nMuskegon Heights at Saugatuck, 7:00 p.m.\nMuskegon West Michigan Christian at Kalamazoo Christian, 7:00 p.m.\nGirls Basketball\nMichigan Lutheran at Dowagiac, 6:30 p.m.\nKalamazoo Hackett at Our Lady of the Lake, 6:00 p.m.\nBridgman at South Haven, 6:30 p.m.\nCassopolis at Brandywine, 7:00 p.m.\nComstock at Fennville, 7:00 p.m.\nLawton at Allegan, 7:00 p.m.\nLoy Norrix at Williamston, 7:00 p.m.",
  "word_count": 1380,
  "scraped_at": "2026-02-14T12:41:13.591344"
}