{
  "article_id": "971072a1c551",
  "url": "https://freerepublic.com/tag/*/index?more=4363884",
  "title": "Latest Articles",
  "date": "20260125T193000Z",
  "domain": "freerepublic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Search:\nKeywords\nUsers\nTitles\nYahoo\nHome·\nSettings·\nBreaking ·\nFrontPage ·\nExtended ·\nEditorial ·\nActivism ·\nNews\nPrayer PrayerRequest SCOTUS ProLife BangList Aliens HomosexualAgenda GlobalWarming Corruption Taxes Congress Fraud MediaBias GovtAbuse Tyranny Obama Biden Elections POLLS Debates TRUMP TalkRadio FreeperBookClub HTMLSandbox FReeperEd FReepathon CopyrightList Copyright/DMCA Notice\nMonthly Donors · Dollar-a-Day Donors · 300 Club Donors\nor by or by mail to: Free Republic, LLC - PO Box 9771 - Fresno, CA 93794\n-\nKristi Noem: Walz And Frey Are Trying 'To Lie About What Actually Unfolded' In Alex Pretti Killing\nAt a press briefing on Saturday, DHS Sec. Kristi Noem defended the actions of federal agents killing Alex Pretti in Minneapolis, Minnesota, and slammed Democratic leaders for their response to it. -\nAG Pam Bondi sends a strongly worded letter to Minnesota Gov Walz\nIn a letter to MN Gov. Tim Walz (D) Saturday, Bondi claimed that Walz could “restore the rule of law” by complying with a list of demands, including giving the Department of Justice (DOJ) the state’s voter registration records. @JasonWhitely -\n'Our Children Are In Trauma': Tim Walz Lays Into ICE\nDuring a press conference on Saturday, Gov. Tim Walz (D-MN) criticized ICE. -\nWoman arrested in connection with investigation into arson at Comal County Republican Headquarters [photo - yuck]\nNEW BRAUNFELS, Texas – A woman has been arrested in connection with an investigation into arson at the Comal County Republican Headquarters, according to the City of New Braunfels. Grace Carol Brown, 21, was taken into custody on Thursday for burglary of a building and arson, a news release said. She was later booked into the Comal County jail on a $200,000 bond. New Braunfels police officers and fire officials had responded around 1:15 p.m. on Jan. 14 to the Comal County Republican Headquarters, located in the 200 block of Landa Street. The release said that employees found that... -\nMore \"Most Wanted Fugitives\" Captured Under Trump [semi-satire]\nFBI Director Kash Patel announced that \"the FBI has captured more of this country's 'most wanted fugitives' in the last year than were captured during the whole four years Biden was president.\" Christopher Wray, the FBI Director appointed by President Trump and retained by President Biden until the end of his presidency, called Patel's comparison \"unfair. We could've easily racked up many more arrests of the most wanted over the four years Biden held the office, but we were given different priorities. President Biden made it clear that our top priority was to go after what was then the former... -\nBREAKING: ICE MURDERS AGAIN in Minneapolis Amid Growing PROTESTS\nBREAKING NEWS: ICE agents have shot and killed another person in Minneapolis. I was interviewing Minnesota AG Keith Ellison when it happened and he explains why it has become an absolute necessity for the “invasion of the Twin Cities by federal agents” to come to a stop. -\nYou knew Hutchinson was lying, despite that…\": Jim Jordan tears into Jack Smith over Trump probes.\nJim Jordan tears into Jack Smith over Trump probes. It shows House Judiciary Committee Chair Jim Jordan (R-OH) aggressively questioning or criticizing former Special Counsel Jack Smith during what appears to be a congressional hearing or committee session. Jordan frames the various investigations into Donald Trump (including those by Jack Smith, Fani Willis, Alvin Bragg, the Mueller probe, impeachments, etc.) as part of a long-running, politically motivated campaign by Democrats against Trump since 2016. Key points from Jordan's remarks in the video: He accuses officials of using questionable tactics, like relying on Cassidy Hutchinson's testimony (e.g., the alleged incident where... -\nFlorida Rep. Maxwell Frost Assaulted at Sundance Film Festival After Being Told Trump Was ‘Going to Deport’ Him\nevent. “Last night, I was assaulted by a man at Sundance Festival who told me that Trump was going to deport me before he punched me in the face,” Frost wrote on Instagram on Jan. 24. “He was heard screaming racist remarks as he drunkenly ran off. The individual was arrested and I am okay.” -\nThe Countdown to Iran’s Liberation Has Begun\nPeace talk aside, the ticking in Iran isn’t diplomacy—it’s a death-rattle, as a murderous regime nears judgment and a brutal people pray that liberation, at last, is real.In my column last week about the situation in Iran (“The Fog of Prewar in Iran”), I wrote:Many commentators, noting Trump’s oft-proclaimed desire for “peace on earth,” believe he has paused to see if negotiations with Iran might end the slaughter. I doubt it. Trump’s desire for peace is perfectly genuine. But I note that the last time he said he wanted “peace on earth” was when he was asked whether he had... -\nDeal with the Devil: How Canada's new partnership with China could backfire\nCanadian Prime Minister Mark Carney’s new plan to cozy up to Beijing betrays his calls to preserve the “international order” he says is under threat from Donald Trump, and Canada’s economic dependence on the United States may cause his plan to backfire. In a speech to the global elite at Switzerland’s Davos resort town this week, Carney warned attendees that the “rules-based order” established by the United States and its allies in the wake of the Second World War is fraying amid the reemergence of great power conflict–principally the rivalry between China and America. “Every day we’re reminded that we... -\nMajor sign of how bad winter storm will be: Waffle House locations close across the South\nWaffle House locations across the South locked their doors in a rare move as a monster winter storm threatens much of the country this weekend — a stark warning of the havoc to come. The 24-hour Southern breakfast chain, famous for rarely closing in bad weather, shut down its griddles as locations in South Carolina, Tennessee, Georgia and Mississippi went into a “Code Red” Saturday as Winter Storm Fern barrels across the Midwest and East Coast, multiple outlets reported. In South Carolina — where the incoming system has prompted its first ice storm warning since 2005 — Waffle House employees... -\nSouth Dakota Bill to Allow Gun Silencers as “UN-Controlled Weapons” Introduced\nSouth Dakota – SB 2 has been introduced in the South Dakota legislature. It removes silencers from the list of “controlled weapons” in the state statutes. This bill effectively removes state regulation of silencers, but not federal regulation. From sdlegislature.gov: Introduced by: Senator Crabtree: An Act to provide that a firearm silencer is not a controlled weapon. The Bill removes silencers from the definition of “Controlled weapon”. The definition is Section 1. § 22-1-2 (8). The bill creates a new definition which removes silencers. Here is how the new definition would read:(8) “Controlled weapon” includes machine gun and short shotgun... -\nWe Infiltrated Private Anti-ICE Groups. This Is What We Found | Ep. 1716\nToday on the Matt Walsh Show, who are the left wing radicals showing up all over the country to obstruct, harass, and assault ICE? Where do they come from? How do they organize? Who is funding them? I sent my producers into their groups and their Signal chats to find out the answers. I’ll tell you what we discovered. Also, thanks to IVF a rapidly increasing number of single women are having children in their 40s. Is this a positive development for mankind? And a Chinese dissident says that the population of China might be half of what we’ve been... -\nSenate Democrats threaten to block DHS funding bill after another person killed in Minneapolis\nWASHINGTON — A sweeping government funding package is facing new hurdles in the Senate after another person was shot and killed by a federal officer on Saturday in Minnesota, raising the specter of a potential shutdown next Friday at midnight.The legislation needs 60 votes to secure passage in the chamber, where Republicans control 53 seats. And a number of key Democrats who have voted for recent appropriations measures said they’ll vote against funding the Department of Homeland Security unless restrictions are put on how immigration officers carry out enforcement operations.The package, which has passed the House, is slated to come... -\nFormer Vikings captain says Minnesota liberals resist ICE because 'we're deporting their voters'\nFormer Minnesota Vikings captain and University of Minnesota football player Jack Brewer spoke out against the anti-ICE agitators in his state. Unrest erupted in and around Minneapolis on Saturday after a Border Patrol agent fatally shot one of the agitators. Brewer called out the state's liberal leadership for inciting the unrest, arguing the Democrats are opposed to ICE because the agency is \"deporting their voters.\" \"We’re deporting their voters. That’s part of what’s happening and it’s blowing up their whole plan,\" Brewer told Fox News Digital. \"You can’t allow people to come into your country who don’t carry the same... -\nWinter storm doesn't disprove climate change, despite Trump's claim. Scientists explain why.\nPresident Trump cited a major winter storm forecast to impact about two-thirds of the United States as evidence to suggest that global warming does not exist, repeating a misleading claim that has been consistently debunked by climate experts. In a Truth Social post on Friday, he said, \"Record Cold Wave expected to hit 40 States. Rarely seen anything like it before. Could the Environmental Insurrectionists please explain — WHATEVER HAPPENED TO GLOBAL WARMING???\" Climate scientists say Mr. Trump's statement conflates short-term weather trends with long-term climate changes. The unusually cold air spilling into the United States is an example of... -\nJames Talarico : Our southern border should be like our front porch. There should be a giant welcome mat out front and a lock on the door.\nJames Talarico : My family is from the border. My mom grew up in Laredo, Texas. Our southern border should be like our front porch. There should be a giant welcome mat out front and a lock on the door. We can welcome immigrants who want to live the American dream. We can build a pathway to citizenship for those neighbors who have been here, making us richer and stronger. And we can keep out people who mean to do us harm. -\nFederal judge questions Trump authority on White House ballroom project\nAs President Donald Trump aims to build a ballroom at the White House, federal Judge Richard Leon on Thursday reportedly asked Justice Department lawyers to point to what authority allows the president to engage in a construction project at the White House. \"Where do you see the authority for the president to tear down the East Wing and build something in its place?\" the judge asked, according to The Washington Post. While the outlet reported that Leon said he could issue a decision next month, NBC News reported that the judge promised that he would issue a decision in February.... -\nSen. Amy Klobuchar says she will vote against DHS funding\nWASHINGTON — Sen. Amy Klobuchar, D-Minn., said in an interview on NBC News' \"Meet the Press\" that she will not vote for Department of Homeland Security funding after the latest fatal shooting of an American by a federal agent in Minneapolis. \"When they're killing two constituents in my state, and they're taking two-year-olds out of the arms of their mom, and they are taking an elder Hmong man out of his house and putting him out there in his underwear, and then figuring out they have the wrong man,\" Klobuchar told \"Meet the Press\" moderator Kristen Welker. \"No, I am... -\nHow did the Greeks and Romans count Years? [7:52]\nThe AD/CE system we use to date the year was introduced - more or less by accident - during the Middle Ages. Before its invention, the classical world used a wide range of dating systems. How did the Greeks and Romans count Years? | 7:52 toldinstone | 615K subscribers | 435,313 views | December 31, 2021\nBrowse by Forum\nGet Connected! Join Free Republic Today!\nAlready a Member? Log into your Free Republic account.\nBreaking News (News/Activism)\n- Dear FRiends, our FReepathon has fallen way behind. Please get your donations in as soon as you can. Thank you and God bless.\n- Sunday Morning Talk Show Thread 8 February 2026\n- The MAGA/America 1st Memorandum ~~ February 2026 Edition\n- Senate strikes deal to avert partial shutdown\n- US Border agents shoot two people in Portland, city officials say\n- Minnesota Gov Tim Walz to suspend re-election campaign amid Somali fraud scandal: report\n- One in custody after incident at Ohio home of JD Vance\n- Caracas, VenezuelaJanuary 3, 2026 6:30 AMUpdated: January 3, 2026 1:12 PMU.S. captures Venezuela's leader and his wife in a stunning operation and plans to prosecute them\n- President Trump says Maduro and his wife have been captured. A news conference will be held at 11 A.M\n- The MAGA/America 1st Memorandum ~~ January 2026 Edition\n- More ...\nFront Page News (News/Activism)\n- 'You exposed him to real danger': Father goes nuclear on school board after teachers sent his son to ICE protest\n- House passes SAVE America Act, sending Trump-backed election bill to the Senate\n- Trump set to gut US climate change policy and environmental regulations: White House official\n- Less than 14% of those arrested by ICE in Trump's 1st year back in office had violent criminal records, document shows\n- Lawler: ‘Not Realistic’ to Kick Out Over 25 Million Undocumented People\n- Fact Sheet: President Donald J. Trump Ensures Affordable Beef for the American Consumer\n- Democrats fear body cameras could be ICE’s new mass surveillance tool\n- Migrant, 70, who told girl, 12, to 'cover her head' before sexually assaulting her on way home from school is spared jail\n- Associated Press Complains That Winter Olympics Teams Are ‘Overwhelmingly White’\n- Appeals court sides with Trump admin with mass detention ruling\n- More ...",
  "word_count": 2304,
  "scraped_at": "2026-02-14T14:22:01.831383"
}