{
  "article_id": "974620db6f16",
  "url": "https://www.timeout.com/london/news/one-of-englands-lionesses-will-get-their-own-madame-tussauds-waxwork-and-you-can-choose-which-one-082323",
  "title": "One of the England Lionesses Will Get a Madame Tussauds Waxwork",
  "date": "20230823T141500Z",
  "domain": "timeout.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "[title]\nThe Lionesses did us proud on the weekend when they were the first English team to make it to a World Cup final since 1966. And while there were more divers in the Spanish team than an Olympic swimming pool, our girls still played a corker and we’re welcoming them home with open arms.\nTo commemorate their achievements in the 2022 Euros and the Australia World Cup, Madame Tussauds is creating a waxwork of one of the players, and it’s up to the public to decide who.\nThere are eight players to choose from, including England manager Sarina Wiegman. Will it be Chloe Kelly whipping her football shirt around her head? Or Lauren James booting the ball? Or perhaps Mary Earps screaming ‘F**K OFF’?\nTim Waters, general manager at Madame Tussauds London, said: ‘Like the rest of the nation we’re incredibly proud of the Lionesses. Not only for their success at the FIFA Women’s World Cup this year, but for their momentous win in Europe last year and all they have done for their sport -bringing women’s football roaring into the mainstream. They inspire and encourage so many, and we feel it’s only right what they have achieved is commemorated so we’re going to do that in the way that only Madame Tussauds London can.\n‘The whole team have been outstanding, and they all brought so much to the World Cup, which makes it really difficult for us to pick who our expert artists should create. That’s why we’re putting it to the public, to help us decide who we should choose.’\nTo decide, you can cast your vote on the Madame Tussauds website up until September 8. The results will be announced within the next year.\nTime Out’s brilliant new podcast, ‘Love Thy Neighbourhood’, is out now. Listen to the fourth episode with Paul Chowdhry here.\nStay in the loop: sign up for our free Time Out London newsletter for the best of the city, straight to your inbox.",
  "word_count": 331,
  "scraped_at": "2026-02-14T13:04:12.120252"
}