{
  "article_id": "975fe46eddf3",
  "url": "https://timesofindia.indiatimes.com/entertainment/english/music/news/wife-of-rams-quarterback-kelly-stafford-expresses-she-was-tired-of-taylor-swift-being-the-focus-at-the-chiefs-games/articleshow/114870733.cms",
  "title": "Wife of Rams quarterback Kelly Stafford expresses she was tired of Taylor Swift being the focus at the Chiefs Games |",
  "date": "20241102T051500Z",
  "domain": "timesofindia.indiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- News\n- entertainment\n- english\n- music\n- Taylor Swift's NFL coverage impact: Wife of Rams quarterback Kelly Stafford expresses she was tired of the singer being the focus at the Chiefs games\nTrending\nKelly Stanford, wife of Rams quarterback Matthew Stafford, voiced her frustration over the extensive media coverage of Taylor Swift and Travis Kelce’s relationship during Chiefs' games last NFL season, feeling it overshadowed the players’ efforts. However, she appreciated Swift for drawing more women and young girls to football, enhancing her daughters' interest in the sport.\ntwitter\n“Now, I have never once said I didn’t like Taylor Swift — ever. But I will say I kind of got tired of the Chiefs’ coverage of it — actually the NFL’s coverage — of this budding relationship last year. And, can she do anything about that? No, she can’t,” said, Kelly Standford, the wife of Los Angeles Rams quarterback Matthew Stafford, on the latest episode of her The Morning After podcast.\n“It was a good business decision for the NFL but I almost felt like it was outshining the games. And that’s what bothered me. I was a little jealous of the fact that they were getting all this attention and all of a sudden the football game was the sideshow. So yeah maybe I let jealousy get the best of me,” she continued.\nBeing an admirer of Taylor herself, she made it clear that her issue was only that other players weren’t getting their much-deserved attention.\nKelly, who is the same age as Taylor, has always followed her career. She even took her family to Taylor’s New Orleans concert and shared glimpses of the same on her social media. .\nNow, looking back, Kelly only has the nicest things to say about Taylor. “I am so thankful for her in a lot of ways because there are so many more women watching, there are little girls watching with their dads and I do think it definitely makes my girls love football more knowing that she’s adjacent to it. Honestly think my girls are prouder of their dad because he’s playing the sport that Taylor Swift loves,” said Kelly according to People’s report.\nEnd of Article\nFOLLOW US ON SOCIAL MEDIA",
  "word_count": 373,
  "scraped_at": "2026-02-14T12:10:31.398391"
}