{
  "article_id": "97a43cb7dba2",
  "url": "https://www.90min.com/supercomputer-predicts-euro-2025-winner-lionesses-defend-title",
  "title": "Supercomputer predicts Euro 2025 winner as Lionesses get ready to defend title",
  "date": "20241223T061500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Supercomputer predicts Euro 2025 winner as Lionesses get ready to defend title\n- England seeking to defend their title at Euro 2025 next summer\n- The Lionesses will compete in a group with France, Netherlands and Wales\n- Supercomputer pegs Spain as the frontrunners to claim the title\nEngland will commence their title defence next summer at Euro 2025 as they face France, Netherlands and Wales in what's been described as the 'group of death'.\nThe Lionesses will travel to Switzerland next July with the hopes of re-running the tape on the historic summer that saw them claim the title of European Champions in 2022.\nEngland will be put to the test from the outset after being drawn in a tough group of competitors. Sarina Wiegman will come up against her former Netherlands side in the race for glory, as well as France and tournament newcomers Wales.\nCombining historic match data from 2000 to 2023, bookmakers’ odds, with the latest UEFA and FIFA rankings, Oddspedia’s supercomputer has predicted who will emerge victorious at Euro 2025...\nSpain the frontrunners to win Euro 2025\nOppspedia's Supercomputer has predicted that Spain are the most likely contenders to take home the European trophy, with a 39.8% winning chance.\nThis will come as no surprise after the side were crowned champions of the world last summer at the FIFA Women's World Cup, triumphing 1-0 over England in the final.\nSpain have had a turbulent run of results over recent times, having dropped points to Italy and Czechia in 2024 alone. The side also tasted defeat at the Paris Olympic Games, losing the bronze medal match to Germany by a 1-0 scoreline.\nDespite this, the nation always possesses an air of inevitability. FIFA's best female player and Ballon d'Or winner Aitana Bonmati leads a group of exceptional talent, making it understandable that they are pegged as tournament favourites.\nEngland only a 9.6% chance of achieving back-to-back glory\nDefending champions England have been given just a 9.6% chance of winning Euro 2025, says Oddspedia's supercomputer.\nDespite emerging the victors of Euro 2022 and reaching the World Cup final in 2023, fans are hesitant about England's chances to lift silverware next summer in Switzerland. A string of friendly fixtures had fans concerned with Wiegman's playing style, but the manager has certaintly proved her worth at major tournaments.\nAfter winning the Euros with the Netherlands in 2017, and going back-to-back with England in 2022, Wiegman has proved that the European stage belongs to her.\nEngland will be eager to become just the second nation to win the tournament twice in a row, currently chasing Germany who lifted the trophy five consecutive times between 1995 and 2013.",
  "word_count": 447,
  "scraped_at": "2026-02-14T12:34:06.409631"
}