{
  "article_id": "97c4b4a1b230",
  "url": "https://www.pilotonline.com/2025/04/29/versatile-guard-lj-thomas-transfers-to-odu/",
  "title": "Versatile guard LJ Thomas transfers to ODU",
  "date": "20250430T021500Z",
  "domain": "pilotonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "COLLEGE BASKETBALL\nFormer Austin Peay and North Carolina State guard LJ Thomas has committed to Old Dominion, according to SI.com and The Sun Belt Report.\nThe 6-2, 199-pound Plant City, Florida, native averaged 14.2 points, 4.5 rebounds and 3.9 assists a game for the Governors last season. He’ll have one season of eligibility remaining.\nBREAKING: Austin Peay transfer LJ Thomas has committed to Old Dominion\nThe 6’2” Junior averaged 14.2 points, 4.5 rebounds, and 3.9 assists this season. Also played at NC State\nMassive pickup for ODU, who’s already had the best portal cycle so far pic.twitter.com/r5WRmtFJA1\n— Zac Capps – The Sun Belt Report (@sunbeltreport) April 29, 2025\n- Virginia will join Northwestern, Butler and South Carolina in the 2025 Greenbrier Tip-Off at The Greenbrier Resort in White Sulphur Springs, West Virginia, according to College Hoops Today.\n- Former UNC Wilmington guard Elijah Jamison has signed with Norfolk State. The 6-3 Louisburg, North Carolina, native averaged 9 points a game in four games for the Seahawks last season.\n- James Madison landed a commitment from Winthrop transfer Paul Jones III, a former Churchland High standout who grew up in Suffolk. The 6-4 guard was on the Big South All-Freshman team for Winthrop and averaged 7.8 points and 2.9 rebounds.\nCOLLEGE BASEBALL\nCAA honors W&M’s Boyd, Laskofski\nTwo William & Mary players picked up CAA honors this week. Freshman right-hander Zach Boyd was the Pitcher of the Week, while freshman infielder Jamie Laskofski was the Rookie of the Week.\nBoyd threw the first shutout by a William & Mary pitcher since 2013, limiting Stony Brook to three hits over seven innings in a 15-0 win last Saturday. Laskofski hit .533 with homer, two triples, a double, eight RBIs and six runs.\nCOLLEGE FOOTBALL\nOakton OT Lattus chooses ODU\nOakton High offensive tackle Wesley Lattus announced on X that he has committed to Old Dominion. Lattus (6-5, 260) also showed interest in James Madison, Monmouth, Towson and Bryant.\nBriefly\n- Former Virginia Tech wide receiver Ali Jennings has received a minicamp invitation from the Green Bay Packers. He played two seasons each for the Hokies, Old Dominion and West Virginia.\n- Virginia Wesleyan softball player Hannah Hearl has been named the ODAC Pitcher of the Week. She went 2-0 with a save to help the Marlins secure the No. 1 seed in the ODAC Tournament.\n- The Virginia Wesleyan women’s tennis team blanked Shenandoah 4-0 in the first round of the ODAC Tournament on Tuesday.",
  "word_count": 414,
  "scraped_at": "2026-02-14T13:21:04.545057"
}