{
  "article_id": "97dfa0e2c8fb",
  "url": "https://www.cornnation.com/2023/3/27/23657647/corn-flakes-huskers-news-softball-sweep-magnificent-mile-and-march-madness-big-ten-women",
  "title": "Corn Flakes : Husker Athletics News , Softball Sweep , Magnificent Mile , and March Madness",
  "date": "20230327T131500Z",
  "domain": "cornnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In this week’s episode of “Where is Jill now?” I bring you Flakes from the Magnificent Mile in the Windy City. After years of very little travel, I’m now in the middle of a few weeks of excessive time away from home.\nMonday Flakes: Softball Sweep, Magnificent Mile, and March Madness\nThe Big Ten Women Are Carrying the Banner for the Conference in March Madness\nThis week’s adventure is a conference related to the accreditation process for the school I work for. As a newby, I’m not here because I’m an expert, but because I need to learn at least a little bit and start contributing to the process we will be going through this fall.\nChicago is a beautiful city (I’m next to Navy Pier, so I’m seeing a gorgeous area) and the food is amazing (not just the deep dish). I’ve always liked Chicago, but this is the first time I really appreciate the comments from friends and colleagues that love it here.\nHave you ever visited a city or location that surprised you? Where?\nCorn Flakes\nHuskers Sweep Series, Win 4-2 Over Purdue - University of Nebraska\nThe Nebraska softball team (23-9, 3-0 Big Ten) claimed the Big Ten series sweep with a 4-2 win over Purdue on Sunday afternoon at Bowlin Stadium.\nBrandon Baker, elite 2024 OT, raves about Nebraska fans after Huskers visit\nThe Huskers could be adding the top offensive lineman of the 2023 recruiting cycle.\nNebraska Football Recruiting: Pair of New Yorkers taking in Huskers next week\nAs Nebraska football recruiting rolls on for both the 2024 class and those beyond, the Huskers are hosting a pair of New York prospects.\nNebraska Football Recruiting: Former Huskers target back on the transfer portal market\nNebraska football recruiting efforts couldn’t land former Baylor Bear Micah Mazzccua but does Matt Rhule have a second chance now?\nWith significant announcement still to come, Amy Williams will ‘absolutely’ recruit transfer portal\nNebraska will recruit transfers regardless, but that conversation changes if Isabelle Bourne and Jaz Shelley make a decision to play for the Huskers next season.\nIllinois Salvages a Win Over Nebraska Baseball, 10-7 - Corn Nation\n2 home runs each by Max Anderson and Gabe Swansen weren’t enough to overcome 6-0 deficit.\nSports!\nThe Big Ten men had a[nother] disappointing tournament with no team emerging from the Sweet 16. The Big Ten women, however, are showing up in force. The conference did have a #1 seed exit early when Indiana was upset in the second round, but the Elite Eight features three Big Ten women’s teams - Ohio State (#3 seed), Maryland (#2 seed) and Iowa (#2 seed).\nIowa earned a final four berth against Louisville last night. OSU and Maryland play tonight for their chance at the Final Four - both are underdogs relative to seeding. Maryland has the toughest matchup (on paper at least) with South Carolina who is regarded as the overall favorite to win it all.\nThe Big Ten women have been packing the Elite Eight with teams the past couple of years, but haven’t broken through with a championship team. Hopefully that changes soon!\nMarch Madness: Florida Atlantic survives Markquis Nowell, Kansas State in thriller for 1st Final Four berth\nThe Owls had never won an NCAA tournament game until this March. Now they’re in the Final Four.\nJerry Green, Detroit sportswriter at 56 Super Bowls, dies\nJerry Green, a Detroit sportswriter who covered 56 consecutive Super Bowls, has died at 94. Green is the only reporter to cover each of the first 56 Super Bowls.\nFAU Broadcaster Pulled Off Clutch Move to Avoid Missing the End of Kansas State Upset - Sports Illustrated\nThe Owls’ commentator nearly missed out on the biggest moment of his career.\nReading That Makes You Smarter\n(Not Guaranteed)\nResearch is shedding new light on salt, a misunderstood nutrient | Nature of Things\nIs salt really bad for you? (well, yes and no)\nWhy do dogs tilt their heads? | Live Science\nDogs commonly tilt their heads, but is it a sign of intelligence, or does it mean something else entirely?\nFinland will pick 10 people for a free happiness masterclass : NPR\nFinland has held the title of world’s happiest country for six years running. It wants to teach people how to unlock their “inner Finn” during a four-day masterclass at a lakeside resort in June.\nThe Weekly Dump\nTwitter now auto-replies to press emails with a poop emoji : NPR\nTwitter’s communications email went dark after mass layoffs late last year. CEO Elon Musk announced this weekend (and NPR confirmed) that it now responds to press inquiries with a single poop emoji.\nMost Popular\n- Nebraska’s Young Players Waiting in the Wings\n- Nebraska Baseball vs UConn - Live Discussion!\n- Nebraska Baseball Weekend Preview: MLB Desert Invitational\n- HUSKERS SOFTBALL Recap - It’s Tennessee & Pickens Again: #2 Tennessee 4 - #8 NEBRASKA 1\n- Five Heart Podcast: The Moos Fallout, Husker Hoops, and Breakfast Pizza",
  "word_count": 832,
  "scraped_at": "2026-02-14T13:44:55.409592"
}