{
  "article_id": "97ea2081df3b",
  "url": "https://www.theguardian.com/world/article/2024/jun/03/first-edition-sunak-campaign",
  "title": "Monday briefing : Is there any saving Sunak election bid ? | General election 2024",
  "date": "20240603T071500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. The Tories don’t have Labour’s problem over candidate selections, but it’s just about the only one they don’t have.\nIt’s been close to two weeks since Rishi Sunak called this election, and it still feels as if he was just as surprised by it as everyone else. So far, the Conservative campaign has consisted of lucky dip policy ideas, a series of unforced errors that have made Sunak look ridiculous, and a vacuum where the big idea about the country’s future should be.\nWhy is it going so poorly – and is there a method to the badness? Today’s newsletter, with Guardian political correspondent Kiran Stacey, goes in search of a rationale, and finds a very gloomy one.\nPS: This is my last First Edition for a while – as mentioned above, there’s an election on, so from today I’ll be moonlighting on a 5pm briefing, called Election Edition. (This may mean I’m the only journalist who will get a lie-in during the campaign.) We’ll be curating the most important stories, a digestible piece of analysis, and a roundup of the stupidest things said and done by politicians that day.\nNimo and Friend Of The Newsletter Rupert Neate will be bringing you First Edition throughout the campaign – and if you’d like to get Election Edition every weekday, click here to sign up. You really don’t want to be going through this alone, do you?\nFive big stories\n-\nSocial care | British social care agencies have been accused of exploiting foreign workers, leaving migrants living on the breadline as they struggle to pay off debts run up while trying to secure jobs that fail to materialise. Dozens of people working for 11 different care providers told the Guardian they found little or no employment despite paying thousands to agents to secure them jobs.\n-\nUkraine | Donald Trump risks being a “loser president” if he wins November’s election and imposes a bad peace deal on Ukraine, Volodymyr Zelenskiy has said, adding that it would mean the end of the US as a global “player”. Zelenskiy told the Guardian he had “no strategy yet” for what to do if Trump returned to the White House.\n-\nLabour | Diane Abbott has said that she intends to “run and win” as Labour’s candidate in the constituency she has represented for 37 years, amid reports that Labour has offered peerages to MPs to stand down. A number of leftwing MPs said that offers had been made for them to give up their seats.\n-\nSouth Africa | Final results from South Africa’s seismic elections have confirmed that the African National Congress (ANC) party has lost its majority for the first time in 30 years of full democracy, firing the starting gun on unprecedented coalition talks. The ANC won just 159 seats in the 400-member national assembly on a vote share of just over 40%.\n-\nMedia | The billionaire rightwing media mogul Rupert Murdoch has married for the fifth time, this time to retired molecular biologist Elena Zhukova. The 93-year-old last year ended a previous two-week long engagement to Ann Lesley Smith, a 67-year-old conservative radio host.\nIn depth: ‘It is essentially a defensive campaign – he even held an event in his own constituency’\nIn all fairness, things are not quite as bad for the Tories as they looked on day one, when all anybody could talk about was Rishi Sunak’s literal wet suit. “The first four days were the worst,” Kiran said. “You can at least say that since then, they’ve been having a go at making the political weather.” The trouble is, they’re losing. Running out the clock isn’t really going to be enough for victory – and the polls aren’t shifting.\nAs underwhelming a start as it’s been, it is possible to discern a theory behind it. Here’s how it’s gone, and why the Conservatives are going this way.\nThe policy blitz\nPolicy announcements are exciting! Everyone likes a policy announcement. So far from Rishi Sunak, we’ve had national service, “triple lock plus” for pensions, 100,000 more apprenticeships a year instead of “rip-off” degrees, a promise not to raise VAT (the same as Labour), and today a change to the Equality Act to rewrite the definition of sex. More eye-catching ideas are doubtless barrelling their way towards us.\nThe problem is that it’s quite hard to tell what all of this adds up to: they all feel as if they’ve been generated by a Spad in the back of the ministerial car, and there is little sense that they’re building towards a coherent whole. (I asked ChatGPT to produce a list that the Tories might draw inspiration from: don’t be surprised if “classic car restoration grants for retirees” makes the manifesto.)\n“It’s just really difficult to locate a theme that will make sense to people,” Kiran said. “It’s tactics, not strategy. That can often work during a campaign, because they’re naturally chaotic events – you need to be fast and responsive.” But without a larger structure in the background, they can easily spin out of control.\nWhen political parties appear to invent policy on the fly to “win the day” with a retail offer instead of pursuing anything larger, I always think of the former Obama adviser David Axelrod’s withering summary of Ed Miliband’s platform in Patrick Wintour’s 2015 long read: “Vote Labour and win a microwave.” The point is not that people don’t want a microwave. The point is that they need a vision of the life their microwave will help them create.\nThe big picture\nThe Tories started their campaign with a six-word slogan. Congratulations if you can remember it: neither Kiran nor I could. (It’s “Clear plan. Bold action. Secure future.”)\nIt’s not that Sunak hasn’t sought to present a narrative for his leadership, and his re-election: the problem is that he’s presented too many. The prime minister has attempted a series of resets since he took office, variously trying to present himself as a breath of fresh air, a man with a plan, a scourge to small boats, an enemy to extremists, and protector of the nation in an uncertain world. Now that the election is under way, none of these seem to be a focal point – even though his big security speech was a few weeks ago.\n“In the end, their message has boiled down to ‘better the devil you know’,” Kiran said. “But that message is completely garbled. Sunak’s initial brand was as Mr Calm, Mr Problem Solver. But because the problems he’s had to solve have been created by his own party, and he doesn’t have a personal mandate, he hasn’t ever fully sketched that out. Without that thread, it’s going to feel bitty.”\nThe unforced errors\nForgetting his umbrella. Posing in front of an exit sign. Asking voters in Barry if they’re looking forward to the Euros when Wales didn’t qualify. Playing football terribly. Holding an event at the Titanic launch site. These things are all trivial. But they’re also entirely avoidable, and evidence of a campaign on the ropes.\n“If you don’t have a good story to tell, you are more prone to making mistakes,” Kiran said, and it’s true that when you’re succeeding in setting the news agenda, there’s just less oxygen for your errors. It’s also true that a campaign starting on the back foot will find a more receptive audience for its worst moments, since they seem to chime with the wider reality.\n“But honestly, a lot of this is simple stuff,” Kiran said. “Being photographed next to an exit sign – there is a team of people to stop those things happening who can’t be doing their jobs properly. Frankly, a good campaign team should be able to stop most of this.” Unless they work for Ed Davey, in which case they are presumably garlanding his path with banana skins in the hope that someone has a camera out.\nThe explanation\nAs is often the case with politics, you get a clearer sense of what’s going on if you ignore what the protagonists say, and focus on what they do. And while Sunak is talking a good game about taking the fight to Labour, an assessment of his campaign visits tells a different story. This FT piece points out that, of the visits Sunak has made since January, the focus has been on seats the Tories already hold. The average majority is just under 10,000 votes.\n“It is essentially a defensive campaign,” said Kiran. “He’s touring the blue wall like nobody’s business. He even held a campaign event in his own constituency. It’s about loss minimisation.” The policy platform – bolster pensions, make young people pick up litter, and tell them university’s pointless – points in a similar direction: an attempt to head off the threat posed by the Reform party. A remarkable YouGov poll last week, carried out after the national service announcement, revealed just how narrow Sunak’s potential audience is: among the under-50s, it has the Tories at 8%.\nKaty Balls’ well-informed analysis for the Spectator last week reached a similar conclusion about what one pollster calls the “Dunkirk strategy”:\nWinning would mean taking 350 seats while current polls suggest the Tories are heading to win about 100. ‘So we can guess what has happened,’ says one former cabinet member. ‘Rishi has been told by his strategists: you can’t win this. But you can lose with 200 MPs rather than 100 by love-bombing the pensioners – even if it goes against your own politics.’”\nAsked for a more optimistic view, Kiran said: “My guess is that the strategy is a couple of weeks of shoring up base, hope that the polls start to move as Reform are squeezed, and then build on that narrative to be more confident in Labour-Tory marginals.” But with more people voting early by post than ever and no guarantee that his opponents will continue to focus on internecine warfare, Sunak doesn’t have a lot of time. By the time he finds his feet, he may be flat on his face.\nWhat else we’ve been reading\n-\nIn this extract from her forthcoming book, Scattered, the Guardian’s community affairs correspondent Aamna Mohdin writes about her return to the refugee camp in Kenya where her earliest memories were formed. It’s a great piece of writing: precise, elegiac, and drawing profound connections between her past and her future. Archie\n-\nEmma Beddington hails the makeover of the midlife crisis, as popularised by the likes of Miranda July, “whose new novel All Fours is reframing perimenopausal turmoil as urgent, sensual – even ‘hot’”. Hannah J Davies, deputy editor, newsletters\n-\nMhairi Black was the youngest MP since 1832 when she was sworn in aged 20 in 2015; now, still not yet 30, she is quitting the Commons. She tells Libby Brooks that she leaves wondering what she will do with the rest of her life – and with a withering view of Westminster: “It serves nobody other than the folk who view parliament as a private club.” Archie\n-\nI’m not one for amassing a lot of stuff, but if it’s something that will make my life easier then yes, absolutely: sign me up. Here are 26 surprisingly useful gadgets from Guardian readers, from a stick blender to a hot brush. Hannah\n-\nIn her column for the Observer magazine, Eva Wiseman writes sharply about the growth of health trackers for the “worried well”: “I deeply resent the fact that tech companies prey on these fears, creating new concerns for profit. I think yes, we can know too much.” Archie\nSport\nRugby league | Rob Burrow (above), the former rugby league player who came to national attention after his diagnosis with motor neurone disease, has died at the age of 41 after a short illness. Burrow, one of the modern era’s great players, helped inspire almost £20m in fundraising to support people living with MND after his 2019 diagnosis.\nChampions League | After Real Madrid beat Borussia Dortmund 2-0 to win their sixth European Cup in a decade, Sid Lowe writes that they rank alongside the Madrid side that dominated in the late 1950s as the greatest club side ever. “Time changes perceptions, of this era and that one,” he writes. “The past is seen differently and one day this will be the past and it will be glorious.”\nGolf | Japan’s Yuka Saso overcame an early four-putt to overturn a three-shot deficit and win her second US Open title on a dramatic final day at Lancaster Country Club. A closing 68 gave the 22-year-old a winning total of four under par, three shots clear of her compatriot Hinako Shibuno.\nThe front pages\nThe Guardian leads with an exclusive report: “Care agencies accused of exploiting foreign workers”. The Financial Times has “Russia-China gas pipeline deal stalls as Beijing plays hardball over prices”. The i has a story on Keir Starmer’s reported plans for a new relationship with the European Union, under the headline “Labour plan for softer Brexit deal too ambitious, EU insiders warn”.\nThe Telegraph leads with “Sunak: I’ll change law to protect women’s spaces”. The Times follows the same story with “Tory vow to end abuse of gender laws by predators”, while the Mail carries a quote in its headline, with “Sex is a fact of biology”.\nFinally the Mirror commemorates Rob Burrow on its front page, after the rugby league star died at the age of 41, under the headline “True Hero”.\nToday in Focus\nHow to live to 100\nWe know more about extending our lifespans than ever before. After\ndecades spent drinking, eating and laughing at people with exercise regimes, what will it take for Phil Daoust to join the ranks of centenarians?\nCartoon of the day | Edith Pritchett\nSign up for Inside Saturday to see more of Edith Pritchett’s cartoons, the best Saturday magazine content and an exclusive look behind the scenes\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nAs part of a series on ADHD and autism, the Guardian spoke to couples to find out how neurodiversity affects their relationships. For naturalist and TV personality Chris Packham, his autism means he can only offer his neurotypical partner Charlotte “100% of myself – or 0%”. For Charlotte, a zookeeper, Chris’s tendency to offer total honesty “can be a bit brutal”. However, she also finds security in knowing he will always give a straight answer. “I’m never floating around, not knowing where I am, because I absolutely know,” she says. In time, she has learned to “embrace our differences rather than forcing either one of us to be more like the other”.\nWhile neurodiversity can pose challenges for some relationships, getting to grips with any issues can also bring a couple closer together. Aidan Martin, a singer-songwriter with ADHD, says that his boyfriend Batou Gomis is comfortable with giving him the space he needs, and “understands me as a complete person”.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2541,
  "scraped_at": "2026-02-14T12:47:57.819033"
}