{
  "article_id": "97ed94e9cc5b",
  "url": "https://www.winnipegfreepress.com/uncategorized/2025/03/04/big-ten-tournament-stage-appears-for-another-round-between-no-2-usc-and-no-4-ucla",
  "title": "Big Ten Tournament stage appears for another round between No . 2 USC and No . 4 UCLA – Winnipeg Free Press",
  "date": "20250304T204500Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Big Ten Tournament stage appears for another round between No. 2 USC and No. 4 UCLA\nAdvertisement\nINDIANAPOLIS (AP) — The final regular season weekend gave women's basketball fans a potential preview of this week's Big Ten Tournament.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nINDIANAPOLIS (AP) — The final regular season weekend gave women's basketball fans a potential preview of this week's Big Ten Tournament.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 04/03/2025 (347 days ago), so information in it may no longer be current.\nINDIANAPOLIS (AP) — The final regular season weekend gave women’s basketball fans a potential preview of this week’s Big Ten Tournament.\nSouthern California dominated crosstown rival UCLA, completing a season sweep of the Bruins to win the league title. Maryland, meanwhile, got a 3-pointer with 1 second left to beat Ohio State.\nThe result: Each of this week’s top four seeds is ranked in the top 15, each has a double bye into Friday’s quarterfinal round, and each has something to prove in Indianapolis.\n“A hundred percent. Absolutely, yes,” UCLA coach Cori Close said Saturday night when asked if she would like a rematch. “If you’re a competitor, yes, bring it on. If we don’t, there’s something bigger wrong. If there’s anyone in our locker room (who) would answer differently, don’t come back.”\nThe fourth-ranked Bruins (27-2) have been flawless against everyone this season — except No. 2 USC, which earned its highest ranking in 39 years Monday thanks largely to JuJu Watkins’ stellar play, including two big games against UCLA.\nAs a result, the Trojans knocked UCLA out of the No. 1 ranking in mid-February and out of the No. 2 spot this week. And there’s no doubt Watkins & Co. think they can ruin the Burins’ next dream — winning the tournament.\nBut coach Lindsay Gottlieb doesn’t want her team thinking about Sunday’s title game yet.\n“You’ve got to be ready on that first day because another team has played,” she said. “Usually, the byes help you later in the tournament. We’ve got to be ready to go, but I think we will (be).”\nNo. 13 Ohio State and No. 15 Maryland certainly understand Gottlieb’s caution.\nOver the past decade, one of those two schools has played for a Big Ten crown eight times while winning a combined six titles. Iowa won the other four, the last three with Caitlin Clark in the starring role.\nBut with Clark now in the WNBA, Ohio State and Maryland enter this week seeded third and fourth as they try to make a stand for the Big Ten’s old guard.\n“We’ve played pretty well the last three games against really good competition, and I think we’re in a good spot,” Buckeyes coach Kevin McGuff said following Sunday’s road loss. “But we’ve got to take that same competitive character into next weekend.”\nThe warmup\nUSC and UCLA both finished their earlier Indiana swings with identical 2-0 marks, winning games at two of college basketball’s iconic arenas — Assembly Hall in Bloomington and Mackey Arena in West Lafayette.\nThe Bruins even took a couple of hours to watch an Indiana Pacers game at the same venue they’ll play in this week.\nBut their return trip is, thankfully, unlikely to be like their first visits. UCLA’s two games were sandwiched around central Indiana’s most severe snowstorm of the season, while USC was around for one of the coldest snaps of the winter.\nHigh temperatures are expected to be in the 40s most of this week, with lows in the 30s.\nWestward bound\nThe women’s tournament will be the league’s 12th postseason championship of the 2024-25 season, and if there is a third round of USC-UCLA, it will give the four first-year Big Ten teams a sixth such championship.\nOregon swept the men’s and women’s indoor track and field titles last weekend in Indy and also won the football title by beating Penn State just a short walk away from Gainbridge.\nThe eighth-seeded Ducks (19-10) open play against ninth-seeded Indiana (18-11) on Thursday, and 12th-seeded Washington (18-12) faces 11th-seeded Minnesota (20-10) on Wednesday. USC plays the first game Friday against the Oregon-Indiana winner while UCLA opens play in Friday’s third game against seventh-seeded Illinois (21-8), 10th-seeded Nebraska (19-10) or 15th-seeded Rutgers (11-18).\nMissing out\nFor the first time, every Big Ten team will not be playing in the tourney. The bottom three teams in the new 18-team league did not qualify.\nWho’s out? Penn State (10-19, 1-17), Northwestern (9-18, 2-16) and Purdue (10-19, 3-15), which lost the tiebreaker with Rutgers based on a loss in this season’s only meeting.\nWhile six of the Big Ten regulars, including Northwestern, have never won the tourney title, not having Penn State and Purdue is odd. The Nittany Lions won the first two league tourney titles while the Boilermakers own a league record nine tourney crowns.\nSchedule talk\nWednesday’s final game pits three-time defending champ Iowa (20-9), the No. 11 seed, against 14th-seeded Wisconsin (13-16). The winner advances to play sixth-seeded Michigan State (21-8) with the winner of Thursday’s matchup facing Ohio State on Friday.\nThe Minnesota-Washington winner will face fifth-seeded Michigan (20-9) for a chance to take on Maryland in Friday’s second game.\nThe two semifinals are slated to tip off Saturday at 3 p.m. and 5:30 p.m. The championship game is set for Sunday at 4:30 p.m.\nPeople watching\nFormer UCLA star Reggie Miller and his sister, Cheryl, who led the Trojans to two national championships in the 1980s, attended Saturday’s game in Los Angeles, and Reggie Miller has occasionally come back to his NBA stomping grounds, Indiana, to watch games.\nWho else could be around?\nClark, who won the tourney’s last three Most Outstanding Player awards. She now calls Indy home, too, since she’s playing for the Indiana Fever. Iowa retired Clark’s No. 22 jersey earlier this season.\n___\nGet poll alerts and updates on the AP Top 25 throughout the season. Sign up here. AP women’s college basketball: https://apnews.com/hub/ap-top-25-womens-college-basketball-poll and https://apnews.com/hub/womens-college-basketball",
  "word_count": 1196,
  "scraped_at": "2026-02-14T13:40:58.365008"
}