{
  "article_id": "98097c0e1023",
  "url": "https://www.miragenews.com/wa-hosts-footy-fest-live-show-before-afl-origin-1611661/",
  "title": "WA Hosts Footy Fest & Live Show Before AFL Origin Match",
  "date": "20260201T061500Z",
  "domain": "miragenews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- Footy Fest, activations and a live broadcast show announced for the lead up to sold-out AAMI AFL Origin match\n- Origin Countdown show will be broadcast from Perth and aired on Channel 7 across Australia on Thursday, 12 February\n- Fans can experience free activities across Perth in the lead up to the historic game including open training for Western Australian and Victorian teams\n- Thousands of out-of-state visitors expected to attend first Origin match in over two decades\n- Iconic match expected to inject millions into the visitor economy as part of Cook Government's economic diversification strategy\nWestern Australia will experience an AFL takeover in the lead up to the sold-out 2026 AAMI AFL Origin, with free event activations and a live broadcast show on offer across Perth.\nThe Footy Fest will take place at Stadium Park next to Optus Stadium on 1314 February, offering free football games, roving entertainment, food trucks, family friendly activities, live music, and WA market stalls.\nAdding to the hype is a live televised 90-minute broadcast event - Origin Countdown - which will take place at Optus Stadium's Southern Oval on Thursday night, 12 February and feature some of AFL's best hosts, personalities and past legends.\nThe broadcast is open to fans and will be filmed live from various locations across WA, including the Leederville Hotel and Little Creatures Brewery Fremantle, and will air on Channel 7 showcasing the State to a national audience of hundreds of thousands of viewers.\nSupported by the Cook Government through Tourism WA, the live show and activations will bring the city to life and create memorable, world-class experiences for visitors and locals alike.\nAs part of Footy Fest, open training sessions for both the WA and Victorian teams will take place at Optus Stadium on Friday, 13 February, offering fans a chance to see star players including Marcus Bontempelli, Nick Daicos, Patrick Cripps and more before the historic match.\nA giant Sherrin football will take over Perth's Forrest Place, alongside a dedicated merchandise store, a variety of free activations including an interactive digital scavenger AFL Origin hunt, and landmarks across Perth will light up navy and gold for the match.\nA dedicated showcase of historic WA Football memorabilia from past Origin matches will also be on display at the WA Museum Boola Bardip and State Library of Western Australia.\nTickets to attend the live Origin Countdown broadcast event are available from today, giving fans the chance to secure their spot for in-person viewing and be a part of the AFL excitement.\nLocal pubs across the State will join in the AFL Origin celebration by decorating their venues and broadcasting the match live, giving fans the chance to come together and witness history.\nAs the first AFL Origin match in over 26 years and the only fixture to take place in 2026, thousands of fans are expected to travel to the State for the highly anticipated event, providing a boost to local pubs, cafes and hotels.\nAFL Origin is the latest in a blockbuster summer of events for WA, following the success of the United Cup, Hoopsfest, Perth Sail Grand Prix, the upcoming Rugby SVNS, and culminating with the AFC Women's Asian Cup in March.\nWith major events like AFL Origin, WA continues to strengthen its reputation as a premier destination for major events and world-class sporting fixtures, helping drive growth in the local tourism sector and support local businesses and jobs through the Cook Government's economic diversification strategy.\nFind out more and get your tickets for Origin Countdown at AFL Origin Returns Tourism Western Australia\nAs stated by Tourism Minister Reece Whitby:\n\"The sold-out AFL Origin is set to take over Western Australia, from live entertainment at the Footy Festival, to the open training sessions where fans can get up close to their favourite players, and the official store offering exclusive merchandise.\n\"Adding even more excitement in the lead up to the game is the national live broadcast of Origin Countdown at Southern Oval, where fans in town can grab a ticket to watch this special footy event live and soak up the atmosphere.\n\"All of this exciting surrounding activity across the State shows that when we host an event in Western Australia, the fun doesn't start and stop at the turnstile.\n\"The Cook Government is proud to be hosting the return of AFL Origin and we're putting on a show for the thousands of visitors heading to Perth to watch WA take on Victoria in footy's biggest rivalry.\n\"It's all part of our economic diversification strategy to grow tourism in WA and support local jobs, as hosting major events like AFL Origin helps boosts our local tourism and hospitality businesses and shines a national spotlight on Western Australia as a great place to live, work and visit.\"\nAs stated by Sport and Recreation Minister Rita Saffioti:\n\"AFL Origin and its Footy Festival will deliver a major boost for Perth, with visitors from across the country filling local pubs, cafes and hotels.\n\"With a live national broadcast and city-wide events, the event is a fantastic opportunity to showcase Perth, our lifestyle and our passion for sport to audiences across Australia.\n\"Here in WA we know how to put on a great party, and that's exactly what we're doing to celebrate the return of AFL Origin.\n\"Local pubs across our State will help bring the AFL Origin atmosphere to life, giving fans a place to gather, celebrate and watch history unfold.\n\"Major events like AFL Origin drive visitation, support local jobs and continue to position Western Australia as a leading destination for world-class sport and entertainment.\"",
  "word_count": 938,
  "scraped_at": "2026-02-14T12:38:25.147087"
}