{
  "article_id": "980fc9d1dba4",
  "url": "https://thepeoplesperson.com/2024/09/26/manchester-united-ceo-omar-berrada-tells-staff-the-aim-is-to-win-the-premier-league-in-2028-285908/",
  "title": "Manchester United CEO Omar Berrada tells staff the aim is to win the Premier League in 2028 - Man United News And Transfer News",
  "date": "20240926T201500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United CEO Omar Berrada reportedly told club staff that the aim is to win the Premier League in the next four years.\nUnited last won England’s biggest trophy in 2013 when legendary manager Sir Alex Ferguson retired.\nSince then, a number of top coaches including David Moyes, Louis van Gaal, Jose Mourinho and Ole Gunnar Solskjaer have unsuccessfully tried to restore United back to the pinnacle of English football.\nIncumbent boss, Erik ten Hag, is currently trying to succeed where his predecessors failed but is encountering challenges in his mission.\nUnited currently lie in 11th position in the league standings, after a poor start to the season that has seen them win two games, lose two and draw once.\nThe Reds were also held to a frustrating 1-1 draw by Eredivisie outfit FC Twente in their opening match of the Europa League campaign on Wednesday night.\nOver the years, the gap between United and their rivals such as Manchester City, Liverpool and Arsenal has widened significantly but according to Berrada, the 20-time English champions are still determined to win the title in 2028.\nThe Athletic reports, “Manchester United chief executive Omar Berrada has told staff that the aim is to win the Premier League title in 2028, for the 150th anniversary of the club being formed.”\n“Berrada, who officially joined from rivals Manchester City in June, addressed employees during a meeting at Old Trafford last Wednesday and mapped out the ambitions shared by Sir Jim Ratcliffe and the football hierarchy.”\n“Berrada informed staff of “Project 150” — so called because it coincides with the major milestone of United’s existence. The club was founded, as Newton Heath, in 1878, before changing its name to Manchester United in 1902.”\nLaurie Whitwell reveals that Berrada spoke about the women’s team and used their achievement of winning the FA Cup last term to strike an “aspirational tone.”\nIt’s understood that his message was received by staff who were in a “mixed mood.”\nA section of employees remain unhappy with the club’s recent move to significantly downsize the workforce, while others were enthused and left the meeting excited about United’s future, where sporting objectives would be given priority above all else.",
  "word_count": 367,
  "scraped_at": "2026-02-14T12:48:12.191620"
}