{
  "article_id": "981351fb7d0c",
  "url": "https://www.bbc.com/sport/football/articles/c70qwg9108jo",
  "title": "Ella Toone dream derby for Man Utd but nightmare for Man City keeper Khiara Keating",
  "date": "20250120T031500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Toone's dream derby but nightmare for Keating\n- Published\nElla Toone could not have dreamed for a better evening at Etihad Stadium as she celebrated a hat-trick and came off to a standing ovation in the Manchester derby.\nThe England international has had a tough few months, dealing with the death of her father in September, then missing two months with a calf injury.\nBut Toone returned to Women's Super League action with a bang, stealing the show as she and Manchester United stunned Manchester City to win 4-2 on their rivals' turf.\nFans were chanting her name while enjoying post-match celebrations and the 25-year-old described it as a \"special\" evening.\n\"I've been through a lot,\" Toone told Sky Sports. \"When I got injured it was a blessing in disguise. Looking back now, I needed it - not just physically but mentally as well.\n\"I've used my time wisely to get back fitter and stronger, and more importantly, to look after myself.\n\"For all my family, it was nice to have a little break away. We obviously miss dad a lot so it's been tough, but I couldn't have done it without [my team-mates] so I'm buzzing.\"\n'We need to protect Toone'\nLifelong United fan Toone had never scored in a Manchester derby prior to Sunday's hat-trick so she could barely believe it when she put her side ahead within 14 minutes.\nLatching on to a Hinata Miyazawa flick and a scuffed effort from striker Elisabeth Terland, Toone dinked a finish over goalkeeper Khiara Keating.\nHer team-mates flooded around her during the celebration as they stood looking up to the sky, gesturing love hearts with their hands, presumably in tribute to her father.\nTwo errors from Keating either side of half-time allowed Toone to add to her tally and she raced over to the United fans with her treble sealed, sliding on her knees with her arms outstretched and a beaming smile on her face.\n\"We all know what she's been through. What's more important right now is that Ella Toone - for Manchester United and England - enjoys football,\" said manager Marc Skinner.\n\"There is so much more growth still to come with Tooney. She will take the headlines but the whole team was excellent.\n\"She gets a lot of plaudits because of the personal stuff she has been through. Sometimes you need that break and she got that through an injury.\n\"I have to make sure she has that headspace and clarity. We need to protect her for the right moments.\"\n'There is no individual blame' - Taylor backs keeper\nAs United fans seranaded Toone at one end of the pitch, City striker Vivianne Miedema consoled goalkeeper Keating at the other as the full-time whistle went.\nA derby defeat, another dent to City's faltering WSL title challenge and several costly individual errors meant a nightmare evening for 20-year-old Keating.\nThe England goalkeeper roared in frustration throughout. First, when her short pass to Leila Ouahabi led to Toone's second goal to make it 3-0, and then when her clearance was blocked by Terland for Toone to make it 4-2, it was crucially just seconds after the restart with City looking to press on after ending the first half in the ascendancy.\nThrowing her arms in the air and shouting to the sky, it appeared Keating's evening could not get any worse but the United fans taunted her behind her goal for the entirety of the second half.\n\"Time is a healer. She will be OK, she will feel sore like we all do,\" said City boss Gareth Taylor.\n\"We win, lose and draw together as a team. There is no individual blame. She will be feeling worse I imagine.\"\nIt is not the first time Keating has made mistakes but the young goalkeeper has bounced back before - reclaiming her number one shirt and earning selection for England.\nShe left Meadow Park in tears when her late error helped Arsenal win 2-1 in November 2023 and there was a costly mix-up in their FA Cup quarter-final defeat by Tottenham last year.\nBut Taylor believes Keating will come back again, despite competition for her place from summer signing Ayaka Yamashita undoubtedly increasing pressure.\n\"She's proven before [she can bounce back] and she will do it again. We never push the blame in any one direction so I think she will be OK within a couple of days,\" added the City boss.\n\"As much as United were aggressive, we played into their hands and we need to be better.\n\"We are not going to become, under my reign, a team that will smash the ball long or play long. There were times tonight where there were spaces and we exploited it - but we need to be better in the execution of our goal kicks.\"",
  "word_count": 804,
  "scraped_at": "2026-02-14T12:43:17.386034"
}