{
  "article_id": "983c831798e8",
  "url": "https://www.justarsenal.com/kathrine-kuhl-on-crazy-schedule-post-womens-world-cup-arsenals-early-exit-from-uwcl/349750",
  "title": "Kathrine Kuhl on  crazy  schedule post Women World Cup & Arsenal early exit from UWCL",
  "date": "20230927T144500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kathrine Kuhl on “crazy” schedule post Women’s World Cup & Arsenal’s early exit from UWCL by Michelle\nLast season, our Arsenal women struggled due to injuries, as we were missing key players at crucial stages of the season. Although injuries aren’t anything to be thankful about, Kathrine Kuhl, one of our 2023 January acquisitions, was able to break into the team as a result of them. After joining us, she went on to be an important part of our campaign last season, making 11 league appearances, an experience she says was full of lessons.\n“It taught me so much and inspired me so much to be a part of that team last season because even though we had so many injuries and so many obstacles on our way, we still kept fighting,” she said on a interview with the Guardian. “It was so cool to see how every single person stood up and performed their very best every single day, and people who hadn’t played a lot were stepping up when they had the chance and it was really cool to see.”\nEven though she played extensively in her first six months at the club, she admits that she is still adjusting to the intensive nature of the WSL, which is vastly different from the Danish League, a distinction that struck her from the start:\n“I’m really happy with how I prepared for that move, but there’s no doubt that the English Women’s Super League is so different from the Danish League” continued Kuhl.\n“It’s on a much higher level, so I still need to get used to it. I knew that the tempo was high, I had the experience of it with the national team. But the tempo was so much higher in the first game and just the quality of the players in Arsenal in the league are top. To train with these people every day, it develops me so much compared to FCN and where it was more working on the individual side.”\nOur Gunner Women are not competing in the 2023-24 UEFA Women’s Champions League, and the 20-year-old believes that all they have to do is battle for the league and other league Cup competitions, but she believes that the tight timetable following the World Cup didn’t allow them to be at 100 percent for the women’s champions league qualifiers, where they were eliminated by Paris FC, after the game went to extra-time and penalties.\n“It’s really disappointing and I think the schedule after the World Cup has been crazy, people coming in from the final and having to play such an important game almost a week after,” Kuhl added. “That’s really, really tough and something that I hope in the future could be changed.\n“Of course, you always want to play European football. Last year, they were some of the best games we had, played on the biggest stage with many people watching, so it’s really sad that we’re not going to experience that this year. Now, it gives us the opportunity to have full focus on the league and in the cups we’re playing. Arsenal is a club who goes for the trophies so that’s just what we’re going to keep on doing.”\nKathrine Kuhl and the girls begin their WSL season this Sunday 1st October, against Liverpool at the Emirates. Our Gunners beat the Reds at home and away last season and expect to do it again this year but nothing is certain, especially this early in the season when all clubs will be finding their feet, building bonds with new recruits, etc.\nArsenal have reported ticket sales of nearly 50,000 so far, for Arsenal Women v Liverpool at Emirates on Sunday – you can still purchase tickets here.\nHow excited are you about the new season Gooners? Will you be at the Emirates on Sunday?\nCOYGW!\nMichelle Maxwell\nFollow us on Just Gooner Women on Twitter for regular updates on the Arsenal Women’s Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 675,
  "scraped_at": "2026-02-14T13:00:12.900305"
}