{
  "article_id": "9863fc3d11ca",
  "url": "https://www.uefa.com/womenschampionsleague/news/027f-17924c8a3b3f-520873c9e672-1000--lyon-vs-chelsea-preview/",
  "title": "Lyon vs Chelsea Women Champions League preview : Where to watch , predicted line - ups",
  "date": "20230322T024500Z",
  "domain": "uefa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lyon vs Chelsea Women's Champions League preview: Where to watch, line-ups\nMonday, March 20, 2023\nArticle summary\nWhen is it? How can you watch it? What are the line-ups? All you need to know about the UEFA Women's Champions League quarter-final first leg between Lyon and Chelsea.\nArticle top media content\nArticle body\nLyon and Chelsea meet in the UEFA Wonen's Champions League quarter-final first leg on Wednesday 22 March at OL Stadium.\nLyon vs Chelsea at a glance\nWhen: Wednesday 22 March (18:45 CET kick-off)\nWhere: OL Stadium, Décines\nWhat: UEFA Women's Champions League quarter-final first leg\nHow to follow / Where to watch: Build-up and live stream from DAZN can be found here\nSecond leg: Thursday 30 March (21:00 CET kick-off), Stamford Bridge\nWhat do you need to know\nLyon have won 12 of their 13 quarter-finals in this competition, their away-goals reverse to Paris Saint-Germain in 2020/21 the sole exception. Chelsea have never gone out in the last eight, but this is only their fourth appearance at this stage, half the number of titles that Lyon made it when they reclaimed the trophy last May.\nOL began their bid for a ninth crowd at home to another London club, Arsenal, and lost 5-1 but since that night in October, Lyon have welcomed back Sara Däbritz, Dzsenifer Marozsán, Ellie Carpenter and Amel Majri, with Ada Hegerberg potentially also returning from a long-term absence to play some part in this tie. Amandine Henry is out. The 1-0 victory in the December trip to Arsenal underlined that, having had their five-year grip on the trophy ended at this stage in 2021, they are in no mood to let go of the cup having got it back in their possession.\nIn the same week that Lyon were losing to Arsenal, Chelsea were winning 1-0 at Paris, who they later beat 3-0 at Stamford Bridge. Although their recent League Cup final loss to Arsenal was a first defeat in almost six months, Chelsea bounced back to go top of the Women's Super League a week later by beating Manchester United 1-0. They are once again looking a well-oiled machine this season, Lauren James emerging as a creative playmaker in Pernille Harder's long absence, with Fran Kirby now also sidelined.\nMelanie Leupolz has come back this month after maternity leave. This is a return to her former home for Kadeisha Buchanan, a multiple Women's Champions League winner with Lyon before her summer switch to Chelsea.\nForm guide\nLyon\nLast six games (most recent result first): WWWWWW\nLast match: Lyon 2-0 Fleury, 17/03 (French Cup semi-final)\nWhere they stand: 1st in Division 1 Féminine, French Cup final\nChelsea\nLast six games: WWWLWW\nLast match: Reading 1-3 Chelsea, 19/03 (FA Cup quarter-final)\nWhere they stand: 1st in Women's Super League, FA Cup semi-final\nWhere to watch\nEvery game in this season's UEFA Women's Champions League from the group stage onwards is broadcast live in most territories on streaming platform DAZN, together with YouTube. The YouTube stream will also be embedded in the UEFA.com MatchCentre and on UEFA.tv for all UEFA Women's Champions League games, with highlights to follow at midnight CET.\nSquad changes\nLyon\nIn: Liana Joseph, Julie Swierot\nOut: Nesrine Bahlouli, Ilona da Costa, Leila Elhadj, Inès Jaurena, Kysha Sylla\nChelsea\nIn: None\nOut: Beth England, Aniek Nouwen\nStarting line-ups\nLyon: Endler; Carpenter, Gilles, Renard, Morroni; Horan, Egurrola, Marozsán; Cascarino, Le Sommer, Däbritz\nChelsea: Berger; Périsset, Buchanan, Bright, Carter; Leupolz, Ingle; James, Cuthbert, Reiten; Kerr\nView from the camps\nSonia Bompastor, Lyon coach: \"The big difference compared to the past is that the away goal is no longer worth double. In preparation it is necessary to take into account the fact that there will be two matches. We will use the fact of starting here at [OL Stadium]. We will want to impose our style. We will be at home and I hope this is something that will help us.\n\"[Emma Hayes] a coach I know because when I played in Washington she was an assistant coach. She is someone who knows women's football well. She brings all her human and footballing qualities. Chelsea are a growing team. The players are capable of performing at the highest level. Emma ensures that this team progresses and performs at the highest level.\"\nLindsey Horan, Lyon midfielder: \"We know that these are matches where there will be a real physical dimension. There will be duels. We will have to push back our physical limits.\n\"[Sam Kerr] is one of the best players in the world. She scores in almost every game. I respect her a lot as a player. Our defence is of high quality with Wendie [Renard], Vanessa [Gilles] and the other players. It's true that Sam is a dangerous player but we have to have confidence in our own strengths.\"\nEmma Hayes, Chelsea manager: \"Playing OL is a wonderful opportunity for us. We respect their experience as former winners over several years. We know they’re an experienced team, but I’m interested in my own team imposing themselves on the game. This is over two legs. Tomorrow for both teams will be about understanding each other a little bit better. But we’re ready.\n\"I don’t spend my time thinking about revenge in life [for the 2019 semi-final]. I look at life as lessons and learnings. This team has learned a lot over time. We are ready for whatever game is presented to us tomorrow. It’s a team that is constantly learning, no matter the competition. The fact we’re competing for almost every trophy we are taking part in shows how much this team learns on a regular basis.\"\nMelanie Leupolz, Chelsea midfielder: \"These are the games we work hard for, big European matches playing under the lights. It was a big goal for me to come back to the Champions League and help my team.\"\nWhere is the 2023 UEFA Women's Champions League final being played?\nEindhoven's PSV Stadium will stage the 2023 UEFA Women's Champions League final at 16:00 CET on Saturday 3 June.\nFirst opened in 1910, the 35,000-capacity PSV Stadium has a long history of hosting major matches, including the UEFA Cup finals of 1978 (second leg) and 2006, the second leg of the 1988 UEFA Super Cup and three games at UEFA EURO 2000.\nOn 6 April 2018, 30,238 fans at the home of PSV Eindhoven watched the Netherlands beat Northern Ireland on the way to the FIFA Women's World Cup, a record crowd for any UEFA-organised women's qualifier. On 1 June 2019, a then Dutch record women's football attendance of 30,640 saw the Netherlands face Australia in a friendly at the stadium.",
  "word_count": 1111,
  "scraped_at": "2026-02-14T12:38:43.143761"
}