{
  "article_id": "9863cfee9ad7",
  "url": "https://www.twtd.co.uk/ipswich-town-news/45675/town-in-process-of-acquiring-former-owner-evanss-training-ground-land/onthisday",
  "title": "Town in Process of Acquiring Former Owner Evans Training Ground Land - Ipswich Town News",
  "date": "20240925T110000Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Monday, 25th Sep 2023 12:50\nTown are in the process of acquiring the area of Bent Lane which former owner Marcus Evans retained following the 2021 takeover as part of the multi-million pound redevelopment of the club's training ground which was announced earlier this month.\nEvans kept a small area of the land across the road from the Playford Road buildings, which it was understood had the potential to be used for development, as well as taking a five per cent stake in new ownership group Gamechanger 20 Ltd, which has subsequently been diluted to around two per cent.\nA statement on the club site this afternoon announced that the Blues are looking to buy more land and TWTD understands that it is the area still owned by Evans which is the subject of their interest.\n“Gamechanger 20 Ltd has started the process of acquiring additional land at Playford Road, the club’s training ground,” the statement reads\n“With the club’s plans to further develop Playford Road, the acquisition of the land, which is located on the Bent Lane side of the training facility, will play a key role in those developments as the club looks to deliver an elite performance environment for the men’s, women’s and academy squads.”\nCEO Mark Ashton added: “I mentioned at the Fans’ Forum that the next big project would be the training ground.\n“We’ve invoked architects to work on designs. We need a total rebuild of the training ground for the first team, a more professional environment in which Kieran McKenna can work and develop first-team players.\n“We have the new pitches now, but we need a multi-million-pound spend on facilities at the training ground to bring us up to speed.\n“In addition to this, further developments for our academy and women’s teams will be included.”\nPhoto: Blair Ferguson\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nHe really should have just sold everything to have a clean break, but it makes sense for him to own part of the club because the return on investment should be very good now that he's not making any key decisions.\nNo doubt he is able to get a better price for the land now he holds it over the club.\nI'm not one of those who hates ME, he just didn't have the football know-how.\nFrom the Board down ,through Mark Ashton and Kieron McKenna we seldom see anything but joined up thinking and an action plan to go with it !\nOur training grounds used to belong to Fisons and Cranes ,and being conveniently adjacent present the ideal opportunity for development and expansion !\nThis news of further progress ,alongside the commitment of architects already is another exciting step forward .\nCOYB\nWe can't take back those bad years, so we might as well see how far we've come and enjoy the contrast.\nBit harsh on Lee Evans. He's a decent squad member, not sure why everyone is so down on the poor man!\nBut watch life's a pitch tv and you will hear David Sheepshanks saying that he had to work quite hard to convince Evans, there was no queue and NOBODY else!\nIf you are interested in the facts, listen to the above at the hour mark.\nBut get your facts right before writing rubbish!\nLets not forget he did a good sell on clause!\nan Olympic size Jacuzzi, 200ft observation platform serviced by cablecar, helipad, barracks for his minions and some sort of underground secret lair, the Borough Council need more information regarding drainage and disabled access before signing off the plans.\nHe would of course be living there, running his organisation.\nGood luck buying that off him.\n(FACT)t was ME who saved the club from going into administration for a second time!\n(FACT) it was ME who wiped out all the clubs debt and brought in gamechanger\n(FACT) wtf has over the top covid got to do with any of it\nI assume you will watch the said episode of LIFES A PITCH to get yourself up to date with the facts!\nThere are so called supporters on here who would find something to whinge about if we won the champions league!! while revelling in their own favourite team having an open bus tour for getting a corner.\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 738,
  "scraped_at": "2026-02-14T12:48:13.103155"
}