{
  "article_id": "98a87e888dda",
  "url": "https://artlyst.com/news/frieze-los-angeles-2023-what-the-dealers-had-to-say/",
  "title": "Frieze Los Angeles 2023 - What The Dealers Had To Say",
  "date": "20230220T104500Z",
  "domain": "artlyst.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Frieze Los Angeles has returned for the Largest edition of the Fair Yet, With Strong Sales, International Attendance and Critically Acclaimed Curated Programs. Now relocated to Santa Monica Airport the fair has found a new permanent home.\nLos Angeles, US (February 19, 2023) – Frieze Los Angeles 2023 closed on Sunday evening to reports of strong sales, international attendees, energy, and enthusiasm, attracting 35,000 visitors throughout the fair’s four-day run. This year the event was held at a new location at the Santa Monica Airport, with over 120 galleries from 22 countries, its largest number of participants to date.\nRunning from an invitation-only preview on Thursday, February 16, to Sunday, February 19, Frieze Los Angeles brought together galleries, institutions, non-profits, philanthropists, and artists to celebrate the city’s arts and cultural communities. Opening to high energy in the early hours of Thursday morning, all four days of the fair saw significant sales and notable attendance from international collectors, museum groups and influential figures from the cultural and entertainment worlds.\nChristine Messineo, Director of Americas, Frieze: ‘Each year, Frieze rallies the creative communities in Los Angeles for a moment that extends far beyond the fair itself. This week demonstrated that Los Angeles is a serious collecting city; galleries brought museum quality works, and their ambition was rewarded. In addition, we saw significant numbers and sales from opening day to the end of the fair proving Frieze Los Angeles is an international destination.’\nSignificant Sales Reported at All Levels\nThe opening day preview on Thursday, February 16, saw significant placements, with galleries reporting praise from collectors and institutions, resulting in many sold-out presentations.\nIn the early hours of the first day, Hauser & Wirth sold works including the painting Shall Rest in Honor There (2023) by Mark Bradford for $3.5 million, the painting Untitled (2022) by Henry Taylor for $450,000 and a painting by Luchita Hurtado for $225,000; David Kordansky Gallery sold out their solo booth of paintings by Chase Hall to major international institutions and collectors; Gladstone Gallery sold pieces including the photograph Untitled (cowboy) (1998) by Richard Prince for $3 million and a bronze wall-mounted piece by Keith Haring for $500,000; Gagosian sold out their booth of recent paintings and works on paper by Rick Lowe; Victoria Miro placed all 18 paintings in their solo presentation of Doron Langberg ranging in price from $18,000 to $80,000; Pace sold a significant Agnes Martin painting for an undisclosed sum as well as a range of works priced between $45,000 and $2 million, including new works by Adrian Ghenie, Yoshitomo Nara, and Matthew Day Jackson, paintings by Thomas Nozkowski and LA-based Maysha Mohamedi, and a small-scale edition of The Embrace by Hank Willis Thomas as well as further sales on the sales throughout the fair; David Zwirner sold paintings including The Encounter by Dana Schutz for $1.2 million to a European institution and Sari by Lisa Yuskavage for $1 million; Thaddeus Ropac sold pieces including a painting by Robert Rauschenberg for $1,700,000, a picture by Alex Katz for $1,500,000, a painting by Martha Jungwirth for €330,000, and a painting by Rachel Jones for £150,000; Xavier Hufkens’ sales included Green Vase with Carnations (1982) by Alice Neel for approximately $1,100,000, a painting by Tracey Emin for approximately £500,000 and a painting by McArthur Binion for approximately $225,000.\nTiwani Contemporary sold out their booth of paintings by Michaela Yearwood-Dan, two of which were placed with prominent institutions; in their joint solo presentation of work by Ernie Barnes, Andrew Kreps Gallery and Ortuzar Projects sold major works including a painting for over $1 million, three paintings for approximately $500,000 each and eight works on paper priced between $60,000 and $100,000; Château Shatto sold a painting by Helen Johnson for $120,000, alongside paintings by Jonny Negron and Zeinab Saleh ranging from $10,000 to $35,000 each; Jessica Silverman sold a large-scale sculpture for $225,000 by Woody De Othello and three sculptures by Rose B. Simpson in the range of $55,000 and $95,000 each, a painting by Rebecca Ness for $65,000 and a work by Pae White for $50,000;Tina Kim Gallery sold a work by Ha Chong-Hyun in the range of $300,000 and $400,000 and a painting by Pactia Abad in the range of $175,000 to $250,000; James Cohan sold a hand-embroidered work by Jordan Nassar for $200,000, a work by Eamon Ore-Giron for $65,000 and a painting by Naudline Pierre for $60,000; Nara Roesler sold two archival inkjet prints by Vik Muniz for $50,000 and $35,000 each and a painting by Fabio Miguez; Lehmann Maupin sold six paintings by London-based artist Chantal Joffe for a combined total of £200,000, three works by Loriel Beltrán for a combined total of $135,000 and a hand-stitched silk collage by Billie Zangewa for $100,000.\nGalleries located in the fair’s West Site also reported strong sales; highlights include Robilant + Voena, who sold a work by Lucio Fontana for over $1 million, a work by Alexander Calder and a sculpture by renowned contemporary Californian artist Barry X Ball; Joyhun Gallery sold two large works by Lee Bae for $207,000 each; Hakgojae sold two paintings by Haindoo, three works on paper by Joung Young-Ju and two paintings by Song Hyun-Sook and Richard Saltoun Gallery sold over ten works by Polish fibre artist Barbara Levittoux-Šwiderska, priced between $8,000 and $120,000.\nAlso in the West Site were galleries in the much-celebrated Focus section of the fair, providing a platform for emerging US-based galleries under 12 years of operation. Focus was co-curated by Amanda Hunt(Head of Public Engagement, Learning, and Impact, Walker Art Center) and Sonya Tamaddon (Independent Curator). Many participants in the section reported resounding success with their presentations. Sow & Tailorplaced, all works by Veronica Fernandez, priced between $14,000 and $26,000 each; Patron sold out of their booth of works by Greg Breda; Make Room placed all works in their two artist booth by Shana Hoehn and Guimi You; Nonaka-Hill sold out their presentation of works by Kyoko Idetsu, priced between $3,500 and $20,000 each; Anat Ebgi placed all four works presented by Jane Margarette, priced in the range of $10,000 to $25,000 each and Parker Gallery sold four paintings by Annabeth Marks and four sculptures by Nancy Shaver, all priced between $7,000 and $15,000. Chris Sharp Gallery sold multiple paintings by Edgar Ramirez priced between $12,000 and $20,000, with Bajío (2023) placed with The City of Santa Monica Art Bank Collection as part of a newly-founded partnership between Frieze and the City to grow their municipal art collection.\nAttendees\nAttendees included Santa Monica Mayor Gleam Davis and local and international museum representatives Johanna Burton, Erin Christovale, Anne Ellegood, Alex Gartenfeld, Thelma Golden, Rita Gonzalez, Michael Govan, Max Hollein, Joanne Heyler, Bettina Korek, Sohrab Mohebbi, Hans Ulrich Obrist, Hamza Walker and Heidi Zuckerman; prominent art collectors Maria Bell, Edythe Broad, Michael Chow, Beth Rudin DeWoody, Ariel Emanuel and Sarah Staudinger, David and Nancy Frej, Maria Hummer-Tuttle, Pamela Joyner, Jill and Peter Kraus, Mary Klaus Martin, Mike De Paola, Carolyn Clark Powers, Dallas Price-Van Breda, Lynda Resnick, Carter Reum, Don and Mera Rubell, Pete Scantland, Maria Seferian, Komal Shah, V. Joy Simmons, Lauren Taschen, Stephanie Vahn, Yvonne Force Villareal and Patrick and Pia Whitesell; artists Doug Aitken, Isabelle Albuquerque, Lita Albuquerque, Edgar Arceneaux, Barry X Ball, the family of Ernie Barnes, Sadie Barnette, Kevin Beasley, Andrea Bowers, Autumn Breon, Thomas Demand, Olivia Erlanger, Charles Gaines, Kim Gordon, Jennifer Guidi, Chase Hall, Alex Israel, Arthur Jafa, Akinsanya Kambon, Basil Kincaid, Ruben Ochoa, Catherine Opie, Calida Rawles, Alison Saar, Betye Saar, Ser Serpas, Alake Shilling, Henry Taylor, Jennifer West, Pae White, Michaela Yearwood-Dan and Jwan Yosef; entertainment and sports industry figures including Andre 3000, Beck, Matt Bellamy, Jamie Campbell Bower, Zach Braff, Cindy Crawford, Tyler the Creator, Larry David, Fran Drescher, Bobby Flay, Danny Fuller, Roxane Gay, David Alan Grier, Simon Helberg, Catherine Keener, Fai Khadra, Heidi Klum, Tina Knowles, Lisa Kudrow, Sugar Ray Leonard, Jared Leto, Melina Matsoukas, John McEnroe, Joe Montana, Timothy Olyphant, Gwyneth Paltrow, Lionel Richie, Margot Robbie, Carine Roitfeld, Kelly Rowland, Usher, Christoph Waltz, Steven Weber, Owen Wilson, Elijah Woodand Shailene Woodley.\nGallery Response\nWith over 120 participants, local and international galleries shared their praise for lively energy from collectors, institutional groups and the new location in Santa Monica.\nDeborah McLeod, Senior Director, Gagosian: ‘It has been an outstanding fair for Gagosian. Attendance is key – an impactful stream of collectors and museum professionals came through on the first day and throughout the fair. Rick Lowe made a stunning exhibition for the booth, and we are thrilled that several works are destined for important North American institutions. The airport location allowed the fair to spread out comfortably – and impressively, to present Chris Burden’s masterpiece, a 40-foot Skyscraper. Chris would have loved it!’\nMarc Payot, President, Hauser & Wirth: ‘This week, Los Angeles is our extraordinary Valentine: We opened our second Hauser & Wirth space here — a gorgeous site in West Hollywood with a sold-out show of works by George Condo — and our Frieze LA stand is a celebration of the Los Angeles artists in our program. Their paintings, works on paper, sculptures, and videos are a testament to the power, originality, and influence of the cultural producers of this amazing city. In addition, we are delighted to have placed works by Mark Bradford, Charles Gaines, Luchita Hurtado, Gary Simmons, and Henry Taylor in major private and institutional collections.’\nJessica Silverman, Owner: ‘Tracing spirit, survival, and growth, we put forward some of the most ambitious works by the artists we are showing at Frieze LA this year. We are delighted that many of these are now headed to prominent institutional and private collections. Our program continues to receive major acclaim up and down the West Coast.’\nChela Mitchell, Owner Chela Mitchell Gallery, ‘Some of the fair’s highlights have been engaging with people who resonate with my program and what I’m presenting. I’m pleased to have work placed in a few top 200 collections, which is wonderful. It shows that collectors at the top understand the importance of emerging work and growing with emerging artists. We’re happy for their support and even happier about what that means for our gallery moving forward. This is our first Frieze, and it has been magical. It’s hard work to put these shows together, but once everything is done and you see how this work impacts the community, it’s all worth it.’\nMarc Selwyn, Owner, Marc Selwyn Fine Art: ‘This was one of the most successful fairs for us in many years. There was unbelievable energy and a very sophisticated, high-calibre crowd. We saw significant sales each day of the fair, including a Lee Bontecou painting that sold the first hour of the opening day with an asking price of $290,000. Many of our sales were to clients who travelled outside the city to attend the fair. In addition to multiple sales to Los Angeles collectors, we placed work with clients from Italy, Korea, San Diego, and Washington D.C.’\nMaria Varnava, Owner, Tiwani Contemporary, ‘As the gallery’s first-ever fair in Los Angeles, we could not be happier with how well our presentation of Michaela Yearwood-Dan was received. All works were sold out on the opening day, including two notable placements to Canadian and Asian arts institutions. What makes this fair so unique, among others, is the strong and dedicated local collector base we saw throughout the fair run. We look forward to coming back.’\nAloisia Leopardi, Director, Richard Saltoun Gallery: ‘Frieze LA has been an excellent experience for us. We chose to present a solo stand showcasing the work of Polish fibre artist Barbara Levittoux-Šwiderska (1933-2019). This is the first time her work has been shown in California for almost 50 years (since 1977!), and we had an amazing response – selling her works to key private collections and now in discussion with two Californian museums. It was fantastic to expose Levittoux-Šwiderska’s artworks to such an impressive audience.’\nMichael Rosenfeld, Owner, Michael Rosenfeld Gallery: ‘Frieze LA was a great success selling Bob Thompson paintings and drawings to collectors and museums across the country. Every day, there was tremendous energy and enthusiasm, and the L.A. light in the tent was extraordinary. The positive energy and attendance surpassed my Frieze experiences in London and New York, and Frieze was a tremendous success on every level.’\nChan Kyu Woo, Chairman, Hakgojae Gallery: ‘It was our gallery’s first participation in Frieze Los Angeles, and I am delighted with the result. To me, Frieze LA is a wonderful place to present Korean artists to the L.A. community. The collectors, not only Korean Americans, inquired a lot about the artists we presented. I was so happy about it and felt Hakgojae Gallery moved forward in the international art market.’\nAnthony Meier, Owner: ‘It’s been a resounding success. We look forward to the great turnout, crowds, and museum visitors next year.’\nHannah Traore, Founder, Hannah Traore Gallery: ‘Participating in the Frieze Focus section has exceeded my expectations. The Frieze team’s and fellow exhibitors’ support has made this a truly career-changing experience. For a new boutique gallery like mine, the exposure and access that Frieze gives me are pivotal. I’ve met more collectors, collaborators, artists, and supporters over these past few days than I can meet in a few months at the gallery. It’s the kind of exposure that shifts my trajectory.’\nKurt Mueller, Senior Director, David Kordansky Gallery: ‘Our first presentation with Chase Hall sold out within the first opening hours of Frieze Los Angeles. We received an incredible response from notable institutions and collectors alike to these important works that engage the artist’s experiences as a youth in L.A. and our city’s social history in their exploration of race, access, and identity. On the eve of Hall’s first solo museum exhibition opening February 28 at the SCAD Art Museum in Georgia, we’re excited to be sharing his work with visitors who have come to L.A. from all over the world for the fair.’\nEsther Kim Varet, Owner, Various Small Fires: ‘There was such a robust response for our presentation at Frieze Los Angeles this year with our critically-acclaimed debut of Dyani White Hawk alongside works by Diedrick Brackens. We sold everything we presented, with several works headed for major institutions. I owe that to the great turnout of curators and museum leadership that came by throughout the fair’s opening days.’\nTina Kim, Founder, Tina Kim Gallery: ‘We were very excited to return to Frieze LA in its new Santa Monica location and found it to be a tremendously successful year! We are pleased to have placed works by several artists, including Pacita Abad, who we are preparing to show in our New York space during Frieze New York this May following the opening of her retrospective at the Walker Art Center, which will travel on to the San Francisco Museum of Art (SFMOMA).’\nAngela Brazda, Director, White Cube: ‘We had a great experience at Frieze LA and have connected with both longtime and new collectors. We were excited to introduce some of our emerging artists, including Danica Lundy, Louise Giovanelli, and Marguerite Humeau, to the L.A. market. We had strong sales during the opening day VIP preview and sold works by Günther Förg, Tracey Emin, Mona Hatoum, Antony Gormley, Robert Irwin, and Harland Miller, among others. Frieze LA was fascinating for us this year given our ambitions and expanding presence in the U.S. with our first New York gallery set to open this fall.’\nNicola Vassell, Owner: ‘Our first Frieze experience was successful. We placed several Ming Smith photographs, including with an important local institution. Our sales were robust, and the quality of our conversations was what we hoped.’\nSusanne Vielmetter, Owner, Vielmetter: ‘We decided to present a focused booth with sculptures by Arlene Shechet and drawings by Nicola Tyson. Both artists created a stunning juxtaposition of new works. The response to this beautiful presentation was enthusiastic, with most works sold in the first hour of the fair and great curatorial conversations. We could not be happier with the response this year!’\nKaren Galloway, Owner, Sow & Tailor: ‘My experience with doing Frieze Los Angeles for the first time has been amazing. I love how Amanda and Sonya curated the Focus section with intention and a diverse selection of artists. The sector gives a new perspective on what’s being made in emerging galleries across the country, with special attention to Los Angeles. During the fair, I was able to connect with so many different and interesting people, especially gaining more connections to institutions, curators and a strong audience who want to learn more about our programming and the artist we are presenting, Veronica Fernandez. I feel very grateful to be here and for the incredible reception to Veronica’s work with strong sales and incredible press for her presentation.’\nRodney Nonaka-Hill, Co-Owner, Nonaka-Hill: ‘Frieze Focus was a perfect venue to continue our reveal of Kyoko Idetsu’s work outside of Japan. Several people made it out to the gallery in Hollywood to continue the conversation – surely inspired by what they saw from our gallery’s presentation at Frieze.’\nGarth Greenan, Owner, Garth Greenan Gallery: ‘We’ve had great success for this year’s Frieze Los Angeles, placing a landmark installation by James Luna. Two major photographs by the artist are going to the Gochman Family Foundation, which is dedicated to Indigenous art, so we’re very pleased with the reception.’\nIvy N. Jones, Owner, Welancora Gallery: ‘For our first ever Frieze fair, we are delighted about how well such a broad audience received our presentation of work by Helen Evans Ramsaran and Chris Watts. In the fair’s first days, we sold most of our booth, placing 7 of 8 works in significant collections. The turnout was excellent, with plenty of institutional presence. We look forward to participating in Frieze Los Angeles again next year.’\nFrieze Los Angeles welcomed local and international museum and institutional groups, including the Carnegie Museum of Art, Hirshhorn Museum and Sculpture Garden, Institute of Contemporary Art, Los Angeles (ICA LA), Institute of Contemporary Art, Miami, The J. Paul Getty Center, Los Angeles County Museum of Art (LACMA), MAXXI – National Museum of 21st Century Arts, The Metropolitan Museum of Art, Mori Art Museum, Museum of Contemporary Art, Los Angeles (MOCA LA), Orange County Museum of Art, Museum of Modern Art, New York (MoMA), Mint Museum, New Museum, Phillips Collection, SculptureCenter, Serpentine Galleries, Studio Museum, TANK Shanghai, Tate, VIA Art Fund and Walker Art Center.\nFrieze Projects\nThis year, Frieze Projects included a series of performances and outdoor artworks installed on-site, curated by the Art Production Fund and titled Now Playing. The special section received support from Art of Recovery, the City of Santa Monica Cultural Affairs initiative. It included artists Autumn Breon, Chris Burden, Jose Dávila, Basil Kincaid, Divya Mehra, Ruben Ochoa, Alake Shilling and Jennifer West. In addition, Ochoa’s Revolution Carts and Class: C Mobile Gallery sold over 1,000 tamales, and Shilling’s Buggy Ball brought out 200 people to participate in soccer clinics in association with Los Angeles Football Club (LAFC), involving 150 artist-designed soccer balls.\nAn off-site portion was exhibited throughout culturally and architecturally significant sites in the Westside of Los Angeles, curated by Jay Ezra Nayssan and Del Vaz Projects. Each provided a setting for new and imagined relationships between place and artist, history, and fiction, including artists Kelly Akashi, Julie Becker, Tony Cokes, and Nicola L. and a tribute from Jonathan Hepfer to the late curator Walter Hopps.\nDeutsche Bank Frieze Los Angeles Film Award\nThe fair also saw the fourth edition of the Deutsche Bank Frieze Los Angeles Film Award, realized in partnership with global film and T.V. studio FIFTH SEASON and acclaimed non-profit academy Ghetto Film School. The award offers a $10,000 prize for the winning film to one of nine fellows and a $2,500 prize for the winner of the Audience Award as voted for by the public. This year’s award was given to Irene Gil-Ramon for her film Best Day of My Life (in L.A.), while Shandrea Evans took home the Audience Award for her film Saturday.\nClaudio de Sanctis, Head of Deutsche Bank International Private Bank and CEO of EMEA, said: ‘I have been thoroughly impressed by the quality of films produced by such a talented group of emerging artists. This year’s theme could not have been more relevant and important in our world today, and my sincere congratulations go to our two winners. In addition, I am delighted that for the first time, both the jury and audience awards have been won by women, showcasing the depth of diverse talent that exists here in Los Angeles.’\nAdditionally, the fair held a dedicated section for various non-profit organizations that work towards equity and inclusion. These included 90220 Gallery, AMBOS, Carolyn Glasoe Bailey Foundation, GYOPO, People’s Pottery Project and Reparations Club.",
  "word_count": 3474,
  "scraped_at": "2026-02-14T13:34:16.242515"
}