{
  "article_id": "98c92c9fb57d",
  "url": "https://www.the42.ie/leanne-kieran-ruesha-littlejohn-5968010-Jan2023/",
  "title": "Positive injury updates as Republic of Ireland duo near respective returns",
  "date": "20230113T014500Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "REPUBLIC OF IRELAND striker Leanne Kiernan is “still on course for a February return,” Liverpool manager Matt Beard has confirmed.\nAnd there’s further positive injury news for the Girls In Green as Ruesha Littlejohn also nears a comeback with Aston Villa.\nKiernan has been out of action since the opening day of the Women’s Super League [WSL] season in mid-September, Liverpool’s stunning victory over Chelsea marred by a significant ankle injury to the Reds’ 2021/22 Player of the Year and top goal-scorer.\nThe Cavan star underwent surgery and was expected to miss “several months” — a blow for Ireland as she was ruled out of their World Cup play-off win over Scotland at Hampden Park.\nA native of Glasgow and former team-mate of Kiernan’s at West Ham, Littlejohn also missed that historic night, having sustained a serious foot injury in the qualifier which ultimately secured the play-off — a 1-0 win over Finland at Tallaght Stadium on 1 September.\nThe 32-year-old midfielder featured in last month’s Conti Cup clash against Durham, but suffered another setback soon after.\nSpeaking to her twin sister, presenter Shebahn Aherne, on 90min Football this week, Littlejohn explained: “It’s been long. That’s me a solid three months, except from having 45 minutes against Durham and then got injured again, so that was fun.\n“I obviously was out with a broken foot, then came back, probably done too much too soon and then tweaked my calf.\n“I had a wee Grade One calf strain — which I had actually planned just so I could really enjoy Christmas,” she added jokingly. “I didn’t need to do the MAS test when I came back so it was well planned!”\n“But I’m good now, back on the pitch, just integrating back in with the squad, so it’s been good. It’s been nice. It’s been long, but I’m looking forward to hopefully being the other side of injuries.”\nKiernan appears a little further off, though Beard offered a positive update on the 23-year-old’s progress in his first Liverpool FC column of 2023 today.\n“On the injury front, Leanne Kiernan is still on course for a February return,” he wrote ahead of this weekend’s meeting with Manchester City. “We haven’t had any setbacks but with the type of injury it was we need to be careful and take it week by week.\n“She is progressing well, she was at St George’s Park last week, which was great for her, and she did a bit of running.\n“So, it’s another step in the right direction, and when we get her back that is going to be like another new signing for us.”\nIt’s positive news for Vera Pauw as competition for her World Cup squad heats up.\nMeanwhile, record-breaking Liverpool defender Gilly Flaherty has announced her retirement from football.\nA current team-mate of Kiernan, Niamh Fahey and Megan Campbell, the 31-year-old won four Women’s Super League titles, seven Women’s FA Cups and a Uefa Cup during a trophy-laden career, which saw her play for Arsenal, Chelsea and West Ham before moving to Merseyside last summer.\nFlaherty, who won nine caps for England, also became the WSL’s all-time record appearance holder last November, passing the mark set by Lionesses great Jill Scott, and she hangs up her boots having played 177 WSL matches.\n- Additional reporting from Press Association",
  "word_count": 555,
  "scraped_at": "2026-02-14T12:21:41.286502"
}