{
  "article_id": "98d7b391566d",
  "url": "https://www.businesstimes.com.sg/lifestyle/bt-luxe/kiat-lim-rising-son",
  "title": "Kiat Lim : The rising of the son",
  "date": "20250918T103000Z",
  "domain": "businesstimes.com.sg",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "‘I’m okay with being criticised’: Kiat Lim, son of billionaire Peter Lim comes into his own\nBrushing aside accusations of nepotism, the offspring of billionaire Peter Lim is coming into his own\nTHERE are multiple minders hovering anxiously around Lim Wee Kiat, better known as Kiat Lim. But the man himself seems relaxed and thoroughly enjoying himself. The occasion is a photo shoot, held in the offices of RSP Architects Planners & Engineers, where he is chairman. And Lim is in his element.\nCooperative, jokey and self-deprecating at times, the 32-year-old occasionally breaks into Hokkien and Singlish, giving buddy vibes instead of billionaire ones. You wonder what he’s like when he hangs out with his superstar friends such as musician JJ Lin and footballer Cristiano Ronaldo.\nHe is, after all, the only son of former “Remisier King” and self-made tycoon Peter Lim, whom Forbes estimates to have a net worth of some US$1.8 billion.\nOf late, the family-controlled businesses Lim is involved in have been making the news. Last month, mainboard-listed Thomson Medical Group (TMG), at which he is executive vice-chairman, unveiled an RM18 billion (S$5.5 billion) Johor Bay mega project encompassing medical, hospitality, residential and lifestyle elements.\nMeanwhile, RSP will build the Johor royal family’s US$200 million, 27-hectare residence in Desaru. On top of that, Lim was in March named president of Spanish football club Valencia, which his father owns.\nAre the flurry of major announcements a declaration that he has taken the reins from his 72-year-old dad?\nNavigate Asia in\na new global order\nGet the insights delivered to your inbox.\nLim hesitates.\n“I respect my father too much to say I’ve taken over. But the answer is yes. My caveat, though, is I will always respect his position and his decisions, because he is my boss as well.”\nHe points out that his father – a fishmonger’s son who had worked as a taxi driver, cook and waiter – is a man of calibre who would not pass the baton to the next generation if he believed it would all be lost. “So, hopefully, he sees something in me.”\nOn echo chambers and nepotism\nWhen it comes to work, the father-son duo have a mentor-mentee relationship, with Lim learning a lot vicariously and through his own “escapades”. Interestingly, they are both very aligned in terms of risk appetite, decisiveness and willingness to take action. But to be clear, there was no daddy-pressure.\n“Did he ask me to purposely create more work for myself by going to a new region? Or by launching a big-ass project in Johor? No, it is my character to want to do more. But, I guess the most important thing is, when I die one day, will I be content having a lot of money? Or, will I be more content knowing that I lived an entrepreneur’s life?”\nAs a (very) rich man’s son, Lim has long got over accusations of nepotism and speaks about it very matter-of-factly.\n“Who doesn’t want a better outcome for the company than the owner of the company? But if you do things well, you’re just lucky, you’ve got resources. If you do it badly, you’re stupid. I’m not saying this out of self-pity. It’s factual. It’s just human nature. I’m okay with being criticised. Look, I took the presidency for the club (Valencia) and anybody who takes this role will be criticised.”\nHis business style involves “a very bottom-up, top-down interaction” where there is room for employees to push for something they believe in, even if he is not on board with the idea.\n“I would hate to be in an echo chamber where everybody says ‘yes, yes, yes’. So my approach is: I have my views, you have yours. If we agree, that’s the best. If we disagree, you, being the professional, will always have one extra vote. But if you screw it up, then it’s on you lah.”\nWhich is why he hires a core team of industry experts better than himself, especially given the diverse businesses he is in. That leaves him in a “nice middle point” where he is able to consider both commercial and non-commercial factors when making decisions, and accept lower returns to achieve longer-term goals.\nRSP front and centre\nLim speaks with pride about RSP, which will mark its 70th anniversary next year. His father bought the firm, a winner of several President’s Design Awards, back in 2013. Since taking over as chairman in 2023, Lim has overseen its global expansion, including the establishment of a global design hub in Dubai last year, where revenue has trebled in the last five years.\nMajor ongoing Middle East projects include Karl Lagerfeld Villas in Dubai, Nobu Hotel & Residences in Abu Dhabi and Armani Hotel & Residences in Diriyah, Saudi Arabia.\nBy his own admission, Lim has been pushing the RSP team “a lot”. There have been investments in infrastructure and digital capabilities as well as a rebranding and more aggressive marketing. Revenue, which was S$64.8 million at end-2022 before he took over, is expected to exceed well over S$100 million this year.\n“We’ve done over 2,500 projects globally, which is a lot, right? But I think people don’t understand the number of jobs we do.”\nThat might well be, but they sure are noticing RSP’s attention-grabbing deal to build the Johor royals’ residence. Lim was having dinner with the Regent of Johor, Tunku Ismail Sultan Ibrahim, when the latter mentioned he wanted to build the home.\n“So we took a stab at it and he liked the initial proposal a lot,” recalls Lim, whose family is close to the royal’s. The RSP team has also designed for royalty in other parts of the world and has “a bit of track record” in understanding the nuances that come with such projects.\nAnd, of course, the personal ties go a long way.\n“He’s a very family-oriented man. Having travelled with him, I understand how he wants family and friends to be in the same compound, yet have enough privacy, and for the residence to accommodate his security, entourage and whatever comes with someone of his stature.”\nOpportunities for TMG\nIf the current vision for RSP is about strengthening its presence in the Middle East and beyond, then the one for TMG is to take advantage of opportunities nearer our shores.\nLim’s father acquired what was then a specialist maternity and paediatric hospital in 2011. In 2022, he appointed his son – then just 29 – to his current position, effectively helming a company with a market capitalisation of over S$1.6 billion today.\nThe Johor Bay integrated project announcement followed TMG’s US$381 million acquisition of healthcare operator Far East Medical Vietnam in 2023, hailed as the largest deal of its kind in South-east Asia since 2020.\n“An industry like this is a gem in this part of the world with its ageing populations and private insurer and private hospital penetration,” notes Lim. “Healthcare is defensive and offers growth; it ticks a lot of boxes and the size is also good for private money to be deployed.”\nBut running hospitals is very hard and complex work. So high-end hospitals are preferred as it’s a segment where people willingly pay.\nAnd while Thomson Medical Centre has “a happy business” looking after women and delivering babies, the hospital is branching into other areas such as orthopaedic surgery and oncology.\n“We’re offering more services because we still have so much room for expansion,” says Lim, adding that the group is also looking at doing neurosurgery, gastroenterology and ophthalmology. “We can do more, a hundred per cent.”\nVamos Valencia\nNo conversation with Lim can take place without discussing the hot potato that is Valencia.\nLim senior’s acquisition in 2014 helped the club avert bankruptcy after years of mismanagement. But Valencia’s fortunes have had a heart-attack triggering trajectory in the Spanish league. It had a few good years but failed to finish any higher than ninth in the last six seasons, and came dangerously close to relegation when they fell to 16th in the 2022/2023 season.\nWith the game being all about passion, it didn’t take long for grateful fans to turn into disgruntled ones who wanted the Singaporean owner out.\nAn ardent football lover like his father, Lim admits the sport has become work, with player costs having “risen 10 times” while revenues have not increased drastically.\n“Of course, I’m a fan of the club, how can I not be? But it’s important to be able to segregate emotionally when making certain commercial decisions because without that discipline, the club will risk going bankrupt, which was how we ended up buying it in the first place.”\nBesides, he wants to look ahead.\nFor a start, Valencia in June announced it secured funding for its new 70,000-seat stadium – a huge jump from the current stadium’s 49,000-plus capacity. Set to open in 2027, it will be Spain’s fourth-largest, with about 15 times the number of hospitality seats today and 365-day programming, including multi-purpose event hosting. Lim has said it is expected to more than treble the club’s current revenue.\nHe has also brought in former Chelsea chief executive officer Ron Gourlay, who oversaw one of the most successful periods in the English club’s history. And finally, there was the club’s “monster of a transfer window” this summer, with some eight incoming players and 12 outgoing.\n“We have a proper sporting plan. Not to say that we didn’t in the past, but now we have professionals in place, similar to healthcare, similar to architecture.”\nAnd no, the club’s not for sale – at least not for now.\n“There have been rumours of us selling every year since we bought the club. Very clearly at this point in time, we’ve put in so much effort, we want to see the plan through,” is Lim’s response. “It’s a game you’re in because you want to create something. Maybe you can judge me in five years’ time.”\nBuilding a family\nFamily life has been particularly satisfying for Lim, who is married with a four-year-old daughter and two-year-old son. He has always wanted to start a family young to keep the age gap with his kids small – unlike the 40 years between him and his father.\n“My kids are my life. But one day, they’re going to be teenagers and they’re not going to care about me anymore. When that happens, I want to still have the energy to do my own thing, travel and enjoy myself.”\nFatherhood has made him a bit more self-reflective and cognisant that whatever he does will affect his children. He finds time to be with them, although work never really stops for a business owner, so he’s routinely sending e-mails or voice messages while at the playground. And then there is the travelling. In the first three months of this year, he was in 13 cities, although right now, he is “purposefully staying in Singapore”.\nIn any event, he’s very contactable. “Everybody knows that when they message me, they can usually get an answer within three minutes. But if I don’t reply, it’s because I don’t reply. So you know now ah!” he says with a laugh.\nReflecting on his own growth process, which was “a very linear and accelerated sink-or-swim approach”, he admits without elaborating, that he’s had his issues.\n“I’ve had to force myself to grow up a lot,” he says, even as he acknowledges he is very fortunate. “I’m not doing butterfly strokes. I’m swimming, but that’s good enough.”\nHe hopes his children will be mentally strong, but ultimately, he just wants them to be kind.\n“My kids keep me going, in that I want to be a better role model for them. Hopefully, they will be able to see my actions just as I did with my dad.”\nPhotography: Darren Gabriel Leow\nFashion direction: CK\nGrooming: Grego Oh, using YSL Beauty and Revlon Professional\nDecoding Asia newsletter: your guide to navigating Asia in a new global order. Sign up here to get Decoding Asia newsletter. Delivered to your inbox. Free.\nCopyright SPH Media. All rights reserved.",
  "word_count": 2022,
  "scraped_at": "2026-02-14T13:22:13.201258"
}