{
  "article_id": "991de25dfcfb",
  "url": "https://www.spokesman.com/stories/2026/jan/25/seahawks-jaxon-smith-njigba-rises-to-occasion-in-n/",
  "title": "Seahawk Jaxon - Smith Njigba rises to occasion in NFC Championship Game",
  "date": "20260126T081500Z",
  "domain": "spokesman.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Seahawks’ Jaxon-Smith Njigba rises to occasion in NFC Championship Game | Notebook\nSEATTLE – The morning of the biggest football game of his professional career to date, a text popped up on the phone of Jaxon Smith-Njigba from his mom.\nThe message: You’re built for this.\n“I’m built for moments like this where it’s all on the line. I love games like this. I love moments like this,” Smith-Njigba said.\nThe best wide receiver in the NFL this season played up to that label in the most important game of the season for the Seahawks and had a significant part in Seattle’s 31-27 win over the Los Angeles Rams in the NFC title game on Sunday night.\nSmith-Njigba can cancel any plans he had for participating in the Pro Bowl Games. He can turn down his invite for NFL Honors where he’s one of the favorites to win Offensive Player of the Year. He’ll be too busy preparing for the first Super Bowl of his career.\nSmith-Njigba’s been on plenty of big stages in his football journey to date. He played for high-school football titles in Texas at AT&T Stadium. He played in the Michigan-Ohio State rivalry. He played for a college national championship and put up numbers in a Rose Bowl – 15 catches for 347 yards and three touchdowns – that may never be matched.\nAnd now with a chance at the Super Bowl on the line, Smith-Njigba added another big performance in a big game to his résumé.\nSmith-Njigba had 10 catches for 153 yards and a touchdown in the victory over the Rams. He made contested catches while withstanding big hits. He flashed open leaving Rams defensive backs wondering where he went. He saw his quarterback Sam Darnold stand in and deliver a perfectly timed pass while getting drilled on a 14-yard TD pass in the dying seconds of the first half that gave the Seahawks a 17-13 lead they would never relinquish.\nThe 10 catches were the most he’s had in any game this season. The 153 yards were fourth-most in his career. He had seven catches and 115 yards before halftime then added one more reception and drew a pass interference penalty on Seattle’s final possession as it bled critical time off the clock.\n“I can just say for myself I love big games, I love big moments where I just leave it all out on the field and we see what happens,” Smith-Njigba said.\nSmith-Njigba’s big game shouldn’t be a surprise. The best game of his career came last year against the Rams and he had nearly 100 yards of receiving when the teams met in Week 16.\nHe also was an afterthought, for the most part, a week ago in his first playoff experience against the 49ers. It was almost boring.\nSmith-Njigba had just three catches – albeit one of them for a touchdown – and a meager 19 yards receiving in the divisional round playoff victory over San Francisco. It was easy to take a back seat when a 41-6 blowout is the result.\nBut if there was a reminder needed of how valuable Smith-Njigba remains to everything the Seahawks want to do offensively, it came against the Rams. And it started early with five of his seven receptions in the first half going for at least 10 yards, including a 42-yarder that was part of the drive capped with his touchdown catch.\n“We need those efforts to be productive on offense,” Seahawks coach Mike Macdonald said. “I’m happy for (Jaxon), man. The guy is an absolute stud.”\nMore Bobo\nJake Bobo is going to end up with one of the stranger stat lines in the entire league when he looks back at the 2025 season.\nTwo catches in 11 regular season games, most of which he was stuck on special teams and barely getting snaps on offense.\nAnd two catches in the NFC playoffs, including a touchdown.\nBobo caught a 17-yard TD pass early in the third quarter that gave Seattle a 24-13 lead. It was his first TD catch since grabbing one in Week 18 of the 2024 season against … the Rams.\nBobo flashed across the middle of the end zone and for the second straight week came up with a big catch in his limited opportunities to get snaps offensively. He had a key 16-yard reception last week against the 49ers.\n“I owe Sammy (Darnold) a couple of beers for the shot that he took, but so much respect for him standing in there and taking that. We got the coverage that we were hunting. If (Jaxon) wasn’t there I knew he was coming to me over the middle,” Bobo said. “So obviously very thankful and happy to contribute.”\nUntil last week, Bobo hadn’t caught a pass since Week 7 against Houston. His only other reception came all the way back in Week 4 in Arizona.\nBobo had 19 catches and two touchdowns as a rookie in 2023, but has seen his offensive role diminish the past two seasons. It makes the chances he does get a little more special.\n“It goes back to this group. It’s not really hard with this group. You want to play for these guys,” Bobo said. “Good dudes. Sam. Ernest (Jones IV), the guys that I named previously. I mean, it’s a lot of fun to come into work every day, and it’s not hard to go to battle for these guys.”\nNew turf incoming\nSunday was the last time this current playing surface inside Lumen Field will be used for a football game.\nIt went out with a victory and covered in confetti.\nThe current turf is expected to come out of the stadium in March and be replaced by a grass surface that will be used for the FIFA Men’s World Cup beginning in June. The grass surface will also be used for a handful of Sounders and Reign matches before the World Cup begins and a U.S. Women’s National Team match against Japan in mid-April.\nThe Sounders will play their regular season opener against Colorado on Feb. 22 on the current artificial surface before spending all of March playing away from Lumen Field while the grass field is installed.\nThe current FieldTurf surface was installed in 2024 and a new version is expected to be installed after conclusion of the World Cup.\nInjuries\nThere were only two notable injuries from the victory and both happened in the second half.\nLinebacker Drake Thomas might be the most concerning as he suffered a shoulder injury that caused him to briefly go to the locker room. He did return to the sideline before the end of the game.\nSpecial teams standout Brady Russell suffered a hand injury and was ruled as being out during the fourth quarter. He came back to the sideline with a wrap on his hand.\nIn the midst of all the celebration, Macdonald was not asked about the injuries after the game.",
  "word_count": 1165,
  "scraped_at": "2026-02-14T12:38:40.296490"
}