{
  "article_id": "9927b7ce8c55",
  "url": "https://punchng.com/epl-fulham-defend-bassey-against-online-abuse-after-fa-cup-win/",
  "title": "EPL : Fulham defend Bassey against online abuse after FA Cup win",
  "date": "20250303T151500Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Fulham have condemned the racist and homophobic abuse directed at their defender, Calvin Bassey, online after he scored in Sunday’s FA Cup victory over Manchester United.\nNigeria international Bassey gave his side the lead before half-time in the match, which ended 1-1 at Old Trafford before Fulham overcame the hosts on penalties to qualify for the FA Cup quarter-finals.\n“Fulham Football Club is utterly appalled at the racist and homophobic abuse received and subsequently shared by Calvin Bassey on social media after Sunday’s FA Cup tie against Manchester United,” the club said in a statement on Monday.\n“We strongly condemn this abhorrent behaviour, which has no place in football or society. Such actions are entirely unacceptable, and we stand in full support of Calvin Bassey, who will continue to receive our full backing.\n“We will do everything in our power to work with the relevant authorities to identify the perpetrators of these vile messages and take the strongest possible action against them.”\nManchester City’s Kyle Walker also faced online racist abuse after their loss to Juventus in the Champions League in December.\nIn February, City forward Khadija Shaw missed a match for mental health reasons after facing racist abuse following a loss to Arsenal in the Women’s Super League.\n“Fulham Football Club is committed to maintaining a firm stance against all forms of discrimination and remains dedicated to fostering an environment of respect and inclusion,” Fulham added.\nFulham will host Crystal Palace in the FA Cup quarter-finals on March 29.",
  "word_count": 250,
  "scraped_at": "2026-02-14T12:49:34.301814"
}