{
  "article_id": "993547f17717",
  "url": "https://www.aol.com/news/lionel-messi-wins-fifas-best-031235283.html",
  "title": "Lionel Messi wins FIFA best player award over Kylian Mbappe",
  "date": "20230228T113000Z",
  "domain": "aol.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lionel Messi wins FIFA's best player award over Kylian Mbappe\nAfter besting him on the World Cup stage, Lionel Messi beat out Paris Saint-Germain teammate Kylian Mbappe for FIFA's best men's player award.\nMessi was announced as the 2022 winner on Monday at the Best FIFA Awards ceremony in Paris. FC Barcelona's Alexia Putellas was named the best women's player for a second straight year.\n\"It's amazing,\" Messi said at the ceremony, per the BBC. \"It's been a tremendous year, and it's an honor for me to be here and win this award. Without my teammates I wouldn't be here.\n\"I achieved the dream I had been hoping for for so long,\" Messi continued, referring to December's World Cup title. \"Very few people can achieve that, and I have been lucky to do so.\"\nMessi secured the honor after leading Argentina to a thrilling victory over France in a World Cup final that went to penalty kicks. Messi scored two goals in the final that secured a third World Cup crown for Argentina and the first of his career. Mbappe countered with a hat trick, but like on Monday, had to settle for second place.\nMonday's honor marked Messi's second time securing the award. He totaled 52 points in the voting tally while Mbappe finished second with 44. The voting panel consisted of national team captains and coaches and journalists. An online fan vote was also part of the equation.\nMessi was also honored in December with the Golden Ball award honoring the World Cup's best player. Mbappe earned the Golden Boot as the World Cup's top goal scorer.\nFrench Real Madrid star Karim Benzema finished third in FIFA best player voting with 32 points. He missed the World Cup with a thigh injury. He won the Ballon d'Or in October, marking just the second time in 14 years that neither Messi nor Cristiano Ronaldo won soccer's most prestigious individual honor.\nPutellas beat out American Alex Morgan and England's Beth Mead for the women's award. She scored 34 goals across all competitions in 2022 and won the award despite missing Euro 2022 with an ACL injury that threatens to sideline her for July's World Cup.",
  "word_count": 365,
  "scraped_at": "2026-02-14T12:52:04.613036"
}