{
  "article_id": "9969981f5f38",
  "url": "https://www.liverpoolfc.com/news/story-how-liverpool-fc-women-came-be-30-years-ago",
  "title": "The story of how Liverpool FC Women came to be 30 years ago",
  "date": "20241011T143000Z",
  "domain": "liverpoolfc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FeatureThe story of how Liverpool FC Women came to be 30 years ago\nThis year marks three decades since Liverpool FC Women, as we now know it, became officially part of the club brand for the first time.\nAhead of Sunday's Anfield meeting with Manchester City in the Barclays Women's Super League, the club has certainly come a long way.\nIt was actually founded in 1989 as Newton LFC, by former England international Liz Deighan.\nThe club was renamed Knowsley United WFC two years later, becoming the founding members of the National Premier Division organised by the WFA.\nIn 1994, the side then took on the official club brand and became known as Liverpool FC Ladies.\nThis led to hopes of a brighter future and they reached consecutive Women's FA Cup finals.\nThey lost 3-2 to Arsenal at Prenton Park in 1995, despite twice being ahead through Karen Burke goals, with Marieanne Spacey scoring a late winner for the Gunners.\nIn the 1996 final, Liverpool, with a future England star in 15-year-old goalkeeper Rachel Brown, drew 1-1 with Croydon at The Den, but ultimately lost on penalties after extra-time.\nThe Reds became a founding member of the top-tier Women's Super League in 2011, and a year later were the first English football club to offer every female player full-time professional contracts.\nAfter a number of different managers came and went, Matt Beard was appointed as the new boss in 2012. He then brought in the likes of USA stars Whitney Engen and Amanda Da Costa, along with Swedish winger Louise Fors and Germany's Nicole Rolser.\nWith one of the most famous names in women's football, Fara Williams, patrolling the midfield, Gemma Bonner a rock at the back with Becky Easton, promising future star Lucy Bronze, plus goal machine Natasha Dowie up top, Beard's side were gearing up for major success.\nHe guided the team to back-to-back WSL titles in 2013 and 2014, clinching the latter on a dramatic final day of the campaign.\nFollowing Beard's departure for the Boston Breakers, a number of managers followed – Scott Rogers, now back at the club as assistant, Neil Redfearn, Chris Kirkland and Vicky Jepson.\nDuring the COVID-19 pandemic, a curtailed 2019-20 season saw the team, by now under the name of Liverpool FC Women, relegated to the FA Women's Championship.\nHowever, Beard returned for a second spell in the summer of 2021 and promptly steered the Reds back to the WSL.\nGreat progress has since been made and a move to the historic AXA Melwood Training Centre as their new headquarters continues to make a big difference, along with the switch to a new home ground this season, St Helens Stadium.\nBeard oversaw an impressive top-four finish in 2023-24 and hopes are high for a bright future for the current team.\nFor Dowie, now the club's first women's ambassador, representing LFC remains a major part of her life.\n\"Liverpool FC means everything to me,\" she told Liverpoolfc.com. \"When I look back on my football career, it's one I'm really proud of that spanned over 20 years in six different countries, but my fondest memories are my time with Liverpool, especially the two seasons we won the league back to back.\n\"The group of girls we had there, some of them have become friends for life. And now as an ambassador of the club, it's just great to stay involved and still feel part of the Liverpool family.\"\nDowie has the distinction of being the only LFC Women player to score at Anfield – during a Women's FA Cup tie with Arsenal in April 2013.\n\"I am very proud of that but I do hope somebody else can do it for us this weekend against Manchester City,\" she continued.\n\"I remember the goal well, a diving header at the Kop end against Arsenal, but unfortunately we lost 2-1 in the semi-final. But we paid them back a week later by beating them 4-0 at the Emirates.\n\"All those memories just put smiles on my face. My guard of honour at Anfield last season was so special.\n\"Honestly, they are the most special moments in my whole career and I can't thank the club enough.\n\"It's hard to win trophies in your career and you can see how hard the WSL is now, so for us to do what we did in 2013 and 2014 I think needs to be really celebrated. Because for Arsenal to do what they did in the women's game for so long and then for Beardy to create this team from nothing and go on and win successive titles was really special.\n\"I'm lucky now with my job that I get to Anfield for every home game and you never take it for granted and when you hear You'll Never Walk Alone, it's just the best feeling ever.\"\nLiverpool have made an unbeaten start to the new WSL season and head in to their Anfield clash with City having dramatically won 3-2 at Tottenham Hotspur last weekend.\nOn the trajectory of the club, Dowie said: \"The move to the AXA Melwood Training Centre and a new home stadium in St Helens is all really positive for Liverpool.\n\"And we need to celebrate how far we have come and also keep trying to focus on what more we can do and what needs to improve.\n\"But as a young girl that never thought she could be a footballer, to see where the game is right now puts a smile on my face.\"\nBeard's side will be aiming for another piece of history when they take on last season's WSL runners-up in a 3pm BST kick-off on Sunday: a first victory at Anfield.\nDowie believes the hosts need to go out and play with no fear.\nShe said: \"Just play the football that they can play. If you look at some of the games last season and the year before even – beating Arsenal at the Emirates, beating Chelsea at Prenton Park, doing the double over Manchester United – we know we can go up against these teams.\n\"The girls almost need to forget they are playing at Anfield and treat it as just another game, use that as more motivation, enjoy it because we probably haven't enjoyed these occasions enough and let the stadium, the whole atmosphere, get on top of us.\n\"Let's go back to basics and then if we can play the type of football I've seen this team play then we can really give a good account of ourselves.\"\nThe last time Liverpool beat City was in May 2023, when Dowie scored her last goal on home turf for the club she loves, one that claimed a place in the record books too.\n\"I won't forget that one, it was a brilliant day!\" she reflected. \"The sun was shining, my family were all there and I didn't realise it would be my last goal at home before I got my final one for the club a week later at Villa Park.\n\"It was special hearing the fans singing my name and to get the win was brilliant and made it extra-special.\n\"I'm really glad I got to end my career at Liverpool when Beardy brought me back. Every goal I enjoyed, but that one against City helped me become the first Liverpool FC Women player to reach 20 goals in the WSL, which is really special.\"",
  "word_count": 1239,
  "scraped_at": "2026-02-14T12:23:06.025259"
}