{
  "article_id": "9987e7f6930b",
  "url": "https://www.fox4news.com/news/children-risks-texas-school-rankings-2024-25-best-schools-top-performing-districts-revealed",
  "title": "Children At Risk Texas school rankings 2024 – 25 : Best schools and top - performing districts revealed",
  "date": "20251114T023000Z",
  "domain": "fox4news.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Children At Risk's Texas school rankings 2024–25: Best schools and top-performing districts revealed\nHOUSTON - Children At Risk released its 2024–25 Texas School Rankings this week, naming the state’s top public schools and highlighting improvements across regions despite years of stagnant school funding.\nThe annual report evaluates more than 7,000 public campuses using a mix of test performance, student growth, equity and college readiness metrics.\nChildren At Risk CEO on the results\nWhat they're saying:\nAt a press conference in Houston announcing the region’s top schools, Children at Risk President and CEO Bob Sanborn said this year’s results show encouraging academic progress statewide, especially among campuses serving economically disadvantaged students.\n\"When we see this improvement like we're seeing, it's sort of an amazing thing. It means everyone's doing the right thing,\" said Sanborn.\nSanborn, who started the rankings two decades ago, said the nonprofit’s goal has always been to build public excitement and accountability around school performance.\n\"People get excited about college football rankings, and I wanted them to be excited about what’s happening in our schools in Texas,\" he said.\nSanborn credited leadership at both the district and campus levels. \"In most cases, it starts with a leader at the top and then leaders within the schools who are really doing the right things to make sure their kids can be successful,\" he said.\nHe also emphasized that the gains occurred despite limited state investment. \"For four years the state legislature really did not increase funding for public schools,\" Sanborn said. \"We’ve seen this improvement without this increase in funding.\"\nA mouth-and-nose cover lies on a school desk next to a pencil case and school books during a lesson of a fifth grade of the Friedrich-Schiller Gymnasium. (Photo by Marijan Murat/picture alliance via Getty Images)\nTop-Ranked Schools\nBy the numbers:\nHigh Schools\n- School for the Talented & Gifted in Dallas ISD\n- Judge Barefoot Sanders Law Magnet in Dallas ISD\n- Carnegie Vanguard High School in Houston ISD\n- DeBakey High School for Health Professions in Houston ISD\n- Westlake Academy, a Tarrant County charter school\nMiddle Schools\n- Sudie L. Williams Talented & Gifted Academy in Dallas ISD\n- T.H. Rogers School in Houston ISD\n- School for the Talented & Gifted in Pleasant Grove in Dallas ISD\n- Lawler Middle School in Frisco ISD,\n- Spring Branch Academic Institute in Spring Branch ISD\nElementary Schools\n- Carroll Elementary School of Carroll ISD\n- Mandarin Immersion Magnet School in Houston ISD\n- Memorial Drive Elementary School in Spring Branch ISD\n- Windsor Park Gifted & Talented in Corpus Christi ISD\n- West University Elementary School in Houston ISD\nGold Ribbon Schools\nDig deeper:\nChildren At Risk also released its Gold Ribbon lists, recognizing high-performing, high-poverty schools, those with student bodies over 75% economically disadvantaged that still earn A or B ratings. This year, the program expanded to include high-performing charter and magnet schools that serve large economically disadvantaged populations.\nIf the previous criteria had remained, Sanborn said, the number of Gold Ribbon campuses still would have increased. But the expanded criteria reflect \"extraordinary magnets\" and \"high-performing charters\" across Texas.\nGold Ribbon High Schools\n- Judge Barefoot Sanders Law Magnet in Dallas ISD\n- Marvin E. Robinson School of Business & Management at Dallas ISD\n- School for Health Professions at Dallas ISD\n- Trinidad Garza Early College at Mt. View in Dallas ISD\n- Challenge Early College High School in Houston ISD\nGold Ribbon Middle Schools\n- School for the Talented & Gifted in Pleasant Grove in Dallas ISD\n- Young Women's Leadership Academy in Aldine ISD\n- Project Chyrsalis Middle School in Houston ISD\n- Amigos Por Vida Friends For Life Charter School\n- Hillsboro Junior High School in Hillsboro ISD\nGold Ribbon Elementary Schools\nGold Ribbon elementary lists were dominated by Laredo ISD and other South Texas districts.\n- Heights Elementary School in Laredo ISD\n- Ryan Elementary School in Laredo ISD\n- Leyendecker Elementary School in Laredo ISD\n- Daiches Elementary School in Laredo ISD\n- Kazen Elementary School in United ISD\nCall for continued investment\nWhat's next:\nWhile celebrating improvements, Sanborn warned that continued progress will require policy support.\n\"As we move forward, think of the possibilities if the state legislature said schools are a priority, not vouchers, but our public schools and if we funded them accordingly, the possibilities that are there, because we have the leadership in Texas, we certainly have the students, we all know that, and we really could be doing a lot better,\" he said.\nAbout Children At Risk\nThe backstory:\nChildren At Risk, a Texas-based research and advocacy nonprofit, evaluates issues affecting children statewide, including education, health, safety and economic mobility. The organization uses its annual rankings to elevate successful school models and foster conversations around equity and school quality.\nChildren at Risk uses a multi-index system that averages four major components:\n- Student Achievement: How students perform on STAAR assessments.\n- Campus Performance: How a school’s scores compare with those of schools with similar poverty levels.\n- Student Growth: How many students improve their STAAR performance year after year.\n- College Readiness (High Schools): Graduation rates and participation in college-prep programs.\nEach index is weighed evenly, and schools are ranked within their grade-level categories. The organization says the system is designed to promote transparency, inform families and encourage data-driven decision-making among educators.\nThe Source: Information in this article was provided by Children At Risk.",
  "word_count": 908,
  "scraped_at": "2026-02-14T14:21:06.028305"
}