{
  "article_id": "999a1a11cb0b",
  "url": "https://www.tomsguide.com/entertainment/hbo-max/new-on-hbo-and-max-in-november-2024-all-the-new-shows-and-movies-to-watch",
  "title": "New on HBO and Max in November 2024 all the new shows and movies to watch",
  "date": "20241029T133000Z",
  "domain": "tomsguide.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New on HBO and Max in November 2024 — all the new shows and movies to watch\nOur guide to what’s coming to Max and HBO in this month\nHere at Tom’s Guide our expert editors are committed to bringing you the best news, reviews and guides to help you stay informed and ahead of the curve!\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nDaily (Mon-Sun)\nTom's Guide Daily\nSign up to get the latest updates on all of your favorite content! From cutting-edge tech news and the hottest streaming buzz to unbeatable deals on the best products and in-depth reviews, we’ve got you covered.\nWeekly on Thursday\nTom's AI Guide\nBe AI savvy with your weekly newsletter summing up all the biggest AI news you need to know. Plus, analysis from our AI editor and tips on how to use the latest AI tools!\nWeekly on Friday\nTom's iGuide\nUnlock the vast world of Apple news straight to your inbox. With coverage on everything from exciting product launches to essential software updates, this is your go-to source for the latest updates on all the best Apple content.\nWeekly on Monday\nTom's Streaming Guide\nOur weekly newsletter is expertly crafted to immerse you in the world of streaming. Stay updated on the latest releases and our top recommendations across your favorite streaming platforms.\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nNovember brings an exciting wave of new content to Max. With an impressive lineup from HBO, Warner Bros. Discovery and acclaimed studios like A24, Max solidifies its position as one of the best streaming platforms thanks to new shows movies and live sports every month.\nThis month, there's a mix of original shows and movies and some new library movies that you'll want to watch. \"Dune: Prophecy\" is clearly destined to be the next must-watch HBO following \"The Penguin.\" But you'll also want to make sure you catch the arrival of A24's \"Janet Planet\" and the return of \"The Sex Lives of College Girls\" in addition to a few other shows and movies.\nSo without further ado, here’s everything new on HBO and Max in November 2024. If you're looking for even more streaming options this Fall, don’t miss our roundup of the best shows currently available on Max.\nNEW ON MAX IN NOVEMBER 2024: TOP PICKS\n'Dune: Prophecy' (Nov. 17)\n\"Dune: Part Two\" is still the best movie I've seen all year. And I've seen more than a few. So believe me when I say that I cannot wait to see if \"Dune: Prophecy\" keeps the momentum going for the science fiction franchise.\nA prequel to the two \"Dune\" movies. This show is set 10,000 years before the events of the rise of Paul Atreides. One of Paul's ancestors, Keiran Atreides (Chris Mason), will get some screen time in this show, but the focus will be on sisters Valya (Emily Watson) and Tula (Olivia Williams) Harkonnen as they establish the secretive Bene Gesserit order.\nEpisode 1 premieres on HBO and Max on November 17\n'Janet Planet' (Nov. 1)\nThe coming-of-age archetype works so well for movies because everyone can relate to having come of age. \"Janet Planet\" stars Zoe Ziegler as Lacy, an 11-year-old girl growing up in western Massachusetts with her single mother, Janet (Julianne Nicholson). The movie follows their journey during the summer, as they navigate Lacy's developing teenage angst and Janet's less-than-stellar relationships.\nGet instant access to breaking news, the hottest reviews, great deals and helpful tips.\nBased on the reviews for \"Janet Planet,\" which debuted last year at the Telluride Film Festival, critics seem to have found something to relate to in the movie, but there's a chance you'll find it a bit too slow. You'll have to watch for yourself to see which side you fall on.\nWatch on Max starting November 1\n'The Sex Lives of College Girls' season 3 (Nov. 21)\n\"The Sex Lives of College Girls\" centers around four 18-year-old freshmen roommates at the fictional Essex College in Vermont. Kimberly (Pauline Chalamet) comes from a poor family, a stark difference from Leighton (Reneé Rapp), a wealthy legacy student. Then there's Bela (Amrit Kaur), a sex-positive aspiring comedy writer and Whitney, who may be a bit too sex-positive when she was having an affair with her soccer coach in season 1.\nNow in season 3, the girls have moved on to sophomore year. But \"The Sex Lives of College Girls\" still revolves around their sexually active lifestyle and the struggles of college. Including, based on the trailer, swiping right on your friend's dad.\nEpisode 1 premiers on HBO and Max on November 21\n'Like Water For Chocolate' (Nov. 3)\nThe original 1992 film \"Like Water for Chocolate\" was a respectable success critically and financially. Based on Laura Esquivel’s novel of the same name, this romantic drama is set during the Mexican Revolution that took place in the early 20th century.\nThis time though, it's a six-part drama series. The story follows Tita de la Garza (Azul Guaita) and Pedro Múzquiz (Andrés Baida), who HBO describes as “two souls deeply in love, yet unable to be together due to entrenched family customs.\" The need for subtitles could be a hurdle for this show from executive producer Salma Hayek Pinault, but for those who love a good romance story, it could quickly become a must-watch TV show.\nEpisode 1 premieres on HBO and Max on November 3\n'Sweethearts' (Nov. 28)\n\"Sweethearts\" stars Kiernan Shipka and Nico Hiraga as a pair of college freshmen who make a pact to break up with their high school sweethearts on the night before Thanksgiving. But when they try, they're thrust into a chaotic night in their hometown that puts their friendship to the test.\nI'll be honest, I'm not sure what to think of this one. I haven't seen it in advance and the trailer was only just revealed. But, anecdotally I've heard some positive things, and with Shipka (of \"Mad Men\" fame) starring, it does seem like this Max original movie has potential. The trailer certainly seems intriguing enough.\nWatch on Max starting November 28\nBLEACHER REPORT LIVE SPORTS ON MAX IN NOVEMBER 2024\nDaily Weekday Shows\n\"The Dan Le Batard Show with Stugotz\" @ 11 a.m.\n\"Up & Adams Show\" from FanDuel TV @ 2 p.m.\nNBA Regular Season\nNovember 12\nNew York Knicks at Philadelphia 76ers @ 7:30 p.m.\nDallas Mavericks at Golden State Warriors @ 10 p.m.\nNovember 19\nCleveland Cavaliers at Boston Celtics @ 7 p.m.\nOklahoma City Thunder at San Antonio Spurs @ 9:30 p.m.\nNovember 26\nMilwaukee Bucks at Miami Heat @ 7:30 p.m.\nLos Angeles Lakers at Phoenix Suns @ 10 p.m.\nNHL Regular Season\nNovember 6\nDetroit Red Wings at Chicago Blackhawks @ 8 p.m.\nNovember 13\nDetroit Red Wings at Pittsburgh Penguins @ 7:30 p.m.*\nLos Angeles Kings at Colorado Avalanche @ 10 p.m.\nNovember 20\nCarolina Hurricanes at Philadelphia Flyers @ 7:30 p.m.*\nNashville Predators at Seattle Kraken @ 10 p.m.\nNovember 27\nWashington Capitals at Tampa Bay Lightning @ 7:30 p.m.\nVegas Golden Knights at Colorado Avalanche @ 10 p.m.*\nNovember 29\nNHL Thanksgiving Showdown\nPittsburgh Penguins at Boston Bruins @ 6:30 p.m.\nColorado Avalanche at Dallas Stars @ 8:30 p.m.\nCollege Basketball\nNovember 4\nHall of Fame Series Las Vegas\nWomen: South Carolina vs. Michigan @ 7:30 p.m.\nMen: Texas vs. Ohio State @ 10 p.m.\nNovember 15\nHall of Fame Series Baltimore\nMen: UVA vs. Villanova @ 5 p.m.\nNovember 26-29 Acrisure Series (Classic, Holiday Classic & Holiday Invitational)\nCheck Max listings for times and match-ups\nNov. 26-30 Players Era Festival: Impact Tournament\nHouston vs. Alabama @ 8 p.m. (Nov. 26)\nRutgers vs. Notre Dame @ 10:30 p.m. (Nov. 26)\nRutgers vs. Alabama @ 10:00 p.m. (Nov. 27)\nNotre Dame vs. Houston @ 12:30 a.m. (Nov. 28)\nNov. 30: Alabama vs. Notre Dame @ 1 p.m. (Nov. 30)\nRutgers vs. Houston @ 3:30 p.m. (Nov. 30)\nNov. 26-30 Players Era Festival: Power Tournament\nSan Diego State vs. Creighton @ 2:00 p.m. (Nov. 26)\nOregon vs. Texas A&M @ 4:30 p.m. (Nov. 26)\nNov. 27: Oregon vs. San Diego State @ 4:00 p.m. (Nov. 27)\nTexas A&M vs. Creighton @ 6:30 p.m. (Nov. 27)\nSan Diego State vs. Texas A&M @ 7:00 p.m. (Nov. 30) Oregon vs. Creighton @ 9:30 p.m. (Nov. 30)\nMountain West College Football\nNovember 2\nWyoming at New Mexico @ 4 p.m.\nU.S. Soccer\nNovember 14\n2024-25 Concacaf Nations League Quarterfinal Round\nU.S. Men’s National Team vs. Jamaica @ 7:30 p.m.\nNovember 18\n2024-25 Concacaf Nations League Quarterfinal Round\nU.S. Men’s National Team vs. Jamaica @ 8 p.m.\nNovember 30\nU.S. Women’s National Team vs. England @ 12:20 p.m.\nMotoGP, Moto2, Moto3\nNovember 1-3\nPETRONAS Grand Prix of Malaysia\nNovember 15-17\nGran Premio Motul de la Comunitat Valenciana\nEndurance Car Racing\nNovember 1-2\nFIA WEC – 8 Hours of Bahrain\nCycling\nNovember 1\nCyclo-Cross (Men & Women): Oudenaarde\nNovember 11\nCyclo-Cross (Men & Women) Superprestige | NIEL\nTriathlon\nNovember 16-17\nT100 Triathlon World Tour\nPTO Tour | Dubai\n*Telecast will not be available in the local indicated market\nPlease note this list may not be comprehensive and is subject to change.\nAll times are in ET.\nPre- and post-game programming will also be available to stream live, along with condensed replay highlights available after each game.\nMAX ORIGINALS AND EXCLUSIVES IN NOVEMBER 2024\nSynopses provided by Max.\n\"Janet Planet\" (A24 film)\nDebuts November 1\nIn rural Western Massachusetts, 11-year-old Lacy spends the summer of 1991 at home, enthralled by her own imagination and the attention of her mother, Janet. As the months pass, three visitors enter their orbit, all captivated by Janet and her spellbinding nature. In her solitary moments, Lacy inhabits an inner world so extraordinarily detailed that it begins to seep into the outside world. Pulitzer Prize-winning playwright Annie Baker captures a child's experience of time passing, and the ineffability of a daughter falling out of love with her mother, in this singularly sublime film debut.\n\"Like Water for Chocolate\" (HBO original drama series)\nDebuts November 3 — Episodes debut weekly\nThe series explores the idea that sometimes traditions can become a prison, an obstacle for love. Tita de la Garza and Pedro Múzquiz are two souls deeply in love, yet unable to be together due to entrenched family customs. The protagonists navigate a world of magical realism and rich flavors as Tita struggles between the destiny imposed on her by her family and her fight for love. Along the way, the audience will witness her greatest refuge: the kitchen. For Tita, her magical connection to cooking becomes an active resistance against oppression, allowing her to channel her deepest desires and passions into her recipes, transforming those who taste them.\n\"Carville: Winning is Everything, Stupid\" (CNN Films)\nDebuts November 14\nFrom masterminding Bill Clinton's 1992 presidential win to his insurgent role in the 2024 race, Democratic strategist James Carville has been one of the most influential forces in modern political history. The \"Ragin' Cajun\" looks back at his unlikely career and 30-year marriage to Republican consultant Mary Matalin. Featuring interviews with Bill Clinton, George Stephanopoulos and more.\n\"Dune Prophecy\" (HBO original drama series)\nDebuts November 17 — Episodes debut weekly\nFrom the expansive universe of Dune, created by acclaimed author Frank Herbert, and 10,000 years before the ascension of Paul Atreides, \"Dune: Prophecy\" follows two Harkonnen sisters as they combat forces that threaten the future of humankind, and establish the fabled sect that will become known as the Bene Gesserit. \"Dune: Prophecy\" is inspired by the novel \"Sisterhood of Dune,\" written by Brian Herbert and Kevin J. Anderson.\n\"Call Me Ted\" (Documentary series)\nDebuts November 13\nA six-part documentary on the extraordinary life of Ted Turner.\n\"Night is not Eternal\" (HBO original documentary)\nDebuts November 19\n\"Night is not Eternal\" is a deeply personal exploration of political activism through the eyes of Chinese American filmmaker Nanfu Wang. For over seven years, Nanfu follows Rosa Maria Paya, a young Cuban activist and daughter of five-time Nobel Peace Prize nominee Oswaldo Paya, in her fight for democratic change in Cuba. Driven by her own experiences in China, Nanfu is drawn to Rosa's story and the parallels between their homelands. With intimate access, Nanfu follows Rosa's journey from the streets of Havana to rallies and conferences worldwide, capturing her transformation from a grassroots activist to an international public figure and documenting the challenges faced by activists resisting authoritarian regimes.\n\"Surveilled\" (HBO original documentary)\nDebuts November 20\n\"Surveilled\" tracks The New Yorker journalist Ronan Farrow as he investigates the growing business of commercial spyware, following the story from New York City to Tel Aviv, Israel, a thriving center of espionage cybertechnology. Once a target of covert surveillance himself, Farrow explores the multibillion-dollar industry, addressing the twofold uses and implications of phone hacking – the ability to monitor criminal activity and the attendant threats to civil liberties.\n\"The Sex Lives of College Girls\" season 3 (Max original comedy series)\nDebuts November 21 — Episodes debut weekly at 9 p.m. ET\nCreated by Emmy-nominated writer and producer Mindy Kaling and Justin Noble, the series follows a group of college students at New England’s prestigious Essex College.\n\"Get Millie Black\" (HBO original limited series)\nDebuts November 25 — Episodes debut weekly\nEx-Scotland Yard detective Millie-Jean Black returns to Kingston to work missing persons cases, soon finding herself on a quest to save a sibling who won’t be saved, to find a child who can’t be found, to solve a case that will blow her world apart and prove almost as tough to crack as Millie Black.\n\"Sweethearts\" (Max original film)\nDebuts November 28\nTwo college freshmen make a pact to break up with their high school sweethearts over Thanksgiving break, leading them on a chaotic night out in their hometown that puts their codependent friendship to the test.\n\"Second Chance Stage\" (Max original series by Magnolia Network)\nDebuts November 28\nSecond Chance Stage is a new kind of talent competition that offers contestants who have pushed their dreams aside for years, even decades, a second chance at their big break.\n\"Music Box: Yacht Rock: A Dockumentary\" (HBO original documentary)\nDebuts November 29\n\"Music Box: Yacht Rock: A Dockumentary\" chronicles the emergence and popularity of the West Coast, soft rock pop culture epitomized by musical artists such as Christopher Cross, Michael McDonald, Kenny Loggins, Steely Dan, and Toto. Retroactively dubbed “Yacht Rock” in 2005 by a parody website series, the easy listening, relaxing sounds of the late 1970s and early 1980s, which were beloved by many, came to be gently mocked and even dismissed by rock lovers and critics, but have since reclaimed their legitimate place in music history and are celebrated in this groove-infused film from the Music Box anthology series.\nEVERYTHING NEW ON MAX IN NOVEMBER 2024\nNovember 1\n\"A Christmas Carol\" (1938)\n\"A Christmas Story\" (1983)\n\"Another Earth\" (2011)\n\"Big Miracle\" (2012)\n\"Cirque du Freak: The Vampire's Assistant\" (2009)\n\"Dirty Harry\" (1971)\n\"Elf\" (2003)\n\"Ghosts of Girlfriends Past\" (2009)\n\"Goodfellas\" (1990)\n\"He's Just Not That Into You\" (2009)\n\"Janet Planet\" (2023) (A24)\n\"Jurassic Park\" (1993)\n\"Jurassic Park III\" (2001)\n\"National Lampoon's Christmas Vacation\" (1989)\n\"The Addams Family 2\" (2021)\n\"The Extra Man\" (2010)\n\"The Full Monty\" (1997)\n\"The Hangover\" (2009)\n\"The Lost World: Jurassic Park\" (1997)\n\"The Other Side of the Door\" (2016)\n\"The Polar Express\" (2004)\n\"Unforgiven\" (1992)\n\"Unstoppable\" (2010)\nNovember 2\n\"Cleats & Convos\" episode 104\nNovember 3\n\"Before They Kill Again\" season 1 (ID)\n\"Invincible Fight Girl\" season 1 (Adult Swim)\n\"Like Water For Chocolate (Como Agua Para Chocolate)\" season 1 (HBO Original)\nNovember 4\n\"Holiday Wars\" season 6 (Food Network)\nNovember 5\n\"Game Changers\" season 1 (Discovery)\n\"Holiday Baking Championship\" season 11 (Food Network)\nNovember 6\n\"Fareed Zakaria Documentaries\" episodes 201–204\n\"Feuds Turned Fatal\" season 1 (ID)\nNovember 7\n\"Luva de Pedreiro: Viral Moves (Luva de Pedreiro - O Rei Da Jogada)\" (Max Original)\nNovember 8\n\"Christmas Cookie Challenge\" season 8 (Food Network)\nNovember 9\n\"Cleats & Convos\" episode 106\n\"Gold Rush\" season 15 (Discovery)\nNovember 10\n\"Build for Off-Road\" season 1\nNovember 11\n\"Bellator: Fight Week Paris\" season 7\nNovember 12\n\"Christina in the Country\" season 2 (HGTV)\n\"Moonshiners\" season 15 (Discovery)\n\"Operation Undercover\" season 1 (ID)\n\"TV on the Edge: Moments That Shaped Our Culture\" season 1 (CNN Original Series)\nNovember 13\n\"Beat Bobby Flay: Holiday Throwdown\" (Food Network)\n\"Call Me Ted\"\n\"Don't Hate Your House with the Property Brothers\" season 1 (HGTV)\nNovember 14\n\"A Very Merry Rickmas Yule Log\"\n\"Calcifer Yule Log\"\n\"Carville: Winning is Everything, Stupid\" (CNN Films)\n\"Harry Potter: Fireplace\" (Yule Log)\n\"Harry Potter: Wizards of Baking\" season 1 (Food Network)\n\"Lost Monster Files\" season 1 (Discovery)\n\"The Dog House: UK\" season 5 Christmas Special (Max Original)\nNovember 15\n\"Casi el Paraíso\" (2024)\n\"The Last Woodsmen\" season 1 (Discovery)\nNovember 16\n\"Cleats & Convos\" episode 107\nNovember 17\n\"Dune: Prophecy\" season 1 (HBO Original)\n\"Dynasties II\" season 1 (discovery+)\n\"First-Time Buyer's Club\" season 2 (OWN)\nNovember 18\n\"Watchmen: Chapter I\" (2024)\nNovember 19\n\"Night Is Not Eternal\" (HBO Original)\nNovember 20\n\"Fareed Zakaria Documentaries\" episode 205\n\"Surveilled\" (HBO Original)\nNovember 21\n\"Human vs. Hamster\" (Max Original series by Magnolia Network)\n\"Mystery At Blind Frog Ranch\" season 4 (Discovery)\n\"Mysteries of the Abandoned\" season 11 (Discovery)\n\"The Sex Lives of College Girls\" season 3 (Max Original)\nNovember 25\n\"Get Millie Black\" (HBO Original)\nNovember 26\n\"90 Day Pillow Talk: The Other Way\" season 6 (TLC)\n\"Chopped: Volume 3\" season 59 (Food Network)\nNovember 27\n\"Barnwood Builders\" season 19 (Magnolia Network)\n\"Good Bones\" season 9 (HGTV)\nNovember 28\n\"Mysteries of the Abandoned\" season 11 (Discovery)\n\"Second Chance Stage\" (Max Original series by Magnolia Network)\n\"Sweethearts\" (2024) (Max Original)\nNovember 29\n\"Music Box: Yacht Rock: A Dockumentary\" (HBO Original)\nNovember 30\n\"Cleats & Convos\" episode 108\nThis list may not be comprehensive and is subject to change\nMore from Tom's Guide\n- New on Prime Video and Freevee in November 2024\n- Trick or Stream: Your ultimate guide to Halloween binge-watching\n- New on Netflix: 5 movies and shows to watch this week (Oct. 28-Nov. 3)\nMalcolm has been with Tom's Guide since 2022, and has been covering the latest in streaming shows and movies since 2023. He's not one to shy away from a hot take, including that \"John Wick\" is one of the four greatest films ever made.",
  "word_count": 3081,
  "scraped_at": "2026-02-14T12:10:33.756690"
}