{
  "article_id": "99b1bb9fbbd6",
  "url": "https://www.tomahawknation.com/2025/3/4/24377212/seminoles-daily-news-acc-on3-norvell-clemson-lawsuit-settlement-espn-gor-realignment-big-ten-2030",
  "title": "Noles News : Four reasons why FSU & Clemson  won  the settlement",
  "date": "20250304T133000Z",
  "domain": "tomahawknation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Florida State football, recruiting news: Four reasons why FSU & Clemson “won” the settlement\nThe agreement would create six years of stability for the ACC\nMassive news released yesterday of a report in which FSU, Clemson, and the ACC are set to agree on a settlement that will keep FSU and Clemson in the conference until 2030 under a new payout model.\nMore detailed analysis is soon to follow once the full details are released and voted on but in my opinion this settlement is a major victory for FSU and Clemson because it accomplishes four things:\n- A payout of up to $15 million annually before performance-based incentives kick in\n- It lowers the reported cost of leaving the ACC from over $700 million to less than $100 million\n- Makes it so FSU and Clemson can exit the ACC for that significantly lowered price in 2030 right when major TV deals are set to renew (Big Ten, B12, and the College Football Playoff)\n- It immediately stops the bleeding that is legal fees b/c the lawyers on both side were making a killing.\nMicahi Danzy earned 3rd place at his first ACC Championship Meet:\nHe’ll be moving from RB to WR this spring.\nDespite all the new faces at the skill positions and on the sidelines; the position of intrigue this spring is the offensive line.\nPosition of intrigue: Take your pick. At virtually every spot, Florida State has a big question after last year’s debacle. QB certainly fits the bill as “intriguing,” but BC transfer Thomas Castellanos isn’t likely to change a lot of hearts and minds this spring by himself. The bigger issue might be getting the O-line in order after an unmitigated disaster last season. If FSU can’t block, it won’t matter who’s in the backfield.\nOther Sports:\nThree Seminoles won gold at this weekend’s ACC Championships.\nThe best Amateur golfer on the planet is a Seminole:\nWomen’s Hoops earned a double-bye in the ACC tournament:\nFSU’s undefeated start has them up to No.4 in BaseballAmerica’s Top 25:\nThe fourth-ranked ‘Noles take on the Ospreys of North Florida tonight at 6pm at Dick Howser Stadium:\nRecruiting:\nLikely five-star WR from Miami Northwestern, Calvin Russell, knows he will be officially visiting FSU this spring/summer:\nFSU will also get the last shot at four-star edge rusher Trenton Henderson before he makes his announcement this summer; he’s scheduled to officially visit FSU on June 20th:\n- Florida State Baseball\n- Florida State Football\n- Florida State football news\n- Florida State Football Recruiting\n- Florida State football schedule\n- Florida State Men's Basketball\n- Florida State men's basketball news\n- Florida State men's basketball schedule\n- Florida State softball\n- Florida State Softball news\n- Florida State Sports Analytics\n- Florida State Women's basketball\n- Florida State women's basketball news\n- Florida State women's basketball schedule\n- FSU Football Practice Reports\n- NFL Noles",
  "word_count": 486,
  "scraped_at": "2026-02-14T13:18:57.449772"
}