{
  "article_id": "99c3dd09c3e9",
  "url": "https://www.sounderatheart.com/2025/08/match-preview-portland-thorns-vs-seattle-reign/",
  "title": "Match Preview : Portland Thorns vs Seattle Reign",
  "date": "20250809T180000Z",
  "domain": "sounderatheart.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Riding high on a four-match unbeaten streak spanning the international break, the Reign next travel south to visit their original rival at Providence Park. The match kicks off at 1:00 PM on Sunday, August 10, and will air on CBS and Paramount+.\nAt the midway point of the season, the teams are neck-and-neck in the middle of the playoff picture, with the Reign holding a slight advantage – fifth place and 24 points in 14 matches to Portland's sixth place and 22 points. With the playoff picture tightly contested and 10 teams brawling for seven spots in the back half of the season, this is an opportunity for either team to help secure their position at the direct expense of a bitter foe.\n\"I love rivalry weekend. I think it's amazing. I think fans love it. I think everyone gets engaged in it,\" Reign head coach Laura Harvey said about being part of the first NWSL rivalry weekend. \"This one's been here for 13 years. I don't think we've highlighted it enough. It's the biggest one. There's no doubt about it. It's the most organic. It's the most historical.\"\nThe Reign are in their best form of the season, unbeaten in four (3W, 1D, +6) and coming off a strong 2-0 home win against Angel City. The Thorns are a little cooler, but have found some real consistency on the season after a very rocky start, with a strong run of form coming to an end in a 2-1 loss to the Washington Spirit on Saturday.\nHead-to-Head\n- The Reign are 16-16-10 all time against the Thorns, including a 7-11-4 away record.\n- The Reign have scored 44 goals in the rivalry while conceding 45.\nRecent results\n- The Thorns have a 6-4-4 record this season, and have scored 20 goals while conceding 14. They're coming off a 2-1 away defeat to the Washington Spirit, their second loss in four matches.\n- The Reign have a 7-3-4 record this season, and have scored 19 goals while conceding 13. They're coming off a 2-0 home win against Angel City, their second consecutive multi-goal win and third win in four.\n- The Reign won the previous meeting with Portland this season, a 1-0 victory at Lumen Field.\n- The Thorns are undefeated (4-0-3) at home this season, taking 15 points from 7 matches.\n2024 results\n- The Thorns ended 2024 in 6th place with a 10-4-12 record, scoring 37 goals and conceding 35.\n- They lost in the first round of the playoffs, 2-1 against Gotham FC.\n- The Reign ended in 13th place with a 6-15-5 record.\nOffseason moves and transfers\n- The Thorns have had an enormous amount of squad turnover since 2024. The offseason featured the retirement of team stalwarts like Christine Sinclair and Becky Sauerbrunn and the departures of Meghan Klingenberg, Gabby Provenzano, and Shelby Hogan, as well as a host of new signings, including former Reign centerback Sam Hiatt, Jayden Perry, Daiane, and Mimi Alidou.\n- Since the Reign and Thorns last played, the Thorns have added two new first-team players, mostly as cover, signing midfielder Mallie McKenzie to a 1-year contract and midfielder Naomi Powell to a temporary contract through August.\n- Forward Caiya Hanks will miss the remainder of the season after suffering a season-ending injury in June, joining the Thorns' already long list of injuries and absences.\nThorns players to watch\nOliva Moultrie: Minute for minute, Moultrie has likely been the Thorns' most important player. An excellent progressive passer with vision and ball skills to spare, Moultrie can put in wicked service or call her own number from distance. Though she's tallied just two goals and one assist on the campaign, she leads the NWSL in shot-creating actions per 90 (with a ridiculous 5.63) and is one of the dozen or so best dribblers in the league today. An absolute menace with the ball on or off her feet, in the run of play or from a set piece. She can hurt you in a ton of ways if you give her the chance.\nBella Bixby: Returning to regular minutes with the Thorns, Bixby – since returning from maternity leave – has shared starting goalkeeper duties with Mackenzie Arnold, and both have been quietly excellent for a Portland side that has needed a lockdown goalkeeper to see out results. Since her April return to play, Bixby has three clean sheets and has allowed just four goals in seven matches played, posting a 4-1-2 record in that time. More than that, her shot-stopping numbers have been elite, among the very best in the league, sharing the top of the charts with her Portland teammate Arnold, Claudia Dickey, and Aubrey Kingsbury.\nReilyn Turner: With the mixture of injuries, absences, and retirements from 2024, the Thorns – much like the Reign – have been an offense-by-committee team in 2025. However, from the early games, Reilyn Turner cemented herself as the most productive member of that committee, and she continues to lead the team with 4 goals and 1 assist, and a production rate that somewhat undersells how good she's actually been. Turner is a potent force in the air and can deliver a good shot with either foot. With players like Olivia Moultrie, Jessie Fleming, and Deyna Castellanos providing service, she gets plenty of opportunities.\nWhat to watch\nFinding an identity: It's a season of changes for the Thorns, and early in the season, they struggled heavily with their 'Oops, All Creative Midfielders' roster and Rob Gale's apparent allergy to using the width. However, since they last played the Reign, they've found much more consistent form and begun to more effectively make use of the talent actually on their roster, and more effectively make use of the whole field. Turner, Moultrie, and Petra Tordin have become a bit of a nightmare to contain in attacking holdup play, and fullbacks Reyna Reyes and Kaitlyn Torpey provide overlapping width that allows them to do something with the ball where they often struggled to in the early going.\nTheir biggest strength is still up the spine of the field, though, and they like to overload the middle of the park with a surfeit of wily and skillful midfielders: Moultrie is joined by Hina Sugita, Sam Coffey, and Jessie Fleming, and when they're on their game, they're a nightmare to contain.\n\"Playing them in our last scrimmage, [their midfield] is arguably one of their strongest parts of their team,\" said Reign rookie Sally Menti. \"So that's always a huge challenge for me and our other midfielders going up against them.\"\n\"The four of them are what makes Portland tick,\" Harvey added. \"So trying to prevent them from being impactful in the game is going to be important, and knowing that if we can do that and limit their opportunities to dictate the game, we might be able to control the game with a bit of momentum.\"\nLess of the ball, but more out of it: Since the Reign's 1-0 victory at the start of the season, the Thorns have relied less on possession, tight control, and dribbling, something that they did well but consistently failed to create chances with. Formerly a team that liked to possess the ball and beat their defender directly but who couldn't find shots, they've transitioned and found an effective strategy. Now in the bottom third of the league for possession, they instead lead the league in shots and key passes, are third in passes into the penalty area, and are in the top third for non-penalty expected goals.\nThough still a phenomenal dribbling team, they've been looking for the cutting pass more than the take-on, and getting the rewards for finding it. Less of the ball has equated to substantially more danger for the Thorns this season.\nCascadia is Cascadia: Laura Harvey will tell you that tactics go out the window in a derby match. Jess Fishlock will tell you she's hated Portland since 2013. These matches just mean more to the players and fans alike, and while they don't actually just come down to who wants it more – the tactics matter, the specifics matter, the whimsicalities of the Soccer Gods really matter – they do have an extra level of intensity that you don't find anywhere else in the league.\n\"I think it's something you've just got to be good at, no matter what the game you're playing,\" Harvey said about winning duels and first and second balls. \"In this league especially, you've got to be prepared that sometimes the game goes that way, and then if you don't do those things, the tactics that you've prepared, you can't really execute. So I think that's where it comes from, being able to execute what you want.\"\nThorns - Reign brings fireworks, for better and worse.\nThe 43rd edition of the NWSL Cascadia Rivalry kicks off on Sunday. Let's see what it has in store for us.\nInjury / Availability Report\nSeattle Reign\nOUT: Ryanne Brown (SEI – knee), Hanna Glas (leg), Veronica Latsko (SEI – lower leg), Cassie Miller (D45 – leg)\nQUESTIONABLE: Phoebe McClernon (foot)\nPortland Thorns\nOUT: Caiya Hanks (SEI – knee), Marie Müller (SEI – knee), Nicole Payne (SEI – knee), Olivia Wade-Katoa (maternity leave), Morgan Weaver (SEI – knee), Sophia Wilson (maternity leave)\nHow to Watch\nThe Reign will face the Portland Thorns on Sunday, August 10, at 1:00 PM PT at Providence Park. The match will air on CBS and stream on Paramount+.",
  "word_count": 1584,
  "scraped_at": "2026-02-14T12:24:05.826457"
}