{
  "article_id": "99e4831794a3",
  "url": "https://www.thefa.com/news/2025/apr/08/five-things-from-england-belgium-at-ashton-gate-20250804",
  "title": "Five things you mightve missed from England win over Belgium in Bristol",
  "date": "20250408T164500Z",
  "domain": "thefa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "England were on the road this month as the Lionesses ventured to the west country for their UEFA Women’s Nations League game with Belgium at Ashton Gate, home of Bristol City FC.\nAnd following the match, which ended in a 5-0 for Sarina Wiegman’s team in front of a sell-out crowd, we’ve picked out five things that you might’ve missed if you were at the game or watching at home.\nJustine’s cap\nFormer Lioness Justine Lorton was presented with her England legacy cap at half time. She was the 128th player to have represented the Lionesses after making her debut against Scotland in August 2007. She went on to win seven caps during a career which saw her represent the likes of Millwall Lionesses, Arsenal, Charlton Athletic and Fulham in her native London before she moved to the west country and enjoyed spells with Bristol Academy and Yeovil Town.\nFrom Belgrade to Bristol…\nJoining FA Chair Debbie Hewitt MBE as a guest at Ashton Gate was the Royal Belgian Football Association President, Pascale van Damme, who was elected to the FIFA Council this week at the UEFA Congress in Belgrade meaning she’ll also be joining Debbie on the 37-strong world governing body of football.\nWorld Cup fever for 2035\nFollowing the news earlier in the week that the Home Nations are to be the sole bidder for the FIFA Women’s World Cup in 2035, both Sarina Wiegman and Lionesses captain Leah Williamson spoke of their excitement at the prospect of England joint-hosting another major tournament. Sarina said: “It’s really good news and would be great if that tournament would be held here. We know, with the experience of the EUROs, how big the game is already here and what that momentum did in the country but also world worldwide. Another tournament, on an even bigger stage, would be incredible and give another boost to the game.” Williamson added: “Having experienced a home tournament when we all realised at the time how lucky we were, it’s exciting news for players to know that potentially that’s on the horizon. I’m sure with the impact that 2022 has had, you’ll have some stories if we’re to host in 2035. I think you’ll have some stories that will be pretty special.”\nBeever-Jones on familiar territory\nIt was a fitting and familiar venue for Lionesses striker Aggie Beever-Jones to score her first England senior goal, after her introduction as a substitute at the break. The Chelsea striker enjoyed a loan spell with Bristol City in the 2021-22 season, as she was starting to break through the ranks at Stamford Bridge. She was a regular for the Robins in the Championship, playing over 20 games for the club and scoring five goals.\nLionesses’ tribute to Poppy\nThe whole team and crowd paid their tribute to the tragic recent passing of young Lionesses and Manchester United supporter and footballer Poppy Atkinson. The ten year old died in March after she was hit by a car at a training session in Kendal, and the players displayed an England shirt bearing her name and the number 24 across their bench during the game after Ella Toone had walked out for the anthems carrying it.",
  "word_count": 535,
  "scraped_at": "2026-02-14T12:58:35.188677"
}