{
  "article_id": "9a059a212e6e",
  "url": "https://thestandard.org.nz/daily-review-17-03-2023/",
  "title": "Daily review 17 / 03 / 2023",
  "date": "20230317T061500Z",
  "domain": "thestandard.org.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Written By:\n- Date published:\n5:30 pm, March 17th, 2023 - 6 comments\nCategories: Daily review -\nTags:\nDaily review is also your post.\nThis provides Standardistas the opportunity to review events of the day.\nThe usual rules of good behaviour apply (see the Policy).\nDon’t forget to be kind to each other …\n- Comments are now closed\n-\nNuclear free advocacy on behalf of constituents.\n-\nBesides, it was terrain what did it, not maximising shareholder returns.\n/\nhttps://twitter.com/AlecMacGillis/status/1636429056219422720\nBoeing attorneys say the crash victims died instantaneously when the Ethiopian Airlines jet slammed into the ground. They argue in court documents that any pain and suffering they may have felt before impact aren’t legally relevant for calculating damages.\nPlaintiffs’ attorneys want the company to pay for what they say was a terrifying six-minute roller coaster before the plane’s high-speed, fatal nosedive.\n[…]\n“Boeing recognizes the tremendous tragedy suffered by the families,” the company’s attorneys wrote in a Feb. 27 filing in federal court in Chicago. But, they wrote, Illinois laws “provide that evidence of passengers’ pre-impact pain and suffering may not be admitted to support a damages award in this case.”\n-\nI am surprised that I can't find here any St Patrick's Day greetings today, so every one I hope that you have had an inspired day. 800,000 Kiwis have Irish heritage. Those who migrated were, many of them, the refugees of the time. My ancestors borrowed the money to come. May we all consider that- our good fortune, the welcome, the chance to prosper- and wish on us all, newcomers, tangata whenua, migrants, refugees, alike that blessing. Beannacht. Mac1.\n-\nThe green balloons were aplenty at “The Patriot” in Devonport today. And the police sirens were aplenty around 8pm. May not have had anything to do with St. Patrick's Day but my first thought: the celebrations have got out of hand.\n-\nWe prefer to celebrate March 17 as the day of St Gertrude of Nivelles. She is the patron saint of cats. More relevant to us than some chap who never set foot in Ireland (which had no snakes anyway).\n-\nIt seems that, like St Patrick, St Gertrude was never formally canonised, nor did she especially champion our feline friends but rather chased away rodents herself. Like Patricius, she did exist……\n-\n-\n- Comments are now closed",
  "word_count": 394,
  "scraped_at": "2026-02-14T13:45:06.963040"
}