{
  "article_id": "9a0951a388f7",
  "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-women/2025/3/1/24375469/brighton-hove-albion-wfc-vs-chelsea-fcw-womens-super-league-preview-team-news-how-to-watch",
  "title": "Brighton vs . Chelsea , Women Super League : Preview , team news , how to watch",
  "date": "20250302T013000Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Women’s Super League returns to action following the international break, with Chelsea visiting Brighton in what should be a fairly comfortable way to get back into club-football mode.\nBrighton & Hove Albion WFC vs. Chelsea FCW, Women’s Super League: Preview, team news, how to watch\nSeagulls looking to keep their nest undefeated\nBut as we saw before the break, in the last-gasp 2-1 win over lowly Everton, there are fewer and fewer “easy” matches in the competition.\nDate / Time: Sunday, March 2nd, 2025, 15:00 GMT; 10am EST\nVenue: Broadfield Stadium, Crawley, UK\nReferee: Kirsty Dowle\nForecast: Sunny intervals and light winds\nOn TV: none (US); Sky Sports (UK); elsewhere\nStreaming: ESPN+ (US); Sky Go (UK)\nBrighton team news: Brighton may be fifth in the table, but they have fewer than half of Chelsea’s 40 points. Still, 15 of those 18 points they have collected at home; in fact, they are undefeated at home in the league with four wins and three draws — though that’s without facing any of Chelsea, Arsenal, or Manchester City.\nThey will be aided in this big test by the recent return from injury of Chelsea legend Fran Kirby, while former Manchester United forward Nikita Parris, who has scored four goals in her last four club matches, will also be available.\nChelsea team news: The win against Everton was our ninth in a row in all competitions, since the 1-1 draw against Leicester City, which remains the one and only match that Sonia Bompastor has not won in her first season at Chelsea. There will be much bigger games coming up soon, including an unprecedented four-in-a-row against Manchester City (League Cup final, Champions League quarterfinals (two legs), and away in the league), but focus must be maintained until then.\nOn the availability front, the good news is that star defender Naomi Girma is set to be available for her Chelsea debut after two weeks of strong training. However, midfielder Erin Cuthbert is still doubtful following a rib injury, and we also have late returns from international football for attackers Catarina Macario, Mayra Ramírez and Maika Hamano to consider.\nPreviously: Lauren James’ brace and a goal from Fran Kirby give Chelsea a 3-0 win over the Seagulls in the WSL last season.",
  "word_count": 377,
  "scraped_at": "2026-02-14T12:23:09.585916"
}