{
  "article_id": "9a1d4c34fb77",
  "url": "https://www.westmilfordmessenger.com/home/girls-on-the-field-ice-mat-CY4919004",
  "title": "Girls on the field , ice , mat",
  "date": "20250829T001500Z",
  "domain": "westmilfordmessenger.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Girls on the field, ice, mat\nSPORTS. They are taking center stage in all sorts of athletic endeavors.\nAs the face of female sports continues to change, girls of all ages are making a mark in ice hockey, flag football and wrestling, to name a few.\n“In my 30 years being involved in high school sports, the greatest growth in athletics has been in girls’ sports,” said Warwick Valley Athletic Director Gregory Sirico. “They are training like boys in terms of strength and speed development. They are involved in AAU and travel sports. Everything that took place for the boys in the ‘80s and ‘90s has expanded directly into girls’ sports.”\nIce Hockey\nIn Sparta, it is common to see girls skating with boys in the local youth hockey program.\n“Hockey is one of the fastest growing sports for females because they are being exposed to it and not pigeonholed into something more traditional,” said Maria Petrou, who established Sparta Hockey Club in 2023. “Every team we play has at least one girl and at the youth level girls are often better than the boys because they develop faster, listen better and their sports IQ is more on point.”\nAccording to USA Hockey, female participation in ice hockey has increased by 65 percent since 2010, a statistic that rings true for Jeff Myhren, head coach of the state champion Kinnelon-Jefferson-Sparta hockey team.\n“My daughter Lexie plays with her friends in the Sparta 8U team, a co-ed team in Kinnelon and on a girls travel team,” he said. “She loves playing and plays anywhere she can. In terms of physicality, there is bumping but no checking in girls-only leagues, including at the professional level. If they are on a boys’ high school team they hit.”\nHitting or no hitting, Lexie, 7, just wants to play.\n“I like having the puck and skating fast,” said the young Devils fan. “I like playing against boys or girls and will always play hockey.”\nHer dad would have it no other way.\n“There was one day she had a hockey game in the morning and a dance recital in the afternoon,” Jeff Myhren recalled. “She went from pads to make up and a recital costume.”\nNewton-Lenape Valley’s Catherine Kramer has been playing hockey since fourth grade and competes with the boys at the high school level.\n“It is more intense playing with the boys,” said Kramer, who will be a senior this year. “Checking is allowed and sometimes they think I’m an easy target. I have been playing varsity for the past three years and every time I get hit into the boards my goalie will start yelling at the official and many of my teammates have gotten penalties for boarding the guy who hit me. My coaches also check on me after a hit and ask if I want to sit out a shift.\n“I tell them I’m good,” Kramer added, “and to put me back in.”\nLast season, Kramer was one of six girls on the team. This year she will be one of two. To keep up with the physicality of playing defense, she hits the gym, rides a bike and watches her diet.\n“Playing against the boys,” she said, “I need to be strong in my legs and upper body to move them when they are in front of the net and to shoot the puck harder to get it around the boards.”\nWrestling\nAbbie Paglia began wrestling for Newton-Kittatinny as a freshman after encouragement from a friend.\n“A friend of mine was wrestling and told me to come watch a practice,” recalled Paglia, whose goal for the upcoming season is a state championship appearance. “I liked what I saw, met the coaches and decided to give it a try. My mom’s reaction was: ‘Girls don’t wrestle. Only boys wrestle.’”\nAs perceptions of wrestling have changed, so too have female participation levels. According to the National Federation of State High School Associations, the number of high school girls who competed in wrestling has quintupled since 2013 and the sport is expanding at the college level.\n“I was surprised girls were wrestling and that it was OK to throw people around and not get in trouble for it,” Paglia, a senior, said. “It wasn’t field hockey, soccer or softball. It was a new norm that enabled me to get healthier doing something I loved. I go to the gym before school and stay late after practice. I had no idea wrestling would become one of the biggest things in my life.”\nIn neighboring Passaic County, Maddie and Ella Hammett are making West Milford proud.\nMaddie, who helped start the local youth wrestling program when she was in middle school, was one of four female wrestlers at West Milford High School last year.\n“I was 11 when I tried wrestling,” said the junior. “I saw my friend Jackie at a clinic and we were excited not to be the only girls. I think the competitiveness of the sport drew me to wrestling.”\nThough they share practice space with the boys and took part in individual competitions at tournaments, there weren’t enough female wrestlers last year to field an all-girls team. There is word that five new girls will be joining the team this season. The minimum number of girls required for a team in New Jersey is seven.\n“That would enable us to wrestle “under the big light like the boys do,” said Maddie, who helps recruit girls via social media and word of mouth. “That is when they shut down all lights and shine one big light on the matt in the middle of the gym.”\nReaction from friends and classmates is mostly positive and her close friends help with the stats.\n“Wrestling changed my outlook and made me improve my diet,” Maddie said. “I cannot stress the mental part enough. The past season I was struggling mentally due to a shoulder injury, but this sport teaches you to be physically and mentally strong.”\nIn Warwick, the high school girls have decided, at least for the time being, to stay merged with the boys.\n“Our female wrestlers practice alongside the boys on the same team,” Sirico said. “What Section 9 has done for schools that have a handful of girls wrestling, like us, is to put together Friday evening matches comprised of all of the female wrestlers in the section that are not on teams with enough girls to fill out a full lineup.”\nOne such wrestler is two-time All American and defending state champion Victoria Alvarado.\n“My brother and I do jujitsu and when I saw boys wrestling, I knew it was something I could do and wanted to try,” said the junior who placed sixth at nationals last year as a sophomore. “I started on the boys modified team in eighth grade and they moved me up last year. Other than the boys being stronger, there isn’t much difference going against them as opposed to girls. I feel sort of bad sometimes when I beat them and see their teammates laughing at them, but it’s funny.”\nAlvarado’s plan to wrestle in college is why she chooses to wrestle girls when Sectionals come around, as girls wrestle freestyle and boys wrestle folkstyle in high school and college.\n“My goal is to be national champion and always get better,” said Alvarado, who trains at Venom in Minisink. “My go-to move is the fireman’s carry, which is a takedown, but I am also trying to get faster and improve my quickness.”\nTo say Monroe-Woodbury’s Gail Sullivan has been making a name for herself in the local wrestling scene would be an understatement. Last year, wrestling at the varsity level as an eighth grader, Sullivan became the first female in male competition to win her bracket at the section level.\n“Wrestling boys is harder but it makes me wrestle smarter and improves my technique because they are stronger,” she said. “Wrestling boys makes it easier to go against girls. My goal is to win a state championship.”\nGoing against boys is second nature for Sullivan, who grew up watching her brothers.\n“Some of my friends think the fact I wrestle is cool because it is not common, and I am always trying to get them to join.”\nKaitlyn Aybar, a junior, wrestles alongside Sullivan and also plays flag football for the Crusaders.\n“I prefer flag due to the community, environment and the game itself is very fun,” said Aybar, who plays cornerback and wide receiver. “My brother tried getting my parents to sign me up for football, so it was always in the back of my mind. Wrestling helped me with flag defensively in terms of technique, stance, coordination and thinking quickly.”\nMonroe-Woodbury Athletic Director Bryan Wilson says that while female wrestlers such as Sullivan have wrestled boys, other females on the team strictly wrestle girls. This school year it looks as though the district may have enough female wrestlers to field an all-girls wrestling team with money having been allocated. In that case, Sullivan, Aybar and company would go against girls.\nMotor Cross\nElla Hammett, Maddie’s younger sister, races her Kawasaki KX112 super minibike in motocross, a form of off-road motorcycle racing on dirt tracks. Her father, Mike Hammett, owns the Power Curve MX team that races at Walden Motocross in New York.\n“When I was four or five, there was a girl on my dad’s motocross team and when I saw her with the dirt bike I fell in love with it,” recalled Ella, who will be a freshman. “There are about eight of us on my dad’s team and a woman named Chloe is the only other female. Boys tend to be more aggressive and pushier on the track than girls. My friends say motocross is scary and ask me how I can do it. I say I am used to it and have fun.”\nElla is tough, like her older sister.\n“When you fall, the first thing you do is ask yourself what happened,” Ella said. “A lot of people get the wind knocked out of them. Thankfully, that hasn’t happened to me. I did recently sprain my ankle jumping my dirt bike in my backyard when my foot came off the peg, but it is basically healed already.”\nFlag Football\nCo-ed and girls flag football teams have popped up at the youth level and varsity levels, thanks in no small part to the National Football League’s efforts to launch youth programs and high school teams via free uniforms, supplies and a rulebook.\n“[NFL Flag] is a pathway for female athletes to play in college, as well as an outlet for tackle athletes to compete in the offseason,” reads a portion of a statement at NFLflag.com. “But as NFL Flag grows, one thing stays the same: It’s a place for every boy and girl to play football.”\nMost of the sport’s growth has come in the past five to seven years, reports the National Federation of State High School Associations. As of January, 10 states have sanctioned the sport for girls (Pennsylvania, Florida, Alabama, Georgia, Nevada, Alaska, New York, Arizona, Illinois and California), two others are expected to sanction flag this year (Colorado, Montana) and 16 other states, including New Jersey, are in various stages of pilot programs.\nWhat’s more, flag football will be an Olympic sport for men and women in 2028. It is a growing collegiate sport as well.\nAt Goshen High School, Ed Killenberger has been head coach of the girls’ varsity flag football team since its inception four years ago.\n“In our first year, the New York Jets sent us 20 uniforms to help us get off the ground which was good because the Northeast had been lagging behind in terms of girls’ flag as a high school sport,” said Killenberger, who is also a coach for the varsity tackle football team. “We have since added 20 additional uniforms and with talk of a JV team starting in the coming year we may have to make cuts for the first time. That shows how much we are growing.”\nHaving coached the boys, who play in the fall, and the girls, who play in spring, Killenberger has a unique perspective.\n“Last season we played for the section championship against Minisink Valley and the level of competitiveness has soared,” said Killenberger, who attributes his team’s consistent improvement to the athletes starting at the youth level. “The girls are just as competitive as the boys. They are athletes who are fortunate to be growing up in an era that offers them a chance to learn and play a great sport on their terms. There are good crowds for home games, and the varsity boys show up.”\nSenior running back Scarlett Winkler preferred male-oriented sports as a kid.\n“I dirt bike, snowboard, mountain climb and when the flag football team started, I had to jump on,” she said. “My brothers played a big role in getting me into football because I grew up playing with them. I like that I can be aggressive and run into people a little bit because even though it is flag, it can get physical depending on the referee and what a player can get away with.”\nWinkler can see herself playing flag football in college if the opportunity presents itself. But first, senior year.\n“We have one goal and that is to beat Minisink,” she said. “Last year we lost to them twice in regular season and then in the section final. We kept the games close early on but each time they grabbed the momentum. Their best players graduated so it is time.”\nAsked what needs to happen to make that goal a reality, Winkler cited fundamentals.\n“Hip movement is important because the gaps to run through are tight and the better your hips move the harder it is for the defender to get your flag,” she said. “There are drills we can do.”\nThe flag football story is the same in Warwick. The high school first fielded a girls’ flag football team in 2023.\nAthletic Director Gregory Sirico coached Warwick Valley’s varsity flag football team that season and, along with Monroe-Woodbury’s Elaine Schellenberg, coordinates flag football for Section 9.\n“A lot of credit for flag football’s growth goes to the NFL, as the Jets gave $9,000 to any school in Section 9 who started a flag program that first year,” said Sirico, who led the Wildcats to a sectional championship in year one. “Combine that with Warwick Youth Football’s strong flag program and the success we have had getting super athletic girls from fall soccer to join flag in the spring and you have a rapidly growing sport. In that one year I coached flag, I found the girls to be competitive, eager to learn and hard working.”\nNatalie Beers has been playing flag football for three years.\n“I was shown a video about flag football in middle school, when it started, but I didn’t think much of it,” said the junior. “As I got into high school, a bunch of my friends were doing it. I used to joke with my brothers about joining the boys tackle football team but then I realized I had an opportunity to play flag football and it is my favorite sport because I can be myself on the field.”\nAt the beginning, Beers said her parents worried she might get hurt. That is no longer a concern.\n“My parents love it and are at every game,” Beers said. “We lost some valuable players from last year, but I see potential for a great season if we put our best foot forward in practice.”\nFemale participation in flag football is also growing in Pike County, Pa., where Mike Mady runs the Pike Area Youth Athletic League.\n“We were established in 1996 and went full co-ed flag in 2023,” said Mady, president since 2022. “Before that, a girl or two would play tackle football when we offered it. Due to the head injury issue, we no longer have a market for tackle, but we currently have 365 athletes split between flag football and cheer. Our flag program is not affiliated with the NFL because we do some things a bit differently and value the ability to tweak things as we see fit.”\nHe said at the youth level, girls are often as good or better athletes than boys.\n“A girl in one of our last years of tackle played offensive line and blocked and tackled like everyone else,” Mady said. “At this age level, the athleticism is close enough that there’s not a marked difference. Jaelynn Monk is one of the fastest players in our flag football league and one of the best players on her team. We have an 8- or 9-year-old girl who is probably the fastest in her grade. Once puberty kicks in things change but prior to that if you are an athlete, you are an athlete and kids respect that.”\nJestin Monk, the father to the aforementioned Jaelynn Monk, is beginning his second season coaching his daughter’s team.\n“Jaelynn is 10 and plays running back but before being introduced to flag football she was more of a girly girl into cheer and gymnastics,” said Monk, a Matamoras resident. “Flag opened the door to other sports such as lacrosse and basketball. She is fast and strong and rougher than some of the boys out there. I make it clear to her that she and her teammates will do the same training and work just as hard as the next player.”\nLast season, Jaelynn was the only girl on the team. This season, which kicked off this month, there are three. What’s more, this school year marks the first time girls’ flag football will be sanctioned as a high school sport by the Pennsylvania Interscholastic Athletic Association.\n“I attribute the popularity to a cultural shift that introduces girls to the game and teaches the game in a fun manner,” Monk said. “The play can be rough at times and when it is we remind them they are not playing tackle. These kids love being aggressive and competing.”\n“I like learning different plays and building things as a team,” Jaelynn said. “I like playing against boys because I feel it is more competitive and I would like to play in high school. My friends support me and when I score a touchdown I hand the ball to the referee.”\n“Wrestling changed my outlook and made me improve my diet. I cannot stress the mental part enough. The past season I was struggling mentally due to a shoulder injury, but this sport teaches you to be physically and mentally strong.”\n- Wrestler Maddie Hammett of West Milford High School\n“When you fall, the first thing you do is ask yourself what happened. A lot of people get the wind knocked out of them. Thankfully, that hasn’t happened to me. I did recently sprain my ankle jumping my dirt bike in my backyard when my foot came off the peg, but it is basically healed already.”\n- Ella Hammett of West Milford, who races her Kawasaki KX112 super minibike in motocross\n“It is more intense playing with the boys. Checking is allowed and sometimes they think I’m an easy target. I have been playing varsity for the past three years and every time I get hit into the boards my goalie will start yelling at the official and many of my teammates have gotten penalties for boarding the guy who hit me. My coaches also check on me after a hit and ask if I want to sit out a shift. I tell them I’m good and to put me back in.”\n- Newton-Lenape Valley’ hockey player Catherine Kramer\n“I dirt bike, snowboard, mountain climb and when the flag football team started, I had to jump on. My brothers played a big role in getting me into football because I grew up playing with them. I like that I can be aggressive and run into people a little bit because even though it is flag, it can get physical depending on the referee and what a player can get away with.”\n- Goshen High School senior flag football running back Scarlett Winkler\n“Wrestling boys is harder but it makes me wrestle smarter and improves my technique because they are stronger. Wrestling boys makes it easier to go against girls. My goal is to win a state championship.”\n- Monroe-Woodbury wrestler Gail Sullivan\n“I like learning different plays and building things as a team. I like playing against boys because I feel it is more competitive and I would like to play in high school. My friends support me and when I score a touchdown I hand the ball to the referee.”\n- Jaelynn Monk, 10, who plays running back in the Pike Area Youth Athletic League’s co-ed flag football program\n“I was surprised girls were wrestling and that it was OK to throw people around and not get in trouble for it. It wasn’t field hockey, soccer or softball. It was a new norm that enabled me to get healthier doing something I loved. I go to the gym before school and stay late after practice. I had no idea wrestling would become one of the biggest things in my life.”\n- Newton-Kittatinny wrestler Abbie Paglia",
  "word_count": 3569,
  "scraped_at": "2026-02-14T12:43:47.403354"
}