{
  "article_id": "9a34a6092519",
  "url": "https://www.bbc.co.uk/sport/football/67673738",
  "title": "Man Utd 1 - 2 Liverpool : Hosts beaten and lose ground in WSL title race",
  "date": "20231217T164500Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United Women 1-2 Liverpool Women: Hosts beaten and lose ground in WSL title race\n- Published\n- comments\nManchester United's defeat by Liverpool in the Women's Super League was down to a lack of \"desire\", says manager Marc Skinner.\nUnited lost ground in the title race as rivals Liverpool came away with a superb 2-1 victory at Leigh Sports Village in their final match of the year.\nIt is the first time Matt Beard's side have beaten United in the WSL and fifth-placed Liverpool moved level on points with them, seven behind leaders Chelsea.\n\"We lost on the fundamentals of football,\" said Skinner. \"They headed it better than us, they kicked it better than us and the two goals are ridiculously bad [to concede] by our standards.\n\"It's desire. We lost too many headers. [Liverpool striker] Sophie Roman Haug had a field day and it bleeds into the performance.\n\"We weren't aggressive. It was a bad day for us. I don't think we outperformed Liverpool or deserved anything from the game. You just can't lose games on the goals we conceded. You just can't concede goals like that.\"\nIt looked like it could be a difficult afternoon for Liverpool when United took the lead within three minutes - Ella Toone pouncing on Leah Galton's pass after the winger's shot had come back off the post.\nMelvine Malard should have made it 2-0 straight afterwards when she fired into the side-netting from close range with the goal gaping.\nBut Liverpool responded well, battling through a first half riddled with errors, and got themselves back into the game when Mel Lawley's cross was flicked in by United defender Millie Turner for an own goal.\nUnited struggled to deal with set-pieces throughout and that eventually proved costly as Liverpool defender Taylor Hinds bundled in the winner with the inside of her knee from Missy Bo Kearns' delivery.\nThe hosts pushed for an equaliser late on and Liverpool goalkeeper Teagan Micah blocked Hannah Blundell's strike, after substitute Rachel Williams' header flew over the bar.\nThere was lengthy stoppage time following a worrying head injury for Liverpool's Gemma Bonner, who left the pitch with blood across her face, but was able to walk off with support from medical staff.\nManager Beard confirmed afterwards centre-back Bonner was expected to go to hospital for further treatment.\n\"I just went in to see her, she's OK,\" he added. \"She's talking. She's getting her lip stitched but she doesn't remember the incident.\n'You feel pressure every day in the job'\nThis is a concerning result for United.\nIt is the fifth time in the WSL this season they have dropped points, with two defeats and three draws just 10 games into an inconsistent campaign.\nIt will no doubt put pressure on manager Skinner to turn results around as they go into the Christmas break trailing their rivals and already out of European competition.\n\"We just have to win every game, that's all we can do,\" said Skinner, when asked about the title race.\n\"We need to continue to invest to develop the squad. We've had injuries this year which has affected the depth of the squad in three-game weeks. It's really important. Otherwise you won't be in a position to challenge.\n\"Do I think we're good enough to win the title? I think we can be good enough but you have to be almost near perfect. That's something we have to address. We can't be almost near perfect every game to win the title.\n\"We have to be more aggressive in the market and we have to have that support and help in order to be a consistent challenger. I think we still have some development to go.\"\nSkinner also bemoaned the \"poor\" goals his side conceded and was \"frustrated\" by their performance, but it does little to change his feelings regarding pressure.\n\"There's pressure when we win, pressure when we lose and pressure when we draw,\" added Skinner.\n\"It's the reality of being manager at Manchester United. You feel it every day you're in the job.\"\n'We are an ambitious football club'\nLiverpool's pre-season ambition was to close the gap on the WSL's top four and knew they would draw level on points with United if they won.\nThey were always going to have to ride their luck and dig in if they were to achieve it and that's what Beard's side did for the 113 minutes played in Leigh.\nGoalkeeper Micah pulled off brilliant saves when needed, while her United counterpart Mary Earps was equally busy - a superb fingertip save to deny Bo Kearns one of the highlights.\n\"It was a tough start for us. We nearly gifted them a second goal,\" said Beard.\n\"The way we recovered and the way we grew into the game, we were worthy of the three points. It's great to keep in touch with that top four or top five - so it was an important win.\n\"I know on our day we can compete and I think we've proven that a few times already this season. It's great to have targets. We are an ambitious football club but we take it game by game.\"\nThe result highlights Liverpool's vast progress since a 6-0 WSL defeat on their last trip to Leigh in January and they end the year on a high, well on course to achieve their ambition.",
  "word_count": 900,
  "scraped_at": "2026-02-14T12:40:24.291253"
}