{
  "article_id": "9a4bd168fc66",
  "url": "https://www.aol.com/ucla-ohio-state-showcased-big-024709378.html",
  "title": "UCLA - Ohio State showcased new Big Ten rivalry a season early . Here why the No . 2 Bruins scheduled the game",
  "date": "20231219T041500Z",
  "domain": "aol.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UCLA-Ohio State showcased new Big Ten rivalry a season early. Here's why the No. 2 Bruins scheduled the game\nUCLA is heading back to Los Angeles with another résumé-building win and a better idea of what life will be like in the Big Ten next season both in competition level and travel requirements.\nThe No. 2-ranked Bruins held off a late rally by No. 13 Ohio State to stay undefeated with a 77-71 win at Value City Arena in Columbus, Ohio, on Monday in what will be a conference game beginning next season. The win was their third against a ranked opponent as the Bruins prove to be a formidable title contender.\nSenior Charisma Osborne (19 points) and the sophomore trio of Lauren Betts (17 points, 11 rebounds), Kiki Rice (15 points) and Gabriela Jaquez (11 points, 5-of-6) led the balanced attack against Ohio State’s notorious full-court pressure. The UCLA defense held the Buckeyes to their lowest scoring output of the season.\nThis year, it’s only an entry on the résumé and experience against a different style of play in advance of the NCAA tournament. Next season, it will likely help determine a Big Ten title between, at minimum, five teams currently in the Associated Press Top 25. No. 6 USC will also join the Big Ten and elite programs Ohio State, No. 4 Iowa and No. 16 Indiana in a battle for conference supremacy.\nIt was the Bruins’ second matchup of the season against a future conference foe after they hosted Purdue in the season opener. And it completed their final of four individual trips to the eastern half of the country in a travel schedule that carried a similar burden they’ll have in the widened Big Ten footprint.\nUCLA’s nonconference schedule filled with long trips\nUCLA head coach Cori Close designed a 2023-24 nonconference schedule that brought her Bruins to the Eastern or Central time zones four consecutive weekends, culminating in the trip to Columbus. Close said it was the team’s first real road game in a “hostile environment against a really good team” this season.\nIt is similar to how much traveling UCLA will do in the Big Ten next season with multiple in-season trips across the country to the East Coast and Midwest.\n“We did four cross-country trips in nonconference this year, and we’ll just be flipping that because the Big Ten has committed to us not having to do it more than four times in the conference season,” Close said after their third road trip, which was to Connecticut for the Women’s Hall of Fame Showcase. “We’ve just looked at it and we’re going to be staying in the western United States with the exception of one time next year.”\nShe said 90% of their nonconference games in 2024 will be in their own Pacific time zone. Coaches, schools and athletic directors plan nonconference schedules about 12-18 months in advance, though some games are late adds. They are typically announced shortly before the season.\nThe Bruins began their heavy travel month flying to Florida for the Cayman Islands Classic, where they defeated UConn and Niagara in the last week of November. The following weekend it was a trip two time zones over to Fayetteville, Arkansas, for a game on Dec. 3. Last weekend, ahead of finals week, the Bruins visited Uncasville, Connecticut, for the Women’s Hall of Fame Showcase. Close said players were able to spread out on the plane and prepare for finals on the long trip.\n“The great thing is you can be strategic,” Close said. “We’ve known [the travel] was coming [and] we have an administration that’s been incredibly, incredibly supportive in the way that we travel. And so it’s really not been bad.”\nOne of the biggest questions out of realignment has been how to handle travel and scheduling. Most sports outside of football play closer to 20 conference games, including during the week. The new conference map stretches coast-to-coast from Los Angeles schools UCLA and USC, who announced their move to the Big Ten in July 2022, to New Jersey’s Rutgers University. Washington and Oregon will also join the Big Ten in 2024 amid the demise of the Pac-12 this summer.\nThe talent on the floor will be high and competition for conference titles fierce when the teams join the Big Ten. But what format that entails is up in the air.\nMegan Kahn, the Big Ten’s vice president of women’s basketball, told Yahoo Sports in December 2022 the conference was already in internal conversations with coaches about how the new conference schedule might work. It was before Washington and Oregon joined. The Big Ten told Yahoo Sports last week the 2024-25 conference schedule was not finalized.\n“Do we want to stay at 18 conference games?” Kahn said last year of what coaches were discussing. “Does it change the number of conference games we want to play? What does a West Coast swing look like? Are there certain days? Are there travel partners? Anything is on the table at this point that we’re sort of vetting through and I’m vetting through myself or with others involved at the table.”\nUCLA and USC each scheduled two Big Ten opponents this season and swept the matchups, 4-0.\nThe Bruins opened their season defeating Purdue 92-49 in Los Angeles while USC hosted Ohio State in what was a showdown of AP Top 25 teams. USC won 83-74. The Trojans also hosted Penn State, which was briefly ranked, late last month and won 71-70.",
  "word_count": 920,
  "scraped_at": "2026-02-14T14:08:08.333632"
}