{
  "article_id": "9a592f305e6d",
  "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/faces-17-people-police-want-27089148",
  "title": "Faces of 17 people police want to speak to right now",
  "date": "20230610T200000Z",
  "domain": "liverpoolecho.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Faces of 16 people police want to speak to right now\nThese people may have information about crimes across Merseyside\nPolice want to speak to these 16 people after incidents that have taken place across Merseyside.\nCCTV images have been published in the hopes to solve active investigations into crimes in the region. The crimes range from a violent protest outside Knowsley Suites to a woman being sexually assaulted in Liverpool city centre.\nMerseyside Police believe these people photographed may have information that could solve active cases. All appeals listed have been released from May this year, however some crimes date back to February this year.\nREAD MORE: Woman pleads not guilty to murder of Kasey Anderson\nA recent appeal relates to a man who is fighting for his life, after being assaulted in Vauxhall. At around 10.30pm on Saturday 27 May, emergency services were called to Fulton Street following reports that a man had been found unconscious after being attacked.\nThe victim, a man in his 50’s, was taken to hospital for treatment for his injuries and he remains in a critical condition. Detectives have arrested two people, a 15-year-boy and a 22-year-old man, on suspicion of section 18 wounding with intent.\nBoth suspects have been released on conditional bail. However, the investigation is ongoing and detectives have issued images of two women they believe may have witnessed the attack and could assist with their investigation.\nDetective Chief Inspector Tony Roberts said: “Although we have made two arrests, our investigation into this incident continues. We are appealing for anyone with information to come forward. If you were in the area at this time and witnessed the assault take place, then please get in touch.\n\"I also ask any motorists who were in the area to please check your dashcam footage in case you have captured something which will assist in the investigation. Every piece of information or footage could be vital in establishing what happened.\"\nWoman sexually assaulted in Coyote Ugly bar on Bold Street\nThe victim was at Coyote Ugly, on Bold Street, when she was assaulted by a man. It happened at around 8.50pm on Sunday, April 30. Police confirmed that the man was removed from the bar by security before he then left the area.\nAn investigation has been launched and officers have released a CCTV image of a man they wish to speak to. They believe that the man pictured may have information about the assault that will help the investigation.\nDetective Inspector Neil Dillon said: \"This was a disgraceful assault on a woman and we are determined to find the person responsible. We are taking this incident extremely seriously and I am appealing to the man featured in this image, or anyone who recognises him, to come forward.\"\nPeople police want to trace after Suites Hotel disorder\nDetectives investigating the serious disorder outside the Suites Hotel have appealed for help identifying 11 people who may be able to help police. An initial peaceful protest outside the Suites Hotel, on Ribblers Lane, Kirkby turned ugly when crowds attacked Merseyside Police officers.\nMissiles including lit fireworks were thrown towards officers and a police Matrix van was set on fire during the disorder on the evening of Friday, February 10. One officer was injured and taken to hospital.\nDetective Sergeant Phillipa Henderson said: \"Although we have made significant progress in keeping our community and officers safe since the unacceptable and disgraceful behaviour that took place on Ribblers Lane in February our officers are still working to find anyone who was responsible for the disorder and bring them to justice.\n\"We will always respect the right to protest when these are peaceful but such violence that caused damage to police vehicles and intimidated or targeted particular communities, will not be tolerated on our streets. We think the people pictured may have vital information to help our enquiries so if you know them, please come forward.\n\"If you recognise them, or have any information about what happened outside the Suites Hotel on Friday 10 February please contact us so we can continue to take action and ensure the safety of all residents in our community.\" View the full imagery here.\nWoman sexually assaulted at bar in Liverpool city centre\nThe woman was at Revolver bar on Temple Court at around 8.30pm on Saturday, 22 April when she was inappropriately touched by a man. She immediately alerted staff at the bar, and the man ran off towards Victoria Street and North John Street.\nMerseyside Police have now issued CCTV images of a man they believe may have information that could help with their enquiries. The victim was left very distressed by the incident.\nDetective Inspector Katie Coote said: “This was a disgraceful attack on a woman, and I would like to reassure the public that incidents such as this are rare. The victim is very shaken and understandably very distressed by the incident.\n“We are taking this incident extremely seriously and I am appealing to the man featured in this image, or anyone who recognises him to come forward. We believe he could hold information that could be vital to our continuing enquiries.”\nSchoolboy suffers head injury after attack at football match\nA teenage boy suffered a head injury and broken nose after being attacked at a football match. Merseyside Police received a report a 15-year-old boy had been punched outside Southport FC’s stadium on Haig Avenue, on Saturday, April 1 after a match against Gloucester City.\nThe teen suffered a broken nose and a head injury during the incident. Police said extensive CCTV and witness enquiries have been conducted, and CCTV images have been issued of a man who detectives believe could assist in the investigation.\nPolice said they believe the suspect was an away supporter and travelled back to Gloucester after the match.\nMan threw rock at door staff after being refused entry to nightclub\nMerseyside Police has issued a CCTV image of a man who they believe can assist their enquiries following reports of an assault in the city centre. It was reported that just before 2am on Saturday, April 15, a man became irate with door staff when he was refused entry to Pure Night Lounge on Back Colquitt Street.\nA short time later, the suspect picked up a rock from the ground and threw it at door staff which hit one person on the head. This caused the victim to fall to the ground and lose consciousness briefly.\nThe suspect ran off from the area before door staff were able to stop him. Extensive CCTV and witness enquiries have been conducted, and detectives have issued a CCTV images of a man they believe could assist in their investigation.\nDon't miss the biggest and breaking stories by signing up to the Echo Daily newsletter here\nREAD NEXT: Teen told police 'I'm not getting bailed' after stabbing delivery driver\nYoung mum who led double life as Encrochat user 'StiffNinja' has jewellery and property seized",
  "word_count": 1167,
  "scraped_at": "2026-02-14T12:00:35.245524"
}