{
  "article_id": "9a818cf26689",
  "url": "https://www.npr.org/transcripts/nx-s1-5327486",
  "title": "Jersey Shore Wave to kick off season as one of the newest teams in women football",
  "date": "20250329T200000Z",
  "domain": "npr.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SCOTT SIMON, HOST:\nThe Women's National Football Conference, a semi-professional women's tackle football league, kicks off its sixth season this weekend. The Jersey Shore Wave is one of the new teams that joined the league this year. Reporter Buffy Gorrilla attended a practice at their home field in Paterson, New Jersey, and brings us this report.\nKAREN MULLIGAN: Here we go, ladies. Go. Hey, just go, like, half-speed.\nBUFFY GORRILLA: Helmet and pads in place, Jersey Shore Wave quarterback. Karen Mulligan, AKA Mully, settles into her stance.\nMULLIGAN: Go.\nGORRILLA: Mulligan releases the football. Her target - wide receiver Shayla Thevenin.\nSHAYLA THEVENIN: Let's go. Mully about to hit me with a dime.\nGORRILLA: Thevenin sprints across the artificial turf towards the spiraling ball, making the catch.\n(SOUNDBITE OF GRUNTING)\nGORRILLA: The Jersey Shore Wave is one of the newest additions to the Women's National Football Conference, a tackle football league for women with 17 teams nationwide. After repeated tryouts, over 50 women made the roster and will suit up in bright teal uniforms. No. 58, Vianca Borrero, an office administrator, is on the defensive line. She has played the game casually since she was five.\nVIANCA BORRERO: My dad loves football, and he used to toss the ball to me back and forth. When he found out I was playing football, he got so happy. He's like, oh, my God. I'm excited for you. This is amazing, and it's a great opportunity for you.\nGORRILLA: Borrero wears glasses and is shorter than the other women.\nBORRERO: I actually got bigger pads and - 'cause I wanted to be super protected. So they kind of didn't fit me. I looked like kind of like a turtle in a shell 'cause it didn't really fit. And then I got these pads, and it felt real. Once you get the right pads, it feels like it's all coming together.\nFABIAN ALESANDRO: Sometimes, the learning curve is a little different because they haven't been exposed to football. But they're athletes, and they want to compete.\nGORRILLA: Head coach Fabian Alesandro has been coaching women's football for 15 years.\nALESANDRO: So you're just kind of changing those skills into what you need on the football field.\nGORRILLA: Skills like catching, throwing and tackling. For Borrero, the motion and mindset took some getting used to.\nBORRERO: It's kind of scary 'cause, you know, as a woman, it's not something you usually do. But once you get used to and you get comfortable, it's kind of like you let this inner energy you always had out on the field, and you just look at this player, and you know you both have the same drive to be here, and you just want to be your best and give them your best.\nGORRILLA: The WNFC is a semi-professional league, so women are not paid to play. They balance football with their off-the-field lives. Monae Clancy works in law enforcement. On the field, she's a running back who wasn't allowed to play football growing up.\nMONAE CLANCY: So my dad didn't let me play. My brother played. I cheerleaded alongside him, but I just got to watch.\nGORRILLA: Now Clancy and her teammates, Brooke Avery, Demira Lockhart and Borrero, get their shot.\nBROOKE AVERY: Once the pads are on and we hit the field, it's go time.\nDEMIRA LOCKHART: It's always a battle.\nBORRERO: I want to sack the QB as many times as I can.\nMULLIGAN: Run as far as I can, and don't let anyone touch me.\nGORRILLA: The season opener for the Wave pits them against another newcomer, the Chicago Winds, and Clancy is stoked.\nCLANCY: Everyone pushes each other to their goal. Even though we proved to ourselves already that we can play, we already know that there's a bigger goal.\nGORRILLA: And the goal, she says, is to prove to the world they can play.\nFor NPR News in Paterson, New Jersey, I'm Buffy Gorrilla.\nCopyright © 2025 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\nAccuracy and availability of NPR transcripts may vary. Transcript text may be revised to correct errors or match updates to audio. Audio on npr.org may be edited after its original broadcast or publication. The authoritative record of NPR’s programming is the audio record.",
  "word_count": 726,
  "scraped_at": "2026-02-14T12:42:59.934271"
}