{
  "article_id": "9a88adf1d90a",
  "url": "https://www.qgazette.com/articles/i-on-politics-366/",
  "title": "I On Politics - Queens Gazette",
  "date": "20231213T194500Z",
  "domain": "qgazette.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "REPORT ON ILLEGAL GUNS SEIZED: U.S. Senator Kirsten Gillibrand stood with NYPD Assistant Chief Jason Savino, Manhattan District Attorney Alvin Bragg, Brooklyn District Attorney Eric Gonzalez, Queens District Attorney Melinda Katz, and Staten Island District Attorney Michael McMahon at NYPD headquarters to unveil her original report analyzing initial successes from the Bipartisan Safer Communities Act (BSCA)’s anti-gun trafficking section and mental health funding distribution. Gillibrand’s first-of-its-kind report found that more than 1,300 illegal guns have been seized by law enforcement and more than 200 defendants have been charged under BSCA’s new gun trafficking statute. The analysis shows that at least 190 of the seized guns were AR-15s or AR-style weapons and authorities also seized at least 151 ghost guns. The data also revealed that over $750 million has been distributed to finance mental and behavioral health services nationwide, which will also support the hiring of over 14,000 new mental health professionals in schools.\nSenator Gillibrand’s Hadiya Pendleton and Nyasia Pryear-Yard Gun Trafficking and Crime Prevention Act formed the centerpiece of BSCA’s anti-gun trafficking provision. Gillibrand first introduced the bill in 2009 after meeting with the family of Nyasia Pryear-Yard, who tragically lost her life at 17 years old when she was shot by a perpetrator using an illegally trafficked gun. Gillibrand worked with Nyasia’s mother, Jennifer Pryear, to pass the bill into law and they attended the bill signing together last year.\n“After more than a decade of sustained advocacy, the centerpiece of my anti-gun trafficking bill was included in the Bipartisan Safer Communities Act, and this original report shows that the law is already taking guns off the streets and putting criminals behind bars,” said Senator Gillibrand. ”After less than a year and half with the new anti-gun trafficking statute, more than 1,300 illegal guns have been seized and more than 200 defendants have been charged. Additionally, more than $750 million has been distributed to support mental health services, which will also support the hiring of over 14,000 new mental health professionals in schools. Making gun trafficking a federal crimes was long overdue— BSCA is proof that Democrats are working hard to keep our communities safe, and that when Congress works together, we can make a difference on gun violence.”\n“Addressing the impact of illegal guns in New York City is a constant priority for the NYPD. The Safer Communities Act introduces new measures to help in that effort,” said Police Commissioner Edward A. Caban. ”I commend Senator Gillibrand and our elected officials for their partnership in this vital work – curbing gun violence and improving our collective public safety.”\nQueens District Attorney Melinda Katz said, ”The scourge of gun violence has stolen family, friends, and loved ones from our communities time and again, leaving heartache and hardship in its tragic wake. The Bipartisan Safer Communities Act, championed by Senator Gillibrand and signed into law by President Biden, works to limit access to firearms, thus saving lives, and provides substantial funding for mental and behavioral health care in the United States. Working together with our legislative and law enforcement partners, my office will continue to use every tool at our disposal to stem the tide of gun violence in this country. I thank Senator Gillibrand for her leadership on this issue.”\nNEW HEALTH INSURANCE LAW: New York State Assemblywoman Stacey Pheffer Amato (D-South Queens) had her bill, A.6806, which ensures the continuation of State health benefit plans for unremarried spouses and dependents of public employees, signed into law. Prior to Assemblywoman Pheffer Amato taking on this challenge, State and local government health insurance plans only allowed the continued offering of health insurance if the public employee had at least 10 years of service. For years this has been seen as a problem because public employees like police officers, firefighters, sanitation workers and transit workers, who got injured on the job and had to retire with less than 10 years of service, were not entitled to continued health insurance, nor were their families. That changed through the enactment of Assemblywoman Pheffer Amato’s law.\n“As your Assemblywoman, I have always, and will always, do everything I can to make sure public employees and their families are protected,” said Assemblywoman Pheffer Amato. “Through this law, we have solidified our commitment to the families of the men and women who not only protect our State, but also keep us moving forward. If a public employee is injured on the job and required to take an early retirement, their families will always have health insurance. The signing of this bill into law guarantees it!”\nSupporters note that the Assemblywoman is a longtime champion for the protection and rights of public employees, and their families. Pheffer Amato serves as the Chair of the New York State Committee on Governmental Employees, which is the leading legislative authority on all public employees in New York, including retirees. In her role she presides over and facilitates legislation and policies for public employees that range in pensions, retirement benefits, and health insurance. She had vocally supported and successfully worked with advocates to bring a lawsuit forward to halt the implementation of the forced switch of over 250,000 City-retirees to Medicare Advantage.\nMENTAL HEALTH CARE ‘INACCESSIBLE’: New York Attorney General Letitia James released a comprehensive report clearly demonstrating that health insurance companies are failing to offer adequate access to mental health care, exacerbating the mental health crisis in New York. The Office of the Attorney General (OAG) surveyed nearly 400 mental health providers listed on health plans’ networks and found that the overwhelming majority, 86 percent, were “ghosts,” meaning they were unreachable, not-in-network, or not accepting new patients. Inaccurate network directories are worsening the statewide mental health crisis and disproportionately impact marginalized communities, leading to adverse health outcomes, and increasing costs for patients. Today’s report follows Attorney General James’ mental health hearings across the state and offers recommendations to increase access to mental health care.\n“No one who reaches out to mental health professionals listed by their insurance company should be told that the providers are unreachable, not accepting their insurance, or not accepting new patients,” said Attorney General James. “Our state is facing a mental health crisis, and this report clearly shows that insurance companies are failing to help New Yorkers in need. By not maintaining accurate directories as required by law, health plans are making it harder for New Yorkers, especially the most vulnerable among us, to get mental health care and forcing them to delay or forego the care they need. I am calling on health plans to rapidly address this problem and help us tackle the mental health care crisis.”\nAttorney General James held mental health hearings in New York City and Buffalo in June 2022 and January 2023 to help highlight the crisis impacting residents throughout the state. In both hearings, more than 100 patients and providers described a broken system. Parents told OAG they spent months trying to find a provider through their insurance plan but could not find one, which led to their children experiencing worsened conditions.\nFollowing the hearings, OAG staff conducted a statewide review of 13 health plans: Aetna, CDPHP, Cigna, Emblem, Empire BlueCross BlueShield, Excellus, Fidelis, Healthfirst, Independent Health, MetroPlus, Molina, MVP, and UnitedHealthcare. Callers attempted to schedule an appointment for an adult or child with a mental health provider who was listed as accepting new patients. Of the 396 providers called across all plans, only 56 providers, or 14 percent of those contacted, offered appointments. 86 percent of the listed, in-network mental health providers staff called were ghosts, as they were unreachable, not in-network, or not accepting new patients.\nImpact of “Ghost Networks” on New Yorkers\nNew Yorkers struggling with mental health conditions rely on health plan provider directories to access affordable, quality health care services. However, when provider directories contain inaccurate listings or unavailable providers — known as ghost networks — patients may be unable to access treatment using their health insurance benefits. As a result, they are forced to choose between paying out-of-pocket, which is not possible for many, or forgoing treatment altogether.\nGhost networks are particularly harmful to New York’s most vulnerable residents, including low-income individuals, people of color, individuals with disabilities, and women, who are least able to aﬀord the cost of out-of-network care.\nAt the OAG mental health hearing in Buffalo, a Black parent from Rochester testified about her struggle to find appropriate and culturally responsive care for her child, describing a tangled and deeply inequitable system. Because they were unable to find appropriate care, she and her child endured eight to 10 psychiatric emergency room visits, more than 15 mental hygiene arrests, and countless referrals, meetings, and six-month wait lists over three years.\nAt the OAG mental health hearing held in New York City, a woman provided testimony that after treatment for depression in the emergency room at Bellevue Hospital, she was told that she would be referred to a therapist in a clinic that would accept Medicaid. However, she could not access treatment with any of the providers to whom she was referred, as they either did not return her calls or had long waiting lists. A mother provided testimony that she was unable to obtain in-network treatment for her elementary school-age child, who suffers from Attention Deficit Hyperactivity Disorder.\nIn 2022 a mother filed a complaint with OAG that she was unable to find an in-network psychiatrist who could provide psychotherapy for her 14-year-old Black son, who suffers from major depression and attention-deficit disorder. Carelon, which administers mental health benefits for the mother’s insurer, EmblemHealth, gave her a list of eight in-network providers. She called all of them, but none were accepting new patients, provided both psychiatry and psychotherapy, or were culturally competent to treat a patient of color. After OAG intervened, the plan entered into a single-case agreement with an appropriate provider.\nThese cases reported to OAG demonstrate the real barriers New Yorkers face in accessing a mental health care provider because insurers are not maintaining up to date directories.\nOAG Recommendations\nTo address this crisis and ensure that New Yorkers with mental health conditions have access to affordable and necessary treatment, major action is needed. State agencies must propose regulations for network adequacy for mental health and substance use disorder treatment services by December 31, 2023. The OAG report recommends that:\nState regulators, such as the Department of Health (DOH), the Office of Mental Health, and the Department of Financial Services, should actively and frequently monitor health insurance networks through secret shopper surveys and other techniques to ensure that their directories are up to date. In particular, health plans should be required to ensure that members can get an appointment with an in-network provider within a short time frame. Plans must also collect and report information about whether network providers are actually providing care.\nState regulators should also take enforcement actions against health plans that violate the law, and seek penalties, corrective actions, and restitution to consumers.\nHealth plans should be required to meet cultural competence and language access standards. At OAG’s January 2023 mental health hearing, several consumers and advocates testified about the need for culturally competent mental health care. The 2023 amendments to the New York Public Health Law require DOH to consider during its network adequacy reviews an insurer’s ability to provide culturally and linguistically competent care to meet the needs of the enrollee population. These provisions should be codified into a regulatory requirement that all New York health plans provide access to culturally and linguistically competent mental health care.\nHealth plans should actively recruit and provide more incentives for mental health care providers to join and stay in their networks, including by providing higher reimbursement rates and reducing administrative burdens on providers.\nThe increased demand for mental health services in recent years has exacerbated longstanding network inadequacy, but health plans bear responsibility due to their low reimbursement rates for mental health services compared with physical health care. Health plans should also increase reimbursement rates for mental health providers to incentivize more providers to join their networks.\nHealth plans can incentivize greater mental health provider participation in networks by reducing administrative burdens that deter many providers from joining networks. By reducing administrative burdens such as time-consuming and unnecessary prior authorization and documentation requirements, and paying claims promptly, health plans can attract and retain more mental health providers.\nAdopting these recommendations can significantly increase access to needed mental health care.\nThis report is part of Attorney General James’ ongoing efforts to address the mental health care crisis across New York. Attorney General James held two public mental health care hearings in New York City and Buffalo to hear directly from impacted New Yorkers. In October, Attorney General James and a bipartisan coalition of 32 attorneys general filed a federal lawsuit against Meta for harming young people’s mental health and contributing to the youth mental health crisis. Also in October, Attorney General James led a coalition of 18 attorneys general in calling for stronger federal regulations to ensure behavioral health services are covered equally to other types of health care. In August 2021, Attorney General James announced a landmark agreement with United Healthcare to resolve allegations that United unlawfully denied health care coverage for mental health and substance use disorder treatment for thousands of Americans, securing $14.3 million in restitution for consumers.\nIf you or someone you know has an issue accessing care because of health insurance issues, please submit any reports online or call OAG’s Health Care toll-free helpline at 1 (800) 428-9071.\nSPECIAL ELECTION TO REPLACE SANTOS: Governor Kathy Hochul issued a proclamation declaring a special election to fill the vacancy in the 3rd Congressional District created by the expulsion of George Santos from the United States House of Representatives. The special election will occur on Tuesday, February 13, 2024.\n“As Governor, I have the solemn responsibility to call a special election to ensure the voters of Long Island and Queens once again have representation in Congress,” Governor Hochul said. ”Members of Congress provide critical constituent services, serve as a link to federal agencies, and advocate on behalf of the constituents who sent them to Washington. I look forward working with the next representative for the 3rd Congressional District on the issues facing New Yorkers.”\nJUSTICE O’CONNOR HONORED: The Women’s Bar Association honored the life and legacy of Justice Sandra Day O’Connor: “The Women’s Bar Association of the State of New York (“WBASNY”) expresses its deepest condolences and joins the nation in mourning the passing of the trailblazing and esteemed Justice Sandra Day O’Connor, the first woman to serve on the United States Supreme Court.\n“Justice O’Connor’s profound impact on the legal profession and her tireless efforts to promote gender equality have left an enduring legacy on the legal landscape. She shattered glass ceilings and served as a source of inspiration for countless women in the legal profession, opening doors to a more diverse and inclusive judiciary.\n“WBASNY recognizes Justice O’Connor for her historic appointment and steadfast commitment to justice, fairness, and the rule of law. Throughout her remarkable career, she embodied the highest standards of integrity, wisdom, and judicial excellence. Her influential decisions have left an indelible mark on American jurisprudence, shaping the perspectives of legal scholars and practitioners alike.”\n“In honoring Justice O’Connor, we not only celebrate a legal luminary but a true advocate for women’s rights and equality,” remarked Dawn Lott, President of WBASNY. “Her legacy is a reminder of the progress we have achieved and the challenges that persist. Reflecting on her groundbreaking achievements, we are inspired to continue working towards a more just and equitable legal system.”\n“WBASNY reaffirms its commitment to advancing justice and equality, championing women’s rights, and fostering a legal community that mirrors the diversity and inclusivity Justice O’Connor advocated for throughout her illustrious career.”\nREVEAL IMMIGRANT EXPENDITURES: Council Members Inna Vernikov (R-Brooklyn) and Robert Holden (D-Queens) introduced a bill, Intro 1273, to create a public database tracking the expenditure of funds related to the migrant crisis.\nThe recent November Plan’s cuts to critical services, coupled with an estimated $12 billion city cost for managing the crisis, highlight the urgent need for transparency. This legislation aims to empower taxpayers by shedding light on how their money is allocated, especially in times of fiscal challenges and increased costs.\n“In the past in times of crisis and emergency, the city tracked all government spending whether it came from us or the federal government,” said Council Member Vernikov. “We need greater transparency, both on where the money is coming from, where it’s going and precisely what it’s being spent on.”\n“We can’t sustain spending billions on a migrant crisis exacerbated by policy failures,” said Council Member Holden. “The public deserves to know how their tax dollars are used, and Intro 1273 will bring clarity, enabling citizens to demand accountability, including urging the White House to take responsibility.”\nCALLS FOR GENOCIDE ILLEGAL: Governor Kathy Hochul issued a letter to the presidents of colleges and universities across the State of New York saying calls for genocide made on college campuses are a violation of New York State Human Rights Law as well as Title VI of the Civil Rights Act of 1964. This letter follows the Congressional Hearing on Antisemitism where several university presidents failed to clearly and unequivocally denounce antisemitism and calls for genocide on college campuses.\nThe Governor assured New York State will enforce violations of the State Human Rights Law and will refer violations of Title VI to federal officials. Calling for genocide would be considered a direct violation of the State University of New York and the City University of New York’s Code of Conduct, and Governor Hochul made clear that all colleges and universities in the state are expected to apply the same standard, and to have a clearly defined and well publicized mechanism for individuals to report complaints.\nOn December 8, Governor Hochul announced the letter at Shabbat Services at Temple Israel, the site of a gun incident and subsequent arrest earlier this week. The Governor also visited Temple Beth Emeth in Albany to share a message of solidarity and made clear that New York State has no tolerance for hate and violence on college campuses.\nFollowing a surge in hate and bias incidents in the weeks following the October 7 Hamas terror attacks, Governor Hochul deployed all available New York State resources to protect New Yorkers in at-risk communities and on college campuses. The Governor also announced that Judge Jonathan Lippman will conduct an independent third-party review of the City University of New York’s policies and procedures related to antisemitism and discrimination, and produce recommendations for how all colleges can better protect the safety of their students.\nSHOOTING OUTSIDE TEMPLE: Senate Deputy Leader Michael Gianaris issued the following statement following reports of a shooting outside Temple Israel in Albany on the first night of Hanukkah.\n“Today’s incident is a reminder why we must do more to keep all New Yorkers safe from hate. While details are still emerging, it is clear an individual discharged a shotgun at a Temple and close to Jewish schools – which is an abhorrent offense. This is why I have called on Governor Hochul to include $90 million in security funding for nonpublic schools so we can keep our children safe from hate.”\nSHOOTS SUPER, FIRES AT COPS, FACES 40: Queens District Attorney Melinda Katz announced that William Hernandez was arraigned on an indictment charging him with attempted murder, kidnapping and assault for allegedly getting into a shootout with police officers after holding his building superintendent at gunpoint and then shooting him.\nDistrict Attorney Katz said: “The defendant is charged with attempted murder in the first degree for allegedly trying to kill a police officer in addition to attempted murder in the second degree in the shooting of his building superintendent. This is not the Wild West. This extremely dangerous and highly volatile situation was safely defused thanks to the bravery and skill of the responding NYPD officers. Carnage was averted and the defendant will now have to answer to the charges we have filed against him.”\nHernandez, 65, of 54th Street in Woodside, was arraigned on an 11-count indictment charging him with attempted murder in the first and second degrees, kidnapping in the second degree, assault in the first and second degrees, two counts of criminal possession of a weapon in the second degree, criminal possession of a weapon in the third degree, and three counts of reckless endangerment in the first degree. He faces up to 40 years in prison if convicted. Supreme Court Justice Leigh K. Cheng ordered Hernandez to return to court on January 17, 2024.\nAccording to the charges:\nOn November 22, at approximately 10:00 a.m., Hernandez confronted the superintendent on the second floor of the building where he lived. The superintendent, Cruz Catana Velasquez, 48, had gone to see a tenant. Hernandez pointed a 9 mm handgun at him, directed him into an elevator and held the elevator.\nHernandez prevented Velasquez from leaving the elevator for approximately 54 minutes, continually threatening to shoot him.\nWhen Hernandez’ attention was distracted by passersby in the hallway, Velasquez ran from the elevator to the nearby staircase. Hernandez fired numerous shots at him, striking the victim in the shoulder, side and abdomen.\nVelasquez ran down the staircase to the lobby and out of the building. Two people saw the wounded superintendent and called 911.\nResponding officers from the 114th Precinct arrived on the scene and saw a man reach out of a sixth-floor apartment window and fire a shot directly across the street.\nA team of officers went up to the sixth floor and observed Hernandez hiding behind a wall with a gun in his hand.\nAfter Hernandez ignored repeated commands to drop the gun, an officer fired at him. Hernandez fired back at the officer and the same officer returned fire. No one was hit.\nWhen Hernandez barricaded himself inside his sixth-floor apartment, the New York City Police Department Emergency Services Unit responded to the scene. Hernandez refused to come out. The standoff lasted for about two and a half hours.\nESU officers entered the apartment after hearing a gunshot and found Hernandez in the bathroom with a gunshot wound to his chest.\nHernandez was apprehended at approximately 1:45 p.m. and taken to a nearby hospital.\nThe superintendent underwent surgery for his gunshot wounds.\nFollowing Hernandez’ apprehension, a search warrant was obtained for his apartment. A loaded 9 mm firearm was recovered from the hallway inside by members of the NYPD.\n16 Y.O., PARENTS CHARGED IN FATAL SPEEDING: Queens District Attorney Melinda Katz announced that a teenage driver and his parents have been charged in connection with the death of a 14-year-old girl who was a passenger in a car sheared in half after crashing at more than 100 miles an hour into a parked UPS truck on a busy Queens thoroughfare. The victim, Fortune Williams, was ejected from the BMW and shortly afterward pronounced dead at the scene on North Conduit Avenue near 160th Street in Jamaica.\nThe unlicensed 16-year-old driver of the BMW, a gift from his father, is charged with manslaughter and reckless driving. While his junior license allowed him to drive when accompanied by a licensed driver at least 21 years of age, the defendant was alone in the car with the victim at the time of the May 17 crash. Prior to the fatal collision, in November 2022, witnesses from the defendant’s school began seeing him regularly driving the same BMW to and from school unaccompanied by an adult. He was ticketed in November 2022 for driving without a license and driving while using a portable electronic device. His name is being withheld because of his age.\nHis parents are charged with endangering the welfare of a child and permitting unlicensed operation.\nDistrict Attorney Katz said: “We will argue that the horrific car crash that took Fortune Williams’ young life was the result of recklessness and negligence, not only on the part of the minor behind the wheel, but the adults who put him in the driver’s seat.”\nThe now 17-year-old, of 227th Street in Springfield Gardens, was arraigned on charges of manslaughter in the second degree; three counts of assault in the second degree; assault in the third degree; reckless endangerment in the second degree; endangering the welfare of a child; reckless driving; driving in excess of the maximum speed limit; unsafe lane change on a roadway laned for traffic; making an unlawful turn; two counts of operating a motor vehicle with a tinted windows; operating or driving a motor vehicle without a license; and operating a motor vehicle in violation of a restricted permit or license.\nHe faces up to 15 years in prison if convicted. His parents, Deo Ramnarine, 43, and Sean Smith, 39, also of 227th Street in Springfield Gardens, each face up to a year in prison.\nSupreme Court Justice Kenneth C. Holder ordered the defendants to return to court on February 5.\nAccording to the charges:\nOn May 17, at approximately 6:38 pm, the defendant was driving a red 2005 BMW 325I westbound on North Conduit Avenue near 160th Street at a speed calculated at 101 miles per hour. The posted speed limit was 30 miles per hour.\nThe teenager lost control of the vehicle when attempting to move from the left-center lane to the right-center lane and crashed into the back of a parked UPS truck. After hitting the truck, the BMW spun across the roadway and struck a tractor-trailer traveling westbound.\nAs a result of the initial collision, Williams was ejected from the front passenger seat of the BMW into the back of the truck. She suffered severe head trauma and was pronounced dead at the scene.\nAs a UPS employee was getting into his truck the BMW collided with the back of it, throwing the employee to the ground. He was taken to a local hospital where he was treated for a large hematoma to his leg, a laceration to his face and a bruise to his chest. He has not returned to work since the incident and will require surgery to repair a torn muscle in his shoulder.\nAt the hospital where he was being treated for minor injuries, the defendant explained to police that he had picked Williams up at her home and was taking her to his grandmother’s house. His father, who was with his son at the hospital, told police that while the BMW was registered in his name, he had bought the vehicle for his son and that the car was his son’s.\nThree weeks after the fatal crash, on June 7, Smith told the car’s insurer that his son had driven the BMW approximately twice with him in the vehicle and that his son was a good driver.\nWILLETS POINT 2 CB APPROVAL: Deputy Mayor of Housing, Economic Development and Workforce Maria Torres-Springer, New York City Economic Development Corporation President & CEO Andrew Kimball, Councilmember Francisco Moya, Community Board 7, New York City Football Club, Queens Development Group, Building and Construction Trades Council of Greater New York released the following statements after Community Board 7 voted in favor of the Willets Point Phase 2 development, a key milestone in the Uniform Land Use Review Procedure (ULURP) certification process:\n“From the beginning, our administration’s goal for the Willets Point development was to take the needs of the community seriously,” said Deputy Mayor of Housing, Economic Development and Workforce Maria Torres-Springer. “As we prepare to make this transformational investment, we are thrilled that Community Board 7 has affirmed their support for the project. We thank all of our partners who have maintained a constant, productive dialogue throughout the process and we look forward to seeing the project come to fruition.”\n“NYCEDC is thrilled that Queens Community Board 7 voted in favor of the Willets Point Phase 2 development and looks forward to continuing the ULURP certification process and working with Queens Borough President Donovan Richards next,” said NYCEDC President & CEO Andrew Kimball. “New York City is proud to make a generational investment in Willets Point that will bring the largest new affordable housing development in over 40 years, not to mention new public open space, hotel, much needed infrastructure and the city’s first soccer specific stadium that will be 100 percent privately financed. This next phase of development will help create nearly $6 billion in economic impact over the next 30 years, more than 14,000 construction jobs.”\nFamously called the “Valley of Ashes” in F. Scott Fitzgerald’s The Great Gatsby, the Willets Point peninsula has been polluted by industrial and auto-related uses for the last century. For many years, it has lacked proper streets and basic sewer infrastructure.\nSupporters noted that this presents an enormous opportunity for:\nEnvironmental cleanup\nInvestment in neighborhood- AND borough-serving sewer and street infrastructure\nThe creation of new mixed-use, mixed-income neighborhood to serve Queens families\nBuilding a place to live and work as well as a destination for visitors\nAnd generating incredible economic growth for Queens\nOver the past 20 years there have been multiple planning processes and attempts to redevelop Willets Point–many of them unsuccessful.\nMore recently in 2018, a community taskforce developed a set of broad recommendations that will serve as a guide for future development Willets Point.\nThe Task Force came up with a proposal that reimagines the Special Willets Point District as hub for a new soccer stadium.\nIn this Administration, this vision is in development to become a reality, bringing:\n2,500, 100% affordable homes, with the first phase of housing to break ground this year\nThis is the largest new affordable housing development in NYC since the 1970s.\nA new 650-seat public school.\nNew public open space of over 40,000 square feet.\nNeighborhood-serving retail.\nA 250-key hotel.\nAnd the City’s first soccer-specific stadium, which will be 100% privately by NYCFC.\nSupporters further promise that this development will create nearly $6 billion in economic impact over the next 30 years and over 14,000 construction jobs, and more than 1,500 permanent jobs.\nAll while bringing needed resources and critical infrastructure to the entire Willets Point community, including: new streets, signage, sidewalks, curbs, trees, lights, draining, stormwater management, water main/hydrants, sewers and utilities.\nThe Adams Administration is writing a new chapter for a neighborhood in Queens that has long been associated with neglect and disinvestment.\nNearly $1 billion in private investment and union labor for construction of stadium.\nWhile the soccer stadium will draw people from across the city, region, and the world, it will also be a place where diverse communities can connect, and where thousands of jobs will be created.\nThis project has been extensively discussed over many years and the community has been regularly briefed on plans and progress; during the public scoping session in April, when the community had an opportunity to comment on Phase 2 that includes the Stadium, there was near unanimous support for the broad scope of the project and its transformation into a neighborhood with housing and a sporting venue.\nUSPS TO GET AUDITED: U.S. Rep. Grace Meng (D-NY) applauded the United States Postal Service of Inspector General’s (OIG) announcement that it is auditing the United States Postal Service’s (USPS) efforts to mitigate mail theft in Queens.\nIn her ongoing effort to combat mail theft in the district, in a letter, Meng convinced USPS OIG to investigate mail that is being delivered throughout the borough.\n“For years, my constituents have voiced their concerns about the lack of safety of their mail as it travels through the postal system. I am proud to have catalyzed a response by OIG, ultimately leading to an audit that will investigate the mail theft problem plaguing our community,” said Meng. “My constituents deserve the peace of mind and benefits that so many other Americans enjoy, knowing that their mail is safe. This is a huge step in addressing the issue and I am honored to have spurred the start of this investigation on behalf of my constituents.”\nThis is the first time that such an investigation into Queens mail security has been conducted. The extent of the audit will include an examination of the mail system to help determine the adequacy of the security of mail in Queens.\nThe estimated release date of the investigation report is currently scheduled for March of next year.\nBOLSTER CITY’S LIFE SCIENCES: New York City Mayor Eric Adams today signed legislation that will further bolster New York City’s life sciences and biotech sectors by offering a tax incentive for growing biotech companies to create jobs in New York City. The new law builds on significant progress the Adams administration has made to create and attract accessible jobs in life sciences and delivers on a key recommendation to invest in the sector from Mayor Adams and New York Governor Kathy Hochul’s “New” New York: Making New York Work for Everyone plan.\n“Employing more than 20,000 New Yorkers and counting, biotech and life sciences are critical to the success of working people in New York City,” said Mayor Adams. “Our city continues to drive innovation, and with this legislation, we are expanding research, discovery, startups, and more to tap into our city’s talented workforce. I am proud to sign this important legislation that will make the smart investments that pave the way for new scientific breakthroughs and deliver real economic mobility for diverse New Yorkers and their families.”\n“As described in the ‘New’ New York plan, New York City must continue to invest in future-focused sectors where we have a competitive advantage and that is exactly what we are doing with the reinstatement of the Biotech Tax Credit,” said Deputy Mayor for Economic Development, Housing, and Workforce Maria Torres-Springer. “Today’s legislation sends one message loud and clear: if you are starting or growing a life sciences company, you should do it in New York City because we are invested in your success.”\n“A key recommendation from the ‘New’ New York plan, this tax credit will make it easier to attract and retain life sciences startups in New York City — cementing ourselves as a global leader for innovation,” said New York City Economic Development Corporation (NYCEDC) President & CEO Andrew Kimball. “The biotechnology industry is a growing sector throughout New York City, employing over 20,000 New Yorkers. With a goal to double this number in the next 10 to 15 years, creating more high-wage, high-growth jobs for New Yorkers, this industry remains vital in New York City’s economic footprint.”\nIntro. 1070 – A — sponsored by New York City Councilmembers Jennifer Gutiérrez and James F. Gennaro — creates a tax credit for biotech companies with a capped annual benefit of $3 million to target-growing startups. This bill would renew lapsed tax credits against the General Corporation Tax, the Unincorporated Business Tax, and the Corporate Tax of 2015 and be allowed between January 1, 2023 and January 1, 2026.\nThe New York City metro area is the country’s leading regional life sciences hub, with nearly 150,000 jobs and 5,100 businesses, generating over $23 billion in wages last year. Last month, Mayor Adams and Govenor Hochul unveiled the Science Park and Research Campus (SPARC) Kips Bay Master Plan for this first-of-its-kind life sciences career and education hub that will anchor the city’s industry. New York City was also recently selected by the Chan Zuckerberg Initiative to be the home of a new biomedical research hub in New York City that will leverage a nearly $300 million public-private investment to drive collaboration between leading research institutions and solve significant scientific challenges.\nThrough the EDC’s LifeSci NYC — a $1 billion initiative — the City of New York is on track to create 1,000 companies and 40,000 jobs, unlock 10 million square feet of wet- and dry-lab real estate, and generate billions of dollars in economic impact over the next 15 years. Since taking office, Mayor Adams has invested $27 million for new life sciences facilities for the City College of New York and Mount Sinai Health System, a new center for sustainability-focused biotech at the Brooklyn Navy Yard, and supported the opening of Rensselaer Polytechnic Institute and the Icahn School of Medicine at Mount Sinai’s Center for Engineering and Precision Medicine on Manhattan’s West Side.\n“In my role as chair of the City Council’s Committee on Technology, and as a Council Member representing the third largest Industrial Business Zone in the city, I understand how reviving the biotechnology tax credit is pivotal in solidifying New York City’s status as a premier hub for biotech innovation,” said New York City Councilmember and Chair of the City Council’s Committee on Technology Jennifer Gutiérrez. “By reinstating this tax credit, we will be able to stimulate growth in this essential manufacturing sector by fostering investment, offering incentives to qualified emerging technology companies, and paving the way for new job opportunities. With these initiatives, we are determined to establish New York City as a leader in the field of biotechnology and protect and strengthen our manufacturing zones.”\nCB 6 MANAGER TO RETIRE: Queens Community Board 6 announced the “well-earned retirement” of District Manager Frank Gulluscio. Mr. Gulluscio served Rego Park and Forest Hills for more than 18 years. During that time, he worked with three chairpersons and a myriad of community members and organizations. In his spare time, he spent 10 years serving on his local community board. Chair Heather Beers-Dimitriadis said, “Our District Manager may be leaving us, but we don’t believe for a second that Queens has seen the end of his public service. Frank cares deeply about his community and will always be involved.”\n‘WEIGH IN ON MAYORAL CONTROL’ State Senator John Liu, Chair of the Senate Committee on NYC Education, encouraged New Yorkers to take advantage of the upcoming five-borough public hearings on mayoral accountability, aka mayoral control of public schools. The hearings are hosted by the New York State Education Department (SED) and will be open to the public. The first public hearing took place in the Bronx on December 5.\nIn 2022, the state legislature passed a two-year extension of mayoral control with new checks and balances that added more members to the Panel for Educational Policy and required the State Education Commissioner to conduct a comprehensive review and assessment of the overall effectiveness of NYC’s school governance system. This review must include a study of school governance models and best practices used by other major municipal school systems, including those that have already reverted from mayoral control to more democratic systems. Additionally, the State Education Commissioner must hold a public hearing in each borough to engage and solicit input from the public on school governance.\nSED has created a website with additional details for providing oral and/or submitting written electronic testimony by January 31, 2024 at 5 p.m.\nState Senator John Liu stated, “It is time to seriously examine the now two decades of experience of running NYC schools under mayoral accountability/control, and SED has taken on this important work, as well as the work of analyzing changes made in other major school systems in recent years. Part of this process requires SED to hold public hearings in each of the five boroughs, and I encourage all stakeholders in our schools to participate. We should leave no stone unturned in considering how NYC schools can be best governed going forward, whether through mayoral control or otherwise.”\nThe hearing in Queens will be held on Monday, December 18, 6 p.m. to 9 p.m. at Thomas A. Edison Career and Technical HS, 165-65 84th Avenue, Jamaica, NY 11432. There will also be upcoming hearings in Brooklyn, Manhattan and Staten Island in January.\nAdditional information is available on the New York State Education Department website.\nHOCHUL’S VISION FOR CREEDMOOR: Governor Kathy Hochul unveiled the Creedmoor Community Master Plan, a community-driven framework for redeveloping underutilized land at the 125-acre Creedmoor Psychiatric Center campus in Eastern Queens. The plan seeks to transform approximately 58 acres of the State-owned Creedmoor campus from surface parking lots, overgrowth, and vacant buildings into a vibrant new community with homes, recreational spaces, greenery, and neighborhood retail. It is the result of a six-month collaborative planning process led by Empire State Development and the Queens Borough President’s Office, facilitated with help from the Metropolitan Urban Design Workshop. The plan, which was released today at a meeting with community stakeholders, is available here.\n“Creedmoor represents a once-in-a-generation opportunity for New Yorkers to reimagine State land and plan for the emerging needs of tomorrow,” Governor Hochul said. “Working together in productive partnership with the community – and thanks to the leadership of Queens Borough President Donovan Richards – we can build more housing, create more jobs, and strengthen Eastern Queens for the next generation.”\nQueens Borough President Donovan Richards Jr. said, “The potential before us on the Creedmoor campus is limitless, as the new Creedmoor Master Plan boldly outlines. From thousands of units of housing to historic homeownership opportunities to school seats to community facilities to retail, this plan represents the single largest investment in Eastern Queens in generations, and I could not be more excited for the work ahead. It’s taken decades to get to this moment, and I’m deeply grateful to Governor Hochul, Empire State Development and the residents of Eastern Queens for their tireless dedication and partnership in developing this community-centric proposal from the ground up. We’re making history every day in Queens, and this project is yet another example of our borough’s bright future.”\nEmpire State Development President, CEO and Commissioner Hope Knight said, “After decades of unrealized promises about Creedmoor, today Governor Hochul, ESD, and Borough President Donovan stand together in partnership with the community to support this comprehensive plan to strengthen Eastern Queens. This vision represents a new opportunity for the neighborhoods around Creedmoor to finally move forward on local priorities and prepare for the community’s emerging needs.”\nThe Creedmoor Community Master Plan introduces over 2,800 units of new housing, with more than 55 percent designated as homeownership. This would represent the area’s single largest new investment in housing since the 1950s and its largest single expansion in homeownership opportunities in nearly 50 years. The Plan also introduces a mix of affordable rental options for seniors and families, and continues a nearly 80-year history of veteran housing in Eastern Queens by offering individuals who have served in the armed forces preferential access to a portion of the project’s units. In addition, the Plan designates approximately 14 acres for open space and sets aside locations for amenities such as a recreation center, daycare facility, school, and neighborhood retail.\nNEW BEHAVIORAL HEALTH CLINICS: Governor Kathy Hochul announced conditional funding for 13 new Certified Community Behavioral Health Clinics, two in Queens, as part of the Governor’s $1 billion plan to transform the continuum of mental health care. New York’s nation-leading work to bolster mental health services and create integrated care models will help the needs of New Yorkers regardless of their ability to pay and to close gaps in coverage. Administered by the state Office of Mental Health in partnership with the Office of Addiction Services and Supports, these clinics will receive $3.5 million, doubling the number of clinics statewide – including six new locations in New York City – and greatly expanding the areas providing person-centered and trauma-informed care for individuals experiencing behavioral health issues.\n“Far too often, New Yorkers dealing with mental health issues and addiction are forced to piece together the specialized care they need in a system that has historically not been set up to treat the whole person,” Governor Hochul said. “Last year I prioritized a $1 billion investment to transform the continuum of mental health care in New York. By significantly expanding the number of Certified Community Behavioral Health Clinics throughout our state, we can better align mental health care and addiction care to make treatment more accessible to all New Yorkers.”\nFirst year conditional start-up funding of $265,000 was awarded to 13 service providers to establish clinics in seven upstate counties and three boroughs of New York City. These new sites will join 13 established clinics, which now provide walk-in, immediate integrated mental health and substance use disorder services for roughly 65,000 individuals of all ages and insurance status.\nIn New York City, conditional start-up funding was awarded to:\n- Catholic Charities Neighborhood Services in Queens\n- Outreach Development Corporation in Queens\n- Ohel Children’s Home & Family in Brooklyn\n- Interborough Developmental Center in Brooklyn\n- Community Association of Progressive Dominicans in Manhattan\n- Postgraduate Center for Mental Health in Manhattan\nThese conditional awards were also provided to seven areas upstate.\nGovernor Hochul announced the awards during a visit to VIP Community Services in the Bronx. Since 1974, VIP has operated a clinic providing family-centered integrated services for mental illness and substance use disorders, including crisis intervention services and care coordination.\nGovernor Hochul’s FY 2024 budget expanded funding for Certified Community Behavioral Health Clinics statewide by $14.7 million, including funding from the state’s newly created uncompensated care pool. With the first sites established in New York in 2017, these clinics provide comprehensive services and coordinate care across behavioral, physical health, and social service systems. These clinics provide care to any individual needing assistance for mental health or substance use, regardless of their ability to pay, place of residence, or age.\nEarlier this year, New York State allocated $5.1 million for the expansion of existing clinics using federal American Rescue Plan Act dollars. These funds will further enhance the impact of this valuable program across New York State.\nThese clinics link individuals to or directly provide crisis mental health services, including 24-hour mobile crisis teams, emergency crisis intervention, and crisis stabilization; screening and assessments; patient-centered treatment planning; and outpatient mental health and substance use services. In addition, these facilities help connect individuals to outpatient primary care screening and monitoring; targeted case management; psychiatric rehabilitation services; peer and family support services; and intensive community-based mental health care for veterans and members of the armed services.\nNEW LAW SUPPORTS SURVIVORS OF CRIME: Governor Kathy Hochul signed legislation S.214A/A.2105A to expand eligibility to victim compensation funds for victims and survivors of crime. The bill removes the requirement that victims provide documentation from law enforcement in order to be eligible for compensation and expands the window of time in which a victim can file a compensation claim.\n“We’re making it easier for victims and survivors of crime to access the compensation available to them,” Governor Hochul said. “As victims recover, this legislation will support New Yorkers in their time of need and ensure that they can receive the benefits they deserve.”\nLegislation S.214A/A.2105A expands eligibility for victims and survivors of crime to access victim compensation funds by removing the requirement that victims must report to law enforcement and provide corresponding documentation to be eligible to receive compensation. The legislation also allows victims to provide alternative forms of evidence that would show that a qualifying crime occurred.\nCity Council Speaker Adrienne Adams issued the following statement: “Unaddressed trauma plays a harmful role in producing negative health and safety outcomes for communities, underscoring the need to ensure crime survivors are supported in their recovery and pursuit of healing. Survivors of crime in communities of color that experience violence the most are among the least likely to receive victim services because of bureaucratic eligibility restrictions. By removing barriers to victim compensation, New York can advance equitable access to critical services that help victims get back on their feet. The Council was proud to have advocated for the passage of this legislation and will continue its focus on expanding access to services for victims that too often lack access. I thank Senate Majority Leader Stewart-Cousins and Assembly Speaker Heastie for their leadership, Senator Myrie and Assembly Member Meeks for sponsoring this critical legislation, and Governor Hochul for signing it into law.”\nCROSS BAY TOLL REBATES: Governor Kathy Hochul Announced a toll rebate program is coming to Bronx and Queens residents who use the Henry Hudson Bridge and Cross Bay Bridge, respectively. The rebates are made possible by the Outer Borough Transportation Account, which was established in 2018 to provide additional resources for outer borough transportation improvements.\nThe full enactment of the Queens Resident Toll Rebate Program for the Cross Bay Veterans Memorial Bridge would be implemented within the first quarter of 2024.\n“We are making travel easier and more affordable for working families in the Bronx and Queens who rely on the Henry Hudson Bridge and Cross Bay Bridge,” Governor Hochul said. “Whether it’s through this rebate program or the historic increases in MTA service we’ve implemented, I am committed to making travel more accessible to all New Yorkers.”\n“Promises made, promises kept! After years of hard work and perseverance, my constituents from Lindenwood, Howard Beach, Hamilton Beach and Ozone Park will no longer be penalized! Through the legislation I passed with Senator Addabbo, Queens residents who utilize the New York E-Zpass program and register for the program will get full access to their entire borough, especially the Rockaway Peninsula. Finally, the MTA and the Governor have listened and are implementing the removal of a barrier to secure economic opportunities for everyone in Queens,” said Assemblywoman Stacey Pheffer Amato, who noted that she and Senator Joseph Addabbo were “solely responsible for passing legislation securing the funding for the rebate program.”\nState Senator Joseph P. Addabbo, Jr. said, “We are about to witness the rebate of an unfair toll levied at the Cross Bay Veterans Memorial Bridge for Queens residents. This reversal is a monumental victory and an effort that elected officials and residents have been striving to accomplish for decades. This achievement will rebate residents for the only intra-borough toll in the city, assist the economic growth and enjoyment of the Rockaway peninsula, and could not have been accomplished without the collective efforts of the community, Governor Hochul, the MTA, and elected officials on the state level.”\nUnder the program, the MTA will rebate Queens residents on trips they make via the Cross Bay Bridge and Bronx residents on trips they make across the Henry Hudson Bridge. Drivers will be eligible for the program if they register for the resident rebate program with a valid New York Customer Service Center (NYCSC) E-ZPass account registered to a Bronx resident for Henry Hudson Bridge rebates or to a Queens resident for Cross Bay Bridge rebates. NYCSC E-ZPass customers whose accounts already meet the criteria for the rebate will be automatically enrolled by MTA Bridges and Tunnels and will be notified, while those who may be eligible but require action will receive instructions on how to properly register. The program is expected to begin in February 2024. Customers looking for more information can visit MTA Bridges and Tunnels Resident Programs.\nQueensboro Hill Library (60-05 Main Street, Flushing) is hosting a Food Drive for canned goods. The Lowell School students have taken up a collection which will be donated to the library on Dec 14th at 12 noon, adding to this season of Giving and Kindness.\n“This past year our Civic has seen an uptick in Food needs. We started a program of offering once a month a Food Bag of items that are requested as Main Staples, like for example: bread, milk, eggs, butter, fruits and vegetables. Our goal is to provide assistance where we can in promoting health and wellness in our Community,” said Maureen Regan, President, Queensboro Hill Flushing Civic. She added, “New York-Presbyterian Hospital together with Green Earth Urban Gardens have been funding and providing this much needed supplement. Our Councilwoman Sandra Ung graciously donated turkeys to our food bags, making Thanksgiving a time to give thanks. Our Holiday season is around the corner and December 14th at 12 noon we will be ending the year with Assemblywoman Nily Rozic as our sponsor and much needed voice in addressing Food Insecurity in our community. These distributions are by reservation at email queensborohillcivic@gmail.com. There will be no home deliveries food bags this month so please RSVP for pick up at noon.\n“So many have asked, is there a membership fee to join our civic. No, we thank our supporters for their funding and donations so we can continue to address local issues in a safe space. We hope to continue this program in 2024. We are open to other civics and groups willing to work together in addressing the needs our vulnerable families are experiencing. Call us.”\n‘FAST-TRACK FILM & TV’ Governor Kathy Hochul directed State agencies to fast-track the process for film and television productions, allowing these industries to quickly resume work now that both SAG-AFTRA and the WGA have ended strikes and ratified contracts. The film and television production industry is a key economic driver for New York, adding over $9 billion in Gross Domestic Product each year.\n“It’s critical that workers in all industries are fairly paid for their labor,” Governor Hochul said. “Now that the strikes are over, I am directing all relevant state agencies to fast-track approvals and permitting so that actors, writers and the dedicated middle-class professionals of this industry can get back to work.”\nIn anticipation of industry union strikes moving toward final agreements, New York State is preparing for the return of large-scale productions statewide. By December 11, State entities will review processes for marketing, making state-owned properties and services available for production and also identify ways to support business attraction. This includes expediting permits, keeping fees and direct personnel costs transparent and not exceeding the costs to the state, maintaining an industry point of contact within the agency to handle production requests, and ensuring the agency maintains a person or team to act as a liaison to expedite permits, clearances and the provision services. Properties and services provided by the state should be made available to the maximum extent practicable to production companies. Unresolved problems should be brought to MPTV and the Governor’s Office.\nNew York State’s Film and TV production industry generates millions of dollars in investment and supports thousands of production workers, caterers, hospitality workers, and small businesses in our communities every year. Unions, such as SAG-AFTRA and WGA, help to ensure high wages, full benefits and robust protections in the Film and TV Production sector and these jobs are accessible to a wide range of New Yorkers, with 44 percent of jobs in the industry available to workers without a 4-year degree. The industry is an important piece of New York State’s economy and according to the most recent independent evaluation, in 2021 and 2022, the film industry added over $18 billion in Real GDP and created more than 131,000 direct jobs.\nWINTER & HOLIDAY SAFETY FOR PETS: The holiday season and colder weather are here, so Senator Joseph P. Addabbo, Jr. urges all pet owners to take extra precautions to ensure the safety and well-being of their beloved animals. The festivities and dropping temperatures can present unique challenges for pets, and it’s important to be mindful of their needs during this time.\nHere are a few tips to keep pets safe and healthy during the holidays and winter months:\n- Mindful Feasting: While enjoying holiday feasts, it’s essential to resist the temptation to share rich, fatty foods with pets, as these can cause digestive issues or even more severe health problems. Instead, treat them with pet-friendly, holiday-themed treats.\n- Avoid Mistletoe & Holly : Holly ingestion can lead to pets experiencing nausea, vomiting, and diarrhea. Mistletoe consumption can result in gastrointestinal upset and cardiovascular issues. Additionally, various types of lilies can cause kidney failure in cats if consumed. Instead, consider opting for equally festive artificial plants crafted from silk or plastic, or select a pet-friendly bouquet.\n- Secure Decorations: Holiday decorations such as tinsel, ornaments, and electrical cords can pose a hazard to curious pets. Make sure these items are securely fastened and out of reach to prevent ingestion or injury.\n- Winter Shelter: If pets spend time outdoors, ensure they have access to a warm, dry shelter and fresh water. Consider bringing them inside during particularly cold weather.\n- Cold Weather Gear: Just like humans, pets can be sensitive to the cold. Consider using pet-safe antifreeze, providing them with protective clothing, and wiping their paws to remove any salt or chemicals after walks.\n- Holiday Travel: If traveling during the holidays, make sure pets are properly secured and comfortable during the journey. If they’re staying home, consider reliable pet care options to ensure their well-being while the owner is away.\nBe a responsible pet owner and make sure the pet is safe and comfortable, especially during the holiday season. By taking these simple precautions, pet owners can guarantee that their pets enjoy a happy and healthy winter season.\nFor further information and resources on pet safety and care, please visit https://www.aspca.org/pet-care/general-pet-care/holiday-safety-tips\nPUSH FOR SNAP TO ALLOW HOT FOOD: U.S. Reps. Grace Meng (D-NY), Brian Fitzpatrick (R-PA), Andrew Garbarino (R-NY), Abigail Spanberger (D-VA), and Senator Michael Bennet (D-CO) called for their legislation to be included in the upcoming Farm Bill that would allow the Supplemental Nutrition Assistance Program (SNAP) to cover hot food.\nIn a letter to the Chair and Ranking Members of House and Senate Agriculture Committees, the lawmakers urged the inclusion of their bipartisan, bicameral Hot Foods Act, which would remove an outdated prohibition that prevents families from using SNAP benefits to purchase hot foods such as prepared rotisserie chickens, hot sandwiches, and soups.\n42 million Americans benefit from SNAP, a critical federal poverty reduction program. The Farm Bill is taken up by Congress every five years, making this the Hot Foods Act’s best opportunity until 2028 to ensure SNAP recipients can purchase hot, ready-to-eat meals.\n“Since its enactment 60 years ago, SNAP has prohibited the purchase of hot foods,” said the lawmakers in their letter. “While this restriction may have made sense in the 1970s, when most families were cooking their meals at home, it is no longer an accurate reflection of American families’ dietary or lifestyle needs. During natural disasters, USDA’s Food and Nutrition Service grants waivers to affected counties so that SNAP participants can use their benefits to purchase hot foods when they are unable to prepare food at home. Such waivers demonstrate that the restriction on hot foods is an unnecessary red tape of business owners, program administrators, and American families.”\nThe lawmakers introduced the Hot Foods Act last May. Their correspondence is endorsed by the Food Research and Action Center (FRAC), GRACE, and National Association of Convenience Stores (NACS).\nCouncil Member Tiffany Cabán released the following announcements: Save Community Composting! “Prior to our Stated Meeting, I joined colleagues, community members, and local organizations in defense of community composting, which Mayor Adams is trying to kill with his ruthless budget cuts. We also learned this week that the Sanitation Department will be reducing the number of waste baskets on the street in response to these cuts. As a reminder: we live in the wealthiest city in the history of the world, home to over 100 billionaires, and site of literally billions of financial transactions every single day. It is outrageous to suggest that we cannot afford adequate city services and beloved community resources.\n“Calling all D22 nonprofits! Do you want to submit a proposal to make one of our Participatory Budgeting ideas come to life? If so, please submit a project proposal form before the end of the year. Questions? Review the Non-Profit Information Sheet or some to our non-profit info session this Thursday, December 14 at 3PM on Zoom.”\nTo register visit:\nhttps://us06web.zoom.us/meeting/register/tZEkcuGqqj8jEtNBybAQnyFa9vkUiqFCKfMY#/registration!”\nHOLIDAY CONCERT FOR LOCAL YOUTH: Celebrate the spirit of the season with a heartwarming winter evening filled with the joyous sounds of talented student musicians at a special free holiday concert, hosted by Senator Joseph P. Addabbo, Jr. in partnership with Harmony4All. It all happens on Tuesday, December 19, at 7:30 p.m. at All Saints Episcopal Church located at 84-85 96th Street in Woodhaven.\nAll are welcome to immerse themselves in an enchanting musical experience, as these gifted students share the magic of the holidays through their uplifting performances of festive tunes and timeless classics.\nHarmony4All is dedicated to bringing the gift of music to underserved students throughout our local schools, believing in the transformative power of musical education as a vital form of emotional and intellectual enrichment. By breaking down financial barriers and providing access to musical resources, they empower students to pursue their passion for music and artistic expression.\nThis event not only celebrates the musical talent of younger residents within our community, but also supports the meaningful vision of Harmony4All, fostering a brighter future for aspiring young musicians.\n“I am proud to help facilitate this event that will showcase the musical talent of the youth in our community, while also promoting the worthy vision of Harmony4All,” Addabbo said. “Holiday music is a great and important part of the season, and it allows individuals to get greater enjoyment of the Holiday Season.”\nUNG ADDRESSES SIDEWALK VENDING: Councilmember Sandra Ung introduced two pieces of legislation in the City Council that will address quality-of-life concerns on New York City’s public sidewalks.\nIntro 1272 requires the Department of Transportation (DOT) to conduct a site visit before the issuance or renewal of a stoop line stand license. A stoop line stand license permits a retail establishment to display merchandise on a public sidewalk.\n“Displaying merchandise outside retail stores is a great way to attract customers, but even if they adhere to all of the rules and regulations, the stands can still be obstacles for pedestrians and some areas are simply unable to handle the added congestion on the sidewalk,” said Councilmember Sandra Ung. “My legislation would ensure that our sidewalks remain clear, allowing for the safe and seamless movement of all pedestrians.”\nWhen a business applies for a stoop line stand license, Councilmember Ung’s legislation would require DOT to examine the location and determine if the display would interfere with the use of the sidewalk. In making such a determination, the department will consider the area’s pedestrian volume and any other factors the agency deems relevant.\nA stoop line stand would be considered an obstruction if it is located within ten feet of a permanent structure and it narrows the path for pedestrians for a distance of ten feet or more. If DOT determines the stoop line stand will not impact the flow of pedestrians, the agency must give its approval in writing before a license is issued or renewed.\n“In busy retail districts like downtown Flushing, even legal stoop line stands contribute to the congestion on our sidewalks and create pedestrian bottlenecks at chokepoints,” said Councilmember Ung. “This issue poses a particular challenge to some of our most vulnerable community members, including the elderly and those with mobility impairments. Our sidewalks are vital arteries that serve as conduits for community interaction, and they should be navigable by everyone.”\nMeanwhile, Intro 1271 would prohibit the use of a commercial charbroiler in connection with a mobile food vending cart. The pollution and particulate matter created from charbroiling food can have substantial impacts on air quality.\nThe fine for a first violation would be $400, with subsequent violations resulting in a $1,600 penalty. Multiple violations could result in the seizure of the char broilers, or the entire cart if the char broiler is permanently attached.\nThe councilmember’s office has received numerous complaints from residents about smoke from food carts that use char broilers infiltrating their homes and buildings.\n“The emission from char broilers contribute to air pollution, releasing particulate matter and other pollutants that have been linked to respiratory problems and other health issues,” said Councilmember Ung. “Residents, including vulnerable populations such as children and the elderly, deserve to live in an environment free from unnecessary health risks. My legislation would strike a balance between our vibrant street food culture and public health by promoting alternative cooking methods that are both less harmful and more sustainable.”\nBILL SUPPORTS STREET VENDORS: New York City Public Advocate Jumaane D. Williams introduced new legislation in the City Council aimed at providing street vendors with city support as New York’s smallest businesses. The bill is part of a broad package introduced on street vendor rights, resources, and reforms, including bills from Council Members Pierina Sanchez, Amanda Farías, Shekar Krishnan, and Carmen De La Rosa.\n“Street vendors are New York City’s smallest businesses, and they present both a vital service to consumers and a vital economic engine for our city, especially for marginalized communities,” said Public Advocate Williams. “By designating a specific division of Small Business Services to support street vendors through my bill, the city can provide the education and resources that are essential to the success of these entrepreneurs. I’m proud to have a bill as part of this legislative package, many years in the making, and honored to partner with the Council and advocates who have brought us to this point of progress.”\nThe Public Advocate’s bill, Intro 1268, would create a division of Street Vendor Assistance within the Department of Small Business Services, charged with providing training, outreach, and education to all food vendors and general vendors regarding entrepreneurship and compliance with all applicable local laws, rules, and regulation. It would also require the commissioner of small business services to update the department’s programs to facilitate services specifically for street vendor small businesses. This would give street vendors access to many of the same tools afforded to other small businesses.\nStreet vending in New York has always been a critical component of in the city’s economy. Nearly 20,000 individuals are employed as street vendors to date. The industry has played an important role in the city’s growth, supporting immigrants, people of color, and military veterans to successfully operate the city’s smallest businesses, while creating entrepreneurs along the way.\nThe current ways in the city approaches and addresses street vendors often leaves many individuals harassed, unfairly arrested, and without adequate resources or clear regulations. Additionally, thousands of vendors have been waitlisted for food vendor permits, with some of them waiting for decades. While some legislative progress has been made in recent years, much more work remains to ensure the industry is supported and treated equitably.\nThis legislative package will reform the city’s current street vending systems, allowing vendors to build wealth within their neighborhoods by further regulating their small businesses, while still allowing them to provide New Yorkers with services they request on a daily basis. Additional bills within the package introduced Wednesday include business licensing and regulatory compliance of all mobile food and merchandise, reducing the criminal liability on food and merchandise vending, and siting rules and regulations for licensed and permitted vendors.\nWOODSIDE BIZ WALK-THRU: On Tuesday, December 5th, New York City Council Member Julie Won hosted a small business walk-through with New York City Department of Small Business Services (SBS) Commissioner Kevin D. Kim. The walk-through also included door-to-door outreach to local businesses by SBS staff.\nThe businesses visited included:\n- La Adelita de Woodside at 53-21 Roosevelt Ave, Woodside, NY 11377\n- Action OSH Cooperative at 58-14 Roosevelt Ave, Woodside, NY 11377\n- Rico Pan Bakery at 58-13 Woodside Ave, Woodside, NY 11377\n- Thamel NYC at 63-14 Roosevelt Ave, Woodside, NY 11377\n- Kalye Bistro at 39-06 64th St, Woodside, NY 11377\n- SriPraPhai at 64-13 39th Ave, Woodside, NY 11377\n“Our immigrant-owned restaurants, bakeries, bars, and worker-owned cooperatives in Woodside are the lifeblood of our city’s economy. Many of these small businesses serve as community centers, meeting places, and social hubs for our communities. Working with the Department of Small Business Services, I will continue to ensure these businesses are supported and our city is a partner not a barrier to their success. Thank you to Commissioner Kevin D. Kim for focusing on Woodside and businesses across District 26,” said NYC Council Member Julie Won.\n“It was an absolute pleasure touring small businesses in Woodside yesterday,” said NYC Department of Small Business Services Commissioner Kevin D. Kim. “Many of these immigrant-owned businesses reminded me of my own immigrant parents’ journey to living their American Dream. These small businesses are more than just the economic engines of their neighborhoods – they are the heart and soul of our neighborhoods. Thank you Council Member Julie Won for working with SBS to support these small businesses!”\nTREE LIGHTING AT VETERANS GROVE: Assembly Member Catalina Cruz joined Council Member Shekar Krishnan, Assembly Member Steven Raga, Queens Community Board 4, the Queens Economic Development Corp (QEDC), and the Elmhurst History and Cemeteries Preservation Society for a tree lighting ceremony at Veterans Grove. “The amazing students from PS 89Q School of Dreamers and St. Bartholomew’s Academy performed for all of our neighbors. We also had face painting, balloons, and delicious hot chocolate!”\nIn other news, Team Catalina was “happy to welcome several of our street vendors from the Corona Plaza Street Vendors Association (AVA) back to Corona Plaza! This welcome back is a step in the right direction to ensure a Corona Plaza that brings our community together and allows long-time vendors to return to work and support their families. The vendors will be working alongside the Queens Economic Development Corp (QEDC) and its market managers to bring out the best of Corona Plaza.”\nLast Saturday, December 9th, Cruz co-hosted a Rego Park Housing Resource Fair with Assemblyman Andrew Hevesi, Senator Joseph Addabbo, State Comptroller Tom DiNapoli, Con Edison, NHS of Queens, the NYC Department of Environmental Protection, and the NYC Department of Finance. Her constituents got to meet representatives from local elected offices, nonprofits, city and state agencies, and more for help with your utilities, property taxes, and so much more! The fair was located at the auditorium of PS 139 in Rego Park”\nRALLY AGAINST ANTISEMITISM: Council Member Vickie Paladino attended a Peaceful Rally Against Antisemitism recently. “My colleagues and I stood in solidarity with our Jewish friends, family, and fellow New Yorkers. The influx of antisemitic words and actions across this city is disgusting and it has only grown as elected officials continue to accept this behavior. It is long past time for every elected official to condemn this behavior and speech outright. There is no room for interpretation after the incident at Hillcrest High School. We must come together to reject these beliefs and protect all Jewish New Yorkers.\nPaladino also joined the Whitestone Merchants’ Association Tree Lighting: “Even the rain couldn’t dampen the Christmas spirit in Whitestone! We had a beautiful tree lighting hosted by the Whitestone Merchants Association complete with performances by the Landrum School of Dance. These girls put on a spectacular show every year and I was awed by their talent once again. Thank you to the Whitestone Merchants Association, Queens Chamber of Commerce, We Love Whitestone, and all those who contributed to this event. It warms my heart to have such a spirited community brightening the lives of their neighbors in our district. I’m honored to support the lights through my office and celebrate with you each year.”\n—With contributions by Annette Hanze Alberts\nThis column was originated by John A. Toscano.",
  "word_count": 11869,
  "scraped_at": "2026-02-14T13:27:43.597709"
}