{
  "article_id": "9a9de45daeac",
  "url": "https://www.rcreader.com/news-releases/pipe-dream-come-true-aledos-elijah-kelly-24-direct-monmouth-colleges-athletic-bands",
  "title": "A Pipe Dream Come True : Aledo Elijah Kelly ( 24 ) to Direct Monmouth College Athletic Bands",
  "date": "20240515T003000Z",
  "domain": "rcreader.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "MONMOUTH, ILLINOIS (May 14, 2024) — During his four years as a Monmouth College student, Elijah Kelly has been a member of just about every musical ensemble the school has to offer.\nStarting the day after his graduation from Monmouth on May 19, Kelly will be in charge of two of those groups — the Fighting Scots Marching Band and the Pep Band — in his new role as director of athletic bands.\"It was kind of a pipe dream for a little bit,\" said Kelly, who first learned that the position might become a reality late last fall. \"What person right out of college gets to direct their pep band and marching band?\"\nIt takes a special individual, and Kelly certainly is that. Last month, he was named the College's Senior Man of the Year by the Blue Key honor society. In addition to being a dedicated member of several Monmouth music groups — including Chorale, Wind Ensemble and Jazz Ensemble, to go with the two athletic bands — Kelly served as president of Sigma Phi Epsilon, helping the fraternity earn academic excellence awards.\n\"His involvement and knowledge of both the instrumental and choral programs will benefit all who participate in each of our vibrant programs,\" said Vice President for Student Affairs Karen Ogorzalek.\nExpanding band's numbers, energy\n\"Elijah Kelly is a friendly face to everyone on campus and gets along with anyone as he continues to strive for excellence,\" wrote his nominator for Senior Man of the Year.\nThat friendly face will come in handy as Kelly works to increase the size of both athletic bands. Recruiting, he said, will be a major part of his job responsibility. But hand-in-hand with his goal of having a bigger band is having an enthusiastic one, and that's where Kelly will place much of his focus.\"We want to get bigger, of course, but one of my goals is to have the band members visibly be so excited to be there, and also to have that atmosphere in the stands,\" said Kelly, an accomplished trombone player who's even jammed with the popular local music group Craig and Co. \"I know we're going to play good music, but I want that enthusiasm to grow, for the band to be excited to perform, and for the people watching to feel that excitement, too.\"\nTo help bring in new students to Monmouth who are interested in continuing their music careers, Kelly said he'll draw on his own high-school experience.\n\"When I was a student at Mercer County High School [in nearby Aledo], Monmouth's band director at the time, Stacy Dziuk, visited our school and had me audition,\" he said. \"That experience has made it important for me to meet students where they are.\"\nTo that end, Kelly has already represented the music department on off-campus recruiting trips, including one to Mercer County. He also recalled a one-hour drive he took with former marching band director John Eckstine to Havana High School. Kelly played with the students in the Ducks' band and talked with them about his experience at Monmouth.\n\"They've trusted me with a lot while I was here,\" said Kelly, who has also served as student director of the Pep Band, along with classmate Ty Otto. \"So I have a good understanding of what the College needs from my position.\"\n\"Alongside Ty Otto, Eli showcased outstanding leadership as they undertook the direction of the Pep Band during our men's and women's basketball games, contributing significantly to the energetic atmosphere of these events,\" said Ogorzalek. \"And if you attended football games last fall, you saw his talents in designing drills used during the halftime shows, which captivated audiences throughout the season.\"“Experience everything”\nThe sales pitch Kelly made in Aledo and Havana will not be too different from what he tells prospective students now that he's the director.\n\"Monmouth College is a place where people want you to be in everything you can,\" said Kelly, a music education major who was planning to teach high-school music until he was hired by his alma mater. \"And it's not just, 'Oh, we'd be happy to have you.' The College thrives on students who are really involved. So experience everything.\"\nIn addition, said Kelly, his pitch will call attention to the scholarship assistance available, even for band members who aren't planning to major in music.\n\"Monmouth is a really tight-knit community,\" he said. \"So I'll tell students to not only come here because of the music, but because of the people.\"\nThe three-year veteran of the College's band camp — it was canceled his freshman year due to COVID — will lead the camp when it meets in August, culminating with a preview show before the football game and parade season begins just a few days afterward.",
  "word_count": 797,
  "scraped_at": "2026-02-14T13:40:01.905908"
}