{
  "article_id": "9ac9494459fa",
  "url": "https://metro.co.uk/2024/11/27/full-list-10-biggest-uk-lottery-wins-177-000-000-euromillions-jackpot-22072787/",
  "title": "Full list of 10 biggest united kingdom lottery wins after £177 , 000 , 000 EuroMillions jackpot",
  "date": "20241127T141500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Someone won £209,300,000 in the EuroMillions on Friday after the jackpot rolled over seven times in a row.\nIf it had been won in the UK – not Austria, where a lucky individual bought a ticket for £10 – it would have smashed a national record held since 2022.\nThat year, the record was set and broken – and nearly broken again – in the space of just four months.\nJess and Joe Thwaites only wore the crown for two months that year before some secret someone usurped them.\nFortunately for the winner of a £195.7 million jackpot that July, they get to keep the ‘biggest ever UK lottery win’ title, at least for now.\nSign up for all of the latest stories\nStart your day informed with Metro's News Updates newsletter or get Breaking News alerts the moment it happens.\nBut as some lottery winners have found, the change brought by so much money isn’t always good.\nSo who are the reigning EuroMillions champions who’ve won the biggest ever UK lottery jackpots?\n11. Frances and Patrick Connolly – £114,969,775\nOriginally from Northern Ireland, Patrick and Frances Connolly were the fourth biggest winners when they it the jackpot on New Year’s Day, 2019.\nThey splashed their cash on a lot of things – Jaguar, Aston Martin and Alfa Romeo cars, and a County Durham Mansion with seven acres of land, and gifts worth £60million for their family and friends.\nA grant-giving charity – PFC Trust – they founded funds community groups in Hartlepool, where they moved for work in 1990.\nIt’s become such a backbone of the charity sector, scammers masqueraded as the Connolly couple to offer cash to 50 people if they hit 10,000 subscribers on a bogus YouTube channel.\nBut the very first thing they bought with their winnings was a pair of M&S underwear\n10. Anonymous – £121,328,187\nThe identity of the person who won this April 24, 2018 Superdraw jackpot has never been revealed after their chose to stay anonymous.\n9. Anonymous – £122,555,350\nThis jackpot started as just £14million before rolling over all the way to the all-time spot of the UK’s ninth biggest lottery prize on April 2, 2021.\nThe winner, however, has kept their identity a secret.\n8. Anonymous – £123,458,008\nAnother anonymous winner bagged this Superdraw jackpot on June 11, 2019, after it rolled over from a previous draw.\n7. Adrian and Gillian Bayford – £148,656,000\nThe life of a lottery winner isn’t all glitz and glam. Sometimes it’s a catastrophe – and Adrian and Gillian Bayford can attest to that.\nSince winning in August 2012, the married couple are no longer married.\nGillian now has a conviction for threatening her ex-boyfriend, domestic abuse charity worker Gavin Innes, who she pushed and shouted at in 2017.\nShe then married convicted fraudster Brian Deans, before ditching him because he begged for more and more money after blowing the monthly allowance she gave him on cars, watches and trips with friends.\nAdrian, meanwhile, turned to eating 50 Cornish pasties a day to cope with loneliness after being dumped by younger women, one of whom he dated while sending saucy messages to an ex.\nThe 53-year-old since partnered up with fiancée, 46-year-old Tracey Biles, 46.\nWith her inspiration, Andrian has planted a vineyard the size of six football pitches at his estate on the border of Cambridgeshire and Suffolk.\nHe had also planned to turn 20 acres of his Horseheath Lodge estate in to a children’s theme park with a train ride and maze.\nBut he scrapped those designs after concerns the development would be far too ‘urban’, bring too much traffic, and threaten archaeological remains.\n6. Colin and Chris Weir – £161,653,000\nWithin a decade of winning the EuroMillions draw, Colin and Chris Weir, from Largs in North Ayrshire, had divorced after 38 years of marriage.\nColin died of sepsis and an acute kidney injury a few months later in December 2019, at the age of 71.\nBy then he had spent half his £80million share of the fortune on cars, property and a controlling stake in his favourite football club, Partick Thistle.\nThe former TV cameraman also donated millions to the Scottish National Party and the pro-independence Yes campaign ahead of the 2014 referendum.\nHe left behind £212,000 worth of furniture, jewellery and artworks, a £10,000 Bentley Arnage, a Jaguar F-Pace SUV, a Mercedes Benz E Class Estate, a Mercedes Benz V Class people carrier, and a pot of petty cash containing £263.90.\nAfter the split, Chris, previously a psychiatric nurse, kept their Frognal House mansion, which they bought for £3.5million after a 10-minute viewing.\nShe sold the property in Troon, Ayrshire, for £2.3million in 2019.\nThey had also set up the Weir Charitable Trust, which funded projects across Scotland.\n5. Anonymous – £170,221,000\nThis EuroMillions jackpot had to go somewhere when it reached the stag of a Must Be Won draw.\nIt had already sat at the €190million cap for the maximum five draws by the time one UK ticketholder bagged it.\nThey chose to stay anonymous.\n4. Anonymous – £171,815,297\nAn anonymous ticketholder claimed their EuroMillions jackpot within 48 hours of the numbers being drawn on September 23, 2022.\nIt was the third big win in the UK that year.\n3. Anonymous – £177,033,699\nThe fourth EuroMillions jackpot winner of 2024 pipped the third spot on the all-time list in November, when they wont more than £177million.\nPrevious winner’s last year only secured £24million, £33million and £61million each – no small prize, but not enough to get into this EuroMillions Hall of Fame.\n2. Joe and Jess Thwaite – £184,262,899\nA new wardrobe and drawers for their bedroom were the first buys for Gloucestershire couple Joe and Jess Thwaite.\nThey had bought a EuroMillions Lucky Dip ticket on The National Lottery app, ‘because it’s easier’, on the very day of the May 10, 2022, draw.\nA communications sales engineer, and the business manager of a hairdressing salon, they were the first of three big winners that year.\nJoe saw they’d won when he woke early the next morning. He said: ‘I saw how much and I didn’t know what to do.\n‘I couldn’t go back to sleep, I didn’t want to wake Jess up so I just laid there for what seemed like forever.\nMore Trending\n‘I spent some time searching for property with no budget limit, which was a novelty!’\nWhen the alarm finally rang, Joe turned to Jess and said: ‘I’ve got a secret, I’ve got something to tell you.’\n1. Anonymous – £195,707,000\nJust two months after Joe and Jess Thwaite set the record for all-time biggest jackpot, their crown was taken by a winner who chose to keep their identity private.\nGet in touch with our news team by emailing us at webnews@metro.co.uk.\nFor more stories like this, check our news page.\nMORE: Full list of countries with most EuroMillions winners after £209,000,000 jackpot scooped\nMORE: Euromillions jackpot tonight is biggest ever at £202,000,000\nMORE: What actually happens when you win the EuroMillions lottery?",
  "word_count": 1177,
  "scraped_at": "2026-02-14T13:31:22.375122"
}