{
  "article_id": "9adf44f47a70",
  "url": "https://londonlovesbusiness.com/licensing-changes-needed-after-punters-waited-until-lionesses-second-half-before-being-served/",
  "title": "Licensing changes needed after punters waited until Lionesses second half before being served",
  "date": "20230822T170000Z",
  "domain": "londonlovesbusiness.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The pub industry has called on the government to make changed to licensing legislation for “national moments” after the Women’s World Cup final on Sunday.\nOn Sunday millions of football fans flocked to their local pubs to watch the match between England and Spain with many being forced to wait until the second half before they were legally allowed to have an alcoholic drink.\nThe British Beer and Pub Association (BBPA) said that early indications show that trading on Sunday was up between 14% and 28%.\nThe BBPA said that “while it may not seem to be the most pressing of matters, the importance of greater legal flexibility that allows communities to come together in the nation’s pubs to celebrate key social and sporting events is vital for their long-term commercial sustainability.”\nBBPA chief executive Emma McClarkin said, “Despite the Lionesses not being able to claim victory on Sunday, they won the hearts of the nation and inspired the millions of people who cheered them on at the pub and elsewhere through their heroic performance in this tournament.\n“It’s great that this success was able to give a boost to our pubs after a year where they’ve faced a range of challenges from unsustainably high energy bills to double-digit duty increases.\n“Despite the Government’s valuable work encouraging local authorities to support pubs on Sunday, we now need the law to reflect the reality that strict, prescriptive licensing cannot easily flex when key events are taking place while Parliament is not sitting.\n“The Licensing Act is an important piece of legislation, but it was never intended to be so inflexible as to stand in the way of communities coming together and enjoy a beer and celebrate one-off events of national interest.\n“MPs know the pubs are the focal points of their local communities so let’s work together to get an amendment quickly agreed.”",
  "word_count": 312,
  "scraped_at": "2026-02-14T13:04:21.974354"
}