{
  "article_id": "9ae99099dbc1",
  "url": "https://www.90min.com/posts/lyon-vs-chelsea-uwcl-preview-tv-channel-live-stream-team-news-prediction-22-3-23",
  "title": "Lyon vs Chelsea - UWCL preview : TV channel , live stream , team news & prediction",
  "date": "20230321T154500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lyon vs Chelsea - UWCL preview: TV channel, live stream, team news & prediction\nThis week's Champions League clash between Lyon and Chelsea sees two of the biggest clubs in Europe go head to head in their quarter-final first leg.\nLyon are reigning champions, having wrestled the title back from Barcelona in last season's final. But they haven't had things all their own way in Europe this season and were notably thrashed 5-1 by Arsenal in France on matchday two of the group stage and failed to beat Juventus home or away.\nDomestically, they lead the way in France, but aren't running away with the league like they have in the past and averaged nearly one whole goal fewer per game than last season. A significant part of that has been down to injuries to numerous key players, although that situation has improved.\nChelsea are facing a considerable four-way challenge in the WSL but went top of the table earlier this month with a victory over Manchester United and are now in the driving seat.\nThe Blues lost the Conti Cup final against Arsenal recently, but are doing well in the FA Cup and are on course for another domestic double. In Europe, meanwhile, they topped a potentially tough group ahead of PSG, beating the French side home and away, only dropping two points overall.\nWhere to watch Lyon vs Chelsea on TV/live stream\n- When is kick off? Wednesday 22 March, 17:45 (GMT)\n- Where is the match being played? Groupama Stadium\n- TV channel/live stream? DAZN UEFA Women's Champions League YouTube\n- Referee? Tess Olofsson (SWE)\nLyon team news\n2018 Ballon d'Or winner Ada Hegerberg hasn't played a lot of football over the last few years because of injury but was back in training earlier this month. She will be part of the squad on Wednesday night, having not played since August, as will Melvine Malard.\nEllie Carpenter has been building her minutes since returning from an ACL injury last month and could start, but Catarina Macario remains sidelined for that same reason.\nChelsea team news\nThere is still no Fran Kirby or Pernille Harder for Chelsea, but Erin Cuthbert, Jelena Cankovic and Eve Perisset all trained on Tuesday morning.\nEmma Hayes rested Sam Kerr, Lauren James and Kadeisha Buchanan against Reading at the weekend and is likley to bring all three back into the team here, the latter agaist her former club.\nLyon vs Chelsea score prediction\nEven with last season's eighth European title under their belt, Lyon haven't been the force they once were at the continental. In addition to their own troubles, the rest of Europe has probably naturally caught up, which has served to make things a lot more interesting.\nChelsea have shown in the wake of what Emma Hayes described as a 'complacent' performance against Arsenal in the Conti Cup final that they can dig in and grind results out. Given how they twice got the job done against a PSG side only marginally behind Lyon in France, this could be their night.\nPrediction: Lyon 1-2 Chelsea",
  "word_count": 514,
  "scraped_at": "2026-02-14T12:21:18.614982"
}