{
  "article_id": "9afe7ed706bd",
  "url": "https://www.theirishworld.com/the-tara-gaa-star-shooting-for-fa-cup-glory/",
  "title": "The Tara GAA star shooting for FA Cup glory",
  "date": "20241108T010000Z",
  "domain": "theirishworld.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Damian Dolan\nGemma Taylor is facing a busy weekend – very busy. On Saturday, she’ll be in Greenford looking to help Tara make it back-to-back junior championship final appearances, and then 24 hours later she’ll be in FA Cup action for Fulham FC Women.\nJunior finalists last year, Tara’s semi-final opponents are Parnell’s, a side who beat all comers to top the group.\nOn Sunday, Taylor’s Fulham are at home to Eastbourne United in the Women’s FA Cup Second Round Qualifying. Hectic stuff.\nBut if results go the way she hopes, it will be worth it for Taylor, who won a junior All Ireland title with London in 2008 at Croke Park.\nTara forced their way into Saturday’s semi-final mix following a thrilling final round of group stage matches.\nStarting the day outside of the top four, Tara did their part by defeating Fr Murphy’s handsomely.\nBut they still needed a favour from Dulwich Harps against St Anthony’s, if they were to gate-crash the semi-final party.\nDulwich duly delivered, winning by 4-8 to 3-5, to send Tara through to the last four by virtue of their ‘head-to-head’ victory (3-6 to 0-7) over the Reading outfit during the group stage.\nTara’s semi-final meeting with Parnell’s promises to be close. There was little to choose between them in their Round 3 tie, which Parnell’s edged by 2-8 to 0-10.\nVictory for Tara will move them one step closer to making amends for last year’s defeat to Thomas McCurtains – the East Londoners winning a superb junior final by 3-9 to 3-8.\nA contender for the best game in London circles last year, that was little consolation for Tara who remain without a county title since 2005.\nThe other junior championship semi-final pits Holloway Gaels against 2021 junior league winners Dulwich.\n“It would be great [to win a county medal],” says Taylor.\n“We’ve had some really good additions to our squad over the last two or three years, and now we just really want to get something out of it to show for the hard work and dedication that everyone’s put in.\n“And for Marie Scanlon, going from a player to the manger’s role, it would be really good to do it for her.”\nTaylor is something of an anomaly; the proud owner of an All Ireland medal, she’s still yet to get her hands on a county medal with Tara.\nIn 2008 she was just 19 when she was part of Johnny Wilson’s junior winning London team which beat Derry in the final at Croke Park by 5-5 to 1-11.\nNothing exceptional about that in isolation, except that she’d only taken up playing Gaelic football that year.\n“What a year it was,” says Taylor, who puts her ability to pick up Gaelic so quickly down to her soccer skills.\nIt was Wilson who’d suggested she join Tara the previous year, having been at Croke Park to see London lose out to Kilkenny in the 2007 decider.\nA substitute against Derry, Taylor got some game time off the bench towards the end. It might have been more but for ligament damage she sustained two weeks before the final.\n“I was devastated; I didn’t think I’d get on the pitch, but managed to play the last 10-15 minutes, which was an experience,” said Taylor, whose mother’s family come from Waterford.\n“But to have only started playing [Gaelic football] it was a massive achievement.\n“Who knows if I’d have got more than 10-15 minutes, if I hadn’t tore my ligaments. I don’t know.”\nAspirations\nSoccer, or football, had always been Taylor’s first love. She “grew up” playing the game from the age of four or five for a local club.\nBetween the ages of 12-16 she attended Watford FC’s Centre of Excellence, but with no clear pathway available to her when she turned 16 – Watford had no women’s team officially affiliated to the club at the time – she slipped back to playing her football at grassroots level.\nIt was then she got involved with Gaelic, Tara and London.\nFollowing the high of 2008, Taylor took some time out from both football and Gaelic, and went travelling for two years, before picking up both sports again.\nShe was at Headstone Manor FC before signing for Fulham in January 2018.\nThe team competes in London and South East Regional Women’s Premier League – the fifth tier of the women’s game in England.\nTaylor’s arrival at the club coincided with the women’s side relocating to Fulham FC’s multi-million-pound training ground at Motspur Park.\nThe complex includes a full-size FIFA approved astro turf pitch, which the women have use of for training and home fixtures.\nIt’s all part of the women’s team being incorporated back into Fulham FC, after a couple of years under the wing of the Fulham FC Foundation.\nWith that has come a number of experiences to support the growth of the team – Wildcats (5-11 years), Girls Development Centre (8-16 years) and Premier League Girls programme (11-16 years).\nThe benefits aren’t just long term, though. Taylor and her teammates now have access to a wide array of resources and support, which she hopes will propel them to success.\n“It’s great; it’s been really beneficial for us,” said Taylor, who is a Youth Engagement Officer for the Foundation mentoring young people who are involved in, or could become involved in, youth crime and violence.\n“We’ve now got a sports scientist, physio, an individual development coach, a goalkeeping coach, head coach, analyst. The aim is to get back up to WSL (Women’s Super League).”\nWhether Taylor’s part of that drive remains to be seen. Time waits for no one.\n“I feel like I’m coming to the end of [playing] football and Gaelic. It’s a lot on the body, but hopefully [I’ll keep playing] for a little while longer,” she said.\nAn attacking midfielder or forward for Tara, Taylor plays a similar position for Fulham, but that’s where the similarities end.\n“I’m not afraid to run at people one-on-one in Gaelic, but my game in football is very different. I like to be the playmaker. I like passing the ball around,” she said.\nLast Sunday’s 5-0 win over Whyteleafe at Motspur Park lifts Fulham up to fourth in the London and South East Regional Women’s Premier League table.\nIt still leaves them 11 points adrift of Ashford Town (Middlesex) who lead the way with six wins from six. Fulham do have two games in hand, however.\n“Mid-table probably doesn’t represent us as well as we would like,” says Taylor.\n“It’s a really difficult league to get out of – only one team goes up – and it’s the best league in our tier. It’s very competitive.\n“We’ve not made as good a start as we would like, but it’s about working hard.\n“We’ve signed some really good players and we’re hoping to be knocking on the door this year. All of the girls would love to get promoted.”\nLeague matters will take a back-seat on Sunday, though, as Fulham go in search of some FA Cup glory, having gone out in the Third Round qualifying for the past two seasons.\nFulham went down 2-1 to Maidenhead United in 2020/21 – Taylor with her side’s goal – and by 3-1 to Actonians in 2019/20.\nVictory over Eastbourne on Sunday would move Taylor and Fulham one step closer to the possibility of drawing one of the women’s games big guns.\nStarting with Eastbourne, they’ll have to negotiate their way through five rounds to make that dream a reality, but the dream is definitely there.\n“We would love to get a game against one of the big teams,” says Taylor.\n“We want to progress further than we have and make it through. It would be unbelievable to play against the likes of Chelsea or Arsenal.”\nIt promises to be a very big weekend indeed.\nYou might also be interested in this article\nhttp://35.176.73.46/new-ground-will-put-warks-gaa-on-a-different-level/",
  "word_count": 1325,
  "scraped_at": "2026-02-14T12:23:03.775693"
}