{
  "article_id": "9b60ff095def",
  "url": "https://fasterskier.com/2026/02/gold-at-the-end-of-linn-svahns-long-path/",
  "title": "Gold at the End of Linn Svahn Long Path – FasterSkier",
  "date": "20260210T200000Z",
  "domain": "fasterskier.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This article was made possible through the generous support of our voluntary subscribers who have helped put our Nat Herz on the ground at the Olympics. If you value coverage like this, please support FasterSkier with a voluntary subscription.\nPREDAZZO, ITALY — Checking today’s ESPN home page makes it clear that the Olympics don’t seem to occupy the American imagination like they once did. I remember the Olympics as being a bigger deal—a set of events that captured the imagination of the world, an international spectacle that occupied the media spotlight. Life magazine, Time magazine, Sports Illustrated: all devoted their covers and countless pages to Olympic events when they were upcoming, to the results when they became available, to the impact that these performances had on the viewing public. There was something bigger about it, something that seemed to separate it from mere sport, something that seemed to elevate it above mere commercialism. These weren’t just athletes; these were Olympians.\nThey still are . . . Over in Italy, the Olympians are parading in ceremonies and competing in events and collecting medals while national anthems resonate in the crisp mountain air … but ESPN covers only the sports that matter to most Americans: NFL Football and NBA basketball and NHL hockey and MLB baseball and PGA golf, followed by men’s college basketball and women’s college basketball and college softball and MLS soccer and WCW Wrestling and the lingering stories surrounding Super Bowl commercials and Super Bowl halftime shows. And waaaaay beneath all that, we find a mention of the American gold medal in Team Figure Skating and the final helicopter flight of Lindsey Vonn’s legendary career. Thus far in Milano-Cortina, Olympic performances haven’t proven sufficient to capture the attention of a jaded viewing public. The only story American’s are likely to follow in cross-country skiing is that of reigning World Cup Champion, Jessie Diggins. Even with that accolade in hand—even being a defending medalist in the Olympic Sprint—Diggins does not find herself appearing often in the daily conversation that dominates column inches over at ESPN.\nAnd it really is too bad that ESPN may overlook another tremendous story that unfolded in the Women’s Classic Sprint, as the long-suffering Linn Svahn—whose history of injury and ill-fortune has repeatedly interrupted what could’ve been a legendary career—finally grabbed the medal that has always appeared to be within her reach. Svahn led a Swedish sweep of the podium ahead of Olympic and World Champion, Jonna Sundling and the ever-crafty veteran, Maia Dahlqvist. Svahn delivered a performance that cements her place in the history of cross-country skiing. After a long, long wait, Linn Svahn is Olympic champion.\nThough it appeared that Americans were still struggling with waxing issues in the soft snow of Val di Fiemme, Team USA saw four skiers advance through qualifying: Jessie Diggins (20th), Sammy Smith (26th), Julia Kern (28th), and Lauren Jortberg (30th). Those qualifying placings did not inspire a tremendous amount of confidence in what was likely to be a lightning-fast day of sprinting. Ultimately, it was Kern who would ski with power and grace in advancing to the Olympic Sprint final where she would finish sixth. Diggins may still be suffering the effects of her crash in Saturday’s Olympic Skiathlon; Diggins skied bravely, but could be seen clutching her injured ribs after placing fourth in her quarterfinal. She would finish the day in 17th.\n“My qualifier didn’t go as well as planned,” said Kern. “But it was enough to qualify, and I always get stronger in the rounds. And I had really good skis and played to my strategy and knew I had a strong finish and really never gave up and was hanging really tough when I was pretty tired. And so I went the lucky loser route today, which was my strategy. And that obviously has a cost. So come the final, I was completely spent, but I didn’t know it, and I really gave it my all, tried to be in the mix, and I had left everything on the course to get to the final. And I don’t have any regrets about that. I think that’s what I needed to do to get there. And that’s where I’m skiing right now.”\n“Obviously it was 30th, but I think it still wasn’t really, like, my best qualifier,” said Jortberg. “I think there’s still a lot of room to move there, which is cool. And I think had it not been in such a stacked heat, I think it would have maybe been a slightly different quarterfinal for me, but we’re still really proud of how I skied. I think I made a couple tactical errors out there.”\nUltimately, the final American placings were Kern 6th, Diggins 17th, Smith 19th, Jortberg 30th.\n“Really exciting to have my Olympic debut,” said Smith. “And I wish I would have done a few things differently in that heat. Like what? I mean, I think I tried to make a move on the left side on the hill. I could have potentially been able to make more time over the top, but it’s pretty incredible opportunity and just excited to be out here and racing.”\nSmith explained the challenge and the complexity of competing in the Olympics while simultaneously enrolled at Stanford: “I’m taking material science and engineering. I’m taking environmental law class. I’m taking a creative nonfiction class, doing an independent study as well with a psychology professor,” said Smith. “And then I’m also taking physics. Stanford probably has more Olympians per capita than most places. It’s actually pretty cool. We have four winter Olympians from Sanford this year. So Eileen Gu is competing for China in big air and slope style, Zoe Atkin in half pipe and big air, and then Brandon Kim in speed skating. So it’s pretty cool that there’s four of us. The school’s been incredibly supportive, and I’m excited for all of us to compete.”\nSprint Quarterfinals\nJortberg and Smith lined up together in a quarterfinal that was packed with stars and contenders including Sundling, Kristine Stavass Skistad (NOR), and 2025 World Cup Sprint champion, Jasmi Joensuu (FIN). Sundling went to the front, setting the pace ahead of Skistad, providing a possible preview of the tactics likely to define the Sprint final. Jortberg and Smith dropped to the back where they appeared incapable of overcoming the blistering pace set by Sundling. Over the top of the ultimate downhill, Sundling led Joenssu as Skistad appeared to struggle. But the finish line lies at the far end of a straight downhill, and Skistad’s fast skis and gliding ability were able to dismantle Joensuu. Skistad would follow Sundling across the line to claim automatic spots in the semifinal. Smith would finish fourth to sit in a lucky loser position after the first quarterfinal.\nQuarterfinal 2 included Kern, Nadine Faehndrich (SUI), and the day’s top qualifier, Svahn. Faehndrich and Svahn made the pace in the heat, though Faehndrich would fade from contention in the late stages. The suprising Italian, Caterina Ganz, would drive forward to claim the second spot to advance to the semifinal behind Svahn; Kern was able to hold her position in the pack moving forward into third place, a status that would allow her to claim a lucky loser spot in the semifinal.\nJohanna Matintalo (FIN) took the third quarterfinal ahead of Laura Gimmler (GER). Julie Bjervig Driveness (NOR) would move into the fastest lucky loser, spot pushing Kern down a spot, but allowing her to remain in contention with two heats remaining.\nDiggins started in the fourth quarterfinal alongside Maia Dahlqvist (SWE). They appeared to be the strongest in their heat, and Diggins sprinted directly to the front to set the pace. But the snow in Val di Fiemme was unusually slow, which did not favor the leaders, especially with the course profile that descended steadily to the finish line. Diggins paid the price for leading early, finding herself passed by the field, and unable to improve her position in the finishing straightaway. Diggins would end her day with a fourth place finish in the quarterfinal from which Dahlqvist and Federica Cassol (ITA) would advance.\n“I didn’t realize it right after it crashed, when I bruised my ribs,” said Diggins. “But then afterwards, you feel it; right now they really hurt. So I’m doing the best I can. I know I’m in good shape and I really want to make the team proud and I’m just trying the best I can . . . I needed to figure out how to manage this for Thursday. I hope that my body’s feeling better, but my energy is good and I’m excited to be here. I think I’M not a best shape in my life. I just need everything to come together in the right moment. But I know there’s possibility there. So I’m going to keep coming and bring my best.”\nSprint Semifinals\nKern found herself in a semifinal crowded by the résumés of Svahn, Sundling, and Skistad. Sundling and Svahn would claim hte automatic qualifying spots, while Kern would overcome a mid-race loss of speed to finish fourth (behind Skistad) to reside in a lucky loser spot (behind Skistad) with one semifinal remaining. Ultimately, the second semifinal involved fewer stars, and a field that seemed less likely to produce fast times and lucky losers. Driveness and Dahlqvist advanced out of the second semifinal, allowing lucky loser spaces for Skistad and Kern.\nOlympic Classic Sprint Final\nSix months ago, FasterSkier’s Editor-in-Chief made a bold and confident confident call, predicting that Julia Kern would qualify for the Olympic Sprint final. While that early prediction may have been a reflection of the proud Massuchessetts roots he shares with Kern, it also reflected his knowledge of World Cup and Olympic skiing, and his understanding of just what it takes to ski and compete at this level. The Editor knows his stuff, and Kern has proven herself entirely deserving. That Kern advanced to the Olympic Classic Sprint final came as no surprise to Fasterskier.\nBut Kern was not alone in the final. The cast of characters in this Sprint drama was one that left no room for pretenders or understudies. Kern lined up alongside Skistad, Sundling, Svahn, Dahlqvist, and Driveness. At the crack of the starter’s pistol, Team Sweden began to assert itself as Sundling drove straight to the front. This has been the tactic that has earned Sundling World and Olympic championships, and it came as no surprise to see her at the front. She was followed by Svahn as Skistad appeared overcome by the early pace. At the mid-race point, Dahlqvist eased her way past Skistad, and Team Sweden headed for the podium. At the finish, it was the power of Svahn that drove across the line ahead of Sundling and Dahlqvist. Linn Svahn’s long path had finally delivered her to the destination that fans had always imagined. After years of injury and disappointment, after seasons of patience and impatience, Linn Svahn finally wears the Olympic gold medal.\n“I am really happy with today,” said Kern. “It’s been a challenging season. I haven’t made it out of the quarterfinals this year. So to make it to the finals of the Olympics Is a huge accomplishment, and I’m really proud of it because I fought really hard today.\nThe typical ESPN viewer may find other events to be more compelling, but the thrill of competing in an Olympic Games is not lost on the athletes: “I’ve never raced with the rings on my bib,” said Jortberg. “There’s a lot going on, which is super cool, and I feel like I just feed off that.”\nWomen’s Olympic Classic Sprint RESULTS\nWomen’s Olympic Classic Sprint QUALIFYING\nOn the ground reporting by FasterSkier’s Nat Herz.\nHelp Support Our Olympic Coverage!\nFasterSkier has our own Nat Herz on the ground at the Olympics, which is a significant financial lift for us. If you value the thoughtful work and access FasterSkier provides at championships like this one, please consider becoming a Voluntary Subscriber. Your support directly fuels our work to cover the people, places, and moments that make our sport special.\nJoin the FasterSkier community!\nJohn Teaford\nJohn Teaford has been the coach of Olympians, World Champions, and World Record Holders in six sports: Nordic skiing, speedskating, road cycling, track cycling, mountain biking, triathlon. In his long career as a writer/filmmaker, he spent many seasons as Director of Warren Miller’s annual feature film, and Producer of adventure documentary films for Discovery, ESPN, Disney, National Geographic, and NBC Sports.",
  "word_count": 2094,
  "scraped_at": "2026-02-14T12:38:07.466421"
}