{
  "article_id": "9ba23d69b55b",
  "url": "https://www.westernadvocate.com.au/story/8811209/40-under-40-meet-the-central-wests-inspiring-changemakers/?cs=146",
  "title": "40 under 40 : Meet the Central West inspiring changemakers | Western Advocate",
  "date": "20241124T220000Z",
  "domain": "westernadvocate.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Our region is filled with amazing and awe-inspiring people, from those who fundraise for important causes to those who are paving the way for the next generation.\nSubscribe now for unlimited access.\nor signup to continue reading\nThese are the people who deserve recognition for the work they're doing every day.\nWe've narrowed it down to 40 people under 40 who are making a real difference in their communities.\nKeep your eyes peeled in the coming days for a closer look at some of these amazing people.\nJosh Toole\nFounder and chief executive officer of BlackFit Fitness\nJosh Toole started BlackFit Fitness in 2015 as a way to tackle stereotypes and close the health gap.\nThrough BlackFit, Mr Toole has developed holistic programs that promote positive attitudes about self-identity through healthy lifestyles and positive wellbeing.\nMr Toole said fitness and physical activity helped him through some \"dark times\".\n\"I also hold tight to a healthy lifestyle as I have witnessed how devastating life can be when we walk away from it - especially in my family and communities growing up,\" he said.\nBlackFit's approach is to link the programs back to Aboriginal traditions like bush tucker.\nMr Toole is also heavily involved in rugby league and founded the Bourke Nines competition as a way to boost the far west community.\nMolly Croft\nOsteosarcoma survivor, president and co-founder of The Tie Dye Project\nMolly Croft was diagnosed with osteosarcoma when she was 12-years-old. Despite everything she was going through, the Croft family decided to \"look for a rainbow in each day\", focusing on the positives rather than the negatives.\nAfter spending 292 nights at Ronald McDonald House, Ms Croft decided to pay it forward and launched a campaign to raise $46,000 - the cost of those 292 nights. She quickly surpassed her fundraising target and raised a total of $185,000.\nIn 2017 Ms Croft and netballer Amy Parmenter started The Tie Dye Project. They've since raised more than $1 million for sarcoma research projects.\nJessica Redfern\nOwner of Petal + Palm, director at National Disability Care, and established Women of Wellington\nAs well as being the face behind Petal + Palm in Wellington, Jessica Redfern is also the boss at National Disability Care, which provides NDIS respite and in-home support.\nIn 2023 Ms Redfern established Women of Wellington. The Instagram page was initially to highlight the wonderful women in the community but has since grown to include free monthly talks on topics from tax to confidence.\nMs Redfern, who is also an author, is passionate about promoting women because she believes their work, both paid and unpaid, is often \"extremely undervalued\".\nShe said she wanted little girls to know women supporting women was the only way forward.\nCountry music singer\nRobbie Mortimer may be surrounded by NRL players in his family, but for him, music was where his heart was.\nFor 15 years he's been writing songs and now Robbie Mortimer is becoming a household name.\nMr Mortimer was a grand finalist in the Tamworth Star Maker country music competition in 2023.\nIt's the competition that launched names like Lee Kernaghan and Keith Urban.\nIn July, Mr Mortimer released You Got That Love. It came after his debut single Blow the Speakers, which racked up over 500,000 streams, landed on Spotify's 'New Music Friday AU and NZ' and various Apple Music editorial playlists.\nElla Havelka\nDancer, choreographer and founder of The ELLA Foundation\nIn 2013 Ella Havelka became the first Aboriginal dancer to join the Australian Ballet - the first in more than five decades.\nThe Wiradjuri woman has been open about the hardships she faced in financially paying for ballet classes and getting an education. She's also spoken about the need for more diversity in ballet.\nIn 2022 Ms Havelka established charity The ELLA Foundation. It provides First Nations youths with scholarships to schools across Australia and mentoring.\nBen Stevens\nOwner of Professionals Real Estate Bathurst and director of Professionals Group Australia\nBen Stevens has a relentless hunger for continuous improvement.\nIt's one of the reasons Professionals Real Estate in Bathurst was the top office within the company in both 2022 and 2023.\nMr Stevens has also been named as NSW's top principal multiple years in a row.\nBut as well as achieving great things at a local level, the real estate agent is also the chair of Professionals Group Australia.\nHe's one of the youngest board members in the group's history.\nOutside of work, Mr Stevens also volunteers across a number of groups.\nMarty Jeffrey\nDirector of the Talbragar Wiradjuri Aboriginal Corporation and former Dubbo Youth Council volunteer\nTubba-Gah Wiradjuri man Marty Jeffrey describes himself as someone with a \"strong passion to embed Aboriginal voices\". As well as his work with the Department of Regional NSW as an assistant project officer with the Aboriginal outcomes team, Mr Jeffrey also volunteers with the Talbragar Wiradjuri Aboriginal Corporation and was previously on the Dubbo Youth Council.\nThe Talbragar Wiradjuri Aboriginal Corporation aims to promote Indigenous culture and see the community thrive.\nMr Jeffrey said his family had always been involved in volunteering and he planned to \"give back to the community in different ways\" for as long as he was able to.\nMr Jeffrey is also heavily involved in cricket and captains the Western Zone representative side and Dubbo club side RSL Colts, with his Indigenous design on their playing shirt.\nIzabelle Kelly\nVolunteer and fundraiser\nDespite being only 12-years-old, Izabelle Kelly has made a big difference to communities in need.\nFollowing the bad bushfires of 2019 and 2020, Izabelle started sewing 150 joey pouches. When the lockdown hit in 2021, she handmade 250 cards for members of the elderly community.\nHer altruism continued in 2022 when she encouraged her school to donate stationery to Lismore South Public School, which had been hit with floods and the following year she cut off her hair for Wigs 4 Kids.\nIzabelle said she dedicates her time to volunteering because she strongly believes in helping those who are less fortunate.\nKeiley Noble\nDrought policy officer and founder of Western Rural Connect\nAfter being named as the 2023 NSW Rural Ambassador, Keiley Noble was inspired to start Western Rural Connect. The not-for-profit organisation aims to encourage and enhance social connections for people in western NSW.\nThrough Western Rural Connect, Ms Noble has hosted a range of functions from Rural Women's Day events to the Harvest Cut Out Ball.\nMs Noble said she wanted the group to feel like \"mates checking in on mates\" so when issues did arise people were more comfortable reaching out for help.\nJess Skinner\nHead coach of the Indigenous Women's All Stars, assistant coach for the Jillaroos and head coach of the NRL Gems Academy\nMs Skinner has been promoting women in rugby league for more than 15 years.\nShe was responsible for the introduction of league tag for women in western and far-western NSW, and then tackle footy.\nShe holds numerous impressive roles within rugby league and in March, Ms Skinner, who is Aboriginal and Maori, became the first female head coach of the Indigenous Women's All Stars team.\nMs Skinner wants to see more country men and women in elite fields, as well as more First Nations people.\n\"I am passionate about my culture and providing opportunities for young people in rural/remote communities to achieve their dreams and aspirations at the elite level,\" Ms Skinner said.\nTaneka Todhunter\nNRLW player\nTaneka Todhunter was wracked with homesickness when she first moved from Dubbo to Sydney to fulfill her professional rugby league dreams.\nBut it was her desire to show \"the kids back home\" that they could achieve their dreams and get away from alcohol, drugs and domestic violence that kept her going.\nIn 2021, Ms Todhunter signed with the Roosters. Then after missing out in the 2022 season, she was offered a development contract with the Eels in 2023.\n\"I want to start developing some actual pathways for kids to go from the country to Sydney,\" she told NRL.com earlier this year.\n\"The boys have houses and mentors but the girls don't have any of that stuff.\"\nDrag queen and LGBTQI advocate\nJonathan Hosking is better known by his drag persona Betty Confetti. He's a driving force behind the thriving drag scene across Bathurst, as well as establishing the city's first Mardi Gras parade.\nIn 2023 he created headlines worldwide after locals protested against having drag queen story time in Goulburn.\nBut despite death threats, Mr Hosking said he refused to stop celebrating diversity and being a champion for the LGTBQIA+ community in the Centra West.\nMr Hosing said he wanted to be the role model for others that he never had when he was growing up.\nJanalee Conroy\nNSW rugby development officer\nAs part of her role as a NSW Rugby Union development officer for the Central West, Ms Conroy has one real passion project. Her goal was to develop the first junior club in her home town, Brewarrina.\nShe achieved that and it added to her long list of club and representative accolades.\n\"One thing I love to tell the kids is there's role models all around the place and I hope that I'm a role model for these kids that I love to coach as well,\" she said.\nKieran O'Dwyer\nOwner and director of Bathurst Strength and Conditioning\nKieran O'Dwyer wants to change the way the country views health.\nIf he was Prime Minister, Mr O'Dwyer said he would \"limit fast food advertising, subsidise gym memberships and give every Australian household vouchers for fresh produce and lean meat\".\nAs the owner and director of Bathurst Strength and Conditioning, Mr O'Dwyer has trained a range of people from high-level athletes to regular joes.\nIn 2023, Mr O'Dwyer received the People's Choice Award - Health, Fitness and Wellbeing Employee at the Bathurst Business Chamber's annual awards.\nAmy Van de Ven\nQuest franchisee and founding member of Central West Inspired Women\nAmy Van de Ven describes her work as \"deeply rooted in fostering community connections and making a positive impact\".\nShe's the owner and operator of Quest Apartment Hotels in Orange and a board member of both Business Orange and Orange360.\nIn 2022, Ms Van de Ven was also one of the people behind the start of Central West Inspired Women. It regularly brings together local women to \"connect for success\". As well as providing an avenue for women to connect, they also have the opportunity to learn from guest speakers.\nThe Orange powerhouse also volunteers at Ronald McDonald House Central West and serves as the master of ceremonies for Stars of Dubbo Dance for Cancer.\nMarea Ruddy\nFounder and director at AccessLife Support Services and councillor\nMarea Ruddy is all about empowerment. Whether that's empowering individuals with a disability through her business AccessLife Support Services - which provides support to people on the NDIS - or encouraging people to stand up for violence against women.\nEarlier this year she helped organise an anti-violence against women March and another in July in Orange and in September she was elected as a councillor in her first term.\n\"As a woman and mother, I draw inspiration from the unwavering love and fierce determination to create a better future for the next generation,\" she said.\nMs Ruddy is also a birth photographer and loves celebrating the beauty and resilience of the human spirit.\nEmily Stanton\nPublican at The Nyngan\n\"When people think of Nyngan, we want people to think, 'gee, that place has got a good pub',\" Ms Stanton said.\nMs Stanton and her husband James have turned Nyngan's oldest hotel, which was built in 1883, into a boutique hotel and bar.\nThe building was purchased in 2022 and The Nyngan was opened in July 2024.\nMs Stanton's hope is that it will be the anchor that encourages people to visit the western NSW town.\nJustin Toomey-White\nFew people love their hometowns as much as Justin Toomey-White.\nHe's been captain-coach of the Wellington Cowboys first grade side for roughly a decade and was one of only two players to be named Group 11 Player of the Year five times.\nBut it's about much more than footy to Mr Toomey-White.\n\"It's not about me or the way I play. It's about every one of those boys who take the field for us getting better,\" he's said.\n\"If they're getting better on the field they're going to be better people off the field and that's the people we want at our club and the players leading our community.\"\nGrace Ridge\nPresident of the Bourke Show Committee and former councillor\nIn 2021 she was awarded the Future Women NSW Rural Scholarship.\nShe believes it's important that women are part of the decision-making process when it comes to issues affecting their community.\n\"If there aren't women at the table, how can the community be equally represented?\" she said.\nMs Ridge also served on Bourke Shire Council between 2021 and 2024.\nJamieson Leeson\nParalympian\nJamieson Leeson has been representing Australia since 2019 but her greatest achievement to date was at the Paralympics earlier this year when she won a silver medal in boccia.\nMs Leeson, who was diagnosed with spinal muscular atrophy type II when she was 18-months-old, has been competing for Australia since 2019 after being scouted at a school boccia tournament the year before.\nAs well as the medal from the Paralympics, Ms Leeson has also won a solver at the World Championships and a gold in both the female BC3 individual and pairs.\nThe champion athlete is also studying a Bachelor of Economics at the University of NSW and has aimed to show anyone can achieve their dreams.\nErrin Williamson\nBusiness owner and Dubbo Business Chamber president\nNot only does she own CSC, Down the Lane and Jimmy Barnet Espresso, Erinn Williamson is also the president of the Dubbo Business Chamber.\nMs WIlliamson took over the role in 2021.\nShe's passionate about promoting local businesses and creating a vibrant economy.\nHer goal is to always make sure she is moving forward, whether that be in her family, self or business.\nNedd Brockmann\nFundraising champion\nWhen Nedd Brockmann moved from Forbes to Sydney, he was overwhelmed at the amount of people he saw living on the street.\nHe had just started running and decided to use that to raise awareness and funds for homelessness.\nIn 2022 he ran across Australia, from Cotteslow Beach in Perth to Sydney's Bondi Beach, covering an average of 86 kilometres a day for 47 days.\nIn October Mr Brockmann made headlines again for running 1600km in 12 days. He was attempting to break the world record.\nIn the past two-and-a-half years his mission to \"get comfortable being uncomfortable\" has led to more than $7 million raised for homelessness charity Mobilise.\nTim Mortimer\nFounder of BNB Made Easy\nWhen Tim Mortimer left teaching to start his own business, he didn't expect a global pandemic.\nBut Mr Mortimer pulled through and in 2023 he was awarded Outstanding Business Leader and Excellence in Small Business at the Orange Business Awards.\nBNB Made Easy looks after the management of short-term rentals. It started in just Orange and has since expanded across the Central West.\nMr Mortimer and his wife Flora now employ 20 staff and more than 50 subcontractors.\nMr Mortimer said they were the point of call for more than 25,000 guests a year.\n\"Our homes are owned by local families, meaning that we get all of their booking revenue to them so that will circulate the local economy. Expanding is just more drive to keep our service doing good things in the region,\" he said.\nIsaah Yeo\nProfessional athlete\nHe's won four NRL premierships, is captain of the Australian side and is the most capped player for the Penrith Panthers.\nAnd Mr Yeo's footy career started with Dubbo CYMS.\nSpeaking after the NRL grand final win in 2021, Mr Yeo said he was \"representing everyone back home in Dubbo\" when he played.\nWhile he may not live in Dubbo anymore, Mr Yeo still has deep ties to the area. He frequently travels back to the region for coaching clinics and sends messages of support to local clubs.\nWorld champion Muay Thai fighter and mental health advocate\nIn May Charlie Bubb, also known as The Smiling Assassin, finally got the title he had spent 14 years working towards.\nHe won the Muay Thai League WBC Light Heavyweight world title.\nBut it isn't just his skills in the ring Mr Bubb has become known for. The Smiling Assassin is also a fierce advocate for suicide prevention and mental health awareness.\nHis motto is \"worth fighting for\".\n\"We want to get the message out there that it isn't weak to speak. Everyone is worth fighting for and anybody out there that is hurting, trust me, every one of your mates would rather spend 10 hours with you talking over your problems than have to hear someone talking at your funeral,\" Mr Bubb said.\nIn 2019 he was nominated for Inspirational Fighter of the Year at the Australian Mauy Thai Awards.\nJesscia Hickman\nAnti-bullying advocate\nAfter being relentlessly bullied in her workplace for 3.5 years, Jessica Hickman ended up in the emergency department.\nRather than let the experience break her, Ms Hickman used it to become a fierce anti-bullying advocate.\nShe's now known across the world as the Bullyologist, encouraging people to stop being bystanders and start being 'upstanders'.\n\"The standard you walk by is the standard you accept. So if you walk by bullying, that's what you accept for yourself and others,\" she said.\nMs Hickman has published two books, The Bullyologist: Breaking the Silence on Bullying and The Upstanding Leader: How to Develop a Speak-Up Culture.\nShe's also been a featured speaker for TEDxSwansea, and has delivered professional talks across Australia, USA, Canada, New Zealand and the UK.\nKnox Gibson\nNational-level swimmer and actor\nKnox Gibson never planned to get into acting.\nHe was modelling with the hope of getting sponsorship for his modelling career when he was noticed by a filmmaker and eventually landed a role in The Hunger Games: The Ballad of Songbirds and Snakes.\nActing hasn't dulled his love of swimming though.\nMr Gibson, who lost his hand in a lawnmower accident when he was almost four-years-old, finished 10th in the Paralympic trials earlier in the year. His goal is to compete at the Paralympics in either 2028 or 2032.\nMr Gibson wants to see more people with limb differences represented on the screen with the hope it leads to a more inclusive world.\nBrad Schumacher\nMotorsport driver\nBrad Schumacher made his GT World Challenge Australia debut in 2021 and marked it by winning the GT Trophy Class Championship.\nLast year Schumacher was crowned the Am Class champion and in June he took on the world's premier GT race, the 24 Hours of Spa.\nIn 2018 he crashed into a wall at Mount Panorama while going 240 kilometres per hour during a club event.\nMr Schumacher considered himself lucky to be alive after the crash. He walked away with a torn tendon in his knee and a tear in his liver.\nHe was determined to keep driving.\nWhen he's not racing, Mr Schumacher owns the largest electrical company in Bathurst - Kelso Electrical.\nSarah Smith\nArtist\nWhen Sarah Smith's croissant painting didn't sell she never expected it would end up at the Louvre.\nMs Smith studied to be a pharmacist but when the pandemic hit, she used the extra time in lockdown to paint.\nWhat started off as a hobby painting everyday objects has continued to grow.\nMs Smith's watercolours have featured in Vanity Fair, Vogue and galleries both across Australia and internationally.\nWhen a gallery in Vienna reached out to her to feature the croissant painting in a summer exhibition across Europe, including the Louvre in Paris, Ms Smith couldn't believe it.\n\"It's so surreal to have in my portfolio and to say it happened,\" she said.\nNicholas Hibberson\nManager of Hibbo Hire - Earthworks Solutions\nHibbo Hire Earthwork Solutions was established in Bathurst in 1988.\nSince then, Mr Hibberson's business has grown to cover Bathurst, Orange and Forbes with major projects undertaken across the Central West.\nMr Hibberson has developed the company into a significant force with a reputation for reliability, adaptability and establishing strong client relationships.\nAinsley Melham\nPerformer\nIn 2019, Ainsley Melham achieved something many actors and singers only dream of - he made his debut on Broadway.\nMr Melham started his musical theatre career in 2016. He went from there to the title role in Aladdin when it toured Australia, before reprising the role for Broadway.\nIn 2020, Mr Melham and Callum Francis started the charity We The Industry.\nThe goal of the organisation is to create greater representation and inclusion within the Australian theatre industry across race, sexuality, disability and location.\nMr Melham said whenever he performed, he was always thinking of his parents and his sister.\n\"While it's fair to say that you perform for the enjoyment of it, you also do it to make those around you proud,\" he said.\nEllie Carpenter\nProfessional footballer\nEllie Carpenter has a long list of achievements to her name.\nShe's a four-time Olympian, Matildas star and champion right back for French powerhouse Lyon.\nThe professional footballer debuted for the Australian national team at 15-years-old. She was the youngest Australian competitor at the 2016 Olympics in Rio and is the youngest female footballer to ever compete in the Olympics.\nAt 18-years-old she was also the youngest player in the United States' National Women's Soccer League.\nMs Carpenter was awarded the W-League Young Footballer of the Year for three consecutive seasons and most recently was named as the inaugural Asian Football Confederation's women's international player of the year.\nMiley Shipp\nAthlete\nMiley Shipp dreams of playing for the Matildas.\nThe 16-year-old has already played football for NSW, won a range of awards, featured in A-League videos and was featured in publications like the New York Times.\nAt the FIFA Women's World Cup in Australia last year, Miley also got to be a ball kid for one of the Matildas' matches.\nDuring winter, Miley traveled to Sydney every weekend to play club football with the University of NSW in the NSW NPL 1 competition.\nMiley says she wants to be a role model for other up-and-coming Indigenous players.\nJason Owen\nMusician\nJason Owen rose to fame in 2012 as the runner-up of X-Factor.\nHis debut album Life Is A Highway reached number one on the ARIA Country Chart and number five on the Australian National ARIA Chart.\nHe's been nominated for numerous major music accolades, including Golden Guitars and CMC awards.\nIn 2019, Mr Owen started his charity Doin It for Rural Aussie Kids.\nDoin it for Rural Aussie Kids provides toys, groceries and money to isolated rural and regional children ahead of Christmas.\nHe also delivers motivational talks as he visits the regional communities.\nMr Owen encourages kids to dream big and that anything is possible.\nPodcaster and advocate\nKatja Williams describes The Ultimate Farm Wife as \"your go-to destination for all things moving to a farm, homesteading and the rural lifestyle\".\nThe podcast, YouTube channel and community delivers a mix of tips, tricks and stories for people who may be moving to the farm, or are already living there.\nMs Williams wants to empower farmers and farm wives with essential skills and practical advice.\nAlong with her husband, Ms Williams looks after 11,000 acres of stud and commercial shorthorns, trade steers, lucerne and other crops.\nHannah Ferguson\nChief executive officer of Cheek Media\nHannah Ferguson doesn't shy away from the taboo or stigmatised.\nShe's forthright in her opinions and wants left-wing opinions to be heard in public spaces.\nMs Ferguson is the boss of new commentary platform Cheek Media Co, the co-host of news podcast Big Small Talk and the author of Bite Back and upcoming book Taboo.\nHer writing has appeared in prestigious publications like The New York Times, Harper's Bazaar and the Sydney Morning Herald.\nJordi Thurtell\nFounder of Sincerely Queer\nTheir dad especially struggled to accept them.\nWith that experience in mind, they started up Sincerely Queer, a safe space for LGBTQIA+ people to connect with others.\n\"I wanted to create a place where gay people could truly be their authentic selves and not feel like they had to shove themselves into a closet,\" Thurtell said.\nIn addition to establishing the group, Thurtell was also one of the people behind Orange's first Rainbow Festival, which was held in March.\nHundreds of people marched through the city in support of diversity and inclusion.\nSarah Wheeler\nFundraiser\nAfter losing both her parents, Sarah Wheeler decided to take action.\nMs Wheeler is currently on The Long Ride, a 5500 kilometre, nine-month journey on her horses to honour her parents and raise money for the Pancare Foundation, and her own charity A Daughter's Way.\nIn July 2022, Ms Wheeler's mum died of stage four bile duct cancer. Her dad died in 2010 of an enlarged heart.\n\"This journey is a tribute to my parents, combining my love for horses with my passion for capturing rural life through photography,\" Ms Wheeler said.\nTo-date, Ms Wheeler has already raised more than $105,000.\nFounder of Dirraybang Footprint\n\"Strong men make strong communities,\" says Jordan Boney.\nMr Boney is the founder of Dirraybang Footprint. The organisation runs cultural workshops within schools and for community groups. It also offers cultural mentoring.\nHe's also a mentor for Boys to the Bush, a not-for-profit organisation that focuses on early intervention strategies for disengaged youths.\nActor and singer\nStepping onto the stage as a young Peter Allen in The Boy From Oz, Jarrod Draper said it felt like home.\nMr Draper has been breaking ground as a Wiradjuri man in the musical theatre industry.\nHe was the first Indigenous graduate from the musical theatre course at the Western Australian Academy of Performing Arts. And when he took on the role of Toulouse Lautrec in Moulin Rouge the musical, he was the first Indigenous artist to play him anywhere in the world.\nMr Draper said he wanted to be the person other Indigenous kids see that \"makes them believe there is a space for them on the stage and screen\".\nHe said he never saw someone like himself as a leading man when he was young but hopes to be that inspiration for other Indigenous children,\nMr Draper has just finished playing Artie Green in Andrew Lloyd Webber's Sunset Boulevard.",
  "word_count": 4431,
  "scraped_at": "2026-02-14T13:02:50.701575"
}