{
  "article_id": "9bbf09cf1d6c",
  "url": "https://www.burntorangenation.com/2025/2/4/24358887/longhorns-daily-news-former-texas-johntay-cook-arrest-forth-worth-sec-cfp-tim-campbell",
  "title": "Longhorns Daily News : Former Texas WR Johntay Cook was arrested in Fort Worth last night",
  "date": "20250204T230000Z",
  "domain": "burntorangenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Johntay Cook, who departed the Texas Longhorns for the NCAA Transfer Portal during the college football regular season, was arrested in Fort Worth last night on property theft and interference of public duties charges, multiple outlets report. Cook is currently the top-ranked portal prospect in the 247Sports’ Transfer Rankings. The Desoto, Texas, product joined Texas as one of the top-ranked members of the 2023 recruiting prospect class.\nLonghorns Daily News: Former Texas WR Johntay Cook was arrested in Fort Worth last night\nPlus: RIP Tim Campbell\nWHAT THEY’RE SAYING ABOUT THE LONGHORNS\nAustin American-Statesman: March Madness bracketology: Is Texas men’s basketball on the bubble?\nAustin American-Statesman: Golden: Toughest games remain, but Texas basketball is battle-tested\nAustin American-Statesman: Texas women’s basketball: Latest rankings for the Longhorns\n247Sports: What Kansas City Chiefs rookie WR Xavier Worthy expects from Texas QB Arch Manning\n247Sports: True freshman Adrian Rodriguez is making his case for immediate playing time for Texas baseball\n247Sports: Four Texas players named to ESPN’s Way-Too-Early 2025 All-America Team\nInside Texas: Steve Sarkisian ranked as On3’s No. 4 head coach in college football in 2025\nInside Texas: The importance of outside receiver in college football\nInside Texas: 2025 Texas Roster Audit: More like roster auditions on the O-line\nICYMI IN BURNT ORANGE NATION\nRECRUITING ROUNDUP\n247Sports: Where Texas Transfer Portal additions stand in latest 247Sports Rankings\nInside Texas: 2027 QB Colten Nussmeier talks Texas, carving his own path in recruiting\nInside Texas: Four-star ATH Heze Kent locks in summer official visits with two ACC programs, trio of SEC contenders\nInside Texas: 2026 four-star LB Anthony Davis staying close to the Longhorns staff\nSEC SHOWDOWN\nGood Bull Hunting: Aggies escape Columbia with a 76-72 win\nRock M Nation: Replacing player leadership in 2025\nRocky Top Talk: Tennessee gets a big boost in the polls after dominating Florida\nAnchor Of Gold: The Statistical: Oklahoma\nRoll ‘Bama Roll: The Kalen DeBoer/Ryan Grubb offense\nA Sea Of Blue: Lamont Butler out, Matthew Murrell questionable for Kentucky vs. Ole Miss\nWHAT WE’RE READING\nSB Nation: 4 Myles Garrett trades that actually make sense\nSB Nation: Roger Goodell’s spineless response to Saints scandal is perfectly on brand\nSB Nation: NFL referee union blasts Chiefs conspiracy theories ahead of Super Bowl 59\nNEWS ACROSS LONGHORN NATION AND BEYOND\n- RIP Tim Campbell.",
  "word_count": 383,
  "scraped_at": "2026-02-14T13:19:31.567114"
}