{
  "article_id": "9bdd47046bdd",
  "url": "https://www.smh.com.au/topic/fa-cup-jk9",
  "title": "Topic | FA Cup | The Sydney Morning Herald",
  "date": "20230416T170000Z",
  "domain": "smh.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FA Cup\nUnderdogs Palace beat Liverpool in shootout to win Community Shield\nJustin Devenny got the winner in the shootout with an emphatic penalty to give Palace a third victory at Wembley in a row.\n- Sam Tobin\nLatest\n- Exclusive\n- AFL 2025\nAFL considers new mid-season competition in radical fixture shake-up\nThe AFL is seriously considering introducing a secondary tournament that would run during the premiership season, award millions of dollars in prizemoney and could even offer the winning team a spot in the finals.\n- Sam McClure\nNine’s goal to become home of soccer with English Premier League dream\nThe media giant will consider a bid for the A-League broadcast rights as it closes in on a deal to acquire the rights to televising the top competitions in England.\n- Calum Jaspan\nManchester United scrape into FA Cup final after astonishing Coventry comeback\nSecond-tier Coventry came back from three goals down to take the Premier League giants to extra time, only to lose on penalties after having a potential late winner ruled offside.\nSunday Sport Quiz: Equestrian high jinx, England’s FA Cup and who is Ralph Doubell?\nChallenge yourself with our sports quiz, a mix of questions about the latest in world and local sport, and the big events in sporting history.\n- Chris Berry\nAnge Postecoglou’s trophy hopes fading as Manchester City knock Tottenham out of FA Cup\nSpurs are out of all cup competitions, leaving them with just the Premier League to focus on – their last remaining hope of winning anything in Postecoglou’s debut season.\n- Vince Rugari\n‘I ain’t taking the blame for that’: Manager slams own players in X-rated FA Cup rant\nDorking Wanderers’ Marc White delivered one of the most brutal post-match assessments in the game’s history after a costly derby defeat.\n- Jeremy Wilson\nManchester City edge closer to treble after FA Cup final win over Man United\nManchester City beat arch-rivals Manchester United 2-1 in the FA Cup final thanks to Ilkay Gundogan’s record-breaking double on Saturday.\n- Martyn Herman\n- Analysis\n- For subscribers\nWhat injury? Kerr proves her class – and fitness – again on the big stage\nThe Matildas captain started and ended her week carrying the Australian flag, and looks cherry ripe for the biggest month of her career.\n- Vince Rugari\n‘Backflip incoming’: Kerr hits winner in FA Cup final; Man City close in on Premier League title\nA week after bearing Australia’s flag at the coronation, Sam Kerr carried Chelsea to another crown in front of 77,390 fans at Wembley Stadium.\n- Glenn Moore",
  "word_count": 431,
  "scraped_at": "2026-02-14T13:25:40.003060"
}