{
  "article_id": "9be38195e637",
  "url": "https://www.thecourier.com.au/story/8680635/ballarat-city-triumphs-over-western-suburbs-3-2-in-state-league-1/",
  "title": "Ballarat City triumphs over Western Suburbs 3 - 2 in State League 1 | The Courier",
  "date": "20240701T063000Z",
  "domain": "thecourier.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "STATE LEAGUE 1 - MEN\nBallarat City Men 3 d Western Suburbs 2\nSubscribe now for unlimited access.\nor signup to continue reading\nThere's been a few missed opportunities for Ballarat City that the club might rue come the end of the season, but at the weekend the club made sure there wouldn't be another one.\nCity's men were impressive in the 3-2 away win against Western Suburbs, picking up three valuable points which keeps them firmly in the mix for promotion opportunities, sitting well inside the top four.\nAnd with three successive home games to come, this is the point of the season City will need to make every post a winner if it wants to earn promotion.\nCoach Michael Trigger had plenty of reasons to smile with the performance, saying it was one of the best of the season.\n\"It was a good performance, I was really happy with it considering it was a bit wet, windy and trying, we played really well,\" he said.\n\"The goals we conceded, one came from a wonder strike which went into the top corner from 30 yards out or so, the other was a mistake from us, but apart from those two moments, I thought we really controlled and dominated the game. We were 3-1 up and they scored very late.\n\"We had some really good performances, I thought Xagai Douhadji was exceptional, returning from his hamstring that he suffered a few weeks back.\n\"I thought Aidan Lane at centre back was very good. He broke his nose against Westgate three weeks ago after hitting his head on an opponent, so it was great to have him back.\"\nTrigger said while comfortable where City sat on the table, the next few games would be season shaping.\n\"We're in the mix, but we could go back through numerous results and wonder what if, we can only focus on what we can do from here, the good thing is, we have three home games in a row in front of us, which we need to capitalise on.\"\nSTATE LEAGUE 1 - WOMEN\nBallarat City 2 drew Mill Park 2\nBallarat City's women can be well pleased with their performance against a difficult opponent on Sunday afternoon, walking away with a 2-2 draw against second placed Mill Park.\nCity took a one goal lead in half-time, but was unable to defend for the full 45 minutes of the second half with Mill Park getting themselves back into the game.\nBut they were able to hold on to secure what could be a valuable point in the context of the season.\nTayte Fraser and Lily Slater each found the back of the net for City, but they had no answer to Tayla Mure of Mill Park who slotted two second-half goals to tie up the match.\nThe result move Ballarat City up to 14 points and it now finds itself well clear of the bottom clubs, with a road trip to face second-last placed Kings Domain coming up this weekend. This game presents another opportunity for the in-form team to continue to climb the ladder.\nSTATE LEAGUE 3\nSebastopol Vikings 1 drew Point Cook 1\nDraws were the story of the day for Ballarat's team with the Sebastopol Vikings also held to a tie, finishing 1-1 with Point Cook.\nThese are two teams that know a lot about each other, having met in State League 3 for a number of years, so there wasn't much new that each side could show.\nAs has been the case in these matches in the past, the two sides went toe-to-toe. The home side, Point Cook was first on the board through Hassan Yehla in the first half, but the Vikings hit back in the second half, with Pat Karras putting through the equaliser.\nWhile a point on the road is always a good result, the final score continues the frustrating season for the Vikings with the game being the club's fourth tie of the season.\nThe Vikings are in the middle of a run of away games, with a clash on the road against Diamond Valley next on the agenda.\nSTATE LEAGUE 5\nBallarat SC 0 def by Deakin University 2\nIt's been a tough two weeks for Ballarat SC with back-to-back matches against the top two sides and despite another loss at the weekend, there's plenty of positivity around for the ever-improving side to take away from the performances.\nOn the back of a 1-0 defeat away to top side Lara United last round, this time, Ballarat fell 2-0 to Deakin University.\nIt was a goal in each half that separated the sides with Deakin with goals to Kai Allen and Sam Wyeth proving to be the difference.\nThe draw gets slightly easier in coming weeks, but next week again looks to be another big test, up against third-placed Maidstone United, completing a trilogy of top teams in a row.\nBDSA\nThe top three teams in the Ballarat District Soccer Association have made their moves on the rest of the competition with Vikings, Forest Rangers and Ballarat North United all having big wins across the weekend.\nIt was also a big weekend for Victoria Park who hit the back of the net twice in a 2-0 victory against Daylesford and Hepburn United.\nTop team Vikings were impressive in their 4-1 victory over Ballarat on Friday night. Leading the way for Vikings was two goals each from Corey Smith and Liam Dawson.\nBallarat North United was never troubled in its 6-0 defeat of Maryborough. North United led 4-0 at the half and went on with the job in the second 45 minutes. Charlie Richardson's hat-trick the highlight.\nForest Rangers were also super impressive in a 7-1 win over Bacchus Marsh. Brandon Bosher added another hat-trick to his impressive season while Trent Moodley scored a double.\nIn the women' competition, it was a huge 10-0 win to Forest Rangers over Creswick with Tiarlah Anstis and Alannah Hayes each scoring three times while Ballarat had a 3-0 win over Ballarat North United with all goals coming in the second half.\n- Need more sport from The Courier? Check out our WhatsApp channel for stories as they go online, and download our app for breaking news alerts - and daily puzzles",
  "word_count": 1050,
  "scraped_at": "2026-02-14T12:18:12.223382"
}