{
  "article_id": "9bee6a51faf2",
  "url": "https://www.barcablaugranes.com/2025/5/24/24435783/arsenal-barcelona-womens-champions-league-final-final-score-match-report-recap-reactions",
  "title": "Arsenal vs Barcelona , Women Champions League Final : Final Score 1 - 0 , Barça suffer heartbreaking defeat in Lisbon",
  "date": "20250524T223000Z",
  "domain": "barcablaugranes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Barcelona could not make history with a third consecutive Women’s Champions League title thanks to a heartbreaking 1-0 defeat against Arsenal at the José Alvalade Stadium in Saturday’s Final. After a poor first half the Blaugrana dominated most of the final period, but conceded against the run of play late in the final period and couldn’t pull off a miracle comeback against a tough and gritty Arsenal side that defended for their lives and claimed their second European crown with one of the greatest upsets in competition history.\nArsenal vs Barcelona, Women’s Champions League Final: Final Score 1-0, Barça suffer heartbreaking defeat in Lisbon\nA very painful loss\nFIRST HALF\nIt has now become a habit for Barça to start slow in Champions League finals, and they had another difficult first half in this one. The Blaugrana were below par with and without the ball, and struggled to play with any consistency in the attacking half.\nTheir struggles against Arsenal’s high press early in the period led to a few half-chances for the Gunners, who had shooting opportunities in dangerous positions in the box and forced a big save from Cata Coll on a shot by Frida Maanum from outside the box.\nArsenal even thought they had taken the lead thanks to an own goal by Irene Paredes, but Barça were saved by the semi-automated offside system and the Catalans were lucky to not find themselves behind after a very tough 25 minutes to start the contest.\nThe Blaugrana slowly but surely started to play a little better towards the end of the period, and had a few dangerous attacks with balls in behind the Arsenal high line, but poor decision-making in the final third stopped them from creating true danger.\nThe Arsenal defenders also made crucial blocks when Barça attempted some shots inside the box, and the Gunners managed to reach the halftime break as the better team thanks to a resolute defensive performance and a few strong moments in attack, while Barça needed to show a ton of improvement in all areas to give themselves a chance in the second half.\nSECOND HALF\nBarça finally looked like themselves to start the second half: the Blaugrana completely dominated the action in the first 20 minutes, moving the ball quickly between the lines and firing several shots on goal from inside and outside the box.\nClaudia Pina saw a deflected effort hit the crossbar, Ona Batlle fired three dangerous shots from the edge of the area, and the Arsenal defenders continued to make crucial blocks and interceptions inside the box.\nThe opening goal seemed like a matter of time for Barça, but one substitution changed the game: Swedish striker Stina Blackstenius came off the bench and gave Arsenal a real counter-attacking threat, and had two monster chances in a span of three minutes: the first required a huge save from Coll, but Blackstenius didn’t miss the second and gave the Gunners a shocking lead against the run of play with 15 minutes to go.\nBarça had very little time to pull off a miracle comeback and certainly had enough numbers in the box and several attempts to create a late chance, but never truly threatened the Arsenal goal. The final whistle came after more than seven minutes of added time, and Barça’s hearts were broken.\nThis is a tough one to take, but Arsenal deserve to win given their resolve and the quality of their defensive performance. Barça didn’t play their best football for most of the evening, and they’ll have to wait until next year to win a fourth European title.\nThis hurts.\nArsenal: Van Domselaar; Fox, Williamson, Catley, McCabe; Little, Maanum (Blackstenius 68’), Mariona; Kelly (Mead 68’), Russo (Wubben-Moy 90+2’), Foord (Hurtig 86’)\nGoal: Blackstenius (74’)\nBarcelona: Coll; Batlle, Paredes, Mapi (Engen 79’), Rolfö (Brugts 79’); Aitana, Patri, Alexia; Graham, Pajor, Pina (Paralluelo 62’)\nGoals: None",
  "word_count": 648,
  "scraped_at": "2026-02-14T12:50:23.824258"
}