{
  "article_id": "9c0ad6ac09ec",
  "url": "https://www.90min.com/sarina-wiegman-admits-concern-chloe-kelly-struggle-game-time-man-city",
  "title": "Sarina Wiegman admits  concern  with Chloe Kelly struggle for game time at Man City",
  "date": "20241119T173000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sarina Wiegman admits 'concern' with Chloe Kelly's struggle for game time at Man City\n- Man City's Chloe Kelly has been called up to Sarina Wiegman's latest England squad\n- The Lionesses will face the USA and Switzerland in friendlies at the end of the month\n- Kelly has struggled for game time at club level this season\nEngland manager Sarina Wiegman has admitted she is concerned with Chloe Kelly's struggle for regular game time at Manchester City this season.\nThe 26-year-old has been a regular for both club and country over the last few years, having scored the winning goal that crowned England champions of Europe against Germany back in 2022. However, chances have been hard to come by for the attacker more recently amid competition.\nKelly has featured in only five of City’s eight WSL matches so far this term, with the majority of her minutes reserved for the Champions League. In Europe, she has has scored two goals and registered two assists in four appearances.\nWhile Lauren Hemp's knee injury could result in more opportunities for Kelly in the coming weeks, Wiegman has expressed concern she is not already playing regularly. However, the England boss also insisted Kelly has enough credit in the bank to retain her place in the Lionesses squad.\n\"It's a concern right now already,\" Wiegman told a press conference on Tuesday. \"It's a hard situation.\n\"We have to look at what's available in our squad. We have some injuries up front: Lauren Hemp, Lauren James. Chloe knows that she is not in the best position with her club at the moment. But enough credit to bring her in, related to the whole team and availability of players.\"\nKelly initially joined City from Everton ahead of 2020/21. In the last four years, she has amassed over 100 appearances for the club, but her current contract is set to expire at the end of the season.\nCity boss Gareth Taylor has previously addressed Kelly's lack of match minutes and her future, telling the media in October: \"Chloe has been great. She's really working hard, she's really engaged and she's really aligned with what we're doing.\n\"She understands, like the rest of the players at the top end of the pitch, that things are slightly different from the last season or two. We have been able to strengthen in those areas.\n\"She's contributed this season, for sure, and like the rest of the players I talk to, whether it be Mary [Fowler] or Aoba [Fujino], you've got to be ready to play if you're needed.\"",
  "word_count": 429,
  "scraped_at": "2026-02-14T13:05:17.597618"
}