{
  "article_id": "9c34e0151003",
  "url": "https://www.thisdaylive.com/index.php/2023/03/16/infantino-re-elected-unopposed-as-fifa-president/",
  "title": "Infantino Re - elected Unopposed as FIFA President – THISDAYLIVE",
  "date": "20230316T210000Z",
  "domain": "thisdaylive.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Latest Headlines\nInfantino Re-elected Unopposed as FIFA President\nGianni Infantino has been re-elected as the president of the Federation of International Football Association (FIFA).\nThe election was held on Thursday during the 73rd Congress in Kigali, as Infantino stood unopposed, making his re-election as head of football’s governing body a formality.\nControversies surrounding him include the treatment of migrant workers in the run-up to last year’s World Cup in Qatar and a failed plan to play the tournament every two years.\nInfantino, however, promised record revenues in the next four-year cycle of $11 billion as he called for more football to be played around the world.\n“It is an incredible honour and privilege, and a great responsibility.\n“I promise to continue serving FIFA and football around the world.\n“To those that love me, and I know there are many, and those who hate me, I love you all,” Infantino said.\nHe confirmed FIFA’s income hit record levels in the last cycle from 2019-2022, but promised to substantially raise this again on the back of expanded men’s and women’s World Cup tournaments and the introduction of a 32-team Club World Cup.\n“Revenues rose to a record $7.5 billion (to 2022) in a period that was hit by COVID-19.\n“When I arrived, FIFA reserves stood at around $1 billion, today they are at almost $4 billion,” Infantino said.\n“We promise new record revenues for the next cycle of $11 billion, and the new Club World Cup is not included in that figure, so it could increase by a couple of billion (more).”\nHe said FIFA would continue to review the transfer system to “improve transparency” and suggested the organisation might discuss a salary cap.\n“We must improve our regulations and the FIFA statutes. We will continue to evolve our good governance principles and look at the transfer system, and maybe have a discussion to improve transparency of transfer fees and salaries.\n“It might be necessary to introduce a cap, we have to think how we can do that. We will look at it with all stakeholders and see what we can do.”\nAmid the financial success of his seven years in office, Infantino has also courted controversy that has made him unpopular with some member associations.\nHe accused critics of host Qatar’s human rights record of hypocrisy and racism at the World Cup.\nThe tournament in the desert state led to a significant amount of political discussion around the host’s treatment of migrant labour, its approach to LGBT rights and FIFA’s threats to penalise players for political statements.\nThis included the banning of the anti-discrimination “One Love” armband which drew anger from a number of quarters.\nFIFA has previously spoken about setting up a legacy fund to assist and compensate migrant workers who helped build the stadiums and other infrastructure for the World Cup.\nBut the FIFA boss made no mention of it in his address, since no concrete plans have been revealed.\nHe did suggest that FIFA had cleaned up its act with regards to governance.\n“Every single dollar that is being invested in projects and associations will undergo an independent audit. Money just doesn’t get lost any more.\n“That is why the institutions have regained their trust in FIFA. The Department of Justice of the United States has given us more than $200 million back that was stolen by corrupt officials. We have re-invested that in football,” he said.\nPlayer welfare groups have questioned FIFA’s decision to expand the men’s World Cup from 64 to 104 games, but Infantino said there was need to have more football played around the world.\n“When I hear there is too much football, yes, maybe in some places, but not everywhere. In fact, in most parts of the world there is not enough football played.\n“We need way more and not less competitions, we want football to develop worldwide.\n“We are discussing organising a women’s Club World Cup and a FIFA World Series in March every two years, when teams are free from playing qualifiers,” he stated.\nInfantino was first elected in an Extraordinary Congress in 2016 following the resignation of his predecessor, Sepp Blatter, and retained his position unopposed three years later.\nBut this counts as his second term of office and he would therefore be available for a third and final term in four years’ time. (Reuters/NAN)",
  "word_count": 725,
  "scraped_at": "2026-02-14T13:07:38.813973"
}