{
  "article_id": "9c39ab12a931",
  "url": "https://metro.co.uk/2024/03/22/reason-nike-changed-england-flag-new-kit-revealed-20512784/",
  "title": "The reason Nike changed England flag on new kit revealed | Football",
  "date": "20240322T134500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Football Association and Nike are under increasing pressure to recall England’s controversial new shirt ahead of its debut against Brazil.\nGareth Southgate’s side will take to the Wembley turf in front of 90,000 fans for a prestige friendly, wearing a kit that has caused uproar amongst former players, fans and even politicians.\nThe fallout surrounds the American apparel giant’s decision to change the colour of the St George’s cross printed on the collar of the home shirt.\nRather than use a traditional red on a white background, the cross is comprised of red, purple and blue on a navy background in what Nike initially termed as a ‘playful update’ which was intended to ‘united and inspire’.\nAmid a growing backlash, Nike released a statement on Thursday insisting they would not recall the shirt while highlighting the reworked flag design was inspired by the training kit warn by England’s 1966 World Cup legends.\nA Nike spokesperson said: ‘The England 2024 Home kit disrupts history with a modern take on a classic.\n‘The trim on the cuffs takes its cues from the training gear worn by England’s 1966 heroes, with a gradient of blues and reds topped with purple. The same colours also feature an interpretation of the flag of St. George on the back of the collar.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThat explanation has failed to appease a growing number of dissenters, including former England midfielder Joey Barton who noted the palette on the new jersey mirrored that of the Genderfluid Pridge flag.\n‘Trying to sneak that Woke, Gay communist nonsense onto the England national team jersey,’ he wrote on X.\n‘Nothing ‘playful’ about it. Another manoeuvre in their attempted ‘Coup d’état’ of the men’s game. Leave our flag and our game alone.’\nRishi Sunak, meanwhile was forced to wade into the debate on Friday and urged Nike ‘not to mess’ with one of the symbols of the England football team.\nHe said: ‘Obviously, I prefer the original and my general view is when it comes to our national flags we shouldn’t mess with them because they are a source of pride, identity, who we are and they are perfect as we are.’\nMore Trending\nThe prime minister was echoing the sentiments of Labour leader Sir Keir Starmer who urged those responsible to revert to a more conventional design.\nHe told The Sun: ‘I’m a big football fan, I go to England games, men and women’s games, and the flag is used by everybody. It is a unifier. It doesn’t need to be changed. We just need to be proud of it.\n‘So, I think they should just reconsider this and change it back. I’m not even sure they can properly explain why they thought they needed to change it in the first place.’\nMORE: ‘You’ve got to respect him’ – Ray Parlour defends Ben White after Arsenal star snubs England call-up\nMORE: ‘It’s wrong on every level!’ Former England stars slam new kit\nMORE: Harry Maguire believes Manchester United star Kobbie Mainoo could be the next Jude Bellingham",
  "word_count": 559,
  "scraped_at": "2026-02-14T12:32:05.823437"
}