{
  "article_id": "9c67f4abb512",
  "url": "https://awfulannouncing.com/nfl/women-raise-game-diversity-opportunities.html",
  "title": "  Women Raise The Game  showcases the NFL embrace of diversity",
  "date": "20250219T221500Z",
  "domain": "awfulannouncing.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The week of the Super Bowl is always filled with a strong lineup of football-related events. But one this year stood out for showing why the NFL and many in business with the league have not backed away from embracing diversity, even at a time when many other companies have ended or reduced their efforts.\nThat would be the second annual ‘Women Raise The Game’ Champions Super Bowl brunch.\nThis brunch, held at the Le Meridien Hotel in New Orleans, featured a remarkable lineup of speakers and award honorees. From on-stage interviews through panels and award presentations to individual comments to the media, some recurring themes ran throughout.\nOne key repeated theme from this Women Raise The Game event was the importance of diverse leadership in helping leagues, organizations, and businesses reach the widest possible audiences. On a “The Business of Sports” panel, NFL Vice President (global brand and consumer marketing) Sarah Bishop said diversity is critical there, which is part of why her league keeps leaning toward that.\n“Diversity generally, I think obviously, couldn’t be more important than it is now,” she said. “You need diverse perspectives and opinions and voices around the table. It makes us all better. It makes us all stronger.”\nBishop said that for her specific department, which focuses on growing the NFL’s overall fanbase, the crucial factor is telling diverse stories that will interest different audiences. In addition to more traditional game stories or analytical breakdowns, that can include elements touching on music, fashion, increased participation through flag football, and more.\n“Why we do what we do is really to create that connection with the game and show people that football is for everybody,” she said. “How we do that, it’s storytelling across the ecosystem.”\nShe said it’s also vital to spotlight what the league, its players, and its coaches do for their communities.\n“We’re connecting with people through purpose,” she said. “The league does incredible things in the cause and community space, many of which we don’t talk about. And so we know that connecting through what you stand for is really incredibly important too, especially to the younger generation. So making sure that we’re focused on that is also critically important.”\nBishop said the NFL has seen some of the best results in reaching new audiences with stories particularly focused on players as people.\n“I think the storytelling for us that’s been incredibly successful has been what we call ‘helmets off,’ really showcasing the people behind the players and what they stand for as a way to connect with these new audiences, whether that is youth or women or Latino audiences. Showing them the place for themselves in our brand is really important.”\nBut this isn’t just about targeting specific audiences and then having some algorithm create content for them. Who’s making the content matters. This was particularly shown through comments on Women Raise The Game’s first panel, “No Limits: Expanding The Opportunities,” from Talia Thompson, a Native Hawaiian and Samoan filmmaker who founded Tusitala Productions and directed Pacific Roots: Our Football Legacy.\nThat documentary features extensive interviews with many Polynesian players who have greatly impacted the league. And Thompson said she was uniquely able to get those interviews and tell those stories in a wide-ranging feature-length project like this because of her connections to that community.\n“In my culture we pass down our histories and our customs orally. So I feel like being a storyteller, being a person that my community trusts, most especially with my first project, Pacific Roots: Our Football Legacy, being able to work with all the Polynesian athletes that have made an impact in the National Football League…it’s been such an honor and a privilege to be that storyteller for my people, because prior to starting this project a few years ago, it didn’t exist.”\nOn that front, Women Raise The Game’s Tamala Barksdale (who’s also the chief strategy officer and partner at The 360 Agency, whose founder Tish Galindo also founded WRTG) told Awful Announcing at this brunch that diversity in the media covering sports is critical to ensuring stories are told well.\n“The story of sport is better represented when there are young men, young women, old men, old women talking about it,” she said. You get different perspectives, you get a different take on the sport, right?\n“It’s been a man’s game for a while, but women have been invited in for quite some time. And the fact that they’re succeeding, telling great stories, getting the clicks, raising women in the numbers, we love it, we love to see it.”\nBarksdale said that doesn’t necessarily mean hiring people based on gender, but it does mean making sure talented women are recognized and given opportunities.\n“Your publisher wants to have the best person telling the story. Our position is that the best person wins. And oftentimes, it’s going to be a woman.”\nEvent MC Holly Robinson Peete said she’s seen notable recent progress on female representation in the sports media space, but she thinks more can be done.\n“I think the media space looks good, I think it could be better, where we’re not always just being cute on the sidelines, you know,” she said. “I like when we anchor shows, I like when we’re not just window dressing. I think that’s happening more.”\nShe said one area of tangible progress has come on ESPN’s First Take, where host Molly Qerim is now often allowed to opine in a way predecessors like Cari Champion weren’t.\n“It used to drive me nuts in the early days of First Take when my friend Cari Champion was on, and it would just be like she was allowed to just go to commercial, and barely got to weigh in,” Robinson Peete said. “She has a huge, high sports IQ. So I think just having women be a moderator is…I want to hear their opinions as well.”\nThose opinions and perspectives can also come from behind the scenes. An example of that was this year’s Woman of the Year Award, presented to Constance Schwartz-Morini.\nSchwartz-Morini is the co-founder of SMAC Entertainment with Michael Strahan. That company is involved in a wide range of sports business projects, from representing athletes, coaches, and reporters to producing documentaries and docuseries from BS High through Evolution of the Black Quarterback and Coach Prime.\nOver the years, Schwartz-Morini has been heavily involved in that business. That includes regularly serving as an executive producer on the documentary side, which builds on work she’s done for a long time, including at NFL Films in the 1990s. She told AA that while she’s somewhat uncomfortable being recognized publicly with an award like this, she loved the honor for the chance to show women they can work at the highest levels of sports.\n“It’s opportunities like this for me to continue to get the word out that it doesn’t matter if you’re a guy or a girl or what you’re into. It’s just, ‘Are you the best at what you do?’”\nZaileen Janmohamed, the president and CEO of the Bay Area Host Committee (which is leading efforts for this past week’s NBA All-Star Game, next year’s Super Bowl LX, and the 2026 FIFA World Cup games there), was honored with Women Raise The Game’s Woman of the Year award last year. She told AA that the support she got from WRTG last year was invaluable, and she came back to the event this year to pass that on and salute Schwartz-Morini in particular.\n“The award last year, it literally changed the game for me,” she said. “It was at a time that I essentially just won three events. And you know you have to do it, but you don’t know if you can.\n“And these types of things actually fuel your confidence and fuel your soul. And you realize you have so many people that are supporting you whether you know them or not, that there’s a movement behind you that wants to see you succeed. So today was my chance to basically pay it forward and celebrate someone else who is doing amazing things in her career, and maybe doesn’t even realize her impact on this industry and her being female in this industry.”\nThe focus on opportunities obtained through excellence extended beyond media figures. On the Business of Sports panel, Chicago Bears offensive assistant (running backs) Jennifer King said she pivoted to coaching football after a decade-plus in women’s basketball after seeing early female coaching trailblazers in the NFL. She said the history she’s made as the first Black female to coach in the league full-time will hopefully prove inspirational for others.\n“Once I saw a woman coach in the NFL, I was like, ‘I can do that.’ So I think it’s important for me to be the representation that I didn’t have,” she said. “That’s something that I try to do every single day in the opportunity that I get, because you never know who’s watching, who can be influenced by seeing you coaching in the NFL.”\nIn an on-stage interview with Invisalign VP of marketing Kamal Bhandal, Diana Flores (the quarterback and captain of Mexico’s world champion national flag football team and an NFL ambassador who was featured in their Super Bowl LVII “Run With It” commercial) said she saw the power of bringing her unique perspective to the table once she used her play to win over those who doubted her.\n“No matter who you are, no matter where you’re from, if you earn the respect and you earn your place on the field, on the table, whoever or whatever you want to do, there’s something very unique and special that happens.”\nA key focus throughout the comments at this event was “sending the elevator down,” or using one’s own success to help a new generation of women in sports. Bishop, the NFL marketing vice president, said mentorship, support, and providing opportunities there are all crucial.\n“I think probably every woman, every person in this room has had a moment where they’ve had someone see them and listen to them and give them the opportunity to be at the table,” she said. “This is incumbent upon all of us who are now in those rooms to bring other people along with us.”\nThe latest\n“I remember going into the agency to be introduced, and I was with my boss, who was a man. And I walked into this room full of men at the agency, and I was very excited to run my first campaign.\n“And I remember going up to the agency owner and the head of the relationship with us, and I introduced myself, ‘I’m Marissa, nice to meet you.’ And he said to me, ‘Hello, Marissa, it’s so nice to meet you, why don’t you meet Susie, my admin, and why don’t you two ladies go have a cafecito while us men talk business?’\n“And, you know, I was 23 years old at the time, I didn’t know what to do in that moment. I looked at my boss and he said nothing. And it was in that moment that I had to make a choice. And it was the defining moment.\n“You have 30 seconds to make that choice. But in those 30 seconds, my parents and everything they’ve done for me flashed by. And, you know, legs shaking and everything, I have to say, ‘I can’t go have that cafecito because I’m running this campaign. I’m staying in the room.’\n“I wish I could tell you the sky parted and everything was wonderful, but no, it was extremely awkward staying in the room. And for months, you know, of being in that relationship. But I had to stay and make sure that people knew I was in that room and claimed my seat.\nSolis said she’s grateful she got that experience early on.\n“It happened at 23, and I’m so very blessed for that, because I’ve claimed every seat that has come after. And it doesn’t matter if you’re the only, the first, it doesn’t matter. Claim that place, go, you know, make it happen.”\nAnd she said that motivates her to keep pulling others up.\n“Make sure you don’t forget those that come after you and pull them up and bring them with you. Because I don’t want to ever be that boss that just stood there and did nothing.”\nBut there remain challenges here. Christina Chang, a partner at leading law firm Nixon Peabody LLP who’s a key part of their entertainment and sports and stadium practice teams, said on the Business of Sports panel people from underrepresented backgrounds often have to outperform anyone else to get a shot.\n“To be great, you have to work really hard, especially when you are a female, a minority. You’re trying to break into things like sports, which time and time again, the barrier to entry is insane sometimes, right?”\nAnd Chang said the current focus from both the U.S. government and many corporations on removing diversity, equity, and inclusion programs adds to the hurdles there.\n“Diversity is so important, especially now. Regardless of politics, I think Trump’s America is a very dangerous place for a lot of us. And so you’re just going to have to work that much harder. And that’s okay, right? But the diversity, the viewpoints, you have to keep leveraging that and elevating each other.”\nMany women in and around the NFL are doing that kind of elevation of others. One is Sabrina Greenlee (CEO of the non-profit organization S.M.O.O.O.T.H., which empowers women affected by domestic violence), who was honored here as an advocate of the year. Greenlee, who lost her vision after a 2002 attack, is the mother of Chiefs’ star DeAndre Hopkins, and he’s regularly advocated for her and the work she’s doing. And Greenlee said in her acceptance speech that the key for her is continuing to do the work even amidst incredible challenges.\n“Never underestimate the power of showing up,” she said. “I am living proof, my life is a testament of when you show up every day. Because it’s not going to be easy.”\nAnd Ashley Smith, the NFL’s manager of player engagement who was honored here as a visionary of the year, said in her acceptance speech that the key message from events like this is that women are vital in all sorts of sports roles.\n“Women belong in every conversation, in every boardroom, in every front office, and in every decision-making seat in sports and entertainment. We belong as coaches, as executives, as storytellers, and as game changers. And when we uplift and support one another, our impact becomes undeniable.”",
  "word_count": 2452,
  "scraped_at": "2026-02-14T12:49:47.636145"
}