{
  "article_id": "9c7387bbcad3",
  "url": "https://news.sky.com/story/fifa-club-world-cup-to-take-place-in-2025-in-the-united-states-13031836",
  "title": "FIFA Club World Cup to be spread across 28 days in summer of 2025",
  "date": "20231216T170000Z",
  "domain": "news.sky.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA Club World Cup to be spread across 29 days in summer of 2025\nThere will be 12 representatives from Europe in the competition, with the participation of Chelsea, Real Madrid and Manchester City already determined as recent Champions League winners.\nSaturday 16 December 2023 19:09, UK\nThe new Club World Cup will be spread across 29 days by FIFA in the summer of 2025, Sky News can reveal – finishing around a month before the new Premier League season.\nFIFA has set aside 15 June to 13 July in 2025 for the inaugural edition of a 32-club men's tournament in the United States, sources say.\nThe new Premier League season could be starting four weeks after the final - sparking concerns about the additional workload on players who could be required for more than 80 matches in the season.\nIt is understood teams will have a minimum of three days' rest between games to address concerns about player welfare.\nThe Club World Cup dates are due to be presented to a meeting on Sunday in Jeddah, Saudi Arabia, of the FIFA Council that is headed by Gianni Infantino and had previously approved the launch of the new competition.\nThe tournament would follow the end of the European season and the 2-10 June slot already set aside for two international matches - potentially 2026 World Cup qualifiers in Europe.\nRead more:\nDelia Smith's car hit by beer can before football match\nA Question Of Sport axed by BBC\nThere will be 12 representatives from Europe, with the participation of Chelsea, Real Madrid and Manchester City already determined as recent Champions League winners.\nThe European Club Association, which represents the leading teams, has endorsed the new competition and is working with FIFA on selling the commercial rights.\nThe Club World Cup is taking the slot used the year before the 2002, 2006, 2010, 2014 and 2018 World Cups as a test event in the host nations - the now-defunct, eight-country Confederations Cup.\nFIFA sees the new Club World Cup as addressing the dominance of Europe by giving clubs from other continents access to an enhanced competition.\nAhead of the FIFA Council meeting in Saudi Arabia on Sunday, Sky News has learned that the global players' union FIFPRO has told the governing body that players need a mandatory 28-day off-season break.\nCalendar challenges\nIf that was adopted in 2025 it would pose challenges for the Premier League over what to do about teams reaching the Club World Cup final and potentially needing to start the new domestic season about 28 days later when pre-season training would usually be required.\nA further headache would be a team also required to play in the 2025 Community Shield which is played a week before the Premier League starts.\nAnd starting the season later than usual for all teams would be challenging for the Premier League because players need to be released by their clubs to national teams on 25 May 2026 ahead of the World Cup being staged in the U.S., Canada and Mexico.\nThat World Cup is expanding to 48 teams with 104 matches rather than the 64 at Qatar 2022 with 32 teams.\nFIFPRO has told FIFA that some players in the 2024-25 season might be required for more than 80 matches for club and country - a 10% rise than the current upper limits.\nFIFA is also planning to launch a new competition in 2024 that will see the UEFA Champions League winners play the winner of intercontinental play-offs between the other confederations.\nMan City are preparing to fly this weekend to Saudi Arabia to participate next week in the last edition of the Club World Cup in its current format as a little-regarded seven-team tournament held annually with each continent's champions plus the host nation.\nThe new 32-team competition will only be held every four years and it will plant FIFA's footprint deeper on the football calendar.\nThe international governing body's major events are currently the men's and women's World Cups for national teams that are each held once in a four-year cycle.\nMr Infantino's plans to make the World Cup every two years were rebuffed by European football leaders.\nBut the significantly-expanded Club World Cup will give FIFA an even greater association with the club game that is the lifeblood of the sport.\nTypically, clubs seek money-spinning global tours in July as part of pre-season plans. FIFA is trying to offer up matches that could be both more lucrative for clubs and more meaningful.\nThat would leave managers having to decide whether to play full-strength sides whereas summer tours are currently used to spread playing time among the squad.\nFIFA is also planning a Club World Cup for women's teams.\nFIFA declined to comment on the dates of the new men's Club World Cup.\nThe World Leagues Forum is chaired by Premier League chief executive Richard Masters.\nThe group has previously said on the Club World Cup: \"As the calendar is already overloaded, with longstanding domestic club competitions and ever-expanding international competitions, FIFA's decision creates the risk of fixture congestion, further player injuries and a distortion of competitive balance.\n\"The interests of the football community, which we expect FIFA to take care of, are not best-served by piling-up FIFA-owned matches which only involve the top 1% of players. Instead, we should all expect FIFA to create the environment for a complementary balance between domestic and international football for the benefit of the whole game.\"",
  "word_count": 914,
  "scraped_at": "2026-02-14T12:46:38.953701"
}