{
  "article_id": "9c76b4f288cf",
  "url": "https://www.dw.com/en/visit-saudi-ditched-as-potential-womens-world-cup-sponsor/a-65018259",
  "title": "Visit Saudi ditched as potential women World Cup sponsor – DW – 03 / 16 / 2023",
  "date": "20230326T150000Z",
  "domain": "dw.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Visit Saudi ditched as potential women's World Cup sponsor\nMarch 16, 2023Visit Saudi's proposed sponsorship of the women's World Cup in Australia and New Zealand drew the ire of the host nations and players across the globe. Human Rights Watch believe FIFA failed to do their due diligence.\nHuman Rights Watch (HRW) has claimed FIFA's failure to do adequate due diligence has led to football's governing body having to reverse its intention to have 'Visit Saudi' named as a sponsor for the women's World Cup.\nThe Saudi Arabia tourism board had been touted as a potential sponsor of the expanded 32-team tournament, which drew sharp criticism from a number of quarters.\nJoint host nations of this summer's competition Australia and New Zealand wrote to FIFA in February, when the potential sponsorship deal was reported, first by The Athletic, demanding clarification and to express \"shock\" and \"disappointment\".\nGianni Infantino, who wasre-elected as president until 2027 at the FIFA congress in Kigali after running unopposed, said that although conversations had occurred with Visit Saudi, no contract had been signed.\n\"The significance of this is that it is the first reversal of a sponsorship that FIFA has made,\" Minky Worden, Director of Global Initiatives at Human Rights Watch, told DW.\n\"This is the first time FIFA are leaving money on the table because they failed to do human rights due diligence, so it's a pretty important reversal.\"\n\"The importance of this is that FIFA also did not consult the female national team players, who are most affected. They failed to think through what the implications are for women's, LGBTQ and human rights.\"\nInfantino accuses countries of double standards\nIn contrast, Infantino accused Australia of double-standards as he highlighted the country's political and economic contracts with Saudi Arabia.\nMany leading players in the women's game had criticised the potential sponsorship plan, with German captain Alexandra Popp saying: \"It is not an optimal sponsor for a women's World Cup and for what we women stand for.\"\nAnd, veteran U.S. forward Alex Morgan echoed those thoughts, explaining it 'morally' did not make sense.\nDespite the apparent climb down from FIFA, Infantino suggested that sponsorship deals with countries such as Saudi Arabia and Qatar cannot be ruled out, despite their human rights records.\n\"There is a double standard which I really do not understand,\" he said. \"Of course, we want to see how we can involve Saudi sponsors, and those from Qatar, in women's football generally.\n\"FIFA is an organisation made up of 211 countries. There is nothing wrong with taking sponsorships from Saudi Arabia, China, United States of America, Brazil or India.\"",
  "word_count": 436,
  "scraped_at": "2026-02-14T12:25:27.749418"
}