{
  "article_id": "9c8c0057c2b4",
  "url": "https://www.rnz.co.nz/news/sport/492815/boost-in-live-sport-on-free-to-air-tv-in-nz",
  "title": "Boost in live sport on free to air TV in NZ",
  "date": "20230629T051500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "For the first time in over 30 years a raft of live sport, including cricket, netball, athletics, and basketball is being broadcast free-to-air in New Zealand.\nFrom Jonah Lomu's World Cup rampages, to the infamous underarm ball and Black Magic's 1995 triumph, some of the Aotearoa's greatest sporting moments were broadcast to lounges across the country for free.\nSky's Prime TV has offered some live coverage of events, and some delayed coverage, but the ramping up of TVNZ's live offer gives the viewing public a level of live sport that it hasn't seen for decades.\nFrom July TVNZ will pick up broadcasting major international sport including cricket, netball, athletics, and basketball.\nIt follows the demise of the streaming service from Spark Sport.\nThe Black Caps, Tall Blacks, NFL, United Rugby Championship, Diamond League Athletics, The US Tennis Open, FA Cup Football and the World Rally Championship are just a handful of the sporting smorgasbord coming to screens.\nHowever when it comes to New Zealand's so called national game the All Blacks and Black Ferns won't be on the TVNZ menu.\nPrime will offer six Rugby World Cup games live on free to air television and also live coverage of the Silver Ferns at the Netball World Cup.\nTVNZ general manager Melodie Robinson said its their goal was to bring sporting coverage to all New Zealanders however they chose to watch.\n\"It ticks some of our public charter repsonsibilities as well in making sure that we tell all those New Zealand stories and represent all those voices.\"\nThe former Black Fern said she was inspired to chase her dream after seeing women's rugby on TV as a kid.\n\"We are really keen to keep offering sport in the future to New Zealanders, so we are really open about what sport's rights we will go for and we certainly will put all our best cards on the table when we do.\"\nNew Zealand Cricket chief executive David White said it was an exciting time for cricket lovers in particular.\n\"Having TVNZ as the free-to-air home for all our domestic Black Caps, White Ferns, and Super Smash matches is a fantastic opportunity for the game in New Zealand and we couldn't be more excited.\"\nNew Zealand sports commentary legend Keith Quinn says he is happy to see some sports return to free-to-air TV, he still believes our national game should not come at a cost to the viewer.\n\"I'd like to think that the All Blacks would always be live for every New Zealander to see all of their significant games like it was in the good old days.\n\"There's a percentage of New Zealanders who don't watch it anymore and that's such a shame, I think that the national game should be seen mostly free to air by all people.\"\nHe said Kiwis hd adopted an interesting attitude in the past three decades toward pay-per-view sport.\n\"There was a reluctance for New Zealanders to agree to pay for Sky Sports but it had rugby on it and rugby was the exception. They must have rugby in their lounge to watch. But a high percentage of New Zealanders didn't want to pay any more to watch.\"\nQuinn said this was evident when Spark Sport obtained the rights to cricket.\n\"Hence, Test cricket have fallen in ratings and I presume that's why they've released it back to free to air.\"\nThe veteran voice of so many iconic kiwi sporting moments, Quinn said he was delighted to see sport return to free television.\n\"It's very pleasing that it's getting better and free to air but everyone is used to rugby having to be paid for so I guess that will stay the same.\"\nQuinn believes fans were badly let down when cricket was lost to a paid streaming service.\n\"For a whole season we had no cricket on the television, so the kids didn't see their cricket heroes.\"\nSports media manager Dave Worsley was concerned about how messy the sports viewing landscape was becoming.\n\"That's where viewers get annoyed. Not being able to watch certain sports they want. A lot of people don't have a TV, they use their laptops, they use their devices, phones. Most of the younger people don't care whether it's free because they get on their devices then they stream it legally or sometimes illegally.\"\nWorsley worried it could be heading towards a similar situation that sports fans face in the United States.\n\"They have six to seven different streams that they get for different sports. Sounds inconvenient but they do it.\"\nProfessional teaching fellow at University of Auckland's communications program Chris McMillan said much had changed in the time since sports were last readily available for free.\n\"There is now a global market that didn't exist before Sky so it absolutely is a different market.\"\nMcMillan said by going behind paywall, sports were shooting themselves in the foot and cutting off participation.\n\"There's definitely a strong argument that New Zealand's an anomaly in not having protections for sports and it becomes a question of whether people who are watching sport are consumers buying a private product or are they citizens who want to participate in the cultural conversation?\"\nHe said sport was a significant part of our national story.\n\"Putting parts of that story behind a paywall, inevitably makes it richer, whiter and older. Are we excluding a lot of people from that conversation? Do we need some sort of legislation to protect the public good and allow sport to be watched by a wider range of New Zealanders? Would that actually improve participation numbers and have feed on effects for for public health as well?\"\n-RNZ",
  "word_count": 947,
  "scraped_at": "2026-02-14T12:28:37.680524"
}