{
  "article_id": "9c982ef91752",
  "url": "https://menafn.com/1105556831/The-Super-Bowl-What-We-Love-But-Mostly-Hate-About-It",
  "title": "The Super Bowl - What We Love But Mostly Hate About It",
  "date": "20230210T203000Z",
  "domain": "menafn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "(MENAFN- The Conversation) This weekend, millions of north american (and worldwide) eyeballs will be glued to their tvs , beer and chicken wings in hand, to celebrate perhaps the last truly bipartisan“national holiday” that America has left: the Super Bowl.\nWhile the Super Bowl is ostensibly a football game for the NFL championship, it is really a combination of sporting event, concert and advertising convention.\nRead more: protests not welcome in the spectacle of sports\nThis year, rihanna will perform at halftime in a much-anticipated return to the stage. And 30 second advertising spots have sold for as much as 7 million apiece.\nRihanna will perform at halftime during the Super Bowl LVII NFL football game. (AP Photo/Mike Stewart) One investment management group estimates the event will bring 700 million dollars to the city of Phoenix, and an estimated $16 billion will be wagered on the game .\nAnd, oh yeah, the Kansas City Chiefs will play the Philadelphia Eagles.\nProfessional sport is primarily a business\nWhile the league may like to promote itself as simply men playing sport for the love of the game, their teammates, and the city they have been drafted or signed to play for, elite and professional sport is first and foremost a business.\nMore specifically, it is a commodity spectacle where athletes put their bodies and brains on the line for our entertainment. They are both workers and product. Dollars and cents come to the league through ticket sales, TV licensing deals, merchandise, advertisement and anything else the league and its organizations can possibly sell.\nWhile we may know elite sport is business, rarely do we ask what the business and profit-making mean for everyone involved in the NFL business ecosystem, from the workers (players) to the capitalists (managers and owners) to the consumers (fans).\nThis is by design. The NFL, like most businesses, does not want its consumers to see how their sausage is made, especially when it involves the amount of violence, exploitation and harm that exists in football.\nKansas City Chiefs fans cheer during the NFL football Super Bowl LVII opening night, Monday, Feb. 6, 2023, in Phoenix. The Kansas City Chiefs will play the Philadelphia Eagles on Sunday. (AP Photo/Matt York) Threat of brain injury\nThe most obvious of these harms is the long-term injury - specifically brain injury - to players. There is continued evidence of football's relationship with traumatic brain injury, dementia, memory loss, depression and premature death.\na 2017 study published by the Journal of the American Medical Association, said 177 of 202 former football players studied of all levels had chronic traumatic encephalopathy (cte) , including 110 of the 111 NFL players studied.\nIn the latest research out of boston university, 345 of the 376 former NFL players studied had (CTE).\nBecause CTE can only be diagnosed post-mortem, these studies contain samples of brains that were donated by concerned families, and therefore are more likely to have CTE. Still, they show rates of 92 per cent for the NFL players studied.\nIn contrast, a 2018 boston university study looked at 164 donated brains of men and women: only one had CTE, and he was a former college football player.\nHouston Texans head coach Lovie Smith observes a moment of silence with Texans and Indianapolis Colts players before their football game in support of Damar Hamlin of the Buffalo Bills who was injured on the field. (AP Photo/Darron Cummings) It is harrowing to imagine how many players - not just in the NFL, but in college and at the high school level - are developing CTE, and suffering irreparable and lifetime damage to their brains and lives.\nFootball is not the only sport where athletes are at risk of lifelong injury (rugby, ice hockey and combat sports are other big culprits), but many football players aren't even able to earn any money for their bodily sacrifice.\nLabour exploitation\nWhile the NFL and the college football industry sell the dream of scholarships and superstardom, only 6.5 per cent of high school students will even play college football. And they do not get paid for their labour. And a miniscule 0.00075 per cent (800-900 out of 1.1 million) will play the game professionally .\nIf players do beat these lottery-level odds and make it to the NFL, football player careers average about three to four years . Many contracts are not guaranteed, with teams able to cut players and not pay them the full amount of their salaries.\nAdd to this the exploitation of a predominantly Black workforce of unpaid players who sacrifice their bodies and brains to fill the coffers of largely white coaches and team owners.\nAs scholars nathan kalman-lamb, derek silva and johanna mellis put it in the guardian,“big-time college sport is often about rich white people using Black people for profit.”\nThe treatment of athletes as mere commodities or investments, to be drafted and traded, used for value and profit extraction and then thrown away, permeates every layer of the NFL.\nSuper Bowl traditions have a strong hold\nThere are other issues too: this is not an exhaustive list of the harms associated with football and the NFL. These are just some of the behind-the-scenes facts and relationships that the NFL does not want fans thinking about, least of all during the Super Bowl.\nKansas City Chiefs defensive tackles Chris Jones (95) and Khalen Saunders (99) talk as players warm up during a football practice in Tempe, Ariz. The Chiefs play against the Philadelphia Eagles in the Super Bowl. (AP Photo/Ross D. Franklin) The Super Bowl - as the culmination of the NFL's season long coverage - is meant to make sure we continue to ignore these issues by providing us with a spectacle to take our minds off the hard questions .\nKarl Marx originally coined religion as the“opiate of the masses,” and sport scholars have long adapted this passage to sport, and specifically to mega-events like the Super Bowl or the Olympic Games.\nBeyond distracting fans from their own personal problems and the unequal world they inhabit, the goal of football's spectacle (from the league's perspective) is also to distract fans from the very harms that the sport itself produces.\nIf you want to keep watching, that's your prerogative. Super Bowl traditions have a strong hold, and the game is often something that brings family and friends together. But at the very least, keep in mind the violence and harm that it takes to get to this game, and remember that there are human beings under those helmets.",
  "word_count": 1095,
  "scraped_at": "2026-02-14T12:39:14.699616"
}