{
  "article_id": "9cb2b5a4060c",
  "url": "https://english.aawsat.com/sports/4540286-rubiales-resignation-should-not-be-end-beginning-movement-says-stanway",
  "title": "Rubiales Resignation Should Not Be End but Beginning of Movement , Says Stanway",
  "date": "20230911T180000Z",
  "domain": "english.aawsat.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The resignation of Spanish football federation chief Luis Rubiales following allegations of giving an unsolicited kiss to Jenni Hermoso should be the start of a movement rather than the end point, England's Georgia Stanway said on Monday.\nRubiales's actions following the Women's World Cup final sparked outrage in Spain and he quit his post on Sunday, saying his position had become untenable even though he continued to defend his version of events.\n\"Everybody's fought and we fought as a women's football group -- we fought as players, we've fought as staff, we've fought as journalists for the outcome to be what it is,\" Stanway told reporters ahead of Bayern Munich's season opener on Friday.\n\"Obviously, the outcome is what we want. But at the same time, we want this to be the start of something, rather than the end of something.\n\"We want to continue to be able to have these conversations, to feel comfortable to have these conversations, feel comfortable in your workplace, to be able to stand up for whatever you think is right.\"\nHermoso received an outpouring of support after the incident from players and government officials.\nLosing finalists England also made a statement in support of Hermoso while their coach Sarina Wiegman dedicated her UEFA Women's Coach of the Year award to the Spain women's team last month even as Rubiales defied calls to quit.\n\"I know as a group of Lionesses and I know as a group at Bayern, we will continue to fight for what we believe is right. Even if people don't join us, we will stand by our own opinion,\" Stanway added.\n\"We have a resolution, but this is only the start of something that could end up being potentially very, very positive for the women's game.\"",
  "word_count": 295,
  "scraped_at": "2026-02-14T13:03:56.972999"
}