{
  "article_id": "9cca8a94f8c4",
  "url": "https://www.asiaone.com/world/spain-down-england-win-womens-world-cup-first-time",
  "title": "Spain down England to win Women World Cup for first time",
  "date": "20230822T053000Z",
  "domain": "asiaone.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SYDNEY — Spanish technique overcame English resilience as La Roja put aside months of turmoil and division to win their first major title with a 1-0 victory over England in a hardfought Women's World Cup final at Stadium Australia on Sunday (Aug 20).\nCaptain Olga Carmona scored the only goal in the first half as Spain, robbed of some of their best talent by a mutiny against coach Jorge Vilda only a few months ago, won the game's biggest prise at only the third attempt.\nAitana Bonmati and Teresa Abelleira ran the match from the Spanish midfield and the margin of victory would have been greater had England goalkeeper Mary Earps not saved a second-half penalty.\n\"It's unbelievable,\" said midfielder Bonmati, who was named player of the tournament.\n\"I have no words, I'm in shock. What we have done is remarkable, we have known how to suffer and enjoy. We have won, we have the little star here. This is the dream of any soccer player. I can't ask for anything more.\"\nVilda became only the second male coach to win a major women's tournament — the World Cup, the Olympics and the Euros — since 2000.\n\"What we did, it's difficult to achieve,\" he said. \"I'm very proud of this team, we have shown we know how to play, that we know how to suffer, we have believed and we are world champions.\"\nEngland's second defeat in 39 matches since Sarina Wiegman took over as coach denied them the chance to add a maiden world title to the European Championship crown they won last year.\n\"It's really hard to take,\" said captain Millie Bright. \"We gave everything... we are absolutely heartbroken but unfortunately we weren't there today.\"\nThe first Women's World Cup final not to feature either the United States or Germany started at quite a pace with England just about enjoying the upper hand in the battle of two first-time finalists.\nForward Lauren Hemp continued where she left off in the semi-final against Australia and screwed the ball towards goal in the fifth minute before clipping a shot off the bar 12 minutes later.\nSpain responded immediately, with Carmona overlapping down the left flank and driving the ball across the goal but teenager Salma Paralluelo was unable to make contact and Alba Redondo's shot from the far post was well saved by Earps.\nSpain took the lead in the 29th minute after England were dispossessed in midfield.\nAbelleira curled a sublime cross-field pass to Mariona Caldentey, who slid the ball forward to Carmona. The left back drove into the area and let fly with an angled shot which flew past the fingertips of Earps and into the far corner of the net.\nThe goal appeared to knock the stuffing out of England and Spain had the better of the rest of the half with Paralluelo pinging a shot off the post just before the break.\nEnglish adaptability\nEngland had shown their adaptability throughout the tournament and Wiegman switched from three to four at the back after the break, while bringing Lauren James on for Alessia Russo up front.\nSpain's game, by contrast, has been unchanging and they continued to drive forward with Caldentey bringing a fine save out of Earps with a shot from the edge of the box in the 50th minute.\nBonmati hit the bar with a long-range effort just after the hour mark and the Spanish appealed vociferously for a handball against Keira Walsh during their next visit to the England box.\nThe award of a penalty looked a formality from the moment referee Tori Penso was instructed by VAR to review the footage but Earps dived low to her left to stop Jennifer Hermoso's spot kick.\nJames had a shot tipped over the bar by goalkeeper Cata Coll in the 75th minute but Spain were not content to sit on their lead and Earps had to be at her best to deny Ona Batlle as the clock hit the 90th minute mark.\nRoared on by the majority England support in the crowd of 75,784, the Lionesses threw all 11 players forward for a corner deep into stoppage time but Coll, playing only her fourth international, came out confidently to gather the ball.\n\"I think everyone has seen an incredible game, very open game, both teams who want to play football,\" said Wiegman, who was also the losing coach when in charge of her native Netherlands in the 2019 World Cup final.\n\"I think we can be so proud of ourselves now, although it doesn't feel like it at the moment.\"\nALSO READ: England reach first World Cup final despite Kerr stunner",
  "word_count": 777,
  "scraped_at": "2026-02-14T13:04:32.127121"
}