{
  "article_id": "9cda462085f9",
  "url": "https://www.ocregister.com/2024/02/16/orange-county-boys-and-girls-track-and-field-preview-mater-deis-brandon-gorski-might-soar-above-the-rest-this-season/",
  "title": "Orange County boys and girls track and field preview : Mater Dei Brandon Gorski might soar above the rest this season – Orange County Register",
  "date": "20240217T014500Z",
  "domain": "ocregister.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "HIGH SCHOOL TRACK AND FIELD PREVIEW\nHow high Mater Dei’s Brandon Gorski will go is anyone’s guess.\nGorski has a guess, and a goal. He is not sharing either.\n“It’s kind of crazy,” he said. “So I’m keeping it to myself.”\nGorski, a junior, was Orange County’s best in the high jump last track and field season. He cleared 6 feet, 9 inches twice last season, at the Trinity League Championships and at the CIF Southern Section Masters Meet.\nGorski grabbed everyone’s attention his freshman year when he successfully jumped 6-8 at the Masters Meet.\nHe also is one of Orange County’s better athletes in the long jump. Gorski was third in the long jump at the CIF-SS Division 2 finals with a mark of 22 feet, 5.25 inches. He also was the Division 2 high jump champion with a clearance of 6-6.\nHe dabbles in the sprints, and might run the 200 occasionally and get involved in Mater Dei’s 4×100 relay team this season.\nGorski is enthusiastic about his potential in the high jump this season because he is healthy.\n“I jumped all of last year with a sprained ankle,” he said. “I had to wrap it before I jumped. It’s a lot better now.”\nThe Orange County record for the high jump is 7-3, established by Sean Lee of Trabuco Hills in 2018.\nHis meet schedule this year is centered around the Arcadia Invitational on April 5-6. It annually is the biggest meet outside of CIF Southern Section and CIF State meets. Gorski finished second there last year with a clearance of 6-7.\n“Arcadia for sure,” Gorski said. “I really want to win Arcadia.”\nThe high jump is Gorski’s No. 1 event but it wasn’t always that way.\n“ I actually was doing the long jump when I first started in track in PAL (Parochial Athletic League),” said Gorski. He was the long jump champion at age 11 at the USA Track and Field Hershey Youth Indoor National Championships in New York in 2017.\nGorski played basketball at Mater Dei as a freshman. He said he might return to basketball his senior year.\nFor certain is that he will continue to compete in the long jump and high jump just about equally, with some sprints action when it feels right.\n“That will only help me in the long run,” Gorski said. “It’ll just make me stronger so that when I do narrow down what I’m doing at Arcadia and then at CIF (Southern Section) and then at state, if I’m doing either one event or two events it’ll feel like nothing.”\nNOTES\n• Another Mater Dei track and field standout is senior sprinter Nate Frazier, who was first in the 100 and 200 at the Orange County Championships last season and posted personal bests of a wind-aided 10:58 in the 100 and a wind-legal 21.62 in the 200. “He’s going to run both springs again this year,” said Mater Dei track and field coach Rick Martinez, “and’s he’s going to be our main guy in the 4×100, too.” …\n• The Orange County Championships meet is April 13 at Mission Viejo High School. …\n• CIF-SS divisional prelims are May 4 at four high school sites, including Trabuco Hills for Division 1 and Yorba Linda for Division 3. CIF-SS finals are May 11 at Moorpark High followed by the CIF-SS Masters Meet at Moorpark on May 18. The CIF State Championships are at Buchanan High in Clovis on May 24-25. …\n• For the second year a 4×800 relay will be in the CIF State meet, so a 4×800 relay will again be part of the CIF-SS Masters Meet.\nGIRLS TRACK & FIELD ATHLETES TO WATCH\n(All times wind-legal)\nHolly Barker, Trabuco Hills, Jr.: She was the Orange County girls cross country athlete of the year this past fall, having finished second in the CIF State Cross Country Championships and first in the Orange County Cross Country Championships.\nHannah Bassett, Mission Viejo, Jr.: Bassett second in the 400 in the CIF Southern Section Division 3 finals and was the 200 champion in the Triton Invitational.\nMelisse Djomby Enyawe, Corona del Mar, Sr.: She was a champion at last fall’s Mt. SAC Cross Country Championships, and last track and field season she was second in the CIF-SS Division 3 1,600 and fourth in the 3,200 at the Arcadia Invitational.\nBrynn Garcia, JSerra, Jr.: Garcia was the 3,200 winner at the Orange County Championships and finished third in that distance at the CIF-SS Division 3 finals.\nAvery Groves, Santa Margarita, Sr.: Groves was second in the CIF-SS Division 3 100 finals and second in the 100 at the Orange County Championships.\nAnnie Ivarsson, Dana Hills. Jr.: She finished second in the CIF-SS Division 2 cross country championships this past fall, and last track and field season Ivarsson was fourth in the CIF-SS Division 2 finals.\nGeorgia Jeanneret, JSerra, Sr.: Jeanneret was the CIF-SS Division 3 champion last year in the 800, finished second in that event at the Arcadia Invitational with a personal-best 2:09.55 and was third in the 1,600 at the Orange County Championships.\nNatalie McCarty, Newport Harbor, So.: McCarty one day might focus on one or two events. Last year she found success in multiple events. She finished fifth in the 400 at the Laguna Beach Trophy Invitational, finished first in dual league meet against Fountain Valley, finished third in 300 hurdles in the CIF-SS Division 3 finals, finished fifth in the high jump in the Division 3 finals and finished first in the long jump in the Surf League Championships.\nMakenzie McRae, Huntington Beach, Sr.: McRae finished first in the 1,600 at last season’s Orange County Championships with a personal-record 4:53.84 and was third in that event in the CIF-SS Division 1 finals.\nBrooke O’Brien, JSerra, Sr.: O’Brien’s ran a personal-record 2:13.94 in the CIF-SS Division 3 1,600 finals to finish second.\nAnne Packard, JSerra, Jr.: Packard was the CIF-SS Division 3 champion in the 1,600, third in the 800 at the CIF-SS Division 3 finals and third in the 400 at the Orange County Championships.\nSophie Polay, JSerra, Jr.: Polay finished second in the 3,200 at the Orange County Championships last season while at Santa Margarita and was third this past cross country season in the Orange County Championships.\nKeaton Robar, Newport Harbor, Jr.: Robar finished fifth in the 800 at the CIF State meet, fifth in the 800 with a personal-record 2:09.13 at the Arcadia Invitational, and had a fine season in cross country this past fall.\nAlexa Sheldon, Edison, Sr.: Sheldon finished fourth in the shot put and fourth in the discus at last year’s CIF-SS Division 2 finals. Her 41 feet, 7.4 inches in the shot put was the county’s best mark in 2023.\nAva Simos, Corona del Mar, Sr.: Simos was the CIF-SS Division 3 champion last season in the 100 with a time of 11.98 and was second in the Division 3 finals 200. She won the 100 and 200 at the Orange County Championships.\nKaylah Tasser, JSerra, So.: Tasser was third in the 3,200 at last season’s Orange County Championships and fourth in the 3,200 in the CIF-SS Division 3 3200 finals.\nMaya Woolforde, JSerra, So.: Her 56.16 in the 400 at the Eagle Invitational was Orange County’s best time in the event last season.\nBOYS TRACK & FIELD ATHLETES TO WATCH\n(All times wind-legal)\nKieran Beckman, Huntington Beach, Sr.: He was eighth in the 300 hurdles at last season’s Arcadia Invitational at 39.35. His 21.70 in the 200 was the county’s fifth-fastest in 2023.\nAyden Breland, Mater Dei, Sr.: Breland’s discus throw of 180 feet, 3 inches was the best among Orange County non-seniors last season.\nDevin Bragg, Los Alamitos, Jr.: Bragg finished fourth in the CIF Southern Section Division 1 finals last year. His 10.48 in the 100 at the CIF-SS Masters Meet was the best time in Orange County in that event last year. His 21.22 in the 200 also led the county in 2023.\nJackson Brownell, San Clemente, Sr.: His 1:55.41 was the eighth-best time in Orange County last year.\nCarter Christie, Villa Park, Sr.: Christie, who was a two-way star for the Spartans football team, had the county’s third-best mark in the long jump last season at 22 feet, 4.5 inches.\nTaj Clark, San Clemente, Sr.: Clark was fourth in the 800 at the CIF State meet at 1:53.41 and was a top contributor for the Tritons’ cross country team that won a CIF championship in the fall.\nRider Cooper, Portola, Sr.: Cooper had Orange County’s best time last season in the 400 with his 48.21 in the Orange County Championships.\nBrett Ephraim, San Clemente, Sr.: Ephraim, ninth in the 1,600 at last year’s CIF-SS Masters Meet, led San Clemente to a CIF-SS cross country championship this past fall.\nIbsan Felix, Beckman, Sr.: Felix finished second in the CIF-SS Division 1 cross country finals this past fall and was second in the 1,600 at last year’s Orange County Championships track and field meet.\nNate Frazier, Mater Dei, Sr.: Frazier, who played running back for Mater Dei’s football team that won the state championship in the fall, is Orange County’s top returning sprinter. His top time in the 100 last season was 10.76, which was second-fastest in Orange County. Frazier also ran a 21.62 in the 200 to win the Orange County Championships.\nDario Garrett, Trabuco Hills, Sr.: Garrett’s 14.99 in the 110 hurdles was the fastest time among non-seniors in country track and field last year.\nBrandon Gorski, Mater Dei, Jr.: His clearance of 6 feet, 9 inches at the Trinity League finals was the best jump in Orange County last season. Gorski also is among the county’s better long jumpers.\nJayden Hernandez, Dana Hills, Sr.: He was a top contributor in the fall for the Dana Hills cross country team that won a CIF championship. Last year at Godinez, he was sixth in the CIF-SS Division 2 1,600 and sixth in the mile at the Arcadia Invitational.\nJayden Hill, Mission Viejo, So.: He was the South Coast League champion in the shot put and discus last year.\nEli Kaltreider, Edison, Sr.: He high-jumped 6 feet, 5 inches at the Arcadia Invitational last season.\nRyan Leunberger, Capistrano Valley, Sr.: His clearance of 15 feet was the second best in the pole vault in Orange County last season.\nZach Lewis, Pacifica, Sr.: Lewis finished sixth in the shot put at the CIF State meet with a throw of 58 feet, 11.5 inches. He was fourth in the discus at the CIF-SS Masters Meet with a personal-record mark of 180 feet, 4 inches.\nDiego Mejia, Godinez, Sr.: Mejia finished second in the 800 at the CIF-SS Division 2 championships with a 1:56.59.\nEvan Noonan, Dana Hills, Jr.: He was the CIF-SS and CIF State cross country champion this school year, and during last track and field season Noonan was a CIF-SS champion in the 1,600 and finished third in the 3,200 at the CIF State meet.\nDheer Patel, Northwood, Sr.: Patel finished sixth in the CIF-SS Division 1 400 finals last year.\nAngel Perez, Capistrano Valley, Sr.: He finished first in his division at the Mt. SAC Cross Country Invitational.\nMason York, Edison, Sr.: York, also an outstanding football player, was the Surf League champion last season in the 200 and finished seventh in that event in the CIF-SS Division 2 finals.",
  "word_count": 1905,
  "scraped_at": "2026-02-14T13:39:11.298684"
}