{
  "article_id": "9ce7c0c02df1",
  "url": "https://www.wwno.org/npr-news/2025-12-16/after-outcry-over-prices-fifa-to-sell-60-tickets-for-the-world-cup-with-a-catch",
  "title": "After outcry over prices , FIFA to sell $60 tickets for the World Cup -- with a catch",
  "date": "20251217T003000Z",
  "domain": "wwno.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA said on Tuesday it plans to sell $60 tickets for each of the 104 games of the 2026 World Cup — an announcement that comes after an outcry over prices for the tournament that will be held next summer across the U.S., Canada and Mexico.\n\"Fans of the national teams that have qualified for the FIFA World Cup 2026 will benefit from a dedicated ticket pricing tier, which has been designed to make following their teams on football's greatest stage more affordable,\" FIFA said in a statement.\nBut these tickets — called \"supporter entry tier tickets\" by FIFA — will only be available to supporters of qualified teams and are limited in quantity.\nOnly 10% of the total number of tickets provided to each qualified team would be available at $60 per game, including the final. Given that each team gets 8% of the available tickets per game, the effective number of tickets available at that price would be only 0.8% of the stadium capacity for that game, or 1.6% for both teams combined.\nBut the actual number of $60 tickets could vary. Each country would determine which of its fans qualify for the cheaper tickets. In the statement, FIFA requested that countries \"ensure that these tickets are specifically allocated to loyal fans who are closely connected to their national teams.\"\nSome fans had called prices 'a betrayal'\nFIFA's announcement comes after many fans reacted with outrage at the prices for the World Cup next year, which range from $140 for a handful of initial round games to as much as $2,735 for the U.S. opening match against Paraguay that will be held in Los Angeles next year.\nPrices for knockout rounds surge even more, with FIFA charging $4,185 for the cheapest ticket for the final that will be held in July next year in New Jersey — and $8,680 for the most expensive seats.\nThat's much higher than previous World Cups. For example, the most expensive ticket for the 2022 final at the last tournament held in Qatar was about $1,600.\nUnlike previous World Cups, FIFA has yet to publish a list of prices, instead adjusting them across different sales windows without an announcement. Fans found out about the price changes after FIFA opened its latest lottery window last week, which allows fans to apply for tickets until Jan. 13.\nAnd many fans were upset. The Football Supporters Europe, a group that represent fans across the region, called ticket prices \"a betrayal to the most dedicated fans.\" On Tuesday, the group said on X it welcomes FIFA's latest announcement, but added it was not enough.\n\"Based on the allocations publicly available, this would mean that at best a few hundred fans per match and team would be lucky enough to take advantage of the 60 USD prices, while the vast majority would still have to pay extortionate prices, way higher than at any tournament before,\" Football Supporters Europe said.\nDemand appears high, however\nFIFA has defended its pricing policy, saying it's adapting to prices in the North American market. It has also consistently responded by saying it's a non-profit organization that steers the majority of its revenues from the World Cup \"to fuel the growth of men's, women's and youth football throughout the 211 FIFA Member Associations.\"\nDespite the outrage over its prices, FIFA is seeing strong demand for next year's World Cup. On Tuesday, FIFA added it had already received 20 million ticket requests during this current sales window, with weeks still to go before the lottery window closes.\nBut for supporters, following a team throughout the tournament could be prohibitively expensive in 2026 — and not only because of high ticket prices.\nThe cost of travel across the three countries has also surged, including hotel prices, making it likely that next year's tournament will be among the most expensive World Cups ever staged for fans.\nCopyright 2025 NPR",
  "word_count": 652,
  "scraped_at": "2026-02-14T12:37:52.403755"
}