{
  "article_id": "9d79601a31a5",
  "url": "https://www.rnz.co.nz/international/pacific-news/585599/fiji-7s-dominate-pacific-sports-headlines-for-the-weekend",
  "title": "Fiji 7s dominate Pacific sports headlines for the weekend",
  "date": "20260131T220000Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Victories in Singapore by the Fiji men's sevens rugby team were the highlights on Saturday, in another busy weekend for Pacific sports teams.\nThe Fijians finished day one of the Singapore Sevens, the third tournament of the 2025/2026 HSBC SVNS Series, with three wins, topping their pool and securing their berth in the semifinals on Sunday evening.\nIn Apia, Samoa, Cook Islands club Tupapa Maraerenga FC proved far too strong for Nukuhetulu FC of Tonga in their OFC Men's Champions League Qualifying match, winning the clash 3-0.\nWith that result Tupapa Maraerenga head into the second round of the qualifiers in the new week as favourites to win the series.\nWhile, across in Port Moresby, Auckland City continued from where they left off in the first round of the new OFC Pro League in Auckland a weekend ago, claiming their fourth win so far with a 2-0 win over local side PNG Hekari FC.\nThe win means Auckland City stay clear at the top of the points table, with 12 points.\nFiji 7s set up meeting with All Blacks 7s\nIn Singapore, the Fiji men's sevens team are the defending champions.\nPlaymaker Terio Velawa told the media after their third pool match win over South Africa that defending the title is something they are focused on, but they were also conscious the competition is tougher than before.\nThe Fijians defeated Great Britain 22-19 in a close win in their opening pool game on Saturday afternoon.\nSpeedster Viwa Naduvalo claimed two tries in that half as Fiji led 12-7 at half-time.\nNaduvalo claimed his hat-trick in the second half before Nacani Boginisoko , who was making his debut, claimed his first try of the series.\nA better performance in their second pool match saw the side defeated Spain 28-7.\nEarly tries from Iowane Teba and George Bose saw the champs lead 14-7 at half-time, after Spain had claimed one of their own.\nVeilawa and Bognisoko also added to the tallies in the second half to seal the win.\nThe third match of the day was tougher than the two previous pool games, with the game going into extra time, after the two sides were tied 19-all at full time.\nWith the new format, teams who end up in a draw have to play sudden death extra spells to decide a winner, where the team that scores the first points wins the match.\nBoginisoko claimed his third try in Singapore when he went through the tiring South African defence to claim the winner.\nSouth Africa had led 14-7 at half-time and 19-14 towards the end of the game, before Fiji levelled terms to force the game into extra time.\nFiji's opponents New Zealand lost their opening pool match 19-12 to France, but they came back strong to beat Argentina 26-20 in their second game and claim a 29-10 victory over Australia to secure their semi-final spot.\nFiji meets New Zealand at 7.52pm, New Zealand time, tonight in the first men's semi-final.\nThe second semi-final will feature South Africa against France, at 8.14pm.\nIn the women's competition, the Fijiana women's team lost two earlier pool matches to Australia and United States of America before beating Japan 34-12 in their final pool game.\nThey lost 35-7 to Australia in their opening pool game and were pipped 17-12 by USA in their second game.\nSemi-finals in the women's competition will see Australia take on Canada while New Zealand will meet USA.\nCook Islands club lead qualifier\nMeanwhile, in Apia, the 3-0 win by Tupapa Maraerenga FC, who also claimed the qualifier series last year, came after the side had taken to the game early and applied the pressure from the opening whistle.\nNukuhetulu, the Tongan local champs, were making their debut at the qualifier and could not hold their own against the Cook Islanders.\nOceania Football Confederation media said Tupapa wasted little time stamping their authority on the match, opening the scoring inside the first ten minutes through Daniel Bunch.\nBunch doubled his record when he struck his team's second goal in the 24th minute.\nNgametua Tukana added the team's third goal before half-time after he pounced on a ball cleared off the line by Nukuhetulu goalkeeper Ge'ofa'aki Aho. Tukana pounced on the rebound, edging the ball over the line to extend the lead to three.\nNukuhetulu showed moments of promise in the second half and tighten their defence, keeping the scoreline at 3-0 until the end of the game.\nIn the earlier game, Samoa's Viavase-Tai FC and American Samoa's Pago Youth FC fought to a 1-1 draw.\nMatches will continue on Tuesday, Pago Youth FC taking on vs Nukuhetulu FC and Tupapa Maraerenga FC batting Vaivase-Tai FC in the second round.\nAuckland's supremacy on show again\nAuckland City continue to be the pace-setter in the new OFC Pro League, with the second round kicking off in Port Moresby on Saturday.\nTwo stoppage time goals, one each by Bailey Ferguson in the 92nd minute, and Emiliano Tade, eight minutes later, gave the side the 2-0 victory.\nThat result broke the hearts of local fans who had come out in large numbers to support Hekari.\nIt also meant that the PNG club remains at the bottom of the points table, heading into the second day of matches on Sunday afternoon.\nOFC media said an expectant crowd was on hand to see the country's first-ever professional football team make their debut but they were treated to a fairly low-key opening half.\nPopular forward Raymond Gunemba was making his first start of the campaign and the veteran wasn't short on energy and endeavour in putting pressure on the Auckland FC backline.\nAuckland's James Bayliss was a threat at the other end and did have the ball in the net, but his attempt was ruled out by the video referee, who picked up the player was offside.\nLiam Gillion, of Auckland FC, told the media post-match it was a tougher clash then they expected because of the weather conditions and they had to dig deep to get the results.\n\"It was hot and it was a tough game today,\" he said.\n\"All the boys worked hard. First time playing in these conditions, for all the boys first time in the islands, first time in PNG as well so it's very tough conditions.\n\"We finally broke them down towards the end.\"\nHumidity was high at the games venue and around Port Moresby.\nPNG Hekari FC goalkeeper Dave Tomare proved to a strong wall in between the posts and kept the City attackers out until the stoppage goals were scored against him.\nSunday's second day of matches will see South Island FC of New Zealand taking on Oceania's club of the century South Melbourne, before Fiji's Bula FC square off against the Solomon Kings FC.\nSign up for Ngā Pitopito Kōrero, a daily newsletter curated by our editors and delivered straight to your inbox every weekday.",
  "word_count": 1155,
  "scraped_at": "2026-02-14T12:51:11.830214"
}