{
  "article_id": "9d817861afd6",
  "url": "https://www.scmp.com/author/luisa-tam",
  "title": "Luisa Tam | South China Morning Post",
  "date": "20230401T010000Z",
  "domain": "scmp.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Luisa Tam has been a journalist for more than 30 years. She has held a variety of roles during her career, including working as a producer for NDR German TV, a media campaigner with Greenpeace, and as the deputy managing editor of Eastern Express. She previously worked at the Post from 1988 to 1990, before rejoining in her current role in 2015.\nLuisa Tam has been a journalist for more than 30 years. She has held a variety of roles during her career, including working as a producer for NDR German TV, a media campaigner with Greenpeace, and as the deputy managing editor of Eastern Express. She previously worked at the Post from 1988 to 1990, before rejoining in her current role in 2015.\nMore people are turning to AI apps for girlfriend or boyfriend stand-ins as the tech behind romantic chatbots improves, but they risk losing the skills vital for real-life communication and dating.\nHong Kong has an identity crisis, and tourism initiatives such as the Night Vibes campaign haven’t worked. Fun events show promise, but what we really need is to pivot to being a ‘de-stress economy’.\nOprah Winfrey’s spiritual relationship transformed her life. We get an expert’s opinion on what makes a relationship spiritual and how it can benefit you and your partner in many ways.\nLike an overstuffed diner who raids the buffet too many times, Hong Kong risks leaving tourists fatigued by overstuffing the calendar with ‘mega events’.\nHong Kong, trying to improve its overseas image, needs to change its stance on diversity and inclusion and bring itself into line with the modern world. This would benefit the city in many ways.\nThe idea of ‘sleep divorce’ hit headlines recently after Cameron Diaz espoused its benefits. Here are the pros and cons of couples sleeping in separate bedrooms, which can even benefit their sex lives.\nWe should welcome a revitalisation of Hong Kong’s Flower Market – but it must be done right. At first glance, plans for its redevelopment don’t preserve its culture or align with the joyful chaos of Mong Kok.\nThe Chubby Hearts art project was started in the UK by designer Anya Hindmarch. The Hong Kong edition drew criticism, but it has brought joy and laughter to the city, and we need more projects like it.\nThere is much to reflect on after the Inter Miami vs Hong Kong Team fiasco, such as how David Beckham could have averted a PR disaster, Hong Kong fans’ behaviour, and what the government can learn.\nA long-standing tradition for Chinese people over Lunar New Year is to give and receive cash in red packets known as lai see in Cantonese. But who should give lai see to whom, and how much money should be handed out?\nChinese people follow a lot of traditions to boost their luck during Lunar New Year. Here’s how to give yours a bump during the Year of the Dragon, from money and colours to clothing and food.\nHong Kong needs new ideas to attract tourists after underwhelming campaigns like ‘Night Vibes’. The success of Harbin, mainland China’s ice capital, offers valuable pointers.\nWith ‘grey divorce’ – divorce among older adults – on the up, we asked an expert why this is occurring and how couples can salvage a long-standing emotional partnership when things aren’t right.\nBy combining history, technology and entertainment, ‘time travel’ tourism could rejuvenate Hong Kong’s travel industry by attracting a range of visitors seeking unique and immersive experiences.\nLuisa Tam reflects on what working at the South China Morning Post was like pre-internet and hitting the journalism jackpot as the newspaper celebrates its 120th anniversary.\nThe government needs to adopt a more comprehensive approach that goes far beyond the promised US$2,500 cash handout to new parents if it wants to truly foster a baby boom in Hong Kong.\nDiscovering your partner has been unfaithful can be devastating, and it’s hard to know what to do. Relationship expert Valentina Tudose offers tips to protect your emotional health and well-being.\nForeign talent enhances Hong Kong’s competitiveness and expatriates enrich the social fabric and contribute to a more cosmopolitan environment – all crucial to us maintaining our international status.\nWith Hugh Jackman’s marriage to his wife of 27 years ending, a relationship expert explains the factors that contribute to the success of a long-term partnership.\nHong Kong’s new ‘Night Vibes Hong Kong’ campaign should focus on revitalising places like the Temple Street Night Market and Ladies’ Market if it is to attract locals and tourists alike.\nDonnie Yen’s stand-out appearance in John Wick: Chapter 4 is an excellent opportunity to raise Hong Kong’s global prominence, and the city’s government must step up to take it.\nForget ‘Hello Hong Kong’, we risk being labelled ‘Heartless Hong Kong’ after the recent street hawker case, which really isn’t fair to our mostly hospitable and welcoming people.",
  "word_count": 813,
  "scraped_at": "2026-02-14T12:24:28.446329"
}