{
  "article_id": "9dc480a8eb8a",
  "url": "https://www.afl.com.au/aflw/news/1410406",
  "title": "Why Kirby Bentley has been likened to Erin Phillips",
  "date": "20250905T080000Z",
  "domain": "afl.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "IN SPORT, we've all had that teammate who makes you walk a bit taller, allows you to hold your head higher, who fills you with confidence just knowing that they're on your team.\nKirby Bentley is one of those people, with former teammate Chelsea Randall likening Bentley’s on-field impact to that of AFL Hall of Famer Erin Phillips.\nRandall and Bentley are originally from Western Australia and crossed paths throughout their early playing careers.\nThey were opponents and then teammates in the WAFLW, went on to represent their state at the national championships, and were both selected to play for Melbourne in the inaugural women's exhibition series.\n\"I'll explain it like this,\" says Randall.\n\"When I took the field with Erin Phillips, I knew Erin was on my team and we were going to have a good day. I knew that she was going to give 110 per cent and that I'd come along for the journey.\n\"It was the same if 'Kirbs' (Bentley) was on my team. It was like, we've got Kirbs, I've got 110 per cent trust in she's just going to do everything she can today and I'm going to come along for the ride and let's have some fun with it.\"\nBentley was part of the pioneering cohort who experienced women's football transition from a hobby to a profession.\nThe Noongar Yamatji woman was one of the best footballers in Western Australia throughout the 2010s after transitioning from elite-level netball to football, in order to be closer to her sister.\n\"I grew up in Mount Barker, which is a country town down south in WA,\" said Bentley.\n\"And as a country kid in the '90s, I wanted to play football. I wanted to play football with the Eagles. So, the Matera brothers, Ben Cousins.\n\"I loved the fact that I could tackle people, you know, be creative with the way that I played.\n\"I was playing National League netball from the age of 16 to 24. My middle sister was playing football and I wanted to get to know her and who she was. I went down just to train, just to build that relationship with her.\"\nBut it wasn't long before Bentley rose through the ranks, her natural ability standing out among others. Bentley was selected to represent Western Australia, she was part of the AFL's first ever women's Academy, and went on to be selected for Melbourne in the exhibition series against the Western Bulldogs.\nBentley rode the wave of women's football as its popularity grew, alongside fellow trailblazers like Daisy Pearce, Lauren Arnell, Darcy Vescio and Katie Brennan.\n\"They convinced me to play the first game and then that turned into All-Australian, and then turned into a state, and then obviously representing Melbourne in the inaugural football games,\" Bentley explained.\n\"To be a part of that pathway and that journey is huge for women in general. To play alongside and against some of the most talented footballers and genuine footballers at that time was incredible because we were starting to create a shift in the way that society and people were seeing women in the AFL.\"\n\"To be able to put on an AFL club's football jumper and represent that club alongside the most talented footballers in the country at that time, I think it was a great starting point. I don't think we realised the impact that we were going to have on the game and the direction it was going to take.\"\nAt Bentley's peak, she was unstoppable. A pure joy to watch. Exciting, creative and classy.\n\"You just never knew what she was going to do. I swear she sold that much candy to me. She was a player that had so much time with ball in hand.\" Randall recalled.\n\"In a time when women's footy was a little bit chaotic, she brought this calmness and this composure to the game that was years beyond where women's footy was at the time.\"\nIn 2011 Bentley was awarded the Debbie Lee Medal for the best player at the National Championships ahead of Daisy Pearce, Paxy Paxman, Lauren Arnell and Aasta O'Connor. Bentley was also named best on ground for Western Australia in the Grand Final.\nIt was no surprise that when the AFLW competition began in 2017, Bentley was chosen as a priority pick for Fremantle and made the All-Australian Squad in her first season.\nSadly, injury struck Bentley down in her prime. A knee injury sustained representing the Allies in the AFLW State of Origin game ruled her out of the 2018 season.\nAt the end of 2018, Bentley was delisted by Fremantle before being given another chance as a free agent at Carlton, but the then 32-year-old only managed three further games in the navy blue.\n\"There's an ounce of sadness from my end cause I just feel like she never got a real go with her body,\" Randall said.\n\"Like the timing of her prime footy never got to be on display for the world to see, which was really hard because she was someone I looked up to and I was just in awe of her all the time. She just unfortunately never got to show, you know, how bloody amazing she really is.\"\nThis year, Bentley has been named as the AFLW Indigenous Round Honouree, an accolade only fitting for someone who helped grow the game to where it is today.\nBentley has been particularly pivotal in growing girls' football in Western Australia, where a tournament for Indigenous girls aged 13-15 years of age is known as the Kirby Bentley Cup, an event that still takes place.\nWorking with young Indigenous people has always been a passion of Bentley's.\n\"To some of our young Indigenous girls that were coming through, she kept telling them that they were incredible and talented. Trying to give them some belief to keep showing up,\" said Randall.\n\"Because she knew the power of sport could give opportunities to everyone, but in particular those that maybe needed the extra opportunities as well. She really understood the power of sport and how that could help change someone's life.\"\nRandall also recalls Bentley always sharing and educating others, including her teammates, on her Indigenous culture.\n\"I think back to the days when I was playing at Swan Districts footy club and my knowledge and education and awareness of Aboriginal people and their history … I was very naive, I just feel like I didn't know a lot at all.\n\"And it was thanks to Kirby and some of the other players that I played with who were just happy to have the conversations with me. They were happy to help educate me and my understanding and just different cultural aspects and help me understand so that I could celebrate with them or enjoy different moments.\n\"Those impacts, those hallway conversations, the power of just being able to talk to non-Indigenous people and Indigenous people, it was so powerful, for me individually, but for obviously the community that she had an impact on as well.\"\nWhen told of Bentley's honour during this year's AFLW Indigenous Round, Randall said she couldn't be prouder of her former teammate.\n\"Incredibly proud. I mean, it just doesn't surprise me whatsoever because of all the work that she does in all the different roles that she's held in terms of coaching and across her journey,\" Randall said.\n\"But from the very early days, she hasn't changed to the person that she is, she's remained true to herself, and to her family. So I'm just very proud of the person that she's become and I'm forever grateful that footy brought our lives together.\n\"I'm sure every other person that's met Kirby feels exactly the same way. She's an incredible role model for so many people and I couldn't be prouder of her.\"",
  "word_count": 1312,
  "scraped_at": "2026-02-14T12:58:28.846422"
}