{
  "article_id": "9dd0d5adf4d4",
  "url": "https://news.yahoo.com/kc-current-interim-coach-caroline-103000843.html",
  "title": "KC Current interim coach Caroline Sjöblom eyes culture shift , mental reset and permanent job",
  "date": "20230528T110000Z",
  "domain": "news.yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "KC Current interim coach Caroline Sjöblom eyes culture shift, mental reset and permanent job\nCaroline Sjöblom comes from the island of Aland, where the abiding language and culture is Swedish despite formally being part of Finland. (Long story.)\nSome 30,000 people live in what she calls the “paradise of the Baltics,” demilitarized land a two-hour ferry ride to Stockholm. The daughter of a sea captain and teacher-archaeologist grew up “close to nature,” as she put it, including learning to play soccer in the backyard where apple trees served as goalposts.\nIsolated as it might sound, Aland nonetheless was a place where she came to apprehend five languages and could play professional soccer even before going to college in Stockholm to study behavioral science.\nAnd with the encouragement of her parents on this autonomous land, she also could envision something boundless about the broader world — which she explored through such adventures as backpacking through South America and living in Spain.\nThat background helps explain why Sjöblom seldom gets stressed out, she’ll tell you, and much of why she thinks in terms of “no limits” and “you can do whatever you want in life.”\nIt all helps explain how this woman of dignified intensity somehow came to be in Kansas City in the first place, connected from a world away by an agent and intrigued by the phenomenon of the Kansas City Current’s investment in the game.\nAnd it testifies to how she so nimbly and admirably handled the chaotic twist that abruptly left her the interim coach of the Current when Matt Potter was fired in early May for what was described by general manager Camille Ashton as a “lack of collaboration and partnership.”\nMere hours after players were let in on the startling change in Houston, Sjöblom steered the Current to a 2-0 win — their first of three straight wins after opening the 2023 with three straight losses.\n“It was like a roller coaster,” she said. “But at the same time, I was kind of calm in the storm.”\nWith ample reason: Among her considerable credentials, Sjöblom previously was the head coach of Sweden’s U19 national team in 2020 and served as an analyst for the country’s silver-medal senior Olympic team in Tokyo.\n“Everything I do,” she said, “I have been preparing my whole career for (this) moment.”\nAs a result, Sjöblom now essentially is auditioning for the Current’s permanent coaching job — a role that has proven an elusive fit for a pioneering organization that otherwise has seized imaginations globally.\nKC Current organization remains ‘one step ahead’\nEnter the Current’s state-of-the-art practice facility and headquarters in Riverside and head upstairs to the administrative offices. On the wall, you’ll see what might be called a motto:\nSOMEWHERE OUT THERE,\nTHERE’S A FAN\nWHO’S HERE FOR THEIR FIRST TIME,\nTHEIR LAST TIME,\nOR THEIR ONLY TIME.\nThe final words, painted in the team’s teal scheme: I OWE THAT FAN MY BEST.\nMove on within and you can sense that standard come to life.\nIn an open bullpen room on Thursday, dozens and dozens of staff members were engaged in the business of marketing, partnerships, community relations, content production, legal work, sales and communications.\nBut the marquee element of it all is on the lower level in an operation where players enjoy top-notch resources, a notion that remains a revelation after women have been denied such amenities for so long.\nWhen I heard some dozen or so players laughing that morning from a dining room where chefs prepare their meals, it struck me how that place of their own in itself was a sea change amid so many other aspects of what’s happening here.\nEven as the $19 million site that opened last year remains unrivaled in the world of women’s professional soccer, and certainly rare in professional women’s sports anywhere, the Current are geometrically amplifying its endeavor:\nTheir privately financed, 11,500-seat, approximately $117-million ultramodern stadium being built on the Missouri River at the Berkley Riverfront is taking more tangible form by the day toward its scheduled opening next year.\nCo-founders Angie and Chris Long and Brittany Mahomes, now joined in the investment by husband Patrick, are driving an operation that National Women’s Soccer League president Jessica Berman says is not just a moment but a movement — one that reflects the best of a progressive Kansas City and will become all the more prominent as we become a 2026 World Cup host.\n“We are one step ahead of everyone else,” Sjöblom said, “and it’s fantastic to be on that journey.”\nWhat’s needed to ‘build a culture’ in Kansas City\nWith all the momentous stuff bubbling, the results on the pitch might appear almost secondary for a team that struggled mightily its first season, improbably went to the NWSL title game a year ago and had won just three of its first 10 outings in all competitions this year entering its game against Houston on Friday at Children’s Mercy Park.\nThe season took another exasperating step against the Dash, who beat the Current 2-0 for the club’s fifth straight loss since those first three wins under Sjöblom.\nBut the urgency to win no doubt is paramount from the inside looking out — particularly when it comes to Sjöblom, the third coach in three seasons, and staff and the players assembled.\nThat’s why early last week she watched the last of four straight losses four separate times through what she called “different glasses.”\n“Trying to understand,” she said.\nAnd it’s why the coach who considers herself demanding also spent the week candidly but tactfully stressing she believed effort had been an issue, albeit meaning a more nuanced psychological version of it than simple laziness.\nThe recent debilitating pattern of the team sagging after giving up goals or missing opportunities, she said, reflects a mindset to be changed. Those moments, she believes, should galvanize the team instead of making it drift.\nTo her, effort is about such points as the will to have resilience and come together under duress and to fend off fatigue and make disciplined decisions ... with room for the courage to make mistakes.\n“To dare to do things,” she said. “You don’t want to hide on the pitch.”\nSo she repeatedly sought to get the point across with specifics during meetings and in practice on Thursday, when she felt the need to raise her voice more — subtly enough, it should be noted. At one point, she gestured to her head and called out, “It’s all about inside here.”\nThat concept is perhaps what she most believes she can infuse in this team even beyond what a sports psychologist might provide. Through her background in Sweden, she has conviction that the game is some 70% mental — a factor she finds undervalued here.\n“When you get the pressure against you,” she said, “you need to be able to solve it inside with your brain.”\nShe also aims to be able to solve this in collaboration with a dynamic technical staff featuring assistant coaches Lucas Rodriguez and Lloyd Yaxley, lead analyst Donna Newberry and high performance director Ben Donachie — a group with a wealth of different soccer backgrounds and quite observable chemistry and camaraderie among them.\n“And, for me, I think, I just bring some togetherness,” she said. “I’m a diplomatic person. I want everyone to feel good in a room.”\nIn the weeks to come, she’ll have a chance to demonstrate that it’s a winning formula on the pitch for a struggling club that’s winning about everywhere else.\n“I truly believe our leadership style can improve this club,” she said. “But that needs a preseason. It needs more time. It takes time to build a culture. … It takes time to build an empire.”",
  "word_count": 1297,
  "scraped_at": "2026-02-14T12:14:57.179510"
}