{
  "article_id": "9ddd450cfe69",
  "url": "https://www.justarsenal.com/arsenals-dantino-on-foord-catley-australia-being-the-dark-horse-of-the-womens-world-cup-2023/344245",
  "title": "Arsenal DAntino on Foord , Catley & Australia being the  dark horse  of the Women World Cup 2023",
  "date": "20230715T141500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal’s D’Antino on Foord, Catley & Australia being the “dark horse” of the Women’s World Cup 2023 by Michelle\nAs the assistant coach at Arsenal, Aaron D’Antino possesses an in-depth understanding of Arsenal’s Australlian duo Caitlin Foord and Steph Catley. In an article in KEEPUP, the Australian coach provides valuable insights into these two prominent Matilda’s stars who are playing pivotal roles in spearheading their country’s World Cup campaign, where the Matildas will face the Republic of Ireland, Nigeria and Canada in Group B.\nWatch Arsenal players in action at Women’s World Cup 2023 FREE in UK – full schedule\nWhile all attention is understandably directed towards the superstar captain of the Matildas, Sam Kerr, it is essential not to overlook another exceptional Australian talent. Caitlin Foord, who made her debut as a 16-year-old full-back twelve years ago, and is now poised to participate in her fourth World Cup. Stepping out from Chelsea’s top goal-scorer Kerr’s shadow, Foord could well establish herself as a dominant force during the 2023 tournament.\nHaving progressed through the A-Leagues, Caitlin Foord enters the World Cup following a very productive 2022-23 season with Arsenal Women, having found the back of the net 12 times across all competitions.\n“I think she hit the ground running for us. I’m talking her original entry into the WSL,” D’Antino said. “Particularly if you look at her in comparison to Sam Kerr. I think it took Sam a little bit to get going.\n“I think it shows Caitlin’s consistency over the past couple of seasons. She has just gone from strength to strength. Understanding her strengths as a player and really wanting to, selfishly, bring the best out of herself more often than not. It’s been a really big part of her growth.\n“She has that Aussie mindset in terms of wanting to work incredibly hard for the team and she will do whatever the team needs. But it’s also going, well you’re one of the best players on the pitch, why can’t we use you as a threat more often than not?\n“She is just phenomenal. She is incredibly reliable on the ball.”\n“Once she gets going and she is facing goal… everyone knows she loves to cut in from the left onto her right foot. Being able to get the best out of her, that’s going to be an interesting part.\n“Obviously Australia are tinkering with how they play her. Playing her more central sometimes as opposed to out wide. That just opens up a whole new world with how you defend Caitlin Foord.\n“And if you have Steph (Catley) supplying her. That’s a huge part for us in terms of their partnership. That goes years beyond us. It’s almost telepathic, they know what they need from each other before it even happens.\n“It will be really interesting to see how the Matildas use her. It will be similar to (Arsenal star and Ireland captain) Katie McCabe. They will chop and change her position to get the absolute best out of her, particularly when you talk about playing off Sam Kerr.”\nCatley is another Arsenal superstar in the Matildas’ Women’s World Cup squad and like Foord, this experienced defender signed a new contract with the club irecently.\n“I have to say Steph is one of the most intelligent footballers I’ve ever worked with and equally technically proficient. So reliable with the ball but that’s because of her understanding of the game.\n“No matter where you put her on the pitch, you almost know you’re going to get a 9.5/10 performance from her every time she plays.\n“We’ve been trying to work with her to try to be more of an attacking threat. That’s not necessarily about her joining the attack, it’s also the areas she’s putting the ball into the box because she has such a high-level quality of cross and a damaging left foot.\n“All of that being said, then there’s the leadership part in terms of her being able to support players around her. She is a positive-mindset person. Nothing is ever too small to do. Constantly trying to find solutions and go out and try it. She is brave enough to do that.\n“She will be one of the best players at the tournament for sure.”\nD’Antino continued: “They’re one of the host nations, so there will be massive expectations but then when you go and look at some of the European teams, I think everyone will be talking about a lot of European nations to be favourites. And that’s outside of the USA and Canada, and Brazil.\n“When I look at all that, I then go well I think the Matildas are a dark horse to win the tournament.\n“Tony (Gustavsson) has done a great job in building more depth into the squad and giving a lot of young players some experience.\n“If you look at the quality they have, the experience they have… previously where they may have struggled is you were probably relying on the same players for almost too long going deeper into tournaments.\n“All of a sudden now they have got some really good depth or some players who have picked up some invaluable experience over the past two years. Hopefully they can come in and be really strong game-changers and impact players to alleviate some of the pressure on the experienced players.\n“In saying all of that, you need to be in a position where you’re performing well and you feel like you have the ability to rotate.\n“You absolutely have the culture and everything you need to win a major tournament. You know they will give absolutely all they have.”\nOnly a few more days until the World Cup kicks off and our football-drought will be over Gooners!\nCOYGW!\nMichelle Maxwell\nFollow Michelle on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 992,
  "scraped_at": "2026-02-14T12:22:08.492266"
}