{
  "article_id": "9de647069d2a",
  "url": "https://menafn.com/1107094642/Barcelona-Are-Ready-To-Step-Up-In-Champions-League-Says-Xavi",
  "title": "Barcelona Are Ready To Step Up In Champions League , Says Xavi",
  "date": "20230919T040000Z",
  "domain": "menafn.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "(MENAFN- Khaleej Times) Published: Tue 19 Sep 2023, 1:06 AM Barcelona must turn good performances into positive results in the Champions League said coach Xavi Hernandez as they prepare to open their Group H campaign at home to Belgian champions Royal Antwerp on Tuesday.\nBarca, who won their 27th La Liga title last season, enjoyed a thumping 5-0 win over Real Betis on Saturday with the club's mix of young talent and experience bolstered by new signings Joao Cancelo, Joao Felix and Ilkay Gundogan.\n\"It's time to take a step forward in the Champions League,\" Xavi told a press conference on Monday. \"The objective is to finish top of the group and be seeded in the knockout phase draw. But it's about deeds, not words.\n\"Last season, the team did well in terms of play but not in terms of results. This year we have to play well and get results,\" he added.\nBarca will also face Shakhtar Donetsk and FC Porto, who meet in the other Group H tie in Hamburg on Tuesday.\nThe Spanish champions have enjoyed a good start to their domestic title defence with four wins and a draw leaving them second in La Liga two points behind Real Madrid.\nThey have won the Champions League five times but the last time was back in 2015 and they face a tough task to return to the top of European football, having failed to get past the group stage last season and dropping into the Europa League.\n\"We start at home, in front of our fans and we are in great form,\" added Xavi, who said the club could not wish for a better temporary venue than the Estadi Olimpic Lluis Companys whilst renovations are carried out on the Camp Nou.\nALSO READ:\nSpain's women players say their national team boycott remains\nGuardiola optimistic about Man City retaining Champions League title\nPremier League: Burnley earn first point in draw at Forest",
  "word_count": 324,
  "scraped_at": "2026-02-14T13:51:00.559718"
}