{
  "article_id": "9e0b743f0bd9",
  "url": "https://www.independent.co.uk/asia/india/kolkata-doctor-rape-protest-arrest-mamata-b2598386.html",
  "title": "Kolkata rape and murder : Doctor father says  she went to serve people  as nationwide protests swell",
  "date": "20240819T133000Z",
  "domain": "independent.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Kolkata rape and murder: Doctor’s father says ‘she went to serve people’ as nationwide protests swell\nProtesting doctors demand transparent investigation, adequate security for medical staff and speedy ratification of a law for protection of healthcare workers.\n- Bookmark\n- CommentsGo to comments\nDoctors in India continue to protest and demand tougher legislation to protect healthcare workers following the rape and murder of a junior doctor in the eastern state of West Bengal.\nThe protests erupted earlier this month after the trainee, 31, was found dead at the state-run RG Kar Medical College and Hospital on 9 August. Her partially naked body with visible marks of abuse was discovered in one of the seminar halls in the emergency building of the hospital by her colleagues. The autopsy report confirmed that she had been sexually assaulted and smothered to death.\nA civil volunteer named Sanjay Roy, associated with the state police, was arrested and the case was taken over by the Central Bureau of Investigation, a federal agency, amid calls for a transparent inquiry.\nBut the victim’s father claimed that more than one person was involved.\n“The place where I sent my daughter to make a living and serve the people not protect her,\" he told NDTV. “It’s very sad.”\n\"It is impossible that only one suspect is involved. There are more suspects at large.”\nThe murder has sparked a strike by doctors, disrupting non-emergency hospital services across the country.\nThey have demanded a transparent investigation into the murder, resignation of hospital officials, adequate security for all medical staff, and speedy ratification of a law for the protection of healthcare workers.\nHundreds and thousands of people, mostly women, have also marched in West Bengal, seeking a reckoning with violence against women.\nThe government has urged doctors to return to duty while it sets up a committee to recommend protection measures for healthcare professionals.\n\"Our cease-work and sit-in will continue till our demands are met,\" said Dr Aniket Mahata, spokesperson for protesting junior doctors at the RG Kar Medical College and Hospital in Kolkata.\nIn the national capital Delhi, protesting doctors carrying \"Justice delayed is justice denied” placards were stopped by police as they tried to set up free outpatient services outside the federal health ministry.\nNearly a million doctors reportedly took part in the strike on Saturday.\nThe Indian Medical Association, the country’s largest union of doctors and medical workers, called on the public to support its “struggle for justice”.\nIt described the junior doctor’s murder a “crime of barbaric scale due to the lack of safe spaces for women”.\n“The strike is in response to a tragedy that has never happened in the history of the medical profession in India. It’s not that we want to do it but the situation demands we set an example that doctors can also take to the streets,” Aviral Mathur, president of the Federation of Resident Doctors Association, told The Independent.\nIn solidarity with the protesting doctors, thousands of supporters of West Bengal’s two biggest football clubs marched in Kolkata on Sunday evening with chants of \"We want justice\". Unprecedented scenes unfolded as supporters of two rival teams protested together despite the derby match being called off due to possible violence at the stadium.\nThe Kolkata police have restricted gatherings of more than five persons around the RG Kar hospital following vandalism in the emergency ward, which housed the crime scene.\nPeaceful midnight protests at the hospital last week were marred by a mob of men who broke through police barricades, entered the campus and went on a rampage.\nPolice have said the crime scene on the third floor was untouched and that 37 people involved in the vandalism were arrested.\nThey have also arrested a second-year college student for allegedly sharing a “provocative social media post” against West Bengal chief minister Mamata Banerjee.\nThe student has been accused of inciting hatred and encouraging people to assassinate the chief minister through her Instagram stories.\nMs Banerjee's administration on Saturday advised medical colleges and hospitals in the state to avoid allotting night duties to women doctors \"as far as possible\".\nAlapan Bandyopadhyay, principal adviser to the chief minister, said a new initiative called night companion will be implemented for the safety of women doctors.\nThere will be separate toilets and restrooms for women doctors along with \"safe zones\" that will remain under blanket surveillance, he added. \"Shifts will be arranged in such a manner that in case of night duties the women doctors can function in pairs.\"\nSandip Ghosh, former principal of the medical college and hospital, was interrogated by the CBI for the fourth consecutive day on Monday.\nHe resigned last week following public outrage over his remark that “it was irresponsible of the girl to go to the seminar hall alone at night”.\nIndia's Supreme Court has taken suo motu cognisance of the rape and murder case and will hear it on Tuesday.\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments",
  "word_count": 836,
  "scraped_at": "2026-02-14T12:09:17.389991"
}