{
  "article_id": "9e287f77cb01",
  "url": "https://www.namibian.com.na/fc-ongos-win-fnb-women-super-league/",
  "title": "FC Ongos win FNB Women Super League",
  "date": "20240430T113000Z",
  "domain": "namibian.com.na",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FC Ongos retained the FNB Women’s Super League title in style after posting two more runaway victories over the weekend.\nOn Saturday they beat Okahandja Football Club 8-1, with their top goal scorer Anna Marie Shikusho bagging half of the goals, while they beat Namib Daughters 6-0 the next day.\nShikusho once again scored four goals, while Thomalina Adams and Memory Ngonda added one each, which ensured that they won the title, even though they still have three matches in hand.\nOngos now lead the log on 55 points from 19 matches and can’t be caught by the chasing pack anymore, with Beauties and Girls & Goals trailing 16 points behind.\nThe battle for second position is, however, heating up with Beauties and Girls & Goals on 39 points each, Khomas Nampol on 36 points, and Unam Bokkies on 34, all in the mix.\nThey all dropped points over the weekend, with Beauties losing 3-2 to Girls & Goals on Saturday, and then being held to a 1-1 draw by Unam Bokkies on Sunday.\nKhomas Nampol, meanwhile, beat Girls & Goals 1-0 on Sunday, but dropped points in a 1-1 draw against Unam Bokkies on Friday.\nIn other results, Ramblers beat Nust Babes 4-1, V Power Angels beat Namib Daughters 1-0, Arrows Ladies beat Ongwediva Queens1-0, Ramblers beat Arrows Ladies 4-2, Okahandja FC beat V Power Angels 3-2, and Nust Babes beat Ongwediva Queens 2-1.\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 339,
  "scraped_at": "2026-02-14T12:41:53.685554"
}