{
  "article_id": "9e2c007adb56",
  "url": "https://www.fortmorgantimes.com/2024/09/14/it-takes-a-family-northern-colorado-athletics-hall-of-fame-adds-six-new-members/",
  "title": "  It takes a family : Northern Colorado Athletics Hall of Fame adds six new members",
  "date": "20240914T133000Z",
  "domain": "fortmorgantimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mariel Gutierrez, one of the best female athletes to come through the University of Northern Colorado, and five other former UNC coaches and athletes were inducted into the athletics Hall of Fame Friday evening in Greeley.\nThe inductees distinguished themselves as the 30th anniversary class into the now 160-person Hall of Fame, which includes “all-time greats of UNC,” as master of ceremonies Tom Barbour said.\nGutierrez, 27, earned her place in the Hall of Fame as a soccer player for the Bears from 2015-18. She was honored on a night when the university also remembered Rosemary Fri, one of those all-time greats and a pioneering figure in UNC athletics following her death last month.\nFri was at UNC from 1959 to 2004 as a student, coach, instructor and administrator. Years before the implementation of Title IX — the sweeping federal legislation that, among other things, created equality in college athletics — Fri started the women’s tennis and volleyball programs.\nFri died Aug. 11 at age 91. She was remembered during the approximately one-hour long ceremony in front of about 220 people in a University Center ballroom at UNC.\n“It’s hard to sum up her impact,” Barbour said. “She was a visionary of what a modern athletic department should look like. Rosemary, you will be greatly missed.”\nThe 2024 class also included two Greeley natives in Tom Runnells, who played baseball at UNC from 1974 to 77 before playing and managing in Major League Baseball, and Tad Boyle, who coached the Bears’ men’s basketball team to an incredible turnaround during its transition to Division I from 2006 to 2010.\nRunnells was a standout athlete at Greeley West and had a 41-year career in professional baseball. Boyle starred at Greeley Central before playing at Kansas and has made his name nationally as the men’s coach at Colorado since leaving UNC.\nFormer women’s basketball coach Jaime White, a contemporary of Boyle’s in the early 2000s, was also inducted along with football player Jed Roberts and women’s basketball player Savannah Smith.\nAaron Smith, former UNC and NFL defensive lineman and two-time Super Bowl champion with the Pittsburgh Steelers, was also scheduled to be inducted with the class on Friday evening. Smith was not able to attend the ceremony because of a family emergency. Barbour said Smith’s daughter was injured during a high school soccer game last week.\nAll of the inductees were scheduled to be honored during UNC’s first home football game Saturday afternoon at Nottingham Field. UNC also planned to retire Smith’s No. 91 jersey during the game.\nAssistant athletics director for strategic communications Michael High said Friday afternoon the next opportunity for Smith to be inducted would be in 2026. The Hall of Fame inductions are held every two years. High said Smith may try to return sooner for the jersey ceremony, but no date has been established.\nJordan Davis, the UNC men’s basketball all-time leading scorer, was also elected to the hall of fame this year. Davis deferred his induction to 2026 because he’s currently playing in Spain.\nGutierrez, like Savannah Smith, was one of the most decorated athletes in her sport. Both women contributed to teams that qualified for NCAA Tournaments during their years on campus.\nGutierrez scored 36 goals, which ranks fourth all-time, and she’s seventh with 15 assists. She ranks first in game-winning goals (14), shots (220) and shots on goal (113) in the program’s Division I era.\nGutierrez in 2018 was the Big Sky Conference offensive most valuable player and Golden Boot Award winner for leading the league in goals during conference play.\nShe said the induction was an incredible honor, and she had a hard time wrapping her head around the award and inclusion in the hall. She said the individuals recognized Friday were not solely responsible for their success.\n“It’s not an individual honor,” Gutierrez said. “It’s a team honor. It takes a family to be a part of this,” mentioning athletes, coaches, athletic department staff and others including family members who worked with and supported the new inductees. “It takes a whole group of people and an extended family.”\nGutierrez, 27, came to UNC from Gypsum, where she still lives. She was a finance major at UNC and now works as a valuations consultant. Gutierrez continues to be involved in soccer as a player and a coach, and she’s working on earning a license to be an official.\nGutierrez started playing soccer in elementary school during recess. Her parents, Lety and Guerre Gutierrez, didn’t know their daughter was playing soccer. Gutierrez’s uncle, Jesus Flores, told Lety and Guerre of Mariel’s skill and talent. She began playing competitively the following year.\nGutierrez recognized and thanked her family for their help and support. Her parents attended the ceremony along with her sister, a nephew and niece.\n“They never said no more soccer,” Gutierrez said. “They are the ones who influenced me.”",
  "word_count": 815,
  "scraped_at": "2026-02-14T12:42:05.841456"
}