{
  "article_id": "9e3def4c07ab",
  "url": "https://www.arsenal.com/fixture/women/2026-Jan-10/women-0-0-manchester-united-women-match-report",
  "title": "Women 0 - 0 Manchester United Women - Match Report",
  "date": "20260113T103000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Our first Barclays Women’s Super League match of 2026 ended in a 0-0 draw at home to Manchester United.\nWe were on top for the majority of the game, but there were no goals to separate the sides at Emirates Stadium.\nFIRST HALF\nThe game began with a big save from Anneke Borbe to deny an early opener - Jess Park’s cross was flicked on by Fridolina Rolfo’s’s head and our goalkeeper tipped it onto the crossbar.\nAt the other end, Mariona Caldentey showed good footwork to dribble into the 18-yard box but was leaning back when she went for goal, firing high over the bar on her left foot.\nAlessia Russo’s cross then caused a goalmouth scramble but Olivia Smith couldn’t quite squeeze the ball past Phallon Tullis-Joyce, before Katie McCabe’s cross for Kim Little was hooked into the side netting.\nThere were a couple more chances to take the lead on the brink of half-time when Beth Mead pulled the ball back from the right for Frida Maanum, but her first-time effort was curled over. McCabe’s ball into the box was then touched down by Steph Catley and fires towards goal by Russo, but Tullis-Joyce was equal to it.\nSECOND HALF\nAfter a quiet start to the second half, Stina Blackstenius and Caitlin Foord came on for Maanum and Smith, and it wasn’t long until United were reduced to 10 players due to a second yellow card for Jayde Riviere, who put in a late challenge on Foord after a similarly late one on Smith in the first half.\nThe hunt for an opening goal continued with Little playing the ball out right to Mead, whose cross was flicked goalwards by Blackstenius, but straight at Tullis-Joyce.\nIn the 83rd minute, Smilla Holmberg came on for her debut alongside Victoria Pelova, replacing Fox and Mead respectively.\nFoord went for goal from distance with five minutes of normal time remaining, but the shot was too central to trouble Tullis-Joyce.\nLittle was next to try her luck, her deflected volley flying high and wide from the edge of the area.\nOur next change came in the 89th minute, Lotte Wubben-Moy coming on for Catley.\nRusso then played the ball out wide to Pelova, who went for the bottom right, but Tullis-Joyce wasn't beaten at her near post, and Little then smashed a long-distance strike just past the bottom right corner.\nDespite applying plenty of pressure towards the end of the seven minutes of added time, we were unable to make the breakthrough.\nWHAT’S NEXT\nOur Adobe Women’s FA Cup campaign kicks off against Aston Villa at 2pm on Sunday, January 18 in Borehamwood.\nWe’re then back at Meadow Park for the Subway Women’s League Cup semi-final against Manchester United at 7pm on Wednesday, January 21.\nWSL football returns when we travel to Stamford Bridge to take on Chelsea in a 12.30pm kick-off on Saturday, January 24.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 512,
  "scraped_at": "2026-02-14T12:44:34.085605"
}