{
  "article_id": "9e4173ecc9af",
  "url": "https://www.nytimes.com/athletic/5676563/2024/08/03/uswnt-japan-olympics-result-takeaways-trinity-rodman/",
  "title": "USWNT 1 Japan 0 : Trinity Rodman extra - time goal lifts a tired U . S . team to the Olympic semifinals",
  "date": "20240803T173000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It was far from the most entertaining match of soccer this Olympics has offered — even French-influenced booing rang out every time the U.S. played out of the back. It was forward Trinity Rodman who eventually fought through tired legs and a compact Japan defense to find the back of the net for the U.S. in extra time of a drawn-out quarterfinal match.\nAdvertisement\nEven with the utmost respect and knowledge of Japan, U.S. women’s national team head coach Emma Hayes’ side struggled against their opponent.\nJapan shut down the front three of Rodman, Mallory Swanson and Sophia Smith for much of the game. The trio who had been so dominant in the group stage slowed in the knockout round opener. Could tired legs, forced changes in the midfield and cautionary play be to blame? Sure, but Japan is also a very clinical team, able to cede possession and attack when they can create chances.\n“Minimal changes gives you the better chance to build the creativity, so I will not change anything I’m doing,” Hayes said before the quarterfinal match. But on Saturday the lack of rotation led to the exact opposite of creativity. And still, she waited until the start of extra time to make her first sub: Lynn Williams on for Swanson.\nFor the first time at the Paris Games, the U.S. had to rely heavily on its defensive play until Rodman was able to hit a upper-90 shot to give the U.S. the lead.\nJeff Rueter and Steph Yang break down the quarterfinal match.\nRodman’s extra-time goal keeps USWNT Olympic hopes alive\nComing into the Olympics, Rodman’s role with the USWNT had largely been one of a creator.\nAll three forwards have incredibly dynamic skillsets, each as capable of threatening with a shot as they can pick a savvy pass while dribbling at full speed. With Swanson and Smith the more out-and-out scorers for club and country of the trio, Rodman has selflessly embraced picking the final ball, often a low cross from near the touchline back into the heart of the box for an onrushing attacker to slam home.\nIn these Olympics, however, Rodman has reminded the world that she, too, can bag goals with the best of them. Her first two international goals of the year came in the group stage but against Japan, she again looked more likely to find an assist than score herself. That changed in extra time — albeit with a frustrating first attempt, as a left-footed shot in the 104th minute sailed well over the corner of the bar and ignored a central run by Smith.\nAdvertisement\nTwo minutes later, Rodman tried again. Fans of the United States will be very grateful that she did.\nTRINITY RODMAN TAKE A BOW. 👏\nTHAT IS ABSOLUTELY STUNNING. THE USWNT LEADS IN EXTRA TIME.#ParisOlympics | 📺 USA and Peacock pic.twitter.com/rNlebzAyOo\n— NBC Olympics & Paralympics (@NBCOlympics) August 3, 2024\nThe goal made the 22-year-old winger the youngest USWNT goalscorer in an Olympic knockout match in 20 years. It also made up for what had been a frustrating opening 90 minutes for her, though one could say the same about regulation for almost every member of the starting lineup. One has to worry that Rodman and others will be even more languid in a semifinal with such little rotation and limited rest.\nWhen the going gets tough, a team has to try something new. Hayes is incredibly fortunate to have a third scoring option with Rodman’s quality.\nJeff Rueter\nHayes risked production for chemistry\nAgain, we saw a lack of rotation from Hayes, with a single change only forced through Sam Coffey’s yellow-card suspension. That meant Korbin Albert started deep in midfield.\nThere was a small midfield shuffle, with Lindsey Horan pushing quite high with the forwards and withdrawing Rose Lavelle for large periods in each half. You could see they wanted to try to keep some lanes open with an extra attacker to occupy the five Japan kept in the back, but players either weren’t linking up on the final couple of passes or weren’t making the runs into the right spaces.\nErrors can happen if you’re nervous, and sometimes everyone is just weirdly off in their timing. But they can also occur from tired legs. Watching Swanson and Smith counter in the 25th minute without Horan or Rodman matching them to make a far post run, tired legs seemed the more likely culprit. It was the same a few minutes later as Smith darted at the goal, but instead of crossing, she only skied the ball high and wide.\nJapan added to it occasionally with their transition game, pulling the U.S. up and down the field as they picked their moments to go forward. This has been Japan’s game plan before, frustrating teams for long stretches before trying to press quickly. It hasn’t necessarily served them well all the time; just see their comeback against Brazil, when they only really cranked up the pressure in the back end of the second half, and had to squeak out the win through a penalty and Momoko Tanikawa’s stoppage time wondergoal. But even with their limited entries into the final third, the U.S. was often saved by Japan serving a suboptimal final ball.\nAdvertisement\nWhatever the reasons, it certainly feels like a lack of trust in her bench from Hayes — again, perhaps something to partially lay at the feet of U.S. Soccer for allowing such a short runway in onboarding Hayes, which surely wasn’t conducive to trust-building. Then again, all parties knew the timeline here, and if Hayes wasn’t prepared to walk up to the edge of a cliff at this tournament, then this was always going to be the sleepy result.\nSteph Yang\nWhat caused the lack of production from the U.S. front three?\nThroughout the group stage, few teams had as well-rounded a line anywhere on a field as the United States’ attack. The interplay between Swanson, Smith, and Rodman looked downright seamless through three games. Often under-appreciated was the service this trio enjoyed, both from Lavelle in close proximity and via line-breaking balls from Horan, Coffey and the center backs.\nUnfortunately, injuries and a suspension greatly limited the latter category of player from selection availability against Japan. Coffey and Tierna Davidson have been useful to keep possession moving with their passing acumen. While Albert performed similarly to Coffey’s standard of upfield directionality, Emily Sonnett is not the same kind of passer as Davidson. Most glaring, however, was a complete change in approach from Horan, who was wildly ineffective in the quarterfinal.\nThroughout Hayes’ nascent tenure, Horan has yet to find a natural role in her new coach’s preferred team shape. If these Olympics have made anything clearer, it’s likely that she isn’t going to be the team’s most effective option in a double-pivot, whether partnering with Coffey or Albert. That could open a chance for other midfielders to break into the pool, but does make one wonder how Hayes will get the most out of her captain in the years to come.\nJeff Rueter\nHow will the lack of rotation impact the semifinal?\nThe Olympics are arguably the world’s most famous test of an individual’s perseverance. Given how little rotation there was in both the four games’ starting lineups and the quarterfinal’s tardy substitutions, simply being able to walk in time for Tuesday’s semifinal will be worthy of a medal.\nAdvertisement\nThis tournament has been an absolute trial by fire for Hayes, who only officially took over at the end of May after a full season with Chelsea in the Women’s Super League. No other competition in international football has as limiting of a structure as the Olympics. The 18-player squad cap cuts a coach’s ability to rotate and bring two options who are focused on the same role, while the every-three-days cadence affords little time for rest or training ground modifications. Still, Hayes has put her team in a bind heading into one of the tournament’s marquee matches.\nThere is some good news about the impending semifinal. Coffey will be back from her suspension and, in a moment of turning a curse into a blessing, will return to midfield with the lineup’s freshest legs to anchor the midfield. The United States will face the winner of Canada and Germany. Between beating Canada in both the W Gold Cup and the SheBelieves Cup and the 4-1 group stage thrashing of Germany, neither opponent will be as intimidating of a foe as Japan was in this round.\nThroughout the group stage, three teams stood out in underlying metrics: the United States, Japan, and Spain. The USWNT projects to be the favorite, but we can’t be too confident about that with how tired players looked down the stretch. Emily Fox, Albert, and Rodman all needed trainers’ help in extra time, with Fox exiting late due to a leg injury. Fox has been crucial to the USWNT’s build-up, especially on the right side. The training staff will have its work cut out over the next 72 hours to ensure players are ready to capitalize on a relatively favorable matchup for a game of these stakes.\nJeff Rueter\nWhat’s next?\nThe USWNT faces Germany on Tuesday, August 6 in an Olympic semifinal match at Stade de Lyon. Germany needed extra time and penalty kicks to take down Canada in their quarterfinal match.\nRecommended Reading\n- USWNT seeing Olympic success without Alex Morgan, but her impact extends beyond on-field wins\n- Analyzing the USWNT Olympic roster for Paris 2024\n- Casey Krueger on motherhood, resilience and an Olympic return with the USWNT\n- England Women announce USWNT, Germany friendlies as part of autumn schedule\n- How Lynn Williams got a second chance at the Olympics: ‘If I’m called upon, I will be ready’\n(Top photo: Daniela Porcelli/Getty Images)",
  "word_count": 1642,
  "scraped_at": "2026-02-14T12:17:54.371440"
}