{
  "article_id": "9e67ab0780e8",
  "url": "https://www.teamtalk.com/news/emery-devastated-liverpool-told-massive-deal-elite-aston-villa-star-is-on-arsenal-also-plot-transfer",
  "title": "Emery devastated as Liverpool are told massive deal for elite Aston Villa star is on ; Arsenal also in transfer picture",
  "date": "20240203T153000Z",
  "domain": "teamtalk.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Emery devastated as Liverpool are told massive deal for elite Aston Villa star is on; Arsenal also in transfer picture\nAston Villa boss Unai Emery has reportedly been hit with the worrying news that he will be forced to cash in on prized asset Douglas Luiz this summer – with long-term suitors Arsenal, as well as Liverpool, both poised to embark on a transfer battle.\nThe Brazilian is regarded as one of the best all-round midfielders in the Premier League, having evolved into a huge asset of the Midlands club since a bargain £15m move from Manchester City in summer 2019. That form has earned the 25-year-old 10 caps for Selecao Canarinha, as well as multiple admirers around clubs in the Premier League.\nTo that end, Luiz was the subject of two failed attempts to sign him in summer 2022 by Arsenal, whose final offer worth £25m was rejected by Aston Villa.\nThat decision has certainly looked shrewd in the months that have followed; demand for the game’s top midfielders has seen prices rise exponentially, often coming in for well excess of £100m, while Luiz himself has also earned acclaim for his superb performances in that time.\nAs a result of his excellent form, and amid claims Arsenal tried again to sign Luiz in the most recent summer window, the midfielder – whose partner is Aston Villa Women star Alisha Lehmann – was rewarded with a bumper new deal, keeping him at the club until 2026.\nHowever, a parting of ways now looks on the cards for Villa this summer, who will reluctantly be forced to cash in on their prized asset.\nREAD MORE: Aston Villa set to discuss summer sale of high-profile defender; decision made over loanee’s future\nVilla told they will have to sell Liverpool, Arsenal target Douglas Luiz\nAnd according to a report on Football Insider, Villa chiefs have informed a disappointed Emery that they will now inform Luiz’s suitors that offers for his services will be considered as the club look to balance the books in the wake of FFP limitations and generate funds for their own summer dealings.\nThe report states that Villa will try and fetch as much as £100m from the player’s sale with the midfielder still having two years left on his deal come the summer window and in light of claims that he on the wanted list of some of the country’s top clubs.\nIndeed, long-term suitors Arsenal are expected to launch a fresh summer move for his services. Mikel Arteta’s side will be in the market for new midfielders with Jorginho and Mohamed Elneny both falling out of contract and doubts also emerging over the long-term future of Thomas Partey.\nAs a result, Luiz is one of three midfield targets that Edu and Arteta have reportedly drawn up as possible summer targets.\nHowever, Football Insider that the strongest interest in Luiz is set to come from Liverpool who have also earmarked the Brazilian as a summer target.\nTheir interest in him will also remain irrespective of Jurgen Klopp’s impending departure and the fact that Liverpool will also be on the hunt for a new sporting director.\nLuiz has scored six goals and added three assists so far this season from 32 appearances, having played a major role in Villa’s push for the top four this season.\nHowever, Emery is now preparing for the devastating news that he will likely have to bid his star man a tearful farewell this summer as Villa look to fall on the right side of FFP limitations and having spent significantly under both Emery and his predecessor, Steven Gerrard.\nDON’T MISS: Aston Villa terminate £17m star’s contract, with instant switch to Villarreal agreed",
  "word_count": 618,
  "scraped_at": "2026-02-14T13:01:25.359667"
}