{
  "article_id": "9e896eb96910",
  "url": "https://jamaica-gleaner.com/article/commentary/20251224/elizabeth-morgan-christmas-friction-caricom-tt-versus-rest",
  "title": "Elizabeth Morgan | At Christmas , friction in CARICOM – T & T versus the rest",
  "date": "20251224T091500Z",
  "domain": "jamaica-gleaner.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Elizabeth Morgan | At Christmas, friction in CARICOM – T&T versus the rest\nLoading article...\nWe are in Christmas week, a period that should be about joy, hope, generosity, peace and love. There has been a very strange build up to this Christmas. There has been the lingering pall of the destruction wrought by Hurricane Melissa in western Jamaica; a family death and funeral; and increasingly worrying developments in this hemisphere.\nOver the past few weeks, this column has addressed: living in troubled times (November 21); CARICOM trapped between Venezuela and the USA (December 3); the US National Security Strategy (December 10); and the US and Immigration (December 17). These articles all sought to urge readers to seriously monitor political, social, and economic developments in our region and in the entire hemisphere. There is cause for serious concern.\nT&T DISTANCING ITSELF FROM CARICOM\nNobody is arguing that CARICOM is a perfect organization. It has its issues. As this column has pointed out in several articles, the Revised Treaty of Chaguaramas calls on the members to coordinate foreign policy to the extent practicable. So, Trinidad and Tobago (T&T) does not have to agree with all other CARICOM Members on foreign policy, although that would be desired.\nThe concerns from developments over this weekend arise from statements issued by the Prime Minister of T&T, Kamla Persad-Bissessar. Antigua and Barbuda, and Dominica were placed by the Trump Administration on a partial travel ban list updated with additional countries on December 16. This partial travel ban restricting entry to the USA takes effect on January 1, 2026. Haiti is subject to a full travel ban.\nIt appears that the partial travel ban imposed on Antigua and Barbuda and Dominica is related to these countries’ Citizenship for Investment Programmes. Statements on this matter were released by the CARICOM Bureau, which includes the past, present and future Chairs of the CARICOM Conference, and by the Organization of Eastern Caribbean States (OECS), expressing their unease with the US action, while acknowledging that administration’s right to regulate access to its country.\nPrime Minister Persad-Bissessar distanced her country from the CARICOM statement and advised her countrymen and women not to be openly critical of the USA, which is the primary economic partner of the CARICOM region, as there could be consequences as happened to Antigua and Barbuda and Dominica. She warned that US entry visas could be revoked. Thus, hold your tongue, pen, and keyboard in public spaces.\nIt sounded as though PM Persad-Bissessar was advising her country and the region that the US Trump administration is above criticism and the need to retain visa access to the US is of paramount importance. She accused CARICOM members of supporting a dictator in Venezuela, while “bad mouthing’ the USA, the hand that fed the region.\nEvery founding leader of the Caribbean Community (CARICOM), a grouping of supposedly sovereign/democratic states, could be heard collectively turning over in their graves, including T&T’s Dr. Eric Williams.\nNO CONCERN ABOUT DEVELOPMENTS IN THE USA\nIt seems that PM Persad-Bissessar is not familiar with the US’ history in this hemisphere. It seems that she has no concern about what is happening in the USA on a daily basis, the erosion of democracy, and what has been happening in the south Caribbean Sea, very close to her shores. It seems that for her, the ends justify the means.\nIt seems that she has not read the US National Security Strategy and seen the role accorded to the countries of this hemisphere, including Canada, which under the Trump Corollary, are to become vassals of the USA.\nIt is interesting to note the current involvement of the Trump administration in the recent elections in Honduras. It is also interesting to note that President Trump, on Sunday, appointed Governor of Louisiana, Jeff Landry, as special envoy to Greenland, noting that Governor Landry understands the importance of that territory to the US’ national security. Landry is reported as saying that it will be an honour to serve in this position to make Greenland part of the USA. As you can imagine, this was not well received in Copenhagen, Denmark, a member of the European Union. What will be next? Given the strategic importance of the Arctic, could President Trump be appointing another special envoy to make Canada the US’ 51st state?\nRegarding the operations of the US military in the south Caribbean, international human rights organizations and international lawyers are reporting that, to date, 104 people have been extra judicially executed in 28 US military strikes. It seems that the PM of T&T has no concern about this and, to keep US visas, this should just be ignored. It seems the advice is “see and blind, hear and deaf”. A US visa is worth more than integrity and justice.\nThe T&T PM also seems to have overlooked the tariffs which the Trump administration has imposed on all goods exported to the USA from all CARICOM countries – a 10 per cent baseline tariff and 15 per cent on Guyana and T&T. These tariffs have sidelined the Caribbean Basin Initiative. There has been some relief on certain agricultural exports from the Presidential Order issued on November 14. Some products from T&T, anhydrous ammonia, urea and urea-ammonium nitrate, were returned to zero.\nPM Persad-Bissessar also seems to forget that all of the countries of Latin America and the Caribbean in President Trump’s mind may be linked with the “Third World” countries which he disparages.\nWhen it comes to the visa bans, we wonder how this will affect the FIFA Football World Cup, June-July 2026. Will countries, such as Haiti, which have qualified, be allowed to play, if they have matches in the USA? A response would be welcomed from Mr. Gianni Infantino.\nSo, here we are on Christmas Eve, some of us observing the Christ Mass, and there is friction in the CARICOM camp. It seems the expensive gift that we should all want to receive and keep this Christmas is that treasured US visa, while we overlook unspeakable deeds happening in the waters of this region.\nBest wishes for Christmas.\nElizabeth Morgan is a specialist in international trade policy and international politics. Send feedback to columns@gleanerjm.com",
  "word_count": 1035,
  "scraped_at": "2026-02-14T12:37:21.122017"
}