{
  "article_id": "9ea0a2de0c6c",
  "url": "https://www.bravotv.com/the-daily-dish/heather-gay-bronwyn-newport-tease-rhoslc-season-6-reunion-drama",
  "title": "Heather Teases Someone Walked Off RHOSLC Season 6 Reunion Set",
  "date": "20251209T204500Z",
  "domain": "bravotv.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Heather and Bronwyn Tease RHOSLC Season 6 Reunion: “Someone May or May Not Have Walked Off”\nThe Real Housewives of Salt Lake City's Bronwyn Newport and Heather Gay are opening up about the reunion.\nTired of scrolling? Click here to bump BravoTV.com's latest news to the top of your search results.\nHeather Gay and Bronwyn Newport are no strangers to taping reunions and being in the hot seat, but according to both of the The Real Housewives of Salt Lake City cast members, the RHOSLC Season 6 reunion taping was \"long\" and not easy for everyone involved.\nBoth Heather and Bronwyn appeared on Peacock's Reality Hot Seat on Sunday, Dec. 7, where they teased what's to come. Heather, during the broadcast, opened up about the reunion, which was filmed in NYC on Thursday, Dec. 4.\n\"We filmed the reunion three days ago, which was honestly, like, not a big deal. It was like, 15 hours,\" she explained sarcastically, as seen in the video above. \"Someone may or may not have walked off.\"\nHeather continued, using some football-inspired phrases to describe how she did at the reunion. \"I feel like I executed a few plays. I took a few sacks. I fumbled the ball a bit,\" she said. \"It's like football, man. Every game is a hundred percent on the line, you don't remember the game you played before, you don't remember the game you're gonna play next week. You put it all in focus. So I don't think it gets easier, maybe you develop certain muscles and skill sets, and are less surprised by things. But it still a new game, every time.\"\nRELATED: Heather Gay Reveals She's \"Binge-Watching\" Real Housewives Reunions Before New Career Move\nBronwyn, for her part, noted that she and Heather walked away from the reunion in a good place — but the same can't be said for everyone.\n\"We all take our own hits,\" she added, noting that RHOSLC cast member Meredith Marks was in the hot seat. \"Everyone gets tackled on the field. It was a long day.\"\nAndy Cohen teases the RHOSLC Season 6 reunion\nReunion host Andy Cohen took to his Instagram Story shortly after the reunion filmed, where he remarked on the length of the taping. \"I thought we were going to be done with this reunion by 7,\" he explained. \"It is 10 p.m. We just wrapped.\"\nRELATED: So Many Bravolebs Are Coming Together for Peacock's Reality Hot Seat: How to Watch\nHe also noted that the snowflake holders gave it their all at the reunion. \"You know what, the women of Salt Lake City, they don't do anything, you know, half-assed,\" he added.\nDetails on the RHOSLC Season 6 reunion looks\nThese teases from Heather, Bronwyn, and Andy are just a preview of what is to come from the RHOSLC Season 6 reunion.\nThe reunion looks were also unveiled during the Reality Hot Seat broadcast, showing how Heather, Bronwyn, and their fellow cast members — Lisa Barlow, Mary Cosby, Angie Katsanevas, Meredith Marks, and Whitney Rose — dressed to impress. In a photo from the Greece-inspired reunion set, the snowflake holders can be seen dressed in a variety of jewel and pastel colored gowns, all equipped with some gorgeous draping.\nTake a look at the RHOSLC Season 6 reunion seating chart to see where the women will be sitting for their chat with Andy.",
  "word_count": 565,
  "scraped_at": "2026-02-14T13:43:20.798880"
}