{
  "article_id": "9ea2fa9841d8",
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-12144665/Gladiators-unite-fearsome-fifteen-line-group-photo.html",
  "title": "Gladiators unite ! The fearsome fifteen line up for their FIRST group photo",
  "date": "20230531T164500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gladiators unite! The fearsome sixteen line up for their FIRST group photo as BBC unveil the referees faced with the task of keeping them in check ahead of iconic show's reboot\nIt's the picture every fan of the returning show has been waiting for.\nWith the full cast of the revamped Gladiators finally unveiled, BBC1 have offered a first look at the lycra-clad cast in costume as they prepare to take on a new set of adversaries.\nWhile the skimpy outfits popularised by iconic former cast-members such as Jet, Lightening and Amazon have been ditched, the up-to-date look still draws attention to the fearsome sixteen''s chiselled chests, ripped biceps and sculpted abs.\nAs well as the cast, BBC1 have revealed the all new set of moderators tasked with the unenviable job of keeping them in check - no mean feat if this line-up is anything to go by.\nThe fearsome group includes trained rugby players, accomplished swimmers, sprinters and powerlifters - but Mark Clattenburg will bring years of experience as a Premier League referee to the table when the series gets underway.\nIn with the new: The full cast of the revamped Gladiators (Top row – left to right: Legend, Fire, Bionic, Diamond, Nitro. Second row – left to right: Electro, Giant, Steel, Apollo, Comet. Third row – left to right: Viper, Athena, Fury, Phantom, Bottom – Left to right: Sabre, Dynamite)\nOut with the old: The original cast in 1998 (Back row - left to right: Warrior, Raider, Hunter, Saracen, Trojan. Second row - left to right: Falcon, Rhino, Cobra, Nightshade, Wolf, Panther. Front row - left to right: Amazon, Vogue, Lightning, Jet, Zodiac)\nKeeping them in line: Mark Clattenburg (L) will bring years of experience as a Premier League referee to the table when the series gets underway. He will be joined by Sonia Mkoloma, a former English international netball player (R)\nWatch out: Third and final referee Lee Phillips is a fitness professional, firefighter and athlete who moved to London after completing university to join the fire service\nClattenburg oversaw several big games - including the 2012 Men's Olympics final, the 2012 Carabao Cup final, the 2014 European Super Cup as well as the 2016 FA Cup, Champions League and European Championships Finals.\nHe will be joined by Sonia Mkoloma, a former English international netball player who competed at five Netball World Cups and three Commonwealth Games – making an incredible 123 international test appearances.\nSonia now works as the England Netball Assistant Head coach and will be heading to South Africa for the World Cup later in the year.\nThird and final referee Lee Phillips is a fitness professional, firefighter and athlete who moved to London after completing university to join the fire service.\nHe has competed in the World Police and Firefighter Games in Los Angeles amongst 10,000 athletes and also won gold in the Ultimate Firefighter and CrossFit competitions, making him double World Champion.\nThe newly unveiled group are ready to battle contenders at Sheffield Arena in the most iconic and exciting sports entertainment gameshow, coming to BBC One and iPlayer.\nContestants will face the unenviable task of facing the Gladiators in the ultimate test of speed and strength in a series of brand new games alongside some returning classics, among them fan-favourite The Eliminator.\nHere we take a look at the latest Gladiators and their fitness credentials...\nMore to come: They will take part in the ultimate test of speed and strength in a series of brand new games alongside classics culminating with fan-favourite The Eliminator\nBionic\nWatch out: At a towering 6ft 6in it's somewhat inevitable that Gladiator Matty Campbell, a professional bodybuilder, has been named Bionic\nAt a towering 6ft 6in it's somewhat inevitable that bodybuilder Matty Campbell has been named Bionic.\nAs a child he used to sprint and play football, reaching Academy Level, but a car accident curtailed his professional ambitions. It was his subsequent rehabilitation that led him to finding an alternative outlet in the gym.\nDespite having never previously been a regular visitor to the gym, he found that he had a natural ability and quickly started gaining muscle-mass, leading to his eventual love of bodybuilding,\nHe said: 'Never in a million years did I expect to get the call to be a Gladiator, it's a feeling that’ll never sink in. I’m just a normal lad from Teesside! A\n'll the training and hard work has finally paid off for me, I can’t wait to get started!'\nElectro\nUnstoppable: Jade Packer, aka Electro, is a quick, unstoppable and the perfect mix of strength, speed and skill\nMulti-talented: Currently working as a sports model, fitness coach and hybrid athlete, she began her journey as a sprinter\nJade Packer, aka Electro, is a quick, unstoppable and the perfect mix of strength, speed and skill.\nCurrently working as a sports model, fitness coach and hybrid athlete, she began her journey as a sprinter.\nHer speed led to her being ranked amongst the Top 10 Fastest Runners in the UK aged 12 for 150m and she went onto to race for titles at various championships over the 100m and 200m.\nHer bodybuilding journey began at the age of 18 after she discovered the sport on social media platform Instagram, and her subsequent dedication to training won her 4 x Top 3 UKBFF Placings in the Wellness Category, an invite to compete at the Arnold Classic and an IFBB Elite Pro Card by taking Gold at the English Grand Prix.\nAfter training for only a year before her first show, she became an instant sensation and went on to represent the UK in both Barcelona and Madrid throughout her 2 seasons.\nNow training in CrossFit, with a unique hybrid-style that incorporates her athletic background, she still describes running as 'her forte.'\nShe said: 'I hope Electro can spark an unstoppable pursuit for a new generation of athletes. I’m ready to light up the arena with a different kind of energy.'\nPhantom\nUnstoppable: Toby Olubi, aka Phantom, was part of the Team GB Bobsleigh team and competed in the 2018 PyeongChang Winter Olympics\nCan't wait: 'We will be given the biggest entertainment platform to represent that ethos and I couldn’t be more proud and grateful to be a Gladiator…. Let the show begin!!'\nToby Olubi, aka Phantom, was part of the Team GB Bobsleigh team and competed in the 2018 PyeongChang Winter Olympics.\nIn the same season, he and his team broke the world record for the fastest ever bobsleigh at 97 mph. They also made history by bringing home Great Britain's first-ever gold medal in the 2018 Whistler World Cup.\nHe has also been a sprinter a domestic level and has won the county championship for the UK men's 60m sprints and has frequently competed in the British men's 100m sprint Olympic qualifying championships.\nAdditionally, the fitness nut has also won the title of fastest Bobsledder in the UK push championships for four consecutive years from 2015 to 2019.\nHe said: 'This is a dream come true for me. I’m a 90’s kid so the Gladiators of past were my version of real life superheroes. Now I’ve got the chance to don the big “G” and be an inspirational figure myself.\n'Gladiators is all about stepping up against the odds and bringing the best version of yourself.\n'We will be given the biggest entertainment platform to represent that ethos and I couldn’t be more proud and grateful to be a Gladiator…. Let the show begin!!'\nViper\nCommitted: For the past 15 years, Quang Luong, aka Viper, has dedicated his life to fitness, spending each day perfecting the art of bodybuilding\nFor the past 15 years, Quang Luong, aka Viper, has dedicated his life to fitness, spending each day perfecting the art of bodybuilding.\nA fitness model and practicing boxer, he’s often been cast in films in powerful roles, even appearing in a James Bond film as a gangster. Alongside his power and precision he’s looking to devour his competitors.\nHe said: 'I was born to be a Gladiator. I am strong, powerful and just like a Viper I can attack with speed.'\nAthena\nGetting involved: A combination of brain, brawn and beauty, Karenjeet Kaur Bains gets her Gladiators moniker from the Ancient Greek Goddess of War and Wisdom, Athena\nSuccess: Representing Team GB, she is a winner of three Gold and two Silver Commonwealth Powerlifting medals\nWell done: She's also the five time All England Powerlifting Champion and five time British Powerlifting Champion\nA combination of brain, brawn and beauty, Karenjeet Kaur Bains gets her moniker from the Ancient Greek Goddess of War and Wisdom, Athena.\nRepresenting Team GB, she is a winner of three Gold and two Silver Commonwealth Powerlifting medals.\nShe's also the five time All England Powerlifting Champion and five time British Powerlifting Champion and represented Great Britain at the World and European Championships.\nAdditionally, she holds the Guinness World Record for the “Most Bodyweight Squats in a minute”… oh, and did we mention she's also a Chartered Accountant!\nVery proud of her South Asian heritage, she makes show history as the first Sikh Gladiator and wants to inspire people of all ethnic backgrounds to achieve their full potential.\nShe said: 'I represent all those from diverse and minority backgrounds, especially women, that have ever been denied the opportunity to pursue their dreams in sport.\n'I hope I can be a role model and show the levels a female can achieve, if she is given the opportunity to follow her passion and given the wings to fly!'\nComet\nMy turn: Ella-Mae Rayner, aka Comet, has also been unveiled as one of the new Gladiators\nMulti-talented: A former elite gymnast, Ella-Mae moved into semi-professional in diving before embarking on a degree in Sport Science\nToned and trim: She now trains six times a week while also working as a Fitness Model & Coach\nA former elite gymnast, Ella-Mae Rayner moved into semi-professional in diving before embarking on a degree in Sport Science.\nAt university she successfully coached and competed in University Cheerleading Championships, but it was a career changing ankle injury that led to a newfound love of the gym.\nShe now trains six times a week while also working as a Fitness Model & Coach.\nShe said: '’m absolutely thrilled to be Comet. I loved watching Gladiators growing up. I specifically remember Jet, she was an icon for me as a child and one of the reasons I become a gymnast.\n'I can’t believe I will be following in her footsteps. It really is a dream come true.'\nSabre\nSabre says: 'I truly hope Sabre will inspire and empower the younger generation of strong capable females just as the gladiators I once watched inspired me'\nTough: Sabre has competed in 5 British Weightlifting Championships events and numerous CrossFit championships all over the world\nDetermined: Fierce, powerful and agile; these are the main attributes of Sabre. Sheli McCoy describes herself as a 'grafter' and trains 16-19 hours per week\nFierce, powerful and agile; these are the main attributes of Sabre.\nSheli McCoy describes herself as a 'grafter' and trains 16-19 hours per week.\nShe has competed in 5 British Weightlifting Championships events and numerous CrossFit championships all over the world and has simultaneously been Scottish champion in both sports.\nSabre runs her own gym in Dundee, hoping to inspire future generations to reach their full fitness potential.\nShe has nearly 100,000 followers and loves to post videos of her workouts whether it be lifting heavy weights, doing pull ups from the bar or upside down handstands.\nShe says: 'I truly hope Sabre will inspire and empower the younger generation of strong capable females just as the gladiators I once watched inspired me to be a confident athletic women. It is Sabre's time to shine - here come the powerful girls.'\nApollo\nTitan: With the speed of a rocket, it's no surprise Alex Gray has earned the name Apollo\nSpeedy: He captained English Rugby teams for 16's, 18's and 20's. He was scouted to go to NFL for his skillset, making him the first British rugby player to transfer over to the NFL.\nWith the speed of a rocket, it's no surprise Alex Gray has earned the name Apollo.\nHe started his career playing rugby under 16s and moved onto the Premiership and then England 7s team. He captained English Rugby teams for 16's, 18's and 20's.\nHe was scouted to go to NFL for his skillset, making him the first British rugby player to transfer over to the NFL.\nSigned for Atlantic Falcons and then became the first international player to Captain an NFL team.\nApollo wants to win and won't stop until he does. Don't be fooled by his smile and charm, if you're in his way he'll take you down.\nApollo says: 'Gladiator ready?? You better believe I am!! After playing Rugby and In the NFL, the opportunity to inspire as Apollo is a dream come true. I plan on leading from the front and never giving up'.\nDynamite\nWatch out! Small, explosive and dangerous, just like Dynamite, 20-year-old, Emily Steel, is the youngest Gladiator in the current line-up\nExplosive: With a background in swimming competing at a national level until she was 15 years old, she's now a full-time elite CrossFit athlete\nFierce: Emily boasts 7,000 Instagram followers and regularly shares snaps of herself weightlifting or of her toned figure\nSmall, explosive and dangerous, just like Dynamite, 20-year-old, Emily Steel, is the youngest Gladiator in the current line-up.\nWith a background in swimming competing at a national level until she was 15 years old, she's now a full-time elite CrossFit athlete, also juggling second year studies full time at university in sport and exercise science.\nEmily boasts 7,000 Instagram followers and regularly shares snaps of herself weightlifting.\nDynamite recently competed internationally at one of the largest fitness festivals in the world and becoming an under 23's weightlifting British record holder.\nDon't underestimate Dynamite. She may look small, but she'll blast into the competition and obliterate her opponents.\nDynamite says: 'I'm too young to remember the original Gladiators, but my parents loved it and suggested I try out. Dynamite really does represent who I am and I'm excited to showcase what I can do in the games.'\nNitro\nNitro! Nitro is a team GB sprinter called Harry Aikines Aryeetey (pictured)\nNitro is a team GB sprinter called Harry Aikines Aryeetey. Commonwealth and World gold medallist sprinter, Harry's lightning fast speed and 'ball of energy' personality earned him the name Nitro.\nThe athlete has competed at the highest level in the UK since his youth. After becoming the first athlete to win gold medals at both 100 and 200 metres at the World Youth Championships, he won 2005 BBC Young Sports Personality of the Year age 17.\nHarry has gone on to win gold 4 x in the men's 100m European Championships and at the Commonwealth Games.\nHis long list of achievements include: 2 x Olympian, 3 x European Champion, 2x Commonwealth Champion, 1x Commonwealth Silver Medallist, 1x European Bronze Medallist, 1x World Bronze Medallist, 1x British Champion, 2x World Youth Champion, 1x World Junior Champion.\nWith his incredible speed and agility, the Contenders will have their work cut out, getting past social media-star Nitro, who boasts 253,000 Instagram followers.\nHot stuff: Commonwealth and World gold medallist sprinter, Harry's lightning fast speed and 'ball of energy' personality earned him the name Nitro\nFamily: The fitness fanatic shares a two-year old daughter named Aubreé-Isla with his partner\nThe fitness fanatic - who shares a two-year old daughter named Aubreé-Isla with his partner - regularly posts insights into his grueling training routine.\nOn taking part in the show, Nitro said: 'Becoming a Gladiator is another great achievement!\n'A childhood dream come true! You never know what is coming in life, each day is there to be enjoyed and savouring all opportunities is a must!\n'It literally gives me energy and strength! I can't wait to be in the arena and bring Nitro to Gladiators!'\nDiamond\nDiamond! Dazzling her way into the Gladiators stadium is Livi Sheldon, a 6ft bodybuilder. With her striking looks and indestructible natural earning her the name, Diamond\nLoved up: Livi - who regularly shares fitness tips on social media - is in a relationship with men's lifestyle coach Grant Gibbs\nDazzling her way into the Gladiators stadium is Livi Sheldon. She is a 6ft bodybuilder, with her striking looks and indestructible natural earning her the name, Diamond.\nAfter graduating with a degree in Sports Science, Livi took up bodybuilding, becoming a British Finalist 'England Toned Figure'.\nHer passion for sports began at age 6, when she played football for a boys football team. She eventually moved over to a girls' team, where she became captain for many years, and went on to play for Worcester City Ladies team.\nHowever, don't be deceived by Diamond's bright beauty, she is unbreakable and super strong.\nOn joining Gladiators, Livi said: – 'When I was growing up I used to get picked on for being taller than everyone else.\n'Now I get to show everyone that being unique is your superpower. I can't wait to get into the arena and take on the contenders as Diamond'\nLivi - who regularly shares fitness tips on social media - is in a relationship with men's lifestyle coach Grant Gibbs.\nGiant\nGiant! On Thursday, Giant, (pictured) Fire and Legend joined the line-up of super-fit TV titans ahead of the iconic show's hotly anticipated return\nGet your Crocs off! Giant made history by becoming one of the all-time tallest bodybuilders\nHis love: Pictured with his wife, Katie Christian, whose Instagram handle is @ hormonehealer_\nGiant is a former firefighter turned bodybuilder called Jamie Christian Johal.\nStanding at 6ft 5inches, it's no wonder he was given the name Giant. He made history by becoming one of the all-time tallest bodybuilders.\nNow he's bringing that power into the Gladiators arena. He may look like a big, friendly giant, but don't be fooled, he won't be holding back when it comes to the games.\nGiant said: 'I feel like everything in life has lead me here. I'm honoured to be part of this iconic show that I watched as a child. I'll be bringing my GIANT stature and personality so contenders better come prepared!'\nFire\nFlash! Blazing into the Gladiators stadium like a flash is Montell Douglas. She's fierce and will burn through the arena destroying anyone who gets in her way, earning her the name Fire\nImpressive accolade: Former Team GB Sprinter and Olympic Bobsledder, she held the British woman's record for fastest 100m sprint at 11.05 seconds\nBlazing into the Gladiators stadium like a flash is Montell Douglas. She's fierce and will burn through the arena destroying anyone who gets in her way, earning her the name Fire.\nFormer Team GB Sprinter and Olympic Bobsledder, she held the British woman's record for fastest 100m sprint at 11.05 seconds, smashing the previous record which had stood unbeaten for 27 years.\nIn January 2022, Montell made sporting history to become the first female UK athlete to compete at both the Summer and Winter Olympic Games.\nIn 2010, Montell won Commonwealth Gold in the 4x100m relay race in Delhi - and holds a European Under-23 Silver Medal in 100m.\nMontell moved into bobsledding in 2016, and the following year finished within the Top 10 at her World Cup debut.\nChamp! When competing at the Beijing Winter Olympics in 2022, Montell returned to the city where she had competed 14 years previously at the 2008 Summer Olympics\nWhen competing at the Beijing Winter Olympics in 2022, Montell returned to the city where she had competed 14 years previously at the 2008 Summer Olympics.\nShe loves inspiring women to achieve their dreams, no matter what age, height or background they're from.\nThe show claims that contenders should beware of Fire. She's fast, unpredictable and dangerous and will ravage anyone in her path.\nFire said: 'I'm so pleased I've been asked to be Fire! Being a gladiator has been a secret lifelong dream of mine.\n'As a strong and powerful woman, I'm living proof that you can achieve your dreams, no matter what age or background, if you believe and keep pushing. I'm ready to light up the competition!'\nLegend\nLegend! Training up to six times a week in bodybuilding and powerlifting, former international athlete, Matt Morsia describes himself as a Legend - hence the name!\nFamily: Matt pictured with his wife Sarah on holiday - they have two children together\nBusy man: In 2020, he released his first book, 'The 24/7 Body'. Bringing all his power and strength to the series, the contenders will not forget Legend\nNew faces: The trio were revealed for the first time on This Morning\nGladiators READY... Giant, Fire and Legend join the previously announced Fury and Steel as part of the new generation of mighty Gladiators ready to challenge a brave set of contenders\nGetting some practise in: Giant showed off his duelling skills on the show\nAnd finally, meet Legend. Training up to six times a week in bodybuilding and powerlifting, former international athlete, Matt Morsia describes himself as a Legend - hence the name!\nThe former Championship bronze medal winning long and triple jumper, and silver medal winning powerlifter, loved the 'showmanship' of competing.\nAfter retiring from international competitions, he continued performing to a huge audience becoming highly successful fitness influencer and professional YouTuber - amassing over 355 million views.\nIn 2020, he released his first book, 'The 24/7 Body'. Bringing all his power and strength to the series, the contenders will not forget Legend.\nHe said: 'I've been training like a beast for the show but realistically I didn't need to. I could've spent the last two months eating doughnuts and playing Dungeons & Dragons and I'd still be better than everyone else.\n'I'm called Legend for a reason! I can only apologise for the irreparable damage I'm about to do to the contenders. Actually, that's a lie, I'm not sorry at all. I'm actively looking forward to it'.\nOGs: The iconic show, which originally aired on ITV from 1992 to 2000, is making an epic return to screens after 23 years on the BBC (The original Gladiators in 1994)\nShe's ready! Professional Exeter Chiefs Rugby Player, Jodie Ounsley, has joined the line-up as her alter-ego 'Fury', named thanks to her power and passion for competition\nFeel the power: Meanwhile, joining Jodie's Fury is UK CrossFit star Zack George, who's set to intimidate the contestants as his alter-ego Steel\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Astonishing moment a street is swallowed by a sinkhole\n- Israeli hostage reveals how she survived being tortured\n- Deepak Chopra confronted over his relationship to Epstein\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- New video shows man with backpack similar to Guthrie kidnapper\n- Toddler opens car door in traffic and sends biker flying",
  "word_count": 3903,
  "scraped_at": "2026-02-14T13:08:59.017264"
}