{
  "article_id": "9ea3fa5dd29d",
  "url": "https://www.bbc.co.uk/sport/football/articles/cg7y711k7j0o",
  "title": "Sonia Bompastor: Chelsea head coach extends contract until 2030",
  "date": "2026-02-06T20:48:17.668Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "Bompastor extends Chelsea contract until 2030\n- Published\nChelsea head coach Sonia Bompastor has extended her contract with the club until 2030.\nThe 45-year-old arrived from Lyon in May 2024 after Emma Hayes' departure and led the Blues to an unbeaten domestic treble in her first campaign, winning the Women's Super League, FA Cup and League Cup.\nHowever, having been crowned WSL champions for the past six seasons, Chelsea are now 12 points off leaders Manchester City in third place after a disappointing run of form.\nIn a statement, Bompastor thanked the club for their \"unwavering support and the trust they have shown in me\".\nThe Frenchwoman added: \"It's a privilege to lead this team and I could not be prouder to represent Chelsea.\"\nWhat's gone wrong for Chelsea in the WSL this season?\n- Published2 February\nBompastor blames injuries for Chelsea drop-off\n- Published5 February\nOn Sunday Chelsea visit Tottenham, who are fifth and one point behind them in the WSL standings.\nThe Blues are through to the Champions League quarter-finals, in the fifth round of the FA Cup and face Manchester United in the League Cup final next month.\nBut the chances of them securing a seventh consecutive league title have suffered a blow after back-to-back defeats by fourth-placed Arsenal and City.\n\"Our success as a team is built on grit, resilience and intensity and we do not settle for anything less than winning,\" added Bompastor.\n\"We have so much left to fight for, we are competing on four fronts, and we will give everything. My focus is firmly on bringing more success to this amazing club.\"\nBen Haines, Ellen White and Jen Beattie are back for another season of the Women's Football Weekly podcast. New episodes drop every Tuesday on BBC Sounds, plus find interviews and extra content from the Women's Super League and beyond on the Women's Football Weekly feed",
  "word_count": 314,
  "scraped_at": "2026-02-14T11:17:39.165837"
}