{
  "article_id": "9ed610072966",
  "url": "https://www.winnipegfreepress.com/world/2025/12/18/in-2025-trump-told-fifa-olympics-and-ncaa-to-get-in-line-for-the-most-part-they-complied",
  "title": "In 2025 , Trump told FIFA , Olympics and NCAA to get in line . For the most part , they complied – Winnipeg Free Press",
  "date": "20251218T114500Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In 2025, Trump told FIFA, Olympics and NCAA to get in line. For the most part, they complied\nAdvertisement\nIt has never been unusual for the leader of the host country to show up for one of the biggest moments of soccer's World Cup — the gala where the team pairings are revealed.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nIt has never been unusual for the leader of the host country to show up for one of the biggest moments of soccer's World Cup — the gala where the team pairings are revealed.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nIt has never been unusual for the leader of the host country to show up for one of the biggest moments of soccer’s World Cup — the gala where the team pairings are revealed.\nWhat made President Donald Trump’s appearance this month different was the “FIFA Peace Prize.” The newly created honor by the sport’s international federation was, to no one’s surprise, presented to Trump, who’d been angling for a far more prestigious award — the Nobel Peace Prize.\nTrump hovering over soccer’s international spectacle was a fitting moment in a cycle that shifted into overdrive in 2025: The U.S. president, with the help of some U.S. politicians and many sports leaders, took unprecedented steps to bend sports to his own worldview.\n“I think sports is one fundamental example of Trump’s belief that he’s in charge of everything,” said David Niven, who teaches a “Sports and Politics” course at the University of Cincinnati.\nThough the Trump administration’s policies on immigration, transgender issues and more have repercussions in many areas, all veered into the games people play, and watch, in 2025.\nNext year’s World Cup and the 2028 Los Angeles Olympics — sports events that tout their ability to bring the world together — will be scrutinized for whether they accomplish that goal in a country that has become less welcoming.\nIn one example, an executive order Trump signed soon after taking office seeks to reduce opportunities for transgender athletes.\nIn another, U.S. Immigration and Customs Enforcement has ramped up activity, leading to more than 605,000 deportations since Trump’s first day in office, according to the administration.\n“Fans, whenever you have a major soccer event, they’ll show up and support their team,” said Louis Moore, a Michigan State professor who teaches about sports in society. He said he suspects ICE will be at some of the venues “and I just hope that FIFA has the backbone to have something worked out where you could protect players and fans.”\nWhether ICE shows up at World Cup games is an open question. But the White House has been sending mixed messages that could have an impact on athletes and fans coming to America for these international sports events.\nOn one hand, the administration has touted the creation of a “FIFA Pass,” designed to allow ticketholders to get expedited appointments for their visas. On the other, it recently announced expansion of travel bans and immigration restrictions — some targeting countries taking part in the World Cup — in reaction to the shooting of two National Guard members in Washington last month.\nTrump’s policies on transgender sports filter to NCAA, Olympics\nThe debate over transgender athletes was a touchstone cultural issue that helped Trump win last year’s election.\nEarly in his term, Trump signed an executive order, “Keeping Men Out of Women’s Sports,” empowering federal agencies to ensure schools receiving federal funding comply with the administration’s reading of Title IX, which interprets “sex” as the gender a person was assigned at birth.\nThe day after Trump signed his order, the NCAA amended its own rules to adhere to the administration’s guidance.\n“President Trump’s order provides a clear, national standard,” said NCAA President Charlie Baker, a former Massachusetts governor.\nSeveral months later, and with no fanfare, the U.S. Olympic and Paralympic Committee (USOPC) changed its policy to conform with Trump’s. It was a move Olympic legal expert Jill Pilgrim said was backed by a “well-reasoned set of arguments.”\n“But I’d be pretty shocked if this doesn’t get challenged” in court, Pilgrim said.\nSports leaders curry favor with Trump\nAll the while, key leaders took pains to stay on Trump’s good side.\nThough some believe it violated FIFA’s own requirements to be politically neutral, the FIFA Peace Prize afforded an excuse for its president, Gianni Infantino, to lavish praise on Trump, who has the ability to make life easy or incredibly awkward for the sport when it comes to the United States next year.\nWhile soccer gave a trophy to Trump, U.S. Olympic leaders used a White House ceremony this summer to present him with a set of medals from the 1984 Olympics — the last time they were held in Los Angeles.\nIt was part of an event attended by LA28 and USOPC leaders Casey Wasserman and Gene Sykes during which Trump signed an executive order creating an Olympic “task force.”\nThough the task force is charged with overseeing functions the government would normally provide for the Olympics anyway — like security and visa processing — this gave Trump a chance to take credit for it while bringing Wasserman and Sykes to the White House to thank him.\nIt made for some awkwardness when Trump asked a silent room for applause after thanking Sykes for the USOPC’s move on the transgender policy.\n“Some of this is almost to the point of parody,” said Niven, the Cincinnati professor. “They’re just shiny things that are in front of him at a given moment.”\nGolf brings Trump back into the fold\nAlso over the summer, Trump was a specially invited guest of the PGA of America at one of its biggest events, the Ryder Cup — a Europe vs. USA golf tournament held outside New York.\nThe invitation came some three years after the PGA removed the 2022 PGA Championship from one of Trump’s golf courses, saying hosting there would be “detrimental to the brand” in the wake of the Jan. 6, 2021, attacks on Congress.\nIn addition to his rift with the PGA, Trump supported LIV Golf — the Saudi-backed league that caused a rupture in the sport after dangling nine-figure salaries to lure many of its top players. Early in 2025, Trump held a White House meeting to try to make peace.\nThough nothing came of that meeting, both that and his appearance at the Ryder Cup marked his symbolic return into the fold of the sport he cares about most.\nIf there was lingering resentment among the players during the Ryder Cup’s emotionally charged week, it was not perceptible — they took pains to call it an honor to have Trump there, while treading nowhere near politics.\nTrump pushes into college sports, but impact might be limited\nCollege sports is one area testing the limits of Trump’s influence, though that hasn’t kept him from trying.\nThe “Saving College Sports” executive order Trump signed in July was a sweeping document that, among other things, ordered labor officials to clarify whether college athletes can be considered employees of their schools.\nFor the NCAA, the answer is a hard no. It also seeks antitrust protections to prevent it from being sued.\nUltimately, Congress has the authority to decide both issues. But Republicans and Democrats envision far different remedies for an industry in flux. Neither side passed significant legislation on the issue.\n“It’s one of the thorniest issues out there, and it just defies simple solution,” Niven said of the college conundrum. “That’s not exactly the description of Congress’ sweet spot for contributing.”\nAll of which could leave an opening for Trump — who hasn’t weighed in much since the executive order — to try again in 2026.\n“Something ought to be done, and I’m willing to put the federal government behind it,” he said last week. “But if it’s not done, you’re going to wipe out colleges. They’re going to get wiped out, including ones who do well in football.”\n___\nhttps://apnews.com/sports",
  "word_count": 1521,
  "scraped_at": "2026-02-14T12:37:37.072861"
}