{
  "article_id": "9f3380acbb25",
  "url": "https://www.thenationalnews.com/business/2025/06/11/eu-plans-to-remove-the-uae-from-its-high-risk-money-laundering-list/",
  "title": "EU plans to remove the UAE from its  high - risk  money - laundering list",
  "date": "20250611T051500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The European Union plans to remove the UAE from its list of countries that pose a high risk for money laundering, amid growing efforts by the Emirates to boost its regulatory framework.\nThe European Commission, the EU's main executive body, said that the list was updated after taking into account the work of the Financial Action Task Force (FATF) and in particular its list of “Jurisdictions under Increased Monitoring”.\n“The UAE welcomes the commission’s updated list of high-risk countries to strengthen the international fight against financial crime, and is fully committed to deepening its robust and strategic partnership with the European Union,” a UAE official said in a statement.\n“We continue to work closely with the relevant authorities and each EU member state.\"\nThe FATF, the global body that combats money laundering and terrorism financing, removed the UAE from its “grey list” in February last year after significant progress on reforms. The Emirates was placed on the grey list in 2022.\n“As a founding member of FATF, the commission is closely involved in monitoring the progress of the listed jurisdictions, helping them to fully implement their respective action plans agreed with FATF,” the European Commission said.\nThe commission added 10 countries to the high-risk list: Algeria, Angola, Côte d’Ivoire, Kenya, Laos, Lebanon, Monaco, Namibia, Nepal and Venezuela.\nAs well as the UAE, Barbados, Gibraltar, Jamaica, Panama, the Philippines, Senegal and Uganda were removed.\nHowever, the updated list will come into force only after it receives “no‑objection” from the European Parliament and the council within one month (which can be extended for another month).\nAt that point, the regulation is published in the Official Journal of the EU, where all laws and decisions are published, and comes into effect 20 days after publication. This could happen approximately three weeks after the decision-making process ends.\nThe commission said it had “carefully considered the concerns expressed regarding its previous proposal and conducted a thorough technical assessment, based on specific criteria and a well‑defined methodology, incorporating information collected through the FATF, bilateral dialogues and on‑site visits to the jurisdictions in question”.\nThe UAE has made significant progress in combating money laundering and the financing of terrorism over the past few years, passing strict laws and issuing regulations to clamp down on financial crime.\nIn September last year, the UAE set out a nationwide action plan aimed at combating terrorism financing and money laundering. The 2024-27 National Strategy for Anti-Money Laundering, Countering the Financing of Terrorism and Proliferation Financing has 11 goals focused on risk-based compliance, effectiveness and sustainability.\nThe enhanced framework, overseen by the Higher Committee and led by an expanded National Committee, includes the former Executive Office of Anti-Money Laundering and Counter Terrorism Financing, which now serves as the General Secretariat.\nIn August, the government also amended its laws against money laundering and the financing of terrorism and crime groups and formed a national committee on these crimes.\nAs part of its reforms, the UAE is adding measures to assist with investigations, imposing sanctions in cases of non-compliance at financial institutions and increasing the number of prosecutions to combat money laundering.\nThe UAE Central Bank has been imposing a growing number of fines and penalties in recent months to clamp down on violators.\nOn Tuesday, the regulator imposed financial sanctions on six exchange houses in the UAE, amounting to Dh12.3 million ($3.3 million), due to “violations and failures” to comply with the anti-money laundering/countering the financing of terrorism framework and related regulations.\nIn May, it fined one exchange house Dh3.5 million, and imposed a Dh100 million levy on another for “significant failures” in its AML/CFT framework and related regulations.\nLast month it also fined another exchange house Dh200 million for the same offence. A Dh500,000 fine was imposed on a branch manager, who was also banned from working in any licensed financial institutions in the UAE.\nThe Central Bank has also recently fined two branches of foreign banks operating in the country a total of Dh18.1 million for breaching anti-money laundering regulations.",
  "word_count": 669,
  "scraped_at": "2026-02-14T12:35:15.800885"
}