{
  "article_id": "9f638bfcd654",
  "url": "https://www.twtd.co.uk/ipswich-town-news/49436/taylor-were-not-happy-with-the-number-of-red-cards",
  "title": "Taylor : Were Not Happy With the Number of Red Cards - Ipswich Town News",
  "date": "20250502T091500Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Friday, 2nd May 2025 06:00 by Kallum Brisset\nTown midfielder Jack Taylor says the Blues have spoken about discipline following their fifth red card of the season against Newcastle United last weekend.\nBen Johnson’s sending off at St James’ Park marked the second successive game the Blues have seen a man dismissed in the first half, drawing them level with Arsenal as the side with the most in the Premier League this season.\nWhile there were question marks surrounding Johnson’s first yellow card for simulation, there could be few complaints at the decision to haul Alexander Isak to the ground which earned the wide man his second yellow just seven minutes later.\nTaylor, who started just his second league match of the season on Tyneside, acknowledged playing with a man light is particularly difficult as a midfield player when the Blues see little of the ball.\n“It feels almost impossible when you’re on the pitch with ten, to be honest,” he said. “Especially on the ball and at set plays, you’re sacrificing an extra man for set plays and we’ve been punished with that in the last couple of weeks.\n“Discipline’s a massive thing and something we spoke about after the game that we weren’t happy about with the amount of red cards we’ve had this season. We haven’t had a lot of the ball and decisions don’t normally go to newly promoted sides sometimes.\n“It’s one of those things that we need to work on because no doubt it could possibly happen next year, that’s what we’ve spoken about.”\nWith Johnson now joining Leif Davis in being ruled out through suspension, the Blues are significantly light on numbers due to an extended injury list that includes no fewer than nine first-team players.\nThat means Kieran McKenna has been forced to play players in more unnatural positions such as Jacob Greaves filling in at left-back at St James’ Park, with the possibility of more reshuffling needed ahead of the Blues’ trip to Everton on Saturday.\nThat is where it is important that Town have players willing to step into the side when needed, something Taylor insists is the case among the current squad.\nHe said: “It’s never ideal when you get injuries in the squad. Especially our right-wing position, we’ve had two long injuries with Wes [Burns] and Chieo [Ogbene].\n“It’s football and that’s why you need a squad. Everyone has come into the team at different stages of the season and showed why they’re at this level. The squad is so intact, you haven’t got any outsiders. It’s not ideal to have injuries but you’ve got to deal with what you’ve got.\n“Last week away at Newcastle the game plan was going well, an unfortunate red card and then it’s probably one of the toughest places in the world to go down to ten men to. With people playing out of position, you’ve got to sacrifice yourself for the team.”\nThe Blues head to Merseyside having already had their relegation to the Championship confirmed last weekend, joining Leicester City and Southampton in having their fates mathematically sealed with four matches still to play.\nWhile there is now no hope of the Blues maintaining their Premier League status, Taylor knows there is plenty still to play for during the run-in which begins with the penultimate ever match to be played at the Toffees’ Goodison Park.\nHe said: “Bringing the best account of ourselves in and out of possession and sticking to the game plan whether we’re away or at home. We haven’t really changed anything drastically, you know what sort of Town team is going to turn up on a Saturday or Tuesday evening.\n“Showing fight right to the end, there’s loads of points still to play for so we’re trying to grab every point that’s available.\n“You’re still playing Premier League matches and fans are paying their money to come across the country to watch you, so you’ve got repay them in that aspect. Showing the best account of yourself is going to do you know harm.\n“You don’t try and prepare now for next season because you’ve still got the off-season to prepare for that and reflect on the season just gone. There’s going to be movement in and out of the club so everyone’s got to be ready.\n“There’s no problem with bringing the best aspect of yourself and showing your ability on the biggest stage.\n“They’ll come out and try and win the game like we will. It’s a historical ground and they’ve only got two home games left there so the atmosphere will be great.\n“It’s another opportunity for our players to show what we’re about as a team and a club. The fans included in that, to make everyone know what Ipswich is about.”\nDespite Town’s return to the second tier being confirmed last weekend, the Blues were given a resounding reception by the travelling supporters in Newcastle.\nHaving experienced relegation for the third time in his career, Taylor says the support shows that the club is still moving in the right direction.\n“It’s such a nice feeling not seeing an empty chair at the full-time whistle,” he said. “Everyone clapping you and singing the club’s anthems.\n“It’s a really proud moment to show that everyone in the club understands that we’re going through it together and no matter what happens we’re going to come out of it stronger.\n“It’s not the outcome that everyone wanted this season, but the club is on an incredible journey and to get here how we got here in such a quick time is really special. The outcome is not what we all wanted but we’ll try and get back to the Prem as quick as we can.\n“[The club is] made to be in the Premier League. If we bounce back up, then hopefully this club can be a sustainable Premier League club for the future.”\nTaylor also maintains the belief that the Blues can regroup and fight to return to English football’s top table once again next season and that Portman Road is the place to be.\nThe 26-year-old added: “It’s the same as me two years ago before I signed. I didn’t hear a single bad word said about the club or the people that work here, that’s got to be a good reflection on us as a whole.\n“It’s football and when it comes to transfer windows, people are going to talk. No matter if there’s outgoings or incomings, the club is in such a good stand for next season. I’m pretty sure we’ll have a right go next year.\n“Every aspect of the club is looking into the future and preparing for the future with the new training ground and things like that. The women’s team showed that’s another section of the club that is being pushed, I’m glad for them to get promoted. The club is in really good stead.”\nTWTD\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nCentral midfield is going to be a problem area with new signings needed.\nLuongo likely to go as contract is up, both Philips and Cajuste will go back to their clubs. That leaves an ageing Morsey (questionable as to whether his legs are going), Taylor (not sure is top half standard Championship player) and Humphreys is a bit of an unknown.\nBased on that, centrally we have a bit of an issue\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 1261,
  "scraped_at": "2026-02-14T12:11:40.389411"
}