{
  "article_id": "9f6d0161f206",
  "url": "http://www.orlandosentinel.com/opinion/central-florida-100/os-op-cf100-nfl-tragic-lesson-20230106-j5gs2fq3vvbu7a4w6spvkwizda-story.html",
  "title": "Central Florida 100 : The NFL tragic lesson – Orlando Sentinel",
  "date": "20230107T004500Z",
  "domain": "orlandosentinel.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": ".fl100-bio{border-bottom:1px solid #666666;padding:12px 0;margin:6px 0 24px 0;font-size:18px;color:#333;line-height:27px;font-family:Georgia, Times New Roman, serif;}.fl100-bio-thumbnail{float:left;padding:4px 14px 14px 0;margin:0;width:187px;height:105px;}.fl100-bio-name{font-weight:bold;font-size:22px;margin-top:0;padding-top:0;}.fl100-bio-label{font-weight:bold;} @media only screen and (max-width:600px){.fl100-bio-thumbnail{float:none;margin:0 auto;display:block;padding-top:0;}}\nOur panel of 100 influential leaders discusses the most important issues affecting you.\nDick Batchelor, president, Dick Batchelor Management Group\nLast week: FLORIDA DEMOCRATS NEED HELP: While Gov. Ron DeSantis celebrates his 20-point margin of victory, and the Republican-led House and Senate now enjoy a supermajority in both houses, it is now more than obvious the Florida Democratic Party is in need not only of a “political autopsy” but a complete resurrection. The party, suffering from self-inflicted wounds, needs to rebuild itself from top to bottom. It not only needs new, invigorating leadership and fundraising capabilities, but also needs to reengage the rank-and-file Democratic voters. Short of that, the Florida Democratic Party will remain on life support.\nLee Constantine, commissioner, Seminole County\nLast week: FLORIDA’S RAPID GROWTH: The recent news of Florida becoming the fastest-growing state in the nation was met with excitement by many. True, growth is one indicator of Florida’s economic success. However, runaway growth comes with negative consequences. Without proper planning, sprawl is inevitable. This causes additional traffic congestion and water pollution. Our natural resources are stressed further and hurricanes become more devastating, thus increasing insurance premiums. Floridians’ very quality of life is threatened. Prior to 2011, Florida was considered a national leader in growth management. Since, there has been degradation of our state planning laws in the rush for more development. This trend must be reversed lest we kill the golden goose.\nTom Dyer, attorney, founder of Watermark\nLast week: SAVE PROPERTY INSURANCE: In his inaugural address, Gov. Ron DeSantis offered a preview of his likely 2024 presidential campaign. But remarkably, he ignored the crisis impacting millions of his constituents. Florida homeowners pay on average more than $4,200 per year for property insurance, an alarming amount that’s doubled since DeSantis took office. Recent steps taken by the Legislature will prop up insurers, but won’t protect homeowners from more backbreaking rate increases after another brutal hurricane season. The governor’s war on the “woke mob” doesn’t matter to most Floridians. Will he continue to sidestep a badly broken property insurance system that does?\nJohn L. Evans Jr., business consultant, promisingpeople.com\nLast week: DESANTIS’ MOMENT: Trajectories matter in the human experience. I can attest, after the inaugural for him, our governor’s trajectory is unmatched in Florida political history. His speech last Tuesday was impeccable. Remember, it’s not just what you say, but how you say it. Ron DeSantis spoke with thunderclap force. The man is on a mission and welcomes his dates with history. I counted hearing the word “Camelot” in countless conversations. An iconic pic buttresses the notion, with glamorous wife Casey, tending two of her children, as an F15 soared over the proceedings. Where this is all going, only heaven knows.\nMark Freid, Immediate past president, Holocaust Center\nLast week: REJECT ANTISEMITISM: The antisemitic message projected onto the downtown office building on New Year’s Eve left me feeling a whole lot less celebratory and significantly less optimistic about the new year. I believe Orlando is a welcoming and accepting community, but these hate-fueled antisemitic acts, (yes, along with bigotry against many other groups), are becoming way too frequent and frightening. Let me assure you, the message is clear. There are people in our own community, the City Beautiful, who see their Jewish neighbors as different, as “less than,” and, in their eyes, unwelcome. History tells us that silence amplifies these messages of hate and accelerates the danger to their targets. So, how will we respond? What will we do? What will you do?\nGlenton Gilzean Jr., president/CEO, Central Florida Urban League\nLast week: AMTRAK EXPANSION: Amtrak is set on expanding its service throughout Florida in 2023, with a potential to run trains all the way from New Orleans to Miami, via Orlando. The service would connect the Panhandle to stops in Central Florida and along the East Coast, giving locals and tourists a much needed alternative to travel across our beautiful state. This is welcome news to begin 2023 and I look forward to riding the rails later this year.\nLooking ahead: This week, Amtrak is set on expanding its service throughout Florida in 2023, with a potential to run trains all the way from New Orleans to Miami, via Orlando. The service would connect the panhandle to stops in Central Florida and the East Coast, giving locals and tourists a much needed alternative to travel across our beautiful state. This is welcome news to begin 2023 and I look forward to riding the rails later this year.\nJeff Hayward, president and CEO, Heart of Florida United Way\nLooking ahead: VOLUNTEERISM: With the New Year, I encourage you to start 2023 off right by getting involved in our community. Volunteering is a great way to do this, and Heart of Florida United Way is currently seeking more than 300 volunteers to join us for Week of Action which runs from Jan. 15-21. This annual volunteer event is in honor of Dr. Martin Luther King Jr., and it is a great chance to get involved and personally make a difference. There is something for everyone, including individuals and professional groups with some great opportunities to volunteer as a family! Visit HFUW.org for more information.\nJane Healy, former editorial page editor and managing editor, Orlando Sentinel\nLast week: DIVERSIFY THE BED TAX: If there’s one major accomplishment Orange County Mayor Jerry Demings and the commission should do next year, it’s expanding the use of the hotel tax. When it started in the late 1970s, it generated $2.4 million a year. Now it produces about $24 million a month! It made sense to spend money on a convention center at first to bring more business travel here. And the downtown venues are a huge plus this community deserved. But there’s no need for yet another addition to a gigantic convention center. But there is huge need to help tourism workers by using tax for things like free Lynx passes or affordable housing. They should take this on even if it means standing up to Disney, particularly if Disney wants help in reviving its self-governing Reedy Creek.\nDavid Kay, chair, Interfaith Council of Central Florida\nLast week: HATE CRIME’S FLAWED REPORTING: It sounded like good news — the FBI just said hate crimes were down in 2021. But there’s a catch. Less than two-thirds of the nearly 19,000 law enforcement agencies nationwide reported hate crime data, down from over 90% the year before. That means hate crimes likely went up, perhaps as much as 25%. Only two of the 757 agencies in Florida provided data to the Department of Justice, reporting just a single hate crime. Considering we rang in the New Year with an antisemitic message projected on a downtown building, that doesn’t seem like a reliable number.\nLooking ahead: MARTIN LUTHER KING REMEMBRANCES: In April, it will be 55 years since we lost Martin Luther King Jr. To echo the words of the slave preacher Dr. King quoted in his 1962 speech on the centennial of the Emancipation Proclamation, we’re still not where we ought to be, but we’re also not where we were. Greater Orlando has over a dozen events commemorating and celebrating Dr. King, starting with Sunday evening’s vigil at Orlando City Hall and interfaith/multicultural program at Shiloh Baptist Church and culminating with the annual gospel concert at Dr. Philips Steinmetz Hall on Feb. 18. Find all the details at MLKOrlando.com.\nKen LaRoe, Founder, Climate First Bank\nLast week: THE FIGHT AGAINST ESG: Florida and other states keep going after ESG, blacklisting financial institutions like mine that are prioritizing preserving our planet. Just this week, the Kentucky State Treasurer threatened to divest Climate First Bank, BlackRock, JP Morgan Chase and others. Interestingly, the Treasurer’s press release was fraudulent and farcical because the State of Kentucky does no business with my bank, Climate First Bank, nor do we do any business with them. Her inane reasoning? That our commitment to invest less in fossil fuels and instead in renewable energy is a threat to the economy and national security. But it’s the dirty energy industry’s grip on our nation’s economy, its polluting planet-warming emissions and its role in fueling this anti-ESG rhetoric that is unequivocally dangerous.\nAlex Martins, chair, UCF Board of Trustees; CEO, Orlando Magic\nLooking ahead: PATENT POWER: Researchers from the Florida High Tech Corridor’s three universities enter the new year driving discoveries and inventions for the people of Florida. In the latest National Academy of Inventors report, the universities of Central Florida, Florida and South Florida’s combined annual patent total (272) would rank No. 3 in the world, behind only the University of California system and the Massachusetts Institute of Technology. Patents are critical to bringing to the marketplace new technologies in engineering, science, medicine and other fields that make our society safer and healthier and advance our quality of life.\nAnna McPherson, past president, Junior League of Greater Orlando\nLast week: VISUALIZING HOMELESSNESS: Lately, I’ve experienced a new urgency in conversations surrounding homelessness in our community. People are seeing a new level of crisis: recently, a local social media account posted a picture of human fecal matter smeared under a highly trafficked underpass; two weeks ago a neighbor witnessed someone relieving themselves next to a residential sidewalk after spending the night on a park bench; aggressive panhandling is proliferating at interstate exits downtown. Tents abound. Orlando and Orange County have resources to help those in crisis. We as citizens need to start asking more questions around what policies, procedures, programming, funding sources, individual actions and personal donations effectively move people out of dangerous street living situations and into shelters and permanent housing.\nPamela Nabors, president/CEO, CareerSource Central Florida\nLast week: VIOLENT GAME: Last Monday night I was so excited to watch my beloved Buffalo Bills, along with my son and grandson. Our joy suddenly evaporated as we watched Bills safety Damar Hamlin fight for his life after a devastating tackle. Football is indeed a very dangerous sport, but with all the media promotion and commentator analysis hype, it’s easy for the viewing public to forget that these men are made of flesh and blood. I would hate if catastrophic injuries or worse become an accepted staple of the sport, much like racing. I pray for Damar’s continued recovery and am sobered like many football fans this week about the nature of the game.\nLooking ahead: LABOR CHALLENGES CONTINUE: A recently released national labor report indicated that U.S. worker challenges will continue well into 2023. Many Americans appear to be more interested in creating a life that doesn’t involve traditional work — nearly 3.5 million workers are missing from the workforce. Companies are continuing to see the effects of the “great resignation” and “quiet quitting,” both of which make a rebound to pre-pandemic labor participation rates unlikely. Despite current record-high inflation, consumer spending is still rising, and employers are searching for workers to meet continued demand.\nBrendan O’Connor, editor in chief, Bungalower.com\nLast week: DRAG DEBATE: A touring drag show, “A Drag Queen Christmas,” that made a stop at The Plaza Live in the Milk District attracted quite a crowd, inside and outside, after it sparked backlash from state officials and a written warning for allegedly marketing to children. As someone who dabbles in drag and hosts a regular drag bingo night at a local brewery each week, I have to say, I don’t terribly enjoy seeing kids in an audience of adults laughing at my dirty jokes but that doesn’t mean the parents don’t have the right to be there. It also doesn’t mean I need to change what I’m saying on the microphone either. It’s a free country and kids happen. So do men in dresses. Get over it. But while we’re talking about it, a brewery is still a bar, y’all.\nLooking ahead: MILLS 50 UPGRADE: St. Matthew’s Tavern in Mills 50 was just purchased by Team Market Group, the company behind fancy watering holes like The Robinson Room, Mather’s, and The Wellborn and the local scenesters are pretty upset about it. Dive bars along 17-92 seem to be a thing of the past as operators with more resources snatch them up for something newer and flashier, with operating restrooms and light switches, and less drug-dealing bartenders and late-night street brawls. It’s a big change for Mills 50, and one that heralds a future for the neighborhood with a little less grime and a little more expensive cocktail offerings. With the same lack of parking.\nBeverly Paulk, founding member, Central Florida Foundation and The Orlando Philharmonic\nLast week: YEAR-END CHEERS AND JEERS: First jeer goes to Florida for-profit, private nursing programs that lead the country in license-exam failures. Fewer than one third of for-profit nursing students pass the required knowledge test, yet are strapped with the education debt that failed to prepare them. And our nursing shortage worsens. Second jeer is for the 25-year Bright Futures program. Funded by Florida Lottery, the wealthier students receive up to $6,370 annually and the lower income, equally smart students can’t qualify due to affording pricey test preparation. Cheers go to the Magical Dining program giving more than $2 million to area nonprofits in only 13 years.\nJim Philips, retired longtime radio talk-show host\nLast week: THE HEAT IS ON: It’s always kind of fun to see houses of worship with a sense of humor as it applies to the weather. One of my favorites outside a Baptist church read: “If you think it’s hot now…” New transplants to the area (Florida now leads the nation in population growth) might keep this mind now that Orlando has recorded its third=hottest year on record. This probably does not matter much to newcomers who have had it up to their frozen eyebrows with snow, ice, and heart attacks from shoveling out from a blizzard. Modern air conditioning will cool you off faster that re-attaching your toes from frostbite. But, don’t be surprised in late August for another sign to say: “The heat index is between OMG! and WTH!?”\nLooking ahead: HUMAN COMPOST: Could Florida soon join other states that have embraced the “natural burial movement”? That’s right! Instead of cremation or being placed in the ground your body can be turned into soil after it’s “curtains,” so to speak. Why not? We’re running out of cemetery space and cremation releases heat trapping gases. Here’s how it works. After you give up the ghost, your body is placed in something like a a big cement mixer along with loads of organic material like alfalfa or palm fronds. Round and round it goes for several weeks as microbes do their thing. Before you know it…voila!…you’re ready for anything. Maybe you can be mixed with fertilizer for the garden. That would be some tasty lettuce indeed. Alkaline hydrolysis is relatively inexpensive compared to the King Tut method or something like coal-fired pizza. Please mix me with legal weed and bake some brownies…it’s high on my list.\nGloria Pickar, president emerita, League of Women Voters of Orange County\nLast week: PRISONERS KEPT IN THE DARK: The Sunshine State keeps prisoners intellectually in the dark. As the Marshall Project reports, Florida leads the nation for prison book banning at 20,200 titles; Texas at 9,400 is a distant second. Banning books about educational opportunities, prisoners’ constitutional rights, self-improvement and even diversion like “100 Animals Adult Coloring Book,” is counterproductive to security and rehabilitation. Jail and school-library book bans combined, Florida is clearly infringing on First Amendment rights. These acts are destructive to our democracy. Learn more about the “State of Democracy in Florida” at the League’s Hot Topics Luncheon Jan. 11: www.LWVOC.org/HotTopics. Sunshine State? Hardly!\nLooking ahead: ACADEMIC FREEDOM UNDER ATTACK: After George Floyd’s murder, we embraced diversity, equity and inclusion education. Now under cover of the anti-woke law, Gov. DeSantis has directed our colleges and universities to develop a list by Jan. 13 of DEI and critical race theory programs, including assigned funding. The law has been challenged as a violation of the First Amendment. This threatens academic freedom, free speech and university funding. While DeSantis promotes Florida as the “free state,” our constitutional rights are steadily eroded. Learn more about the “State of Democracy in Florida” at the League’s Hot Topics Luncheon Jan. 11: www.LWVOC.org/HotTopics. Free state? Hardly!\nLarry Pino, attorney and entrepreneur\nLast week: BILLIONAIRE SPACE RACE: Three billionaires – Elon Musk, Richard Branson and Jeff Bezos – will be imprinting 2023 as a watershed year for the exploration of space starting with one launch a week, expanding to two launches by mid-year, and three weekly projected by the end of the year. For Elon, it’s all about populating lower space with global internet access and populating Mars with human beings. For Branson, it’s about redefining tourism as he brandishes lower space experiences for well-heeled passengers. And for Bezos, his mission is not particularly clear. What is clear, however, is that 2023 will be explosive. And, what is even clearer is that Central Florida will be its economic beneficiary.\nLooking ahead: THE ACCIDENTAL POPE: When Pope Emeritus Benedict XVI was elected to succeed the popular Pope John Paul II, the world anticipated a less ebullient but more formidable theological behemoth able to right the challenges Roman Catholicism had encountered. The Pope, however, who never wanted the role, fell to its cross-currents in the face of entrenched Vatican bureaucracy, a persistent hierarchical reluctance to deal with sexual abuse in the clergy and the ongoing secularization of daily life. While his resignation in 2013 deprived the world of an intellectual powerhouse who could have been a formidable agent of change, it should be noted that the Pope never stopped reminding us that God must remain relevant.\nJoanie Schirm, GEC founding president; World Cup Orlando 1994 Committee chairman\nLast week: A LESSON IN NFL TRAGEDY: The week reminded us the football game we love is a dangerous sport as we watched Buffalo Bills safety Damar Hamlin, after a routine tackle, collapse to the ground. The NFL halted the game, followed by a national outpouring of humanity for Hamlin, his family, and the distraught players on both teams. The Sentinel editorial “Florida can lead in cardiac arrest response” suggests a unique opportunity. Use a tiny sliver of the huge settlements in Florida from drug manufacturers and retail pharmacies. The state should invest millions towards public education and additional CPR training while equipping and training staff and volunteers to use automatic external defibrillators to save lives.\nLooking ahead: HATE CRIME REPORTING: FSU College of Criminology and Criminal Justice assistant professor Brendan Lantz’s quote nailed the lack of facts problem regarding addressing complex societal issues. “The biggest barrier to hate crime research is how difficult it is to define the problem … because our data isn’t very good, and you can’t start to develop a solution until you truly understand the problem.” Lantz is referring to the FBI’s annual hate crime study failing to capture nearly 40% reporting from law enforcement agencies. Add that we still don’t receive full law enforcement national gun violence data, and you see why we cannot harness the strength of community response to develop meaningful safety measures.\nNicole Wilson, Orange County commissioner, District 1\nLast week: HAPPY NEW YEAR: Happy New Year to all! Let’s collectively resolve to use more empathy in 2023. As a personal goal, I am working hard to hear and see issues from another perspective, not just the ones that echo my worldview but also ones that challenge, confuse or even infuriate me. We will always have more in common when we take a step back and remember we are all human.\nLooking ahead: IMPACT FEES: In the coming week, the Orange County Board of Commissioners will discuss new impact fee schedules for services provided by law enforcement, fire rescue, and parks. The impacts of new development are supposed to be offset by impact fees so that existing residents aren’t burdened with the cost of expanded services. Our residents rely on services paid for by each new dwelling through impact fees. They are a crucial tool for ensuring our residents maintain a high quality of life and must be updated to provide adequate funding for these critical services.\nMichael Zais, political blogger for thedrunkenrepublican.com\nLast week: IS THIS INCLUSION? In another example of the pure sham that is the “Diversity and Inclusion” movement, Black Democratic Rep.-elect Cori Bush from Missouri attacked Black Republican Rep.-elect Byron Donalds of Florida, calling him a “prop” and accusing him of “perpetuating white supremacy.” This attack was apparently instigated by Donalds being thrust into the spotlight for receiving votes for Speaker of the House in the midst of that debacle. Such vile and racist comments from the left are routinely directed at highly accomplished conservative African Americans, such as S.C. Sen. Tim Scott and Dr. Ben Carson. “Diversity and Inclusion,” if subject to ideological litmus tests, is nothing but a fraud.",
  "word_count": 3508,
  "scraped_at": "2026-02-14T13:35:16.527202"
}