{
  "article_id": "9fac2b92c511",
  "url": "https://theathletic.com/live-blogs/england-belgium-arnold-clark-cup-live-score-updates-result/q6WHSUWl9x8x/",
  "title": "England Women vs Belgium Arnold Clark Cup live updates : Start time , streaming , lineups and team news",
  "date": "20230222T171500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How England dominated Belgium 6-1 to lift the Arnold Clark Cup\nSummary\nEngland have retained their Arnold Clark Cup crown after a resounding 6-1 victory against Belgium at Ashton Gate.\nSarina Wiegman’s side were dominant throughout the encounter, as goals from Chloe Kelly, Leah Williamson and Lucy Bronze helped the Lionesses extend their unbeaten run to 29 matches.\nWiegman’s side began the encounter in dominant fashion, as their slick passing pinned back the Belgium defence from the opening whistle. Kelly, who scored the winning goal in the Euro 2022 final, opened the scoring in the 12th minute as she tapped home from a Lauren James cross.\nCaptain Williamson doubled England’s advantage with a thumping header on the 42nd minute, before Kelly’s second close-range finish of the night shortly after the break gave England a three-goal lead in the 50th minute.\nBelgium's night went from bad to worse as Julie Biesemans deflected a cross into her own net in the 78th minute to add to England’s tally. Moments later, Bronze slotted home from a set-piece to extend the hosts’ advantage.\nThere was further drama in stoppage time as Belgium managed a late consolation through Elena Dhont’s rasping effort. Despite failing to keep a clean sheet, England rubber-stamped their victory as Williamson’s composed finish added a sixth goal for England in the dying embers of the game.\nWith the FIFA Women's World Cup just five months away, the performance was another important marker of England’s growing confidence under Wiegman. They have scored 137 goals and conceded just nine in their 29 unbeaten games since the Dutch manager took charge in September 2021.\n(Photo: Getty Images)\nGood night!\nThank you for sticking with us tonight and throughout the tournament as England lift the Arnold Clark Cup for a second successive year.\nChloe Kelly the 'tap-in queen'\nThe Manchester City winger scored three close-range finishes in the Arnold Clark Cup, and tells ITV that team-mate Lucy Bronze refers to her as the 'tap-in queen'.\nLeah Williamson lifts the Arnold Clark Cup!\nThe all-conquering Lionesses' are victorious again!\nEngland collecting medals\nOne of England's best-ever players, Fara Williams, is handing out the medals. But this might just be England's best-ever team...\nIndividual awards handed out\nKelly wins the tournament's top scorer awarded, while James is named Player of the Tournament.\nEngland players huddle on the pitch\nThe European champions are huddled around the centre circle as Wiegman offers some words for the side. Plenty of smiles all around.\nFT: England 6-1 Belgium\nAnother assured performance from Wiegman's side.\nThey have been absolutely dominant this eve, as they have for much of the Arnold Clark Cup, and they have completed their campaign in style.\nGOAL! Williamson scores her second\n90+5' England 6-1 Belgium\nOr maybe not! England do have the final word after a cool finish from Williamson.\nThe ball ping-pongs on the edge of the area before it lands at the feet of the England captain, who places her effort into the bottom corner.\nGOAL! A consolation for Belgium\n90+2 England 5-1 Belgium\nWhat a strike that is from Dhont!\nDhont cuts onto her left and unleashes a rasping effort. They've been dominated all over the pitch tonight but Belgium might just have the final word!\nGOAL! England extend lead\n89' England 5-0 Belgium\nIt's the centurion Bronze who caps off another excellenct England display.\nA good delivery from the free-kick, as Daly knocks it down for Bronze to tap home.\nA five-star display from Wiegman's side.\nKelly named Player of the Match\nTwo goals and plenty of energy all evening. It's hard to argue as the Manchester City is tonight's Player of the Match\nShe's at it again as she wins a free-kick near the right-hand corner.\nBelgium make another change, with Wullaert — who won't be able to win the top scorer award now — being replaced by Fon.\nBelgium ring changes\nBelgium are also making substitutions as the game is beginning to slow down.\nMeersman on for Biesmans and Missipo goes off for Eurlings\nDouble change for England\n79' England 4-0 Belgium\nThe talent rarely drops with England's changes. That's a testament to the depth in this squad.\nPark replaces Toone, while Walsh makes way for Wubben-Moy.\nGOAL! Own goal from Belgium\n78' England 4-0 Belgium\nLovely play from England in the build-up, who are running away with this one.\nA little give-and-go between Kelly and Stanway, and the latter's cut-back across the six-yard area is deflecting by Biesmans into her own net with Daly breathing down her neck.\nCorner for Belgium\nA rare chance for them to threaten the England goal...\nDaly replaces Russo\n72' England 3-0 Belgium\nA massive cheer among the Ashton Gate crowd as Daly comes on.\nI wonder where the substitute will play... centre half?\nChance for England!\nConfusion at the back for Belgium — the last thing they need at the minute!\nStanway wins possession and she has three white shirts alongside her but chooses to go on her own, but her shot is parried away for a corner by Evrard.\nEngland win corners in quick succession — that's nine for Wiegman's side in the game.\nQuiet night for Earps\n66' England 3-0 Belgium\nEngland have been absolutely dominant in possession in the second half, with goalkeeper Earps hardly having a touch of the ball.\nWiegman's side have been relentless and there is a strong sense that they're not done yet.\nToone strikes the woodwork!\nIn a similar position to Kelly minutes earlier, Toone finds herself in space inside the Belgium penalty area.\nHer effort is struck with venom, but Evrard manages to get a fingertip to it, pushing it on to the crossbar.",
  "word_count": 948,
  "scraped_at": "2026-02-14T13:03:19.270009"
}