{
  "article_id": "9fae777fd58c",
  "url": "https://www.birminghammail.co.uk/news/showbiz-tv/strictly-come-dancings-karen-carney-32971072",
  "title": "Strictly Come Dancing Karen Carney on heartbreaking abuse that caused her to  break down  ",
  "date": "20251129T230000Z",
  "domain": "birminghammail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Strictly Come Dancing's Karen Carney on heartbreaking abuse that caused her to 'break down'\nThe Birmingham-born footballer turned pundit was in tears as she spoke candidly about her encounters with online trolls\nStrictly Come Dancing's Karen Carney has opened up about the online abuse she endured after becoming one of the first female football pundits.\nThe Birmingham-born footballer turned pundit heartbreakingly revealed the experience caused her to lose all her confidence and admitted it had never returned until she took to the dance floor.\nIn Saturday night's show Karen impressed the judges and fans so much with her couple's choice dance that they said they thought she could lift the Glitterball trophy.\nShe earned a perfect 40 score, but before the stellar performance Karen was in tears as she spoke candidly about her encounters with online trolls.\nRead more Strictly's Balvinder Sopal hits back at judges with hilarious dance-off dig\nKaren revealed: \"When I went into punditry I always felt a little bit of an outsider if I'm being brutally honest. There wasn't many, if any, women pundits at the time.\n\"I've received a lot of negativity, particularly one instance was really, really, really bad and it completely knocked my confidence and I've not been able to get it back.\"\nLaura Bassett, Karen's former team mate and fellow Lioness, commented: \"To have witnessed some of the online abuse she's received and see this effervescent, fun, full of life friend crumble and break down and question themselves, it was heartbreaking.\"\nReflecting on her Strictly journey, Karen said: \"It's helped my confidence so much. I can be my true authentic self.\"\nKaren dedicated her latest dance to her mum Marie for supporting her football dreams when she was the only girl playing as a youngster.\nMarie revealed Karen had once run off the pitch crying because no-one would pass her the ball because she was a girl.\nBut Karen made her first-team debut for Birmingham City in the FA Women's Premier League National Division and went on to play for England.\nKaren is now a frontrunner in the competition, and second place in the leaderboard heading into the quarter final next week.\nShirley Ballas commented: \"I'm quite emotional because I love a strong woman...you really have put yourself in with a shot at this whole Strictly Come Dancing whole thing.\"\nCraig Revel Horwood simply said: \"That dance just got you into the Champions League.\" Motsi Mabuse congratulated her, saying: \"Girl honestly this was just everything...you knocked it out of the park.\"",
  "word_count": 419,
  "scraped_at": "2026-02-14T12:50:50.159058"
}