{
  "article_id": "9fd982130462",
  "url": "https://www.yahoo.com/news/masters-only-few-spots-left-161219727.html",
  "title": "Masters has only a few spots left . One player could earn a spot at Augusta National via ranking",
  "date": "20240326T170000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Masters has only a few spots left. One player could earn a spot at Augusta National via ranking\nThe final week for players to try to get into the Masters through the world ranking has rarely held so few possibilities.\nByeong Hun An is a lock to stay in the top 50. He was No. 60 at the end of 2023, and then started the year finishing fourth at Kapalua and tied for second at the Sony Open to get inside the top 50. He secured his position in the top 50 with a tie for eighth at Bay Hill.\nEveryone else in the top 50 — all the way to No. 54 — is already in the Masters through various other criteria, including four who won on the PGA Tour this year.\nThe Masters currently has 86 players — that includes Tiger Woods, who has not played since February at Riviera. He is expected to play, though Woods has not formally revealed his plans. He only has to register before teeing off.\nIt does not include Angel Cabrera, who spent two years in prison for gender violence before being released on probation. His manager said in an email the former Masters champion is still two months away from getting a visa to travel from Argentina.\nThe Masters field could reach as high as 90 players. An will get in through the world ranking, and a few players — no more than one will get in — have a chance to play their way into the top 50. The Houston Open and Texas Open winners also get invitations.\nTom Hoge is at No. 57 and likely would need around third place in Houston to get in. Mackenzie Hughes (No. 63) and Alex Noren (No. 66) would need a runner-up finish to have any mathematical chance.\nAmong those on the bubble who chose not to play in Houston are Christiaan Bezuidenhout (No. 55) and Brendon Todd (No. 64).\nThe Augusta National field has 13 players from LIV Golf — 10 recent major champions, newcomers Tyrrell Hatton and Adrian Meronk through the Tour Championship and world ranking at the end of last year, and Joaquin Niemann on a special invitation.\nTwo years ago before the Saudi-funded league was launched, 10 other LIV players were in the field — four of them through the world ranking, five from having won on the PGA Tour and one from being top 12 in the previous year's Masters.\nTGL MULLIGAN LAUNCH\nThe indoor TGL league backed by Tiger Woods and Rory McIlroy will try again in 2025, this time with a new steel-supported structure replacing the inflated dome that collapsed in November, just two months before the league's planned 2024 launch.\nMore in Sports\nThe league of six four-player teams uses a combination of simulators for the long shots and a high-tech, rotating green complex that allows for actual shots during the matches.\nTGL has booked the first three Tuesdays in prime time, starting Jan. 7, on ESPN and ESPN+. That puts it the night after college football and NFL playoff games.\n“January is a tremendous time of year for fans looking for prime-time sports and TGL’s launch will complement the start of the PGA Tour season and take advantage of ESPN’s promotional machine across their coverage of the NFL and college football playoffs,” said Mike McCarley, TMRW Sports founder and CEO.\nThe new SoFi Center on the campus of Palm Beach State College will have 1,500 seats surrounding a field of play roughly the size of a football field.\nStill to be determined is which teams all 24 players will join.\nTeams are set for Boston, Los Angeles and Atlanta. Woods leads the Jupiter, Florida, team but still needs three players, while four players are needed for San Francisco and New York.\nSO LONG SO YEON\nSo Yeon Ryu introduced herself on a big stage when she won the 2011 U.S. Women's Open at The Broadmoor in Colorado. She was rookie of the year on LPGA in 2012, co-player of the year in 2017 and won another major at the ANA Inspiration in 2017.\nIf that wasn't enough, she continued to take college classes and graduated in 2013 from Yonsei University with a degree in sports business.\nAnd now the 33-year-old South Korean, who spent 19 weeks at No. 1 in the world, is ready to walk away. Ryu wrote on Instagram last week the Chevron Championship — the first LPGA major of the year — will be her last before retiring.\n“I am so grateful that I could do what I loved to do, day in and day out, and even make a career out of it,\" Ryu said. \"I am not going to lie; I had some hard patches, but despite some of the challenges, I truly enjoyed it all.”\nRyu has 18 wins worldwide, six of them on the LPGA.\nMASTERS MEMORIES\nLucas Glover returns to the Masters for the 10th time and still has vivid memories of his first visit to Augusta National.\nHe was 6. And he only saw the first hole.\nThis was 1986 — the year Jack Nicklaus went on to claim his sixth green jacket — and Glover and his grandfather, Dick Hendley, had two badges from friends in Greenville, South Carolina, for the Saturday round. They arrived for the 7 a.m. opening of the gates.\n“We put our chairs down there on 1. I thought it was really cool that no one moved them,” Glover said. “We walked over to the range and watched everyone warm up, walked to the first tee with the first group, sat down and watched everybody tee off on 1.”\nAnd they left.\n“When we got home, the leaders were turning on the back nine and we watched it on TV,” Glover said.\nThere was one incident. Glover said his shoe came untied, so he raised his foot onto the rickety chair and it made a grinding noise that caused Ben Crenshaw to back off his tee shot.\n“He gave me the stink eye,” Glover said.\nYears later, Glover was doing an outing with Crenshaw and CBS lead announcer Jim Nantz, and Nantz made him tell Crenshaw the story.\n“He came up after and said, ‘Did I really give you the stink eye?’ I said, ‘Yeah, but I deserved it,’” Glover said.\nDIVOTS\nRory McIlroy and Shane Lowry are playing the Zurich Classic in New Orleans, the only official team event on the PGA Tour schedule. Patrick Cantlay and Xander Schauffele have played it the last three years, winning in 2022. ... This is the sixth time Nelly Korda has reached No. 1 in the women’s world ranking, all within the last three years. ... Cameron Young was the only player with all four rounds in the 60s at the Valspar Championship. ... The JM Eagle LA Championship is raising its purse again to $3.75 million, making it the largest prize fund on the LPGA except for the majors and the season-ending CME Group Tour Championship. Last year, organizers doubled the purse to $3 million.\nSTAT OF THE WEEK\nTiger Woods and Phil Mickelson have each played seven tournaments that count toward the Official World Golf Ranking in the last two years. Mickelson is with LIV Golf, which is not recognized by the OWGR.\nFINAL WORD\n“It’s just always been my dream to never get a real job.” — Peter Malnati, in his 10th year on the PGA Tour, after winning the Valspar Championship.\n___\nAP golf: https://apnews.com/hub/golf",
  "word_count": 1257,
  "scraped_at": "2026-02-14T12:47:01.818634"
}