{
  "article_id": "9fdc3a2e93ff",
  "url": "https://www.sbs.com.au/news/podcast-episode/midday-news-bulletin-6-september-2025/2try2lma8",
  "title": "Midday News Bulletin 6 September 2025",
  "date": "20250906T040000Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\nTRANSCRIPT\n- Police ramp up the pressure in the Dezi Freeman manhunt with a hefty reward\n- World health officials say Mpox no longer an international health emergency\n- Sam Kerr still waiting to return to the field for Chelsea.\nVictoria Police have announced a million dollar reward for information leading to the arrest of Dezi Freeman, as the massive search for the alleged cop killer enters its third week.\nHomicide Squad Detective Inspector Dean Thomas says the money is the largest reward for an arrest in Victorian history.\nFreeman remains on the run after allegedly shooting two officers during a deadly confrontation at Porepunkah, about 300km northeast of Melbourne, on August 26.\nThere have been no official sightings of Freeman - but Chief Commissioner Mike Bush has previously said police have no intention of giving up the search.\n\"Our understanding of him is he understands bushcraft well, which provides a challenge for us, but we keep an absolutely open mind on what options are open to him and those options will inform our approach... The hunt will continue until we find him.”\nSome members of the Australian-Indian community have urged Liberal senator Jacinta Nampijinpa Price to apologise, after she claimed the government prioritises Indian migrants because many of them vote for Labor.\nPrice made the comments in an interview with ABC Radio earlier this week, where she singled out the Indian community as an example of her claim that Labor was accepting migrants who support their policies, their views and vote for them as well.\nIn the western Sydney suburb of Harris Park — also known as Little India — some locals have told SBS News the remarks have left them feeling unfairly targeted, coming just days after anti-immigration rallies that took place across the country.\nUS President Donald Trump has ordered the US Department of Defence to change its name to the Department of War.\nThe Department of War was its original name from 1789 until it was changed in 1947, when officials sought to emphasise the Pentagon's role in preventing conflict.\nTrump's executive order represents his latest effort to rebrand the US military, which has included presiding over an extraordinary military parade in downtown Washington DC, and restoring the original names of military bases that were changed after racial justice protests in 2020.\nSome of Trump's Republican supporters in Congress have now proposed legislation to make the name change official, which the President says is his preference.\n\"This is something we've thought long and hard about. We've been talking about it for months, Pete and I, and Dan. I think it's a much more appropriate name, especially in light of where the world is right now.\"\nOfficials say Mpox is no longer being considered an international health emergency.\nWorld Health Organisation chief Tedros Adhanom Ghebreyesus says the decision is based on advice from its Emergency Committee, which has met every three months to evaluate the outbreak.\nHe says the commitee has noted a sustained decline in cases since the emergency was declared in August last year, especially in the Democratic Republic of Congo and in other affected countries including Burundi, Sierra Leone and Uganda.\nBut the chief says despite the change in alert level, Mpox remains a potentially deadly and serious disease in a number of communities.\n\"Of course lifting the emergency declaration does not mean that the threat is over, nor that our response will stop. And I note the Africa CDC's declaration yesterday that Mpox remains a continental emergency.\"\nA 102-year-old has become the oldest person to summit Mount Fuji in Japan.\nKokichi Akuzawa climbed the mountain in early August - and his achievement has been now officially recognised by Guinness World Records.\nAkuzawa climbed with his 70-year-old daughter Motoe, his granddaughter, her husband and four friends from a local mountain climbing club.\nHe says he spent three months training before the Fuji climb, waking at 5 a.m. for hourlong walks and tackling roughly one mountain each week, mostly around Nagano prefecture to the west of Gunma in central Japan.\nTo sport and in football news,\nSam Kerr will have a further frustrating wait to make her return to the game after 20 long months on the sidelines.\nThere had been considerable anticipation that Australia's superstar skipper would burst back into action for Chelsea in the Women's Super League opener against Manchester City.\nBut Kerr ultimately went unused as a substitute in the game at Stamford Bridge, instead watching fellow Matilda Ellie Carpenter light up the start of the WSL season by scoring Chelsea's first goal in their 2-1 home victory.",
  "word_count": 780,
  "scraped_at": "2026-02-14T12:43:43.957795"
}