{
  "article_id": "9fe95dd4f828",
  "url": "https://www.nytimes.com/athletic/5719108/2024/08/24/canada-drone-herdman-olympics-investigation/",
  "title": "Canada drone scandal : How did it happen , questions over Herdman role , what must change",
  "date": "20240824T170000Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In the aftermath of the drone scandal that rocked Canada’s women’s national team at the Paris Olympics, Canadian soccer has been left with many unanswered questions.\nWhen exactly did drone usage and spying become prevalent in Canada’s national soccer teams? And who started it?\nIn July, Canada Soccer committed to an independent review to try to answer those questions. The organization retained Toronto-based lawyer Sonia Regenbogen to primarily focus on actions taken by Canada Soccer representatives related to what occurred at the Paris Olympics after it emerged Canada’s women’s team had flown drones over two New Zealand training sessions. The team was deducted six points but still reached the quarter-finals, losing on penalties against Germany.\nAdvertisement\nCanada women’s national team coach Bev Priestman was suspended in July by FIFA from soccer-related activities for one year.\nGO DEEPER\nCanada’s Olympic soccer spying scandal explained: What we know, who’s involved and what's next\nIn conjunction with her suspension, FIFA published an email exchange between Priestman and an unknown Canada Soccer staffer. In the email, Priestman wrote of drone usage: “I know there is a whole operation on the Men’s side with regards to it.”\nThe independent review will also examine the history that led up to this scandal.\n“The more I learn about this specific matter, the more concerned I get about a potential long-term and deeply embedded systemic culture of this type of thing occurring, which is obviously completely unacceptable,” Canada Soccer CEO Kevin Blue told reporters during a July conference call.\nThat brings John Herdman — Canada women’s national team coach from 2011 to 2018, then the men’s coach until 2023 and now Toronto FC head coach — and his role into focus.\n“I’m highly confident that in my time as a head coach at an Olympic Games or World Cup, we’ve never been involved in any of those activities,” Herdman said on July 26.\n“I’ve always gone into Olympic Games, World Cups, big events, with integrity in mind and the ability to compete at the highest level, following the rules and processes. So for my side, I’ll help Canada Soccer where I can with that review.”\nFurther concerns have emerged over potential drone usage in Canada, however.\nMultiple sources, speaking anonymously to protect relationships, told The Athletic that ahead of the July 10 first leg of the Canadian Championship semi-final between Toronto FC and the Canadian Premier League’s Forge FC, a drone was spotted above Tim Hortons Field in Hamilton during a Forge training session. One person familiar with the incidents, who will remain anonymous to protect relationships, told The Athletic that Forge made Canada Soccer aware of possible drone usage but the team did not lodge an official complaint.\nAdvertisement\nIt is not clear who was responsible for this drone, which was spotted before the first reported drone incident at the Olympics on July 19.\n“Over the last few weeks, we have been made aware of speculation regarding this type of activity. That information has been forwarded to the independent, third-party investigator who is leading the external review,” said Paulo Senra, chief communications officer for Canada Soccer. “A disciplinary process for this tournament is in place to adjudicate and sanction violations of the Canada Soccer Code of Conduct or tournament regulations if that is required.”\nForge FC and Toronto FC declined to comment to The Athletic.\nForge would go on to win the first leg 2-1. The second leg of the Canadian Championship semi-final is on August, 27.\nIn addition, Canada Soccer will eventually release the findings of the independent review. One more lingering question that the review could attempt to answer is how potentially “systemic” drone usage became prevalent within Canada Soccer, particularly on the men’s side, and what should change to ensure it does not happen again.\nHerdman moved from Canada’s women’s national team to the men’s side early in 2018 to much fanfare, having helped to guide the women’s team to two bronze medals at the 2012 and 2016 summer Olympics. He was seen throughout Canada Soccer as a brilliant and transformative coach and, when rumours began to circulate that Herdman could head to England to take on the women’s national team job late in September 2017, many felt pressure to keep him in Canada.\nHerdman moved from the women’s team to the men’s team in January 2018. He was also named the national director of the men’s program as Canada Soccer fired then-head coach Octavio Zambrano.\nHerdman quickly vaulted to new standing within Canada Soccer.\nAdvertisement\n“We had to get it right, right away,” then Canada Soccer general secretary Peter Montopoli told The Athletic in 2022. “It just made bloody sense that the next step of the evolution was John.”\nSenior members of the organization were cognizant of keeping Herdman engaged and motivated in the men’s team project. In 2018, he was given an unprecedented contract through the 2026 World Cup. And as the men’s team began their turnaround in the buildup to the 2022 World Cup, Herdman became viewed by many in the organization as the most important person in Canadian soccer.\nYet deep pockets did not always accompany Herdman’s power.\nCompared to many nations where soccer is a more prevalent sport, Canada Soccer has never enjoyed financial clout. Herdman himself raised funds for the men’s national team through World Cup qualifying. This was a noble pursuit, but it also illustrated how Herdman and his staff did not enjoy the kind of financial resources other national teams did.\nHeavily funded organizations might be able to employ multiple coaches who could pre-scout opponents via video. Allocating resources differently could have allowed more time spent pre-scouting opposition teams.\nStill, Herdman was seen as a master motivator of players who might have previously gone overlooked by the men’s national team program. He often relied heavily on instilling self-belief through rousing speeches. Some of his methods of motivation, including the use of a medieval sword designed specifically for the men’s team to symbolize their quest to qualify for the 2022 World Cup, raised eyebrows inside and outside the program. But the results spoke for themselves: Herdman pushed Canada to their first men’s World Cup since 1986.\nYet what Herdman wasn’t always providing was the kind of nuanced tactical instruction some of his players craved. Yes, some of Herdman’s tactical planning worked well, such as his decision to move to a 4-2-2-2 box midfield to stifle the United States in 2019 for Canada’s first competitive win over their rivals in a generation. But increasingly, as many of Herdman’s players advanced in their club sides, many in and around the national team wondered why Herdman’s level of specific, on-field tactical instruction did not always match his use of motivational tactics.\nHerdman and former Canada Soccer coach Joseph Lombardi also enjoyed a close working relationship. Lombardi was part of multiple men’s national team coach staff in 2018 and 2019. He was one of the coaches immediately sent home from the Paris Olympics for his role in the drone scandal.\nAdvertisement\nMultiple sources said concern over Canada’s attempts to spy on opponents to collect information on opponents began as early as 2019.\nIn 2021, Honduras’ national team accused Canada of spying on a training session during World Cup qualifying. The Athletic reported that Canada used a staffer to observe a United States training session in 2021 as well.\n“I know for a fact every team does it in some capacity,” the United States men’s national team midfielder Tyler Adams said on The Cooligans podcast in July. “I don’t know about drones… that seems a little bit crazy. But there are always people when you train in stadiums the day before games: someone who will be acting like a worker and they’re really working for a different federation or something. It happens. It happens consistently. I’m positive of that.”\nHerdman departed Canada for Toronto FC after losses to the United States in the 2023 Nations League final and the 2023 Gold Cup quarter-finals.\nAfter multiple disappointing seasons including a last-place finish in MLS in 2023, Herdman has guided the high-spending outfit back towards a path of respectability. Early in the season, TFC looked consistently revitalized and energized on the field. They currently sit in a wild card spot in the Eastern Conference.\nHerdman also recently lost one of the biggest backers at TFC in Bill Manning, a driving force behind Herdman’s hire. The former TFC president mutually parted ways with the team in July.\nCould Herdman’s future with the club end up being impacted by the findings in Canada Soccer’s independent review? The review will likely only cover Herdman’s time with the national teams, but could constant questions about any potential use of drones lead to questions about his future as well?\nAs far as Canada Soccer is concerned, genuine changes to any unmitigated autonomy coaches enjoy could be considered as part of the independent review. If Canada Soccer staffers were unable to report independently about drone usage or any other ethical shortcomings, an avenue to do so should be one of those changes.\nAdvertisement\nIn the FIFA report, a March 2024 email exchange between Priestman and an unnamed Canada Soccer performance analyst discusses a “spying conversation.” The analyst stated their “reasons for me being unwilling to do this moving forward,” which include moral objections. The analyst confirmed, “You will not be asking me to fulfil the role of ‘spying’ in the upcoming camp & future camps.”\nPriestman forwarded the analyst’s email to a Canada Soccer staffer, whose name is redacted. In that email, she referenced the “whole operation on the Men’s side.”\n“Yesterday in a meeting when discussing, I asked to propose a alternative solution as for scouting it can be the difference between winning and losing and all top 10 teams do it. I received this more ‘formal’ email this morning and so just after guidance really as to what from a HR stand point I can do or do I need to find another solution in resourcing?” Priestman wrote.\nIn the wake of Priestman’s suspension, Blue said there was attempted drone usage during Canada’s recent run at Copa America.\n“My current understanding is that the fact pattern of that instance is significantly different than what occurred here, especially as it relates to the potential impact of competitive integrity,” Blue said.\n“I’ve spoken with our current head coach (Jesse Marsch) about the incident after it occurred and I know he has denounced it as a practice to his staff,” Blue added.\nCanada Soccer’s efforts to right the ship will continue with the independent review. One question though remains clear: did Canada’s national team coaches enjoy unprecedented levels of autonomy?\n“Canada Soccer will continue to communicate regularly about this issue and take swift, decisive steps to restore public trust,” the organization said in a July 31 statement.\nCan the organization gain the trust of the public ahead of Canada co-hosting the 2026 men’s World Cup? To maximize sponsorship revenue and fan interest, doing so will be paramount.\nAdvertisement\n“Canada Soccer’s independent external review is well underway and because of this, it would be inappropriate for us comment further. When we have more to share, including conclusions of the review, we will communicate it publicly,” Senra said.\nWhat happens as a result of Canada Soccer’s independent review, and whether drone usage and spying at the club and national level can be eradicated will go a long way to regaining that trust.\n(Top photo: Ulrik Pedersen/DeFodi Images via Getty Images)",
  "word_count": 1917,
  "scraped_at": "2026-02-14T12:17:44.315869"
}