{
  "article_id": "9fed0e1bac70",
  "url": "https://www.bbc.co.uk/sport/football/articles/c23zkemn5xmo",
  "title": "Eni Aluko: Women's football punditry debate explained after Ian Wright row",
  "date": "2026-02-10T17:48:09.113Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "How Aluko sparked women's football punditry debate\n- Published\nWhen Eni Aluko appeared as a pundit on Match of the Day in 2014 she made history, becoming the first woman to do so and paving the way for the likes of Alex Scott and Steph Houghton to follow in her footsteps.\nIn the years since, the former England, Chelsea and Juventus forward has become a regular feature of football coverage with broadcasters including ITV and TNT Sports.\nBut in the past week she has reignited a debate first sparked a year ago about the presence of male pundits in women's football, claiming that opportunities for female former players are being reduced by men blocking the way.\nThe row erupted over radio, podcasts and television, generating heated arguments online, and drawing in other pundits and presenters.\nBBC Sport explores how the matter has become a talking point again.\nInitial row with Wright and subsequent apology\nIn 2025 Aluko made controversial comments about ex-Arsenal and England forward Ian Wright.\nAluko told BBC Radio 4's Woman's Hour that male pundits including Wright - for years a strong advocate for women's football and widely considered an ally by players past and present - were taking too many broadcasting opportunities away from female pundits by regularly appearing in TV coverage of the women's game.\n\"I've worked with Ian a long time. I think he's a brilliant broadcaster, but I think he should be aware [of how much he is doing in the women's game].\n\"I think we need to be conscious and we need to make sure that women are not being blocked from having a pathway into broadcasting in the women's game.\"\nShe later apologised to Wright, insisting she \"was trying to make a broader point about the limited opportunities for women in football\".\nWright responded by saying he had noted but could not accept the apology, insisting: \"I'm very disappointed by what Eni has said. I want to move on from it.\"\n'Gatekeeping' debate reignited in podcast appearance\nAluko has faced sexist and misogynist online abuse since becoming a pundit.\nLast year former Manchester City captain Joey Barton was found guilty of sending grossly offensive communications about her, as well as fellow pundit Lucy Ward, after a trial.\nThe judge, sentencing Barton to a suspended six months in custody, said that Barton's posts about Aluko - including comparing her to the serial killer Rose West - constituted a \"racially charged and sexist attack\".\nIn an episode of the 90s Baby Show podcast last week, Aluko discussed the impact the Barton case had on her and her family, and was critical of the fact she and fellow pundit Fara Williams were not included in live broadcast coverage of England's victory in last summer's Euros final.\nOf the six pundits featured in BBC and ITV coverage of the final, two were men - Nedum Onuoha and Wright.\n\"In the women's game, the opportunities are even more limited, so the main characters of the show should be the women,\" the 38-year-old said.\n\"Men should be part of that. I'm not saying anybody should be excluded. I believe in diversity wholeheartedly, but the same way we've played a role in the men's game, that's a supporting role, you're part of the ensemble, you're never going to get the premium final games, it should be the same way for women's football.\"\nAluko was subsequently criticised online, and followed up by posting two videos in which she again accused Wright of disrespect.\n\"When I apologised to Ian Wright publicly and privately, he had an opportunity to show the grace and allyship that he showed to many other people, and to prove that he is the ally that he says he is,\" she said.\n\"Unfortunately, my sincerity, my humility, was met with disrespect.\"\nTNT Sports presenter Laura Woods subsequently hit back at Aluko, calling her comments \"damaging\".\nShe wrote on X: \"[The idea that] 'the women's game should be by women for women' is one of the most damaging phrases I've heard. It will not only drag women's sport backwards, it will drag women's punditry in all forms of the game backwards.\n\"If you want to grow something, you don't gatekeep it. We want to encourage little boys and men to watch women's football too, not just little girls and women. And when they see someone like Ian Wright taking it as seriously as he does - they follow suit. That's how you grow a sport.\"\nAluko responded with a statement saying: \"I believe that women's football should prioritise women as the faces of the sport - it's as simple as that.\n\"I think women should be the dominant force in the women's game in the same way that men are the dominant force in the men's game. That means men should play more of a supporting role.\n\"That's all I'm saying - and people are quite free to disagree whilst respecting my right to an opinion too.\"\nHeated radio argument\nAluko then appeared on Talksport on Tuesday afternoon with former Crystal Palace chairman Simon Jordan.\nThe pair clashed in a fraught and at times deeply personal argument.\nJordan criticised Aluko's character, calling her \"not particularly enlightening, illuminating, engaging or charismatic\", and implied that punditry work was offered to her and others because of their gender or background.\nAluko, who was repeatedly spoken over by Jordan, criticised TNT Sports colleague Woods.\n\"I would consistently go to Laura and say, 'How do you think it went? What do you think? How did it go?'\" she said.\n\"I had to look at the messages yesterday and think, hold on, I feel a bit gaslit here. Laura consistently said to me, 'I think you're a brilliant broadcaster. I think you're a brilliant pundit'.\n\"So I think there's a little bit of serving her argument at this point, which I respect. She doesn't agree, and that's fine. But I think there's an insinuation in there that you don't meet the standard.\n\"I've worked too hard for people to conclude that because you're not seeing me on screen, I'm not good enough. That's not true.\"",
  "word_count": 1020,
  "scraped_at": "2026-02-14T11:17:47.510720"
}