{
  "article_id": "9ff45556d1de",
  "url": "https://www.syracuse.com/tv/2025/12/how-to-watch-john-cenas-last-match-wwe-live-stream-tonight.html",
  "title": "Where to watch WWE Saturday Night Main Event online : Start time , TV channel , free live stream without StreamEast",
  "date": "20251213T223000Z",
  "domain": "syracuse.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "John Cena, the modern Greatest of All Time of the WWE, bids the promotion an action-packed and sure-to-be emotional farewell at Saturday Night’s Main Event on December 13 (12/13/2025) at 8 p.m. ET, live from Capital One Arena in Washington, D.C. Here’s how to watch live.\nSaturday Night’s Main Event airs exclusively on Peacock on Friday, December 13, and a premium or premium-plus subscription is required to watch.\nWhere to watch John Cena’s last fight live and on demand for free\nSaturday Night’s Main Event is included with a subscription to Peacock Premium ($10.99/month) or Premium Plus ($16.99/month). There is no free trial available, however, fans can bundle Peacock Premium with Apple TV+ for $14.99 per month and save on both services.\nWWE fans can also get Peacock Premium for free with a subscription to Instacart+.\nWhat’s included with Peacock?\nIn addition to a wide range of WWE content, subscribers can watch ad-supported TV, movies, live sports and more with Peacock Premium. Peacock is the exclusive home to around 175 English Premier League games during the 2025-26 Premier League season. NFL Sunday Night Football games on NBC are simulcast on Peacock. The service also includes full episodes of NBC and Bravo hit series, such as “The Office” and “Parks and Recreation,” as well as the latest episodes of ongoing series and Peacock Originals like “The Traitors” and “Poker Face,” are added weekly. Peacock is also home to the Olympics and Paralympic Games, horse racing, motocross, PGA Tour, Tour de France and more high-profile sporting events throughout the year, making it an essential streaming service for any sports lover.\nWho is fighting on Saturday Night’s Main Event this week?\nJohn Cena will square off with Gunther, winner of “The Last Time Is Now” tournament. But that’s just the main event of a jam-packed fight card featuring:\n- Undisputed WWE Champion Cody Rhodes vs. NXT Champion Oba Femi\n- World Tag Team Champions AJ Styles & Dragon Lee vs. Je’Von Evans & Leon Slater\n- Bayley battles against NXT’s Sol Ruca\nWhat is ‘Saturday Night’s Main Event’ about?\nSaturday Night’s Main Event is one of WWE’s flagship wrestling specials, along with Royal Rumble, WrestleMania and more, that dates all the way back to 1985, with several iterations along the way. The promotion’s biggest stars are always on display for these events. This year, there have been four Saturday Night’s Main Event specials already, featuring everyone from John Cena and Cody Rhodes to Logan Paul and Drew McIntyre.\nWhat to expect at Saturday Night’s Main Event this week\nAt the heart of the show is the emotional culmination of John Cena’s legendary career when he’ll step into the ring for what’s being promoted as his final WWE match against the dominant Gunther, who earned this spot by winning The Last Time Is Now tournament and has been praised by both fans and fellow wrestlers alike.\nBut it’s not just about Cena’s farewell. One of the evening’s standout bouts pits Undisputed WWE Champion Cody Rhodes against NXT Champion Oba Femi, a clash that feels like a symbolic duel between the present and future of the company.\nTag team action also spices things up as AJ Styles and Dragon Lee defend against rising stars Je’Von Evans and Leon Slater, offering a blend of seasoned skill and youthful fire. On the women’s side, Bayley takes on Sol Ruca, giving the NXT standout a big-league spotlight.\nExpect this night to be packed with high emotions, memorable moments, and a showcase of WWE’s blending of eras. Whether you’re in it for Cena’s send-off, the hard-hitting championship clashes, or the burst of new talent making their mark, it’s shaping up to be a must-see lineup.\nMore Entertainment stories\n- How to watch WWE Friday Night SmackDown! free live stream tonight\n- How to watch ‘RuPaul’s Drag Race’ Season 18, Episode 7 for free without cable\n- Dierks Bentley bringing ‘On The Map Tour’ to Upstate NY: When, where, tickets\n- Didn’t get Zayn Malik ‘Konnakol Tour’ tickets? Here’s where you can still buy them\n- How to watch ‘Love Story: John F. Kennedy Jr. & Carolyn Bessette’ premiere for free on FX",
  "word_count": 693,
  "scraped_at": "2026-02-14T12:50:38.475037"
}