{
  "article_id": "a01ca0e13891",
  "url": "https://www.techradar.com/streaming/entertainment/watch-tokyo-marathon-2025-live-streams",
  "title": "How to watch Tokyo Marathon 2025 live streams for free",
  "date": "20250301T123000Z",
  "domain": "techradar.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "How to watch Tokyo Marathon 2025: live streams for race, start time\nTokyo Marathon broadcasters, TV channels and free streams\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nYou are now subscribed\nYour newsletter sign-up was successful\nWatch the Tokyo Marathon as 169 elite runners lead a field of more than 38,000 people through the streets of the Japanese capital. Below we have all the information on how to watch the Tokyo Marathon from anywhere in the world, with details on worldwide TV channels, broadcasters and live streams on TV screens, laptops, tablets and mobiles.\nClick to read more about the Tokyo Marathon live stream▼\nThe 2025 Marathon Majors Series gets underway in Japan with the 18th running of the Tokyo Marathon. Traditionally attracting a strong field of elite athletes, this year is no exception. In the men’s race, Kenya’s Benson Kipruto will bid to defend his title but will face fierce competition from the likes of Ugandan middle-distance superstar Joshua Cheptegei and two-time winner Birhanu Legese of Ethiopia.\nThe women’s race is also shaping up to be hugely exciting as the last three winners of the event will line up in Tokyo. Ethiopia’s Sutume Asefa Kebede triumphed last year, Ethiopia’s Rosemary Wanjiru was the winner in 2023 and former world record holder Brigid Kosgei (also of Ethiopia) won in 2022. Adding extra intrigue is the fact that another former world record holder will be in action as the 51-year-old Paula Radclife attempts to roll back the years.\nHere's where to watch the Tokyo Marathon 2025 online from anywhere, and potentially for FREE.\nWatch Tokyo Marathon 2025 Quick Guide\nDate and times\n- Date: Sunday, March 2\n- Start time (Elite): 12.10am GMT / 11.10pm AEDT / 7.10pm ET (Sat) / 4.10pm PT (Sat)\nBest free stream\nFREE Tokyo Marathon live stream broadcasters\nYou can watch Tokyo Marathon 2025 for FREE on RTVE in Spain.\n- Watch FREE on RTVE Play – Spain\nUnblock geo-restrictions: Use a VPN to watch Tokyo Marathon 2025 for free on your usual streaming service above if you're away from Spain.\nUse a VPN to watch any Tokyo Marathon 2025 stream\nNordVPN – try it risk-free for 30 days\nUse NordVPN to watch your usual New York Marathon free stream from abroad. We test all the providers and we rate Nord as the best VPN. There's 24/7 support available, a money-back guarantee and, best of all, there's currently over 70% off with this deal.\n- TV tips email: Never be stuck for anything to watch again\nHow to watch Tokyo Marathon live streams in the US\nIf you want to watch the Tokyo Marathon in the US, coverage is available to stream on FloSports.. A subscription to the streaming service costs $29.99 per month or $150 per year.\nOutside the US? If you want to watch whilst traveling abroad you'll need to download NordVPN, as detailed above.\nHow to watch Tokyo Marathon live streams in the UK\nLive coverage of the 2025 Tokyo Marathon will be broadcast on TNT Sports and Discovery+.\nIf you don't get TNT Sports via your TV package, you can take out a standalone subscription on Discovery+.\nA premium subscription, which includes all that plus TNT Sports (Premier League, Champions League and Europa League football plus rugby, wrestling, UFC, and MotoGP), costs £30.99 per month.\nNot at home and want to use your usual platform to watch the Tokyo Marathon? Try using NordVPN.\nCan you watch Tokyo Marathon live streams in Australia?\nUnfortunately, it looks like the Tokyo Marathon hasn't made the cut in Australia.\nIf you're visiting Australia from somewhere where the race is on, you can use one of the best VPN service providers to tap into your usual coverage from home. Our favorite is NordVPN.\nHow to watch Tokyo Marathon live streams in Canada\nIn Canada, the Tokyo Marathon is being shown on FloSports. . A subscription to the streaming service costs $29.99 per month or $150 per year.\nIf you're not at home and find yourself blocked from you Flo subscription, NordVPN should help you to access the stream from anywhere.\nCan I watch the Tokyo Marathon 2025 for free?\nFree Tokyo Marathon 2025 coverage is available in Spain via RTVE Play.\nRemember that, if you're traveling away from home, you can use a VPN to watch Tokyo Marathon free from abroad on your usual streaming service.\nWhen is the 2025 Tokyo Marathon?\nThe 2025 Tokyo Marathon takes place on Sunday, March 2.\nWe test and review VPN services in the context of legal recreational uses. For example: 1. Accessing a service from another country (subject to the terms and conditions of that service). 2. Protecting your online security and strengthening your online privacy when abroad. We do not support or condone the illegal or malicious use of VPN services. Consuming pirated content that is paid-for is neither endorsed nor approved by Future Publishing.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nAdrian is a freelance journalist and copywriter based in the UK. He’s written about sport for a vast range of publications including World Soccer Magazine, Newsweek, Yahoo, FourFourTwo and Red Bull. Although he has covered everything from the NBA Finals and French Open, to the London Olympics and Formula 1 in Abu Dhabi, his great passion remains football – a sport he could write and talk about all day long.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 928,
  "scraped_at": "2026-02-14T12:49:42.512442"
}