{
  "article_id": "a01df8b0ecae",
  "url": "https://wellington.scoop.co.nz/?p=157261",
  "title": "Wellington . Scoop » Over 100 , 000  visitor nights  in Wellington hotels during FIFA event",
  "date": "20231217T043000Z",
  "domain": "wellington.scoop.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Over 100,000 “visitor nights” in Wellington hotels during FIFA event\nNews from WCC\nA report commissioned by the Wellington Regional Development Agency to evaluate the costs and benefits to Wellington of hosting the FIFA Women’s World Cup 2023 (FWWC) has identified a net benefit to the city of $24.6 million.\nThe cost benefit ratio is 1.42, meaning that for every dollar invested there was a returned benefit of $1.42. The evaluation, undertaken by Fresh Information, exceeds expectations and is a strong result compared to 2019 projections.\nThe $24.6 million net benefit to Wellington was $13m more than projected in the 2019 evaluation and the cost benefit ratio of 1.42 was higher than that achieved in Auckland, Hamilton and Dunedin. Nationally the cost benefit ratio was 1.34.\nThe tournament generated 100,124 visitor nights in Wellington with $44.7 million of additional expenditure in Wellington across event operations and tourism.\nOther results included:\n243,645 tickets issued across the nine matches – an average of 27,072 per match. This is the equivalent of 0.45 tickets per capita, more than twice the 0.21 rate of Auckland.\n94,085 unique attendees with 61% from Wellington, 18.4% from other parts of New Zealand and 20.1% international visitors.\n60,000 people visited the FIFA Fan Festival run by WellingtonNZ at the waterfront.\n57,817 Wellingtonians went to a FIFA game – 92% of those thought hosting the FIFA games increased their pride in the city and made it a more enjoyable place to live.\nWellingtonNZ events and experience general manager Warrick Dent says the report shows the tournament was an outstanding success for the city, enjoyed by locals and visitors alike and provided a sound economic return.\n“The FIFA Women’s World Cup exceeded expectations across many areas and has left a lasting positive impact on Wellington showcasing the city as a vibrant and friendly place to visit capable of hosting major events which augurs well for the future. It also generated significant social, economic and cultural benefits and was embraced by locals.\n“We are very proud to have delivered such a successful event which would not have been possible without the input of a range of people and organisations and we hugely appreciate the work of everyone involved.”\nIn addition to strong economic results, this evaluation found that hosting FWWC 2023 delivered a range of intangible benefits for football and women in Wellington and New Zealand including achievement of the key objective of “increasing the visibility of, and value placed on, women in sport and wider society”.\nThe FWWC was held in July and August and was one of the largest and most complex sports events ever hosted in Wellington.\nNine of the 29 cup matches held in New Zealand were held in the capital – the same number as Auckland. However, Wellington had the busiest schedule of any stadium in Australia and New Zealand with seven pool games played over 14 days, which meant a match every second day.\nThe tournament has provided an important legacy to Wellington with increased visibility and perception of women’s sport.\nInvestment in improving facilities such as playing surfaces and changing rooms to comply with FIFA requirements took place at Sky Stadium, Martin Luckie, Newtown and Porirua Parks.\nThe report also said the knowledge and experience from hosting the matches has enhanced Wellington’s major event capability.\n1 comment:\n-\nRatepayer, 18. December 2023, 7:04\nForeign owned hotels did well, how much did we pay?",
  "word_count": 569,
  "scraped_at": "2026-02-14T12:05:29.464613"
}