{
  "article_id": "a0438c7a6faa",
  "url": "https://theathletic.com/5115568/2023/12/06/england-women-nations-league-conclusion/",
  "title": "England ran out of time and goals on a dramatic night in Glasgow",
  "date": "20231206T100000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lucy Bronze has her hands on her knees, crouching down, eyes fixed, staring across the England team huddle. One of the staff members holds his phone, waiting for the Netherlands’ game against Belgium to end.\nLauren Hemp and Esme Morgan crowd around him, peeking at the screen, nervously waiting. Alex Greenwood cannot bear to look. A couple more seconds and they can properly celebrate a 6-0 away win against Scotland at Hampden Park.\nAdvertisement\nBut then Bronze plummets to the floor, head in her hands. England assistant Arjan Veurink walks away in exasperation. The tight linking of arms is broken. The news has dropped. “They’ve scored,” the staff member says.\nIt’s true. Some 700 miles away in Tilburg, in the 95th minute, Damaris Egurrola has just made it 4-0 to the Netherlands against Belgium, pipping England to a place in February’s Nations League semi-finals on goal difference (+8 to +7) and so costing Team GB a potential spot in the women’s football tournament at the Paris-hosted Olympics Games next summer.\nEngland’s demolition of Scotland was not enough for them to win the group.\nIt had been a night full of twists and turns and late drama.\nAt half-time at Hampden, England looked in control. Leading 4-0 thanks to goals from Alex Greenwood, Lauren James (two) and Beth Mead, they were topping the group on goals scored as the Netherlands were only 1-0 up.\nEngland had a job to do and were on a mission. There was no time for celebrations after they scored.\nAs soon as a goal went in, Bronze and Fran Kirby pointed to the ball, urging their team-mates to retrieve it and run back to the halfway line. Manager Sarina Wiegman was feeding in information from the Netherlands game to the player closest to her on the touchline as and when it was appropriate.\nKirby’s 49th minute goal put England 5-0 up and in a commanding position but they still needed to continue their ruthlessness. Over in Tilburg, the Dutch were breathing down their neck. Ten minutes after Kirby got the fifth, Lineth Beerensteyn scored her second of the night to give the Dutch a 2-0 lead. If England were to concede it could all change and there were nervy moments in defence.\nAn underhit pass from Morgan and hesitation from goalkeeper Mary Earps allowed Kirsty Hanson to pounce, only for Earps to spare England’s blushes. Abi Harrison nearly snuck in a goal with a deft touch while Martha Thomas could have definitively ended England’s dreams in added time had her header not been clawed away by Earps.\nAdvertisement\nWhen asked if her heart was in her mouth at that stage, England left-back Niamh Charles said: “For sure, but also you are in the moment. You are just playing, competing.”\nAt that moment, England were going through on goals scored. But a minute later, Egurrola struck in the 91st minute to make it 3-0 and take the Netherlands back into first place on goal difference.\nAn England staff member ran to the technical area to tell Wiegman the Dutch had a third. Wiegman said to Bronze: “We have to score now, we have to go.”\n“We were pushing to score that goal anyway because that can change at any minute,” said Wiegman. “We couldn’t play any scenario because there was no time, it was the end of the game.”\nAnd so, in her trademark buccaneering fashion, the 32-year-old full-back sprinted forward. A minute after Damarris made it 3-0 in Tilburg, in the 93rd minute in Glasgow, Bronze responded, heading in England’s sixth at the back post to put them back on top of the group via goals scored.\nBronze finally allowed herself to celebrate, fists clenched, letting out a guttural roar and falling to the turf.\n“I thought, ‘Now we’re going to get it (win the group)’,” said Wiegman. “But it was not enough. That’s football.”\nThe full-time whistle blew at Hampden. England had done all they could. Bronze was explaining the situation to her team-mates. At that point, they were progressing to the Nations League semi-finals but they refrained from showing any sign of jubilation.\nEngland gathered in that huddle, arm in arm, excitedly waiting for confirmation of good news.\nBut then Egurrola silenced them. Her second added-time goal in the space of four minutes sent the Netherlands through to the next stage of the competition — and to within one win of the Olympics.\nFor the first time in a long time, Wiegman was speechless in the huddle.\nAdvertisement\n“I actually don’t know what to say,” she told the players. “I’m really proud of our performance and what we did this whole week. But it’s not enough and it’s really disappointing.”\nThe England manager was clearly affected by the result. A tinge of anger, frustration and sadness came across in her press conference when reflecting on perhaps what is her biggest failure to date.\n“It’s the first time that it’s such a big disappointment,” she said. “I thought we performed really well, so that’s hard to take.”\nThe performance against Scotland would have sufficed had it not been for England’s disappointing results earlier in the group, losing away to both the Dutch and Belgium. There were warning signs early on. At times against different opponents, they were not clinical enough offensively despite dominating possession.\nBefore the Scotland game, only 32 per cent of England’s 87 shots had been on target. Defensively, they made some poor decisions, committed unnecessary errors and gifted goals. Wiegman believes the results, especially the 3-2 defeat against Belgium in October, were not a reflection of how the team prepared in camp.\nLast night, England showed up. Ultimately, the damage was done earlier in the campaign.\n“Dwelling on them (the what-ifs), you could go round and round in circles all the time,” said Charles.\nWiegman and her players are serial competitors and winners. Despite the belief that missing the Olympics will allow some of England’s squad more rest following three consecutive tournament summers, the 2022 European champions and 2023 World Cup finalists want to claim more medals.\n“It was an amazing experience being out there and being able to call yourself an Olympian,” said Kirby, who was in the Great Britain squad that got to the quarter-finals of the previous Olympics in Japan two years ago.\nAdvertisement\n“You want to go to every major tournament,” added Wiegman. “The career of a football player is (only) a certain amount of time, so if you can play every major tournament of course every player wants that.\n“We have to look at the (demands of the) calendar. The players are not robots. They need some rest too. But instead of a tournament? That goes a little bit too far.”\nInstead of battling it out with the top European nations in February for one of the two spots available at Paris 2024, England will return to playing friendlies and no doubt experience a heavy dose of resentment that they are the ones missing out — particularly when they reflect on how close they came.\nGO DEEPER\nTeam GB, the 2024 Olympics and why failing to qualify matters\n(Top photo: Stu Forster/Getty Images)",
  "word_count": 1196,
  "scraped_at": "2026-02-14T14:08:30.172106"
}