{
  "article_id": "a05019c6be64",
  "url": "https://timesofindia.indiatimes.com/blogs/voices/naval-leadership-lessons/",
  "title": "Naval leadership lessons",
  "date": "20250828T080000Z",
  "domain": "timesofindia.indiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Naval leadership lessons are less in classrooms and more demonstrative at work! More action-oriented and less sermonising. It shows more than it says and therefore is simpler to understand, imbibe and follow.\nThere are leadership schools for officers and senior sailors, and military leadership and modern leadership lessons are imparted to all at various stages. But in my experience, we all assimilate by seeing more than reading – having attended these courses and having had the opportunity to teach.\nAll types of leaders exist in the navy and perhaps in all three services. Transactional as well as transformational, authoritarian as well as democrat. Many have traits of great leaders and some lack the same. The ‘situational’ leadership approach could also be applied to them and many would emerge with flying colours and few would fall in critical situations. War time leaders as well as peace time heroes function in the dynamic world of Navy!\nNaval leadership lessons are not complex, sophisticated theories but a process and are cultivated by observing simple day-to-day routine in harbour and at sea. The main focus is on your ‘men’! No matter how modern and technically superior your weapon systems are, the people who operate them are key. Their morale is to be maintained and the naval leadership hinges on this concept of morale.\nThe first lesson we receive is to ‘know your men’, ‘rubbing shoulders with your men’. There is a ‘divisional system’ in place and an officer has about 25 to 30 sailors under him whose welfare, training, conduct and discipline he has to watch. He maintains documents and presents to the Commanding Officer periodically . This system is the backbone and foundation of the naval human resource management and leadership. Time-tested and proven and when it fails sometimes the officer is invariably responsible.\nThe fundamentals of conduct and discipline one learns by observing the Captain and the ship! Yes; the Captain of a ship is known by the name of his ship! The role model in front of a young officer wherein he imbibes leadership skills by observing his Commanding Officer. The uniform (turnout), punctuality the demeanour is watched. Each activity of the ship moves under a planned system in harbour and at sea, promulgated by the ‘daily orders’ and after observing these timings one gets aligned to the concept of punctuality. Insistence on troop games such as football, hockey, volleyball and basketball over individual games is a standard practice over the years where officers and men play together in a spirit of competition and comradery.\nAbiding by the naval tradition, annual ‘pulling regatta’ ( boat race) is conducted among fleet ships and each ship fields teams department wise and officers also participate. Teams practice for long durations and extra diet is provided. It is a prestigious championship and each Commanding Officer wants to win the ‘Cock’! The ‘Silver Trophy’ in shape of a ‘Rooster’.\nIn harbour and at sea the Commanding officer and the concerned staff ensure that good quality food is provided to men. Each meal is tasted by the duty officer and the Logistics officer. The Commanding officer also visits galley in order to observe the food quality, hygiene and morale of the cooks.\nClose periodic monitoring of discipline on board is embedded in the system wherein every Friday afternoon ‘Requestmen & Defaulter’ is conducted. The disciplinary cases are dealt on the table of the Commanding officer and it is called ‘Summary Trial’. Along with this, ‘Requestmen’ is also held and sailors put up their ‘Request’ for various issues- Promotion, undergoing civil courses, to continue in same station, transfer to shore establishment, change of branch etc. Watching these proceedings as Divisional Officer where you have to explain your sailor’s case one is observing the fairness and decision making ability of the Commanding Officer ! Also assessing the leadership style of the command!\nLarge number of senior officers , dignitaries visit the ship. The ship also visits various ports and foreign ports as well on good will visit and it is during these occasions the young officers learn how to conduct . The language , the subject of discussions and the manner in which the Captain and other seniors conduct themselves is an invaluable lesson. How much to speak, what to speak and when to stay quiet and nod smilingly !\nSafety of the ship and its men is the ultimate responsibility of the Commending officer. This is seen during long deployments and exercises, tough weather conditions when the Captain would be on the Bridge (command platform) with the executive officer and other heads of department most of the time alert and taking quick decisions motivating the ship staff, hardly resting! Even the largest ship such as an aircraft carrier moves as an entity and the pulse and tension percolates to the bottom and therefore in this aspect the Navy is unique .\nCertain customs and traditions help in maintaining ‘core values’ of a leader: Respect for women and care of children; any lady entering the ‘Gangway’ has to be saluted on board ships. During the ‘Navy Week’ when the ship is open for visitors, one has witnessed long queues of school children from the suburbs of Mumbai waiting for their turn to see the ship bearing the sun, but they smile at you and salute you! At these instances you realize the tremendous responsibility one has toward these aspiring children who hold you in high esteem! The Navy belongs to the children of India!\nWe learn from our mistakes and blunders and sometimes human and material loss which have occurred in the past . Some stories of bravery and determination inspire us still. During our missile boat course we learnt of Chatak fire. In the early eighties, INS Chatak a missile boat caught fire after a missile mislaunch which led to a major fire and the ship staff was prepared to abandon the ship but the Captain of the ship Lt Cdr Rehan and his executive officer fought the fire, motivated their men and saved the ship. When the ship returned to harbour it was jet black with smoke. The Captain was signalled if anything the ship wants on reaching harbour. He replied ‘Biryani!’. ‘ To Float , To Move , To Fight’ is the motto on which the ships operates and each person works towards it.\nFinally, the heroic stories of our past heroes are our leadership lessons. These tales are our moral compass, and we hold them in our sacred corner. The sacrifices made by officers and men in war. The name of Captain MN Mulla the Commanding Officer of INS Khukri which went down to sea, hit by enemy torpedo on 09 December 1971 Indo – Pak war, remains etched in our collective memory. The ship was sinking, he gave his life jacket to a sailor, sat in his Captain’s chair and went down with the ship! He was the ship! He was Khukri!\nTop Comment\n{{{short}}} {{#more}} {{{long}}}... Read More {{/more}}\n{{/totalcount}} {{^totalcount}}Start a Conversation\nDisclaimer\nViews expressed above are the author's own.",
  "word_count": 1178,
  "scraped_at": "2026-02-14T13:22:51.255270"
}