{
  "article_id": "a08538ca8180",
  "url": "https://dailytrust.com/n10m-up-for-grabs-as-70-clubs-compete-in-the-ocean-glory-cup/",
  "title": "N10m Up for grabs as 70 clubs compete in the Ocean Glory cup",
  "date": "20250219T051500Z",
  "domain": "dailytrust.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "No fewer than seventy clubs are gearing up for the inaugural football competition, tagged: Ocean Glory Cup, scheduled to kick off March 3rd at Festac 23rd FHA Stadium in Amuwo-Odofin, Lagos.\nThe competition sponsored by Ocean Glory Commodities Limited will feature 64 Youth teams and 16 All Stars teams.\nThe Chief Executive Officer, Emmanuel Cole Chiori, at the press conference held yesterday, described the tournament as part of the firm’s Corporate Social Responsibility (CSR) initiatives.\n“We are delighted to launch the Ocean Glory Cup 2025, an event that highlights our dedication to community development and the transformative power of sports.\n“This tournament forms a crucial part of Ocean Glory’s Corporate Social Responsibility (CSR) initiatives. It aims to bolster the development of football while empowering young athletes to advance in their careers,” he said.\nHe expressed the firm’s commitment to support sports development, saying the tournament is aimed at providing a platform for budding footballers to showcase their skills.\n“This tournament is more than just about winning; it’s about creating life-changing opportunities for young players to grow, learn, and reach their full potential. We believe every athlete deserves a chance to shine, and we are excited to witness the extraordinary talent this competition will unveil,” he said.\nHe added the winners of the Youth teams and Allstars categories will receive N4 million, with ₦2 million respectively.\n“In addition to cash rewards, participants will receive mentorship opportunities, exposure to scouts and professional clubs, and a pathway to achieve their dreams\n“We remain committed to leveraging the power of sports to inspire, uplift, and nurture talent within the community,” he said.\nUPDATE NEWS:\nNigerians can now invest ₦2.5 million on premium domains and profit about ₦17-₦25 million. All earnings paid in US Dollars. Rather than wonder, click here to find out how it works.",
  "word_count": 301,
  "scraped_at": "2026-02-14T14:15:43.450790"
}