{
  "article_id": "a088f6898b42",
  "url": "https://www.dailymail.co.uk/news/article-13580245/glastonbury-festival-begins-dua-lipa.html",
  "title": "More than 200 , 000 Glastonbury festivalgoers get the party started for real as they gear up for three nights of massive acts at Worthy Farm starting with Dua Lipa tonight",
  "date": "20240628T151500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "More than 200,000 Glastonbury festivalgoers get the party started for real as they gear up for three nights of massive acts at Worthy Farm starting with Dua Lipa (and compete for the best flag!)\nThe Glastonbury party has officially started as more than 200,000 music lovers gear up for three day of massive acts and music mayhem.\nWorthy Farm is heaving as the music extravaganza kicked into overdrive for real ahead of tonight's headline act, Dua Lipa.\nRevellers, who have been on the site since Wednesday, have been getting into the flow of things as the first official day of spectacle got underway.\nMusic lovers, armed with bags of clothes and bottles of booze, have spent several nights camped out in tents, after baking in 30C heats.\nMany faced hours of travel chaos just to get to the madness in Somerset, with multiple trains lines heading out from London closed on Thursday.\nAs today's action got underway, huge crowds massed at the iconic Pyramid Stage, which has seen music idols from the likes of Sir Elton John, Sir Paul McCartney, and Adele headlining over the years.\nAmong the 200,000-strong swell of fans included a grumpy 10-week-old baby called Finlay, who has become an early Glastonbury hit after he was spotted at his 'first rave' during Annie Mak's opening set of the day.\nThe youngster's hilarious dour-face was beamed onto massive TV screen as he sat on his father's shoulders during the Irish DJ's show at the Other Stage - which led to Mak declaring the baby was a 'little legend'.\nMeanwhile, a flag depicting the moment BBC News presenter Maryam Moshiri gave the middle finger to the camera live on air last year also appeared at the festival on Friday.\nThe Glastonbury Party has kicked off as 200,000 revellers brace themselves for three days of music mayhem\nThis woman appeared in high spirits as she watched Olivia Dean performing on the Pyramid Stage from atop someone's shoulders\nA flag depicting the moment BBC News presenter Maryam Moshiri gave the middle finger to the camera live on air appeared at Glastonbury on Friday\nAnd this little girl cut a cool figure with her swanky glasses and bright jumper\nA grumpy-looking baby attending his first rave has become a Glastonbury smash hit after the dour-faced 10-week-old stole the show at Annie Mac's opening festival gig\nOlivia Dean was among the first to perform on the Pyramid Stage during Friday's action\nThousands of people have helped kicked the party into overdrive, with some dressing up for the occasion\nToday will see Glasto revellers watching shows from the likes of Annie Mak and Dua Lipa\nRock megastars Coldplay will be headlining the Pyramid Stage on Saturday evening with R&B singer SZA leading the show on Sunday.\nMeanwhile, country pop icon Shania Twain has taken the coveted Legends slot on Sunday and is expected to pull a massive crowd.\nToday's action started for many with huge queues to use the shower blocks, following a day of partying in the sweltering heat on Thursday.\nAnd as the music bonanza began, Olivia Dean was among the first to step onto Glastonbury's Pyramid stage this afternoon.\nThe 25-year-old, who grew up in north London, has previously collaborated with the likes of drum and bass megastars Rudimental and she is a Chanel ambassador.\nShe was met with rapturous applause after dedicating a song to her grandmother and other members of the Windrush generation during her Glastonbury set.\nThe singer, who was wearing a T-shirt with her grandmother's face on it, said: 'She came to this country when she was 18, never been on a plane... she had my mum quite young, my mum had me and I'm a product of her bravery.'\nOlivia Dean was among the first to step onto Glastonbury's Pyramid stage this afternoon.\nThe 25-year-old, who grew up in north London, has previously collaborated with the likes of drum and bass megastars Rudimental and she is a Chanel ambassador\nBubble party fun! These women came armed to the Pyramid Stage with bubble guns as Olivia belted out tunes\nEarlier, festival goers were treated to a show by Squeeze perform at the Pyramid Stage\nHuge crowds packed into the Pyramid stage to watch the first opening acts of the day\nThese two youngsters couldn't contain their excitement as they watched all the action from their shoulder height vantage point\nAlthough this punk fan might be at the wrong festival - with Green Day set to perform in London tomorrow afternoon at Wembley...\nShe added: 'So this song is for my granny, to the Windrush generation, for any immigrant, anyone's who's brave enough to move.'\nShe continued: 'And if you're watching at home granny \"hi!'\"\nThe singer then wiped away tears and commented on 'what a beautiful day' it was before she played her last song, Dive.\nLater, fans of South Korean K-pop band Seventeen appeared to go into a frenzied overdrive as the music act appeared on the Pyramid stage.\nLovers of the group, armed with the South Korean flag, screamed as the group performed.\nEarlier in the day, festival goers watch Squeeze perform at the Pyramid stage.\nK-pop stars Seventeen take to the Pyramid Stage on Friday\nThe South Korean group were met with thunderous applause from fans at Glastonbury\nSome supporters even came to the show sporting the South Korean flag\nFans went into a frenzy as the boyband performed on Friday afternoon\nWhile DJ legend Annie Mak helped kick-off the party with an hour-long set of dance classics at the festival's second biggest stage.\nBut the Irish star's set was almost overshadowed by a grump-looking baby called Finlay.\nThe 10-week-old infant and his dour face was beamed onto Mac's huge TV screens, with the little lad becoming part of a smash hit.\nWearing his striped one-piece pyjamas and ear protectors, Finlay was met with a rapturous reception from atop his father Tom Kay's shoulders as special effects on stage saw his image turn into a hallucinatory dance visual.\n'Oh my god, this baby, what a little legend,' Mac said to the crowd of thousands as Finlay appeared again.\nAdorable baby Finlay was met with cheers as he appeared on the big screen multiple times while Irish DJ Mac opened Worthy Farm's second biggest stage\nWearing his striped one-piece pyjamas and ear protectors, the little lad was met with a rapturous reception from atop his father Tom Kay's shoulders as special effects on stage saw his image turn into a hallucinatory dance visual\nFinlay attended the show with his parents Tom, 39, and Rosie, 35, and big sister Sophie, 10\nFinlay was turned into a hallucinatory dance visual during Annie Mac's gig on Friday\nShe signed off her performance by thanking 'everyone, Glastonbury and this baby'.\nFinlay's parents insisted the youngster loved the music and have now said they will play his moment of techno fame on his wedding day.\nFinlay's father Mr Kay, a 39-year-old accountant, said '(Finlay) was loving the music, so we thought we'd put him on my shoulders, he was just enjoying the vibes and then was on the big screen and got a big cheer - it's amazing.\n'Some people around us have sent us a video of it... it's great to think (Mac) noticed.'\nFinlay's mother Rosie Lewis, a 35-year-old originally from Edinburgh, said the video will probably be played at his wedding and 18th and 21st birthdays in years to come.\nHuge crowds are seen watching Seventeen perform on the Pyramid stage on Friday\nElsewhere on the Park stage, Lynks is seen putting on a colourful performance\nJanet Planet of Australian band Confidence Man is seen as they perform on the Other Stage\nThe couple, who have also brought their 10-year-old daughter Sofia, are only at the festival by chance after they won a competition for tickets through The Guardian newspaper.\n'You had to nominate a friend that you thought was worthy of winning tickets,' Ms Lewis said, explaining she put her partner's name down.\n'I had just given birth in the hospital, I thought he'll never win, but he might get an email saying 'Rosie's nominated you for being worthy of winning Glastonbury tickets' and make him feel good about himself - then he won them.'\nAsked what tips they would give to parents thinking of bringing their young children to a festival, Ms Lewis said: 'Do it - you can overthink it and it can put you off.\n'But take more nappies than you think you'll need and take more vests and outfits than you think you'll need.'\nThe Pyramid stage was awash with colour as fans sprayed bubble guns into the air\nSome 200,000 people are expected to pack into Glastonbury to watch the action\nSome fans' outfits were more unusual than others - with this music-lover appearing to have dressed up as Edward Scissorhands from the 1991 Tim Burton film featuring Johnny Depp\nOther revellers were spotted earlier today washing themselves down outside their tents after huge queues formed at the limited number of showers on site\nHundreds of revellers face long queues to use the limited number of on-site showers\nIt comes after thousands partied throughout the day during yesterday's 30C heatwave\nSofia, who is at her third Glastonbury since 2016, said: 'And go to the Kidzfield.'\nKidzfield is an area of the festival dedicated to under-12s, including music lessons, face painting and storytelling.\nDespite the child-friendly offering, Sofia said she is actually most looking forward to seeing the festival's Arcadia laser-laden dance stage - complete with its new flame-belching Dragonfly installation, which has replaced the site's famous Spider.\nIt comes as Glastonbury's organiser Emily Eavis was forced to defend the world-famous music spectacle's line-up amid criticism of there being a lack of rock bands as pop star Dua Lipa prepares to headline Friday's event.\nThis year's event sees headline performances from Dua Lipa, Coldplay and American R&B singer SZA, while country star Shania Twain will play the coveted Legends slot.\n'I think the line-up reflects what's happening in the music world at the moment - there aren't a lot of new rock acts to choose from if I'm honest,' Eavis said.\nGlastonbury's organiser Emily Eavis has defended the music spectacle's line-up amid criticism of there being a lack of rock bands as pop star Dua Lipa (pictured) prepares to headline today\nPeople enjoy the first proper day of Glastonbury Festival as the music gets underway - including this fan with their bejewelled hat\nAnd these revellers were clearly dressed to impress - going as the cast of Shrek\nSqueeze warmed up the Pyramids stage on Friday with their opening set of the day\nChris Difford of Squeeze gets the crowds into party gear during the show\n'Hopefully that will emerge again, my heyday was 1995 with Pulp and Oasis and Radiohead... and that was great but music changes all the time and right now this is where we're at.\n'Every year, we've been criticised for being too rock, too grime, too hip hop, too pop... it's just part of our year.\n'Generally it's not from the public... everybody's really happy and excited to be here.'\nLast night, festivalgoers were pictured inhaling 'laughing gas' from balloons on the grass.\nElsewhere, a small mobile cart saw entrepreneurs flogging little bottles claiming to contain the 'vegan alternative to cocaine'.\nThis morning, dozens of empty nitrous oxide cans were pictured scattered around the festival site, with some left in large piles close to the bins.\nFestivalgoers at Glastonbury take 'laughing gas' at Worthy Farm on the first day of the event\nDiscarded balloons left next to nitrous oxide canisters in a car park, at the Glastonbury Festival this morning\nLarge piles of used nitrous oxide cans were pictured across the site following yesterday's show\nAnd the bins were also overflowing with rubbish following the Thursday's action\nA spokesman for Avon and Somerset Police said that since Wednesday until 10am on Friday, the festival had seen a total of six arrests for drug offences on and off site at Glastonbury.\n'Three of these relate to the same occurrence and these people have also been arrested on suspicion of theft,' he added.\nOver the same period, the force also recorded 39 incidents, which included 11 thefts, five drug offences and two reports of violence.\nThis year's festival is taking place in the week before the General Election, which Eavis acknowledged they have 'never had'.\n'I feel a bit like we've stepped out of the election, even though it's next week,' she said.\n'We were working on having voter registration booths, but then the day moved.\n'It's a big one for us, we've never had a pre-election festival.'\nGlastonbury have also decided it will not be broadcasting the Euro 2024 football tournament, with England set to face Slovakia in the last 16 at 5pm on Sunday.\nEavis said the festival set up a screen to watch fixtures during the World Cup tournament in 1998, but times have changed.\n'We used to have a screen here as no-one had any means of finding out what even the result was because we were so cut off from the outside,' she said. 'Now obviously, everyone's connected and I think you know it's a music festival.\nRevellers walk through the Glastonbury Festival site at Worthy Farm in Somerset this morning\nGlastonbury revellers queue up to use the facilities this morning as the festival continues\nTents at Worthy Farm this morning as revellers prepare for a day of music across the stages\nGlastonbury festivalgoers will face cooler conditions for the action, as forecasters said Britain's recent hot spell is now coming to an end with windy weather on the way and unsettled conditions for the next few days.\nMusic fans at Glastonbury enjoying Friday's line-up could be met with the 'occasional light shower' but the day will mainly be 'dry and bright', according to a Met Office spokeswoman.\nNicola Maxey said: 'Although there is a chance of an occasional light shower today at Glastonbury, it will be a mainly dry and bright day with sunny spells, and the chance of some late evening sunshine for festival goers.\nGlastonbury revellers queue up to use the facilities this morning as the festival continues\n'Tomorrow will mostly be another dry and bright day, a little warmer than Friday, but becoming cloudier through the evening with the chance of some light drizzle later one.\n'The drizzle should clear as we go through Sunday morning, making way for another dry day with plenty of sunshine.\n'Whilst a weather front could bring some rainfall to the festival site for a period on Monday, Tuesday is looking like another dry day.\n'Temperatures are expected to reach high teens to low 20s Celsius over the coming days.'\nGlastonbury revellers are expected enjoy weather across the weekend that is 'mostly dry with plenty of sunny spells' and temperatures about average for June, which will be at 18C (64F) today before rising to 19C (66F) tomorrow and 21C (70F) on Sunday.\nIt follows the UK's first heatwave of the year that saw a 2024 high of 30.3C (86.5F) on Wednesday and a four-day heat health alert that expired yesterday afternoon.\nRevellers walk through the Glastonbury Festival site at Worthy Farm in Somerset this morning\nThe Glastonbury Festival site at Worthy Farm in Pilton, Somerset, is pictured this morning\nGlastonbury revellers queue up to use the facilities this morning as the festival continues\nPeople collect rubbish at the Glastonbury Festival this morning ahead of the artists playing\nMet Office spokesman Grahame Madge said: 'After the spell of warmth earlier this week, the UK forecast is pivoting rapidly to cooler and more unsettled conditions.\n'This change is being driven by an unseasonably deep area of low pressure to the west of Scotland, this is bringing strong winds and rain to northern parts of the UK, including Scotland, Northern Ireland and northern England.\n'A cold front from this system is dragging cooler air eastwards across the rest of the UK. This is bringing temperatures down to much nearer average values.\n'The UK outlook for the next few days is for periods of unsettled conditions to be interspersed with brighter spells.'\nThe incoming unsettled weather follows a period of sustained high temperatures.\nWednesday was the hottest day of the year so far, the Met Office said, with a high of 30.3C (86.5F) recorded at Heathrow Airport.\nThe previous hottest day of the year was Tuesday, with the mercury topping out at 30C (86F) in Chertsey in Surrey.\nMet Office meteorologist Kathryn Chalk said the last time 30C was recorded in the UK before this week was on September 10 last year – nearly 300 days ago.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Astonishing moment a street is swallowed by a sinkhole\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Food vlogger dies after 'eating toxic devil crab'\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Deepak Chopra confronted over his relationship to Epstein\n- Toddler opens car door in traffic and sends biker flying\n- New video shows man with backpack similar to Guthrie kidnapper\n- Israeli hostage reveals how she survived being tortured",
  "word_count": 2914,
  "scraped_at": "2026-02-14T12:32:16.186047"
}