{
  "article_id": "a09a42401826",
  "url": "https://thepeoplesperson.com/2023/02/13/manchester-united-are-still-title-contenders-despite-recent-shaky-performances-259724/",
  "title": "Manchester United are still title contenders despite recent shaky performances",
  "date": "20230214T023000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United Women overcame another huge test in their season on Sunday as they proved their credentials as title contenders by holding on for the win against Spurs.\nTheir 2-1 victory saw them return to the top of the league, one point ahead of Chelsea; however, they have played one game more.\nBut as The Athletic points out, the table only tells part of the story of United’s recent fragile performances.\nAfter the winter break, United looked tired as they ground out a 1-0 victory over Reading. The goal came from substitute Rachel Williams in the 87th minute, and fans were frustrated.\nThen last weekend, they were held to a 0-0 draw against Everton, which gifted Chelsea a two-point lead in the title race. It almost felt worse than a loss to the fans.\nIt wasn’t as if United didn’t have chances, they dominated, but they just needed to be more clinical in front of goal; they had 25 shots but couldn’t get one over the line.\nIt piled the pressure on Head Coach Marc Skinner, who has come under fire for his reluctance to rotate his squad and bring on subs early.\nAccording to Opta, United have made the fewest changes to any starting XI in the WSL this season (eight), whereas their opponents on Sunday, Tottenham, have made the third-most (30).\nAfter another frustrating first half, United made the breakthrough in the 68th minute as Leah Galton smashed home a cross from Ona Batlle.\nFive minutes later and Beth England levelled for the home side before an own goal from Bartrip put the Reds ahead again, all within ten minutes of the first goal.\nBut if you thought that was dramatic, you hadn’t seen anything.\nThe referee had long since lost control of the game, Drew Spence had ruffled a few feathers, and Hayley Ladd had found herself in a brawl, but after Eveliina Summanen got in a tangle with Ella Toone, the game took a turn for the worse for United.\nToone pushed Summanen to the ground and was shown a straight red.\nDown to ten with ten minutes left to play, the momentum was with Spurs, and it would be a tough test for the Reds.\nAs The Athletic pointed out, “In the past, United have struggled to grind out important results in critical games in the WSL, but this season, they have shown signs of turning the tide.”\nTheir comeback win over Arsenal earlier in the season showed that this was a different team than in years gone by, but their disappointing result against Chelsea and this latest run of form shows there is still work to do.\nSkinner himself picked up on it, “We weren’t quick enough. First half, we needed to be quicker in our thought processes before the ball came to us rather than receive the ball and then make a decision. But the beauty of this team is when we went in at half-time, we gave them five minutes and asked them for solutions, and they said they already needed to do that.”\nAs they head off into the international break, United have much to be happy about. Toone’s suspension could be seen as a team cracking under pressure, or perhaps it is just a blip in an otherwise good season for the Reds.\nEither way, United is on track in their quest for European football next season and is still in title contention.",
  "word_count": 573,
  "scraped_at": "2026-02-14T12:21:29.411536"
}