{
  "article_id": "a09c6c2b04e0",
  "url": "https://www.kidderminstershuttle.co.uk/news/23331140.worcester-warriors-agreement-place-wasps-play-sixways/",
  "title": "Worcester Warriors : agreement in place for Wasps to play at Sixways",
  "date": "20230218T193000Z",
  "domain": "kidderminstershuttle.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "THE new owners at Worcester Warriors have confirmed that they have an agreement with Wasps to bring them to Sixways.\nIt was said by Jim O'Toole at the supporter Q&A event at Sixways on Saturday that the fellow cash-stricken club will be based at the home of Warriors for a minimum of three years.\nREAD MORE | New owners to keep Worcester Warriors name\nThe agreement will see Wasps train at the stadium, as well as basing their business at Sixways. Wasps will be able to share players with Worcester initially to help Warriors progress through the leagues.\nBut the deal is not yet completed, something Wasps were keen to report.\n\"To clarify on rumours today, Wasps have not signed a ground agreement with any stadium and remain in discussions with several potential venues,\" Mr O'Toole said.\n\"We will not put pen to paper on any agreement without having first consulted with both the relevant governing bodies and more importantly, the local communities that would be impacted by such a move.\"\nThe agreement will be that once Warriors reach the Championship (or equivalent level), Wasps will have their own facility to move into.\nWasps were given RFU approval to join the Championship for next season, playing their home games at Sixways.\nAs well as bringing Wasps to Sixways, the new owners also confirmed that Worcester Warriors Women will remain at the stadium.\nLocal football club Worcester Raiders will continue to play at Sixways for the remainder of the 2022/23 season. Negotiations will then be had over their future.\nAtlas also confirmed that there are plans in place to stage a number of one-off matches at Sixways, including; the Army vs Navy clash and a British and Irish Lions Legends match.",
  "word_count": 290,
  "scraped_at": "2026-02-14T12:00:01.092230"
}