{
  "article_id": "a0a298b9fb5a",
  "url": "https://metro.co.uk/2025/04/30/eni-alukos-former-england-teammate-speaks-back-superhero-ian-wright-23004754/",
  "title": "Eni Aluko former England teammate speaks out to back  superhero  Ian Wright",
  "date": "20250430T230000Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Eni Aluko’s former England teammate Steph Houghton has leapt to the defence of Ian Wright and his ‘unbelievable’ support of women’s football.\nAluko sparked a major backlash after claiming Arsenal legend Wright was ‘blocking opportunities’ for female pundits, insisting he needed to ‘be aware’ of the amount of punditry work he is involved in.\nThe former Chelsea star issued a public apology to Wright two days later, describing him as a ‘brilliant broadcaster and role model’.\nWright however did not accept the apology, insisting he would rather ‘move on’ from the row.\nWright is a proud advocate for the women’s game at club and international level, regularly on punditry duty for ITV’s coverage of the Lionesses – often alongside Aluko.\nThe broadcaster issued a statement on Tuesday backing Wright with former England star Houghton the latest to defend the former striker.\nAppearing on ‘Crossways – A Women’s Football Show’ along with Houghton, Wright said: ‘It’s been a bit of an up-and-down week. But at the end of the day, it’s all sorted.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘It’s always good to see you Steph, because you make me smile. It’s been quite a tough week.’\nHoughton, who was part of the England set up with Aluko from 2007 to 2016, jumped in to pay a glowing tribute to the Londoner, describing him as a ‘superhero’.\nHoughton said: ‘Ian, can I just say this, and this has not been pre-empted, I think I posted on Instagram: What you have done for our game is unbelievable and you’ve got to take all the credit that everybody’s thrown at you this last week because you are a super-hero. And I love working with you.’\n‘I love you Steph,’ Wright responded. ‘To see you come out publicly like that for me it’s just nice.\n‘But I just wish… it’s not about the individual in the women’s game, it’s just about the collective.\n‘I’m not going to go into it, but I just really appreciate the public support that I got.’\nAluko was scheduled to co-host the third edition of the Women’s Football Awards on Thursday but yesterday announced she would be stepping back from the role.\n‘The Women’s Football Awards hold a special place in my heart. It was the first time an event of this scale was created solely to celebrate the incredible achievements in women’s football, and I’m so proud to have been part of it since the beginning,’ a statement began.\nMore Trending\n‘However, I’ve decided to take a step back from being part of the hosting lineup this year. I don’t want anything to deflect from the joy, recognition, and celebration that this event is all about.\n‘This event belongs to the players, coaches, fans, and everyone who has worked tirelessly to elevate the women’s game.\n‘The awards will be hosted in the very capable hands of Gabby Logan and Jamie Carragher, who I know will bring their passion and energy to the stage. I love women’s football deeply, I’m proud of how far we’ve come, and I’ll absolutely be back involved in the future.’\nMORE: Ian Wright ‘very surprised’ by Mikel Arteta tactic during Arsenal’s defeat to PSG\nMORE: Ian Wright names PSG’s possible weak link against Arsenal\nMORE: Roy Keane and Ian Wright make FA Cup final predictions after Man City beat Nottingham Forest",
  "word_count": 605,
  "scraped_at": "2026-02-14T13:06:16.938007"
}