{
  "article_id": "a0c6389416a7",
  "url": "https://www.justarsenal.com/more-than-half-way-to-emirates-sell-out-2-months-before-arsenal-v-tottenham-women-nld/357673",
  "title": "More than half way to Emirates sell - out 2 months before Arsenal v Tottenham Women NLD",
  "date": "20240111T140000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "32,000+ tickets already sold for the Women’s NLD\nOur Arsenal Women will welcome Tottenham to The Emirates in early March in what already looks like is going to be another massive turn out for our women, with 32,000 + tickets already sold for the game. This is a game where our Gunners will be seeking revenge for the heartbreaking 1-0 loss at Tottenham Hotspur Stadium in December last year, and get one over our arch north London rivals as we look to finish off the season in good form.\nIn last seasons match against Spurs Arsenal walked away 4-0 winners in front of a then record breaking 47,367 people at The Emirates in what was a game that is etched into many of our minds and a dominant victory over our London rivals. With plenty of time to still buy tickets we can expect another massive crowd to come out in support of our women. Crowd numbers are only getting better and better at Arsenal Women this season and after the EURO’s and the Women’s World Cup, everyone seems to have caught women’s football fever and are coming out in numbers to support the growth of the game.\nOnly a few years ago we could never have imagined the numbers we have started to see come and support the women and the game seems to be growing and growing as the years go by and that can only be seen as a positive for women’s football. Arsenal this season, and last, seem to leading the line, breaking the attendance record an astounding two times in one season, with the opening game against Liverpool bringing in 54,115 people to witness the first game of the season and then breaking that again against Chelsea in our massive 4-1 win over the title holders, in front of a massive 59,042 people.\nWe could be set for yet another record-breaking crowd and with tickets being so reasonably priced and plenty still available, if you can and are able, why not get down and support the women in what could be a massive game for our season. Tickets are only £15 for adults and £47 for a club-level ticket.\nFixture details\n- Date: Sunday, March 3*\n- Kick Off: 14:00\n- Location: Emirates Stadium\n- Match tickets on sale: Friday 8 December, 2pm (UK)\n- Broadcaster: TBC\n*This fixture is subject to change due to broadcast selections.\nBUY TICKETS DIRECTLY FROM ARSENAL.COM\nHopefully we get to see a massive turn out and and a win for our Gunners!\nInterestingly, Arsenal Women face Manchester United at the Emirates 2 weeks previous to this NLD – either or both fixtures could SELL-OUT, with the most recent attendance figures only being a whisker away from selling out the Emirates Stadium..\nDaisy Mae\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 495,
  "scraped_at": "2026-02-14T12:57:24.909593"
}