{
  "article_id": "a0e54465645d",
  "url": "https://www.1011now.com/2024/06/27/2024-nebraska-athletics-hall-fame-class-announced/",
  "title": "2024 Nebraska Athletics Hall of Fame class announced",
  "date": "20240627T214500Z",
  "domain": "1011now.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "2024 Nebraska Athletics Hall of Fame class announced\nLINCOLN, Neb. (Press Release) - Six decorated student-athletes comprise the 2024 University of Nebraska Athletics Hall of Fame class was announced Thursday.\nThe 2024 class includes: Jordan Hooper (women’s basketball, 2011-14); Carl Myerscough (men’s track and field, 2000-04); Virginia Stahr (volleyball, 1986-89); Ndamukong Suh (football, 2005-09); Mary Weatherholt (women’s tennis, 2009-13); and Emily Wong (women’s gymnastics, 2011-14).\nAll six members of the 2024 class were either an individual national champion or the national or conference player of the year in their respective sport. Each Hall of Famer was an All-American during their Husker career, with the class combining for a total of 26 All-America awards.\n“We are excited to recognize and celebrate the achievements of six of the greatest student-athletes in the history of Nebraska Athletics,” Director of Athletics Troy Dannen said. “It is an incredible accomplishment to be inducted into the Nebraska Athletics Hall of Fame. Each of our six inductees were elite competitors who made significant contributions to the storied tradition of Nebraska Athletics. We look forward to welcoming them back to campus this fall to honor their legacies.”\nThe 2024 Nebraska Athletics Hall of Fame class will be inducted in a ceremony on Friday, Oct. 4. The class will be permanently enshrined on a granite plaque with the names of the six members added to the University of Nebraska Athletics Hall of Fame Plaza.\nThe Nebraska Athletics Hall of Fame Plaza is located on a walkway near the new Osborne Legacy Complex, stretching from outside of East Memorial Stadium and continuing to the historic NU Coliseum. The University of Nebraska Athletics Hall of Fame Plaza is accessible to the public 24 hours a day, seven days a week at no charge and is lit for night viewing. The plaza recognizes each annual Hall of Fame class, along with columns dedicated to the history and successes of each of Nebraska’s athletic programs.\n2024 Nebraska Athletics Hall of Fame Class\n· Jordan Hooper, Women’s Basketball (2011-14)\n· Carl Myerscough, Track & Field (2000-04)\n· Virginia Stahr, Volleyball (1986-89)\n· Ndamukong Suh, Football (2005-09)\n· Mary Weatherholt, Women’s Tennis (2009-13)\n· Emily Wong, Women’s Gymnastics (2011-14)\n2024 Nebraska Athletics Hall of Fame Class Bios\nJordan Hooper, Women’s Basketball (2011-14), Alliance, Nebraska\nJordan Hooper was a three-time All-American as one of the most decorated women’s basketball players in Nebraska history. She was an honorable-mention All-American as a sophomore and junior before a standout senior season. In her final season, Hooper was the 2014 Big Ten Player of the Year, a Wade Trophy Finalist, a Wooden Ward Finalist and a first-team All-American. She finished her career as the No. 2 all-time scorer in program history with 2,357 points. At the conclusion of her career, Hooper owned Nebraska career records for three-pointers (295) and double-doubles (40). Hooper was the only player in Nebraska history and one of just two players in Big Ten history to score 2,300 career points and grab 1,100 career rebounds. Following her career, she ranked sixth on the Big Ten’s all-time scoring list and ninth in rebounds. Hooper led Nebraska to the 2013 NCAA Sweet 16 and to a 2014 Big Ten Tournament title. After an outstanding career at Nebraska, Hooper was the No. 13 overall pick in the 2014 WNBA Draft. Hooper’s No. 35 jersey was retired in January of 2024. She earned her degree in psychology from the University of Nebraska in 2014.\nCarl Myerscough, Men’s Track & Field (2000-04), Hambleton, England\nCarl Myerscough was a four-time NCAA shot put champion and seven-time All-American as the most decorated thrower in Nebraska men’s track and field history. Myerscough won back-to-back indoor shot put national titles in 2002 and 2003 and was the NCAA outdoor shot put national champion in 2003 and 2004. At the conclusion of his career, Myerscough was just the third person in NCAA history to win four total shot put national titles. Myerscough is the Nebraska record holder in the indoor and outdoor shot put and in the discus. He was an eight-time Big 12 Conference champion, including winning three consecutive indoor shot put titles and three consecutive discus titles. Myerscough scored 57 points in his NCAA Championships career, the second-highest total in program history. His performances helped the Huskers post two top-10 and six top-25 team finishes during Myerscough’s career. Myerscough went on to throw for his native Great Britain in the 2012 Olympics. He earned his degree in art from the University of Nebraska in 2004.\nVirginia Stahr, Volleyball (1986-89), Waco, Nebraska\nVirginia Stahr was an All-American on the volleyball court and in the classroom as one of the greatest student-athletes in the history of Nebraska Athletics. On the court, Stahr was a two-time All-American, earning first-team honors as a junior in 1988 and second-team accolades as a senior in 1989, when she was also named the Big Eight Player of the Year. Stahr ended her career as Nebraska’s all-time leader in kills and aces and was second in program history in blocks. Nebraska went 116-20 in Stahr’s four seasons, including a 35-1 record in Big Eight Conference play. NU won four Big Eight regular-season titles in Stahr’s career, and she helped the Huskers to a pair of NCAA runner-up finishes. In the classroom, Stahr was a three-time first-team Academic All-American and was the first person to be a two-time Volleyball Academic All-American of the Year. An NCAA Top Six Award winner, Stahr earned her degree in elementary education from the University of Nebraska in 1989.\nNdamukong Suh, Football (2005-09), Portland, Oregon\nOne of the most dominant defensive linemen in the history of college football, Ndamukong Suh holds the distinction of being the only defensive player to be named the Associated Press College Football Player of the Year. He won the award as a senior in 2009, when he was also a Heisman Trophy finalist. Suh won a slew of major national awards in 2009, claiming the Outland Trophy, the Lombardi Award, the Bronko Nagurski Trophy and the Chuck Bednarik Award. He was also a unanimous first-team All-American and the Big 12 Defensive Player of the Year. Suh totaled 215 tackles in his career with 57 tackles for loss and 24 sacks. He ranks second all-time at Nebraska in tackles for loss and fourth in sacks. In his stellar senior season, Suh led Nebraska with 85 tackles along with 24 TFLs, 12 sacks, 10 pass breakups and three blocked kicks. Following his Husker career, Suh was selected with the No. 2 overall pick in the 2010 NFL Draft. The 2010 NFL Rookie of the Year, Suh was a five-time Pro Bowl selection and a five-time All-Pro. Suh’s No. 93 jersey is retired, and he is a member of the Nebraska Football Hall of Fame. Suh earned his degree in construction management from the University of Nebraska in 2009.\nMary Weatherholt, Women’s Tennis (2009-13), Prairie Village, Kansas\nMary Weatherholt is the only Nebraska women’s tennis player to be the conference player of the year, the only Husker to be a singles All-American and the only player to win multiple All-America awards. Weatherholt earned All-America honors in both singles and doubles action during her career, and she was a two-time Big Ten Female Tennis Athlete of the Year and a Big 12 doubles champion. She owns Nebraska all-time records with 123 singles wins, 208 combined singles and doubles victories and an .842 career singles winning percentage. Weatherholt also owns Nebraska season records for combined wins (56), singles wins (36) and winning percentage (.938). As a senior in 2013, Weatherholt was the NCAA singles runner-up while advancing to the quarterfinals of the NCAA Doubles Championship. Her individual success helped the Huskers set a school record for team victories (24), while Nebraska won the Big Ten regular-season title and posted the best finish in school history with a trip to the round of 16 in the NCAA Tournament. A 2014 NCAA Top Ten Award recipient, Weatherholt earned her degree in business administration from the University of Nebraska in 2012.\nEmily Wong, Women’s Gymnastics (2011-14), Grand Forks, North Dakota\nEmily Wong is the most crowned conference champion in the history of Nebraska women’s gymnastics. Wong won a school-record nine individual conference titles in her career. Also a five-time individual regional champion, Wong excelled on every event. She is the only gymnast in program history to win a regional title on all four events, and she added an all-around title as well. Wong also earned first-team All-America honors on all four events and the all-around in her career. She was an 11-time All-American overall, tying for the most All-America awards in program history. In her senior season, Wong won the AAI Award as the nation’s top gymnast, and she was the 2014 Big Ten Gymnast of the Year. Her individual excellence helped the Huskers win a conference title in each of her four seasons. Nebraska also posted three top-10 and two top-five national finishes during Wong’s career. She also excelled in the classroom as a two-time Academic All-American. Wong earned her degree in nutrition science from the University of Nebraska in 2015.\nClick here to subscribe to our 10/11 NOW daily digest and breaking news alerts delivered straight to your email inbox.\nCopyright 2024 KOLN. All rights reserved.",
  "word_count": 1547,
  "scraped_at": "2026-02-14T14:11:03.633293"
}