{
  "article_id": "a0f5bd9a91e0",
  "url": "https://thestandard.org.nz/open-mike-01-05-2023/",
  "title": "Open mike 01 / 05 / 2023",
  "date": "20230430T190000Z",
  "domain": "thestandard.org.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Written By:\n- Date published:\n6:00 am, May 1st, 2023 - 40 comments\nCategories: open mike -\nTags:\nOpen mike is your post.\nFor announcements, general discussion, whatever you choose.\nThe usual rules of good behaviour apply (see the Policy).\nStep up to the mike …\n- Comments are now closed\n-\n\"New Zealand is one of the highest per capita energy users on the planet. We waste a lot of energy to do things that are unnecessary for our fundamental wellbeing.\"\nhttps://www.newsroom.co.nz/green-growth-approach-to-climate-change-will-do-more-harm-than-good\nUnderstanding is beginning to spread\n-\nThe author doesn't provide evidence for the assertion you quote.\nHe concludes with a conservative trusim:\n\"Various trends in the past century have created expectations that whatever we wish for we are entitled to. The magic of fossil fuels, along with a trillion dollar a year marketing and advertising industry, has made those manufactured wishes feel like needs.\"\nJust a few points would show that NZers cope with major change better than expected:\n- Television news, printed newspapers, landlines, books, and mail and receding very rapidly\n- Cash is receding to nothing\n- Whole sectors working and learning from home, permanently\n- Rapid managed retreat from coastlines is occurring and enforced by nature\n- Traffic across the Auckland Harbour Bridge has stalled in number for over a decade\n- Manufacturing with heavy energy use has stalled and likely to recede\n- National and Labour are proposing massive accelerations of renewable energy generation, with the national target of 100% national generation by 2030 which is just 7 years away\n- https://www.national.org.nz/electrifynz?gclid=EAIaIQobChMI7fTQj7_S_gIVlZhmAh26pQ-WEAAYAiAAEgLVlvD_BwE\nOf course the biggie in New Zealand is transport fuel use which is very hard to decrease for all our small vehicles outside 2 urban centres of Auckland and Wellington.\nPlenty of optimism\n-\nAll the evidence needed ….\n\"Understanding is beginning to spread\"…that dosnt mean magical thinking has disappeared, merely that it is diminishing.\n-\nLordie how tiring.\nThis is like Alexander Bell complaining that it will be impossible to replace the telegraph because Starlink hasn't had enough launches yet.\nOf course it is the case that existing technology requires a volume of mineral resources.\nWhether that is a limitation to the energy revolution required for replacing oil combustion is not examined.\nThat is not a reason to be pessimistic that the energy revolution cannot be attained, or even that there are too few mineral resources to achieve it.\nUnderstanding needs quality assurance.\n-\nword salad for lunch today\n-\nStop bringing bananas to a knife fight.\n-\nKnife fight?….how then did you manage to shoot yourself in the foot?\n-\nDo yourself a solid and read the following to get yourself a relevant opinion:\nhttps://www.bec.org.nz/wp-content/uploads/2022/08/BEC-Report.pdf\nhttps://www.mbie.govt.nz/assets/1597b02644/nz-energy-outlook-electricity-insight.pdf\n-\nDid myself the opposite of a solid and read the first linked report…..if thats what you are reading then your attitude is unsurprising….it is entirely materials blind and an example of the magical thinking that pervades yet states….\n\"It is important to view the scenarios developed for the BEC2050 project not from the perspective of whether you believe they will occur, but whether it is believable that they could occur.\"\nPerhaps then need to take their own advice.\nConsequently I wont waste my time on the subsequent links unless you wish to direct me to one that isnt similarly flawed\n-\n-\n-\n-\n-\n\"…2022 may be “peak” power emissions\nWind and solar are slowing the rise in power sector emissions. If all the electricity from wind and solar instead came from fossil generation, power sector emissions would have been 20% higher in 2022. The growth alone in wind and solar generation (+557 TWh) met 80% of global electricity demand growth in 2022 (+694 TWh). Clean power growth is likely to exceed electricity demand growth in 2023; this would be the first year for this to happen outside of a recession. With average growth in electricity demand and clean power, we forecast that 2023 will see a small fall in fossil generation (-47 TWh, -0.3%), with bigger falls in subsequent years as wind and solar grow further. That would mean 2022 hit “peak” emissions. A new era of falling power sector emissions is close….\"\n-\nYes it needs a whole post, rather than a set of bullshit reckons from one non-applicable academic.\nIf I get a moment over the weekend I will go through the Climate Commission, MBIE generation outlook, BusinessNZ Energy Council future demand scenarios, and Electricity Authority generation outlook.\nAll of the facts are pretty well understood in those forecasts,\nNone of it has much cause for anxiety for NZ.\n-\n-\n-\n-\nAs you are well aware (or should be as a long time participant and moderator of this site) that link is to the work of Simon Michaux, one of the few or possibly the only person who taken the time to evaluate the wherewithal to replace/reduce fossil fuel energy….work that has been presented and discussed here on many occasions previously.\nWhat is anyone to gain from 'something about metal mining'?….perhaps the knowledge that to create something you first need sufficient materials to do so, nevermind technical ability political will or public acceptance.\n-\n-\nAnd obviously as your friend knew it was \"something about metal mining\" he;she would have also seen the authors name prominently listed and his/her interest may have been piqued…..even it hadnt been on the numerous previous occasions.\n-\n-\nWell for those friends here is a brief (5 min read) for their perusal which quotes Michaux's work\n\"All of these incontestable realities highlight the fact that our dreams of a renewable powered boom are illusory. We need a different conversation than fossil fuelled business as usual or a Green New Deal.\nMichaux has offered some starters.\n“We need frank discussion about what minerals we think we need versus what we’ve got,” he said in an excellent interview with Nate Hagens on his podcast, The Great Simplification. “And then we’re going to realize that what we got won’t work with the existing plan.”\nFundamentally, we need to talk about a future of less instead of a future of more.\nSociety will have to build simple products that last and that can be easily recycled.\n“And we will scale back our needs and our society will simplify,” adds Michaux.\nThat is the conversation we should be having now. The one we continue to avoid.\"\nhttps://www.resilience.org/stories/2023-04-10/the-rising-chorus-of-renewable-energy-skeptics/\nThose friends may note a certain similarity to the original article posted this morning from Newsroom .\n-\n-\n-\nThe short version, synopsis in 60 s of scrolling.\nMentions the 1972 Club of Rome 'Limits to Growth' project as a cornerstone for assumptions about peak everything. Hmm.\n-\n\"The 2020 study examined updated quantitative information about ten factors, namely population, fertility rates, mortality rates, industrial output, food production, services, non-renewable resources, persistent pollution, human welfare, and ecological footprint, and concluded that the \"Limits to Growth\" prediction is essentially correct in that continued economic growth is unsustainable under a \"business as usual\" model\nThe study found that current empirical data is broadly consistent with the 1972 projections and that if major changes to the consumption of resources are not undertaken, economic growth will peak and then rapidly decline by around 2040\"\nhttps://en.m.wikipedia.org/wiki/The_Limits_to_Growth\nGuess we kinda think that pessimistically on our bad days.\n-\n-\nTo answer, the phrase Club of Rome stirred up embedded ancient negative detritus, but jumping onto Wikiped updated my faint twinge.\nBeen remembering recently a conversation with my friend Annette in the early 80s, telling me that her lecturer claimed \"global warming will be critical by 2020 if we do nothing now!\" She wasn't even doing sciences, but womens' studies. Lo and behold! Hmm.\n-\n-\n-\n-\n-\n-\n-\n-\nWhite rabbits!\n-\nJust in case there is anyone here who still doubts that Gender Ideology is homophobic.\nhttps://reduxx.info/from-her-to-him-the-downfall-of-a-lesbian-dating-app/\n\"You can pick any gender identity and sexuality you wish and exclude any you choose… just as long as it isn’t male,” DJ Lippy remarked to Reduxx. “It’s like opening an all you can eat vegan buffet but sneaking salami into all the dishes. When you complain, they kick you out and call you a pork exclusionary radical vegan.\"\n-\nIt is a homophobic, anti women – human females of all ages, anti child, pro heterosexual / fetishistic / pornified/ pro commercial sex / pro commercial child birth government funded authoritarian Patriarchy males rights movement.\nThese trans identified males and females have been yelling at same sex attracted people for a while now for their refusal to fuck these trans identified individuals.\nAlso, see the vitriol that is extended to women – human females, who would rather divorce their now 'dead' husbands before having to pretend to be a lesbian to please their 'wifes'.\nThis movement is anti everything that does not comply immediatly to their wishes.\nIt is a pity for the LGB community, the transsexual community, and women in children as they well i guess they are collateral damage. But that too was always thus.\n-\nYes people think they are supporting the Rainbow Community in supporting Trans rights, but actually many lesbians have been ostricized and smeared by the community they helped establish.\n-\nIf you're talking about HER, the lesbian, queer and non-binary dating site started more than 10 years ago, they were not very impressed with being taken down off Twitter by trans exclusionary activists on World Lesbian Visibility Day a few days ago.\nThey point out no one is forcing users of the site to hook up with anyone they don’t want to.\n-\nI wasn't talking about HER\n-\n-\n-\n-\nPost truth news in the MSM example #9785:\nGovernment to slap toll charge on new $830m road north of Auckland\nFirst, the headline – \"Slap\" – a sudden or direct blow.\nTolls have been signalled for almost the last 20 years for penlink. The headline is misleading, designed for an emotional rather than a rational response.\n\"…Public consultation in 2006 by the former Rodney District Council showed 90% of the public supported a tolled Penlink. However, results from a second consultation last year have not been released on Waka Kotahi's website… …Residents of the Whangaparāoa Peninsula have previously told Stuff they felt was unfair they would have to pay a toll on top of a regional fuel tax, when other infrastructure projects around the country weren't tolled…\"\nSo: The last time they were asked, 90% suported a toll. However, some un-named randoms felt it was \"unfair\" – an emotional response to the only fact, which is 90% supported a toll when last asked. Still, who is interest in facts when someone is upset it is unfair?\nSo who actually is upset?\n\"…Albany ward councillors John Watson and Wayne Walker previously said public mood on tolls had shifted since the regional fuel tax was introduced in 2018, calling it “double charging”…\"\nSo it turns out it probably just a couple of local right wing councillors and their mates.\nThis sort of emotional driven, post truth, negative bias MSM stuff has consequences. Citizens have nowadays been totally trained & encoouraged by the MSM to respond emotionally to news stories rather than rationally. A loaded story on Penlink to Tucker Carlson is on the same continuum. When the MSM sits about pretending to be puzzled about the rise of anti-vax sentiment or Trumpism, their complicitly is never really examined.\n-\nWatson and Walker are just fucking idiots.\n-\n\"Heavy vehicles will pay double those rates\".\nHeavy vehicles, especially trucks, cause around 1000 times the road damage of a family saloon. Tolls should reflect this.\n-\nThe only people that will pay these tolls are the ones that can not write them off as a cost of doing business. Trucking companies will not care one bit. Ditto for any other company car, lease plan car etc.\nThe worker that will need to use this road for what ever reason, or the traveler that wants to go on holiday will pay the full price. I hope that the Tolls reflect this.\n-\nThe $3 toll is to cover $1mi pa maintenance costs. The new road saves 20 min of drive time.\nAssuming this is at 80 kmp on the old road, the distance saved is 25 km. A Nissan Micra uses 6.7 L/100 km, which is at the low end of fuel consumption. 6.7 L x 25/100 x $1.90/L = $3.20. Already saved the toll. Savings for most cars and heavy vehicles will be more, apart from e-cars, of course.\nInitial announcement of PublicPrivate Partnership for Transmission Gully\nTG: We are paying the construction company making this road $1.2 bi, which includes a 25 year maintenance cost. It saves 27 km, plus stops and starts, along the Pukerua-Porirua highway.\n-\nThree dollar every day both ways quickly makes a big dents. Something like almost 30 bucks a week on a min wage is a big expense which will effectively only be paid for by the end user .\nCommercial users of this road will write this cost off as a business expense and reduce their taxable income by the cost of their expenses. So in essence the high users will still not pay for this road. They will have that expense returned to them courtesy of the tax system, and they will be fully subsidized by the tax payer.\nThat is the only fact that really matters. Unless of course we are happy for other people to spend 40 min more in traffic because they can't afford the new shiny Toll road.\nedit, i have no issues with Toll roads, but if you want commercial users to pay for that road you need to remove that tax benefits that come with commerical vehicles.\n-\n-\n-\n-\nI note, however, there are no proposed tolls on the most recently opened expressway – Kapiti.\nWould that be because it's in Wellington, and politicians are just more sensitive to local opinion there?\n-\n-\nBiden ruminates and journalists release methane at the White House Correspondents dinner.\n-\nThe Daily Show's token black male leads the response\n-\nBlame Rupert Murdoch and Fox for Iraq, Trump, and The Big Lie\n-\n-\nI like how the du(n)ce from act thinks taxing the greedy is tall poppy syndrome.\nLike your that dumb to fall for that lie.\n-\nThanks SPC, those were interesting links. Biden is turning out to be an excellent orator, resilient in working a crowd, even a negative, Republican one. Loved the Brandon glasses/persona at the end, defusing the dog-whistle right-wing meme by owning it.\n- Comments are now closed",
  "word_count": 2440,
  "scraped_at": "2026-02-14T12:02:39.338264"
}