{
  "article_id": "a118462d4b27",
  "url": "https://www.namibian.com.na/fifa-confirms-saudi-arabia-as-2034-world-cup-host/",
  "title": "Fifa confirms Saudi Arabia as 2034 World Cup host",
  "date": "20241212T004500Z",
  "domain": "namibian.com.na",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA on Wednesday confirmed that Saudi Arabia will host the 2034 World Cup, underlining the Gulf kingdom’s growing influence in world sport despite criticism of the country’s human rights record.\nAt the same time, a virtual Congress of world football’s governing body confirmed that Morocco, Spain and Portugal will be joint hosts of the 2030 World Cup, in which three games will also be played in South America.\nThe Saudi bid was waved through by acclamation during the meeting of FIFA’s 211 national member associations, with no rivals standing in its way.\n“It is a proud day, a day of celebration, a day that we invite the entire world to Saudi Arabia,” said Abdulaziz bin Turki bin Faisal al Saud, the Saudi Minister of Sports.\n“We intend to have an extraordinary version of the World Cup in our kingdom.”\nHowever, there was immediate condemnation from rights groups who insisted that handing the organisation of the tournament to the country puts the lives of construction workers at risk and “marks a moment of great danger”.\nFifa had invoked its principle of rotating the World Cup between continents, which meant only bids from Asia or Oceania were welcome for 2034.\nThe unprecedented organisation of the 2030 tournament will involve three continental confederations in Europe, Africa and South America, while the next World Cup in 2026 — the first involving 48 teams — will take place across North America.\nControversially, the body gave potential bidders barely a month last year to submit candidacies, and Australia and Indonesia abandoned their interest.\nThat left Saudi Arabia as the sole candidate, clearing the way for the World Cup to return to the Gulf region so soon after Qatar hosted in 2022.\nThe kingdom’s de facto ruler, Crown Prince Mohammed bin Salman, has been using sport for some time to amass influence and improve its global image — critics say he is effectively “sportswashing” by diverting attention from Saudi Arabia’s rights record.\n‘Moment of great danger’\nThe awarding of the World Cup to Saudi will make the issue of human rights a major talking point again, just as it was two years ago.\n“We are inclusive and we are non-discriminatory, and we want to obtain positive social impact,” Fifa president Gianni Infantino said in closing remarks.\n“We are of course aware of critics and fears, and I fully trust our hosts to address all open points from this process and deliver a FIFA World Cup which meets expectations.”\nHe added that “social improvements and positive human rights impacts” are “responsibilities of hosting a World Cup.”\nRights groups highlight mass executions in Saudi Arabia and allegations of torture, as well as restrictions on women under the conservative country’s male guardianship system. Free expression is severely restricted too.\nFIFA’s decision to award the tournament to Saudi Arabia “despite the well-known and severe risks to residents, migrant workers and visiting fans alike, marks a moment of great danger,” Amnesty International and 20 other organisations said in a joint statement.\n“Based on clear evidence to date, FIFA knows workers will be exploited and even die without fundamental reforms in Saudi Arabia, and yet has chosen to press ahead regardless,” said Steve Cockburn, Amnesty’s Head of Labour Rights and Sport.\nEngland’s Football Association meanwhile said it had received assurances from Saudi Arabia that LGBTQ fans would be “safe and welcome” at the tournament.\n‘Centenary celebration’\nThe 2030 tournament will mark a century since the first World Cup was held in Uruguay, and as a result the unrivalled joint bid by Morocco, Spain and Portugal will also see the South American nation handed one game along with Argentina and Paraguay.\nFIFA confirmed over a year ago that the joint proposal led by Morocco, Spain and Portugal was the sole contender for 2030, with all other potential candidacies having fallen by the wayside.\nFour South American countries launched a joint bid in 2019, convinced that the centenary World Cup should entirely take place on the continent where it all began.\nMeanwhile, Morocco replaced Ukraine as a partner for Spain and Portugal, while South America agreed to step aside in exchange for hosting three games.\nFollowing these “centenary celebrations” in the southern hemisphere winter, the six teams involved will cross the Atlantic to play the rest of the tournament.\nSpain, which hosted the 1982 World Cup, should be the main host as it boasts 11 of the 20 proposed stadiums.\nMorocco — after failing in five previous bids — will become the second African nation to host the competition after South Africa in 2010.\nPotential venues for the July 21 final include the Santiago Bernabeu in Madrid and Barcelona’s renovated Camp Nou as well as the planned Hassan II stadium between Casablanca and Rabat, set to boast a 115,000 capacity.\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 899,
  "scraped_at": "2026-02-14T12:52:46.563615"
}