{
  "article_id": "a12161845521",
  "url": "https://bernews.com/2023/03/simons-enjoys-creative-experience-at-bcb/",
  "title": "Simons Enjoys Creative Experience At BCB",
  "date": "20230330T201500Z",
  "domain": "bernews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Simons Enjoys Creative Experience At BCB\n[Written by Patrick Bean]\n“The BCB has limited resources, but we always aim to train and educate student-athletes as they are future leaders of our beautiful island. If you do not invest in the present, you will not have too many fond memories of the past, or a promising future,” said Calvin Blankendal, Chief Executive Officer of the Bermuda Cricket Board.\nAaliyah Simons is a career-minded young Bermudian woman, meandering her way among the highly competitive and potentially lucrative fields of marketing and hospitality.\nThe 22-year-old’s latest stop on her fledgling, career journey has her positioned as an intern at the Bermuda Cricket Board [BCB], where she is charged with carrying out an array of tasks designed to positively impact and advance cricket’s popularity among the local community.\nArmed with a degree from Canada’s Seneca College, Simons is one who prefers the hands-on, pragmatic approach, rather than endless dwelling upon theory, well in line with the manner of instruction at the polytechnic school, which specialises in applied learning.\nOne should not be fooled by her seeming reservedness, for a shrinking violet of passivity and inaction she’s not and Simons has the scars of aggressive battle to prove such.\nHer steely determination to return to full strength and the field of play after being felled by a torn anterior cruciate ligament [ACL] and meniscus garnered while playing Ontario Colleges Athletic Association [OCAA] football for the highly rated Sting offers evidence of hardened resolve, meaning rivals would be wise to advance with caution.\nWhile the promotion of cricket, rather than football, is the BCB’s priority and it is the men’s national team which stand as chief flag bearers, Simons has a burning desire for women to share equal billing on the island’s sporting stage.\n“We are seeing more women getting involved in cricket,” said Simons, countenance brightening with every syllable spoke. “At present we have formed seven women’s T20 teams and we need one more to be considered for Women’s T20 International status [WT20I].\n“So, what we’re trying to do is to continually promote and encourage people to get out and give cricket a try. Let them know that they don’t have to be natural born athletes or have a certain skill level, but just to try it as an activity.\n“We want people, especially the women and children to try new, positive things and let one of those new things be cricket.”\nCricket is blossoming on the international and club levels worldwide among females in terms of on-field participation, however a clear lag exists in spectator support compared to the men’s game, something Simons believes must be improved.\n“I think spectator support is very important because, even with football, if you compare the amount of people that come out to watch a boy sport compared to a women’s sport, it’s ridiculous,” said Simons, who is but one of a trio of sporting sisters, with siblings Ayshalay and Amber both members of the Bermuda women’s volleyball team.\n“I played football for the national team and St George’s Cricket Club Lady Colts and the amount of people that came out and supported the women’s league was very shocking.\n“Women are trying to make their mark in the world of team sports, because women do have a lot of talent, but it’s slept on.\n“When women come out and show what they can do on the field I think it’s actually amazing and should be better supported.”\nNevertheless, with football moving beyond its zenith and the start of a heavily stocked season of domestic and international cricket imminent, Simon’ precedence is squarely placed upon that yet referred to as the gentlemen’s game.\n“I’ve actually been on the radio speaking of the different programs that are coming up,” said Simons, who noted the recently completed Pee Wee Have A Go clinics and the soon to commence Easter camp as prime BCB sponsored youth offerings.\n“I’ve been creating flyers and posts for the Pee Wee’s and basically just getting our national players that are associated with cricket to repost the flyers and help in getting the word out in order to enhance visibility in the public sector.\n“We’ve been getting some coverage in the newspaper, as well as with online publications, social media and things like that.\n“Cricket has to compete against the popular sports in any particular school, so one of the main things is continuously promoting and getting the word out and being visible. Obviously some sports are more popular than others, but now, with the national team doing well, a lot of children are looking up to the players and becoming more interested and we want to take advantage of that.”\nIt is the effort to enhance crickets profile that enables Simons to utilize some of her marketing skills and youthful propensity to promote and spread word via social media platforms such as Instagram, TikTok and Facebook.\nThe local governing body’s Chief Executive Officer Cal Blankendal spoke to Simons having dived seamlessly into roles involving the marketing and administering of matters vital to the organizational objectives in managing, while advancing the sport locally and internationally.\n“Ms. Rajan Simons is the marketing and fund development manager of the BCB,” explained Blankendal, who also has an extensive history promoting both cricket and football and securing sporting and career enhancing opportunities for young person’s abroad.\n“Aaliyah expressed an interest in sports management via her athletic and hospitality career background. She was an outstanding football player, and I note that student-athletes are capable of multi-tasking and delivering projects on time.\n“The BCB has multiple projects all taking place simultaneously, and we are always looking to train and offer opportunities to young people. They are the future of our country and sports management allows them to learn in a very creative, challenging, but friendly and supportive environment, fostered by the BCB staff and executive board.\n“We hope that she has gained insight into the world of sports management and that it may enhance her career in the hospitality industry. The internship program is supported through the BCB and during the summer months via the Workforce Development – High School and University Student employment program.”\nAfter an initial two-week, full-time stint, Simons continues to support the BCB three times a week as they prepare for the start of the 2023 domestic season.\nAaliyah will be leading the way until she travels to England for further schooling, her lead choice of institutions being Bristol University of the West of England, the downside being that she will miss the inaugural Bermuda Premier League, as well as the 2023 ICC World Cup T20 Americas Qualifier, involving Bermuda, Canada, Cayman Islands and Panama, two international events she is playing a part in organising.\n“When Rajan left [for vacation] I was tasked with posting all of the games, the results, all of the flyers and advertisements in the newspaper,” said Simons. “I have helped Mr. Blankendal with the budget for the tour and I’ve spent time working on the organizing of the games set to take place in September and October.\n“I’ve definitely learned a couple of new things since I’ve been here. I’ve also been taking a couple classes in the hospitality program that I was in, but it’s definitely a lot more than what I thought it was going to be.\n“Some things are quite hard, others are pretty easy, but I’m a creative person and that’s why I like the marketing side of things, because it gives you the opportunity to create and come up with new ideas to promote the business and everything else. And with all that’s happening with the youth league, the women’s league, the national team there’s a lot that’s going on, so this is the perfect time for me to be on board so that I can see everything that’s happening.”",
  "word_count": 1311,
  "scraped_at": "2026-02-14T12:24:55.330982"
}