{
  "article_id": "a13c418fd339",
  "url": "https://www.yahoo.com/news/greg-cote-hot-button-top-153828902.html",
  "title": "Greg Cote Hot Button Top 10 : Dolphins - Bills a de facto playoff , booing Michigan , Taulia & lots more",
  "date": "20240107T161500Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Greg Cote’s Hot Button Top 10: Dolphins-Bills a de facto playoff, booing Michigan, Taulia & lots more\nGREG COTE’S HOT BUTTON TOP 10 (JANUARY 7): WHAT IN SPORTS HAS GRABBED US LATELY: Happy to be back after a two-week holiday break and a belated HNY! Our Sunday Hot Button Top 10 had been blog-only but when our blog retired it moved, re-imagined, to online-only. HB10 means what’s on our minds, locally and nationally, but from a Miami perspective and accentuating stuff that’s big, weird, damnable, funny or otherwise worth needling as the sports week just past pivots to the week ahead. Welcome to the 43rd edition of your Sunday sports-potpourri notes column, the new HB10:\n1. DOLPHINS: NFL playoffs start tonight with AFC East Championship Game: Bills at Dolphins tonight to end the regular season. Bills Mafia vs. Dolfans, too. Heated, hated rivals -- teams and fans. And winner-take-all for the division title, No. 2 seed and friendlier postseason path. Stakes don’t get much higher or games much bigger. And Fins are home dogs with injuries mounting and Jaylen Waddle and Raheem Mostert unlikely to play. It’s why I call this the biggest Dolphins home game since the AFC Championship after the 1992 season. (See my preview column and prediction in separate links below.)\n2. COLLEGE FOOTBALL: Go Washington! Let’s all boo Michigan, shall we?: Monday’s Michigan-Washington CFP title game would be a matchup easy to cheer for either team, minus the extenuating circumstances The Huskies’ only claim to a national championship was back in 1991 (but Miami is the more widely recognized champ from that season). The Wolverines, despite their elite-program rep, last won in 1997. Both are due. But how can anybody outside of Ann Arbor be rooting for Jim Harbaugh and Michigan after the signal-stealing scandal that caused Harbaugh to be suspended and could bring further penalties as the NCAA probe continues? Then again Harbaugh will probably be in the NFL when the sanctions hit A Michigan win would taint the CFP and invite an asterisk.\n3. PANTHERS: Let’s get Reinhart into the NHL MVP convo!: Florida is 25-12-2, on a season-best seven-game win streak with Saturdays’ 8-4 bust-out at Colorado, and near the top of the NHL East entering a Tuesday roadie in St.Louis. Panthers are proving last year’s Stanley Cup Final appearance was no fluke. Why? Sam Reinhart needs to start being talked about among NHL MVP candidates if he keeps up what he’s done in the season’s first half. He is second in the league with 28 goals after a hat trick Saturday, top-10 with 50 points, and his crazy-good 27.7 shooting percentage tops all skaters with at least 15 goals.\n4. HURRICANES: Might another Tagovailoa be coming to Miami?: Big Ten career passing leader Taulia Tagovailoa -- Tua’s lil’ bro -- leaves Maryland for the transfer portal, though he presently is out of remaining eligibility and seeking an NCAA waiver to gain a sixth season. The idea of joining his brother for a season in Miami sounds appealing -- and the Miami Hurricanes desperately need a veteran QB after several portal targets have gone elsewhere. I doubt Taulia will get another year, but if he does, it should be as a Cane. (I was ahead of the possibility with this late-November column.)\n5. HEAT: Will Miami ever have a full, healthy team on the doggone court?: It’s eight times in 35 games, or 22.9 percent. That’s how often Miami’s Big 3 of Jimmy Butler, Bam Adebayo and Tyler Herro have all been healthy and on the court together. Combined they have missed 39 games injured. Now that Herro and Bam are healthy, it’s Butler missing six of the past seven games with a foot injury. Shoutout to depth for Heat being 20-15 as they open four at home Monday vs. Houston.\n6. NFL: Is the once-unthinkable about to happen in New England?: It seemed impossible, once, that the Patriots and Bill Belichick might ever part ways on less than amicable terms. But is it about to happen? They won’t say he was “fired,” but is that what’s about to happen? I won’t believe it ‘til I hear the news. Meantime coaches who reportedly could be canned on Black Monday include Ron Rivera (Commanders), Dennis Allen (Saints), Kevin O’Connell (Vikings) and Arthur Smith (Falcons).\n7. NFL/MEDIA: “Inspirational” Rodgers has McAfee in an ESPN tempest: So the Jets voted Aaron Rodgers the team’s “most inspirational” player. I guess taking four snaps all season merits a trophy when you hobble 6-10 into your season finale. Rodgers had plenty of free time to get Pat McAfee in trouble with ESPN for falsely linking late-night host Jimmy Kimmel to Jeffrey Epstein in a regular appearance on Tanktop’s show. ESPN apologized, which didn’t thrill McAfee, whose relationship with the Worldwide Leader appears to be fraying.\n8. GYMNASTICS: Retton family owes answers about the money: McKenna Kelley, daughter of Mary Lou Retton, posted a crowdsourcing $$$ request on behalf of her famous mom that has surpassed $460,000. Retton, now 55, who won gold at the 1984 L.A. Olympics, was released from a hospital in October after a weeks-long stay to fight what the family called “a rare form of pneumonia.” Family says the money will pay for medical bills with what’s left going to a charity of Retton’s choice. Problem is, the family has declined to say how much of the $460K has been spent, whether anything was used for non-medical bills and how much is left for charity. Retton got a ton of money because of her celebrity. Transparency is a must.\n9. MORAL ISSUES: Bauer, Pistorius and second chances: Former Dodgers pitcher Trevor Bauer, banished from MLB in 2021 amid allegations of sexual assault by multiple women, is on an mage-rehab tour and seeking to restart his career at 32. And Oscar Pistorius, 37, the double-amputee South African Olympic runner, was released from prison on parole after serving nine years for the murder of his girlfriend. Should either be welcomed back into public life as if nothing happened? I believe in second chances, but in these cases, nine years seems much too light for a cold-blooded shooting death, and Bauer’s contrition hasn’t gone far enough. He admits “mistakes” and “reckless” behavior, but needs to apologize with genuine remorse. (In a related topic: Wander Franco will never, ever play in MLB again.)\nMore in Sports\nBarcelona fans tear into several players amid Atlético disaster\n10. CANES HOOPS: Both UM teams still must convince doubters: Miami men (Final Four) and women (Elite Eight) both are coming historic seasons and both have solid records, yet neither is ranked. Guys are 11-3 after beating No. 16 Clemson then losing in OT at Wake Forest. Women are 10-3 but have slumped a bit after an 8-0 start. Poll voters are ending no benefit of doubt, and both Canes teams still must prove last season was no flukey aberration.\nOther most recent stuff from me: Why Dolphins-Bills to end regular season is Miami’s biggest home game in 30 years // Off a 14-2 sizzler, our NFL Week 18 picks // Messi, Dolphins, Final Fourt: Our top 10 Miami sports stories of 2023 // R.I.P. Jim Martz: A tribute to the man who gifted me my career // Latest Herald NFL QB rankings entering Week 18 // Georgia’s 63-3 OB rout of ‘Semi-Noles’ an embarrassment to college football // Previous HB10 // And my latest podcast:",
  "word_count": 1241,
  "scraped_at": "2026-02-14T13:39:24.590769"
}