{
  "article_id": "a1407ce6ddc6",
  "url": "https://thepeoplesperson.com/2023/05/31/edwin-van-der-sar-at-ajax-where-did-it-all-go-wrong-for-manchester-united-hero-264737/",
  "title": "Edwin van der Sar at Ajax : Where did it all go wrong for Manchester United hero ? ",
  "date": "20230531T014500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Edwin van der Sar has quit his role as the chief executive officer of Ajax Amsterdam.\nManchester United’s former goalkeeper was appointed in 2016 and oversaw the Erik ten Hag-led renaissance, during which Ajax won three Eredivisie titles, two KNVB Cups and also reached the Champions League semi-final.\nVan der Sar, 52, released a statement this morning confirming his resignation in what many viewed as a surprise given Mike Verweij’s piece on De Telegraaf which was published just hours prior.\nVerweij reported: “(People inside Ajax) believe that Van der Sar will only apologise and carry on, instead of keeping the honour to himself and leave.”\nThe former Dutch keeper contradicted this immediately, with part of his statement reading: “I feel the need to take some distance, to get some rest, and to do other things.”\nYou can read the rest of his statement via The Peoples Person here.\nUnited fans had been campaigning over several years for Van der Sar to assume Ed Woodward’s position at the club when the investment banker was in charge of United’s footballing activities.\nBut now, as Van der Sar’s love affair with Ajax has reached a dramatic break-up, many will wonder why such a revered CEO has ended his relationship sourly.\nAjax fans, however, will say that this has been coming; so where did it all go wrong for United’s Champions League hero?\nThis may all circle back to United.\nErik ten Hag, Ajax’s most successful manager for several years, left the club last summer to take over the reins at Old Trafford, bringing two of his former club’s best players along for the ride in Antony and Lisandro Martinez.\nSuch an authoritative, respected, and influential manager would never have been easy to replace — as United saw when Sir Alex Ferguson retired.\nTen Hag also took his assistant manager, Mitchell van der Gaag, with him to Manchester, someone with an esteemed coaching pedigree.\nSo Van der Sar had to get creative. And by creative, he invited a Ten Hag prodigy to take over from his former boss.\nAlfred Schreuder, who worked as an assistant to Ten Hag for little over a year between 2018 and 2019, was appointed as the man tasked with continuing Ajax’s recent successes.\nWhat would have greatly upset this process of pinpointing a new manager was Marc Overmars’ resignation from his role as director of football last February.\nThe former Arsenal winger and Van der Sar’s former teammate admitted to being involved in unacceptable activities: sending unwanted and explicit pictures to female colleagues and being generally creepy over a lengthy period of time.\nOvermars had worked in a high-position at Ajax for just shy of a decade. Simon Hughes of The Athletic detailed: ‘Daphne Koster (Ajax women head coach) told in a documentary that she and some of her colleagues knew Overmars had sent inappropriate messages but no one dared to sound the alarm because of a culture of fear that prevailed within the club.’\nVan der Sar promoted the club’s technical director Gerry Hamstra to a slightly more authoritative position and former prolific striker Klaas Jan-Huntelaar, who had zero experience of working in a technical, administrative, or non-playing staff position, was recruited to work in tandem alongside Hamstra as Overmars’ “replacements”.\nNeither of the pair, however, were granted the complete responsibility to work as a director of football, instead serving as technical ‘assistants’ to Van der Sar and then-manager Ten Hag.\nSince Overmars’ departure, neither a permanent director of football nor interim director of football was sought by Van der Sar.\nSchreuder’s appointment, although helped by his work with Ten Hag, in Barcelona, and short-term success at Club Brugge, was not viewed as an inspired choice.\nHis immediate pragmatism and strange team selections, which saw a lack of creativity, attacking impetus and defensive instability, unnerved supporters and led to mixed results.\nMany of the key players from previous seasons endured a sudden decline in form, such as former United top transfer target Jurrien Timber. The club endured defeats to title challengers PSV Eindhoven and AZ Alkmaar and drew with eventual winners Feyenoord before the World Cup break.\nCut to January and Schreuder never managed to revitalise his side after Christmas. He was sacked after a run of four draws in the first five matches post the World Cup.\nThe club was relegated to the Europa League having finished their Champions League group stage with a mere six points and was subsequently knocked out of the lesser competition with immediate effect, losing 3-1 on aggregate to Union Berlin, albeit one month after Schreuder was sacked.\nVan der Sar was left with egg on his face for not being able to keep the ship afloat following the managerial change last year.\nReplacing Martinez with Calvin Bassey and Antony with Francisco Conceição, moreover, did not help his efforts in maintaining the Ajax standard.\nReserve coach, Johnny Heitinga, swapped Jong Ajax for the first team and assumed control in the capacity of caretaker manager. The former Everton defender did manage to steady the ship, but individual performances and a lack of foresight and control behind-the-scenes still led to a shaky run-in.\nHeitinga often faced the media during this unprecedented horror show, with many signalling that a board member – not least Van der Sar – should make themselves present for questioning.\nThis request was never granted. Heitinga remained honest in interviews and gestured to the idea that there was a lack of clarity and direction within the hierarchy of the club, often suggesting to ask him the same question about Ajax’s future again the following week.\nUltimately, Ajax recorded their worst league finish since 2009, missing out on Champions League qualification and also failed to win either of the cup competitions.\nSuch incompetent signings, playing, technical, and coaching staff-wise, led to fingers being pointed at Van der Sar, the man in charge of the club’s football ventures.\nThe Amsterdam loyalists managed to echo their feelings when Van der Sar entered the pitch before the club’s final home game of the season, a 3-1 victory against Utrecht, to thank departing coach Michael Reiziger and goalkeeper Martin Stekelenburg. The CEO received a thunder of whistles and boos.\nAjax are managerless, still searching for a director of football, and are also expected to soon lose another one of their best players, Edson Alvarez. The club are now also lacking a CEO.\nThe club released a statement, suggesting that they would have preferred for Van der Sar to weather the storm and see Ajax out of the current mess in which the club finds itself. Supervisory board member Pier Eringa said:\n“We wanted Edwin to stay, but he had made his decision. We have to respect that.”\nAlthough many fans will be happy to see the back of the CEO who guided the club into murky waters, whilst also being pleased that a legend has left with dignity, there is now the danger that the storm will only gather intensity.\nVan der Sar’s writing has been on the wall for 18 months and, unlike Marina Granovskaia’s sudden departure from Chelsea due to an ownership change, the reasons for such are somewhat self-inflictive.\nHe failed to recover from Overmars’ exit and appoint a high-calibre director of football; Ten Hag’s departure was not well-handled in terms of recruiting new coaching staff; Martinez, Antony, Ryan Gravenberch, Sebastian Haller, Noussair Mazraoui, and Nicolas Tagliafico’s transfers out of the club were not adequately replaced; clarity, direction, and control were not established; there was a lack of accountability and public dialogue (until now, commendably); internal conflict seemed to be present.\nVan der Sar has been recognised internationally as a revered CEO. After 11 years working in Ajax’s boardroom, most of which was successful, it would be nonsensical to now strip this status away from him.\nHe has admitted to having become exhausted with his job, causing him tough mental strain, as he stated to AjaxTV earlier today: “I am just done here. I am fed up. There is constant pressure, always on the phone, calling, making hard decisions.”\nThe overall fallout shows, however, that things can quickly go from brilliance to catastrophic and, although many outside viewers may be able to preemptively spot such imbalance, that it is difficult to gain a perspective when placed in the eye of the hurricane.\nImagine an FA Cup Final programme, but 100% online!\nWith just a couple of clicks you could be reading the FA Cup final special edition of United Matchday Magazine, right here on your device. All the latest news, meet the teams, tactical preview, opinion, debate, transfer news, quiz and much more! Get yours now for just £3/$3.75 and\nbe in the know about everything in red!",
  "word_count": 1455,
  "scraped_at": "2026-02-14T13:09:01.789708"
}