{
  "article_id": "a14adfd9e12a",
  "url": "https://www.thenationalnews.com/news/europe/2025/06/02/nationalist-karol-nawrocki-is-narrow-winner-in-polish-presidential-election/",
  "title": "Nationalist Karol Nawrocki is narrow winner in Polish presidential election",
  "date": "20250602T081500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Conservative Karol Nawrocki won Poland’s weekend presidential run-off election, according to the final vote count on Monday, in a blow for the country's pro-EU government.\nMr Nawrocki, who is 42 and an admirer of US President Donald Trump, won 50.89 per cent of votes in a race against Rafal Trzaskowski, Warsaw's pro-Brussels mayor and ally of the country's centrist government who received 49.11 per cent.\n\"Congratulations to the winner,” outgoing conservative President Andrzej Duda said on X. “Stay strong Poland.”\nMr Nawrocki, a eurosceptic historian who ran a national remembrance institute, campaigned on a promise to ensure economic and social policies favour Poles over other nationalities.\nThe amateur boxer won despite his past dominating debate in the last days of the campaign – from questions about his acquisition of a flat from a pensioner to an admission that he took part in orchestrated gang fights.\nWhile Poland's parliament holds most power, the president can veto legislation, and the vote was being watched closely in Ukraine as well as Russia, the US and across the European Union.\nThe victory brings a \"fresh victory for (European) patriots”, Hungarian Foreign Minister Peter Szijjarto said on his Facebook page on Monday.\nUAE President Sheikh Mohamed extended his congratulations to Mr Nawrocki, saying he looked forward to working with him \"to build upon the strong ties between the UAE and Poland and drive further growth and development for our countries\".\nEuropean Commission President Ursula von der Leyen on Monday congratulated Mr Nawrocki on his win and said she was convinced the EU could continue its \"very good co-operation” with Poland.\n\"We are all stronger together in our community of peace, democracy, and values. So let us work to ensure the security and prosperity of our common home,” Ms von der Leyen said in a post on X.\nTight race\nThe race had Poland on edge since a first round of voting two weeks earlier, revealing deep divisions in the country along the eastern flank of Nato and the EU.\nAn early exit poll released on Sunday evening suggested that Mr Trzaskowski was heading to victory before polling began to suggest otherwise a couple of hours later.\nThe outcome suggests that Poland can be expected to take a more populist and nationalist path under its new leader.\nPresident’s role\nMost day-to-day power in the Polish political system rests with a prime minister chosen by the parliament. However, the president's role is not merely ceremonial – the office holds the power to influence foreign policy and veto legislation.\nMr Nawrocki will succeed Mr Duda, a conservative whose second and final term ends on August 6. Under the Polish constitution, the president serves a five-year term and may be re-elected once.\nTusk headache\nPrime Minister Donald Tusk came to power in 2023 with a coalition government that spans a broad ideological divide – so broad that it has not been able to fulfil certain of his electoral promises, such as loosening the restrictive abortion law or passing a civil partnership law for same-sex couples.\nBut Mr Duda's veto power has been another obstacle. It has prevented Mr Tusk from fulfilling promises to reverse laws that politicised the court system in a way that the European Union declared to be undemocratic.\nNow, it appears Mr Tusk will have no way to fulfil those promises, made to voters and the EU.\nSome observers in Poland have said the unfulfilled promises could make it more difficult for Mr Tusk to continue his term until the next parliamentary election scheduled for late 2027, particularly if the Law and Justice party dangles the prospect of co-operation with conservatives in his coalition.\nIn the past two weeks, the candidates mostly fought for the support of people who voted for other candidates in the first round, in particular far-right's Slawomir Mentzen, who came third with 15 per cent support.\nMr Trzaskowski tried to attract them with promises of deregulation. Mr Nawrocki used his credentials as head of the Institute of National Remembrance (IPN), support for gun ownership, traditional families and Christian values, but also a critical tone on Ukraine, in common with Mr Mentzen.\nMr Nawrocki's wife Marta, a civil servant, and three children featured strongly in his campaign.\nBoxer, historian, politician\nMr Nawrocki was chosen by the Law and Justice party as part of its push for a new start.\nThe party governed Poland from 2015 to 2023, when it lost power to a centrist coalition led by Mr Tusk. Mr Nawrocki was chosen as a new face who would not be tainted by the scandals of the party's eight years of rule.\nHowever, his candidacy was clouded by allegations of connections to criminal figures and his participation in a violent street brawl. He denies the criminal links but was unapologetic about the street fight, saying he had taken part in “noble” fights in his life.\nThe revelations did not seem to hurt his support among right-wing voters, many of whom see the allegations as politically motivated.\n\"All my sports activities were based on the strength of my heart, the strength of my muscles, my fists,” Mr Nawrocki told a debate when confronted over reports he had been involved in mass organised fights between football hooligans. \"It was a fair competition, regardless of the form.”\nMr Nawrocki portrayed the election as a referendum on the government, which he described as a metropolitan elite out of touch with their concerns.\n\"I am simply one of you,” he told voters in the eastern town of Biala Podlaska while on the campaign trail.\nTrump factor\nMr Trump made it clear that he favoured Mr Nawrocki as Poland's president.\nHe welcomed Mr Nawrocki to the White House a month ago. Last week, the conservative group CPAC held its first meeting in Poland to give Mr Nawrocki a boost. Kristi Noem, US Homeland Security Secretary and a prominent Trump ally, praised Mr Nawrocki and urged Poles to vote for him.",
  "word_count": 991,
  "scraped_at": "2026-02-14T12:36:02.576103"
}