{
  "article_id": "a16ef7101740",
  "url": "https://www.twtd.co.uk/ipswich-town-news/50410/town-women-claim-first-ever-wsl2-victory",
  "title": "Town Women Claim First Ever WSL2 Victory - Ipswich Town News",
  "date": "20250928T201500Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sunday, 28th Sep 2025 18:31 by Matt Makin\nIpswich Town Women made history by recording their first ever win in the second tier of English women’s football, a late Paige Peake penalty securing a 3-2 victory over Portsmouth in a frenetic and sometimes feisty home WSL2 fixture at Colchester’s JobServe Community Stadium.\nHaving rung the changes for Town’s League Cup game against Leicester in midweek, Blues manager Joe Sheehan named a strong starting line-up for this vital clash against a potential relegation rival.\nNatalia Negri started in goal, screened by a back four of Grace Neville, Maria Boswell, Peake and Summer Hughes.\nLeah Mitchell and Beth Roe continued as the defensive midfield pairing, having assumed the roles in the previous league outing at Charlton last week, which ended 0-0.\nJenna Dear started the game in the 10 role with Sophie Peskett on the left wing, Ruby Seaby on the right and Rianna Dean in the striker position.\nLaura Hartley returned to the bench after starting against the Foxes midweek, along with Megan Wearing, Kaci-Jai Bonwick, Kyra Robertson and Natasha Thomas.\nCharlotte Fleming and Shauna Guyatt, who made returns as subs on Wednesday following long-term injury absences, also made the bench for the first time in the league this season.\nFormer Ipswich player Ella Rutherford, who joined Portsmouth following her release in the summer, was named on the visitors’ bench.\nThe away side were forced into a very early sub after only two minutes of play, Emma Jones going down off the ball and following assessment being swiftly replaced by Jessie Gale.\nSoon after, a neat passage of play from Town saw Seaby get the ball into the box but the winger was tackled before she could get a shot away.\nTown weathered an immediate counter from the visitors before getting forward again, Dear spraying the ball out to Seaby to dribble into the box, the ball going back out to Neville, who cut in and saw her attempt blocked out. To the general confusion of the home fans a goal-kick was awarded, the first of several questionable decisions of the day.\nShortly after, there was another stoppage in play when Peake needed treatment, the Town defender leaving the pitch but returning to play quickly.\nOn 10, Portsmouth broke on the counter but skipper Boswell was quick to get back and put the ball out of danger.\nA minute later, Izzy Collins was able to get in down Town’s right flank before pulling the ball back to Sophie Barker, who was able to tee up Ava Rowbotham for a shot from distance, which easily fell to Negri to collect.\nIpswich then dominated the game for a spell, putting pressure on the visitors’ defence.\nOn 13, Peskett was able to get on the end of long ball from Peake and then find Seaby on the right, but Pompey stopper Jess Gray was able to stop her near-post effort.\nA few moments after a Boswell free-kick found Seaby, who curled an effort over the bar.\nIn the 19th minute, Peskett was able to cut out a promising Portsmouth move in the middle of the park and burst forward to shoot from the edge of the box, her blocked effort falling to Roe, who then failed to find the on-rushing Hughes on the left, the ball going out for a throw-in.\nThree minutes later, Ipswich scored the first goal of the game, their first ever at this level of the women’s football pyramid.\nDean was both creator and scorer, finding Peskett out on the left, the winger then driving forward to put in a beautiful cross which Dean was able to head past Gray with relative ease. The Blues’ faithful erupted in ecstasy seeing their side take the lead in a league game for the first time this season.\nTown continued pushing and looked to add a second. On 27, Peskett looked to be breaking clean through on goal before being chopped down by Greta Humphries, who became the first player of the game to receive a yellow card.\nAs the match reached the half-hour mark, a link-up between Seaby and Dean saw the latter put a sumptuous cross into the box, but there was no blue shirt in the area to get on the end of it. Three minutes later, Dear had the ball in the net, but the flag was up for offside.\nTen minutes before the break, Portsmouth pumped the ball into the box but Tia Primmer’s weak header was wide of the mark and easily collected by Negri.\nImmediately afterwards, Peskett looked to be breaking again before being pulled back, this time by Jazz Bull, who joined Humphries in the referee’s book. Boswell’s resulting free-kick found Dear in the box but her header was straight at Gray.\nOn 40 Seaby won a corner which was taken by Roe, but Town’s effort was headed over the bar.\nThree minutes later, Pompey made their second change of the match, Barker making way for Angelina Dixon. The attacker soon made herself known as the half entered five minutes of time added on, curling a shot narrowly over the bar.\nTown failed to see the warning signs and two minutes later, and against the run of play, Nixon had the ball in the back of the net after hitting the ball sweetly from distance to whistle past Negri and bring the sides level.\nThe Blues pushed for a quick equaliser before the break and in the final minute of added-on time won a free-kick in the middle of the park. Portsmouth, seeming to lose their discipline, earned a third yellow card when Rowbotham kicked the ball away before Town could take the set piece.\nTown were slightly unfortunate not to be ahead at the break despite a superb effort from Nixon and could be aggrieved at Peskett being flagged offside when through on goal moments before, despite appearing to be level with the defensive line when the ball was played.\nPortsmouth had the first effort of the second half, Negri holding a shot from distance on 48.\nSeaby then looked to break forward but was tripped by Hannah Coan, who became the fourth player to receive a caution. Boswell’s deep free-kick was headed clear.\nIn the 54th minute, Roe appeared to be bundled over on the left edge of the Pompey box but the referee waved away claims for a foul to the incredulity of Dear.\nSheehan then made his first change of the afternoon, withdrawing Seaby to replace with Thomas, Town’s number seven moving out to the left and Peskett switching to the right flank.\nTown picked up their first booking on 59, Boswell receiving a yellow for a clumsy challenge.\nAs the game hit the hour mark, the match entered a chaotic few minutes. Portsmouth went 2-1 up on 60 after Town failed to deal with a free-kick into the box, Rowbotham poking home at close range and the goal standing despite vociferous protests from Town players that another opposition player was interfering with play from an offside position.\nImmediately from the restart, however, Town drew level, Peskett breezing down the right and putting the ball to the back post for Thomas to head home.\nThe referee at first appeared to disallow the goal, presumably seeing a foul on Peskett after her cross before seeing the goal, but then allowed the goal to stand. Portsmouth players were incensed by the decision as was Pompey coach Jay Sadler, who was booked for his protests.\nTown fans, however, went wild celebrating their all-time goalscorer’s first goal in WSL2, the forward now having scored for the club in the second, third and fourth tier of the English league system.\nOn 69 Town broke through Peskett on the right before switching the ball to Hughes on the left, who wriggled to the byline and put in a teasing cross towards goal that was booted out for a throw-in.\nA few minutes later, another Boswell free-kick was sent into the box, this time finding Peake who could only head wide.\nTown continued to apply pressure and with 10 minutes remaining won a penalty kick.\nIn what had become a theme in the game, Peskett broke into the box following some stellar play from Roe and Dear before being brought down by Collins, the referee not hesitating to point to the spot. Town fans were baffled, however, that Pompey’s 25 did not receive a card of any colour.\nPeake, a prolific penalty-taker in her previous spell as an Ipswich player, stepped up and coolly powered the ball low and right, sending Gray the wrong way, to give Town the lead with only nine minutes remaining.\nThe spot-kick was Peake’s first goal for the club since returning from Southampton in the summer, the fact that it was against her former employer’s local rivals not lost on many in the ground.\nSadler immediately made another change before the restart, with Primmer making way for former Blue Rutherford. Rutherford’s first action in the game was to receive the visitors’ fifth booking of the day after fouling Roe.\nThe forward then reminded Town fans of the solo efforts she could pull out of nowhere with a long-range effort that Negri was forced to push onto the bar.\nOn 87 Peskett, who had had a fine game, came off for defender Wearing and in the final minute of the game Sheehan made his final change with Dear making way for Fleming to get her first league minutes since rupturing her ACL last season.\nThe fourth official indicated six additional minutes and Town moved to a defensive posture, dropping deep and taking the ball to the corner flag when they did venture forward.\nPortsmouth pushed for an equaliser, but a resolute Blues defence forced the away side to hopeful punts into the box.\nThe referee brought the game to a close and there was a rapturous response from the Town fans, Sheehan going over to celebrate with the East Stand before the team joined him and Thomas led the squad in a fist pump celebration.\nThe performance was Ipswich’s most cohesive of the season to date and built on the incremental progress seen over recent games, even in the 5-1 cup loss to WSL Leicester in midweek.\nPeskett, despite getting two assists and winning the penalty that won Town the game, was not in the conversation for Player of the Match. Mitchell and Roe, both playing out of position in defensive midfield, followed up on the solid performances they made at the Valley with the latter getting the nod from the match sponsor.\nDean also had an excellent game in the striker position, opening her account for the club and Dear was able to dictate play in the middle of the forward line.\nTown’s first ever win in the second tier sees them move up to 10th in the WSL2 table on four points, one above Portsmouth and three ahead of Sheffield United, who lost to a 91st minute goal from Birmingham City yesterday.\nTaking all the points from a relegation rival cannot be understated and despite it being early in the season, if Town can take the momentum from this game to South Yorkshire next weekend and get a result, it will go a long way to putting them in a strong position for survival at the end of the season.\nTown: Negri, Neville, Boswell (c), Peake, Hughes, Mitchell, Roe, Seaby (Thomas 54), Dear (Fleming 89), Peskett (Wearing 87), Dean. Unused: Hartley, Bonwick, Robertson, Guyatt.\nPortsmouth: Gray, Bull (c), Barker (Nixon 43), Coan, Freeland, Rowbotham, Jones (Gale 2), Hornby, Humphries, Primmer (Rutherford 83), Collins. Unused; Erhabor, Wilding, Kennedy, Sheffield. Att: 1,236.\n\"It was great to share that moment with them at the end.\" 🎙️\nThe thoughts of Joe Sheehan after today's dramatic win! ⤵️— Ipswich Town FC Women (@ITFCWomen) September 28, 2025\nPhoto: Matchday Images\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nAlways thought the fa are missing a trick by not having ladies game played in the summer. Think that would attract a lot more generally\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 2037,
  "scraped_at": "2026-02-14T12:13:21.499002"
}