{
  "article_id": "a1857738c0ce",
  "url": "https://saudigazette.com.sa/article/633884/World/Europe/Over-30-Brits-eye-Australia-gap-year-as-age-limit-upped",
  "title": "Over - 30 Brits eye Australia gap year as age limit upped",
  "date": "20230701T094500Z",
  "domain": "saudigazette.com.sa",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LONDON — Millions more Brits can now live and work in Australia after the age limit for working holiday visas went up to 35.\nThe age limit has been extended from 30 for all British citizens meaning 16 million adults are now eligible.\nPopular with backpacker tourists, the changes are a key part of the free trade agreement struck between the two countries last year.\nIt will also be easier for Australians to work and travel in the UK.\nIt follows an agreement between New Zealand and the UK to expand working holiday visas up to 35-year-olds.\nThe scheme will allow Brits to work and live in Australia for up to three years from 1 July 2024, with various restrictions on the type of work that visitors are allowed to do to be lifted.\nIn a rule going back more than a decade, British working holiday makers had to complete 88 days of agricultural work if they wanted to stay in Australia, for every additional year they would like to stay on.\nThese rules are now being eased, allowing visitors to work more freely across industries.\nThe three-year allowance does not have to be consecutive and can be taken at any time up until the age of 35.\nSally Cope, UK regional general manager for Tourism Australia, said there had been lots of interest from foreign travellers recently in the big sporting events coming up in Australia over the next few years.\n\"It's an exciting time and these big sporting events, like the FIFA women's football world cup and Olympics in Brisbane in 2032, offer the temporary contract type work that young visitors want.\"\nAccording to Tourism Australia, there are around 35,000 arrivals from the UK on working holiday visas each year and many stay on.\nRestrictions are also easing for Australians. From February 2024 the age range will go up to 35, instead of 30, and they will be able to stay for three years instead of two.\nAustralia is a popular destination for young people, among Europeans.\nAside from lifestyle attractions, wages are slightly higher than many European countries.\nAustralia's minimum wage is currently $21.38 (£11.22) with the UK's minimum wage standing at £10.42, for those aged over 23 years old. — BBC\nOver-30 Brits eye Australia gap year as age limit upped",
  "word_count": 385,
  "scraped_at": "2026-02-14T12:26:48.166248"
}