{
  "article_id": "a19301e9e7b9",
  "url": "https://toronto.citynews.ca/2024/06/06/north-carolina-house-speaker-says-university-athletics-scheduling-bill-isnt-going-further/",
  "title": "North Carolina House speaker says university athletics scheduling bill isnt going further",
  "date": "20240606T220000Z",
  "domain": "toronto.citynews.ca",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "North Carolina House speaker says university athletics scheduling bill isn’t going further\nPosted June 6, 2024 5:01 pm.\nLast Updated June 6, 2024 5:13 pm.\nRALEIGH, N.C. (AP) — Legislation that would make sure the University of North Carolina at Chapel Hill and N.C. State University play each other annually in football and basketball and then play three other public schools regularly isn’t advancing beyond a quick committee meeting this week, House Speaker Tim Moore said Thursday.\nA House committee on universities approved the measure Tuesday with no debate, and with a bill sponsor afterward expressing optimism about its future. But Moore, who can hold great sway on the future of legislation, said the bill won’t go any further. He didn’t give a specific reason why.\n“It’s had the hearing it will have. … I told them they could hear it in committee, but it won’t come to the floor,” Moore said, adding jokingly: “I mean, everyone knows Carolina is going to win all those games anyway.” He attended UNC-Chapel Hill.\nThe bill would require the football and men’s and women’s basketball teams at UNC-Chapel Hill and N.C. State to play each other at least once annually. And the Wolfpack and Tar Heels would have to play East Carolina University, Appalachian State University or the University of North Carolina at Charlotte at least once every year in those sports.\nThe bill’s supporters have presented the proposal as a way to secure deep rivalries between N.C. State and UNC-Chapel Hill in the midst of volatile times in college athletics and to build up competitions with other University of North Carolina system schools.\nConference realignments also threaten longtime and regional matchups. The Atlantic Coast Conference, of which UNC and N.C. State are founding members, is facing uncertainty about its long-term future as it continues to face a growing financial gap behind the Big Ten and Southeastern conferences.\nRep. David Willis, of Union County, who shepherded the bill in committee this week, didn’t immediately respond to a message Thursday seeking comment. Although the bill will now stall, its popularity in some corners could signal to university athletic departments to schedule these games on their own.\nThe Associated Press",
  "word_count": 365,
  "scraped_at": "2026-02-14T14:13:14.485906"
}