{
  "article_id": "a19c447ec1e8",
  "url": "https://www.dailymail.co.uk/femail/article-14489885/Prince-William-joke-bald-head-hair-royal-fans.html",
  "title": "Prince William says he  wishes he had red hair  and jokes he  lost the chance  to dye it as he meets a wellwisher",
  "date": "20250312T120000Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Prince William says he 'wishes he had red hair' and jokes he's 'lost the chance' to dye it as he meets a wellwisher\n- The Prince of Wales visited Sporting Khalsa FC in the West Midlands yesterday\n- READ MORE: William and Kate appear loved up at Commonwealth Day Service\nThis is the hilarious moment Prince William made a light-hearted joke about his hair as he met with royal fans.\nThe beaming Prince of Wales, 42, was in high spirits as he completed a walkabout yesterday while visiting the Sporting Khalsa Football Club at Aspray Arena in the West Midlands.\nThe heir to the throne appeared in a fantastic mood as he met crowds chanting his name, as he shook people's hands and asked everyone how they were doing.\nBut as he met with one wellwisher, William soon did a double-take after spotting her vibrant red hairstyle.\n'Your hair!' he exclaimed, before cheerily laughing and patting the woman on the shoulder: 'It's fantastic!'\nAs crowds were delighted by his humour, William couldn't resist joking about his own hair-do, pointing at his head.\nHe joked: 'I wish I had hair like that! You look amazing. I've lost the chance.'\nThe lucky fan then got the opportunity to take a selfie with the Prince and shake his hand.\nPrince William was left astonished by a royal fan's bright hairstyle during a visit to the West Midlands yesterday\nOn social media, royal fans were delighted by the prince's easy-going humour, gushing that he is the 'people's prince'.\nThey wrote: 'I love how William is so at ease with his own skin that he can joke about his hair and no awkwardness there';\n'William is very charismatic, he's the People's Prince';\n'What a cute video. He is so loved. And he loves back';\n'What a nice chap he is.'\nWilliam was recently crowned the world's sexist bald man for two years in a row in research compiled by research compiled by PR agency Reboot Online - even beating movie stars such as Dwayne 'The Rock' Johnson, Stanley Tucci and Vin Diesel to the title.\nIn his teens, William was blessed with his mother Princess Diana's thick blonde hair, and experienced swooning crowds as a teenage heartthrob.\nHowever, decades later, Prince Harry called out his brother's 'alarming baldness' in his best-selling memoir, Spare.\nThe Prince of Wales, 42, joked that he's 'lost the chance' to dye his own locks a similar colour\nA beaming William was in awe of the woman's hairstyle and said it was 'fantastic'\nThe royal delighted fans with the moment, who praised him for being able to make a light-hearted joke about his hair\nWilliam then went on to have a buzzcut in 2018 after seeking advice from his wife's hairdresser - marking a drastic change in his style.\nMore recently, he's switched up his appearance once again and has delighted royal fans by growing a beard.\nThe royal had showcased his caring side on Tuesday afternoon as he shared cuddles and high-fives with adorable schoolchildren waiting to welcome him to the West Midlands.\nThe beaming Prince of Wales, 42, proved he can be just as warm-hearted as his wife, Kate, while sharing sweet moments with the little fans from Fibbersley Park Primary Academy in Willenhall.\nThanks to her natural warmth and ability to connect with families, Kate is often referred to as the 'Children's Princess' by royal enthusiasts - but her husband appeared to be just as capable of delighting the younger generations.\nFrom inspiring laughter and cheer to sharing hugs and high-fives, the father-of-three seemed in his element as he greeted the young crowd at the Sporting Khalsa FC.\nWilliam, in his role as patron of the Football Association, visited a referee training course at the club as part of the FA’s Reflective and Representative campaign which aims to recruit 1,000 people from Black, Asian and Mixed Heritage backgrounds into refereeing roles.\nThe course started in July 2023 and combines theory and practical training to support those who are taking their first steps into officiating.\nPrince William showcased his caring side on Tuesday afternoon as he shared cuddles and high-fives with adorable schoolchildren waiting to welcome him to the West Midlands\nParticipants on the course will be equipped with the key skills and knowledge needed to referee grassroots football matches safely and effectively and is aimed at people aged 14 and over who wish to referee mini football, 9 v 9 and 11 v 11 games.\nDuring the visit, the prince met representatives from the FA and Sporting Khalsa to hear about the importance of opening up opportunities in football to young people from diverse backgrounds.\nWilliam greeted children from Fibbersley Park Primary Academy who were waving home-made flags and signs. He shook hands and gave high fives, saying: 'Are you missing your lessons right now? Your hands are cold.'\nSpotting a child waving a sign that read 'Aston Villa are the best' he stopped to talk and said: 'They're playing tomorrow.'\nPam Dawes, 62, attracted the attention of the prince thanks to her bright orange hair, and said: 'We had a selfie. He loved my hair. He was lovely, bless him. He's made my day.'\nWhen William finally made it onto the pitch near Wolverhampton, he told the club's directors Manjit Gill and Inder Grewal: 'Sorry to keep you guys waiting. I just broke the record for the number of high fives in ten minutes.'\nRemarking that the six-year-old all-weather pitch was 'in good nick', the prince asked: 'What is attracting people to play at the moment from different backgrounds? How are you bringing them in?'\nWilliam, in his role as patron of the Football Association, visited a referee training course at the club as part of the FA’s Reflective and Representative campaign which aims to recruit 1,000 people from Black, Asian and Mixed Heritage backgrounds into refereeing roles\nFrom inspiring laughter and cheer to sharing hugs and high-fives, the father-of-three seemed in his element as he greeted the young crowd at the Sporting Khalsa FC\nNow two years into its three-year programme, the FA has already exceeded the original target and is looking to grow the numbers further.\nIt comes nearly five years after a 53-page diversity report compiled by the Black, Asian and Mixed Ethnicity Referee Support Group alleged that some FA observers made racist comments about referees, effectively blocking them from being promoted to the higher leagues.\nSporting Khalsa FC is one of several clubs across the country that is running courses to teach Black, Asian and Mixed Heritage people over the age of 14 how to become match officials.\nIt combines theory and practical training to support those who are learning to be referees and other roles.\nWilliam took part in a training session in a classroom where students were shown video clips before being asked to decide whether the action on screen warranted a red card, a yellow card, or no card.\nHe joined students in standing in different sections of the room depending on their decision.\nPicking up his red and yellow cards, William joked: 'I'll follow the crowd.'\nWhen asked why he had decided to grant a red card, William gestured to two girls beside him and said: 'I'll take advice from you two.'\nThe beaming Prince of Wales, 42, proved he can be just as warm-hearted as his wife, Kate, while sharing sweet moments with the little fans from Fibbersley Park Primary Academy in Willenhall\nThe Prince of Wales is greeted by schoolchildren from Fibbersley Park Primary Academy during a visit to a referee training course at Sporting Khalsa FC in Willenhall\nThe course started in July 2023 and combines theory and practical training to support those who are taking their first steps into officiating. Pictured, Prince William greeting a young fan today\nEarlier this week, William joined the Princess of Wales to attend Commonwealth Day celebrations at Westminster Abbey\nHe then added: 'I think that it's studs out. Straight leg. I think it's dangerous, because of the height of where it is.'\nThe prince and his fellow students who had decided it was a red card were told they were right.\nWilliam then moved to a football pitch where he was taught about different whistle tones and flag signals.\nJogging up and down, he was told at one point that he didn't need to blow the whistle. Nicola Arrowsmith-Olds then taught him which flag to signal and the prince practiced side-stepping along the touchline.\nHe then joined a mini game to referee students participating in the course.\nDuring his visit, the prince met Raj Randhawa, the FA's Equality, Diversity and Inclusion delivery manager, and Levi Gray, a lieutenant in the British Army and a professional referee.\nLt Gray, serves with the Royal Irish regiment and was part of the officiating team for the 2024 Women's FA Cup at Wembley Stadium.\nShe said: 'We spoke about improving diversity in football and how at the grassroots it can be quite a vulnerable place for people because you don't have the protection that you have in the professional game so it's how communities like this [in Walsall] are helping people.'\nRandhawa said: 'For him to come and visit and take time out of his day and meet some of the participants staring their referee journey, it will live long in the memories for them but personally for me as well.'",
  "word_count": 1568,
  "scraped_at": "2026-02-14T12:10:55.108772"
}