{
  "article_id": "a1a6517fd9db",
  "url": "https://www.theatlantic.com/ideas/archive/2019/04/what-college-admissions-scandal-reveals/586468/",
  "title": "What the College - Admissions Scandal Reveals",
  "date": "20231203T064500Z",
  "domain": "theatlantic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "They Had It Coming\nThe parents indicted in the college-admissions scandal were responding to a changing America, with rage at being robbed of what they believed was rightfully theirs.\nUpdated at 5:23 p.m. ET on April 9, 2019.\nSweet Christ, vindication!\nHow long has it been? Years? No, decades. If hope is the thing with feathers, I was a plucked bird. Long ago, I surrendered myself to the fact that the horrible, horrible private-school parents of Los Angeles would get away with their nastiness forever. But even before the molting, never in my wildest imaginings had I dared to dream that the arc of the moral universe could describe a 90-degree angle and smite down mine enemies with such a hammer fist of fire and fury that even I have had a moment of thinking, Could this be a bit too much?\nLet’s back up.\nThirty years ago, having tapped out of a Ph.D. program, I moved to Los Angeles (long story) and got hired at the top boys’ school in the city, which would soon become co-educational. For the first four years, I taught English. Best job I’ve ever had. For the next three, I was a college counselor. Worst job I’ve ever had.\nWhen I was a teacher, my job was a source of self-respect; I had joined a great tradition. I was a young woman from a certain kind of good but not moneyed family who could exchange her only salable talents—an abiding love of books and a fondness for teenagers—for a job. Poor, obscure, plain, and little, I would drive through the exotic air of early-morning Los Angeles to the school, which was on a street with a beautiful name, Coldwater Canyon, in a part of the city originally designated the Central Motion Picture District. It sat on a plot of land that in the 1920s composed part of the Hollywood Hills Country Club, an institution that has a Narnia-like aspect, in that not even the California historian Kevin Starr knew whether it ever really existed, or whether it was merely a fiction promoted by real-estate developers trying to entice new homeowners to the Edenic San Fernando Valley. Across from a round tower connecting the upper and lower campuses was Saint Saviour’s, a chapel that the founders of the school built in 1914 as an exact replica of the one built in 1567 for the Rugby School in England, with pews facing the center aisle in the Tudor style. This combination of the possibly imaginary country club and the assumption behind the building of the chapel—get the set right, and you can make the whole production work—seemed to me like something from an Evelyn Waugh novel. But it also meant that—unlike Exeter or Choate—this school was a place where I could belong. There were no traditions, no expectation of familiarity with the Book of Common Prayer. All you needed to have was a piercing love of your subject and a willingness to enter into an apprenticeship with great teachers. I had those things.\nThis was before cellphones and laptops, and in the chalk-dusted eternity of a 42-minute class period, there was such a thrumming, adolescent need for stimulation that when I opened whatever book we were reading—all of them great, all of them chosen by teachers far more thoughtful and experienced than I—and began reading aloud, the stream of words was the only thing going, and many of the students couldn’t help themselves from slipping into that stream and letting it carry them along.\nI met a traveller from an antique land,\nWho said—“Two vast and trunkless legs of stone\nStand in the desert …. Near them, on the sand,\nHalf sunk a shattered visage lies\nI did not come from a religious family, but we had a god, and the god was art, specifically literature. Taking a job teaching “Ozymandias” to a new generation was, for me, the equivalent of taking religious orders.\nAnd so when a job opened in the college-counseling office, I should not have taken it. My god was art, not the SAT. In my excitement at this apparent promotion, I did not pause to consider that my beliefs about the new work at hand made me, at best, a heretic. I honestly believed—still believe—that hundreds of very good colleges in the country have reasonable admissions requirements; that if you’ve put in your best effort, a B is a good grade; and that expecting adolescents to do five hours of homework on top of meeting time-consuming athletic demands is, in all but exceptional cases, child abuse. Most of all, I believed that if you had money for college and a good high-school education under your belt, you were on third base headed for home plate with the ball soaring high over the bleachers.\nI did not know—even after four years at the institution—that the school’s impressive matriculation list was not the simple by-product of excellent teaching, but was in fact the end result of parental campaigns undertaken with the same level of whimsy with which the Japanese Navy bombed Pearl Harbor.\nEvery parent assumed that whatever alchemy of good genes and good credit had gotten his child a spot at the prep school was the same one that would land him a spot at a hyper-selective college. It was true that a quarter of the class went to the Ivy League, and another quarter to places such as Stanford, MIT, and Amherst. But that still left half the class, and I was the one who had to tell their parents that they were going to have to be flexible. Before each meeting, I prepared a list of good colleges that the kid had a strong chance of getting into, but these parents didn’t want colleges their kids had a strong chance of getting into; they wanted colleges their kids didn’t have a chance in hell of getting into. A successful first meeting often consisted of walking them back from the crack pipe of Harvard to the Adderall crash of Middlebury and then scheduling a follow-up meeting to douse them with the bong water of Denison.\nThe new job meant that I had signed myself up to be locked in a small office, appointment after appointment, with hugely powerful parents and their mortified children as I delivered news so grimly received that I began to think of myself less as an administrator than as an oncologist. Along the way they said such crass things, such rude things, such greedy things, and such borderline-racist things that I began to hate them. They, in turn, began to hate me. A college counselor at an elite prep school is supposed to be a combination of cheerleader, concierge, and talent agent, radically on the side of each case and applying steady pressure on the dream college to make it happen. At the very least, the counselor is not supposed to be an adversary.\nI just about got an ulcer sitting in that office listening to rich people complaining bitterly about an “unfair” or a “rigged” system. Sometimes they would say things so outlandish that I would just stare at them, trying to beam into their mind the question, Can you hear yourself? That so many of them were (literal) limousine liberals lent the meetings an element of radical chic. They were down for the revolution, but there was no way their kid was going to settle for Lehigh.\nSome of the parents—especially, in those days, the fathers—were such powerful professionals, and I (as you recall) was so poor, obscure, plain, and little that it was as if they were cracking open a cream puff with a panzer. This was before crying in the office was a thing, so I had to just sit there and take it. Then the admissions letters arrived from the colleges. If the kid got in, it was because he was a genius; if he didn’t, it was because I screwed up. When a venture capitalist and his ageless wife storm into your boss’s office to get you fired because you failed to get their daughter (conscientious, but no atom splitter) into the prestigious school they wanted, you can really start to question whether it’s worth the 36K.\nSometimes, in anger and frustration, the parents would blame me for the poor return on investment they were getting on their years of tuition payments. At that point, I was living in a rent-controlled apartment and paying $198 a month on a Civic with manual windows. I was in no position to evaluate their financial strategies. Worst of all, the helpless kid would be sitting right there, shrinking into the couch cushions as his parents all but said that his entire secondary education had been a giant waste of money. The parents would simmer down a bit, and the four of us would stew in misery. Nobody wanted to hear me read “Ozymandias.”\nI will now add as a very truthful disclaimer that the horrible parents constituted at most 25 percent of the total, that the rest weren’t just unobjectionable, but many—perhaps most—were lovely people who were so wise about parenting that when I had children of my own, I often remembered things they had told me. But that 25 percent was a lesson that a lifetime of reading novels hadn’t yet taught me. In the classroom I was Jane Eyre, strong and tranquil in the truth of my gifts; in the college-counseling office, I was the nameless heroine of Rebecca, running up and down the servant stairs at the Hôtel d’Azur as Mrs. Van Hopper barked at me.\nDuring those three years before the mast, I saw no evidence of any of the criminal activity that the current scandal has delivered. But I absolutely saw the raw materials that William Rick Singer would use to create his scam. The system, even 25 years ago, was full of holes.\nThe first was sports. Legacy admissions have often been called affirmative action for white people, but the rich-kid sports—water polo, tennis, swimming, gymnastics, volleyball, and even (God help us all) sailing and actual polo—are the true affirmative action for the rich. I first became acquainted with this fact when I was preparing for a meeting with the parents of a girl who was a strong but not dazzling student; the list her parents had submitted, however, consisted almost exclusively of Ivy League colleges. I brought her file in to my boss for guidance. She looked it over and then, noticing something in the section on extracurricular activities and tapping it decisively with her pen, said, “Oh, she’ll get in—volleyball.”\nVolleyball? Yale was going to let her in—above half a dozen much more academically qualified and many much more interesting kids on my roster—because she played volleyball? I soon learned that the coaches of all these sports were allowed a certain number of recruits each year, and that so long as a kid met basic academic qualifications—which our kids easily did—the coaches got their way. I never heard an admissions person question a coach; “She’s on the soccer list,” the admissions person would say, and we’d move on to the next kid.\nThe second flaw in the system was an important change to the way testing is reported to the colleges. When I began the job, the SAT and the ACT offered extended-time testing to students with learning disabilities, provided that they had been diagnosed by a professional. However, an asterisk appeared next to extended-time scores, alerting the college that the student had taken the test without the usual time limit. But during my time at the school, this asterisk was found to violate the Americans With Disabilities Act, and the testing companies dropped it. Suddenly it was possible for everyone with enough money to get a diagnosis that would grant their kid two full days—instead of four hours—to take the SAT, and the colleges would never know. By 2006, according to Slate, “in places like Greenwich, Conn., and certain zip codes of New York City and Los Angeles, the percentage of untimed test-taking is said to be close to 50 percent.” Taking a test under normal time limits in one of these neighborhoods is a sucker’s game—you’ve voluntarily handicapped yourself.*\nAnd, finally, there were large parts of the process over which no one entity had complete oversight. The kids were encouraged, but not required, to bring us their essays. Ditto the lists of extracurricular activities they were required to submit to the colleges. The holy trinity of documents—transcript, test scores, and teacher recommendations—never touches the kids’ hands. But the veracity of everything else depends on a tremendous leap of good faith on the part of the admissions offices.\nAnd it was through these broken saloon doors—the great power conferred on coaches, extended-time testing, and the ease with which an application can be crammed with false information—that Singer pushed unqualified students into colleges they wanted to attend. He told the parents to get their kids diagnosed with learning disabilities, and then arranged for them to take the test alone in a room with a fake proctor—someone who was so skilled at taking these tests that he could (either by correcting the student’s test before submitting it or by simply taking the thing himself) arrive at whatever score the client requested. (“I own two schools,” Singer told a client about the testing sites, one in West Hollywood and the other in Houston, where his fake proctors could do their work.) He allowed coaches to monetize any extra spots on their recruitment lists by selling them to his clients. And he offered a service that he called “cleaning up” the transcript, which involved, at the very least, having his employees take online courses in the kids’ name and then adding those A’s to their record.\nAll this malfeasance has led to the creation of a 200-page affidavit, and a bevy of other court documents, that can best be described as a kind of posthumous Tom Wolfe novella, one with a wide cast of very rich people behaving in such despicable ways that it makes The Bonfire of the Vanities look like The Pilgrim’s Progress. If you have not read the affidavit, and if you’re in the mood for a novel of manners of the kind not attempted since the passing of the master, I recommend that you and your book club put it on the list for immediate consumption.\nThe one compliment the FBI paid the indicted parents is that it took college admissions as seriously as they did. The investigation included wiretaps, stakeouts, reviews of bank statements, travel records, cell-site data, emails, and interviews with cooperating witnesses—chief among them Singer, who seems not simply to have thrown his clients under a bus, but rather to have taken them to Port Authority and thrown them under an entire fleet.\nHow did his scam come to light? Let the reader be introduced to Morrie Tobin, upon whose character and doings much will depend. A 55-year-old stockbroker and father of six who lives in the elegant Los Angeles neighborhood of Hancock Park, he got pinched last spring for an SEC violation that allegedly defrauded clients of millions of dollars. Desperate to lighten his punishment, the Los Angeles Times reported, he offered an unrelated claim: There was a Yale soccer coach, Rudy Meredith, who accepted bribes to let kids into the university. Of all the things Tobin could have given up, this seems an especially cruel one—he had two daughters enrolled at Yale, one had graduated from the university, and a fourth had recently been accepted. At the very least, this revelation put their admissions in an unflattering light. The FBI had Tobin wear a wire to a private meeting with the coach, during which Singer’s name came up, and from there the full investigation—“Varsity Blues”—began.\nMost of the families involved in the scandal lived in the California dreamscapes of a Nancy Myers movie: Newport Beach, Hillsborough, Laguna Beach, San Francisco, Del Mar, Ross. The out-of-staters are no slouches either. One family divides its time between Aspen and New York; another lives in Greenwich. Let’s start there, in Greenwich, where not getting your kid into the right college is cause for seppuku. We are in the home of Gordon Caplan and his wife, Amy. Gordon was—until placed on “leave” post-indictment—the co-chairman of a New York–based global law firm, where he was a partner in the private-equity group. Amy is the heiress daughter of the late telecommunications magnate Richard Treibick. He also lived in Greenwich, summering in the Hamptons in a 32-acre spread in Sagaponack that included a seven-bedroom house on the dunes with a pool overlooking the ocean, which his family sold shortly after his death in 2014 for a reported $35 million. (Caplan has not commented publicly on the allegations contained in the filings, or entered a plea; he was scheduled to make his first court appearance on Wednesday.)\nGordon graduated from Cornell, but ended up pursuing his law degree at sweaty-browed Fordham, suggesting the combination of privilege and hustle that can really get a certain kind of guy ahead. He was the board chairman of the world’s most quixotic nonprofit organization, Publicolor, which seeks to “improve education in youth by promoting an imaginative use of color in school buildings.” In 2018—the year he was negotiating with Singer about his daughter’s future—The American Lawyer magazine named him Dealmaker of the Year.\nHe seems to have had Cornell on his mind for his daughter, having dramatically upped his annual giving to the low six figures during her sophomore and junior years of high school. But her grades and scores were apparently too low for the traditional approach, and he and Singer began talking about a scheme. “What is the, what is the, the number?” he asks Singer, “at Cornell for instance.”\n“Hold on a second,” Singer says, carefully bleeding his client one pint at a time. “The number on the testing is $75,000.” (Singer seems to have operated on a sliding scale. He charged Caplan $75,000 for the testing scam, yet he charged Felicity Huffman only $15,000. Perhaps The American Lawyer needs to cast a wider net when selecting its Dealmakers of the Year.)\n“I can do anything and everything, if you guys are amenable to doing it,” he tells Caplan, explaining the elaborate system he employed to falsify test scores: “I can guarantee her a score.”\nCaplan takes a few hours to digest this idea, and then has a second phone call with Singer. “This notion of effectively going in, flying out to L.A., sitting with your proctor, and taking the exam is pretty interesting.”\n“It’s the homerun of homeruns,” Singer tells him.\n“So, how do I get this done with you?” Caplan asks. “What do I need to do?”\nSinger gives an interesting answer: “I’m gonna talk to our psychologist, and we may have to send her to you, or you to her.” Sure enough, per the criminal complaint, “On or about July 21, 2018, CAPLAN and his daughter flew to Los Angeles to meet with a psychologist in an effort to obtain the medical documentation required to receive extended time on the ACT exam.”\nThis is the only section of the complaint that mentions the character of “our psychologist.” There are more educational psychologists in Greenwich, Connecticut, than there are Labrador retrievers. Hotfoot it over to New Haven or Manhattan, and you have to beat them off with a stick. Why was Singer so certain that this particular psychologist would produce the documentation the student needed? The government is clearly continuing its investigation—student records have been subpoenaed from several private schools in Los Angeles, and it’s not hard to imagine that more indictments, perhaps many more, are coming. “Our psychologist” might play a role in these investigations.\nThe problem with getting newly diagnosed with a learning disability in 11th or 12th grade is that the companies that own the tests know they’re probably being manipulated, and will often deny the application for extended-time testing. Sure enough, the ACT denied the Caplan daughter’s first request, and also her appeal. But then, a surprising bit of good news. “You were right,” Caplan tells Singer; “it was like third time was the charm … Everybody was telling us there’s no way, and then all of a sudden it comes in.” But one of the delights of this novel is that the reader is often in possession of information the main characters lack. While Caplan crows, we smirk: “The ACT ultimately granted CAPLAN’S daughter extended time on the exam at the request of law enforcement.”\nThe only obstacle Caplan has in executing his plan (other than the FBI, but that outfit is still months away from making itself known to him) is the old ball and chain. In the obdurate way of heiresses who grew up in the cleansing sea air of Sagaponack summers and not amid the hard-roll-with-butter realities of Fordham Law, she has her niceties. In July, when both Amy and Gordon get on speakerphone with Singer, the con man suggests having one of his operatives take an online class for their daughter as a means of bringing up her GPA. But “CAPLAN’s spouse replied that she had a ‘problem with that.’”\nCaplan grabs the phone off the cradle, effectively taking Miss Scruples off the call.\n“It’s just you and me,” he tells Singer. “Is that kosher?”\nNo, it’s not kosher. Obviously.\n“Absolutely,” Singer says. “I do it all the time man.”\nBy November, the Gordon/Amy situation had reached one of those marital impasses in which Partner A is going ahead with something Partner B thinks is messed up, but isn’t willing to outright squash, because who knows? Maybe it will work. It’s a high-risk/high-reward prospect for Partner A. “I’m taking [Amy] off of this,” Caplan tells Singer at one point; [Amy] is very nervous about all this.”\nBut the Dealmaker of the Year spent considerable time kicking the tires on this one. “Keep in mind I am a lawyer,” Caplan said at one point, according to the affidavit. “So I’m sort of rules oriented.” And, later, “I’m not worried about the moral issue here. I’m worried about the, if she’s caught doing that, you know, she’s finished.”\nMuch of the discussion of this scandal has centered on the corruption in the college-admissions process. But think about the kinds of jobs that the indicted parents held. Four of them worked in private equity, a fifth in the field of “investments,” others in real-estate development and the most senior management of huge corporations. Together, they have handled billions of dollars’ worth of assets within heavily regulated fields—yet look how easily and how eagerly they allegedly embrace a crooked scheme, as quoted in the court documents.\nHere is Bill McGlashan, then a senior executive at a global private-equity fund, reacting to Singer’s plan to get his son (who does not play football) admitted to USC via the football team: “That’s just totally hilarious.”\nHere is Robert Zangrillo, the founder and CEO of a private investment firm, talking with one of Singer’s employees who is planning to bring up his daughter’s grades by taking online classes in her name: “Just makes [sic] sure it gets done as quickly as possible.”\nHere is John B. Wilson, the founder and CEO of a private-equity and real-estate-development firm, on getting his son into USC using a fake record of playing water polo: “Thanks again for making this happen!” And, “What are the options for the payment? Can we make it for consulting or whatever … so that I can pay it from the corporate account?” He can. “Awesome!”\nHere is Douglas Hodge, the former CEO of a large investment-management company, learning from Singer that his son will be admitted to USC via a bribery scheme, and that it’s time to send a check: “Fanstatic [sic]!! Will do.”\nThe word entitlement—even in its full, splendid range of meanings—doesn’t begin to cover the attitudes on display. Devin Sloane is the CEO of a Los Angeles company that deals in wastewater management. Through Singer, he allegedly bribed USC to get his son admitted as a water-polo player. But a guidance counselor at his school learned of the scheme and contacted USC—the boy did not play the sport; something was clearly awry. Singer smoothed it over, but the whole incident enraged Sloane: “The more I think about this, it is outrageous! They have no business or legal right considering all the students privacy issues to be calling and challenging/question [my son’s] application,” he wrote to Singer.\nThere are several instances of college counselors gumming up the works with their small-timers’ insistence on ethical behavior. That someone as lowly, as contemptibly puny, as a guidance counselor should interfere with a rich person’s desires is the cause of electric rage. For this reason, after having read the 200-page affidavit many times and trying to be as objective as possible, I had to conclude that the uncontested winners of Worst People (So Far) to Be Indicted are Lori Loughlin, an actress, and her husband, Mossimo Giannulli, a designer. When a college counselor at their daughter’s high school realized something was suspicious about her admission to USC and asked the girl about it, the parents roared onto campus in such a rage that they almost blew up the whole scam.\nThe couple paid $500,000 to get both of their daughters into USC on the preposterous claim that they rowed crew. Their daughter Olivia has become a particularly ridiculed character in the saga, because there are pre-indictment videos in which she describes both her lack of desire to attend college and how rarely she attended high school during her senior year. But I have sympathy for her. She knew higher education wasn’t where she belonged, but her parents insisted that she go. Up until the scandal, the girl had a thriving cosmetics line, was a popular YouTuber, and was clearly making the best of what Hillary Clinton would call her God-given potential. Now she’s a punch line, and Sephora has pulled her products off the shelves.\nThe court filings don’t state when the parents began working with Singer, but they appear to have felt a sense of urgency on April 22, 2016, when they took part in a standard component of prep-school college counseling: the family meeting with a college counselor during spring of junior year. “We just met with [Olivia’s] college counselor this am,” Giannulli wrote in an email to Singer. “I’d like to maybe sit with you after your session with the girls as I have some concerns and want to fully understand the game plan … as it relates to [her] and getting her into a school other than ASU!”\nMentioning Arizona State University to the private-school parents of a freshman is the equivalent of throwing a flash-bang grenade; it won’t kill anyone, but it will sure as hell get their attention. But mention it to the parents of a second-semester junior, and you’re no longer issuing warnings. ASU is the unconditional surrender.\n“If you want [U]SC,” Singer replies, “I have the game plan ready to go into motion.”\nBut the college counselor at the girls’ high school had always doubted that the first girl rowed crew; when the second one got into the same school for the same reason, she realized that something suspicious was going on. She confronted the girl.\nThe counselor was acting honorably. Loughlin and Giannulli—if the affidavit is to be believed—were in the midst of a criminal operation. Yet instead of hanging his head in shame, Giannulli apparently roared onto the high-school campus apoplectic. Singer got a panicked email from his USC contact: “I just want to make sure that, you know, I don’t want the … parents getting angry and creating any type of disturbance at the school … I just don’t want anybody going into … [the daughter’s high school] you know, yelling at counselors. That’ll shut everything—that’ll shut everything down.”\nIt’s hell on Earth for college counselors when people like this show up angry that their kid didn’t get an acceptance from Williams. But to endure it because you’ve gotten in the way of a giant scam? Hideous.\nOne way or another, the counselor was impelled—I would imagine by some freaked out higher-up—to send the parents an email:\nI wanted to provide you with an update on the status of [your younger daughter’s] admission offer to USC. First and foremost, they have no intention of rescinding [her] admission and were surprised to hear that was even a concern for you and your family. You can verify that with [the USC senior assistant director of admissions] … if you would like. I also shared with [the USC senior assistant director of admission] that you had visited this morning and affirmed for me that [your younger daughter] is truly a coxswain.\nAs Jerry Maguire said about being a sports agent, being a prep-school college counselor is an “up-at-dawn, pride-swallowing siege.” But no work of fiction could prepare these employees for the fact that there are now L.A. private-school parents who are intent on maligning the guidance counselors who they have decided must have been in on the scheme. The president of one school sent this email to parents: “I want to emphasize that I have absolute confidence in the honesty of our deans, the accuracy of the information they provide to colleges and their focus on personal character in the guidance they provide our students.” Honesty of the deans? It’s the dishonesty of the parents that’s the problem.\nEver since the scandal became public, two opinions have been widely expressed. The first is that the schemes it revealed are not much different from the long-standing admissions preference for big donors, and the second is that these admissions gained on fraudulent grounds have harmed underprivileged students. These aren’t quite right. As off-putting as most of us find the role that big-ticket fundraising plays in elite-college admissions, those monies go toward programs and facilities that will benefit a wide number of students—new dormitories, new libraries, enriched financial-aid funds are often the result of rich parents being tapped for gifts at admissions time. But the Singer scheme benefits no one at all except the individual students, and the people their parents paid off.\nThe argument that the scheme hurt disadvantaged applicants—or even just non-rich applicants who needed financial aid to attend these stratospherically expensive colleges—isn’t right either. Elite colleges pay deep attention to the issue of enrollment management; the more elite the institution, the more likely it is to be racially and socioeconomically diverse. This is in part because attaining this kind of diversity has become a foundational goal of most admissions offices, and also because the elite colleges have the money to make it happen. In 2017, Harvard announced with great fanfare that it had enrolled its first class in which white students were in the minority.\nWhen I was a prep-school college counselor 25 years ago, I thought that whatever madness was whirring through the minds of the parents was a blip of group insanity that would soon abate. It has only gotten more and more extreme. Anyone can understand a parent’s disappointment if he had thought for 17 years that his child would go to Yale one day, only to learn that it’s not in the cards. But what accounted for the intensity of emotion these parents expressed, their sense of a profound loss, of rage at being robbed of what they believed was rightfully theirs? They were experiencing the same response to a changing America that ultimately brought Donald Trump to office: white displacement and a revised social contract. The collapse of manufacturing jobs has been to poor whites what the elite college-admissions crunch has been to wealthy ones: a smaller and smaller slice of pie for people who were used to having the fattest piece of all.\nIn the recent past—the past in which this generation of parents grew up—a white student from a professional-class or wealthy family who attended either a private high school or a public one in a prosperous school district was all but assured admission at a “good” college. It wasn’t necessarily going to be Harvard or Yale, but it certainly might be Bowdoin or Northwestern. That was the way the system worked. But today, there’s a squeeze on those kids. The very strong but not spectacular white student from a good high school is now trying to gain access to an ever-shrinking pool of available spots at the top places. He’s not the inherently attractive prospect he once was.\nThese parents—many of them avowed Trump haters—are furious that what once belonged to them has been taken away, and they are driven mad with the need to reclaim it for their children. The changed admissions landscape at the elite colleges is the aspect of American life that doesn’t feel right to them; it’s the lost thing, the arcadia that disappeared so slowly they didn’t even realize it was happening until it was gone. They can’t believe it—they truly can’t believe it—when they realize that even the colleges they had assumed would be their child’s back-up, emergency plan probably won’t accept them. They pay thousands and thousands of dollars for extended-time testing and private counselors; they scour lists of board members at colleges, looking for any possible connections; they pay for enhancing summer programs that only underscore their children’s privilege. And—as poor whites did in the years leading up to 2016—they complain about it endlessly. At every parent coffee, silent auction, dinner party, Clippers game, book club, and wine tasting, someone is bitching about admissions. And some of these parents, it turns out, haven’t just been bitching; some of them decided to go MAGA.\nAnd so it was that at 5:59 on the morning of March 12 in the sacramentally beautiful section of the Hollywood Hills called Outpost Estates, all was quiet, save for the sounds of the natural world. In the mid-century modern house of a beloved actress—a champion of progressive values, as is her husband—and two lovely daughters, everyone slept. But at the strike of 6:00, there was the kind of unholy pounding at the door that must have sounded more like an earthquake than a visitor: FBI agents, guns drawn, there to apprehend … Felicity Huffman? Felicity “Congress is attempting to eviscerate women’s health care. Like many women across America, I am outraged” Huffman? For the crime of … paying to get her daughter an extra 400 points on the SAT?\nDown, down, down she went in the FBI car, in her handcuffs and athleisure, down below Outpost, down below Lake Hollywood, down below the Dolby Theatre where she had been so many times—in a beautiful gown, with her famous husband, William H. Macy, beside her—to watch the Academy Awards, once as a nominee. All the way down to—my God!—the downest place of all: Spring Street. The federal courthouse! This was where Donald Trump was supposed to go, not Felicity Huffman. Cool your heels, defender of the downtrodden: There is no rushing through all this—the mug shot, the phone call, the hearing. And this can’t even be grist for the mill of a new devotion to the plight of American mass incarceration. You’re now Exhibit A of law enforcement finally treating rich, white Americans as unsparingly as it treats poor, black ones.\nAll she wanted was an even playing field for her rich, white daughter! All she wanted was a few hundred SAT points so the girl didn’t get lost in the madness that has made college admissions so stressful, so insane, so broken, so unfair. “We’re talking about Georgetown,” Macy informed Singer about their hopes for their younger daughter. Fortunately for them, and for the younger daughter—and possibly for Georgetown itself—they had not employed him to work on this goal before the indictments were handed down. Fortunately for Macy (who seems to have taken a modified Parent B position), only Huffman has been indicted in the scheme.\nHuffman, like all of the other indicted parents, was expressing an attitude I first encountered not in the great books, but in the Charlie Brown Christmas special, when Sally dictates her endless list of toys to Charlie. “All I want is what I have coming to me,” she tells him; “all I want is my fair share.”\n* This story has been updated to clarify the nature of the accommodations provided for standardized testing.",
  "word_count": 6093,
  "scraped_at": "2026-02-14T12:16:52.768881"
}