{
  "article_id": "a1aca215c229",
  "url": "https://en.chessbase.com/post/asian-continentals-a-rsum",
  "title": "Asian Continentals , a résumé",
  "date": "20230701T150000Z",
  "domain": "en.chessbase.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "2023 will be the year of chess in Kazakhstan. Taking place alternately in the two largest cities, Almaty and Astana, as well as in other picturesque tourist resorts, numerous important international and national events have been running non-stop since the beginning of the year. Thanks to the dedication and impeccable organisation of the Kazakh Chess Federation led by Timur Turlov, whose company Freedom Holding Corp. is also a generous sponsor, Kazakhstan is slowly but surely turning into the Mecca of chess.\nThe most recent international event was the Asian Continental Championship, held from 4 to 11 June, in which 130 athletes from 18 countries took part. The President of the Asian Chess Federation, Sheikh Sultan bin Khalifa al Nahyan, attended the closing ceremony.\nThe President of the Asian Chess Federation, Sheikh Sultan bin Khalifa al Nahyan, the First Vice-President of the Kazakh Chess Federation, Darmen Sadvakasov, and the Deputy Mayor of Almaty, Asem Nusipova.\nHeld on their home turf, the Kazakh players were understandably the most numerous. Not only that, but their results were outstanding.\nKazakhstan won two gold and two bronze medals. The blitz event that preceded the main competition revealed a new Kazakh star: Isanzhulov Arystan, a 20-year-old FM (standard rating 2408, blitz rating 2450), emerged as the winner with 7.5 points after defeating four GMs, including Megaranto Susanto (INA, 2614) and Vokhidov Shamsiddin (UZB, 2570). Arystan suffered only one defeat, against the bronze medallist of the tournament and his compatriot GM Makhnev Denis.\nThe top 20 players of the Blitz tournament\nIn the women's competition, gold was also won by a representative of Kazakhstan: 18-year-old WIM Xeniya Balabayeva (standard rating 2186, blitz rating 2113).\nGold for Kazakhstan: Xeniya Balabayeva and Isanzhulov Arystan\nIn the women's Blitz tournament, a young Kazakhstani player climbed from the bottom of the seedings to 5th place, leaving eighteen titled players in her wake. 12-year-old Kholyavko Mariya made 6/9 with a rating of only 1570 and earned a whopping 226 rating points.\nIn the main women's competition, Xeniya Balabayeva missed the podium by just half a point. She tied with another Kazakh, Kairbekova Amina, for fourth and fifth place.\nBest women: (from left) 4th - WIM Xeniya Balabayeva (KAZ); 1st - WGM Diviye Deshmukh (IND), 2nd - WGM Marie Anne Gomez (IND); 5th - WIM Kairbekova Amina (KAZ); 3rd - IM Munguntuul Batkhuyag (MGL)\nGM Shamsiddin Vokhidov, a member of the famous Uzbek team, won the Open tournament undefeated with 7/9 and 14 points added to his rating. GM Daneshvar Bardiya of Iran was second with half a point less, tied with Kazakh IM Alisher Suleimenov, the bronze medallist.\n(From left to right) Daneshvar Bardiya, Shamsiddin Vokhidov, Alisher Suleimenov\nThe 'King of Chess Asia 2023', GM Shamsiddin Vokhidov\nWe have not often seen the runner-up, Daneshvar Bardiya, on the international circuit. He is 17 years old and has recently been awarded a GM title. Maybe that will change after this amazing success. He was unbeaten and scored 6.5/9.\nHe continued his stay in Kazakhstan to play at the Actobe Open Classic that followed only days after the Asian Continental (20 - 27 June). There, he continued his winning streak: by the fifth round he was in sole lead with a perfect 5/5. Undefeated, he won the tournament with 7,5 /9.\nGM Daneshvar Bardiya, a new star from Iran\nIn third place, Kazakh IM Alisher Suleimenov secured a place in the World Cup and with 2498 points, just two points short of the 2500 required, is well on his way to becoming a Grandmaster. He was already a member of the Kazakh national team at the last Olympiad.\nKazakhstan's number one, GM Rinat Jumabaev, shared first place in the fifth round with the eventual winner, GM Shamsiddin Vokhidov of Uzbekistan. He did not recover from his defeat to Vokhidov and, after three consecutive draws, finished in tenth place (6/9), one point behind the winner and tied with five players. Rinat Jumabayev will be remembered for eliminating Fabiano Caruana, then ranked #2 in the world, in the third round of the 2021 World Championship. Jumabayev was eliminated by Sam Shankland in the following round.\nKazakhstan's No.1, GM Rinat Jumabayev (right) playing against IM Alisher Suleimenov, the new Kazakh hope, in round 5 (1-0)\nIndia is never far behind when it comes to the number of participants and their impressive results.\nHowever, their rising star and the tournament's top seed, GM Arjun Erigaisi, was lacklustre in this event. Although he finished just half a point behind the winner, he was tied with five other players for sixth place. According to 'ChessBase India', he has lost his last chance to secure a ticket to the World Championship and, unless he is given a wild card, he may lose out for this year.\nGM Arjun Erigaisi, hoping for a wild card\nWe do not often hear about players from Afghanistan. Khatibi Mohammad Qais has already taken part in two international events in Kazakhstan: The Kazakhstan Cup in March this year and now the Asian Continentals. In a short video of the Kazakh Chess Federation he talks about his impressions and the chess situation in his country.\nKhatibi Mohammad Qais from Afghanistan\nAnother unusual visitor came from Papua New Guinea. FM Stuart Fancy is vice-president of the Papua New Guinea Chess Federation. He was also listed as a potential vice-president on the ticket of former FIDE General Secretary CM Enyonam Sewa Fumey from Togo, who unsuccessfully ran for the FIDE presidency last year. The Kazakh Chess Federation has published a short interview with Stuart Fancy in which he praises the event and gives a brief account of himself and chess in Papua New Guinea.\nFM Stuart Fancy from Papua New Guinea\nIn recent chess news, the Papua New Guinea Chess Federation has been mentioned as the only federation to have voted against the infamous transfer of the Russian Chess Federation to the Asian Chess Federation. The public vote showed that 6 federations abstained (Mongolia, Taiwan, Singapore, Hong Kong, Australia, Bhutan) and the remaining 29 voted in favour of the transfer.\nIt is difficult to predict how the transfer will affect the Russian players' careers in the near future. At this early stage, they must feel confused and disoriented.\nWhat follows is an attempt at an in-depth analysis of the transfer of the Russian Chess Federation to the Asian Chess Federation, the \"predicament of Russian players\".\nThe predicament of Russian players\nThe Asian Continental Championship had a special significance in the current chess climate, as it reopened questions about the fate of Russian players since the recent transfer of the Russian Chess Federation (RCF) to the Asian Chess Federation (ACF). It was the first major event in which Russian players could have played within the new structure. Conspicuously, however, there was not a single Russian player in either of the two sections, the Open and the Women's. The reason for their absence can only be speculated. Although I made several enquiries, I was unable to obtain clarification from the relevant authorities as to whether Russian players were officially eligible to play. One of the reasons could be that some Russian players have already taken part in the European Individual Championships from 3-13 March. Both events are qualifiers for the World Championship. The transfer was approved just a few days before the start of the European Individual Championships, but it was decided that Russian players already registered could still play under a neutral flag.\nThe winner of the European Individual Championship was a Russian player, GM Alexey Sarana. He has since moved to the Serbian Federation.\nAlexey Sarana, the last Russian to be crowned European Chess Champion | Photo: European Chess Union https://www.europechess.org/\nThe exodus of Russian players to other federations has been going on for some time, but it accelerated after the Russia - Ukraine war and continues now that the Russian Federation has left the European Chess Union.\nThe transfer was approved on 28 February at the General Assembly of the Asian Chess Federation in Abu Dhabi and made official on 1 May. Although geographically the move makes some sense, since 77% of Russia's landmass is in Asia and only 23% in Europe, it is well known that it was politically motivated. A few days after the start of the Russian 'special operation' on Ukrainian soil, the International Olympic Committee (IOC) issued a resolution recommending that international sports federations and sports event organisers should not invite or allow Russian and Belarusian athletes and officials to participate in international competitions and that Russian and Belarusian nationals, whether individuals or teams, should only be accepted as neutral athletes or neutral teams. No national symbols, colours, flags or anthems should be displayed.\nInside the Games, the world's number one Olympic news website, reported extensively on the chess transfer from Russia to Asia. It noted that most Russian sports have opted against moving their affiliation from Europe to Asia, including the Russian Football Union, which has instead sought to set up a working group with UEFA to restore relations.\nIt seems that there was already some kind of rift between the European Chess Union and the Russian Chess Federation. Alexander Tkachev, Executive Director of the RCF, commented for the Russian state news agency TASS: \"Throughout the existence of the European Chess Union, only one European-level tournament has been held here. We know how to hold it, we just have not been allowed to. There was not a single Russian representative on the board, but that is not the case now.\" Both Alexander Tkachev and the President of the Russian Chess Federation, Andrey Filatov, hope that after the transfer, ACF-authorised tournaments will be held in Russia already this year.\nMembers of the Asian Chess Federation presidium at the Asian Chess Summit in Abu Dhabi on 28 February | Photo: RCF https://ruchess.ru/\nThe fate of the players, and in particular their chances of competing for a place at the World Championship, remains unclear. \"Inside the Games\" reported:\n\"FIDE said the change would not affect the sanctions it had imposed. Russian players would still have to play under a neutral flag (FIDE's) or request a transfer to another federation in order to play in FIDE events. And Russian teams would not be allowed to take part in world competitions, regardless of which continental federation they belong to. The main difference would be that currently Russia can't play in the European Championships, and after this move they might be allowed to play in the Asian Championships.\"\nA statement from Alexander Tkachev adds to the confusion: \"If the Asian Championship is not a qualifier for the World Cup, we will play under the national flag and anthem.\"\nThis statement provides a possible explanation for the absence of Russian players at the recently concluded Asian Continentals. As the event was a qualifier for the World Cup, it means that they could not compete under the national flag and anthem. But it also means that under such conditions they would not compete at all.\nEuropean Chess Union (ECU) vice-president Malcolm Pein accused FIDE of being \"run by the Kremlin\" after it allowed the Russian Chess Federation to move to Asia. However, despite Dvorkovich's former close ties to Putin's office, FIDE has followed the IOC's recommendations and has strongly opposed the use of the Russian national flag and anthem at international competitions run by FIDE. Furthermore, although FIDE approved the transfer, its formal approval was not required under the rules, as such transfers can be made by internal agreement between continental federations.\nAmong the many questions and uncertain answers, the most important is: if the future of Russian chess players has been considered, as it should be, how do they benefit from their federation's move to the Asian federation?\nThe well-established procedure of earning a place at the World Championship through a continental championship has now been spoiled.\nFilatov told the Russian federal sports channel Match TV ( https://matchtv.ru/) that Asian chess life offers even more opportunities: in addition to the standard continental competitions there are the Asian Olympic Games and the Asian Indoor Games, where chess is included and where Russian athletes could become champions. However, their participation still has to be approved by the International and Asian Olympic Committees.\nAndrey Filatov, President of the Russian Chess Federation, and Sheikh Sultan bin Khalifa Al Nahyan, President of the Asian Chess Federation, at the Asian Summit | Photo: RCF https://ruchess.ru/\nAny change needs time for adaptation and stability. Perhaps the move will eventually prove beneficial. But for now, Russian players are geopolitical victims through no fault of their own, left out in the cold while lawmakers shoot over their heads.\nMore articles by Diana Mihajlova...",
  "word_count": 2114,
  "scraped_at": "2026-02-14T12:26:42.738684"
}