{
  "article_id": "a1bde42c7d0a",
  "url": "http://www.cambodiantimes.com/news/278761764/messi-meets-india-champions-adidas-star-athletes-unite-at-purana-qila",
  "title": "Messi Meets India Champions : adidas Star Athletes Unite at Purana Qila",
  "date": "20251218T104500Z",
  "domain": "cambodiantimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ANI PR Wire\n18 Dec 2025, 15:16 GMT+10\nBusinessWire India\nNew Delhi [India], December 18: adidas, committed towards fostering a dynamic multi-sport culture in India, brought together football legend Lionel Messi and some of the nation's most inspiring world champions. Set in front of the majestic Purana Qila, this moment reinforces adidas' enduring vision to create a global stage for sport where excellence is recognized and celebrated beyond borders.\nThe iconic heritage site transformed into a confluence of greatness as Messi shared a rare interaction with Sumit Antil (World Para Athletics Champion - Javelin), Nishad Kumar (World Para Athletics Champion - High Jump), Nikhat Zareen (Women's World Boxing Champion), Renuka Thakur (Women's T20 World Champion), and Kuldeep Yadav (Men's T20 World Champion). More than just a meeting, this was an exchange of mutual respect between athletes who have achieved greatness in their respective sports at a global stage.\nFrom Messi's triumphs at the FIFA World Cup and beyond to Sumit and Nishad's dominance in para-athletics, Nikhat's precision in the ring, and the World Cup heroics of Renuka and Kuldeep, this gathering symbolized the shared language of respect for athletes across sport. By bringing together champions from football, cricket, boxing, and para-athletics, adidas reiterated its belief that sport in India is evolving beyond boundaries.\nSpeaking on the moment, Vijay Chauhan, GM, adidas India, said: \"At adidas, we believe that sports is the ultimate unifier. Bringing a legend like Lionel Messi together with India's finest world champions and seeing them interact and inspire one another, reinforces this belief. This isn't just about individual greatness, but about the collective spirit of the three stripes that connects athletes across borders and disciplines.\"\nSharing his experience, Lionel Messi said, \"Sport knows no borders, and meeting these incredible Indian champions today has been a reminder that while the sports we play may be different, the passion and drive to win are the same. adidas has always stood for athletes across the globe, and it is a privilege to stand alongside these World Champions who are writing their own history and inspiring a new generation in India.\"\nThis historic union at Purana Qila serves as a powerful testament to the adidas spirit, bringing together legends of today to inspire the champions of tomorrow, united by the drive to push boundaries and redefine what is possible.\nLink to the collaboration post: https://www.instagram.com/p/DSXcN-dEiQB/?utm_source=ig_web_copy_link&igsh=MzRlODBiNWFlZA==\n(ADVERTORIAL DISCLAIMER: The above press release has been provided by BusinessWire India. ANI will not be responsible in any way for the content of the same)\nShares\nShare\nTweet\nShare\nFlip\nEmail\nGet a daily dose of Cambodian Times news through our daily email, its complimentary and keeps you fully up to date with world and business news as well.\nPublish news of your business, community or sports group, personnel appointments, major event and more by submitting a news release to Cambodian Times.\nMore InformationWASHINGTON, D.C.: A JetBlue flight from the small Caribbean nation of Curaçao avoided a collision with a U.S. Air Force refueling tanker...\nDUBAI, U.A.E.: Supporters of Iranian Nobel Peace Prize laureate Narges Mohammadi noted on December 12 that the government had arrested...\nMIAMI, Florida: The admiral in charge of U.S. military forces in Latin America stepped down on December 12, two years before his retirement...\nBOSTON, Massachusetts: A third lawsuit, this one filed in a Massachusetts federal court by California and 19 other U.S. states, was...\nWASHINGTON, D.C.: The Trump administration is defending its decision not to provide real-time American Sign Language interpretation...\nNEW YORK CITY, New York: Attacked by President Donald Trump for reporting about his physical condition, The New York Times fired back...\nKolkata (West Bengal) [India], December 18 (ANI): The Indian Deaf Cricket Association (IDCA), supported by the Board of Control for...\n(Photo credit: Nathan Ray Seebeck-Imagn Images) Neither the Atlanta Falcons nor the Arizona Cardinals have the record they thought...\n(Photo credit: Travis Register-Imagn Images) The Denver Broncos were considered an AFC front-runner entering the season. The Jacksonville...\n(Photo credit: Raymond Carlin III-Imagn Images) New York Giants quarterback Jaxson Dart knows that he is in for a challenge Sunday...\nKolkata (West Bengal) [India], December 18 (ANI): Cricket icon and a defining Kolkata figure, Sourav Ganguly, has joined Tiigers of...\nNew Delhi [India], December 18 (ANI): Former Indian cricketer Aakash Chopra expressed surprise at New Zealand all-rounder Michael Bracewell...",
  "word_count": 720,
  "scraped_at": "2026-02-14T12:37:37.411628"
}