{
  "article_id": "a1c062cef951",
  "url": "https://www.eastbaytimes.com/2025/07/27/euro-2025-england-beats-spain-in-a-penalty-shootout-after-1-1-draw-to-retain-title/",
  "title": "Euro 2025 : England beats Spain in a penalty shootout after 1 - 1 draw to retain title",
  "date": "20250727T223000Z",
  "domain": "eastbaytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By GRAHAM DUNBAR\nBASEL, Switzerland (AP) — England thrived in high drama yet again to take down Spain in a penalty shootout and win another Women’s European Championship title on Sunday.\nChloe Kelly lashed in her spot kick to give defending champion England a 3-1 win in the shootout after a 1-1 draw after extra time.\n“I was cool, I was composed, and I knew I was going to hit the back of the net,” said Kelly, whose goal decided a second straight Women’s Euros final.\nEngland goalkeeper Hannah Hampton saved spot kicks from Mariona Caldentey and Spain superstar Aitana Bonmatí, before substitute Salma Paralluelo dragged her shot wide of goal.\nThe defending champion won the only way it knew how at this thrilling Euro 2025.\nSuper subs\nEngland had fallen behind in the first half, fought back in the second and relied on its superb substitutes — including Kelly – just as it did against Italy and Sweden previously in the knockout rounds.\nEngland leveled the score in the 57th on Alessia Russo’s header from a cross by Kelly after Mariona Caldentey had given Spain the lead in the 25th finishing Ona Battle’s cross.\nSpain trailed for only four minutes in the entire tournament — and not for one second against England — yet the reigning World Cup winner could not seal its first European title.\n“I think this team deserved more. At least not living with this bitter feeling,” Spain coach Montse Tomé said in translated comments.\nKelly had scored an extra-time winning goal for England at Wembley three years ago to beat Germany 2-1.\nIn extra time Spain had good possession in the England penalty area so many times yet did not force a decisive goal.\n“It was cruel,” Bonmatí told Spanish broadcaster La 1, after being named best player of the tournament. “We played better, created more scoring chances, but in soccer sometimes that’s not enough.”\nSpain goalkeeper Cata Coll saved spot kicks from England captain Leah Williamson and the first by Beth Mead.\nIt was appropriate in England’s memorable tournament that Mead’s penalty had to be retaken under a new soccer rule that allows a second chance when a player scores by slipping and touching the ball twice. It did not matter after Hampton’s saves.\nClassic Arsenal goals\nArsenal attackers like scoring with perfectly placed headers from inviting crosses sent to the ideal spot.\nSpain took the lead Sunday with a very English goal – a full back’s cross from the byline finding the head of an Arsenal player to score, on a rain-slicked field on an overcast, cloudy day.\nThe strong Spanish flavor leading to Caldentey’s opener was in the neat passing to find Athenea del Castillo in the penalty area and her vision to see Ona Batlle’s direct run into space.\nCaldentey was in the Arsenal team that won the Women’s Champions League final in May beating a Barcelona side with six starters who also lined up for Spain on Sunday. Spain used three more Barcelona players as substitutes.\nThe Arsenal forward line in that final, Russo and Kelly, combined to tie the Euro 2025 final. Kelly’s right-foot cross from the left was floated toward the head of Russo who guided the ball back toward the top corner of the Spain net.\nWiegman’s hat trick\nEngland coach Sarina Wiegman has still never before been eliminated from a Women’s Euros tournament. Despite how close she came three times this month.\nThe top female national-team coach of her generation has a Euros hat trick after leading England to victory in 2022 and her native Netherlands to the 2017 title.\nBoth those titles were won as the host nation team and no England senior team, men or women, had previously won a world or continental title abroad.\nWiegman also extended the run of title-winning women coaches to eight Women’s Euros editions across 28 years. Women were outnumbered by male coaches each time.\nRoyal appointment\nThere was royalty from both nations in the VIP box at St-Jakob Park including heirs to each throne.\nPrince William, the first son of Britain’s King Charles, was with his daughter Princess Charlotte. He is president of the English Football Association.\nAlso present were Princess Leonor of Spain and her younger sister, Infanta Sofía. At the 2023 World Cup final Sofia was at the game with her mother Queen Letizia in Sydney, Australia.\n__\nAP soccer: https://apnews.com/hub/soccer",
  "word_count": 735,
  "scraped_at": "2026-02-14T12:43:55.923507"
}