{
  "article_id": "a1c1ca40c320",
  "url": "https://www.smh.com.au/sport/nrl/we-don-t-wear-pads-or-helmets-brother-is-the-bloody-biff-the-trick-to-finding-nrl-fans-in-the-us-20250225-p5lets.html",
  "title": "NRL Las Vegas : How Australia is selling rugby league to the US",
  "date": "20250228T191500Z",
  "domain": "smh.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This was published 11 months ago\n‘We don’t wear pads or helmets, brother’: Is the bloody biff the trick to finding NRL fans in the US?\nBy Jordan Baker\nAaron Woods unwinds his giant frame across a velvet couch, looking every inch an Antipodean gladiator in the anteroom of a Las Vegas television studio. His is the hirsute, affable face of rugby league in America, and as he waits to be interviewed about the NRL’s matches this weekend, he rattles off some of the other places he’s promoted the game; a NASCAR race in Florida, an LA Lakers basketball match, the filming of a Netflix professional wrestling show in Charlotte, North Carolina.\nHere he is at KLAS TV, stepping under the bright lights. He delivers his rapid sell in an NFL lingo Americans can understand; Nathan Cleary is our Patrick Mahomes (Kansas City Chiefs), six tackles are kinda like four downs, but the difference is “there’s going to be a lot of collisions” in the league, he tells presenter Chris Maathuis. “We don’t wear pads or helmets, brother.” He doesn’t voice the implied conclusion to that statement, but a Fox presenter did, a few weeks earlier: “It’s something like football for guys that aren’t sissies?”\nOff-air, as he walks back to his hotel, Woods confides that Americans froth at the idea of collisions without pads. He leans closer; he’s not sure if he should say this. Last year, when he played in Las Vegas for Manly, a teammate “got split open” in the first 15 minutes. “For American fans to see a massive cut, trainer comes on the field, puts a bit of vaso[line] on it, just tapes him up, and he’s straight back out there … it’s just the theatre.”\nIt’s year two of the Las Vegas venture, but league’s battle to attract US eyeballs remains in its infancy. With the gala day at Allegiant Stadium less than a week away, every Las Vegas bookie approached by this masthead had not heard of it. “Is it soccer?” puzzled one, when asked if he was offering odds on this weekend’s league matches. “Is it cricket? Is it AFL?” The American manager at the Aussie-themed Outback Steakhouse on The Strip was similarly unaware, although he did say a “rugby team” had been there for dinner the night before.\nThe challenge of selling a sport that is massive in Australia but relatively unknown in much of the US is colossal; to find the sympathetically minded within a huge population and convince them to give the game a crack, without spending vast sums of money. To do this, the NRL has identified promising targets, ranging from the Polynesian community in Utah to fans of other sports known to have an appetite for biff.\nThe NRL’s arguably most powerful partnership is with the UFC, a Las Vegas-based mixed martial arts competition that, some argue, has eclipsed ice hockey as the US’s fourth sport. It’s popular in Australia, too; in the NRL heartland of western Sydney, pubs burst during pay-per-view battles between so-called cage (technically octagon) fighters, who can use any martial art form – from kickboxing to jujutsu – to overwhelm their opponent.\nUFC fans skew youthful and male; they’re the blokey, right-leaning type that listens to Donald Trump supporter Joe Rogan, the most popular Spotify podcaster in the US and Australia. There’s heavy crossover with the NRL. Several Australian league players have switched from league to the UFC (ex-Rooster Tai Tuivasa, ex-Warilla Gorilla Alexander Volkanovski) and NRL clubs have used UFC fighters’ wrestling expertise to help with tackling. Many players are fans, including Cleary.\n“Rugby league has long hung its hat on being an authentically working-class sport, which aligns closely to the working-class nature of combat sports,” says Hunter Fujak, a lecturer in sport at Deakin University. “This also transfers to their respective fan bases, which both over-index towards working-class men.”\nThe NRL and UFC struck a deal in 2023 to cross-promote. “Broadly, the partnership is a fancy way of saying UFC and NRL are mates,” says UFC’s Australia New Zealand vice president Peter Kloczko. “When we look at our local UFC fan base, the strongest crossover we have with any other sport in Australia is the NRL.\n“The basis of the partnership … is to appeal to the American fan base, saying, ‘Hey, if you’re into UFC, the chances are you’re into NRL as well’.” The UFC has been promoting the NRL’s Las Vegas matches and players to its social media followers, is lending out its Vegas performance institute, and will join some of the fan events in the lead-up to the games.\nThe NRL returned the favour when UFC came to Sydney last month, broadcasting a video of top players promoting it. “No better way to spend your Sundays [than] to watch UFC – big fan,” says Canberra’s Hudson Young, who went on to be involved in a late-night row involving an inflatable souvenir bat in a Las Vegas hotel this week.\nThe crossover between rugby league and cage fighting fandom is “where the sweet spot is for us”, says Andrew Abdo, chief executive of the NRL. “I think we’re just scratching the surface of what we can do together as partners.”\nThe UFC is owned by Dana White, a long-time friend of Trump (White and Trump declined invitations to attend this weekend). White’s role in the Trump campaign – he has been described as one of the main orchestrators in securing the “testosterone vote” – has also put it firmly in the Make America Great Again political firmament.\nSome believe associating NRL with the MAGA crowd is a bad choice by the NRL (domestic violence advocates were furious when the NSW government provided funding for a recent UFC bout in Sydney; White Ribbon criticised the NRL over its invitations to Trump and White), but Abdo disagrees. “We’re agnostic about any political views, religious views, or whatever. We’re actually about bringing people together and taking their mind off things, and all the challenges in the world,” he said.\nWoods’ US adventures have also included attending the taping of an episode of WWE Raw on Netflix, at which he again got air time thanks to the UFC, whose parent company also owns the WWE. The more theatrical wrestling is UFC for a younger audience. The world’s most famous ex-wrestler, now actor, Dwayne “The Rock” Johnson (who has Samoan heritage), has promoted NRL in the past; there’s a much-watched video of former Rabbitoh turned $33 million-a-year NFL left tackle Jordan Mailata introducing the code to him and giving him a Steeden ball during Super Bowl week last year.\nThe NRL also views America’s most popular sport, the NFL, as a natural bedfellow; the two sports share a common ancestor – rugby union – so there are whiffs of familiarity, as Woods pointed out on KLAS TV. It’s no coincidence that the NRL timed its Las Vegas venture to land soon after the Super Bowl, when football fans are missing the oval ball.\nHere, the relationship with international rights-holder Fox has helped. The network put one of its stars, former New England Patriots gridiron player Rob Gronkowski, in an ad spruiking “football but not as you know it – no pads, no armour, no time out” (it was awkward for the NRL when “the Gronk” was spotted at Melbourne’s Caulfield races, proclaiming how wild he found AFL). The hiring of Allegiant Stadium, which hosted the Super Bowl last year, firmed the link, too.\nThe NRL has also struck a relationship with the NFL’s Las Vegas Raiders and ice hockey’s Las Vegas Golden Knights (a hockey player gave a press conference with a Raiders player last Friday) to share market knowledge and cross-promote on their various social channels. The Las Vegas Aces, its women’s WNBA team, might also attend tomorrow, AEDT. NRL clubs have also struck deals with the Los Angeles Rams; Brisbane trained at their facilities last year (the Rams will play in Melbourne in 2026).\nLeague is using algorithms to target advertising in particular regions of California, Nevada and Texas, which have friendly time zones. A rich seam is Utah, home to a significant Polynesian population (about 50 per cent of NRL players have Pacific and Maori heritage) because of the Mormon crossover (the Pacific Islands were the first non-English-speaking region to be visited by Latter Day Saints missionaries in the mid-1800s).\nThe aim is to get them to the game, inspire them to subscribe to WatchNRL, an app that broadcasts the game in America, or engage with NRL products, such as fantasy football or tipping. Fox Sport US, owned by Australian-born media mogul Rupert Murdoch, will broadcast when the Canberra Raiders play the New Zealand Warriors on Saturday, US time.\nOf course, it’s not all blokey. The Jillaroos are playing a test match against England in Las Vegas, and the NRL says there’s a marketing angle there, too. If US audiences enjoy the rough-and-tumble novelty of a men’s match, then the physicality of the women’s game will open their eyes even wider. “It’s a great opportunity for us to win fans in that market,” says Abdo. He also hopes it might attract women from other sports to consider rugby league. “In terms of the women’s game and appealing to female athletes, there’s a big upside for us in America.”\nThe Herald’s travel expenses to Las Vegas have been partly funded by the NRL.\nNews, results and expert analysis from the weekend of sport sent every Monday. Sign up for our Sport newsletter.",
  "word_count": 1590,
  "scraped_at": "2026-02-14T14:15:39.560040"
}