{
  "article_id": "a1da25bd8c77",
  "url": "https://www.90min.com/sarina-wiegman-chloe-kelly-not-playing-enough-to-earn-england-call-up",
  "title": "Sarina Wiegman : Chloe Kelly  not playing enough  to earn England call up",
  "date": "20250211T173000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sarina Wiegman: Chloe Kelly 'not playing enough' to earn England call up\n- Chloe Kelly has been left out of the England squad for the February break\n- The forward recently signed for Arsenal on loan for the rest of the season\n- The Lionesses will face Portugal and Spain in upcoming fixtures\nEngland manager Sarina Wiegman admits that Chloe Kelly hasn’t been playing enough to earn her place in the Lionesses squad for upcoming Nations League fixtures.\nThe 26-year-old has been a mainstay in the England squad over recent seasons, famously scoring the winning goal that crowned the nation European Champions under the arch of Wembley Stadium 2022.\nAfter starting just one of Manchester City's Women's Super League (WSL) fixtures prior to Christmas, Kelly completed a deadline day move to Arsenal in with the intention of \"having the best shot to represent my country\" at the upcoming Euros in Switzerland.\nWiegman has left Kelly out of the England squad set to face both Portugal and Spain in upcoming UEFA Women's Nations League fixtures.\n\"She hasn't played enough in my opinion,\" the head coach expressed. \"She has moved clubs now, but last Autumn she hardly played, and as I said, she built some credits but over that time she made less minutes.\n\"We had a good conversation yesterday and she undestands. She's not out for the Euros, when she gets back and is in full training, hopefully she gets the minutes soon so she can show again. We will revisit it, there is huge competition going on in the team.\"\nKelly, who hasn't missed out on an England squad since returning from her ACL injury in 2022, has told fans that she is eager to return to the set up as soon as possible.\nWiegman emphasised that the attacker needs to \"get started at Arsenal, get some minutes in, start playing and showing what you're about and then we can revisit that again\".\nShe added: \"We all hope that she shows good performances and that she gets the minutes in and gets her level back.\"\nPrior to making her loan move to Arsenal, Kelly expressed her discontent with Manchester City, telling fans on social media that she had been “dictated to whom I can or can’t join”. The forward finalised, “I just want to be happy again.”\nThe England coach responded to Kelly’s statement, saying “she was hired, she was worried about her mental health.”\n“I don’t have the full context but I’m just glad now that she had the move, which she mentioned was really good for her,\" said Wiegman. \"Hopefully she can get a smile on her face again, play some football, and show who she is as a footballer.’”\nIn Kelly's absence, Nikita Parris has been rewarded for her firing form over recent months at Brighton & Hove Albion, earning her first Lionesses call up since 2022.\nSpeaking on the selection, Wiegman expressed: \"We always watch a lot of players. Nikita is doing well and she's in good form. She knows what's needed in international football. I want to see her in our environment and hopefully she can take this opportunity.\"",
  "word_count": 524,
  "scraped_at": "2026-02-14T12:49:51.414398"
}