{
  "article_id": "a1f017f7e59b",
  "url": "https://www.southpeacenews.com/today-in-high-prairie-march-18-2023/",
  "title": "Today in High Prairie : March 18 , 2023 - ",
  "date": "20230326T184500Z",
  "domain": "southpeacenews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Today in High Prairie! See what’s happening today in town, celebrity birthdays, local history, world history and your daily horoscope. Please send your birthdays and community events to southpeacenews@hotmail.com and/or spneditor@outlook.com.\nWhat’s Happening Today – March 18, 2023\nSmoky River Agricultural Trade Show at Falher (Day 3 of 3).\n10 a.m. – HP CRC Little Chefs in HP at Children’s Resource Centre.\n7-11 p.m. – Jamboree at Triangle Hall. Music, dancing, socializing. Call (780) 523-5367 for details.\nToday’s Celebrity Birthdays – March 18, 2023\n1496 – Mary Tudor, Daughter of Henry VII\n1765 – David H. Chasse, Fought Napoleon at Waterloo\n1858 – Rudolf Diesel, Invented diesel engine\n1879 – Cluny MacPherson, Inventor of the gas mask\n1905 – Robert Donat, Goodbye Mr. Chips actor\n1911 – Smiley Burnette, Petticoat Junction actor\n1926 – Peter Graves, Mission Impossible actor\n1927 – George Plimpton, Sports writer\n1932 – F.W. de Klerk, South African President\n1938 – Charley Pride, American country singer\n1943 – Kevin Dobson, Kojak actor\n1945 – Eric Woolfson, Alan Parsons Project singer\n1948 – Robert Whitlock, Derek and the Dominos singer\n1956 – Ingemar Stenmark, Swedish alpine skier\n1959 – Irene Cara, Actress/singer [Fame]\n1963 – Vanessa Williams, First African US Miss America\n1970 – Queen Latifah, American actress\n1989 – Lily Collins, Mirror, Mirror actress\nThis Day in Local History – March 18, 2023\nMarch 18, 1939: Father Constant Falher, O.M.I., dies in Grouard and is buried there. He serves parishes in both Grouard and Joussard.\nMarch 18, 1970: South Peace News reports that construction begins on the new Toronto Dominion Bank.\nMarch 18, 1970: About 60 beginners receive their diplomas in square dancing after completing 20 lessons.\nMarch 18, 1972: The High Prairie Regals win the NPHL title after defeating the hometown Peace River Stampeders 5-4 to win the series 4-1. Ron Rose scores the winning goal. The Regals score five goals in each game in the series.\nMarch 18, 1974: The roof of the Faust Community Hall caves in from heavy snowfall destroying the 1935 constructed building.\nMarch 18-20, 1977: High Prairie hosts the Peace Winter Games.\nMarch 18, 1985: The St. Andrew’s Saints girl’s basketball team wins its third straight divisional title after defeating Prairie River 32-4 in the final.\nMarch 18, 1986: South Peace News reports that the High Prairie and District Golf Club has tendered its grass greens. The greens, announced by club president Brian Bliss, should be ready for the spring of 1987.\nMarch 18, 1989: Beaver Lumber closes its doors in High Prairie.\nMarch 18, 1990: The Sucker Creek Capitals Native Peewee team blasts Morley 12-2 in the final and win the Alberta title at Hobbema.\nMarch 18, 1997: High Prairie School Division Supt. Verne Evans tenders his resignation effective at the end of August ending 35 years of service.\nMarch 18, 2001: Lakeland Eagle Al Anderson is unanimously selected to the NPHL’s first all-star team at forward.\nMarch 18, 2001: Airdrie wins the gold medal at the Belle B Provincial Ringette Tournament held in High Prairie. The High Prairie Hoodlums lose three straight.\nMarch 18, 2004: Peter Daniel Welch, 19, of McLennan, dies after falling beneath a train in McLennan.\nMarch 18, 2007: The NPHL makes a shocking announcement by suspending the West Division final series between the Horse Lake Thunder and Fort St. John Flyers. That leaves the winner of the Lakeland Eagles versus Peace River Stampeders as the NPHL champion. The Flyers and Thunder were at an impasse following Game 6 of their semifinal series.\nMarch 18, 2008: High Prairie resident Trevor Cisaroski’s letter concerning the stench from burning at the town shop is discussed at a public works committee meeting. The committee promises to investigate and report back April 15.\nMarch 18, 2011: Three CFL stars visit East Prairie to talk to youth about life experiences including Ryan Lucas of Saskatchewan, Patrick Kubongo of Edmonton and J.R. LaRose of the B.C. Lions.\nMarch 18, 2011: Kinuso School sends two teachers and 15 students to the National Archery in Schools Program/Alberta Hunter Education Instructors Association archery event in Edmonton. Coach Luke Peters is pleased with the effort despite the team not winning any medals.\nMarch 18, 2015: South Peace News reports that Amy Donahue, 9, plans to cut her hair for cancer charity. She hopes to raise $2,000.\nMarch 18, 2015: The M.D. of Big Lakes becomes Big Lakes County.\nMarch 18, 2016: Lesser Slave Lake MLA Danielle Larivee presents High Prairie Regional Recreation with a $30,000 cheque to help purchase a new ice resurfacing machine. The money comes from the CFEP program.\nThis Day in World History – March 18, 2023\n1241 – Kraków is ravaged by Mongols.\n1532 – English parliament bans payments by English church to Rome.\n1673 – Lord Berkley sells his half of New Jersey to the Quakers.\n1766 – Britain repeals the Stamp Act, helped lead to American Revolution.\n1813 – David Melville patents apparatus for making coal gas.\n1850 – Henry Wells & William Fargo form American Express.\n1881 – Barnum & Bailey’s first combined “Greatest Show on Earth” opens.\n1882 – Morgan Earp assassinated by outlaws in Tombstone.\n1891 – Britain is linked to the continent by telephone.\n1892 – Lord Stanley presents silver cup for hockey [Stanley Cup].\n1899 – Phoebe, a moon of Saturn, is discovered by William Pickering.\n1902 – Italian Enrico Caruso is first well-known performer to make a record.\n1909 – Einar Dessau of Denmark makes the first ham broadcast.\n1920 – Greece adopts the Gregorian calendar.\n1922 – British magistrates in India sentence Mahatma Gandhi to 6 years.\n1931 – First electric shavers go on sale in US [Schick].\n1944 – 2,500 women trample guards to buy 1,500 alarm clocks in Chicago.\n1945 – 1,250 US bombers attacks Berlin.\n1945 – “Rocket” Richard becomes the first NHLer score 50 goals in a season.\n1948 – Philips begin experimental TV broadcasting.\n1949 – NATO [North Atlantic Treaty Organization] ratified.\n1952 – First plastic lens for cataract patients fitted.\n1959 – US President Dwight D. Eisenhower signs Hawaii statehood bill.\n1965 – Poppin’ Fresh Pillsbury Dough Boy introduced.\n1965 – Rolling Stones fined 5 pounds each for public urination.\n1965 – Cosmonaut Alexey Leonov is first person to walk in space.\n1966 – Scott Paper begins selling paper dresses for $1.\n1967 – Beatles’ “Penny Lane” single goes #1.\n1970 – NFL selects Wilson as official football.\n1981 – Buffalo Sabres score NHL record nine goals in one period vs Toronto.\n1989 – In Egypt, a 4,400-year-old mummy is found in the Pyramid of Cheops.\n1990 – Largest art robbery [$500 million] in US history occurs at Boston.\n1990 – First free elections in East Germany, Conservatives beat Communists.\n1994 – South Africa Goldstone committee reveals existence of secret police.\n2014 – Russia formally annexes Crimea, previously part of Ukraine.\n2018 – Vladimir Putin is elected to six-year term as Russian President.\nToday’s Horoscopes – March 18, 2023\nAries [March 21 – April 20] – Money matters might require your attention today. Concerns involving the home are on your mind. You may need to work on the household accounts or balance the records of a home business. You may put in more time than necessary. Do not assume the worst! All should be basically well, so you probably could just balance the accounts and move on. You have other things to do, too!\nTaurus [April 21 – May 21] – Deep thought that occupies your time today could lead to some fascinating conversations with a close friend or partner. Lots of ideas and useful information could be discussed and lead to new projects, perhaps involving writing or teaching. You will want to research every possible contingency before making definite plans, so get busy. You do not want to pass up a lucrative opportunity.\nGemini [May 22 – June 21] – Today your imagination is likely to be flying high, drawing on past images and events that you may have forgotten. You may wonder about the commercial potential of your thoughts. A conversation with a friend who knows this subject could prove enlightening. Write your ideas down and learn as much as you can about your various options over the next few days. You might be surprised!\nCancer [June 22 – July 22] – A friend could put forth some ideas regarding incorporating the arts into a business enterprise. A lot of discussion could result, though it is unlikely any final decisions will be made now. More ideas should come over the next few days. Some intense research on your end should shed some light on the workability of the project. Go to it!\nLeo [July 23 – Aug. 23] – Imagination and insights definitely advance a project today. Discussions, perhaps involving money, spur you and your collaborators on to new innovative projects that might prove to be of great benefit to all. Do not let your inspiration stop there. Let the ideas and images spur you on toward new enterprises and horizons. Make the most of them in every possible way.\nVirgo [Aug. 24 – Sept. 22] – Friends who have been traveling or live far away could bring some interesting news your way that has not yet broken in your area. This might make you curious to do some research on the subject. Take everything you hear with a grain of salt until you determine the facts for yourself. Things can get garbled in translation when you hear things second or third hand.\nLibra [Sept. 23 – Oct. 23] – Today you might give some thought to career matters. You are probably trying to brainstorm ingenious ways to advance professionally and increase your income. A number of different options might present themselves, some workable, some not. It might not be easy to put them into action, but keep trying. Obstacles always arise when you are trying something new. You will get there.\nScorpio [Oct. 24 – Nov. 22] – Your partner may return from a journey today, and a deep conversation could follow. Your friend will share stories of the trip, which could lead to talk about the relationship’s future. Nothing is apt to be decided. The discussion is more likely to focus on generalities than specifics. You will gain a stronger understanding of your partner and how things could shape up.\nSagittarius [Nov. 23 – Dec. 21] – Today you may feel a little out of sorts, but your creative energies are likely to flow freely. Inspiration could come from deep within you. You are probably more focused than usual, and therefore can spend considerable time working on a task or project without getting restless. Give free rein to your ideas. They might seem a bit dark and strange at first, but they are important.\nCapricorn [Dec. 22 – Jan. 20] – The survival of a partnership could depend on some open and honest communication today. Conflicting issues may be simmering and need to be aired in a sensitive and caring way. It is vital to express the affection you feel for your partner and the importance of this partnership to you. The conversation may not be an easy one, but you will feel better for it by day’s end.\nAquarius [Jan. 21 – Feb. 18] – A book, letter, or other important piece of paperwork that was misplaced might finally be found today. This is important, as it may relate to financial concerns or a creative project you have been working on. The information it contains should motivate you to move ahead and put this matter to rest. Much of your day could be spent dealing with this. Go to it!\nPisces [Feb. 19 – March 20] – Discussions with close friends could lead to ideas for creative projects of some kind. Although the projects themselves may centre on writing, music, drama, graphics, or teaching, today’s brainstorming is likely to centre more on business and marketing than artistic matters. Nonetheless, you could walk away feeling inspired and motivated. Write down your ideas.",
  "word_count": 2010,
  "scraped_at": "2026-02-14T12:25:29.849760"
}