{
  "article_id": "a1f92d4eea1b",
  "url": "http://www.afghanistannews.net/news/278861724/afc-u17-asian-cup-and-afc-u17-women-asian-cup-2026-final-draw-to-reveal-india-group-stage-opponents",
  "title": "AFC U17 Asian Cup and AFC U17 Women Asian Cup 2026 final draw to reveal India group stage opponents",
  "date": "20260211T143000Z",
  "domain": "afghanistannews.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "New Delhi [India], February 11 (ANI): The Final draw for the AFC U17 Asian Cup Saudi Arabia 2026 and the AFC U17 Women's Asian Cup China 2026 will be held on Thursday at the AFC House in Kuala Lumpur, Malaysia, according to the All India Football Federation (AIFF).\nFor the 21st edition of the AFC U17 Asian Cup, 16 teams will be divided into four groups of four each. India were one of the seven teams that secured their place in the tournament via the qualifiers, joining hosts Saudi Arabia and the eight other AFC representatives from the FIFA U17 World Cup Qatar 2025 that qualified automatically.\nIndia topped Group D ahead of Iran, Lebanon, Palestine and Chinese Taipei in the qualifiers held in November 2025 to qualify for the AFC U17 Asian Cup for the 10th time in their history.\nThe tournament is scheduled to take place between May 5 and 22. The top two teams from each group will not only qualify for the quarter-finals but also book their places in the FIFA U17 World Cup Qatar 2026.\nFor the AFC U17 Asian Cup Saudi Arabia 2026 Final Draw, India are placed in Pot 3 and will be drawn against either Saudi Arabia, Korea Republic, Japan, or Uzbekistan from Pot 1, Tajikistan, Australia, Yemen, or Indonesia from Pot 2, and DPR Korea, United Arab Emirates, Qatar or Myanmar from Pot 4.\nAs hosts, Saudi Arabia will be designated as the top seed and occupy position A1.\nPot allocations for the AFC U17 Asian Cup Saudi Arabia 2026 Final Draw (Seedings in brackets):\nPot 1: Saudi Arabia, the Republic of Korea (1), Japan (2), Uzbekistan (3)Pot 2: Tajikistan (4), Australia (5), Yemen (6), Indonesia (7)Pot 3: Thailand (8), China PR (10), Vietnam (11), India (12)Pot 4: DPR Korea (13), United Arab Emirates (14), Qatar (15), Myanmar (16)\nFor the 10th edition of the AFC U17 Women's Asian Cup, 12 teams will be divided into three groups of four each. India were one of the eight teams that secured their place in the tournament via the qualifiers, joining hosts China PR and the four AFC representatives at the FIFA U17 Women's World Cup Morocco 2025 that qualified automatically.\nIndia topped Group G ahead of Kyrgyz Republic and Uzbekistan in the qualifiers held in October 2025 to qualify for the AFC U17 Women's Asian Cup after 21 years.\nThe tournament is scheduled to take place between May 1 and 17. For the Final Draw, India are placed in Pot 3, and will be drawn against either China PR, DPR Korea, or Japan from Pot 1, Korea Republic, Thailand, or Australia from Pot 2, and Chinese Taipei, Myanmar, or Lebanon from Pot 4.\nAs hosts, China PR will be designated as the top seed and occupy position A1.\nThe top two sides from each group, along with the two best third-placed teams, will progress to the quarter-finals. The four semi-finalists will qualify for the FIFA U17 Women's World Cup Morocco 2026, where DPR Korea are the current holders.\nPot allocations for the AFC U17 Women's Asian Cup China 2026 Final Draw (Seedings in brackets):\nPot 1: China PR, DPR Korea (1), Japan (2)Pot 2: Korea Republic (3), Thailand (5), Australia (6),Pot 3: Philippines (7), Vietnam (8), India (9)Pot 4: Chinese Taipei (10), Myanmar (11), Lebanon (12)\nFor the pot allocations for the Final Draw for both AFC U17 Asian Cup Saudi Arabia 2026 and AFC U17 Women's Asian Cup China 2026, the seedings are based on a points system derived from the teams' final rankings across the previous three editions of the Finals, with the points from each edition weighted progressively as follows: 100% of ranking points for the latest edition (2025 for men's and 2024 for women's), 50% of ranking points for the second-last edition (2023 for men's and 2019 for women's) and 25% of ranking points for the third-last edition (2018 for men's and 2017 for women's). (ANI)",
  "word_count": 658,
  "scraped_at": "2026-02-14T12:38:00.285223"
}