{
  "article_id": "a208bf93a71a",
  "url": "https://wchstv.com/newsletter-daily/athletic-director-christian-spears-to-part-ways-with-marshall-university",
  "title": "Athletic director Christian Spears to part ways with Marshall University",
  "date": "20250429T203000Z",
  "domain": "wchstv.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Athletic director Christian Spears to part ways with Marshall University\nHUNTINGTON, W.Va. (WCHS) — Marshall University and its athletic director will be parting ways.\nChristian Spears will not stay in Huntington after his contract ends next year and will continue directing until the university decides on a replacement, a news release from Marshall University confirmed Tuesday.\n“We are grateful for Christian’s passionate leadership and substantial contributions to Marshall Athletics,” Brad D. Smith, president of Marshall University, said in the news release. “From championship seasons to key facility upgrades, Christian is leaving the athletic department in a strong position. We wish him continued success in his next venture.”\nSpears was brought to Huntington in 2022 after serving as the deputy athletic director and chief operating officer at the University of Pittsburgh.\nIncluding his stint at Marshall along with five years at Pitt, Spears has accumulated three decades of experience in athletics administration with time at Eastern Michigan, Northern Illinois, Southern Illinois and Long Beach State.\nUnder Spears, Marshall football has remained bowl eligible, winning the Myrtle Beach Bowl in 2022.\nLast year, the Herd won its first Sun Belt Conference Championship, but lost head coach Charles Huff to Southern Miss. Marshall opted out of a bowl invite after more than two dozen players hit the transfer portal.\nSpears also brought Kim Caldwell to Huntington for a single season where she earned a national coach of the year honor, leading the women’s basketball team to a Sun Belt Conference championship in 2024. Caldwell has since moved on to lead the Tennessee Volunteers.\nAlso in 2024, Marshall men’s soccer came up a game short of claiming a College Cup Championship. He also oversaw the completion of the long-awaited Jack Cook Field for the baseball team.\nSpears' contract with Marshall ends in March 2026. The university said it will immediately begin a national search for its next athletic director.",
  "word_count": 315,
  "scraped_at": "2026-02-14T13:21:08.457666"
}