{
  "article_id": "a20eb0539d42",
  "url": "https://www.thenews.com.pk/print/1318541-pina-fires-spain-past-england-into-nations-league-semis",
  "title": "Pina fires Spain past England into Nations League semis",
  "date": "20250604T213000Z",
  "domain": "thenews.com.pk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Pina fires Spain past England into Nations League semis\nMADRID: Super-sub Claudia Pina struck twice as Spain came from behind to beat England 2-1 on Tuesday in a heavyweight clash and reach the women´s Nations League semi-finals.\nSweden romped to a 6-1 win over Scandinavian rivals Denmark to progress to the final four, along with already-qualified France and Germany. World champions Spain won Group A3 by five points from Euro 2022 winners England, who could have progressed themselves with a victory at the RCDE Stadium on the outskirts of Barcelona.\nAlessia Russo stroked Sarina Wiegman´s side ahead after 22 minutes but Pina´s brace off the bench in the second half booked the holders´ ticket to the final four in October. Spain and England will be the favourites to lift the Euros trophy this summer in Switzerland and after a narrow defeat at Wembley in February, Montse Tome´s side flexed their muscles by outclassing the Lionesses.\nPina did the damage with a cool first finish and then a blast from the edge of the box for her second. “I received the ball (for the second) and I didn´t even think about it, I hit it with my soul,” said Pina, who often shines off the bench for her club too.\n“I always try to do my best, and I am ready, I´m happy to be able to help,” she added. Featuring seven Barcelona players, who finished as Champions League final runners-up last week, and one winner in Arsenal´s Mariona Caldentey, Spain started the stronger.\nThey almost took the lead after three minutes but Hannah Hampton made a superb reflex save to deny Esther Gonzalez from close range. The Chelsea goalkeeper was under the spotlight after Mary Earps´ shock decision to retire from international football ahead of the Euros this summer and swiftly offered evidence of why she is England´s number one.\nDespite the hosts´ dominance they could not find a way in front and England capitalised. Niamh Charles got away with a slight foul on Salma Paralluelo inside her own half which enabled England to spring forward.\nFormer Barcelona midfielder Keira Walsh guided a superb ball through for Russo to chase and the Arsenal forward stroked home clinically. Spain were left outraged when left-back Charles then blatantly handled the ball in her area without punishmeSpain, who beat England in the 2023 World Cup final, found a way back through substitute Pina, who netted two minutes after coming on.\nPina flashed a quick shot across Hampton to equalise, and the 23-year-old grabbed another 10 minutes later. She bagged her second from the edge of the box, with a shot which crashed in off the post past the helpless Hampton.\nEngland never seemed capable of wrestling the momentum away from a Spain side that began to cruise, starving the visitors of the ball. They were run ragged and beyond missing out on the Nations League will be left with some concerns ahead of their European Championship defence this summer.\n“(It was) a very intense game... they are very tight on the ball, I thought we did well,” Wiegman told ITV. “In the second half they (were)... pressing a bit higher and we struggled to get out of the press and keep the ball.”\n- ´Inspiration´ Kirby - England midfielder Fran Kirby announced her retirement from international duty after the game, having been told earlier in the week she would not be part of the Euros squad.\n“I´m really proud of her and grateful to work with her (over the years),” Wiegman told reporters. “She´s been an inspiration for a lot of people and an incredible example.”\n-\nNicole Kidman Celebrates Galentine’s Day Months After Keith Urban Split\n-\nJustin Bieber Unveils Hailey Bieber As First Face Of SKYLRK In Intimate Campaign Debut\n-\nCaitlin O’Connor Says Fiance Joe Manganiello Has Changed Valentine’s Day For Her\n-\nRachel Zoe Sends Out Message For Womne With Her Post-divorce Diamond Ring\n-\nJames Van Der Beek's Final Conversation With Director Roger Avary Laid Bare: 'We Cried'\n-\nJaden Smith Walks Out Of Interview After Kanye West Question At Film Premiere\n-\nWhy Halle Berry Wasn't Ready For Marriage After Van Hunt Popped Question? Source\n-\nMichelle Obama Gets Candid About Spontaneous Decision At Piercings Tattoo\n-\nBunnie Xo Shares Raw Confession After Year-long IVF Struggle\n-\nBrooks Nader Reveals Why She Quit Fillers After Years\n-\nTravis Kelce Plays Key Role In Taylor Swift's 'Opalite' Remix\n-\nHow Jennifer Aniston's 57th Birthday Went With Boyfriend Jim Curtis\n-\nJoJo Siwa Shares Inspiring Words With Young Changemakers\n-\nJames Van Der Beek Loved Ones Breaks Silence After Fundraiser Hits $2.2M\n-\nDisney’s $336m 'Snow White' Remake Ends With $170m Box Office Loss: Report\n-\nTravis Kelce's Mom Donna Kelce Breaks Silence On His Retirement Plans",
  "word_count": 798,
  "scraped_at": "2026-02-14T12:35:54.431405"
}