{
  "article_id": "a226d87cc0d3",
  "url": "https://www.kildare-nationalist.ie/news/in-conversation-with-mick-mullen-kildare-gaa-chairperson_arid-50160.html",
  "title": "In conversation with Mick Mullen - Kildare GAA Chairperson - News",
  "date": "20250306T080000Z",
  "domain": "kildare-nationalist.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It's been roughly 100 days since Mick Mullen was elected Chairperson of Kildare GAA so the Kildare Nationalist caught up with the Celbridge clubman during his busy schedule this week to assess with him his first few months in office and his plans for the remainder of this year.\nMick, we had a very good conversation with you in advance of you election as Chairperson of Kildare so after 100 days in office how has it been for you?\nIt’s been very busy, Pat, but a different type of busy. Most people had sort of relaxed for the Christmas, and you have to allow people down time as well. Then it turned into January and we started to look at Committees. A number of people wanted to step away for various different reasons so I had a number of key positions to be filled and the first one was to replace myself as Chairman of the CCC. We have a bit of continuity there as Noel McKenna has been on the Committee for a number of years and he is a very capable administrator. He’s been a referee, he’s been on the Assessors in Croke Park, he’s on Leinster Assessors so he was in a very good position, although he said he wasn’t expecting the 100 emails a day.\nObviously the committee system works very well in Kildare?\nIt does, like all counties but I would say maybe people don't realise that there are about 30 sub-Committees within Kildare GAA from Finance, the senior teams, Coaching and Games, Hurling, Coiste na nÓg, Development Squads, Central Council, Handball, Demographics, St Conleth’s Park, Safety, Administrators, IT Systems, Strategic Plan, Stewards. Filling the gaps was a really a very big task, because a lot of people would have committed to the previous chairman. Obviously, I had to ask everybody if they were still happy enough to continue. Some were difficult enough to fill and the last one I filled recently was the Children’s Officer. Dermot Lavin has stepped down having completed five years. I’ll be delighted to announce at this Tuesday’s Co Board meeting that Deirdre O’Reilly, former Chairperson and Secretary of Celbridge GAA, is going to take up the role of Children’s Officer.\nI am conscious that we have a number of great women within the county and I have nominated a number of women to chair up Committees. Also, we have two excellent administrators that were voted in like Lorraine Wolfe, our PRO and Christine Murray, our Secretary. I am very conscious of trying to get the balance right across the board and the dynamics right within the Management Team.\nI’ve always held the view that the role of the chairperson is so vast and requires so much attention that a Football Committee, like the Hurling Committee, might be appropriate. Has that ever been considered?\nI mentioned at the Convention that our IT Committee is out there to help all the administrators. We have the Hurling Action Plan which we have reignited again and John Burke is going to lead that and we have a number of initiatives with a number of new people there. While I was doing that, I have a Football Action Plan as the next plan. I haven’t identified who it is as yet. There are a number of Committees that actually cross over each other. An example of this would be Coiste na nÓg and Coaching and Games so I have the Chairman of Coaching and Games, Eamon Costello, to be part of Coiste na nÓg and Dave Cahill to be a member of the Coaching and Games Committee to improve communications or any kind of snags that may hit us along the way.\nYou have delegated a number of responsibilities to your Vice Chairman, Larry Curtin?\nThere are some 30 sub- Committees and there are only seven evenings in the week so there's no way that I will be able to get around to each. So the way I have structured it we have myself, the Treasurer, Secretary and Vice Chairman and the Operations Manager as the Senior Executive Team and we meet online on Wednesday mornings and out of that each has a responsibility and Larry as Vice Chairman has responsibility for the Hurling Action Plan, Coaching and Games Coiste na nÓg, Development Squads, Children’s Officer, Central Council Delegates, Leinster Council Delegates and that brings it all in under the one umbrella.\nObviously along with yourself and Larry there were two other very strong candidates in Bryan Murphy and Colm Nolan for the positions of Chair and Vice Chair, respectively. Are there opportunities to involve Bryan and Colm in the future of Kildare GAA?\nAs I said I’m still trying to finalise everything and I would say that the door is always open for everybody. I did talk to Bryan before the Convention and I do plan to try and meet him. Colm is already involved with the senior hurlers and he has a number of other Committees in Croke Park. I want everyone to be involved. I want the media to be involved because Tommy Callaghan, yourself, Ger and the other lads, you are all Kildare people and no different than us, when things don’t go well you all get disappointed too. I don’t want people feeling that they are isolated. The door is always open.\nSomething that has received commentary, not necessarily in Kildare, that the Co Board meetings don’t achieve what they were set out to achieve and maybe the wrong people are attending and that it should be more of the decision makers from the clubs. Are you going to look at the Co Board meetings and how they might deliver better for you and for the county?\nCounty Board meetings are set in stone in the Rule Book. The style of them can be adjusted to suit whatever. We have five Co Board meetings but if you go back to say 2012 where email and IT systems have enhanced the information that goes out to clubs. Some Club Secretaries will tell you that they get too much information. When delegates come to meetings a lot of the time the information is already out there. Part of what I’m looking at too, and it happened last Tuesday night, we are going to do meetings with Chairpersons as we want to improve our communication there.\nSometimes people don’t feel safe to speak up at meetings for fear that their name would appear in the paper. Maybe it would be nice that it would be reported that a delegate raised a comment at the meeting rather than naming that delegate.\nThere are delegates that come to us at the end of meetings to ask us to ensure that we include that they raised something at the meeting.\nI want to ensure that people in the room can feel safe without the fear of being ridiculed and that is a feeling I have had for a long time.\nYou will know that some counties, like Cork, now exclude the media from Co Board meetings, do you ever see a situation where Kildare would go down that route?\nAll through the years if something commercially sensitive is said and you guys are asked not to write about it, in fairness to Kildare media you have always respected that. I will try and keep that going but who knows what’s down the road in terms of discussions. We are all Kildare people we all want to see what is best for Kildare.\nOne of the first tasks for you and your new team was a review of the Football Championships. Were you disappointed that maybe more clubs didn’t respond to the survey and are you happy with how things are going now with the decision to be made at this Tuesday’s Co Board meeting?\nThis is my fourth review of the Championships and it was time to look at the Championships again. It always brings excitement to the room when it’s being discussed. I’m not disappointed and I’m not surprised because we have always gotten that type of response. People don’t always buy into surveys but they are a good gauge of where things are. I was happy with the response from the general public, not necessarily those involved with clubs but they are Kildare supporters.\nThey only bit of information they get is from the media or from social media. We have two options on the board on Tuesday (March’s County Board meeting takes place on Tuesday 4 March) and there is no group vote coming from the top table and there has been no discussion at the top table in regards to which option is best. It’s open so it’s very much a choice of the clubs and whatever comes out of it or if they decide to stick with what we have then we’ll move on and we’ll tweak it along the way. We may revisit it in a year’s time again to see if there is a different sixteen. I like the Cavan one myself where the 16 teams go into a pot and there’s four rounds, open draw and the top four go straight to the quarter finals, the next eight to the big draw and the bottom four are into the relegation draw.\nThe hurling survey is done also and the majority of clubs want the status quo.\nFinance is always a big thing for any business, any group or organisation and Kildare GAA are in a healthy state in that regards at the moment?\nWe are in a good position but prices go up. I do hear the narrative that team expenses are going up. Sometimes you have to step back and analyse. The cost of living has gone up in the last five years and the cost of food and diesel and petrol has gone up. So, for a company to supply food to Kildare GAA the price has gone up so naturally our expenditure will have to go up as well.\nYes, there is a narrative out there that there is far too much spent on county teams but we do have to look after our players. We spent over €1m on teams last year but Galway, who are at the other end of the spectrum, spent €2m and that’s not good either. I would say that there will have to be a happy medium. There has to be a shared service in terms of using the same hotels, using the same bus companies, large catering companies to get the best deals for all counties.\nWe have to look after the players. They have to get treatment; they have to get strength and conditioning but we still have Hawkfield to improve and we may have to get an All-Weather surface and another dressing room there. I’m now looking at Phase 2 of St Conleth’s Park, which won’t be done in my time, to enhance the terrace behind the goal at the town end.\nThen we have the big picture which is integration which I feel is going to need Government financial intervention. We can only do X but we’ll need two, maybe three facilities because we have ladies football and camogie and everybody will want the same piece of ground to play on but we can’t afford a new stand or new stadium somewhere else.\nThere is obviously a lot of pride, whether you talk to players or supporters, in Cedral St Conleth’s Park. How close it to being the perfect stadium now with all the snag list complete?\nThere’s still a few bits and pieces but there’s the realisation like the scoreboard took time to get right. The stanchions have to be changed at the Kilcullen end to increase the capacity. There are a number of snags around the gate, the usual things you only see when you start to use them.\nIn managing a facility like that there is a great cost at maintaining it at the level that you want. It’s all geared towards Saturday 12 April (Leinster Football Championship quarter-final against Westmeath), that’s the big one and I hope there’s a big crowd there. There was a great crowd at the Laois game under lights. There’s a great buzz within the county once the teams are doing well.\nWe’ve started to do a few things. We have a Commercial Plan in place in terms of trying to have a separate entity and the hope would be that it would wash it’s face and provide funds to maintain the stadium to a standard that we want. We are working hard on it but the majority of us are volunteers so we do need patience as well. We still believe that we will be in a position to be clear within eighteen months.\nIs the pitch still a work in hand, are there still challenges there to get it right with the amount of activity on it?\nThere is no growth at the moment. The biggest challenge is the 15 metres that the builders had taken and that has most traffic but the rest of the pitch is fine. We have done some work around the dugouts. There are less people on the line which makes it a better spectacle as well. There are a number of club games coming up and we have U20 and U17 games coming up as well.\nYou mentioned communication earlier and the President, Jarlath Burns, was out during the week talking about communications around Ffnals and maybe having penalties if counties don’t really engage on that. Communication was a big issue for you when you were going for election and you wanted to improve communications within the county?\nThat has started already with the meeting last Tuesday night with the Club Chairpersons. We have improved communication between Committees. There will be incremental or small steps but they will happen. There’s promotion of our games as well and the people who are working on the promotion of our games are flat out and I want to ensure that all sub-Committees are helping the communications by feeding the information.\nYou also said that you wanted to involve the supporters more and communication is obviously important to them and getting teams named and accurate teams announced and when matches are on.\nIn fairness to Brian (Flanagan) he has released the teams as per Croke Park but like everything else, injuries do happen. A team is picked on a Tuesday to come to us and to go to the Printers on a Wednesday but things change from Tuesday to Friday. In terms of involving supporters, our survey was the start of that. We also sent out a summary from last month’s Co Board meeting as well so that’s another new communication outlet as well.\nWe work tirelessly to keep the media informed as much as possible as a lot of people still use the media to keep themselves informed.\nClub Kildare is going very well at the moment and you have a Corporate Lunch organised for April?\nIt’s the day before the Westmeath match and we are having it in Lawlor’s Hotel again. We have a number of Guest Speakers lined up and some of them will be from Westmeath. We have increased membership of Club Kildare as Colm (Farrell) alluded to at the last Co Board meeting. We have looked at the commercial side of Club Kildare as well which is going well.\nWe also have our Car Draw and we are working closely with Evan Arkwright in Curragh Racecourse to have something around Derby Day.\nJarlath Burns was out last week as well talking about the decline in population of rural areas in Ireland and indeed in Kildare the towns are quite well populated and there are parts of the county not well populated but they still have to support clubs. Syl Merrins brought forward a Demographics Report late last year, where is that now?\nThe next report on that will be ready in April and there are a number of Syl’s Committee out meeting clubs at the moment. We all know the concerns that people have in rural Ireland and rural areas of South Kildare but there are pockets in North Kildare as well. Rathcoffey is probably the lowest of the small clubs in North Kildare. Ardclough, despite how things are going in football, can field two good hurling teams so they’re not struggling in terms of numbers it’s more to do with the pressure of dual players. Rheban, Grangenolvin and Castlemitchell are all doing well. Kildangan were struggling but they made a plan and they’re back up again. We all know that clubs are struggling and we don’t need a report to tell us that but the question is what are we going to do about it, what is the solution? When you go through the history books, even in Kildare, there are clubs that are not there anymore. A bit of lateral thinking is needed at underage level. There may be something around catchment areas, there maybe something around the schools. I don’t see clubs amalgamating in Kildare though.\nThere are quite a number of high-profile Kildare born players playing League of Ireland and cross channel football and international rugby at the moment do you see that as a challenge to the GAA in Kildare?\nI would say that it is a challenge but I think that the recent opening of Cedral St Conleth’s Park will inspire players to play for Kildare GAA. We have a stadium now that people are proud of and want to come and play in it. The best players at Gaelic football are also the best players at soccer and rugby and other sports. Kevin Feely’s first years were in soccer and Rory, his brother chose soccer and we know that a number of high-profile lads have chosen rugby. Those lads have a tradition within their families. Yes, we do have challenges but I do think that putting out Cedral St Conleth’s Park and a good product will encourage our young lads to want to come and play there.\nYou mentioned the Strategic Plan earlier and you mentioned at the last Co Board meeting that you are concluding the current Plan and developing a new one up to 2030 perhaps?\nLouise Conlon, Head of Operations, will head that up. Pat Gilroy and Tom Cribbin went around the county and brought back a report to the Management Committee and the Management Committee then formulated the current Strategic Plan but we lost two years because of Covid. It’s now in its last year and if you read it, you would see that a lot of the targets are met in terms of facilities, finance, the fixtures, Coiste na nÓg. The new Strategic Plan will be formulated over the course of this year with the hope of a launch early next year and we have a number of people very interested in becoming involved in developing the Plan.",
  "word_count": 3173,
  "scraped_at": "2026-02-14T12:10:55.535603"
}