{
  "article_id": "a23eee2810de",
  "url": "https://www.thenationalnews.com/news/mena/2025/05/30/writings-on-cairos-notorious-communal-taxis-showcase-egyptian-humour-and-religious-piety/",
  "title": "Writings on Cairo notorious communal taxis showcase Egyptian humour and religious piety",
  "date": "20250530T213000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The writings on the back of Cairo's notorious communal taxis have long offered a rich insight into the humour Egyptians are renowned for along with their religious piety.\nLately, they have also been shining a light on the mood of the city, a sprawling and chaotic metropolis of 25 million people. In some ways, the writings – which are either painted on or on stickers – are an unlikely window of free expression in a country long accustomed to rigid restrictions on free speech, where social media is about the only place where Egyptians can speak their minds with relative freedom.\nIt is not that what is written on the back of these minibuses is inflammatory or particularly seditious – it is often simply the names of the driver's children or a short Quranic verse or a prayer – but that they offer a glimpse of the mood among the city's overwhelmingly poor majority. With so many minibuses in Cairo – at least 50,000 by one count – the messages they display are widely seen as they dart and weave through the streets at all hours of the day and night.\nIn some cases, there is an image of Saddam Hussein, Che Guevara or Bob Marley. In other cases, there are words of deep gratitude to mothers. Very common too are supplications for the protection of the minibus from envy, such as: \"Don't be vexed, it's God's will\" or \"God will keep it safe!\"\n\"It's like a thawab [reward] that will help me on Judgment Day,\" said Mohammed Hassan, whose minibus bears a sticker that says, \"Don't forget to say Allah out loud\".\n\"I work the route between Abdel Moneim Riad Square and Maadi and I stop at so many lights, so you can imagine how many thawabs I earn every time someone reads the sticker,\" he said, referring to the roughly 17km distance between the central Cairo square and the leafy suburb to the south.\nSome of the writings on the minibuses – they are the most popular mode of transport in the city and are known in Egypt's Arabic vernacular as microbasat – speak of, but more often just hint at, the struggle of Cairo's poor majority as they deal with double-digit inflation, expanding taxes and higher utility bills.\n\"I am neither a doctor nor an engineer, but I know something about car engines,\" says one that speaks of pride in what a minibus driver does for a living. \"No gold or antiquities, just hard work night and day,\" says another, alluding to the vast wealth made by Egyptians involved in illegal gold mining or trafficking in ancient artefacts. \"Oh, if only lady luck would smile on me,\" declares one that bemoans poverty.\nThe humour, however, can sometimes be edgy or dark. Often, it seems to be in the same vein as the lyrics of Mahraganat music, a relatively new genre that emerged in the wake of the 2011 uprising that removed the 29-year regime of Hosni Mubarak and has since flourished in Cairo's poor districts.\n\"Don't stare at it [the minibus] enviously, you moron!\" goes the first part of an aggressive attempt at humour. \"Be back in a second,\" says one that speaks to the delays sometimes caused when the driver stops for tea and a smoke at a nearby cafe.\n\"They beat up on us so hard and we responded, but only with curse words,\" reads a self-effacing phrase on one minibus, echoing an often-repeated line from a 2000 Egyptian blockbuster movie, El Nazer Salahedldeen. \"If you cannot make yourself happy, ruin the mood of everyone else,\" is the obnoxious counsel offered by another.\n\"I would rather stick to prayers or verses from the Quran,\" said a minibus driver whose vehicle bears a sticker that reads: \"Allah is the best protector\".\n\"It is the wisdom of an old man like me who has no formal education except for that from the school of life,\" he mused.\nSometimes, the humour on the minibuses is somewhat risque, and, in some ways, speaks to the problems involved in dealing with some unruly drivers. \"Not all women are ladies,\" declares one that professes an understanding of the human condition. Staying with the topic of women, another one uses the customary phrasing of job advertisements: \"A hottie is wanted to stay with me through my shift.\"\nThese kind of messages fit in with the widespread notoriety of minibus drivers. Cases of assault and sexual harassment are not uncommon on Cairo’s communal taxis, prompting police in some cases to plaster flyers on the back of seats that list the names and mobile numbers of officers at local police should they be needed to report a crime.\nLately, more serious messages have begun to appear on the minibuses. \"God, please, make our brothers in Palestine victorious!\" says one, superimposed on a map of Palestine in the green, red and black colours of the Palestinian flag. \"Gaza is in our hearts,\" declares another.\nThe writings on the minibuses have not always been innocuous. In the early 1980s, the government saw fit to ban them when some were deemed to betray sectarian undertones at a time of Muslim-Christian violence in Cairo.\n\"The Lord is my shepherd; I shall not want,\" was a popular one used then by Christians on minibuses as well as private cars. Muslims countered with the use of the declaration of faith: \"There is no God but Allah and Mohammed is his messenger.\"",
  "word_count": 911,
  "scraped_at": "2026-02-14T12:11:24.432719"
}