{
  "article_id": "a2517c73e842",
  "url": "https://www.arsenal.com/fixture/women/2023-Nov-09/women-3-1-bristol-city-women-match-report",
  "title": "Women 3 - 1 Bristol City Women - Match Report",
  "date": "20231110T030000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "We made a positive start to our Conti Cup journey on a brisk Thursday night at Meadow Park, with a 3-1 win over Bristol City.\nFrida Maanum and Lotte Wubben-Moy gave us a two-goal cushion in the first half before the Robins pulled one back after the break. Stina Blackstenius was there, however, to extend our lead in stoppage time.\nWhat happened\nEidevall made nine changes to the team who lined up against Manchester City, with Kyra Cooney-Cross earning her full debut and Beth Mead stepping into the starting XI for the first time since 2022.\nIt was nearly a dream start within the opening 30 seconds but Stina Blackstenius’ clean finish after some neat interplay was ruled just offside.\nIn her first start this season, 20-year-old midfielder Kathrine Kuhl was spectacular in the number eight role, surging through the middle of the park with mazy runs - the ball glued to her feet.\nAustralian Cooney-Cross also looked sharp at the base of midfield, showing her vision with a number of defence-splitting passes.\nAfter an early spell of fluid, exciting football, our Gunners found a breakthrough before the half-hour mark. Beth Mead got her second assist of the season with a well-timed cutback to Frida Maanum, who then rifled the ball into the roof of the net, leaving the Bristol City keeper with no chance.\nWe looked good value for a goal soon after as our captain for the evening, Katie McCabe, struck from distance and forced a good save from Olivia Clark in the Bristol goal.\nIt was Lotte Wubben-Moy who doubled our lead just before half-time. Our centre-back leapt high to meet a Cooney-Cross corner and headed home for her first goal this season. Wubben-Moy's ensuing celebration was a well-kept promise to a young Arsenal and Lionesses fan, Izzy.\nWe continued to dominate possession and attacking chances, and Maanum was millimetres away from getting a second with a gorgeous, curling effort that just whistled past the post.\nOur Gunners continued in much the same vein after the break, settling into a comfortable rhythm.\nCompletely against the run of play, we were caught napping during a Bristol set piece and the visitors pulled a goal back through Sille Struck.\nWith Vivianne Miedema and Caitlin Foord entering the game in the 69th minute, we looked to reinstate our two-goal cushion.\nThere were a number of near-misses, including a Miedema header from a corner that brushed the crossbar and a powerful shot from Foord that also hit the woodwork.\nSubstitute Cloe Lacasse showed some silky skills down the right wing that continued to threaten the Bristol backline but it wasn’t until stoppage time that all the pushing for a third goal paid off.\nStina Blackstenius bagged her second goal is as many games to cap off a solid display in the Conti Cup.\nWhat's next\nThis Sunday, our Gunners head to the King Power Stadium to face Leicester City in the Women's Super League.\nOur next Conti Cup fixture is on November 23, as we take on Championship side, Southampton, at St Mary's.\nTeam news\nArsenal starting XI: D'Angelo, Wubben-Moy, Beattie, Mead (Lacasse, 63), Maanum (Miedema, 69), McCabe (C) (Catley, 63), Maritz, Hurtig (Foord, 69), Kuhl, Blackstenius, Cooney-Cross (Pelova, 85)\nSubs: Zinsberger (GK), Williams (GK), Ilestedt, Russo\nBristol City starting XI: Clark (GK), Struck, Aspin (Layzell, 46), Connolly (C), Rodgers (Jones, 46), Hayles, Mustaki (Woolley, 70), Bull, Syme (Furness, 61), Teisar, Ward\nSubs: Davies, Powell, Napier, Thestrup\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 603,
  "scraped_at": "2026-02-14T12:40:41.222061"
}