{
  "article_id": "a26f6cb89a16",
  "url": "https://www.illawarramercury.com.au/story/9162381/matildas-arsenal-trio-bid-to-become-world-champions/",
  "title": "Matildas Arsenal trio bid to become world champions",
  "date": "20260128T011500Z",
  "domain": "illawarramercury.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Caitlin Foord, Steph Catley and Kyra Cooney-Cross will hope this week to become the first Australians to be crowned soccer world champions as Arsenal contest the inaugural FIFA Women's Champions Cup.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe new competition, which features the winners of the six continental club championships, reaches a climax in London with European Champions League winners Arsenal entering at the semi-final stage.\nThe Gunners face African champions AS FAR, the team of the Moroccan military, at Brentford on Wednesday (0500 Thursday AEST).\nCooney-Cross, after a period of compassionate leave in Australia to be with her mother, who has stage four cancer, has returned to England and joins her Matildas teammates in the Arsenal squad.\nRenee Slegars, the Arsenal manager, indicated the midfielder was unlikly to start the semi-final.\n\"Kyra will be with us tomorrow, but we just have to be really smart with how we manage her and bring her back to full fitness,\" said Slegars.\nBrazilian side Corinthians meet New York-based Gotham FC in the other semi-final earlier on Wednesday at the same venue with the final at Arsenal's Emirates Stadium on Sunday (Monday 0500 AEST).\nThe only Australian to reach the final of a FIFA-recognised global men's club competition to date is Harry Kewell.\nHe was in the Liverpool team that lost the World Club Championship final to Brazil's Sao Paulo in 2005.\nMark Bosnich won the 1999 Intercontinental Cup, an annual competition between the European and South American champions with Manchester United in 1999. While effectively a global decider it was not operated by FIFA and only featured two teams.\nCraig Johnston lost the same event with Liverpool in 1981 and 1984.\nAt international level Australia's only finalists are the U17s in 1991, losing on penalties to Brazil.\nThe new competition will run annually, except in years involving the also new quadrennial 16-club Women's Club World Cup, which launches in 2028.\nThe winners will earn $A3.3m and the losing finalists $1.4m.\nTwo clubs have already been eliminated: Oceania champs Auckland United and Asian winners Wuhan Jiangda. Wuhan beat Australian champions Melbourne on penalties in the Asian Champions League final in May.\n\"This is a new trophy in women's football. Arsenal have been trailblazers for many years and we want to be part of that and we want to make history as well,\" added Slegars.\n\"We're very proud of being in this competition.'\nAustralian Associated Press",
  "word_count": 406,
  "scraped_at": "2026-02-14T12:38:35.968379"
}