{
  "article_id": "a2830bcb5df6",
  "url": "https://www.globenewswire.com/news-release/2024/02/02/2822914/0/en/New-to-The-Street-Announces-its-553rd-Episode-TV-Line-Up-Featuring-Five-Corporate-Guests-Airing-on-the-FOX-Business-Network-Monday-February-5-2024-10-30-PM-PT.html",
  "title": "New to The Street Announces its 553rd Episode TV Line Up , ",
  "date": "20240202T150000Z",
  "domain": "globenewswire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NEW YORK, Feb. 02, 2024 (GLOBE NEWSWIRE) -- FMW Media's New to The Street is airing its national TV show on the FOX Business Network on Monday, February 5, 2024, at 10:30 PM.\nNew to The Street's 553rd episode features the following five (5) corporate interviews:\n1). Vacation Property Management – The Compass Collection's interviews with Heather Plampin, President/CEO, and Matt Farhat, Head of Business Development.\n2). Decentralized Supercomputing – Dynex's (CRYPTO: DNX) ($DNX) interview with Clifford Mapp, an Independent Technology Expert and Blockchain Pioneer.\n3). Biopharmaceutical - Acurx Pharmaceuticals, Inc.'s (NASDAQ: ACXP) ($ACXP) interview with David Luci, President/CEO.\n4). Sports Academy - IMG Academy's interview with Tim Pernetti, President.\n5). \"Sekur Privacy & Sekur Security – Weekly Hack\" segment with internet privacy expert Mr. Alain Ghiai, CEO, Sekur Private Data, Ltd. (OTCQB: SWISF) (CSE: SKUR) (FRA: GDT0) ($SWISF) (Sekur®).\nEpisode 553\nFrom the New York Stock Exchange Studio, Heather Plampin, President/CEO, and Matthew Farhat, Head of Business Development of The Compass Collection, talk with New to The Street's TV Host Jane King. Recognized as a national brand, The Compass Collection is a vacation rental management and marketing services company. Specializing in sales/marketing, revenue management solutions, and guest services, property owners and renters have had great experiences when engaging the Company. Each property owner has unique issues indicative of a specific property. The Compass Collection looks in-depth at each property and can create an effective plan to increase rental revenues. With a national footprint, property owners can expand beyond local or regional markets, optimizing rental listings to increase rental opportunities. US and international clients use The Compass Collection to book vacation rental properties. All properties have a complete description under the Company's management. Matthew explains what makes The Compass Collection different from other vacation property management companies; described as \"High and to The Right,\" property owners can expect a high level of expertise and high value in services rendered. Heather explains that owners become actual CEOs of their properties, enhanced by a back-office team using technology and providing service support. Most small property owners have limited access to a national platform. Still, when they contract with The Compass Collection, they have a whole range of services that are not readily available and affordable with competitors' management programs. A perfect owner wants to maintain asset property asset preservation, provide a wonderful vacation guest experience, and confidently manage on-site property needs and maintenance. The Compass Collection can assist an owner looking for a more sophisticated level of infrastructure, which can promote higher revenues and rental bookings. Self-managers with operational on-site services can engage with the expectation to increase marketing of the property's attributes, attract more renters, and increase revenue returns. Many who use other full-service property management companies make less revenue due to higher contract commissions. The Compass Collection offers better prices, services, support, and technology platforms, giving property owners a partner who can market a vacation property and successfully make guests' vacations great. The Compass Collection can offer a free property evaluation, creating a custom vacation rental plan unique to a specific property and its location. Suppose an owner wants to be a flagship rental in a new market or be a trailblazing property in existing markets. In that case, The Compass Collection can offer excellent incentives to become a client. As a national vacation rental site, The Compass Collection provides property owners and vacation renters with unique and dynamic services to obtain the best experience and productive outcomes. Matt tells viewers, owners, and interested vacationers can use the on-screen QR code available during the show or go to www.thecompasscollection.com. For more information, viewers can visit The Compass Collection - http://www.thecompasscollection.com/.\nFrom the Nasdaq MarketSite Studio, Clifford Mapp, an independent technology expert and blockchain pioneer, talks about Dynex (CRYPTO: DNX) ($DNX) with New to The Street's TV Host Jane King. Clifford explains Dynex's technology platform that can provide supercomputing services to everyone and every industry at a fraction of the cost. Dynex offers a decentralized supercomputer platform, disrupting the supercomputing hardware and software legacy industries. Using a neuromorphic blockchain-based algorithm on its DynexSolve Chip, Dynex creates quantum-level computation services that can solve complex problems. Clifford says that neuromorphic networks use logical gateways to process information, mimicking the human brain in collecting and understanding information. Dynex Marketplace is a decentralized platform where anyone can access the system; end-users pay Dynex according to the time needed to process a computational outcome. Generally, Clifford states that it costs about $8 for a 3–5-minute runtime on their system, is very affordable, and results provide valuable data. An automotive company uses Dynex for a virtual reality wind tunnel. Instead of paying millions of dollars for construction, maintenance, and administrative costs for a wind tunnel, the automotive engineers engage Dynex supercomputer services to create cost-effective and timely produced datasets on automotive designs. The medical and pharmaceutical industries can benefit from Dynex, giving information on cancer, genetics, blood, and drug use outcomes. A pharmaceutical company could use the Dynex in a matter of minutes to see data on how the human body maintains itself after a 10-year drug use. The financial industry is another example of an industry that can make immediate computations on stock market forecasting and other financial stats. The Company has an entire staff of professionals to manage and support any clients who need to formulate a problem-solving solution on the system. Dynex Neuromorphic Computing platform is decentralized, allowing for complex computations without expensive infrastructures and providing cost-effective outcomes. The on-screen QR code is available during the show; download or visit Dynex - https://dynexcoin.org/.\nNew to The Street's TV Host Jane King from the Nasdaq MarketSite Studio talks with David Luci, the President/CEO of Acurx Pharmaceuticals, Inc. (NASDAQ: ACXP) ($ACXP). As a clinical-stage biopharmaceutical business, ACXP is developing a new class of antibiotics for life-threatening bacterial infections. David updates viewers on the Company's FDA Phase 2 clinical trial on the Ibezapolstat drug, a treatment for patients with Clostridioides difficile Infections (CDI). Based on positive data from Phase 2a and Phase 2b, management is now going forward with the FDA Phase 3. The Company compared its top-line data with the currently used standard-of-care drugs in the marketplace, and Ibezapolstat has impressive positive results. Phases 2a and 2b confirmed that the drug had approximately 94% success with no reinfections. In treated patients, the microbiome bacteria found in the digestive tract shows the bacteria maintaining and restoring itself within those patients after a 10-day treatment. At a recent microbiome conference presentation in Texas, the Company compared logarithmic results from a competitor drug (vancomycin) to its Ibezapolstat drug, showing the differences in the effects on gut microbiome bacteria. Competitor drugs have been used for decades to treat CDI, but the reinfection rates are very high and greatly diminished gut microbiome bacteria. ACXP's Ibezapolstat study results have shown to combat reinfections effectively. Based on the data and other publications regarding the market size for newly discovered and effective treatment of CDI, ACXP believes Ibezapolstat could be a market worth over $1B. Decades-old antibacterial drugs are not working due to changes in the molecular composition of CDI. Thousands of people worldwide die annually, with many catching CDI in hospitals and nursing homes. Acurx Pharmaceuticals, Inc. believes its Ibezapolstat drug is the next generation for effectively treating CDI. Throughout 2024, Investors and others should expect more exciting news about Ibezapolstat and other positive corporate ongoings. The on-screen QR code is available during the show; download or visit Acurx Pharmaceuticals, Inc. - https://www.acurxpharma.com/.\nTim Pernetti, the President of IMG Academy, from the Nasdaq MarketSite Studios, talks with New to The Street's TV Host Jane King about the organization's sports educational platforms. As a leading sports education brand, IMG provides access and opportunities for student-athletes on-campus and online. The academy's model focuses on holistic and intentional personal development through a suite of products. A 600-acre campus in Bradenton, Florida, offers over 1500 students a practical education beyond just classroom instruction. IMG Academy hosts numerous sports camps and college recruitment programs and has provided MLS (Major League Soccer), NFL, WNBA, and other sports teams' facilities and training programs. The academy prides itself on a value proposition based on 4-core components: on-campus student life, academics, athletics, and personal development. IMG Academy's online presence, IMG Academy+, helps student-athletes globally with various programs. Girls' sports programs are an essential aspect of the IMG Academy curriculum, with new program offerings to inspire female athletes. Some of the most influential female athletes sit on IMG Academy's \"Women in Sports Committee,\" providing leadership roles and advice to improve girls' sports educational experiences. Offering girls more student loan packages has increased female enrollments and helps maintain retention rates. The efforts proved successful with new sports curricula like the women's volleyball program. Before becoming President of IMG, Tim worked as an executive for the academy through his relationship with Endeavor Group Holdings, Inc. In 2020, during COVID, his passion became more evident, and he took on a direct role as president. The academy is always looking to improve the student experience; they engage employees, students, and parents to provide comprehensive suggestions that can significantly benefit all the educational platforms on campus and online. New facilities, sports programs, food services, and student life programs became realities based on those inputs shared with the academy's leaders. The positive ongoings have increased student enrollment and overall student body retention. Endeavor Group Holdings, Inc. recently sold the IMG Academy to Hong Kong-based BPEA Equity (BPEA EQT), a private equity firm. BPEA EQT, in partnership with existing portfolio company Nord Anglia Education, can open IMG Academy's sports educational programs to a larger global market. With strong leadership and a commitment to ensuring a unique sports educational experience, IGM Academy attracts some of the best student-athletes to help them excel in their life's journey. The on-screen QR code is available during the show; download or visit IMG Academy - https://www.imgacademy.com/.\nNew to The Street airs its \"Sekur Privacy & Sekur Security – The Weekly Hack\" segment. Alain Ghiai, an internationally acclaimed internet privacy expert and the CEO of Sekur Private Data, Ltd. (OTCQX: SWISF) (CSE: SKUR) (FRA: GDT0) ($SWISF) (Sekur®) talks with TV Host and Multi-media Journalist Ana Berry about a recent mortgage company data breach. Mr. Cooper, one of the largest mortgage lenders, reported a breach in stolen data on approximately 15 million customers. The stolen data includes names, addresses, social security numbers, account numbers, dates of birth, and phone numbers. Mr. Cooper sent letters to its customers offering free monitoring services to help notify clients if someone is using their stolen data in the future. Alain believes that the cyber security breach occurred from an email account. 87% of cyber issues stem from emails, especially on free, Big Tech platforms. Many larger corporations use Big Tech platforms for their IT needs, which unfortunately have limited countermeasure cybersecurity features. To avoid cyberhackers' attempts, send your information through the most secure method possible or become a Sekur subscriber. SekurMail, with SekurSend/SekurReply options, sends a link to a recipient to open an email in a closed-loop encrypted military platform. The service protects both the subscriber and the recipient, even if the recipient is not a Sekur subscriber. Using SekurMail with the Company's SekurVPN adds another layer of encryption that protects its subscribers' IP addresses and website traffic information. Sekur owns its servers, never sells data, never uses phone numbers, has no 3rd party cloud applications, and never tracks web traffic. Sekur.com can offer businesses and individuals a secure and private e-communication platform that is reasonably priced, ranging from $12-$20 monthly; business customers have higher prices from business email domain migration. Sekur offers PROMO CODE: PRIVACY, which gives a 15% discount on all Sekur services for up to 5 years. Remember, Sekur Private Data, Ltd. operates in Switzerland, a country with some of the strictest privacy laws in the world. Tune in next time for another cybersecurity topic on the \"Sekur Privacy & Sekur Security– Weekly Hack\" segment. The on-screen QR code is available during the show to download more info or visit Sekur Private Data, Ltd. - https://sekurprivatedata.com/, https://sekur.com/ and https://sekurvpn.com/. \"Privacy Has Arrived.\"\nAbout The Compass Collection:\nThe Compass Collection is an elite vacation rental marketing and management company in the USA. They are experts in providing concierge-level services and results and believe every property owner and renter deserves fantastic rental experiences. Let The Compass Collection's dedicated rental management specialist use their extensive knowledge and proven track record to take an exclusive vacation property rental to the next level - www.thecompasscollection.com.\nAbout Acurx Pharmaceuticals, Inc. (NASDAQ: ACXP) ($ACXP):\nAcurx Pharmaceuticals, Inc. (NASDAQ: ACXP) ($ACXP) is a clinical-stage biopharmaceutical Company focused on developing new antibiotics for difficult-to-treat infections. The Company's approach is to develop antibiotic candidates that target the DNA polymerase IIIC enzyme. Its R&D pipeline includes antibiotic product candidates that target Gram-positive bacteria, including Clostridioides difficile, methicillin-resistant Staphylococcus aureus (MRSA), vancomycin-resistant Enterococcus (VRE), and drug-resistant Streptococcus pneumoniae (DRSP). The Company's Ibezapolstat is a novel, orally administered antibiotic developed as a Gram-Positive Selective Spectrum (GPSS™) antibacterial. It is the first of a new class of DNA polymerase IIIC inhibitors under development by Acurx to treat bacterial infections. Ibezapolstat's unique spectrum of activity, which includes C. difficile but spares other Firmicutes and the important Actinobacteria species, appears to contribute to maintaining a healthy gut microbiome. The Company completed Phase 2 clinical trials of Ibezapolstat. To learn more about Acurx Pharmaceuticals and its product pipeline, please visit www.acurxpharma.com.\nAbout Dynex (CRYPTO: DNX) ($DNX):\nDynex (CRYPTO: DNX) ($DNX) represents a cutting-edge neuromorphic computing platform built upon a revolutionary adaptable blockchain system. This decentralized neuromorphic supercomputing network executes calculations with unparalleled speed and efficiency, surpassing quantum computing limitations. Dynex is the world's first neuromorphic supercomputing blockchain based on its DynexSolve chip algorithm, a Proof-of-Useful-Work (PoUW) approach to solving real-world problems. PoUW miners participate on a decentralized network that can sometimes perform tasks at speeds greater than quantum computing. In December 2023, the Company officially launched the Dynex Marketplace - https://dynexcoin.org/.\nAbout IMG Academy:\nIMG Academy is the world's leading sports education brand, providing access and opportunity for student-athletes with an innovative suite of on-campus and online programming. IMG Academy supports the entire student-athlete developmental journey from exploration to specialization to graduation through its boarding school and camps on its cutting-edge campus in Bradenton, Florida; IMG Academy+ online coaching with a focus on personal development through the lens of sport and performance; and NCSA College Recruiting, providing tools, coaching, and access to a network of 40,000 college coaches. IMG Academy is the only education brand directly responsible for filling one-quarter of all college roster spots annually. IMG Academy helped place many thousands of kids into college - https://www.imgacademy.com/.\nAbout Sekur Private Data Ltd. (OTCQB: SWISF) (CSE: SKUR) (FRA: GDT0) ($SWISF):\nSekur Private Data, Ltd. (OTCQB: SWISF) (CSE: SKUR) (FRA: GDT0) ($SWISF) is a cybersecurity and internet privacy provider of Swiss-hosted solutions for secure communications and secure data management. The Company distributes a suite of secure cloud-based storage, disaster recovery, document management, encrypted emails, and secure communication tools. It sells its products through its websites, www.sekur.com, approved distributors, and telecommunication companies worldwide. Sekur Private Data, Ltd. serves consumers, businesses, and governments worldwide - https:/sekurprivatedata.com and https://sekur.com; Twitter: @sekurprivate.\nAbout New to The Street:\nNew to The Street is an FMW Media production that operates one of the longest-running US and International sponsored and syndicated Nielsen-rated programming television brands, \"New to The Street.\" Since 2009, New to The Street has run biographical interview segment shows across major U.S. television networks. The Nielsen-rated and sponsored broadcast programming platform reaches millions of homes in the US and international markets. FMW's New to The Street show appears on Bloomberg and the FOX Business Network as sponsored programming. FMW is also one of the nation's largest buyers of linear television, long and short-form paid programming - https://www.newtothestreet.com/.\nForward-Looking Statements Disclaimer US/Canada:\nThis press release contains forward-looking statements within Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934. In some cases, you can identify forward-looking statements by the following words: \"anticipate,\" \"believe,\" \"continue,\" \"could,\" \"estimate,\" \"expect,\" \"intend,\" \"may,\" \"ongoing,\" \"plan,\" \"potential,\" \"predict,\" \"project,\" \"should,\" \"will,\" \"would,\" or the negative of these terms or other comparable terminology. However, not all forward-looking statements contain these words. Forward-looking statements do not guarantee future performance or results and will not necessarily be accurate indications of when such performance or results are achieved. This press release should be considered in all filings of the Companies contained in the Edgar Archives of the Securities and Exchange Commission at www.sec.gov.\nThis press release contains forward-looking information within the meaning of applicable Canadian securities laws. Forward-looking information is often, but not always, identified by the use of words such as \"seek,\" \"anticipate,\" \"believe,\" \"plan,\" \"estimate,\" \"expect,\" \"likely,\" and \"intend\" and statements that an event or result \"may,\" \"will,\" \"should,\" \"could\" or \"might\" occur or be achieved and other similar expressions. These statements reflect management's current beliefs and are based on information currently available to management as of the date hereof. Forward-looking information in this press release includes, without limiting, the foregoing expectations. Neither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\nCONTACT:\nFMW Media Contact:\nMonica Brennan\nmonica@NewtoTheStreet.com\n1-917-330-2564\n\"New to The Street\" Business Development Office\n1-516-696-5900\nSupport@NewToTheStreet.com\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/8983ef68-0216-4779-8026-4e79095ab718",
  "word_count": 2921,
  "scraped_at": "2026-02-14T12:17:23.882057"
}