{
  "article_id": "a2a7dbdf184c",
  "url": "https://indianexpress.com/article/upsc-current-affairs/upsc-essentials/upsc-prelims-2024-current-affairs-pointers-june-3-to-9-elections-result-9382734/",
  "title": "UPSC Current Affairs Pointers of the past week | June 3 to June 9 , 2024",
  "date": "20240610T063000Z",
  "domain": "indianexpress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This is an archive article published on June 10, 2024\nUPSC Current Affairs Pointers of the past week | June 3 to June 9, 2024\nWorld Environment Day, Election verdict, HCES, IATA and more — Here are some must read current affairs tidbits for your prelims preparation that you shouldn't miss for UPSC, state PSCs, and other competitive examinations.\n12 min readNew DelhiUpdated: Jun 29, 2024 06:12 PM IST\nIn the recently concluded Lok Sabha election, BJP emerged as the largest party after securing 240 seats and Prime Minister designate Narendra Modi formally stake claim for government formation, at Rashtrapati Bhavan, in New Delhi, Friday, June 7, 2024. (PTI Photo)\nUPSC Current Affairs Pointers is a new initiative of UPSC Essentials to consolidate your prelims exam prep. Every Monday, take a quick look at last week’s current affairs tidbits curated specially for those preparing for UPSC and various other competitive examinations.\nWorld Environment Day (WED) is observed annually on June 5th as a significant international event dedicated to raising awareness about environmental issues and promoting sustainable practices. This year, the Kingdom of Saudi Arabia had the honor of hosting the 2024 Environment Day celebration.\nThe theme for WED 2024 is “Our Land, Our Future, We Are Generation Restoration,” with a focus on land restoration, desertification, and drought resilience.\nThe establishment of the United Nations General Assembly on June 5, 1972, marked the inception of WED, aiming to raise awareness and promote action for environmental protection. Each year, a different theme is chosen to spotlight various environmental challenges.\nThe United Nations General Assembly declared the decade from 2021 to 2030 as the UN Decade on Ecosystem Restoration\nThe NHRC of India was established on October 12, 1993, under the Protection of Human Rights Act (PHRA), 1993, which was later amended by the Protection of Human Rights (Amendment) Act, 2006.\nThe NHRC is a multi-member body comprising a chairperson and five members.\nFollowing the retirement of former Supreme Court judge Arun Mishra, who served as the chairperson of the NHRC for three years, the President has appointed Vijaya Bharathi Sayani as the acting chairperson.\nIn the recently concluded 2024 Lok Sabha elections in India, a total of 543 parliamentary constituencies were contested. The Bharatiya Janata Party (BJP) emerged as the leading party, securing victory on 240 seats, followed by the Indian National Congress (INC) with 99 seats, the Samajwadi Party (SP) with 37 seats, and the All India Trinamool Congress (AITC) with 29 seats.\nDespite progress in women’s representation, with 74 women MPs elected to the Lok Sabha this year, the number is four fewer than in 2019. However, it marks a substantial increase from India’s first elections in 1952, indicating gradual progress in gender parity in Indian politics. Nonetheless, these 74 women MPs constitute only 13.63% of the elected strength of the Lower House, highlighting the ongoing need for greater gender diversity in political representation.\nOne noteworthy aspect of these elections was the significant number of votes cast for “None Of The Above” (NOTA) in the Indore Lok Sabha constituency. A staggering 218,674 voters opted for NOTA, setting a new record. This surpassed the previous record held by Gopalganj, Bihar, in 2019, where 51,660 voters chose this option.\nEconomy\nStory continues below this ad\nIn urban India, the share of food in average monthly per capita consumption expenditure (MPCE) in 2022-23 was about 39 per cent. (Express Photo)\nThe National Sample Survey Office (NSSO) under the Ministry of Statistics and Programme Implementation conducted the Household Consumption Expenditure Survey (HCES) from August 2022 to July 2023.\nThis survey, typically conducted every five years, aims to generate estimates of household Monthly Per Capita Consumption Expenditure (MPCE) and its distribution across rural and urban sectors, different states and union territories, and various socio-economic groups.\nThis survey marks a significant update in understanding the consumption patterns of Indian households, given that the last survey conducted in 2017-18 was not released due to cited “data quality” issues.\nThe average monthly per capita consumption expenditure (MPCE) in urban households rose by 33.5% since 2011-12, reaching ₹3,510. Rural India saw a 40.42% increase in MPCE over the same period, hitting ₹2,008.\nThe proportion of spending on food has decreased in both rural and urban households. Rural households now spend 46.4% of their overall monthly outgoes on food, down from 52.9% in 2011-12. Urban households spend 39.2% on food, compared to 42.6% eleven years ago.\nIn rural areas, Haryana households spent the most on ‘milk and milk products’ at 41.7% of total expenditure on food. Kerala households spent the most on ‘egg, fish & meat’ at 23.5% of their food expenditure.\nThe International Air Transport Association (IATA), the trade association representing some 330 airlines and over 80% of total air traffic, will hold its annual general meeting (AGM) in Delhi from June 8-10, 2025. IndiGo, India’s largest airline, will be the host for this marquee global aviation event.\nThis will mark the first time in over four decades that India hosts the IATA AGM. The last time India hosted the event was in 1983, and prior to that, in 1958.\nScience and Technology\nThis Nakshatra Sabhas have been launched in collaboration with Starscapes, a private company that runs observatories related to astrophysics and space exploration across the state. (Express Photo)\nThe Uttarakhand government has inaugurated a three-day ‘Nakshatra Sabha’. It was organised at George Everest peak in Mussoorie by the Uttarakhand Tourism Department in collaboration with an Astro tourism company, Starscapes.\nIt aimed at promoting astro tourism in the region. The event promised a comprehensive astro-tourism experience, featuring stargazing through specialised instruments, talks by experts, an astrophotography competition, and special solar observations.\nNASA’s James Webb Space Telescope (JWST) has identified the earliest-known galaxy, an extraordinary discovery by an international team of astronomers as part of the JWST Advanced Deep Extragalactic Survey (JADES) program.\nThe galaxy, named JADES-GS-z14-0, spans about 1,700 light-years approximately 9.5 trillion kilometers. This galaxy has a mass equivalent to 500 million stars the size of our Sun and is rapidly forming new stars at a rate of about 20 per year.\nIn the same study, the JADES team also uncovered the second oldest-known galaxy, JADES-GS-z14-1. This galaxy dates back to about 303 million years post-Big Bang. It is smaller than JADES-GS-z14-0, with a mass equivalent to about 100 million sun-sized stars, measuring approximately 1,000 light years across, and forming around two new stars per year.\nDiseases in News\nMexican health officials alerted the WHO that a 59-year-old who died in a Mexico City hospital had the virus despite no known exposure to poultry or other animals. (AP)\nThe World Health Organization (WHO) confirmed on June 5, the death of a 59-year-old man in Mexico caused by a strain of bird flu called H5N2. This marks the first recorded human fatality from this particular strain.\nAvian influenza, or bird flu, is a viral infection that primarily affects birds but certain subtypes can infect humans, leading to severe respiratory illnesses. The most notorious of these subtypes is H5N1, which has caused numerous human infections and fatalities in the past.\nSymptoms of avian influenza in humans mirror those of regular flu and include fever, cough, sore throat, muscle aches, and, in advanced cases, severe respiratory distress.\nPerson in News\nSub-Lieutenant Anamika B Rajeev. (Photo Credit: X/@SpokespersonMoD)\nSub-Lieutenant Anamika B Rajeev has made history by becoming the Indian Navy’s first woman helicopter pilot. She received the prestigious “Golden Wings” at a passing-out parade held at a naval air station in Arakkonam, Tamil Nadu.\nShe will be flying helicopters such as Sea Kings, ALH Dhruvs, Chetaks, and MH-60R Seahawks, marking a significant milestone for women in the Indian Navy.\nIn another notable achievement, Lt Jamyang Tsewang, the first commissioned naval officer from Ladakh, also graduated as a qualified helicopter pilot.\nIn 2018, flying officer Avani Chaturvedi of the Indian Air Force became the first Indian woman to fly a fighter aircraft solo, piloting a MiG-21 Bison.\nClaudia Sheinbaum has achieved a historic milestone by winning a landslide victory to become Mexico’s first female president.\nThis landmark election sets a precedent for North America, as neither the United States nor Canada has yet elected a woman leader to office.\nA climate scientist and former mayor of Mexico City, Sheinbaum’s election is seen as a significant advancement for gender equality in the region.\nThe historic election featured two prominent female candidates, with Xóchitl Gálvez Ruiz of the Fuerza y Corazón por México (Strength and Heart for Mexico; formerly known as Frente Amplio por México) serving as the opposition coalition candidate.\nSheinbaum will be the seventh woman to be elected president in Latin America, following in the footsteps of Violeta Chamorro of Nicaragua (1990), Mireya Elisa Moscoso of Panama (1999), Michelle Bachelet of Chile (2006), Cristina Fernández de Kirchner of Argentina (2007), Laura Chinchilla of Costa Rica (2010), and Dilma Rousseff of Brazil (2011).\nIndian-origin astronaut Sunita Williams flew to space for the third time on May 5th, along with fellow astronaut Butch Wilmore, marking a historic milestone as the first members aboard Boeing’s Starliner spacecraft.\nThis 25-hour flight to the International Space Station (ISS) also saw Wilmore and Williams become the first astronauts to be launched on an Atlas V rocket.\nWilliams made history as the first woman to embark on such a mission, adding to her already impressive list of achievements.\nIn 2012, during a prior trip to the ISS, Williams became the first person to complete a triathlon in space. She simulated swimming using a weight-lifting machine and ran on a treadmill while strapped in by a harness to prevent floating away.\nSports\nPoland’s Iga Swiatek holds the trophy after winning the women’s final of the French Open tennis tournament against Italy’s Jasmine Paolini at the Roland Garros stadium in Paris, France, Saturday, June 8, 2024. (AP Photo/Thibault Camus)\nPolish sensation Iga Swiatek, the 23-year-old World No. 1, triumphed over Italian Jasmine Paolini to clinch her third consecutive French Open title, marking her fourth victory in five years at Roland Garros. This victory also marks Swiatek’s fifth Grand Slam singles title. Notably, she became the only woman apart from Serena Williams to achieve the Madrid-Rome-Paris triple, winning all three premier clay court events in the same year.\nOn the men’s side, 21-year-old Carlos Alcaraz of Spain defeated Germany’s Alexander Zverev to claim his first French Open title. This victory makes Alcaraz the seventh Spaniard in the Open Era to win the Roland Garros trophy. With this win, Alcaraz now holds three Major titles and has become the youngest player to win Grand Slams on all three surfaces.\nReal Madrid clinched their 15th Champions League title with a decisive 2-0 victory over Borussia Dortmund at Wembley.\nThis triumph not only solidified their position as one of the most successful clubs in European football but also marked a significant achievement for key players Dani Carvajal and Luka Modrić.\nFollowing this victory, Carvajal and Modrić surpassed their former teammates Cristiano Ronaldo and Karim Benzema in terms of showpiece victories, with six final wins to their names.\n— ISSF World Cup Rifle / Pistol\nIndian shooter Sarabjot Singh clinched the gold medal in the men’s 10m air pistol event at the ISSF World Cup 2024 in Munich, Germany, on June 6, 2024.\nShooter Samra secured the bronze medal in the women’s 50m rifle 3 positions event, contributing to India’s medal tally.\nIndia concluded the ISSF World Cup 2024 in Munich with two medals. China dominated the event, leading the standings with 11 medals (four golds, four silvers, and three bronzes), followed by Norway, which secured one gold, one silver, and one bronze.\nSubscribe to ourUPSC newsletterand stay updated with the news cues from the past week.\nStory continues below this ad\nThe UPSC articles of Indian Express is now on Telegram. Click here to join our Telegram channel and stay updated with the latest Updates. Also, follow us on Instagram and X.\nKhushboo Kumari is a Deputy Copy Editor with The Indian Express. She has done her graduation and post-graduation in History from the University of Delhi. At The Indian Express, she writes for the UPSC section. She holds experience in UPSC-related content development. You can contact her via email: khushboo.kumari@indianexpress.com ... Read More",
  "word_count": 2039,
  "scraped_at": "2026-02-14T12:47:49.670937"
}