{
  "article_id": "a2a8cacb8b4f",
  "url": "https://www.arsenal.com/news/loan-watch-13-gunners-start-life-new-clubs",
  "title": "Loan Watch : 13 Gunners start life at new clubs",
  "date": "20250915T123000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After a flurry of activity around deadline day, we currently have 15 players across our men’s and women’s first-team squads out on loan for regular football at various clubs around the world.\nFive of our men’s side and eight from our women’s squad are currently away from north London on temporary deals, many of whom have made their first appearances for their new clubs over the past couple of weeks.\nJakub Kiwior enjoyed a bright start to life at Porto on Saturday, slotting into a defence which kept a clean sheet and secured three points with a 1-0 win over Nacional. The victory maintains Porto’s 100% league record at the summit of the Liga Portugal after five games.\nHaving spent time at Porto last term, Fabio Vieira made his debut for Hamburg in the Bundesliga on Saturday, but his team endured a tough evening as they suffered a 5-0 defeat at champions Bayern Munich. Fabio played 76 minutes at the Allianz Arena.\nThree more of our first-teamers are still awaiting their bows though, as Reiss Nelson was an unused substitute for Brentford as Keith Andrews’ side played out an enthralling 2-2 draw with Chelsea in an all-London clash, while Karl Hein was also an unused substitute as Werder Bremen put four past Borussia Monchengladbach without reply to go ninth in the Bundesliga. Oleksandr Zinchenko was ineligible for Nottingham Forest's 3-0 loss at Emirates Stadium after his deadline-day move.\nIn his fourth start for Shrewsbury Town so far, Ismeal Kabia played 76 minutes of their 3-1 defeat at home to Salford City, as the Shropshire side fell to 23rd in League Two, while academy teammate Lucas Nygaard didn't feature in Brabrand IF's 2-2 draw with BK Fremad Amager as they remained 10th in the Danish second division.\nAs for our women's loanees, Michelle Agyemang and Rosa Kafaji both featured for Brighton & Hove Albion on Friday night, as they narrowly went down 2-1 at Manchester City in the WSL. Michelle played the full 90 minutes in Manchester, while Rosa came off the bench in search of an equaliser in the final nine minutes in what was her Seagulls debut.\nMadison Earl came on in the 68th minute of Ipswich Town's 1-0 defeat at home to Nottingham Forest, who fell to the bottom of WSL 2. Vivienne Lia came on in the 79th minute of that match for Forest, who are seventh.\nPortsmouth are also still looking for their first point after Sunday's 2-0 loss away to Bristol City, which Jessie Gale came on in the 79th minute. The game came too early for Naomi WIlliams to be included in the squad for the Robins.\nCecily Wellesley-Smith is still awaiting her Leicester City debut as she was an unused substitute as they beat Liverpool 1-0 to go seventh in the WSL, while overseas, Laila Harbert did not come off the bench in Portland Thorns' 1-1 draw away to Chicago Stars, which left the former fourth in the NWSL.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 523,
  "scraped_at": "2026-02-14T12:58:28.073962"
}