{
  "article_id": "a2e3f8c3f157",
  "url": "https://metro.co.uk/2025/08/24/watch-us-open-2025-tv-channel-live-stream-uk-23987630/",
  "title": "US Open 2025 : How to watch on TV channel and live stream in the united kingdom ",
  "date": "20250824T141500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The US Open is back for another year with the likes of Carlos Alcaraz, Jannik Sinner, Emma Raducanu and Jack Draper all playing in New York.\nAfter the mixed doubles, which took place last week, the fourth major tennis event of 2025 kicked off on Sunday as Alcaraz attempts to get revenge on Sinner for his Wimbledon final loss.\nBritish No.1 Draper, ranked No.5 in the world, will also fancy his chances in the men’s singles having reached the semi-finals at last year’s US Open.\nRaducanu famously clinched the title at Flushing Meadows four years ago and the Brit is looking to enjoy a deep run in the women’s singles this year.\nScroll down for details on how to watch the US Open on TV in the UK including which channel you need and information about live streaming…\nHow to watch the US Open on a TV channel in the UK\nTo watch the US Open on TV in the UK, the channel you need is Sky Sports Tennis.\nSky Sports Tennis can be found on the linear channel number 407, while Sky Sports+, which is providing additional coverage, is number 410 for Sky Glass customers and 412 for Sky Q customers.\nHow to live stream the US Open in the UK\nYou can live stream the US Open in the UK via Sky Go or NOW TV.\nIf you’re not a Sky customer, you can pay for a NOW TV day pass or sign up for a monthly subscription.\nA NOW TV day pass is currently available for £14.99 here.\nCan you watch the US Open without Sky Sports?\nSky Sports has exclusive coverage of the 2025 US Open.\nMore Trending\nThat means if you do not have a Sky subscription, and do not want to pay for NOW TV, you will not be able to watch the action from the Grand Slam tournament.\nHowever, Sky may upload some of the highlights to their YouTube page – which you can find here.\nWhat time does play start each day at the US Open?\nThe US Open day sessions will start at 4pm UK time and the night sessions will begin at 12am (midnight) UK time.\nMORE: Carlos Alcaraz explains his shock new look at the US Open\nMORE: Medvedev has proven, once again, that he is a massive baby\nMORE: Emma Raducanu’s former coach names the two favourites to win the US Open",
  "word_count": 404,
  "scraped_at": "2026-02-14T13:22:52.102835"
}