{
  "article_id": "a2ebdba42eed",
  "url": "https://bleedingcool.com/tv/james-gunn-offers-reassuring-response-to-green-lantern-suit-question/",
  "title": "James Gunn Offers Reassuring Response to Green Lantern Suit Question",
  "date": "20231230T044500Z",
  "domain": "bleedingcool.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Posted in: Max, Movies, Preview, streaming, TV | Tagged: dc studios, dcu, green lantern, lanterns, max\nJames Gunn Offers Reassuring Response to Green Lantern Suit Question\nSuperman: Legacy's James Gunn clarified an important matter regarding Nathan Fillion's Green Lantern suit that should bode well for Lanterns.\nArticle Summary\n- James Gunn isn't looking to go CGI with Nathan Fillion's Green Lantern suit.\n- \"Lanterns\" series to delve into Hal Jordan and John Stewart's story.\n- Gunn teased \"Lanterns\" last month with a flame emoji.\n- Upcoming live-action \"Superman: Legacy\" and animated \"Creature Commandos\" boast star-studded casts.\nEven with DC Studios co-head James Gunn ready to start filming on Superman: Legacy in a few months and the animated Creature Commandos set to kick off his & co-CEO Peter Safran's new DCU in 2024, we've been trying to keep our radars tuned to the other projects that were announced almost a year ago as part of \"Chapter 1 – Gods and Monsters.\" As we were doing some social media clean-up, we found an update from Gunn that we nearly missed – one that directly impacts \"Legacy\" but also bodes well for the upcoming Green Lantern series, Lanterns. Over the course of the casting news for \"Legacy\" that's been released, we learned that Nathan Fillion (The Rookie) would be joining the film – and the DCU – as Green Lantern Guy Gardner. That led to a question from a fan on Threads about Fillion's suit – hitting upon one of the biggest problems that fans had with Ryan Reynolds' 2011 Green Lantern film.\nOver the past dozen years, costuming for superhero series & films has grown by leaps and bounds – just look at the work that's been done with Prime Video's The Boys and Max's Titans. With that in mind, Gunn offered a matter-of-fact reassurance when asked if Guy's suit would be real, CGI, or a combination of the two. \"I can't remember ever having a CG suit unless it was on a CG character,\" was Gunn's response. Since we're not interested in beating up on a film that came out over ten years ago, we'll just say that we're really glad to hear that. Compared to \"a huge HBO-quality event\" along the lines of \"True Detective,\" Lanterns is set to focus on Hal Jordan and John Stewart, who investigate a mystery that Safran said \"plays a really big role leading us into the main story that we're telling across our film and television. So this is a very important show for us.\"\nBack in November, Gunn was asked if there was anything new he could say about the upcoming series. While not offering any words, Gunn did respond with a flame emoji – which we're taking as a good sign. Granted, now we're curious to know if that's based on any scripts that were seen, maybe some preliminary production designs. But the fact that he had a response and was willing to offer it is a good sign that things are moving on that front, too.\nSet for a Summer 2025 premiere, DC Studios' Superman: Legacy stars (so far) David Corenswet (Hollywood) as Superman/Clark Kent, Rachel Brosnahan (The Marvelous Mrs. Maisel) as Lois Lane, Nicholas Hoult (The Great) as Lex Luthor, Isabela Merced (Sicario: Day of the Soldado) as Hawkgirl, Edi Gathegi (X-Men: First Class) as Mister Terrific, Nathan Fillion (The Rookie) as Green Lantern Guy Gardner, and Anthony Carrigan (Barry) as Metamorpho. The role call for Max's 2024-premiering Creature Commandos includes Frank Grillo as Rick Flag Sr., with Maria Bakalova as Princess Ilana Rostovic, Indira Varma as The Bride, Zoe Chao as Nina Mazursky, Alan Tudyk as Dr. Phosphorus, David Harbour as Eric Frankenstein, and Sean Gunn as G.I. Robot & Weasel, and Steve Agee returning as John Economos. Here's a rundown of what else was announced series-wise at the beginning of the year:\n\"Waller\": With Peacemaker Season 2 on hold while Gunn works on Superman: Legacy, the Viola Davis-starring series will include the \"Peacemaker team\" and serve as a \"continuation\" of the HBO Max series. The series will be executive produced & penned by Jeremy Carver (Doom Patrol) and DCU writers's room writer Christal Henry.\n\"Paradise Lost\": Set before the birth of Diana (Wonder Woman) and set on the island of Themyscira, Safran & Gunn see the series as a \"Game of Thrones\" -like take on Wonder Woman's origins (\"It's really about the political intrigue behind a society of all women\": Safran). Comic fans may recognize the title from Phil Jimenez & George Pérez's Paradise Island Lost comics series. \"How did that come about? What's the origin of an island of all women? What are the beautiful truths and the ugly truths behind all of that? And what's the scheming like between the different power players in that society?\" were the rhetorical question that Gunn asked when explaining the series' themes.\n\"Booster Gold\": Seen as the DCU's deep dive into comedy, Safran describes Mike Carter/Booster Gold as \"a loser from the future who uses basic future technology to come back to today and pretend to be a superhero.\" From a series perspective, we're looking at a possible 25th-century setting, where Mike is a disgraced former football star who uses a time machine on display in the Metropolis Space Museum to gain fame and fortune… and maybe the desire to be a real superhero (if the sponsorship is right?). \"Basically, \"Booster Gold\" is imposter syndrome as a superhero,\" Gunn added.",
  "word_count": 910,
  "scraped_at": "2026-02-14T13:38:22.335106"
}