{
  "article_id": "a2ec9c6aba9f",
  "url": "https://www.bbc.co.uk/sport/football/64878704",
  "title": "Barcelona : George Girvan scored La Liga club first goal and taught Spanish how to foul",
  "date": "20230328T124500Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Barcelona: George Girvan scored La Liga club's first goal and taught Spanish how to foul\n- Published\nLionel Messi became a worldwide superstar on his way to scoring a record 672 goals for Barcelona, but did you know a Scotsman scored the club's first competitive goal?\nGeorge 'Geordie' Girvan's name will forever be etched in the La Liga club's history books for hitting the net in the freshly inaugurated 1900-01 Copa Macaya, an early iteration of the Copa del Rey.\nBut how did this connection occur between what became a modern superclub with a global fanbase, a boy from North Lanarkshire and the Victorian textile mills of Ayrshire and Renfrewshire?\nBarcelona historians Manuel Tomas and Mike Roberts explain to BBC Scotland how the early years of the club had a distinctly Scottish flavour.\nWhy Barcelona?\nBorn in Dalziel, just outside Motherwell, in 1878 to parents from Ayrshire, Girvan's journey to Spain begins in the textile mills of Johnston Shields & Co in Newmilns.\nThe mills were booming, but there was a problem. The Factory Act 1891 limited the hours children could work and prohibited women from working within four weeks of giving birth.\nArmed with patents for their design and manufacture of lace fabrics, and recognising Barcelona's growing importance as a European shipping hub as well as its less restrictive labour laws, Johnston & Shields opened a factory in Sant Marti I Provencales, then just north of the city.\nThe company sent Scottish workers, including Girvan, to Catalunya to teach the locals how to produce their products.\nGirvan began playing football for factory side FC Escoces - 'the Scottish team' - who also imported the combination football pioneered in Glasgow by Queen's Park.\nBarcelona, in the meantime, had been founded in 1899 by Hans Gamper, a Swiss businessman who had previously established, and played for, FC Zurich. It was, says Tomas, \"a club of mainly foreign wealthy gentlemen players\".\nTheir city rivals, the long-since-folded Catala, had a strict no-foreigners policy and their team was made up of entirely local merchants; the Athletic Bilbao of their day.\nThe Scottish controversy\nRealising they had to relax their policy to remain competitive, Catala turned up for a February 1900 'friendly' against Barcelona having poached no fewer than six Scots from the Escoces team, including Girvan.\nHowever, Barca were livid they had not been told beforehand of Catala's change in transfer policy and, in an ill-tempered encounter, the Scot's new team finished with eight players and a bruising 4-0 defeat.\nGirvan's team-mate and fellow countryman Willie Gold landed a haymaker on the jaw of Barcelona's English gent Stan Harris that earned him a straight red.\nRoberts says Barcelona were \"morally outraged\" and even took out a press advertisement confirming they would \"not play any matches against the Scottish\".\nRoberts, the author of 'Football in Barcelona: 1892-1902+', suggests there was more than a hint of class snobbery and hypocrisy given Barcelona's own team was already multi-national.\n\"Barcelona's players were gentlemen amateurs, the Scots were a different breed of player altogether, they were manual labourers from the mills,\" he says.\nThe dilemma was that Girvan - who \"could play in every position, defender one week, left winger the next, a great all-rounder by the standards in Barcelona at the time\" - and his fellow Scots were the best players in the city.\nCopa Macaya and the U-turn\nAnd, with that, we return to the inaugural 1900-01 Copa Macaya. It was the first football tournament in Spain, organised by businessman and football enthusiast Alfonso Macaya.\n\"It was a tournament Barca were expected to walk,\" Roberts says.\nBarca shocked everyone by surreptitiously lifting their ban on Scotsmen and fielding a team featuring three of them, with Girvan as striker.\nNot only that, they made the Scotsmen they had previously shunned into honorary members of the club.\nThe match ended in a 2-1 win for Hispania, who themselves fielded six Scots, but their opponents' newly signed attacker from Motherwell netted the opening goal and, with it, secured a place in the annals and a mention in the FC Barcelona Museum to this day.\n\"He's a legendary figure in the history of the club,\" Roberts adds. \"Messi may be Barca's record goalscorer, but Girvan got their first.\"\nWhile an alleged unpaid bar bill at the city's Hotel Casanovas led to Barcelona's Scottish contingent being stripped of their membership, Tomas in no doubt about the extent of their legacy.\n\"The Scots were part of a community which Barca ultimately grew out of,\" he suggests.\nGirvan, having long since returned to Scotland and become Provost of Newmilns and chair of the lacemakers union, was a guest of honour in a game between Scotland and Spain at Hampden Park in 1957 - 11 years before his death.\nHis fondest memory, the story goes, was not having scored Barca's first competitive goal but having taught the locals how to foul.\nWhat's in store for Manchester United? A brand-new podcast follows the sale of one of the biggest clubs in the world\nThe Sugababes' magical live performance: Get lost in old favourites and enjoy an unexpected cover",
  "word_count": 852,
  "scraped_at": "2026-02-14T12:51:45.953958"
}