{
  "article_id": "a2f53906e0e9",
  "url": "https://www.morningjournal.com/2025/08/12/alozie-juggles-the-houston-dash-the-nigerian-national-team-and-even-cancer-research/",
  "title": "Alozie juggles Houston Dash , Nigerian national team and even cancer research",
  "date": "20250812T231500Z",
  "domain": "morningjournal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Anne M. Peterson\nThe Associated Press\nIt’s not only that Michelle Alozie plays for the Houston Dash in the National Women’s Soccer League, or that she recently won an African championship with the Nigerian national team.\nThe Yale grad also helps conduct pediatric cancer research at Texas Children’s Hospital.\nAlozie’s dual careers sprang from necessity because — in the days before the NWSL adopted its first collective-bargaining agreement in 2022 — she was uncertain whether she could earn a livable wage in soccer.\n“I remember telling my boss that football was my main priority, and I just needed kind of like something on the side to make sure that, if needed, my resume was still there, I’m still in the medical field and I’m ready if my football life doesn’t pan out,” she said.\nThe child of Nigerian immigrants, Alozie originally played at Yale, where she graduated with a degree in molecular biology, but finished her career with Tennessee. After going undrafted, she played in Kazakhstan for a year before trying out for the Dash in 2021.\nAround that time she also got a call from Randy Waldrum, Nigeria’s American coach, who was scrambling to find eligible players after the Super Falcons arrived in the United States for a game without a full squad because of visa issues.\n“I think it was since I was in college that I wanted to play for the Super Falcons, but I didn’t really know how to get on their radar,” Alozie said. “So for it to happen this way, and for me to play my first professional football game on a national team as opposed to the club side, it was just kind of crazy.”\nShe went on to play under Waldrum in the 2023 Women’s World Cup. Nigeria advanced to the Round of 16 before falling on penalties to England after a hard-fought scoreless draw. Alozie grabbed attention during the match when England’s Lauren James stepped on her, drawing a red card.\nAlozie also played for Nigeria at last summer’s Olympics in France, adding Olympian to a growing collection of honors.\nThen this summer she helped Nigeria win the Women’s Africa Cup of Nations. The Super Falcons had dubbed their bid for a 10th African championship “Mission X”\nA versatile defender, Alozie had one of the most memorable goals of the tournament. She sent a long ball forward from distance and it bounced into the goal in stoppage time to give Nigeria a 2-1 victory over South Africa, putting the Super Falcons in the championship match. Nigeria went on to defeat host Morocco 3-2 for the title.\nThe victory came despite the persistent allegations of mismanagement of the women’s program that have dated back years, and the lack of opportunities for the players to train together as a group.\nAlozie understands how important global visibility is for the growth of the game in Africa. She pointed to fellow Nigerian players Asisat Oshoala and Rasheedat Ajibade, as well as Zambian Barbra Banda and Temwa Chawinga of Malawi, all of whom play on high-profile club teams.\n“All these people coming out of Africa that people were probably sleeping on before, and then they come to the big stage and they’re scoring hat tricks at the Olympics, they’re breaking records in the NWSL or the WSL,” she said. “I think the world is definitely waking up to women’s football in Africa.”\nBack home in the United States, Alozie works several days a week at Texas Children’s Hospital in addition to playing for the Dash.\nHer supervisor, Dr. Alexandra Stevens, said she didn’t know when Alozie applied that she was also a pro athlete. Alozie asked if she could contribute as a researcher while continuing her soccer career, and the hospital agreed.\nAlozie’s immediate focus is on the second half of the season with the Dash, who are in a rebuilding phase after finishing at the bottom of the NWSL last year. Under new coach Fabrice Gautrat, the team has made modest gains.\n“The playoff push is still there, we’re still very much focused on that. We see the changes being implemented in our culture and how we want to play in the overall identity of the Houston Dash being built,” Alozie said. “So that is something super positive, not only for right now, but for the future.”",
  "word_count": 723,
  "scraped_at": "2026-02-14T12:43:50.353078"
}