{
  "article_id": "a2fcb60a6b1e",
  "url": "https://www.coventrytelegraph.net/news/uk-world-news/one-person-dead-least-seven-26813449",
  "title": "One person dead and at least seven injured in mass stabbing outside nightclub",
  "date": "20230430T153000Z",
  "domain": "coventrytelegraph.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A murder investigation is under way after multiple people were stabbed in Cornwall. Locals in Bodmin said this morning that cordons had been put in place and there was a heavy police presence.\nPolice are currently near the Eclipse Nightclub on Castle Canyke Road and are believed to have been there since the early hours of this morning, CornwallLive reports.\nA witness said there were forensic tents outside the nightclub. The road is closed at the entrance to Victoria Square. A football match planned on a nearby pitch was cancelled this morning, according to locals.\nPolice have now confirmed that a murder inquiry is under way. A statement said: \"Police were called at 3.15am on Sunday 30 April to the area of Victoria Square on Castle Canyke Road following a report of a serious altercation.\n\"It was further reported that someone was in possession of a knife and that multiple people had sustained suspected stab wounds.\n\"A man in his 30s was confirmed deceased at the scene. His next of kin have been informed and are being supported by specialist officers.\n\"At least seven other men and women have been injured and taken to hospital to receive treatment. At this time none are being treated as life-threatening.\n\"A 24-year-old man from Bodmin has been arrested on suspicion of murder, attempted murder and causing grievous bodily harm with intent. He remains in police custody at this time.\"\nSubscribe here for the latest news where you live\nLeigh Frost, Cornwall Councillor for Bodmin St Petroc, said on Facebook this morning: \"Many of you are aware of the awful tragic news that has happened on Castle Canyke Road last night. The police are on the scene and access to the road is closed.\n\"At the moment I strongly urge everyone to let the professionals do their jobs and keep the speculation to a minimum. My thoughts are with the victims and their families.\"",
  "word_count": 320,
  "scraped_at": "2026-02-14T12:02:40.281081"
}