{
  "article_id": "a30653c9718b",
  "url": "https://www.abc.net.au/news/2025-12-18/sam-kerr-scores-the-winner-for-chelsea-in-womens-cl/106158026",
  "title": "Sam Kerr scores the winner as Chelsea makes it through to Women Champions League quarterfinals",
  "date": "20251218T034500Z",
  "domain": "abc.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sam Kerr scores the winner as Chelsea makes it through to Women's Champions League quarterfinals\nIn short:\nMatildas star Sam Kerr headed home the winner as Chelsea defeated Wolfsburg 2-1.\nThe victory means Chelsea moves directly through to the Women's Champions League quarterfinals.\nWhat's next?\nChelsea and Kerr return to Women's Super League action on January 11 against West Ham.\nMatildas skipper Sam Kerr is back to her big-game best, scoring the winner to steer Chelsea to a 2-1 comeback win over Wolfsburg and into the Women's Champions League quarterfinals.\nKerr became the first Australian, and just the second Chelsea player, to notch 20 Champions League goals with her wonderful looping header in Germany.\nIt meant Kerr and Ellie Carpenter's Chelsea, as one of the top-four teams behind Barcelona, Lyon and Bayern Munich, progresses directly through to the final eight of the revamped tournament.\nKerr's return to goalscoring form, after seeing off a calf injury following her lengthy ACL rehabilitation, will be heartening for the Matildas as she builds game time and form ahead of the home Asian Cup.\n\"It's been good,\" Kerr said after her first goal in a month.\n\"It's been obviously a little bit tricky. Every player wants to play all the time and I've had to be managed a little bit, which has been difficult.\n\"But I felt good now — the last couple of weeks especially I've felt more like myself and obviously still have to be patient with myself.\n\"But I've felt much better and enjoying being back out there and just playing football rather than thinking about making sure I'm staying fit.\n\"I feel like I can just focus on playing football and competing.\"\nKerr notched an assist in Chelsea's 3-0 win over Brighton this week, was involved without scoring in a 6-0 thrashing of Roma and notched a brace in a 6-0 win over St Poelten last month.\nChelsea was lacklustre early, with Kerr well-held, as Wolfsburg dominated play and took a deserved lead when Alexandra Popp pounced on goalkeeper Livia Peng's poor clearance and lashed home in the 16th minute.\nLucy Bronze responded in the 45th by nodding home Erin Cuthbert's corner.\nThe England star then won possession and found Johanna Rytting Kaneryd, who beat a defender then lofted the ball into the mixer for Kerr, who shrugged off her marker and brilliantly headed the winner.\nFellow Matilda Teagan Micah was on the bench as Lyon beat Atletico Madrid 4-0 to lock in second place and direct qualification, while Barcelona beat Paris FC 2-0 and Bayern Munich eliminated Valerenga with a 3-0 win.\nArsenal, home to Aussie trio Steph Catley, Caitlin Foord and Kyra Cooney-Cross, finished fifth despite its 3-0 away win over Belgian club Oud-Heverlee Leuven, and will enter the play-offs.\nCanadian young gun Olivia Smith opened the scoring in the 18th minute with England's Beth Mead doubling the Gunners's lead nine minutes later.\nCooney-Cross appeared to have teed Foord up for a goal in the 67th minute.\nIt was initially ruled out for offside but cleared after a VAR review, although it was instead awarded as an own goal.\nThe teams ranked fifth to 12th progress to two-legged play-offs.\nThe ABC of SPORT\nAAP",
  "word_count": 535,
  "scraped_at": "2026-02-14T12:50:32.084187"
}