{
  "article_id": "a3162c718e29",
  "url": "https://www.dailyliberal.com.au/story/8810984/meet-the-act-nominees-for-the-2025-australian-of-the-year-awards/?cs=2623",
  "title": "Meet the ACT nominees for the 2025 Australian of the Year Awards | Daily Liberal",
  "date": "20241105T150000Z",
  "domain": "dailyliberal.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A disability advocate, a rock climbing instructor, a rugby legend, a community radio presenter and an artistic neuro-diversity advocate are just some of the nominees for the 2025 Australian of the Year Awards for the ACT.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe territory's 18 nominees across the four award categories include Brumbies stalwart Laurie Fisher, scientist and Light House ArchiScience founder Jenny Edwards, Cafe Stepping Stone co-owners Vanessa Brettell and Hannah Costello and Disability Leadership Institute founder Christina Ryan.\nAward recipients for the ACT will be revealed next week and go on to represent the territory in the national Australian of the Year Awards presented in Canberra on the eve of Australia Day in January 2025.\nThe 2025 award nominees for the ACT are:\nAustralian of the Year\n- Jenny Edwards - Scientist and founder, Light House ArchiScience (Canberra)\n- Megan Gilmour - Co-founder, MissingSchool (Hawker)\n- Christina Ryan - Founder, Disability Leadership Institute\n- Philippa Seldon - Founder, The Healthy Tradie Project (Nanima)\nSenior Australian of the Year\n- Armando Corvini - Rock climbing instructor and volunteer (Deakin)\n- Laurie Fisher - Super Rugby coach (Canberra)\n- Peter Ralston and Marilyn Ralston - Running supporters of the vision impaired (Kaleen)\n- Stuart Warner - Musician and community radio presenter (Queanbeyan)\nYoung Australian of the Year\n- Jarrett Anthoney - Co-founder, Dainere's Rainbow (Gungahlin)\n- Daniel Bartholomaeus - Artist and neurodiversity advocate (Canberra)\n- Brendan Swan - Founder, Concussion Australia\n- Hayley Whatman - Voice for youth (Canberra)\nLocal Hero\n- Vanessa Brettell and Hannah Costello - Co-owners, Cafe Stepping Stone (Canberra)\n- Dr Madhumita Iyengar - Founder, Initiatives For Women In Need (Amaroo)\n- Pamela Muston - Ultramarathon runner (Wamboin)\n- Delfina Shakespear - Gender-equality advocate in women's sport (Florey)\nThe ACT's nominees are among 137 people being recognised across all states and territories.\nThe award recipients for the ACT will be announced on Thursday, November 14, 2024, in a ceremony at National Gallery of Australia, which will also be available to watch online at australianoftheyear.org.au.\nThey will then join the other state and territory recipients as finalists for the national awards announcement on January 25, 2025, in Canberra.\nNational Australia Day Council chief executive Mark Fraser said the nominees for the ACT had \"achieved extraordinary things and are contributing to the community in many different ways\".\n\"They are using their own experiences to help others, taking leadership roles to lift others up and demonstrating we all have greatness within us,\" Mr Fraser said.\nThe following profiles and pictures of the ACT nominees have been supplied by the National Australia Day Council, organisers of the Australian of the Year Awards.\n2025 ACT AUSTRALIAN OF THE YEAR NOMINEES\nJenny Edwards - Scientist and founder, Light House ArchiScience\nJenny Edwards brings her background in science and communication to her role as lead scientist at her award winning home design and retrofitting company, Light House ArchiScience.\nJenny believes science can guide us towards more sustainable and energy-efficient living in well-designed, welcoming and light-filled homes. She introduced the building envelope testing techniques of thermal imaging and air leakage testing to the Canberra region, and through Light House is aiming to transform the residential landscape in the territory.\nJenny is passionate about empowering the broader community by passing on knowledge about how to create comfortable and climate-resilient housing, inspiring grassroots sustainable action through simple scientific principles and smart science-based design. She shares her expertise through regular presenting and speaking engagements, authoring articles, and through her online presence at Light House and as FixIt Chicks on Instagram.\nJenny, 52, was named the Energy Efficiency Champion at the National Energy Efficiency Conference in 2023.\nMegan Gilmour - Co-founder, MissingSchool\nWhen her son survived critical illness, social innovator Megan Gilmour set out to support the 1.2 million Australian children at risk of missing school due to complex medical and mental health challenges.\nDrawing on her lived experience and professional background in global development, Megan was driven to create MissingSchool - pioneering technology, education policy and partnerships to develop school solutions that help these children continue learning alongside their peers.\nIn 2015, Megan co-authored the national-first \"School connection for seriously sick kids\" report, and published a policy paper in 2021, pursuing visibility, equity and access to education for this vulnerable cohort. She led MissingSchool to launch the world's first national telepresence service, allowing children in hospital or home to join lessons in real time, reconnecting some 6900 students since 2018.\nNow 55, Megan's relentless advocacy is changing education systems for children with chronic health conditions and school absence and their families, restoring vital connections for belonging.\nChristina Ryan - Founder, Disability Leadership Institute\nAs a person with disability, and a leader in feminist and disability advocacy for many years, Christina Ryan was well placed to recognise the enormous untapped potential of people with disabilities to be leaders in all areas of society.\nChristina founded the Disability Leadership Institute in 2016 to address the glaring gap in dedicated professional development services for people with disabilities. She recognised that the flexible thinking and problem-solving skills inherent in those with disabilities could be leveraged to benefit their chosen career trajectories.\nAs a UN delegate and expert witness to the Disability Royal Commission, 60-year-old Christina's advocacy spans several decades and is informed by her intersectional understanding of prejudice and privilege. She advocates tirelessly for others, and through the institute has united and empowered countless people with disabilities to fulfil their leadership potential, fighting ableism and championing a more inclusive workforce.\nPhilippa Seldon - Founder, The Healthy Tradie Project\nPhilippa (Pip) Seldon, 46, comes from a family of tradespeople, including her brother, a carpenter who lost his life to suicide. Pip's experience in construction as an operations manager combined with her credentials as a health and nutrition coach, yoga and breathwork practitioner made her uniquely positioned to drive positive change for those working in construction.\nPip founded The Healthy Tradie Project, a program taking a proactive approach to work, health and safety in the construction industry, which is known to have significantly high rates of mental ill-health and suicide.\nThe Healthy Tradie Project delivers structured education and training that includes mindfulness, breathwork, nutrition and yoga to empower individuals to build physical and mental fitness, ensuring they better cope with the pressures of the industry. Pip's commitment to this mission is helping to shift attitudes in a traditionally stoic group of mostly men, encouraging vital conversations around mental health and wellbeing.\n2025 ACT SENIOR AUSTRALIAN OF THE YEAR NOMINEES\nArmando Corvini - Rock climbing instructor and volunteer\nArmando Corvini says he's led two lives - the one he lived when he was young and unstoppable, and the one he lived after his accident.\nWhen Armando was 56, he was lead climber on an expedition to the Himalayas. Although the party were well prepared, there was heavy snow and they had to overnight on the descent. All came away with frostbite, with Armando the worst off - he lost all his fingers and toes.\nAfter recovering, the lifelong climber began volunteering at his local YMCA in 1997, helping stroke patients with their mobility. After it closed in 2005, he continued working as an instructor for many Canberra schools and colleges.\nArmando is now 85 and his business, Guided Outdoor Adventures, offers rock climbing, abseiling and caving exploration to foster confidence in people of all ages. He also holds free indoor rock-climbing lessons for people with disability - enabling them to experience the joy of rock climbing.\nLaurie Fisher - Super Rugby coach\nLaurie Fisher has been a prominent member of the ACT rugby community for more than 40 years. He first joined the Brumbies Runners in 1999, moving up the ladder to head coach of the Australian under 21s before becoming head coach of the Brumbies in 2005, finally leaving in 2008 for a stint with Munster in Ireland.\nLaurie returned to Canberra in 2012, helping to build a new team that was beaten in the Super Rugby final in 2013 and semi-final in 2014. After another UK stint, this time to Gloucester, he returned for the 2018 season.\nThe team he shaped with head coach Dan McKellar reached the semi-finals of Super Rugby on three occasions, took out the Super Rugby AU title in 2020 and were runners up in 2021.\nHaving retired at the completion of the 2023 season, Laurie was asked to join the Wallabies coaching staff through to the end of 2025. Now 66, he remains closely connected and the heart and soul of the Brumbies, the most successful province in Australian Super Rugby.\nPeter Ralston and Marilyn Ralston - Running supporters of the vision impaired\nPeter Ralston OAM (75) and his wife Marilyn Ralston (74) have made it possible for people with vision impairment or other disabilities in the ACT to walk or run at mainstream events and enjoy the benefits of an active lifestyle.\nPeter is founder and president of Achilles Running Club Canberra, which he and Marilyn began in 2013. Volunteer guides team up with people with disability at fun runs, club training and the weekly parkrun.\nIn the past three years, Peter has guided blind athletes 120 times at parkrun, and Achilles Canberra has enabled several blind members to each achieve hundreds of park runs. Peter and Marilyn also serve the community, Peter as a member of Lions Club of Canberra Belconnen and Marilyn at St John's Care, Reid.\nIn recognition of his service to sport for people who are blind or have low vision, Peter was awarded the Medal of the Order of Australia in 2020.\nStuart Warner - Musician and community radio presenter\nCanberra's own \"Piano Man\" Stuart Warner has been bringing joy to the public and visitors for 35 years, playing weekly at Hyatt Hotel Canberra as well as embassies, the Commonwealth Club, events and parties.\nWhen not serenading guests, Stuart has been a radio presenter and program coordinator for community radio station ArtSound FM 92.7 for 10 years. On air for up to four hours a week, he has amassed an audience thanks to his soothing voice and impart of music and singer knowledge.\nA mentor to many, 74-year-old Stuart serves on several committees at ArtSound, including its board, and assisted with training courses and seminars to introduce new community members to broadcasting.\nStuart is also a trained theatre organist and held positions on the executive of the Theatre Organ Society of Australia (ACT) since 1998. He performs on the Compton Theatre organ housed in the Albert Hall and has a 40-year local government career in NSW.\n2025 ACT YOUNG AUSTRALIAN OF THE YEAR NOMINEES\nJarrett Anthoney - Co-founder, Dainere's Rainbow\nJarrett Anthoney has endured one of the most profound losses imaginable - that of a sibling in childhood. His younger sister, Dainere, died of brain cancer at the age of 15. Together with his family, Jarrett founded Dainere's Rainbow to raise awareness and funding for childhood brain cancer and continue Dainere's legacy of advocacy.\nWorking with the Sydney Children's Hospitals Foundation, Dainere's Rainbow supports the vital research of Professor David Ziegler. To date, it has raised over $740,000. Jarrett has personally driven these efforts, instigating creative methods of fundraising including gala dinners, publishing a children's book and running the City2Surf (raising over $100,000 in the 11 years of competing), all to benefit the charity.\nIn 2016, Jarrett successfully advocated for funding for a dedicated paediatric palliative care nurse in the ACT. Through Dainere's Rainbow, 29-year-old Jarrett is fighting for better support and a brighter future for children with brain cancer and their families.\nDaniel Bartholomaeus - Artist and neurodiversity advocate\nDaniel Bartholomaeus is a 21-year-old artist with an innate ability to inspire and motivate others, especially within the neurodiverse community.\nDaniel, who has autism and ADHD, hasn't had an easy time. He's had anxiety since he was young and school was challenging, contributing to him developing depression. In 2022, even though his portfolio had just won him a place at university, his mental health was at its lowest point.\nToday, Daniel is a mentor with The With Friends Initiative, a social group for neurodivergent young people, and has worked with Daydream Machine, the National Gallery of Australia and the United Nations to help young people realise that it's not about what you can't do, but what you can do.\nDaniel uses his art for self-expression, but also to forge common pathways for people with mental ill-health and those of different abilities, bridging the gap between neurotypical and neurodiverse people.\nBrendan Swan - Founder, Concussion Australia\nIn 2014, aged 17, Brendan Swan suffered a significant concussion from his coach (alongside several other concussions in the 18 months beforehand) while training to be a professional Thai boxer. Brendan never fully recovered from those concussions, and a decade on he continues to live with persistent post-concussion symptoms. But now he's using that experience to help others.\nIn 2020, Brendan was also diagnosed with thoracic outlet syndrome, which put his law career on hold as he required six major surgeries. Remarkably, it was during this time that Brendan started Concussion Australia.\nConcussion Australia brings together first-in-class medical experts, lawyers and people affected by concussion. The grassroots charity provides practical education across the board and help to those who need it, including online support groups, educational seminars and referrals, as well as regular engagements with politicians and the media. Brendan, who is CEO and now 28, doesn't take a salary.\nHayley Whatman - Voice for youth\nHayley Whatman, a proud Wiradjuri woman, is a strategic advocate for youth, mob, social justice and ethical accountability.\nHayley's approach, founded on the principles of truth-telling, is committed to amplifying the voices and safeguarding the interests of marginalised youth, families, communities and future generations. She brings her grassroots community service knowledge, social work background and lived experience to her activism.\nHer various positions include co-chair of the ACT Ministerial Youth Advisory Council; ACT representative for the National Aboriginal and Torres Strait Islander Housing Association's inaugural Youth Roundtable; and the director of research and policy at Foundations for Tomorrow - a youth-driven non-profit committed to renewing Australia's leadership, decision-making and governance approaches.\nHayley, 24, draws strength from her own story and her contributions have earned her several accolades, including induction into the 2023 ACT Women's Honour Roll; the 2023 Executive Dean's Award from Charles Sturt University; and a 2022 Young Canberra Citizen of the Year Award.\n2025 ACT LOCAL HERO NOMINEES\nVanessa Brettell and Hannah Costello - Co-owners, Cafe Stepping Stone\nVanessa Brettell (31) and Hannah Costello (32) are harnessing the power of hospitality to lift and empower those most vulnerable in their community.\nTheir business, Cafe Stepping Stone, operates as a social enterprise, employing women mostly from migrant and refugee backgrounds and others who experience significant barriers to employment. The sustainable vegetarian café has two locations which offer culturally and linguistically diverse women employment pathways, on-the-job training and qualifications through partnerships with registered training organisations.\nHannah and Vanessa's inclusive employment practices involve targeting female workers who are the sole income earners in their household, new arrivals to Australia, those with limited English or minimal employment history, and those experiencing homelessness. The employees are supported to gain skills and experience, facilitating their entry or return to the workforce.\nHannah and Vanessa also run a range of events through Stepping Stone, creating a welcoming hub for community to grow, with a focus on social justice and connection.\nDr Madhumita Iyengar - Founder, Initiatives For Women In Need\nDr Madhumita Iyengar's mission started on a personal level - to give her daughters a voice.\nMadhumita is well recognised through her work with Initiatives For Women In Need (IWiN), which she created in 2013. The organisation's focus is helping disadvantaged women and children, including those experiencing discrimination, racism or domestic violence - particularly in culturally and linguistically diverse communities. IWiN is comprised of volunteers from both Indian and Australian backgrounds with policy and research experience.\nIWiN's yearly symposium highlights issues championed by the organisation. Addressing violence against women was on the 2023 agenda; investing in women in STEM is the 2024 focus. IWiN also works for change on a national level, such as the need for a domestic violence services policy framework for migrants from diverse backgrounds.\nMadhumita, 60, is also the chair of the Canberra Multicultural Community Forum, a peak body of ACT's multicultural community organisations, and she has a PhD in economic modelling.\nPamela Muston - Ultramarathon runner\nIt wasn't until Pamela (Pam) Muston was approaching 50 that she decided to run her first ultra marathon. Over a decade on, her track record for distance running is truly awe inspiring.\nPam has completed countless marathons and ultramarathons, including the Sri Chinmoy Canberra 100 Trail and Glasshouse Mountains 100 miler (the only female to have won for three consecutive years). She's taken on and won both the Great Ultra Mediocre Backyarder and the Coast to Kosciusko Ultramarathon.\nPam is also the coordinator of the Kowen Trail Run which takes place twice a year. She's transformed it into a high profile fundraising event to benefit the local rural fire brigade in Wamboin, on the ACT border.\nAt 64, Pam's enthusiasm and encouragement are a positive force in her community, inspiring and motivating women to take up or persevere with distance running. She is unmatched in her athletic endurance, dedication and generosity to others.\nDelfina Shakespear - Gender-equality advocate in women's sport\nDelfina Shakespear is a woman match official in both the Ninja A-League and the Capital Football competitions (soccer). With 99 A-League Women's matches under her belt, she is paving the way for greater female representation, participation and inclusivity in the sport.\nDelfina is heavily involved at Capital Football, advocating to change the culture around respectful behaviours and safe participation environments for all, particularly match officials, via campaigns such as 'We Play as One' and 'Reduce Abuse'.\nA role model showing other women what they, too, can achieve, 33-year-old Delfina also commits her time to mentoring, advocating and leadership. She is an example of what women can aspire to in sport at both national and state levels, on and off the field. In 2019, Delfina was awarded both Capital Football NPL Women's and Men's Referee of the Year, and in 2024, she won the ACT Woman of the Year - Special Commendation Award.\n- ACM, publisher of this masthead, is official media partner of the 2025 Australian of the Year Awards.",
  "word_count": 3081,
  "scraped_at": "2026-02-14T12:10:29.802022"
}