{
  "article_id": "a3164064adc8",
  "url": "https://www.bbc.com/sport/articles/cwypxw44ykxo",
  "title": "World Sport Star of the Year 2025 : Vote for nominees Caldentey , Crawford , Duplantis , McLaughlin - Levrone , Ohtani , Salah",
  "date": "20251209T114500Z",
  "domain": "bbc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sports Personality World Sport Star of the Year contenders\n- Published\nVoting has now closed for the BBC Sports Personality World Sport Star of the Year 2025 award.\nSix contenders were shortlisted for the award, which will be presented during the live show on BBC One on Thursday, 18 December.\nThe 2024 World Sport Star award was won by Swedish pole vaulter Armand Duplantis.\nFind out more below about the contenders.\nWho are the World Sport Star contenders?\nMariona Caldentey\nSport: Football Country: Spain\nSpain midfielder Caldentey enjoyed a stellar first season in English football, with her performances instrumental in Arsenal's march to Champions League glory, beating her former club Barcelona in the final.\nAfter scoring 19 goals in 41 appearances for the Gunners in her first season, Caldentey was named the Professional Footballers' Association women's player of the year and the Women's Super League player of the year.\nCaldentey scored in the Women's Euro 2025 final, which Spain narrowly lost to England on penalties.\nThe 29-year-old was runner-up in the Ballon d'Or award, missing out to compatriot Aitana Bonmati, and was also included in Uefa's Champions League team of the year.\nThe making of Spain and Arsenal's humble magician\n- Published24 August 2025\nArsenal's Caldentey wins WSL player of year award\n- Published11 May 2025\nTerence Crawford\nSport: Boxing Country: United States\nCrawford cemented his status as one of the greatest boxers in history by becoming the first male fighter to be undisputed champion across three weight divisions in the four-belt era.\nThe 38-year-old had to go up two weight classes to face the great Saul 'Canelo' Alvarez at super-middleweight, but secured a unanimous decision in front of a fiercely pro-Mexican crowd in Las Vegas.\nIn claiming the WBA (Super), WBC, IBF, WBO and The Ring belts, the American extended his professional record to 42 straight victories - the past 20 of which have been world title fights.\nHowever, Crawford was stripped of the WBC belt earlier in December, with president Mauricio Sulaiman claiming the American did not pay sanctioning fees.\n'Crawford conquers Canelo to become the face of boxing'\n- Published14 September 2025\nHistory-maker Crawford stuns Canelo in Vegas\n- Published14 September 2025\nArmand Duplantis\nSport: Athletics Country: Sweden\nIn 2025, Sweden's Duplantis once again soared above his rivals to capture a third pole vault World Championship gold.\nIn doing so, he set yet another world record of 6.30m - his fourth of this year alone - and the 14th of his remarkable career.\nHe also retained his indoor world title - meaning he has won eight successive golds in major global competitions - and won all 16 of his events to become the first male pole vaulter in modern history to go undefeated for two successive years.\nIn November, the 26-year-old was named men's world athlete of the year for a third time.\nSydney McLaughlin-Levrone\nSport: Athletics Country: United States\nMcLaughlin-Levrone, the greatest female 400m hurdler of all time, made the switch to the 400m flat at the World Athletics Championships this year, but the result remained the same as she became the first athlete to claim career world titles in both disciplines.\nHer time of 47.78 seconds was the second fastest in history and she came close to breaking a world record that has stood since 1985.\nThe 26-year-old is undefeated across both distances for two years.\nShe added another gold in the 4x400m relay in Tokyo and was named the women's world athlete of the year.\nMcLaughlin-Levrone wins 400m gold with second fastest time in history\n- Published18 September 2025\nDuplantis & McLaughlin-Levrone named world athletes of year\n- Published30 November 2025\nShohei Ohtani\nSport: Baseball Country: Japan\nOn the LA Dodgers' march towards retaining their World Series title, Japanese superstar Ohtani produced one of the greatest individual performances in Major League Baseball history.\nThe rare 'two-way' player, who operates as both a pitcher and a hitter, smashed three home runs and struck out 10 batters against the Milwaukee Brewers.\nThat made him the first pitcher since 1942 to hit three home runs in the same game.\nThe 31-year-old was named as one of baseball's Most Valuable Players for the third straight year, and the fourth time overall, moving him into second on the all-time list.\nOhtani wins fourth Major League MVP award\n- Published14 November 2025\nOhtani rewrites history to send Dodgers to World Series\n- Published18 October 2025\nMohamed Salah\nSport: Football Country: Egypt\nSalah, the 'Egyptian King', scored 29 Premier League goals and broke a host of records as he helped Liverpool to a record-equalling 20th top-flight title in the 2024-25 season.\nHe became the first player to win the Golden Boot, the Playmaker award for most assists and the Premier League player of the season award in the same campaign. He was also named as the PFA men's player of the year for a record third time and collected a third Football Writers' footballer of the year award.\nThe 33-year-old became the highest-scoring overseas player in Premier League history, overtaking Sergio Aguero's mark of 184.\nSalah has scored five goals in 18 appearances for Liverpool so far this season, and on Saturday said he felt like he had been \"thrown under the bus\" by the club and that his relationship with head coach Arne Slot had broken down.\nRelated topics\n- Published13 August 2025\n- Published19 August 2025",
  "word_count": 897,
  "scraped_at": "2026-02-14T12:50:43.781943"
}