{
  "article_id": "a33566633f1f",
  "url": "https://www.farmersjournal.ie/ireland-womens-team-can-take-positives-from-defeat-755986",
  "title": "Ireland women team can take positives from defeat",
  "date": "20230329T231500Z",
  "domain": "farmersjournal.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "While Ireland’s opening TikTok Women’s Six Nations defeat to Wales was obviously very disappointing, there could be a sliver of a positive to take from it.\nA 31-5 loss – with the five coming from a late try by captain Nichola Fryday – was not something that could be put down to bad luck or anything, but it should be borne in mind that Wales are further down the professional route than Ireland, who are only taking their first steps in that regard.\nWhat the game showed is that having a professional set-up will reap benefits – Wales are doing that now and Ireland can hopefully make similar gains. In fairness to coach Greg McWilliams, he didn’t try to sugar-coat it.\n“I’m not going to pretend we are not disappointed,” he said.\n“We have got to own that performance. We know where we are.\n“Wales are a little bit further ahead of us, you can see that in their development, they overpowered us in the first half and we have learned some really valuable lessons.\n“Like anything, you have got to learn from those lessons, create a plan and aim to be better the next time you play.”\nIn terms of the Six Nations, the challenge is that the next time you play comes around pretty quickly, and for Ireland that means a clash with France – who beat Italy, albeit in a close game – at Musgrave Park on Saturday.\nThe home match against England will also take place at the Cork venue. Hopefully it will bring the same luck as it did to the U20 team, who had both of their home games there, too – but would it have been a better idea to also utilise Thomond Park, the Sportsground in Galway, Belfast’s Kingspan Stadium or even Dubarry Park in Athlone?\nWhen the GAA circulated a bulletin outlining discussions at its most recent management committee and central council meetings, among the things mentioned was that a decision had been taken “to prohibit the promotion of charities, campaigns etc. on playing gear; it was felt that there are other ways to promote these without modifying playing gear”.\nI’m sure that you, dear reader, will have a similar reaction to me in being surprised to find that this issue was such a scourge on our Gaelic games landscape.\nJust recently, both Cork hurling and football teams played in jerseys that had the logo of Cork ARC Cancer Support House, with the advertising space generously given over by sponsors Sports Direct.\nThere was nobody at Páirc Uí Chaoimh for the games that day against Westmeath or Limerick who had not been affected by cancer, and the initiative helped to raise funds for a most worthy cause.\nWould it have been as successful without the logo on the jerseys? Perhaps, but the exposure that comes from being seen in newspaper/website action shots and on television should not be underestimated – there is after all a reason why sponsors stump up cash. It feels like this is a classic ‘sledgehammer to crack a walnut’ situation, a blanket ban rather than risking offence by turning down an individual proposal.\nIt’s like the time a motion for Congress called for holes to be drilled in trophies to prevent them being filled with alcohol.\nIn an ideal world, all the counties would come together and wear charity jerseys, inviting punishment for doing so and generating a groundswell of support, but that’s too much to hope for. Ultimately, it’s the charities that will lose out.\nAs the knockout stages of the Heineken Champions Cup commence, three of the 16 sides left are Irish. That could be down to just one by the end of the weekend.\nThere definitely won’t be more than two provinces in the quarter-finals as Leinster clash with Ulster at Aviva Stadium on Saturday evening.\nAll logic points to Leinster winning, but the fact that the format of the competition has changed – sensibly doing away with the two-leg system at this stage – means that Ulster are likely to have a go, if nothing else.\nBy the time the all-Irish clash kicks off, Munster’s fate will be known as their game against the Sharks in Durban in South Africa begins at 1.30pm.\nIt’s a very tall order away to a perennially strong side but, historically, these have been the games that have brought the best out in Munster.\nAlso on Saturday, Connacht go to Italy for a game against Benetton that they should win, but then the beauty of knockout sport is that we just don’t know.\nRarely can there ever have been such a furore over the late addition of a sub goalkeeper to a matchday panel as there was for Dublin’s game against Louth last weekend.\nBut then, Stephen Cluxton isn’t just any other goalkeeper. Drafted in due to an injury crisis, the 41-year-old wasn’t needed, but it was interesting that manager Dessie Farrell said that he hadn’t returned to just sit on the bench.\nIt’s unlikely he will feature for this weekend’s Division 2 final against Derry either, but you never know.\nEspecially now that we are approaching the stage where the upcoming championship takes on more importance than a league game, which doesn’t affect promotion (both Derry and Dublin will be in Division 1 next year).\nEqually, the Division 1 final in Croke Park between Mayo and Galway may feature some shadow-boxing, given that they would meet again in the Connacht semi-final on 22 April if Mayo get over Roscommon in their quarter-final.\nIt could be argued that the most important league final this weekend is the Division 2A hurling decider, as Offaly take on Kildare. The sides finished joint top of the table after recording four wins each and a draw against each other, with the Lilywhites taking the automatic final spot on scoring difference while Offaly beat Kerry in a semi-final.\nFor Kildare to reach Division 1 would represent huge progress for the county, though of course Offaly, for so long one of the top teams, can’t afford to be left behind. It’s a shame that one must lose, but it’s good for the league to have a game of such importance.",
  "word_count": 1036,
  "scraped_at": "2026-02-14T12:25:12.124049"
}