{
  "article_id": "a3357464d6a0",
  "url": "https://dailytrust.com/obaseki-splashes-cash-on-edo-queens-after-heroic-welcome/",
  "title": "Obaseki splashes cash on Edo Queens after heroic welcome",
  "date": "20240531T040000Z",
  "domain": "dailytrust.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Edo State Governor, Mr. Godwin Obaseki, yesterday, doled out cash rewards to the State’s female football team, Edo Queens, after they made history by winning the 2024 Nigeria Women Football League (NWFL) Super Six Championship Playoffs which was held in Yenagoa, Bayelsa State.\nThe victorious ladies who picked the ticket to represent Nigeria in WAFU B Women’s Championship were warmly welcomed back to Edo State amid pomp and pageantry by thousands of football fans and other residents.\nThe jubilant fans, led by the Edo State First Lady, Dr. Mrs. Betsy Obaseki, joined a motorcade of the victorious Edo Queens from Western Boys High School, in Ikpoba-Hill and cheered the team through Aduwawa, Akpakpava, Plymouth, Ring Road and terminated at the Government House, Benin City, where they were received by Governor Obaseki.\nObaseki was joined by the governorship candidate of the Peoples Democratic Party (PDP), Dr. Asue Ighodalo, and other top government officials to receive the triumphant girls.\n- Eriksen completes fairytale return to Denmark’s Euro squad\n- Paris Olympics: Wrestlers open camp in Yenagoa\nThe governor, who praised the team for their excellent campaign at the 2023/2024 season of the Nigeria Women Football League (NWFL) and victory at the Super Six Playoff, assured them of the state government’s sustained support\n“I am so happy and proud today as you have done us proud by bringing this trophy home. The trophy we have been looking for in the past 29 years is now with us. We know you will continue to be champions. I encourage you to work hard as your government and Governor will continue to support you.\n“Whether I am here or not, the person that will replace me will continue to support you. You have tried and have made us proud. Money alone can’t do it all but we will give you money for a job well done and for making us proud.”\nThe governor, therefore, announced a cash reward of N1m to each of the players while the coaches will share N5m.\nIt will be recalled that Edo Queens against all odds finished top of the Super 6 playoff table with 10 points from four matches.\nRivers Angels, Heartland, Nasarawa Amazons, Confluence Queens and hosts Bayelsa Queens were the other clubs in the title deciding tournament.\nUPDATE NEWS:\nNigerians can now invest ₦2.5 million on premium domains and profit about ₦17-₦25 million. All earnings paid in US Dollars. Rather than wonder, click here to find out how it works.",
  "word_count": 413,
  "scraped_at": "2026-02-14T12:48:01.779185"
}