{
  "article_id": "a36247abfc4d",
  "url": "https://dailynews.co.tz/yanga-simba-derby-fever-blinds-nation-as-singida-jkt-and-simbu-quietly-win-everything-else/",
  "title": "Yanga - Simba derby fever blinds nation as Singida , JKT and Simbu quietly win everything else",
  "date": "20250921T124500Z",
  "domain": "dailynews.co.tz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Yanga-Simba derby fever blinds nation as Singida, JKT and Simbu quietly win everything else\nDAR ES SALAAM: IN Tanzania there are football tournaments and then there are Tanzanian football tournaments.\nAnd in between, there are tournaments that simply get swallowed whole by that small god of all sports gods the Yanga vs Simba derby.\nPoor CECAFA Kagame Cup 2025 fell precisely into that trap.\nI mean, few even noticed it had kicked off, for the nation was transfixed listening, smelling, chanting and quite literally mouthing the derby for a full fortnight.\nThe small god does not allow distractions, you know…\nWhich is tragic, because in the middle of the fog, Singida Black Stars FC went and lifted their first-ever Kagame Cup after beating Sudan’s Al Hilal SC 2–1 in the final at KMC Stadium.\nAnd JKT Queens, bless them, picked up the women’s version of the trophy with a slim but glorious 1–0 over Rayon Sports.\nTwo Tanzanian clubs, two continental titles, both tucked under the rug by the thundering drum of Yanga–Simba.\nYou’d think the nation would break into song and dance, perhaps compose a few taarab verses, or at least give the players a grand motorcade ride through Sam Nujoma Road.\nInstead, nothing but silence and faint applause, drowned out by radio jingles promising yet another ‘explosive derby showdown’ at Benjamin Mkapa.\nAnd let’s be clear, here: it wasn’t even the league!\nThe match that devoured national attention was only a charity shield game, the sort of glorified curtain-raiser worth nobody-knows-what and nothing more.\nA curtain-raiser, mind you, for the actual NBC 2025/26 league season, which had not yet begun.\nBut try telling that to a Tanzanian fan in derby week, you may as well whisper into the Indian Ocean – if not Lake Tanganyika or Lake Victoria – and expect an echo back.\nTo the faithful, which is almost the whole country, be it a charity shield or Champions League final, the Yanga-Simba derby is the alpha and omega.\nBread may run out, power cuts may strike, even petrol queues may grow long, but nothing comes between a Tanzanian and the derby.\nIt didn’t help that CECAFA was relegated to Mwenge’s Kinondoni Municipal Council (KMC) Stadium.\nTo the average local football romantics, staging an international tournament there is tantamount to turning it into an Ndondo Cup sideline, that street football with fancier boots.\nThe Ndondo Cup, for the uninitiated, is Tanzania’s unofficial grassroots World Cup, held annually in neighbourhood pitches, producing both legends and lifelong knee injuries.\nBut for a continental tournament like CECAFA to be staged at Mwenge? Unthinkable!\nEven Azam Complex at Chamazi, with its comfortable stands and modern turf, suffers the same indignity: it is not Benjamin Mkapa Stadium and therefore it cannot possibly matter.\nAnd just when you thought the neglect couldn’t get any more glaring, the Wachambuzi our beloved pundits decided CECAFA wasn’t worth their breath.\nThese armchair analysts, many of whom never even featured in their school teams, now speak with more authority than Arteta, Mourinho and every European coach rolled into one.\nAfter derby day, they had bigger fish to fry: the suspiciously offside Yanga goal, the endlessly recycled question of why the referee wasn’t a foreigner as agreed?\nOr whether Simba might have boycotted had the stadium gatekeeper forgotten to polish the nets.\nThat’s why it took them two full days to notice there was a world beyond the derby.\nBy then, CECAFA had already crowned the champions and packed up its banners.\nMeanwhile, Singida and JKT went about their business, like children ignored at a family party.\nThe ones who win a spelling bee while all the attention goes to their noisy cousins playing wrestling in the backyard.\nTheir victories deserved fireworks, headlines, perhaps even a presidential tweet, but they got little more than a polite nod. A crying shame.\nAnd then came Alphonce Felix Simbu. Oh, jamani, Simbu!\nTanzania’s marathon maestro, sprinting through Tokyo’s streets at the World Athletics Championships, his lungs burning, his heart pounding, his strides steady as a metronome.\nIn a sensational finish inside the Japan National Stadium, the army sergeant crossed the finish line just ahead of Germany’s Amanal Petros to win the world title in 2:09:48.\nSimbu’s world gold is the first-ever won by a Tanzanian athlete in track & field.\nThe kind of victory entire nations seize upon to baptise newborns, rename streets and compose new national anthems.\nBut alas, Simbu had the terrible misfortune of winning his medal in the same week as the Yanga–Simba derby.\nHis triumph surfaced in whispers, not headlines.\nEven the loudest, most know-it-all wachambuzi only admitted two days later, after Yanga had beaten Simba for the sixth straight time, that Simbu had in fact made the nation proud.\nWhy the delay? Because their piles of derby content buried everything else.\nPages of statistics on who scored most goals since the two team’s births in the 1930s, countless conspiracy theories about referee bias.\nEven endless debates on whether Yanga’s new kit colour gives them supernatural advantage. It all came first.\nAthletics, or any other game but the ‘Dabi’ in this hierarchy, is mere background noise.\nFor a bit of perspective, consider how others treat their heroes.\nIn Botswana, Letsile Tebogo won that country’s first-ever Olympic gold in Paris 2024.\nPresident Mokgweetsi Masisi declared a half-day holiday.\nTebogo got a hero’s parade, his face on a 50-pula banknote, a handshake with Pope Francis and the Best Male Athlete Award at the ANOCs. Meanwhile, Simbu received…well, silence. In Tanzania, no derby means no news.\nYou could run across the Great Wall of China in a Tanzanian vest, but if it coincides with Yanga vs Simba, best believe you will trend only on family WhatsApp groups.\nYou see, this is the bizarre reality of Tanzanian sports.\nThe derby has grown into a small god, demanding sacrifices of attention and ignoring all else.\nAnd the powers that be, who also join in the ICU of derby sickness, are too busy looking for ways to please the 60 million-plus population.\nThat includes making Mama happy too, because she called to say she is watching.\nThere is an increasingly loud cry that the powers that be should devise strategies not only to balance the sporting scales but also to honour our Simbus in any way possible.\nThe derby has grown into a small god, demanding sacrifices of attention and ignoring all else.\nCECAFA, Simbu, even the weather forecast – everything bows before its might.\nOne cannot even fault the pundits too much; their very livelihoods depend on the derby.\nWithout it, what would they argue about on their boringly long daily and nightly shows?\nThe derby provides endless oxygen for their debates, even if some of them never made it past the school reserves bench.\nAnd so, poor CECAFA, poor Simbu.\nIf not for Azam beaming the CECAFA games live and WhatsApp forwarding medals in bulk, we might never have known.\nThe Kagame Cup went uncelebrated, the historic world marathon gold unrecognised.\nAnd that, in a nutshell, is the state of Tanzanian football fandom: trophies and triumphs mean little when the derby god is awake.\nWhat a shame and yet, what a story.\nThat is, in Tanzania, you can conquer Africa, you can conquer the world, but unless you conquer Simba or Yanga, do not expect the drums to beat in your honour.\nHow to Break the feted Yanga vs Simba derby Syndrome – without losing your mind?\nWell, allow me to introduce my Tanzanian Derby Detox Programme (TDDP) tips…\nFirst things first: accept that the nation’s obsession with Yanga vs Simba is not a football problem, it’s a public health issue.\nStep one, introduce mandatory football diversity weeks. Every household must watch at least one Singida Black Stars, JKT Queens, or Azam FC game without flinching.\nBonus points for applauding a corner kick.\nSecond, bribery of the eyeballs works wonders.\nOffer free maize, airtime, or small goats to anyone who can name the CECAFA winners before the derby.\nSuddenly, eyes would wander from Mkapa Stadium and a few more people may discover that yes, Tanzania does have other teams.\nThird, leverage social media memes. Picture a Yanga fan facepalming while Simbu crosses the finish line, or a Simba supporter crying with joy as JKT Queens lift their trophy.\nFinally, normalise random wins.\nThe odd Azam goal, a Singida victory, even a marathon gold let it flash in every news feed.\nGradually, Tanzania will realise that kumbe life and sport exists beyond the derby.",
  "word_count": 1422,
  "scraped_at": "2026-02-14T12:36:42.654601"
}