{
  "article_id": "a375fda9cb55",
  "url": "https://www.winnipegfreepress.com/world/2025/11/22/ap-news-in-brief-at-1204-a-m-est-385",
  "title": "AP News in Brief at 12 : 04 a . m . EST – Winnipeg Free Press",
  "date": "20251123T054500Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "AP News in Brief at 11:04 p.m. EST\nAdvertisement\nIn Geneva, US and Ukraine officials report progress on ending Russia's war but offer few specifics\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nIn Geneva, US and Ukraine officials report progress on ending Russia's war but offer few specifics\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nIn Geneva, US and Ukraine officials report progress on ending Russia’s war but offer few specifics\nGENEVA (AP) — Top U.S. and Ukrainian officials said Sunday they’d made progress toward ending the Russia-Ukraine war but provided scant details after discussing the American proposal to achieve peace that has sparked concerns among many of Washington’s European allies that the plan is too conciliatory to Moscow.\nU.S. Secretary of State Marco Rubio said high-stakes talks in Geneva were “very worthwhile” and constituted the most productive day in “a very long time.”\n“I feel very optimistic that we can get something done,” Rubio said.\nBut he offered very little information on what was discussed. He also downplayed a Thursday deadline set by President Donald Trump for Ukraine to respond to the plan, saying simply that officials want to see fighting stop as soon as possible and that officials could keep negotiating Monday and beyond. He said that higher-level officials may eventually have to get involved.\n“This is a very delicate moment,” Rubio said of what still needed to be worked out. “Some of it is semantics, or language. Others require higher-level decisions and consultations. Others, I think, just need more time to work through.”\n___\nIsrael says it killed a senior Hezbollah official in its first strike on Beirut in months\nHARET HREIK, Lebanon (AP) — Israel on Sunday struck Lebanon’s capital for the first time since June, saying it killed Hezbollah’s chief of staff Haytham Tabtabai and warning the Iran-backed militant group not to rearm and rebuild a year after their latest war.\nThe strike in Beirut’s southern suburbs killed five people and wounded 25 others, Lebanon’s Health Ministry said.\nHezbollah confirmed Tabtabai’s death. Earlier it said the strike, launched almost exactly a year after a ceasefire in the Israel-Hezbollah war, threatened an escalation of attacks — just days before Pope Leo XIV is scheduled to visit Lebanon on his first foreign trip.\n“We will continue to act forcefully to prevent any threat to the residents of the north and the state of Israel,” Israeli Defense Minister Israel Katz said. The military instructed residents in northern Israel near the Lebanese border to continue with daily routines, indicating that it did not anticipate a military response from Hezbollah.\nIsraeli Prime Minister Benjamin Netanyahu accused Tabtabai of leading Hezbollah’s efforts to rearm.\n___\nAftermath of Chicago’s intense immigration crackdown leaves lawsuits, investigations and anxiety\nCHICAGO (AP) — Chicago has entered what many consider a new uneasy phase of a Trump administration immigration crackdown that has already led to thousands of arrests.\nWhile a U.S. Border Patrol commander known for leading intense and controversial surges moved on to North Carolina, federal agents are still arresting immigrants across the nation’s third-largest city and suburbs.\nA growing number of lawsuits stemming from the crackdown are winding through the courts. Authorities are investigating agents’ actions, including a fatal shooting. Activists say they are not letting their guard down in case things ramp up again, while many residents in the Democratic stronghold where few welcomed the crackdown remain anxious.\n“I feel a sense of paranoia over when they might be back,” said Santani Silva, an employee at a vintage store in the predominantly Mexican neighborhood of Pilsen. “People are still afraid.”\nFor more than two months, the Chicago area was the focus of an aggressive operation led by Gregory Bovino, a Border Patrol commander behind similar efforts in Los Angeles and soon Louisiana.\n___\nBig changes to the agency charged with securing elections lead to midterm worries\nMINNEAPOLIS (AP) — Since it was created in 2018, the federal government’s cybersecurity agency has helped warn state and local election officials about potential threats from foreign governments, showed officials how to protect polling places from attacks and gamed out how to respond to the unexpected, such as an Election Day bomb threat or sudden disinformation campaign\nThe agency was largely absent from that space for elections this month in several states, a potential preview for the 2026 midterms. Shifting priorities of the Trump administration, staffing reductions and budget cuts have many election officials concerned about how engaged the Cybersecurity and Infrastructure Security Agency will be next year, when control of Congress will be at stake in those elections.\nSome officials say they have begun scrambling to fill the anticipated gaps.\n“We do not have a sense of whether we can rely on CISA for these services as we approach a big election year in 2026,” said Minnesota Secretary of State Steve Simon, a Democrat who until recently led the bipartisan National Association of Secretaries of State.\nThe association’s leaders sent a letter to Homeland Security Secretary Kristi Noem in February asking her to preserve the cybersecurity agency’s core election functions. Noem, whose department oversees the agency, replied the following month that it was reviewing its “funding, products, services, and positions” related to election security and that its services would remain available to election officials.\n___\nMamdani stands by Trump criticism despite friendly White House meeting\nWASHINGTON (AP) — New York City Mayor-elect Zohran Mamdani didn’t back down in an interview that aired Sunday from past criticism that President Donald Trump acted like a despot and a fascist after a surprisingly friendly White House meeting between the two men.\nThe newly elected democratic socialist and the Republican president have fiercely criticized each other in the past. Trump called Mamdani a “100% Communist Lunatic” in a social media post following the incoming mayor’s election victory, and Mamdani has said Trump was attacking democracy. Yet the two political foils emerged smiling after the meeting Friday and spoke of shared goals.\nPressed about his past criticism during a “Meet the Press” interview conducted Saturday, Mamdani said his views remained unchanged.\n“Everything that I’ve said in the past, I continue to believe,” Mamdani said. “And that’s the thing that I think is important in our politics, is that we don’t shy away from where we have disagreements, but we understand what it is that brings us to that table, because I’m not coming into the Oval Office to make a point or make a stand. I’m coming in there to deliver for New Yorkers.”\nTrump had brushed aside Mamdani’s criticisms Friday and even jumped in on his defense several times. When a reporter asked if Mamdani stood by his comments that Trump is a fascist, Trump interjected before Mamdani could fully answer the question.\n___\nPope calls on kidnappers in Nigeria to free 265 students and teachers after some pupils escape\nABUJA, Nigeria (AP) — Fifty of the 303 schoolchildren abducted from a Catholic school in north-central Nigeria’s Niger state have escaped captivity and are now with their families, the school authority said Sunday, as the pope called for the immediate release of those still missing.\nThe schoolchildren, aged between 10 and 18, escaped individually between Friday and Saturday, according to the Most Rev. Bulus Dauwa Yohanna, chairman of the Christian Association of Nigeria in Niger state and the proprietor of the school.\nA total of 253 schoolchildren and 12 teachers are still being held by the kidnappers, Yohanna said in a statement. “We were able to ascertain this when we decided to contact and visit some parents,” he added.\nMeanwhile, 38 worshippers kidnapped during a deadly church attack in central Nigeria’s Kwara state have regained their freedom, Kwara Gov. AbdulRahman AbdulRazaq said in a statement.\nGunmen had attacked the Christ Apostolic Church in Kwara’s Eruku town on Tuesday, killing two people and taking others hostage. Nigeria’s President Bola Tinubu, in a separate statement, attributed the freedom of the worshippers to “the efforts of security agencies” without giving further details.\n___\nA sheriff, a billionaire, a tinge of scandal. California governor’s race packs drama, uncertainty\nLOS ANGELES (AP) — The race for California governor features former presidential wannabes, a county sheriff, two women who could become the first female to hold the office, House members current and former, an ex-Cabinet secretary and at least one billionaire with another in the wings. The contest has been singed by scandal and witnessed one campaign nearly melt down.\nAnd it hasn’t officially started yet.\nThe pending exit of term-limited Gov. Gavin Newsom has created the most wide-open and crowded field for the state’s highest office in memory. The job pays $242,000 a year but provides an arguably more valuable national political platform and the ability to engage in trade, climate and other global affairs. By default the California governor, in a state of nearly 40 million people, is a national figure. Newsom is widely expected to launch a White House run after the Democrat’s term ends in early January 2027.\nThe lure of the powerful job attracted its latest candidate Thursday — Democratic Rep. Eric Swalwell, who served as a House manager in President Donald Trump’s 2021 impeachment trial and briefly sought his party’s 2020 presidential nomination.\nThe eventual winner will also inherit a long list of problems, from an unchecked homeless crisis to multibillion-dollar projected future budget gaps.\n___\nThe G20 summit in South Africa ends with the glaring absence of the US after Trump’s boycott\nJOHANNESBURG (AP) — The Group of 20 summit in South Africa ended Sunday with the glaring absence of the United States — the next country to lead the bloc — after the Trump administration boycotted the two days of talks involving leaders of the world’s richest and top developing economies.\nSouth African President Cyril Ramaphosa declared the summit in Johannesburg closed by banging a wooden gavel on a block like a judge would, in a G20 tradition. The gavel would normally be handed over to the leader of the next country to hold the rotating presidency, but no U.S. official was there to receive it.\nThe world’s biggest economy boycotted a summit meant to bring rich and developing nations together over President Donald Trump’s claims that South Africa is violently persecuting its Afrikaner white minority.\nThe White House said it intended in a last-minute decision for an official from its embassy in South Africa to attend the G20 handover. But South Africa refused that, saying it was an insult for Ramaphosa to hand over to a junior embassy official. In the end, no U.S. delegation was accredited for the summit, according to the South African Foreign Ministry.\nSouth Africa said the handover would happen later, possibly at its foreign ministry. Trump has said the U.S. will hold next year’s summit at his golf club in Doral, Florida.\n___\nTakeoff of China’s flying taxis hits turbulence\nHONG KONG (AP) — An unmanned, oval-shaped craft from flying taxi maker EHang hovers, whirring noisily like a mini-helicopter over a riverside innovation zone on the outskirts of the southern Chinese business hub of Guangzhou, part of a trial of a mini-flying taxi that once might have been found only in sci-fi films.\nIn nearby Shenzhen, food-delivery drones already are part of daily life and a novelty attraction for tourists, even if such services cost more. In the waterfront park surrounded by high-rises, Polish tourist Karolina Trzciańska and her friends ordered bubble tea and lemon tea by phone, just to give it a try. Their drinks arrived via a drone buzzing through the drizzle about 30 minutes later.\n“This is the first time I’m seeing something like this, so it was super fun to see the food being delivered by the drone,” she said.\nSuch businesses are growing quickly with support from the government, though the take off of the so-called “low-altitude economy” faces obstacles such as strict airspace controls and battery limitations.\nActivities in airspace below 1,000 meters (about 3,280 feet) accounted for business turnover worth 506 billion yuan ($70 billion) in 2023, about 0.4% of China’s economy. By 2035, it’s expected to hit 3.5 trillion yuan (about $490 billion), said Zhang Xiaolan, a researcher at the State Information Center, a think tank affiliated with China’s main planning agency.\n___\nChristmas tree retailers find lots to like at a Pennsylvania wholesale auction\nMIFFLINBURG, Pa. (AP) — Christmas went on the auction block this week in Pennsylvania farm country, and there was no shortage of bidders.\nAbout 50,000 Christmas trees and enough wreaths, crafts and other seasonal items to fill an airplane hangar were bought and sold by lots and on consignment at the annual two-day event put on at the Buffalo Valley Produce Auction in Mifflinburg.\nBuyers from across the Northeast and mid-Atlantic were there to supply garden stores, corner lots and other retail outlets for the coming rush of customers eager to bring home a tree — most commonly a Fraser fir — or to deck the halls with miles of greenery.\nBundled-up buyers were out in chilly temperatures to hear auctioneers hawk boxes of ornaments, bunches of winterberry, cotton branches, icicle lights, grave blankets, red bows and tree stands. It was nearly everything you would need for Christmas except the food and the presents.\nAmericans’ Christmas tree buying habits have been evolving for many years. These days homes are less likely than in years past to have a tree at all, and those that do have trees are more likely to opt for an artificial tree over the natural type, said Marsha Gray with the Howell, Michigan-based Real Christmas Tree Board, a national trade group of Christmas tree farmers.",
  "word_count": 2457,
  "scraped_at": "2026-02-14T14:20:45.697974"
}