{
  "article_id": "a37e88788663",
  "url": "https://www.90min.com/posts/sarina-wiegman-how-lionesses-can-grow-world-cup-defeat",
  "title": "Sarina Wiegman already looking at how Lionesses can  grow  after World Cup defeat",
  "date": "20230821T174500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sarina Wiegman already looking at how Lionesses can 'grow' after World Cup defeat\n- England lost the 2023 Women's World Cup final to Spain\n- Sarina Wiegman looking at ways the Lionesses can \"grow\"\n- Next tournament in the Nations League from September\nEngland manager Sarina Wiegman already has her eye on future tournaments and where the Lionesses can \"grow\" after finishing as runners-up at the 2023 Women’s World Cup.\nWiegman guided England to a maiden international trophy at last summer’s European Championship, before steering the Lionesses to a first ever World Cup final against the odds – three key players missed the tournament through injury amid other setbacks during.\nAs many as 14 of the current squad will be 30 or younger by the time of the 2027 World Cup, while Leah Williamson will too turn 30 that year. England will also have an opportunity to defend their continental title at Euro 2025 and there are others like Maya Le Tissier, 21, Emily Ramsey, 22, Lucy Parker, 24, Jess Park, 21, and Ebony Salmon, 21, who could become more involved.\nWiegman herself is under contract with England until 2025 and FA chief executive Mark Bullingham has already confirmed a hypothetical approach from the United States would be rejected.\nIn the shorter-term, England have the new Nations League to contend with from as soon as next month - and that tournament also doubles as a qualifying event for the 2024 Olympics, where Great Britain teams have previously been organised and managed by the FA and England setup.\n\"We've shown there is a lot of talent in this team and we have shown there are also areas in which to grow,\" Wiegman told Lionesses: Down Under presenter Kyle Walker in a final interview before leaving Australia. \"We had some injuries where players stepped up. Participating in a tournament for the first time is such a big thing to have in the bag to move forwards with to the next tournament.\"\nREAD THE LATEST LIONESSES WOMEN'S WORLD CUP 2023 NEWS HERE\nWiegman, who guided Netherlands to second place in the 2019 World Cup, revealed she is \"very disappointed\" not to go all the way and beat Spain to lift the trophy. But pride is her overriding feeling.\n\"Most of all, I'm proud of the team. Considering how we performed during the tournament and all the challenges we faced before and during the tournament, how we grew into the tournament, and we stuck together to play our best game, I think we've done really well.\n\"Before the tournament we had a lot of challenges and then in the tournament we had challenges. The team adapted all the time and showed resilience. It's such a pleasure to work with this group. There's so much commitment and eagerness to improve and to grow and do better every single day.\"\nThe tournament reinforced the general growth of women's football, with a cumulative attendance of close to two million. Back home, the final was the BBC’s most watched television event of 2023 so far after only the coronation of King Charles III. On the pitch, it was also more competitive than ever, with the gaps between the top teams and the rest now smaller than ever.\n\"The level of the game has improved so much, in physicality, in a technical way, the tactical way, and every country needs to step up to stay at the top,\" Wiegman said.\n\"The countries just beneath the top are getting closer and closer and I just hope that worldwide, people will have seen it and the people who are responsible now say, 'Okay, we have to take the women's game to the next level and we are now going to give it a boost.'\"",
  "word_count": 623,
  "scraped_at": "2026-02-14T13:26:08.199036"
}