{
  "article_id": "a380380d839e",
  "url": "https://www.nytimes.com/athletic/6813827/2025/11/17/ashes-australia-boland-doggett-indigenous-history/",
  "title": "Scott Boland and Brendan Doggett aim to make history for Australia in Ashes opener",
  "date": "20251118T041500Z",
  "domain": "nytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Scott Boland is hoping history will be made by Australia even before a ball is bowled at the first Ashes Test in Perth.\nShould Boland and fellow quick bowler Brendan Doggett make the XI for the hosts against England on Friday, it will be the first time Australia have named two indigenous players in the same Test team.\nAdvertisement\nAs it is, Doggett would become only the third First Nations man to wear the Baggy Green — the first being another paceman, Jason Gillespie, who featured in 71 Tests over a decade following his debut in 1996.\nTwo indigenous women have also represented Australia in Test cricket. All-rounder Ash Gardner is an established star of the current team, but Faith Thomas was the trailblazer. She became the first Aboriginal woman to represent Australia in any sport in 1958.\n“Hopefully Brendan does get the nod and that happens,” said Boland, speaking at a press conference on Monday at Perth Stadium, ahead of the opening Ashes Test. “It’s going to be really special for him, his family and the Australian indigenous community.\n“It just gives kids a real pathway they can see (with) two guys playing. You watch AFL (Australian Rules Football) or NRL (National Rugby League) and there’s numerous guys playing in the same team or playing for Australia.\n“If they can see there’s two guys playing, hopefully they want to take that step into playing cricket because it’s not as big in the indigenous communities as AFL and rugby league. Hopefully we can try and shift it there.”\nDoggett has been included in previous Australia tours and made the cut for Australia’s initial 15-man Ashes squad for the first Test. Injuries to fellow bowlers Josh Hazlewood and Sean Abbott, plus the delayed comeback of captain Pat Cummins, have since improved Doggett’s prospects of making his Test debut.\nIf selected, it will see Boland and Doggett play alongside each other just as they did in Australia’s Indigenous XI that toured England in 2018, to commemorate 150 years since a First Nations team first played in the United Kingdom.\n“We opened the bowling together then,” added Boland. “One of us will be trying to get the new ball in front of the other one for this week, if he plays, but yeah, it’s going to be a pretty cool one.\nAdvertisement\n“One of Pat’s greatest strengths as captain is that he brings everyone together really well. He’s one of those guys who wants to get to know you. Doggy’s been around … so it’s not like he’s a brand new face to the group. Come game day, I’m sure he’ll be nervous like a lot of guys who debut or are playing their first game for a while. Hopefully he can settle in pretty quickly.”\nBoland has his own special history with the Ashes, blowing England away with a six-wicket haul in Melbourne on his Test debut in 2021. He boasts 62 wickets from his 14 Tests at an impressive average of only 16.53, with 49 of those coming in Australia (at 12.63). This will be his third Ashes series.\n“There’s so much history behind it,” said Boland. “Two great sporting nations going head to head and I’ve been looking forward to this series for a long time.”\nAustralia began training together at Perth Stadium on Tuesday but are only expected to confirm their team on the morning of the first Test.",
  "word_count": 570,
  "scraped_at": "2026-02-14T14:20:55.913067"
}