{
  "article_id": "a3829756e1df",
  "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/paul-doyle-jailed-more-20-33063315",
  "title": "Paul Doyle jailed for more than 20 years for ploughing car into crowd at Liverpool parade",
  "date": "20251216T154500Z",
  "domain": "liverpoolecho.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Paul Doyle jailed for more than 20 years for ploughing car into crowd at Liverpool parade\nThe 54-year-old drove his vehicle into more than 100 men, women and children, leaving them with broken bones, gruesome wounds and lasting psychological harm\nPaul Doyle was today jailed for 21 years and six months after causing scenes of horror and devastation during Liverpool FC's Premier League title parade. The 54-year-old, of Burghill Road in West Derby, admitted a total of 31 charges on the day he was due to stand trial, having ploughed his car into crowds of fans during the celebrations earlier this year.\nMore than 100 pedestrians, ranging from babies to a 78-year-old woman, were hurt after being struck by the Ford Galaxy on Water Street in Liverpool city centre as what was meant to be a day of joy turned into scenes of terror. Fifty casualties required hospital treatment in the aftermath of the appalling incident, having been left with broken bones, gruesome wounds and degloving and spinal injuries.\nMany were also left with lasting and profound psychological harm as a result of the sickening scenes which unfolded before their very eyes. Doyle dramatically changed his pleas last month, moments before he was due to face a jury at Liverpool Crown Court.\nHis sentencing has been taking place over the course of the past two days. Appearing in the dock this afternoon, Tuesday wearing a black suit over a white shirt and grey tie, he briefly closed his eyes then stared straight ahead as he learned how long he will spend behind bars.\nSentencing, the Honorary Recorder of Liverpool Judge Andrew Menary KC said: \"The events of the 26th of May 2025 were meant to be a day of great civic pride for the people of Liverpool. Liverpool Football Club had secured its 20th Premier League title, and tens of thousands of people men and women, parents with prams, and children perched on shoulders filled the city centre to celebrate the victory parade.\n\"You drove your Ford Galaxy, weighing nearly two tonnes, from your home towards the city centre in order to collect friends whom you had dropped off earlier. For no reason other than impatience and arrogance, your driving into the city was routinely dangerous.\n\"In poor weather conditions, you repeatedly undertook other vehicles at speed. You approached road hazards too quickly, and you drove through traffic lights at a busy junction when they were clearly showing red.\nClick here to read about the hero who stopped the parade attacker and click here to read how Paul Doyle bit off a sailor's ear in the pub.\n\"You entered Dale Street at 5.54pm, traveling against the flow of dispersing fans. From the outset, your driving was aggressive and dangerous. You frightened pedestrians, leaning on your horn and shouting obscenities such as 'get out of the f***ing way'.\n\"Between 5.59pm and 6.01pm, a mere two minutes, you used your vehicle in a manner that turned it into a weapon, driving deliberately into and over more than 100 people on Dale Street and Water Street. You paused twice during this rampage. Each time, you could have stopped, but you chose to continue, revving the engine and ignoring the screams and chaos around you.\n\"The footage is truly shocking. It is difficult, if not impossible, to convey in words alone the scene of devastation you caused. It shows you quite deliberately accelerating into groups of fans time and time again. You struck people head-on, knocked others onto the bonnet, drove over limbs, crushed prams and forced those nearby to scatter in terror. You ploughed on, at speed and over a considerable distance, violently knocking people aside or simply driving over them, person after person after person.\n\"You accelerated forwards and backwards repeatedly. Several victims became trapped beneath the vehicle as you continued to move it. Others were thrown into the air or propelled across the ground. A number of witnesses, including serving police officers, describe you continuing to press the accelerator, even when people were visibly underneath the car. Your shouted expressions of frustration underline your state of mind at the time, not fear or panic but an inexplicable and undiluted fury.\n\"Your vehicle only came to a halt on Water Street due to the heroic actions of a member of the public, Daniel Barr, who jumped into the back seat and shifted the automatic gear selector to park, combined with the sheer number of bodies trapped beneath it. Even then, witnesses, including those pinned under the car, heard you continuing to depress the accelerator, attempting to drive on. His actions prevented further injury and may well have saved lives.\nRead how a mum told Paul Doyle not to sit in the dock and cry for himself and read about the woman who survived the Manchester Arena bombing only to be hit by Paul Doyle's car\n\"It is almost impossible to comprehend how any right-thinking person could act as you did. To drive a vehicle into crowds of pedestrians with such persistence and disregard for human life defies ordinary understanding.\n\"This was not a terrorist attack, as some feared at the time, nor was it caused by any mechanical defect in the vehicle. You were not under the influence of drugs or alcohol, and you were an experienced driver familiar with the car.\n\"You claimed in police interviews to have acted in panic and fear for your life due to the crowd's behaviour. That account was demonstrably false. The position should be stated clearly. The crowd did not cause this incident. They reacted to it.\n\"Faced with a vehicle being driven directly at them, accelerating, reversing and striking multiple people, they had no idea who you were, why you were driving in that manner or whether this was a deliberate attack of an even more serious nature. Their responses, including shouting, striking the vehicle and, in some cases, breaking windows, were the instinctive actions of frightened people trying to protect themselves and others, desperate to stop a moving threat they could not understand.\n\"Those actions were not acts of aggression. They were acts of fear. The chaos that unfolded was caused solely by your driving, and any attempt to place responsibility on the public or the Liverpool supporters present would be unfair and wholly unfounded.\n\"Your actions caused horror and devastation on a scale not previously encountered by this court. The indictment identifies 29 victims in counts three to 31, but that figure significantly understates the true extent of the harm. Parents and children, police officers, grandparents, students, tourists and passers by were all caught up in events which many believed, in the moment, to be a mass casualty terror attack.\n\"What should have been a day of communal celebration has instead left a lasting legacy of fear, injury and loss across this community. The overall harm is exceptional, not only in the sheer number of victims and the seriousness of their injuries, but also in the depth, duration and human reach of the trauma you inflicted.\n\"Families were separated in the chaos. Parents were convinced their children had been killed. Children saw their parents unconscious or bleeding, and many people searched desperately for loved ones, not knowing whether they were alive.\n\"The offences you have admitted were not the result of momentary recklessness or a panicked reaction. The truth, as captured on your own dashcam and multiple CCTV and mobile phone recordings, is that you lost your temper in a rage, determined to force your way through the crowd, regardless of the consequences. By your pleas of guilty, you admit that you intended to cause serious harm to achieve that end, even to children.\"\nPaul Greaney KC, prosecuting, previously told the court: “On the 27th of April 2025, Liverpool FC beat Tottenham Hotspur 5-1 to reach a points total in the Premier League that was unassailable. In becoming champions, the club achieved its 20th title.\n“The city of Liverpool wished to celebrate the club’s achievement, and a parade was therefore arranged for the 26th of May 2025, the spring bank holiday. This was to involve the players and staff travelling in an open top bus on a route that started at Allerton Maze in South Liverpool and travelled through the suburbs of the city before ending outside the Liver Building on the Strand, next to the River Mersey.\n\"Hundreds of thousands of people, probably about a million in total, attended to watch and cheer. To begin with, this was a day of great joy. Following its arrival, many of those who had waited on the Strand to cheer began to walk up Water Street towards Dale Street in order to make their way home. The road therefore became extremely busy with pedestrians who were spread across both pavements and the road.\n“As the parade was finishing, the defendant, Paul Doyle, was driving his grey Ford Galaxy Titanium from his home into central Liverpool in order to pick up friends who had attended the parade. His vehicle weighed nearly two tonnes.\n“The defendant drove the Galaxy onto Dale Street at 5.54pm and began to travel in the direction of Water Street, so on a course opposite from the direction of travel of most of the fans and towards them. From an early stage, Paul Doyle drove dangerously along that road, frightening people as he did so.\n\"Then at 5.59pm, he encountered some traffic implementation measures that were filtering vehicles off to the right. He came to halt, but, shortly afterwards, set off down the left side of Dale Street towards Water Street, ignoring the measures.\n\"By 6.01pm, less than two minutes later, the Galaxy was stationary on Water Street, and attempts were being made by fans to drag Paul Doyle from it. He was quickly protected by police officers, and thereafter arrested and detained, having sustained only minor injuries.\n“What had happened in that short period between 5.59 pm and 6.01pm is that the defendant had driven his vehicle into a collision with well over 100 people, causing injuries including serious injuries to many and, when the vehicle was brought to a halt, people including children were trapped beneath it. The prosecution case is that the defendant had used the vehicle as a weapon over that period of time. In doing so, he not only caused injury on a large scale, but also generated horror in those who had attended what they had thought would be a day of joyfulness.\"\nMr Greaney, assisted by Philip Astbury, continued: \"It is important at the outset to explain what did not cause Paul Doyle, then a 53-year-old family man who lived a short distance from the city centre to behave in this way. At the time of these events, some at the scene thought that what was taking place was a terrorist attack, with the driver utilising a vehicle to attack in a way that has occurred before; for example, during the London Bridge attack on the 3rd of June 2017.\n“That is not what occurred. Paul Doyle’s actions were, the prosecution is entirely satisfied, not driven by ideology. This was, it should be categorically stated, not a terrorist attack.\n“So, was what happened the result of some defect in the vehicle? Did the brakes fail or the vehicle suddenly accelerate without any intervention by the driver? Paul Doyle has never suggested that happened, and expert investigation by the police has excluded any problem with the vehicle as having caused or contributed to what occurred. So, that is not the explanation.\n“Was Paul Doyle drunk or high on drugs? Again, the prosecution is able to give a definitive answer to that question. He was not. At the time that he drove into and over 100 people, Paul Doyle was completely sober, and free of all drugs.\n“So, why did the defendant behave in such an extraordinary and harmful way on Dale Street and Water Street? Paul Doyle claimed, when subsequently interviewed by the police, that he acted as he did in a blind panic and in fear of his life because of how some in the crowd had behaved towards him. The position of the prosecution is that this account given by the defendant to the investigators was untrue.\n“The truth is a simple one. Paul Doyle just lost his temper in his desire to get to where he wanted to get to. In a rage, he drove into the crowd. When he did so, he intended to cause people within the crowd serious harm. He was prepared to cause those in the crowd, even children, serious harm if necessary to achieve his aim of getting through. The truth is as simple as the consequences were awful.\"\nThe charges Doyle admitted included 17 charges of attempting to cause grievous bodily harm with intent. The complainants in these matters were named as six-month-old Teddy Eveson, other boys and girls aged seven months, 10, 11, 13, as well as adults Jack Trotter, Jon Evans, Scott Dolan, Ashton Gilmore, Jacqueline McClaren, Jamie Fagan, Carl Martin, James Vernon, Emily Wright, David Price, James Weston and Ethan Gillard.\nA further nine charges which he pleaded guilty to stated that he caused grievous bodily harm with intent to Helen Gilmore, Anna Bilonozhenko, Sheree Aldridge, Sam Alexander, Hannah O’Neill, Stefan Dettlaf, Christine Seeckts, Susan Passey and Aaron Cothliff. He finally faced sentence for three offences of wounding with intent against a 12-year-old boy, Simon Nash and Robin Darke, as well as matters of affray and dangerous driving.\nThe court heard Doyle had a number of previous criminal and military convictions from when he was a younger man, including an immediate custodial sentence for biting off a sailor's ear while a Royal Marine in a drunken brawl. Mr Greaney told the court: \"Those efforts to rehabilitate himself after a difficult early adulthood only serve to make more shocking and tragic what he did in Liverpool that day this May.\"\nSimon Csoka KC, for Doyle, told the court today: \"We should make it clear the defendant is horrified by what he did, horrified by the consequences of what he did. He's remorseful, ashamed and deeply sorry for all those who were hurt or suffered. He accepts full responsibility. He expects no sympathy. Nevertheless it's important we emphasise his remorse.\"\nHe added: \"The paradox of that day is that he was doing a favour for a friend. It was an ordinary day. He did not have any motive in the ordinary sense to cause serious injury nor did he have a desire in the ordinary sense to cause serious injury. This is a case where the consequence of his decisions was that serious injury was a virtual certainty and it was foreseen by him. It was not a case where there was a motive and desire to cause serious injury.\"\nMr Csoka, supported by Damian Nolan, continued: \"The defendant recognises it’s fortunate the consequences of his actions weren't as grave as they might have been. His actions weren't planned. His conduct has been difficult for him to understand and accept. It’s taken him several months for him to recognise mentally what he did. He's appealed by his own conduct, the spiralling effect of his conduct was utterly unexpected for him and utterly unexpected for all those who know him well.\n\"There has been a period of denial, whether that can be categorised as subconscious denial is perhaps a moot point. There clearly has been an avoidance of reality. That's a well recognised phenomenon when an individual is involved in an event such as this.\"\nIn terms of personal mitigation, Mr Csoka said the defendant had lived a different life from his previous offending as a man in the early 1990s. He said: \"Upon his release from prison, he transformed his life by going to university. He’s worked hard since then, had a successful career in IT, raised a family with his wife. They have three children.\n\"The court has been provided with a large number of character references. He was very active in his community. He's engaged in a number of occasions with charity fundraising activities. All of those people speak of a kind, generous and selfless man. It's part of the paradox of this case that how they know him is so different to the way he behaved.\n\"They all find his actions incomprehensible and so utterly unlike the man that they know. Again perhaps that fed into the difficulty in the defendant coming to recognise and accepting what he did. We can only emphasise again the deep sorrow and shame that the defendant feels. We accept that those are only words and it will provide no comfort to those who were hurt and those who suffered.\"",
  "word_count": 2792,
  "scraped_at": "2026-02-14T12:50:34.938990"
}