{
  "article_id": "a38c65102b82",
  "url": "https://www.ok.co.uk/lifestyle/lionesses-salary-earned-chloe-kelly-30757228",
  "title": "Lionesses Women World Cup earnings revealed including  bonus scheme  ",
  "date": "20230822T084500Z",
  "domain": "ok.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lionesses Women’s World Cup earnings revealed including 'bonus scheme'\nThe Lionesses came heartbreakingly close to bringing football home for the first time since 1966 - but the Spanish team ultimately pipped them to the post at the last minute\nEngland’s Lionesses made the country proud this year as they made it all the way to the final of the FIFA Women’s World Cup.\nThe team took on Spain on 20 August in a fierce clash but were ultimately beaten one nil.\nDespite the heartbreaking loss, the Lionesses have been hailed as footie heroes and they still pocketed a whopping £2.4 million in prize money after a hugely impressive run in the tournament.\nHistorically, this prize pot is split 60-40 between the Football Association and the team, with the latter pocketing the lion’s share.\nThat would mean the FA would take home 1.44 million, while the rest would be split between the 23 Lionesses at £41,000 each.\nBut that’s not all, as FIFA has introduced a brand new personal player bonus scheme for this year’s World Cup, meaning all players take home an additional £153,000.\nThe men’s and women’s England teams are paid equally for each pitch appearance.\nEach player is paid a £2,000 match fee - and this pay parity was only introduced in January 2020.\nDespite this rule change, the women’s team is still fighting to be treated equally.\nBefore the first game kicked off, the Lionesses were embroiled in a pay dispute with the FA after the body refused to offer them a £100,000 bonus if they managed to win the whole thing.\nHowever, the men’s team was offered a £500,000 bonus each for the same feat during Qatar 2022.\nFifa also gave the men’s team £17 million in bonuses for reaching the final eight during the men’s World Cup, despite the women’s team receiving just a fraction of the cash for making it considerably farther.\nFifa offers the women’s World Cup just a £86.1 million prize pot to be shared among the means, while the men’s teams had a whopping £346 million to split.\nThe Lionesses also make much less on a club level than their male counterparts - and the gender pay gap is staggering.\nThe average pay for a male Premier League player is £2,800,000 a year, while a woman can only expect to take home around £30,000.\nThat’s an average pay gap of £2,770,000 a year - which is certainly not small change!\nThe highest-paid Lioness - viral sensation Chloe Kelly - is believed to pocket around £933,000 a year, according to Spanish site Marca, but that’s including sponsorships and brand deals.\nAlthough her exact salary at Man City is unknown, the typical female player for the club can expect to take home around £75,000 a year.\nThe team’s highest-paid man, Belgian Kevin De Bruyne, meanwhile has scored a mega £20.8 million pounds a year in take-home pay.",
  "word_count": 484,
  "scraped_at": "2026-02-14T13:04:26.825590"
}