{
  "article_id": "a3bd73c91afd",
  "url": "https://www.camdencourier.com.au/story/9069253/lara-gooch-joins-adelaide-united-on-two-year-deal-a-league/",
  "title": "Lara Gooch joins Adelaide United on two - year deal : A - League | Camden Haven Courier",
  "date": "20250918T060000Z",
  "domain": "camdencourier.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Boolaroo's Lara Gooch is widely regarded as one of Australia's brightest prospects, and the Newcastle Jets product will be hoping a fresh start at Adelaide can reignite her dream of one day playing for the Matildas.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Reds, who finished third last season before losing their two-legged semi-final to Melbourne Victory, announced on Wednesday that they had signed the Lake Macquarie 20-year-old on a two-year deal.\nGooch joins Adelaide after her last A-League season with the Jets was disrupted by injury. She featured in only 10 games, starting twice and scoring once.\nBut, if the Australian youth representative can stay fit and firing, she has the ability to create havoc in the competition and press claims for potential senior international honours in the future.\nGooch gained national attention when she helped Australia claim bronze at the AFC Under 20 Asian Cup in Uzbekistan in March of last year.\nIt was the first time an Australian women's football team had secured a medal since the Matildas lifted the Asian Cup in 2010.\nGooch's goal off the bench to seal a 1-0 win over Korea Republic in the bronze medal play-off also booked the Young Matildas' spot at the FIFA Under 20 World Cup in Colombia 12 months ago.\nThe lightning-quick winger, who has unrivalled acceleration off the mark, played off the bench in all three games at the World Cup and was also part of an Australian under-23 squad last year.\nBut Gooch nursed shin splints coming into the last A-League season and was also plagued by an ankle injury.\nShe was one of eight departures announced by the Jets in July.\nIn all, Gooch made 43 appearances, and scored five goals, for her home-town A-League side since debuting as a 16-year-old in 2021-22.\nThe unpredictable and dynamic attacker, who has previously listed her long-term goals as playing for the Matildas and at an Olympics, is aiming to have impact at the Reds.\n\"What I hope to bring to Adelaide is just that aggressiveness, attack up front and being creative, and just to help the girls score as many goals [as they can] or get the goals myself to help win games ... and silverware sounds lovely, so that's definitely at the forefront of my mind, to do as best as we can,\" Gooch told United media.\nAdelaide United head of football Marius Zanin expected Gooch's signing to further boost the Reds' attacking options.\n\"Lara is one of the most promising young players in the country, and we're thrilled she's chosen Adelaide United for the next stage of her career,\" Zanin said.\n\"She already has significant experience at a young age, both in the league and internationally, and her speed and energy will add another dimension to our attack.\n\"Importantly, Lara has shown the mentality and drive we value at Adelaide United, and we believe she can make a real impact over the next two seasons.\"\nA move to Adelaide United last A-League season resulted in a career-best year for Cooks Hill United Football Club junior and Jets product Archie Goodwin.\nGoodwin, who, similar to Gooch, has already overcome a number of injury setbacks in his young career, shared the A-League Golden Boot winner accolade with Sydney striker Adrian Segecic and has earned a rich deal with Charlotte FC in the United States.\nThe Jets women's roster has undergone an overhaul after they finished second-last in 2024-25.\nOn Thursday, the Jets announced the re-signing of teenage attacking talent Alexis Collins.\nThe 17-year-old was a surprise starter in an opening round 2-2 draw with Western Sydney in Cessnock last season after being a late addition to the Jets' 2-24-25 roster.\nThe Mayfield United Junior Soccer Club player and Jets academy product went on to make eight appearances last season.\nCollins, who has been re-signed on another scholarship deal, has been in national youth squads and the Future Matildas program.\n\"Alexis is a forward with tremendous upside,\" Hoyle said.\n\"Physically strong, very quick, and a tireless work ethic, she already brings qualities that will excite fans.\n\"Surrounded by the experienced forwards in our squad, Alexis has the perfect platform to continue developing her game every single day.\"\nIn the Jets biggest signing news so far, strike weapon Melina Ayres returns for Newcastle after taking leave from football last A-League season.\nOther key signings for the Jets, who are targeting a return to finals under new coach Stephen Hoyle, are goalkeeper Anna Leat and forward Kelli Brown, who are both New Zealand internationals.",
  "word_count": 759,
  "scraped_at": "2026-02-14T12:36:51.682680"
}