{
  "article_id": "a3f74f28a83a",
  "url": "https://www.yahoo.com/news/silent-bill-sweeney-survives-damage-215627859.html",
  "title": "Silent Bill Sweeney survives but damage to RFU has been done",
  "date": "20250327T223000Z",
  "domain": "yahoo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Silent Bill Sweeney survives but damage to RFU has been done\nAt just after 6.11pm on Thursday night, Bill Sweeney looked over his shoulder at the big screen behind him. The embattled Rugby Football Union chief executive to that point had not said a word during the special general meeting that had been called for a vote of no confidence in his leadership.\nIn the moment, he briefly looked nervous himself, before the large screen in the “Live Room” at Twickenham declared that he had comfortably won the day, with a majority of 466 of the 708 members who had cast their vote, either remotely or in person.\nWith that he took off his glasses and looked ahead. A penny for his thoughts. Surely after securing 65.82 per cent of the vote (for the record, 206 voted against him and there were 36 abstentions) it would only be a matter of procedure for the RFU board to conclude that he should remain in place.\nBy the time RFU president Rob Udwin drew stumps nine minutes later on an historic evening – the last SGM called by the RFU members was in 2005 when grass-roots rebel Martyn Thomas triumphed over the governing body’s favoured candidate to win the vote to become chairman – there was little doubt.\nSir Bill Beaumont, the interim chair who had been brought in to shore up support for Sweeney when Tom Ilube resigned at the height of the salary and bonus scandal in December, had pledged his support for Sweeney even before the Freshfields review of the long-term investment plan (LTIP) bonus payments, or the RFU roadshows had been completed.\n“On the first motion before us, the message from our members is clear,” said Beaumont. “They have voted emphatically to support our CEO, Bill Sweeney, and I am pleased to see such a decisive outcome.”\nYet Sweeney remained silent, even in victory. It was a bizarre end to a bizarre night.\nThe evening had opened up with members who made statements of support for Sweeney rather than questions. It was left to former Test referee Wayne Barnes to put forward the case for the board, while Udwin acted as the convenor, appearing at times to be short of patience.\nA question from Gary Henderson from Sussex, on what a potential timeline would be on RFU reforms, was rejected by Udwin as not relevant. When a questioner asked if Barnes received a fee for being a member of the board, no answer was forthcoming.\nIt was left to the RFU’s executive director of legal and governance, Angus Bujalski, one of five executive members who shared in an LTIP bonus of almost £1 million, to point out that Barnes was paid a “small fee” of £25,000.\nMore in World\nRemarkably, there was not a single reference to Sweeney’s remuneration, given that this latest insurrection by the multi-factioned group that became known as the “Whole Game Union” had been sparked by the revelations last November not only that he had become the highest-paid chief executive in British sport after receiving £1.1 million last year – a salary of £742,000, which was an increase of eight per cent, and LTIP bonus of £358,000 – despite the RFU suffering a record loss of over £37 million and redundancies of 42 members of staff. No was there any reference to the RFU’s attempts to bury the full extent of the LTIP cost at the back of the annual report and subsequent refusal to explain or own the decision.\nOne of the consequences of the RFU’s roadshows has been to move the focus of the controversy away from the specifics of Sweeney’s leadership and his management by the board, to a narrative that the main issue was a failure to address the many issues thrown up by the grass-roots game.\nPerhaps the Whole Game Union knew its rebellion would not succeed in advance, having seen the extent to which the RFU was prepared to go to support its man, from manning the phones, and posting support from ex-England players, to Sweeney’s sudden interest in appearing on podcasts.\nOn the night they did not drill into the specifics but called for an overhaul of the governance of the game.\nPaddy McAlpine, the chair of Chichester RFC, was the best speaker on the night, suggesting that whatever the outcome, this was “just the beginning, not the end”.\n“When a structure fails, those responsible must be held accountable. Enough. Enough exclusion, enough failure,” he said. “This isn’t a vote; it is a turning point. History will remember what we do here today.”\nThe rebels accepted the defeat, but critically have exacted plenty from the process, with the RFU now fast-tracking a motion to devolve more power to the regions, and the promise of greater investment, drastically improved communications and an executive body that is more open and transparent and listens.\nThey have also set Sweeney and the board a deadline of the annual general meeting in June to prove that real change is on the way. The question that hangs in the air is how on earth did the RFU not know about all these issues with the grass-roots game until it was forced into extraordinary measures to see off this latest rebellion?\nThere are senior figures who voted against the motion who also believe that Sweeney’s desire to stay on until the 2027 men’s World Cup is no longer realistic, given how damaging the past few months have been for the governing body. Some believe England’s hosting of the Women’s World Cup this September might represent an appropriate moment for change.\nIf the RFU is genuinely to begin a healing process, it is going to require a strong chair who is not there to blindly support the chief executive but hold him to rigorous account. The sad reality is that a strong board would never have allowed this bonus scandal to have occurred in the first place, for all the RFU’s claims to be operating like a FTSE 250 company.\nIf this really is to be a moment in history for the English game, and transforms the RFU into an outward-facing organisation, providing leadership for the world game as the biggest and most powerful union, and tackling the financial and participation challenges rather than expending so much time protecting its own positions, then perhaps paying out that £4.9 million in total bonuses to the executive team was worth it after all.",
  "word_count": 1076,
  "scraped_at": "2026-02-14T12:34:26.281463"
}