{
  "article_id": "a404c87b86b4",
  "url": "https://www.comstocksmag.com/web-only/possible-last-causeway-classic-71-year-history-one-remember",
  "title": "Possible Last Causeway Classic in 71 - Year History Is One to Remember",
  "date": "20251127T003000Z",
  "domain": "comstocksmag.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "If Nov. 22’s Causeway Classic was truly the 71st and final chapter of the storied series between I-80 rivals Sacramento State and UC Davis, then the sendoff couldn’t have been more dramatic.\nIt was a game that had everything — two Big Sky Conference rivals with a playoff berth on the line, an iconic trophy waiting on a table in the end zone to be grabbed by the winners, and 14,580 fans, the largest Causeway Classic crowd in the 17-year history of UC Davis Health Stadium, there to witness it all.\nWhen Sacramento State Hornets quarterback Cardell Williams’ fourth-down pass from the UC Davis 29-yard-line to receiver Ernest Campbell fell incomplete with 44 seconds left, the 31-27 Aggies win was sealed. The overflow crowd had witnessed a roller coaster ride of a game that saw No. 15 UC Davis jump to a 14-0 lead, only to fall 10 points behind the Hornets heading into the fourth quarter before scoring 14 unanswered points.\nWide receiver Samuel Gbatu, Jr., hauled in quarterback Caden Pinnick’s 30-yard touchdown pass with 6:14 left to play to put the Aggies ahead, while Sacramento State’s final drive fell short.\n“I’d be lying if I didn’t say that I really wanted to win the game; I didn’t want to be the guy that lost the last Causeway ever,” UCD second-year coach Tim Plough, a former quarterback for the Aggies, said in the postgame press conference.\nAs expected, the win vaulted the Aggies, now 8-3, into the Football Championship Subdivision (FCS) playoffs as an eighth seed, which earned them a bye and a home game Dec. 6 against the winner of the Nov. 29 Rhode Island/Connecticut State game. Sacramento State ends its season 8-5.\nHeading into Nov. 22, the matchup — which began in 1954 (the name was officially coined in the early 1980s as a reference to the Yolo Causeway that connects Sacramento and Davis) — was billed as possibly the last Causeway Classic for several reasons.\nWith both school’s athletic programs in transition, UC Davis’ football program will remain in the FCS Big Sky Conference next year and in the near future, while every other UCD sports team — both men’s and women’s — will move into the higher Football Bowl Subdivision (FBS) Mountain West Conference for the 2026-27 academic year, while football will (ironically) remain in Big Sky.\nSacramento State’s football program, meanwhile, is planning to leave the Big Sky and is scheduled to play the 2026 season as an independent, unless they get a bid to move into a FBS conference like the Mountain West or one in a major transition mode like the Pac-12. As a result, UCD’s non-conference schedule is set for the next two years at least without Sacramento State, making the future of the Classic uncertain.\n“I’m just glad that it’s (the trophy) going to stay here for all of eternity,” Plough says. “That’s where it belongs.” He adds that he believes there won’t be another Causeway Classic unless Sacramento State “change their tune of what they’re saying they’re going to do. I’m happy that was the last one. It stays here with us, and that’s where it should be.”\nThe Hornets’ first-year coach Brennan Marion, who came to Sacramento after being UNLV’s offensive coordinator, lamented losing the rivalry game.\n“It’s the first rivalry game I’ve lost as a coach, so I guess I’ll learn from it,” Marion says. “I guess in all those other games I was an assistant coach; I’ve got to be a better head coach to get the team prepared to win the rivalry game.”\nWithout another Causeway Classic in the near future, both schools have recently announced major plans regarding athletic facilities. Sacramento State is looking into converting the current Cal Expo grandstand area into a new football stadium, while UC Davis has announced Aggie Ascent, a $265 million master plan to upgrade UCD facilities across their athletic spectrum.\n–\nStay up to date on art and culture in the Capital Region: Follow @comstocksmag on Instagram!\nRecommended For You\n‘We’ve Shown Sacramento the Best Baseball in the World’: First Year With A’s in Sacramento Draws a Total 1.1 Million Fans\nA’s finish first season of unique Sutter Health Park sharing experiment with the River Cats\nYou never know what you might see at an MLB game, as\nSacramento learned this year.\nStar Power and Flashy Hires Are Kicking Off Sacramento State’s Sports Season\nLakers great Shaquille O’Neal and Sac Kings star Mike Bibby are among the personalities drawing attention to the sports program\nSacramento State’s sports teams have endured many lean\nyears. But the institution, which debuted its original sports —\nbasketball, baseball and tennis — in 1948, has embraced a\ncontroversial change.\nSacramento Republic FC and Wilton Rancheria Break Ground on New Railyards Stadium\nAfter a decade of setbacks, club and tribe launch construction on 12,000-seat venue set to open in 2027\nIt’s been a decade-plus rollercoaster ride for Sacramento Republic FC’s efforts to build a new stadium, but on a bittersweet historic day for Elk Grove’s Wilton Rancheria, the tribe and SRFC broke ground on a $175 million, 12,000-seat multi-use stadium in The Railyards district north of downtown Sacramento.\nWhat’s Next for Hornet Stadium?\nUC Davis Causeway Classic win over Sacramento State comes on the heels of new Hornet Stadium announcement\nIt was a year that started with much promise for Sacramento State with a Top-10 preseason ranking, talk of a new stadium and the hope that Sacramento could use a new facility to position a move from the FCS’ Big Sky Conference to an upper division conference such as the Pac-12.",
  "word_count": 938,
  "scraped_at": "2026-02-14T14:20:40.309148"
}