{
  "article_id": "a4212edbf290",
  "url": "https://www.foxbusiness.com/markets/foxs-revenue-rises-increased-advertising-sales",
  "title": "Fox revenue rises amid increased advertising sales",
  "date": "20240621T064500Z",
  "domain": "foxbusiness.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Fox's revenue rises amid increased advertising sales\nRevenue rose 12% to $3.05B, topping analysts' expectation of $2.94B\nFox Corp., parent of Fox News and the Fox broadcast network, reported higher revenue in the latest quarter, as more original entertainment programming, live sports and growth at its streaming platforms boosted advertising sales.\nRevenue rose 12% to $3.05 billion for the quarter ended Sept. 30. Analysts polled by FactSet were expecting $2.94 billion.\nThis is the \"healthiest ad market we have seen in some time,\" executive chairman and Chief Executive Lachlan Murdoch said on a call with analysts.\nPATAGONIA IS BOYCOTTING FACEBOOK, URGES OTHER COMPANIES TO DO THE SAME\nFox attracted more advertisers seeking to get in front of viewers for the live fall sports season, as well as its ability to promote ads across its various platforms, Mr. Murdoch said. Fox’s advertising revenues increased 17% over last year.\nFox’s shares, which closed at $41.58 on Wednesday, have gained 43% so far this year.\nFox’s cable programming unit, which includes the Fox Business Network and Fox Sports 1 channel as well as Fox News, pulled in $1.42 billion in revenue, up nearly 7% from last year. The easing of Covid-19 restrictions allowed for more sports. Fox also got a boost from pay-per-view boxing.\nOn Wednesday, Fox secured a rights deal with the Union of European Football Associations, or UEFA, to bring more than 1,500 soccer matches to Fox Sports. It will start running UEFA Nations League matches across its platforms in June of next year. Fox also has the rights to some of the biggest soccer tournaments including the FIFA World Cup, FIFA Women’s World Cup and Copa America.\nFox Nation, the direct-to-consumer streaming platform operated by Fox News, generated higher subscription revenue over last year, the company said. Tubi, Fox’s entertainment streaming platform, also had a strong quarter.\nRevenue from Fox’s TV stations was $1.58 billion, up from $1.35 billion a year ago due to growth at Tubi and higher advertising sales as local markets recovered from the pandemic-induced restrictions last year. The company also benefited from a full college football slate, the Major League Baseball All-Star game and more scripted entertainment programming at its Fox Network.\nCLICK HERE TO READ MORE ON FOX BUSINESS\nFox News parent Fox Corp. and Wall Street Journal parent company News Corp share common ownership.\nIn September, Fox said it acquired celebrity news platform TMZ from AT&T Inc.’s WarnerMedia unit, a move that would expand its digital media and unscripted content.\nTMZ owns a popular website and produces several TV shows. Fox local-television stations carry the shows \"TMZ\" and \"TMZ Live,\" and TMZ has produced specials for Fox’s entertainment unit, including \"Harry & Meghan: The Royals in Crisis\" and \"UFOs: The Pentagon Proof,\" and a sports gossip show that is carried by the Fox Sports 1 cable network.\nFox will focus on integrating the TMZ brand into all parts of the company’s portfolio, including monetizing the brand across Fox TV stations and developing TMZ-branded content for Tubi, Mr. Murdoch said.\nCLICK HERE TO GET FOX BUSINESS ON THE GO\nCo-founder and managing editor Harvey Levin, who launched TMZ in 2005 and serves as host of its TV shows, will remain in charge of operations.\nProfit attributable to stockholders decreased to $701 million, or $1.21 a share, for the fiscal first quarter, from $1.11 billion, or $1.83 a share, in the year-earlier period. The decline was attributed to the absence of a $462 million gain from Walt Disney Co. related to tax liabilities from its sale of 21st Century Fox assets.\nAdjusted net income was $1.11 a share, ahead of analysts’ consensus expectations of $1.01 a share, per a FactSet poll.",
  "word_count": 615,
  "scraped_at": "2026-02-14T12:32:36.185376"
}