{
  "article_id": "a4364e92ddf2",
  "url": "https://www.usforacle.com/2025/09/13/haugen-bulls-uab-american-conference/",
  "title": "Haugen return lifts Bulls over UAB in conference debut",
  "date": "20250913T193000Z",
  "domain": "usforacle.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Haugen’s return lifts Bulls over UAB in conference debut\nUSF men’s soccer kicked off American Conference play with a 1-0 win over UAB, keeping its unbeaten start intact.\nThe Bulls (3-0-4) came into the matchup returning from a 1-1 draw at Mercer.\nSouth Florida’s captain and defender Mathis Haugen stepped up to deliver a free kick in his first return since he suffered a concussion.\nHaugen’s strike soared over the heads of UAB’s defense and connected with fellow captain Pedro Faife, who headed it into the bottom center of the net.\nThe lone score was all it took for the Bulls to continue their unbeaten streak, and open conference play with a win.\nFriday’s win at Corbett Stadium moved USF to 3-0-4 on the year, with the home field continuing to provide steady ground.\nRelated:USF women’s soccer keeps win streak alive over Stetson\nTwo Bulls carried conference recognition into the match — junior goalkeeper Jahiem Wickham, named Goalkeeper of the Week after a career-high eight saves against UCF, and senior midfielder João Belmudes, who earned an honorable mention with a goal and an assist in the same stretch.\nUSF arrived unbeaten through six matches. But with only two victories, the meeting with UAB offered the first chance to measure itself against conference competition.\nThe chance didn’t spark a wave of pressure.\nThe first half mirrored the Bulls’ season to this point — organized and steady, but without the cutting edge to separate themselves.\nA yellow card to junior midfielder Tyler Richardson in the 44th minute highlighted the frustration of a half that ended scoreless.\nThe breakthrough came in the 62nd minute, and it came from the leadership core.\nHaugen, who had logged just 14 minutes this season, shot the free kick which dropped into the box for Faife, who headed it in.\nFor Haugen, the assist meant more than just a stat.\n“Finally being able to provide the assist to the game-winning goal was massive, and it definitely gives me a lot of confidence going forward,” Haugen said after the game.\nThe decisive moment came in his first match back after recovering from a concussion.\n“I had suffered a concussion, like a week and a half ago,” he said. “I’ve been kind of out of it and not been able to contribute to the team in the way I want to contribute.”\nRelated:USF takes on Miami in ranked matchup\nHead coach Bob Butehorn emphasized how important Haugen’s return was.\n“For us to have him back and be able to have him contribute is very good, and he showed it today,” Butehorn said after the game.\nUSF held firm over the final half-hour to secure the victory, its third win of the season and first in conference play.\nThe result extended the Bulls unbeaten start to 3-0-4 overall and 1-0-0 in the conference, showing signs of the consistency they have searched for in the opening month.\nButehorn said the opening conference performance gave his team the right foundation for league play.\n“I think the guys did a really good job of handling that pressure, of getting that first win in the conference and starting off the conference season right,” he said.\nThe Bulls will be back on the road for an 8 p.m. kickoff on Sunday, Sept. 21, when they travel to Tulsa, Oklahoma — another conference test early in their slate.",
  "word_count": 561,
  "scraped_at": "2026-02-14T12:20:04.984584"
}