{
  "article_id": "a4446a75f407",
  "url": "https://www.jdsupra.com/legalnews/courtside-counsel-june-2024-6837199/",
  "title": "Courtside Counsel - June 2024 | Eversheds Sutherland ( US ) LLP",
  "date": "20240614T201500Z",
  "domain": "jdsupra.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The NCAA reaches a historic settlement to pay college athletes. What to know: NPR\nWhat: On May 23, 2024, the NCAA and the so-called “power five” athletic conferences reached a groundbreaking agreement that seeks to end the century-old tradition of amateurism in college sports by allowing athletes to receive pay directly from the colleges and universities they play for. The agreement, part of a class-action lawsuit known as House v. NCAA, must be approved by a federal judge overseeing the case, a decision that could be months away. The proposed settlement has two parts. First, it would distribute $2.75 billion to athletes who competed before July 2021, when the NCAA first allowed athletes to earn money from their Name, Image and Likeness (NIL) rights. Second, it would create a future revenue-sharing model in which schools could each distribute around $20 million per year directly to athletes.\nWhy this matters: The issue of NIL has been a topic of discussion in college sports for years. While this settlement brings clarity to some NIL issues, there are more legal determinations and battles to come.\nTrend alert: Outstanding concerns related to this settlement include (1) which athletes will be compensated, (2) how much will they make, (3) Title IX issues around whether men and women athletes will be paid equally, and (4) potential future NCAA antitrust lawsuits.\n__________\nScarlet Johannson vs. OpenAI Foreshadows AI's Sports Shakeup - Sportico\nWhat: After Scarlett Johansson declined a request from OpenAI’s CEO to be the voice of OpenAI’s ChatGPT AI named “Sky,” many drew comparisons between Johansson’s voice and the Sky voice. Johansson is now seeking answers from OpenAI about the uncanny resemblance to her voice (specifically, her voice in the movie Her, where she voiced an AI). OpenAI claims they used the voice of another actress entirely. Other celebrities like Sarah Silverman have sued the company for copyright infringement.\nWhy this matters: With growing conversation around the impact AI will have on intellectual property and rights under NIL, copyrights, and trademarks, the recent example with Johansson highlights the potential for athletes or teams to be misrepresented in AI content or for their likeness to be used. AI content can easily depict a team with the wrong brand sponsorships or supporting a controversial cause. Athletes and sports entities will need to remain vigilant to ensure their reputations and representations are protected.\n__________\nOpinion | AI is coming to online sports gambling; new regulations are needed – The Washington Post\nWhat: AI is transforming professional sports and sports betting by providing advanced analytics and individually tailored gambling experiences. While this technological advancement offers benefits like improved performance metrics for athletes and predictive sports betting models for gamblers, it also raises significant concerns about gambling addiction and the ethical use of data. Proponents of online sports betting stress that AI tools are leveling the betting field by providing the general public with access to analytics once available only to professional gamblers, but others point out that relying on AI-driven statistical probabilities could exacerbate gambling addictions as bettors wager increasing amounts of money because they think they are making surefire bets.\nWhy this matters: Critics believe regulatory safeguards and industry guidelines are urgently needed to address these risks, with examples such as the EU’s AI Act serving as potential frameworks. In the US, a patchwork of state regulations exists, highlighting the potential need for comprehensive national legislation to manage AI’s impact on sports betting by holding companies accountable for the ethical use of AI in sports betting, ensuring responsible gambling practices and protecting consumers from potential harms.\n__________\nHow VAR Will be Used at Euro 2024 Explained (msn.com)\nWhat: VAR is a regular topic of debate in the world of football. UEFA hopes to alleviate the tension for Euro 2024 with the official tournament ball, aiming to provide officials with some much-needed help through the use of cutting-edge technology contained in the match ball. UEFA is introducing connected technology, that was used by FIFA in the 2022 World Cup, into the Adidas Fussballiebe ball (meaning love of football) for Euro 2024 to improve the accuracy of semi-automated offside VAR decisions. Alongside, UEFA is also aiming to use VAR to reduce the length of time it takes to make a decision, with offside decisions averaging 25 seconds, down from 70 seconds. The ball will also provide additional tracking data for players.\nWhy this matters: VAR will be used differently from how it is currently being done in the Premier League, amid a recent vote by Premier League clubs on whether to scrap VAR, following calls for its abolishment from the English top-flight. In comparison to Euro 2024, the Premier League does not use chips in their official matchday balls or AI in their system. Instead, the Premier League VAR officials rely on manually drawing lines when it comes to offside calls, which can lead to human error and the wrong decision being made.\nSemi-automated offsides have the potential to change VAR for the better. If the technology proves once again how smoothly it is operated in another major tournament, it would not be a surprise to see the Premier League implement it in the future. There were various examples showing how well the technology works in the 2022 FIFA World Cup, one being that it was able to conclusively prove that Cristiano Ronaldo did not make any contact with the ball for Portugal’s opening goal against Uruguay. Domestically, Serie A is the only major league to use semi-automated technology, but with a slight difference in that, they do not use a chipped ball and use AI to help detect the point of contact of the ball for an offside call. The same system is used in the UEFA Champions League. Looking to the future, La Liga has confirmed it plans to use the technology from the 2024/25 campaign.\nFuture developments to keep an eye on: The future of VAR very much depends on the use of new technology at major tournaments, such as Euro 2024 being a success; if it is, keep an eye out for semi-automated technology being implemented in wider domestic leagues such as the Premier League, with football’s lawmakers keen to make the use of VAR as efficient and easy as possible for it to run smoother in the future.\n__________\nSpanish Court Rules in Favor of Super League Creators – BBC Sport\nWhat: The European Super League (ESL) may not be dead after all. In late May, a commercial court in Madrid ruled against UEFA and FIFA, finding that these organizations had engaged in anti-competitive behavior by banning their clubs from joining the proposed league. While A22 Sports Management—the company behind the ESL—and the football associations have offered combatting interpretations of the Spanish court’s ruling, one thing is certain: the ESL is far from a lost cause.\nWhy this matters: The court’s judgment and parties’ responses may seem like déjà vu, and for good reason. In December 2023, the European Court of Justice declared much the same in its ruling: UEFA and FIFA were “abusing a dominant position” to stifle competition. Those two associations remained steadfast after the ruling, noting their “confiden[ce] in the robustness” of their rules and describing their conduct as “compl[iant] with all relevant European laws and regulations.” ESL and its proposed members, however, said the ruling “paved the way for a new competition.” The European Court of Justice, for its part, was clear that its ruling should not be taken as an approval of the ESL. History repeated itself with the Spanish court’s verdict, which also found that UEFA and FIFA had violated pro-competition laws in preventing the ESL from entering the market. A22 declared the Spanish court’s ruling meant “the era of the monopoly is now definitively over,” but UEFA and FIFA took the stance that the judgment in no way approved the ESL. With these parties locked in battles in the courts of justice and public opinion, resolution in the near future appears unlikely. But rulings like the Spanish court’s leave open the possibility that the football landscape as we know it is about to change.\n__________\nBorussia Dortmund: An investors favourite football team | NYSE:MANU (proactiveinvestors.com)\nWhat: High Dollars for Borussia Dortmund. The top-scoring team, Borussia Dortmund, boasts high profit margins again this year. Since COVID-19, the soccer club has consistently grown in revenues and skyrocketed in overall value, making it a very attractive investment opportunity for soccer fans. Unlike other soccer clubs, Borussia has been able to balance top-tier sports performance and monetize that performance, allowing the club to be successful in multiple ways.\nWhy this matters: It is always important for investors to diversify their investments, and investing in sports is a growing way many standard investors and sports fanatics alike have grown their portfolios. Given the rise in sports revenues since the pandemic, investing in professional sporting teams is strengthening the financial industry.\n[View source.]",
  "word_count": 1488,
  "scraped_at": "2026-02-14T12:41:31.134033"
}