{
  "article_id": "a45c82de022b",
  "url": "https://www.dailymail.co.uk/news/article-14946557/Lioness-fans-spot-hilarious-thing-legend-Chloe-Kelly-shouts-collecting-medal-Prince-William.html",
  "title": "Lioness fans spot hilarious thing  legend  Chloe Kelly shouts after collecting medal from Prince William",
  "date": "20250728T091500Z",
  "domain": "dailymail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It had only been minutes since Chloe Kelly captured the nation's collective heart with the goal that crowned England European champions – so she can perhaps be forgiven for letting her emotions get the better of her as she collected her medal.\nThe 27–year–old forward bellowed 'f****** come on!' into the TV cameras in a less–than–watershed–friendly moment after shaking hands with Prince William and collecting the gong that signified her and her fellow Lionesses' achievement.\nAfter kissing her medal, she rushed the TV camera to let loose – winning over fans watching at home. She was also seen swaggering around the pitch with her team when she shouted: 'The first time was so nice, we had to do it twice!'\nThe Lionesses later partied late into the night as they celebrated their second European title on the trot after trouncing Germany 2–1 in 2022.\nTheir victory was extra sweet – coming after Spain won 1–0 in a closely fought World Cup final two years ago. Fans seemed to agree with Kelly's ecstatic reaction.\nOne wrote: 'Chloe Kelly \"F****** come on\" Hah. Legend.'\nAnother posted: 'Chloe Kelly shaking hands with Prince William then turning to the camera... kissing her winners medal and saying \"F****** COME ON\" was the standout moment of the Women's Euros for me.' They added: '#Legend'.\nDespite staying up until 4am, the team was ready to head to the airport just hours later ahead of a Downing Street reception with Deputy Prime Minister Angela Rayner later this afternoon.\nFootball fans have dubbed Lioness Chloe Kelly a 'legend' after her emotions got the better of her on live TV\nKelly is seen leaving the team's hotel in Zurich, Switzerland this morning – with her winners' medal around her neck\nMidfielder Ella Toone's boyfriend revealed that some in the camp were worse for wear this morning after boozy celebrations with cake, Champagne and karaoke until dawn – but not even that could stop them from smiling as they left the hotel today.\nBut Kelly looked fresh–faced as she stepped out this morning, a rose in her backpack and her medal still slung around her neck.\nThe line–up for the team coach was eccentric: star winger Lauren Hemp clutching a Lego set of the castle from Disney's Beauty and the Beast', perhaps built in downtime by the self–confessed brick–building fan.\nCaptain Leah Williamson grasped the trophy protectively as she clambered aboard.\nMichelle Agyemang – named young player of the tournament – came out wearing a Nike t–shirt reading 'IIOME' – marking the second time the Lionesses have brought football home in just three years.\nHero goalkeeper Hannah Hampton – who saved two penalties in the shootout – was all smiles as she was escorted out of the hotel under an umbrella by a grinning member of staff; perhaps the team's smiles were that infectious.\nAnd Lucy Bronze grimaced through the pain as she made for the bus, after living up to the middle name Tough by playing the entire tournament with a fractured tibia. She managed 105 minutes in the final before being substituted off.\nThe Lionesses, manager and staff had filed off the coach clutching the trophy and glasses of wine before being were met with roars from their loved–ones, who were waiting to greet them at the team hotel.\nSarina Wiegman and her captain Leah Williamson cut a celebratory cake before the dancing began – in wild scenes shared on social media.\nMany of the Lionesses were belting out tunes on a karaoke machine as people bopped on a packed dance floor.\nCelebrating their triumph over Spain in the Euros, the England team lined up to shake hands with Prince William and have their medals place round their necks\nThe Arsenal winger, who also scored the winner in England's 2022 Euros final win over Germany , kissed her medal before turning to the camera as she walked away and said: 'F****** come on!'\nThe Arsenal star smashed the ball into the top corner past Spain's Cata Coll to win the Euros\nThe Arsenal star has been criticised for her celebrations after scoring the winning penalty for England against Spain\nThe Lionesses successfully defended the historic crown their won at Wembley three years ago\nKelly's introduction part–way through the first half changed the momentum of a game that Spain dominated and looked set to win.\nThe 27–year–old, who – like her Gunners team–mates – adds Euros glory to Champions League success, assisted Alessia Russo's 57th–minute equaliser after Mariona Caldentey's 25th–minute opener.\nWith the score still tied after extra time, the match went to a penalty shootout — where goalkeeper Hannah Hampton made two huge saves.\nKelly, once again, became the hero of the hour, calmly dispatching the decisive spot–kick to seal a 3–1 shootout win.\nSpeaking after the match Kelly gushed that she was 'so proud of this team, so grateful to wear this badge' and 'so proud to be English'.\nAs the presentation ceremony took place, the Prince of Wales was among those to congratulate star striker Michelle Agyemang on being named young player of the tournament.\nWilliam exchanged words with Agyemang, appearing to say 'well played, fantastic, well done'.\nAgyemang, 19, who had one England cap before the tournament, scored crucial equalisers in the Lionesses' quarter–final and semi–final comebacks.\nThere was non–stop applause in her home town of South Ockendon as fans saw the Arsenal forward step through a guard of honour to pick up her award.\nSir Keir was the first to congratulate England on their win – posting on X: 'Champions! Congratulations Lionesses – what a team. What a game. What drama.\n'You dug deep when it mattered most and you've made the nation proud. History makers.'\nEngland's Michelle Agyemang heads for the team coach in a t–shirt that reads 'HOME' with two stylised letter Is – referencing the fact the Lionesses have brought football home twice\nLucy Bronze played through the pain barrier despite having a fractured tibia for the entire tournament – living up to her middle name of Tough\nEngland's Lauren Hemp walked out carrying a Lego set based on the the castle in Disney's Beauty and the Beast. She has spoken about her love of building the sets in the past\nStar left back Alex Greenwood was still wearing her medal\nEngland goalkeeper Hannah Hampton saved two penalties in the shootout\nEngland captain Leah Williamson (right) with the trophy leaving the team hotel at The Dolder Grand in Zurich\nSpanish media criticised Chloe Kelly for what they called an 'unnecessary' celebration that saw her gesture at Spanish keeper Cata Coll\nNow, the Football Association has confirmed the victorious squad will celebrate in style with a victory parade on an open–top bus through central London on July 29, culminating at The Mall.\nIt is understood a royal reception with Prince William and King Charles is also being planned to honour the team's incredible achievement.\nFans can attend for free and it will be broadcast live on BBC, ITV, and Sky.\nSadly, it is understood Downing Street has no plans for a bank holiday to mark the Lionesses' triumph.\nBut the team has, at least, had royal recognition – including from Princess Charlotte, who used her first ever official public message to congratulate the team.\nKing Charles said: 'This brings you, your manager and all your support team my most heartfelt congratulations on winning the EUROS 2025.\n'For more years than I care to remember, England fans have sung that famous chant \"football's coming home\".\n'As you return home with the trophy you won at Wembley three years ago, it is a source of great pride that, through sporting skill and awesome teamwork, the Lionesses have made those words ring true.\n'For this, you have my whole family's warmest appreciation and admiration.\n'More than that, though, you have shown through your example over past weeks that there are no setbacks so tough that defeat cannot be transformed into victory, even as the final whistle looms.\n'Well done, Lionesses. The next task is to bring home the World Cup in 2027 if you possibly can!'\nPenalty hero Chloe Kelly and Lucy Bronze, who played the final with a broken leg, head into the team hotel after winning the Euros and the party began\nElla Toone was on someone's shoulders as she danced with Georgia Stanway\nElla and teammate Lauren Hemp were up until way past 4am, enjoying the celebrations\nEngland manager Sarina Wiegman and captain Leah Williamson cut a celebratory cake\nDrinks were flowing as friends and family joined the England players in celebration\nPrincess Leonor, 19, and Sofia, 18 of Spain, were seen gushing at Princess Charlotte, 10, during the Euro finals last night\nHRH Prince William, Prince Of Wales and Princess Charlotte of Wales look disappointed and dejected after Spain go 1–0 ahead\nBut Charlotte was all smiles as Chloe Kelly sent her winning penalty home to secure England's status as reigning European champions\nSir Keir Starmer is seen in attendance with his wife Victoria Starmer\nAnd Charlotte's sweet message, co-authored with her father, read: 'What a game! @lionesses, you are the champions of Europe and we couldn't be prouder of the whole team. Enjoy this moment @England. W & Charlotte.'\nThe Princess watched the match next to her father and just along the row from her Spanish contemporaries: future queen Princess Leonor, 19, and her younger sister Sofia, 18.\nAn image of the royals captured Charlotte leaning over her father to chat to the older princesses – a rare moment of open communication between young royals of different monarchies on the world stage.\nThe princesses – daughters of Spain's King Felipe and Queen Letizia – were seated near the Prince of Wales but appeared preoccupied as they chatted to his daughter during the nail–biting final.\nDespite a hard–fought match that went to penalties, the royals maintained jovial relations with each other and appeared in good spirits throughout the match.\nOther Spaniards appear to be chewing on sour grapes this morning, however.\nNational sports publication Diario AS insisted that England 'robbed' their Iberian opponents in its full match report.\n'The dream ends in a nightmare,' they added. 'Spain lost the European Championship on penalties. England tied a match that Spain largely dominated.\n'History is made by victories, and also by defeats. Spain fell in the Euro Cup final but left its name sealed in gold.\n'England robbed them of their dream; the world champions couldn’t close the circle they began to write two years ago in Sydney.\n'They couldn’t have been crueler in the penalty shootout, tossing a few dice in the air.'\nAnna Moorhouse of England eats a slice of pizza after an interview with the media following the game\nEngland supporters celebrate during a live screening of the Women's Euro 2025 final soccer match between England and Spain at the Boxpark in Croydon\nEngland supporters celebrate during the penalty shootout\nJoy for England fans as Alessia Russo heads home to make the score 1-1\nThe outlet also hit out at Chloe Kelly for her 'unnecessary' celebration in front of La Roja stopper Cata Coll after scoring the winning penalty for England.\nKelly, who scored the winner in England's 2022 Euros final win over Germany, made a beeline for fans after smashing the ball past Coll before making a gesture in front of the keeper, the outlet said.\nIn the comment that accompanied a short clip of the climatic moment, published on their website, Kelly's decision to make a b–line for the England supporters in the corner was deemed 'cocky' and uncalled–for.\n'This is unnecessary, my friend: Kelly’s cocky gesture to Cata Coll after scoring the decisive penalty,' they wrote.\n'The England specialist changed her run during her penalty celebration to get past the goalkeeper she had just beaten.'",
  "word_count": 1967,
  "scraped_at": "2026-02-14T12:12:29.145639"
}