{
  "article_id": "a47347d12cc3",
  "url": "https://www.twtd.co.uk/ipswich-town-news/49353/mckenna-arsenal-have-qualities-any-team-would-admire",
  "title": "McKenna : Arsenal Have Qualities Any Team Would Admire - Ipswich Town News",
  "date": "20250418T180000Z",
  "domain": "twtd.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Friday, 18th Apr 2025 18:19\nTown host Arsenal at Portman Road on Sunday with manager Kieran McKenna a big admirer of the Gunners. (Sky Sports Main Event/Football KO 2pm).\nThe Blues’ Premier League status has been hanging by a thread for some weeks with the 2-1 home defeat to Wolves, for much of the second half of the season 17th before moving ahead of West Ham on goal difference last week, a fortnight ago making escape but impossible.\nDespite an impressive 2-2 draw at Chelsea last Sunday, the gap to safety extended to 14 points but West Ham’s 1-1 draw with Southampton on Saturday means relegation won’t be confirmed this weekend whatever the result on Sunday.\nAt the other end of the division, the Blues defeating Arsenal and Liverpool winning at Leicester later in the day would mean the Gunners couldn’t catch the Merseysiders.\nMcKenna says the prospect of an R being formally added next to Town’s name in the table, which was a possibility prior to the Hammers’ draw, hasn’t come into discussions ahead of Sunday’s match.\n“It’s not something we’re thinking about going into this weekend,” he said. “After the Wolves result, we had those discussions; that it’s out of our hands and it’s not worth thinking about what other teams are doing or other teams’ results.\n“It never is anyway but certainly at this point it’s about us and maximising what we can get out of the last six games in terms of performances and points. That’s where all the conversations have been this week and nothing else regarding that.\n“Full focus on Arsenal, it’s a game to look forward to for everyone at the football club and a chance to test ourselves and hopefully show a good side of ourselves.”\nDoes it matter when the inevitable is confirmed? “It’s not something I’ve given a second’s thought to. The arithmetic doesn't really concern me. The concern is just going into Sunday.\n“If I haven’t given it a whole load of thought, if you asked me does it matter a huge amount in the biggest picture, I’d say probably not.\n“What matters hugely in the biggest picture is that we give absolutely everything on Sunday as we did last week, as we need to do the next weekend.\n“We need to fight for as many points as we can and that’s all that we can control. Honestly, that’s the only thing that’s coming into my mind.”\nArsenal are currently second in the Premier League, 13 points behind Liverpool and four in front of Newcastle in third.\nThe Gunners, who completed a 5-1 on-aggregate Champions League quarter-final victory over Real Madrid on Wednesday, are without a win in their last two in the Premier League, a 1-1 draw at Everton a fortnight ago having been followed by a stalemate with the same scoreline at home to Brentford last week.\nThe North Londoners have won only two of their last seven in the Premier League but have lost just once in that time, a surprise 1-0 home reverse to West Ham, their only league loss in 22 matches.\nOn their travels this season, they have won seven, drawn seven and lost only twice, 2-0 at Bournemouth in October and 1-0 at Newcastle a month later. They have drawn their last three away from home in the Premier League.\nMcKenna is a big fan of his Gunners counterpart Mikel Arteta: “It’s hard not to have admiration for the job that Mikel’s done there. Of course, we experienced it at the early stages at Arsenal when I was coaching against him [with Manchester United] and now it’s a completely different team and a different club than he inherited.\n“They’ve got a lot of qualities that any team would admire. Not just their individual quality, the physical quality, but I think their humility, how they work, their discipline, their commitment I think is really evident.\n“They’re a team to admire and full credit for the work he and his staff have done and we’re looking forward to the challenge of coming up against that and seeing what we can learn from the game and hopefully what we can take from the game.”\nThe North Londoners completed a famous victory over Real Madrid on Wednesday, winning 2-1 on the night having secured a 3-0 lead from the first match, but McKenna isn’t anticipating such a big game and important result having an impact on Sunday’s match.\n“It’s not something we can waste energy on because we always have to prepare to face the best version,” he said.\n“If you ask my opinion, I think we’re going to face a really strong Arsenal. They’ve come through a fantastic tie and you can see the values in their group, that’s them through to the semi-finals and, without speaking for them, I’m pretty certain they’re going to be really motivated to deliver a good performance, get a win and not give anything away too easily this season.\n“We’re prepared and getting ready to face a really, really good Arsenal side. Whether they change one or two players or three or four players from the team the other night, does that change anything really, in terms of the strength of what we’re going to face? I don’t think so.\n“We’re expecting to face a really good team, a really motivated team and we need to show those qualities ourselves.”\nMcKenna says he watched the Real ties but concentrated more on other games in his preparations for Sunday.\n“It wasn’t the most used game in terms of our preparations. A different opponent,” he said.\n“They have played lots this year and there is no secret as to what they are very, very good at. That was more of a cup of tea and a biscuit and enjoying watching it on the sofa.\n“Straight after the Champions League and you have just beaten Real Madrid 5-1 on aggregate and the second leg’s done, if you could tell me the statistical record for how teams do after that weekend, then you’d have more insightful knowledge than me!\n“The game was Wednesday night, we’re playing Sunday. They’re a top, top team with a top squad, so we’re expecting to face a really good Arsenal on Sunday.”\nTown have won only once at Portman Road in the Premier League this season, the 2-0 victory over Chelsea just after Christmas, and McKenna wants that record to improve in the final three Portman Road matches before the end of the campaign.\n“We would like our home record to be better, we’ve spoken about it lots of times,” he admitted. “There are probably different reasons why it hasn’t been.\n“But we have three more chances to go and record a big win at home, and the first one is on Sunday.\n“Of course, it’s a really difficult one, no doubt about that, but we believe in ourselves and we believe that if we execute every part of a game right, then we have a chance and we can compete, even with the best teams, and Arsenal are certainly one of the best teams.\n“We’re looking forward to Sunday and we’re only really focusing on that game and giving everything that the game’s going to require and if we do all that and it’s our day, then there’s a chance we can get it on Sunday.”\nAsked how Town balance respect for the opponent and confidence that they can cause the opposition problems, he added: “We’ve had plenty of practice at it, that’s the challenge. We had it last week and we have it lots of weeks.\n“We’re playing against one of the best teams in England, for sure, and if you’re one of the best teams in the Premier League, then you’re one of the best teams in Europe and they’ve shown that with their Premier League form over the last few years, and they’re showing it with their European form this year.\n“We’ve great humility and great respect for the opponent, but we’re here on merit, we’re here on right, we’ve shown across the season that we can compete with lots of teams.\n“We showed last weekend we can compete with a very good team and we showed even at the Emirates earlier in the season. Although it was a really difficult game, we showed a way to compete and make the game tight and if things had gone a little bit differently at the end, we could even have got something from the game.\n“We know the scale of the challenge and what we’re up against, but our focus is on ourselves and what we need to execute in the game plan to make it a difficult game for them.”\nMcKenna knows his team will have to be at their best to get a result, while Arsenal will need to be below par.\n“We know to compete in these games and to get the result, you have to do pretty much every part of your game right, there’s no two ways about it. It’s not going to be a one-dimensional performance, that won’t be enough,” he said.\n“We know Arsenal are going to have large spells of the game, we know they’ll have plenty of possession, so we know we’re going to have to both find a way to put pressure on them high up the pitch at times so they don’t feel completely comfortable and try and get some high regains and disrupt their rhythm.\n“But we also know they’re going to have large spells of possession and sometimes that’s going to be close to our goal, so we’re going to have to defend in a low block whenever we need to with full commitment and really good organisation.\n“We know we’re going to have impose ourselves with the ball and they’re not going to make it easy for us, they’re going to come and press us high, so we need to find solutions to try and play over the press, to play through the press, to get a foothold in the game.\n“And we know even from the first game that when we establish ball in their half that they’re a humble enough team to bring everybody behind the ball and defend with 10 men in their own third as well, so it’s not easy to create big chances.\n“They’re counter-attacking well and we’re counter-attacking well over the last few weeks, so transitions are going to be very important and they’re the strongest set-play team in the league.\n“So we need to do all those phases really, really well and if we do that, we’ll give ourselves a chance to be in the game and then it comes down to the margins and game management and how you can try and find a way to edge a result.\n“We know a lot of things have to go our way and Arsenal probably need to be below their best, but all these things are possible and that’s the environment we’re going to try and create on Sunday.”\nThe Team\nMcKenna probably won’t make too many changes from the team which gained a point at Chelsea last Sunday.\nAlex Palmer will be in goal behind a back four of Axel Tuanzebe, Dara O’Shea, Cameron Burgess and Leif Davis.\nSkipper Sam Morsy and Jens Cajste will be in central midfield with Kalvin Phillips out with his achilles issue.\nBen Johnson looks set to continue on the right with Julio Enciso in the middle and Jack Clarke probably on the left.\nLiam Delap has been back in training this week after a rib injury meant he was only available from the bench at Chelsea and appears likely to return to the XI with George Hirst dropping to sub.\nThe Opposition\nArteta says it hasn’t been too tough to turn minds to the visit to Portman Road following the excitement at the Bernabeu.\n“Quite easy, just review the Madrid game and immediately go to Ipswich and start to do all the preparation,” he said.\n“Start to watch the games, the games we play against them and what we learn over the last few months since we've played them,” he said in his pre-match press conference on Friday.\n“How can we hurt them, their qualities, and start to do the preparation towards the game.”\nRegarding the prospect of relegating the Blues, the Spaniard added: “Yeah, I understand where they are at the moment and they're playing at home and as you said, it's one of the few chances that they have [to survive].\n“But for us, it's a big game, we need to start to win football matches in the Premier League to at least maintain the position that we are in and to push into the last few games with some hope.\n“And we know how tough it's going to be. They are a really well-organised team. What Kieran McKenna and the staff have done is remarkable and you see every week how they perform and the amount of issues they give to the opposition. So we expect a tough game.”\nRegarding Town striker Delap, he said: “I don’t like to talk about any individuals of any opposition. As a team they are very strong. Individually they have players that can win you football matches. They’ve done it against big opponents so you have to pay a lot of attention.”\nOn Liverpool potentially being crowned champions this weekend, Arteta said: “We'll make sure that we win the game and that doesn't happen.”\nArsenal are currently without Takehiro Tomiyasu, Gabriel Jesus, Riccardo Calafiori (all knee), Kai Havertz, Gabriel Magalhaes (both hamstrong) and Jorginho (rib).\nHistory\nArsenal have had the best of the games between the teams historically, winning 31 (28 in the league), drawing 11 (10) and losing 18 (15).\nTown most recently beat the Gunners in the first leg of the Carling Cup semi-final in January 2011 when Tamas Priskin netted the only goal in a 1-0 victory for a Blues side with Charlie McParland in caretaker charge. The North Londoners won the Emirates leg 3-0.\nYou have to go back to September 1984 for Town’s last league win against Arsenal, a 2-1 victory at Portman Road under Bobby Ferguson, Romeo Zondervan and Russell Osman scoring, while Brian Talbot and Paul Mariner were both in the visitors’ XI.\nJust after Christmas at the Emirates, Havertz’s first-half goal was enough to see Arsenal to a 1-0 victory over the Blues.\nThe Gunners utterly dominated the first half but with Town limiting their chances, while The Blues had more opportunities to counter-attack in the second period but without ever seriously threatening to get back on terms.\nThe teams most recently met in the Premier League at Portman Road in December 2001 when Freddie Ljungberg netted in the fifth minute and Thierry Henry bagged a penalty on 56 as the North Londoners ran out 2-0 victors.\nFamiliar Faces\nBlues right-back Harry Clarke, currently on loan at Sheffield United, was with Arsenal between 2015 and 2023 having joined from Town as an academy schoolboy, before returning to his hometown club without featuring in the Gunners’ first team.\nWinger Omari Hutchinson was with the Arsenal academy between 2015 and 2022 before moving on to Chelsea's youth set-up.\nTown’s head of strength and conditioning Ivan Mukandi was with the Gunners’ academy for seven years before joining Town in the summer of 2021, also working with their women's side.\nFirst-team analyst Cillian Callaly as a first-team analyst was previously in the same role at Arsenal having been with their academy prior to that.\nOfficials\nSunday’s referee is Chris Kavanagh, his assistants Dan Cook and Richard West, and the fourth official Tom Nield. The VAR official will be Darren England and his assistant Steve Meredith.\nThe Lancashire-based official has shown a stonking 184 yellow cards and six red in 34 games in domestic, European and international competition this season, including 13 yellows in one match and 12 yellows and a red in another.\nKavanagh will be taking charge of his first Town match this season, although he has been the VAR official on two occasions, the home game against Spurs and the away match at Crystal Palace.\nHis last Blues fixture was the 1-0 defeat to Huddersfield at Portman Road in October 2016 in which he cautioned Jonathan Douglas and one opposition player.\nBefore that, Kavanagh was in charge of the 3-0 defeat at Hull City the previous October in which he booked Giles Coke and two home players.\nPrior to that Kavanagh’s only previous Town match was the 3-0 home victory over Charlton in 2014/15 in which he booked Tommy Smith and David McGoldrick as well as one Addick.\nSquad From\nPalmer, Walton, Slicker, Davis, Townsend, Johnson, Tuanzebe, Godfrey, O’Shea, Woolfenden, Burgess, Greaves, Morsy, Cajuste, Luongo, Taylor, Clarke, Enciso, Chaplin, Broadhead, Delap, Hirst.\nPhoto: TWTD\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nHaving beaten the minnows of Real Madrid in two consecutive matches, I don't fancy our chances.\nI know that McK has been tactically naive this season but remember that he is a young manager and learning his trade.\nWe'll be alright next season.\nKeep the faith.\nBecause after 20+ years, this short visit to the top flight is something we couldn't even imagined three or four years ago.\nWe can all beat the Arsenal.\nDone it before.\nI wonder what Roger is doing ?\nWalton\nH Clarke\nWoolfenden\nBaggott\nDavis\nMorsy\nLuongo\nTaylor\nChaplin\nHarness\nHirst\nAll surplus to requirements now aside Woolfenden\nGive them well deserved send off Burns too obviously, look at that for a Prem team\nHalkdy in goal\nTunazabe\nBurgess\nHutchinson\nWhich are the 3 that have made the step up, and Broadhead didn't even get into that first 11.\nThat has cemented my point completely, we had good loans and had a fluke season as joyous as it was but that team are not good enough for the Prem as relegation has proven and those players aside ones mentioned.\nOut of the team a year ago only 4 should be anywhere bear our squad Woolfenden, Burgess, Hutchinson, Tunazabe and I'd keep H Clarke to see how he develops, Broadhead done ok but deserves start lower down Championship in league 1.\nTell me which players out of the rest would get in any Prem squad?\nIts like a cult right now you either hero worship Mchenna and his players from arrival or your touted as not being a fan,\nSo 1 hymn book we all have to sing off.\nThe only journey we are on is back to the Championship and no point saying under Mckenna we will bounce back we won't currently, we couldn't beat Leicester and Southampton this season so why would we next.\nNot many write a valid argument, just call me a scum fan or a troll or say I'm talking rubbish.\nIf someone can give me a valid reason as to why fans think we will go back up I have a read.\nAll this journey and season orctwo too early waffle, who said it was a given we were going up in first place, many rich clubs or clubs with parachute payments who haven't in the 22 years since we been out.\nAsk Wigan, Reading, Blackpool, Derby, Huddersfield, Scum, West Brom, Watford, Birmingham, Bolton, Cardiff, Swansea, Luton, Sunderland, Portsmouth, in the last 10 seasons from relegations only 4 teams have gone on to bounce back and stay there, Villa, Fulham, Newcastle and Bournemouth and not many before them only really West Ham and Wolves yo yo, the rest yo yo few times never established.\nWe had a chance to stay up in 17th and even couple of weeks ago could of closed gap but blew it!\n27 points lost from winning positions, whose fault is that, you can't blame Muric. The only game he cost us the actual game was Southampton with 2 mistakes 2nd Davis fault really, Brentford we down 10 men when leading, Man City cone on, West Ham drubbing 1 mustake and Bournemouth equaliser not winner.\nWhat makes us so different? Nothing! And if you think it's because we got Mckenna think again, all those teams got to Prem, a few yo yo but not many, so before slating me take a little look at history books of 1 or 2 season wonders.\nhttps://www.nbcsports.com/socc\nI am not trolling or a Norwich fan (that's so rude) I just don't think Mckenna is the man to build an established Premier league team and while players signed in league 1 are around never will be as we have proven.\nIt's no difference to everyone slating Phillogene and Muric and using them as scapegoats without looking at stats!\nLike it or not those players have to be sold and managers come and go it's football.\nMckenna picks team, Mckenna picks tactics, subs, training so it's on him. Done great with back to back promotions, new owners and Ashton are great and club financially good but a established Prem team with Mckenna and a squad competing in League 1 only 2 seasons ago, no.\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 3543,
  "scraped_at": "2026-02-14T12:11:48.986720"
}