{
  "article_id": "a47b53971790",
  "url": "https://www.dailybulletin.com/2023/07/24/germany-routs-morocco-borges-gets-hat-trick-for-brazil/",
  "title": "Women World Cup : Germany routs Morocco ; Borges gets hat trick for Brazil – Daily Bulletin",
  "date": "20230724T190000Z",
  "domain": "dailybulletin.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Germany kicked off its World Cup campaign Monday with the same objective as always: to win it all. Germany, a two-time champion that has never failed to reach at least the quarterfinals, drew a favorable group and began its tournament with a 6-0 romp past Morocco. So even though it has a good chance to reach the final eight again, Germany has set its sights much higher.\nBrazil made a similar statement with a rout against Panama, behind a hat trick from Ary Borges.\nAnd Italy, a team in transition, featured two teenagers in a win against Argentina, 1-0.\nGermany 6, Morocco 0\nGermany won the World Cup in 2003 and 2007, and also has eight European Championships and an Olympic gold medal in its trophy case. But its form had been erratic in recent months, with losses to Brazil and Zambia and a narrow win against Vietnam in a friendly in June.\nStill, it showed every indication that it deserves its status as a title contender by cruising in its opener, piling up goals and taking advantage of two own goals by Morocco to post the most lopsided win of the tournament. Alexandra Popp scored the first of her two goals only 11 minutes into the match and added a second before halftime. But it was clear even before then that the Germans were in control.\nKlara Bühl and Lea Schüller added their first goals of the tournament in the second half, bookending a pair of Morocco own goals, to complete the rout.\nMorocco is one of the eight first-time qualifiers in the field. Even though its competitive chances are daunting, its qualification has won the team new fans back home.\nBrazil 4, Panama 0\nAll eyes have been on Marta, the 37-year-old Brazilian legend who is hoping to capture an ever-elusive World Cup title in her sixth appearance. She is considered by many to be the greatest player in the history of the game, but has often carried the load for her national team alone.\nNot Monday, when that honor went to Borges, a 23-year-old midfielder who delivered highlight after highlight in Brazil’s 4-0 win over Panama. Borges hit two goals, then passed on a relatively easy opportunity for a hat trick to deliver a wild assist, then got the third goal anyway with a header between the legs of Panama goaltender Yenith Bailey.\nBorges, who plays for Racing Louisville of the National Women’s Soccer League, was eventually subbed out of the game — for none other than Marta.\nThe closest the Brazilians have come to winning the tournament was nearly a generation ago, when they lost to Germany in the 2007 final.\nItaly 1, Argentina 0\nItaly reached the quarterfinals of the last World Cup, a solid result after a 20-year absence from the tournament. But after missing the knockout stage of the European Championship last year, the team began a generational transition, with coach Milena Bertolini dropping a number of veterans to make way for new talent.\nGiulia Dragoni, a 16-year-old midfielder whom some have nicknamed Little Messi, only made her debut this month in a scoreless draw against Morocco. But she started against Argentina, part of a lineup that also featured 18-year-old forward Chiara Beccari.\nItaly nabbed a victory over Argentina with a single goal, a header from Cristiana Girelli, who came off the bench to replace Dragoni and scored four minutes later. She is the first Italian woman to score in two World Cups.\nDragoni, meanwhile, could be the face of Italy’s team for the next decade. “I have no expectations,” she said this week. “I can’t because I am still so young and I came here to learn and to have some experience.”\nArgentina has never advanced past the group stage, failing to win a World Cup match and scoring only five goals in three tournaments.\nColombia vs. South Korea\nColombia is coming off a strong performance in the Copa América Championship, where it beat Argentina in the semifinals and fell to Brazil in the final, 1-0. Those results suggest a readiness to contend on the world stage.\nBut that competitiveness may have gone too far in a recent friendly against Ireland: That match was called off after 20 minutes for what the Irish labeled “overly physical” play from the Colombians. Colombia rejected that characterization and defended its style; it said the Irish simply “preferred not to continue playing.”\nColombia will face South Korea, the runner-up in the 2022 Asian Cup, on Tuesday in Sydney (Monday, 7 p.m. PT). The South Koreans have made it to the knockout stage once in three previous World Cup appearances, in 2015. Four years ago, the Koreans lost all three of their games.",
  "word_count": 786,
  "scraped_at": "2026-02-14T12:16:44.287853"
}