{
  "article_id": "a4a351e405dd",
  "url": "https://houston.culturemap.com/news/entertainment/popular-stories-berg-michelin-billionaires/",
  "title": "These are the most - read stories in Houston this week",
  "date": "20241005T170000Z",
  "domain": "houston.culturemap.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This week's hot headlines\nChinese restaurant closure leads week's 5 most-read Houston stories\nEditor's note: It's time to recap the top stories on CultureMap from this past week.\n1. Ben Berg's homage to New York Chinese restaurants will soon shutter. Berg Hospitality's Benny Chows served its last meal on Monday, September 30. A representative provided CultureMap with a statement from Berg Hospitality about the closure.\n2. Michelin Guide chooses Houston to reveal Texas' first starred restaurants. The countdown is on to find out which restaurants will be included in the first Texas edition of the Michelin Guide. An invite-only ceremony will be held in Houston on Monday, November 11 to reveal the selections.\n3. Coltivare owners cite I-45 expansion for decision to close 3 EaDo concepts. Agricole Hospitality’s time in EaDo is coming to an abrupt end. The Houston hospitality group closed all three of its concepts — live music venue and cocktail bar Lightnin’s Good Times, Tex-Mex restaurant HiWay Cantina, and Vinny’s Pizza — after service on Saturday, September 28.\n4. Tilman Fertitta tops new Forbes list of Houston's richest billionaires. A dozen of Houston's illustrious billionaires have made the cut on the new Forbes 400, a list of the 400 richest people in the United States for 2024. Houston hospitality king and Rockets owner Tilman Fertitta is the 12th richest Texan and the 99th richest person in the United States, according to Forbes' list, released October 1.\n5. Meow Wolf Houston's dive bar will serve 'Hot Slop,' 'Hooch,' and more. Surely one of the more intriguing aspects of Houston's new Meow Wolf installation is Cowboix Hevvven, the venue’s honky tonk-inspired dive bar. Part of what makes Cowboix Hevvven so intriguing is that it’s the first time Meow Wolf has integrated its food and beverage offering into the venue’s overall aesthetic.",
  "word_count": 302,
  "scraped_at": "2026-02-14T13:40:39.543400"
}