{
  "article_id": "a4b663812136",
  "url": "https://www.90min.com/features/6-big-takeaways-sir-jim-ratcliffe-interview-man-utd",
  "title": "6 big takeaways from seismic Sir Jim Ratcliffe interview about state of Man Utd",
  "date": "20250311T151500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "6 big takeaways from seismic Sir Jim Ratcliffe interview about state of Man Utd\n- Sir Jim Ratcliffe gives sit down interviews to the BBC and Sky Sports\n- Perception of Man Utd co-owner has hugely soured since 2024 buy-in\n- Cost-cutting, Ruben Amorim & women's team among major talking points\nBy 90min Staff\nManchester United fans and the wider football world are picking through the numerous major talking points after co-owner Sir Jim Ratcliffe gave wide-ranging interviews to the BBC and The Overlap, former skipper Gary Neville’s platform on Sky Sports.\nThe timing cannot be understated. Ratcliffe's regime has been getting slated from every angle in recent months, having already reached a year in charge – despite only owning a minority stake in the club – amid the justified perception of somehow making things even worse.\nRatcliffe has quicky learned how unforgiving football can be. He has previously dabbled in ownership through INEOS at OGC Nice and Lausanne-Sport. But nothing on this scale, with this much scrutiny, and this much of a challenge to get things right.\nFrom hiking ticket prices, to laying off hundreds of staff at the same time as making expensive football personnel mistakes, taking lunches away from ordinary employees, toying with removing financial support for disabled supporters and talking dismissively about the women's team, sentiment towards the man hailed just 12 months ago as the club's saviour has massively soured.\nIt was clear that Ratcliffe and the INEOS contingent were out to do some damage control and take back at least some of the narrative.\nPrepared to be unpopular over financial compromise\nThe stark warning from Ratcliffe in his BBC interview is that Manchester United would \"run out of cash\" by the end of 2025 without the severe cost-saving measures he is implementing.\nThe billionaire has hardly stoked employee morale since last summer, with sweeping declarations that everyone must be 100% office-based after a culture of hybrid working had become the norm, before then laying off 250 people – and plans for up to 200 more. Taking away Old Trafford's staff canteen, reported to cost £1m per year, also came across unnecessarily harsh and churlish at the same time as various underperforming members of the playing squad are paid that in a month.\n\"I recognise I'm unpopular at the moment - but I am prepared to be, and I can deal with being unpopular for a period of time because I believe that what we're doing is the right thing,\" he said.\nFan ire peaked last month when the latest set of accounts revealed that now more than £1bn has been spent servicing the enormous debt imposed on United by the Glazer family's controversial leveraged buyout in 2005. Ratcliffe played down the impact of that, claiming there are bigger cost issues to tackle and that \"most companies\" in the UK \"have debt of some form\". Once profitability returns, \"you can start paying down the debt,\" he said.\nBut Ratcliffe also made it clear that he expects the club to be making money for it to be invested in the playing squad, not to be spent on operating costs. \"Do you want to spend it on operating the club, or do you want to spend it on the squad? What we want to do is invest in the best players in the world if we can, rather than spend it on, I'm afraid, free lunches.\"\nIt's ruthless and making Manchester United a pleasant place to work with relatively minor concessions and gestures doesn't seem a priority.\nKey players won't be sold\nRemember when Leeds United hit a financial wall in 2002 and were forced over the subsequent two years to sell their most valuable assets – including Rio Ferdinand – to raise cash, but ultimately resulted in double relegation, a 15-year absence from the Premier League, and irreversible damage?\nRatcliffe says that Manchester United will not be going down that route: \"We won't be selling players because of the state we are in financially.\"\nOperational costs are what he wants to reduce, not at the detriment of football investment.\n\"The club had got bloated so we reduced that and will finish it with a lean and efficient organisation. That's how we will address the costs. The player decisions will all be focused on how we are going to improve performance. That's all,\" he declared.\nAmbition for swift success 'not impossible'\nDespite accepting that errors – namely keeping Erik ten Hag, and pursuing, hiring and firing Dan Ashworth – have been made, Ratcliffe is adamant that the goal is to become Premier League champions again by 2028, aligning with the club's 150th anniversary.\nGiven that United sit 14th in the table with ten games of the 2024/25 season remaining, and could well record their worst finish since relegation from the top flight in 1974, it sounds absurd to think they are targeting a return to the very top of the domestic pile only three seasons from now.\n\"I don't think it's mission impossible,\" Ratcliffe reasoned, arguing that setting a goal is healthy.\n\"If you look at Arsenal, if you look at Liverpool, if you look at the period of time it took them to get the house in order and get back to winning ways, that's probably slightly on the short end of the spectrum. But it's not impossible.\"\nFaith in Ruben Amorim\nRatcliffe's defence of keeping Erik ten Hag last summer was that the newly-appointed sporting hierarchy hadn't been through the door \"more than five minutes\" when the decision had to be made. But within three months the club was prepared to take the hit and accept it was a mistake.\nThe billionaire was particularly cutting about the former Ajax boss’ influence on recruitment, when it came to signing \"one or two Dutch players\". It's likely he was referring to Matthijs de Ligt and Joshua Zirkzee, both arriving last summer, but Ten Hag long had a reputation for pursuing players he already knew, with United also providing him Antony, Andre Onana and Noussair Mazraoui since 2022.\nReplacement boss Ruben Amorim actually has a worse record after a dreadful run of results just over three months into the job but is geared up for the long-term. His title – head coach – is different to that of any of his predecessors to reflect a specific role in the evolved and more modern sporting structure above him and it seems as though Ratcliffe is fixed on giving the Portuguese the benefit of the doubt after inheriting a squad built by someone else that doesn’t suit his clearly defined style.\n\"He is, as most great coaches are, an emotional character. Ruben is not perfect but I am a great supporter of Ruben,\" Ratcliffe said. \"He wants a dressing room that is full of people who are totally committed to winning football matches. He won't tolerate people who don't have 100% of that attitude. The players have to be in the same box.\"\nIs there any way back for Rasmus Hojlund?\nPlenty were shocked by the brutal honesty from Ratcliffe when it came to namedropping five underperforming signings who are either not good enough, overpaid, or perhaps both.\nTen Hag favourites Antony and Andre Onana were among them, as was Casemiro. Jadon Sancho, who United are \"paying £17m\" in loan wages so that Chelsea will buy him permanently in the summer, is the fourth. Then came the name of Rasmus Hojlund.\nAntony, thriving on loan out of the spotlight at Real Betis, already looked destined to move on at the end of the season. Casemiro is at the tail end of his career – he will retire a legend of the 21st century anyway, for everything he achieved during a decade at Real Madrid. Sancho, even more so than Antony, will absolutely not be a United player for much longer due to the terms of his Chelsea loan. Onana is at least a well established senior pro, exclusive of his time in Manchester, who is objectively proven at two former clubs to be one of the best goalkeepers in Europe.\nFor Hojlund, contracted until 2028, to be publicly named in that context by the man who controls the club, it is a monumental blow and difficult to envisage how he continues to have a future at Old Trafford – or maybe even at the highest level in general.\nThe Dane appears grouped into a problem that the new regime has \"inherited\" and must \"sort out\", seemingly considered a mistake of the \"past\" and not part of the \"new place in the future”.\nHojlund, only recently 22 and still in the infancy of his career, is already at rock bottom in terms of confidence. He has shown himself to be very capable in the right environment and with sufficient support and service, scoring seven times in six consecutive Premier League appearances during a run of outstanding form in the middle of last season. But it may now be impossible for him to succeed.\nBruno Fernandes, on the other hand, was highlighted by Ratcliffe as a \"fabulous footballer\" that the club \"definitely needs\".\n'Women doing better than the men'\nThe way Ratcliffe has spoken about United's women's team on multiple occasions in the past has been clumsy at best. His words and language have come across as dismissive and uninterested, to the point where fans have taken it to mean that the women's programme is not viewed by him and the club's senior hierarchy as important. He now claims the criticism has been \"unfair\".\nThis time, Ratcliffe – reported to have asked now departed women's team captain Katie Zelem what her role at the club was during a visit to Carrington last season – seemed better prepared in his answers. He offered more of an explanation when speaking about the financial input of the women's team, compared with the riches of men's football, and the tone at least seemed more caring.\n\"The women's team wear the Manchester United brand, the Manchester United logo, so in that sense they are every bit as important as the men's team. And frankly, they are doing better than the men's team,\" he told the BBC.\nThe women still clearly aren't at the forefront of his thoughts - his hesitation before declaring that they are second in the WSL table pointed to a lack of ingrained knowledge. But after the Zelem debacle, he did at least mention new captain Maya Le Tissier by name, unprompted.\nWhether that's organic growth in Ratcliffe's interest in the team's fortunes, or simply the result of being more carefully prepped by his PR team to talk about it is unclear. The likelihood is that it's the latter. It's still not the controlling partner talking passionately about women's football, suggesting there won't be any kind of substantial investment project to rival domestic giants Chelsea – still a drop in the ocean for the club in the grand scheme of things and potentially a missed opportunity, but it's at least no longer undermining their very existence. Baby steps.",
  "word_count": 1844,
  "scraped_at": "2026-02-14T12:49:25.817176"
}