{
  "article_id": "a4b9ffc72435",
  "url": "https://hotair.com/david-strom/2026/01/11/sunday-smiles-n3810727",
  "title": "Sunday Smiles",
  "date": "20260112T001500Z",
  "domain": "hotair.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "No, I am not going to dive into the depressing fact that the left is deeply committed to lying about what happened in Minnesota last week. There will be plenty more to say about that in the coming days, mostly because the left is deeply committed to spreading a false narrative in order to further their revolutionary agenda.\nInstead, I want to write about a different depressing trend about which I have written before: the war on love and procreation.\nI am, despite unfortunately being childless, quite pro-creation. I always wanted to have kids, but it was not to be, at least not if I wanted to be true to my marital vows, which goes without saying I do, however unfashionable that is these days.\nThere is, and has been for a long time, a leftist campaign to reduce the population and to destroy the family. Families and churches are rightly seen as enemies of the leftist agenda, which is why every communist government has worked hard to undermine these institutions, going back to Marx and Engels.\nThe amount of casual anti-love, anti-male, anti-romance content being thrust at young women is utterly insane\n— Allie (@allie__voss) January 10, 2026\nIt's like there's some giant conspiracy to make women picky, misandrist, off-putting, and alone pic.twitter.com/DQE35SBZkL\nThere are no ties as strong as those between mothers and children, and one of the left's main tools is generalizing nurturing instincts that are natural by undermining the particular and personal loyalties that people develop within families and strong communities. The goal is to transfer loyalties from the local to the general. That means undermining bonds we have with particular people.\nIn practical terms, this manifests as the promotion of \"empowerment\" narratives, in which people are encouraged to see their main goals as fulfilling their own desires and expressing their nurturing instincts in general terms. It's why you see so many people who are genuinely nasty to individual people in the service of some vague moral good. \"The people.\" \"Immigrants.\" \"Social justice.\" \"People of color.\" \"The homeless.\"\nHow often have you seen liberals walk right past a homeless person in danger of overdosing without a care in the world, while simultaneously prepared to scream at you for not paying enough taxes to solve homelessness? The actual effects of their actions don't matter because they no longer see particular people, just categories.\nRelationships that used to be about love are now all about \"fulfillment,\" which is how you get all the polyamory, polycules, abortion mania, and now women bragging about leaving their children to seek fulfillment.\nThat Target can have a sweater emblazoned with \"Dump Him\" in their Valentine's Day display shows you have far we have gone down this path. No doubt you buy books and magazines with descriptions of how to hook up with people, if you need to scratch your sexual itch in the reading section, there.\nA viral “Dump Him” sweater spotted at Target has sparked a bigger conversation about how anti-male messaging has quietly become normalized in advertising.\n— Evie Magazine (@Evie_Magazine) January 9, 2026\nWhat would cause outrage if flipped the other way is now treated as humor, shaping culture, relationships, and expectations… pic.twitter.com/e6MahF5WsE\nForget love. If you need to get laid every once in a while, there's an app for that, right?\nI'm sure a lot of people assume that this is merely ironic humor, but the fact is that you see anti-relationship and anti-natal propaganda everywhere. You see it in the \"DINK\" movement, which promotes going on cruises and vacations instead of having pesky, expensive kids. You see colleges pushing classes on polyamory and kink. The whole transgender movement pushes sterilizing children.\nThe goal is to break human bonds and replace them with your relationship with the new state, or preferably, the transnational movement.\nNo doubt, people unfamiliar with the literature that spells this all out find this idea absurd, but it is all laid out in the communist literature going back a century. The point is to atomize people. That is a key to totalitarian brainwashing. It's why children turned their parents in to the Secret Police.\nNo \"Dump Him\" sweater by itself leads to this dystopia, but the \"Dump Him\" sweaters are hardly alone. We swim in a sea of such propaganda.\nIt's no accident that the most mentally ill population in the world is liberal women, and especially young liberal women, who are desperately unhappy because they have bought the propaganda. \"Empowerment\" rarely makes people happy, and it's hard to imagine anything making a person happier than holding an infant as they coo.\nNot even a fine day in the polycule.\nON TO THE MEMES\nBEST OF THE BABYLON BEE:\nLiberals Begin Chugging Everclear At 7 A.M. To Protest RFK’s Warning Against Drinking At Breakfast https://t.co/P0gKQR4hwt pic.twitter.com/dzMWHtmM9O\n— The Babylon Bee (@TheBabylonBee) January 10, 2026\nThoughtful Husband Purposely Does Numerous Things Wrong Because He Knows How Much His Wife Loves Nagging https://t.co/eFljc4dWOA pic.twitter.com/DhcitzMPr8\n— The Babylon Bee (@TheBabylonBee) January 10, 2026\nLosing Football Team Excitedly Introduces New Coach Just Fired From Other Losing Football Team https://t.co/p9n8CsTg6f pic.twitter.com/Gy06o7jx1T\n— The Babylon Bee (@TheBabylonBee) January 10, 2026\nTrump Leads SEAL Team To Capture Rogue Dictator Gavin Newsom https://t.co/YLdGVg2iyY pic.twitter.com/9TP4f4WdvM\n— The Babylon Bee (@TheBabylonBee) January 10, 2026\nSomber Tim Walz Announces Every Daycare Center Record Sadly Perished In Last Night's Riot https://t.co/dTRfHpwq3f pic.twitter.com/M85BhHLDLL\n— The Babylon Bee (@TheBabylonBee) January 10, 2026\nAwkward: Biden Forced To Pay Trump The $25 Million Bounty For Capturing Maduro https://t.co/6nxBL5jf4a pic.twitter.com/TVhwpwIzwW\n— The Babylon Bee (@TheBabylonBee) January 10, 2026\nAmericans Now Living In Fear They Could Be Killed Just For Hitting ICE Agents With Cars https://t.co/VfBeKnEnd2 pic.twitter.com/BNpPRctXpH\n— The Babylon Bee (@TheBabylonBee) January 10, 2026\nTim Walz Retiring To Spend More Time In Prison https://t.co/FKQ3fm90Mq pic.twitter.com/800yz4METE\n— The Babylon Bee (@TheBabylonBee) January 10, 2026\nParenting Tip: Limit Your Child To Just 4 Hours Of Brain Rot Slop Each Day https://t.co/CPVql0NV9Y pic.twitter.com/RFGS7Ke5MJ\n— The Babylon Bee (@TheBabylonBee) January 10, 2026\nAides Tell Disappointed Trump That Maduro And Mamdani Are Different People https://t.co/LuvOngElMi pic.twitter.com/H0eej1SFS9\n— The Babylon Bee (@TheBabylonBee) January 10, 2026\nDemocrats Confused Why Venezuelans Cheering Downfall Of Nice, Warm Collectivism https://t.co/YZiARAmnXz pic.twitter.com/5BiziIfiXf\n— The Babylon Bee (@TheBabylonBee) January 10, 2026\nICE Agents Disguise Themselves As Capitol Police So Democrats Will Defend Them https://t.co/L25xbcjUo0 pic.twitter.com/uiKadCPyAJ\n— The Babylon Bee (@TheBabylonBee) January 9, 2026\nTucker Carlson Dumbfounded Why Iranians Protesting Most Amazing Government On Planet https://t.co/Pz4lvLEIsa pic.twitter.com/Bu4g0LQK5M\n— The Babylon Bee (@TheBabylonBee) January 9, 2026\nSomalis Demand Americans Stop Judging Them By The Content Of Their Character https://t.co/ZAtQLDUleU pic.twitter.com/V2QUNLayNk\n— The Babylon Bee (@TheBabylonBee) January 9, 2026\nDemocrats Say Things Would Be Much Safer If Law Enforcement Would Just Stop Trying To Enforce The Law https://t.co/KEYFGNwBVl pic.twitter.com/qgaAuweIEx\n— The Babylon Bee (@TheBabylonBee) January 9, 2026\nTim Walz Calls In Somali Military To Fight Against ICE https://t.co/guPdE2IXLe pic.twitter.com/EW7lUUVB6B\n— The Babylon Bee (@TheBabylonBee) January 8, 2026\nExhausted Nation Wishes Minnesota Would Be Normal For Like Five Minutes https://t.co/NtmALxOBqi pic.twitter.com/Oidp0wyvv3\n— The Babylon Bee (@TheBabylonBee) January 8, 2026\n‘It's Too Expensive To Have Kids,’ Says Woman Whose Ancestors Raised 11 Kids In A Two-Bedroom House https://t.co/wftxAY86jv pic.twitter.com/rJvEMp0cM5\n— The Babylon Bee (@TheBabylonBee) January 8, 2026\nWhite House Announces Over 1,000,000 New Jobs Were Created In December But They Were All Filled By Marco Rubio https://t.co/miDeObm3VO pic.twitter.com/0wWwbvh3UM\n— The Babylon Bee (@TheBabylonBee) January 7, 2026\nDemocrats Once Again Threaten Civil War To Stop Republicans From Taking Away Their Slave Laborers https://t.co/5Y5BXweiXA pic.twitter.com/QerzAdocUc\n— The Babylon Bee (@TheBabylonBee) January 8, 2026\nBEST OF THE REST OF THE INTERNET:\nMama cat adopted a puppy, grooms him like her own kitten, and the puppy is living his best life 🥹❤️\n— Antidepressant Content (@depressionlesss) January 11, 2026\npic.twitter.com/x4bGMXH5Aw\n🤣🤣🤣Tampon Timmy… To the Walz… pic.twitter.com/CJwr3kMWEm\n— NancyH (@NancyH_60) January 10, 2026\nThis is peak nature pic.twitter.com/ArQkhLniMp\n— Pushi Memes (@PushiMemes) January 10, 2026\nSoon https://t.co/sne4ARTh2Q pic.twitter.com/efT6B6ex1l\n— Bonchie (@bonchieredstate) January 10, 2026\nI DID NOT SAY THIS!!!🤣🤣🤣 pic.twitter.com/VqppXdJU0F\n— il Donaldo Trumpo (@PapiTrumpo) January 9, 2026\n🚨 Khamenei, in talks to flee Iran, rules out California due to \"prohibitive wealth tax\" pic.twitter.com/En12QErIg7\n— David Keyes (@DavidMKeyes) January 9, 2026\n— Human Owned by Cat 😺 (@Petswithaura) January 10, 2026\nWe keep Learing about more corruption. pic.twitter.com/PiN6yow1nm\n— Everintrigued (@EverIntrigued) January 7, 2026\nI don’t believe taking Nicholas Madero out of Venezuela is right, just because he is a narco… 🤣 pic.twitter.com/eYQS8CMdMf\n— Jake (@JakeCan72) January 5, 2026\nLOL!!! This wins the internet today! 🤣🤣🤣 pic.twitter.com/21MnIyhBVw\n— Gunther Eagleman™ (@GuntherEagleman) January 4, 2026\nMama please give me some pic.twitter.com/gmrtCWhfoo\n— Human Owned by Cat 😺 (@Petswithaura) January 4, 2026\nthree unlikely friends ✨ pic.twitter.com/wx394zri2O\n— Human Owned by Cat 😺 (@Petswithaura) January 11, 2026\nPupper got impressive skills..🐕🐾🎯🤯😅 pic.twitter.com/1mbT0iWOdJ\n— 𝕐o̴g̴ (@Yoda4ever) January 11, 2026\nMeet Zelda, she politely asks for pets 🥺 pic.twitter.com/Qi4wJSo9Qc\n— Cats That Make You Go Awww (@CuteAdorableCat) October 26, 2025\nThe other cat just watching 😂 pic.twitter.com/6jUIsLPLh9\n— Cats That Make You Go Awww (@CuteAdorableCat) January 11, 2026\nAND FINALLY\n- Editor’s Note: Do you enjoy Hot Air's conservative reporting that takes on the radical left and woke media? Support our work so that we can continue to bring you the truth.\nJoin Hot Air VIP and use promo code FIGHT to receive 60% off your membership.",
  "word_count": 1550,
  "scraped_at": "2026-02-14T13:23:45.784107"
}