{
  "article_id": "a4c93842cdaa",
  "url": "https://www.newstatesman.com/back-pages/2023/05/dramatic-season-high-point-carlisle-vs-stockport-wembley-hunter-davies",
  "title": "It been a dramatic season , but its high point is still to come : Carlisle vs Stockport at Wembley",
  "date": "20230524T131500Z",
  "domain": "newstatesman.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Gawd, what a long season. Hard to remember when it began. Hard to name all the Premier League managers who have been given the chop. Oh yeah, we had the World Cup in the middle. How did that go? Where was it held again?\nOn 2 August when Arsenal went 2-0 up against Palace in their first game of the season, I remember the Arsenal fans chanting “We’re gonna win the league”. They knew it was ridiculous. A bit of fun. Then, blow me, Arsenal went on to dominate the Prem for almost all of the season. Till Man City got into top gear. Well done Sit-ay.\n[See also: In football even the lowliest clubs have their time in the sun, however brief]\nHard cheese for Chelsea fans. Their team has been terrible. And Liverpool too. How the mighty are wobbling. The fading of Virgil van Dijk is baffling and sad. He had been so majestic, so commanding, an aristocrat among muddy oafs. Was it his injury? Or was he just tainted by the general fading of Liverpool players? It must have been fun, though, being a Villa, Brentford or Brighton fan. How the humble and modest have been smiling.\nAs a Spurs fan of over 6o years, it has been annoying, sad, depressing. Not just Arsenal doing well, but Spurs being shite. No manager, no defence, no midfield, no ideas. I was quite looking forward to Arsenal winning the Prem, as half my friends are Gooners. Just to rub in the misery.\nBut the season is ending on a high. On 28 May Carlisle United Football Club (CUFC) will be at Wembley in the Second Division play-off final against Stockport County. Oh rapture. And I intend to be there – with my son; my oldest Cumbrian friend, Melvyn; my 14-year-old granddaughter, who is football-mad; plus my lady friend Miranda. I know how to treat a gel.\nRight – now for the long-awaited, much coveted 27th annual The Fan Awards. Trumpets please.\nHair of the Season. It’s been a quiet season, tonsorially. Long hair seems to have gone, shaved hair has receded (ha ha), and silly hair has died down – but having a little shaved line or two along the side of the head has caught on. One player in every team has it, here and abroad. Footballers are such copycats, so easily influenced. What else have they got to do, after a hard two hours’ training, except count their millions and stare in the mirror?\nStep forward, Ederson, the Man City goalie. He has had his thin shaved line since early in the season. Looks well neat.\nTrick of the Season. Crowds can play their part, cheering on the troops, and also booing the opposition. Sometimes, alas, even their own players, such as Sánchez of Spurs.\nThere was an unusual ploy by the Leeds crowd, at home against Liverpool. Liverpool had been on top and were mounting yet another attack when the ball went out. A Leeds fan in the crowd caught it – and held it. Eventually, a ball boy threw another one in. Play went on and once again Liverpool were surging forward, looking dangerous – when suddenly the fan who had kept the ball threw it back into play. Two balls on the pitch. The ref had to blow his whistle: drop-ball restart; the usual scramble, ball belted away. The danger was over. The Leeds fan had stopped a possible goal against his team.\nManager of the Season. Pep, of course. You can’t beat success, and he is a genius. But which manager would you like to play for? I fear Pep would be a nightmare, if you had a poor game. City has a full reserve team, just as excellent, waiting in the wings. I did feel sorry for Walker when Pep criticised him in public. He and Foden and even De Bruyne were dropped after some less-than-brilliant performances. He can be brutal.\nKlopp is clearly a hugger and normally smiley, but not so much this season. He has to spill blood. And would I now want to fulfil my adolescent dream of playing for Spurs? You must be joking. I bet their dressing room has been toxic. Harry must be potty, staying so long.\nFor enjoyment, I think I would have liked to have played for Newcastle. They seem a happy, united lot – no egos, not really much strength in depth to worry you on an off-day. Eddie Howe is quiet, fair, stable and sensible, never rubbishing his players in public. They have had a great season, and are destined to do well in Europe.\nComing soon. A CUFC win at Wembley. Then, in July, England’s women beating everyone in the World Cup. Oh well, we can all dream. Come on you Lionesses…\n[See also: How I went viral at Spurs, why believing isn’t magic, and Jack Grealish’s calves go global]\nThis article appears in the 24 May 2023 issue of the New Statesman, The Tory Crack-Up",
  "word_count": 835,
  "scraped_at": "2026-02-14T13:24:48.120352"
}