{
  "article_id": "a4d2a7372989",
  "url": "https://www.thelocal.es/20250327/today-in-spain-a-roundup-of-the-latest-news-on-thursday-23",
  "title": "Today in Spain : A roundup of the latest news on Thursday",
  "date": "20250327T080000Z",
  "domain": "thelocal.es",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Spain arrests suspect over murder of US priest\nSpanish police said on Wednesday they had arrested a man suspected of strangling an 80-year-old US Catholic priest during a robbery in the southern city of Málaga.\nFather Richard Gross, who was from the US city of Boston, was found dead in January inside a holiday apartment he had rented in the centre of the city, where he was preparing to embark on a cruise.\nOfficers arrested a 40-year-old French national on Tuesday in the southern city of Seville, Spain's national police said in a statement. They said he was detained on suspicion of murder.\nAnother suspect was already in custody: a 27-year-old North African man arrested in late January. Police said they believed he acted as a lookout during the attack. Both men have criminal records related to theft.\nPolice suspect the two men followed Gross as he got out of a taxi the day he arrived in Málaga and followed him to the entrance of his holiday apartment, where the attack took place.\nThe two suspects then fled the scene with the priest's belongings, including his suitcase.\nUnderground economy accounts for a quarter of Spain's GDP\nA recent report published by the London-based Centre for Economic Policy Research (CEPR) estimates that the underground economy in large countries represents 17 percent of GDP, while in developing countries this figure doubles to 33 percent of GDP.\nGreece is at the top of the ranking in the EU, where the shadow economy represents 36 percent of the Hellenic nation's GDP, followed by Italy with 31 percent.\nSpain is in third place with 24 percent. Furthermore, the study found that there's been a 7 percent increase in these illicit practices in Spain from 1999 to 2020.\nREAD ALSO: How many workers in Spain don't pay taxes?\nMadrid to extend free public transport offer for children and seniors\nFrom July 1st, children aged 7 to 14 will be able to enjoy free public transport in Spain's capital, an offer which up to now had been made available to 4 to 7 year olds in Madrid (those under that age always travel for free).\nPeople over the age of 65 will continue to have free access to Madrid's metro buses, metro, trains and other means of public transport.\nKids and seniors in Madrid still need to get a seasonal transport card for the offer to apply.\nSpain World Cup 2030 chief resigns after stadium fix allegation: reports\nSpain's head of World Cup 2030 organisation resigned Wednesday after being accused of fixing the process to decide which stadiums would host matches to favour one city, reported Spanish media.\nMaría Tato stood down from her post at the Spanish football federation (RFEF) following a report published by newspaper El Mundo which said ratings for potential venues were altered to favour Anoeta in San Sebastian, at the expense of Balaídos in Vigo.\n\"On 25 June 2024, Balaídos was among the 11 venues (in Spain), but on 27 June the list was modified,\" complained mayor of Vigo, Abel Caballero, on X this week.\n\"This is extremely serious, we demand that they explain to us who changed it, why and with what criteria.\"\nThe RFEF has been hit with various crises in recent years, including that of former president Luis Rubiales who resigned in disgrace in September 2023 after forcibly kissing Women's World Cup star Jenni Hermoso on the lips following Spain's triumph in Sydney.",
  "word_count": 574,
  "scraped_at": "2026-02-14T12:34:29.338713"
}