{
  "article_id": "a515314e2527",
  "url": "https://www.the42.ie/new-match-of-the-day-presenter-6539975-Nov2024/",
  "title": "Who are the frontrunners to replace Gary Lineker as Match of the Day presenter ? ",
  "date": "20241112T123000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WITH GARY LINEKER set to leave his role as Match of the Day presenter at the end of the season, the BBC will soon begin the hunt for his replacement.\nThe former England forward has anchored the popular BBC show since 1999 and, here, the PA news agency takes a look at five candidates to replace Lineker.\nAlex Scott\nScott enjoyed a successful playing career with Arsenal and England before moving into broadcasting after her retirement in 2017.\nShe has presented The One Show and has also worked alongside Lineker in the past as a presenter of the BBC’s Sports Personality of the Year programme.\nShe was also a contestant on one of the corporation’s flagship entertainment shows, Strictly Come Dancing, in 2019, while more recently has presented Football Focus.\nGabby Logan\nFormer gymnast Logan has presented MOTD in Lineker’s absence on many occasions in the past, while she also fronted the BBC’s coverage as the Lionesses stormed to glory in the Women’s Euros in 2023.\nShe has also been involved in the BBC’s coverage of Six Nations rugby, and the last four summer Olympic Games.\nMark Chapman\n‘Chappers’ is the regular presenter of Match of the Day 2, which shows highlights of Premier League action on Sunday evenings.\nHe is also a key part of the BBC’s coverage of football on radio, presenting Sports Report on 5 Live and the Monday Night Club on the same channel.\nJason Mohammad\nMohammad first started to work for the BBC in 1997 and remains host of the organisation’s Final Score show on Saturday afternoon.\nA regular deputy for Lineker and Chapman on both Match of the Day shows, the Welsh presenter has been among the BBC’s highest earners.\nKelly Somers\nSomers became the sixth woman to present an edition of Match of the Day in 2020 and has held a variety of roles across the BBC.\nA frequent face during matches for England’s men at the 2020 Euros and the World Cup in 2022, Somers has fronted Channel 4’s coverage of the national team over the last two years.",
  "word_count": 347,
  "scraped_at": "2026-02-14T12:10:22.412358"
}