{
  "article_id": "a5180c4b37c0",
  "url": "https://www.tcpalm.com/story/opinion/readers/2023/05/10/florida-governor-ron-desantis-travel-disney-monorail-esg-child-therapy-43-haircuts-execution-letters/70193555007/",
  "title": "DeSantis travel , Disney , ESG ; child therapy ; $43 haircuts",
  "date": "20230510T100000Z",
  "domain": "tcpalm.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Secret DeSantis travel, Disney, ESG; child therapy; $43 haircuts; death verbiage | Letters\nFailure to fix homeowner's insurance woes will lead to economic ruin\nWhen I moved to Florida in 2013, I paid $130,000 for the house I live in. When I received my recent bill for homeowners’ insurance, the current value was listed at $370,100.\nI paid $1,294 for homeowners’ insurance in 2015.\nI paid $1,959 for homeowners’ insurance in 2018. By 2021, the renewal premium increased to $2,700.\nDue to an impending large premium increase in 2022, I changed my homeowner’s coverage insurer to Citizens Insurance and paid the $2,589 annual premium.\nMy recent bill from Citizens Insurance showed the renewal premium would be $3,243, with $928 not allowed due to allowable rate change restrictions, indicating my full premium would have been $4,171.\nIn nine years, my homeowner's insurance premium increased $2,877, a 220% increase.\nRequested quotes from other companies showed annual premiums ranging from $5,000 to $10,000.\nI think people are beginning to wake up and realize the prohibitive cost of homeowner's insurance makes living in Florida just too expensive for anyone except the independently wealthy.\nIf this problem is not addressed, the inflated market value of existing real estate and the high cost of homeowner's insurance will discourage many people considering a move to Florida. Many current residents will realize they can no longer afford to live here and will leave the state.\nThe housing market will collapse again. Market value of existing real estate will decrease, and the insane building of new homes and rental properties now going on will end with widespread unemployment and severe economic consequences.\nWalter Mills, Port St. Lucie\nHere's a way to get breeders to pay animal control costs\nThe city of Fort Pierce is now investing heavily in our city’s homeless animal shelter.\nI know that some think this wasteful. I believe that’s dependent on how the money is used. Saving innocent animal lives and investing in animal impound prevention programs is ethical and wise.\nThe public needs to understand that the tax dollar costs to responsibly operate the animal shelter is simple math. The amount needed is dependent on the number of animals our city residents breed, discard and abandon on our streets or dump at the shelter.\nConsider that breeders pocket profits and don’t suffer the consequences when one of their \"products' ends up at the shelter. Why not require breeders to chip their animals and, when found abandoned or discarded, require them to incur the costs of sheltering them?\nAlso, there are those who don’t embrace the \"pet for life\" commitment except when they acquire a pet. Those of you who may object to the costs are pointing their fingers in the wrong direction!\nIt is exciting Fort Pierce is now embracing the animal shelter and making the wise investment in a future animal clinic to provide more proactive services to help reduce the number of animals needing sheltering. You don’t have to be a mathematician to figure out that if you want lower costs, lower the amount of animals that need sheltering.\nIf you think Fort Pierce is spending too much on sheltering, think again!\nBroward County for years has planned a replacement animal shelter, and in March hired Stiles Corp. to build the $15.2 million shelter. It's expected to open next year.\nSo, the fact is that shelter costs depend on you. Want to help keep costs down? Don’t breed or buy; adopt, don’t shop!\nSusan Parry, founder of United for Animals, lives in Fort Pierce.\nPut children first: Get them therapy if they need it\nIt is OK to put your preschool-age children into therapy.\nThere are many types of therapy, however. Many children benefit from speech, behavioral and even physical therapy. The importance of starting these therapies at a young age is not often discussed, although it should be. Therapy starting from preschool can give children a necessary head start and can improve their physical and cognitive development as they age.\nIt is important to remember that getting your child therapy does not mean that you have done anything wrong as a parent; it’s quite the opposite. It simply means that you recognize your child needs a little help and are doing what you can in order to ensure their success.\nA Centers for Disease Control article, “Data and Statistics on Children’s Mental Health,” said that “1 in 6 U.S. children aged 2–8 years (17.4%) had a diagnosed mental, behavioral, or developmental disorder.”\nIn many of these cases, behavioral therapy could be a much-needed solution. It is shown to help these children in many aspects of their life, such as obedient behavior on a sports team, appropriate behavior both in private and public spaces, and in their readiness to enter kindergarten with the abilities to learn at the right pace.\nIt is very important to put our children first and get them the therapy they need in order to lead them to success.\nJamie Polley, Vero Beach\nMartin County must hold builder accountable\nD.R. Horton developed Jensen Village in Jensen Beach, which is part of the Jensen Beach Country Club. D.R. Horton left the development with more than 188 issues that have not been resolved, which included disrepair of the roads, sidewalks, fencing and a community pool.\nCommunication with D.R. Horton is minimal or nonexistent.\nHomes in the development that were under construction and not yet closed upon by potential buyers were left open to the elements with windows, front doors and garage doors wide open, with air conditioning running and the inside of the houses painted, with carpeting and tile in place.\nDuring the construction of homes in Jensen Village, D.R. Horton could not keep stable construction superintendents to oversee construction. Many homeowners, after purchasing homes, developed leaking roofs and electrical, air conditioning, appliance and driveway problems.\nMartin County continues to allow D.R. Horton to build in the Stuart, Jensen Beach and Palm City areas after the company leaves a prior development unfinished. D.R. Horton has the following developments moving forward in Martin County: The Oaks, Palm City; Sabal Pointe, Jensen Beach; Willow Pointe, Stuart; Sandpiper Square, Stuart; and Preserve at Park Trace, Stuart.\nThe ratings by 82% of homebuyers on Trust Pilot give DR Horton a 1 out of 5-star rating and list many issues. Reports indicate D.R. Horton is responsible for flooding, health and other issues on Green Lane and Ronny’s RV Ranch and Mobile Home Park in Stuart.\nIt is imperative that D.R. Horton be held accountable to communicate and address health, homeowner and development issues. The company should not be allowed to continue five more developments in Martin County without addressing more than 188 issues in Jensen Village and issues on Green Lane and Ronny’s RV Ranch and Mobile Home Park.\nPam Ouellette, Jensen Beach\nImpact 100 critical to Police Athletic League\nIt’s difficult to express the level of gratitude everyone involved with Martin County Police Athletic League — members, their families, mentors, sponsors, supporters and staff — have for Impact 100 Martin.\nThis incredible organization of women leaders who are committed to putting their dollars and ideas toward improving our community blessed us beyond words with a $100,000 impact contribution.\nWe’re extremely thankful and honored to even be included among such an elite class of top-quality nonprofits, much less to win. The Impact 100 grant will enable us to purchase and retrofit a delivery truck into a mobile PAL. That way we can take our programs — athletic activity, organized sports and our acclaimed iLead leadership course — to kids in Hobe Sound and Indiantown who can’t get to our Palm City facility.\nWith our membership growing by 62% in just two years, PAL is committed to crime prevention through programs — which include boxing, wrestling, soccer, golf and drumline — that appeal to elementary, middle and high school students. About 20% of our kids are court-sanctioned to attend our programs. The other 80% come from families who know the value of what we do, but can’t afford the costs of organized sports.\nPAL covers the cost for free, thanks to our generous supporters. Although Martin County sheriff’s deputies donate their time as mentors, we don’t receive tax dollars from any source. That’s why the support of Impact 100 makes a difference.\nWe’ll put it to good use, catering to kids from underserved communities as we encourage them to put down their phones and the sedentary life and embrace their youthful energy and healthy living. They’ll learn how to lead, resist peer pressure, help others and grow into their rightful roles as “healthy, productive leaders of the future.”\nNoel Delvalle, Palm City\nSecret DeSantis trips show lack of commitment to public\nThe bill that would prohibit the disclosure of travel by Gov. Ron DeSantis and other designated state leaders and the reasons given for this legislation (security) is pure fiction.\nFor a governor who allegedly prides himself on transparency, the security claim is nothing but smoke and mirrors to hide the real intent of these trips and, more importantly, who paid for them. We know that the governor travels with a contingent of Florida Department of Law Enforcement security personnel and that any threats to the governor and/or other state leaders have been virtually nonexistent.\nTo further muddle this issue, the claim that even disclosing the destination of these trips once they are completed would reveal a pattern of travel, and thus it could also be considered a security issue, is almost comical. Once again, the governor and his cronies have prevailed, the democratic process has taken a back seat, and the governor has shown his disdain for the taxpayers and voters in the state of Florida.\nCharles Miller, Port St. Lucie\nFlorida right to inspect Disney monorails, other things\nThe state of Florida is wise to inspect the Disney monorail.\nHow many people have died on the monorail? Maybe these statistics are being kept secret.\nWe know that 100 people or so have died on the Brightline rail. Many of them were reportedly committing suicide. How many people have committed suicide at Disney? We need to have these facts.\nGeorgeann Allard Calendine, Vero Beach\nDeSantis' lack of business acumen to hurt Floridians\nGov. Ron DeSantis is at it again, hurting the people of the state of Florida and abandoning all pretense of being a Republican.\nHis ban on investing with any entity that considers ESG (environmental, social and governance) as part of its investment decision making is — I am not sure how to say this, except it is a dumb as a bag of doorknobs!\nESG is a rating service — just like well-known Moody’s; in fact, Moody’s produces an ESG rating. It isn’t a way of life; it is information on the quality of a company's management team. Considering more than pure narrow financial criteria has been exemplary corporate philosophy since I went to business school in the late 1970s. It isn’t new at all.\nA successful company finds a common ground with all its constituents, and the result is bigger than it would be by focusing on any one. DeSantis apparently doesn’t understand this, because he has never been in business and doesn’t believe in consensus.\nExcluding high ESG companies means excluding Apple, Microsoft, Merck, Accenture, Sherwin-Williams, Mercedes and many other highly successful companies that have produced extraordinary financial returns for shareholders. Excluding high ESG firms from Florida investment will without a doubt reduce the return of Florida’s funds, ultimately hurting the people who depend on the state being successful, like worker pension plans and important rainy day funds like hurricane recovery funds.\nDeSantis has lost his footing as a leader as he now continually rails against corporate development and forward-looking leadership. These are things he clearly doesn’t understand and should as a governor, much less in any higher office.\nDavid Hunter, Vero Beach\nDeSantis faces problems in primaries\nIf you think the governor is absent now, traveling overseas to make his pitch, wait until he declares himself as a candidate.\nPerhaps instead of shaking hands and kissing babies overseas, he should take an advance class at Toastmasters, because his assets are going to be handed to him in the mudslinging GOP primaries.\nMike Maldonado, Port St. Lucie\nGruesome details of execution, murder not fit for print\nI was deeply disturbed by the article of May 5, \"Florida inmate Barwick apologizes before execution,\" by Mollye Barrows. Her description of a man being executed with significant details was not fit for a newspaper.\nHer detailed description was upsetting, nauseating and unnecessary. I will not repeat the details, as they would make others who have not read the article very disgusted. Equally upsetting were also the details of how this murderer killed Rebecca Wendt.\nThis type of information is for true stories on TV with warnings about the details. If I read another article like this, I will not buy the newspaper. Please consider the public when much-needed editing should be completed.\nBarbara Fernandez, Stuart\nCharge me $43 for my haircut and I will make a big change\nThe column in your newspaper May 4 has several opinions about the price of haircuts. One said the average men's haircut is $43 vs. a woman's $69.\nI have been going to the same barber for years and I am quite fond of him. We have been on cruises with him, and we go to the same church: He charges $17, and I give him $20, to include a tip. While I am quite fond of him, and he gives a very good haircut, if he increased his price to the averages quoted in a website called \"You Probably Need a Haircut\" of $43 for a man and $69 for a woman, my wife would be cutting my hair and/or it would be reaching my shoulders!\nGeorge Gordon, Stuart",
  "word_count": 2313,
  "scraped_at": "2026-02-14T12:15:02.568403"
}