{
  "article_id": "a543438594b9",
  "url": "https://tvline.com/lists/cancelled-shows-actors-new-roles-photos-2023/",
  "title": "New TV Roles for Candice Patton , Milo Ventimiglia , Kat McNamara & More – TVLine",
  "date": "20230619T234500Z",
  "domain": "tvline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Dream Roles For Stars Of Cancelled Shows: #OneChicago's New Firefighter And Doc, Gender-Swapped Mulder, YOU's Final Love Interest And More\nNow that everyone has had some time to recover from the broadcast networks' spring cancellation spree, it's time to look to the future and revisit TVLine's annual tradition of dreaming up possible new gigs for the cast members of recently axed shows.\nThe Grim Reaper visited many comedies and dramas, bringing freshman newbies like Alaska Daily, The Winchesters, True Lies and Gotham Knights to a premature end. Meanwhile, The Flash and Riverdale announced their final-season runs, freeing up even more of our small-screen faves for fresh roles. So TVLine put on its casting director hat and crafted some hypothetical characters for them, like a Company You Keep con man as Chicago Fire's new leader, a Walker Independence star as a Good Doctor resident and a Goldbergs alum as an Animal Control wrangler.\nPlus, we've come up with two scenarios that would reunite stars from Reba and 30 Rock, so you're welcome! And we think you'll really want to believe in our dream role for Big Sky's Kylie Bunbury.\n(But again: These are dream castings from Team TVLine, not actual news items. Not yet, anyway!)\nScroll through the list below to review our picks, then hit the comments to share the beloved faces you want back on TV ASAP.\n14. Candice Patton\nPast Gig: The Flash's Pulitzer Prize-winning journalist Iris West-Allen\nNew Gig: The apple of Joe Goldberg's eye — and perhaps the one who finally takes him down? — during the fifth and final season of the Greg Berlanti-EP'd YOU\n13. Catherine Haena Kim\nPast Gig: The Company You Keep CIA agent Emma Hill\nNew Gig: A fun-loving but dedicated new ED doctor on Chicago Med\n12. Cheyenne Jackson\nPast Gig: Kat's friend and love interest Max on Call Me Kat\nNew Gig: A '90s pop star mounting a comeback who catches Summer's eye on Girls5eva, reuniting him with 30 Rock's Tina Fey — plus, he can sing!\n11. Hilary Swank\nPast Gig: No-nonsense reporter Eileen on Alaska Daily\nNew Gig: A no-nonsense cop investigating a bizarre murder on the new season of Fargo. (Hey, she's already acclimated to the cold.)\n10. Jimmy Smits\nPast Gig: East New York's John Suarez, the veteran two-star NYPD Chief who was name was floated by Councilman Sharpe, a wannabe mayor, to be the new police commissioner\nNew Gig: The same John Suarez, who after falling out of favor with Sharpe nonetheless catches the eye of Blue Bloods' Mayor Chase, as a possible replacement for Frank Reagan\n9. JoJo Fleites\nPast Gig: Mary's hunter pal Carlos on The Winchesters\nNew Gig: A non-binary new Coterie roommate on Good Trouble. (Think of the hair-off with Gael!)\n8. Kat McNamara\nPast Gig: The strong-willed Abby Walker on Walker Independence\nNew Gig: A new (and highly skilled) surgical resident on The Good Doctor who has to work twice as hard to prove herself because her father is a member of the board\n7. KJ Apa\nPast gig: Embattled Riverdale dreamboat Archie Andrews\nNew gig: The ab-fabulous Station 19 probie that Jack doesn't want dating sister Brooke\n6. Kyla Pratt\nPast Gig: Cat café waitress Randi on Call Me Kat\nNew Gig: An overly enthusiastic med school student who gets on Abishola's last nerve on Bob Hearts Abishola\n5. Kylie Bunbury\nPast Gig: Private investigator Cassie Dewell on Big Sky\nNew Gig: Either Scully or a gender-swapped Mulder — we're not picky! — in Ryan Coogler's reportedly in-the-works diverse X-Files reboot\n4. Milo Ventimiglia\nPast Gig: Con man Charlie Nicoletti on The Company You Keep\nNew Gig: A legendary firefighter who takes over as rescue squad's leader during Severide's (continued?) absence on Chicago Fire\n3. Navia Robinson\nPast Gig: Scrappy, badass Carrie aka the Robin to the late Bruce Wayne's Batman on Gotham Knights\nNew Gig: Another mysterious transfer student, who enters Jin's orbit, in American Born Chinese Season 2\n2. Steve Howey\nPast Gig: Skilled international spy Harry Tasker on True Lies\nNew Gig: A rival high school football coach on Young Sheldon who catches the eye of all the women in Medford — including June Ballard and Brenda Sparks (played by Howey's former Reba costars Reba McEntire and Melissa Peterman)\n1. Troy Gentile\nPast Gig: Karate master, wannabe rapper and naive middle child Barry on The Goldbergs\nNew Gig: An annoyingly hyper new animal wrangler on Animal Control",
  "word_count": 742,
  "scraped_at": "2026-02-14T13:08:04.850658"
}