{
  "article_id": "a55598909571",
  "url": "https://www.france24.com/en/live-news/20240518-chelsea-crowned-women-s-super-league-champions-as-hayes-bows-out-in-style",
  "title": "Chelsea crowned Women Super League champions as Hayes bows out in style",
  "date": "20240518T174500Z",
  "domain": "france24.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea crowned Women's Super League champions as Hayes bows out in style\nLondon (AFP) – Chelsea were crowned Women's Super League champions for a fifth successive season as boss Emma Hayes bowed out in style with a title-clinching 6-0 rout of Manchester United on Saturday.\nIssued on: Modified:\nHayes' side went into the last day of the season ahead of second-placed Manchester City on goal difference in a thrilling finish to the title race.\nChelsea raced into a four-goal lead by half-time at Old Trafford and, with City unable to match that spree in their 2-1 win at Aston Villa, the silverware was destined for Stamford Bridge once again.\nLevel on points with City, the Blues finished on top with a +53 goal difference compared to City's +46.\n\"What a wonderful performance. The hardest thing to do is five in a row because people take their eye off the ball,\" Hayes said.\n\"I can't say it's my most enjoyable title. It's definitely been the toughest without doubt, for that reason probably the sweetest.\"\nIt was a fitting finale for Hayes, who was saying farewell to the club she has brought so much success during 12 years in charge.\nHayes is leaving to take over as United States Women's boss after winning seven Super League titles, five FA Cups and two League Cups.\n\"Great memories, listening to the fans, the connection with the players. I just haven't got any more to give, I know that,\" Hayes said.\nThe 47-year-old's legacy is not just the silverware in Chelsea's trophy cabinet, but also her key role in helping the huge growth in popularity of the women's game in Britain.\n\"Everyone said girls can't play, nor can they fill stadiums, nor can they get paid, nor can they create history,\" Hayes said.\n\"Not only are we not going away but we are going to fill them every week. Women's football now is a serious business and that for me is what it's about.\"\nNo mercy\nCity had hoped to spoil Hayes' leaving party by winning the title for the first time since 2016.\nBut Chelsea had spent 153 days on top of the table, compared to 64 for City, and they rounded off their seventh title in eight seasons in blistering fashion.\nChelsea made a dream start against Women's FA Cup winners United in the second minute as Guro Reiten's cross picked out Mayra Ramirez and she rose highest to head home.\nSix minutes later, Hayes was punching the air in delight as Johanna Kaneryd clipped a composed finish past United keeper Mary Earps.\nOver at Villa Park, Mary Fowler gave City hope with a powerful strike in the 21st minute.\nBut Ramirez ensured Chelsea would not have to worry about being caught by City.\nSurging away down the right flank, Ramirez's pin-point cross was tapped in by Sjoeke Nusken in the 43rd minute.\nAnd Ramirez waltzed through the hapless United defence and smashed a thunderous drive into the roof of the net in first-half stoppage time.\nHayes' team showed no mercy and Melanie Leupolz scored their fifth in the 47th minute with a close-range effort.\nTheir title hopes gone, City conceded a 67th-minute equaliser to Rachel Daly before Lauren Hemp at least ensured the visitors finished on a winning note.\nFran Kirby, making her final Chelsea appearance after nine years, capped her own farewell with the sixth goal in the 85th minute as the title celebrations started in earnest.\n© 2024 AFP",
  "word_count": 579,
  "scraped_at": "2026-02-14T12:41:47.853884"
}