{
  "article_id": "a5584dabd43a",
  "url": "https://www.con-telegraph.ie/2025/04/30/fa-carefully-reviewing-transgender-inclusion-policy-after-supreme-court-ruling/",
  "title": "FA  carefully reviewing  transgender inclusion policy after Supreme Court ruling",
  "date": "20250430T104500Z",
  "domain": "con-telegraph.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FA ‘carefully reviewing’ transgender inclusion policy after Supreme Court ruling\nBy Jamie Gardner, PA Chief Sports Reporter\nThe Football Association says it is “carefully reviewing” its transgender inclusion policy following a UK Supreme Court ruling earlier this month.\nThe FA issued an update to its policy shortly prior to the ruling which continued to allow transgender women to play in women’s football with reduced testosterone levels, but added a formal process allowing the governing body to exercise ultimate discretion to refuse or remove eligibility to players on grounds of safety or fairness.\nHowever, it has confirmed the policy is now being examined again.\nAn FA spokesperson said: “We are carefully reviewing our policy and taking legal advice.”\nThe Scottish Football Association is understood to have updated its policy so that only those born female can play in women and girls’ football from under-13s upwards next season.\nThe Supreme Court ruling issued on April 16 offered clarification on terms used in the Equality Act. It concluded that Section 195 of the Act, which allows the lawful exclusion of athletes based on sex from gender-affected sports, was “plainly predicated on biological sex”.\nFormer FA chairman Lord Triesman told The Telegraph at the time of the ruling: “The pitiful excuses of some sports bodies, and especially the FA, have been shown to be unlawful.\n“Women’s sport, as in all else, is defined by biology facts. There is no room for alternative propositions and the bodies concerned must reform and comply with the law at once or certainly face constant legal challenges.”\nSince the ruling was handed down, the Ultimate Pool Group has updated its policy to ban trans women, having also received a report that pool was a gender-affected sport.\nSnooker’s global governing body, the World Professional Billiards and Snooker Association, is also reviewing its policy.",
  "word_count": 303,
  "scraped_at": "2026-02-14T12:11:41.019156"
}