{
  "article_id": "a59aca54bb2f",
  "url": "https://www.cityandstateny.com/power-lists/2024/07/40-their-40s/398218/",
  "title": "40 In Their 40s",
  "date": "20240729T210000Z",
  "domain": "cityandstateny.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "In their fifth decade, the New Yorkers on our inaugural 40 In Their 40s list are hitting their professional stride – drawing on two-plus decades of education and experience to make the maximum impact in their respective fields.\nMany of this year’s honorees are on the second or third incarnations of their careers in areas ranging from law and government to the arts, sales, social work and urban planning. Moving between the public, private and nonprofit sectors, City & State New York’s 40-something power players go where they can most fully realize their ambitions – and balance large-scale projects with the busiest years of family life.\nIn 2024, 40-somethings are split between Gen Xers (roughly 44 and up) and millennials. Some have grown children, others have toddlers – but all of them remember a world before Google, and a New York with the twin towers.\nWith decades left to imprint their legacy, here’s a look at 40 of New York’s most noteworthy mid-career professionals.\nTimothy Atkins\nAt 47, Timothy Atkins finds that representing the Life Insurance Council of New York suits his “middle of the road” temperament.\n“The companies I represent are not right or left, Democrat or Republican,” says Atkins, currently LICONY’s counsel and managing director of legislative affairs. Having worked for both parties at the state level, he retains “a lot of reverence for elected officials – and relationships inside that are helpful.”\nThe prospect of such a network inspired the Catskills native to study law, which his politically active grandmother – a Democrat and role model – assured Atkins would open doors. It did, allowing the young attorney entrée to a variety of advocacy and state government roles.\nThese included five years in the state Senate where, as the GOP’s senior counsel and legislative operations chief, he worked on the bill that launched Uber and the ride-hailing industry in New York. He also directed intergovernmental affairs for the powerful state Dormitory Authority. “I loved public service,” he says. Watching policy transform his home state “was extraordinarily rewarding, professionally.”\nAtkins’ work today, while less partisan, is no less consequential: He’s currently lobbying to increase the state’s statutory disability benefit for the first time in 30 years. “I loved the opportunity to engage, at a young age, in issues that have a real impact on the communities I love,” he says. “But as I’ve gotten older, it’s nice to be a step removed from the politics.”\nEric Blankenbaker\nOne benefit of being a communications pro like Eric Blankenbaker is that you always know what to say – even when the question is, “How do we handle the Middle East conflict?”\nPlenty have been stumped by that one. But when one of Blankenbaker’s corporate clients posed it recently, the 40-year-old was ready: “I said, let’s look at the last 150 statements that companies have put out – and use AI to analyze what rhetoric has been most effective.”\nAs a crisis specialist, Blankenbaker is professionally comfortable with the uncomfortable. His team at Weber Shandwick, the public affairs firm where he previously worked, won a SABRE Award for its campaign to restore the reputation of rail company Norfolk Southern after a train derailment.\nPolitics were “always part of my DNA,” Blankenbaker says. Thanks to his mother’s job working for Robert F. Kennedy, current affairs were breakfast table conversations at their Maryland home. Blankenbaker considered journalism before opting to work for politicians, including Rep. Tom Suozzi and former U.S. Sen. Joe Lieberman.\nHis newest challenge is the fallout of high-profile fraud affecting the Zelle payment app. As of this month, Blankenbaker is in charge of strategic and public affairs communications at Early Warning Services, the joint-venture financial services company behind Zelle.\nA millennial, he takes a proactive approach to confronting technology’s challenges. “Maybe I don’t know what the correct string is to input into ChatGPT,” Blankenbaker says. “But I can say, ‘This is a problem to solve – and we’re learning from one another.’”\nNate Bliss\nNate Bliss spent 20 years building up the New York City economy – masterminding the Coney Island renaissance and, later, supporting the city Economic Development Corp. during a period of exceptional dynamism.\nHe was working for Taconic Partners, a real estate developer, when the siren call of City Hall beckoned two years ago – and Bliss was soon back in government. Heading up housing, economic development and workforce for New York City Mayor Eric Adams, he says, is an irresistible “opportunity to address the unique challenges” of the post-pandemic moment.\n“We’re in the midst of a structural reset,” says Bliss, 41. Citing the truism that public and private sectors speak different languages, he adds, “I realized there’s a lot of value in someone who could speak both.”\nBliss grew up in suburban Washington, D.C., and moved to New York a week before 9/11, an experience that cemented his urbanist inclinations. Initially drawn to the city’s music scene, he found his niche instead in urban planning, leading the Coney Island Alliance through a rezoning effort that jump-started the area’s amusement economy. At the New York City Economic Development Corp., Bliss built a team to tackle large-scale projects, like the growth of Long Island City.\nHe learned that “getting anything big done in the city requires work with multiple stakeholders – and helping them find alignment,” Bliss says. Now Bliss brings these insights to challenges such as the housing crisis and income equality: “It’s been rewarding to work on such issues these past two years.”\nKate Blumm\nNew York City native Kate Blumm never tires of telling the stories of the city that shaped her. Now a senior vice president at Rubenstein, the storied public relations agency, the 40-year-old has devoted her career to celebrating New York’s evolution through its institutions.\nAfter serving in a variety of city communications roles, Blumm says, “It was important to land at a place that loves New York as much as I do.” Her portfolio has included Rockefeller Center, the Penn District and One World Trade Center – properties “that have a real civic dimension and are important to all New Yorkers,” she says.\nRaised on the Upper West Side, Blumm earned an English degree from New York University and found PR a natural fit: “Language is how I understand the world.” In the years since, she has shaped communications around the Brooklyn Botanic Garden’s $100 million capital campaign and – with the city Economic Development Corp. – the Lower East Side’s Essex Crossing and Hunter’s Point South in Queens, projects that transformed New York neighborhoods.\nCrafting policy speeches for Mayor Bill de Blasio, Blumm says, was “one of the toughest and best experiences.” Most recently, she worked pro bono to secure national coverage for the Debt Gala, a social justice-minded spin on the starry Met Gala.\nBlumm’s career “is like getting a crash course from the best and the brightest minds in the business about any given policy space,” she says, “coming together to do a great project – and telling a great story about it.”\nKristine Borok\nIn culinary school, Kristine Borok mastered exotic techniques. But one of her most treasured recipes is among the simplest: her Filipino grandmother’s leche flan. “Preparing it is an extension of all the women in my family,” she says.\nThe connections between women, cooking and community are at the heart of Borok’s work at Hot Bread Kitchen, the nonprofit that supports New Yorkers in hospitality careers. Most, like Borok, are immigrants and women of color. She was born in the Philippines and grew up in one of the few nonwhite families in the 1980s Rockaways.\nThose experiences, coupled with her own early restaurant career (and women’s studies degrees from the University at Albany), inform Borok’s work as chief strategy and advancement officer. “I can’t imagine a better fit,” says Borok, 46. She comes from a family of restaurateurs, but the career path was still a hard sell to her immigrant parents: “There was no Food Network yet, no culture of celebrity chefs.”\nBorok didn’t end up needing a TV show to make an impact. Since joining Hot Bread Kitchen in 2019, she has boosted fundraising to $8 million annually, up from $3 million. Her work marshaling partnerships during the coronavirus pandemic helped expand the organization’s capacity to 550 clients annually, up from 100 five years ago.\n“I love that we’re this nonprofit arm of the food industry. It feels personally and professionally satisfying,” Borok says. “And I love being part of people’s life transformations – and hearing their stories.”\nCaroline Brancatella\nCaroline Brancatella’s career in health law has been defined as much by the power of female solidarity as by her successes in handling highly regulated health care transactions as well as Medicaid and Medicare.\nShe roomed with her close-in-age younger sister during law school at the University at Buffalo. “It was like a bad Jane Austen novel,” she recalls, laughing. Both ended up as attorneys in Albany, where the elder Brancatella has been of counsel at Greenberg Traurig for 15 years.\nHer arrival at the firm coincided with the dawn of the Affordable Care Act, shaping a career centered around health care and FDA practice. She’s also a litigator who specializes in mergers, acquisitions and compliance matters.\n“I’ve watched the evolution of Obamacare, how it has affected the market and the expansion of New York Medicaid,” says Brancatella, who represents insurance plans, providers and government-payer programs. “And essentially, the trying of new things to make our health care system work.”\nA Buffalo native and Bills fan, Brancatella remains “a big supporter of upstate cities.” But she stays in Albany in no small part for the female support system where, once mentored herself, she now mentors others.\n“I clerked for a female federal judge, which taught me a lot about being a professional,” Brancatella says. “And one reason I stay at this specific firm is because I have such tremendous colleagues – not just in their substance, but in how they negotiate and manage their lives.”\nMatt Cohen\nAt the Long Island Association, Matt Cohen brings a millennial vision to a century-old organization tackling the island’s contemporary challenges.\n“Long Island is a fun place to live and a good place to work,” Cohen says. “We’ve got top schools and hospitals, great beaches. There’s a lot to like.”\nAs a 42-year-old parent, though, Cohen has a firsthand view of the issues on his home turf – including the housing and child care shortages that threaten Long Island’s economic growth.\nWith LIA, Cohen has led efforts to create more housing through legalizing accessory dwelling units. He also rallies his membership – businesses and organizations throughout Nassau and Suffolk counties – to create workforce housing through public-private partnerships, and exhorts them to prioritize child care “as a business issue,” says Cohen, who also chairs the Child Care Council of Suffolk.\nThe Northport native’s passion for policy started early: By 14, he was interning with Rep. Gary Ackerman. Apart from four years at the University of Pennsylvania, Cohen has always lived on Long Island. He earned his law degree from Hofstra and, prior to joining LIA, headed government affairs for the Long Island Power Authority and was U.S. Sen. Charles Schumer’s Long Island director.\n“Long Island has come a long way, especially in terms of the mindset around housing, but our collective mentality has to keep evolving,” Cohen says. “We’re a new generation of business leaders – and it’s up to us to talk about these issues.”\nMelissa D’Andrea\nSeen one way, Melissa D’Andrea sells software for Workday, whose products facilitate human resources and financial management. But D’Andrea views her job as a public service calling. “There’s something very rewarding about working for the state,” says the government account executive, who specializes in selling to New York and New England state departments and agencies.\n“I’ve always lived here. I’m a New York taxpayer. My kids went to college here, and now they’re looking for jobs,” says D’Andrea of her commitment. “So I understand the issues the state is dealing with.”\nNow 44, she grew up in Saratoga Springs, where her father specialized in a very old technology – blacksmithing for the local horse tracks. After marrying, D’Andrea had three daughters and launched her career in technology sales a decade ago, specializing in state contracts.\n“It’s a big value I provide, knowing how to navigate the procurement process for that customer,” D’Andrea says. At Oracle, where she was an account executive handling state public sector sales, D’Andrea was the top performer on her cloud infrastructure team for 2023.\nAs a mother, D’Andrea is conscious of being a role model – “that strong female influence, showing there’s tremendous opportunity to be successful for yourself.” And while sales is about numbers, D’Andrea knows her work – facilitating the software that powers projects like Medicaid – is ultimately about human beings.\n“Everything we’re doing is making a difference, making things easier for people,” she says. “Technology changes lives.”\nKristin Duffy\nA self-described lifelong “news junkie,\" Kristin Duffy thought she’d be a journalist – but found her narrative inclinations were best suited to government affairs. “It really is storytelling,” Duffy says of her profession. “You convey the most important parts of whatever issue you’re working on, and get that story to the decision-makers.”\nDuffy currently does that at AT&T, where, as director of state legislative and regulatory affairs, she communicates the value of the company’s new cell towers – a process essential to closing the rural connectivity gap. She recently convinced the state Legislature to boost funding for upstate New York’s emergency response system from $20 million to $85 million, allowing for 911 upgrades.\nThe Brunswick native, 41, realized during a college TV news internship that she wanted to go deeper into issues – and work on solutions. After college, she worked for then-state Senate Majority Leader Joseph Bruno and for the New York State Nurses Association, where she championed an anti-violence bill.\nAt AT&T, Duffy has found satisfaction in working with the company’s foundation, which has committed $2 million since 2022 toward closing the digital divide – including the ongoing rollout of AT&T’s connecting learning centers at Boys and Girls Club as well as at Girls Inc.\n“I figure out what the needs are in our community, make recommendations and help shepherd projects to fruition,” Duffy says. “I like being the middleman – educating lawmakers on the importance of an issue, and working with the Legislature to solve problems.”\nElliott Ehrenreich\nElliott Ehrenreich’s legal skills are highly in demand by corporate and developer clients. But while he is known as an attorney, “I also see myself as a business adviser,” he says.\n“I take into account not only legal matters, but also the very real soft issues that come up – clients’ image within a community or industry, for instance – and help them sort through various decisions.”\nEhrenreich, 45, is a partner in the Buffalo office of Phillips Lytle, where he specializes in corporate and business law and frequently counsels real estate developers on financing and other transactions. A Duquesne Law graduate, he practices in both Pennsylvania and New York and previously spent nearly two decades at Knox McLaughlin.\nIn particular, Ehrenreich enjoys shepherding businesses throughout the corporate life cycle. He recalls one client who started a telepsychiatry company with limited capital. Under the attorney’s guidance, the business grew over a decade of investments and sold for “millions and millions,” Ehrenreich says. “It was phenomenal to see all that hard work pay off, for what was really the capstone of these individuals’ careers.”\nIt’s not all business for Ehrenreich, however. In addition to representing UPMC, the Western Pennsylvania health system, he also serves on its patient quality committee and other boards. “It’s not all ribbon-cuttings: We drill down into the minutiae of safety that helps every patient who goes into a hospital,” he says. “That sort of work isn’t glamorous – but it’s incredibly rewarding.”\nJoseph Fontano\nJoseph Fontano caught the political bug long before he caught the labor bug, but at the same time he calls the transition from one to the other basically seamless.\nFollowing stints as a staffer in the state Legislature and for the New York City Council, Fontano joined Local 338 as deputy political director, before being elected secretary-treasurer in 2015. He views the move into organized labor as a way to focus more on the issues that drive him.\n“It gave me the ability to fight for what I grew up believing in, good wages, the ability to retire with dignity and affordable health care,” Fontano says about the move.\nFontano says his work on the growth of the cannabis industry in the state has been the proudest accomplishment of his career at Local 338. Fontano started working on the issue when it was largely about the medicinal marijuana industry and growing union jobs before the legalization of recreational marijuana. Fontano says that it was largely a team effort from Local 338.\n“We were developing a new industry in New York and we wanted good-paying jobs,” he says.\nWith his focus more on the bargaining table and negotiating rather than strictly on the legislative agenda, Fontano says he finds the hours of negotiating worth it for one reason.\n“When you have members look for you at the end of the negotiations and say, ‘it works for us,’ there is nothing better than that,” Fontano says.\nMichael Frame\nAfter two decades advocating for higher education, Michael Frame now represents the renascent industry of his upstate youth.\nJoining the Manufacturers Association of Central New York two years ago as operations chief was less a pivot than an evolution of his core mission – to provide people with opportunities “at the intersection of policy and talent development,” says Frame, now MACNY’s executive vice president. “I’m growing New York state talent from a different angle, focused on nontraditional pathways.”\nThese include technical apprenticeships and other initiatives aimed at training young people for in-demand jobs across a 26-county region.\nFrame grew up near Syracuse and “fell in love with advocacy” on a Cornell University trip to lobby Congress for federal financial aid. He graduated into lobbying roles with Florida State University, setting up its first Washington, D.C., office, and the State University of New York, where Frame coordinated a presidential visit and, for Binghamton University, helped increase research funding by $10 million.\n“Policy teaches you how to be strategic in your thinking,” Frame says. He is gratified to apply that strategy to his home region, where he “grew up in the shadow” of shuttered factories.\nSmaller manufacturers remain the lifeblood of the industry, he notes, and the Biden administration’s CHIPS Act is like a transfusion, which Frame leverages to jump-start the supply chain through semiconductor production. “We’re part of helping them be successful,” the Mohawk Valley resident says of MACNY’s 330 member companies. “To be part of this renaissance is really exciting.”\nNickesha Francis\nNickesha Francis’ advocacy started early – on the playground in her native Jamaica. “I was always fighting injustice,” recalls the 44-year-old. “I was raised with a sense of community and taking care of each other, and that has carried through in every aspect of my work and my life.”\nIt certainly informs Francis’ work as a policy and advocacy manager at Good Shepherd Services, the New York City child welfare agency where she has logged nearly a decade. Last fall, she successfully rallied with a coalition to restore city funding for educational and restorative justice programs.\nNew York, where Francis came to study psychology at Mercy College, was initially a culture shock after Jamaica, “a little island where everybody knows everybody.” But she found satisfaction in case management and advocacy roles on behalf of families at The Children’s Village, a social services organization, and opted for a policy track at the Columbia University School of Social Work.\nHer perspective as an immigrant of color makes Francis especially effective in representing New York’s marginalized populations. One of her proudest achievements came during a graduate school internship with the Correctional Association of New York, when she campaigned to make New York among the final states to raise the age threshold for juvenile justice.\n“There was a lot of ignorance and discrimination that I experienced as an immigrant,” Francis says. “That really shaped my advocacy against injustice and bias.” Whether seeing patients or fighting for them, she adds, “I always come from a social work lens.”\nJosh Gold\nAn influential health care union and a ride-hailing startup may appear to have little in common. But for political strategist Josh Gold, 1199SEIU’s large-scale campaigns provided the ideal training ground for working at Uber – where, in less than a decade, his policy efforts helped establish New York’s ride-hailing industry.\n“1199 was a great place to learn politics,” says Gold, an attorney who is now Uber’s senior director for public policy and communications. Working on Medicaid funding, “I learned relationship building and delved deep into issues.”\nThose lessons helped him to mount the multiyear campaign that finally changed state law, allowing Uber to operate legally. Such an outcome was hardly a given when Gold joined the startup in 2016 – nor was a smooth relationship with the New York City taxi industry, which staunchly opposed its startup rival. Gold achieved the détente by positioning Uber as an ally in the taxi industry’s recovery; 10% of taxi rides are now referred to Uber drivers.\nRaised in White Plains, Gold followed his mother into the law and found his niche in politics early, working for the city comptroller and leading public affairs for the New York Hotel and Motel Trades Council. Apart from Uber, he is proudest of managing the external campaign for then-Mayor Bill de Blasio’s groundbreaking pre-K funding initiative.\n“As a parent now, I think it’s one of the most impactful parts of his legacy,” Gold says. “And I was a part of that.”\nEldad Gothelf\nEldad Gothelf’s childhood dream was playing shortstop for the New York Mets. After college, however, he realized urban planning “is the umbrella for everything that is interesting to me,” he says. “Politics, development, infrastructure, everything you see when you walk out of your house.”\nNow 47, Gothelf brings those interests together at Kasirer, where he is senior vice president for real estate. Since his first post-graduate school job – working on South Williamsburg’s redevelopment – he has helped shape the city’s evolution in a series of land use, zoning and government relations roles.\n“Nearly 20 years later, I’m working on multiple developments up and down the Greenpoint-Williamsburg waterfront,” Gothelf says. “I went out to dinner there not long ago, took a walk in Domino Park. That’s a gratifying feeling – to point things out to my two boys and say, ‘I was involved in that.’”\nAlong with cultivating New York’s built infrastructure, Gothelf has long nurtured its human ecosystem. He is a longtime teacher of urban planning at Columbia University, his graduate alma mater, and mentors younger members of the Kasirer team.\n“Working in a defined geographic area and the same industry over time, you see the evolution of the work of the city,” he says. “In New York, you never run out of questions and things to learn.”\nBut if he ever does, Gothelf wants the Mets to know he’s still available. “If they sign me now, at age 47,” he says, “it wouldn’t be the worst move they make all year.”\nKenya Handy-Hilliard\nSteeped in public service from the time she was little, Kenya Handy-Hilliard recently took a novel step: She joined the private sector.\nNow a government relations manager for McDonald’s, Handy-Hilliard seeks “to make the most change with less politics,” she says. “I use my government experience to direct dollars to where the need is.”\nAt the fast food behemoth, Handy-Hilliard cultivates partnerships with local police departments and youth sports leagues. A highlight was delivering Happy Meals and other aid to upstate communities of color traumatized by the deadly Buffalo supermarket shooting in 2022.\nRaised by city government veterans, Handy-Hilliard was initiated into New York politics working for Rep. Yvette Clarke. Diving into major issues like immigration reform made her realize that “I wanted to be the one taking it myself to the endzone,” she says. While her 2021 New York City Council candidacy was unsuccessful, “as a woman of color, it gave me a voice and a platform,” Handy-Hilliard says. It also convinced her she’d rather work behind the scenes.\nAt 41, the lifelong New Yorker now draws on experience heading intergovernmental and community affairs for multiple city offices, as well as working under three administrations in the state attorney general’s downstate office – “a lesson in crisis management,” she says.\nIn the public or private sector, Handy-Hilliard knows she has earned her authority. “That meek voice I grew up with? I got rid of it,” she says. “I walk into rooms confident in my ability. I know what I’m talking about.”\nLaura Kavanagh\nBeing the first woman to serve as New York City’s fire commissioner – and a young woman at that – is an experience Laura Kavanagh likens to hiking, her weekend passion.\n“A trail on the map is still long and hard, but you know where you’re going,” says the 42-year-old, who was appointed in 2022 and recently announced her resignation from the post. “If you decide on a different trail, you’ll have to clear the brush, and it takes twice as long to get anywhere. You may have to turn around and start a new path.”\nKavanagh’s own new path has yielded greater diversity in FDNY recruitment, including a historically large cohort of women graduates. Since joining the department a decade ago, she has held a series of external affairs and deputy roles and is proud of helping secure firefighters’ largest-ever raise in a recent contract.\nHer effectiveness quieted some doubters, and she challenged the status quo during her time leading the department. Born in San Francisco, Kavanagh “moved to New York City the moment that I could, and never looked back,” she says.\nAs a community and campaign organizer – including for Barack Obama’s reelection as president – Kavanagh has lived in all five boroughs. That experience gave her valuable grassroots perspective and a crucial familiarity with diverse neighborhoods, “which is important for anyone who runs things in this city.”\nStill, many who knew Kavanagh thought the FDNY “was a strange choice,” she acknowledges. “It was a risk and a change, of course. But I knew in my gut it would be the right thing.”\nAmy Kellogg\nAmy Kellogg’s passion for the law started at age 7, when she’d tell anyone who would listen in her rural upstate town that someday she’d be a lawyer. “I must have seen a movie,” she says, “because of course, at that age, I had no idea what lawyers do.”\nShe does now – and teaches the next generation at her alma mater, Albany Law School. Since graduating, she has also specialized in lobbying as an attorney with Harter Secrest & Emery, using the legislative knowledge she gained during an internship with the Assembly.\nAs partner-in-charge of the firm’s Albany office, Kellogg recently guided its expansion into new practice areas, adding attorneys in health care and tax law. Health is a current focus for her own work, which includes representing the American Nurses Association – including efforts to make New York the final state to recognize nurse anesthetists – and the state Clinical Laboratory Association, for whom she recently secured modifications to the licensing law.\n“There’s a shortage of health care providers in New York, which affects patient access,” Kellogg says. Her work is gratifying, she adds, “because I’m helping make sure every day New Yorkers get the services they need.”\nFor years, Kellogg also has represented a New York City transit union – background that recently helped her negotiate the city’s congestion pricing plan. “These long-term relationships give you the ability to really dig into issues,” says the 46-year-old, “in a way that you couldn’t otherwise.”\nRochelle Kelly-Apson\nFor Rochelle Kelly-Apson, the line from hospitality to lobbying runs through politics – and the power of a single voice to effect change.\nThe 44-year-old New Yorker found her own political voice in her hotel trades union. “Many members were immigrants, and they weren’t used to standing up for themselves to the big bosses,” Kelly-Apson says. Supporting her colleagues, and the candidates who best represented them, felt natural. “I’ve always been focused on service,” she says.\nAfter numerous campaigns and more than a half-dozen years working at the state level, Kelly-Apson is now a senior vice president at McBride Consulting & Business Development Group on Long Island. She is also involved with Black political and civic organizations, including the NAACP’s Hempstead chapter and Black Voters of Long Island.\nOver five years with the state attorney general’s office, Kelly-Apson saw the fruits of advocacy firsthand. Among her projects were a measure to curb medication overprescribing and funding for housing legal services to help homeowners. She also headed intergovernmental affairs for then-Gov. Andrew Cuomo, supporting efforts to raise the juvenile age for criminal responsibility.\n“What I loved most was seeing how the laws and budget were impacting people’s lives,” she says. “Policy has a real, life-changing impact.”\nShe currently leads the board of New Hour For Women and Children, a provider of reentry services for Long Island women and families. In the private sector, “I still work on really positive projects,” Kelly-Apson says. “I’m still working for the people.”\nJason Laidley\nWhen Jason Laidley established his own strategic consultancy a few years ago, he knew his focus would be the borough he has called home since age 7.\n“I’m from the Bronx, and now we’re bringing resources back to the Bronx,” says Laidley, the founder and CEO of London House. “It makes sense to take my networks and resources and my understanding of government to help nonprofits – and represent them to the city and state.”\nRaised in a Jamaican immigrant family, Laidley studied computer science – but, like many Gen Xers, struggled to find a job, until he tried government. He landed the role of Bronx borough director for the New York City comptroller’s office and remained there for 15 years under three administrations, supervising constituent services like housing and nutrition programs.\nNow 45, Laidley has also worked on campaigns for notable city politicians, including Letitia James and Jamaal Bailey, who hired him as chief of staff in the state Senate. With experience in both New York and Albany, Laidley now advocates for clients like the New York Botanical Garden and the Bronx Community Foundation, increasing the borough’s share of the government funding pie. He’s also an executive at Moonshot Strategies.\n“Sometimes the Bronx gets the short end of the stick,” Laidley says. “We have a lot out here that people don’t know about. Sure, there’s Yankee Stadium, but also we’ve got Wave Hill and the botanical gardens and the most parkland in New York City – and great people doing great things.”\nWayne Lair Jr.\nAlbany lobbyist Wayne Lair Jr. looks back with satisfaction over a record of policy wins in areas ranging from charter schools and health care to legalizing e-bikes.\nBut as a partner at Statewide Public Affairs, he’s especially proud of helping build a powerhouse government relations outfit from the ground up. Lair, 41, joined Statewide at its founding, and his efforts have helped grow the firm from 12 clients to roughly 60, adding New York City and Buffalo offices along the way. “We really are like a family,” he says.\nLair grew up in Johnstown, where his fascination with America’s past led to degrees in history and political science from the nearby University at Albany. Politics was a natural segue. His education in the workings of the state Senate and Assembly came as a legislative coordinator for New York StateWatch.\nMuch of Lair’s recent work has involved lobbying for measures ensuring patient access to groundbreaking medicines – like a bill requiring insurance coverage for biomarker testing. “As health care advances, we’re trying to help government keep up with that progress,” he says.\nLair has also represented the New York State Restaurant Association, helping small-to-medium-sized businesses navigate government policy. But persuading lawmakers to legalize e-scooters and e-bikes was among his most entertaining assignments as a lobbyist.\n“It was a lot of fun,” he recalls of the Bronx pilot program he helped organize on behalf of Lime, an e-scooter company. “We still have a couple of bikes lying around the office.”\nYa-Ting Liu\nTo the chagrin of her immigrant parents, Ya-Ting Liu was born to pursue public service. “They wanted me to be a lawyer or doctor, of course,” says the Taiwan-born Liu, who grew up in New Jersey. “But I’ve always been passionate about causes bigger than ourselves – and how decisions impact the lives of so many people.”\nToday, Liu makes some of those decisions as New York City’s first chief public realm officer. After working on built environments as Mayor Eric Adams’ strategy chief, she was chosen to establish a new role aimed at improving quotidian public spaces.\n“It’s channeling the everyday New Yorker getting from Point A to Point B,” says Liu, a longtime urban planner, “and making that experience as nice as possible.”\nDrawing on experience with various conservation and infrastructure organizations, Liu has tackled everything from a network of public restrooms – she’s working on a Google Maps feature – to public space (adding 40 football fields’ worth across five boroughs) and the nation’s largest outdoor dining program. Her team is currently collaborating with the City Council to reform standards for those pandemic-era sidewalk sheds.\nWhile tackling the day-to-day streetscape, Liu also is also aware of her role as a precedent and a model – even though, “if I’m totally honest, my parents are still not 100% clear on what I do,” she says. “But they’re really proud. I’m paving the way to what I hope will be a successful legacy not just in New York City, but throughout the country.”\nTerrance Miller\nOver nearly two decades, Terrance Miller has championed diversity at the software and information technology company CDW – with notable results. Dozens of minority- and women-owned businesses now partner with CDW as suppliers, and Miller’s work with Black fraternities and sororities has fortified a pipeline of underrepresented candidates – as has a paid internship program for New York City youths.\n“Inclusivity is important for me because I feel everybody deserves opportunity and a fair shot,” says Miller, 43. He feels that way in large part due to his own childhood in New Haven’s poverty-plagued core, “where I saw so many individuals with talent that went unrealized,” he says.\nBy age 13, Miller was a peer mentor – a role he would play, in various ways, throughout his professional career, incorporating the skills he added as a college social services major.\nHis impact at CDW is considerable, since the company is an official software provider for New York City and the Metropolitan Transportation Authority. Miller has used those relationships to partner on workforce development programs, and he also co-chairs CDW’s East Coast chapter of Black Excellence Unlimited.\nRecently, Miller was back in New Haven, talking to teens about technical careers. “What made me fall in love with this job is the gratification that I’ve gotten from giving back and working with youth,” he says.\nWhether selling technology or spearheading inclusion, he says, “It’s about managing relationships, understanding the client’s needs – and connecting people with the right resources.”\nBennet Moskowitz\nHigh-profile, controversial clients like Ivanka Trump or the estate of Jeffrey Epstein might intimidate some – but not Bennet Moskowitz, who has represented both.\n“I was born for this,” says the litigator, a partner in the Manhattan office of Troutman Pepper. “I’m not afraid to speak up for my decisions. I have no stage fright. I’m a bipartisan lawyer who fights hard for everyone I represent – and I believe everyone deserves the best defense possible. That’s how the system works best.”\nRaised in South Florida, Moskowitz studied journalism and sociology at New York University before deciding to try law, enrolling at Columbia. It turned out to suit his Type A personality perfectly.\nNow 41, Moskowitz has earned a reputation for the kinds of clients and cases that turn heads. He was in the middle of the battle over New York’s congressional redistricting, which has national political implications, and recently secured one of the year’s largest jury awards in North Carolina, for a book publisher. “As a litigator, you live for that kind of result,” he says.\nWeekends in his Connecticut suburb while cheering on his children at School of Rock and Little League keep Moskowitz grounded. Boldface names or otherwise, “You have to tune out all the noise you hear, whether it’s from media or other people, and focus on doing the best job you can for your client,” he says. “I’m available 24/7 to all my clients – famous or not. I really live their cases.”\nAdebayo Oyeniya\nAn “accidental public servant,” as he calls himself, Adebayo Oyeniya came from Nigeria to Manhattan in 2011 – and was bowled over “by the magnitude of the environment, the high rises, the underground trains,” he says.\nWhile studying architecture at the New Jersey Institute of Technology, he was compelled by both the region’s physical complexity and the challenge of modernizing its century-old infrastructure. Today, as a Manhattan-based director at KPMG, he tackles those issues directly with a portfolio of infrastructure and capital projects, roughly 70% of which involve New York City government and other public clients.\nIn addition to architecture training on two continents, Oyeniya draws on nearly a decade of experience with both the city Department of Design and Construction and its Economic Development Corp. Memorably, he worked on the reconstruction of more than 100 homes demolished by Superstorm Sandy. He was also integral to the construction of Coney Island’s new Ruth Bader Ginsburg Hospital – part of a $1.7 billion post-Sandy Federal Emergency Management Agency grant.\nIn Nigeria, the young Oyeniya latched onto architecture because he loved the interplay of human environments and nature, and he was good at sketching. Here in New York, he draws continual inspiration from the city itself, “the way it pushes you to your limit,” says Oyeniya, 41.\n“There’s so much potential in New York City, so much resiliency,” he says. “You want to take advantage of that – and see New York be more vibrant, socially conscious, diverse and improved for the next generation.”\nEd Ra\nIn 2010, at just 28, Ed Ra was then the youngest person elected to the Assembly. “People would think I was an intern and ask me for ID,” recalls the Nassau County Republican, now 42.\nRa was the youngest member of that year’s youth wave, a millennial influence that continues to reverberate. He recently co-founded the Future Caucus, for state legislators under 45, with Manhattan Democrat Alex Bores. Together, they bring a generational affinity for technology – Ra has a computer science degree – to contemporary issues like AI. (Constituents are thrilled “to see something bipartisan, given where we are right now politically,” he says.)\nFor his part, Ra grew up immersed in “the positive side of government,” as the son of a Hempstead council member. Watching his father earn neighbors’ respect by working on their problems, “I knew from high school that I wanted to run for office myself,” says Ra, a former deputy attorney for Hempstead.\nIn the Assembly, Ra is proud of modernizing funding to expand education for children with disabilities, and of his budget work with the Ways and Means Committee. He lives a few miles from where he grew up in Franklin Square, and like a lot of 40-somethings, can often be found working out at Orangetheory Fitness. “I went to the grand opening of their local studio, and thought, ‘I might like this,’” he recalls. “It ended up becoming a five-day-a-week thing.”\nRachel Rea\nBehind Rachel Rea’s career in wireless technology is a decadeslong love affair with radio frequency engineering. “It’s like art for people who can’t draw,” says Rea, who currently leads operations for Boingo Wireless. “It’s got a very creative side to it.”\nIt’s also essential infrastructure for modern life, as anyone who has seen the Boingo logo at a New York City airport or train station knows (the Metropolitan Transportation Authority is a client). The ubiquity of wireless makes Rea very popular – and her work deeply gratifying. “We give customers connectivity where they didn’t have service before,” she says.\nRea, 49, grew up in New York loving math and science and majored in electrical engineering. She learned the wireless industry over more than a dozen years at Verizon, handling matters ranging from design and operations to management of both budgets and people.\nAt Boingo, Rea oversees the design and deployment of large-scale networks, including for military bases and hospitals. A recent project was connecting Grand Central Madison, a new MTA rail terminal 18 stories under Manhattan’s East Side.\nBut her longest-term project, and the one she’s most proud of, is recruiting more women into tech careers. Rea is the executive sponsor for Boingo’s women’s employee resource group and a mentor with industry groups. “The last statistic I heard is that women make up 16% of engineering and STEM fields,” she says. \"While that’s a lot better than the ’90s when I was in school, we still have a long way to go.”\nJennifer Richardson\nJennifer Richardson likes to be fast. Right now, she’s training for the New York City Marathon, with a goal of 7 minutes, 50 seconds per mile and as a fundraiser for Girls on the Run Hudson Valley.\nFast is also the pace of her lobbying work at Patrick B. Jenkins & Associates, where she is senior vice president. “In the private sector, things move,” says Richardson, who joined the firm after a series of state and city roles. “The public sector is a slower process. But that background is extremely helpful. I can tell clients what to expect – that government has a hierarchy, and sometimes 30 people have to approve something.”\nRichardson grew up in Dutchess County, studied at Cornell and earned a law degree at Albany Law School, where she now teaches lobbying law. After stints at a union and several state offices, she found her niche in a legislative affairs role with the New York City Department of Education.\n“I love that there are always new things to learn,” says Richardson, who also worked in the New York City mayor’s office. “Lobbying is like putting together a series of puzzles.”\nAt the Department of Education, she helped establish a first-of-its-kind statewide prosecutorial conduct commission. More recently, Richardson worked on legislative reform around the handling of trial evidence.\nThese days, running between her office and meetings with lawmakers, she occasionally slows down to wave. “Sometimes I’ll see my students in the Capitol,” she says.\nShanifah Rieara\nBack in 2010, Shanifah Rieara was annoyed at the proliferation of poor manners during her New York City subway commute. So she posted on Facebook: “If I was to ever work at the MTA, I’m going to do a courtesy campaign.”\nWhen Facebook recently reminded her of that 14-year-old post, the longtime straphanger had a good laugh. After joining the Metropolitan Transportation Authority as head of communications and policy and chief customer officer, Rieara did indeed spearhead the “Courtesy Counts” campaign, featuring whimsical cartoons that gently reinforce politeness.\nRieara also rolled out 10,000 screens to improve messaging and honored the MetroCard’s last gasp with a collectible series featuring Notorious BIG and Vampire Weekend – “taking the MetroCard strong to the finish line.”\nCivic engagement was a family ethos for Rieara, who was born in St. Thomas and grew up in the Bronx. By her early 20s, she was attending community board meetings, which led to full-time roles at boards in West Harlem and the Upper West Side during Columbia University’s expansion.\nRieara modernized community boards as Northern Manhattan director for then-Borough President Scott Stringer, then followed Stringer to the city comptroller’s office, overseeing public affairs.\nNow 45, she brings a grassroots focus to her work overseeing New York’s ultimate democratic institution: public transit. “I have that 90-minute commute from the Bronx down to MTA headquarters, so I see it all firsthand,” Rieara says. “It’s easy to complain, but I am a true believer in government – and making it work.”\nGustavo Rivera\nState Sen. Gustavo Rivera’s political career gathered steam gradually, then suddenly, in Hemingway’s immortal words.\nThe Puerto Rico native won his Bronx state Senate seat, which he has held for 14 years, after years as a political operative – “working on elections, not becoming an election result,” he explains. He had come to New York to study political science. Recruited to help with a friend’s run for office, Rivera was drawn into campaigns, which led to a job at the state Senate.\nBy 2009, even his Hunter College students were urging him to run himself. Rivera was determined to find the perfect candidate to help Democrats retake the chamber – until finally, he became that candidate.\n“Based on the privilege I’ve had, I see this work as an obligation to the community,” says Rivera, 48, whose speech is peppered with a scholar’s historical references. “And it’s an obligation to continue working for them, seeking power on their behalf, to change their lives for the better.”\nMotivated by his social issues, the senator counts his 2011 vote for same-sex marriage as a highlight. (He has officiated several same-sex ceremonies.) The first person of color to chair his chamber’s Health Committee, he is marshaling sponsors for a bill guaranteeing universal health care for New Yorkers.\n“It would fundamentally change the way we deliver health care, and potentially create a model for the country,” Rivera says. And yes, it’s an uphill battle – but “I don’t do small ball,” he adds. “I do big things.”\nDaisy Rodríguez\nAt the intersection of New York’s premier science and arts institutions, Daisy Rodríguez’s work on accessibility is distinctly personal.\nCultural destinations felt far from accessible to Rodríguez in the 1980s, when she grew up in a Manhattan family of Spanish-speaking immigrants. Today, she is devoted to a more inclusive New York as the head of government and community affairs for the Wildlife Conservation Society – where she successfully fought to restore $53 million in city funding for New York’s cultural community.\n“We can demonstrate the numbers and the influence,” says Rodríguez, who is also a board member of the Museum Association of New York. “You can impact a young person’s mind by providing something as simple as access to these spaces. And the support we get from government makes that possible.”\nRodríguez, who holds degrees in art and urban affairs, first honed her legislative skills working for U.S. Sen. Chuck Schumer. She previously led government affairs for the American Museum of Natural History, expanding outreach throughout the five boroughs.\nThese days, in an effort to engage marginalized teens like her younger self, Rodríguez hires local youths for jobs at the five city parks run by her Bronx-based conservation organization (the Bronx Zoo is one). She also forges partnerships on career-oriented science programs, including conservation fieldwork.\n“People before me helped me, and I’m a big believer in paying it forward,” Rodríguez says. “You’ve got to plant those seeds – because you’ll grow a garden for sure.”\nRobert Rodriguez\nGrowing up in East Harlem, Robert Rodriguez never imagined he’d become New York’s secretary of state – or the first Hispanic person to lead the powerful Dormitory Authority of the State of New York, which finances and constructs much of the state’s health and education infrastructure.\nYet Rodriguez was born into public service. His mother was a school administrator, and his father served on the New York City Council. “In true telenovela fashion, my uncle ran against my dad,” recalls Rodriguez, 48, who thought: “That drama – it’s not for me.”\nSo after Yale University, Rodriguez took a finance job with Bloomberg LP. Ironically, it was his boss-turned-mayor, Mike Bloomberg, who inspired Rodriguez’s political change of heart: “Watching him take that leap influenced my thinking about how to make a difference.”\nTransitioning to a public finance career, Rodriguez then won election to the Assembly from his East Harlem district in 2010. Over a decade in that legislative role, he championed state-subsidized retirement savings and spearheaded state investments in public housing, transit and open spaces. He is especially proud of the Second Avenue subway and the East River Esplanade.\nThe grandson of Puerto Rican transplants, Rodriguez was humbled to be part of a historically diverse state Cabinet – and to put his corporate and public finance skills to broader use. After championing the Department of State’s community development program, the new DASNY chief says he is thrilled “to continue that mission-driven work with the resources and commitment to transform the communities of New York.”\nDenny Salas\nAfter stints in Washington, D.C., and Florida, Denny Salas – like so many ambitious, high-energy people – found his political home in New York City.\n“In New York, it feels easier to get into local politics,” says Salas, who is currently a senior vice president at Gotham Government Relations. “There are so many avenues to get involved and to distinguish yourself.”\nFor Salas, those efforts included runs for New York City Council in 2021 and Assembly in 2022, both motivated in part by issues of inequity raised by the murder of George Floyd. While he didn’t win either race, Salas succeeded in cultivating the relationships that established him on New York’s political landscape.\nThe New England-bred son of Dominican immigrants, Salas, now 42, was working in finance when Barack Obama’s presidential bid drew him into politics. After campaign and lobbying roles in the nation’s capital, Salas landed in New York a decade ago, taking positions with a charter school and the New York City Police Department.\nAt Gotham, he recently represented public service retirees in a successful bid to preserve Medicare benefits. Salas also holds leadership roles with the United Democratic Organization, a Chinatown political club where he has spearheaded holiday food distribution, and the Manhattan Democratic Party.\n“When I jumped in for City Council, people were watching – union people, community leaders – and saw that I am a serious person,” Salas says. “They saw that I was, and am, actually there to help people – and that I was willing to deliver.”\nAkiva Shapiro\nAs a regular in front of New York’s top courts and even the U.S. Supreme Court, Akiva Shapiro is not easily fazed. But he admits to being awestruck last year, when the American Association of Jewish Lawyers and Jurists honored him with its Pursuit of Justice Award.\n“Justice Ruth Bader Ginsburg presented that award to Justice Elena Kagan in the Supreme Court chambers,” says Shapiro, 45. “I was incredibly wowed and inspired, as a very proud Jew and Jewish lawyer.”\nShapiro, a litigation partner in the New York office of Gibson, Dunn & Crutcher LLP, has earned a reputation as one of the nation’s leading defenders of religious liberties. During the COVID-19 pandemic, he made headlines by persuading the U.S. Supreme Court that then-Gov. Andrew Cuomo’s restrictions on religious gatherings were unconstitutional.\nMore recently, Shapiro has represented a Queens stadium in ongoing litigation over outdoor concerts. “From my perspective, it’s a critical First Amendment issue to ensure that musicians are able to perform in venues like this in New York, a music haven,” he says.\nThe son of Palo Alto computer specialists, Shapiro was always fascinated by American history and the U.S. Constitution. He earned a master’s degree in religious studies from Yale and a law degree from Columbia, and chose Gibson Dunn because its focus on constitutional litigation dovetailed with his self-described libertarian streak.\n“I felt I had the opportunity to make a difference,” he says. “In an ideal world, as a lawyer, that’s what you’re doing.”\nDawn Smalls\nDawn Smalls went into law to make large-scale change. Indeed, from the Clinton White House to the Obama administration and now at the firm of Jenner & Block, where she is a partner, the 46-year-old has a legacy of advocacy on behalf of vulnerable Americans.\nMillions have used the Affordable Care Act, which Smalls implemented as the chief regulatory officer for then-President Barack Obama’s Department of Health and Human Services. More recently, Smalls led a national class-action lawsuit on behalf of underpaid au pairs – and successfully prevented New York City from evicting unhoused New Yorkers sheltering at hotels during the COVID-19 pandemic.\n“I’m invested in where I can be the most impactful,” she says, “whether government, nonprofit or the private sector.”\nAs evidence, Smalls cites her 2019 run for New York City public advocate, which led to a place on the city Campaign Finance Board. And much of Smalls’ advocacy draws on her experiences marshaling civic engagement with the Ford and Open Society foundations.\nSmalls realized early that law and government were powerful levers of change. Her first close-up exposure came as a high school student, where the political internship program included career advice from the governor and mayor. By her 21st birthday, she was working for White House chief of staff John Podesta – and noticed how many senior figures, like Elena Kagan and Rahm Emanuel, were attorneys.\n“That was the example before me,” she says, “and the example I wanted to emulate: a lawyer who contributes to policy and change.”\nJJ Suarez Jr.\nAcross New York City, JJ Suarez Jr. has overseen hundreds of upgrades to subway stations, public housing and other city-run facilities.\nAs vice president at CSA Group, the architectural and engineering firm founded by his father three decades ago, Suarez launched the firm’s operations in New York City 15 years ago – and has since grown CSA into an indispensable resource for the city’s infrastructure.\nSuarez had big shoes to fill: JJ Suarez Sr., a Cuban refugee who emigrated to the U.S. from Puerto Rico, founded the nation’s largest Hispanic-owned project delivery firm. “He’s been an amazing role model and mentor,” the younger Suarez says.\nRaised in Cincinnati, Suarez joined the company after college, using his bilingual skills to coordinate CSA projects in Puerto Rico. He also worked with the Cincinnati public schools to rebuild all 72 of the district’s facilities.\nBut New York is where Suarez – who holds a master’s degree in construction management from New York University – has made his mark. Under his supervision, CSA acquired and expanded a 20-person firm to 120 employees today, becoming a go-to contractor for the New York City Housing Authority as well as the Metropolitan Transportation Authority.\nParticularly memorable was the task of rehabilitating nearly 300 public housing buildings in the aftermath of Superstorm Sandy – a task Suarez calls emblematic of the firm’s mission. “It’s work that contributes to the welfare of a lot of people,” he says. “And that’s very rewarding.”\nRaj Thakkar\nIn his 30s, Raj Thakkar had what looked like a great career – working for a technology startup – but found himself disenchanted with corporate politics. “I wanted to make an impact,” says the native New Yorker, 49. “I wanted to do something good for a change.”\nThat initial change, as chief financial officer of a Brooklyn charter school, propelled Thakkar toward his eventual niche – advising schools and nonprofits on sound financial organization. As the founder and CEO of Charter School Business Management and its affiliate, FOREsight Financial Services for Good, he now employs 70 full-time staff who assist 175 organizations in New York City as well as nationally.\nThakkar learned the importance of financial management as a young child, refilling candy and soda in his father’s Queens convenience store. But when health issues forced his father to retire, the resulting sale of the business – at a loss – kindled the young man’s passion for helping worthy causes thrive.\nSince launching his venture, Thakkar, who holds a master’s degree in business administration from New York University, has been named New York’s Small Business Person of the Year in 2018 and has taught social enterprise at the NYU Wagner Graduate School of Public Service. He recently published a book, “Fiscally seCURE: Prepare, Protect and Propel Your Charter School with Responsible Financial Management,” the first in a series.\n“My dad wasn’t ready to retire 10 years earlier than planned,” Thakkar says. “I thought, I don’t want this to happen to anyone else that I know, personally or professionally.”\nRobbie Welch\nThanks to Robbie Welch, visitors to City Hall now admire portraits of trailblazing women, like Black Rep. Shirley Chisholm, alongside pictures of New York City’s mayors (all men). It’s one way that Welch has brought his arts background and diverse perspective to the City Council, where he is a longtime staffer.\nThe “Women’s Voices: Shaping the City” display “marries my worlds of culture and art with government,” Welch says. Similarly, he brings his DJ talents to City Hall events and has been active in diversity recruiting efforts.\nA Florida native, Welch got his start in the music and entertainment business. Eventually, he made his way to New York City and worked for New Line Cinema. By his 30s, “I was feeling burned out,” he says. “I wanted to do something more fulfilling.”\nDrawn to advocacy, Welch took a position with the New York State Black Gay Network. He then spent a decade coordinating education and training programs for Community Resource Exchange, a management consultancy that strengthens New York City nonprofits. Along the way, his focus became “having conversations with the community, and understanding what they need,” says Welch, 48.\nAt the City Council, he recently coordinated the first visit from a Cuban delegation of LGBTQ+ leaders. “It was really powerful, because they got a chance to see our culture in a different way, and vice versa,” Welch says. “What I enjoy about politics is that we have the ability to make change – and it has to start somewhere.”\nDaniel White\nYou could say that Daniel White has a lot of balls in the air this year. The senior account executive at Geto & de Milly, a public affairs firm, has been busy organizing major New York real estate projects around professional soccer, cricket and tennis.\n“I love sports,” says White, 42. “So representing three of the most popular sports on the planet here in New York allows me to marry that with my experience in buildings and land use.”\nWhite recently celebrated the approval of the New York City FC’s $800 million Queens stadium – the fruition of a decadelong effort on behalf of the city’s first Major League Soccer team. His work has also paid off for the John McEnroe Tennis Academy, which will be the country’s largest indoor tennis facility when it opens this fall on Randalls Island.\nAlso this year, White helped the International Cricket Council build a temporary stadium for the New York portion of this year’s Cricket World Cup.\nHis own addresses changed constantly during his itinerant childhood. But New York has been home since he moved to attend Fordham University, save for a five-year post-college detour to Capitol Hill working for then-Rep. José E. Serrano.\nAt Geto & de Milly, White has put those government relations skills to use on behalf of some of New York’s most iconic new buildings, like the Robert A.M. Stern-designed 520 Park Ave. “We get to see our work built across the city,” White says. “That’s pretty cool.”\nMichael Woloz\nNearly half a lifetime ago, Michael Woloz traded a career writing for newspapers and for the New York City Council to try public affairs – and never left.\n“It was so fascinating, and the work was so current. And it still is,” says Woloz, 49, now the head of the firm, renamed CMW Strategies. “I love dealing with complex issues, building coalitions and trying to find solutions.”\nAs managing partner, Woloz has cultivated a Top 10 boutique lobbying firm that specializes in culture, real estate, transportation and technology.\nOver the years, Woloz has secured hundreds of millions in state and city dollars for the arts institutions that, as a New York native, he grew up cherishing. He was also instrumental in lobbying the city to permit the launch of e-scooters.\nBut as chair of the New York League of Conservation Voters, Woloz considers his work on environmentalism to be his greatest legacy. “I think climate change is one of the key challenges of our time,” says Woloz, who successfully persuaded the city to impose greener standards for home heating oil. “I have two children, and I believe we need to do what we can to make their future better.”\nAs new issues continue to sprout, Woloz retains the enthusiasm that drew him into lobbying a quarter century ago. “You’re in the middle of it. You’re in the room where it all happens,” he says of the policy world. “That’s what’s exciting about lobbying.”\nAngela Wu\nAngela Wu’s parents fled the Chinese Cultural Revolution, scraping by on food stamps and restaurant gigs and clawing their way into the home-owning middle class in America.\n“They (came) to this country believing in the land of opportunity,” says Wu, 40, who studied art and architecture at Harvard and holds a master’s degree in business administration from Yale. “I internalized this belief in the power of government, when it does what it’s supposed to do, to truly make people’s lives better.”\nWu brings that optimism to her consulting work on behalf of New York City and state government clients, as well as organizations. Currently a director with Slalom, a Seattle-based technology consultancy, she helps shepherd large-scale projects.\nIn New York, these have included the post-Superstorm Sandy disaster recovery effort. More recently, Wu helped city and state agencies marshal $41 billion for an emergency eviction prevention program during the coronavirus pandemic. She is particularly passionate about her work with nonprofits like the Central Park Conservancy and the American Civil Liberties Union.\n“I always tell my clients that technology is just an enabler,” Wu says. “People look to it to solve problems, but at the end of the day, it’s a tool.”\nWhat really counts, she knows, is the human impact. Wu learned this as a fledgling landscape architect, working on the development of Brooklyn Bridge Park along a formerly industrial waterfront. “Now you see families there with joy on their faces, enjoying that space,” she says. “That’s the transformational power of a single policy decision.”\nNEXT STORY: The 2024 Transportation Power 100",
  "word_count": 10479,
  "scraped_at": "2026-02-14T12:18:05.011914"
}