{
  "article_id": "a5a1e7847846",
  "url": "https://sandiegomagazine.com/features/san-diego-fc-mls-season-2025/",
  "title": "San Diego FC Has Arrived Here What it Means for the City",
  "date": "20250225T230000Z",
  "domain": "sandiegomagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On a corner of the Singing Hills golf club, out where El Cajon fades into chaparral, five soccer fields gleam in the sun, the grass as manicured as the putting greens they replaced. A two-story, state-of-the-art fieldhouse rises from the turf. Nearby sits a defunct resort, reopening this fall as student residences and classrooms. Together, these facilities are San Diego FC’s brand-new performance center and Right to Dream Academy, institutions that will shape San Diego sports—and potentially create international stars.\nIn May 2023, Major League Soccer awarded San Diego the league’s 30th franchise. That announcement recognized San Diego’s outsized soccer fandom, built by Wave FC— our city’s professional women’s team—and the now defunct Loyal SC, a legendary team that played in soccer’s second division. It also served as a salve years after the Chargers’ departure. But it didn’t just mean the region was getting a new major league team. With Right to Dream, San Diego would be home to a franchise model uncommon in North American sports.\nRight to Dream started in 1999 as a small youth soccer academy in Ghana and has since opened academies in Egypt, Denmark, and, soon, San Diego. The academies offer education and housing at no cost to promising youth players aged 11 to 18. These preteens and teens, dubbed residential athletes, commit to a training regimen designed to turn them into world-class professionals. Whether they successfully achieve that goal or not, Right to Dream guarantees them five-year scholarships, which is a life-changing opportunity for the sixth- and seventh-graders brought into the fold each year. Right to Dream’s San Diego academy welcomes its first class of 20 students this fall.\nIn other parts of the world, these young players have long been the lifeblood of soccer teams or “football clubs” (the source of the “FC” in the San Diego team’s name), and every major club has an academy feeding its senior team. In the US, professional teams rely on a web of college sports, minor leagues, and entry drafts for roster building and player development.\nThe Right to Dream Academy gives San Diego FC not only a competitive advantage, but also a source of local pride. “I connected with the Right to Dream project right away,” says SDFC’s most high-profile player, Mexican forward Hirving “Chucky” Lozano (his nickname is pronounced “choo-key”). “It reminded me a lot of my own journey in soccer. I lived a similar process, but what they have here is on another level—so much better. The facilities, the investment, the support—it’s incredible. I think it’s going to make a huge impact.”\n“What’s unique from a soccer perspective is the binational opportunity that we have across the border in Mexico,” San Diego FC CEO Tom Penn adds. “Our training ground is located within 50 kilometers of the border. That’s significant because FIFA and MLS rules allow us to recruit 50 kilometers across the border. We’re the one and only [club] to be able to home-grow the talent from San Diego and America and Mexico.”\nThe tie that binds San Diego FC to the academy is their mutual owner and SDFC chairman Mohamed Mansour. In 2021, Monsour bought Right to Dream, its three academies, and FC Nordsjaelland, a soccer club in Denmark’s top division.\nIt’s within this network that SDFC operates. Forward Marcus Ingvartsen transferred to San Diego FC after several seasons playing for FC Nordsjaelland. Midfielder Alex Mighten went the other way. After they signed him in August 2024, SDFC sent the 22-year-old Mighten on loan to FC Nordsjaelland to gain experience.\nThe benefits of this system aren’t lost on Miguel Barajas, president of the San Diego Independent Supporters Union, a collective of San Diego FC’s supporter groups. An academy is “something that people have been wanting for a long time, especially in big soccer hubs like San Diego,” Barajas says. “There are a lot of kids that come from very diverse backgrounds and don’t necessarily have the funds to be able to pay to play.”\nSome of those kids will one day take the pitch at Mission Valley’s Snapdragon Stadium, and Barajas’ band of supporters will be there to greet them. A National Guardsman and a father, Barajas dedicates his spare time to the mundane tasks that make supporter groups an exciting feature of the MLS experience—recruiting new members, distributing tickets, and making sure everyone knows when drum and chant practices are. San Diego FC is “coming along real nice,” he says. “The club definitely has the makings of a team that can make an impact from the first year.”\nThat impact can be economic. San Diego’s newest team certainly drives some growth in jobs and tourism. That impact can be cultural. There are few things as entertaining, fun, and gratifying as a team win. Lozano is going to electrify a binational region that consistently ranks among the highest in soccer viewership markets. Midfielder Luca de la Torre is bringing his noted playmaking and creativity back to his hometown after 10 years playing overseas.\nBut how do you measure the impact of a boy from South Bay believing he can be the next academy graduate to start for his hometown team? “It’s really special to play for your city, where you’re from,” de la Torre said at a press conference after his signing. “I would have loved it if [the club] was here 10 years ago.”\nOr a group of friends from City Heights standing arm-in-arm in the supporter section at Snapdragon Stadium? “There’s just something about the sport,” Barajas says. “I’ve been to games in Europe, I’ve been to games in Mexico, and there’s just something so addictive about being in the stands.”\nPARTNER CONTENT\nOr locals knowing that something important, something universal, is happening in their city? “I’m most excited about what this is going to mean for the community of San Diego,” Penn says. “A sports team, properly executed, unifies the city like nothing else—across all regions, across all ethnicities, across socioeconomic backgrounds, across gender, across political parties.”\nThe sports scene here has long been defined by what it lacks. The Padres are one of five MLB teams without a World Series championship. The Clippers and Chargers, devoid of trophies themselves, left for the city that San Diego says it is not. San Diego FC’s arrival ushers in a new era in which San Diego can define what it actually is: a soccer-mad city driven by everyday people’s hope for greatness and connection.",
  "word_count": 1074,
  "scraped_at": "2026-02-14T14:15:39.511437"
}