{
  "article_id": "a5acd67650bf",
  "url": "https://www.the42.ie/alban-hysa-interview-6820389-Sep2025/",
  "title": "The life coach with a BA in psychology who now an FAI Cup finalist",
  "date": "20250920T080000Z",
  "domain": "the42.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LAST SATURDAY was a big moment in the short history of the Bohemians women’s team.\nFive years after they were founded, the Dublin club beat Treaty United to reach their first-ever Women’s FAI Cup final.\nIt will be their second final this season, having been defeated on penalties after a 1-1 draw against Wexford Youths in the All-Island Cup final last month.\n“It was one of those things that we would have worked hard during the season in terms of changing — winning, as we know, it’s a habit, and there hasn’t been much of that in the past,” Bohs head coach Alban Hysa tells The42.\nThe Dubliners will be underdogs in the final on 19 October against reigning Premier Division champions Athlone.\nBut they’ve come close to defeating the Midlands club already this season. Last month, they went 2-0 up against the table toppers, who came back to earn a 2-2 draw thanks to a late Roisin Molloy header, while Hysa says his side were denied a “stonewall penalty”.\nBohs finished eighth last year. Hysa took over ahead of the new campaign after previous coach Ken Kiernan left to become Ciarán Kilduff’s assistant with Dundalk’s men’s team.\nThe coach, who moved to Ireland from Albania over 25 years ago, feels the team have improved significantly since then.\nThey are currently sixth, and three points off fourth-place Wexford, whom they beat during the week, while they face Shamrock Rovers at Tallaght Stadium later today (kick-off: 5pm).\nWith four games to go, Hysa is hopeful his side can push for a top-four finish.\nBohs have certainly improved from a slow start that saw them pick up just three wins from their opening nine games.\nHysa says the hectic schedule, partly prompted by their cup run, means the team have sometimes had to rely heavily on player rotation and struggled to “bring consistency”.\n“I’d rather have the league extended, and, be able to play the games a week at the time, considering that we are not professionals, and it’s a lot to ask for the players to have three games in a week,” he says, adding that the club’s request to move last Tuesday’s match away to Wexford to 23 September was rejected.\nTheir success has come despite Hysa overseeing a quite young and inexperienced squad.\n“The only odd one on that number would be Lisa [Murphy], being 30. There are three or four in and around 23-24, and the rest of them are all 17 and 18, and you’ve got a couple of 21s. It’s such a young team that even finding the right balance in terms of integration [is a challenge] and because there are different generations, trying to bring everyone on the same page takes time.\n“But providing that the team stays together, they will be a force to be reckoned with in the next year.”\nHysa himself is relatively new, at least in terms of senior management.\nAfter moving to Ireland, he began his career with a brief stint as a player at Bohs.\n“Roddy Collins was the manager, and they were playing Dundee United in a friendly at Dalymount. I walked up to him, I just thought to myself, ‘Why am I not playing football, considering all the years I spent doing so before I came to Ireland?” he told the club website earlier this year.\nHe was offered a Fás contract on £80 a week, but also had a job offer from technology company IBM, opting to take the latter opportunity, while enjoying part-time stints at Dublin City and Monaghan United.\nHe first became acquainted with the women’s side of the game after working for a couple of years in the FAI’s Emerging Talent Programme.\nHe also had stints with Bohemians and Peamount’s underage teams, before becoming coach for the Treaty United senior team ahead of the 2023 campaign.\nIt was not an easy challenge, to put it mildly. The club had finished the 2022 season bottom of the table, picking up two points from 27 matches, scoring five goals and conceding 110.\nThey improved during Hysa’s sole season in charge, registering eight points from 20 matches, scoring 11 goals and conceding 50.\n“Treaty the previous year, we were losing eight, nine and 10-nil,” he recalls. “So I was asked to stop the shipping of the goals, rather than to go and win games.\n“When I arrived, there was no team. I only had five players in training. So, I scrambled to sign pretty much anyone who could play half-decent football. And, in terms of year on year, the job was just outstanding, even though the results might not show it in terms of wins, we were losing games 1-0 and 2-1, something that they hadn’t seen for years.”\nHysa still opted to leave. He was working in Dublin, and the trips down to Limerick, twice a week for training and for home matches, were taking their toll.\nHe took another job with Bohemians U17s “not because I wanted to be at 17s level again, but I thought I’d give my own kid [who is a footballer] a year of my life”.\nFrom there, Hysa got the senior job and says the club have benefitted from “first-class” training facilities, which they make use of three times a week.\nIf he had his way, though, the team would be training full-time.\n“But we are not there in terms of the finance, and even from a woman’s perspective, the gates aren’t there in terms of getting something back. To be fair, we have had 400 to 500 fans every week, and we have been able to break the record against Shels with 1400 people in a semi-final. Even against Treaty, there we had over 1000 people in the stadium.\n“So Bohs compared to other grounds, it’s night and day in terms of what we get, but still going back to being able to offer full time training to these girls, a lot will need to happen in between, from an FAI perspective and a club perspective, whereby we are in a position to offer these players full time so that they don’t go to England or even Scotland for the sake of it.”\nHe continues: “Glasgow City, who were playing against Athlone in the Champions League [during the week], they only had about 400 people in the ground [for the home game], and that’s a Europa Cup game. And those kinds of teams can offer 25k sterling a year to players, where they could survive playing football.\n“I don’t know how we get there, but there’s a lot that needs to be done for us to be in a position, not only to train every day, but to be able to offer players a way of life, playing football.”\nHysa laments the fact that Irish women’s teams generally do not get compensation when their players move abroad, invariably because they are not tied to professional contracts.\n“Unless we get into a space where we have the players on professional contracts, and when other clubs from England, or Scotland or whatever the case might be, are approaching our players, then they have to pay so that the club can survive.\n“It’s one of those things that research has to be done. There is no magic stick there that you can have a solution and say, ‘This is what we do.’”\nIf there was one aspect Hysa could change about Irish soccer, it would be to professionalise the women’s game.\n“Especially in an age group of 16, 17, 18, because that’s when they are breaking through to the first team, and that’s the moment that they need most of the training, rather than when they arrive at 22-25, which potentially could be a bit too late for their development to move across.\n“As we have seen, players who are moving to England rarely, they are starting nowadays. It’s always a few minutes here and a few minutes there, which, yes, will help with their development, training every day. But at the same time, if you’re not having time on the pitch, that development will be [hindered] also.”\nHysa has a particular interest in the mental side of sport, earning a BA in psychology in 2012.\n“With the BA, I’ve now done life coaching, and I did two years of logotherapy and existential analysis, which is a meaning-centred approach to life. Obviously, they all help in relation to dealing with players. It gives you an insight into human behaviour and how you know best to approach that space. But, there is a balance also in terms of not going too deep into that, because you’re the manager, and you can’t really go too much into the details of it. That’s why you get sports psychologists to go and do that.\n“I will be the one making the decisions at the end of the week. So it’s very hard for someone to maintain a balance of knowing everything about the personal life of someone. I’m not saying that you cannot know personal things, and facilitate where needed.\n“But you cannot go deep into someone’s personal life, know their background and at the same time, having to make decisions on Saturday, because sometimes for the kids, that might be the only escape that they have, playing on a Saturday might bring them into the present moment, which means that they forget about everything else that exists around them, any problems, rather than the other way around.”\nHysa recalls overseeing a course for the FAI many years ago, which increased his awareness of the obstacles players often face away from the public eye.\n“I remember working with the 17s and the 19s players who play nowadays in England, and I only saw them as an initiation, for about 15-20 minutes individual work just to find out where they are, the issues and problems and whatever the case might be.\n“I went back to the coaching staff with themed feedback, in terms of the issues and problems in the team. And what came out of that was eye-opening, even for me today, the problems that are there in the background that the manager might not know and think about, because they never share those things. So, that’s why you need the professionals to go and help with that space.\n“There were illnesses, personal stuff. There were relationship, family issues, whereby you would think that a kid can’t go after training and be 100% at their own home, with what was going on. So, there was a lot that came out of it.”\nHysa holds a Uefa A licence, which is all the Women’s Premier Division requires, with no plans to undertake the pro course in the near future.\n“It’s one of those that potentially, you might have to work for a few years before they give you a spot in there,” he says.\n“It’s a lot of money. And for all the money that we have spent doing all the licences, education and certs, and all the courses that you do to maintain them, at times you don’t see that money back. It’s not like you’re going to university, you’re doing a Master’s or a PhD, and all of a sudden, you’re going to get that back into a work environment.”\nIn addition to spending around 40 hours a week on football-related matters, Hysa works as a sales rep, which allows him the necessary flexibility to manage Bohs. He also emphasises the effort put in by assistant boss Alan Murphy and the rest of his “great” coaching staff.\nIn Hysa’s Twitter bio, along with the various football accolades, he describes himself as a life coach.\n“I did that within IBM,” he says. “I did have a practice going on for two years that I worked myself, combining psychology, life coaching, executive coaching, Nova therapy. And I was doing a bit also at Trinity, in the leadership master’s programme. I would go there three or four times a year, just doing executive coaching with CEOs, etc.”\nSince 2018, he has been practising it only personally, rather than in an official capacity.\nAnd does Hysa see many parallels between life coaching and football management?\n“There are, because once you understand human behaviour, it makes it easy in terms of knowing how to speak to players — not all of them, considering the new generations now.\n“The problem is that the new generations want it to happen today. All of the young players want to play now. That’s when they are 16,17, it’s almost a demand from the parents, from the kids, thinking that time is gone, when, in reality, they need to build themselves up.\n“And I saw that in Treaty, when I had a very young team. I had a couple of 15-year-olds, and one of the 15s wasn’t happy with me not playing her in Treaty. And I’m like: ‘I’m minding you so that you don’t get a big injury.’ You are not thrown at the deep end against women. And your career just completely goes out of the window, rather than introducing slowly — 15 minutes here and there. That’s the reality of where we are.\n“And it certainly helps knowing how to communicate within that space, with parents and kids, especially if they’re not mature and in a working relationship, they wouldn’t have seen much beyond the school years.”\nAs the conversation comes towards a close, Hysa encourages young, aspiring coaches to be open-minded and understand that management is a constant process of learning and evolution.\n“Most coaches nowadays, they think that they know it all, because they have gone through courses and universities, and because they’ve got a piece of paper — in reality, having a piece of paper doesn’t mean anything, unless you have worked in that space with a piece of paper.\n“And they are not open to new experiences, new ideas, new understanding, as we know the world is never black and white. We never see the colours in between. But unless you’re looking for those colours, you’re never going to see them. So it’s a fine boundary [between] thinking that you know something, and being aware.\n“Awareness is a big thing for me. If people are aware where they are at, truthfully aware, then they will be open.\n“Because they’re bringing awareness, within themselves, and they are pointing the finger at themselves, rather than pointing the finger outwards. But in our society, unfortunately, the first thing that we do is point the finger outwards. It is always somebody else’s fault.”",
  "word_count": 2432,
  "scraped_at": "2026-02-14T12:36:45.298550"
}