{
  "article_id": "a5ad86b79191",
  "url": "https://www.irishfa.com/news/2026/february/irish-fa-welcomes-fifa-womens-world-cup-2035-inspection-visit-to-northern-ireland",
  "title": "Irish FA welcomes FIFA Women World Cup 2035™ inspe ... ",
  "date": "20260210T133000Z",
  "domain": "irishfa.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Irish Football Association has welcomed a FIFA delegation to Northern Ireland as part of the FIFA Women’s World Cup 2035™ Inspection visit, which took place last week.\nThe visit represents a key stage in the bidding process, providing FIFA with the opportunity to assess proposed stadia, training facilities and host venues across the UK as part of the joint bid submitted by the English FA, Irish FA, Scottish FA and FA of Wales.\nThe inspection programme began on Monday 2 February, with the FIFA delegation receiving an overview of the bid’s vision and long-term legacy. The four UK football associations are united in the belief that the FIFA Women’s World Cup is a tournament for everyone - welcoming the world’s best players to communities across the UK, supported by passionate fans and inclusive host environments.\nBacked by strong support from governments and public authorities, the bid is built around three key pillars:\n•Growing participation in the women’s and girls’ game, locally and globally\n•Developing the workforce and leadership that will sustain women’s football\n•Driving long-term commercial growth\nDuring the visit, FIFA delegates inspected a range of proposed venues across England, Northern Ireland, Scotland and Wales, including training facilities, team hotels and fan festival locations. In Northern Ireland, the delegation visited the Clearer Twist National Stadium at Windsor Park in Belfast, highlighting the city’s readiness to host on the world stage.\nThe inspection showcased the scale and accessibility of the proposed tournament, with 63 million people living within two hours of a host stadium and a projected 4.5 million tickets available across the UK.\nThroughout the visit, FIFA representatives saw first-hand the quality of facilities, the strength of transport links and the shared commitment of the four home nations to deliver a tournament that is inclusive, sustainable and memorable. The bid is underpinned by the unifying vision of All Together, reflecting the collective ambition to welcome the world and leave a lasting legacy for women’s football.\nThe inspection visit forms a critical part of the FIFA Women’s World Cup 2035™ bidding process. The outcome will be announced on Thursday 30 April 2026, when the 76th FIFA Congress meets in Vancouver, Canada.",
  "word_count": 361,
  "scraped_at": "2026-02-14T12:38:02.540241"
}