{
  "article_id": "a5c5281913bb",
  "url": "https://metro.co.uk/2026/02/10/mexican-police-unleash-team-crime-fighting-robot-dogs-2026-world-cup-26812509/",
  "title": "Mexican police unleash team of crime - fighting  robot dog for 2026 World Cup",
  "date": "20260210T131500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Authorities in Mexico have unveiled their futuristic plans to use a group of ‘robot dogs’ to assist police in surveillance and crime prevention during the 2026 World Cup.\nHector Garcia Garcia, the mayor of Guadalupe, situated in the state of Nuevo Leon, presented his new ‘K9-X Division’ on Monday, made up of four crime-fighting droids equipped with ‘cutting-edge’ technology.\nThe metallic four-legged creatures – that wouldn’t look out of place in dystopian sci-fi classic Blade Runner – have been designed to enter dangerous situations and transmit live footage to help security personnel identify trouble before taking action.\n‘This is the police force that will help protect the World Cup!’, Guadalupe’s mayor Garcia exclaimed during the presentation.\nIt is hoped the robots will support in patrolling large areas and detecting unusual behaviours and objects, while identifying abnormal crowd patterns.\nThey were acquired by the municipality bordering Monterrey which is home to the Estadio BBVA, one of the 16 venues selected for this summer’s eagerly anticipated tournament in Mexico, Canada and the United States.\nA video released by local government in Guadalupe shows one of the robots walking on all fours through an abandoned building and climbing steps with – it must be said – some difficulty.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nIn the demonstration footage, one of the ‘dogs’ encounters an armed man before ordering the individual in question to drop his weapon via a loudspeaker.\n‘Guadalupe is a pioneer in including this new security system, which features video cameras, night vision lenses, voice command and warning, made with resistant materials capable enter rugged spaces,’ a statement read.\nGarcia explained the the ultimate goal of the robots was to support police with ‘first intervention’ and to ‘protect the physical integrity of officers’ tackling crime.\n‘With an investment of approximately 2.5 million pesos (£106,000), the robot dogs are part of the comprehensive security strategy, which includes the use of drones, a C4 centre equipped with new software, and more than 100 new patrols,’ Garcia added.\nThe Estadio BBVA, home of Liga MX outfit CF Monterrey, will host a total of four matches at this year’s World Cup in June and July.\nThe first of these games will take place on June 14, involving Tunisia and the winner of UEFA’s play-off Path B (Ukraine, Sweden, Poland or Albania) in Group F.\nTunisia will return to the stadium to face off against Japan six days later, before South Korea and South Africa do battle there in a Group A contest on June 24.\nThere will also be a round of 23 fixture held at the ground on June 29, featuring the winner of Group F and the team that finishes in second place in Group C.\nGuadalajara and Mexico City are the two other Mexican cities selected to host matches at the World Cup, with more than five millions fans expected to flock to the country to soak up the drama.\n‘Mexico is hosting a World Cup for the third time and Mexico City for the fourth time. We forget that in 1971 we also had the Women’s World Cup, it is important to say,’ Josefina Rodriguez Zamora, Mexico’s Secretary of Tourism, explained at last month’s Tourism and Investment Forum in Madrid\nMore Trending\n‘It is estimated that more than five million travellers will watch the matches, but that is not the big challenge.\n‘The challenge is that these visitors will travel throughout the country and that, if you arrive at a venue, you will want to visit Oaxaca, you will want to return to Merida, Los Cabos, Colima, Chiapas… that you will want to know the whole of Mexico.\n‘That is why we have 32 states within the World Cup party, not just three venues, we are 32. We have 13 matches and, most importantly, connection with all the cities that will be World Cup venues, both in the United States and Canada.\n‘We have the most beautiful thing, a country that awaits them with open arms.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Winter sun hotspot bans item used by 5,400,000 Brits – and threatens £350 fine\nMORE: Where is hot in March? The best holiday destinations for warm weather\nMORE: Jamie Carragher names his England World Cup squad as Arsenal pair miss out",
  "word_count": 776,
  "scraped_at": "2026-02-14T12:38:02.629775"
}