{
  "article_id": "a609434bff22",
  "url": "https://www.mirror.co.uk/3am/celebrity-news/lioness-icon-toni-duggan-cant-34946044",
  "title": "Lioness icon Toni Duggan  cant wait  to play football again months after retirement",
  "date": "20250330T091500Z",
  "domain": "mirror.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "EXCLUSIVE: Lioness icon Toni Duggan 'can't wait' to play football again months after retirement\nLioness legend Toni Duggan shocked fans last year when she announced that she was retiring from football but just six months later, she has revealed she's heading back onto the pitch\nToni Duggan admits that just six months after announcing her retirement from football, she's eager to get back onto the pitch. The former Lioness star, 33, left fans shocked when she announced her retirement in September 2024 following a career spanning 17 years. At the time, Toni admitted her career had been \"more than\" she could \"ever have dreamed of.\"\nShe played in the World Cup semi-finals, as well as the Champions League finals and some of the biggest games in domestic football. Aged 27, she told reporters her biggest fear was \"retirement.\" But now, the Liverpudlian is raring to go as she takes up a new role in football.\nToni will join the likes of her fellow Lioness, Jill Scott, as well as names including Louis Tomlinson, Sam Thompson and Olympian Sam Quek taking part in Soccer Aid for UNICEF this year. \"I don't know if its excitement or nervousness to be honest,\" she exclusively told the Mirror.\nSpeaking at the press launch at Manchester's Hotel Football, overlooking the mammoth Old Trafford, she went on to say: \"I don't know what shape or condition I'm going to be in after having a baby. I'll do some training before it but I can't wait, the type of players that are playing as well and to be training, never mind playing out there with them.\n\"I'm really looking forward to it.\" But this time around, Toni's young daughter, Luella, who she gave birth to in March 2023 will be in the stands with her family, cheering on the legend. \"The baby will be there, all my family will be there,\" she said before adding: \"As they was during my career.\n\"They'll all be looking forward to having a little giggle at me too.\" Toni admits getting to three semi-finals with England is one of the stand out moments from her career that she will always look back fondly on. \"I think for me, the 2015 World Cup in Canada, when we won that Bronze medal, I felt like that was the real start of the Lionesses.\n\"What they've gone on to achieve since then, I'm so proud of the girls and getting over the line and winning the European Championship. But just being a part of that and being part of the change, seeing the new heights that women's football has reached now. I'm so proud to be part of that journey.\"\nWhile she admits she's happy that women's football is finally taking centre stage, she \"loved\" being part of the fight before the Lionesses were given the recognition they deserved. \"There's still a long way to go,\" Toni said. She added: \"But I'm so proud to sit at home and see the stadiums sold out.\n\"The girls getting the recognition they finally deserve and it's the people before me that didn't get them opportunities. Just to create pathways for the young girls coming through, clear pathways and opportunities to be a full time professional footballer, as the lads can be.\"\nThis year, Soccer Aid will take place at Old Trafford but Toni feels no rivalry, despite having previously played for Manchester City. \"No, it's fine,\" she laughed before explaining: \"Obviously I played a lot of my career at Manchester City. I think Old Trafford is a great stadium, I've been here before when it's been held here in the past, the support has been brilliant.\n\"I'm looking forward to getting out on the pitch and seeing all the fans cheering and getting behind us.\" Being from the North West, she admits being \"so proud\" as supporters often rally behind their own. \"Coming from Liverpool myself, everyone knows how much football and the clubs mean to the city, I'm sure it'll be no different here in Manchester,\" she said.\n\"I'm happy Paul Scholes is on my team, hopefully he can give me a little assist,\" Toni joked. She continued: \"I'm really looking forward to it. It's a great occasion, raising loads of money and having a little bit of a laugh along the way.\"\nTaking part in Soccer Aid has a whole new meaning for Toni now that she's a mum. \"It resonates a bit more because I've got my little daughter, she's only one,\" she said. She went on to say: \"We don't realise how lucky we are and how much children around the world really need our support. Something so little from us can do so much for them, hopefully we can raise a lot more money as we have done in the past. Really, really proud to be a part of it.\"\nSince launching in 2006, Soccer Aid has raised an astonishing £100 million for UNICEF, helping children and families across the globe. The money raised goes towards helping those often caught up in conflict, helping with education, housing and vital medical supplies.\nThe match takes place on Sunday, June 15, at Old Trafford, Manchester. Tickets from £20 for adults and from £10 for juniors, and are available on the Soccer Aid for UNICEF website.\nLike this story? For more of the latest showbiz news and gossip, follow Mirror Celebs on TikTok, Snapchat, Instagram, Twitter, Facebook, YouTube and Threads.",
  "word_count": 906,
  "scraped_at": "2026-02-14T13:06:38.251026"
}