{
  "article_id": "a6173e54da6b",
  "url": "https://www.marketscreener.com/quote/stock/UNDER-ARMOUR-INC-39444/news/Under-Armour-Q4-FY-2025-View-Transcript-49952931/",
  "title": "Under Armour : Q4 & FY 2025 View Transcript",
  "date": "20250514T200000Z",
  "domain": "marketscreener.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "13-May-2025\nUnder Armour, Inc. (UA)\nQ4 2025 Earnings Call\nCORPORATE PARTICIPANTS\nLance Allega\nSenior Vice President, Finance & Capital Markets, Under Armour, Inc.\nKevin A. Plank\nPresident, Chief Executive Officer & Director, Under Armour, Inc.\nDavid Eric Bergman\nChief Financial Officer, Under Armour, Inc.\n......................................................................................................................................................................................................................................................\nOTHER PARTICIPANTS\nJay Sole\nAnalyst, UBS Securities LLC\nSimeon Siegel\nAnalyst, BMO Capital Markets Corp.\nSam Poser\nAnalyst, Williams Trading LLC\nLaurent Vasilescu\nAnalyst, BNP Paribas Exane\nPeter Clement McGoldrick\nAnalyst, Stifel, Nicolaus & Co., Inc.\n......................................................................................................................................................................................................................................................\nMANAGEMENT DISCUSSION SECTION\nOperator: Good day, and welcome to the Fourth Quarter 2025 Earnings Conference Call. All participants will be in listen-only mode. [Operator Instructions] Please note, this event is being recorded.\nI would now like to turn the conference over to Lance Allega, Senior Vice President, Finance and Capital Markets. Please go ahead.\n......................................................................................................................................................................................................................................................\nLance Allega\nSenior Vice President, Finance & Capital Markets, Under Armour, Inc.\nGood morning, and welcome to Under Armour's fourth quarter fiscal 2025 earnings conference call. Today's call is being recorded and will be available for replay.\nJoining us on this morning's call are Under Armour President and CEO, Kevin Plank; and Chief Financial Officer, Dave Bergman.\nBefore we begin, I'd like to remind everyone that our remarks today will include forward-looking statements that reflect Under Armour management's current views as of May 13, 2025. These statements may include projections about our future performance and are not guarantees of future results. Actual results may differ materially due to several risks and uncertainties which are described in this morning's press release and our filings with the SEC, including our most recent Annual Report on Form 10-K and Quarterly Reports on Form 10-Q.\nToday's discussion will also reference non-GAAP financial measures, which we believe provide useful insight into our underlying business trends. When applicable reconciliations of these non-GAAP measures to their most\ncomparable GAAP counterparts can be found in this morning's press release and on our Investor Relations website at about.underarmour.com.\nWith that, I'll turn the call over to Kevin.\n......................................................................................................................................................................................................................................................\nKevin A. Plank\nPresident, Chief Executive Officer & Director, Under Armour, Inc.\nThank you, Lance, and everyone joining us this morning. I felt confident as we close fiscal 2025 and begin preparing for this call.\nOver the past year, we built greater agility into the organization while making purposeful and strategic choices, elevating the brand through higher quality revenue decisions, unlocking meaningful SG&A efficiencies, and advancing toward a stronger, healthier Under Armour, all while navigating top line pressures. We had a clear and disciplined strategy tailored to the environment we faced in fiscal year 2025 and executed it with focus and determination.\nToday, we are energized and optimistic about our tangible progress, recognizing, of course, that there is still much work to be done to arrest our current trajectory and drive brand affection.\nAs we look externally, the business environment is currently evolving. It is always evolving, but so are we. Yes, the landscape is more dynamic and visibility beyond the near-term is unclear. That's precisely why our work over the last 13 months to build the muscle strength of agility and focus matters. We know what it takes to win, and we're ready.\nDave will cover our initial thoughts in the current trade policy environment a bit, but the main takeaway is that we're confident in our ability to manage through whatever lies ahead and stay on offense. While we're never satisfied with declining revenue, our fourth quarter results allowed us to exceed our fiscal 2025 outlook, demonstrating some of the foundational traction we're gaining as we reposition the Under Armour brand.\nFurthermore, we either exceeded or met the initial outlook we provided last May for every line item, with gross margin being our most important metric that benefited from our strategies of reducing promotions in our own DTC businesses.\nAs we work to regain pricing power, which is ability to deliver and maintain the full retail asking price, we see a significant long-term opportunity to expand gross margin by reshaping the composition of our business through a strategic refinement in our go-to-market process. By being more comprehensive, ensuring that every detail is considered from product that only UA can make. This is our reason to exist, innovation delivered with current or forward style.\nSecond, sales force, armed with technical knowledge of how to explain the UA difference to wholesale partners. Third, the right point of purchase expression at retail or online that tells the story. And finally, of course, social media collaborator and influencer support that provides the permission for our target consumers to engage with and by UA. We have a great base to build from, and we'll continue to refine this competency in the coming seasons.\nNow, reflecting on my first year back as CEO, I'm proud of the progress we've made: sharpening our strategy; streamlining operations; and establishing a stronger financial foundation. Most importantly, we've confirmed our identity as a global sports house brand with undeniable authenticity on any court, pitch, or field across the world.\nWe represent the underdog, those who weren't given all of God's gifts, but had to instead work harder to achieve excellence. We had to apply the rule of 10,000 hours to master their craft. We like to say that we don't innovate just so that we can run up the score, we innovate just to give our athletes a fighting chance. This mindset also means continually striving for improvement.\nAnd in that spirit, we're becoming leaner and more intentional, shrinking the battlefield wherever possible, which makes challenges manageable and creates the ability for small wins to eventually add up to large wins. We're focusing on high return categories, markets, and initiatives.\nBy simplifying the portfolio, streamlining operations, and exiting lower value activities, we're sharpening execution, boosting efficiency, and directing capital to its highest impact uses. Fewer things done better will fuel stronger, more consistent value creation.\nWe're working to turn complexity into clarity and clarity into action. Quick strike capabilities drive brand heat through trend-led drops while our 20 million member global loyalty program deepens engagement and drives repeat purchases. At the same time, streamlining materials, reducing SKUs and efforts to optimize our supply chain will help improve speed, lower costs and unlock future growth.\nWith sharper planning and [audio gap] (00:05:54), we're working to run a more agile, demand-led model that keeps us aligned with athletes and well positioned to regain market share and expand margins over the longterm.\nAt our core, Under Armour was built on the belief that athletes deserve better. Today, we're fulfilling that promise with greater discipline and precision, as we evolve our move toward a category management operating model that represents a structural shift and a game changer in how we serve athletes. By aligning product, marketing and regional teams around key categories like training, running, team sports, basketball, sportswear, golf, and licensing, we aim to execute faster and create greater impact.\nThis Athlete First model gives category teams clear ownership, with a single leader responsible for making decisions and acting with speed. At the same time, it centralizes key functions while empowering regional strategies to drive a leaner, more efficient go-to-market engine, strengthening the brand and improving returns. This disciplined approach is how we believe we will unlock value and succeed in the marketplace.\nStepping back into my current role and due to the 18-month lead times in our industry, the priority was product. Without great product, there is nothing else. Our Spring/Summer 2025 collections hit retail floors with renewed confidence in the fourth quarter. Even in a challenging sales environment, key apparel wins emerged: HeatGear Baselayer outperformed expectations; our Unstoppable Collection delivered strong results, and Sportswear is gaining meaningful traction.\nAt the center, we're accelerating innovation to energize athletes and elevate the brand. This quarter, we introduced the boldest SlipSpeed yet, ECHO, launched with Stephen Curry at the 2025 NBA All-Star Weekend, through a collaboration with luxury car designer MANSORY.\nLooking ahead, a premium apparel collection will debut this fall, uniting performance, sport and style. The Curry brand continues to expand its impact with the steady flow of the new Curry 12 and the De'Aaron Fox 1 colorways, along with exclusive athlete designs, keeping the brand in view and culturally relevant.\nOn the collaboration front, we've had smaller drops like our UA United Arrows collab in Japan and our partnership with recently acquired UNLESS, debuting at the Milan Design Week. Our regenerative plant-based sportswear collection of hoodies, T-shirts and shorts all crafted from natural fibers designed to decompose without leaving toxic residue or microplastics.\nAs we look towards Fall/Winter 2025, our product direction continues to sharpen, and our design language is becoming more cohesive. Our priorities are clear: win in men's apparel; unlock the full potential of footwear; and strengthen our connection with women, starting with trusted essentials like bras and bottoms and then building from there to grow her affinity for Under Armour.\nWe're especially energized by the upcoming UA Halo collection codenamed AURA at our recent investor meeting, which represents a premium expansion into next generation performance sportswear. UA Halo will debut with three distinct footwear offerings, a trainer, runner and a racer, each designed to meet specific athlete needs while uniquely incorporating the UA logo into the midsole structure, adding support, and just like our logo, perfect balance.\nComplementing the footwear is a range of elevated apparel that signals a new era for the brand in both design and innovation. At the same time, we're redefining our core base layer category with NEOLAST, material fiber breakthrough engineered to revolutionize stretch performance in apparel while being fully sustainable.\nAs we near the completion of our initial 25% SKU reduction over the past year, we're maintaining disciplined inventory management to create space for a stronger, more focused product architecture. Together, these steps will drive brand momentum, enhance profitability and unlock new growth opportunities.\nOur ambition, put simply, is to sell so much more of so much less at a much higher full price. And there's a Trojan Horse product in the mix too, a game changer disguised as a backpack. The No Weigh, that's W-E-I-G-H backpack, launched this past Thursday in a short-term test format for us with patent pending auxetic suspension straps that flex with your body to help evenly distribute weight, creating a lighter feeling from the bag. It's amazing.\nWe're not only testing the bag, but also the $140 price point in an otherwise $40 to $65 market, similar to what we did last year with our StealthForm Uncrushable Hat, bringing innovation to a $13 to $25 market, introducing the UA performance lens and placing the opening price point at $45. And that hat is working for us.\nI'm providing this level of detail about an accessory item because it's meant to serve the broader metaphor for what we expect to do with our shirts and shoes going forward with four to six products each season for spring and fall. This example is meant to set the edge for what you can expect from our go-to-market with these key four to six products each season, a comprehensive go-to-market strategy that inspires consumers to want to buy UA at premium price points.\nIf you have the chance, please visit our Investors page now at about.UnderArmour.com for a more complete visual of our new go-to-market approach and how we're raising the bar here at UA. This includes, as I described earlier, first and foremost, an innovative design right product that only UA could build. It also encompasses the tools and the story of how our teams are being prescriptively trained to sell the product, brand right point-of-sale execution and finally, social and influencer support to drive buzz and conversion.\nBut this only happens when the product delivers the magic. We're confident in our pipeline. We, frankly, have always had great innovation, but believe the largest opportunity lies in the way we holistically support the product\nwith a story that both explains why it is special and also makes you feel something. This is brand and great companies buy commodities and sell brand.\nWe've not done a good job enough on the story front for some time, and that changes with the execution we just completed in launching the No Weigh last week in our testing protocol. This will prepare us for when we come back with this bag in a few months for broad market distribution in the critical back-to-school period.\nOver the past nine months and the leadership of Brand President, Eric Liedtke, we've made substantial progress in reshaping our narrative. Today, we have a distinct storytelling strategy aligned with our product vision, establishing a cohesive brand voice across all touch points.\nAs our storytelling aligns with the strength of our product innovation in fiscal 2026, our objective is to enhance our brand relevance and unlock greater brand differentiation. We're particularly focused on young athletes. We're not increasing our marketing spend. Instead, we're making it work harder. With an annual budget of roughly $500 million in some of the world's top sports athletes and assets, we're reallocating resources more intentionally to generate greater brand heat and engagement.\nBig moments drive brand affinity, as Stephen Curry continues to break his own 3-point record. The night he was set to make 3-pointer number 4,000 of his career, we created an epic Dave Chappelle narrated campaign that didn't just follow the moment, it defined it. The campaign, which ran across social media, was a cultural splash of brand relevance that put UA at the forefront of basketball fans worldwide.\nSharon Lokedi's recent record-breaking Boston Marathon win wearing an Under Armour shoe was another decisive moment for the Velociti Elite, showcasing its performance on the world stage. We backed it with a full funnel campaign celebrating her achievement and firmly positioned Velociti Elite as the go to choice for runners chasing greatness.\nAcross the lineup now, from the $250 Elite that Sharon just validated, to the $160 Pro to the $130 Speed and the\n$100 Pace, Velociti meets runners at every level driving brand and energy and commercial opportunity. Building on this momentum, we're extending Velociti's design language into one of our highest volume footwear franchises. The $75 Assert, which will relaunch with its updated design this fall. Further strengthening segmentation and expanding our reach across price points.\nThe more visual description of this product or pricing hierarchy is also outlined on our investor page. And we encourage you to view this and a few other examples of what is different at UA and how we're raising the bar.\nOur athlete strategy is equally intentional. New signing like the NBA's Davion Mitchell, WNBA's Nika Muhl, and six NIL athletes who we signed in time for this past March Madness and are part of a disciplined approach to re-architecting a future-facing roster that we will continue to nuance.\nMeanwhile, the impact is clear. 27 UA teams made the NCAA tournament with one of our Under Armour teams from both the women's and men's bracket reaching the Final Four.\nIn golf, we'd like to extend our heartfelt best wishes to longtime Under Armour athlete and one of the truly great people in sports, Jordan Spieth, as he competes this weekend at the PGA Championship, chasing the elusive career Grand Slam. We're all behind you, Jordan. Go get them.\nAnd also this fall, we're reaffirming our American football roots when Under Armour is back on field as an official glove and footwear provider for the NFL. Strengthening our performance credentials, stars like Justin Jefferson and Kyle Hamilton, along with this year's number one Draft pick, Cam Ward, further enhanced our status in a sport central to our identity.\nAdditionally, we're evolving our marketing mix to meet modern consumer behavior by emphasizing social, experiential and digital first branding, building. UA Next which is our Global Youth Activation platform, utilizes events like the Under Armour, All-America Football and volleyball games earlier this year, along with serialized content and grassroots activations that are gaining traction and partnerships with creators and major colleges like Notre Dame, Wisconsin, Maryland who help drive scalable, story-driven campaigns. This marks a true shift in our strategy. Fewer bolder moves amplified by better storytelling and smarter deployment of world-class assets. This is how we will build brand energy and win share with athletes, partners and shareholders.\nUnder Armour is moving to lead in a dynamic environment among leagues, teams, collabs, influencers and of course, NIL. And we're making steady progress towards that goal.\nOur North American transformation is well underway. Over the past year, we've been working to redefine our ecommerce channel to become a brand flagship. A destination that inspires and elevates. By reducing promotional days and discounts, we prioritize brand equity and profitability over short-term volume. The results speak for themselves. More than 10-point increase in the full price sales mix, double-digit AUR growth and a more profitable channel overall.\nAs we enter year two of this transformation we will move even further beyond the outlet model to build a more dynamic, connected and premium digital platform applying proven lessons from our success in EMEA to accelerate progress.\nWe also see a clear opportunity to strengthen our value proposition in physical retail. Driving productivity across our formats remains a top priority.\nIn factory house stores, our largest North American footprint, we are significantly reducing storewide sales, [ph] advance (00:17:24) in offering 365 days a year of full price on some products too, focusing on SKU rationalization to create a more curated premium experience that enhances consumer clarity and operational efficiency.\nOur brand houses represent the pinnacle of UA retail, and we're investing accordingly. Our new campus headquarters flagship store is performing ahead of expectations and the new aesthetic is helping us shape our next retail concept to model for the more than 2,000 Under Armour branded stores around the world, allowing for flexibility in store size to fit the specific market. Growing our store base is a future ambition as we become more deliberate with our products and the stories that sell them.\nStarting in fiscal 2026, we'll roll out a tiered market specific strategy to enhance merchandising and drive productivity across our network.\nWholesale remains critical and is evolving. We owe our partners great product and a compelling story that results in great sell through at full price. We know where we want to be and who we want to partner with, and we're using this time to strengthen those key relationships with transparency of our brand direction, underpinned by our conviction in offering fewer products with more intention that could only come from UA.\nOur category-led model significantly helps there, combined with a sharpened go-to-market discipline that we expect will result in greater demand for both the consumers we have today, and the new ones we are inviting to engage with us.\nin EMEA, our top performing region in fiscal 2025 are maintaining the discipline to protect the brand strength we built, strong partnerships and a clear category focus will drive momentum. In fiscal 2026, we'll concentrate on key growth markets like France, Spain and Germany, while deepening brand advocacy across global football, running and sportswear anchored in training.\nIn APAC, we're resetting the marketplace now to foster sustainable premium growth. Despite a highly promotional environment, our efforts to streamline inventory, reduce discounting and enhance sales quality are laying the groundwork for healthier expansion.\nJust a few months in now, though brief, early signs indicate that it's working. UA strong performance driven brand equity and best-in-class distribution infrastructure position us to scale with appropriate patience and pace. We'll continue to apply proven strategies from North America and EMEA to drive full price demand across key categories.\nAt the core of our progress is a high caliber leadership team, united by purpose and built to drive sustained performance. We haven't just added talent. We've attracted exceptional, proven leaders, many of whom you met at our December investor meeting. This represents a structural shift. It signals a cultural transformation at Under Armour.\nHigher standard of excellence is firmly taking root, and I'm committed to ensuring the leadership strength translates into sharper execution, improved results. We're quite simply raising the bar at UA.\nThe impact is clear, and it is our culture that stands to benefit. The move to our new headquarters has accelerated the shift, infusing the company with fresh energy and new ideas. While cultural change takes time, the foundation is firmly in place and the momentum is unmistakable. We're building a more connected, agile and performance driven Under Armour that seems to be taking hold.\nWe also welcomed three new board members Don Fitzpatrick, Eugene Smith and Rob Sweeney, each bringing expertise in finance, operations and sports. Their leadership directly supports our strategic priorities, accelerating financial performance, shaping our connection with athletes, and fueling brand heat. They'll be instrumental as we unlock new growth and position UA for success.\nAs we enter fiscal 2026, sustaining momentum across product, story, service and team is critical for advancing our brand transformation. We move forward with clarity, conviction and discipline thoroughly attuned to the shifting global landscape and ready to navigate it with agility and resilience.\nOur ambition goes beyond a comeback, it's a reinvention. Under Armour's greatest chapters remain in front of us, a future driven by sharper focus, bolder innovation, and deeper connections with athletes. We're operating with urgency, while we may have more time than we think, we do not have as much time as we would like, so we're just getting to work.\nWith the right team in place, a clear strategic vision and unwavering commitment to excellence, we're not merely preparing for the future, we're determined to dictate it.\nAnd with that, I'll turn it over to Dave to walk us through our fourth quarter fiscal 2025 results and provide further insight into our outlook for the first quarter. Dave, over to you.\n......................................................................................................................................................................................................................................................\nDavid Eric Bergman\nChief Financial Officer, Under Armour, Inc.\nThanks, Kevin. Moving straight into our fourth quarter fiscal 2025 results, which exceeded expectations and allowed us to surpass our full year fiscal 2025 outlook.\nFrom a revenue perspective, the fourth quarter was down 11% to $1.2 billion. The results by region follows. North American revenue declined 11%, primarily due to a decrease in our DTC business, which was driven by lower ecommerce sales resulting from our ongoing efforts to limit promotional activities. This was accompanied by a decline in revenue from our owned and operated stores. Within wholesale, we experienced a decrease in full price sales, which was partially offset by an increase in the timing of sales to a third-party off-price channel.\nRevenue in EMEA decreased 2%, although it remained flat on a currency neutral basis. Furthermore, the decline in full price wholesale was partially offset by growth in our direct-to-consumer, distributor and off-price businesses.\nAligned with our expectations, revenue in APAC was down 27%, or 26% when adjusted for currency fluctuations. This decrease was primarily due to the highly competitive and promotional environment, as well as our efforts to foster a healthier business, including adopting some of the same strategies we've employed in North America for our e-commerce operations.\nWithin Latin America, revenue declined 10%, primarily due to unfavorable foreign exchange impacts. Without FX, currency neutral revenue rose by 3% in the quarter, driven by our distributor business.\nFrom a channel perspective, wholesale revenue decreased 10%, driven by lower full price sales, partially offset by growth in the off-price channel and the timing of those sales to third-party partners.\nDirect-to-consumer revenue was down 15%, mainly due to a 27% decrease in e-commerce sales, stemming from ongoing efforts to establish a more premium online presence through fewer promotions and discounts.\nSales at our owned and operated stores declined by 6% during the quarter. Licensing was down 15%, primarily due to the decision to bring our socks business in-house. This will be the final quarter of comparing this business change.\nFinally, by product type, apparel revenue was down 11% with softness across most categories in the quarter, partially offset by strength in outdoor. Footwear declined by 17%, reflecting in part our ongoing proactive portfolio management efforts, as we work to optimize segmentation and assortment. In our accessories, business was up 2% in the quarter with strengthened team sports and run. The category also benefited from our decision to bring socks in-house.\nOur fourth quarter gross margin increased 170 basis points year-over-year to 46.7%. This increase was driven by 150 basis points of supply chain benefits, due mainly to lower product and freight costs, 80 basis points of pricing benefits, primarily from lower discounting and promotions in our DTC business, as well as some impact from more favorable royalty terms. And roughly 20 basis points were gained from favorable foreign currency impacts and product mix. These benefits were partially offset by roughly 90 basis points of unfavorable channel and regional mix.\nMoving to SG&A, which increased 1% to $607 million in the fourth quarter, excluding roughly $16 million in transformation expenses related to our fiscal 2025 restructuring plan and around $5 million in litigation settlement expenses our adjusted expense was $586 million, up 7% versus last year's adjusted number. This was driven primarily by higher marketing expenses and incentive compensation, partially offset by savings from ongoing cost management efforts, including lower consulting expenses.\nNext, during the fourth quarter, we recognized $16 million in restructuring charges and combined with the $16 million transformation expenses recorded in SG&A, we had approximately $32 million in restructuring charges and related expenses for the quarter. So far under our fiscal 2025 restructuring plan, we have recognized $89 million of restructuring charges and related transformation expenses, of which $55 million is cash related and $34 million is non-cash.\nExpectations for total charges and expenses under this plan remain within a range of $140 million to $160 million, and we anticipate the remainder will occur by the end of fiscal 2026.\nMoving down the P&L, we recognized an operating loss of $72 million in the fourth quarter. Excluding the transformation expenses, litigation settlement expenses and restructuring charges, our adjusted operating loss was $36 million. On the bottom line, our reported diluted loss per share was $0.16, while our adjusted diluted loss per share was $0.08.\nShifting to our balance sheet, inventory was down 1% year-over-year to $946 million, which aligned with our expectations to finish in line with last year's level. Our cash balance at the end of the quarter was $501 million and we had no amounts outstanding on our $1.1 billion revolving credit facility.\nAdditionally, we repurchased $25 million worth of our Class C stock during the fourth quarter, retiring 4.1 million shares. So far, under our three-year $500 million share repurchase program, we have repurchased $90 million of our Class C stock, retiring 12.8 million shares.\nNow, moving briefly in our full year results, fiscal 2025 revenue declined 9% to $5.2 billion, slightly better than our expected 10% decline. North American revenue was down 11% for the year. EMEA was flat, and APAC revenue declined 13%. Our full year gross margin increased by 180 basis points to 47.9%, surpassing our outlook. This improvement was driven by reduced freight and product costs and the benefits of lower discounting in our DTC channel, especially in e-commerce.\nFull year G&A expenses rose 8% to $2.6 billion, Excluding a $266 million litigation settlement expense, approximately $31 million in transformation expenses, and a $28 million impairment related to exiting our previous headquarters, adjusted SG&A expenses decreased by 2% to $2.3 billion. This decline was primarily attributed to cost management initiatives, including benefits realized to-date from our fiscal 2025 restructuring plan.\nOperating loss was $185 million. And excluding transformation expenses, restructuring, impairment charges and litigation settlement expenses, adjusted operating income was $198 million, slightly ahead of our prior outlook of\n$185 million to $195 million. Full year diluted loss per share was $0.47. And our adjusted diluted earnings per share was $0.31, which was above our previous outlook of $0.28 to $0.30.\nMoving into fiscal 2026, building on Kevin's remarks, it's important to recognize the plan we established before the announcement of recent tariff changes. As we enter the second year of our turnaround, we've made measured progress across our strategic, operational and financial objectives. Before the recent changes in trade policy, this translated into an expectation of a modest top line contraction for fiscal 2026, as we continue to prioritize higher\nquality revenue and brand strength while driving further gross margin expansion and getting back to leveraging our SG&A cost structure. Altogether, driving operating income that was set to be ahead of fiscal 2025 levels.\nHowever, since changes in trade policy are expected to have a significant impact, we are proactively evaluating a range of mitigation strategies. This includes exploring potential cost sharing initiatives with key partners, diversifying our sourcing footprint to minimize exposure to affected regions where feasible, and examining targeted price adjustments to protect margins in areas with unique pricing power.\nTo provide a clear view of our global sourcing profile, approximately 30% of our volume is sourced from Vietnam, 20% from Jordan, and 15% from Indonesia. The remaining third is strategically diversified across a number of other countries, each representing a low to mid-single-digit percentage. This deliberate diversification creates a well-balanced portfolio, reducing reliance on any single market and enhancing our ability to navigate geopolitical, costs and supply chain complexities from a position of strength.\nWe also remain focused on managing SG&A by enhancing organizational efficiency, tightening discretionary spending, reducing travel and third-party costs, and concentrating investments on initiatives directly supporting near-term revenue and margin expectations. Given the significant uncertainty that tariffs create concerning potential shifts in consumer demand and rising product costs, we believe limiting our outlook to the first quarter of fiscal 2026 is prudent. This measured approach demonstrates our commitment to maintaining flexibility and ensuring transparency as we navigate the evolving environment.\nAs such, we expect our first quarter revenue to decline by 4% to 5%, with North America also experiencing the same rate of decline due to softness in our Spring/Summer 2025 wholesale order book, which we detailed in our last few calls. We anticipate high single-digit revenue growth in EMEA, supported by FX tailwinds and the Easter shift, along with a mid-teen percentage decline in APAC, as we continue actions to lay the groundwork towards a healthier business.\nRegarding gross margin, we expect an expansion of 40 to 60 basis points compared to the previous year. This includes anticipated benefits from a more favorable product mix, reduced product freight costs and favorable foreign exchange rates. It is important to highlight, however, that changes in tariff policy are not expected to significantly impact our first quarter.\nFor SG&A, we remain focused on cost management in the context of our expected top line decline in the current operating environment. Including anticipated transformation expenses related to our fiscal 2025 restructuring plan, adjusted SG&A expenses are expected to leverage slightly compared to the prior year, driven mainly by ongoing savings from actions taken under our restructuring plan and other spending efficiencies. Bringing this together, we expect adjusted operating income to reach $20 million to $30 million and adjusted diluted earnings per share to be $0.01 to $0.03 in the first quarter of fiscal 2026.\nIn closing, while the environment remains dynamic, the sharper agility and stronger processes we've embedded give us confidence in our ability to manage near-term challenges while staying squarely focused on long-term value creation. Most importantly, we have the right team, energized, resilient, and relentlessly committed to delivering an authentic brand and business transformation. We remain unwavering in our strategic priorities, firmly believing they position us to unlock our full potential while maintaining the flexibility to adapt. Simply put, we are ready and built for what's next.\nNow, we'll open the call to questions. Operator?\nQUESTION AND ANSWER SECTION\nOperator: We will now begin the question-and-answer session. [Operator Instructions] The first question comes from Jay Sole with UBS. Please go ahead.\n......................................................................................................................................................................................................................................................\nGreat. Thank you so much. I'd love to ask about the North American reset. Just give us a little bit more color and dive into a bit more about how it's working and how it's shaping up in fiscal 2026?\n......................................................................................................................................................................................................................................................\nYeah. Hi, Jay. Thank you. Well, first and foremost, this always begins with leadership. And we're very fortunate to have Kara Trent, who's my, our partner here. And she's also the one who ran this play for us in Europe. So, she is battle ready and has brought that now in the chair for the last 14 or so months here in North America. And so, that being the playbook that we're running here, it's just - it's great practice for us and - to have Kara. So, that kind of leadership is great. And I'm happy to say that we've built a team that's substantially built around Kara as well.\nWe use this theme of modeling the behavior that we want to create, meaning we've gotten to work and taking ourselves out of bad situations with some of the constant discounting that I think for too long we were leading the conversation with consumers with. It was wishful thinking for us to get us positive. And that's why we use the metaphor of something like the backpack. I think it was our attempt to just try to demonstrate this is what we think excellence looks like. So, trying to show you even through something like an accessory, when we get it right, because I don't believe we've done that. I think we made great product, but I think we've been somewhat limited to walking into a store and frankly, finding clothes on a hanger.\nThe story for a company like Under Armour that spends years validating our factories, our fabrics, the products that we build, I don't believe that story had come through. So, this comprehensive I think metaphor of number one, you need a great product, so I use the backpack, because you put it on, and you're like, wow, it feels like half the weight in there. Number two, the ability for us to communicate that to our sales forces and them to understand how to sell that. Number three, the appropriate in-store POP, what it's going to look like. And then finally again, as I said in my prepared remarks, the way that we're engaging with social media and changing away from just traditional media into things which are more relatable to that 16 to 24-year-old we're looking to go to.\nI'm not sure we have a timeline, but what we will have is much better execution. The ability for us and I say model the behavior, if we can do that, what I described with the backpack, can you imagine laying that into something like the Halo trainers that releases our Unstoppable collection, whereas you'll see, we're reinventing our base layer, building on the base and core that we have, but looking forward to what else that can be. I think begins with the opportunity that we have.\nSo, there's - I feel like the - prior to April 2, I think we had a really good line of sight. It wasn't perfect. As Dave said, we weren't ready to grow. We were still in an ability of contracting where we were right now. But we feel like we're getting on our front foot. I think that begins with the belief that we have from the team and the ability for us to know that we can move this brand to something that's much more affectionate from the consumer.\nSo, the brand momentum, it should build ahead of revenue. But the 18-month reset that we talked about in May of 2024, we're not far from that. We're progressing as planned through the year end. So, we're working with our wholesale partners. We're building confidence from them. And it's just one step at a time right now. But we're basically - we're in a fixed bayonets and down to hand-to-hand. And we know what it takes. And there's a lot of good competitors out there, but we feel like we've got a pretty good story and we've got a compelling brand as well.\n......................................................................................................................................................................................................................................................\nGot it. Kevin, that's great. If I can ask one more, maybe, can you share just some more details about your upcoming major brand activation? When will we be able to see it?\n......................................................................................................................................................................................................................................................\nYeah. We told you that it was going to be a large, full force campaign that we were going to have. But to be clear, it's embracing that underdog DNA that we've spoken about, I think several times, including our investor meeting back in December. Eric is digging into this marketing function. So, just getting our arms around that, we've also brought in a new SVP of Brand in Americas Marketing in Tyler Rutstein, who really is driving a lot of that connection that we want to the target consumer.\nSo, what you're not going to see is just a big campaign with Super Bowl ads. It is going to be smaller breakdowns of content that's relevant to the channel where we're marketing. The idea we have from a branding or marketing standpoint is that, I think anyone would tell you we make good product. What we need, though, is we need permission from this kid. More importantly, the person that that kid is looking to across social media, the influencers, the NIL, the athletes, the others. And so, that's where I think we're doing a better job of just telling the story of the product and making sure they understand that what the brand DNA is all about.\nI can't emphasize enough, a big part of this is what's coming with this campaign is that we're leading with story, we're not leading with a price. The activation, it will mostly be in the back half of the year too, Jay. But as I said, you're going to feel this in more sort of micro doses than you will as one sort of big splash. And we think that's the most effective way for us to deal with our marketing dollars right now.\nI also think that you'll feel the benefits of this as we get probably a little more focus with our category management structure. And that's what's going to lead us, is that each of those GMs, the five separate GMs that we have of driving across, selecting the right influencers, making sure that we're in the culture, what NIL will do for us. And then we're going to lean on some of these intrinsic assets we have. And I don't just mean our sort of headline or banner athletes like the Stephen Currys or the Justin Jeffersons but it's also getting into NIL athletes. It's leaning on our UA Next platform, which is we found, just as part of that. And a kid who has engaged with Under Armour or seen us without UA Next, that the NPS score is something that we believe can be significantly improved on.\nAnd if the kid has seen us or interacted with us through our 3,000 high school base that we have plus how that rolls up to our All-America or UA Next events, the consideration goes up considerably up into the high-50s and high-60s. And so, we're going to continue to build out these platforms that we've got long-term legacy and you'll continue to see us just spend our money a lot more thoughtfully and appropriately.\nSo, product marketing is going to be a part of this as well, I think as we're showcasing with the backpack because I think that's the greatest example of what does this brand mean or stand for, it gives us the ability to do that, ensuring that we give them the, a, what it is, b, what it does and, c, how it's going to make you better, in the whole\ntime, allowing you to feel something. That's what brands do and that's what I think we're in the process of making happen.\n......................................................................................................................................................................................................................................................\nGot it. Sounds great. Thank you so much.\n......................................................................................................................................................................................................................................................\nThank you, Jay.\n......................................................................................................................................................................................................................................................\nOperator: And the next question comes from Simeon Siegel with BMO Capital Markets. Please go ahead.\n......................................................................................................................................................................................................................................................\nThanks. Hey, guys. Good morning. Kevin, how are you thinking about the path just normalizing e-com specifically, maybe with the planned reduction and promo activities. Is there a specific revenue level or just some other way we can think about the timing, duration and maybe magnitude of the expected e-com revenue declines and stabilization? And then, Dave, I think you noted the costs related to the restructuring plan. Just how do you think about the expected savings from it, I guess, [ph] from (00:42:06) uncertainty of tariffs notwithstanding looking a little bit longer-term, how you're thinking about the ability to take SG&A expenses out of the model with this new lower revenue base? Thank you.\n......................................................................................................................................................................................................................................................\nYes, Simeon, I'll kick off with e-com. Obviously, we've been able to report positive traction after a year and controlling the controllables, which is our own DTC businesses is great. And proof positive in the full price sales mix on our website, up double-digits year-over-year. With promo and clearance down, I think what we want to do is make sure that this isn't just meant to be a transactional site where people go and they find the grids but they're actually looking and they're being brand inspired. I think too many sites, there's a lot of efficient ways to order product from a lot of different places, but when it's on our site, they should be required to see the story because I think that is our differentiator. That is our moat. And I think that for too long we've become frankly just clothes on a hanger.\nAnd also on an e-commerce front, point of view is incredibly important. It's not welcome to our website or welcome to our store, here's a bunch of stuff. What would you like to buy? But being very intentional, that's why I use that analogy of when we're getting it right, what we're showing what we did with the backpack and trying to use that metaphor, it's more about being able to have four, six expressions of that a year, imagine what that will look like when it manifests through the new Halo product that we drop later this year as well. And so, that will be felt on our website too, and ensuring those other pieces.\nLoyalty is also really important for us. It's - we've got 18 million rewards members in the US alone, 10 million over in APAC for us. And active members, one thing that we found, which is a massive opportunity, generate 50%-plus more of our revenue and have double the repurchase rates. And so, with loyalty over 50% of the US DTC, it's really getting a slot and getting us close and really understanding who our consumer is and how we can speak to them in a better way.\nI think also, again, the way that we showcase online, you're not just going to find a grid page with a static picture, but using a lot more video, being a lot more dynamic. So, we're working on the back-end infrastructure of our website as well, and that's been really important for us.\nSocial commerce is going to play a part in what we're looking to do as well, and Tyler and team have been really driving that down at the grassroots level. But all-in-all, in short, a healthier brand, right? E-commerce foundation for sustainable growth is what we're looking to. And we're going to have great stories to tell and what better platform than our own channels.\n......................................................................................................................................................................................................................................................\nSimeon, on the restructuring and SG&A side, as we drove through the restructuring plan in 2025, we brought about $35 million of savings in fiscal 2025 from that. When we think about the full year run rate of those actions and then layering on the additional actions for fiscal 2026, especially the closure of the Rialto DH out in California, that expected run rate savings on a full year as we get to the end of fiscal 2026 is going to be closer to $75 million or so, which we're excited about. And then essentially a little bit higher than that is you step into fiscal 2027, and you have a full year of all the fiscal 2025 and 2026 activities.\nSo, that's definitely helpful and a big step in the right direction for us. And as we step into planning for fiscal 2026 pre-tariff, we were looking for slight leverage in our cost structure, which is a great step in the right direction as well. And we're also seeing that as we plan out just the Q1, that the outlook that we've given. We do want to be mindful not to cut too deep when we think about any additional SG&A work that we want to drive, depending on what happens from a tariff and overall demand scenario, especially in brand marketing where sustained investment is critical to the long-term breadth and health of the company.\nBut we do manage each of our expenses pretty tightly now. We've made a lot of progress there, a lot more discipline around consulting, around CapEx spending, discretionary spending, T&E. Again, as Kevin mentioned, optimizing the marketing, spending smarter, not more. And we've been able to reduce the SG&A now for multiple years in a row. So, we're definitely getting to a pretty good spot and we're going to continue to manage it tightly as we drive through the year.\n......................................................................................................................................................................................................................................................\nThat's great. Thanks a lot, guys. Best of luck for the year ahead.\n......................................................................................................................................................................................................................................................\nThank you, Simeon.\n......................................................................................................................................................................................................................................................\nOperator: And the next question comes from Sam Poser with Williams Trading. Please go ahead.\n......................................................................................................................................................................................................................................................\nThanks for taking my questions. I guess can you give us some idea, it sounds like you're with - about the inventory on hand, units and dollars and how like are there a lot less units now within the inventory relative to the dollars? And how do you look at that moving over time as well as the units and dollars in the revenue both in fourth quarter and sort of within the guidance relative to growth of each.\nSo, from a inventory perspective, again, we feel pretty good about where we landed the year, pretty much right on what we expected. Obviously, we're managing this year pretty tightly as we get into fiscal 2026 and a little bit of uncertainties around demand with the current tariff environment. So, we're being pretty tight with that. Managing the POs, we do expect that, wherever demand ultimately develops through the year that we'll be able to manage inventory within a pretty tight range to that.\nObviously, the cost per unit is going to be going up, by how much we're not sure, as obviously with each announcement that seems to change a little bit. But we feel confident in our ability to manage it tightly. We don't have a large percentage of old or excess inventory. A lot of it is current and we believe that we're going to be able to use our factory houses in a really positive way to move through a lot of that. And then obviously still tapping the off-price channel a little bit, but staying within our kind of our operating principle where we've been keeping that to the 3% to 4% mix of revenue as we did in fiscal 2025.\nAnd relative to the Q1 guide, again, we're not necessarily getting into too many details for full year, but on Q1, we feel pretty good about the outlook that we gave. There's not that much change in price versus unit in the Q1 guide. More of that will probably come as pricing changes come about later in the year.\n......................................................................................................................................................................................................................................................\nYeah, I don't - I think I may have said it wrong. Your inventory is up 18% at the end of the quarter in dollars. What are the units up? And then within the guidance that you provided for the first quarter, with revenue down 4.5% to 5%, do you expect units, given that you're trying to make, are units are going to be down less, given that you're trying to, as you evolve to this more premium goal that you're aiming towards? I'm not trying to figure out if your inventory is in line or not.\nI'm really trying to figure out, are the ASPs going to steadily work their way up within the guidance and within the inventory levels? So, your units will be - if your inventory is down 18%, your units are down 25%, which would then mean that you're basically making your - elevating your brand?\n......................................................................................................................................................................................................................................................\nYeah. I guess, Sam, the way that we're looking at is little bit more holistically because there's going to be puts and takes between the different regions. We did take some returns in Q4 of fiscal 2025 to help make sure that we were coming into this year healthy. More of that was footwear driven, which has little bit of a higher unit cost. So, there's a lot of mix items going on. I don't know that digging into it relative to the unit progression from Q4 into Q1, is going to tell much more of a different story for us.\n......................................................................................................................................................................................................................................................\nHey, Sam, just to be clear, inventories down 1% on the quarter, down 1%. I thought you referenced plus 18%.\n......................................................................................................................................................................................................................................................\nOh, no, I'm sorry. Down 15%. I'm sorry. I'm looking at something else, I apologize for that.\n......................................................................................................................................................................................................................................................\nYeah.\n......................................................................................................................................................................................................................................................\nInventory is down - but I mean, with inventory down, I mean, the question is are units down more than the dollars or less than the dollars as a percent? And then do you foresee going forward that as your inventory gets to the appropriate level, that your - as you elevate the brand, will your dollar inventory grow faster than your units like will units be less as you get more focused?\n......................................................................................................................................................................................................................................................\nYeah. I got you. Well, what I'm looking for is when I use the selling so much more of so much less at a much higher full price. One of the key metrics that I track daily is average unit retail and just saying are we - is the price that people are willing to pay for Under Armour more or less, and looking at that across apparel, footwear and accessories equally.\nSo we're highly tuned to that. But yeah, of course, our - hopefully we're driving that in margin, we're driving that what people feel about the brand. But yeah, that's going to be better more premium product is that we're not looking to take 6% of the Lycra out of garment A, B or C and how that will translate into us building more margin that way.\nPricing power is incredibly important for any brand and it's one of the things which we are keenly focused on. And so, that means we can't just show up with the Joneses in $10 and $15 BINs, selling product by the load. So, we're going to be incredibly intentional and very specific with the products that we bring to market. But yeah, it will cost more money for sure. But we need to prove that, we'll take it one step at a time and we've got a great base to build on.\n......................................................................................................................................................................................................................................................\nThanks very much.\n......................................................................................................................................................................................................................................................\nThanks, Sam.\n......................................................................................................................................................................................................................................................\nOperator: And the next question comes from Laurent Vasilescu with BNP Paribas. Please go ahead.\n......................................................................................................................................................................................................................................................\nOh, good morning. Thanks very much for taking my question. Kevin, Dave, it makes sense you're not guiding for the full year, but can you possibly speak to your Fall order book? How has it changed over the last few months due to the tariff noise? And should we assume a certain rate, like, could it be slightly down for on a year-over-year basis? Thank you very much.\n......................................................................................................................................................................................................................................................\nYeah, I'll jump in on that one. Right now, we're definitely limiting to Q1 at this point. And a lot of that, if you think about it, with the tariff rates, they're pretty much temporary at this point. They may change significantly. So, we don't feel it's prudent to give outlook that will also have to change and be adjusted kind of announcement to announcement. So, we're trying to be prudent there. So we're really only looking at Q1 covering Spring/Summer 2025. But I would say that the product feedback has been positive. And the influence of the new product organization I think is clearly visible.\nAnd as momentum grows, Fall/Winter 2025 will build into Spring/Summer 2026. And at this point, even with the tariff and uncertainty, we're not seeing any key partners with cancellations. I think our partners know that they're valued and we're really focusing on that and we're giving them reasons to believe. And Kevin went through a lot of those points in his prepared remarks.\nAnd I think that there are clear improvements in the design and style that are being noted by our partners. So, regaining shelf space takes time as you think about back half of the year. But our focus and execution are improving and we're seeing those results.\n......................................................................................................................................................................................................................................................\nVery helpful. And then on the gross margin, again, another great quarter. I think you called out, Dave, 150 bps of supply chain benefits, due to - mainly from lower product and freight costs and then 80 bps from just lower promotions. I would presume that there is, that the 80 bps continues to be a positive going forward.\nAnd then how many more quarters do you have of the 150 bps of benefits from just lower supply chain cost? Does it end in 1Q or does it continue? And then lastly, again, EMEA guided up high single digits while for first quarter, how should we assume that? Is that just kind of a wonky first quarter, any one-time things that we should consider? Or is that just continuing momentum for the brand in that region for the foreseeable future? Thank you.\n......................................................................................................................................................................................................................................................\nYeah, I think relative to gross margin prior to the new tariffs, we were looking for continued gross margin expansion due to continued product costing improvements, ongoing work with the higher quality revenue, including the DTC discounting, the promotion reductions and a little bit of slight expected FX headwinds.\nHowever, the new developing tariffs will create obviously some significant headwind. And so, we're only providing Q1 at this point. The larger benefits, when you think about Q4 of 2025 with the favorable supply chain impacts, product costs, freight costs, some of that will continue.\nBut we've got a lot of that that's been recognized and worked through with our partners through fiscal 2025. So, I wouldn't expect or anticipate that those benefits would be as large in fiscal 2026. And then same thing relative to the DTC discounting favorability, because we took such big strides in fiscal 2025, especially in Americas, we wouldn't see as much of that year-over-year benefit continuing as an incremental benefit in fiscal 2026. There's a little bit of benefit there in APAC because we started to do more of that as we're helping to clean up and reset APAC a little bit, but definitely not to the magnitude that we saw in fiscal 2025.\nAnd then, Kevin, I don't know if you want to touch on EMEA.\nYeah, let me just sort of give a global picture first, which is we recently made some leadership moves in APAC that we're into about four, five months into that process and have the markets actually reporting into me. And I'm heading over there in a few weeks again. As it relates to EMEA, not unlike we have here in America, you heard the affection that the team really has for our leadership in Kara here, but we're fortunate to have A-plus leadership in EMEA as well with Kevin Ross.\nAnd so, the kind of momentum that we've had, again, that began under Kara's watch over there and that Kevin has really just accelerated over the last 18 months or so. It allows us to play offense. And it feels great and it's a great goal that everybody can look around the world and say, this is what it feels like and when you're just winning on a consistent basis.\nAnd so, I think what's there is they have a really clear proposition for the consumer. It's authenticated in sport, specifically football. We've got nearly 30 athletes across all of the European leagues highlighted by winners like Achraf Hakimi, who plays for PSG and playing in the Champions League final in Germany, I think this weekend.\nSo, and again, that speaks to just what we have. We've got a bit of a cultural following now that's coming out of Europe, specifically out of France and Paris and in the UK also, but we're well-positioned with strong fundamentals. I think that this ambition we have, which is people seeing Under Armour's moat, which is it's not just a cool hoodie or a nice top or a great shoe, but people know that if it's UA, it's got the performance aspects to it.\nAnd so, we're really building on that. And that means rooting and authenticating our shelves in sports - in sport where we - I think we just have a great following. The product that we're putting, the football boot, we have athletes calling us, agents calling us, clubs calling us as well for our positioning there. And I think that's what feeds the entire ecosystem.\nIn addition to great relationships with Sports Directs, the JDs, Intersports, El Corte Ingls as well as our distributor shifts that we have in places like Turkey. So, I think we're just doing things right there.\nAnd then as we continue to just lean on the product, as we continue to come more full force with things like some of our sportswear expressions that we have launching Halo, there's just a lot of energy and excitement for the brand. ECHO is doing really well for us there also, so we're learning a lot.\nBut again, it's good to be able to look at EMEA, and just see what success really looks like. And so, that ambition, it all fosters from that playbook that we've been running there for quite some time.\n......................................................................................................................................................................................................................................................\nThat's great to hear. Thank you very much for all the color.\n......................................................................................................................................................................................................................................................\nOperator: The next question comes from Peter McGoldrick with Stifel. Please go ahead.\n......................................................................................................................................................................................................................................................\nHi, good morning.\nGood morning, Peter.\n......................................................................................................................................................................................................................................................\nWith the ongoing - thanks for taking my question. With ongoing evolution of the good, better, best products pyramid, I was curious if you could talk about the structural product offering influence on AUR and underlying gross margin as we look forward?\n......................................................................................................................................................................................................................................................\nYeah. Let me just - yeah, sorry. Let me just give you a structure wise. So, I think a great example or a metaphor that we have from a product standpoint of how we're thinking about the business. Today, we talked about we make a lot of good, we make some better and nowhere near enough best. We're looking to reshape our business with about 25% good, 50% better, and 25% best. So, we're looking to just ladder up. And what we don't want to do is we're not looking to necessarily limit the amount of good products we have. We just want to reshape this business.\nA great example that I think is what we use with Sharon Lokedi in the Boston Marathon. This is also on our Investor page. It spells it out really simply. But when you can authenticate at the highest level with something like the Boston Marathon to smash a course record like Sharon did just a couple weeks ago, in the $250 Elite product that we have, the Velociti Elite, it really sets the pace and what we've done a good job, I think where we lost this as we sort of had a running execution. Now, we're actually taking that hierarchy all the way down through the ecosystem, meaning you've got the $250 Elite shoe that'll be in specialty run.\nWe then have commercialized that with $160 version, you'll find in like big box sporting goods and some run specialty as well as. The $130 version, $100 version as well that we can open and bring down to family. And then as well as that design lines roll into our $75 Assert. And building this, it was the same designers that worked on the top Elite from a overall aesthetic standpoint all the way down to the $75 product. And so, I think that's what we're just getting a lot more synergy with our product as it relates to one another.\nApparel is no different and we're getting it right. I think you'll see that from Halo. It is going to be a pinnacle expression from us, but it is going to be - and it also crosses us and pushes us from a, it's authentic product that's great to perform in, but also most importantly, it also looks great as well. And of course it has the Under Armour DNA. So, fixing that is something which is really important for us.\n......................................................................................................................................................................................................................................................\nAnd I think, Peter, when you think about AUR and also even ASPs, too, in fiscal 2025, we had a pretty much lower eCom mix. We also had a lower APAC mix. We also had lower footwear mix. All three of those contributed to a little bit lower ASPs. As we drive further into fiscal 2026 and back out of fiscal 2026, those things will probably change a little bit from a mix perspective and will help ASPs in general.\nAnd as we kind of comp the promo and discounting reductions that we've been doing, that'll start to stabilize and turn more towards a positive for us. So, we're definitely focused on that and we're going to keep driving that forward.\nOkay. Thank you. And Dave, I recognize the challenge in forecasting and guidance, but I was curious if you could give us a run rate gross tariff impact to COGS, given current level of visibility?\n......................................................................................................................................................................................................................................................\nYeah. Listen, I totally appreciate the question. And obviously, we're running through a lot of different scenarios at this point. And every few days it seems like there's new information and new rumors out there. So, at this point, we're going to kind of stay prudent and just speak to Q1 and then obviously, we would hope to be able to give a lot more color on that as we get through the next call.\n......................................................................................................................................................................................................................................................\nTotally understand. Thank you.\n......................................................................................................................................................................................................................................................\nThanks, Peter.\n......................................................................................................................................................................................................................................................\nOperator: And the next question comes from Paul Lejuez with Citi. Please go ahead.\n......................................................................................................................................................................................................................................................\nQ\nHi, this is [ph] Kelly (01:02:47) on for Paul. Thanks for taking our question. I appreciate you giving some color on how you were thinking about the business prior to the tariff announcements. Could you just help us bridge the gap between the kind of down mid-single-digit 1Q revenue guide and the expectation, again, prior to tariffs for sales down slightly, if you could just maybe talk about that from a geo and channel perspective? Thank you.\n......................................................................................................................................................................................................................................................\nYeah, I mean, I guess a couple things there. We are giving the outlook for Q1 to be down 4% to 5%. We did mention that prior to the tariff announcements and a lot of the uncertainty over there, we were anticipating a full year modest revenue decline as we continue to kind of work to reset and strengthen the brand and progress on our strategic priorities.\nThat decline that we were anticipating for full year was anticipated to be a little smaller than the decline we had in fiscal 2025. So, to kind of give a little bit of a box around that. But then also expecting some gross margin expansion, due to the continued costing improvements and also some of the continued reductions in DTC discounting and promos.\nAnd then with the SG&A leveraging that, we expect to start driving in fiscal 2026 as well, landing with operating income that was going to exceed fiscal 2025. So, that was a lot of the work that we were driving towards and we're going to keep focused on all of those areas as we learn more about the tariffs and any potential demand impacts. But we feel pretty good about that. And you can tell from the outlook in Q1 that would basically back you\ninto originally thinking our back half was going to be slightly better than our front half. Again, we'll have to see how things develop now with the tariffs and the uncertainty that are out there. But that's originally what we were seeing.\n......................................................................................................................................................................................................................................................\nQ\nGot it. And just one more from us. On the sort of the North American DTC channel where you've been seeing some weakness due to pulling back on eCom. As you started to lap those promos, I mean, should we expect DTC channel growth in 2026, obviously outside of some of the tariff stuff? Or is what's happening with the rationalization in the factory outlets going to sort of offset that? Thanks.\n......................................................................................................................................................................................................................................................\nYeah. Again, we're not going to give a lot of detail on full year, but what I would say is that as we move towards the back half of fiscal 2026, we would have made a lot of those steps and finishing those plays from a DTC and health perspective in North America. So, the pressures that we've had in DTC, North America, because of a lot of those strategic decisions, should be much more minimized in the back half of fiscal 2026. And so, we feel pretty good about that. And obviously stepping into fiscal 2027, again, tracking the demand situation here with tariff uncertainties, but that was where we were heading.\n......................................................................................................................................................................................................................................................\nAnd [ph] Kelly (01:05:55), I'll drop a little color on the model that you're working on, too, because as Dave is talking through some of the technicals that we're working through, we're just looking to drive brand affection right now. So, as we're thinking about fiscal 2026, there's always a silver lining in everything. And so, we're using this moment and opportunity just to make sure that we're really clean. We're delivering ourselves and showing up at retail with our wholesale partners the way that we want to be seen. And we're modeling that behavior by demonstrating that at our own eCom and our own stores as well. And so, it'll be a full funnel approach us for sure.\n......................................................................................................................................................................................................................................................\nQ\nGot it. Thanks for the color. Best of luck.\n......................................................................................................................................................................................................................................................\nThank you.\n......................................................................................................................................................................................................................................................\nOperator: The next question comes from John Kernan with TD Cowen. Please go ahead.\n......................................................................................................................................................................................................................................................\nQ\nGood morning. This is [ph] Chris (01:06:37) on for John. Two questions for us. First, in terms of - sort of a broader picture for North America, kind of in relation to the broad initiatives that are underway with this reset, kind of what do you see as a normalization or long-term opportunity for segment margin recovery in North America as you kind of move along this strategic reset? And I have one follow-up. Thank you.\nYeah. Let me just start with some of the basics there, which is to be clear, we don't necessarily love where we are right now, but we certainly love where we're going. Culture is going to be a big part of this. And instilling that belief across the organization, across our partners at every touch level, suppliers, retailers, distributors, franchisees, and especially our own team, this - where we are in this reset, and then, as I used in my prepared remarks, the reinvention for the brand, it starts with our team. And so, I think that, for me the last 13 months have been really constructive in that approach.\nAs I said, we don't need any excuses. Meaning that it's not just about us transacting or trading on price, which I feel like we've done for a bit too long. And we just really need to drive that affection from that 16 to 24-year old athlete, as well as the consumer that we have today, which includes the 16 to 24-year old. But we think we can drive that more product story, service and team, is this foundation that we talked about often throughout our history of the fundamentals we need get right with. And as we say, product is our everything. And number one, the best product we should make or manufacture should be our story.\nThe rest of the team is falling in on all those other pieces that we have of making sure we have the right products, the right place, the right time. And so, we're really just driving down to the fundamentals. And as I said when we're getting this right during this reset and we're moving our shelves, especially here in North America, from what Under Armour would you like to buy to? Here's four very specific ideas that we have for you that we think that you'll love. That's when I think that will be really in strategy. And so, we've got work to do, but we're making this manifest across every channel touchpoint from eCom to our outlet stores to or factory houses all the way to our full priced brand houses as well, and especially in our retail partners.\nSo, they're waiting to see us when there's competition from a lot of different places. But I like our positioning. I know that this team can pull it together and excited about what it means in the short, mid and long-term.\n......................................................................................................................................................................................................................................................\nQ\nTerrific. Thank you for that. And then just how should we think about the category mix within the context of apparel and footwear in your Q1 revenue guide? And is there anything that you can talk to you about the margin differential between those two categories currently and kind of where you see that longer-term? Thanks so much.\n......................................................................................................................................................................................................................................................\nYeah, I'll jump in on that real quick. When we think about Q1, we do anticipate that footwear will have a little bit more pressure than apparel and accessories for Q1. And that's something that we've been talking about over the last year as well. And from a margin perspective, that actually does help us a little bit because our footwear is a little bit lower gross margin than our apparel. That gap is something that we've been decreasing a little bit each year as we continue to design our footwear differently and continue to improve relative to price points there.\nSo, it is something that we're cognizant of relative to the mix. We're looking forward to continuing to drive up footwear longer-term. We understand that that can create a little bit of a gross margin headwind for us longer-term, but that's something that we can plan for and navigate and are looking forward to that.\n......................................................................................................................................................................................................................................................\nQ\nThanks very much. Best of luck.\n......................................................................................................................................................................................................................................................\nThank you.\n......................................................................................................................................................................................................................................................\nThank you.\n......................................................................................................................................................................................................................................................\nThank you.\n......................................................................................................................................................................................................................................................\nOperator: This concludes our question-and-answer session. The conference has now concluded. Thank you for attending today's presentation. You may now disconnect.\nDisclaimer\nThe information herein is based on sources we believe to be reliable but is not guaranteed by us and does not purport to be a complete or error-free statement or summary of the available data. As such, we do not warrant, endorse or guarantee the completeness, accuracy, integrity, or timeliness of the information. You must evaluate, and bear all risks associated with, the use of any information provided hereunder, including any reliance on the accuracy, completeness, safety or usefulness of such information. This information is not intended to be used as the primary basis of investment decisions. It should not be construed as advice designed to meet the particular investment needs of any investor. This report is published solely for information purposes, and is not to be construed as financial or other advice or as an offer to sell or the solicitation of an offer to buy any security in any state where such an offer or solicitation would be illegal. Any information expressed herein on this date is subject to change without notice. Any opinions or assertions contained in this information do not represent the opinions or beliefs of FactSet CallStreet, LLC. FactSet CallStreet, LLC, or one or more of its employees, including the writer of this report, may have a position in any of the securities discussed herein.\nTHE INFORMATION PROVIDED TO YOU HEREUNDER IS PROVIDED \"AS IS,\" AND TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, FactSet CallStreet, LLC AND ITS LICENSORS, BUSINESS ASSOCIATES AND SUPPLIERS DISCLAIM ALL WARRANTIES WITH RESPECT TO THE SAME, EXPRESS, IMPLIED AND STATUTORY, INCLUDING WITHOUT LIMITATION ANY IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, ACCURACY, COMPLETENESS, AND NON-INFRINGEMENT. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, NEITHER FACTSET CALLSTREET, LLC NOR ITS OFFICERS, MEMBERS, DIRECTORS, PARTNERS, AFFILIATES, BUSINESS ASSOCIATES, LICENSORS OR SUPPLIERS WILL BE LIABLE FOR ANY INDIRECT, INCIDENTAL, SPECIAL, CONSEQUENTIAL OR PUNITIVE DAMAGES, INCLUDING WITHOUT LIMITATION DAMAGES FOR LOST PROFITS OR REVENUES, GOODWILL, WORK STOPPAGE, SECURITY BREACHES, VIRUSES, COMPUTER FAILURE OR MALFUNCTION, USE, DATA OR OTHER INTANGIBLE LOSSES OR COMMERCIAL DAMAGES, EVEN IF ANY OF SUCH PARTIES IS ADVISED OF THE POSSIBILITY OF SUCH LOSSES, ARISING UNDER OR IN CONNECTION WITH THE INFORMATION PROVIDED HEREIN OR ANY OTHER SUBJECT MATTER HEREOF.\nThe contents and appearance of this report are Copyrighted FactSet CallStreet, LLC 2025 CallStreet and FactSet CallStreet, LLC are trademarks and service marks of FactSet CallStreet, LLC. All other trademarks mentioned are trademarks of their respective companies. All rights reserved.",
  "word_count": 12364,
  "scraped_at": "2026-02-14T12:43:27.829373"
}