{
  "article_id": "a640f684c4be",
  "url": "https://www.justarsenal.com/we-all-needed-a-bit-of-confidence-potm-victoria-pelova-says-after-arsenal-women-beat-villa/363024",
  "title": "  We all needed a bit of confidence  POTM Victoria Pelova says after Arsenal Women beat Villa",
  "date": "20240325T203000Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal Women headed to Villa Park last night, to face Aston Villa in the Barclays Women’s Super League. After suffering a 3-1 resounding defeat to top-of-the-table Chelsea the previous week, and dropping away from the WSL front-runners Chelsea & Man City, Arsenal Women had a point to prove.\nOur Gunners were 1-0 down to the hosts going into half-time, but rallied magnificently in the 2nd half, with goals from Pelova, Lotte Wubben-Moy & Blackstenius winning the game for Arsenal 3-1.\nPlayer of the Match, Arsenal midfielder Victoria Pelova, opened the scoring for our Gunners, after a shot from Russo was parried out by Anna Leat onto the waiting boot of Pelova.\nVictoria Pelova spoke to SkySports, after the match. She discussed to our Gunners loss to Chelsea and the was very complimentary of Aston Villa’s keeper, Anna Leat, who had one heck of a game:\n“We all needed a bit of confidence after the game against Chelsea, but we showed even if we are 1-0 down we can turn it around, so that is a good thing.\n“I was looking and it was about 75 minutes and she [Leat] was just having every single ball! And I thought there cannot be 15 minutes more!\n“But she did well, and I am happy for her in that way, but glad we scored!\n“In football, confidence goes up and down, when we beat Chelsea 4-1 we had lots of confidence, and if you lose, it is not that it goes away, but it is good that we won, and how we won today.”\nDid you enjoy the game Gooners? Does it give you a bit more confidence for the Conti Cup Final next week, against Chelsea?\nCOYGW!!\nMichelle M\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 318,
  "scraped_at": "2026-02-14T12:22:20.383693"
}