{
  "article_id": "a648dda46525",
  "url": "https://punchng.com/obaseki-doles-out-n42-5m-to-edo-queens-for-nwfl-triumph/",
  "title": "Obaseki doles out N42 . 5m to Edo Queens for NWFL triumph",
  "date": "20240531T024500Z",
  "domain": "punchng.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Edo State Governor, Godwin Obaseki, on Thursday doled out N42.5m to the players, coaches and backroom staff of Edo Queens following the team’s victory at the Nigeria Women’s Football League Super Six Tournament in Yenagoa, Bayelsa State.\nThe 30 players got N1m each, technical crew N5m, backroom staff N5m, while the team’s supporters club got N2.5m.\nWith the victory, the Queens also clinched a ticket to represent Nigeria in the CAF Women’s Champions League, Africa’s topmost women’s club football competition.\nJubilant fans, led by the wife of the Edo State Governor, Dr. Betsy Obaseki, joined a motorcade of the victorious Queens from Western Boys High School in Ikpoba-Hill and cheered the team through Aduwawa, Akpakpava, Plymouth and Ring Road, before terminating at the Government House, Benin City, where they were received by Governor Obaseki.\nObaseki was joined by the governorship candidate of the Peoples Democratic Party, Dr. Asue Ighodalo, and other top government officials to receive the triumphant girls.\nThe Governor, who praised the team for their excellent campaign at the 2023/24 season of the Nigeria Women’s Football League and victory at the Super Six Tournament, assured them of the state government’s sustained support.\n“You have tried and have made us proud. Money alone can’t do it all but we will give you money for a job well done and for making us proud. Each player of the team will get N1m for the achievement, while the coaches will get N5m,” Obaseki stated.\n“I am so happy and proud today as you have done us proud by bringing this trophy home. The trophy we have been looking for in the past 29 years is now with us. We know you will continue to be champions. I encourage you to work hard as your government and Governor will continue to support you.\n“Whether I am here or not, the person that will replace me will continue to support you.”\nBesides rewarding Edo Queens, Obaseki also handed the supporters club of Bendel Insurance a new bus.",
  "word_count": 335,
  "scraped_at": "2026-02-14T12:48:02.611819"
}