{
  "article_id": "a662f315e4c6",
  "url": "https://www.standard.net.au/story/8456243/premier-speedways-2023-maxs-race-features-transfer-based-format/?cs=10266",
  "title": "Premier Speedway 2023 Max Race features transfer - based format | The Standard",
  "date": "20231213T063000Z",
  "domain": "standard.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A change of format is expected to open up the field for Max's Race and provide a different spectacle for speedway fans.\nSubscribe now for unlimited access.\nor signup to continue reading\nPremier Speedway's December 16 event - named after racing icon Max Dumesny - will utilise the transfer-based format commonly used in the United States, with drivers progressing to the feature races based on heat finishing positions rather than points.\nPremier Speedway general manager Michael Parry said a similar format was used during last year's Max's Race and made for a more unpredictable contest between drivers, with 54 already nominated for the event.\n\"It's a bit of an excitement thing,\" he said. \"We try and do some different things so it's not the same format.\n\"This really widens it open to a different spectacle... and levels out the playing field.\"\nQualifying will consist of two flights determined by a random draw rather than seeding.\n\"We could end up with Brock Hallett and Jamie Veal and Jock Goodyer all qualifying in the same group, divided into two flights,\" Parry said.\nThe top-24 cars from each flight transfer to heats, with the top four from each advancing straight to the A-Main.\nAmerican duo Carson Macedo and Chase Randall make their first appearances for the Australian season at Premier Speedway, while Warrnambool's Corey McCullagh returns to the drivers seat in the V90 with a new team.\nMacedo, who finished top three on the famed World of Outlaws tour this season with eight race wins, returns to drive for Dyson Motorsport's N99, while Randall will steer the USA9.\n\"Rapt to have Carson and Chase back, both exciting talents, and really shown in their past season in America that they're a force to be reckoned with,\" Parry said.\nGates open 3.30pm with racing to start at 5.30pm.",
  "word_count": 303,
  "scraped_at": "2026-02-14T13:10:20.760042"
}