{
  "article_id": "a691336cd438",
  "url": "https://www.fromtherumbleseat.com/2023/12/28/24017415/mailbag-12-28",
  "title": "Mailbag 12 / 28",
  "date": "20231229T024500Z",
  "domain": "fromtherumbleseat.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The mailbag is brought to you by Section 103, home of the most unique and comfortable Georgia Tech apparel. Get 10 percent off your next order with coupon code FTRS to order items such as the Lightweight Short-Sleeve Coach Hoodie to celebrate the bowl victory.\nMailbag 12/28\nWhat are your New Year’s Resolutions for GTAA?\nGTalbatross: What looks better to NFL teams as an NFL draftee: 1) I played for 3 coaches at 1 university and had my best season my last year.2) I played for 3 different coaches by transferring each year and had my best season my last year.\nChris: I’m honestly not sure because the NFL’s evaluation process is notoriously nebulous and somewhat disconnected from reality. Both situations demonstrate that you’ve grown and have better knowledge of what works for you, but I’m sure there’s some weird reason an NFL war room would discount one or both of them.\nJack: I agree with Chris, and will add that they really are just looking at on-field performance. Coachability or lack thereof will come out regardless of who is on the sideline.\nBen: Agree with what’s already been said. I think you look for more than just “best year” when looking at prospects. You’re looking for coachability and specific skillsets.\nJake: I am not sure either is a preferred one, but in my extremely-not-football-coach mindset, I would look for the former first.\nGTalbatross: Bball question: where is our 3 pt shooting going to come from this year and what does Kelly need to see the ball drop?\nJake: I think Kowacie Reeves (17-45 | .378) and Deebo Coleman (18-50 | .360) have been fine from distance on a reasonably large sample size. Kyle Sturdivant has been okay (.333) on a smaller sample size, as well. The problem with these three (and probably compounded by Miles’ .222 percentage on a much larger 81 attempts) is that the consistency between games really has not been there. There have been some decided clunkers across the board in that department.\nAs for fixing Miles’ shot, it could be a lot of things. I feel like we had a similar question about Mike Devoe a few years ago. I think, though, that the team has been on a long road trip during the heat of finals, which could contribute at least somewhat.\nRob: There is no question that 3-point shooting has been a massive struggle this season. The Jackets rank 325th in the country in three-point percentage. Tech has only shot above 30% from behind the arc in one game (the opener against Georgia Southern). I think the answer to your question was in the question itself. Miles Kelly has to get things going for the Jackets to give this team a spark from three-point distance. I am not sure what has to happen for him to see the ball drop, but he is shooting just 22% on threes compared to 38% last season.\nGTSMURF: What are your New Year resolutions for yourself?\nBen: I graduate from my master’s program in May, so my next challenge is applying for doctoral programs, so I guess my resolution is to get into grad school again?\nJake: Pretty straightforward this year - exercise more, hydrate better, and save having a beer or two for the weekend which I expect will all contribute to a boost in my metabolism.\nGTSMURF: What are your New Year resolutions for GTAA?\nJack: Keep fundraising as much as J Batt can manage. We’ve made considerable progress this year between all the various initiatives, and ticket sales are back on the upswing. Campus is about to dramatically grow and change over the next decade, and part of that is a growing GTAA between adding at least one women’s sport and being a critical marketing arm for the Institute.\nJake: Consistency on the court for the basketball teams, especially in being smart with the ball and limiting turnovers and fouls, as well as consistency on mound in particular for baseball and softball. I think all four programs have NCAA tournament-level upside.\nCTjacket: Are either men’s or women’s basketball playing in the NCAAs this year?\nJack: If I had to say right now, it’s no for both teams. Both are so, so young and are not on the top half of the ACC. There will be some really nice wins sprinkled in there for both squads (Duke for the fellas, Georgia for the gals), but the variance I think we’ll see is going to kill any hopes of either team going dancing. I’m looking at 2025 as the year we see both teams make a serious push for an at-large bid.\nJake: I suppose I should have read a bit further down in my previous replies. I think both teams have the upside to get there, and I think a Nevada win would have put MBB on the outside of the bubble with a lot of good opportunities for statement wins left to play for, though Nevada is no slouch, either. They both have a lot of work to get there, but I elect optimism.\nDressHerInWhiteAndGold: Who’s on your Mt Rushmore for:\nGT football, GT Hoops, BeesBall?\nI’m guessing we may need to add some sub-groups: coaches, point guards, hitters etc.\nIt’s a rich field from which to select your “4 heads”.\nJack: I almost don’t feel qualified to do this considering I haven’t been around long enough, but I’ll throw this one out there for y’all to discuss (I’m taking from the entire pool of options here): John Heisman, Bobby Cremins, Danny Hall, Calvin Johnson.\nBen: Sticking just with football (because that’s where my expertise is), I’ll say Calvin Johnson, Justin Thomas, Demaryius Thomas, Phillip Wheeler. I don’t know that they’re the four best, but they are four that all have significance for me.\nJake: If I were to take four heads total from the three sports combined, I tend to favor coaches for their long term additions to their teams. I think that list would be Heisman, Dodd, Cremins, and Morris. I think the last entry on the list is my most controversial inclusion, but Morris won four straight ACC titles and 51 games in a single season, whereas Tech baseball had been way off in the wilderness prior to his tenure. Although Hall has surpassed him as Tech’s all-time wins leader by any coach in all sports by a wide margin, his win percentage is quite competitive in addition to the trophy case. As for the other three, Heisman is the father of all Tech sports, including the three specified, Dodd is the soul of the athletic program ethos, and Cremins is to MBB what Morris is to baseball, though more acknowledged due to his longer tenure.\nBurdell91: With the increasing number of opt-outs and pre-bowl-game transfers, how long does the bowl “system” have before it just becomes a joke? The expanding playoff seems like it’ll take a bite out of bowl interest, so how long before FBS drops the B and the postseason is just a playoff (like every other NCAA sport, including the other levels of football)?\nYou can’t force players to play; I don’t see how the opt-out/transfer tide can be stemmed at this point. The only thing they’re going to be interested in is games that “mean something”, i.e. playoff games. The rest of the postseason is purely exhibition, and more and more players have no interest in risking injury for a team where they already have one foot out the door.\nChris: I think it’s hard to say that bowl system is going to end up failing because the games don’t mean something - what a bowl means to a team/player is going to dynamically change each season. For example, our Gasparilla win was incredibly important and meaningful to us, but a program like Clemson would probably turn their noses at the invite. Part of the reason I think that expanding to more bowls does work most of the time is that it gives the opportunity for teams to play in games they personally find meaningful. The tension that’s always pulled against though is that there’s a lot of bowls that aren’t meaningful nationally, which is what TV corporations and talking heads care about. That’s kind of always the thing with college football though: at it’s best it’s a regional sport with tons of storylines, but ESPN just wants to talk about C O A C H P R I M E and the Playoff contenders. I think there’s a couple things that could happen to make more players play: 1. the NCAA could disallow pre-bowl transfers and make players wait until some date after the NC game. 2. I wouldn’t be shocked to see NIL contracts start to include clauses that require players to play in a bowl game, or maybe include bonuses for playing in one. Several of our players did some Tampa-based ads before the game, so clearly it presents some sort of financial incentive to them.\nBen: I don’t know that bowls will every go away in full. After the inevitable split, I could see whatever is left after the formation of the superleague continuing to use the bowl system (slightly modified) while the superleague uses a playoff.\ntyler_pifer92: I learned today that Sherrer is the Interim DC, which I somehow completely missed.\nIf you had your pick, who would it be?\nWho do you think is a candidate?\nBen: I was unsure if Key would actually try to hire another DC this offseason. Never at any point did Sherrer use the interim tag, but now that KQ has put together a hot board and is talking about the search, here we are. Some candidates that come to mind immediately (simply because they’re not employed now) are guys like Rocky Long, Zach Arnett (probably a long shot imo), or the DC that Elko didn’t bring with him (although that may be a sign if Elko didn’t bring him).\nPartywaggin: Saw on the Twittermachine that KQ was commenting about how quiet CBK has kept the search for DC. Not that KQ knows everything, but if he’s commenting, it must be really quiet!\nI wonder if CBK has his eye on a coach in the playoffs, so nothing has had a chance to start leaking yet until those are over?\nJack: This has been a continuing trend in the J Batt era. His office and the greater GTAA have nearly no leaks. We got fooled on the Willie Fritz potential hire. We didn’t have much more than heavy assumptions of who the other football HC interviews were. Damon Stoudamire was not a top of mind name until Tech told everyone he was the guy. The DC search seems to have followed the same pattern of keeping everything close to the vest until the time is right. I laud them for that.\nBen: Frankly, I don’t know who Tech will hire, and I won’t be surprised if we don’t learn much until it’s announced or just prior. As Jack mentioned, this administration has been much better job keeping rumors and leaks close to the vest.\nJake: I am pleased that there are fewer leaks. I trust Key and the team to go about their business - much like they did when hiring Faulkner - and that we will all be able to break things down properly once that is completed. It’s this in-between chatter that causes me a bit of undue stress, I would say. If it’s a guy in the playoff, though, or a yet-to-be-completed bowl game, that is likely a team with positive defensive value.",
  "word_count": 1941,
  "scraped_at": "2026-02-14T13:10:05.985517"
}