{
  "article_id": "a6ac8c18a637",
  "url": "https://tribune.com.pk/story/2512204/nwsl-draws-two-million-fans-in-new-season",
  "title": "NWSL draws two million fans in new season",
  "date": "20241127T033000Z",
  "domain": "tribune.com.pk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NWSL draws two million fans in new season\nExpanding to 14 teams, the NWSL achieves unprecedented growth in attendance, viewership, and fan engagement\nThe National Women’s Soccer League (NWSL) set a new attendance record in 2024, according to a report by Sports Business Journal. Clubs averaged 11,250 fans per match, a six percent rise compared to the previous year.\nThe league expanded to 14 teams this year, up from 12 in 2023, which contributed to a significant boost in overall attendance. For the first time in its 12-season history, the NWSL welcomed two million fans, a 44 percent increase from 2023 and a staggering 96 percent rise from 2022.\nA total of 89 matches saw crowds of 10,000 or more, surpassing the previous year’s record of 55 matches. Additionally, 14 million viewers watched regular-season matches on television.\nEight of the 12 returning teams recorded higher attendance figures compared to the previous season. The Chicago Red Stars experienced the largest growth, partly due to a high-profile match against Bay FC, which drew an NWSL record crowd of 35,038.\nThe National Women’s Soccer League (NWSL) is the premier professional women’s football league in the United States, founded in 2012. It represents the pinnacle of women’s football in North America, featuring top domestic and international players.\nThe league operates under a single-entity structure, where the teams are owned collectively, ensuring financial stability and fostering competitive balance.\nMatches are played across a regular season, with teams competing for playoff positions and the chance to claim the NWSL Championship. The league's steady growth over the years has cemented its place as a global leader in advancing women's sport and increasing its visibility.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 301,
  "scraped_at": "2026-02-14T12:10:14.520561"
}