{
  "article_id": "a6b5b2083722",
  "url": "https://www.hillingdontimes.co.uk/news/24291865.jill-scott-urges-man-city-send-steph-houghton-wsl-title/",
  "title": "Jill Scott urges Man City to send Steph Houghton out with WSL title",
  "date": "20240501T140000Z",
  "domain": "hillingdontimes.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Lionesses legend Jill Scott says Manchester City can give Steph Houghton the perfect send-off by sealing the Women’s Super League title.\nHoughton announced she will retire at the end of the season, bringing an end to a glittering career in which she has been synonymous with the rapid growth of the women’s game.\nThe 36-year-old won 121 caps for England, was the star player for Team GB at the London 2012 Olympics and captained City to their first and only league title in 2016 alongside Scott.\nCity are within touching distance of a second title as they currently sit six points clear at the top ahead of rivals Chelsea – having played two games more – and Scott, 37, called on her former side to get over the line to see Houghton off in style.\n“I would love to see City win it, especially with it being Steph Houghton’s last season,” said Scott, who was speaking at the launch of the FA’s Greater Game initiative.\n“She deserves to go out on a high and I would love to see her with that trophy in her hands. She has been fantastic. To still be playing now even with the injuries she has had, she is a true warrior when it comes to football. Everybody at Man City will want to win it for her.\n“I remember 2016, it was the best day of my life really, I think we ended up doing the treble that season. It has been a long wait and it has often been so close but just not getting their hands on the trophy.\n“It’s exciting, City have had a very good season in the league and so have Chelsea. It has been more difficult for Chelsea just because of the amount of games they’ve got, it’s almost like you’re a victim of your own success sometimes being involved in four trophies.\n“For neutral fans it has been a great title run-in, sometimes at this time of the season it is all tied up, so it is going to be an exciting last few weeks.”\nCity’s title credentials will face a big test on Sunday when they welcome Arsenal to the north-west.\nAny slip up will be readily seized upon by Emma Hayes’ Chelsea, who have their eyes on a fairytale of their own with Hayes set to leave West London to manage the USA in the summer after 12 years at the helm.\nThe dream of a first Champions League title was extinguished last weekend with a 2-0 defeat to Barcelona at a sold-out Stamford Bridge, but Scott believes Hayes will go down as a legend of the game regardless of how the next few weeks play out.\n“The whole league would want to wish her the best in her next chapter,” she added. “She has been a great ambassador of the game, she has done so much for Chelsea.\n“I remember when I was playing for Everton and where Chelsea were when she took over to where they are now challenging for the Champions League.\n“Either way you look at it, it’s going to be a perfect end for someone.\"\nScott had her own dream send-off by winning Euro 2022 with England at Wembley, but has since switched her attentions to inspiring the next generation.\nThe 161-time England international was back on the pitch in north-west London to help launch the Greater Game’s move initiative, which aims to inspire and support young people, between the ages of 12-16, into making healthier lifestyle choices.\nThe project has created a new football-themed game called ‘DROPS’, but Scott insisted it is about simply getting moving in whatever way works best for each individual.\nShe said: “It’s all about inspiring healthier lifestyles through a focus on four pillars; think, move, eat and sleep. It’s just about making little changes to your lifestyle, especially for children, to make sure they can be healthier in the mind and the body.\n“We’ve launched a game called Drops which I really like because all you need is a couple of mates, six bottles and it’s all about whether you can knock the ball through the gates or knock the bottles over. It’s a points system so it really adds a competitive side but the underlying thing is we are getting kids moving.\n“The FA did some research and a third of children don’t really feel that it’s necessary to exercise and that’s worrying. By showing the ways that you can move, even if it’s just going for a walk, it will make a difference.”\nThe Football Association rolls out ‘the Greater Game’ nationwide as nearly a third of young people do not feel the need to exercise regularly @EnglandFootball #TheGreaterGame",
  "word_count": 787,
  "scraped_at": "2026-02-14T12:52:31.888541"
}