{
  "article_id": "a6c24c4a84e2",
  "url": "https://jerseyeveningpost.com/news/2024/05/22/landmark-assisted-dying-debate-begins/",
  "title": "Landmark assisted - dying debate begins",
  "date": "20240522T173000Z",
  "domain": "jerseyeveningpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "POLITICIANS are debating how Jersey would introduce a legal right for Islanders to end their lives under defined circumstances.\nIntroducing the proposition in the States, Health Minister Tom Binet said the Assembly would be making an “extremely important decision for our island”.\nThe proposed details were workable, with “excellent safeguards” that would be “hard-wired throughout”, Deputy Binet argued.\nHe added that they were also more detailed than those being put forward in other parts of the British Isles.\nWhile admitting that his personal views were strongly in favour of the move to provide a legal right for Islanders to end their lives in certain circumstances, Deputy Binet stressed that the proposition he was fronting had already been drafted by the time he took office in late January.\nDeputy Binet thanked his predecessors at Health, former Deputy Andrew Green and Deputy Karen Wilson, for their work to progress the matter over the past six years.\nThe majority of the States Assembly voted in favour of the principle of assisted dying in November 2021 (36-10).\nDeputy Binet said: “Islanders have demanded we address the issue – we should be representing the public, and not asking if we should bring in this law, but how we will bring it in.”\nThe Health Minister addressed aspects of the proposition, including measures outlining a minimum time-frame for the approval of an assisted death: two weeks under “route one”, for a terminal illness, and 90 days under “route two”: unbearable suffering. The longer limit would enable a detailed exploration of other options to take place.\nDeputy Binet rejected charges from critics about creating a “slippery slope”, with the scope for assisted dying becoming gradually widened, saying that the States Assembly was the decision-making body for the Island and that no further changes would be brought in without the same degree of care as had been applied over the past two years.\nConcluding after 40 minutes, Deputy Binet said: “Just like overdue voting rights for women in times gone by, and the overdue acceptance of homosexuality in my own lifetime, I consider this to be yet another of those seemingly complicated issues that have to be dealt with, if we are to continue to develop a caring and compassionate society.”\nAlthough many Members opted to delay their contributions to the debate until Wednesday 22 May, some did make contributions before the day’s business was adjourned.\nDeputy Steve Ahier said that the Health Minister and his officials should be congratulated on their work and for introducing something that would enable Islanders to die with dignity and could become an “exemplar” to other jurisdictions.\nDeputy Barbara Ward referred to her 45-year career as a nurse and said: “I never thought I would be debating such a highly sensitive and emotional proposition – I see it as assisted suicide, and it goes against my professional code of practice and belief system.”\nDeputy Malcolm Ferey said he supported route one, but not route two, which he said was “a step too far” and would “normalise giving up on people and people giving up on themselves”.\nDeputy Hilary Jeune said she had remained a firm supporter of route one since being elected almost two years ago, but was concerned about clinical governance in Jersey and had not yet decided how she would vote regarding route two.\nConstable Andy Jehan was the fifth and final speaker before Members adjourned. He repeated the words of the late broadcaster and journalist Gary Burgess, who wrote in a JEP article that “it’s my life, and I should be free to do what I want as long as it doesn’t affect other people”.\nMr Jehan also said he had spoken to Motor Neurone Disease sufferer Charlie Tostevin, a former chair of the Jersey Football Association who expressed his views in a JEP report last Saturday.\n“I’ve known Charlie for many years and bumped into him at the Muratti match on Saturday,” he said. “Surprisingly he didn’t want to talk about the football, but whether I would support him by voting for this proposition, and I was happy to give him that assurance.”\nMembers will vote on:\n-\nestablishing an assisted dying service for adult residents who have made a voluntary and informed decision to die.\n-\nlimiting eligibility to people with a terminal illness with a life expectancy of six months, or 12 months if they have a neurodegenerative disease (known as route one).\n-\nthe service being open to someone with an incurable physical condition which might not be terminal but is causing them unbearable suffering (known as route two).\n-\nan opt-out for health professionals, giving them a right to refuse to participate in assisted dying.\n-\nminimum time-frames between the first formal request for an assisted death and the act itself – 14 days for route one and 90 days under route two.",
  "word_count": 809,
  "scraped_at": "2026-02-14T12:08:44.973529"
}