{
  "article_id": "a76b818f75d7",
  "url": "https://www.watoday.com.au/national/a-most-unbelievable-experience-the-mistake-that-transformed-arnold-schwarzenegger-20231016-p5ecju.html",
  "title": "Arnold Schwarzenegger : the champion bodybuilder , movie star turned governor is back",
  "date": "20231125T010000Z",
  "domain": "watoday.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "This was published 2 years ago\n‘A most unbelievable experience’: The mistake that transformed Arnold Schwarzenegger\nFrom movie star to governor, champion bodybuilder to champion of … selflessness? Arnold Schwarzenegger is back – in a surprising way.\nI just wanted to say at the outset: no schmäh, no BS, okay? There’s always a schmäh. I cannot promise you that.\nI want no schmäh. No. There’s a schmäh with everything. Sometimes people take schmäh meaning you’re lying, which is not what it is. It’s kind of like, you wrap it up in a more attractive package. In order to sell something, you have to have the schmäh. It’s just the way it is.\nThe last 30 pages or so of your book [Schwarzenegger’s new self-help title, Be Useful: Seven Tools for Life] are about the idea of having a responsibility to others. I’m curious to know more about how you got to that understanding. Because you could be a bully, you were disrespectful with women, you were driven primarily by thoughts of your own greatness. How does that guy transition into a person who realises the value of selflessness? That’s a good question. First, pull back and do the master shot. I always fell into things. If it is helping other people, if it is the environmental issue, if it is becoming governor of California, if it is fighting prejudice – any of those things, I fell into it. To go back to this particular subject, I noticed that in bodybuilding, I always felt the best when I could teach and help someone.\nBut one day I got a phone call from Wisconsin. They invited me to come to the university where they have a program for the Special Olympics, and would I teach them about weight training? I only paid attention because it was Jackie Kennedy who called. I said, “I cannot say no to Jackie Kennedy.” So I go. Then, of course, when she picked me up from the airport, I realised that it was not that Jackie Kennedy.\nToo late to turn around. I go, and we started teaching Special Olympians how to bench-press – the most unbelievable experience. You could see the change in those kids. I was blown away. I went home at night and said to myself: “It’s funny that I feel so good about this. I didn’t make any money, and it was not a career move.” It started there. It has not stopped since.\nA question about a former in-law of yours: what do you make of Robert F. Kennedy jnr’s anti-vax, conspiracist turn? First of all, I know Bobby from the time I met Maria [Shriver, Schwarzenegger’s former wife and a member of the Kennedy clan]. I always liked him. But when I look at him being suspicious of certain things, I ask myself, “Can anyone really judge him in a fair way?” Because here’s a guy who has had an uncle assassinated [John F. Kennedy], a father assassinated [Bobby Kennedy]. No one wants to open up the files. So, you must say to yourself, “What is the reason for that?” You start not trusting governments.\nI don’t live with this kind of suspicion because nothing ever happened to me that makes me feel like that. But a lot of things happened to him, so this is where he is coming from. I’m not saying rightfully or wrongfully. I’m just saying I can see why someone like him is the way he is.\nBut we can be sympathetic to someone and what happened to them and also say facts are facts. His facts are different. I understand what you’re saying, but there are people out there who have their own facts. That’s the problem. Of course it’s a problem, but I’m just saying it’s not that you can go to someone and say, “Look, these are the facts.” I see Bobby in Gold’s Gym. I like him, and I love that he’s out there running [as an independent in the 2024 US presidential election]. I will always say great things about Bobby because during my entire existence with the Kennedys he always treated me with respect. I will always do this the same way back: absolute respect.\nI was thinking about the arc of your career, and how unprecedented it was. What’s your hunch about what was going on in the culture that allowed for you to become the star you did at the time you did? It was clear to me that I had to make bodybuilding hip. Bodybuilding had to become something people follow and admire – and you could make money off it. That was the idea. I felt like the Muhammad Ali of bodybuilding, that I could bring personality to it and therefore people would pay attention.\n“The Germans have a difficult time with the ‘r’ ... They said ‘ah’: toom-ah; chop-ah. Then I realised that that’s funny.”Arnold Schwarzenegger\nThat’s exactly what happened with Pumping Iron. Before the [1977] movie was released, I got a call from Ed Pressman. He was a quiet, shy guy, but he did all these great movies. He saw Pumping Iron and he said, finally, we have someone who could play Conan. He went out with his lawyer friend, and they bought the Conan rights. All of a sudden, there was Schnitzel [Schwarzenegger’s nickname] taking advantage of this [expletive]. This is what happened. It was timing, but I created it and I willed it.\nBut the question is more about what was going on that made audiences receptive to you at that time. For example, there was something about James Dean’s personality that made him an icon in the 1950s. Or in the ’70s, Al Pacino spoke to audiences. What was it about you in the ‘80s? The uniqueness, the personality, the accent helped. And it was the body because in the ’80s the health and fitness business was exploding. Gold’s Gym became a huge franchise; Weider’s Shape magazine – everything started exploding, and I was benefiting from that. But this is what I say: I was partially responsible for creating that. This is why I saw myself not emulating Al Pacino.\nThe combination of your accent and your delivery –there’s a woodenness to it. Were you consciously aware of using that as an actor? Because some of your lines are funnier with you saying them than if it had been anyone else. No. A lot of times it’s accidental. The Germans have a difficult time with the “r” in the end. They said “ah”: toom-ah; chop-ah. Then I realised that that’s funny. Now I spice that up and make it more exaggerated. Then it becomes a line that the people want to repeat because of the way you say it.\nNow I drive around with a bicycle and someone will scream out, “Get to the chop-ah!” Or I go to the Arnold Sports Festival, and people will scream out my lines: “I hope you leave enough room for my fist because I’m going to ram it into your stomach and break your goddamn spine!”; “Crush your enemies and see them driven before you and to hear the lamentation of their women.” It’s the way I say it that makes it funny.\nClint Eastwood is the first guy I remember who had one-liners in an action movie. That became a thing you were known for. The guy comes around the corner and I stick him with the knife through the chest into the pole and I said, “Stick around.”\nWhen did you realise that kind of line was magic for you? First of all, it comes from my sense of humour.\nSo, you came up with those lines? No. In the ’80s, I was what they call in German a lehrling, an apprentice. I was an apprentice to [American actor and comedian] Milton Berle. I told him: “Look, I love humour, and I know it’s very difficult for Germans or Austrians to have an American kind of sense of humour. You’ve got to help me.” He says, “That Nazi! I have to train him? [Expletive] this.” He was complaining and insulting me. But anyway, he loved me. He was there at my engagement party. He was there at my wedding. He was always there, whatever I did.\n“There was very rarely anyone like me in bodybuilding, very rarely anyone like me in acting and very rarely like me in politics.”Arnold Schwarzenegger\nHe taught you to be funny? Not to be funny, but to write lines for me because I had it in me. I had a sense of humour, but I needed help with the writing. So whenever I went to do some speech, I started out with the funny lines that he would write. Most of my stuff in the ’80s and ’90s, Milton Berle wrote. I would get an award somewhere: “Wow, this is amazing. I tell you, as a bodybuilding champion, you get many medals. You get certificates, get trophies, all of this, but this award, without any doubt, is the most recent.”\nOf course, the first time I did it, Berle immediately criticised. He says: “You said it too fast. What the [expletive] is the matter with you? Have you heard of timing, Schnitzel? The idea of it is that you say, ‘This is the most’ – you can’t say it; you’re choked up – and then you say, ‘recent’.” All this crazy stuff was his.\nCould you improvise a kill line with me if I gave you a scenario? Like what?\nYou take my recorder and slam it down my throat! Okay.\nBut what’s the line? ”Eat it.”\nNo, I got one: “What, no comment?” [Laughs] That’s why I need a writer.\nThe box office is driven by IP and by franchises now. There are very few movie stars left who can, on their own name, reliably open a movie the way you used to. Do you think the era of the movie star is gone and not coming back? I don’t know. I’m not a fortune-teller. I was just talking the other day with someone from Mattel. This company changed from a toy company to an intellectual property company. But who was he sitting with to do one of his franchises? Me.\nThe right often uses Hollywood as a punching bag: “It’s all wokeism; it’s not friendly to conservatives.” What do you think of that criticism? Well, it’s true, but so what?\nWhat part is true? The wokeism and that they’re trying to be goody-goody. Let’s not fool ourselves. They talk about the environment and all that stuff but look at which studio has solar panels on top of the rooftops. None of them. They talk a big game. Doesn’t mean that there are not a lot of sincere people in the game. But the bottom line is, Hollywood at least is out there talking about the right issues: women’s rights and equal rights, giving blacks and Asians more opportunities, Latinos more opportunities; those who are acting out Native Americans ought to be Native Americans. This is all good. This is why I say, let them be what they are. The bottom line is, I never complained about Hollywood, the way they’re pushing certain things. Sometimes the Academy Awards is kind of like, “Look how good we are.” It drives me nuts. But it hasn’t hurt anybody. So, yes, the right wing always dumps on it. The left wing dumps on the right wing, the right wing dumps on the left wing. To me, it’s funny because I’m somewhere in the middle.\nIn your [2012] book Total Recall, there’s one section in which you talk about a Republican conference in 2006 where you said, “The California Republican Party should be a right-of-centre party”, and it didn’t go over well. Since then, the party has generally moved further and further to the right. Do you still feel that there’s a home for you in the Republican Party? Yes. There is a home for me in the Republican Party. In the state of California, the Republican Party has done a horrible job to represent the people. When you’re in the legislature, you’re not supposed to represent only your district; you’re also supposed to represent the state and move the state forward and work with everyone in order to make life better.\nSo when they know that a majority of Californians want to have a cleaner environment, want to have renewable energy – for them to go the other way, it’s not serving the people. Do a poll, and you will find out that a majority of people in California want to have a clean environment. They want to get rid of fossil fuels. Then that’s what you do.\nMy question was whether you still feel at home in the Republican Party. It doesn’t matter. There was very rarely anyone like me in bodybuilding, very rarely anyone like me in acting and very rarely like me in politics. I’m me. If they want to be stuck in the ideological corner, then I say, I think I’m freer if I’m not, and I can work with more people. I feel totally comfortable in the Republican Party. I just think it is important to listen. I encourage them to listen to the polls and make every effort to be a public servant and not a party servant.\nBut making decisions just based on polls is what makes politicians say that January 6 [storming of the US Capitol] was overblown or that Trump won the 2020 election. If politicians don’t feel comfortable with the truth, that’s nothing unusual. These guys can lie better than anybody. Some people do that in order to get re-elected. For that, they will say, “Yes, this election was rigged.” If you put them on the lie detector, I can guarantee you it’ll be a different story. But that’s okay. They have to play their schmäh in their game, and it doesn’t mean I have to buy into this whole thing.\nMaybe I was being too idealistic, but I was hoping for some schmäh that was a little more inspirational than that. Oh, now you want some schmäh, huh?\nAbout the importance of doing the right thing regardless of political considerations? I don’t have to give you schmäh at all because if you look at my speeches, I make it very clear that we must work together. In my mind it’s not even a schmäh, it’s a fact. The only way that we can move forward in a strong way is if we work together. You can have a right-wing philosophy, but you have to still serve the people.\nIt’s like, I would not get involved in an abortion, but I would never stop anyone from having an abortion. I have my more conservative beliefs about things, but it doesn’t mean that I’m forcing that on anyone else. That’s not the way to do it. If a majority of people want to have the right to choose, then the only thing we really have to identify is, okay, when should be the cut-off? I remember I was a big fan of [economist] Milton Friedman – people should take care of things themselves; government shouldn’t be responsible – but then it was interesting to see, when you work with Special Olympics or with after-school programs, that the reality is we need to have government step in and help.\nYou grew up in Austria right after World War II. You had exposure to people who believed in fascism. So when you hear people say Donald Trump is a burgeoning fascist or the Republican Party is authoritarian, does that sound alarmist to you or do you think there’s truth to it? I cannot tell you if Trump is prejudiced. I think that he made moves and said things that sound like it, but I don’t know what’s in his heart. The right or the left, both sides have to make an effort to come together and solve problems. We need a leader who has the energy to bring people together, who sells that idea, and who is convincing enough to bring people together because they want to work together.\nI mean, a few months ago, we were in Washington. I met with 20-some Republicans who were interested in the environment. We didn’t talk about climate change because they maybe are not into that. But they were into “let’s get rid of pollution”. There may be half of them who deny climate change but definitely not pollution. So you repackage it. The search has to be for the sweet spot rather than “How can I attack the other side?”\nDo you see anyone out there with the potential to be that unifying figure? No. But I’m sure that this country has extraordinary people and extraordinary brains and extraordinary motivators. I mean, what it needs is someone in politics like [US football coach] Deion Sanders. It needs someone who comes in and doesn’t talk about the details. Just talk about the big picture: we got to go and be No. 1 as a country, and this is what we need to do, and we need to have everyone come together.\nYes, we can have differences of opinions, but it has to be run as if everyone’s together on the same team for the better good. That’s what we have to do in politics rather than bickering and getting stuck in ideological corners. Someone has to come forward and talk about rebuilding the country in a really great way and about the things that are really important rather than, “Should we have a bathroom for trans people?” All the little battles just hold us up.\nI’ll give you one more chance at a kill line because you whiffed before. I am about to publish the story that destroys the world – you slam the laptop on my head and blood spurts everywhere! What’s the line? “You’re terminated.”\n“If it bleeds, it leads.” That’s funny. When did you think of this [expletive]?\nEverything’s a schmäh. Exactly.\nTo read more from Good Weekend magazine, visit our page at The Sydney Morning Herald, The Age and Brisbane Times.",
  "word_count": 3040,
  "scraped_at": "2026-02-14T14:08:56.293834"
}