{
  "article_id": "a76ca6afbc4e",
  "url": "https://theprideoflondon.com/2023/05/05/chelsea-noni-madueke-spark-dark-time/",
  "title": "Chelsea : Noni Madueke showing he is a spark during this dark time",
  "date": "20230505T103000Z",
  "domain": "theprideoflondon.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Arsenal match is only the beginning for the English youth international Noni Madueke as he seems to be all in for the Chelsea project.\nFor Chelsea fans right now, there is not much to cling onto. Frank Lampard came taken over for Graham Potter, and nothing has changed. Despite a spirited effort at Stamford Bridge in the UEFA Champions League quarterfinal second leg against Real Madrid, the Blues have not won a single match in any competition since March 11 at the King Power Stadium against Leicester City.\nWhile there is nothing to play the rest of the campaign expect for pride, the youth among this roster has already provided some positivity. Lampard has to use these last few matches as chances to provide youngsters minutes in the Premier League. In a mid-week fixture against rivals, Arsenal at the Emirates, Lampard finally gave the 21-year-old London native Noni Madueke an opportunity in the starting XI. The Blues’ No. 31 signed from PSV Eindhoven on January 20, but for some reason even with the state of the club, neither Potter or Lampard has given him a consistent run of games as a starter.\nHis start in north London was his first in any competition since February in the devastating loss to Southampton at Stamford Bridge. He made the most of his 78 minutes on the pitch on Tuesday night, demonstrating just how dynamic he can be in the final third. While the team as a whole should be disappointed in the display, Madueke has to be proud of the contributions he made to the team. In his second time at Arsenal this season, the English youth international had more successful take on attempts than anyone on the pitch on either team. His persistence was what stood out above all. At times, he made mistakes by trying to do too much, but that never affected him mentally.\nHe even tied Wesley Fofana for the team lead in tackles plus interceptions. Madueke delivered when many of his teammates looked checked out. There should be no reason going forward that the former PSV winger does not start in every match. It may be asking a lot for a player so young, but there is no doubt he is hungry to prove himself, especially at CFC. After the game, he sent out a social media post that showed just how committed he is to the club.\nFor him to say, “Immensely proud everytime I look down at the chest on my chest” on his socials post game just demonstrates how bought in he is to becoming a change maker at this club. Some may say that athletes are not the only ones operating their social media, but his performance on the pitch says otherwise. Chelsea needs players that are going to be here for the long-run. Madueke is clearly making his intentions known. This summer is shaping up to be one with more outgoings and incomings. Madueke’s youth and creativity is a light the Blues can use to bring some positivity to the conclusion of one of the worst season’s in club history.\nNot only for his play on the pitch, Noni Madueke is a spark plug of youth Chelsea Football Club needs to get through this demoralizing time.\nMadueke played with a chip on his shoulder, using it as fuel to attempt to will his team to finding the back of the net. His acrobatic goal in the 65′ was his first in the Premier League, and the first for the west Londoners since the Conor Gallagher strike in the 13′ at home against Brighton and Hove Albion.\nFor him to show that much confidence with the ball at his feet in attack when the morale at the club as a whole is so low displays a lot of character. Work hard, and results follow. That is what Madueke displayed when he finally received the chance from a reluctant Lampard. Other than the Chelsea Women’s team, the fans of this club need some reason to turn the television on for the next few weeks. Madueke is that reason.",
  "word_count": 685,
  "scraped_at": "2026-02-14T12:55:31.102659"
}