{
  "article_id": "a7c357528958",
  "url": "https://www.finanznachrichten.de/nachrichten-2025-02/64539148-michelin-delivered-segment-operating-income-of-euro-3-4-billion-in-2024-and-generated-a-free-cash-flow-of-euro-2-2-billion-demonstrating-its-ability-to-adapt-399.htm",
  "title": "Michelin delivered segment operating income of €3 . 4 billion in 2024 and generated a free cash flow of €2 . 2 billion , demonstrating its ability to adapt to uncertain market conditions . ",
  "date": "20250212T173000Z",
  "domain": "finanznachrichten.de",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Clermont-Ferrand - February 12, 2025 - 5:45 pm\nCOMPAGNIE GÉNÉRALE DES ÉTABLISSEMENTS MICHELIN\nMichelin delivered segment operating income of €3.4 billion in 2024 and generated a free cash flow of €2.2 billion, demonstrating its ability to adapt to uncertain market conditions.\nGroup sales and segment operating income were supported by a powerful improvement in the mix, despite soft tire volumes. Margin at constant exchange rates was maintained at 12.6%.\n- €27.2 billion in sales, with a highly positive 1.9% mix effect reflecting the Group's value-driven approach.\n- Tire volumes down 5.1% due to the unprecedented simultaneous decline in OE demand across every segment, intensifying competition in mass markets, and one-off headwinds in Specialties.\n- Market positions improved in targeted business segments and geographies, particularly 18-inch and larger Passenger car tires, high-end truck fleets, mining and aircraft tires.\n- €3.4 billion in segment operating income, with a preserved 12.6% margin at constant exchange rates, fueled by mix enrichment and improved operating performance despite a low utilization rate of industrial capacity.\n- Currency fluctuations reducing sales by 1.0% and segment operating income by 2.0%, with most currencies declining against the euro.\nAutomotive & Two-wheel (SR1): operating margin of 13.1% despite volumes penalized by the OE downcycle, supported by a strong enrichment of the sales mix, with 18-inch and larger segment reaching 65% of MICHELIN-branded Passenger car tire sales.\nRoad transportation (SR2): operating margin recovery confirmed at 9.0%, thanks to a targeted and value-based approach to the market, and to the enhanced valorization of our products and solutions. Operating income growing by 26% despite the slowdown of OE markets in Europe (down 20%) and North & Central America (down 11%).\nSpecialties (SR3): sales and operating margin facing a temporary drop, due to depressed OE markets in Agricultural and Construction activities, and to one-off headwinds in mining tires. Growth recorded in Aircraft and Polymer Composite Solutions activities. In markets with promising fundamentals, Group strengthening its position.\nStrong cash generation leading to a stronger financial position.\n- Free cash flow before acquisitions of €2.2 billion, with EBITDA reaching 19.7% of sales (up 0.3 points)\n- Net income down slightly, of €1.9 billion.\n- Dividend of €1.38 per share to be submitted to the Annual Meeting\nFlorent Menegaux, Managing Chairman: \"My first words are for all our teams around the world, who demonstrate unfailing engagement on a daily basis. I want to salute them. Our 2024 results are solid, despite a particularly unstable economic and geopolitical context. To maintain our competitiveness, we also had to make difficult industrial restructuring decisions in Poland, China, Sri Lanka and France. Michelin continues to implement its \"Michelin in Motion 2030\" strategy\".\nGuidance\n2025 tire markets are expected with slight growth over the year, but declining in the first half due to lower OE demand.\nIn a highly uncertain context, Michelin is expecting to improve its segment operating income at constant exchange rates on 2024, and to generate more than €1.7 billion in free cash flow before acquisitions.\nThe Group maintains its 2026 objectives released at the 2024 Capital Markets Day.\nKey figures\n1 In the following review, 2023 data have been restated to reflect changes in the scope of the reporting segments in 2024. These changes mainly concerned the Two-wheel tire business, which is now consolidated in the Automotive, Two-wheel and related distribution segment, in alignment with the internal Group organization. 2022 data are based on the previous scope of reporting, when the Two-wheel tire operations were included in the Specialty businesses and related distribution segment.\n2 2024 dividend subject to approval by the Annual Shareholders Meeting on May 16, 2025.\n3 Free cash flow corresponds to net cash from operating activities less net cash used in investing activities, adjusted for net cash flows relating to cash management financial assets and borrowing collaterals.\n4 In calculating ROCE, amortization of acquired intangible assets and the Group's share of profit/(loss) from equity-accounted companies are added to segment operating income. ROCE is calculated after tax using a standard rate of 23% in 2024, which is more in line with the effective tax rate than the standard 25% used in 2022 and 2023.\n5 At period-end.\nMarket Review\nPassenger car and Light truck tires & Two-wheel\nPASSENGER CAR AND LIGHT TRUCK TIRES\n* Including Turkey and Central Asia.\nThe global Passenger car and Light truck sell-in tire market grew by 2% over the year in 2024, as a 4% gain in Replacement sales offset a 2% decline in the Original Equipment segment.\nPASSENGER CAR AND LIGHT TRUCK TIRES - ORIGINAL EQUIPMENT\nIn the Original Equipment segment, global demand ended 2024 down 2% year-on-year, with a steeper decline in Europe (down 7%) than in North America (down 2%) and a 3% increase in China.\nDemand in Asia excluding China (mainly Japan and South Korea) also weakened over the year, declining by 8%.\nIn Europe, the quarter-by-quarter market decline (down 1% in Q1, 7% in Q2 and 9% in Q3) gained momentum in the final three months, with a 13% drop tracking OEM output. New vehicle sales were impacted by pressure on purchasing power from persistently high interest rates. Moreover, uncertainties over the pace of the market's transition to EVs, exacerbated by reductions in EV purchase subsidies in certain countries, in particular Germany, are leading consumers and fleets to push back new vehicle purchases.\nThe North and Central American market declined by 2% year-on-year. After holding relatively firm in the first half (up 1%), demand dropped 4% in the second six months, despite the favorable comparison with the prior-year period, when a strike in the fall slowed sales.\nAs in Europe, EV takeup was slower than expected. In addition, the North American market saw a shift to lower-trim models, with fewer features and less equipment, following the post-pandemic period when disrupted semiconductor and component supply chains prompted carmakers to focus on executive models.\nThe market in China improved by 3% over the year, with wide swings, however, from one quarter to the next. Demand steadily cooled quarter-by-quarter (up 6% in Q1 and 3% in Q2, then turning down 4% in Q3), as exports gradually failed to offset the increasingly steep decline in domestic demand.\nHowever, the market rebounded strongly in the final three months, gaining 7% thanks to the vast demand-led economic stimulus package announced by the central bank and the Chinese government in late September.\nPASSENGER CAR AND LIGHT TRUCK TIRES - REPLACEMENT\nIn Replacement tires, the 4% year-on-year increase in global demand hid significant disparities by region, with robust 9% growth in Europe and a slight 1% slowdown in China.\nAfter growing 6% in the first half, the European market further accelerated in the second six months, with an 11% gain, reflecting the net impact of:\n- an increase in imports in September and October, ahead of the application of the European Union Deforestation-free Regulation (EUDR) initially scheduled for January 1, 2025, but finally postponed by a year;\n- relatively weak OE demand;\n- robust demand for winter tires.\nThe gain was also lifted by the sustained move upmarket in the product mix, with faster growth in sales of 18-inch and larger tires.\nYear-end dealer inventories were somewhat higher than normal due to the above-mentioned imports.\nDemand in North America rose by 2% over the year, with the second half unchanged (0%) after a vibrant 4% increase in the first six months. In a resilient economy, the second-half slowdown reflected the leveling off of Asian import sales, after a first half powered by the lowering of anti-dumping duties on tires imported from Thailand in January 2024.\nYear-end 2024 inventory levels had returned to normal.\nIn China, after a more or less stable first half (up 1%), the market ended the year down a slight 1%, with a steep 5% plunge in the third quarter, as domestic demand declined, and a return to stability (0%) in the final three months. Sluggish demand also reflected the shift in mobility patterns observed in recent years following the rapid improvement in rail infrastructure, as a decline in average kilometers driven offset the increase in the number of vehicles on the road.\nIn the other operating regions, demand edged up 2% in South America, with an upsurge in Asian imports, and remained unchanged in Asia excluding China.\nThe Indian market rose by 4%, with faster growth in demand for 18-inch and larger tires.\nTWO-WHEEL\nIn the Motorcycle and Scooter segment, after a first half hurt by poor weather conditions, the second half saw a rebound in demand for sport touring motorcycle and premium scooter tires.\nThe Bicycle tire market remains vulnerable, particularly in the OE segment, which has been consolidating since 2023.\nTruck tires (radial and bias)\n* Including Turkey and Central Asia.\nThe global Truck tire sell-in market (excluding China) improved by a slight 1% in 2024, with the 7% decline in Original Equipment sales outweighing the 3% growth in Replacement demand.\nIn China, where the Group's presence is negligible, markets contracted by 5% over the year, including declines of 3% in the OE segment and 7% in Replacement.\nORIGINAL EQUIPMENT\nIn the Original Equipment segment, the global market (excluding China) declined by 7%.\nIn Europe, the first-half trend (down 19%) continued through the second half (down 22%). The decline, which was expected, reflected a return to more normal levels after three years of strong growth in the wake of the health crisis and the difficulties in the auto industry. In 2024, the uncertain economy and more restrictive financing weighed on new vehicle demand.\nIn North and Central America, the 11% drop in demand over the year follows the introduction of the new emissions standard of January 1st 2024, which strongly boosted demand in 2023, especially in the second half of the year.\nMarket growth in South America surged 24% year-on-year, with demand comparing very favorably with 2023, which had been adversely impacted by a surge in new vehicles buying in 2022 ahead of the new emissions standard introduced in early 2023.\nREPLACEMENT\nThe global Replacement sell-in market (excluding China) grew by 3% over the year.\nDemand was stable year-on-year in Europe, where tons carried remained more or less unchanged. Demand rose by 6% in Western European markets, but declined in Central and Eastern Europe, penalized by a sharp 18% decline in the Turkish market.\nDemand in North America was up 7% at the end of December, with seasonal fluctuations from inventory build-ups and drawdowns. The market was up by more than 15% as of end-July, buoyed by the massive buying of imports ahead of higher anti-dumping duties on Thai tires. The market then flattened out to 2023 levels in the second half, with freight demand broadly unchanged year-on-year.\nLifted by the sustained growth in freight demand, particularly in Brazil, the South American market rose by 5% over the year. The market is also seeing greater penetration from Asian import brands.\nIn the other operating regions, markets grew by 2% over the year, including a 3% gain in India.\nSpecialty businesses\nMining tires: while mining tire demand remains robust over the long term, supported by ever-increasing ore mining needs, in 2024, the market was dampened by extensive inventory drawdowns as supply chains returned to normal and mine operators focused more sharply on cash flow discipline.\nDemand nevertheless firmed up in the final quarter, as inventories returned to normal by year-end.\nBeyond-road tires: in these segments, where demand is almost equally divided between Original Equipment and Replacement sales, growth was mixed in 2024, with OE demand falling sharply across the board and Replacement demand demonstrating greater resilience.\nIn Agricultural tires, the highly cyclical OE markets, fell by over 20% in both the Americas and Europe, dragged down by the reduction in average farming income due to farm commodity prices, adverse weather events and high interest rates.\nThe Replacement market was slightly up year-on-year, but remained roiled by the growing penetration of budget brands, particularly in the Americas.\nDemand for Construction tires contracted over the year, by around 15% in the OE segment and somewhat less in Replacement, due to the slowdown in homebuilding in both Europe and North America, where inflation and interest rates remain high. Infrastructure tire demand was more resilient in North America, supported by the growth in public spending.\nThe Materials Handling tire segment experienced a similar trend, with an almost 15% drop in OE sales and flat demand in the Replacement segment.\nAircraft tires: the commercial aviation market continued to expand, led by rising Chinese demand for international flights, which nevertheless remained a significant 30% lower than in 2019.\nPolymer Composite Solutions: correlated over the long-term with demand from the mining industry, the fundamentals of the conveyor belt market remain buoyant, but business in 2024 was penalized by the very high basis of comparison with 2023 figures, and by the financial imperatives pushing mine operators to postpone their capital projects. On the other hand, demand for service activities, which play a critical role in maintaining and optimizing mining facilities, is continuing to trend upwards.\nIn the other segments (belts, seals, high-tech fabrics and engineered polymers), which serve a variety of market verticals, global demand is still returning to normal levels as built-up inventory is reduced across the value chain.\nSales and Results\nSales\nConsolidated sales amounted to €27,193 million in 2024, representing a 4.1% decline from the €28,343 million reported in 2023. At constant exchange rates, the decline stood at 3.1% for the year.\nThe year-on-year change reflected the combined impact of the following factors:\n- a 5.1% decline in sales volumes, stemming primarily from:\n- the very low output in all the Group's original equipment markets,\n- cyclical or one-off factors that particularly impacted the Specialty businesses, such as strict export controls, inventory drawdowns by certain mining operators and the closure of a large mine,\n- the Group's selective strategy of focusing on markets and segments that leverage the full value of its innovations and technologies;\n- a 2.0% increase from the positive price-mix effect. Prices added a slightly favorable €31 million to full-year sales, overcoming the negative €105 million impact in the first half from applying raw materials-based and other contractual indexation clauses. The highly positive €538 million mix effect reflected the priority focus on the highest value products (MICHELIN brand tires, 18-inch and larger Passenger car tires, agricultural tracks, etc.) and the efficient management of the geographic and the Replacement/OE market mixes;\n- a 1.0% decrease from the negative currency impact, due to the increase in the average annual euro exchange rate against the Turkish lira, the Brazilian real, the Chilean peso and most other operating currencies except the US dollar, where it remained stable over the year;\n- a neutral impact from the non-tire businesses, as the 0.2% increase from changes in the scope of consolidation (mainly the inclusion of FCG on September 26, 2023) offset the slight decline in aggregate non-tire sales compared with the extremely high 2023 comparative (lifted by record sales of several businesses, notably conveyors).\nResults\nSegment operating income amounted to €3,378 million or 12.4% of sales for the year ended December 31, 2024, compared with €3,572 million and 12.6% in 2023.\nThe €194 million decrease reflected the net impact of the following factors:\n- a €28 million increase from changes in the scope of consolidation, corresponding primarily to the inclusion of Flex Composite Group since late September 2023;\n- a €756 million unfavorable volume effect reflecting:\n- the decline in volumes sold,\n- the fixed cost shortfall resulting from the general under-utilization of production capacity as output declined and certain plants were ramped down over the year;\n- a €438 million increase from the favorable price-mix effect, led by:\n- a slight net increase in prices, stemming primarily from the application of contractual indexation clauses, whose impact swung to positive in the second half from negative in the first due to the time lag in applying the changes in their underlying raw materials and other price indexes;\n- a very favorable mix, shaped by a combination of several factors: growth in sales of 18-inch and larger Passenger car tires and, more generally, premium products; more dynamic sales in Replacement tires than in the OE markets, which weakened over the year; and a positive geographic mix;\n- a €168 million increase from the first-half decline in the cost of raw materials used in production, which offset the second-half rebound in these costs;\n- a slightly positive trend of €34 million in manufacturing and logistics costs. The impact of inflation, particularly on payroll costs, and of the temporary closure of certain plants at year-end was partly cushioned by lower maritime shipping costs and improved operating performance;\n- a €162 million decrease from the year-on-year growth in SG&A expenses (including mainly administrative and general expenses, selling expenses and research and development expenses) in the Tire operations, reflecting the impact of inflation, particularly on payroll costs;\n- a €144 million increase from other favorable cost factors, primarily comprising an adjustment in the variable compensation paid in respect to 2024;\n- a €70 million decrease from exchange rate movements, led by the unfavorable impact of the gains in the euro against the Turkish lira, the Chilean peso, the Japanese yen and most other operating currencies.\nOther operating income and expenses unallocated to the operating segments represented a net expense of €747 million in 2024 versus a net expense of €920 million in 2023. The improvement primarily corresponded to the year-on-year reduction in provisions for industrial restructuring projects.\nNet financial position\nFree cash flow after acquisitions ended the year at €2,225 million, virtually unchanged from the €2,343 million reported at December 31, 2023. This relative stability is explained on the one hand by the rise in working capital, led by the increase in inventory value as a result of higher raw material costs, and on the other hand by the absence of significant acquisition.\nGearing stood at 16.7% at December 31, 2024, corresponding to net debt of €3,112 million, down €169 million from December 31, 2023.\nSegment information\n* And related distribution.\nNB: In the following review, 2023 data have been restated to reflect changes in the scope of the reporting segments in 2024. These changes mainly concerned the Two-wheel tire business, which is now consolidated in the Automotive, Two-wheel and related distribution segment, in alignment with the internal Group organization.\nAutomotive and Two-wheel\nSales in the Automotive, Two-wheel and related distribution segment fell by 1.3% year-on-year to €14,667 million in 2024.\nVolumes sold contracted by 1.6% over the year, reflecting a steeper decline in the Original Equipment segment than in Replacement, due to both external factors (particularly a downturn in the automotive market) and the Group's internal management of the balance between Original Equipment and Replacement sales.\nDespite the lower volumes and a general reduction in prices due to the application of indexation clauses in OEM contracts, the segment maintained its operating income and margin almost on a par with 2023. This was primarily thanks to the highly favorable mix effect, driven by (i) the sustained growth in sales of 18-inch and larger tires and other outcomes of the priority focus on the most value-accretive market segments; and (ii) the faster momentum in Replacement tire sales compared with Original Equipment sales.\nDistribution operations increased their percentage of the segment sales stream and maintained its generally neutral bottom-line contribution.\nSegment operating income amounted to €1,917 million or 13.1% of sales, versus €1,968 million and 13.2% in 2023 (at comparable scope of reporting).\nRoad Transportation\nSales in the Road transportation and related distribution segment totaled €6,599 million in 2024, down 4.9% from the prior year.\nPremium truck tire manufacturers faced a complicated business environment in 2024, with Original Equipment markets cooling after expanding robustly in 2023 and Replacement markets reporting only slight growth that was in fact driven almost entirely by the waves of low-cost imports from Asia. In this context, volumes sold declined by 6.1% year-on-year, but disciplined management enabled the Group to deliver positive price and mix improvements. The Connected Solutions business, combined under the MICHELIN Connected Fleets brand, continued to expand, thanks mainly to more disciplined management and improved operating efficiency. It made a positive contribution to segment operating income.\nSegment operating income totaled €597 million or 9.0% of sales, versus €474 million and 6.8% in 2023 (at comparable scope of reporting).\nSpecialties\nSales by the Specialty businesses and related distribution reporting segment declined by 9.4% year-on-year, to €5,927 million. Volumes sold, which only concern Specialty tires, declined by 9.1% over the year.\nSegment operating income amounted to €864 million or 14.6% of sales, versus €1,130 million and 17.3% the year before (at comparable scope of reporting).\nMining tires: in an ore market that remains on a long-term growth trend impelled by rising demand for metals, particularly to support the energy transition, volumes sold were dampened by a number of short-term factors. The inventory drawdowns undertaken by certain mining companies in second-half 2023 continued in 2024 before gradually petering out at year-end. Business in Europe and Central Asia slowed considerably after export controls were further tightened. Lastly, Central American operations were hurt by the closure of a large mine in Panama. Despite the impact of these one-time factors, mining tire sales rose by volume and in value, led by a very positive operating performance and a product and service portfolio well aligned with customer priorities for the productivity and safety of their operations. This helped to drive market share gains and significant growth in service volumes sold.\nBeyond-road tires: sales of agricultural, materials handling and construction tires were severely impacted by the steep decline in Original Equipment markets in every segment. This did not prevent the Group from launching new products demonstrating its technological leadership, such as the MICHELIN CEREXBIB 2 tire for New Holland's new CR11 combine, which significantly reduces soil compaction and helps to meet emerging farming challenges.\nIn the more mixed Replacement markets, the Group pursued its strategy of prioritizing key segments. In agricultural tires, for example, it gained market share in Europe, primarily by targeting sales of tires for high-power tractors. In the construction segment, the Group announced in December its withdrawal from bias tires and tracks for compact equipment to focus on radial technology and announced the sale of two production plants and the CAMSO brand.\nAircraft tires: in markets that were slightly up for the year, the Group increased its sales, particularly in mature regions. Operating difficulties encountered by aircraft manufacturers slowed growth in Original Equipment demand, and shifted sales towards Replacement which improved the business line's sales mix.\nPolymer Composite Solutions sales declined somewhat year-on-year, mainly due to comparison with the record highs reported in 2023, particularly in the conveyor belt business. In 2024, in an economy pressured by rising interest rates, mining companies postponed certain capital projects, which weighed on sales of new conveyor belt systems. However, this impact was partially offset by sales of maintenance services. The other segments (seals, belts, engineered fabrics, etc.) held sales firm overall, in markets that retain their medium- and long-term growth prospects despite temporary downturns.\nThe financial statements for the year ended December 31, 2024, were approved for publication by the Managing Chairman on February 11, 2025 after being reviewed by the Supervisory Board. At the date of this press release, the audit procedures have been carried out and the statutory auditors' report is being issued.\nNon-financial performance\nThe Group is recognized for its engagement and its environmental, social and governance performance.\n*Full details concerning the position and distribution of these scores are available at michelin.com\nThe Michelin in Motion 2030 strategic plan\nThe Group is continuing to deploy its Michelin in Motion 2030 strategic roadmap, as reaffirmed at the Capital Markets Day event in May 2024.\nPeople Objectives\n(1)Total Case Incident Rate: the number of accidents and cases of occupational illness recorded per 200,000 hours worked\n(2)Diversities and Inclusion Management Index.\nSet the global standard in employee engagement:\nThe engagement rate, which expresses the confidence of Michelin employees in the Group, rose by 1.2 points to 84.7% in 2024. The improvement was particularly positive in an unstable social, economic and geopolitical environment, which required employees to demonstrate a high degree of agility.\nSet the global standard in workplace safety:\nNewly-acquired businesses, particularly in the Polymer Composite Solutions segment, are being gradually integrated into the TCIR reporting system. Although slightly higher as reported in 2024, TCIR was stable year-on-year based on comparable scope of reporting and number of hours worked. Safety performance in the Polymer Composite Solutions operations is improving, but is still not in line with the tire production plants.\nOverall, 2024 saw a significant reduction in the number of serious accidents, by around 17%, with in particular a 37% reduction in the Distribution and Services operations.\nSet the global standard for employee diversity and inclusion:\nAttesting to the Group's commitment to diversity and inclusion, the IMDI improved by one point year-on-year, led by significant gains in the number of women in high-level positions of responsibility, the acceptance of diversity, and the promotion to management positions of people originally hired as production operators.\nLead the industry in creating customer value:\nThe Partner NPS declined by 2.5 points year-on-year, reflecting lower scores in the Original Equipment segment of the Beyond-Road business (Agricultural, Construction and Materials Handling tires), impacted by the sharp slowdown in demand, and with certain European dealers who experienced one-off delivery difficulties due to the reorganization of the Customer Service Centers.\nThe key driver of customer satisfaction remains the exceptional quality of the products sold by the Group, combined with the renowned reputation of the MICHELIN brand.\nProfit Objectives\n(1)Consolidated ROCE is calculated after adding back (i) goodwill, acquired intangible assets and investments in equity-accounted companies to economic assets; and (ii) amortization of acquired intangible assets and the Group's share of profit from and loans to equity-accounted companies to after-tax earnings.\n(2)Composite indicator used to measure the brand's vitality.\n(3)Percentage of sales from products and services introduced in the last three years.\n(4)2023-2030 compound annual growth rate\nDrive significant growth in sales:\nConsolidated sales at constant exchange rates declined by 3.1% in 2024, primarily as a result of lower volumes sold in a challenging economic environment, particularly in the automotive, truck, farm machinery, construction equipment and every other Original Equipment tire market. The volume decline was only partially offset by a highly robust product mix, reflecting strong sales performance in the most value-accretive segments. The Group also continued to deploy its growth strategy in the Polymer Composite Solutions and truck fleet Connected Solutions businesses, which are enjoying structural growth.\nContinuously create value:\nConsolidated return on capital employed stood at 10.5% in 2024, in line with strategic plan objectives and attesting to the Group's commitment to creating significant value for all its stakeholders every year.\nThe decline compared with 2023 was attributable to the contraction in segment operating income, as well as to the fact that 2023 ROCE had been boosted by asset disposals, particularly by the Symbio and TBC joint ventures.\nMaintain the strength of the MICHELIN brand:\nThe brand vitality indicator held steady over the year, with just a one-point decline from 2023, and remained a significant 12 points higher than in 2020.\nThe indicator also remained stable in the eight countries where the new brand campaign was deployed in 2024, despite a media landscape saturated by the Paris Olympic Games and the Euro 2024 football championship.\nAfter exceeding the initial target of a five-point gain compared with 2020, the current objective is to sustain this strong performance, while increasing the visibility of Michelin's innovative solutions across every communication channel.\nMaintain the sustained pace of product and service innovation:\nAt 29.4%, the 2024 product/service vitality score just slightly missed the target of exceeding 30% every year. While product plans are quickly and regularly refreshed in the Automotive and Two-wheel tire segments, cycles are longer in the B2B businesses (Truck, Agricultural, Construction and Mining tires), with less frequent product line renewals.\nIn 2025, the Group is rolling out an ambitious product plan, led by the launch of the MICHELIN Primacy 5 and MICHELIN Cross Climate 3 Passenger car and Light truck tires and the MICHELIN X-Line Grip and MICHELIN X-Line Energy 3 Truck tires.\nPlanet Objectives\n(1)The \"industrial - Michelin Environmental Performance\" (i-MEP) metric is used to track the environmental impacts of the Group's manufacturing operations over the next ten years. It makes these impacts easier to understand by focusing on five priority areas: energy use, CO2 emissions, organic solvent use, water withdrawals, and waste production. The i-MEP is described in more detail in the methodological note in Chapter 4 of the Universal Registration Document.\n(2)The new Group target following the SBTi's approval in June 2024 of the 1.5°C-aligned pathway to 2030.\nAchieve carbon neutrality in manufacturing and energy use by 2050:\nIn June 2024, the Science-Based Targets initiative (SBTi) approved the Group's new carbon emissions reduction targets, attesting that they are aligned with a 1.5°C pathway and consistent with achieving net zero greenhouse gas emissions by 2050.\nAs a result, the 2021 target of a 50% reduction in Scope 1 & 2 carbon emissions in 2030 versus 2010 has been replaced by a more ambitious objective of a 47% reduction in 2030 versus 2019.\nIn 2024, carbon emissions declined by 13% year-on-year, led by:\n- a decrease in volumes produced;\n- an increase in the percentage of electricity from renewable sources, to 62% of total power use compared with 54% in 2023. The proportion of renewables in the total energy mix rose to 29% from 24% the year before.\nIn all, by year-end the Group had reduced its Scopes 1 & 2 carbon emissions by 37% compared with 2019, in line with the new target of a 47% reduction in 2030.\nHelp achieve carbon neutrality in use:\nOverall, the indicator improved by 4.3% from the 2020 baseline and by 1.4 points year-on-year.\nIt was up 2.3 points on 2023 in the Automotive tire segment, supported by the new MICHELIN-branded DEFENDER 2 and LTX 2, E-PRIMACY and E-PRIMACY 2 tires, the launch of the BFGOODRICH ALL-TERRAIN KO3 and MICHELIN Alpin 7 tires, and growth in the MICHELIN CROSSCLIMATE 2 and KLEBER QUADRAXER 3 and SUV ranges.\nIt also improved by 0.3 points in the Truck tire segment, thanks to the higher sales of the MICHELIN XME Z/D and XM Z2/D2 ranges in South America, the MICHELIN XM Z2 range in Asia, the MICHELIN X Incity EV electric urban bus tire, and the MICHELIN AGILIS 3 Light truck tire.\nIn the Specialties segment, the 0.4-point year-on-year increase was led by the ongoing shift to radials in the Aircraft tire market and the introduction of new solid tire components in the Materials Handling segment.\nSet the global standard for the environmental footprint of manufacturing facilities:\nThe i-MEP indicator rose by 1.3 points over the year compared to 2023, for a 17.4% improvement on the 2019 baseline and a target of a one-third reduction by 2030.\nThe gain was especially meaningful in that lower output had an adverse impact, given that production plant energy use is fixed.\nThe Group's pathway to its 2030 target is based on:\n- roadmaps validated in each metric (energy use, CO2 emissions, VOC use, water use and waste), with the supporting capital budgets;\n- heightened awareness of environmental issues at every level of the organization and in every aspect of the business.\nReach 100% of renewable or recycled materials in tires:\nThe percentage of renewable or recycled materials stood at 31% in 2024, up three points on 2023.\nTwo points of the gain came from the increased use of natural rubber, whose percentage had fallen sharply in 2023, while one point was attributable to the greater volumes of other renewable and recycled materials.\nThe Group is pursuing its roadmap to meet the goal of using 40% renewable and recycled materials by 2030, with a particular focus on securing raw materials, accessing renewable and recycled elastomers, and driving faster deployment of renewable and recycled inputs in semi-finished and finished products.\nHighlights\nCorporate\n- For the third time running, Michelin is identified as one of the world's most innovative companies in the Top 100 Global Innovators 2024 ranking.\n- Michelin, IFPEN and Axens inaugurate the first industrial-scale demonstrator unit capable of producing bio-based butadiene, representing a major milestone in the creation of a new industry. Built on the Michelin site in Bassens, France, the demonstrator is part of the BioButterfly project, which aims to develop and bring to market butadiene using ethanol derived from plant biomass to replace butadiene made from petrochemical feedstocks. -\n- The cornerstone for the Collaborative Innovation Hub (PIC) is laid in Clermont-Ferrand, as part of the Cataroux Park project to transform the Group's historic production plant into a vibrant arena for innovation and development. Another cluster in the Park, the Sustainable Materials Center, will triple its capacity, creating 700 jobs and supporting 20 startups by 2030. Its role is to help startups to develop their industrial demonstrators faster and more cost effectively.\n- NASA selects the Moon RACER team, which includes Michelin, AVL, Boeing and the Northrop Grumman Corporation, for the first phase of the ARTEMIS project to develop a new Lunar Terrain Vehicle. The phase 1 contract gives the selected teams one year to complete a feasibility study for the proposed solution. Leveraging in particular its expertise in airless technology and high-tech materials, Michelin will design a wheel capable of withstanding extreme temperatures and radiation, while delivering optimum traction on lunar soil.\n- Michelin reaffirms its innovative brand DNA with the new \"On the road and beyond!\" brand campaign, which showcases its powerful capacity for innovation and unrivaled expertise. Initially launched in France, the new campaign will soon be rolled out internationally.\n- Michelin, the French national research institute CNRS and the University of Strasbourg inaugurate a new joint research laboratory - \"Spinlab\" - dedicated to research into the manufacture of nanofibrous materials, thus strengthening their combined expertise in this innovative process. The collaborative venture will also open new pathways to developing innovative materials for critical uses, with applications in mobility as well as in medicine, the environment and energy. These uses are central to the Michelin Group's goal: to manufacture high value-added composites that change our daily lives.\n- Michelin, Danone, US startup DMC Biotechnologies and Crédit Agricole Centre France join forces to create Biotech Open Platform, a next-generation industrial biotechnology platform that further illustrates Michelin's All-Sustainable vision. In particular, it will help to drive the wider use of bio-based materials, a core challenge for both the industry of tomorrow and resource preservation. It also demonstrates Michelin's unflagging commitment to developing innovation and supporting its host communities.\n- At the China International Import Expo (CIIE), attended by nearly a million visitors and more than 4,000 accredited journalists, Michelin exhibits its prototype moon wheel, made from 71% recycled and renewable materials.\n- Michelin chooses Microsoft to support the deployment of innovative digital solutions to optimize energy use management in its production plants around the world. The partnership will help the Group to reduce its carbon emissions and fulfill its commitment to reaching net zero by 2050.\n- Michelin and Brembo sign a global agreement to develop intelligent braking systems. Michelin will contribute its expertise in designing advanced algorithms, its outstanding knowledge of tire physics and its simulation and modeling capabilities. Initial tests show a reduction in braking distances of up to four meters, regardless of tire wear or road conditions.\n- The Group is continuing to realign its tire manufacturing base, announcing the forthcoming conversion of the plants in Olsztyn, Poland and Shenyang, China to Passenger car tire production and the shutdown of tire operations in Cholet, France and metal reinforcements production at the facilities in Shanghai, China and Vannes, France. During each of these projects, Michelin's priority is to support the people impacted by the transition, by consistently applying the principles of respect, transparency and fairness throughout the process.\n- Michelin sells its two Sri Lanka-based plants dedicated to bias tires and compact construction equipment tracks to the CEAT Group. The Camso brand will also be sold at the end of a three-year licensing period. The Group will refocus on marketing its radial tires in the addressed market, while also ceasing production of bias tires in its plant in Olsztyn, Poland. These transactions, which will strengthen the financial performance of the Specialty tire businesses, are aligned with the Michelin in Motion 2030 strategy, which is redirecting the Group's activities towards the most profitable markets and offerings.\n- European rating agency Scope Ratings assigns Michelin a long-term credit rating of A with a stable outlook. At the same time, Moody's upgrades its long-term credit rating from A3 to A2. Both ratings recognize the Group's financial strength and the quality of its strategy.\n- The Michelin Group releases its first Tax Transparency Report, marking a significant milestone in its history. The Report outlines the Group's tax policy and strategy, specifying its tax contribution by country and worldwide, which stood at nearly 40% of 2023 segment operating income.\n- The French Federation of Employee Shareholders (FAS) awards Michelin its CAC All-Tradable Grand Prize, in recognition of the Group-wide employee shareholding initiatives that have been an integral part of the Group's value-sharing commitment for more than 20 years.\n- The Michelin Guide continues its international expansion with new curated selections for Mexico, Lithuania, Fujian Province (China) and Doha, Qatar, bringing the total collection to more than 40 destinations.\n- In 2024, the MICHELIN Guide introduces the MICHELIN Keys honoring hotels in a number of countries for their hospitality excellence, including 189 establishments in France, 271 in Germany, Austria and Switzerland, and others in the United States, Spain and Japan. The award attests to the MICHELIN Guide's commitment to becoming the leading global booking platform for outstanding hotels and restaurants.\n- ViaMichelin launches its new website and mobile application, available in seven languages in 11 European countries. ViaMichelin enhances the user experience by bringing together the best routes, the finest MICHELIN Guide selections and rich, inspiring editorial content for planning road trips across Europe.\n- Set up in 2014, the Michelin Corporate Foundation has defined new objectives for the 2024-2028 period, to help pursue the Group's commitment to acting for the common good in seven areas of action: future-facing jobs, equal opportunity and inclusion, healthy living and eating, sustainable mobility, forest biodiversity, collaborative social models and regional development.\n- The Michelin Man becomes our enthusiastic TikTok influencer, sharing inspiring, unexpected innovation content for Gen Z and beyond.\n- Michelin supports the new European R117-04 regulation in force since July 1, 2024, which mandates performance tests on worn tires to improve safety. These rules are designed to ensure that tires deliver safe performance throughout their useful lives. Worldwide, 400 million tires are prematurely removed from cars every year, which means that the regulation could avoid the release of 35 million tonnes of CO2 emissions.\n- In May 2024, Michelin carries out a €1 billion euro-denominated bond issue in two €500 million tranches with maturities of 7 and 12 years. The 7-year tranche pays interest at 3.125% and the 12-year tranche at 3.375%. The net issue proceeds have been used for general corporate financing requirements.\n- In February 2024, as part of its capital management and optimization policy, the Group announces the launch of a multi-year share buyback program in a maximum amount of €1 billion over the three-year period from 2024 to 2026. The Group signs two agreements with investment service providers covering €500 million worth of share buybacks. The agreements are executed in full during the year and the purchased shares are subsequently canceled.\nPeople\n- Following an assessment by the Fair Wage Network, a globally recognized NGO, Michelin is certified as a \"Global Living Wage Employer,\" attesting to the ability of the Group's fair compensation policies and practices to guarantee a living wage for every employee in more than 60 countries.\n- At the Michelin Media Day 2024 event, the Group announces three major innovations to support its transformation and to foster social and societal cohesion in France and around the world: the guarantee of a living wage and a universal social protection floor for all Michelin Group employees; the creation of an ambitious lifelong learning program; and the official presentation of Cataroux Park, a revitalization project unlike any other in Europe and a powerful accelerator of innovation.\n- The updated Diversity, Equity and Inclusion policy is posted on the corporate website, attesting to the importance the Group attaches to the multi-faceted challenges and growing social expectations surrounding these issues.\n- Michelin launches a new BIB'Action employee shareholding plan open to 127,000 employees in 46 countries, with the intention of renewing such plans every year so that employees rank among its leading shareholders. The 2024 plan is a resounding success, with more than 56% of employees taking up the offer, for a total of more than 66,000 investors in 46 countries.\n- Prestigious magazine HR Asia names Michelin Thailand one of the \"Best Companies to Work For in Asia 2024 - Thailand.\" The award recognizes Michelin's commitment to its employees and their well-being, in particular by nurturing a quality workplace environment, offering career development opportunities and an inclusive corporate culture.\n- Michelin and Porsche renew their partnership to support Indonesian natural rubber farmers in deploying sustainable farming, environmental and social practices. Known as Cascade, the training project will benefit 6,500 smallholders over the next three years. It is seamlessly aligned with the Group's long-standing commitment to encouraging eco-responsible, deforestation-free natural rubber sourcing.\nPlanet\n- The Group announces its intention to apply the recommendations of the Task Force on Nature-related Financial Disclosures (TNFD), in alignment with the targets defined at COP15 in Montreal. The announcement completes Michelin's commitments to biodiversity already expressed in 2018 through the act4nature international initiative.\n- At Tire Technology Expo 2024, Michelin unveils a new light particle analysis system that will deepen knowledge of tire and road wear particles (TRWPs). This major new step forward is aligned with the challenges of the Euro 7 standard, which will define regulatory tire abrasion thresholds. For nearly 20 years, Michelin has been actively engaged in reducing tire abrasion and conducting research on TRWPs.\n- For the 2024 MotoE World Championship round in Portimão, Portugal, Michelin presents its new tires for MotoGP electric class bikes containing more than 50% renewable and recycled materials. In line with the Group's commitment to making tires all-sustainable by 2050, motorsports remain a key testing ground and an accelerator for technological innovations.\n- The CDP rating organization once again finds that Michelin is demonstrating leadership in tackling the challenges of both climate change, with an A- rating, and water security, with a B rating.\n- As head of the UN Global Compact France Network, Florent Menegaux presents the new strategic vision for the next six years at its Annual Meeting. Companies will be encouraged to undertake results-oriented commitments to address five priority issues: a living wage, gender equality, climate change, water and financing the UN Sustainable Development Goals (SDGs).\n- Michelin joins Antin and Enviro to announce the construction of their first end-of-life tire-recycling plant in Uddevalla, Sweden. The project will be based on Enviro's unique pyrolysis technology, which is capable of extracting carbon black, pyrolysis oil and other raw materials from end-of-life tires.\n- For the fourth year in a row, Michelin is recognized by international non-profit CDP as a \"Supplier Engagement Leader\" for the initiatives undertaken with suppliers to measure and reduce their carbon footprints.\n- The EU-funded BlackCycle project, coordinated by Michelin and aimed at developing a tire circular economy, wins the Environmental Achievement of the Year award at Tire Technology Expo 2024.\n- For the third consecutive year, Michelin is ranked No. 1 in the tiremaker category by SPOTT, a natural rubber ESG disclosure platform. Its score of 80.9% attests to the Group's leadership and transparency in responsibly helping to drive progress across the natural rubber value chain.\n- As part of the act4nature international initiative, Michelin strengthens its biodiversity commitments for 2030. For example, the Group now aims to use only deforestation-free natural rubber in its products, in accordance with the definitions and standards of the European Union Deforestation Regulation (EUDR), and to reduce pesticide use in rubber farming by 70% on rubber tree farms operated by the Michelin Group and its joint ventures.\n- Created in 2004 in Bahia, Brazil, the vast, nearly 4,000-hectare Michelin Ecological Reserve (REM) has in just 20 years become one of the best protected, most species-rich ecosystems in the world. Reflecting the Group's All-Sustainable vision, the reserve compellingly demonstrates that rubber tree farming can be made environmentally friendly. Its success has been supported by an extensive research program involving more than 140 projects and 167 scientific publications.\n- The Science-Based Targets initiative (SBTi) confirms that the Group's new targets are aligned with a 1.5°C pathway and are consistent with achieving net zero greenhouse gas emissions by 2050. The new targets have strengthened Michelin's engagement in the fight against global warming.\n- Michelin is leading the Tyre Digital Product Passport initiative as part of the EU-funded CIRPASS-2 project, in line with the European Ecodesign for Sustainable Products Regulation. Introduced in July 2024, the passport is designed to drive faster deployment of circular economy practices in Europe.\nBusiness operations\n- Michelin is selected as the exclusive supplier to equip the Ferrari F80. This latest collaboration with the Italian carmaker showcases Michelin's powerful innovation and unparalleled simulation and modeling expertise. Leveraging its patented state-of-the-art algorithms and unique C3M manufacturing process, the Group developed the outstanding F80 tire in just 15 months.\n- Michelin, the leading tire manufacturer in the United States, surpasses 100 J.D. Power awards with the 2024 rankings, more than all its competitors combined. The awards, based on responses from more than 31,000 vehicle owners, illustrate the Group's high standards of quality and safety for its customers.\n- Exclusive MotoGP tire supplier Michelin becomes title sponsor for the French Grand Prix, which will be officially renamed the Michelin® Grand Prix de France in 2024. MotoGP events offer opportunities to test advanced technologies in extreme conditions, thereby helping to improve the consumer tire lines. Among these technological advances, Michelin has developed tires for the fully electric MotoE bikes, which are made with an average of 50% renewable and recycled materials.\n- Michelin scores its 33rd win in the Le Mans 24 Hours and its 27th straight victory since 1998. The ideal laboratory for testing technologies under the most extreme conditions, endurance racing has played a major role in establishing Michelin's reputation and demonstrating its superiority in delivering long-lasting performance. In one example, Michelin has enabled Hypercars to cover up to 750 kilometers at an average speed of 240 kph, or the equivalent of two Formula 1 Grand Prix races, all on a single set of tires.\n- The IAA Transportation Trade Fair in Hanover offers Michelin the opportunity to reaffirm its position as an indispensable partner to the trucking industry, with two innovative new tire lines and a broadened range of Connected Solutions further demonstrating the benefits of the Group's All Sustainable vision for its fleet management customers.\n- Michelin launches the MICHELIN Primacy 5 range and widens its technological lead. The new tire delivers an 18% increase in tread life, while maintaining superior wet grip safety performance, reducing noise and improving fuel efficiency by 5% compared with its predecessor. With a 6% smaller environmental footprint, it is also perfectly aligned with Michelin's all-sustainable strategy.\nA full description of the highlights may be found on the Michelin website: michelin.com\nResults presentation\nFull-year 2024 results will be reviewed with analysts and investors at a live conference today, Wednesday, February 12, 2025 at 6:30 pm CET. The event will be in English, with simultaneous interpreting in French. The conference call and the full array of financial information may be found on the michelin.com website.\nInvestor calendar\n- April 24, 2025Quarterly information for the three months ending March 31, 2025\n- May 16, 2025Annual Shareholders Meeting\n- May 21, 2025Ex-dividend date\n- May 23, 2025Dividend payment date\n- July 24, 2025First-half 2025 results\n- October 22, 2025Quarterly information for the nine months ending September 30, 2025\nContact details\nDISCLAIMER\nThis press release is not an offer to purchase or a solicitation to recommend the purchase of Michelin shares. To obtain more detailed information on Michelin, please consult the documents filed in France with the Autorité des Marchés Financiers, which are also available from the website michelin.com.\nThis press release may contain a number of forward-looking statements. Although the Company believes that these statements are based on reasonable assumptions at the time of publishing this document, they are by nature subject to risks and contingencies liable to translate into a difference between actual data and the forecasts made or inferred by these statements.\nGleichzeitig vollzieht sich an der Wall Street ein lautloser Favoritenwechsel. Während viele auf Wachstum setzen, feiern Value-Titel mit verlässlichen Cashflows ihr Comeback: Telekommunikation, Industrie, Energie, Pharma – die „Cashmaschinen“ der Realwirtschaft verdrängen hoch bewertete Hoffnungsträger.\nIn unserem aktuellen Spezialreport stellen wir fünf Aktien vor, die genau in dieses neue Marktbild passen: solide, günstig bewertet und mit attraktiver Dividende. Werte, die nicht nur laufende Erträge liefern, sondern auch bei Marktkorrekturen Sicherheit bieten.\nJetzt den kostenlosen Report sichern – bevor der Value-Zug 2026 endgültig abfährt!\nDieses exklusive PDF ist nur für kurze Zeit gratis verfügbar.",
  "word_count": 8255,
  "scraped_at": "2026-02-14T14:15:48.939425"
}