{
  "article_id": "a7f41044502a",
  "url": "https://www.islingtontribune.co.uk/article/eidevall-lets-make-this-even-more-special",
  "title": "Eidevall :  Let make this even more special  ",
  "date": "20230119T211500Z",
  "domain": "islingtontribune.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Eidevall: ‘Let’s make this even more special’\nAfter seeing 46,811 supporters turn out for WSL draw with Chelsea, Arsenal boss wants ‘even better experiences’\nThursday, 19th January 2023 — By Steve Barnett\nArsenal’s Kim Little celebrates scoring against Chelsea from the penalty spot. Photo: Liam Asman/SPP\nFAR from being content with seeing the second biggest crowd in Women’s Super League (WSL) history pack into the Emirates Stadium on Sunday, Jonas Eidevall shared a goal of creating “even better experiences” in a bid to keep driving up the numbers now paying to fill out the stands.\nSome 46,811 supporters descended upon Ashburton Grove to watch the Gunners play out an entertaining 1-1 draw against Chelsea – just 556 fans short of the record attendance that saw Arsenal beat north London rivals Tottenham 4-0 at the same ground earlier this season.\nIt’s certainly a rapid rise from the 8,700 crowd recorded when the Gunners played the Blues at the Emirates Stadium last season – but Eidevall made it clear the club wasn’t about to rest on its laurels.\nReflecting on the tangible growth being seen in women’s football, the Swede said: “It makes us so proud to represent the club. The atmosphere is great. They turn up again for the third consecutive WSL game played at the Emirates Stadium with a 40,000-plus experience. It’s incredible just looking at where we have come from in the last year, so let’s build on it, let’s push it.\n“Let’s not be content. Let’s create even better experiences with even more people in there. Let’s make this club even more special than what it already is.”\nOn Sunday supporters were treated to late drama that blew the WSL title race wide open as Kim Little’s penalty was cancelled out in the dying seconds of the match by Sam Kerr.\nThe Gunners dominated the tie but had to wait until just before the hour mark to make the breakthrough when captain Little confidently sent Zecira Musovic the wrong way from the spot after Caitlin Foord was clumsily halted by Niamh Charles.\nThe crowd clearly thought it was going to be “1-0 to the Arsenal”, but Kerr had other ideas – and in the 89th minute the forward escaped her marker and powered home a header from six yards.\n“I told the players [how proud I was] after the game,” revealed Eidevall. “I thought our performance was really, really good. I’m proud of that.\n“Of course, we’re disappointed with the result, but going forward we need to take that performance with us and we need to learn what we need to learn from the goal we conceded.\n“The crowd, the players’ bravery and their choice between being active or reactive – I think a lot of these are things that we want to showcase for our supporters. We want to be a brave team. We want to play fearlessly. We want to express ourselves. I’m happy to see that.”\nThe draw leaves Chelsea three points clear at the top of the table, albeit having played a game more than their title rivals. Arsenal, meanwhile, drop down to third after being leapfrogged by Manchester United, who thrashed Liverpool 6-0.\nIt’s hard to imagine the top order changing this Sunday, with Chelsea hosting Liverpool in a 12.30pm kick-off, while Arsenal and United face testing but very winnable games away to Reading and Brighton & Hove Albion respectively. Those matches get underway at 2pm.",
  "word_count": 573,
  "scraped_at": "2026-02-14T12:21:36.830171"
}