{
  "article_id": "a85341461da9",
  "url": "https://www.90min.com/posts/rachel-daly-reveals-frustration-dropping-bench-haiti-womens-world-cup",
  "title": "Rachel Daly reveals frustration over dropping to bench for Haiti clash",
  "date": "20230723T131500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rachel Daly reveals frustration over dropping to bench for Haiti clash\n- Rachel Daly left frustrated over not starting England's World Cup opener\n- Alessia Russo started over the WSL top scorer in the number nine role\n- Lionesses have not scored from open play in their last four games\nBy Emily Keogh\nEngland striker Rachel Daly reflected on a tough win over Haiti during their World Cup campaign after dropping to the bench for the Lionesses' narrow 1-0 win.\nDaly was the WSL Golden Boot winner last season, equalling the league's all-time single season record with 22 goals - netting more twice as many as Alessia Russo (10). But she found herself out of the starting XI for the opening Group D match against Haiti.\nRusso had come off the bench in every game at Euro 2022 last summer, scoring four goals and was given the nod for an England side that has struggled to score in recent months. Georgia Stanway netted the winner from the spot here, but it is now four consecutive games - including the behind closed doors friendly against Canada - in which the Lionesses haven't scored from open play.\nWith her team struggling to find an attacking rhythm, Daly was unsurprisingly frustrated not to start only coming off the bench later on.\n\"I think anyone would be [frustrated not starting],\" she said. \"No one is happy to sit on the bench; if you are, then you are not in the right place, not in the right career.\n\"It’s a tough place for Sarina [Wiegman] to be, to pick the team. I respect her decisions, and I will support Alessia all the way, and obviously, I know Beth [England] will do the same,\" she added.\nWhen asked about apparent cobwebs that need blowing off, Daly remarked, \"Obviously we are coming off the back of some time off after the season, but no I wouldn’t say that [we are rusty]. I think Haiti were a fantastic side and they are a force to be reckoned with. I think they will do some damage. I think you have got give credit to the opposition as well, they were brilliant.\n\"I think movement is probably one of my strengths. I just tried to come on and make a nuisance of myself for the defenders, stepping in off the back of Alessia's big shift. She did brilliantly again, and I am just ready when I am called upon.\"\nTrying to give a reason for the Lionesses' goal drought that has plagued the Euro 2022 winners, the 31-year-old said there is not one singular reason to explain their struggles.\n\"I mean, you could put it down to a number of things,\" she explained. \"I think we are quite a new side, a relatively new side. We have lost a lot of players through injury, retiring. We are still building, but I don’t think it’s a worry or a concern at the minute. Hopefully, more will come.\"\nREAD THE LATEST LIONESSES WOMEN'S WORLD CUP 2023 NEWS HERE\nThe competition for the starting striker role has been a key topic of conversation ever since the retirement of Ellen White last year. The competition between Daly, Russo and England, all players coming off excellent WSL seasons for their respective clubs, is enough to give Wiegman a headache.\n\"I think that’s the beauty of having a competitive squad. I think everybody is digging out for a position,\" Daly commented.\n\"It's a headache Sarina has to have in multiple positions. I wouldn't like to be in her shoes, obviously making such big decisions coming into tournaments, but she's a fantastic manager, we respect all of her decisions. It proved tonight that it works, so we are happy.\"\nThe Lionesses began their Euros campaign last year in a similar way with a 1-0 win over Austria where the side also looked a little rusty. Daly believes the Haiti game is a result that the team can build on.\n\"The girls were just saying that then actually, it’s a bit of deja vu, but, look, 1-0, three points on the board, we will take that,\" she explained. \"That’s all that matters coming out of games in the group and for the foreseeable. So, three points on the board, we will take it.\"\nLISTEN NOW TO 90MIN's FOOTBALL CLIMATE CONVERSATION PODCAST\nFormer Italy international Arianna Criscione, Dulwich Hamlet's Brittany Saylor and Football for Future founder Elliot Arthur-Worsop join Katie Cross to have football's climate conversation about the Women's World Cup and tournament football's carbon footprint. Pledgeball's Heather Ashworth also gives an update on the Pledgeball's new Women's World Cup initiative.\nIf you can't see this embed, click here to listen to the podcast!",
  "word_count": 785,
  "scraped_at": "2026-02-14T13:26:55.659409"
}