{
  "article_id": "a86111cdd955",
  "url": "https://www.thecable.ng/super-falcons-forward-oparanozie-retires-at-29",
  "title": "Super Falcons forward Oparanozie retires at 29",
  "date": "20230913T143000Z",
  "domain": "thecable.ng",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Desire Oparanozie, Super Falcons striker, has announced her retirement from professional football for both club and country.\nThe former Falcons captain broke the news in a statement released on her social media handles on Wednesday.\nThe 29-year-old striker appreciated her family, fans, and friends for their support during her “incredible” career.\n“To my fans, family, and friends, thank you for the show of love and support over the years,” she wrote.\nAdvertisement\n“It’s time to take a bow, as I believe there’s no better time than now. I’m officially announcing my retirement from professional football for both club and country.”\nTo my fans, family, and friends, thank you for the show of love and support over the years. It's time to take a bow, as I believe there's no better time than now. I'm officially announcing my retirement from professional football for both club and country… pic.twitter.com/QClEeujx8C\n— oparanozie desire (@oparanozie9) September 13, 2023\nAdvertisement\nThe forward was part of the Nigerian squad that participated in the recently concluded 2023 FIFA Women’s World Cup in Australia and New Zealand.\nThe Falcons were dumped out of the tournament following a 4-2 loss on penalties to the Lionesses of England in the round of 16.\nOparanozie began her football career with Bayelsa Queens, a Nigerian women’s professional side.\nAdvertisement\nIn 2010, she moved to Delta Queens before playing for Düvenciler Lisesispor in the Turkish women’s first football league on loan for two months.\nIn 2012, she joined Rossiyanka in the Russian women’s football championship and left the club one year later.\nShe later joined German side, Wolfsburg, but she struggled to tie down a regular shirt.\nAfter half a season, Oparanozie was compelled to terminate her contract and make a switch to Guingamp, France.\nAdvertisement\nHer last club was the Chinese Women’s Super League club Wuhan Jianghan University.\nThe forward began her career with the national team in 2010. She went on to become an integral part of the team for many years.\nAdvertisement",
  "word_count": 332,
  "scraped_at": "2026-02-14T13:03:54.129783"
}