{
  "article_id": "a864bc5dcc98",
  "url": "https://bilkulonline.com/2024/09/07/aiffs-prestigious-a-licence-coaching-course-wraps-up-at-ara-academy-in-ahmedabad/",
  "title": "AIFF Prestigious A Licence Coaching Course Wraps Up at ARA Academy in Ahmedabad",
  "date": "20240907T143000Z",
  "domain": "bilkulonline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "AIFF’s Prestigious A Licence Coaching Course Wraps Up at ARA Academy in Ahmedabad\n- The 12-day course, led by AIFF’s top coaching experts, trained 32 aspiring coaches, including Indian football legends like Subrata Paul and international coaches.\n- Ahmedabad Racquet Academy (ARA) received high praise for its world-class facilities, further enhancing Gujarat’s reputation in sports infrastructure.\nBILKULONLINE\nAhmedabad, Sep 7: In a major boost to football development in Gujarat, the prestigious All India Football Federation’s (AIFF) A Licence Coach Training Course recently concluded at the Ahmedabad Racquet Academy (ARA).\nThis marks the first time Gujarat has hosted this elite coaching certification program, which was organized under the aegis of the Ahmedabad District Football Association (ADFA) and the Gujarat State Football Association (GSFA).\nLed by top football experts, including Vivek Nagul, AIFF’s Head of Coach Development, and Sajid Yousuf Dar, former head coach of the Indian women’s national team, the course was aimed at equipping aspiring coaches with the expertise required to train and nurture young football talent. The instructors highlighted the critical role A Licence coaches play in shaping the future of Indian football.\n“A Licence coaches are instrumental in elevating the standard of football in India. By empowering them with advanced coaching techniques and methodologies, we can ensure the next generation of players gets the best possible training,” said Vivek Nagul.\nSajid Yousuf Dar echoed these thoughts, adding, “The passion for football in India is undeniable. These coaches are the ones who will foster this passion and develop skilled players capable of competing on a global stage.”\nJoining the course as an Assistant Tutor was Gujarat’s own Shakti Chauhan, a Pro-Licence holder. The 12-day course saw 32 participants from across India and abroad, including some of the most prominent names in Indian football. Among the notable participants were legendary Indian goalkeeper Subrata Paul, former internationals Chandam Chitrasen Singh and Sanjeev Maria, I-League players Saran Singh and Subhas Singh, and UEFA B-licensed coach Steve Leon J Herbots from Belgium.\n“The facilities here at the Ahmedabad Racquet Academy are outstanding, providing an ideal environment for learning and development,” praised Herbots, who serves as Director of United Sports in Kolkata.\nKrinesh Patel, Director of ARA FC, expressed his pride in hosting such a high-profile event. “We are committed to supporting the growth of football and are thrilled to have hosted top-tier coaching talent. This recognition further solidifies Gujarat’s position as a key player in sports infrastructure,” he said.\nThe Ahmedabad Racquet Academy FC continues to be a trailblazer in promoting sports development in Gujarat. With world-class facilities and expert coaching, the academy is dedicated to nurturing young talent in football, tennis, and other sports, aiming to produce the champions of tomorrow.",
  "word_count": 449,
  "scraped_at": "2026-02-14T12:48:30.729792"
}