{
  "article_id": "a87378231bb4",
  "url": "https://www.rnz.co.nz/international/pacific-news/542609/pasifika-sipoti-briefs-for-21-february",
  "title": "Pasifika Sipoti briefs for 21 February",
  "date": "20250221T020000Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rugby sevens\nFiji will meet Uruguay in the opening match of the men's competition at this weekend's Vancouver Sevens tournament.\nFiji is the joint-leader of the series, but lost to Uruguay in a pool match at the Perth Sevens last month.\nThe side meets Uruguay at 7.18am Fiji time on Saturday, before taking on USA at 12.45pm on the same day and then Spain at 6.52am on Sunday.\nIn the women's compeition, the Fijiana Sevens team will meet Japan (10am Saturday, Fiji time), France (3.52pm) and then Great Britain (9:18am Sunday).\nRugby league\nFormer Kangaroos captain Cameron Smith says he is open to being involved with the growth of the new PNG NRL team.\nThe Post Courier reported the former Melbourne Storm and Queensland legend saying if there was an opportunity, he would certainly have a discussion about it.\nSmith was in Port Moresby this week for the launch of the PNG franchise.\nHe captained the Storm, Queensland and Australia, and played 400 NRL premiership games.\nRugby union\nFiji's under-20 rugby coach Senirusi Seruvakula has named a squad for two regional tournaments in Auckland.\nThe Fiji Rugby Union said the team will first compete in the Oceania Rugby Under-20 Challenge, scheduled between late February and early March.\nThey will face Tonga, Samoa, and an invitational Moana Pasifika side, with the winner advancing to the second-tier World Rugby Under-20 Trophy competition.\nThe same group of players will then participate in the Super Rugby Under-20 tournament, scheduled for 15-22 March, also in Auckland.\nOceania football\nHekari United football club will represent Papua New Guinea at the OFC Women's Champions League tournament in May.\nThe National newspaper reported the club defeated Lae City Dwellers 7-0 in the local women's conference soccer league final last weekend, to earn the right to represent PNG.\nHekari United completed the local season undefeated.\nThe OFC tournament will be held in Tahiti, from 4-17 May.\nAthletics\nThe Papua New Guinea athletics team getting ready for the 2025 Pacific Mini Games in Palau have been preparing both locally and overseas.\nThe National newspaper reported around 40 athletes have been training at the National Sports Institute in Goroka.\nPresident Tony Green said some athletes are also training at the Gold Coast in Brisbane, while a few others are based in New Mexico, USA, where they are also training and competing in local athletics meets.\nThe Mini Games will be hosted by Palau in from 29 June to 9 July.\nBoxing\nWorld heavyweight champion Daniel Dubois has withdrawn from his title defence against New Zealand's Joseph Parker this weekend after falling ill.\nBritish boxer Dubois, who holds the IBF title, underwent a medical examination in Saudi Arabia and missed a scheduled media conference, prompting the decision to pull out.\nParker will now face last-minute replacement Congolese boxer Martin Bakole in a non-title fight.\nHe said he's ready to go, and promoter Spencer Brown said the New Zealander doesn't mind who he fights.",
  "word_count": 491,
  "scraped_at": "2026-02-14T12:49:44.995228"
}