{
  "article_id": "a8a2dfc086ad",
  "url": "https://www.illawarramercury.com.au/story/8133216/illawarra-stars-dos-santos-and-heyman-make-alw-history/?cs=300",
  "title": "Illawarra stars Indiana Dos Santos and Michelle Heyman make A - League Women history | Illawarra Mercury",
  "date": "20230326T020000Z",
  "domain": "illawarramercury.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sydney FC coach Ante Juric has continued his faith in Shellharbour's Indiana Dos Santos during the club's race for the minor premiership.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe sky is the limit for the 15-year-old, who made Sydney FC history on Saturday as the club's youngest ever starter in their 3-0 win against Adelaide.\nThe midfielder broke Teigan Allen's record as the youngest ever starter for the club.\nDos Santos was named in the starting 11 alongside A-League Women stalwarts Natalie Tobin, Princess Ibini, Jada Whyman and fellow Illawarra teammate Mackenzie Hawkesby.\nDos Santos managed to nab an assist for Rachel Lowe's opener against United.\nThe victory was crucial for the Sky Blues in the race for the premiers plate. The side now sit second behind Western United but can leapfrog them if they win their game in hand at home to sixth placed Perth on Wednesday plus their final home game of the season against the Jets.\nSydney will win a third straight minor premiership should they get the job done against the Glory and the Jets. The real battle will be the grand final however, with one of the competition's greatest eras missing out on victory on the last day of the past two campaigns.\nHawkesby will look to continue her form that saw her selected for the Matildas last year with the FIFA Women's World Cup in Australia and New Zealand looming on the horizon later this year.\nMeanwhile, former Illawarra Stingrays legend Michelle Heyman made A-League Women's history on Saturday, with the forward breaking the all-time competition appearance record in Canberra's 3-0 win against Western.\nThe former Matilda is looking to help her side reach finals for the first time since the 2020-21 season alongside Chloe Middleton.\nOur news app has had a makeover, making it faster and giving you access to even more great content. Download The Illawarra Mercury news app in the Apple Store and Google Play.",
  "word_count": 328,
  "scraped_at": "2026-02-14T12:25:53.419820"
}