{
  "article_id": "a8cd3f8215d3",
  "url": "https://timesofindia.indiatimes.com/india/from-mahakumbh-stampede-to-messi-mania-10-pictures-that-defined-disturbed-and-delighted-india-in-2025/articleshow/126274978.cms",
  "title": "From Mahakumbh stampede to Messi mania : 10 pictures that defined , disturbed and delighted India in 2025 | India News",
  "date": "20251231T164500Z",
  "domain": "timesofindia.indiatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "- News\n- India News\n- From Mahakumbh stampede to Messi mania: 10 pictures that defined, disturbed and delighted India in 2025\nTrending\nThey say a picture is worth a thousand words, and in 2025, some images captured the very soul of India. From the haunting photograph of Saurabh Rajput’s murder in Meerut to the stunned silence of newlyweds in Pahalgam after a terror attack, the nation faced moments of heartbreak and horror. Yet, there were triumphs that inspired pride: the Women’s World Cup team celebrating victory, Shubhanshu Shukla’s historic journey to the International Space Station, and the chaotic energy of Lionel Messi’s visit, which revealed both adoration and disorder. These snapshots of grief, courage, and celebration defined a year that was as unforgettable as it was extraordinary.\nThe tragedy raised serious questions about crowd management and administrative preparedness. Disturbing visuals from the site showed scattered personal belongings along the Sangam, the confluence of the Ganga, Yamuna, and Saraswati, and shocked, frightened devotees trying to make sense of the chaos.\nPolice investigations soon pointed to his wife Muskan Rastogi and her alleged partner Sahil Shukla, who were arrested after returning from a holiday in Himachal Pradesh. Investigators say the murder was meticulously planned, driven by an extramarital relationship, and later concealed in an attempt to erase all traces of the crime. A chargesheet running over 1,000 pages was filed, packed with forensic findings and witness statements, dismissing rumours of occult involvement.\nAmong the most heartbreaking images was that of Himanshi Narwal, sitting in stunned silence after her husband, Vinay Narwal, was shot dead at point blank. The newlyweds, on their honeymoon barely a week after marriage, became the face of the tragedy, a single picture capturing the enormity of the loss and the cruelty of the attack.\nIn the tense days that followed, India's message was delivered to the world through back-to-back briefings led by Colonel Sofiya Qureshi and Wing Commander Vyomika Singh.Their presence flipped the narrative: women were not just mourning the violence Pakistan-sponsored terrorists had inflicted; they were the ones answering it. The image projected was unmistakable, India's resolve was firm, and its frontline voices were women who embodied strength, and country's refusal to be intimidated.\nIn a near-miraculous outcome, all on board, except one British-Indian survivor, lost their lives. The aircraft also crashed onto a medical hostel building, killing several students inside, deepening the tragedy.\nUpon arrival, Shukla and his crewmates were greeted with warm hugs and handshakes by members of Expedition 73. Axiom mission commander Peggy Whitson then presented astronaut pins to Shukla, Poland’s Slawosz Uznanski-Wisniewski, and Hungary’s Tibor Kapu, all marking their first journey to space.\nShafali Verma was named Player of the Match, while Deepti Sharma earned the Player of the Tournament award. The Team India received a record prize purse of about Rs 37.3 crore, a staggering 239% increase from the previous edition, specifying the tournament’s dramatic rise in stature and the growing recognition of women’s cricket across the world.\nHis visit to the city in December, part of the \"GOAT India Tour,\" saw him virtually unveil a giant statue and greet fans, but the event was overshadowed by chaotic crowd management, damaged stadium property, and widespread criticism. The West Bengal Chief Minister later issued an apology, and inquiries were launched into the organisers’ handling of the event.\nThe image stood out, especially because the Taliban had barred women reporters from the previous interaction, a move Muttaqi later described as a “deliberate” decision.\nBeijing staged the spectacle to mark 80 years since the end of World War II, with nearly two dozen world leaders in attendance, many signalling their intent to deepen ties with China amid heightened US tariff pressures.The display appeared an increasingly multipolar world, even as Donald Trump’s aggressive tariff-era policies reflected his push to reassert the US as a singular hegemonic power.\nEnd of Article\nFollow Us On Social Media",
  "word_count": 650,
  "scraped_at": "2026-02-14T14:22:33.335792"
}