{
  "article_id": "a8d08648900f",
  "url": "https://theathletic.com/4613204/2023/06/19/england-malta-away-fans/",
  "title": "Why 4 , 026 England fans went to Malta ( Clue : It wasnt for the jeopardy ) ",
  "date": "20230619T043000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s mid-afternoon in Malta, the sun is shining, a cooling breeze wafts from the coast and nothing, in particular, is happening.\nAt a hotel in the northern part of the mainland, the mood is calm and peaceful. Then a faint noise catches the ear.\nIt’s a low hum at first, but as it grows, it sounds like singing, which is odd, as this particular hotel has been almost empty for the previous 24 hours. The singing gets louder and louder… and leerier. It comes into focus. It’s being carried over the waves. It’s unmistakable now. Yes, it’s the sound of drunk Englishmen. “Rule Britannia, Britannia rules the waves,” they sing, again and again. Dozens and dozens of them, in a boat, coming in to dock.\nThis is England on tour.\nAdvertisement\nIf the 2022-23 domestic football season felt long, that’s because it was.\nIt began on July 30 with the earliest-ever Community Shield. It ended with the latest-ever FA Cup final, on June 3. Throw in the Champions League ending on June 10 and Manchester City’s campaign lasted for 316 days. Chuck a World Cup in the middle of that and, even for football diehards and fanatics, you find yourself daring to broach the subject of there being too much football.\nSo what persuaded 4,026 people to pay hundreds or perhaps thousands of pounds to travel more than 1,000 miles and presumably take up precious annual leave to watch yet another football match after the longest football season in history, especially one which they almost certainly know the outcome of in advance?\nThe answer that springs to mind is: “One almighty piss up on a beautiful Mediterranean island.” And, yes, for a decent proportion of the travelling England fans, that’s exactly what this trip is. The mood on the plane to the Euro 2024 qualifier looked and sounded like an 18-30 Ibiza holiday.\nBut there are a hardy group of England fanatics who would have travelled to Kazakhstan (which shares borders with China and Mongolia) or the Faroe Islands (current temperature 9C) if England were playing there in June. In fact, especially the Faroe Islands, according to one travelling England fan.\n“I was keeping my fingers crossed for Faroe Islands when the draw was made, it’s one we’ve never ticked off.”\nMeet Carl Davies, a Crystal Palace fan in his fifties (who also follows Roma and Rangers). He goes home and away watching Palace up and down the country and in the past 31 years, he’s missed just two England matches (Lithuania away in 2017 and Montenegro away in 2019). The last home game he didn’t attend was in 1989 because it clashed with Crystal Palace winning promotion via the play-offs.\n“My wife wouldn’t agree, but I’m relatively selective about matches now,” Carl tells The Athletic, immediately raising concerns that this article will need to be fact-checked for credulity.\nAdvertisement\n“For example, I’m not going to North Macedonia away in November. I’ve been twice and there’s nothing wrong with the place, but life is a bit too short. We’re almost certainly going to be through as it’s the last qualifier, so I’ll do something different that weekend and watch the game by myself somewhere — I can’t watch England games in a bar.”\nWhy would a person who has already attended dozens and dozens of football matches this season pay a lot of money to watch another, especially when it’s against Malta, a nation ranked 172nd in the world?\n“You’ve got sunshine, a swimming pool, no chance of trouble, nice trip in June,” he says.\nAnother fan in Malta is Alex. Aged 20, this is his first England away match. He’s been here for a few days and made a holiday of it. He classes himself as a big England fan (he lives 10 minutes from Wembley so goes to a lot of home games).\n“I’ve been wanting to do an England away game for so long,” he says. “Malta, the time of year, the destination, I couldn’t think of a better one. I considered Italy in Naples in March but this one felt like it’d be more relaxed. It’s been a great few days and feels like a reward for the regulars who go.”\nCarl is in Malta with around 35 other people, none of whom — apart from his 18-year-old son Luke — he has met in “real life”. The group started almost 20 years ago when, at a qualifier away in Azerbaijan amid torrential rain and freezing cold weather, dozens were huddled in a small bar. They swapped numbers, stayed in touch and met up at the next away game. There are now 45 of them who speak daily via WhatsApp. They include lawyers, postal workers, men, women and teenagers, and they all have one thing in common: England away.\n“You bond and you gel as a group,” Carl says. “Let’s be honest, following football is irrational, it makes no logical sense. I’m no psychologist but it’s tribalism, ultimately, and at the heart of that is belonging. This really is belonging, even if the football is shite, which it often is and doesn’t justify the time or the money. We have a great time together. I wouldn’t travel on my own, it’s not just about football.”\nAdvertisement\nIt’s certainly not just about football when, with 20 minutes remaining of England against Malta, around a quarter of the away fans have left. Almost half of them miss Callum Wilson’s 83rd-minute goal from the penalty spot. Barely 20 per cent are still around to applaud the team off at full-time. They’ve all gone to the bar.\nCarl stayed until the end, but he understands the notion of not really caring too much about watching every second of a game which was essentially over when Ferdinando Apap put the ball into his own net after eight minutes.\n“Generally, 90 per cent of England games we go to, you know the result beforehand,” he says. “As a Crystal Palace fan, I’ve never had that privilege, so it drives something different in you.\n“For us, it’s wonderfully sociable, there are no nerves about the game, we smile, we laugh and to be honest we probably spend 60 per cent of the time watching the match. I’m not sat there before the game analysing who’s going to be in the team or getting to the ground two hours early. It’s a social venture.\n“The vast majority of England games you can call beforehand. Italy down in Naples recently was different, but that was one of very few competitive games you get in qualifying. Whereas with Palace, who I’ve seen home and away for well over a decade and watched every single second, I’m fully engrossed and relatively stressed.”\nThere are fans from a wide range of English clubs in Malta, from Wolves in the Premier League to Port Vale in League One and Peterborough Sports in the National League North. Alex is a Chelsea fan (who does go to games) and a Wealdstone season ticket holder. He has previously travelled to watch Chelsea in Europe.\n“It’s a completely different vibe,” he says. “For a start, the club boundaries drop to one side. Especially here, I’ve found that everyone’s in it together as one, there’s no division, which is the main difference. You’re all here for England and if you’ve been going a long time, it’s a family. Home or away, football is an escape.\nAdvertisement\n“I wouldn’t class myself as an England fanatic but some would. In the queue for tickets earlier, someone next to me, it sounded like a religion to him.”\nCarl adds: “The vast majority support lower league teams, in fact, I think I’m the only fan of a Premier League club. They’re Preston fans, Carlisle fans, Blackburn fans et cetera, and I’d say the vast majority got into it or like it because they don’t get to travel abroad with their clubs.\n“Club rivalries go out the window. In our group three are Blackburn and two are Burnley.”\nThere are 16,000 people in the official England Supporters Travel Club. Generally between 2,500 and 5,000 will travel to away matches, depending on the allocation given. As an away team, England are entitled to 15 per cent of the stadium capacity but, as is the case here, the host nation might give more tickets. In Malta, around a quarter of the crowd are England fans.\nBut what are England fans like? Clubs have all different types of fanbases which can relate to geography, history, affluence. A range of facets can generate a generally impatient fanbase, or more quiet, or just one that’s completely pants-in-the-air feral. What are the travelling fans of England’s national team like?\n“I’d say, generally speaking, how old you are dictates what type of England fan you are,” Carl says. “The younger ones in my group have grown up with a really good England team that gets to the latter stages of tournaments and may win something soon. You can see and feel that amongst a whole age group.\n“Then there are a bunch 10 years either side of my age who will say we’ll never win anything, we’ll find a way of ballsing it up. Yes, we expect to qualify for tournaments, but we go to tournaments thinking there probably won’t be a semi-final.\n“The younger ones from us, they wanted to book two weeks in Qatar just for the knockout stages, which is a different mindset to the older ones, that’s for sure.”\nAdvertisement\nTournaments are something completely different in terms of intensity. Malta is a social excursion with the result never in doubt. There are also no arrests, which even for a sedentary qualifier in the sun shouldn’t be underappreciated for a country which, although much improved from the dark days of the 1980s, still has a problem, as the European Championship depressingly showed two years ago.\nThe story of what happened with some of England’s fans at Wembley on the day of the Euro2020 final. From Sunday morning to 2am after England’s defeat. Produced @danaihoward https://t.co/y2LK8tuBtp pic.twitter.com/W9V78hHStV\n— Ros Atkins (@BBCRosAtkins) July 13, 2021\nCarl, whose favourite England match was actually a friendly when England beat Argentina 3-2 in Geneva with two late Michael Owen goals, says generally nothing beats a tournament. “Tournaments are fantastic,” he says. “Whenever I’ve been to one I’ve doubted whether to go a couple of weeks before, usually when you see the Panorama programme saying you’re going to be kidnapped in South Africa, or attacked in Russia, or you won’t be able to do anything in Qatar. But I’ve always loved every minute when I’m out there.\n“You also feel rewarded for having gone through the journey all the way through the qualifiers.”\nSheffield Wednesday fan Stephen, also in Malta, agrees: “I didn’t fancy Qatar but I’ve been to tournaments before and there’s nothing quite like them, I can only compare them to big FA Cup games or the play-offs in England.\n“Qualifiers and friendlies are definitely more of a social thing. There’s no jeopardy on the majority of results, especially with how qualifying works now. I’ve seen England miss out on a couple of tournaments like the World Cup in 1994 and the Euros in 2008, but we’d have to be spectacularly bad to miss a tournament now, so the qualifiers are mostly just a day out with friends rather than an important match.”\nAs the full-time whistle goes in Malta, those who aren’t at the bar sing for Jack Grealish (who also isn’t at the bar, just to clarify), they sing for Harry Maguire and they sing for England.\nMany of those fans will be at Old Trafford tonight to watch Gareth Southgate’s team take on North Macedonia. Plenty will be in Skopje in November, even though England will almost certainly have qualified by that point.\nAdvertisement\nWhy? “Football is a way of life. You kind of get it or you don’t,” newbie Alex says. “I’ve been brought up that way. The week is for working and then you’ve got your escape of football at the weekend.”\nHe adds: “It’s an escape, especially with everything going on in the world today, you can just forget all that and have a nice trip and watch a football match without worrying about anything else.”\nCarl says: “With Palace, for me, you build an affinity with the players, the managers, the club, the community. You feel an attachment to them.\n“To be honest, with England, that bond isn’t there for me, even though you get to watch incredible players. It’s a different feeling. But when I go to watch England away, particularly for a big game, back home the country pauses and everyone stops to watch. And I’m there, I’m part of it.\n“And if it’s not a big game, then when else am I going to get the chance to discover a country like Kazakhstan? I don’t ski, so when we got Andorra I was absolutely delighted.”\n(Top photo: England fans in Malta; by Eddie Keogh/The FA via Getty Images)",
  "word_count": 2181,
  "scraped_at": "2026-02-14T12:45:40.670758"
}