{
  "article_id": "a8eeb1cf5e49",
  "url": "https://www.bbc.co.uk/news/articles/c86q2d0ez1go",
  "title": "Natasha Harding : former Wales football player faces fresh claims",
  "date": "20241123T013000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Former Wales football star faces fresh cash claims\n- Published\nUp to 70 parents and businesses have now made allegations that they have lost money to former international footballer Natasha Harding.\nIt is understood the total figure lost could be almost £70,000.\nThe former Reading captain, who is one of Wales' most capped players and now uses her married name of Allen-Wyatt, is facing a number of claims, including that she took money for one-to-one coaching with children that she did not deliver.\nMs Allen-Wyatt said she had to cancel \"some sessions\" due to circumstances outside her control, and apologised to those affected.\nMan City urged to ditch footballer embroiled in cash row\n- Published21 November 2024\nTop footballer took thousands of pounds, claim teammates and parents\n- Published20 November 2024\nEx-football star 'took thousands'\n- Published20 November 2024\nSince the first allegations emerged, parents and businesses from south Wales, north Wales, Gloucestershire and Worcestershire have told BBC Wales about their own experiences with Ms Allen-Wyatt, in fresh claims amounting to £27,000.\nMeanwhile, a parent who set up a WhatsApp group for those affected said their claims totalled around £40,000.\nReports have been made to a number of police forces in Wales and England, some of which have been passed on to Action Fraud, which co-ordinates fraud complaints from all regions.\nAction Fraud said at least one report \"is currently being assessed\" by the National Fraud Intelligence Bureau.\nFormer teammates have also revealed to the BBC that some of Ms Allen-Wyatt's actions \"also impacted ourselves, our families and friends\".\nMs Allen-Wyatt's former club, Manchester City, has been urged to cut its ties with her as a pundit and commentator.\n'I was really, really disappointed'\nAndy Hughes, a voluntary coach for Northop Hall Girls' under-12s and under-13s in Flintshire, said Ms Allen-Wyatt had offered one-to-one coaching to team members after appearing as a guest on his podcast, This Girl Can Play, and mentioning she wanted to expand her academy to north Wales.\nShe subsequently signed up 12 players for 10 sessions of coaching, at a cost of £280 per player.\nBut only two blocks of coaching sessions were delivered, with subsequent sessions cancelled or postponed after Ms Allen-Wyatt told Mr Hughes that she had suffered two family bereavements.\nNo further sessions were arranged, and Mr Hughes said no refunds had been given.\nHe said, \"I was really, really disappointed. For someone who played the game at that level and who’s an icon to the next generation of women footballers, these sessions were really important.\n\"How do you explain to an 11-year-old girl that their Welsh hero isn’t going to come and coach them after all, and that they’ve let them down?\n\"I'm gutted that someone we put forward as a great opportunity has turned out like this. It's a shame because the coaching she did deliver was good.\"\nDaniel Rees, who runs Cardiff Classic Shirts, agreed to sponsor Ms Allen-Wyatt after she contacted him through social media.\nHe gave her £500, for which he was promised the company would be advertised on her academy training shirts, hoodies and jackets for a period of two years.\nMr Rees said he had seen no evidence of this being done and not received any explanation despite trying to contact her.\n\"I couldn't find any pictures of shirts that were meant to be printed up, just a mock-up I was sent,\" he said.\n\"I never thought the worst, I just thought she was having a run of bad luck and it would come good.\n\"To see now that it's so widespread has come as a bit of a shock to the system.\"\nMr Rees said he was also promised two worn Wales match shirts, which never materialised.\nKate Parker, a keen Wales football fan, purchased coaching sessions as a Christmas gift for her niece after seeing the Tash Harding Academy on social media.\nMs Parker, who runs two pubs in the Caerphilly area, paid further amounts for sponsorship through the academy and kit for her niece, with the total coming to £1,335.\nHowever, only one training session was delivered, a second one cancelled, and eventually Ms Parker asked for a full refund.\nJust £350 has been returned to her, in three instalments, with £885 remaining outstanding.\n\"She'd promised my niece a Wales shirt as well... it's a big thing when you're a kid,\" said Ms Parker.\n\"My niece is quite shy, I've been to a couple of her football matches and she doesn't get involved as much as the others.\n\"She was quite upset but my sister sat her down and explained that (the coaching) couldn't happen, and that's that.\"\nBBC Wales approached Ms Allen-Wyatt for comment about these latest claims but received no response.\nGet in touch\nHave you been affected by any of the issues raised here? Please get in touch",
  "word_count": 808,
  "scraped_at": "2026-02-14T12:10:15.601005"
}