{
  "article_id": "a916fc222fcd",
  "url": "https://liverpooloffside.sbnation.com/liverpool-fc-women-news-results/2023/7/31/23814091/official-liverpool-fc-women-transfer-news-sign-creative-attacking-midfielder-marie-hobinger-austria",
  "title": "Official : Liverpool Women Sign Attacking Midfielder Marie Höbinger",
  "date": "20230731T171500Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After a season that saw Liverpool Women solidify their place in the FA Women’s Super League with a solid mid-table finish, the offseason has seen Matt Beard’s side looking to build off that solid foundation with a number of signings.\nOfficial: Liverpool Women Sign Attacking Midfielder Marie Höbinger\nThe creative 22-year-old Austrian arrives to bolster midfield following a successful spell with FC Zürich.\nThe latest on that front is Marie Höbinger, the 22-year-old Austrian international attacking midfielder who becomes their sixth signing of the summer, arriving from FC Zürich, where she won a league and cup double in the 2021-22 season.\n“I’m so happy to be here finally,” Höbinger said of making the move to England. “The new surroundings are great, everyone is so kind and I really like it. I love English football, men’s and women’s, so I always wanted to play in the WSL.\n“I really like the vision of the club. I also am a really ambitious player, so I’m really excited for the forthcoming season. I think I am technically a strong player. I really like ball possession, moving the ball forward, and creating chances.”\nAfter being something of a neglected afterthought, Liverpool Women’s relegation to the Championship in 2020 appeared to serve as something of a wakeup call, and following two seasons back in the top flight the target is inching upwards.\nHöbinger’s signing follows the arrivals of forwards Natasha Flint and Mia Enderby, defenders Jenna Clark and Grace Fisk, and goalkeeper Teagan Micah as the Reds look to close the gap on the likes of Chelsea, Arsenal, and the Manchester clubs.\n“For me personally it’s always thinking in small steps,” Höbinger added. “I want to adapt to the team, get to know everyone, then of course to improve as a player, get better, and learn and grow. I really can’t wait to get started and I’m so excited.”",
  "word_count": 314,
  "scraped_at": "2026-02-14T12:22:07.173586"
}