{
  "article_id": "a92a500d88b7",
  "url": "https://greatbendpost.com/posts/7b580cf0-5c99-46cd-9218-73abf236296e",
  "title": "Saturday Sports Headlines and Scores presented by Barton Community College",
  "date": "20250726T201500Z",
  "domain": "greatbendpost.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "HOUSTON (AP) — Nick Kurtz of the Athletics has become the first rookie in Major League Baseball history to hit four home runs in a game. He also matched the MLB record with 19 total bases against the Houston Astros on Friday night. Kurtz went deep in the second, sixth, eighth and ninth innings. He also doubled and singled on his 6-for-6 night to equal Shawn Green, who had four homers, six hits and 19 total bases for the Los Angeles Dodgers on May 23, 2002 at Milwaukee. It was the 20th four-homer game in major league history and second this season. Arizona’s Eugenio Suárez did it on April 26 against Atlanta.\nNEW YORK (AP) — New York Yankees star Aaron Judge is out of the lineup against Philadelphia because of an elbow injury. Manager Aaron Boone said Saturday that Judge went for imaging. The two-time AL MVP was wincing in the outfield at Toronto this week. Boone says Judge struggled to throw a little bit in Friday night's loss to the Phillies. Boone wouldn’t speculate whether the injury involved Judge’s UCL.\nNEW YORK (AP) — Jazz Chisholm Jr. criticized the attempted suspension of a Little Leaguer for a bat flip, calling it \"ridiculous.\" The incident involved 12-year-old Marco Rocco from New Jersey, who ejected for unsportsmanlike behavior after a home run on July 16. His father, a lawyer, challenged the suspension in court and won. Marco played Thursday for Haddonfield, New Jersey, on Thursday and ent 0 for 2. Toronto pitcher Max Scherzer and others have weighed in, with Scherzer supporting emotional displays in the game. Baseball has increasingly embraced emotion, with notable moments like José Bautista's 2015 bat flip gaining attention.\nBASEL, Switzerland (AP) — Despite UEFA’s commitment to women’s soccer with a $1 billion strategy through 2030, its president Aleksander Ceferin hasn’t been seen at the Women’s European Championship during the thrilling knockout stages. Čeferin’s expected attendance Sunday at the England vs. Spain final in UEFA’s marquee women’s event will be just his second match in the 31-game tournament. His only other appearance was the opening ceremony game 25 days earlier in the same Basel stadium between host nation Switzerland and Norway. Women’s soccer has never dominated a UEFA presidential election and Čeferin was re-elected unopposed twice since his first victory in 2016.\nBASEL, Switzerland (AP) — A title game between defending champion England and World Cup winner Spain is the Women’s European Championship final that many wanted. How they got to Basel on Sunday is a whole other story. Spain has mostly cruised through its five games except for a late scare in a tense semifinal against Germany. England has trailed for long periods of three games and survived being on the brink of elimination in both knockout games. Spain coach Montse Tomé has a supremely technical team. Sarina Wiegman's England has incredible will to win. It looks like an ideal final of contrasting styles.\nFORT LAUDERDALE, Fla. (AP) — The owner of Inter Miami called Major League Soccer’s suspension of Lionel Messi and Jordi Alba for skipping the All-Star Game a “draconian” punishment. Owner Jorge Mas said Friday that Messi and Alba don't understand the one-game suspensions. Messi and Alba did not suit up for the match between the MLS and Liga MX of Mexico despite being voted to the game. Messi did not play to rest amid a packed schedule and Alba was dealing with a previous injury. Mas said the club made the decision for Messi and Alba to sit out of the All-Star Game.\nNEW YORK (AP) — Kyle Schwarber reached 1,000 hits with his 319th home run, surpassing Mark McGwire for the most home runs among players with 1,000 hits in major league history. Schwarber hit two two-run homers in a 12-5 win over the New York Yankees. His first homer started a comeback from a 2-0 deficit. Schwarber, who is 32 and eligible for free agency this fall, has been a key player for the Phillies. He has 36 homers this season, just three shy of the major league leader. Phillies fans and management have expressed their desire to keep him.\nNEW YORK (AP) — Paul Goldschmidt wishes he had played it differently during the Yankees' game against the Phillies. Instead of attempting an off-balance throw to home plate, he believes he should have gone for the out at first base. His throw not only failed to get the second out but was the Yankees' ninth error in four games. The Yankees committed two errors in their 12-5 loss to Philadelphia, which dropped them 5 1/2 games behind AL East-leading Toronto. Manager Aaron Boone said Goldschmidt was trying to make a play, but it was a mistake.\nMIAMI GARDENS, Fla. (AP) — The Miami Dolphins added needed help to their secondary on Saturday, signing cornerback Jack Jones to a one-year deal. Jones had 69 tackles, three interceptions— one returned for a touchdown — and 15 pass breakups in 16 starts for the Raiders last season. A fourth-round draft pick by New England in 2022, Jones played two up-and-down seasons for the Patriots before being released and claimed off waivers by Las Vegas in 2023. Also Saturday, the Dolphins waived cornerback Ryan Cooper Jr.\nMINNEAPOLIS (AP) — Jared Allen was raised on a horse ranch in California and fulfilled his vision of becoming a professional football player with a fun-loving cowboy style. He totaled 136 sacks over 12 seasons in the NFL primarily with the Kansas City Chiefs and Minnesota Vikings. Allen will be inducted in the Hall of Fame next weekend. The crossroad of his career came in 2008 after the trade he requested from the Chiefs sent him to the Vikings. Allen cleaned up his life off the field and took his pass-rushing game to another level as the highest-paid defensive player in the league.\nFinals\nINTERLEAGUEFinal Colorado 6 Baltimore 5Final Cincinnati 7 Tampa Bay 2Final L.A. Dodgers 5 Boston 2 Final Philadelphia 12 N.Y. Yankees 5Final Minnesota 1 Washington 0Final Chicago White Sox 12 Chicago Cubs 5Final Texas 8 Atlanta 3\nAMERICAN LEAGUECleveland at Kansas City (Postponed)Final Toronto 6 Detroit 2Final Athletics 15 Houston 3 Final L.A. Angels 3 Seattle 2\nNATIONAL LEAGUEFinal Miami 5 Milwaukee 1Final St. Louis 3 San Diego 0Final Arizona 1 Pittsburgh 0Final N.Y. Mets 8 San Francisco 1",
  "word_count": 1055,
  "scraped_at": "2026-02-14T13:32:49.896000"
}