{
  "article_id": "a92f9db4e9bd",
  "url": "https://thepeoplesperson.com/2025/05/01/marc-skinner-believes-man-united-women-will-respond-to-chelsea-defeat-in-against-man-city-293494/",
  "title": "Marc Skinner believes Man United Women will respond to Chelsea defeat in against Man City - Man United News And Transfer News",
  "date": "20250501T143000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Manchester United Women boss Marc Skinner was full of praise for his side who were narrowly beaten by champions Chelsea 0-1 at the Leigh Sports Village.\nSpeaking to the official club website, he admitted that Chelsea found their way back into the game in the second half but felt his players also matched their efforts.\nWhen asked about a second half drop off he claimed, “I honestly didn’t think that, you just expend energy, right? It’s just a natural lull in the game. They are making world class changes that they paid a lot of money for. You know they are making an impact. But our players came on and made a massive impact too, so it is really exciting for me.”\nThe 42 year old boss believed that he saw enough from his side to suggest that they have a good chance of winning a second consecutive FA Cup title when they play the Blues later this month.\n“When I see the opportunity for when we play them in the FA Cup, I see a great opportunity. You could hear around the stadium that there was great buzz, great energy. I felt they were let down a little today with some decision making. It’s difficult to take, I’ll assess it but I know I’ll be ready to go into Sunday and obviously next week.”\nThe United boss believes his side matched Chelsea and made life difficult for them throughout the match.\n“We need to realise that we are in a really good space and we have made it really uncomfortable for the champions. And not many teams have done that to them this year. I feel they got fortunate in their moment. Barring the triple stop, which was excellent, Phallon (Tullis-Joyce) didn’t really have that much to do. I feel the team defended so well in front of her and we will continue to do that.”\nSkinner also revealed that there were no injury worries and any substitutes were made just to “freshen up” the team at that point.\nHe was then pressed about Champions League football next season and he was defiant about United’s chances. The Red Devils sit four points clear with only two matches remaining. They next play Manchester City at home on Sunday, where a draw or win would secure European football for next season.\n“We will go into the City game really energised and hopefully after that try and finish second.”\nThe United manager was then asked to give his thoughts on playing at Old Trafford for the crucial match on Sunday and he said, “brilliant. It will echo even more because it will be full of our fans. They bring the noise, they bring the energy and this team will respond. You know there will be moments when City will have a bit of an up and we will need to be ready. We need everybody and if we can do that, we can make it a real cauldron of success and that is what we need to do on Sunday.”\nFinally, Skinner was asked why he got the players in a huddle at the end while the Chelsea players celebrated their latest league win.\nHe asserted, “it’s just I felt that they didn’t deserve the outcome and that sometimes football is cruel but it is a great opportunity for us to spring forward and I know they will. After tonight, I saw it in their eyes, before the game, during the half-time, after, they felt good and they felt comfortable.”\n“It’s disappointing the way it ended but there are a lot of good things the players can take out of it and I know they will be fully ready for these next three games.”\nFeatured image Ben Roberts Photo via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 635,
  "scraped_at": "2026-02-14T12:58:18.718821"
}