{
  "article_id": "a9359f631367",
  "url": "https://liverpooloffside.sbnation.com/liverpool-fc-women-news-results/2023/1/19/23562875/liverpool-fc-women-transfer-news-sign-miri-taylor-from-angel-city-nwsl",
  "title": "Liverpool FC Women Sign Miri Taylor From Angel City",
  "date": "20230120T020000Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Liverpool FC Women have secured their fourth signing of the January window, shoring up their attacking options in bringing in 22 year old midfielder Miri Taylor.\nLiverpool FC Women Sign Miri Taylor From Angel City\nThe 22 year old was selected in the NWSL draft for Angel City’s inaugural season.\nTaylor comes to Merseyside from Angel City FC in Los Angeles, having been selected in their inaugural NWSL draft picks last year. She played in 11 matches for Angel City, in central midfield, center forward, and right wing. Angel City’s season ended in disappointment, not making the playoffs, but the squad leaned on Taylor’s skills as injuries racked them.\nKent-born, Taylor got her start in the Chelsea academy before making her first senior start at 16 for Arsenal. Taylor later went on to Hofstra University in New York where she played for three years and was selected a first-team All-American by the United Soccer Coaches.\n“We’re absolutely delighted to bring Miri to Liverpool,” said Matt Beard of the signing.\n“She will add real versatility to the squad as a midfield player who can also play in any of the three forward positions.\n“Technically she’s a very gifted player and a season in the NWSL last year has given her experience of a physical, transitional league as well.”\nAfter four years abroad, one can understand why Taylor would want to come back across the pond - especially as the FA WSL experiences growth and development of it’s own and Angel City appears primed for a rebuild.\n“It’s a dream come true really. My mum is a massive Liverpool fan, so just for her it’s amazing to be here and I’m really excited to get started,” Taylor said.\n“To come home and play in the Women’s Super League is always something I’ve wanted to do.\n“I really hope for Liverpool I can be someone very dependable and reliable, a good centre midfielder who will break up play, get involved, be physical and counter quickly, be a bit of a leader in the middle, assist and score.\n“When I went to America, I always imagined coming back to the WSL, that was always my dream, to play football in England at the highest level I can.\n“When the NWSL rolled around I thought I can’t turn that opportunity down and I just wanted to get game experience and first-team experience.\n“I’m just really excited to have had interest from Liverpool in the first place and when it was Liverpool it was just tunnel vision.”\nTaylor will wear the 35 for Liverpool FC Women and will hopefully bring some much needed support from the middle of the pitch.",
  "word_count": 444,
  "scraped_at": "2026-02-14T12:21:36.322634"
}