{
  "article_id": "a940eef5abd1",
  "url": "https://www.winnipegfreepress.com/business/2023/06/08/budweiser-brewer-renews-with-fifa-to-2026-despite-world-cup-stadium-beer-ban-in-qatar",
  "title": "Budweiser brewer renews with FIFA to 2026 despite World Cup stadium beer ban in Qatar – Winnipeg Free Press",
  "date": "20230608T124500Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Budweiser brewer renews with FIFA to 2026 despite World Cup stadium beer ban in Qatar\nAdvertisement\nGENEVA (AP) — Budweiser will still be the official World Cup beer through the 2026 tournament in the United States, after brewer AB InBev renewed with FIFA on Thursday despite a troubled time with men’s 2022 World Cup host Qatar.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nGENEVA (AP) — Budweiser will still be the official World Cup beer through the 2026 tournament in the United States, after brewer AB InBev renewed with FIFA on Thursday despite a troubled time with men’s 2022 World Cup host Qatar.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 08/06/2023 (982 days ago), so information in it may no longer be current.\nGENEVA (AP) — Budweiser will still be the official World Cup beer through the 2026 tournament in the United States, after brewer AB InBev renewed with FIFA on Thursday despite a troubled time with men’s 2022 World Cup host Qatar.\nTwo days before the tournament began in Qatar, World Cup organizers withdrew a longstanding promise to let fans at stadiums buy beer with alcohol.\nThe move blindsided the brewer whose Budweiser brand has been the World Cup beer since the 1986 tournament.\nFIFA seemed unable to protect AB InBev under pressure from Qatar in a dispute which seemed a potential breach of contract issue for soccer’s world body. The conservative Muslim nation signed up to honor FIFA’s commercial partners when it started bidding to be host in 2009.\nThough sales of Budweiser dropped in stadiums, the global publicity over the dispute arguably boosted the brewer and left little doubt which brand was tied to the World Cup.\nA renewal for the 2026 World Cup seemed a done deal even during the dispute in Doha. FIFA president Gianni Infantino said then that relations with AB InBev were good and handshakes had been exchanged before arriving in Qatar.\nThere was no mention of past problems Thursday in a FIFA statement confirming AB InBev would sponsor the Women’s World Cup that kicks off next month in Australia and New Zealand, and the men’s 2026 tournament which will be co-hosted by the U.S., Canada and Mexico and will increase to 104 games from 64.\n“FIFA World Cup tournaments are the most popular sporting events in the world” AB InBev chief marketing officer Marcel Marcondes said. “We are deeply connected to the fans and to football all over the world, which is why we’re excited about extending the relationship with FIFA.”\nThe value of the renewal was not stated. The sponsorship was reported to be about $75 million for the previous World Cup.\n___\nMore AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports",
  "word_count": 643,
  "scraped_at": "2026-02-14T13:47:31.359041"
}