{
  "article_id": "a95f76961805",
  "url": "https://theathletic.com/4881216/2023/09/20/spain-rfef-strike-putellas-hermoso/",
  "title": "Chaos , confusion and compromise as majority of Spain squad agree to end boycott",
  "date": "20230920T111500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A compromise between Spain women’s players and their national football association has been reached after meetings involving government officials that ran into the very early hours of Wednesday.\nNow, two days before they are due to play their first match since winning the World Cup a month ago, 21 of the 23 players called up by new manager Montse Tome have agreed to represent Spain.\nAdvertisement\nVictor Francos, president of the Consjejo Superior de Deportes (CSD — a governmental body with authority in sporting matters), travelled to meet the squad at the end of another dramatic day in a long-running dispute.\nIn a statement issued after six hours of talks, shared with media at around 5am local time today, Francos said “two players requested the possibility of leaving for reasons of lack of morale and personal discomfort”, with the remaining 21 now set to travel for Friday’s Nations League match against Sweden in Gothenburg. Mapi Leon and Patri Guijarro are the players who will leave camp.\nThe 23 were called up on Monday in a press conference originally scheduled for last Friday. A majority of them had reaffirmed their commitment to the common position they have taken since late August — that they would not play again until major changes were made at the Spanish Football Federation (RFEF).\nAfter they were called up, sources close to several players, who asked to speak anonymously to protect their positions, told The Athletic they had not been informed in advance they were going to be selected. These same sources said the players were worried they would face sanctions if they did not report for Spain duty.\nFrancos said progress had been made during “friendly and constructive” talks between the RFEF, CSD, players and Tome. He said the outcome of these talks included a new commission formed by representatives of all parties that will “monitor the agreements we have reached”.\nHis statement added: “The players have expressed their concern to us about the need to make changes in the RFEF and the federation has committed to ensuring these changes occur immediately.”\nFurther communication from the RFEF is expected later today.\nAmanda Gutierrez, president of FUTPRO, Spain’s women’s football union, said: “The players see it as a rapprochement. The vast majority have decided to stay for the sake of this agreement. It is the beginning of a long road ahead.”\nLater this morning, Leon and Guijarro spoke to reporters outside the team hotel.\nAdvertisement\n“The situation for Patri and for me is different,” Barcelona defender Leon said. “We already know this hasn’t been the way to return. So we’re not in the conditions to say, ‘No, you come back.’\n“We’re happy because it’s true that changes are being made. We’ve reached another result. Little by little, changes are being made, and in this we totally support our team-mates.”\nGuijarro, a midfielder for the same club, added: “They’re working on those changes. It’s true that some have been made but they’re working. Yesterday we achieved, or they said, they would have a mixed sporting commission. But it’s true that it’s pretty difficult personally, to be here after how everything’s happened. Mentally, you’re not in a place to be able to be there.”\nFrancos also said Leon and Guijarro would not face any punishment over their decision not to travel with the rest of the squad to Sweden.\nBut the possibility of players being sanctioned with fines, or even having their licences to play football in Spain revoked, was a dominant factor in the uncertainty that prevailed all through the day on Tuesday, as the latest chapter in this remarkable and complex story began to unfold.\nIt was around 11am local time when Misa Rodriguez arrived at the hotel where Spain’s Madrid-based players were asked to meet on Tuesday.\nWalking up the steps, past a tightly-packed group of journalists and photographers, the Real Madrid goalkeeper was asked many questions but only answered two of them.\n“Have you spoken to Montse (Tome, the new manager after the sacking of World Cup winner Jorge Vilda two weeks ago)?”\n“No, we haven’t heard anything.”\n“Are you happy to be part of her squad?”\n“No.”\nThis is how the latest day of drama surrounding the new world champions began — with boycotting players who did not want to represent their country arriving stony-faced after being called up for national team duty.\nAdvertisement\nAbout an hour and a half later, Rodriguez and the squad’s five other Madrid-based players left that hotel, near the capital’s Barajas airport. They walked out in silence, ignoring further questions from the expanding crowd of media.\nThey were heading for a hastily-arranged flight to Valencia.\nThe RFEF had made arrangements for the whole squad to gather there, rather than at the Las Rozas complex near Madrid where Spain’s football teams usually train. This too had caused great confusion, with some players uncertain of how they were expected to make the 220 mile (350km) journey, and with the RFEF providing no explanation of why the change had been made. It was later reported the training facilities initially chosen in Oliva, a small town near Valencia, were not suitable because they do not have floodlights.\nTome and the members of her new backroom staff were also travelling south from Madrid, while the national-team players based elsewhere would make their own way.\nTwo more Barcelona players, Alexia Putellas and Cata Coll, were filmed at the Catalan city’s airport on their way to Valencia, as they searched for the fast-track entrance through security. Putellas, holding her phone with her boarding pass, did not engage with many of the questions posed to her by journalists. But when asked how the mood was in the group she said: “Bad. How else could it be?”.\nSo why did the players accept the call-up?\nAccording to sources close to the players, it was because they feared reprisals.\nAt a press conference on Monday afternoon, Tome named her first squad since being appointed as Vilda’s successor. The majority of the 23 players she named had said they no longer wished to represent Spain. Tome said she had spoken to these players, without explaining any details of what they had talked about.\nAdvertisement\nWhen asked several times whether they had changed their position and whether she could guarantee they would indeed play for Spain this week, she gave a series of carefully-phrased answers.\nShe said there was “confidence” the players would return. She praised their “professionalism” and said they would be returning to a “new era” with a “more professional work climate”.\nSources close to several of the striking players told The Athletic they had no idea they were going to be called up. Their initial reaction when they were was confusion and worry.\nThe players were concerned they would face sanction if they did not report. As we will explain in more depth later in this article, a Spanish law could, in theory, see players who refuse to play for Spain punished by having their licence to play football revoked. For that reason, some felt obliged to attend.\nSources close to the players also said that at a meeting with the RFEF leadership on Friday, the striking players were asked to return to the team immediately on the understanding that in a month’s time “some of what they have asked for”, in terms of changes to the RFEF structure and leadership, would be done.\nThe sources said the players decided not to do this, because they still did not trust the RFEF.\nWhat does that law say?\nSpain’s new Sports Law of January 1, 2023, which replaced a previous version established in 1990, sets rules around attending call-ups to Spanish national teams.\nIts article 104 describes as a very serious infringement “the unjustified lack of attendance to the calls of the national sports teams, as well as the failure to make oneself available to the national teams”. However, there is no description list of what are considered “justified causes”.\nArticle 108 then refers to sanctions players might face for refusing a call-up. Potential fines vary between €3,000 and €30,000 (£26,000; $32,000), and there are also powers to suspend an athlete’s sporting federation licence for a period of between two and 15 years.\nAdvertisement\nHowever, there is also a transitional provision (to facilitate the change from the old law to this new one).\nThis states that until a new conflict resolution regulation is approved (and that has not yet happened), the previous law must continue to apply. The size of the potential fines are practically the same, but under the 1990 law licences can be suspended only for a duration of between two and five years. It also, however, establishes the possibility of a perpetual removal of an athlete’s sports licence, although this is said only to be applicable in “infractions of extraordinary gravity”.\nIf a Spain international footballer had their licence revoked or suspended, they would also become ineligible to compete in Spanish domestic football competitions.\nIn the case of the national women’s team, the first stage of any punishment would be the RFEF deciding to file a complaint against players. It would have to file a complaint with Spain’s Administrative Sports Tribunal (TAD). The TAD is described in Spanish law as being part of the CSD, while acting independently of it.\nFour of the TAD’s seven members are chosen by the CSD president, with three representatives proposed by various Spanish sporting federations.\nLate on Monday night, CSD president Francos said on Spanish radio: “If they (Spain’s players) don’t show up, the government will have to apply the law.”\nBut his statement early on Wednesday appeared to draw a line under the matter when saying no players would face any such punishment.\nWhy have the players been striking?\nThe origins of the players’ movement for change go back years.\nIn 2015, after Spain were knocked out of their first ever Women’s World Cup at the group stage, players came together to call for the removal of Ignacio Quereda, who had been the team’s manager since 1988.\nAdvertisement\nIn a recent The Athletic article, players from that era revealed some of the shocking incidents they had experienced when with the national team. Their testimony included details of abusive, sexist or coercive behaviours, as well as descriptions of very poor levels of professionalism, standards and investment from the RFEF.\nGO DEEPER\nThese shocking stories explain why Spain's women's team want systemic change\nIn sharing their stories, those players also spoke strongly of the need for institutional, structural transformation within the RFEF now, as they reflected on what had happened since Quereda’s removal.\nVilda, Quereda’s replacement, was the man in charge in September last year when a new generation came together to push for progress, as 15 players sent emails confirming they did not wish to be selected until changes were made in the women’s national team setup. The changes they were calling for related to both on-field and off-field issues. They were supported by three further players — and so the group was referred to in the Spanish media as ‘Las 15 +3’.\nJust six of those 18 players —Putellas, Irene Paredes, Jenni Hermoso, Aitana Bonmati, Mariona Caldentey and Ona Batlle — were called up for the World Cup in Australia and New Zealand this summer.\nWhen Spain won that tournament by beating European champions England 1-0 in the final in Sydney on August 20, a whole new frontier in the dispute opened following RFEF president Luis Rubiales’ kiss on forward Jenni Hermoso during the post-match trophy presentation ceremony.\nHermoso has said the kiss was not consensual but Rubiales has continued to insist that it was, even after finally resigning as president last week. He had already been suspended by FIFA, world football’s governing body, and in Spain public prosecutors have filed a lawsuit against him for alleged sexual assault and coercion.\nAfter the kiss, the RFEF released a statement attributing quotes to Hermoso in which she appeared to make light of the situation, words which she later denied having said. She was threatened with legal action if she did not change her stance to agree with Rubiales’ version of events. The RFEF also released photos it claimed backed up Rubiales’ claim that the kiss was consensual.\nAdvertisement\nIn a speech at RFEF headquarters five days after that final, Rubiales dramatically stated he was refusing to step down, while describing himself as the victim of a long-running campaign of “social assassination”. He said “false feminism” was a “great scourge in this country”.\nVilda was among the first to rise in a standing ovation at the end of that speech. Tome also stood to applaud.\nThe next day, she and 11 members of the coaching staff released a joint statement in which they said they had been made to sit in the front row for the speech and affirmed their “categorical condemnation” of Rubiales’ behaviour.\nThis Monday, Tome again said she regretted how she had reacted to Rubiales’ speech. She said: “I supported Jenni (Hermoso) and feel sorry for all she has been through in this period. It has all got so big, something which really should not have happened.”\nIn a statement released early on Tuesday, Hermoso said: “We have spent weeks, months, searching for protection from inside the RFEF that never came. The same people who ask us to trust them are those who today announced a squad with players who asked NOT to be called up.\n“The players are certain that this is yet another strategy of division and manipulation to intimidate and threaten us with legal repercussions and economic sanctions. It is more irrefutable proof that shows that even today, nothing has changed.”\nWhen asked during Monday’s press conference why Hermoso had not been called up, Tome said: “We believe the best way to protect her in this squad is this way.”\nHermoso, who has returned to club football with Mexican side Pachuca since the World Cup, questioned who she needed protecting from: “Let’s be clear. A claim was made today stating that the environment within the federation would be safe for my colleagues to rejoin, yet at the same press conference it was announced that they were not calling me as a means to protect me. Protect me from what? And from whom?”\nAdvertisement\nSo what’s next for the Spain team?\nYesterday, the RFEF published a statement outlining its plans for the women’s team’s next two fixtures this Friday and next Tuesday.\nThey said the group would be spending Wednesday in Oliva, near Valencia, for preparation and training. They would then return to Madrid before departing at around 10am local time tomorrow (Thursday) for Gothenburg, where they are due to play Sweden on Friday at 6.30pm local time.\nThe RFEF said the squad will fly from Sweden to Seville airport after that match, then on Sunday travel on to Cordoba, a two-hour drive to the north east, “to continue preparing” for their second Nations League match of this international break there against Switzerland on Tuesday evening.\nSpain squad in full\nGoalkeepers: Misa Rodriguez (Real Madrid), Enith Salon (Valencia), Cata Coll (Barcelona)\nDefenders: Ona Batlle (Barcelona), Olga Carmona (Real Madrid), Maria Mendez (Levante), Irene Paredes (Barcelona), Laia Aleixandri (Manchester City), Oihane Hernandez (Real Madrid), *Maria Leon (Barcelona)\nMidfielders: *Patri Guijarro (Barcelona), Teresa Abelleira (Real Madrid), Aitana Bonmati (Barcelona), Alexia Putellas (Barcelona), Maria Perez (Sevilla), Rosa Marquez (Real Betis)\nForwards: Athenea del Castillo (Real Madrid), Inma Gabarro (Sevilla), Esther Gonzalez (Gotham FC), Mariona Caldentey (Barcelona), Eva Navarro (Atletico Madrid), Lucia Garcia (Manchester United), Amaiur Sarriegi (Real Sociedad)\n* Leon and Guijarro have been allowed to withdraw “for reasons of lack of morale and personal discomfort”.\n(Top photo: Oscar J. Barroso / AFP7 via Getty Images)",
  "word_count": 2628,
  "scraped_at": "2026-02-14T12:04:11.515325"
}