{
  "article_id": "a97f15df1165",
  "url": "https://www.marshallindependent.com/news/local-news/2025/01/looking-back-on-2024/",
  "title": "Looking back on 2024 | News , Sports , Jobs - Marshall Independent",
  "date": "20250102T033000Z",
  "domain": "marshallindependent.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Looking back on 2024\nTop stories included Yelloh’s farewell, sports victories and local developments\nMARSHALL — The year 2024 was the end of an era for a longtime Marshall business, as Yelloh, formerly Schwan’s Home Delivery closed down for good. In November, people gathered to watch a group of yellow delivery trucks make one last farewell drive around Marshall.\nLocal Yelloh drivers said the trip was emotional. Schwan’s trucks had delivered frozen foods around the country for more than 70 years.\nBut the past year also brought a lot of other changes to the area, including a the arrival of a few new businesses in Marshall, and the start of construction on a planned new chemical plant that would make use of sugars produced by Archer Daniels Midland in Marshall. Supporters of Minneota High School football were also celebrating this year, as the Vikings took their place as state champions.\nHere are the Independent’s top 10 stories of 2024:\n1. Yelloh closes\nFood delivery company Yelloh, formerly Schwan’s Home Delivery, announced it would be winding down and ceasing all operations in the fall of 2024. The news came after nationwide layoffs and cuts to the company’s service area in 2023. Company spokespeople said the business faced “insurmountable challenges,” including supply chain disruptions and shifts toward digital shopping.\nThe home delivery business split off from Schwan’s Company after Schwan’s was purchased by Korean firm CJ CheilJedang in 2018. In 2022, Schwan’s Home Delivery rebranded as Yelloh.\nOn Nov. 14, Marshall residents got a chance to say goodbye to the iconic yellow delivery trucks, as a group of Yelloh drivers decided to have a truck parade through the city.\nYelloh driver John Swanson said they saw “nothing but smiles” from people along the way. “We saw one person with a big ‘Thank you’ sign,” he said.\nWhile Yelloh was closing down, the parent Schwan’s Company is still operating in Marshall. During an economic development tour in Marshall in October, Marshall EDA Director Lauren Deutz said Schwan’s still had 650 employees in Marshall, and was also planning to build a facility in Sioux Falls.\n2. Minneota football team celebrates second state threepeat\nThe Minneota High School football team claimed its third straight state Class A championship title against Springfield in November. The Vikings also made history – it was the first time in 52 years of the Prep Bowl that there had been the same championship pairing for three consecutive seasons.\nThe 2024 championship gave Minneota its second threepeat, and its 10th overall state title.\n“When you look back at what this group has accomplished … That’s kind of crazy,” Minneota head coach Chad Johnston said. “They put themselves in part of an elite group now, and they put themselves in the record books. It’s very impressive, I’m very proud of these kids.”\nThe night of the Vikings’ victory, the team got an escort back into Minneota from local first responders, to kick off celebrations for the threepeat. The sidewalks outside the school were crowded with families and supporters, before everyone moved into the gymnasium for a ceremony.\n“Being able to come back to a town like this with the community and support we have, it’s pretty great knowing that everyone stands by us,” senior quarterback Brody Larson said. “Not a lot of teams get to experience this, let alone three times.”\n3. One city, two Kwik Trips\nThe news that Kwik Trip would be opening a gas station and convenience store in Marshall in 2024 sparked a lot of anticipation from local residents. But the company wasn’t done after it opened a location on East College Drive in January. A second Kwik Trip opened at the former Cattoor gas station site at the corner of West Main Street and Highway 59 in November.\nThe excitement for Kwik Trip’s opening was high for both stores. Fans of the chain were waiting early in the morning to buy gas or food as soon as the stations opened. Some customers said having the second Kwik Trip location opened up more options for residents on the west side of Marshall.\n“We’re happy to be in Marshall,” said Dean George, real estate development manager for Kwik Trip. “I think the community has received us very well.”\n4. Aquatic Center breaks ground, undergoes redesign\nIn 2024, celebrations at Marshall’s Sounds of Summer festival included a groundbreaking and name reveal for the city’s planned new aquatic center, The Splash! While Marshall area community members put a lot of support behind the project, the aquatic center project faced some setbacks not long after the groundbreaking.\nIn late August, the city opened construction bids for the new aquatic center, and found they came in at more than $5 million over an engineer’s estimate.\nBase bids submitted for the project ranged from about $22.37 million, to $24.4 million. In 2023, Marshall voters had approved a proposal to extend the city sales tax to raise up to $18.37 million in funds for a new aquatic center.\nEngineers and a construction management firm went back to the drawing board this fall, to try and reduce costs for the aquatic center. In December, the Marshall City Council approved a new scaled-back design concept for the project. The new design would reduce the overall square footage of the pool area by about 20%, and make changes like reducing the number of lanes in the lap and diving pool.\n5. Broadmoor closure announcement sparks concerns\nThis fall, the owners of the only manufactured home park in Marshall announced that they intended to shut the park down later this year. The news brought a crowd of people, including Broadmoor Valley residents, to a Marshall City Council meeting in December.\nPaul Schierholz, of Schierholz and Associates, said factors like the cost of making updates to roads and infrastructure at Broadmoor Valley were why he would be closing down the mobile home park. At the same time, Broadmoor Valley residents urged the city to intervene to help them keep their homes.\n“We are in a desperate situation,” said Deb Ertl, a member of the Broadmoor Valley residents association.\nTo comply with state laws on closing mobile home parks, the city of Marshall set a date for a public hearing on the closure announcement. At the hearing, the city will need to appoint a neutral third party to serve as an arbiter for some of the decisions that would need to be made in the park’s closure process.\nDisputes between residents of Broadmoor Valley and the owners of the park have been ongoing for the past several years. In 2021, the Minnesota Attorney General’s Office sued Schierholz, alleging that he had failed to maintain the streets and park to state standards. Trial dates in the case have been set for January and February 2025.\n6. Standoff in Marshall\nLaw enforcement closed off an area around part of Marshall’s Main Street in April 2024, in a standoff where a Marshall man allegedly fired a gun at police. Paul Kenneth Laumann, 63, was taken into custody after being barricaded inside a residence on East Main Street for several hours.\nMarshall Police said they were called to a residence on the 100 block of East Main Street to assist with a family matter. The incident escalated into a standoff, and the MPD and the Lyon County Sheriff’s Office stopped traffic and evacuated the area around the home.\nThe Marshall Area YMCA served as a temporary shelter for neighbors evacuated from their homes. Red Cross volunteers provided food and personal care items for people, as well as blankets and cots to rest on as the night went on.\nThe Brown, Lyon, Redwood and Renville Emergency Response Unit was also activated during the incident.\nAfter negotiations with Laumann failed, law enforcement said they attempted to get him out of the house by using chemical agents. Laumann was taken into custody without injury.\nAt his first appearance in Lyon County District Court, Laumann was charged with attempted murder, assault with a dangerous weapon, making terroristic threats, and reckless discharge of a firearm.\n7. Solugen breaks ground for new chemical plant\nA Texas-based company broke ground for a planned 500,000 square-foot low-carbon chemical plant in Marshall last spring. In an April program, executives of Solugen bragged the new plant would be positive on both an economic and environmental level.\nSolugen co-founders Gaurab Chakrabati and Sean Hunt said the new Bioforge plant will take corn products from the Archer Daniels Midland plant in Marshall, and use them to make chemicals used in a variety of industries.\nChakrabarti said Solugen’s goal is to find a lower-carbon, sustainable way to produce chemicals.\n“That’s where we put all of our focus, is figuring out how to decarbonize the chemicals industry,” he said.\nThe site was planned to have 50 to 60 employees, but there would also be roughly 150 to 200 construction workers building the plant, Solugen founders said.\nThe project received a $213 million federal loan, as well as an additional $15 million in funding from the Minnesota Department of Employment and Economic Development.\nGroundwork for the Solugen site in Marshall started in 2024, but commissioning of the plant is not anticipated to happen until 2027.\n8. Bot Appliance owners pass torch to Karl’s\nA longtime downtown Marshall business changed hands in 2024. After 41 years with Bot Appliance, Furniture & More, owner Terry Haas said he was selling the business to Karl’s TV, Appliance & Furniture. The South Dakota-based chain opened at the Bot Appliance location on Main Street in September.\nTerry and his wife Karol said they were grateful for the support area communities had shown them over the years.\n“It’s exciting, but also it’s bittersweet,” Karol Haas said of the change. “My customers are my friends.”\nTerry Haas said his work at Bot Appliance started out with a part-time job back in 1983. Over time he went from making deliveries, to working in service, sales, and finally buying the business.\nAs Haas thought about retirement, he wanted to make sure the business could keep going. When Karl’s reached out about buying Bot Appliance, it seemed like a good fit.\n“They’re a good company, and good people,” he said.\n9. Community remembers Jean Replinger\nArea community members remembered the legacy of Jean Sanford Replinger this fall. Replinger, a longtime Marshall resident and Southwest Minnesota State University professor, died in November at the age of 96.\nReplinger taught health and physical education at SMSU from 1969 until 1996 – but her impact reached far beyond the university campus. In 1965, Replinger helped create the first Outward Bound program for women in the western hemisphere.\nOver the course of her life, Replinger not only mentored students and encouraged outdoor activities, she supported many causes including Ski for Light, a nonprofit that teaches visually- or mobility-impaired people to cross-country ski, and the Ernest C. Oberholtzer Foundation. The Foundation maintains Mallard Island in Rainy Lake in northern Minnesota, and hosts programs for natural science, the arts, and Ojibwe language and traditions.\nOn a local level, Replinger was also involved with the Marshall Area Fine Arts Council, and was a supporter of the Southwest Minnesota Orchestra.\nIn recent years, Replinger was recognized for her work as a leader and educator. The first Outward Bound class of women from 1965 was the subject of a documentary, called “Women Outward Bound.” In 2018, Replinger was presented the Women Who Dared Award.\n“She always knew that if you get people outside, interacting with nature … you were going to kind of blossom,” said Alicia Johnson, a friend and former student of Replinger at SMSU.\n10. Marshall solar farm goes online\nPart of the city of Marshall’s electricity will now be generated right in town, with the help of a 10-megawatt solar farm built in 2024. Construction on the project began in 2023 on about 50 acres of land near North Seventh Street and Lyon County Road 33 in Marshall.\nMarshall Municipal Utilities general manager David Schelkoph said the solar farm was a roughly $40 million project. About $25 million of that cost was lithium ion batteries, that will store some of the electricity generated by the solar panels for times when the sun isn’t shining.\nThe solar farm project was undertaken by Missouri River Energy Services (MRES). MRES is one of two major providers of electricity for Marshall Municipal Utilities, Schelkoph said. The other provider is the Western Area Power Administration (WAPA), which is in charge of hydroelectric dams on the Missouri River system, he said.\nSchelkoph said MRES already owns nine wind turbines located southwest of Marshall, but they were adding a solar farm for a couple of reasons. Solar panels had a relatively low cost to install, and would also help utilities meet Minnesota’s state-mandated goals for carbon-free energy.\nAll the electricity generated by the Marshall solar farm will be used in the city of Marshall, Schelkoph said.",
  "word_count": 2153,
  "scraped_at": "2026-02-14T13:32:11.990003"
}