{
  "article_id": "a98575f0cd20",
  "url": "https://www.rotowire.com/mma/article/rotowire-mma-expert-picks-ufc-312-main-card-89940",
  "title": "UFC 312 Main Card Expert Picks",
  "date": "20250206T190000Z",
  "domain": "rotowire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UFC 312 Main Card Expert Picks\nTitles in the men's middleweight and women's strawweight divisions headline Saturday's card in Sydney, Australia.\nAs a reminder, the following selections are purely picks. If you're looking for betting or fantasy-specific breakdowns of these fights, check out the following articles on RotoWire:\nUFC 312 DraftKings Preview\nUFC 312 Betting Preview\nUFC 312 Fight by Fight Breakdowns\nUFC 312 Multi-Site DFS Preview\nWe also have a MMA DFS Lineup Optimizer to try if you're looking to try out different combinations of fighters or generate multiple lineups, plus UFC 312 odds from every major sportsbook.\nTHE PICKERS\nJon Litterine: RotoWire lead MMA beat writer and scribe for our weekly DrafKings preview. Lead analyst on the RotoWire MMA Podcast. Follow him on Twitter at @JonLitterine.\nJake Letarski: RotoWire.com Operations Manager, plus MMA and NCAA Hoops Senior Editor. Host on the RotoWire MMA Podcast and guest on the RotoWire Fantasy Football Podcast. Follow him on Twitter at @RotoJake.\nChris Olson: Contributor at RotoWire to \"Fight IQ, presented by RotoWire,\" as well as The MMA Mashup, DFS Baseball, a MMA gambling columnist and fight recaps. Follow him on Twitter at @RealChrisOlson.\nJoe \"SunTszu\": Known more commonly by his Twitter handle @SunTszu, Joe is a Hedge Fund Executive by day and high-volume DFS player by night. He is a 2x \"Bracket Challenge\" & \"Gotham qualifier. You can also find him as one of the original contributors of \"Fight IQ, presented by RotoWire,\" a DFS-centric video breakdown. He is also a co-creator of the \"Creating Alpha in DFS\" podcast.\nCole Shelton: Cole Shelton is a full-time sports writer focusing on MMA. His work has appeared on BJPenn.com, CBC Sports, Sports Betting Dime and Blue Jays Nation. He currently pens the MMA Best Bets column on RotoWire. Follow him on Twitter at @ColeShelton91.\nDrake Burden: Drake is a proven DFS winner with multiple four-figure paydays under his belt. He took an interest to writing MMA during the pandemic and is active in various Discords and other social media communities. Follow him on Twitter at @DBurdz.",
  "word_count": 343,
  "scraped_at": "2026-02-14T13:41:43.387965"
}