{
  "article_id": "a98d9e1b0ca9",
  "url": "https://www.beckershospitalreview.com/hospital-management-administration/rising-stars-100-healthcare-leaders-under-40-2025/",
  "title": "Rising stars : 100 healthcare leaders under 40 | 2025 - Becker Hospital Review",
  "date": "20250831T171500Z",
  "domain": "beckershospitalreview.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A new generation of bold, innovative healthcare leaders is making healthcare more accessible, affordable and seamless for patients everywhere. These rising professionals, serving in diverse roles across the industry, share a common goal of transforming healthcare for the better.\nBecker’s is excited to spotlight these emerging leaders, all 40 years old or younger this calendar year, who have quickly risen through the ranks of their organizations. With their drive, creativity, and forward-thinking vision, they’re poised to make a lasting impact within their institutions and across the healthcare landscape as a whole.\nNote: Becker’s Healthcare developed this list based on nominations and editorial research. This list is not exhaustive, nor is it an endorsement of included leaders or associated healthcare providers. Leaders cannot pay for inclusion on this list. Leaders are presented in alphabetical order. We extend a special thank you to Rhoda Weiss for her contributions to this list.\nContact Anna Falvey at afalvey@beckershealthcare.com with questions or comments.\nPatrick Adams. Vice President and Chief of Staff at Fairview Health Services (Minneapolis). Mr. Adams oversees enterprise financial portfolios exceeding $4 billion, including over $3 billion in labor costs and $1billion in supply expenses, driving sustained savings through premium pay redesigns and supply utilization improvements that deliver over $50 million annually. As chief of staff to the CEO, he has led strategic initiatives such as merger integrations, facility planning and service mix optimization, efforts that have resulted in over $100 million in capital investment and a $30 million increase in net operating income in the first year. In his previous role as vice president of the system operations center, Mr. Adams restructured staffing, scheduling and patient placement across 10 hospitals, achieving a $1.5 million budget improvement and reducing clinical service diverts by more than 30%. He also spearheaded the implementation of unified staffing systems and Epic tools to optimize patient flow, enhancing efficiency and access to care. Beyond his operational leadership, Mr. Adams serves as a lecturer in the University of Minnesota’s top-ranked Master of Health Administration program, teaching healthcare strategy.\nAbdou Bah. Chief Health Equity Officer and Senior Vice President of Medical Management at EmblemHealth (New York City). Mr. Bah oversees quality improvement, care management, utilization management, pharmacy and clinical programs for EmblemHealth, translating data into targeted interventions that improve access and outcomes. Under his leadership, the organization earned the 2025 Pharmacy Quality Alliance “Quality Improvement Award” after achieving a 38% improvement in key pharmacy quality metrics for its dual-eligible Medicare D-SNP plan and a 37% improvement across other Medicare lines. He spearheaded the 2024 launch of the community diabetes wellness program in the Bronx, offering free A1C screenings, prevention workshops and nutritional counseling to the public. In 2023, he guided EmblemHealth to become the first insurer in New York State to earn National Committee for Quality Assurance health equity accreditation across three product lines. Mr. Bah also created New York’s first pharmacy value-based arrangement for chronic disease management, enabling over 4,000 network pharmacies to provide A1C and blood pressure screenings and coordinate follow-up care. His initiatives have set a regional benchmark for equity in managed care and strengthened the organization’s ability to address chronic conditions while closing care gaps.\nKhelsea Bauer. President and CEO at AdventHealth DeLand (Fla.). Ms. Bauer leads AdventHealth DeLand, a 170-bed acute care hospital serving Florida’s West Volusia County. She was named CEO in 2025, becoming one of the youngest executives in the Altamonte Springs, Fla.-based AdventHealth system to hold this position. She is advancing several expansion projects, including an 18-bed progressive care unit and major upgrades to the cardiac catheterization lab and MRI services, all while addressing emergency department capacity and leading long-term growth planning. The hospital completed 100 robotic surgeries within months of launching the program in late 2024. Previously, she served as COO of AdventHealth New Smyrna Beach (Fla.), where she launched the hospital’s first robotic surgery platform, transitioned cancer services in-house, expanded the local physician network with more than 10 specialists and collaborated with city officials on homelessness response efforts. Ms. Bauer is a first-generation Peruvian-Korean American and an advocate for mentorship and inclusion. She chairs the AdventHealth East Florida Division diversity forum, mentors women leaders and serves on several local boards. In 2024, she was named a “Top 40 Under Forty” honoree by the Daytona Beach News-Journal.\nShane Bedward. President and CEO at AdventHealth Dade City (Fla.). Mr. Bedward leads operations, strategic planning, physician relations and workforce advancement at AdventHealth Dade City, with a focus on building a strong organizational culture and improving community health through outreach, partnerships and education. Under his leadership, the hospital has earned numerous accolades, including the American College of Cardiology Accreditation for chest pain, heart failure and cath lab, Leapfrog safety grade “A” for 2025, and American Nurses Credentialing Center “pathway to excellence” designation. The organization has also been recognized as a U.S. News & World Report-ranked facility from 2024-2025, received multiple “Best of the Best” honors from the Tampa Bay Times, and achieved ECRI’s 2023 “Safety Excellence Award” and more. Mr. Bedward’s tenure has strengthened behavioral health initiatives and expanded access to high-quality care, while ensuring operational excellence across clinical and support services.\nBritney A. Benitez, MSN, RN. Vice President and CNO at AdventHealth Orlando (Fla.). Ms. Benitez leads more than 5,500 nurses and team members at AdventHealth Orlando, a 1,400-bed quaternary care hub. Since assuming the role in 2022, she has reduced nurse turnover by 2% year over year, increased employee engagement by 4% and eliminated the need for agency nursing. She launched the largest shared governance structure in the organization’s history, uniting 89 departments and engaging over 300 frontline participants. Under her leadership, the campus achieved a 200% increase in certified nurses. Ms. Benitez previously served as executive director of nursing, overseeing more than 900 nurses across multiple service lines, and as director of nursing for clinical operations, where she spearheaded critical changes that enhanced patient care and organizational efficiency. She is a board member of the AdventHealth University Foundation and her upcoming priorities include achieving Magnet accreditation and building the workforce to support a new 14-story tower.\nRebecca Boswell, PhD. Director of the Princeton Center for Eating Disorders and Director of Psychiatric Services at Penn Medicine Princeton Health (Philadelphia). Dr. Boswell leads Penn Medicine Princeton’s nationally recognized eating disorders program and oversees psychiatric services, advancing clinical excellence, equity and integrated behavioral health care. Since joining Penn Medicine in 2021, she has expanded access to evidence-based treatment, launched research on GLP-1 medications and global care systems, and implemented training programs to build the next generation of specialists. She also spearheaded systemwide initiatives embedding psychological care into oncology, gastroenterology, sleep medicine and other specialties, while promoting gender-affirming and trauma-informed practices. A clinical psychologist, Dr. Boswell has authored widely cited research in PNAS, Clinical Psychology Review, and the International Journal of Eating Disorders. She is an elected member of the American Psychological Association’s policy and planning board, visiting research faculty at Princeton University, and clinical associate professor of psychiatry at the University of Pennsylvania’s Perelman School of Medicine. Recognized with the 2023 YWCA “Princeton Tribute to Women Award”, Dr. Boswell is a leading national voice in advancing equitable, high-quality mental healthcare.\nNikhil Buduma. Co-Founder and Chief Scientist at Ambience Healthcare (San Francisco). As co-founder and chief scientist of Ambience Healthcare, Mr. Buduma leads the end-to-end research and development of its clinical AI platform, directing a team of over 80 engineers, clinicians and researchers. Under his leadership, Ambience Healthcare became the first ambient-AI system to surpass board-certified physicians in ICD-10 coding accuracy by 27%, a milestone recognized by CNBC in May 2025. The platform, which delivers real-time documentation, coding, summaries and referrals across over 100 specialties, achieved a record-breaking 97.7 KLAS spotlight score and is deployed in leading health systems including Cleveland Clinic, San Francisco-based UCSF Health and Houston Methodist. Since founding Ambience in 2020, Mr. Buduma has driven adoption that saves clinicians hours per shift while improving coding integrity and operational efficiency. His earlier work includes developing one of the first AI triage chatbots at Remedy Medical and co-authoring Fundamentals of Deep Learning, a top-selling neural network textbook.\nChet Brauer. Associate Vice President of Strategic Initiatives and Strategic Planning at Advocate Health (Charlotte, N.C.). Mr. Brauer has played a central role in high-impact strategic projects at Advocate Health since 2020, including leading the Chicago South Side initiative that resulted in a $1 billion investment announcement. He oversees strategy development, operations, finance, government relations and community engagement for the transformational project, now focusing on activation, execution and performance management to achieve long-term goals. Previously, he contributed to the Illinois turnaround project, helping deliver over $120 million in savings to reverse a negative operating margin. His work in repositioning services, managing observation cases and addressing care variation has generated substantial financial benefits for the Midwest region. Mr. Brauer also serves on the Rewire 2030 strategy team, guiding systemwide strategic planning and supporting academic initiatives with Charlotte, N.C.-based Atrium Health Wake Forest Baptist.\nJenny Breunig. Vice President of Operations at Jefferson Washington Township (N.J.) Hospital. Ms. Breunig oversees operations for Jefferson Washington Township Hospital, a 286-bed acute care facility, while also leading regional service lines in heart and vascular, neurosciences, cancer, women and children’s services, and emergency medicine across New Jersey. From fiscal year 2024 to fiscal year 2025, she drove a 7.6% increase in admissions, a 3.4% rise in surgical volume and a 2% growth in emergency department visits, all while reducing premium pay by 3% and observation hours by 17%. She brought portable MRI technology to New Jersey for the first time, onboarded Jacksonville, Fla.-based Nemours Health to enhance the NICU program and secured funding for a third interventional bi-plane suite to expand cardiac care capabilities. With Ms. Breunig’s guidance, patient experience scores improved significantly, with an 18-point jump in “likelihood to recommend” in her first year, supported by the creation of the “Jefferson East Region Culture Team”.\nJake Brooks. President of SSM Health St. Joseph Hospital-St. Charles (Mo.) and SSM Health St. Joseph Hospital-Wentzville (Mo.). At just 34 years old, Mr. Brooks assumed leadership of two SSM Health campuses, overseeing a 329-bed acute care hospital, a 70-bed behavioral health facility, and more than 1,300 employees and 400 providers. He has driven significant expansion projects, including a 66,000-square-foot outpatient facility, a new ambulatory surgery center adding 2,500 cases annually and the acquisition of a surgical robot enabling over 300 robotic surgeries in its first year. Mr. Brooks secured funding to double the size of the Wentzville emergency department and launched the system’s only monoclonal antibody clinic, while expanding urgent care and pain management services. Under his direction, cardiovascular services in the region have grown substantially, nearly tripling surgical volumes within the academic platform and earning U.S. News & World Report recognition. His leadership has also helped reduce reliance on agency staff, lower turnover, improve patient satisfaction and more than double monthly outpatient visits. Mr. Brooks also serves on multiple local boards and actively shapes healthcare access and innovation in a rapidly growing market.\nJames F. Brown, MD. Assistant Vice President of Orlando (Fla.) Health and CMO of Orlando Health-Health Central Hospital (Ocoee), Orlando Health Horizon West Hospital (Winter Garden) and Orlando Health Reunion Village Emergency Department (Davenport). Dr. Brown oversees quality, safety and operational performance for two hospitals and a freestanding emergency department, driving evidence-based protocols, data-driven improvement and interdisciplinary collaboration. He founded both the physician leadership council and the surgical governance committee, initiatives that strengthened medical staff governance, standardized surgical safety and advanced best practices across multiple service lines. As executive champion for Orlando Health’s opioid outreach program, he has expanded navigator resources and medication-assisted treatment for opioid use disorder, addressing a critical public health challenge. Under his leadership, Orlando Health-Health Central earned five consecutive Leapfrog “A” grades, was named a Leapfrog “Top General Hospital” in 2023 and achieved the “Top Teaching Hospital” designation in 2024. He also spearheaded service line growth, including new colorectal and bariatric centers of excellence, while leading AI-driven analytics modernization to unify data and empower frontline decision-making. Dr. Brown is a board-certified emergency physician, active educator and accomplished classical pianist.\nSandhya Chandrasekhar. Assistant Vice President of Enterprise Analytics and Data Engineering at Memorial Hermann Health System (Houston). Ms. Chandrasekhar leads enterprisewide data and analytics strategy, driving large-scale transformation in how Memorial Hermann Health System harnesses data to improve care and operations. She has overseen analytics for major hospital openings, system mergers and EHR migrations spanning 17 hospitals and over 85 outpatient sites. A champion of self-service analytics, she has trained over 50,000 employees in analytics literacy, empowering teams to make data-driven decisions at every level. Her team’s innovative work has been featured at major industry conferences, reinforcing the system’s leadership in healthcare data and AI. Beyond Memorial Hermann, Ms. Chandrasekhar mentors through the Healthcare Data and Analytics Association and served as a volunteer director at Women Who Code, advocating for future tech leaders. She was recognized as one of CDO Magazine‘s “Global Data Power Women” for 2023.\nMeghan Clithero. Vice President and Facility Executive for Atrium Health Levine Children’s Hospital (Charlotte, N.C.). Ms. Clithero leads Atrium Health Levine Children’s Hospital, recognized by U.S. News & World Report for 17 consecutive years as one of the nation’s best children’s hospitals and ranked No. 1 in the state, tied for first in the Southeast and nationally ranked in 10 pediatric specialties. She spearheaded the launch of Levine Children’s hospital at home, an innovative program delivering multidisciplinary, hospital-level pediatric care in patients’ homes, reducing the need for inpatient stays while maintaining high-quality outcomes. Previously, she advanced maternal health equity as the vice president of the women’s service line’s Southeast region, introducing the “Drive to Thrive” mobile care unit to provide prenatal, postpartum and preventive women’s health services to underserved communities, regardless of ability to pay. Her leadership integrates strategy, public health and clinical operations to expand access and improve patient experience across multiple states. Recognized among Charlotte Business Journal’s “40 Under 40”, Ms. Clithero also serves on the board of the Charlotte Ballet.\nKevin Cullinan. President of CommonSpirit St. Anthony Hospital (Lakewood, Colo.). Mr. Cullinan leads operations, quality, safety and strategy at St. Anthony Hospital, a level 1 trauma and comprehensive stroke center that serves as the flagship of CommonSpirit’s Mountain Region. Under his leadership, nurse turnover has decreased significantly and overall vacancy rates have dropped, aided by his “Suits to Scrubs” initiative that embeds executives in frontline roles to boost engagement and retention. His focus on partnerships with physicians and community agencies has driven year-over-year growth in surgical volumes, admissions, emergency department visits and a reduction in average length of stay by over half a day, contributing to an increase in earnings before interest, taxes, depreciation and amortization. The hospital now provides over $120 million annually in community benefit while maintaining CMS 5-star and Magnet designations, as well as national recognition from Newsweek and Premier Inc. Mr. Cullinan also mentors future healthcare leaders through Cornell’s Master of Healthcare Administration capstone projects, recently guiding work on rural healthcare access. Beyond the hospital, he serves on multiple boards and remains active in his community as a volunteer youth soccer coach and elementary school volunteer.\nRebecca D’Amico. Chief of Staff to the CEO and Vice President of Strategy and Brand at Blue Cross Blue Shield Association (Chicago). Ms. D’Amico drives strategic alignment across 33 independent Blue Cross Blue Shield CEOs, impacting healthcare coverage for 118 million Americans in every zip code. She led the first-ever systemwide accountability initiative to improve member experience, resulting in a nearly double-digit advantage over national competitors in satisfaction and likelihood to recommend. Under her leadership, BCBS achieved five consecutive years of membership growth, contributed to a historically low U.S. uninsured rate, and implemented an outcomes-based contracting model for multimillion-dollar therapies through the Synergie Medication Collective. Her maternal health strategy reduced early elective deliveries by 60% and cesareans by 17% at Blue Distinction maternity care centers, while her national partnership with Boys and Girls Clubs of America aims to improve youth mental health for over 3 million young people by 2026. Her advocacy for working mothers has also led to expanded paid maternity leave at Blue Cross Blue Shield Association. Ms. D’Amico also serves as a board member for YWCA Greater Cleveland and as executive sponsor for BCBSA’s caregivers employee community.\nAlexis Davis, PhD. Chief Communications Officer at NYC Health + Hospitals/Kings County (Brooklyn, N.Y.). As the youngest member of the senior executive cabinet, Dr. Davis leads comprehensive communications strategy for one of New York City’s largest and most complex level 1 trauma centers, while also serving as interim department head of public affairs for South Brooklyn Health and Ruth Bader Ginsburg Hospital. She created and launched the first digital magazine in the entire NYC Health + Hospitals system, expanding it beyond Kings County to multiple hospitals, enhancing culture, transparency and eco-friendly communication. Her multi-platform strategy includes hundreds of educational videos, podcasts, symposiums and interactive campus displays, significantly improving staff morale, patient education and organizational visibility. She has developed micro-learning modules to train hospital teams in strategic communications and storytelling, empowering them to highlight medical innovations and frontline heroes. Dr. Davis also revitalized the community advisory board to strengthen civic partnerships, elevate patient voices and influence local health policy.\nKatherine Di Palo, PharmD. Senior Director of Transitional Care Excellence at Montefiore Health System (Bronx, N.Y.). Dr. Di Palo serves as the founding senior director of transitional care excellence at Montefiore, where she leads the strategic design and implementation of care transitions for patients with complex medical and social needs. She oversees an interdisciplinary team of nurse practitioners, pharmacists, navigators and physicians, coordinating care across inpatient, post-acute and ambulatory settings for more than 3,000 annual admissions. Thanks in large part to her work, Montefiore has achieved a 58% reduction in 30-day readmissions for heart attack patients, a 72% reduction for pneumonia patients and national benchmark performance in heart failure care. Dr. Di Palo has also spearheaded the integration of AI into transitional care, creating decision-support tools that improve real-time care delivery. A fellow of both the American Heart Association and the Heart Failure Society of America, she serves on national advisory panels shaping value-based quality standards while mentoring the next generation of clinician leaders. Her holistic approach addresses social barriers such as food insecurity and transportation alongside clinical care.\nChad Dilley. President at Ascension St. Vincent Carmel (Ind.). Mr. Dilley leads the 124-bed Ascension St. Vincent Carmel hospital, overseeing culture, quality, safety, growth and community engagement to ensure operational excellence. With more than 15 years in healthcare leadership, he has directed over $370 million in strategic capital projects and earned national recognition, including the American College of Healthcare Executives “Distinguished Service Award” and ACHE of Indiana’s “Platinum Service Award”. He is a fellow of the ACHE and has served as regent and board president for ACHE of Indiana, and in multiple community leadership roles. Under his guidance, the hospital has earned top honors such as Leapfrog “A” grades, Newsweek’s “America’s Best Maternity Hospitals” and multiple Healthgrades awards for patient safety, outstanding patient experience and surgical care excellence. A frequent presenter at national conferences, Mr. Dilley is also dedicated to coaching emerging leaders. Outside of work, he remains active in civic boards and his church’s children’s ministry.\nSara DiNardo. Vice President of Client Solutions at Phreesia (Wilmington, Del.). Ms. DiNardo oversees Phreesia’s client-facing teams, supporting more than 4,300 healthcare organizations and helping manage over 170 million patient visits annually. In the past year, she led 1,748 value-adding projects, reduced client go-live timelines by 20%, and contributed to a 9% growth in the company’s client base. Her teams implement and optimize digital solutions for patient intake, scheduling and revenue cycle management, ensuring they become integral to client workflows. Under her leadership, Phreesia has achieved consistently high client satisfaction and retention rates, while streamlining check-in processes to ease provider burden and improve the patient experience. Known for her ability to balance big-picture strategy with day-to-day execution, she leads a team of hundreds with a steady, solutions-focused approach. Ms. DiNardo also mentors emerging leaders and sponsors innovation initiatives that enhance client engagement and operational efficiency.\nJames R. Engler, Esq. Chief of Staff to the CEO at Jefferson (Philadelphia). Mr. Engler serves as the principal advisor to Jefferson’s CEO, driving execution of strategic initiatives and ensuring coordination across a complex, multi-entity health system. In his first year, he played a pivotal role in completing the acquisition of Lehigh Valley Health Network, creating one of the nation’s top 15 nonprofit health systems with 65,000 employees, 32 hospitals and more than 700 care sites. He also oversaw the opening of the 19-story, 462,000-square-foot Honickman Center, a multi-specialty outpatient facility with over 300 exam rooms, advanced surgical suites, and comprehensive diagnostic services. Mr. Engler helped lead Jefferson’s Bicentennial, dubbed “#Jefferson200”, which surpassed its goal of 200,000 volunteer service hours, ultimately delivering over 212,000 hours through 1,658 programs and raising more than $1.5 million for the bicentennial fund. His prior public service includes seven years in Philadelphia’s mayor’s office, where he was instrumental in passing the nation’s first soda tax, generating $263 million for early education and anti-poverty programs, and guiding the city’s Covid-19 workforce vaccination policies.\nSham Firdausi. CFO of ScionHealth-Watertown (Wis.) Regional Medical Center. As CFO of Watertown Regional Medical Center, Mr. Firdausi has led a comprehensive transformation of financial and operational performance, introducing his proprietary “Revenue Cycle 101” framework to standardize front-, middle- and back-end processes and embed shared accountability across the enterprise. He has streamlined supply chain operations, enhanced facility readiness and equipped service line leaders with real-time insights through a “business within a business” model. Drawing on prior leadership roles at Centene, UnitedHealth Group, CVS Health and Chicago-based Northwestern Medicine, Mr. Firdausi brings a unique perspective from both the provider and payer sectors. Under his leadership, the hospital has maintained high clinical quality, earning the Healthgrades “Outstanding Patient Experience Award” in 2023 and 2024, Leapfrog “A” hospital safety grades and more. Beyond his hospital role, Mr. Firdausi serves on the board of Chicago-based Trilogy Behavioral Health and as an entrepreneur-in-residence for Yale Ventures, advising on healthcare innovation and scalable growth strategies.\nTyler Fitch, MD. CMIO at OSF HealthCare (Peoria, Ill.). Dr. Fitch, a transformational CMIO with a powerful combination of clinical expertise and deep informatics knowledge, drives strategic initiatives that elevate patient care, optimize provider workflows and unlock the full potential of healthcare IT. He led the growth of the OSF physician builder program from five to 18 physician builders in just two years. This team helps reduce sepsis mortality and has eliminated over 1 million unnecessary clinical alerts. Dr. Fitch has overseen more than 10 major physician adoption programs tied to EHR activations, supporting thousands of clinicians through complex change management. As co-leader of the OSF Ministry generative AI initiative, he established enterprisewide safety measures and educated over 20,000 employees on responsible AI use, helping to deploy AI-powered ambient documentation and pilot next-gen tools. A national thought leader, Dr. Fitch is a frequent speaker and media contributor on the future of AI in healthcare.\nJohn Fryer. Chief Growth and Corporate Development Officer at Lumeris (St. Louis). Mr. Fryer leads enterprise strategy, national expansion and innovation at Lumeris, overseeing partnerships that manage over $13 billion in medical spend and serve more than two million members. His leadership has helped generate $2.5 billion in recurring revenue and $2 billion in medical cost savings while expanding operations across 12 markets. In 2024, he secured a landmark partnership with Evanston, Ill.-based Endeavor Health, bringing 500,000 patients into risk-bearing models, and launched a systemwide ambulatory care initiative spanning hundreds of clinics and thousands of providers. He played a central role in creating the “primary care as a service” category, partnering with Google Cloud, Wolters Kluwer and MIT CSAIL to integrate AI solutions that increase capacity, automate next-best actions and reduce administrative burden. Mr. Fryer has also raised more than $500 million in capital to fuel growth and innovation, while co-founding the AI in healthcare workgroup to guide responsible AI adoption. He is also a fellow of both the American College of Healthcare Executives and the Nashville Healthcare Council, and serves as an adjunct professor at Johns Hopkins University.\nWilson Gabbard. Vice President of Quality and Condition Management at Advocate Health (Charlotte, N.C.). Mr. Gabbard leads strategy for ambulatory quality improvement, condition management and clinical risk adjustment across Advocate Health’s medical group and population health programs, with the goal of achieving national top-decile performance. Under his leadership, the organization realized a more than 72% improvement in closing care gaps, resulting in an additional 150,000 care opportunities addressed for patients. A fellow of the American College of Healthcare Executives since 2019, he also contributes nationally as a member of the National Association of Accountable Care Organizations quality committee and has served as an advisor to the Institute for Accountable Care. Mr. Gabbard’s work ensures alignment between clinical documentation, quality measures and population health initiatives, improving both patient outcomes and organizational performance.\nOliver Galicki. Vice President of Clinical Solutions at Memorial Hermann Health System (Houston). Mr. Galicki led the largest digital transformation in Memorial Hermann’s 117-year history, a $700 million Epic EHR transition, delivering the project more than $100 million under budget while replacing 40-plus applications and maintaining a 98%-plus IT staff retention rate. His leadership improved patient engagement, with over 545,000 MyChart activations and nearly 298,000 logins in March 2025 alone, and enabled the secure exchange of more than 33 million patient records across all 50 states and internationally. Operational outcomes included increased reimbursement through more accurate documentation, revenue cycle performance in the top 34% nationally for pre-service collections, and charges and payments exceeding baseline. Mr. Galicki’s career includes IT leadership roles at Roanoke, Va.-based Carilion Clinic and Slidell (La.) Memorial Hospital, where he drove enterprisewide technology upgrades, Epic implementations and enterprise resource planning modernizations. He also serves on the GE Healthcare medical advisory board and the Healthcare Information and Management Systems Society national professional certification board.\nNicole George, PhD, RN. Vice President and Associate CNO at Press Ganey (South Bend, Ind.). Dr. George partners with health systems across the U.S. and globally to address critical nursing challenges, including staffing, resilience and leadership development. She leverages Press Ganey’s real-time listening platforms and integrated reporting systems to help organizations strengthen nurse engagement, improve patient outcomes and streamline Magnet recognition program applications through automated reporting and dashboards. Previously, at the American Nurses Credentialing Center, she played a pivotal role in guiding CNOs nationwide toward Magnet designation, shaping program strategy and internal policy. At Press Ganey, her evidence-based interventions and advanced analytics help predict turnover, identify engagement opportunities and drive sustainable improvements in nursing practice environments. An accomplished scholar, she earned the “John P. McGovern Chair in Nursing Award” and has published extensively in peer-reviewed journals. Dr. George is also a sought-after national speaker and mentor.\nAlec Grabowski. President of OSF HealthCare Saint Anthony Medical Center (Rockford, Ill.). Mr. Grabowski brings over 15 years of senior leadership experience in both nonprofit and for-profit healthcare, with nearly a decade at the CEO, COO or vice president level in highly competitive markets. He has driven cultural, financial, quality and community perception turnarounds, expanded clinical services and increased market share while leading more than $300 million in construction projects. Mr. Grabowski notably guided Lake Norman Regional Medical Center in Mooresville, N.C. through one of the most highly contested anti-trust health system mergers with Winston-Salem, N.C.-based Novant Health and its subsequent successful transition to Durham, N.C.-based Duke University Health System. His leadership spans community, tertiary and academic-affiliated medical centers, where he has forged strategic partnerships and delivered sustainable operational improvements. Currently overseeing market operations for OSF Saint Anthony Medical Center, a regional referral and level 1 trauma center, he also serves on the board of the OSF Saint Anthony nursing school.\nDylan Graetz, MD. Director of the St. Jude Global Culture and Communication Program at St. Jude Children’s Research Hospital (Memphis, Tenn.). Dr. Graetz sees patients and leads the St. Jude Global programs that improve communication practices and culturally aware patient-centered care for pediatric oncology patients. Her work supports St. Jude Global in ensuring that children have access to quality care and treatment in more than 70 countries. Her organization studies interactions between patients, families and their healthcare teams to understand how those exchanges impact cancer care in global settings. Dr. Graetz has studied childhood cancer-associated stigma in Zimbabwe, Jordan and Guatemala. The data obtained from her studies are now being used to develop a quantitative way to assess stigma worldwide and mitigate this impediment to quality care. Her recent research on these topics have been published in the journals Lancet Child & Adolescent Health, Cancer, Cancer Medicine, Global Qualitative Nursing Research, Frontiers in Oncology, Pediatric Blood & Cancer and JCO Global Oncology. Most recently, Dr. Graetz was awarded the “Conquer Cancer Young Investigator Award” from American Society of Clinical Oncology.\nDanielle Griggs, PharmD. Chief Pharmacy Officer for UVA Health (Charlottesville, Va.). Ms. Griggs leads UVA Health’s pharmacy enterprise, overseeing 23 licensed pharmacy locations, more than 500 employees, a $650 million operating budget and $2.5 billion in patient revenue across hospitals, ambulatory clinics, infusion centers, retail and specialty services. She developed the department’s first strategic plan, aligning pharmacy operations with the health system’s mission and driving over 40% growth in pharmacy revenue while maintaining fiscal discipline. Under her guidance, UVA Health launched the Pharmacy Central Services Center, set to open in 2026, which will centralize automated fulfillment, call center operations, supply management and 340B compliance. She has expanded the ambulatory pharmacy network, doubling centralized prescription fulfillment capacity and increasing patient access and convenience. Recognized with the 2025 “Distinguished Alumni Award” from the University of Kentucky College of Pharmacy, Dr. Griggs also led UVA Health to earn the 2024 “High-Value Pharmacy Award” from Premier, Inc. for innovation, operational excellence and mission-driven care. Dr. Griggs has held leadership roles with VCU’s School of Pharmacy, Vizient and the American Society of Health-System Pharmacists.\nDelphine Groll. Co-Founder and COO at Nabla (Brooklyn, N.Y.). Ms. Groll leads product direction, operational execution and adoption strategy for Nabla’s AI platform, now used by over 85,000 clinicians across 130 organizations and supporting more than 20 million encounters annually. She designed a physician-led adoption model that bypasses procurement delays, enabling immediate clinical use and driving systemwide rollouts at institutions such as Denver Health and University of Iowa Health Care in Iowa City. Under her leadership, the platform expanded to 35 languages, incorporated safeguards against gender bias, and implemented accuracy and reliability systems that measure performance and reduce hallucination risk. In 2025, she directed operational strategy for Nabla’s $70 million Series C funding round, securing resources for expansion into nursing and inpatient care tools and advancing development toward a screenless, agentic AI model. Her work has improved documentation, coding and EHR workflows, delivering measurable gains in efficiency, clinician satisfaction and financial return. Committed to equity in leadership, she has built a leadership team that is 55% women. She also mentors early-stage founders and promotes women in senior technical roles.\nAnnaBeth Guillory. Vice President of Clinical Operations at Ochsner Baton Rouge (La.). Ms. Guillory oversees clinical strategy, daily operations and patient experience for cancer, surgery, pediatrics, women’s services and gastroenterology, leading teams to deliver high-quality, efficient and financially strong care. She played a pivotal role in launching the New Orleans-based Ochsner Health and Houston-based MD Anderson Cancer Center partnership in Baton Rouge in June 2023, which drove a 34% increase in patient volume within a year. Committed to expanding access, she co-developed the Jag Mobile in partnership with Southern University, bringing cancer screenings and health education to underserved communities while providing training opportunities for nursing students. Ms. Guillory also created “Massages and Mammos,” a unique annual event transforming mammogram appointments into a positive, community-focused experience for women. Beyond healthcare, she is an entrepreneur, co-founding Blush Beauty and Blowdry Bar and launching BeautyFindr, a mobile app supporting women entrepreneurs in the beauty industry. She was also recognized as one of Baton Rouge Business Report‘s “40 under 40” for 2023.\nMatthew Hanauer, PhD. Senior Director of Data Science at MedeAnalytics (Richardson, Texas). Across his career, Dr. Hanauer’s work has helped discover tens of millions of dollars in healthcare savings through enterprise AI initiatives, including causal inference models identifying millions of dollars in population health management savings. He helped developed an agentic genAI healthcare advisor and retrieval-augmented generation-based rules conflict tools that reduced manual labor by orders of magnitude and pioneered a medical coding embedding approach that contributed to continued improved model accuracy. At MedeAnalytics, his leadership has been instrumental to implementing machine learning standards and launching multiple, scalable AI products. Dr. Hanauer has championed AI projects that have created machine learning models for hepatocellular carcinoma, chronic conditions and denial predictions that revealed additional millions of dollars in savings. His work includes highly accurate suicide attempt prediction algorithms, explainable AI analyses identifying significant payer savings and transformer-based natural language processing models that enhanced patient experience analytics. Dr. Hanauer boasts over 30 healthcare publications, more than four patents pending and various leadership roles in AI governance.\nKelly Haynie. CEO at Ochsner Medical Center-West Bank Campus (Gretna, La.). Mr. Haynie leads Ochsner Medical Center-West Bank Campus in driving strategic growth, operational excellence,and culture-building initiatives while overseeing quality outcomes, patient experience and major capital projects. A first-generation college graduate and U.S. Army veteran, he brings discipline, resilience and a commitment to social equity to his leadership. Before joining the Ochsner system, he spent more than a decade with MedStar Southern Maryland Hospital Center in Clinton, advancing to vice president of operations and previously holding leadership roles at other hospitals within the Baltimore-based MedStar Health system. In addition to his executive responsibilities, Mr. Haynie serves as adjunct faculty at Towson University and assistant professor at Georgetown University, mentoring the next generation of healthcare leaders. His leadership is recognized through his service as chair of the young members committee and board governor for The Center Club in Baltimore, as well as a board member for the Maryland Healthcare Education Institute.\nSuzanna Winslow Hazboun. Vice President of Human Resources and Assistant General Counsel at MemorialCare (Fountain Valley, Calif.). With expertise in federal and state labor and employment law, Ms. Hazboun joined MemorialCare in January 2020 following nine years as a lawyer at various legal firms and as in-house counsel and senior vice president of strategic human resources for Banc of California. In her current dual legal and human resources leadership team role, she partners with leaders across the organization to strategize on human resources initiatives and all things related to employees. She provides trainings on various human resources and employment-related topics, manages employee-related litigation, works closely with the labor relations team and advises on day-to-day employee issues. She chairs MemorialCare’s “The Good Life” employee wellness program, offering events, classes and materials on mental/emotional/spiritual, physical and financial wellness throughout the year. Ms. Hazboun has led multidisciplinary efforts with human resources, legal services, information systems, compliance and other departments to provide cybersecurity training to the entire MemorialCare workforce.\nMara Hermiston, DO. CMO at Avera Medical Group (Sioux Falls, S.D.). Dr. Hermiston oversees physician recruitment, regional clinic administration, provider wellbeing and service line integration for Avera Medical Group’s 1,330 providers across 200 clinics. She has advanced 14 enterprisewide service lines to standardize care, improve quality and reduce cost, including merging women’s and children’s services in conjunction with a major hospital expansion. Previously, as lead clinic physician at Spirit Lake, Iowa-based Lakes Regional Family Medicine, Dr. Hermiston unified two clinics, led the development of a new facility, implemented team-based care and improved patient throughput while maintaining satisfaction levels. She also reduced her hospital’s C-section rate through best practice adoption and enhanced system transfer operations. She is a practicing rural family medicine and obstetrician physician who leverages her additional business and executive experience.\nTyler Hill. Vice President and CNO at Clarinda (Iowa) Regional Health Center). Mr. Hill leads nursing services, inpatient and outpatient operations, and strategic initiatives to advance care at Clarinda Regional Health Center. He spearheaded the development of a rural transitional care program, standardizing discharge planning and post-discharge follow-up protocols that reduced readmissions and improved outcomes for elderly and complex patients. Mr. Hill implemented evidence-based practice tools through Dynamic Health, streamlined hundreds of EHR documentation elements, and aligned nursing procedures with national standards to improve efficiency and compliance. Facing staffing challenges, he launched international nurse partnerships, preceptor programs and career ladder opportunities to strengthen recruitment and retention. His leadership in patient safety includes establishing a robust safety committee tracking system and enhancing stroke response, alarm management and interdisciplinary rounding processes. Beyond the hospital, Mr. Hill serves on multiple nursing advisory boards, forging academic partnerships to strengthen the rural healthcare workforce.\nChristina Hong. Vice President of Service Lines at Emanate Health (Covina, Calif.). As the youngest vice president in Emanate Health’s history, Ms. Hong leads business and service line growth, strategic finance, marketing, communications, public relations and business analytics for the health system’s three hospitals and 20 clinics serving one million residents. She spearheaded the development and the September 2023 opening of the Emanate Health Cancer Center, bringing top-tier cancer care to the community for the first time. She is also driving the creation of a new emergency department and ICU set to open in 2026. Ms. Hong has been instrumental in securing favorable bond ratings, achieving three-notch upgrades and maintaining strong ratings that enable investment in critical health infrastructure. She also founded the family medicine residency program, now entering its eighth cohort, to address the local physician shortage. During the Covid-19 pandemic, she was appointed to five leadership committees guiding the organization’s response to issues ranging from supply chain to emergency communications.\nMatthew Jenkins, PharmD. Vice President and Chief Pharmacy Officer for VCU Health (Richmond, Va.). Since becoming VCU Health’s inaugural chief pharmacy officer in September 2023, Dr. Jenkins has driven the rapid growth of pharmacy services within the health system. Under his leadership, specialty pharmacy volume has increased by over 50%, ambulatory retail pharmacy by more than 30% and home delivery services have doubled, expanding access for patients served by Virginia’s largest safety net hospital. He implemented a systemwide medication history program and significantly expanded meds-to-beds services, exceeding targeted capture rates and supporting readmission reduction efforts across adult and pediatric populations. Dr. Jenkins also played a key role in VCU Health’s operational response to a week-long municipal water disruption in Richmond. In 2024, he was honored with Auburn University’s “Harrison School of Pharmacy Distinguished Alumni Award” for leadership and professional contributions before age 40. Beyond his pharmacy role, he serves as interim senior leader for multiple clinical and operational services, including nutrition, plant operations, environmental services and therapy departments.\nVeena Jones, MD. Vice President and CMIO for Sutter Health (Sacramento, Calif.). Dr. Jones, triple board-certified in general pediatrics, pediatric hospital medicine and clinical informatics, is a leader of digital transformation across Sutter Health’s hospitals, foundations and medical groups. She served as senior author of a landmark JAMA Network Open study demonstrating that ambient AI reduced clinical documentation time from 6.2 to 5.3 minutes per appointment, lowered burnout rates from 42.1% to 35.1% and improved job satisfaction for 78% of clinicians. Under her leadership, Sutter Health piloted and scaled the Abridge AI listening tool, enhancing patient-provider interaction and reducing cognitive load for nearly half of participating physicians. As former medical director of digital health, she led enhancements to the “My Health Online” patient portal, contributing to 19% of ambulatory and 83% of lab appointments being scheduled online in 2024. Appointed CMIO in 2025, Dr. Jones now drives enterprisewide Epic EHR optimization, digital health strategy and AI integration while continuing as a pediatric hospitalist, virtualist and adjunct faculty member at Stanford University.\nRaheem Kajani, MD. Vice President of Clinical Risk Strategy and Operations for the California Region at Dignity Health/CommonSpirit. Dr. Kajani oversees full-risk agreements across Dignity Health/Commonspirit’s California region, managing care for more than 530,000 lives spanning Medi-Cal, commercial and Medicare Advantage populations. He has implemented strategies to increase in-network utilization, improve patient repatriation workflows at transfer centers and strengthen care coordination. His leadership contributed to the creation of a care management agreement covering approximately 100,000 managed Medi-Cal lives, expanding timely access to essential services. By developing responsive provider network workflows, he ensures patients receive prompt, high-quality care while reducing out-of-network spending. Dr. Kajani has driven measurable improvements in patient outcomes, particularly for those with complex health and social needs.\nMatthew Kaufman. Regional Vice President of Operations at Hartford (Conn.) HealthCare’s East Region. Mr. Kaufman manages daily operations for two acute-care hospitals and associated ambulatory sites, overseeing functions ranging from rehabilitation and behavioral health to radiology, pharmacy and facilities. He leads the region’s annual capital planning process, aligning multi-year construction and renovation projects with patient care needs and strategic growth. His expertise in facilities management ensures timely maintenance, upgrades, and the addition of critical equipment and infrastructure. As incident commander, Mr. Kaufman directs emergency responses for severe weather, surge capacity events and other operational disruptions. Under his leadership, both hospitals have earned multiple Leapfrog “A” safety grades, top price transparency honors from the Health Transformation Alliance and national recognition such as a spot on Healthgrades’ “America’s Best Hospitals” list.\nSage Kealy. Network Vice President of Palliative Care for Hackensack Meridian Health (Edison, N.J.). Since joining Hackensack Meridian Health in 2012, Ms. Kealy has built and led a statewide palliative care service, overseeing a $9 million annual budget and nearly 100 team members across more than 20 care locations. She has driven significant service growth, integrating care across hospitals, clinics, rehabilitation centers, nursing homes and home-based settings to ensure seamless, goal-concordant care for patients with serious illness. Ms. Kealy launched innovative telehealth and home-based primary and palliative care models that expanded access for underserved populations, improved outcomes and reduced costs, while partnering with predictive health to develop AI tools for earlier intervention. Under her leadership as chair of the care for patients with serious illness council, the system has advanced quality, efficiency and patient satisfaction, achieving success across all four pillars of the quadruple aim. She is a dual fellow of the American College of Healthcare Executives and the New Jersey Healthcare Leadership Academy, and holds a faculty role at the Hackensack Meridian Health School of Medicine.\nGuiliana Kissel. Director and Chief of Staff for The Guthrie Clinic (Sayre, Pa.). Since joining The Guthrie Clinic as an administrative fellow in 2021 and advancing to chief of staff in 2022, Ms. Kissel has become a trusted member of the executive leadership team, supporting the president and CEO in strategic decision-making and operational execution. She has overseen key initiatives including the “My Two Cents” program, which incentivizes employee-driven cost-saving solutions, and a collaborative research agreement with Binghamton University that streamlines research project approvals. Ms. Kissel also played a pivotal role in establishing a joint venture with DASCO Home Medical Equipment, improving access to durable medical equipment in the community. As administrator of the community benefits committee, she helped grow community grant investments from under $15,000 in 2022 to $50,000. She additionally manages the Sayre House of Hope, providing accommodations for patients and families traveling for care.\nMichael Kleinschmidt. Senior Vice President and COO of Southern New Hampshire Health (Nashua). Mr. Kleinschmidt has driven measurable transformation at Southern New Hampshire Health, leading initiatives that improved patient experience scores by 38%, eliminated contract labor in under six months and increased staff retention by 25%. His operational scope covers acute care, affiliated services, facilities, marketing, strategic partnerships and service line growth, with a strong emphasis on data-driven decision-making. A licensed pharmacist with advanced business and executive training, he blends clinical insight with operational expertise to align daily performance with long-term strategic goals. His leadership includes designing career ladders and development programs that boosted internal promotions by 15%, as well as rebuilding departmental operations through process redesign and performance coaching. He mentors emerging leaders, teaches lean principles to frontline staff and creates an environment where every team member feels valued.\nGift Kopsombut, MD. Assistant CMIO at Nemours Children’s Health (Jacksonville, Fla.). Dr. Kopsombut, triple board-certified in general pediatrics, pediatric hospital medicine and clinical informatics, leads enterprisewide technology initiatives that enhance provider workflows, optimize EHR usability and expand AI integration across Nemours Children’s Health. She has championed mobile technology adoption, implemented ambient documentation and piloted AI-enabled tools, while simultaneously launching a quarterly IT education series that has equipped hundreds of clinicians to improve efficiency and reduce burnout. As an associate professor of pediatrics at the University of Central Florida College of Medicine, she has mentored over a dozen trainees through research and quality improvement projects, resulting in national presentations and peer-reviewed publications. Her scholarly contributions span social determinants of health screening, pediatric decision support and clinical disease recognition. Beyond her institutional role, Dr. Kopsombut is founder and CEO of MedWreckAI, an AI-driven startup focused on medication safety, recognized among the top ten projects for feasibility and value in Harvard Medical School’s 2025 “Leadership in AI Innovation in Healthcare” program.\nZack S. Landry. President at Novant Health Matthews (N.C.) Medical Center. Mr. Landry leads one of Novant Health’s highest-volume acute care hospitals, Matthews Medical Center, overseeing all operations to ensure top performance, safety and patient experience. He spearheaded the $170 million, 150,000-square-foot critical care tower expansion, increasing capacity from 157 to 177 beds while enhancing cardiology and endoscopy services. Under his leadership, emergency department door-to-provider time dropped by 20 minutes, significantly improving access to timely care. Previously, as system executive for the Novant Health Orthopedic & Sports Medicine Institute, Mr. Landry helped launch its first sports psychology program, broadening mental health and wellness offerings. Dedicated to service beyond the hospital, he also completed a leadership program with Charlotte’s Community Building Initiative, producing new insights into social factors influencing hospital readmissions.\nAndrew Lewis. Assistant Vice President of Specialty Services for SSM Health Medical Group–Oklahoma (Oklahoma City). Mr. Lewis oversees 40 ambulatory specialty clinic sites across Oklahoma, guiding strategic growth, financial performance and operations for a medical group of more than 1,200 employees and 350 providers. Since assuming his role in 2021, he has driven exceptional patient satisfaction and provider job satisfaction scores, strengthening the organization’s position as a regional healthcare leader. Mr. Lewis collaborates closely with physicians to identify challenges early and implement solutions, ensuring smooth operations and growth opportunities. His leadership has positively impacted healthcare accessibility, preventive services and community engagement initiatives across the state. Beyond his executive role, he is active in the Medical Group Management Association, volunteers at his local church and coaches youth flag football.\nRudy Lindsey. Vice President of Service Lines at Children’s Hospital Colorado (Aurora). Mr. Lindsey oversees strategic and operational performance for multiple high-impact medical specialties at Children’s Hospital Colorado, leading a team of 145 administrative professionals in support of 980 faculty providers across 19 academic and clinical divisions. He manages financial oversight for 35 cost centers, 223 restricted funds and 15 University of Colorado School of Medicine budgets, nine of which surpassed targets by $2.8 million in fiscal year 2023. Mr. Lindsey has driven major initiatives including the centralization of subspecialty scheduling, the launch of virtual urgent care, and the $250 million East Tower expansion, all while directing procurement for the $18 million South Campus capital equipment budget. His leadership has supported the recruitment and onboarding of 15 new faculty members in under two years and delivered a “provider dashboard” that increased work relative value units by 14% in a single year. He has also overseen multimillion-dollar grants, including a $1.1 million Colorado Hospital Association “CARE Award” and a $2.8 million state Title X family planning grant.\nJonathan Liu, MD. Principal Medical Director at Amazon (Seattle). Dr. Liu serves as principal medical director for population health at Amazon Global Benefits, leading initiatives that impact the health of 1.5 million employees worldwide. Under his oversight, Amazon’s neighborhood health centers in six states achieved double-digit percentile gains in cancer screening rates and control of diabetes and hypertension. He co-founded and co-chairs the Purchaser Business Group on Health’s inclusive health workgroup, now joined by 23 major employers, producing purchasing principles and vendor assessments to advance equitable care. In 2024, he drove Amazon’s partnership with the White House “Cancer Moonshot” initiative, launching free at-home colorectal cancer screening, securing the company’s commitment to the “Working with Cancer” pledge and speaking at the White House on employer roles in prevention. He also spearheaded collaborations with the American College of Lifestyle Medicine, training over 200 providers, and with the National Institute of Health’s “All of Us” research program, exceeding enrollment goals by 2.5x with 80% participation from underrepresented populations. His leadership earned him the Purchaser Business Group on Health’s “Well-being and Health Equity Innovator Award” for 2024.\nBlake Long. Vice President of Brand and Marketing at Allina Health (Minneapolis). Mr. Long leads Allina Health’s marketing, communications and media relations teams, driving innovative strategies that strengthen the organization’s reputation, engage communities and deliver measurable results. He oversees high-impact initiatives such as the Minnesota United Football Club partnership, which integrates Allina Health’s sports medicine expertise with youth mental health programs like the award-winning “Change to Chill”. Mr. Long’s team produces Emmy-winning storytelling content, including the “My Allina Health Story” series, which highlights patient triumphs and caregiver dedication to fuel multi-channel engagement. His leadership has expanded the reach of the Healthy, Set, Go e-newsletter, achieving open rates of 47.1% and generating over 1,200 patient appointments in 2024 alone. He also launched All Together Better magazine and “All Together Better Month” to inspire employees, board members and donors while boosting morale across the system. Mr. Long was recognized as a Twin Cities Business “Notable Marketing Leader” for 2025.\nDarius Love, DNP, RN. Assistant Vice President of Workforce Optimization and Redesign for Orlando (Fla.) Health. Dr. Love leads enterprisewide innovation strategies for nursing and patient care services, overseeing divisions including the central staffing office, Magnet and professional practice, and nursing research. He implemented virtual care infrastructure and monitoring strategies that reduced nursing assistant overtime by 20%, piloted virtual nursing initiatives that saved over 141,000 clinician minutes and optimized admission documentation to cut workloads by up to 36%. As clinical executive sponsor, he advanced infusion pump integration and deployed a real-time mobile app linked to a central data repository, streamlining workflows and improving decision-making. Dr. Love also restructured nursing leadership spans of control, aligned operational frameworks, and strengthened leadership development pathways to enhance engagement and sustainability. His earlier work in service line leadership and neuroscience nursing informs his ability to anticipate needs, operationalize innovation, and scale solutions that improve both patient outcomes and clinician wellbeing.\nKaleigh A. Maio. Vice President of Human Resources at Heywood Healthcare (Gardner, Mass.). Ms. Maio leads human resources strategy for a 1,700-employee independent healthcare system, driving initiatives in workforce planning, DEI, employee engagement and labor relations. Stepping into the vice president role during the Covid-19 pandemic and Chapter 11 restructuring, she implemented targeted programs that boosted overall employee satisfaction scores by 6.4% and increased survey participation by 7% in 2024. Her innovations include bringing the employee assistance program in-house, launching an employee concierge service for expedited healthcare access, and creating wellness and support programs such as the “Giving Tree” and “Employee Clothes Closet”. Ms. Maio actively partners with community organizations like Catholic Charities to strengthen diversity and expand recruitment pipelines. Recognized with the WBJ “40 Under Forty” award and the Greater Gardner Chamber’s “Michael Gerry Unsung Hero Award”, she is committed to advancing workplace equity and resilience.\nLaura Mark, PharmD. Vice President of Pharmacy at Allegheny Health Network (Pittsburgh). Dr. Mark oversees pharmacy services across 10 hospitals, nine outpatient pharmacies and 17 infusion centers, providing strategic and operational leadership for the entire network. In 2024, she exceeded financial goals by delivering $16.7 million in savings and revenue optimization through targeted initiatives. She has driven operational excellence by standardizing technologies such as BD devices, IV and PCA pumps, and Omnicell systems, as well as leading major pharmacy construction projects. Under her guidance, clinical pharmacy services have expanded significantly, including ambulatory care, wellness clinics, anticoagulation, prior authorization, refill management and medication governance programs. A strong advocate for safety and compliance, she ensures adherence to regulatory standards, including 340B program requirements, while championing formulary management and protocol development. In addition to her operational impact, Dr. Mark mentors pharmacy residents, supports educational partnerships and serves on the dean’s advisory board at Duquesne University.\nNikola Markoski, PharmD. Director of Pharmacy Strategic Sourcing Solutions and Analytics at Vizient (Irving, Texas). Dr. Markoski leads national strategies to strengthen medication access, mitigate drug shortages and enhance supply chain resilience for U.S. healthcare systems. He co-founded the End Drug Shortages Alliance, now with 300-plus members and 80-plus organizations, and established its rapid response team, the only cross-industry group providing real-time quantified insights and guidance during major pharmaceutical disruptions such as the Akorn closure, Pfizer Rocky Mount plant damage and Hurricane Helene IV shortages. His predictive analytics work identified that 8,300 patients annually go untreated for Bacillus Calmette-Guérin due to supply constraints, prompting national awareness and policy engagement. As lead author of Vizient’s 2024 Beyond the Shortage report, he quantified $900 million in annual labor costs and 20 million labor hours tied to shortage management, influencing advocacy and reform efforts. Dr. Markoski’s proactive interventions have prevented cascading shortages and improved provider preparedness, while his mentorship as Vizient’s intern and residency coordinator is shaping the next generation of pharmacy supply chain leaders. A sought-after national speaker and industry thought leader, he continues to set new benchmarks for crisis response, predictive modeling and long-term supply chain strategy in healthcare.\nMike Marquardt. CFO for UVA Health University Medical Center (Charlottesville, Va.). Mr. Marquardt oversees the full scope of financial operations at UVA Health University Medical Center, including reporting, budgeting, supply chain, procurement and strategic planning. Under his leadership, the organization reduced external traveler expenses from $195 million in fiscal year 2023 to $91 million in fiscal year 2024, with projections to end fiscal year 2025 below $70 million, cutting monthly costs from $20 million to $5 million through decreased usage and improved rate management. He was a key sponsor in developing inpatient labor standards used across nearly 50 departments, now referenced in national industry publications. Mr. Marquardt has modernized the system’s budget process by implementing the Anaplan platform, fostering transparency and operational ownership. A frequent presenter for national healthcare conferences, he actively encourages finance team members to take leadership roles in professional organizations.\nGarett May, JD. President and CEO of West Jefferson Medical Center (Marrero, La.). Appointed in April 2025, Dr. May brings over a decade of executive healthcare leadership to West Jefferson Medical Center, with expertise in hospital operations, strategic growth and patient-focused care. Previously, as COO of Huntsville, Ala.-based Crestwood Medical Center, he directed more than $150 million in capital projects, boosting surgical and imaging volumes, improving efficiency and advancing physician integration. His earlier leadership within the Jackson, Miss.-based Merit Health system delivered service expansions and operational improvements, all while enhancing community-based care initiatives. Dr. May blends legal, financial and administrative expertise to navigate the complex demands of modern healthcare.\nWhitney Mbipeh. Vice President of Operations at Thomas Jefferson University Hospitals (Philadelphia). Ms. Mbipeh oversees hospital operations for Thomas Jefferson University Hospitals, managing a $1 billion budget, over 1,400 full-time employees, and key clinical and support service lines including heart and vascular, oncology, transplant, radiology, laboratory and environmental services. She expanded patient access by optimizing radiology staffing, creating nearly 400 additional imaging slots per month, and improved employee experience by transforming a traditional gift shop into a profitable 24/7 micro market with fresh food options. Her operational leadership has fostered collaboration across departments while maintaining financial sustainability. Previously at Cleveland Clinic, she led the acquisition and integration of a multimillion-dollar primary care practice, converted all ambulatory visits in the Florida region to telemedicine at the onset of Covid-19 and reduced surgical cancellations through the expansion of preoperative assessment clinics.\nJacob McCarty. COO at Kaiser Permanente San Leandro (Calif.) Medical Center. Mr. McCarty oversees operations for Kaiser Permanente’s San Leandro Medical Center and six affiliated campuses, managing a $2 billion annual budget, 6,000 employees and over 370,000 patients. Under his leadership, the facility has achieved a Leapfrog “A” rating, ranked 46th in California and 4th in the San Francisco Bay Area by U.S. News & World Report, and led the Northern California Region in most census management metrics and overall operating margin for multiple years. He has spearheaded major capital projects, opened a second DaVinci robotic surgery room to expand urology, urogynecology and colorectal services, and implemented senior care programs such as advanced care at home and home health plus. His tenure has seen reductions in average length of stay, improved inpatient and perioperative throughput, and national recognition for joint replacement and maternity care excellence. Beyond hospital operations, Mr. McCarty serves as adjunct faculty at New York University, a subject matter expert in healthcare administration curriculum design, and a member of Kaiser’s national workplace violence prevention council. He brings prior CEO and COO experience across trauma centers, children’s hospitals and academic medical settings.\nNicole Mitchell. Vice President of Commercial Growth at NextGen Healthcare (Fredericksburg, Va.). Ms. Mitchell leads an end-to-end commercial engine spanning demand generation and pipeline marketing, digital marketing, internal and external events, sales education, market and field intelligence, sales engineering, both sales ops and revenue ops, and much more. She aligns go-to-market strategy with execution to accelerate bookings and optimize lead-to-cash performance. Notable wins include launching NextGen’s AI-powered efficiency messaging, driving over $300 million in marketing-sourced pipeline, restructuring inbound and outbound sales development representative programs for higher quality and velocity, and implementing a commissions automation platform for over 170 reps overseeing a $21 million budget. She also elevates brand presence through high-impact user groups, tradeshows and executive summits, while equipping teams with sales playbooks, new-hire bootcamps and competitive field intelligence. Previously vice president of pre-sales, she brings deep product fluency to commercial strategy. In 2025 alone, NextGen Healthcare has earned recognition as the No. 1 practice management by Black Book, as well as Newsweek’s “Most Trustworthy Companies in America” and Forbes‘ “America’s Best Midsize Employers”. Ms. Mitchell’s community leadership includes roles with the American Cancer Society and the Cystic Fibrosis Foundation.\nMarie Moore. President at Mercy Washington and Lincoln Communities (Washington, Mo.). Ms. Moore began her career with Mercy as a nurse tech at Mercy Hospital Springfield while earning her nursing degree. Over the last 15 years, she has risen into leadership positions such as director of operations, hospitalist and intensivist, director of nursing for the adult medical service line, and executive director of patient logistics operations. In 2022, she was named vice president and CNO. In this role, she oversaw more than 2,000 nurses, achieving 8.29% net positive core nursing workforce growth with a $4.2 million reduction in year-over-year contingent labor spend. She also helped establish a regional career advancement center with concentrated focus on workforce pipeline and building community relationships. In February 2025, Ms. Moore was appointed to her current role, in which she oversees three hospitals, one managed, with over 170 beds and $248 million in net patient revenue, as well as 66 physician practices. She was named a “Most Influential Woman” by the Springfield Business Journal.\nAlexander Motola. Co-Founder, Executive Vice President and Chief Business Officer at LucyRx (Bethesda, Md.). Mr. Motola co-founded LucyRx, a next-generation pharmacy benefit manager reimagining prescription care with a focus on cost clarity, reduced drug prices and better outcomes. He oversees mergers and acquisitions, corporate strategy, capital and growth initiatives, and organizational development, leading the company through three major transactions and helping raise over $500 million in growth capital. Under his leadership, LucyRx has scaled to nearly 200 employees and expanded nationally, now serving more than one million members through partnerships with employers, health plans and providers. Mr. Motola previously worked in healthcare-focused private equity, investment banking and pharmacy benefits, experiences that shaped his perspective on structural inefficiencies in the healthcare system. He also serves as a startup advisor through Los Angeles-based UCLA’s Venture Accelerator and has long supported nonprofit organizations dedicated to expanding healthcare and financial literacy for underserved communities.\nThomas Nahass, MD. Vice President of Health Informatics for RWJBarnabas Health (West Orange, N.J.). As vice president of health informatics, Dr. Nahass leads systemwide initiatives to advance clinical technology, optimize the Epic EHR and enhance patient safety across New Jersey’s largest academic health system. He oversaw the rollout of the deterioration index early warning system, improving mortality outcomes in decompensating patients by 22%, and co-chairs the sepsis mortality committee, redesigning workflows to boost compliance and outcomes. During the 2024 Baxter IV fluid crisis, he implemented a data-driven conservation strategy using barcode tracking and Tableau dashboards, ultimately reducing usage by 44% without increasing mortality or acute kidney injury rates. Dr. Nahass also developed an autoCDI tool in Epic that minimizes documentation queries for physicians while accurately capturing care complexity. He also created advanced dashboards to track respiratory viral disease trends, enabling masking policy changes nearly two weeks ahead of CDC guidance. He leads the Epic physician builder program to engage tech-minded physician leaders in workflow innovation, contributing to the system achieving Epic “Gold Stars Level 10” for three consecutive years and placing it in the top 1% of Epic customers globally. Still practicing in the medical ICU, Dr. Nahass mentors residents and fellows, frequently presents at national critical care conferences and will lead a panel on AI in critical care this fall.\nAnnabelle Nam. Chief of Staff, Quality, Innovation and Performance at McGill University Health Centre (Montreal, Canada). Ms. Nam leads enterprisewide initiatives to advance quality, performance improvement and data innovation at one of Canada’s top academic health systems. She has modernized data governance and performance reporting, enabling transparent, actionable insights that align clinical and operational priorities and accelerate the organization’s evolution into a learning health system. Ms. Nam has been instrumental in evaluating and scaling innovation partnerships, integrating technologies that promote data democratization into clinical workflows to improve patient outcomes. Her leadership has earned internal commendations for driving change management, fostering cross-functional collaboration and strengthening a culture of continuous improvement. Beyond the health centre, she has shared her expertise nationally as a featured speaker at conferences, highlighting the centre’s analytics modernization journey.\nNike Onifade. Senior Vice President of the National Cancer Service Line at Advocate Health (Charlotte, N.C.). Ms. Onifade leads one of the largest integrated cancer programs in the nation, overseeing a multibillion-dollar enterprise that treats more than 50,000 new cancer patients annually across 130-plus sites in five states with over 750 affiliated physicians. She is unifying clinical operations, research, education, innovation and commercialization into a cohesive national strategy, embedding clinical trials into care delivery, standardizing patient access, and integrating AI and emerging technologies to improve outcomes and efficiency. Previously, as division vice president at Chicago-based CommonSpirit Health, she managed a $250 million oncology division, driving a 30% net revenue increase in two years, expanding access to over 220 clinical trials, launching CAR T-cell therapy and improving staff retention by 55%. Her earlier leadership at Pittsburgh-based UPMC included integrating community cancer programs into the UPMC Hillman Cancer Center to expand subspecialty and clinical trial access. She is nationally recognized as a 2025 “Outstanding Diversity Champion” by the Houston Business Journal, a 2024 Diversity MBA “Top 100 Under 50 Executive Leader” and a 2024 “Thomas C. Dolan Executive Leadership Scholar” according to the American College of Healthcare Executives.\nRiley Orr. COO of Regent Surgical (Franklin, Tenn.). Mr. Orr leads Regent Surgical’s operations, growth and supply chain professionals to advance its mission of redefining surgical care. His passion and expertise in the ASC space make him a key asset as the company deepens and expands partnerships across the country. Mr. Orr has over 11 years of operations experience and a career-long commitment to the ASC industry, beginning his career as a surgery center administrator. Prior to Regent, he worked for USPI and Compass Surgical in operations leadership roles. This holistic experience enables him to add firsthand insight to all aspects of Regent’s operations, as well as the company’s partners’ operations.\nAleks Overbey. President at Ascension St. Vincent Fishers (Ind.). As the youngest president in the St. Louis-based Ascension St. Vincent system, Mr. Overbey leads a 46-bed hospital serving Indiana’s rapidly growing Hamilton County, overseeing strategic growth, quality outcomes and associate engagement for more than 200 team members. Since late 2023, he has driven record-setting growth, including a 14% increase in inpatient discharges, a 40% rise in surgical procedures and a 44% jump in births, with three consecutive months of record surgical volumes. He has expanded key service lines, including breast surgery, neurosurgery, gastroenterology, OB/GYN and urology. Drawing on a strong background in healthcare finance and strategic planning, Mr. Overbey has managed budgets exceeding $700 million, led productivity optimization and crafted enterprisewide strategic plans in prior roles at Indianapolis-based Indiana University Health and at Ascension. His leadership has helped the hospital earn national recognition, including being named one of the “100 Top Hospitals” by Premier PINC AI and Fortune in 2024. Committed to community engagement, he also serves on multiple boards and committees.\nAsa Oxner, MD. Vice President and Associate CMO of Ambulatory Services for Tampa (Fla.) General Hospital. Dr. Oxner leads Tampa General Hospital’s rapidly growing ambulatory network, overseeing initiatives that improve access, quality and care coordination across multiple outpatient sites. She spearheaded the “Think Ambulatory First” program, which has diverted nearly 400 patients from inpatient or emergency department care, saving more than 1,000 hospital bed days with only 6% requiring return visits. As medical director of Tampa Bay Street Medicine and the “IDEA Tampa Syringe Services” program, she has overseen the exchange of over 850,000 needles, reversal of 13,500 overdoses and linkage to care for 100% of newly diagnosed HIV patients. Dr. Oxner was the founding medical director of The USF Patient-Centered Medical Home in Tampa, implementing the first value-based care model for primary care within USF and Tampa General Hospital and enabling successful ACO participation with annual shared savings. She also co-led development of an e-consult program to expedite specialty care and designed home monitoring systems for Covid-19 patients. Her career includes global health leadership with Partners in Health in Sierra Leone, managing pediatric care, HIV and tuberculosis programs, and Ebola response efforts.\nAsher Perzigian. North America Care Innovation Practice Lead for Accenture Health (Chicago). Mr. Perzigian leads Accenture Health’s North America Care Innovation Practice, overseeing one of the firm’s most transformative growth portfolios to improve access, experience and outcomes. Recently, he closed a nine-digit budget gap for a regional health plan, reversed declining utilization and membership, and stabilized long-term growth. Mr. Perzigian integrated a new business unit’s digital health strategy post-merger for a national healthcare company, achieving a seamless consumer experience and operational efficiencies. Additional initiatives spearheaded by him include launching a reimagined care coordination and virtual staffing model, consolidating five operating models into a single digital process flow, and advising on mergers and acquisitions strategies that improved competitive positioning. Beyond client work, he co-hosts the Mavericks in Healthcare podcast, amplifying innovation and inspiring the next generation of healthcare leaders.\nMarco Priolo. Senior Vice President of Finance for University of Maryland Upper Chesapeake Health (Bel Air, Md.). Mr. Priolo has led the financial operations of UM Upper Chesapeake Health since 2020, directing strategic planning, resource management and value-driven investments to benefit the community. His approach to financial stewardship emphasizes collaboration with clinicians and operators to address healthcare’s most pressing challenges while enhancing patient care. His career includes key leadership roles at Baltimore-based Johns Hopkins Medicine, where he served as director of financial innovation and director of business development. A dual-appointed adjunct faculty member in finance at Johns Hopkins Bloomberg School of Public Health and Johns Hopkins University, Mr. Priolo combines academic expertise with real-world financial leadership. He is also active in community engagement, including volunteer coaching for the John Hopkins University wrestling team.\nRyan Quattlebaum. President and CEO at AdventHealth Wesley Chapel (Fla.). Mr. Quattlebaum directs the strategic vision, operational performance and financial sustainability of AdventHealth Wesley Chapel and its outpatient network. Leveraging his financial expertise, he has driven revenue growth, improved earnings before interest, taxes, depreciation and amortization margins, maintained a focus on high-quality patient care and built high-performing teams. Under his leadership, the hospital earned U.S. News & World Report recognition for excellence in diabetes, heart attack, hip and knee replacement, and pneumonia care, as well as multiple 2025 Healthgrades honors, including “America’s 250 Best Hospitals”, “Critical Care Excellence Award” and “Pulmonary Care Excellence Award”. Mr. Quattlebaum’s leadership aligns operational success with organizational values. His career spans executive roles across multiple Altamonte Springs, Fla.-based AdventHealth facilities, as well as financial leadership positions in healthcare systems and consulting. As a member of the Florida Hospital Association’s workforce improvement committee, he also contributes to statewide strategies for strengthening the healthcare workforce.\nDannah G. Raz, MD. Division Chief of Developmental Pediatrics at Phoenix Children’s. Dr. Raz leads Phoenix Children’s division of developmental pediatrics and serves as medical director of its Down syndrome program, where she has expanded services and strengthened multidisciplinary care. She partnered with the psychology division to reduce average wait times for autism evaluations in children under four by 20% and increased the number evaluated in this age group by 220%, while also launching Arizona’s autism educational summit. Under her leadership, Phoenix Children’s established the state’s only multidisciplinary Down syndrome clinic, expanded it from biweekly to six times per month and added a dietitian to address obesity risks, alongside securing automatic state disability qualification for patients with Down syndrome. Dr. Raz is a founding leader of the neurodiversity committee, advocating for inclusive, comprehensive care and implementing institutionwide initiatives for individuals with neurodevelopmental disabilities. She also advances research as a participant in national Fragile X studies and clinical trials, and mentors future pediatricians as a core faculty member and resident rotation director. Recognized as a Phoenix Magazine “Top Doctor” for four consecutive years, she is driving both programmatic growth and systemic improvements for children with developmental and behavioral needs.\nSunitha Reddy. Chief Revenue Officer and Vice President of Operations for Prime Healthcare (Ontario, Calif.). Ms. Reddy oversees financial and operational strategy for 51 hospitals and more than 360 outpatient locations across 14 states, aligning managed care, revenue cycle, utilization management, patient access and business office operations to achieve systemwide goals. Under her leadership, Prime Healthcare hospitals have earned more than 150 clinical awards from Healthgrades in 2025 alone, including multiple “America’s 100 Best by Specialty” honors. 31 of the system’s hospitals achieved an “A” Hospital Safety Grade from The Leapfrog Group. She has driven initiatives rooted in data and best practices that improved efficiency, strengthened revenue performance, and advances health equity and social responsibility, with the Lown Institute naming Prime Healthcare among the most socially responsible health systems in the U.S. Beyond her corporate role, she serves as executive director of the Dr. Prem Reddy Family Foundation, which has awarded millions in scholarships and funds programs for clean water, vaccination and free clinics.\nAdam Reich. Senior Vice President of Business Strategy at Dana-Farber Cancer Institute (Boston). Mr. Reich leads transformative growth across Dana-Farber Cancer Institute’s clinical network. Under his leadership, Dana-Farber has expanded to include more than 20 hospital affiliations and forged strategic international partnerships, most recently extending the institute’s global footprint in the Middle East. He also spearheaded the launch of Dana-Farber’s international patient program, which now provides care to patients from more than 100 countries at its Boston campus. Mr. Reich was instrumental in shaping Dana-Farber’s groundbreaking clinical collaboration with Boston-based Beth Israel Deaconess Medical Center and Harvard Medical Faculty Physicians, an alliance that will support the Institute’s planned 300-bed inpatient hospital. Beyond institutional strategy, Mr. Reich has advanced initiatives that extend the institute’s reach and impact, including expanding need-based lodging programs and helping deliver Dana-Farber’s expertise to more than 1,000 community oncologists nationwide through the innovative “Pathways” program, a clinical decision support system that guides physicians through personalized, evidence-based treatment options.\nNatalie Rodriguez. COO and CFO at Coral Gables (Fla.) Hospital. Ms. Rodriguez oversees all ancillary and support departments, manages multimillion-dollar budgets, and leads both daily operations and long-term strategy for Coral Gables Hospital. During a corporate bankruptcy and ownership transition, she renegotiated all critical service agreements, saving the organization over $3 million annually, and established over 150 vendor accounts to sustain life-sustaining services. She ensured the hospital passed The Joint Commission, Agency for Health Care Administration and Life Safety surveys under maximum operational risk. Promoted four times in three years, she has demonstrated exceptional crisis leadership and strategic foresight. Her role also includes chairing the environment of care, emergency management and workplace violence committees, as well as serving on the board of directors and medical executive committee.\nSamantha Ruokis. Vice President of Clinical Performance Excellence at UChicago Medicine. Ms. Ruokis leads systemwide quality improvement, risk management, patient safety and operational excellence efforts for UChicago Medicine, ensuring the delivery of safe, high-value care across Chicago’s South Side and beyond. An industrial engineer by training, she has institutionalized evidence-based clinical pathways to optimize resources and reduce unwarranted variation in care. Her commitment to a just culture has driven a 20% year-over-year increase in event reporting for the last two fiscal years, with an identified reporter rate approaching 80%. Under her leadership, the organization has strengthened its safety culture while maintaining accountability and transparency. Since joining UChicago Medicine in 2014, she has advanced from quality program manager to vice president, consistently delivering measurable improvements in patient outcomes and safety. Her work supports the institution’s long-standing record of excellence, including 27 consecutive Leapfrog “A” safety grades and multiple national quality awards.\nBrooke Russell. Chief Marketing Officer at AVALA (Covington, La.). Ms. Russell has transformed AVALA’s brand presence, leading a complete rebranding that energized internal culture and strengthened external reputation across the region. As chief marketing officer, she aligns marketing, communications and patient experience initiatives to reflect the organization’s mission, fostering deeper engagement with patients, physicians and team members. Her leadership has elevated AVALA from a local provider to a recognized healthcare network, integrating creative storytelling with data-driven strategies to build loyalty and drive growth. Ms. Russell’s collaborative approach ensures marketing is embedded in operational and clinical priorities, while her commitment to team development promotes an inclusive, high-performing workplace. She has also contributed to community and economic development as an advisory board member for the St. Tammany Chamber of Commerce and through mentorship roles with Theta Phi Alpha.\nDeirdre Salanger. COO of Strong Memorial Hospital (Rochester, N.Y.). Ms. Salanger serves as COO of Strong Memorial Hospital, an 897-bed facility and the only level 1 trauma center in New York’s Finger Lakes region, overseeing all onsite and ambulatory clinical operations, service lines and major capital projects, including a tripling of the emergency department and construction of a nine-story patient tower. She brings over a decade of leadership experience from top-tier institutions, including Detroit-based Henry Ford Health hospitals and at Baltimore-based Johns Hopkins Medicine, where she advanced quality, safety and multidisciplinary service-line development. At Henry Ford Hospital, she managed surgical services, cardiac catheterization and electrophysiology labs, as well as $3.2 million square feet of capital projects, all while driving operational excellence. Ms. Salanger also has extensive experience in oncology operations, having led financial and ambulatory management for the Sidney Kimmel Comprehensive Cancer Center at Johns Hopkins. Her leadership has helped earn Strong Memorial Hospital national recognition, including National Cancer Institute designation in 2025 and its fifth consecutive Magnet designation in 2024. In addition to her executive role, she contributes to the field through academic appointments at Cornell University and Johns Hopkins University.\nAlyana “Aly” Samai. Vice President of Neuroscience Services at LCMC Health (New Orleans). Ms. Samai leads systemwide growth and strategy for LCMC Health’s neuroscience initiatives, building on a decade of clinical and leadership excellence in stroke and neurological care. She began her career in stroke research in 2013, contributing to publications in Stroke and JAMA Neurology, before transitioning into leadership as stroke program coordinator at West Jefferson Medical Center, where she guided the hospital to comprehensive stroke certification from The Joint Commission. Named a “Healthcare Hero” by New Orleans CityBusiness in 2019, she went on to develop and expand the LCMC Health Neuroscience Institute. In 2022, she assumed dual leadership roles as director of neuroscience for both West Jefferson Medical Center and University Medical Center, bridging operations and strategy across facilities. Now as vice president, she shapes the future of neuroscience services with a focus on innovation, growth and community impact.\nAndrew Santos. President and CEO at AdventHealth North Pinellas (Tarpon Springs, Fla.). Mr. Santos leads operational oversight, strategic planning, stakeholder engagement and the advancement of quality, safety and innovation at AdventHealth North Pinellas. He has strengthened physician relationships, enhanced organizational culture and driven growth in both patient volume and market share. His tenure has contributed to the hospital earning a Leapfrog safety grade “A”. Mr. Santos’s leadership extends beyond the hospital, serving on the boards of the Greater Lake Placid Chamber of Commerce and the South Florida State College Foundation, as well as holding stewardship roles at LifeSpring Adventist Church. His diverse background includes leadership positions across multiple Altamonte Springs, Fla.-based AdventHealth system facilities in operations, surgical services, finance and strategic development.\nLuke Schademan, BSN, RN. Executive Director of Neurosciences and Critical Care Services at MemorialCare Saddleback Medical Center (Laguna Hills, Calif.). With 16 years of progressive experience in nursing and the last six in nursing management. Mr. Schademan oversees several services at MemorialCare Saddleback Medical Center. These include emergency and critical care, social services, palliative care, critical care nurse practitioner program and an outpatient wound healing center. He is also responsible for the Neuroscience Institute, which includes the stroke program, brain and spine health initiatives, and electroencephalogram services. These roles allow him to integrate his clinical expertise and administrative leadership to support patient care and daily operations. His achievements include implementing a new care model for Saddleback’s busy emergency department, adding licensed vocational nurses to supplement registered nurses, allowing RNs to work at the top of their licensure and skill set. This results in emergency department patients having shorter arrival-to-provider times and patient satisfaction improvements. Stroke program initiatives over the past year have improved the time from patient door-to-thrombolytic treatment, consistently outperforming national benchmarks for acute ischemic stroke care. The majority of Saddleback’s stroke patients receive thrombolytics in less than 30 minutes. These efforts have earned Saddleback “Get With the Guidelines – Gold Plus Award” from the American Stroke Association/American Heart Association for excellence in stroke care.\nAllison Schiffli. Vice President of Provider Education and Sponsored Projects for Parkview Health (Fort Wayne, Ind.). Ms. Schiffli leads provider education initiatives for Parkview Health’s 14 hospitals and nearly 300 physician offices across more than 20 counties, overseeing continued medical education, graduate medical education, undergraduate medical education, sponsored projects and simulation programming. She played a key role in securing Parkview Health’s first standard continued medical education accreditation through the Indiana State Medical Association, ensuring alignment with national best practices and expanding access to high-quality, accredited provider education. Ms. Schiffli helped develop Indiana’s first long-Covid clinic and operationalized a focused ultrasound program for essential tremor treatment. She spearheaded the creation of a new simulation education partnership with Trine University and launched Parkview Health’s mobile medical simulation lab in 2024, bringing advanced training directly to first responders and community organizations. Under her leadership, the system’s graduated medical education programs achieved initial Accreditation Council for Graduate Medical Education accreditation in family medicine and psychiatry, with their first graduates expected in 2026. She also serves on the board for Area Health Education Centers, supporting recruitment and retention of health professionals in underserved and rural communities.\nEvan Schmidt. Vice President of Strategic Planning at Hartford (Conn.) HealthCare. Mr. Schmidt leads the development, communication and execution of Hartford HealthCare’s annual strategic priorities, ensuring alignment across strategic, operational and financial domains. He conducts hundreds of engagement sessions with staff, medical teams and community partners to gather insights that shape systemwide goals. In fiscal year 2024, his leadership of the strategic initiatives committee resulted in the review, refinement and approval of 65 business plans, generating $68.6 million in incremental revenue. Mr. Schmidt also evaluates and advances strategic partnerships that align with the system’s values and enhance capabilities. His collaborative approach and effective communication have made him a trusted advisor to senior leadership, bridging priorities between executive leadership and operational teams. Thanks in large part to his work, Hartford HealthCare has strengthened its position as a top-ranked, innovative healthcare system recognized nationally for safety and innovation.\nMichelle Schmitt. Vice President of Pharmacy Financial Operations at SSM Health (St. Louis). Ms. Schmitt, the first to serve as vice president of pharmacy financial operations at SSM Health, oversees pharmacy business operations, analytics and the 340B center of excellence across four states. She has optimized the 340B program to increase compliance, enhance value and expand access to essential medications, strengthening both financial sustainability and patient care. Ms. Schmitt spearheaded the expansion of centralized medical group purchasing, improving procurement efficiency and supply chain resilience. Her initiatives include launching technician-led interventional neuroradiology workflow management in the anticoagulation clinic, creating robust analytics for drug margin performance and implementing Drug Supply Chain Security Act technology ahead of regulatory deadlines. During the Covid-19 pandemic, she coordinated mobile vaccine clinics across Wisconsin, ensuring equitable vaccine access. She also established a drug shortage subcommittee to proactively manage supply disruptions, safeguarding continuity of care.\nKristen Sharp, DHA. North Texas Market CFO and Chief Staffing Officer for Behavioral Health Services at HCA Healthcare (Nashville, Tenn.). Dr. Sharp oversees financial and staffing strategy for three key behavioral health facilities, leading multimillion-dollar turnarounds, streamlining reporting systems, and implementing data-driven initiatives that enhance efficiency and sustainability. As CFO, she manages budgeting, forecasting and compliance while optimizing resource utilization to support both fiscal performance and high-quality patient care. In her chief staffing officer role, she has developed workforce models that align staffing with clinical demand, reduce reliance on agency labor and improve operational efficiency in a complex care environment. Recognized with a Cystic Fibrosis Foundation “30 Under 30” honor, and as a 2024 “Nashville Emerging Leader Awards” finalist, she is widely respected for her ability to connect financial strategy with operational impact. Beyond HCA Healthcare, Dr. Sharp chairs the advisory board for Play Like A Girl, serves on multiple nonprofit boards and mentors emerging healthcare leaders, particularly women of color.\nJared Shelton. President of Texas Health Harris Methodist Hospital Fort Worth. Mr. Shelton leads an 851-bed level 1 trauma hospital, overseeing strategic, financial and operational performance to deliver top-quartile quality and patient satisfaction outcomes. Prior to his current role, he served as president of Texas Health Harris Methodist Hospital Hurst-Euless-Bedford, where he guided the organization to earn Magnet designation in 2022 and launched a three-year internal medicine residency program. Recognized among Fort Worth Inc.’s “The 500” most influential leaders, Mr. Shelton is known for driving a culture of excellence through collaboration with nursing, medical staff and support teams. His leadership extends beyond hospital walls, serving as regent for the American College of Healthcare Executives Texas–Northern, trustee for the Dallas Fort Worth Hospital Council and chair of the 2024 March of Dimes signature chefs event. Mr. Shelton has been instrumental in systemwide initiatives, including serving as executive champion for a major food, nutrition and environmental services outsourcing agreement.\nImran Siddiqui, MD. CMO at Desert Valley Hospital and Desert Valley Medical Group (Victorville, Calif.). Dr. Siddiqui, board certified in internal medicine, serves as CMO, practicing primary care physician and hospitalist. In 2023, he was instrumental in launching Desert Valley Hospital’s internal medicine residency program, where he continues to serve as associate program director. As medical director for Desert Valley Medical Group, a multispecialty practice of more than 100 physicians, he has advanced patient care and operational efficiency. His leadership blends clinical expertise with strategic vision, resulting in measurable quality and growth outcomes. Under his leadership, the hospital earned a Leapfrog grade “A”, reinforcing its status as a premier 148-bed acute care facility.\nErica Stevens, MSN, RN. CNO at AdventHealth Winter Park (Fla.). Ms. Stevens leads more than 1,200 nurses in delivering high-quality, whole-person care at the 373-bed acute-care AdventHealth Winter Park. Under her leadership, the hospital has consistently earned “A” safety grades from The Leapfrog Group for over eight years and was named a “Top Teaching Hospital” in 2024. Ms. Stevens has helped elevate the hospital’s nationally recognized programs in inpatient rehabilitation, women’s services, oncology, orthopedics, labor and delivery, and primary stroke care designation. She played a key role in launching AdventHealth hospital at home in 2025, an innovative program providing hospital-level care in the comfort and safety of patients’ homes. Beyond operations, Ms. Stevens is deeply committed to shaping the future of nursing. In partnership with local nursing schools, she helped organize more than 21 rotations through AdventHealth’s dedicated education units, creating robust, hands-on clinical experiences for students and a stronger pipeline into practice. She also serves on the nursing advisory boards for Herzing University, Keiser University, Rasmussen University and Seminole State College. Ms. Stevens is one of the driving forces behind AdventHealth Winter Park’s recognition, as part of AdventHealth’s Central Florida Division and ranked together with AdventHealth Orlando, as the No. 1 hospital in greater Orlando for 14 consecutive years, according to U.S. News & World Report.\nKen Stevens. CEO at Medical City Frisco (Texas). Mr. Stevens was promoted to CEO of Medical City Frisco in May 2025, leading a 97-bed acute care hospital recognized for nursing excellence and serving one of the fastest-growing counties in the nation. He oversees all financial operations, clinical quality outcomes and patient experience, with recent expansions including new emergency department patient rooms and an operating room for women’s services. As COO of Medical City Lewisville (Texas) from 2023 to 2025, Mr. Stevens directed $20.5 million in women’s services investments, oversaw major NICU renovations, and advanced projects for a $2.5 million hybrid procedural suite and $2.7 million operating room. Under his leadership, employee engagement survey results ranked the Lewisville hospital first among 22 hospitals in the system, with 91% of medical staff naming it their preferred place to practice. Mr. Stevens began his career as a financial analyst and advanced through operations, supply chain and administrative leadership roles, demonstrating consistent success in service growth, patient outcomes and satisfaction. He also serves on the boards of the Dallas-Fort Worth Hospital Council and PediPlace.\nJacob Tanner Barb. CNO for Community Hospital Corporation (Plano, Texas). Mr. Tanner Barb became one of the youngest associate CNOs in the nation at age 25 and advanced to CNO at 26, leading clinical operations, quality, safety and nurse engagement in a long-term acute care setting. Under his leadership, the hospital achieved triple Center for Improvement in Healthcare Quality center of excellence designations in long-term acute care, nursing and respiratory therapy, and was ranked No. 9 nationally for lowest preventable readmission rates at 9.09%. He is a “DAISY Award” recipient and previously drove an 18% improvement in Press Ganey “Hospital Consumer Assessment of Healthcare Providers and Systems” scores, placing a prior facility in the top 25% of critical access hospitals nationwide. Mr. Tanner Barb routinely rounds with staff, addresses concerns in real time, and fosters a culture of accountability and collaboration. His career spans high-acuity pediatric and adult care, with leadership roles at Philadelphia-based Penn Medicine, Jacksonville, Fla.-based Nemours Children’s Health and the Albuquerque-based University of New Mexico Hospital.\nMichael Taylor. Senior Vice President of Operations at U.S. Dermatology Partners (Dallas). Overseeing more than 75 locations across Texas and Oklahoma, Mr. Taylor manages operations for nearly 200 providers, over 700 team members and $170 million in annual revenue. In less than three years, he has led the creation of more than 30 new outreach program locations, expanding dermatologic care into rural communities. Mr. Taylor introduced a hub-and-spoke location model in underserved regions, improving resource allocation and patient access. He also launched a centralized call center that streamlined communication, boosted patient satisfaction and enhanced service efficiency. He also spearheaded the opening of the flagship Center for Aesthetic and Laser Medicine, driving significant cosmetic service growth under medically supervised care. His leadership has been pivotal in physician recruitment, partnership management and operational strategy, ensuring sustained growth and service quality. He has been with U.S. Dermatology Partners for over a decade.\nEvan Thoman. Chief Well-Being Officer at Emory Healthcare (Atlanta). Mr. Thoman leads the Woodruff Health Sciences Center’s Office of Well-being (EmWELL), advancing a systemwide strategy grounded in three pillars: fostering a culture of wellness, improving the nature of work and supporting personal resilience. The Office of Well-being supports the “Getting Rid of Stupid Stuff” initiative, empowering teams to eliminate low-value administrative tasks, and developed system-level dashboards integrating engagement, wellbeing and operational data to drive targeted improvements. His work has addressed systemic drivers of burnout, strengthened employee engagement and embedded wellbeing into the culture of one of the nation’s top-ranked academic medical centers. Nationally, Mr. Thoman serves as co-chair of the American Nurses Association’s “Healthy Nurse, Healthy Nation” initiative, influencing strategies to improve nurse wellbeing across the U.S. His prior leadership roles at Houston-based MD Anderson Cancer Center and NASA’s Johnson Space Center inform his high-reliability, evidence-based approach to workforce wellness. By positioning wellbeing as a strategic imperative, Mr. Thoman directly links staff health to patient care quality, organizational performance and long-term system sustainability.\nRahul Tiwari. Senior Vice President of Data and Analytics at CAQH (Washington, D.C.). Mr. Tiwari leads CAQH’s enterprise data, analytics and AI strategy, overseeing global teams that serve more than 4.8 million healthcare providers and nearly 1,000 health plans. His work focuses on advancing interoperability, predictive analytics and equity-driven data practices across the healthcare system. He has led initiatives that streamlined provider credentialing processes by 40% and improved the accuracy and efficiency of provider data nationwide. During his tenure at Baltimore-based Johns Hopkins Medicine, he developed a rapid-response analytics infrastructure during the Covid-19 pandemic, enabling real-time decisions on capacity, personal protective equipment distribution and vaccine strategy across six hospitals and 200-plus clinics. At Cardinal Health, he created a patented machine learning solution that integrated EHR and supply chain data, reducing product waste by 6% and saving $98 million in two years across 400 hospitals.\nJennifer Touse. Chief Legal Officer at BayCare Health System (Clearwater, Fla.). Ms. Touse leads the legal strategy for BayCare Health System, guiding a team that supports more than 33,000 team members and ensuring compliance across one of West Central Florida’s largest nonprofit academic health systems. Rising through the organization since 2011 to become the youngest member of the system’s CEO cabinet, she has played a central role in major legal and strategic milestones. In the past year, she led the replacement of a 50-year joint operating agreement with a unified corporate structure, bringing all system hospitals and services under one legal entity to ensure long-term stability. Ms. Touse also oversaw the integration of providers from major physician groups, the transition of clinics into hospital-based departments and the negotiation of a strategic collaboration with Chicago-based Northwestern Medicine. Additionally, she directed the legal acquisition of a 36-acre office park in Tampa, Fla., soon to become the BayCare Academic Health and Research Corridor, supporting academic growth and research partnerships.\nDoug Turner. Vice President of Enterprise Applications at UCI Health (Orange, Calif.). Mr. Turner leads the implementation of a $200 million Epic EHR and enterprise applications project that will integrate six UCI Health hospitals by the end of 2025. Managing a team of more than 250 IT professionals and coordinating with 600 clinical and operations staff from over 70 workgroups, he has fostered collaboration to drive critical workflow decisions across the enterprise. His leadership ensures the seamless unification of hospitals in Orange, Fountain Valley, Lakewood, Los Alamitos, Placentia Linda and the new Irvine facility. Mr. Turner’s strategic vision and relationship-building skills have been central to aligning diverse stakeholders behind this large-scale transformation. By empowering teams and maintaining clear communication, he has positioned UCI Health for improved operational efficiency and patient care delivery. His work is setting the stage for a fully integrated, modernized health system that supports both clinical excellence and long-term innovation.\nMike Valli. Chief Commercial Officer at symplr (Houston). As chief commercial officer, Mr. Valli leads all revenue-generating functions at symplr, overseeing sales, marketing and customer success to support hospitals and health systems nationwide. He has expanded adoption of the symplr operations platform, helping healthcare organizations streamline workflows, lower administrative costs and free up clinicians’ time for patient care. Previously, at Optum, Mr. Valli managed relationships with 650 provider organizations across 19 states, held full profit and loss responsibility, and drove billions of dollars in contracts and acquisitions, including a multi-year partnership with Cooperstown, N.Y.-based Bassett Healthcare Network to improve revenue cycle and analytics. Recognized among Business Insider’s “30 Under 40 Leaders in Healthcare”, he is also a frequent speaker at major industry events. His leadership emphasizes customer-first strategy, aligning solutions with the real operational pressures health systems face.\nAbbey Vandersall, MD. Senior Vice President and Chief Clinical Officer at AMSURG (Nashville, Tenn.). As the youngest executive and only physician on AMSURG’s leadership team, Dr. Vandersall oversees clinical quality, safety and patient experience across more than 250 ambulatory surgery centers serving millions annually. She launched AMSURG’s first patient experience program, achieving record satisfaction scores in the company’s 30-plus year history, and led a pilot connecting 10,000 high-risk patients to timely colon cancer screenings. Her advocacy efforts successfully reversed Blue Cross Blue Shield of Massachusetts’ decision to stop covering anesthesia for colonoscopies. Dr. Vandersall developed a first-of-its-kind value-based ASC care model that helped align enhanced reimbursement with optimal patient care. Her team’s efforts contributed to 64 AMSURG centers being named among the nation’s best by U.S. News & World Report. She has served on national health organization boards and taskforces, including the American Cancer Society’s national colorectal cancer roundtable, the Colon Cancer Alliance’s “Never Too Young” taskforce, and the Susan G. Komen Foundation board in Nashville. Prior to AMSURG, she played a key role in Nashville, Tenn.-based Envision Healthcare’s $8 billion restructuring, ensuring care continuity for 25,000 clinicians and countless patients.\nNicole Mari Varisco. Region Vice President of Market Development at CommonSpirit Health (Chicago). Overseeing a six-state region spanning more than 1,300 miles and 36 care sites, Ms. Varisco drives CommonSpirit Health’s growth strategy through data-driven planning and high-impact sales leadership. She has earned the system’s advancing leader designation for three consecutive years due to exceptional employee engagement scores on her regional sales team. Ms. Varisco played a pivotal role in launching one of the nation’s fastest-growing robotic cardiac surgery programs and in establishing both a Covid-19 vaccine call center and a Texas Southern University vaccination site, which administered tens of thousands of vaccines with a focus on underserved communities. She has also advanced workforce development by mentoring early careerists, precepting an Masters in Healthcare Administration candidate and creating the first business development internship with Texas State University. Her professional excellence is matched by her community service, including leadership roles in local youth and church organizations. She was named one of the Houston Business Journal‘s “Women Who Mean Business” in 2024.\nPooja P. Vyas, DO. System Vice President, Care Coordination Liaison and Physician Advisement for SSM Health (St. Louis). At just 36 years old, Dr. Vyas leads care coordination, clinical documentation integrity, utilization management, case management and clinical denials for SSM Health, driving measurable improvements in both patient outcomes and operational efficiency. Her initiatives have reduced unnecessary hospital admissions, enhanced documentation accuracy and streamlined care transitions, directly supporting quality care and financial sustainability. Leveraging her experience as a hospitalist, she has developed algorithms to lower readmissions and improve inpatient versus observation status determinations, while also boosting “Hospital Consumer Assessment of Healthcare Providers and Systems” scores through better physician-patient communication. Dr. Vyas’s leadership bridges frontline clinical work and executive strategy, fostering collaboration and adoption of best practices systemwide. Board-certified in internal medicine, she combines clinical expertise with business acumen to lead complex healthcare operations.\nAnne Wellington. Senior Vice President of Product Strategy and Partnerships at Press Ganey (South Bend, Ind.). Ms. Wellington leads strategy for a 70-plus solution portfolio at Press Ganey, driving integration of patient experience data into clinical workflows through partnerships like Epic’s “Partners and Pals” program. She has advanced tools that enable real-time feedback to inform provider decision-making, improving both patient and caregiver experiences. Previously, as part of software company Stanson Health’s founding team, she helped build EHR-embedded clinical decision support tools, and as executive director of the Los Angeles-based Cedars-Sinai Accelerator, she guided healthcare startups to scale within complex health systems. At Press Ganey, she has developed integrated reporting systems that streamline Magnet recognition program applications, simplify performance tracking, and support nurse engagement and retention initiatives. Her cross-disciplinary experience enables her to align technical, clinical and operational priorities, ensuring scalable, practical product development.\nJomel Whittington. President of AVALA Physician Network (Covington, La.). Mr. Whittington, the first African American president of the AVALA Physician Network, leads daily operations for 10 physician practices and has driven significant service expansion, adding orthopedics, hand surgery and spine surgery while increasing AVALA Pain’s clinic capacity by 50%. He is spearheading efforts to further grow the network by integrating primary care, urgent care and neurology services, and has built strategic partnerships with top specialists across Louisiana to enhance patient access. Before joining AVALA, he doubled the provider team at Metairie, La.-based DISC of Louisiana, optimized operations and strengthened brand awareness, transforming the spine surgery clinic into a thriving, independent practice. His earlier leadership in a Baton Rouge startup hospital included directing business operations and revenue cycle management. Mr. Whittington’s approach emphasizes innovative, patient-focused growth strategies that reduce reliance on traditional referral models while fostering direct community engagement. Active in professional and community roles, he is a member of the American College of Healthcare Executives and volunteers as a youth basketball coach and mentor.\nAllison “Allie” Wyler. President of Advocate Health Care’s North Chicago Area and President of Advocate Lutheran General Hospital (Park Ridge, Ill.). Ms. Wyler leads strategy and operations for five hospitals and 94 ambulatory clinics in the North Chicago Area, driving a culture of safety, top-decile clinical outcomes and strong engagement. Rising through the ranks since joining Charlotte, N.C.-based Advocate Health as an administrative fellow in 2010, she became the youngest-ever president of Downers Grove, Ill.-based Advocate Good Samaritan Hospital in 2021 at age 35, where she reduced turnover and vacancy rates by 50% and elevated employee engagement from the bottom quartile to among the top in U.S. hospitals. In 2024, she assumed her current role as area president and president of Lutheran General Hospital. Her leadership has earned national recognition, including Crain’s Chicago Business “40 Under 40” for 2023 and American College of Healthcare Executives Chicago Chapter’s “Young Healthcare Executive Award” in 2019. Ms. Wyler is also active in community leadership, serving on the boards of Easterseals DuPage & Fox Valley and the Junior League of Evanston-North Shore.\nMara Yancoskie. Vice President of Financial Planning and Analysis at Main Line Health (Radnor, Pa.). Ms. Yancoskie directs the operating and capital budgeting process for a nearly $3 billion integrated health system, overseeing decision support, service line reporting, cost accounting and operational finance for more than 600 employed providers. She redesigned the budget process and capital planning framework, built a multi-platform revenue model and led business planning improvements that enable faster, data-driven decision-making. Her leadership has driven over $90 million in margin improvements through transformation initiatives and operational efficiencies. As a certified net revenue analyst, she is a subject matter expert in revenue cycle implementation and a sought-after resource for reimagining processes that enhance performance and growth. Ms. Yancoskie also co-leads the finance realization committee and project priority council, aligning financial strategy with organizational priorities.\nKenny Yu. Health System Senior Director of Pharmacy Services at NYU Langone Hospitals (New York City). Mr. Yu provides strategic leadership for NYU Langone’s enterprisewide pharmacy operations, overseeing more than 900 full-time employees across inpatient, ambulatory, retail, specialty, investigational drug services and business analytics. He built NYU Langone’s 340B program from the ground up as its inaugural director, advocating nationally for its preservation and speaking on Capitol Hill about patient care and medication access. Mr. Yu has been invited to the White House to address medication quality and drug shortages, and he has contributed to numerous peer-reviewed publications and high-profile panels, including a U.S. News & World Report webinar. Stepping into his current role just before the Covid-19 vaccine rollout in November 2020, he successfully navigated pandemic demands while maintaining operational excellence. His leadership has contributed to NYU Langone earning the No. 1 quality ranking for three consecutive years and securing a top-10 national position from U.S. News & World Report.",
  "word_count": 16796,
  "scraped_at": "2026-02-14T13:22:38.410142"
}