{
  "article_id": "a9df80119f26",
  "url": "https://www.bbc.co.uk/sport/football/articles/cly3jper60yo",
  "title": "England: Michelle Agyemang helped at Euro 2025 by team-mate Alex Greenwood",
  "date": "2025-08-01T10:16:53.622Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "England family took me under their wing - Agyemang\n- Published\n\"No matter what, come to me and I will show you the ropes.\"\nThe Lionesses are not just a team, but a family according to England's breakthrough Euro 2025 star Michelle Agyemang.\nAt 19, the Arsenal striker was the youngest player in the England squad who successfully defended their European crown in Switzerland.\nShe faced a daunting experience of integrating into a successful squad, but said players like Alex Greenwood made sure they took Agyemang under their wing during the tournament.\nManchester City captain Greenwood, 31, was the youngest member of England's squad at the 2015 World Cup. Ten years later, she led by example.\nAs one of the most experienced players in the squad, with 105 caps, she made a beeline for the teenager to offer reassurance on the first day of camp.\n\"A lot of them took me in because I was the youngest in the team,\" Agyemang told BBC Breakfast. \"It can be hard sometimes but everyone was so willing to help me.\n\"They took me under their wing. I have only been around for a short time but they were so loving, kind and caring.\"\n'Everyone is valued in this team'\nBeing a Lioness is not only reserved for the players on the pitch but for the team behind the scenes, who make sure the squad can perform to their highest level.\nManager Sarina Wiegman has been praised for her role in ensuring squad players felt as important as the starting XI with Agyemang, who picked up the young player of the tournament award, saying \"everyone is valued\".\n\"Everyone, no matter your role, the backroom staff and the staff behind the staff, everyone is valued in this team and you can see it with the way we celebrated,\" Agyemang continued.\n\"We all did it together. To see it come off in the end shows how together we were and I'm so grateful that we have such a good team around us, and it made it so special.\"\n'I have never been part of anything like that'\nEngland fans have ensured Agyemang has become the subject of humorous online memes after her facial expressions of happiness and exasperation were captured on camera during the Lionesses' most testing moments.\nThe online fun is all part of the game as Agyemang's first experience of a major tournament could not have gone much better - with it ending in tears of happiness.\n\"I am not really that expressive when it comes to emotions,\" Agyemang added. \"Sometimes my facial expressions are the most you will get out of me. Especially in times like the win, a lot of gratitude is the main feeling I am feeling.\n\"I did cry a little bit because it was so surreal to see the change from the first game all the way to the final. At times it was difficult, but we made it and I was just grateful to God for that.\n\"As soon as Chloe's [Kelly] penalty went in, I was just in disbelief. Jess Carter was hugging me and I was like 'what is this, what is going on?'. It was just mad.\"\nThe scenes of sheer jubilation when captain Leah Williamson lifted the trophy for the second time in three years brought much of England to tears, with Agyemang understandably stating: \"I have never been part of anything like that before.\"\nRelated topics\n- Published27 July 2025\n- Published29 July 2025\n- Published22 July 2025",
  "word_count": 585,
  "scraped_at": "2026-02-14T11:17:41.874353"
}