{
  "article_id": "a9f6ef4fce17",
  "url": "https://www.90min.com/posts/marc-skinner-remains-defiant-as-man-utd-fall-10-points-behind-wsl-leaders",
  "title": "Marc Skinner remains defiant as Man Utd fall 10 points behind WSL leaders",
  "date": "20240122T010000Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Marc Skinner remains defiant as Man Utd fall 10 points behind WSL leaders\n- Man Utd beaten at Stamford Bridge by WSL leaders Chelsea\n- Marc Skinner spoke about the need for investment to close gap\n- Manager also reacted to growing pressure from fans\nManchester United manager Marc Skinner is adamant that his team have no choice but to keep fighting in the WSL to make up a ten-point gap that has opened to leaders Chelsea.\nUnited fell to a 3-1 defeat at Stamford Bridge on Sunday that, having gone within a whisker of winning the title last season, now leaves them fourth and struggling to contend once again.\nChelsea are the only domestic side that United have faced in their short history, beginning with a reformed first-team in 2018, and have not yet beaten. Skinner sees the difference between the club and insists it will take continued investment to close the gap, but in the short-term there can be no let up on the pitch – speaking after the game, he was passionate about the project.\n\"In relative terms to Chelsea, we’re still a young team. However, we need to continue to invest in the structure to get ourselves around to where Chelsea are with that depth and quality,\" he said.\n\"I am absolutely happy with the players. As a collective, they have always been great and we have the quality, but we need the depth and the competition [within the squad]. We need to continue to invest, as something the club are obviously ambitious to do.\n\"We were brilliant last year, almost faultless, but this year we’re going to be judged by the same mantle – of course we are. We judge ourselves by that. We want to be winning these games of football. I have no doubt where our team are heading and we will push and push and push to be one of the most successful teams in this league. Ten points, I get it, we’ve got ten points to chase, so regardless of where we are, we’ve got to have energy to chase that.\"\nSunday was a third league defeat in 11 games so far in 2023/24, already one more than in the whole of last season. At the halfway stage, United have just 18 points, compared to a year ago. Even if the title looks out of reach, the FA Cup and Carabao Cup remain up for grabs, while Skinner is defiant that even the league has plenty still to go.\n\"Still in two cup competitions and the reality is we’ve got a ten-point gap on the leaders to chase. That’s the fact in front of us. We know we’ve got to try and be perfect in every game. I still think there are points to be dropped in this league for other teams, I do,\" he stressed.\n\"I don’t think [others] are going to be perfect until the end of the season, so we’ve got to try and chase that ten-point gap down regardless. We’ve got to start with a Manchester City performance [in the Conti Cup] and an Aston Villa performance, and that’s all we can control.\"\nOne uncomfortable fact is that Skinner is facing growing fan unrest. Some supporters who travelled to Malta for a recent winter training camp were heard chanting for a change in manager, while BBC cameras at Stamford Bridge picked up a sign reading ‘Skinner Out’.\n\"The fans are absolutely entitled to do what they want, we are never going to silence any fan from having an opinion – they pay their hard-earned money,\" the boss commented.\n\"My job is stay sole-focused on what I know this team will achieve in the future, I have no doubt about. You can tell by our attitude. You can tell when a team is ready and fighting. That team out there second half, the way that we played and the way we took it to Chelsea…they’re champions!\n\"Our team was still chasing and fighting. That is a team that knows where it’s heading and that is what we should be talking about. Never ever stop any fans having their opinion, they are absolutely entitled to it. But my job is stay focused on what I want to achieve with this team and that is success.\"",
  "word_count": 716,
  "scraped_at": "2026-02-14T12:57:23.684383"
}