{
  "article_id": "aa2e6b2b7f7f",
  "url": "https://www.90min.com/emma-hayes-crowned-best-womens-coach-fifa-2024-awards",
  "title": "Emma Hayes crowned Best Women Coach at FIFA 2024 awards",
  "date": "20241218T121500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Emma Hayes crowned Best Women’s Coach at FIFA 2024 awards\n- USWNT boss Emma Hayes was named women’s coach of the year at FIFA Best awards\n- She departed WSL side Chelsea at the end of the 2023/24 season\n- The USWNT won Olympic gold in Paris over the summer\nEmma Hayes has been crowned the best women’s coach at the 2024 FIFA awards after a stellar year with Chelsea and the USWNT.\nThe 48-year-old guided Chelsea to a fifth consecutive WSL title at the end of the 2023/24 season, bringing a trophy-laden 12 years at the London club to a glittering end. Success then followed as she took on a new role as head coach of the USA team and guided them to Olympic gold at the first time of asking.\nThis latest accolade comes just a matter of months after winning the Ballon d'Or as the Women's Football Coach of the Year. This is also the second time Hayes has won the FIFA Best award since the women’s coach prize was first introduced in 2016.\nThe USWNT boss last claimed the award in 2021, ahead of former Barcelona manager Lluis Cortes and England boss Sarina Wiegman. Hayes ranked third a year prior in 2020 and was second behind Wiegman in 2023.\nJonatan Giraldez, who is now coaching Washington Spirit in the NWSL, claimed second place behind Hayes in this year’s award after a quadruple-winning season with Barcelona – which includes the Champions League. Brazil manager Arthur Elias ranked third after they clinched the silver medal at the Olympics in the summer.\n\"It's been an amazing year on many levels, but my overriding emotion is gratitude,\" Hayes said at the ceremony in Doha on Tuesday night. \"I want to thank everyone who has been on this journey with us, especially the players, coaches and staff from Chelsea and the USWNT.\n“In the middle of 2023, I never thought I would be sitting here as part of a gold medal-winning team, but I've loved working with the players and I'm very excited about 2025 and executing our WNT strategy. It's going to be an exciting time for the players as we continue to build on what we accomplished in 2024.\"\nU.S. Soccer CEO and Secretary General JT Batson added: \"We really appreciate the joy and energy Emma has brought to the team and U.S. Soccer. Emma's dedication to our players, staff and everyone who cares about soccer in the United States is inspirational and she is so deserving of this.\"",
  "word_count": 420,
  "scraped_at": "2026-02-14T12:52:46.142660"
}