{
  "article_id": "aa38d5cef4ae",
  "url": "https://www.fourfourtwo.com/news/chelseas-psr-bubble-to-burst-as-club-forced-to-sell-next-summer-report",
  "title": "Chelsea PSR bubble to burst as club  forced to sell  next summer : report",
  "date": "20250925T151500Z",
  "domain": "fourfourtwo.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chelsea's PSR bubble to burst as club 'forced to sell' next summer: report\nChelsea will be forced to tread more carefully during next summer's transfer window\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nChelsea's activity in the transfer market during recent seasons has led fans of rival clubs to question how the Blues can afford such a volume of high-profile, expensive signings without contravening the Premier League's Profitability and Sustainability rules (PSR).\nUnder BlueCo ownership, the Blues have been able to sell the Women's team and hotels on the Stamford Bridge site to sister companies, making sure they, technically, abide by English football's financial controls.\nIn Europe, however, such deals would not count towards UEFA's rules and player trading takes on greater importance.\nChelsea's finances under UEFA scrutiny\nThe 'football earnings' rule requires clubs to balance their spending with revenues. Clubs are obligated to limit their losses to €60 million over a three-year period, although this can be higher for clubs in good financial health.\nAccording to Daily Telegraph journalist Matt Law, the Blues will need to be more business-savvy next summer as the club's financial position comes under greater scrutiny by European football's governing body.\n\"Nicolas Jackson isn't in their Champions League squad. So even if they sell Nicolas Jackson, he will not count [towards complying with UEFA's rules],\" Law said on the 'London is Blue' podcast.\n\"Because it has to be people who you have to balance against people who were in your squad. So, if [Chelsea] sell [Raheem] Sterling, if they sell Jackson, if they sell [Axel] Disasi, they're not going to count.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n\"So, if they bring players into a squad next summer, they're going to have to trade again, and it's going to result in first-team players having to be sold, basically. That makes life very difficult for next summer.\"\nChelsea spent approximately £300m in the summer transfer window, recouping around £290m from player sales. Whether Enzo Maresca's side are able to repeat their strong player trading performance in 12 months' time is a different matter altogether, but could prove necessary.\nBased on Chelsea's most recently available accounts as at June 30, 2024, the club reported a pre-tax profit of £128.4 million, suggesting the organisation is in good financial health. This reflected a major improvement on the £90.1 million loss posted during the previous year.\nAlthough, without the 'repositioning' of their Women's team, which generated a £198.7m profit, Chelsea's financial footing would not appear as secure.\nClubs competing in UEFA competitions must also adhere to the 'squad cost rule', which limits a club's spending on wages, transfer fees (amortised over the contract length), and agent fees.\nThis spending is capped at 70 per cent of the club's annual revenue, which fell to £468.5m during 2023/24, down from just over half a billion the season prior.\nJoe joined FourFourTwo as senior digital writer in July 2025 after five years covering Leeds United in the Championship and Premier League. Joe's 'Mastermind' specialist subject is 2000s-era Newcastle United having had a season ticket at St. James' Park for 10 years before relocating to Leeds and later London. Joe takes a keen interest in youth football, covering PL2, U21 Euros, as well as U20 and U17 World Cups in the past, in addition to hosting the industry-leading football recruitment-focused SCOUTED podcast. He is also one of the lucky few to have 'hit top bins' as a contestant on Soccer AM. It wasn't a shin-roller.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 716,
  "scraped_at": "2026-02-14T13:21:38.657638"
}