{
  "article_id": "aa54c2413276",
  "url": "http://www.tnledger.com/Default.aspx?newsDate=3/3/2023",
  "title": "The Nashville Ledger",
  "date": "20230302T070000Z",
  "domain": "tnledger.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Not the homecoming anyone wanted\nSEC tourney should have been Miller’s moment. A shooting shifted the focus\nFor Nashville, the coming week was supposed to be a glorious start to March Madness with the Southeastern Conference returning to Bridgestone Arena to crown its men’s basketball tournament champion.\nAlabama's Miller calls fatal shooting 'really heartbreaking'\nTUSCALOOSA, Ala. (AP) — Brandon Miller spoke Wednesday about being at the scene of a fatal shooting that killed a 23-year-old mother, saying he will \"never lose sight of the fact that a family has lost one of their loved ones.\"\nNashville the big winner before tournament ever begins\nOut-of-state basketball fans – and the millions of tourism dollars they bring with them – are the lifeblood of the March 8-12 SEC Tournament frenzy in and around Bridgestone Arena. But longtime Nashville restaurateur Tom Morales is courting the local fans.\nAP: Alabama's Brandon Miller SEC player, newcomer of year\nAlabama freshman Brandon Miller, whose tremendous season on the court has been clouded by controversy off it, is The Associated Press player of the year and newcomer of the year in the Southeastern Conference.\nSEC coaches honor Vanderbilt’s Stackhouse, Robbins\nVanderbilt’s Jerry Stackhouse has been named Coach of the Year, sharing the honor with Texas A&M’s Buzz Williams, and Vanderbilt’s Liam Robbins has been named SEC Defensive Player of the Year.\n39.9°F\nA Few Clouds\nWind: calm mph\nHumidity: 58%\nEVENTS\nMonthly Chamber Coffee. This is a free networking event and members and future members are welcome to attend, remember to bring plenty of business cards. Coffee and light refreshments will be served. Maury Regional Occupational Health, 1114 W. 7th Street. Wednesday, 9-10 a.m. InformationLee’s faith-based program seeks $1.2M bailout from taxpayers\nWhen legislators set up the Governor’s Office of Faith-Based and Community Initiatives in 2019, among the selling points was its below-bargain-basement price tag.\nMonthly payments spike bad new for first-time buyers\nNashville is not alone when it comes to rising home prices, the National Association of Realtors reports. In fact, that seems to be the case in most large cities across the country, despite an overall sales slump.\nAverage long-term US mortgage rate hits 3-month high\nThe average long-term U.S. mortgage rate hit a three-month high this week, reflecting higher Treasury yields and expectations that the Federal Reserve will continue to raise its benchmark rate and keep it there until inflation recedes.\nOzburn named CEO of TriStar Centennial\nTriStar Centennial Medical Center has selected Tom Ozburn, DSc., FACHE, CMPE, as chief executive officer of the 741-bed multi-campus system of care.\nState begins payments from opioid settlements\nTennessee’s Opioid Abatement Council is making the first payments from opioid lawsuit settlements to counties totaling more than $31.4 million. The state began processing the direct payments from the Opioid Abatement Trust Fund to county governments last week.\nHonda CR-V Hybrid vs Kia Sportage Hybrid: Old reliable gets a challenge\nThe 2023 Honda CR-V and 2023 Kia Sportage are two highly rated small SUVs by Edmunds. Notably, they also come in hybrid versions that offer some compelling advantages.\nSpikes provides solid base for young entrepreneurs\nA good building starts with a substantial foundation. No matter where you go from there, that base is an opening action, an announcement, a public sign of things to come. Whether it’s a new home or the future site of industry or ideas, the foundation is the start of something exciting.\n5 ways to deal with coveting thy neighbor’s success\nIf you’ve ever scrolled through social media posts only to be gripped with envy when you see a friend posing in front of their beautiful house or enjoying themselves at a luxurious resort, then you understand how easy it is to want what other people have. Financial envy is real, and sometimes it can be ugly.\nWhat to expect: New parents’ finances need nurturing, too\nWhen you’re caring for a newborn, it can be hard enough to carve out time to shower, let alone stay on top of money tasks. In the fog of sleep deprivation, you may miss a bill payment or impulse-buy random things online to help with infant care. Suddenly, your credit scores are down and your budget is stretched.\nSkynyrd member's death signals end of era for Southern rock\nNORFOLK, Va. (AP) — Lynyrd Skynyrd guitarist Gary Rossington, who died Sunday, made it big when rock 'n' roll was still a defining cultural force on par with today's TikTok trends and superhero movies.\nFan favorite Lainey Wilson leads CMT Music Awards nominees\nNASHVILLE (AP) — Country singer Lainey Wilson is a fan favorite at this year's CMT Music Awards, where she is the leading nominee including for \"Video of the Year.\"\nTyre Nichols death spurs Justice Department police review\nMEMPHIS (AP) — The Justice Department announced Wednesday that it will review the Memphis Police Department policies on the use of force, de-escalation strategies and specialized units in response to the fatal beating of Tyre Nichols during an arrest.\nAlex Jones would get $520,000 salary under bankruptcy plan\nAlex Jones' media company has proposed a plan in its bankruptcy case to pay the conspiracy theorist $520,000 a year while leaving $7 million to $10 million annually to pay off creditors, including relatives of Sandy Hook shooting victims.\nFTC probes Twitter data practices after Elon Musk's layoffs\nWASHINGTON (AP) — The Federal Trade Commission is investigating Elon Musk's mass layoffs at Twitter and trying to obtain his internal communications as part of ongoing oversight into the social media company's privacy and cybersecurity practices, according to documents described in a congressional report.\nFox chair Murdoch says 2020 election was fair: court filings\nNEW YORK (AP) — Fox Corp. Chairman Rupert Murdoch said under oath that he believes the 2020 presidential election was free, fair and not stolen, according to court filings released Tuesday in a lawsuit over Fox News' coverage of former President Donald Trump's unfounded election fraud claims.\nElon Musk apologizes after mocking laid-off Twitter employee\nSAN FRANCISCO (AP) — If you're not told you are fired, are you really fired? At Twitter, probably. And then, sometimes, you get your job back — if you want it.\nTikTok renews push to ease fears over European data security\nLONDON (AP) — TikTok unveiled new measures Wednesday to protect European user data as it takes steps to head off further government bans on employees using the Chinese-owned video-sharing app on their work phones.\nWhat to know about prescription drugs promising weight loss\nWeightWatchers, the 60-year-old diet firm, announced this week it would acquire a telehealth company whose providers prescribe anti-obesity drugs for growing numbers of eager online subscribers.\nMaker of unproven birth drug Makena to pull from US market\nWASHINGTON (AP) — The maker of an unproven drug intended to prevent premature births says it will voluntarily remove the product from the U.S., after regulators signaled plans to follow through on a long-delayed effort to force it from the market.\nUS to relax COVID testing rules for travelers from China\nWASHINGTON (AP) — The Biden administration is preparing to relax COVID-19 testing restrictions for travelers from China as soon as Friday, according to two people familiar with the decision.\nUS investigates Tesla for steering wheels that can fall off\nDETROIT (AP) — U.S. auto safety regulators have opened an investigation into Tesla's Model Y SUV after getting two complaints that the steering wheels can come off while being driven.\nFrom marketing to design, brands adopt AI tools despite risk\nEven if you haven't tried artificial intelligence tools that can write essays and poems or conjure new images on command, chances are the companies that make your household products are already starting to do so.\nEPA proposes stricter limits on coal plant water pollution\nWASHINGTON (AP) — The Biden administration on Wednesday proposed strengthening a rule aimed at reducing polluted wastewater from coal-burning power plants that has contaminated streams, lakes and underground aquifers across the nation.\nTikTok campaign targets Biden on proposed Alaska oil project\nANCHORAGE, Alaska (AP) — A social media campaign urging President Joe Biden to reject an oil development project on Alaska's remote North Slope has rapidly gained steam on TikTok and other platforms, reflecting the unease many young Americans feel about climate change.\nPowell says 'no decision' on the Fed's next move on rates\nWASHINGTON (AP) — Federal Reserve Chairman Jerome Powell stressed Wednesday that the central bank's policymakers have yet to decide how large an interest rate hike to impose at its next meeting in two weeks in its drive to defeat high inflation.\nJanuary US job openings dip, but still high at 10.8 million\nWASHINGTON (AP) — U.S. employers posted 10.8 million job openings in January, indicating the American job market continues to run too hot for the inflation fighters at the Federal Reserve.\nWall Street steadies itself a day after its steep tumble\nNEW YORK (AP) — Stocks steadied on Wall Street Wednesday and closed with a mixed finish, a day after worries about interest rates sent them to one of their worst tumbles of the year.\nWhite House, states tackle 'junk fees' that cost consumers\nWASHINGTON (AP) — The White House brought together state lawmakers, federal officials and others Wednesday to trade ideas about how to fight \"junk fees\" that inflate the cost to consumers of everything from hospital visits and airline tickets to student loans and concert seats.\nAs bourbon booms, thirst for rare brands breeds skullduggery\nSALEM, Ore. (AP) — Buttery, smooth, oaky. These are characteristics of the best bourbons, and a growing cult of aficionados is willing to pay an astonishing amount of money for these increasingly scarce premium American spirits — and even bend or break laws.\nSwiss bankers accused of lax control of Putin pal's accounts\nGENEVA (AP) — Four former bankers with the now-shuttered Swiss affiliate of a major Russian bank have gone on trial over allegations that they didn't properly check accounts opened in the name of a Russian cellist with longtime ties to President Vladimir Putin.\nHong Kong's Cathay Pacific posts $834 million loss for 2022\nHONG KONG (AP) — Cathay Pacific Airways Ltd. said it was ready to rebuild as Hong Kong opened up to global visitors despite reporting wider losses in 2022.\nAdidas earnings take beating on breakup with Ye, China slump\nFRANKFURT, Germany (AP) — Adidas' breakup with the rapper formerly known as Kanye West and the inability to sell his popular Yeezy line of shoes helped batter earnings at the end of last year, leading to a net loss of 513 million euros ($540 million).\nBiden budget aims to cut deficits nearly $3T over 10 years\nWASHINGTON (AP) — President Joe Biden's upcoming budget proposal aims to cut deficits by nearly $3 trillion over the next decade, the White House said Wednesday.\nUS sanctions Iranian officials over women's right abuses\nWASHINGTON (AP) — The U.S. is imposing more sanctions on Iran, hitting people and firms accused of violating women's rights during nationwide anti-government protests over the treatment of young women and girls.\nFBI tested by attacks, politically explosive investigations\nWASHINGTON (AP) — Three days after federal agents searched former President Donald Trump's Florida home for classified documents, FBI Director Christopher Wray emailed his workforce urging them to tune out criticism from those who \"don't know what we know and don't see what we see.\"\nBiden upends politics, precedent in pivot on DC crime law\nWASHINGTON (AP) — President Joe Biden's support of a Republican resolution to block new District of Columbia crime laws has split members of his own party amid rising concerns about crime in the nation's capital and other cities.\nMcClellan becomes 1st Black woman for Virginia in Congress\nWASHINGTON (AP) — Democrat Jennifer McClellan, holding the receipt for a poll tax her father once had to pay tucked into the pages of a family Bible, was sworn into the U.S. House on Tuesday, becoming the first Black woman to represent Virginia in Congress.\nPettersson lifts Canucks to 4-3 win over Predators in SO\nVANCOUVER, British Columbia (AP) — Elias Pettersson scored the only goal in the shootout and the Vancouver Canucks beat the Nashville Predators 4-3 on Monday night.\nFlorida lab to test 550 Tennessee rape kits with $1.5M grant\nNASHVILLE (AP) — Tennessee is outsourcing the testing of at least 550 rape kits to a private Florida lab through a $1.5 million federal grant, the state's lead investigative agency announced Monday in a move aimed at reducing processing times that have drawn scrutiny.\nVoting tech firm spotlights Murdochs in defamation suit\nNEW YORK (AP) — A voting tech company suing Fox News is arguing that Fox Corp. leaders Rupert and Lachlan Murdoch played a leading role in airing false claims that the technology helped \"steal\" the 2020 presidential election from former President Donald Trump.\nMilitary veteran convicted of obstruction in Capitol riot\nWASHINGTON (AP) — A military veteran accused of telling an undercover FBI agent about a plan to \"wipe out\" the nation's Jewish population was convicted on Tuesday of storming the U.S. Capitol to stop Congress from certifying President Joe Biden's 2020 electoral victory.\nHope Hicks meets with NY prosecutors investigating Trump\nNEW YORK (AP) — Donald Trump's former spokesperson Hope Hicks met Monday with Manhattan prosecutors who are investigating hush-money payments made to women on the ex-president's behalf — the latest member of the Republican's inner circle to be questioned in the renewed probe.\nSoFi Bank sues to block Biden's student loan payment pause\nWASHINGTON (AP) — A private bank is trying to force the Biden administration to end its pause on federal student loan payments, arguing the moratorium has no legal basis and has cost the bank, known for its refinancing business, millions of dollars in profits.\nTucker Carlson amplifies Jan. 6 lies with GOP-provided video\nWASHINGTON (AP) — Handed some 41,000 hours of Jan. 6 security footage, Fox News' Tucker Carlson has launched an impassioned new effort to explain away the deadly Capitol attack, linking the Republican Party ever more closely to pro-Trump conspiracy theories about the 2021 riot.\nFDA: Two more eyedrops brands recalled due to risks\nWASHINGTON (AP) — U.S. health officials are alerting consumers about two more recalls of eyedrops due to contamination risks that could lead to vision problems and serious injury.\nWeightWatchers gets into prescription weight loss business\nWeightWatchers soared before the opening bell Tuesday after the company said it was getting into the prescription drug weight loss business with the acquisition of Sequence.\nUS sues to block JetBlue from buying Spirit Airlines\nThe Biden administration sued on Tuesday to block JetBlue Airways from buying Spirit Airlines, saying the deal would reduce competition and drive up air fares for consumers.\nPowell signals increased rate hikes if economy stays strong\nWASHINGTON (AP) — The Federal Reserve could increase the size of its interest rate hikes and raise borrowing costs to higher levels than previously projected if evidence continues to point to a robust economy and persistently high inflation, Chair Jerome Powell told a Senate panel Tuesday.\nUS economy sending mixed signals: Here's what it all means\nWASHINGTON (AP) — Maybe it was just too good to be true.\nStocks tumble on fears about faster rate hikes, Dow down 570\nNEW YORK (AP) — Stocks sank Tuesday after the head of the Federal Reserve warned it could turn the dial back up on its hikes to interest rates if pressure stays high on inflation. The warning shook markets and raised worries about a possible recession down the line.\nHershey debuts plant-based Reese's Cups, chocolate bars\nReese's Peanut Butter Cups are getting the vegan treatment.\nLego posts boost in profit, sales as it raised some prices\nCOPENHAGEN, Denmark (AP) — Lego said Tuesday that profits increased by 5% in 2022 from a year earlier and sales rose even as it raised prices on higher-ticket toys.\nChina's trade shrinks as Western demand weakens\nBEIJING (AP) — China's trade contracted again in January and February as U.S. and European demand weakened in the face of interest rate hikes, adding to pressure on official efforts to revive economic growth following the end of anti-virus controls.\nBiden says new taxes on the rich can help save Medicare\nWASHINGTON (AP) — President Joe Biden on Tuesday proposed new taxes on the rich to help fund Medicare, saying the plan would help to extend the insurance program's solvency by 25 years and provide a degree of middle-class stability to millions of older adults.\nIn reversal, Biden weighs detaining migrant families\nWASHINGTON (AP) — The Biden administration is considering detaining migrant families who cross into the U.S. illegally as it prepares to end COVID-19 restrictions at the U.S.-Mexico border, according to U.S. officials familiar with the plans. That would be a major reversal after officials in late 2021 stopped holding families in detention facilities.\nBiden to host 2nd state visit, for South Korean leader Yoon\nWASHINGTON (AP) — President Joe Biden will host the second state visit of his administration, for South Korean President Yoon Suk Yeol, the White House announced on Tuesday.\nUS sees China propaganda efforts becoming more like Russia's\nWASHINGTON (AP) — China has long been seen by the U.S. as a prolific source of anti-American propaganda but less aggressive in its influence operations than Russia, which has used cyberattacks and covert operations to disrupt U.S. elections and denigrate rivals.\nRepublicans issue subpoenas to former school board officials\nWASHINGTON (AP) — House Republicans issued another series of subpoenas Monday as part of an ongoing investigation into what they contend is the mistreatment of parents who protested \"woke\" school board policies.\nManafort, US government settle civil case for $3.15 million\nWASHINGTON (AP) — Paul Manafort, the former chairman of Donald Trump's 2016 presidential campaign, has agreed to pay $3.15 million to settle a civil case filed by the Justice Department over undeclared foreign bank accounts.\nExxon Mobil sued as 5 nooses displayed at Louisiana facility\nExxon Mobil Corp. violated federal law for failing to take sufficient action as five hangman's nooses were displayed at its facility in Baton Rouge, Louisiana, the U.S. government said in a lawsuit.\nTesla price cuts: Flagging demand or tactic to boost sales?\nDETROIT (AP) — In explaining why Tesla Inc. keeps cutting prices on its electric vehicles, the auto industry is pretty much divided into two camps.\nSouth Carolina offers $1.3B to new Scout electric SUV maker\nCOLUMBIA, S.C. (AP) — South Carolina's governor said Monday he is going to ask lawmakers to approve nearly $1.3 billion to bring to the state a new electric vehicle plant by a Volkswagen Group-backed group trying to revive a brand that was a 1960s forerunner to today's SUVs.\nTwitter glitches as links, images fail to load\nTwitter experienced a bevy of glitches Monday as links stopped working, some users were unable to log in and images were not loading for others.\n'Dilbert,' Scott Adams draw ire from fellow cartoonists\nNEW YORK (AP) — Cartoonists are pushing back against racist remarks made by \"Dilbert\" creator Scott Adams, with one artist even using his own strip this week to lampoon the disgraced cartoon now dropped by newspapers nationwide.\nFox libel defense at odds with top GOP presidential foes\nNEW YORK (AP) — Fox News is on an unlikely collision course with two leading contenders for the Republican presidential nomination over the rights of journalists.\nChief of 2023 climate talks: 'Houston, we have a problem'\nSultan al-Jaber, CEO of the Abu Dhabi National Oil Co., who will lead international climate talks later this year, told energy industry power players on Monday that the world must cut emissions 7% every year and eliminate all emissions of methane, strong comments from an oil executive.\nNations reach accord to protect marine life on high seas\nWASHINGTON (AP) — For the first time, United Nations members have agreed on a unified treaty to protect biodiversity in the high seas - representing a turning point for vast stretches of the planet where conservation has previously been hampered by a confusing patchwork of laws.\nIn 'junk fee' fight, US details airline family seating rules\nThe Transportation Department is rolling out a \"dashboard\" to let travelers see at a glance which airlines help families with young children sit together at no extra cost.\nInflation pressures put Powell in spotlight before Congress\nWASHINGTON (AP) — When Federal Reserve Chair Jerome Powell last appeared before Congress, in June 2022, inflation had reached a four-decade high of nearly 9% and showed no sign of easing.\nWall Street holds steady ahead of a potentially big week\nNEW YORK (AP) — Stocks were mixed in quiet trading Monday as Wall Street stays in a holding pattern ahead of a potentially big week.\nMade in the USA? Proposed rule clarifies grocery meat labels\nShoppers could soon find it easier to tell if those grocery store steaks or pork chops were really \"Made in the USA.\"\nAltria makes $2.75B investment in e-cigarette startup NJOY\nDays after exiting its stake in troubled electronic cigarette maker Juul, Altria announced a $2.75 billion investment in rival electronic cigarette startup NJOY.\nUnions vow to shut France's economy down amid pension battle\nPARIS (AP) — Roads blocked, oil refineries disrupted, planes grounded and trains halted — unions are threatening to shut down France's economy this week in what they hope is their toughest riposte yet to President Emmanuel Macron's plan to raise the retirement age.\nChinese planners promise 12 million jobs, economic rebound\nBEIJING (AP) — Chinese economic officials expressed confidence Monday they can meet this year's growth target of \"around 5%\" by generating 12 million new jobs and encouraging consumer spending following the end of anti-virus controls that kept millions of people at home.\nBiden's upcoming budget part of 2024 political messaging\nWASHINGTON (AP) — President Joe Biden has decided to get out of the White House to unveil his budget this week and instead promote it in Pennsylvania, a must-win state in 2024.\nDC to pull new crime law; Senate still plans to reject it\nWASHINGTON (AP) — The head of the Washington, D.C., Council said Monday he is withdrawing a sweeping rewrite of the capital city's criminal code from consideration, just before a U.S. Senate vote that seemed set to overturn the measure. But the move will not prevent the Senate vote or spare President Joe Biden a politically charged decision on whether to endorse the congressional action.\nThousands of pro-Trump bots are attacking DeSantis, Haley\nWASHINGTON (AP) — Over the past 11 months, someone created thousands of fake, automated Twitter accounts — perhaps hundreds of thousands of them — to offer a stream of praise for Donald Trump.\nVanderbilt center Robbins out for the season with leg injury\nNASHVILLE (AP) — Vanderbilt has announced on social media that scoring leader Liam Robbins will miss the rest of the season with a leg injury sustained early in Wednesday's 68-66 victory at No. 23 Kentucky.\nWright's late jumper lifts VU past No. 23 Kentucky; Robbins likely lost for season\nLEXINGTON, Ky. (AP) — Shots finally started falling again for Jordan Wright, whose boldest attempt came with the game on the line.\nTennessee PG Zakai Zeigler suffers season-ending knee injury\nKNOXVILLE (AP) — Tennessee point guard Zakai Zeigler will miss the rest of the season with a knee injury.\nLankinen leads Predators past Panthers 2-1\nSUNRISE, Fla. (AP) — Kevin Lankinen made 30 saves and the Nashville Predators put a dent in the playoff hopes of the Florida Panthers with a 2-1 win Thursday night.\nVideo shows Memphis jailers beating Black inmate who died\nMEMPHIS (AP) — A Black man having a psychotic episode died in custody last fall after Memphis jailors punched, kicked and kneeled on his back during a confrontation, according to a video released this week by a Tennessee prosecutor.\nTwo Americans arrested on charges of selling tech to Russia\nWASHINGTON (AP) — The Justice Department on Thursday arrested two Kansas men on allegations that the pair illegally exported aviation-related technology to Russia and provided repair services for the equipment.\nWalgreens won't sell abortion pill by mail in 20 states\nDEERFIELD, Ill. (AP) — Walgreens on Thursday said it won't sell an abortion pill by mail in 20 conservative-led states.\nThe implications of Walgreens' decision on abortion pills\nWalgreens says it will not start selling an abortion pill in 20 states that had warned of legal consequences if it did so.\nFord to raise production as US auto sales start to recover\nDEARBORN, Mich. (AP) — Ford will increase production of six models this year, half of them electric, as the company and the auto industry start to rebound from sluggish U.S. sales in 2022.\nTesla gets $330M tax deal for Nevada expansion, truck plant\nLAS VEGAS (AP) — Tesla won more than $330 million in tax breaks from Nevada on Thursday for the company's commitment to a massive expansion of its sprawling vehicle battery facilities east of Reno, including the construction of a new electric semi-truck factory.\nBetting on social media as a news destination for the young\nNEW YORK (AP) — If young people are spending so much time on social media, it stands to reason that's a good place to reach them with news.\nStocks rally, close out their first winning week in last 4\nNEW YORK (AP) — Stocks rallied on Wall Street, climbing to their biggest gain in six weeks.\nAmazon pauses construction on second headquarter in Virginia\nNEW YORK (AP) — Amazon is pausing construction of its second headquarters in Virginia following the biggest round of layoffs in the company's history and shifting landscape of remote work.\nNordstrom closing its Canadian stores, cutting 2,500 jobs\nTORONTO (AP) — Nordstrom Inc. announced Thursday it is closing all of its Canadian stores and cutting 2,500 jobs as it winds down operations in the country.\nChina accuses US of attacking companies after export curbs\nBEIJING (AP) — China accused Washington on Friday of improperly attacking Chinese companies after genetics analysis giant BGI Group and 17 others were hit with curbs on access to U.S. technology on security or human rights grounds.\nDoctor: Lesion removed from Biden's chest was cancerous\nWASHINGTON (AP) — A skin lesion removed from President Joe Biden's chest last month was a basal cell carcinoma — a common form of skin cancer — his doctor said Friday, adding that no further treatment was required.\nUS sanctions Russian officials over dissident's detention\nWASHINGTON (AP) — The U.S. has imposed sanctions and visa restrictions on five Russian officials and an expert witness involved in the incarceration of Vladimir Kara-Murza, a Russian opposition leader who has been imprisoned in Moscow since April for speaking out against Russia's invasion of Ukraine.\nBusinessman Perry Johnson announces 2024 presidential bid\nOXON HILL, Md. (AP) — Republican businessman Perry Johnson has announced his long-shot bid for president.\nHow Biden leaves wiggle room to opt against reelection bid\nWASHINGTON (AP) — President Joe Biden exudes confidence as the next race for the White House approaches.\nBiden, Scholz huddle on Ukraine war at White House\nWASHINGTON (AP) — German Chancellor Olaf Scholz said Western allies would support Ukraine for \"as long as it takes\" as he visited the White House on Friday for a private meeting with U.S. President Joe Biden.\nUS to send more ammo, folding armored bridges to Ukraine\nWASHINGTON (AP) — The U.S. is expected to announce a new package of military aid for Ukraine Friday, including —for the first time — eight armored vehicles that can launch bridges and allow troops to cross rivers or other gaps, U.S. officials said Thursday.\nAntetokounmpo, Forsberg join Nashville SC's ownership group\nNASHVILLE (AP) — Milwaukee Bucks star Giannis Antetokounmpo and Nashville Predators forward Filip Forsberg have joined the ownership group of Major League Soccer's Nashville SC.\nTennessee GOP lawmaker apologizes over 'hanging' comment\nNASHVILLE (AP) — A Tennessee Republican lawmaker on Thursday apologized after asking earlier this week if \"hanging by a tree\" could be added to the state's execution methods, a comment that has shocked Black lawmakers who point to the state's dark history of lynching.\nAs Tennessee, others target drag shows, many wonder: Why?\nNASHVILLE (AP) — \"If I hadn't been a girl, I'd have been a drag queen.\" Dolly Parton has uttered those words famously and often. But if she really were a drag queen, one of Tennessee's most famous daughters would likely be out of a job under legislation signed into law by Republican Gov. Bill Lee on Thursday.\nTennessee measure restricting drag shows heads to governor\nNASHVILLE (AP) — Tennessee lawmakers advanced legislation Thursday that would severely limit where certain drag shows can take place, a proposal Republican Gov. Bill Lee has vowed to sign into law.\nTennessee pushes to define 'sex,' could risk federal funding\nNASHVILLE (AP) — Tennessee Republican lawmakers on Wednesday advanced legislation that would prevent transgender people from changing their driver's licenses and birth certificates, a move that officials warn could cost the state millions in federal funding.\nTrump can be sued for Jan. 6 riot harm, Justice Dept. says\nWASHINGTON (AP) — Former President Donald Trump can be sued by injured Capitol Police officers and Democratic lawmakers over the Jan. 6, 2021, insurrection at the U.S. Capitol, the Justice Department said Thursday in a federal court case testing Trump's legal vulnerability for his speech before the riot.\nLabor judge: Starbucks violated worker rights in union fight\nA federal labor judge has ordered Starbucks to reinstate seven fired workers, reopen a shuttered location and stop infringing on workers' rights after finding that the company violated labor laws \"hundreds of times\" during a unionization campaign in Buffalo, New York.\nJudges nixes shareholder claims against McDonald's directors\nDOVER, Del. (AP) — A Delaware judge has dismissed claims against directors of McDonald's in a shareholder lawsuit challenging their handling of sexual harassment by former CEO Steve Easterbrook and the company's former top human resources executive.\nDemocrats ask Fox not to push 'propaganda' on 2020 election\nWASHINGTON (AP) — The two top Democrats in Congress are asking Fox News executives not to spread \"grave propaganda\" about the 2020 election and are demanding that commentators who have falsely suggested that the election was stolen acknowledge on the air that they were wrong.\nTwitter's new 'violent speech' policy similar to past rules\nSAN FRANCISCO (AP) — Twitter on Wednesday unveiled a new policy prohibiting \"violent speech\" on its platform, though the rules appear very similar to guidelines against violent threats that the company had on its books before Elon Musk took it over.\nCommunities await first US limits on 'forever chemicals'\nThe Environmental Protection Agency is expected to propose restrictions on harmful \"forever chemicals\" in drinking water after finding they are dangerous in amounts so small as to be undetectable. But experts say removing them will cost billions, a burden that will fall hardest on small communities with few resources.\nFederal Reserve officials sound warnings about higher rates\nWASHINGTON (AP) — A run of strong economic data and signs that inflation remains stubbornly high could lead the Federal Reserve to raise its benchmark rate higher in the coming months than it has previously forecast, several Fed officials say.\nApplications for jobless claims fall for 3rd consecutive week\nThe number of people applying for unemployment benefits in the U.S. fell for third straight week. That's good news for American workers, but potentially bad news in the fight against inflation by the Federal Reserve, which has been ratcheting up its benchmark interest rate for a year in an effort to cool the economy, loosen the labor market and tame inflation.\nEurope inflation eases slightly but consumer pain persists\nFRANKFURT, Germany (AP) — Inflation eased only slightly in the 20 countries that use the euro currency as the pain from higher costs for food and fuel persists and gives the European Central Bank no reason to slow interest rate increases aimed at getting prices back under control.\nChina looks to consumers to drive economic rebound\nBEIJING (AP) — Chinese leader Xi Jinping's agenda for the annual meeting of the ceremonial legislature: Revive the economy by encouraging consumers to spend more now that severe anti-virus controls have ended, and install a government of loyalists to intensify Communist Party control over the economy and society.\nStocks climb to send Wall Street to first gain in 3 days\nNEW YORK (AP) — Stocks rose Thursday for their first gain in three days, even as bond yields climbed to tighten the squeeze on Wall Street.\nWalmart to expand 28 stores with health care centers in 2024\nWalmart plans to add more than two dozen health care centers to some of its stores next year, as the retailer moves deeper into providing primary care and other services.\nMacy's Q4 sales, profit, outlook, impress in rough terrain\nNEW YORK (AP) — Macy's profit and sales for the holiday quarter slid with inflation leading some customers to pull back, but it beat Wall Street expectations and its outlook for 2023 didn't disappoint given the uncertain economic environment.\nUK is grappling with vegetable shortages. How did it happen?\nLONDON (AP) — When European Union chief Ursula von der Leyen visited Britain last week, some joked on social media: Can you please bring us some tomatoes?\nRep. George Santos under investigation by House Ethics panel\nWASHINGTON (AP) — The House Ethics Committee announced Thursday it is launching an investigation into embattled Republican Rep. George Santos, the New York congressman whose lies and embellishments about his resume and personal life have drawn deep scrutiny.\nBiden rallies Senate Democrats, endorses Republican measure\nWASHINGTON (AP) — President Joe Biden visited the Senate on Thursday to demonstrate unity among Democrats — but he ended up endorsing a Republican priority instead.\nGOP senators: Computer chip money underwriting 'woke' agenda\nWASHINGTON (AP) — Republican senators are accusing the Biden administration of using $39 billion meant to build computer chip factories to further \"woke\" ideas such as requiring some recipients to offer child care and encouraging the use of union labor.\nLegal fight over student debt a prelude to political battle\nWASHINGTON (AP) — Facing the possibility that the Supreme Court will reject President Joe Biden's plan for student loan forgiveness, the White House is aiming to turn the political heat toward Republicans while deflecting criticism from disappointed borrowers.\nWhite House cybersecurity strategy stresses software safety\nWASHINGTON (AP) — An ambitious and wide-ranging White House cybersecurity plan released Thursday calls for bolstering protections on critical sectors and making software companies legally liable when their products don't meet basic standards. The strategy document promises to use \"all instruments of national power\" to pre-empt cyberattacks.\nRussian envoy says nuclear powers may clash over Ukraine\nGENEVA, Switzerland (AP) — A senior Russian diplomat warned Thursday that increasing Western support for Ukraine could trigger an open conflict between nuclear powers.\nScholz asks China to refrain from sending weapons to Russia\nBERLIN (AP) — German Chancellor Olaf Scholz on Thursday called on China to refrain from sending weapons to Russia and instead use its influence to press Moscow for the withdrawal of Russian troops from Ukraine.\nBiden begins push for funding for pandemic fraud measures\nPresident Joe Biden's administration is asking Congress to agree to pay more than $1.6 billion to help clean up the mess of fraud against the massive government coronavirus pandemic relief programs.\nMcCarthy, GOP introduce measure to protect 'parents' rights'\nWASHINGTON (AP) — House Republicans pressed ahead Wednesday with one of the central planks of their midterm election campaign, introducing legislation to give parents more of a say in school curriculum.\nHunter Biden probe free of interference, Garland pledges\nWASHINGTON (AP) — Attorney General Merrick Garland vowed Wednesday he won't interfere with an investigation into Hunter Biden's taxes, a probe that's continuing to unfold as congressional Republicans intensify their focus on the president's son.",
  "word_count": 5969,
  "scraped_at": "2026-02-14T12:52:02.847968"
}