{
  "article_id": "aa604460b833",
  "url": "https://azdailysun.com/entertainment/chris-rock-speaks-about-oscars-slap-pete-davidson-gets-serious-with-girlfriend-and-more-celeb/article_e782f344-5726-5a3b-a1b2-ba2cfdde7d7a.html",
  "title": "Chris Rock speaks about Oscars slap , Pete Davidson  gets seriou with girlfriend , and more celeb news",
  "date": "20230306T063000Z",
  "domain": "azdailysun.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chris Rock finally speaks publicly about Will Smith's Oscars slap\nChris Rock accused Will Smith of \"practicing selective outrage\" and mocked the infidelity rumours surrounding the 'King Richard' star and his wife Jada Pinkett Smith in his first public comments since being slapped at the Oscars by the actor.\nCeleb news for the week of Feb. 27\nJonathan Majors and Michael B Jordan want to make more movies together\nUpdatedJonathan Majors and Michael B. Jordan are planning to make more films together.\nThe two stars are currently promoting their latest movie 'Creed III' and had such a good time working on the project - which Michael also directed, as well as starring in as Adonis Creed - they hope to develop an enduring partnership.\nElvis Costello describes the late Burt Bacharach as an 'extremist'\nUpdatedElvis Costello has described the late Burt Bacharach as \"extreme in love and invention\".\nThe songwriting pals first met in 1989 while working at the same recording studio and worked together for almost three decades.\n'I shouldn't have done it!' Jason Statham reveals worst stunt injuries\nUpdatedJonathan Statham had endured \"so many injuries\" over the course of his acting career.\nThe 55-year-old actor has performed a variety of stunts in various action films over the years and has ended up with injuries such as a torn bicep and almost \"faceplanted\" the ground at a speed of 30mph.\nJoe Biden's attendance at King Charles' coronation in doubt\nUpdatedJoe Biden may not attend King Charles' coronation.\nThe 80-year-old US president will be invited to Westminster Abbey in London on 6 May to see the monarch formally crowned alongside his wife, Queen Consort Camilla, but White House officials have confirmed it is not yet clear if he will be there.\nEverything Everywhere All At Once sweeps the board at Independent Spirit Awards\nUpdated'Everything Everywhere All at Once' was the big winner at the Independent Spirit Awards on Saturday (04.03.23), taking home seven prizes.\nThe martial arts fantasy scooped the night's top prize, for Best Feature, ahead of 'Bones and All', 'Our Father, the Devil', 'Tar', and 'Women Talking', and there were also wins for Michelle Yeoh, who scooped Best Lead Performance, Ke Huy Quan, who took home Best Supporting Performance, and Stephanie Hsu for Best Breakthrough performance, as well as The Daniels in the Best Director and Best Screenplay categories, and Best Editing for Paul Rogers.\n'Well see': Lana Del Rey hints Glastonbury appearance could be in doubt\nUpdatedLana Del Rey has hinted she could pull out of performing at Glastonbury.\nThe 'Born to Die' singer wasn't impressed that organisers didn't announce she will have one of the top slots at this year's festival when they released the first wave of artists on the line-up earlier this week, with headliners Arctic Monkeys, Guns N' Roses and Sir Elton John listed at the top of the promotional poster alongside Lizzo - who organiser Emily Eavis said would have headlined if the 'Welcome to the Jungle' hitmakers hadn't already been promised top billing - and then the rest of the acts mentioned in alphabetical order.\nJackie Chan, Rose Byrne, John Cena and more to join Seth Rogen in Teenage Mutant Ninja Turtles: Mutant Mayhem\nUpdatedSeth Rogen will be joined in 'Teenage Mutant Ninja Turtles: Mutant Mayhem' by Jackie Chan, Rose Byrne and John Cena.\nThe 40-year-old actor is producing the movie and voicing warthog mutant Bebop and on Saturday (04.03.23) he introduced lead cast members Micah Abbey, Shamon Brown Jr., Nicolas Cantu and Brady Noon - who will voice turtles Donatello, Michaelangelo, Leonardo and Raphael respectively - to the world at the Nickelodeon Kids' Choice Awards, as well as revealing the rest of the all-star line-up.\n'Anything is possible!' Lisa Ann Walter muses on the idea of a Parent Trap remake\nLisa Ann Walter thinks a remake of 'The Parent Trap' would be \"possible\".\nThe 59-year-old actress played the role of housekeeper Chessy in the 1998 Disney comedy - which saw Lindsay Lohan make her motion picture debut as long-lost twins Hallie Parker and Annie James who switch places in order to reunite their parents - and she is convinced that any potential reboot would be \"genius\", as long as original screenwriter and director Nancy Meyers is on board.\nThe Last of Us and The Mandalorian's Pedro Pascal finds his fan-following 'overwhelming' at times\n'The Last of Us' and 'The Mandalorian' star Pedro Pascal admits it can get \"overwhelming\" coping with his massive fanbase.\nThe 47-year-old actor plays fan-favourites Joel in the post-apocalyptic drama series based on the video games of the same name and the titular role in the 'Star Wars' spin-off, and although he loves the \"connection\" he has with fans of the cult shows, it can get intense at times.\nRebel Wilson's dig at Meghan: 'She's not as warm or cool as lovely Prince Harry'\nUpdatedRebel Wilson has declared the Duchess of Sussex isn't as \"naturally warm\" as her husband Prince Harry.\nThe 'Pitch Perfect' actress, 43, said she met the couple at their US home with her mum, and admitted duchess Meghan, 41, wasn't as \"cool\" as 38-year-old Harry - but admitted it may have been down to her mother putting the former 'Suits' actress on the spot with personal questions.\nPrince Harry 'smothers' his kids with love so they won't be scarred with 'traumas'\nUpdatedPrince Harry says he \"smothers\" his two children with love so they won't be doomed to experience his \"traumas\".\nThe Duke of Sussex, 38, said he was showering his son Archie, three, and 20-month-old daughter Lilibet with love in a chat with trauma expert Dr Gabor Maté, 79, online on Saturday (04.03.23) in a discussion that took in his mental health and drug use.\nPrince Harry: 'I'm NOT a victim out for sympathy - I'm doing an act of service'\nUpdatedPrince Harry insists he is not a \"victim\" searching for sympathy over his life.\nThe royal instead thinks sharing intimate details of his life is and \"act of service\" for the world, he said during his 90-minute online sit-down with trauma specialist and self-help guru Dr Gabor Maté on Saturday. (04.03.23)\nMORE Prince Harry drug confessions: 'Marijuana really helped me - but coke did nothing'\nUpdatedPrince Harry says marijuana helped him cope with his mental trauma.\nThe Duke of Sussex, 38, opened up about his life and family in a 90-minute online chat with Dr Gabor Maté, 79, on Saturday (04.03.23) and also admitted cocaine didn't do \"anything\" for him when he was struggling mentally.\nIdris Elba: 'It's MY prerogative to stop labelling myself a black actor'\nUpdatedIdris Elba says it is his \"prerogative\" to stop referring to himself as a \"black actor\".\nThe 'Luther' star, 50, was hit with a flood of online criticism last month when he revealed in an interview with Esquire he no longer applies the label to himself as he felt it put him in \"a box\" and promoted the world's obsession with dividing people into races.\nStephen 'tWitch' Boss' widow Allison Holker tells their kids they will find 'courage'\nUpdatedStephen 'tWitch' Boss' widow Allison Holker has told her children they will find the \"courage\" to \"hold each other up\" three months after their dad's suicide.\nThe 35-year-old professional dancer was left devastated when Stephen was found dead on December 13 aged 40, and has largely taken time out from social media since his death aside from paying tribute to the choreographer and DJ, but on Saturday (04.03.23) she used her Instagram to send a message of support to her three kids.\nKim Kardashian ready to date again\nUpdatedKim Kardashian is ready to date again.\nThe 42-year-old mother of four - who enjoyed a nine-month relationship with comedian Pete Davidson following the breakdown of her marriage to rapper Kanye West - has asked friends to set her up, but insisted she doesn't want to date any celebrities.\nKaty O'Brian: Why I said no to starring in a huge Hollywood franchise\nUpdatedKaty O'Brian turned down a role in a \"huge project\" because she wanted to diversify her career.\nThe 33-year-old actress trained as a martial artist before launching a career in Hollywood and after appearing as a henchwoman in Marvel's 'Agents of S.H.I.E.L.D.' and Major Sara Grey in 'Black Lightning', she had to learn to say no to some big movie roles so she could avoid being typecast.\nTessa Thompson: Stallone is still part of the DNA of Creed\nUpdatedTessa Thompson says Sylvester Stallone \"felt ever-present\" on the set of 'Creed 3'.\nAlthough Stallone's Rocky Balboa appeared in 'Creed' and its sequel, the 76-year-old actor did not return for the third movie in the franchise but Tessa believes he is still a big \"part of the DNA\" of the series.\n'Three is enough for us': Pussycat Doll Kimberly Wyatt doesn't want any more kids\nUpdatedPussycat Dolls singer Kimberly Wyatt's family is complete.\nThe 41-year-old star has three kids - Willow, eight, Maple, five, and three-year-old Senna - with husband Max Rogers, and she admits her third child was a \"massive surprise\" and so she has no desire to add to their brood.\nKimberly Wyatt regrets Pussycat Dolls turning down Lady Gaga's Just Dance\nUpdatedPussycat Doll Kimberly Wyatt says her biggest regret is the band not accepting Lady Gaga's hit 'Just Dance'.\nThe girl group - also comprising Nicole Scherzinger, Ashley Roberts, Carmit Bachar, Melody Thornton and Jessica Sutta - could have had a huge hit with the pop megastar's breakthrough 2008 single, but they turned it down, and Kimberly insists it was not her choice.\nAmanda Seyfried wants to a role in movie version of Mean Girls: The Musical\nUpdatedAmanda Seyfried wants to be in the movie adaptation of 'Mean Girls: The Musical'.\nThe 37-year-old actress made her big screen debut as Karen Smith in the 2004 comedy which serves as a parody of the high school clique system and revealed that she and her co-stars Lindsay Lohan, Rachel McAdams, and Lacey Chabert are all \"100 percent\" interested in making cameos in the upcoming adaptation of the Broadway musical based on the film.\nAaron Taylor-Johnson joins Nosferatu remake\nUpdatedAaron Taylor-Johnson has joined the cast of the 'Nosferatu' remake.\nThe 'Bullet Train' actor is set to star in the new film version of the horror classic from director Robert Eggers, alongside Bill Skarsgard, Nicholas Hoult, Willem Dafoe, Emma Corrin and Lily-Rose Depp, according to the Hollywood Reporter.\nShania Twain 'uncontrollably fragile' after husband's affair\nUpdatedShania Twain was \"uncontrollably fragile\" after her husband cheated on her with her best friend.\nThe 57-year-old singer's 14-year marriage to Robert \"Mutt\" Lange ended in 2008, after she discovered he had been having an affair with her close friend Marie-Anne Thiébaud and Shania admitted she still doesn't speak to them.\nRiley Keough feared she'd lose Daisy and the Six role because she couldn't 'belt' out a song\nUpdatedRiley Keough feared she wouldn't get her musical role in 'Daisy and the Six' because she couldn't belt out a song.\nElvis Presley's granddaughter - whose parents are the late Lisa Marie Presley and her ex-husband Danny Keough - plays the titular singer in the new Prime Video series, but unlike her late grandfather, Riley had no singing experience and \"faked it until she made it\" by hiring a vocal coach to teach her how to belt out a tune.\nSleep is extraordinary and beautiful, says Jennifer Aniston\nUpdatedJennifer Aniston thinks sleep is \"beautiful\".\nThe 54-year-old actress has struggled with insomnia for years, and she's now grown to appreciate the value of sleeping well.\nJustin Timberlake calls Jessica Biel a 'dream' in gushing birthday post\nUpdatedJustin Timberlake thinks Jessica Biel is ageing like a fine wine.\nThe actress turned 41 on Friday (03.03.23), and Justin has taken to social media to pay a gushing tribute to his wife.\nMacklemore's daughter attends Alcoholics Anonymous meetings with him\nUpdatedMacklemore's seven-year-old daughter has attended Alcoholics Anonymous meetings with him.\nThe 39-year-old rap star - who has Sloane, Colette, four, and Hugo, 18 months, with his wife Tricia Davis - has revealed that he's kept his kids informed about his sobriety journey.\nGigi Hadid hopes Next in Fashion inspires viewers\nUpdatedGigi Hadid hopes viewers can take inspiration from season two of 'Next in Fashion'.\nThe 27-year-old model has teamed up with Tan France for season two of the Netflix series, and Gigi has given fans an insight into what they can expect from the reality series, which features up-and-coming designers.\nCameron Diaz 'is really enjoying her acting return'\nUpdatedCameron Diaz is \"having a blast\" amid her acting return.\nThe 50-year-old actress has ended her acting hiatus to star in the Netflix movie 'Back In Action' and the blonde beauty has relished shooting the film with Jamie Foxx.\nAngela Bassett: I wasn't robbed of Oscars success\nUpdatedAngela Bassett remains philosophical about her lack of Oscars success.\nThe 64-year-old actress was nominated for an Academy Award for her performance in 1993's 'What's Love Got to Do with It' - but she ultimately missed out on the accolade.\nChrissy Teigen admits to watching 'bottom barrel' reality shows\nUpdatedChrissy Teigen has resorted to watching \"bottom barrel\" reality TV shows other recent months.\nThe 37-year-old model - who has Luna, six, Miles, four, and Esti, six weeks, with music star John Legend - has revealed that she's desperate to watch a new series of '90 Day Fiance'.\nJennifer Hudson 'didn't need to win American Idol'\nUpdatedPaula Abdul knew Jennifer Hudson \"didn't need to win\" 'American Idol' to realize her dreams.\nThe 41-year-old singer starred on the show's third season in 2004, and Paula explained that she didn't need to win the series in order to become a success.\nI'm an open book with my fans, says Christina Aguilera\nChristina Aguilera is determined to be \"honest and open\" with her fans.\nThe 42-year-old pop star thinks she's always been \"a pretty open book\" about her appearance and her insecurities.\nLily Collins loves interior design\nUpdatedLily Collins has recently become obsessed with interior design.\nThe 33-year-old actress - who is the daughter of musician Phil Collins and his second wife, Jill Tavelman - has revealed that she loves looking for interior design inspiration on Instagram.\n'There's nothing better': Kim Kardashian works out with Kelly Rowland\nUpdatedKim Kardashian has been working out with Kelly Rowland.\nThe 42-year-old reality superstar took to social media on Thursday (02.03.23) to show off a mirror selfie of herself along with former Destiny's Child singer Kelly, 42, where she noted there was \"nothing like\" working out in her home gym with a friend.\nIdris Elba won't 'say too much' to avoid social media rows\nUpdatedIdris Elba is afraid of \"saying too much\" and getting involved in a \"b****** social media argument\".\nThe 50-year-old actor insisted he lives \"quite a sheltered life\" and like many people in the public eye, he is reluctant to offer opinions on topical issues in case they are \"taken out of context\" and become the focus of an online row.\n'I have to whip it out': Michael Douglas confirms he and Catherine Zeta-Jones have saucy golf bet\nUpdatedMichael Douglas has to take his trousers off and \"whip it out\" if Catherine Zeta-Jones beats him at golf.\nThe 'Ant-Man and the Wasp: Quantumania' actor confirmed he and his wife still have an ongoing bet when they are playing their favourite game but he insisted he doesn't lose very often.\nHeather Rae El Moussa 'obsessed' with baby son\nUpdatedHeather Rae El Moussa never expected to be so \"obsessed\" with her son.\nThe 'Selling Sunset' star and her husband Tarek El Moussa welcomed baby Tristan into the world on 31 January and though the 35-year-old beauty thought she'd be ready to go out to dinner without the tot by now, she can't bear to be separated from him \"at all\" because they have such an \"insane bond\".\nJames Cameron held screening to get honest feedback on Avatar: The Way of Water\nUpdatedJames Cameron gathered film fans to give him direct feedback on 'Avatar: The Way of Water'.\nThe 68-year-old filmmaker and his producing partner Jon Landau attended a screening in Burbank and were joined by an audience who had seen the movie already, with the director requesting their unfiltered thoughts on the flick to help guide the rest of the franchise.\nZara Larsson defends Meghan Trainor: 'She didn't create this for TikTok, TikTok was created for Meghan'\nUpdatedZara Larsson has defended Meghan Trainor after she was accused of making music just to go viral on TikTok.\nThe Swedish pop star took to Twitter to respond to a user who suggested the 'All About That Bass' hitmaker was part of the \"TikTokification (sic)\" of pop music\", and hit back saying it's the other way around as the video-sharing platform was \"created for Meghan\".\nNicki Minaj revives alter-ego Chun-Li for new single Red Ruby Da Sleeze\nUpdatedNicki Minaj has released her first track of 2023, 'Red Ruby Da Sleeze'.\nOn the eve of the song's release, the rap star warned ghost writers \"they will be scrambling\" and declared that Nicki is \"still on hiatus\" while she channels her Chinese alter-ego Chun-Li from the 2018 track of the same name.\nJohn Cena, Awkwafina, and Simu Liu to star in action-comedy film Grand Death Lotto\nUpdatedJohn Cena, Awkwafina, and Simu Liu are to star in Prime Video action-comedy 'Grand Death Lotto'.\nThe 45-year-old professional wrestler-turned-actor will executive produce the Amazon Studios film alongside Zack Roth and Rob Yescombe, who will pen the script, and Paul Feig will direct the movie.\nRebel Wilson got month-long Disneyland ban over 'illegal' bathroom selfie\nUpdatedRebel Wilson got banned from Disneyland.\nThe 'Pitch Perfect' actress - who got engaged to Ramona Agrum at the California theme park last month - claimed she was asked to stay away from the tourist attraction for a month after taking a photo inside a \"secret bathroom\".\nBecky G needs a lot of help with wedding planning\nUpdatedBecky G \"needs a lot of help\" planning her wedding.\nThe 26-year-old pop star got engaged to sports star Sebastian Lletget, 30, just before Christmas 2022 after seven years of dating and even though she has found it \"refreshing\" to be in a new stage of the relationship, she revealed her side of the family are trying to hurry the wedding along.\nKerry Washington recalls secret wedding to Nnamdi Asomugha\nUpdatedKerry Washington is planning a \"secret anniversary celebration\" with her husband Nnamdi Asomugha.\nThe 46-year-old actress tied the knot with the 41-year-old former football cornerback without any publicity almost a decade ago and now they are approaching a milestone in their marriage, she's insisted they won't be celebrating 10 years with any fuss.\nLea Michele's stint in Funny Girl to end in September\nUpdatedLea Michele's stint in 'Funny Girl' will end in September.\nThe 'Glee' actress took over the role of Fanny Bryce from Beanie Feldstein in September 2022 and it's now been announced the Broadway revival will come to an end on 3 September.\nSherri Shepherd thanks Maksim Chmerkovskiy for helping her dance away divorce drama\nUpdatedSherri Shepherd has praised Maksim Chmerkovskiy for bringing her back from her \"lowest point\" with free dance lessons.\nThe 55-year-old talk show host hit rock bottom when her marriage to Lamar Sally ended in 2014 but she'll always be grateful to the 'Dancing With the Stars' professional for being an \"all-round good guy\" and reaching out to help her take her mind of their divorce battle.\nThe ABBA Voyage avatar concert is set to go around the world\nUpdatedABBA's 'Voyage' avatar concert is set to go on a world tour.\nUniversal Music Group chairman Sir Lucian Grainge confirmed the news during an earnings call for the firm this week.\nArctic Monkeys and Guns N' Roses join Sir Elton John as the 2023 Glastonbury headliners\nUpdatedArctic Monkeys and Guns N' Roses have been confirmed as the final headliners for Glastonbury 2023.\nAlex Turner and co will headline the Pyramid Stage at the world-famous festival for the third time in their career on Friday, June 23.\nGlenn Close starring in The Summer Book adaptation\nGlenn Close is to star in 'The Summer Book'.\nThe 75-year-old actress has boarded the cast of the movie adaptation of Tove Jansson's novel alongside Norwegian star Anders Danielsen Lie.\nRon Jeremy's sister requests conservatorship for former adult film star\nUpdatedRon Jeremy's sister wants him to be placed under a conservatorship.\nThe former adult film star was recently ruled unfit to stand trial on over 30 counts of rape and sexual assault due to dementia and now Susan Bilotte has filed a petition asking for attorney Ellen Finkelberg to be placed in charge of the 69-year-old actor's finances and healthcare.\nBillie Eilish steps back from social media\nUpdatedBillie Eilish has stopped looking at social media.\nThe 21-year-old singer admitted she has deleted a number of apps from her phone to avoid the temptation to keep mindlessly scrolling when she could be doing other things.\nKings of Leon announce a pair of gigs at Wrexham AFC's ground\nUpdatedKings of Leon have announced a pair of gigs at Wrexham AFC's stadium.\nThe 'Sex on Fire' hitmakers will rock Racecourse Ground over the Bank Holiday Weekend, on Saturday 27 and Sunday 28 May, 2023.\n'They never had to go to the doctor!' Heidi Klum and Tom Kaulitz believe their dogs have been poisoned\nUpdatedHeidi Klum's husband Tom Kaulitz thinks their dogs have been poisoned.\nThe 49-year-old model has been married to the Tokio Hotel rocker since 2019 and he, along with his brother Bill, have speculated that the deaths of Tom's shorthaired pointer Capper - who died last month at the age of 15 - and four-year-old Irish wolfhound Anton a few weeks later, as well as Bill's bulldog Stitch just days ago were down to foul play.\nRapper Lil Mosey found not guilty of second-degree rape after jury trial\nUpdatedLil Mosey has been found not guilty of second-degree rape.\nThe 21-year-old 'Stuck in a Dream' rapper - whose real name is Lathan Moses Stanley Echols - was accused of the offence after a woman claimed she and her girlfriend were raped by him and another man in 2021 after they met at a cabin, but he was cleared on Thursday (02.03.23) by a jury.\nChris Brown wins big at 2023 Urban Music Awards\nUpdatedChris Brown was the big winner at the 2023 Urban Music Awards (UMA).\nThe US rapper took home Artist of the Year (USA) and Best Album for 2022's star-studded LP 'Breezy' at the 19th edition of the ceremony, which was held at London's Porchester Hall on Tuesday night (28.02.23) and broadcast live on VooVix TV.\nEd Sheeran announces only UK shows of 2023\nUpdatedEd Sheeran has announced a last-minute UK and European arena tour.\nAfter unveiling his latest album 'Subtract' - which is due for release on May 5 - on Wednesday (01.03.23), the 'Castle on the Hill' hitmaker has announced a small batch of dates, kicking off on March 23 in Manchester, taking in two nights at London's The O2 arena on March 24 and 25 before heading to Glasgow and Dublin on March 28 and March 30, and wrapping in Paris on April 2.\nFormer Victoria's Secret Angel Jasmine Tookes gives birth: 'We are so in love'\nUpdatedFormer Victoria's Secret Angel Jasmine Tookes has given birth.\nThe 32-year-old model and her husband, Snapchat director Juan David Borrero, welcomed their first child together into the world, daughter Mia, last week.\nI want to live a life of solitude, says Lady Gaga\nUpdatedLady Gaga wants to live a \"life of solitude\".\nThe 36-year-old pop star - who is one of the most recognisable musicians in the world - has revealed that she's actually keen to just \"have time to be alone\".\n'I burst into tears': Steven Spielberg had emotional reaction to seeing The Fabelmans' Michelle Williams and Paul Dano together\nUpdatedSteven Spielberg cried when he first saw Michelle Williams and Paul Dano in character together for 'The Fabelmans'.\nThe 76-year-old filmmaker's Oscar-nominated movie is based on his old childhood and he explained how a \"routine\" first day of filming proved to be very emotional for him.\nJussie Smollett lodges appeal seeking new trial\nUpdatedJussie Smollett wants a new trial over allegations he faked a hate crime on himself.\nThe 'Empire' actor was sentenced to 150 days jail and 30 months of felony probation in March 2022, three months after he was found guilty on five of six counts of disorderly conduct for allegedly staging a racist and homophobic attack on himself in 2019 but spent less than a week behind bars after the Illinois Appellate Court granted a motion from his lawyers for a stay of the sentence.\nChaka Khan takes a swipe at Adele, Mariah Carey and more\nChaka Khan has taken a foul-mouthed swipe at Mary J. Blige, Adele, and Mariah Carey.\nThe 69-year-old star has hit out at a number of her fellow vocalists while discussing Rolling Stone's recent list of the 200 Greatest Singers of All Time, on which she was placed at number 29.\nI'm a very sensitive person, says Christina Aguilera\nUpdatedChristina Aguilera is a \"very sensitive person\".\nThe 42-year-old pop star has grown up in the spotlight - but over the years, she's learned how to deal with the scrutiny that's come her way.\nJonathan Majors is 'going for overall health'\nUpdatedJonathan Majors' role in 'Creed III' inspired a \"lifestyle\" change.\nThe 33-year-old actor stars opposite Michael B. Jordan in the sports drama film, and Jonathan has revealed that he pushed himself to his physical limit for his role in the movie.\nMy daughter doesn't like playing tennis, says Serena Williams\nUpdatedSerena Williams' daughter \"doesn't actually like to play tennis too much\".\nThe 41-year-old tennis legend - who has five-year-old Olympia with her husband Alexis Ohanian - has revealed that her daughter isn't especially keen to follow in her mom's footsteps.\nLily Collins is 'obsessed' with her bangs\nUpdatedLily Collins thinks there's \"a little Frenchness\" to her current hairstyle.\nThe 33-year-old actress has become obsessed with her bangs over recent months and she plans to \"keep them for a while\".",
  "word_count": 4347,
  "scraped_at": "2026-02-14T13:07:58.484099"
}