{
  "article_id": "aa86cec70cdc",
  "url": "https://www.lancashiretelegraph.co.uk/news/25726951.education-community-pioneers-honoured-awards/",
  "title": "New Year Honours 2026 sees East Lancashire celebrated",
  "date": "20251229T230000Z",
  "domain": "lancashiretelegraph.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A Blackburn tech entrepreneur, education leaders, a charity pioneer and sports stars moulded in East Lancashire are among those recognised in the New Year’s Honours List 2026.\nThis year’s list includes 11 women and five men from across the region, including Blackburn, Darwen, Clitheroe and Nelson, who have made vital contributions to the towns and fields they serve.\nMohamed Isap, chief executive of the IN4 Group, is one of two people honoured with an OBE (Order of the British Empire), receiving it for his services to education.\nMr Isap is also a founding director of Star Academies, chair of the Lancashire Business Board, and a trustee of the Duke of Edinburgh Award and the Careers Enterprise Company.\nHe said: “I’m deeply honoured to receive this award for services to education and skills. It reflects a lifetime of work across education, skills and enterprise, and the belief that talent exists everywhere if people are given the right opportunities.\n“Education is where long-term change happens, and it plays a vital role in creating opportunity for individuals, families and communities.\"\nPreviously, he was the co-chair of the Greater Manchester LEP, and has also been on the Corporation Board at Blackburn College and was the chair of governors at Wensley Fold Church of England School for eight years.\nCouncillor Phil Riley, leader of Blackburn with Darwen Council, said: “In addition to his formal roles, Mo is a tireless advocate for social mobility, diversity, and inclusion.\n\"He regularly mentors young entrepreneurs and supports grassroots initiatives aimed at empowering underrepresented communities.\n“His contribution to the place of Blackburn with Darwen reflects his public-spirited nature for the betterment of his fellow citizens.\n\"His unwavering dedication to opportunity, and his belief in partnership and collaboration, continues to benefit our community. I feel proud to call him a key strategic partner, close ally and friend.”\nDeborah Millar is the second OBE recipient, for services to further education.\nShe is director of digital transformation at Hull College, and hails from Darwen.\nMs Millar has worked in the education sector for more than 27 years and has played an important role at Hull College in driving forward digital transformation in education.\nShe said: “I’m touched, humbled, and grateful to receive this honour.\n\"To be recognised for doing what I love most - helping people feel confident with technology - is genuinely so rewarding.\n\"I never get tired of that moment when someone’s eyes light up, and they get it. When technology becomes empowering instead of intimidating - that’s what keeps me going.\"\nTwo more female education leaders received top gongs, with Commander of the British Empire (CBE) awards going to Dr Lynne Barnes and Lisa O'Loughlin.\nDr Barnes is a principal lecturer at the University of Lancashire, and is honoured for her service to education.\nShe is a lecturer in deaf studies, having committed her career to serving the deaf community, and recently received a Lifetime Achievement Award from the National Association of Disability Practitioners.\nLisa O'Loughlin is chief executive of East Lancashire Learning Group and has been honoured for her services to further education.\nWith a wealth of experience in further education, Ms O'Loughlin, who is based in Lancaster, was also deputy principal of Blackburn College between 2007 and 2013, and has been a driving force behind transformational change at ELLG to boost prospects for students.\nFour community champions have been recognised with British Empire Medals (BEM) for their services to charity and the places they live.\nThomas Gilmour, who is PCSO for British Transport Police and hails from Clitheroe, is honoured for services to railway safety.\nCaptain David McNamee, also from Clitheroe, is honoured for services to the community in Slaidburn and the Hodder Valley, while Dawn Taylor is rewarded for services to the community in Rossendale.\nSimon Walsh, Procurement Director for Manchester University NHS FT and Joint Greater Manchester Procurement Lead was recognised with a British Empire Medal (BEM) for services to the NHS and charity.\nSimon has worked in NHS procurement services since 1987 and has led the procurement team of MFT and its predecessors since 2003. He is formerly Chair of the Health Care Supply Association, the representative charity for NHS procurement staff, and has contributed to procurement policy development at regional and national levels.\nSimon said: “It has been immensely rewarding to lead the procurement team at MFT and, with the support of the trust, to develop a unique range of services to wards, theatres, and departments. I am both humbled and proud to receive this recognition.”\nAcross East Lancashire, there were MBEs for those who have made a huge contribution to local communities, plus a slew of sporting stars.\nThe founder of a charity which started out in Blackburn and has gone on to help countless women is made a Member of the British Empire.\nElaine Edwards, from Darwen, is founder and chair of Families and Babies and honoured for her services to breastfeeding mothers.\nThe breastfeeding peer support service started in 2004 when Elaine had a difficult start to breastfeeding her daughter, Jessica, and struggled to get support.\nShe went to a local Sure Start Centre for help, where she met other mums who were in the same position, which inspired her to set up FAB.\nBarnoldswick's Jacqueline Hanson, lately a regional chief nurse at NHS England, also gets an MBE for services to nursing and health service leadership.\nJackie provided leadership during the COVID-19 pandemic, was instrumental in driving the establishment of the North West antiracism programme and was awarded the Member of the Order of the British Empire (MBE) for services to the nursing profession and health services leadership.\nJackie said: “I am deeply honoured and proud to receive this award that has been given in recognition of my leadership contribution to nursing and health services.\n“I have been enormously privileged to work alongside dedicated, hardworking and compassionate staff who have strived to improve the quality of health care services for communities and patients within the North West.\n“I dedicate this award to all of them and thank them for their support and guidance throughout my career.”\nDirector of the Super Slow Way, Lorraine Peake, from Clitheroe, is honoured for services to the community in Lancashire.\nThe Super Slow Way works with artists in communities along the Leeds and Liverpool Canal in East Lancashire, using its rich environmental and heritage assets to support community-led regeneration and climate action.\nLorraine, better known as Laurie, said: “I am proud and delighted to receive this honour for the work of Super Slow Way in the communities of East Lancashire.\n\"We are a small but mighty team, all of whom come from the area and, as such are passionately committed to creating opportunities for the people that live here.\n\"We all believe in the power of art to forge new spaces for people to come together, to see new possibilities in the places they live, and have important conversations that would otherwise not happen.”\nFormer Dragon's Den star and cloud computing pioneer Piers Linney also gets an MBE.\nThe Bacup entrepreneur, currently executive chair of Implement AI, is honoured for services to small business, entrepreneurs, investors, banking, diversity and social mobility.\nTech whizz Isabelle Barron caps off an incredible few years with an MBE, having been crowned Europe's best in digital construction and taking home a Medallion of Excellence in the WorldSkills Olympics.\nIsabelle, from Clitheroe, is made an MBE for services to vocational education.\nA number of England’s Lionesses feature on the list after they won back-to-back European Championships in the summer, with three key players who started their careers at Blackburn Rovers honoured.\nFormer Haslingden High and Bacup and Rawtenstall Grammar student Keira Walsh, plus Ella Toone and Georgia Stanway, all came through the Rovers academy system before moving on to bigger clubs and becoming stalwarts of the national team.\nToone, Walsh and Stanway have all been made MBEs along with defender Alex Greenwood, while Lionesses captain Leah Williamson is made a CBE.\nFA chair Debbie Hewitt said: “It has been another historic year for the Lionesses, and on behalf of everyone at the FA, I would like to congratulate Alex, Ella, Georgia, Keira and Leah.\n“All of their contributions extend far beyond their outstanding performances on the pitch; equally important is their shared commitment to making a positive impact on society.\n\"Each of them has embraced the responsibility of being a role model for a generation of girls with sincerity and purpose.\"\nThis year’s honours list includes 1,157 recipients, with 67 per cent living outside London and the South East.\nHalf of all recipients at CBE level and above are women, marking the strongest representation since 2020, the Cabinet Office said.\nOther big names honoured include knighthoods for ice skaters Torvill and Dean, actors Idris Elba and Meera Syal, plus OBEs for comedian Matt Lucas, presenter Gabby Logan, actor Warwick Davis, and some members of the World Cup-winning England women's rugby union team.\nLionesses coach Sarina Wiegman gets an honorary damehood, while Wicked star Cynthia Erivo and one-half of the Chuckle Brothers, Paul Elliott, get MBEs.\nPrime Minister Keir Starmer said: \"This year’s Honours list celebrates the very best of Britain – people who put the common good ahead of themselves to strengthen communities and change lives.\n“Their quiet dedication speaks to the decent, compassionate country we are proud to be.\n\"On behalf of the whole nation, thank you – and congratulations to everyone recognised today.”\nThe full list locally is as follows:\nCBE\n- Dr Lynne Barnes. Principal Lecturer, University of Lancashire. For services to Education. (Preston)\n- Lisa O’Loughlin. Principal and Chief Executive Officer, East Lancashire Learning Group. For services to Further Education. (Lancaster)\nOBE\n- Mohamed Isap. Chief Executive, IN4 Group. For services to Education. (Blackburn)\n- Deborah Millar. Director of Digital Transformation, Hull College. For services to Further Education. (Darwen)\nMBE\n- Isabelle Barron. Team Member, WorldSkills. For services to Vocational Education. (Clitheroe)\n- Elaine Edwards. Founder and Chair, Families and Babies. For services to Breastfeeding Mothers. (Darwen)\n- Jacqueline Hanson. Lately Regional Chief Nurse, NHS England. For services to the Nursing Profession and Health Service Leadership. (Barnoldswick)\n- (Jonathan) Piers Linney. Executive Chair, Implement AI Limited. For services to Small Business, to Entrepreneurs, to Investors, to Banking and to Diversity and Social Mobility. (Bacup)\n- Lorraine Peake. Director, Super Slow Way. For services to the community in Lancashire. (Clitheroe)\n- Georgia Stanway. For services to Association Football. (Barrow in Furness)\n- Keira Walsh. For services to Association Football. (Former Blackburn Rovers)\n- Ella Toone. For services to Association Football. (Former Blackburn Rovers)\nBEM\n- Thomas Gilmour. Police Community Support Officer, British Transport Police. For services to Railway Safety. (Clitheroe)\n- Captain David McNamee. For services to the community in Slaidburn and the Hodder Valley, Lancashire. (Clitheroe)\n- Dawn Taylor. For services to the community in Rossendale, Lancashire. (Rossendale)\n- Simon Walsh. Procurement Director and Joint Greater Manchester Procurement Lead, Manchester University NHS Foundation Trust. For services to the NHS and Charity. (Nelson).",
  "word_count": 1835,
  "scraped_at": "2026-02-14T13:07:16.218838"
}