{
  "article_id": "aa886f1d755c",
  "url": "https://theathletic.com/5120994/2023/12/19/underrated-alanna-kennedy-has-become-manchester-citys-defensive-hero/",
  "title": "Underrated Alanna Kennedy has become Manchester City defensive hero",
  "date": "20231219T074500Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Whisper it, but Manchester City defender Alanna Kennedy might be the most underrated centre-back in the Women’s Super League (WSL).\nThe 28-year-old Australia international is in her third season with City but injuries — a broken nose in April last year, a hamstring problem and a fractured shoulder in the September and a calf tear in March — have disrupted her time at the club.\nIt is only now she seems truly settled and is playing some of her best football as a result.\nAdvertisement\nKennedy was a somewhat unassuming signing, joining from fellow WSL side Tottenham Hotspur ahead of the 2021-22 season. She predominantly played in defensive midfield during her year at Spurs having arrived during the Covid-19 pandemic, a period which saw several Australians (notably Arsenal duo Caitlin Foord and Steph Catley) move to WSL teams having previously played in the American league or back home.\nIt is easy to have an opinion on a player that’s influenced by their off-field persona.\nKennedy has a wonderful tendency to be rather goofy; the video of her reacting to her nose being broken in an international match was social media gold. That has perhaps created the perception that she is not as composed as some of the other defenders in the WSL.\nIf anyone nose a good surgeon, hit me up xx pic.twitter.com/ss72lrOepU\n— Alanna Kennedy (@AlannaKennedy) April 13, 2022\nKennedy played an important role in helping Australia reach the semi-finals of their home World Cup this summer. Despite a concussion that resulted in her missing that match against England and the third-place play-off against Sweden, the tournament seems to have boosted her confidence. She is looking incredibly assured in a City defence which is currently the best in the WSL, having conceded only seven goals and secured four clean sheets in 10 games.\nThat assuredness has not been a guarantee, with Kennedy having had a tempestuous time in Manchester.\nSpeaking to The Athletic ahead of the World Cup, Kennedy said the “last two years… have been the most turbulent of my career, in terms of form and injury”. She started only twice in the WSL last season, but has made the jump to being a regular this year.\nThe right-sided centre-back role is one City have taken a while to fill. Former England captain Steph Houghton had played in that position since the club became professional in 2014, and with the 35-year-old’s time as a starter coming to an end through both injury and form, the challenge City have faced in replacing her has generally been overlooked.\nWhile Houghton clearly remains a leader for City off the pitch, Kennedy has become the cool head on it. Nowhere is that more clearly demonstrated than by the fact that she is the club’s only first-choice defender not to have been sent off this season.\nGO DEEPER\nExplaining Greenwood's 'most ridiculous red card'\nCity play one of the most exposed defensive systems in the WSL. Manager Gareth Taylor has at least one, and sometimes both, full-backs inverting into the midfield, which leaves centre-backs Kennedy and Alex Greenwood to cover large amounts of space. They also have to be good on the ball, with the full-backs’ movement creating more varied passing angles.\nAdvertisement\nCity are one of the most possession-heavy teams in the league. According to Opta, only Chelsea have had more build-up attacks (defined as a sequence of 10-plus passes which ends in a shot or touch in the box). Of all WSL centre-backs, Kennedy has the third-highest progressive passing distance with 4,021 yards, only behind Manchester United’s Maya Le Tissier and Lotte Wubben-Moy of Arsenal. But unlike in those centre-back pairings, Kennedy normally plays as the more reserved defender.\nKennedy is also playing in front of 19-year-old goalkeeper Khiara Keating, who has been preferred by Taylor this season over the more experienced England and Scotland internationals Ellie Roebuck and Sandy MacIver.\nGO DEEPER\nDropped by Manchester City and England, what now for Ellie Roebuck?\nKeating has acquitted herself well but is clearly still learning, with some rash decision-making demonstrating her rawness. That has made Kennedy and Greenwood’s presence even more important.\nBut Kennedy and Greenwood have been unable to find consistent match-time together, with suspension and then a concussion seeing the latter miss several matches. Kennedy has helped hold a chopped-and-changed defence together.\nBack-to-back losses against Arsenal (2-1) and Brighton (1-0) last month have left City slightly off the pace in the league, three points behind leaders Chelsea. They have the ability, however, to string together long runs of results, and have already played all of their other top-four rivals, taking four points from the three matches with a 3-1 win against United, a 1-1 draw with Chelsea and that Arsenal defeat.\nThere is no reason yet to think that City are out of any kind of title race, because the teams around them will drop points, as we saw recently with champions Chelsea losing 4-1 away to Arsenal.\nCity’s fourth-place finish last season saw them concede nine more goals across the 22 games than Arsenal, who came third.\nThe talent among their attacking trio of Lauren Hemp, Chloe Kelly and Bunny Shaw has long been recognised. It is only fair to give their defence the same plaudits, with Kennedy currently the player leading the way.\n(Top photo: Matt McNulty/Getty Images)",
  "word_count": 890,
  "scraped_at": "2026-02-14T12:22:10.112803"
}