{
  "article_id": "aa9815e26d45",
  "url": "https://www.fox5dc.com/news/nwsl-settles-abuse-case-creates-5m-fund-victims",
  "title": "NWSL settles abuse case , creates $5M fund for victims",
  "date": "20250206T063000Z",
  "domain": "fox5dc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "NWSL settles abuse case, creates $5M fund for victims\nWASHINGTON - The National Women's Soccer League (NWSL) will now compensate players who were abused and harassed, following a settlement announced by D.C. Attorney General Brian Schwalb on Wednesday.\nNWSL sex abuse claims\nThe backstory:\nThe settlement is the result of a three-year investigation that began after abuse within the league came to light in 2021 when two players spoke out.\nAn independent investigation commissioned by U.S. Soccer and led by a former Deputy U.S. Attorney General confirmed their stories, revealing that the abuse was systemic.\nThe investigation uncovered that players were regularly subjected to unwanted sexual advances, pressured to engage in inappropriate behavior, and faced difficult training conditions, including weight monitoring and verbal attacks. Fear of losing playing time or being excluded from the national team silenced many from speaking out.\nA criminal inquiry led by Schwalb and prosecutors from New York and Illinois confirmed that coaches and staff began abusing players almost immediately after the league's formation in 2013.\n\"The league was aware of verbal and emotional abuse, which included racist and sexist harassment because players filed official complaints, complaints which the league largely ignored,\" Schwalb said.\n$5 million compensation fund for victims\nWhat's next:\nAs part of the settlement, the NWSL is required to establish a $5 million compensation fund for victims of abuse.\nThe league must also implement new reporting channels for players to confidentially report abuse and hire at least two mental health professionals for each team.\nTori Huster, Deputy Director of the NWSL Players Association, emphasized the significance of the settlement: \"This $5-million restitution fund is not a gift — nor is it justice. This fund exists because players refused to be silenced and found the courage to stand together as a collective. This fund is an acknowledgment of the league’s failures.\"\nSince its inception in 2013 with eight teams, the NWSL has expanded to 14 teams, with two additional franchises set to debut in 2026. The league’s attendance surpassed 2 million for the first time last season.\nThe Source: The information in this story comes from FOX 5 reporting and Attorney General Brian Schwalb's Office.",
  "word_count": 361,
  "scraped_at": "2026-02-14T12:19:22.870461"
}