{
  "article_id": "aaa344e0cafe",
  "url": "https://www.standard.net.au/story/8337489/club-standing-on-the-doorstep-of-historic-success/?cs=10266",
  "title": "Warrnambool Wolves field squads in six south - west division soccer grand finals | The Standard",
  "date": "20230906T234500Z",
  "domain": "standard.net.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A sense of community and player empowerment has lifted Warrnambool Wolves Football Club to a grand premiership feat.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Harris Street Reserve-based club will field teams in all six South West Victoria Football Association grand finals on Sunday - from division one men all the way down to under 12s.\nPlayers from across the six Wolves teams agreed it was a special achievement for the community club.\n\"The achievement for the whole club to get into the grand final, every division, is amazing,\" division two men's captain Hayden Laird said. \"It just shows how determined and well-supported we are at this club.\n\"We really support each other and it shows out on the field.\"\nUnder 14 Wolves Black captain Julian Cooke, who has been around the club since he was four years old, said he thrived from immersing himself at the club and supporting each of its teams.\n\"It's the best thing on Sundays, I'd rather be here all day than at home,\" he said. \"It's just such a nice feeling being here and helping out with MiniRoos in the morning to watching seniors in the afternoon.\"\nOn Sunday, the Wolves are aiming to pull off a mixture of first-time flags and back-to-back feats.\nLaird will lead the Wolves' division two side in its first grand final appearance since the division was introduced in 2022.\n\"It's really awesome for the team to get in and have a shot at it,\" he said.\nThe Wolves play reigning premier Portland in the decider with Laird's side going in with confidence after scoring a narrow 1-0 over the Panthers in the final home-and-away round.\n\"Keen to hopefully capitalise on that and get another win,\" Laird said. \"They're (Portland) quite strong so it's going to take our best on the day.\"\nLaird, who is in his second year of playing soccer competitively, said a premiership would mean a lot to his team after it went through several changes in personnel from last season as well as during the season.\n\"We want to show that division two is really competitive and helping the club develop, especially giving people opportunity to play men's soccer,\" he said. \"It's really broadened the horizons for people to get in and have a go.\"\nLaird has relished taking up the sport himself, with his leadership qualities earning him a mid-season call-up as captain in 2022 after the previous captain went down injured.\n\"This year, I got tapped on the shoulder again,\" he said. \"And even though I'm inexperienced, I've got some experienced boys, like Sam Boyle, he's been around since juniors and has really helped me out with strategy and all sorts.\n\"I've been the leader vocally and he's helped me out with the strategy and setting up the line-ups and how we'll attack each game.\"\nDivision one men's player Henry Simmons said he was \"absolutely buzzing\" to contest his first decider in the region after the Englishman joined the club three months ago.\nThe Wolves, who lost last year's division one grand final, will face off against cross-town rivals Warrnambool Rangers, following an unbeaten home-and-away season.\nSimmons, 26, praised the club for its family feel, adding it felt \"like one big unit\".\n\"And they just happen to be one of the best in the league (on-field) - that's a bonus,\" he said.\nWolves women's player Lexi Humphries similarly has joined the Wolves this season and will play in her first decider.\nThe veterinarian moved to the region from Perth, and has quickly settled into life at the club.\n\"I noticed it from the first training session when I got here, everyone was super welcoming and I felt really comfortable coming back,\" Humphries, 24, said.\nThe midfielder said the Wolves' women's squad was hoping to capitalise on their good season on Sunday and bring home back-to-back flags. They meet Port Fairy Plovers, a team the Wolves defeated 4-0 in last year's decider.\n\"We've got a combination of new and experienced players and the new players have really pulled through and improved a lot,\" Humphries said of the Wolves' 2023 season.\nMeanwhile, the Wolves' under 12s - led by co-captains Connor Sargeant and Sam Collins, both 12 - are getting ready for their first grand final experience.\nThe team advanced to the decider off a thrilling penalty shoot-out win in their preliminary final against Hamilton but face a stern test against reigning premier Warrnambool Rangers in the grand final.\nCollins said last week's penalty shoot-out was an exciting result for his team, while Sargeant admitted to nerves as they kicked their way into a grand final. Both players, who play in the midfield, have come up the ranks from MiniRoos.\nSargeant said teamwork was key in his side's strong form this year, with the co-captains hoping to the bring the club its first under 12 flag since 2018.\nMeanwhile, the Wolves' under 17 and under 14s are aiming to repeat their successes of 2022.\nThe under 17s - led by captain Tom Walker - are going for back-to-back flags but are yet to defeat their grand final rivals Portland this year.\n\"The boys are excited to play Portland,\" Walker, 17, said. \"We just got them last year (in the grand).\n\"(This year) we've lost twice and drawn once.\"\nThe defender believed his team had built a strong chemistry on-and-off the pitch.\n\"Everyone's friends off the field because we go to school together,\" he said.\nWalker said he would encourage his teammates to \"play their hearts out and give it their all\" in the final game of the season.\n\"Obviously it's going to be a hard game and we've got to play hard to win,\" he said. \"We've just got to stay positive and play as a team and bring each other up.\"\nWolves Black's under 14 captain Julian Cooke is confident his squad can get the job done against Hamilton.\n\"Most of the players are the same as last year, so we've all been in this situation before,\" he said.\nCooke believed remaining positive across the 90 minutes would be critical.\n\"If we stay positive, we play better than the other teams because we just have a better mentality,\" he said.\n- The South West Victoria Football Association's grand finals will be held at Stawell's North Park on Sunday, with the first game starting at 10.30am, and the division one men's decider concluding the fixture from 2.30pm.\nOur journalists work hard to provide local, up-to-date news to the community. This is how you can access our trusted content:\n- Bookmark https://www.standard.net.au/\n- Make sure you are signed up for our breaking and regular headlines and newsletters\n- Follow us on Facebook, Twitter, Instagram and LinkedIn\n- Tap here to open our Google News page\n- Join our Courts and Crime Facebook group and our dedicated Sport\n- Facebook group\n- Subscribe",
  "word_count": 1150,
  "scraped_at": "2026-02-14T12:15:24.380494"
}