{
  "article_id": "aaae92792be9",
  "url": "https://abc17news.com/news/2024/10/20/chawinga-scores-her-20th-goal-of-the-season-and-current-beat-wave-4-1/",
  "title": "Chawinga scores her 20th goal of the season and Current beat Wave 4 - 1",
  "date": "20241020T084500Z",
  "domain": "abc17news.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Chawinga scores her 20th goal of the season and Current beat Wave 4-1\nTemwa Chawinga scored her league-leading 20th goal of the season and the Kansas City Current beat the San Diego Wave 4-1 on Saturday in the National Women’s Soccer League.\nChawinga become the first player to score against all of the other NWSL’s teams in a single season with her goal in the 57th minute at CPKC Stadium.\nThe Current (15-3-7) have already clinched home-field advantage for the playoffs with one regular-season match remaining. The Wave (5-13-7) were eliminated from playoff contention.\nThe Current built a 2-0 lead before halftime on Michelle Cooper’s goal in the 22nd minute and an own goal off Wave goalkeeper Kailen Sheridan in the 31st. Debinha added the Current’s fourth goal in the 80th.\nThe Wave avoided the shutout with Delphine Cascarino’s goal from some 30 yards out in the 88th.\nIn the final regular season match at CPKC Stadium, the Current honored midfielder Desiree Scott, who announced this week she’s retiring at the end of this season. She entered the game to a rousing ovation late in the game.\nScott has played for the Current since its inaugural year in 2021 and was among the league’s founding players in 2013 with FC Kansas City, which later folded. Scott won a pair of Olympic bronze medals before a gold at the Tokyo Games with the Canadian national team.\nRacing Louisville 1, Thorns 0\nTaylor Flint scored in the 88th minute to give Racing Louisville a 1-0 win over the Portland Thorns at Lynn Family Stadium.\nThorns top scorer Sophia Smith came in as a substitute in the 62nd, returning from two weeks on the sidelines with an ankle injury.\nPortland (9-12-4) handed the Orlando Pride their first loss of the season last weekend, but the loss to Louisville means the Thorns will need a result when they host Angel City on Nov. 1 in the final regular-season match.\nLouisville (7-11-7) needs to win in its final match against San Diego and get help to make the playoffs.\nBay FC 1, Courage 0\nAbby Dahlkemper scored to give Bay FC a 1-0 victory at home over the North Carolina Courage.\nBay (10-14-1) remained alive in the hunt for a playoff spot with the win at PayPal Park in San Jose. The team will need a win or a draw on Nov. 2 at the Houston Dash.\nThe Courage (12-10-3) have already secured the fifth seed in the playoffs.\n___\nAP soccer: https://apnews.com/hub/soccer",
  "word_count": 418,
  "scraped_at": "2026-02-14T12:18:46.391046"
}