{
  "article_id": "aab0b87ff4d1",
  "url": "https://www.theghanareport.com/african-games-black-princesses-look-to-improve-after-opening-win-over-ethiopia/",
  "title": "African Games : Black Princesses look to improve after opening win over Ethiopia",
  "date": "20240312T093000Z",
  "domain": "theghanareport.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ghanaian football player Mukarama Abdulai expressed her disappointment over the team’s poor finishing during their first match against Ethiopia in the African Games Group A opener last Saturday.\nDespite creating several opportunities to score, the team failed to convert them into goals, leaving Abdulai frustrated.\nHowever, Abdulai remains optimistic that the team will perform better in their next game against Tanzania today. She acknowledges that the team has worked on their weaknesses and is prepared to face Tanzania, who are known for their physical play.\nIn a press conference ahead of the game, Abdulai said, “The first game didn’t go as planned, it didn’t go the way we all wanted, especially missing chances that we could have scored. Our fans expected more but going into the second match, we have worked on what didn’t go well for us and the coaches have worked on areas we lacked individually and as a group.”\nAbdulai, who was awarded the Golden Boot at the FIFA U-17 Women’s World Cup, believes that her team needs to step up their game if they want to succeed in the tournament.\nAlthough she recognizes that playing in the World Cup is different from the African Games, she refuses to use that as an excuse for not scoring in the opening game. She is determined to learn from her mistakes and do better in the upcoming matches.\n“We know they are a physical side but we will follow our coaches’ instructions and go into the game to do better than our opening match,” Abdulai said. “Playing in the World Cup is different from the African Games but I wouldn’t use this as an excuse not to score in the opening game though I had goal-scoring chances I expect to do better in our next matches.”\nThe Black Princesses will play against Tanzania later today, March 12, 2024, at the Cape Coast Sports Stadium.",
  "word_count": 315,
  "scraped_at": "2026-02-14T14:10:06.269927"
}