{
  "article_id": "aacaa9144c95",
  "url": "https://www.theadvocate.com.au/story/8702355/whitney-knights-comeback-boosts-devonport-strikers-wsl-season/",
  "title": "Whitney Knight comeback boosts Devonport Striker WSL season | The Advocate",
  "date": "20240721T061500Z",
  "domain": "theadvocate.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "An Instagram message has led to Whitney Knight becoming a focal point of the Devonport Strikers' Women's Super League side despite \"a few seasons\" out of the game.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe 24-year-old, who has scored eight goals for the Strikers, explained how her debut season at the club has rekindled her love for the sport.\n\"A few of the guys from work pushed me back into playing. I had a few seasons off because professional life took over and I didn't have the time,\" Knight said.\n\"I fell out of love with the game to be completely honest but I'm enjoying it this season. I messaged them on Instagram and asked if I could come down for a training session and it went from there.\n\"I've made a few friendships within the team and it's just enjoyable playing with a good group of girls. Tom [Ballantyne] is a great coach as well.\n\"It doesn't feel so much like a chore to play football. It's just rocking up on the weekends and playing.\"\nKnight, who runs a design and construction business in the mining industry, played two seasons for A-League club Melbourne Victory before rupturing her ACL in the right knee.\nA move to Queensland for university saw her have a one-year stint at the Brisbane Roar.\nKnight joined teammates Georgia King and Lucy Foote (two) on the goal sheet in the Strikers' 4-0 victory against Kingborough on Saturday, July 20.\nAfter extending their lead at the top of the table with 34 points, Knight emphasised the result does not close off the premiership for the unbeaten side.\n\"The importance of the game was prevalent leading into the game. The girls worked hard and I think we deserved the win,\" she said.\n\"Notably we've been undefeated this season so far and the importance of yesterday's game doesn't completely seal it off for us, but it definitely puts us in a really good position.\n\"We played on the synthetic field - the main pitch was waterlogged - but even the synthetic field held up a fair bit of water.\"\nThe Strikers' NPL sides had the bye.\nNORTHERN CHAMPS MEN\n- Ulverstone def Launceston United 6-0\n- Somerset def Launceston City 4-2\nNORTHERN CHAMPS WOMEN\n- Burnie defeated Devonport 4-0\n- Ulverstone def. by Launceston United 0-2\n- Somerset def. by Launceston City 1-5",
  "word_count": 399,
  "scraped_at": "2026-02-14T12:42:23.645134"
}