{
  "article_id": "ab0c5c19fff9",
  "url": "https://prowrestling.net/site/2023/11/20/wwe-raw-results-11-20-powells-live-review-of-the-wargames-advantage-match-drew-mcintyres-promo-nia-jax-vs-raquel-rodriguez-becky-lynch-vs-xia-li-chad-gable-vs-shinsuke-nakamura/",
  "title": "WWE Raw results ( 11 / 20 ): Powell live review of the WarGames advantage match , Drew McIntyre promo , Nia Jax vs . Raquel Rodriguez , Becky Lynch vs . Xia Li , Chad Gable vs . Shinsuke Nakamura",
  "date": "20231121T034500Z",
  "domain": "prowrestling.net",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Jason Powell, ProWrestling.net Editor (@prowrestlingnet)\nWWE Raw (Episode 1,591)\nGrand Rapids, Michigan at Van Andel Arena\nAired live November 20, 2023 on USA Network\n[Hour One] Raw opened with a recap of Drew McIntyre’s interference costing Cody Rhodes and Jey Uso their Undisputed WWE Tag Team Title match against Damian Priest and Finn Balor…\nDrew McIntyre stood in the ring and was introduced by ring announcer Samantha Irvin. McIntyre told the booing fans that he’s not Dominik Mysterio. He said he’s earned the right to talk and told them that they will listen.\nMcIntyre said he was the most upset by the reaction to what he did last week. He said he’s been the same person. He said if you’re a fan of his, then he didn’t need to explain it, but if you turned on him then he doesn’t give a damn what you think.\nMcIntyre said he looked Jey in the eye right before he dropped him. He assumed that Jey was looking for an apology for ruining his big moment, but he said he didn’t recall a single moment where Jey apologized to him or anyone else who was screwed over by him and his family.\nMcIntyre referred to Cody Rhodes as collateral damage. He recalled Cody bringing Jey to Raw. McIntyre said people tell him to get over, but he questioned why he should. He said Jey and his family cost him and his family their moment at Clash at the Castle.\nMcIntyre said the big question everyone was asking was whether he had joined The Judgment Day. He asked the fans what they thought. “You clearly don’t know me very well after all these years,” McIntyre said. “No, I have not joined The Judgment Day. I will be on their team at WarGames, though.” McIntyre said Rhea Ripley gave him something that no one else in the world could – Jey in a cage.\nJey Uso’s entrance theme interrupted McIntyre, who told Jey to get his ass to the ring. Jey strutted out with a mic and said that McIntyre needs to let it go. He said McIntyre cost him the tag titles, so there was no more talking. Jey played to the crowd and asked if they wanted to see him give McIntyre a beatdown.\nJudgment Day members Rhea Ripley, Damian Priest, Finn Balor, Dominik Mysterio, and JD McDonagh climbed onto the ring apron behind McIntyre. Michael Cole, who was on commentary with Wade Barrett, reiterated that McIntyre had not joined the Judgment Day faction, but would be on their team at WarGames.\nSeth Rollins, Sami Zayn, and Cody Rhodes made their entrances and joined Jey. The babyfaces made their way to the ring. Adam Pearce entered the ring and said there would be no fighting. Security ran out. Pearce said the person who throws the first punch would cost their team the advantage in the WarGames match.\nPearce told the babyface team that they need to find a fifth member for their team by the end of the night. Pearce said he needed to know by 9ET which wrestlers would represent each team in the advantage match. He said there would be no interference allowed and told them to choose by that time or he would pick for them.\nMcIntyre stepped forward and then exited the ring. The Judgment Day wrestlers followed McIntyre. Ripley waved at the babfaces before dropping off the apron…\nPowell’s POV: A strong promo from McIntyre and a good segment overall. I love that McIntyre can rationalize his actions in his own mind and it wasn’t just a heel turn without any real logic behind it. I also like the way the Pearce character is taking control. I don’t know if it will last beyond WarGames, but it’s effective in the meantime when it comes to keep the teams apart before their showdown on Saturday.\nCole and Barrett spoke from their desk at ringside. Cole played up the importance of having the advantage in a WarGames match. They also hyped the previously advertised matches and added that Gunther and The Miz would go face-to-face…\nNia Jax made her entrance for the opening match heading into a commercial break… [C]\nThe Judgment Day members were hanging out in their backstage area. Priest said told Ripley that he doesn’t care for McIntyre, but he thinks it’s good business to have him on the team. Priest added as the leader of the team, she should have brought it up to him so that they all could have discussed it.\nRipley said McIntyre is unpredictable and she didn’t know what his decision was, but it all worked out. “Did it, though?” Priest asked. Ripley said she thinks it did, then conceded that they should have discussed it.\nPriest told Ripley that he thinks he should represent the team in the advantage match. Ripley said that they should all discuss it. She said they would wait for McIntyre and then decide, which Priest agreed to…\nRaquel Rodriguez made her entrance…\n1. Nia Jax vs. Raquel Rodriguez. Rodriguez went right after Jax, who caught her with an early uranage slam. Rodriguez came back and sent Jax to ringside. Rodriguez went to the apron and performed a crossbody block onto Jax on the floor. When Rodriguez tried to get Jax back in the ring, Jax shoved her into the barricade. Jax hoisted up Rodriguez and drover her back into the ring post. [C]\nJax wrapped Rodriguez around the ring post and wrenched her back from the floor. Back in the ring, Jax put Rodriguez in a chinlock. Rodriguez nearly powered up with Jax on her back, but she collapsed under her weight. Rodriguez got up and threw a couple of clotheslines at Jax, who cut her off with a headbutt.\nRodriguez came back and hit Jax with a big boot to the chest. Rodriguez played to the receptive crowd and hit her corkscrew spinning elbow from the middle rope. Rodriguez hoisted up Jax and once again collapsed under her weight. Jax performed a running senton splash.\nJax went to the middle rope for her Annihilator, but Rodriguez slipped under her and set up for a powerbomb, but she collapsed under her weight again. Jax hit the Annihilator and scored the clean pin…\nNia Jax beat Raquel Rodriguez in roughly 9:00.\nPowell’s POV: While it was the opening match of the show when crowds are typically hot, it was encouraging to hear the fans get behind Rodriguez more than they usually do. Rodriguez took the clean pin, but it was done in a way that fans should respect her for attempting to power up a larger opponent.\nA Xia Li video package aired… [C]\nIn the Judgment Day clubhouse, Priest asked Ripley where McIntyre was. “Speak of the devil,” Priest said in an obvious tease that McIntyre is the Devil Mask character. Wait, wrong company. Anyway, McIntyre said he heard Priest wants to work the advantage match.\nRipley said Priest is the leader at WarGames. Priest asked if McIntyre had a problem with that. McIntyre said he had no problem, but he made the pitch that he should work the match instead. McIntyre said he doesn’t like Judgment Day, but he despises Jey Uso.\nPriest said he doesn’t like McIntyre and said he cost him the World Heavyweight Championship. Priest ended up saying that if McIntyre wanted the match, it was his. Priest told McIntyre to show his worth by gaining the advantage. After McIntyre left, Priest told Ripley that he better get them the advantage…\nThe broadcast team spoke at their desk. Cole said they had “breaking news.” He said they found out shortly before they went on the air that the company had opened seats for Smackdown and Survivor Series.\nCole set up a sponsored recap of the angle from Smackdown that set up the women’s WarGames match. Cole hyped the potato chip company poll that will let fans choose which women’s team has the advantage in the WarGames match…\nBecky Lynch made her entrance… [C]\nPowell’s POV: So the babyface team gets the advantage in the gritty WarGames due to a fan vote held by a freaking potato chip company? Ugh.\nCole touted WWE’s deal with the Big 12 Conference that will result in the Big 12 Championship football game’s MVP being presented with a replica title belt…\nSeth Rollins, Cody Rhodes, Jey Uso, and Sami Zayn spoke backstage about who would represent them in the advantage match. Jey wanted to face McIntyre. Rollins said McIntyre wanted to take him out and they need him. Jey made a passionate pitch to face McIntyre, which Rollins and the others agreed with.\nZayn turned the focus to who would be the fifth member of their WarGames team. Cody said he had an old friend that he could call to be the fifth man…\nPowell’s POV: MJF? Ricky Starks? Ted DiBiase Jr.? Matt Cardona? No, not really. The strong rumor regarding the mystery person has been out there for a few weeks, but I’m not going to spoil it for those who have avoided it this long.\nXia Li made her entrance. NXT Women’s Champion Lyra Valkyria was shown holding her title belt in the crowd. Cole noted that Valkyria defeated Lynch for the title and would defend against Li on Tuesday’s NXT television show…\n2. Becky Lynch vs. Xia Li. Lynch ducked an early kick and eventually tossed Li to the floor. Lynch hit Li with a sliding kick from the ring and then jumped off the apron and punched her. Lynch roughed up Li on the floor and then rolled her back inside the ring. Li charged at Lynch, who caught her with a kick through the apron. Li caught Lynch with a kick that knocked her off the apron. [C]\nA piece of Lynch’s hair extensions fell out in the corner coming out of the break (I can’t even imagine how much some creeper would pay for that on eBay). Li performed a spin kick onto Lynch, who was down on the mat and then covered her for a two count.\nLynch came back and put Li in the Disarmer. Li grabbed her hand and rolled onto Lynch and got a two count while forcing Lynch to break the hold. Li executed an airplane spin into a cutter before covering Lynch for another two count.\n[Hour Two] Li put Lynch in a chokehold while in the ropes and had to release it before the ref’s five count. Li went up top, but Lynch cut her off. Lynch superplexed Li and covered her for a two count. Lynch went for the Manhandle Slam, but Li escaped and then hit Li with her knockout kick. Lynch tumbled into the ropes and then Li shoved her to the floor.\nLi joined Lynch on the floor and threw a kick that Lynch avoided. Lynch ran Li into the ring post. Both wrestlers raced back to the ring at the referee’s nine count. Lynch and Li threw punches at one another. Lynch ducked another kick and then hit the Manhandle Slam and scored the pin.\nBecky Lynch defeated Xia Li in 12:40.\nAfter the match, Damage CTRL members Iyo Sky, Asuka, Kairi Sane, and Bayley walked out of a concourse and headed down the steps to the ring. Charlotte Flair, Bianca Belair, and Shotzi showed up and attacked the Damage CTRL members. Security ran out. The babyfaces took the ring while security held back Damage CTRL while Lynch’s entrance theme played. The babyfaces went to ringside for more of a pull apart brawl…\nPowell’s POV: I was curious to see if they would protect Li before her NXT Women’s Championship match. It turned out that Li took a clean loss, yet gained something in defeat in her best match to date. Of course, a lot of wrestlers have their best match with Lynch, but it was a step in the right direction for Li. The post match brawl was a pretty basic way to push the women’s WarGames match.\nLudwig Kaiser was shown walking backstage. Giovanni Vinci showed up and asked him if everything was okay. Vinci said nothing was okay and Vinci knew it. He said he didn’t appreciate how Vinci tried to get on Gunther’s good side by interfering in a match last week. Vinci said he will do whatever is best for Imperium. Kaiser said Vinci is his responsibility and ordered him to stay backstage while he takes care of Johnny Gargano… [C]\nA Zoey Stark video package aired… Ludwig Kaiser made his entrance while Johnny Gargano and Tommaso Ciampa were already inside the ring…\n3. Johnny Gargano (w/Tommaso Ciampa) vs. Ludwig Kaiser. A few minutes into the match, Gargano sent Kaiser to ringside and then went for a suicide dive. Kaiser stuffed it with a punch from the floor. Kaiser hit Gargano with an uppercut at ringside. [C]\nCole said Kaiser dominated the action throughout the break. Gargano came back with a suicide dive. Kaiser regrouped and got a near fall, then set up for his DDT finisher, but Gargano avoided it. Gargano performed a head-scissors takedown that drove Kaiser’s face into the mat.\nKaiser came right back with a rolling senton and a boot to the face. Giovanni Vinci showed up at ringside. Kaiser barked at Vinci. Gargano took advantage of the distraction and caught Kaiser with a kick and his One Final Beat finisher, which got the three count…\nJohnny Gargano defeated Ludwig Kaiser in 10:55.\nPowell’s POV: A nice match, though I couldn’t help but feel like nothing mattered until Vinci inevitably showed up at ringside.\nFootage aired from “earlier today” of Adam Pearce standing in between Piper Niven and Chelsea Green and the team of Natalya and Tegan Nox. Candice LaRae and Indi Hartwell, Kayden Carter and Katana Chance, and the duo of Ivy Nile and Maxxine Dupri showed up. Pearce said there would be a four-way for a shot at the tag titles. Nile tried to speak to Pearce, but Dupri shooshed her. After the other teams exited the area, Green told Pearce that she was going to talk to Smackdown general manager Nick Aldis about this. “Tell him I said hi,” said a flustered Pearce, which caused Green to storm off…\nCole hyped the four-way for a shot at the WWE Women’s Tag Team Titles for after the break… [C]\nPowell’s POV: Pearce’s general manager character is so stressed out that I’m waiting for it to lead to a WWE sponsorship with a marijuana dispensary. Hey, it would be better than a potato chip company holding a poll to determine who gets the advantage in a WarGames match. Of course, if you went to that weed dispensary, then the chips would come in handy.\nCole hyped WWE Backlash France ticket info…\nRhea Ripley and Dominik Mysterio returned to the Judgment Day clubhouse. Ripley got pissed when she spotted Shayna Baszler and Zoey Stark sitting on the couch. Stark said they heard so much about the clubhouse that they thought they would check it out.\nBaszler stood up and went face to face with Ripley. “I’ve seen enough,” Baszler said before making her exit. Stark told Ripley that she’s so focused on everyone other than the person she should be focused on. Stark pointed at the Women’s World Championship that was hanging up and claimed it was coming home with her.\nRipley said most people wouldn’t survive the stunt that Stark pulled, but admitted that she kind of respected it. Ripley said Stark would get her beating at Survivor Series…\n4. Natalya and Tegan Nox vs. Candice LaRae and Indi Hartwell vs. Kayden Carter and Katana Chance vs. Ivy Nile and Maxxine Dupri in a four-way for a shot at the WWE Women’s Tag Team Titles. None of the entrances were televised. Chelsea Green and Piper Niven sat in on commentary. All of the wrestlers other than Dupri ended up at ringside. Dupri dove from the middle rope onto all of her opponents while Nile stood behind them. “You go, girl,” Cole yelled like a dork. [C]\nCarter pressed her partner up and dropped her on Nox and Natalya, which led to a pin attempt that was broken up by the other teams. Moments later, Natalya put Chance in the Sharpshooter, but Nile broke it up by performing a bulldog on Natalya. Dupri tagged in and slammed Nox a couple of times. Dupri shook like Otis and then performed his Caterpillar move.\nDupri suplexed Nox and bridged while getting a two count. Durpri and Nile double suplexed Nox and then kipped up at the same time and smiled at one another. Dupri and Nile went up top in different corners. Natalya pulled Nile down. Dupri performed a crossbody block on Nox, who rolled through and got the three count.\nNatalya and Tegan Nox defeated Candice LaRae and Indi Hartwell, Kayden Carter and Katana Chance, and Ivy Nile and Maxxine Dupri in roughly 11:00 in a four-way for a shot at the WWE Women’s Tag Team Titles.\nBackstage, Kaiser was scolding Vinci until Gunther showed up and told him to explain himself. Kaiser tried, but Gunther said he never listens. Gunther told Vinci that he applauded his efforts. Gunther said he may have put the wrong person in charge. Gunther told Kaiser to watch him and said he might learn a thing or two…\nThe Miz made his entrance dressed in a suit for his face-to-face meeting with Gunther… [C]\nAdam Pearce was greeted by New Day, Alpha Academy, DIY, Indu Sher, Imperium, and The Creed Brothers. The teams were upset about the women having the four-way for a shot at the tag titles. Pearce said they couldn’t do it this week, but they could have a tag team turmoil match next week for a shot at the tag titles. Akira Tozawa did his dance while holding a Detroit Lions title belt.\nPearce told a crew member to bring something to his office. Nick Aldis emerged and said there was no need because he was “right here.” Pearce said good and said they should have a conversation, which led to a tense look between him and Aldis…\nThe Miz stood inside the ring and spoke about respect for the wrestlers and the part that the fans play regardless of whether they are booing or cheering. Miz said that led him to Gunther’s lack of respect for everything he has done.\nIntercontinental Champion Gunther made his entrance dressed in a black suit and joined Miz in the ring. Gunther said it’s not a lack of respect, it’s that he has zero respect for Miz whatsoever. He said the ring is for fighting and competition, but Miz is just an entertainer.\nMiz said he is an entertainer and he’s proud of it. Miz said he gets it done inside the ring and out, just like all of the superstars he grew up watching. Miz did a Randy Savage impersonation and then mentioned Rick Rude, Mr. Perfect, Shawn Michaels, and Bret Hart. Miz said he wanted to be the kid who got Hart’s sunglasses.\nMiz said he learned and battled for twenty years so that he could hope and pray that he could hold the same titles that his heroes held. Miz said the reason those wrestlers are still remembered is that they are not “a one note robot like you.”\nGunther laughed and said he’s very amused by Miz, who said he’s been knocked down many times only to rebuild himself. Miz said that’s what makes an entertainer immortal, and elevates the legacy of the Intercontinental Title. He said he would do whatever it takes to survive and win because that’s who he is.\nMiz said Gunther has never really been to the bottom. He questioned whether Gunther will rise up from the bottom or be “another cog in the machine with zero personality to invest in.” Miz said if Gunther doesn’t respect him now, he will beat it into him at Survivor Series and become a nine-time Intercontinental Champion.\n[Hour Three] Gunther smirked and said he sees through Miz and he’s someone who is just like everyone else in the building. Gunther called him “Little Mike Mizanin” and said he was bullied in high school and he idolized all the heroes he just named. He said Miz finally got to become a WWE Superstar and met his heroes and they bullied him to make him understand that he doesn’t belong in the sport.\nGunther said twenty years later, things haven’t changed in that Miz still doesn’t belong in the sport. Gunther said Miz belongs behind the guardrail with all the other weirdos who are just like him. A “USA” chant broke out. Gunther mocked the fans for being weak and insecure like “Little Mike.”\nGunther told Miz that he hasn’t been bullied enough. Gunther shoved Miz and told him to do something. Gunther pushed him two more times while telling him to defend himself. Gunther pie-faced Miz and told him to defend himself.\nMiz acted like he was going to turn the other cheek and then threw punches. Gunther dropped Miz with a big boot. Gunther asked Miz who he thinks he is and then held the belt in his face. Miz kicked Gunther in the balls and then adjusted his suit and tie. Miz indicated that he has big balls and then dropped Gunther with a Skull Crushing Finale. Cole played cheerleader and told him to do it for all of us weirdos…\nPowell’s POV: It seemed like both guys got a little lost at times, but I really liked this segment and the way Gunther compared Miz to the fans in an insulting manner.\nBackstage, Seth Rollins fired up Jey Uso and told him they needed the WarGames advantage. Rollins said Jey knows how important it is because he’s been in WarGames. Jey told Rollins that he had him… Cole hyped Jey vs. McIntyre as the Raw main event…\nShinsuke Nakamura made his entrance for his match against Chad Gable… [C] Cole hyped the WrestleMania week events… A video aired with Ivar and Valhalla talking about Ivar’s match with Bronson Reed on next week’s Raw… Chad Gable made his entrance…\n5. Shinsuke Nakamura vs. Chad Gable (w/Otis, Maxxine Dupri, Akira Tozawa). Cole hyped Gable challenging Noam Dar for the NXT Heritage Cup on Tuesday’s NXT television show. Gable caught Nakamura with an armbar over the ropes, but he had to release it before the referee’s five count.\nGable suplexed Nakamura over the top rope. Gable performed a cannonball dive off the apron onto Nakamura. Gable shot up and did his “thank you” bit. [C] Nakamura took offensive control coming out of the break and hit Gable with a flying knee from the middle rope, which led to a two count.\nGable rolled Nakamura into an ankle lock, but Nakamura threw a kick to break it. Gable hoisted up Nakamura and dropped him face first. “Unique offense from Angle,” Cole said. Gable hit a top rope headbutt for a near fall.\nGable set up for Chaos Theory. Nakamura held onto the top turnbuckle pad, which he eventually tore off before escaping. Nakamura set up for his finisher, but Gable countered into a suplex. Gable followed up with a suplex.\nGable went for a moonsault, but Nakamura put his feet up. Nakamura suplexed Gable and then went for a Kinshasa, but Gable countered into the ankle lock. Cole noted that the move was made famous by Kurt Angle. Nakamura rolled out of the hold and tried to shove Gable into the exposed turnbuckle. Gable stopped short of it, and then Nakamura caught him in a pin and got the three count. Cole said Gable had to pull up due to the exposed turnbuckle.\nShinsuke Nakamura defeated Chad Gable in 12:05.\nPowell’s POV: The crowd was slow to get invested in this match, but they got louder as the match went on. Even so, it still felt like it went a few minutes longer than necessary. I was all for creative doing more with Gable. It didn’t work out and he’s back in full cheeseball mode, which does nothing for me.\nDrew McIntyre was shown walking backstage. The Judgment Day members approached him. McIntyre and Damian Priest went face to face. McIntyre said he didn’t need any help. “Great, we weren’t offering,” Priest said. McIntyre said cool and started to walk away. Rhea Ripley stopped him and told him to get the advantage. McIntyre said he would take Jey out for good. Priest said McIntyre better do it…\nDrew McIntyre made his entrance and still brought the stupid sword with him… [C]\nPowell’s POV: As much as I hate the sword because it makes a guy who feels real come off cartoonish, it actually makes sense that he’s still bringing it out with him. McIntyre is acting like he hasn’t changed, so I guess that includes the awful sword.\nBarrett thanked Black Sabbath for supplying “War Pigs” as the official WarGames theme song…\nBronson Reed delivered a backstage promo and said that Ivar is not a true warrior, he’s a cosplayer. Reed accepted Ivar’s challenge to a match for next week’s Raw…\nThe broadcast team hyped Survivor Series and ran through the lineup without adding any new matches… A WarGames video package aired…\nBackstage, Seth Rollins and Sami Zayn fired up Jey Uso, who headed to the ring. Cody Rhodes showed up and asked Rollins and Zayn if they had any luck finding a fifth member. Rollins said no, and Zayn said it wouldn’t work out. Cody said he got in touch with his guy and he’s in. Rollins and Zayn acted aware of who the fifth man would be and were happy about it…\nJey Uso made his entrance. Cole explained the significance of the advantage in a WarGames match…\n6. Drew McIntyre vs. Jey Uso for the advantage in the WarGames match. McIntyre and Jey threw punches to start the match. Jey performed an early suicide dive and then ran McIntyre’s head into the ring post. [C]\nBarrett predicted that one of the WarGames teams would implode and said it would likely be the team that did not have the advantage. Jey performed a crossbody block from the top rope and got a two count. McIntyre ended up at ringside. Jey went for a suicide dive, but McIntyre caught him with a punch from the floor.\nMcIntyre picked up Jey and ran his back into the barricade and the apron. McIntyre eventually picked up Jey and tossed him onto the broadcast table heading into the final break. [C] McIntyre counted down for his finisher, but Jey cut him off with a superkick. Jey covered McIntyre for a near fall.\nJey went up top, but McIntyre crotched him on the top rope. McIntyre put Jey down with a Future Shock DDT and scored the clean pin.\nDrew McIntyre defeated Jey Uso in 18:35 to earn the WarGames advantage.\nAfter the match, Rhea Ripley came out and told McIntyre to finish off Jey. McIntyre attacked Jey and cleared the broadcast table. Jey fought back and grabbed a chair, but Damian Priest showed up and stopped him from using it. Finn Balor, Dominik Mysterio, and JD McDonagh arrived and joined in on the attack.\nSeth Rollins, Cody Rhodes, and Sami Zayn ran out with chairs and were able to clear McIntyre and Judgment Day from the ring. A “Randy” chant broke out. Cody took the mic and said he’s so glad that Judgment Day got the advantage and have someone the caliber of McIntyre “because we, we’re not alone.”\nCody said they found a fifth member. “Someone I have a Legacy with,” Cody added. Cody asked the heels why they were looking at him like they were prey. Cody asked if they didn’t know it was the Apex Predator. The “Randy” chants grew louder. “You’re not just hearing voices inside your head, because these people here tonight, they’re right,” Cody said before tossing the mic to close the show…\nPowell’s POV: The rumors and/or reports of Randy Orton as the fifth member are true. Cody never mentioned him by name, but he made it clear that it would be him. It was smart to do this rather than leaving any mystery heading into Chicago, as it may have led to disappointment from some of the locals if they were hoping that CM Punk would be the fifth man.\nOverall, they did a nice job of setting the table for the men’s WarGames match and hyping the Survivor Series overall. I may be reading too much into Jey just standing in the background, but he didn’t express the same excitement that his teammates did over the Orton tease. I will have more to say about this show and the Survivor Series WarGames event in my weekly same night audio review for Dot Net Members (including our Patreon patrons). Let me know what you thought of Raw by grading the show below.\nJoin me for my live review of WWE Survivor Series WarGames on Saturday night.",
  "word_count": 4861,
  "scraped_at": "2026-02-14T12:56:56.167598"
}