{
  "article_id": "ab0c9f09153e",
  "url": "https://deadline.com/2024/05/sheffield-docfest-industry-program-2024-announcement-1235916909/",
  "title": "Sheffield DocFest To Hold Panel Discussions On True Crime Genre",
  "date": "20240515T120000Z",
  "domain": "deadline.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sheffield DocFest today announced the full industry program for its 31st edition, a lineup of panel discussions, marketplace sessions, live pitch forums, the annual Filmmaker Challenge, marketplace rough cuts and more.\nThe industry program runs concurrently with the festival from June 12-17. DocFest last week revealed a slate of 109 films that will be showcased in the 2024 event, including 49 world premieres.\n“The Industry program dives into the business of documentary in all its many forms,” a release noted, “complimenting the previously announced film program, exploring the skills and techniques behind many of this year’s films…” [Scroll for the full lineup].\nAmong the intriguing panel discussions is one set for Thursday, June 13 titled “Women in the Frame: Representing Women in Crime Documentaries,” which will include the participation of Kirsty Cunningham, creative director of the documentary Sarah Everard: The Search for Justice. That BBC Studios film, which premiered in the U.K. in March, explored the shocking case of Everard who was abducted, sexually assaulted, and murdered in 2021 by an off-duty Metropolitan Police constable in London.\nWatch on Deadline\nCunningham will be joined on the panel by Emily Turner, director of Accused: The Hampstead Paedophile Hoax; Jack Rampling, director of Liar: The Fake Grooming Scandal, and Anna Hall, director and EP of The Push and Libby, Are You Home Yet?\nInterestingly, DocFest’s industry program will separately offer a case study of My Wife, My Abuser, a Channel 5 documentary that centers on the case of a man named Richard Spencer who was abused by his wife for 20 years. That panel, titled “Navigating Shocking Violence in Docs” will take place on Thursday, June 13.\nWhether they’re exploring true crime or other intense subject matter, documentary filmmakers can experience PTSD or other psychological effects from their work. Responding to that reality, DocFest has organized a panel titled “Mindful Docs: Filmmaking and Psychological Safety,” featuring the participation of Rebecca Day of Film In Mind and Juliana Ruhfus of the Dart Centre. The precise date for that panel is tba.\nFor the third year running, DocFest will present its Filmmaker Challenge which offers a select group of directors the chance to make a film in a single day. Serving as a mentor to the participants this year will be Oscar-nominated filmmaker Julie Cohen (RBG, Julia, My Name Is Pauli Murray). Cohen’s most recent film, Every Body, held its international premiere at DocFest last year.\n“Six early-career U.K. filmmakers from marginalized genders have been selected to undertake the challenge of making a film on the fly, with a micro budget and equipment support,” the festival noted. “Filmmakers will respond to the festival theme of ‘Reflections on Realities,’ with only the deadline as a commissioning constraint with filming undertaken in a single day in and around Sheffield.”\nCohen said in a statement, “I can’t wait to work with this year’s cohort of Filmmaker Challenger participants. I had the fun task of reviewing the applications and I’m happy to report we selected a super talented group with wildly different approaches to documentary. It’s a tough challenge, but these six are up to it!”\nAssessing the 31st edition of Sheffield DocFest, Chair of Trustees Alex Cooke commented, “This year’s festival celebrates world class documentaries, the program is packed with captivating and extraordinary films, an exciting line up of talks and debates, and some brilliant initiatives: the Filmmaker Challenge, pitching opportunities, and the marketplace to support new projects and new talent.”\nCooke added, “We are acutely aware that times are tough, globally for so many, and also within our industry as we face numerous challenges. The risk is to retreat, to isolate ourselves. So, we encourage you to join us to reconnect and energize each other in person. Our hope, as ever, is that you leave DocFest feeling creatively challenged, inspired by what you see, and uplifted by your fellow travelers in this diverse community that is so very special.”\nINDUSTRY PROGRAMME LISTINGS:\nSESSIONS:\nTHURSDAY 13TH JUNE\nThe Power of Co-Productions\nThursday 13 June, 10:00, Crucible Theatre\nModerator: Erika Dilday (Executive Director/Executive Producer, American Documentary)\nSpeakers: Denitsa Yordanova (Global Screen Fund) Fabrizio Zappi (Director RAI DOCUMENTARI), Mandy Chang (Founder and Creative Director – Undeniable/Fremantle), Natasha Dack (Tigerlily Founder), David Rane (My Sweet Land, producer)\nFrom Community Building to Collective Impact: Funding sustainability for BIPOC filmmakers\nThursday 13 June, 10:00, Sheffield Town Hall\nModerator: Leonard Cortana\nEmbracing Inclusivity: Working with Talent and Crew with Disabilities\nThursday 13 June, 11:30, Crucible Playhouse\nSpeakers: Dr. Lily Ahree Siegel (Producer/Director My Partner Lives in My Phone), Dir. Dan Hartley (Director, David Holmes: The Boy Who lived), Ed Lovelace (Director, Name Me Lawand), Camilla Arnold (BSLBT CEO)\nNavigating Shocking Violence in Docs: A Case Study of Channel 5’s My Wife, My Abuser\nThursday 13 June, 12:00, Sheffield Town Hall\nModerator: Dr Sian Williams (Psychologist and Broadcaster)\nSpeakers: Richard Spencer, (main contributor), Adrian Padmore (Channel 5 Commissioner), John Hay (Exec Producer, Atticus Film & TV), Clare Hoban (Media Content Lawyer, Reviewed and Cleared)\nMeet the Commissioners\nThursday 13 June, 14:30, Sheffield Town Hall\nA deep-dive into the commissioning process through real examples of projects that commissioners from Amazon, Channel 5, Sky and UKTV have greenlit in the last year.\nWomen in the Frame: Representing Women in Crime Documentaries\nThursday 13 June, 16:00, Channing Hall\nModerator: Fozia Khan (Head of Unscripted, UK Originals, AmazonMGM Studios)\nSpeakers: Kirsty Cunningham (Creative Director, Sarah Everard: The Search for Justice; The Met), Anna Hall (Series Director and Executive Producer, The Push; Libby Are You Home Yet?), Emily Turner (Director, Accused: The Hampstead Paedophile Hoax), Jack Rampling (Director, Liar: The Fake Grooming Scandal)\nBBC Docs Download: Atomic People\nThursday 13 June, 17:00, Sheffield Town Hall\nSpeaker: Megumi Inman (Producer and Co-Director), Otto Burnham (Editor), Benedict Sanderson (Cinematographer and Co-Director), Morgan Matthews (Executive Producer) – join a panel discussion about the making of their latest feature documentary, Atomic People.\nChair: Emma Loach (BBC Documentaries’ Lead Commissioning Editor)\nFRIDAY 14TH JUNE\nBacking British Storytelling: Meet the BBC Unscripted Commissioners\nFriday 14 June, 10:00, Crucible Theatre\nModerator: Kate Phillips (Director of Unscripted)\nPanel: Clare Sillery (Head of Commissioning, Documentaries), Jack Bootle, (Head of Commissioning, Specialist Factual), Gian Quaglieni, (Commissioning Editor, Current Affairs), Suzy Klein,(Head of Commissioning, Arts and Classical Music), Emma Hindley, (Lead Commissioning Editor, Storyville)\nThe Winner Takes it All – Funding ABBA: Against the Odds\nFriday 14 June, 10:00, Sheffield Town Hall\nModerator: Barbara Truyen (Commissioning Editor, VPRO)\nSpeakers: James Rogan (Director), Dan Hall (Producer), Anders Bruus (Commissioning Editor, DR), Nicholas Franklin (Head of Production, Rogan Productions)\nWorking with Sky Documentaries: Creative Partners Tell All\nFriday 14 June, 12:00, Sheffield Town Hall\nModerator: Julia Nottingham (Founder, owner, producer, Dorothy Street Pictures)\nSpeakers: Hayley Reynolds (Sky Docs Commissioning Editor), Tom Barry (Sky Docs Commissioning Editor ) plus, we will have special guest collaborators from some of Sky’s recent/upcoming titles.\nAdapting Podcasts For TV\nFriday 14 June, 12:00, Channing Hall\nSpeakers: Danny Robins (Presenter/Executive Producer), Jack Bootle (Head of Specialist Factual Commissioning, BBC)\nWorking Class Heroes\nFriday 14 June, 13:45, Channing Hall\nModerator: Dr. Leanne Dawson\nSpeakers: Paul Sng., Alessandra Celesia, Hak Baker\nShaping the Landscape: The Influence of Al Jazeera Documentary on Co-Production, Talent Championing, and Partnerships trends\nFriday 14 June, 14:15, Sheffield Town Hall\nSpeakers: Ahmed Mahfouz Nouh (AJD Managing Director)\nAdel Ksiksi (AJD Manager of Planning & Scheduling)\nLifting the lid on Audiences…(and who’s watching what)\nFriday 14 June, 16:30, Sheffield Town Hall\nSpeaker: Neil Mortensen (Director of ITV Insights Group)\nBreaking Barriers: Navigating Obstacles in Today’s Documentary Landscape\nFriday 14 June, 16:30, Crucible Playhouse\nModerator: Mariayah Kaderbhai (Head of Programmes, BAFTA)\nSpeakers: Participants from BAFTA initiatives\nSATURDAY 15TH JUNE\nDFC Open Assembly II: Don’t panic, organise!\nSaturday 15 June, 10.00, Channing Hall\nMapping the Ecosystem for Storytelling for Social Change\nSaturday 15 June, 11.45, Channing Hall\nSLAM DUNK: Crafting Sports Docs for Broad Appeal\nSaturday 15 June, 13.00 Crucible Playhouse\nModerator: Leslie Lee (director/ producer Super League: The War For Football)\nSpeakers: Kati Fernandez (Senior Director, Head of Development at ESPN), Anouk Mertens (CEO of Neo Studios), Ian Davies, (Executive Producer from Noah Media Group), Ben Turner, (Founding Partner of Fulwell 73 Productions)\nOur Declaration of Independence\nSaturday 15 June, 13.30, Crucible Adelphi\nHosts: The DISCO Network (Ambulante, AFLAMUNA, DocsMX, Doc Society, DocSP, Docubox, In-Docs) in partnership with the Documentary Film Council (DFC)\nArchives for the Future\nSaturday 15 June, 15:45, Sheffield Town Hall\nModerator: Shane O’ Sullivan, (Associate Professor and Head of Department, Film and Photography)\nPalestine Film Institute Showcase\nSaturday 15 June, 15:45, Crucible Adelphi\nModerated by Palestine Film Institute\nLGBTQIA+ DocMakers Meetup\n15th June Crucible Adelphi 17:30\nSupported by BFI Creative Challenge Fund\nPITCHES:\nChannel 4 First Cut Pitch\nFriday 14th June, 10:30, Crucible Playhouse\nOnce again, Channel 4 will be offering five new directors the chance to pitch in front of some of its documentary commissioning team and a live audience. Our winner will walk away with a commission from Channel 4 for their first 60-minute film, and one month of fully paid development and mentorship with an indie to support the development of their idea. You won’t want to miss this fun and playful session.\nSupported by Channel 4\nPodcast Pitch\nSaturday 15th June, 10.00, Crucible Playhouse\nThe podcast pitch brings together six in-development non-fiction audio creators to pitch in front of a selection of industry experts and commissioners. An independent jury will award a first prize (£5000) and second prize (£2000) to the most creative and promising pitches, funded by the Whickers foundation. Come and snoop out this first- time, podcast-only pitch format at Sheffield DocFest.\nFinalists previously announced here\nSupported by The Whickers\nWhickers Pitch\nSunday 16th June, 11.00, Crucible Playhouse\nWho will be awarded the coveted £100,000 Film & TV Funding Award to make their first feature-length documentary? The Whickers Pitch brings together five emerging directors to pitch their non-fiction projects to a panel of industry judges.\nPitching Projects: Camels of the Sea (Vikram Singh), Highness and Excellency (Sajad Imani), One of Us (Rachel Close), Replica (Chouwa Liang), The Cord (Myriam Guillot)\nJudging panel Jane Mote (whickers), Raul Niño Zambrano (Sheffield DocFest), David Green (Editor and Director), Fozia Khan, (Head of Unscripted at Amazon Studios UK). Ibrahim Nash’at (filmmaker and winner of Whickers award 2023), Robin Smith, (Blue Ice Docs Inc).\nProduced by Denise Barren and supported by The Whickers\nCRAFT SUMMIT:\nMarketing Your Film: How to reach Audiences from trailers to tweets\nSaturday 15 June, 10:00, Sheffield Town Hall\nChair: Melanie Iredale (Reclaim The Frame)\nSpeakers: Paul Sng (TISH), Sarah Mosses (Together Films), Christelle Randall (Christelle + Co PR)\nMindful Docs: Filmmaking and Psychological Safety\nFriday or Saturday 15 June, 11:30 Crucible Adelphi\nSpeakers: Rebecca Day (Film In Mind), Juliana Ruhfus (Dart Centre)\nRight Money / Right Film\nSaturday 15 June, 12:30, Crucible Playhouse\nChair: Lizzie Gillet (Misfits Entertainment)\nSpeakers: Julia Nottingham (Dorothy Street Pictures), Soleta Rogan (Co-founder, Exec Producer, Rogan Productions), Alessandro Carroli (Producer, Eie Film)\nMake Film History: A New Platform for Archive-Inspired Storytelling\nSaturday 15 June, 13:30 Sheffield Town Hall\nChair: Shane O’Sullivan (Head of Film and Photography, Kingston University) and Ciara Chambers (Head of Film & Screen Media, University College Cork)\nAI: A Key in the Future of Documentary?\nSaturday 15 June, 14:45 Crucible Playhouse\nSpeaker: Cassie Quarless\nMARKETPLACE SESSIONS:\nSnap Chats: 10-minute meets\nOne of the main reasons delegates come to DocFest is to meet. So let’s do this! Whether you’re looking to find new collaborators for your next film, contribute to someone else’s project, or simply expand your network of doc enthusiasts, get yourself to this mixer. The format is simple: take a seat, chat with the delegate opposite, every 10 minutes you move one seat to the left and meet someone new. Who will you end up chatting with?\nSwitchboard & Consultancies\nDo you have questions about who is funding and distributing what, who is the right partner for your projects, and how to meet them? Come to the Switchboard to take advantage of expert advice on the people you should be meeting at this year’s Marketplace. You can also participate in a consultancy and talk with a range of industry professionals about where to go next with your projects or career.\nExperts and time slots can be found on the website, and you can sign up during the festival in the Reception Room.\nSunrise Breakfast: Building Partnerships with Al Jazeera Documentary Channel\nJoin us for a dynamic breakfast meeting focused on co-producing, acquiring and pitching your creative documentaries and establishing strong partnerships with AJD. During our breakfast, we will talk on how to work with Al Jazeera Documentary Channel and all opportunities available. This event offers a unique occasion to interact with AJD delegates. Whether you’re a filmmaker, producer or distributor, this is your chance to involve in meaningful dialogue, extend your network, and pave the way for future collaborations.\nBreakfast Mixer: Building partnerships with Palestinian filmmakers\nThe Palestine Film Institute invites you to meet and hear from this year’s Palestinian Delegation over breakfast. Filmmakers, festival programmers, co-producers and industry professionals are invited to meet with members of the delegation to extend their networks and explore future collaborations.\nSupported by Al Jazeera and IMS\nMarketplace Round Tables: Meet the Industry\nThese intimate round table sessions are set up around various topics with experts in the field. Find answers to your burning questions and get to know fellow film and industry professionals. With a maximum of ten participants per table, they are designed to be intimate and interactive, allowing for more personalised attention and deeper discussions. We encourage participants to come prepared with questions and actively engage in the conversation.\nMEETMARKET:\nMeetMarket: Match-made Meetings\nSelected documentary projects in the making will have the opportunity to meet with international & UK industry representatives including international funders, broadcasters, distributors, festival programmers and exhibitors. The MeetMarket offers a unique way to pitch your project through carefully curated meetings between pitchers and industry representatives, for creative and financial discussions.\nFull list of projects previously announced can be found here\nMeetMarket: Rough Cut Screenings\nOur Rough Cut Screenings are an opportunity for five selected MeetMarket teams to show part of their documentaries to a room of industry representatives and delegates, to discuss, receive feedback and find partners to move their projects forward.\nTALENT MARKET PARTICIPANTS:\nAlternate Realities Talent Market\nAlternate Realities Talent is an opportunity to foster collaborations between artists, collectives, creatives and organisations focused on using digital technologies to experiment and play with non-fiction boundaries, as well as push storytelling in exciting new directions, and create important artist-to-industry connections. We invite a range of industry representatives that are able to provide opportunities or advice for creators, from gallery and cinema exhibition, to funding, residencies, co-production, and collaborations. Through an open call, we selected 8 talents to meet with experts to get valuable feedback on their new media projects and make new connections.\nThe eight selected talents are: Amparo Soria Fortuny, Debbie Harman, Estela Oliva, Nicholas Carn, Patricia Lalla, Ruth Mariner, Tatiana Collet Apraxine, and Yasmin Khan\nAmplify: Production Talent\nAmplify: Production Talent, is an initiative for entry-level production professionals to elevate their careers. The initiative offers the opportunity to connect with UK production company executives in the factual/documentary TV sector, experience our Marketplace to enhance and widen your network, and learn more about the documentary industry.\nThe eight selected talents are: Esme Hedley, Klaudia Slowik, Lauren May Dawkins, Louis Allen, Nathalie Mayer, Reannon Licorish, Siobhan Bahl, and Tamar Mankassarian",
  "word_count": 2573,
  "scraped_at": "2026-02-14T12:08:49.725214"
}