{
  "article_id": "ab11ed696db9",
  "url": "https://www.examiner.com.au/story/8159735/city-hang-on-after-lions-fightback/",
  "title": "Launceston City the only Northern winners in NPL Tasmania | The Examiner",
  "date": "20230415T133000Z",
  "domain": "examiner.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Launceston City edged an entertaining seven-goal thriller against 10-man Kingborough to bank their third win of the season.\nSubscribe now for unlimited access.\nor signup to continue reading\nDespite playing 78 minutes a man down, Lions fought back from 3-0 down before finishing 4-3 losers as Noah Mies bagged a brace on his return to Prospect Park.\nHowever, the game's pivotal moment involved three former Riverside players as Toby Simeoni's 12th-minute shot was handled on the line by Tom Prince who was duly sent off before Will Humphrey converted the spot-kick.\nToby Anderson finished off a lovely move involving Stef Tantari, Mac Wilcox and Mason Smith and when Tantari cashed in on more Wilcox wizardry it looked game over.\nHowever, Mies struck either side of the interval, the first from a surging run the second from the spot, to keep the contest interesting.\nTantari appeared to have settled proceedings with a screamer four minutes from time but Lions again hit back with what proved to be an injury-time consolation.\nHowever, there was little joy for the North's other two NPL Tasmania sides as both Launceston United and Riverside went down to hefty defeats.\nThe Wentworth Park woodwork conspired against United in a 6-1 loss to Clarence.\nThe result was particularly harsh on United keeper Aidan Piper who made a succession of superb saves but was credited with Zebras' pivotal third goal after Xuan Cappellino's shot hit the post and rebounded in off the luckless gloveman.\nEarlier, the same goal's opposite post had also kept out a David Owusu penalty which would have put the visitors ahead.\nTo complete United's misfortune, Will Spicer suffered the same fate as Piper as Cappellino's 75th-minute shot rebounded in off him after hitting the same post.\nSpicer had conceded the penalty from which Cappellino gave Zebras an early lead which was wiped out by Angelo Amato's excellent strike midway through the first half.\nRiley Dillon added the fifth with the game's third penalty before Sam Tooze's injury-time header completed the scoring.\nRiverside coach Helder Dos Santos Silva was left frustrated by his team's 5-1 loss to champions Devonport.\n\"There are champions and there are winners,\" he said after a niggly contest at Windsor Park.\nThe Portuguese tactician was most annoyed by Strikers' opening goal when home keeper Dan Nash was bundled over before Kieran Mulraney converted.\n\"In terms of football, they have a good team and good players,\" he added. \"My team fought really hard, they were very brave and they have done what I asked of them but it was hard for us out there.\"\nOlympic flooded the midfield in a 3-5-2 with Will Coert accompanying import Andre Chamusca up front and the two nearly combined to keep the scores level at the break before Strikers opened the floodgates.\nFormer Northern Ranger Nick Lanau-Atkinson marked his home-coming with a goal whch squirmed under Nash, Lachlan Van Neutegem added the third after a rebound off the post before Roberto Garrido and Mulraney completed Strikers' scoring, the latter with a trademark towering header.\nOlympic's consolation, and their second NPL goal of the season was - like the first - from the penalty spot, Chamusca converting after being fouled off the ball.\nGlenorchy inflicted South Hobart's first loss of the season with a 1-0 win at KGV on Friday night to briefly hit the top of the ladder.\nRowan Pitt scored the only goal while Jackson Gardner was outstanding in goal as Nick Mearns played his 150th NPL game.\nWomen's Super League\nThe only WSL match of the day saw Devonport romp to a 7-1 win at struggling Taroona.\nNorthern Championship\nIn the Women's Northern Championship, Northern Rangers' goal-scoring feats continued unabated with a 12-0 defeat of Somerset.\nGrace Cogger kicked off the scoring for Jo Haezebrouck and Rod Fulton's side but Abbie Chugg led the way with five goals and there were hat-tricks for both Drew Chugg and Jess Loft.\nRiverside edged a tight encounter with Devonport 2-1.\nA week after losing 13-0 in the statewide cup to the Strikers' WSL team, Olympic exacted revenge through first-half goals from Matilda Reilly and Meg Connolly.\nTaylor Wittwer hit back for Strikers on the hour but Olympic held on to the points.\nOlympic coach Lucy Johns said: \"Happy to win ugly. We did not play well so it's good to win games when you're not playing well.\"\nIt was a less successful afternoon for Reilly's dad Richard whose Launceston City side went down 8-0 to Ulverstone.\n\"Ulverstone are a very mature-age team who have been playing together for a long time,\" he said. \"We're still rebuilding but it was good to have a couple of under-16s coming up for us.\"\nIt was a similar story for Launceston United, who lost 9-0 at Burnie United.\nIn the men's competition, Launceston City enjoyed the better of a 10-goal action-fest against Ulverstone, winning 7-3.\nCity came from 2-1 down with Magnus Hansen, Daniel Smith (two each), Louis Johannes, Daniel Luck and Alec Harris getting the goals.\nNorthern Rangers went down 2-1 to Somerset, Pat Lanau-Atkinson scoring on the same day as his brother Nick.\nLaunceston United went down 4-2 at Burnie United.\nIn the late fixture, Devonport proved too strong for Riverside, winning 4-2. An own goal and Rupert Rathbone registered for Olympic.",
  "word_count": 882,
  "scraped_at": "2026-02-14T12:39:41.961866"
}