{
  "article_id": "ab27f9bee133",
  "url": "https://www.jamaicaobserver.com/2024/05/18/reggae-girl-shaw-happy-player-season-award/",
  "title": "Reggae Girl Shaw happy with player - of - the - season award",
  "date": "20240518T140000Z",
  "domain": "jamaicaobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Reggae Girl Shaw happy with player-of-the-season award\nLONDON, United Kingdom (CMC) — Acclaimed Jamaica senior women’s team striker Khadija “Bunny” Shaw was named the 2023-24 Women’s Super League Player-of-the-Season in England on Friday.\nThe 27-year-old was the top scorer in the WSL with 21 goals in 18 matches for Manchester City Women when she suffered a broken foot in a match last month that has ruled her out of the closing stages of the season with her side desperately wishing they had her firepower to help them clinch the title ahead of holders and current leaders, Chelsea.\nThe announcement came a day after Shaw was formally presented with the Women’s Footballer-of-the-Year award at the Football Writers Association awards gala, where her counterpart Phil Foden was handed the men’s award.\nIn accepting that award, she said: “I’ve had a little hiccup, but overall, it’s been a good season, and I’m happy.\n“It’s been a good season. I’ve always said that the team makes me look good. I’m playing with world-class players and that makes me look good at the end of the day.\n“I just try to do the bits I can at the end of the pitch and work for the team, and ultimately arrive at the end of the season winning stuff. Here we are.”\nThanks to the scoring prowess of Shaw throughout the season, Man City Women are second in the table, trailing Chelsea only on goal difference, with one round of matches remaining, and they visit mid-table Aston Villa on Saturday, requiring at least three goals to stand any chance of lifting the title.\n“It’s exciting times,” Shaw said about the final match. “I’m going to be very nervous to be honest, but I believe in my team, and I love every single one of them out there. Once we do our best, hopefully the best is good enough.”\nShaw has been the central figure in her club’s drive to clinch the WSL title, and she appears likely to also collect the WSL Golden Boot award at the end of the season for scoring the most goals in the league, incredibly averaging a goal every hour and six minutes during the campaign.\nShe became the first player to score three WSL hat-tricks in a calendar year, and the club’s record goal scorer, overtaking Georgia Stanway in the process.\nOne of the memorable moments during the season for Shaw and Man City Women came when she scored the only goal in a 1-0 win against Chelsea in February, with her side becoming the first visiting team to come away from Kingsmeadow with three points in over three years.\nTo earn the award, Shaw fought off a sizeable challenge from City teammate Khiara Keating — named the League’s Golden Glove winner for best goalkeeper the day before — as well as Chelsea duo Lauren James and Niamh Charles, Lotte Wubben-Moy of Arsenal, Spurs youngster Grace Clinton, Jutta Rantala of Leicester, and Brighton forward Elisabeth Terland.",
  "word_count": 496,
  "scraped_at": "2026-02-14T12:22:33.072443"
}