{
  "article_id": "ab3db3474cc2",
  "url": "https://www.nbcphiladelphia.com/entertainment/entertainment-news/taylor-swift-travis-kelce-relationship-timeline/4259822/",
  "title": "Taylor Swift and Travis Kelce relationship timeline – NBC10 Philadelphia",
  "date": "20250826T194500Z",
  "domain": "nbcphiladelphia.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Taylor Swift and Travis Kelce's love story is one for the ages.\nFor the past two years, the NFL star and record-breaking pop icon have proudly shown their affection for each other across the biggest stages in both music and sports. Now, the couple is taking their relationship to the next level.\nStream Philadelphia News for free, 24/7, wherever you are with NBC10.\nOn Aug. 26, the couple shared a joint Instagram post of Travis Kelce kneeling to the ground in front of Swift as they announced their engagement.\n“Your English teacher and your gym teacher are getting married,” the caption reads, accompanied by a dynamite emoji.\nSwift and Travis Kelce's romance fittingly started with a friendship bracelet — the symbol of the singer’s record-breaking “Eras Tour.”\nTheir story began when Kansas City Chiefs tight end Travis Kelce saw Swift perform at his team's home stadium in July 2023. After the concert, he famously expressed his interest in Swift during an episode of “New Heights,” the podcast he hosts with his brother, former NFL star Jason Kelce. The NFL star revealed that he had tried — and failed — to give Swift a bracelet with his phone number on it.\nWhat fans didn’t know at the time was that Swift was paying attention, and the pair got to know each other behind the scenes. Rumors went into overdrive in September 2023 when Swift attended the first of many Chiefs games to cheer on Travis Kelce and his team.\nFor the past two NFL seasons, Swift has become a fixture in stadium suites and on TV screens, attending games with her famous besties, her family and the girlfriends and wives of Travis Kelce's teammates.\nMeanwhile, Travis Kelce's been seen supporting her. He traveled internationally to see a number of the pop icon's “Eras Tour” concerts around the world, and even made an appearance onstage in London before the global tour wrapped in December 2024.\nIn August 2025, Swift appeared on her first-ever podcast interview, proudly sitting beside Travis Kelce as she announced the name of her 12th album: “The Life of a Showgirl.”\nHow did these two lovebirds get here? Here’s a detailed timeline of their relationship.\nJuly 8, 2023: Travis Kelce attends 'Eras Tour' stop in Kansas City\nTravis Kelce attended one of Swift’s “Eras Tour” concerts like millions of fans in the summer of 2023. But while Swifties were looking forward to hearing some of the musician’s biggest hits, Travis Kelce arrived with a plan to get Swift’s attention.\nThe tight end told his brother on the July 26, 2023, episode “New Heights” that he created a friendship bracelet with his phone number on it and intended to give it to Swift at the concert.\n“I was disappointed that she doesn’t talk before or after her shows because she has to save her voice for the 44 songs that she sings. So I was a little butt-hurt I didn’t get to hand her one of the bracelets I made for her,” he said.\nAug. 2, 2023: Travis Kelce is asked about Taylor Swift by a reporter\nNFL Network reporter Andrew Siciliano asked Travis Kelce about his interest in Swift in an Aug. 2, 2023, interview.\nAs soon as Siciliano mentioned the “Anti-Hero” singer’s name in the video, Travis Kelce started laughing. The journalist then started to ask about his previous attempt to get Swift’s attention.\n“I said what I said,” Travis Kelce responded. “And I meant what I said when I said it.”\nHe continued, “You know, what? It is what it is. I’m not going to talk about my personal life. I know what you writers want to hear. And you want to hear more about that, and I’m not going to give you anything.”\nSiciliano pressed on, wondering if Swift reached out to Travis Kelce.\n“And that’s going to wrap it up here at NFL training camp,” Travis Kelce playfully said, skirting the question, before the clip ended.\nSept. 21, 2023: Travis Kelce addresses the dating rumors\nIn a Sept. 21, 2023, visit to “The Pat McAfee Show,” Travis Kelce responded to comments his brother made to sportscaster and former NFL star Tony Gonzalez the week before about him and Swift dating.\n“The guy is absolutely ridiculous, can’t stay out of the freaking headlines,” the Chiefs tight end joked. “Please everybody, stop asking my brother about my love life.”\nTravis Kelce also addressed the dating rumors head-on.\n“I threw the ball in her court. I told her, I’ve seen you rock a stage in Arrowhead and you might have to come see me rock the stage at Arrowhead,” he said of his attempt to meet Swift at her concert in Kansas City. “We’ll see what happens in the near future.”\nSept. 24, 2023: Taylor Swift attends her first Chiefs game\nSwift made headlines when she showed up to her first Kansas City Chiefs game to see the team take on the Chicago Bears at Arrowhead Stadium on Sept. 24, 2023.\nThe “Lover” singer was seen on TV enthusiastically cheering for Travis Kelce while seated next to his mom, Donna Kelce.\nThe Fox broadcast captured Swift throwing her hands in the air and celebrating when Travis Kelce scored a touchdown in the third quarter. The Grammy winner appeared to shout, “Let’s f------ go!” before excitedly banging her hands on the glass in the player’s box.\nDuring the game, Fox announcers repeatedly chimed in about the possible romance between Swift and Travis Kelce in between plays.\n“I mean, I think the secret’s out,” one NFL commentator said.\nSept. 27, 2023: Travis Kelce says his personal life will stay out of the spotlight\nOn the Sept. 27, 2023, episode of “New Heights,” Travis Kelce reacted to the mania around Swift’s surprise attendance at the Chiefs game days before.\n“I just thought it was awesome how everybody in the suite had nothing but great things to say about her. You know, the friends and family. She looked amazing,” he said. “Everybody was talking about her in a great light and on top of that, the day went perfect for Chiefs fans, of course.”\nHe said the experience would be “a game I’ll remember.”\n“And then we just slid off in the getaway car at the end,” he added, using a Swift song title to reference the viral photos of them leaving Arrowhead Stadium together in a convertible.\nBut the athlete said also said he plans to keep his personal life private.\n“What’s real is that it’s my personal life and I want to respect both of our lives,” he said. “So everything moving forward, I think me talking about sports and saying, ‘All right now,’ would have to be kind of where I keep it.”\nOct. 1, 2023: Taylor Swift attends Chiefs-Jets game in New Jersey\nSwift attended another Chiefs game on Oct. 1, 2023, when the Chiefs beat the New York Jets at MetLife Stadium in New Jersey.\nSwift was spotted at the game with an entourage of famous friends, including Ryan Reynolds, Blake Lively, Sophie Turner, Hugh Jackman and more.\nThe night before the game, the singer was spotted grabbing dinner with her girlfriends and Brittany Mahomes, who’s married to Chiefs quarterback Patrick Mahomes.\nOct. 6, 2023: Travis Kelce says he’s ‘even more on top of the world’ amid Taylor Swift relationship buzz\nDuring a press conference Oct. 6, 2023, Travis Kelce addressed what it was like adjusting to a new level of fame because of the rumors about him and Swift.\n“As all the attention comes, it feels like I was on top of the world after the Super Bowl and right now, even more on top of the world,” the athlete told reporters.\nTravis Kelce added that he was “rolling with” the constant attention from paparazzi while attempting to separate work and play.\n“You got a lot of people that care about Taylor for good reason,\" he said. \"You just got to keep living and learning and enjoying the moments. At the end of the day, I’ve always been pretty good at compartmentalizing and being able to stay focused in this building.”\nDuring a visit to TODAY the same day, Donna Kelce discussed how life had changed for her since she was spotted with Swift at a Chiefs game.\n“It truly feels like I’m in some kind of an alternate universe,” she said. “It’s just really, really strange, but it’s fun. It’s a great ride.”\nOct. 12, 2023: Taylor Swift attends Chiefs-Broncos game\nJust one day after appearing on the red carpet for the premiere of her “Eras Tour” concert film in Los Angeles, Swift was spotted in the player’s box at Arrowhead Stadium again as the Chiefs took on the Denver Broncos. She cheered on Travis Kelce’s team alongside both of his parents and Brittany Mahomes.\nOct. 14-15, 2023: Taylor Swift and Travis Kelce make 'SNL' cameos and are seen out in NYC\nThough they still hadn’t confirmed their romance to the media, Swift and Travis Kelce both made surprise cameos on the Oct. 14, 2023, episode of “Saturday Night Live.”\nTravis Kelce popped up at the end of a sketch to poke fun at the NFL’s coverage of his then-rumored relationship. Swift briefly appeared on camera to introduce the episode’s musical guest, Ice Spice, with whom she collaborated on a remix of “Karma.”\nAfter the episode aired, Swift and Travis Kelce were photographed walking hand-in-hand when arriving at Nobu in midtown Manhattan, and again when they left the restaurant.\nThe following night on Oct. 15, the singer and football star were photographed holding hands outside of Waverly Inn in New York City.\nOct. 22, 2023: Taylor Swift Attends Her fourth Chiefs game\nSwift attended the Chargers-Chiefs game on Oct. 22, 2023, marking her fourth appearance at a Chiefs game in the 2023 season. She wore a red Chiefs sweatshirt and a gold friendship bracelet with Travis Kelce’s jersey number, 87.\nChariah Gordon, who got engaged to Travis Kelce’s former teammate Mecole Hardman, Jr., shared pics taken at the game. One of them showed Swift giving Travis Kelce a sweet peck on the cheek while holding his shoulder, marking the first time the couple had been photographed sharing a kiss.\nNov. 10, 2023: Travis Kelce travels to see Swift in concert in Argentina — where she changes the lyrics to 'Karma' in his honor\nAs Swift kicked off the South American leg of her “Eras Tour,” Travis Kelce traveled to see her perform at a concert in Buenos Aires, Argentina, on Nov. 10, 2023.\nDuring the show, Swift changed the lyrics to one of her biggest hits in honor of her beau.\n“Karma is the guy on the Chiefs, coming straight home to me,” she sang, swapping the word “Chiefs” for “screen,” a lyric believed to be in reference to her ex, actor Joe Alwyn.\nAfter the show ended, multiple fans captured videos of Swift running into Travis Kelce’s arms backstage and sharing a kiss.\nNov. 20, 2023: Travis Kelce acknowledges he and Swift are a couple and says he's 'never dated' anyone like her before\nIn an interview with WSJ. Magazine published Nov. 20, 2023, Travis Kelce reminisced about his attempt to meet Swift at her Arrowhead concert in July.\nThe NFL star alluded to the people who were “playing Cupid” for the two of them, although he didn’t specify who.\n“There were definitely people she knew that knew who I was in her corner (who said): Yo! Did you know he was coming? I had somebody playing Cupid,” he told the publication.\nTravis Kelce also recalled the couple’s first date, which he said took place in New York, although he declined to share details.\n“When I met her in New York, we had already kind of been talking, so I knew we could have a nice dinner and, like, a conversation, and what goes from there will go from there,” he said.\nTravis Kelce recalled that he managed to keep his nerves at bay, but his friends and family — not so much. “Everybody around me telling me: Don’t f--- this up! And me sitting here saying: Yeah — got it.”\nDuring the same interview, Travis Kelce marveled over how Swift managed to enjoy her life despite the “scrutiny” she regularly faced.\n\"The scrutiny she gets, how much she has a magnifying glass on her, every single day, paparazzi outside her house, outside every restaurant she goes to, after every flight she gets off, and she’s just living, enjoying life,\" he said. \"When she acts like that, I better not be the one acting all strange.”\nDec. 6, 2023: Taylor Swift speaks publicly about the couple's relationship for the first time\nSwift broke her silence about her relationship with Travis Kelce when she was named Time’s Person of the Year for 2023.\nIn a story published in the magazine on Dec. 6, 2023, Swift revealed that she and Travis Kelce started dating after he “adorably put me on blast” on the “New Heights” podcast.\n“We started hanging out right after that,” she said. “So we actually had a significant amount of time that no one knew, which I’m grateful for, because we got to get to know each other.\n“By the time I went to that first game, we were a couple,” she added.\nSwift was careful to emphasize that when she attended her first Chiefs game on Sept. 24, it was not the couple’s first date.\n“We would never be psychotic enough to hard-launch a first date,” she said.\nSwift went on to say that she and Travis Kelce enjoyed supporting each other at their respective public events — a stark contrast from her relationship with her ex Joe Alwyn, which took place largely out of the spotlight.\n“When you say a relationship is public, that means I’m going to see him do what he loves, we’re showing up for each other, other people are there and we don’t care,” said Swift. “The opposite of that is you have to go to an extreme amount of effort to make sure no one knows that you’re seeing someone. And we’re just proud of each other.”\nDec. 3-31, 2023: Taylor Swift attends five consecutive Chiefs games\nAfter Swift wrapped her “Eras Tour” for 2023, she became a regular guest at Travis Kelce’s games each week.\nStarting on Dec. 3, 2023, with the Chiefs-Packers matchup in Wisconsin, Swift became a fixture. She went on to attend both home and away games against the Buffalo Bills and the New England Patriots.\nOn Christmas Day, she brought her whole family — including her brother, Austin, who dressed as Santa Claus — to the Chiefs-Raiders game.\nThen on New Year's Eve, Swift cheered the Chiefs to victory against the Cincinnati Bengals.\nBut after the game, it was Travis Kelce who was doing the praising. In a video showcasing Swift’s outfit, Travis Kelce couldn’t help but add to the comment section.\nSwift wore a white Jeff Hamilton Chiefs jacket, almost identical to one Travis Kelce wore before the Christmas Day game against the Las Vegas Raiders. In Hamilton’s post about the jacket, Travis Kelce commented fire and raised hands emoji.\nJan. 13-28, 2024: Taylor Swift cheers on the Chiefs during the postseason — and shares a kiss with Travis Kelce on the field\nSwift continued cheering on her boyfriend as the Chiefs went into the postseason in 2024.\nWhen the Chiefs played the Miami Dolphins on Jan. 13, 2024, Swift sat with Donna Kelce again and repped a custom red puffer jacket featuring her boyfriend’s number, 87.\nThe jacket was designed by Kristin Juszczyk, the wife of 49ers player Kyle Juszczyk. Swift’s new pal Brittany Mahomes wore a matching jacket featuring the number 15, her husband Patrick Mahomes’ number.\nSwift then traveled to Buffalo, New York, for the divisional round of the NFL playoffs and watched the Chiefs take on the Bills, winning 27-24.\nShe posed for pictures with her boyfriend’s brother and sister-in-law, Jason and Kylie Kelce, at the game.\nContinuing her postseason streak, Swift attended the Chiefs' AFC Championship Game against the Baltimore Ravens on Jan. 28 with friends Keleigh Teller and Cara Delevingne.\nAfter the Chiefs won 17-10 — positioning the team to take on the San Francisco 49ers in the 2024 Super Bowl — Swift took to the field with Travis Kelce’s family and shared a kiss with her boyfriend.\nFeb. 11, 2024: Travis Kelce and Taylor Swift celebrate the Chiefs winning Super Bowl 58\nThe Kansas City Chiefs edged the San Francisco 49ers, 25-22, in overtime to win Super Bowl 58, the team’s third championship in the last five seasons.\nSwift flew across multiple time zones from her “Eras Tour” stop in Tokyo, Japan, to Allegiant Stadium in Las Vegas to watch her boyfriend play.\nSwift attended the game with Blake Lively and Ice Spice.\nAfter the Chief’s victory, a huge celebration filled the field. Swift and Donna Kelce held each other close as they listened to Travis Kelce and others make speeches.\nWhen Swift and Travis Kelce were finally reunited on the field, they embraced and kissed each other.\nFeb. 23-March 8, 2024: Travis Kelce travels to Taylor Swift's international 'Eras Tour' shows\nJust weeks after Swift cheered Travis Kelce to victory at the 2024 Super Bowl, he flew to Sydney, Australia, to see her perform in the first of several “Eras Tour” dates.\nBased on videos shared by concertgoers, the Super Bowl champ clapped for his girlfriend on Feb. 23 and high-fived fans during the show.\nSwift, meanwhile, gave her boyfriend a few shoutouts during the show. She included her signature lyric swap about him — singing “Karma is the guy on the Chiefs” during the finale — and also appeared to reference his Super Bowl win by pointing into the crowd while singing, “When they gave us our trophies...”\nOn March 8 and 9, Travis Kelce also attended his girlfriend's concerts in Singapore.\nApril 13, 2024: Taylor Swift and Travis Kelce attend Coachella\nWhen Swift and Travis Kelce attended Coachella together, the pop star wore a green baseball cap with the “New Heights” logo, a reference to the Kelce brothers’ podcast that started it all.\nFans shared adorable videos of Swift and Travis Kelce dancing along to performances from the band Bleachers, led by Swift’s longtime friend and collaborator Jack Antonoff, and Ice Spice, who performed her verses from Swift’s “Karma.”\nApril 19, 2024: Taylor Swift and Travis Kelce share candid footage of one another in personal videos\nCelebrating the release of her 11th album, “The Tortured Poets Department,” Swift released a YouTube Short video filled with clips from a two-week period in her life.\nThe video included an appearance from Travis Kelce, who is seen swooping in to give Swift a kiss on her cheek.\nOther clips showed Swift wearing a University of Kansas shirt, frosting cinnamon rolls, playing pickleball and hanging out on a yacht with friends. She’s also seen visiting Singapore’s Gardens by the Bay with Travis Kelce.\nApril 19, 2024: Taylor Swift releases 'TTPD,' including new songs that fans believe are about Travis Kelce\nWhile most of “The Tortured Poets Department” chronicles Taylor Swift’s “saddest story” and a “period of the author’s life now over,” many fans suspected that Travis Kelce is referenced in some of the album’s happier lyrics.\nIn “The Alchemy,” Swift sings about giving in to an almost-magical relationship through a chorus overflowing with football metaphors.\nThen in “So High School,” she sings about a pure, youthful love and mentions a game of “marry, kiss, kill,” seemingly referencing a 2016 interview with the tight end tied to his short-lived dating show, “Catching Kelce.”\nSwift also showed up in a welcome video for her boyfriend's annual music festival, Kelce Jam, on May 18. The montage included a clip of Swift clapping on the field after the Chiefs defeated the 49ers in the 2024 Super Bowl.\nAt the event, Travis Kelce opened up about his favorite music off Swift's new album when he spoke to “Access Hollywood.\"\n“‘So High School’ might be the only one jumping into my mind right now. I think everybody will get fired up for that one,” he said. “‘The Man’ is my niece’s favorite, so we can always go with ‘The Man.’”\nApril 27, 2024: Taylor Swift attends charity gala with Travis Kelce in Las Vegas\nSwift and Travis Kelce showed their support for Chiefs quarterback Patrick Mahomes when they attended the 15 and the Mahomies Vegas Golf Classic gala in Las Vegas on April 27.\nIn a video shared on X, Swift and Travis Kelce are seen walking hand and hand through the venue. Swift wore a metallic green gown while the tight end opted for a blue suit with a white shirt, sans tie.\nIn a video shared by an attendee to Instagram, Travis Kelce took the stage alongside the night’s auctioneer to offer attendees a surprise item up for bid.\n“I was just talking to my significant other, and we might have one other auction item that wasn’t on the docket. Has anybody heard of the ‘Eras Tour?’” Travis Kelce said to the crowd as he helped auction off four tickets to one of Swift’s show’s.\nJune 23, 2024: Travis Kelce makes surprise onstage appearance at 'Eras Tour' in London\nTravis Kelce made a surprise cameo onstage during one of Taylor Swift’s “Eras Tour” concerts at Wembley Stadium in London.\nDuring the June 23 show, Travis Kelce, dressed in a black suit and top hat, popped up onstage alongside Swift and several dancers during her performance of “I Can Do It With a Broken Heart.”\nThe football pro joined the dancers to perform a pantomime routine that showed them trying to get Swift ready for the rest of her show.\nThe crowd cheered as Travis Kelce picked up Swift at one point and carried her around the stage.\nDuring the \"Eras Tour\" stop in London, Swift and Travis Kelce also notably met and posed for a selfie with Prince William and his kids Prince George and Princess Charlotte.\nSept. 5, 2024: Taylor Swift attends first Chiefs game of the 2024 season\nSwift helped the Chiefs kick off the 2024 season on Sept. 5 when she showed up at Arrowhead Stadium to watch the team claim victory over the Baltimore Ravens.\nThe singer was back at Arrowhead again on Sept. 15 to cheer on the Chiefs as they beat the Cincinnati Bengals in their second game of the season.\nSwift, who was dressed in an oversized Chiefs T-shirt and thigh-high black boots, attended the Chiefs-Bengals game with her mom, Andrea Swift, and Haim singer and guitarist Danielle Haim.\nThe three women joined up with Ed and Donna Kelce to watch the game in a stadium suite.\nSept. 8, 2024: Taylor Swift and Travis Kelce attend the U.S. Open and more in New York\nSwift and Travis Kelce attended the the U.S. Open tennis championship at Arthur Ashe Stadium in New York City on Sept. 8, 2024.\nThe couple looked fashionable as they watched Jannik Sinner of Italy beat Taylor Fritz, the first American player to make it to the final since 2006.\nSwift wore a red gingham dress and shades while Travis Kelce wore a white shirt, cardigan sweater and red and green striped Gucci hat — nearly twinning with Brittany Mahomes, who joined the couple with her husband Patrick Mahomes for a double date.\nSept. 11, 2024: Taylor Swift thanks Travis Kelce in VMAs acceptance speech\nWhen Swift took home the award for video of the year at the 2024 MTV Video Music Awards, she used her speech to thank her team, fans and one person very special to her: Travis Kelce.\nThe pop star won the final award of the evening for her song “Fortnight,” featuring Post Malone.\n“Something that I’ll always remember is that when I would finish a take... I would always just hear someone like, cheering from across the studio where we were shooting it,” she said while recalling the experience of filming the music video.\n“And that one person was my boyfriend, Travis.”\n“Everything this man touches turns to happiness and fun and magic,” she continued. “So I want to thank him for adding that to our shoot, because I’ll always remember that.”\nDecember 2024: Taylor Swift and Travis Kelce inspire Christmas movies\nSwift and Travis Kelce's relationship sounds so fairytale-like, it has inspired not one, but two romance films for the 2024 holiday season.\nTheir relationship provided some of the \"magic\" that inspired the Chiefs-centric Hallmark film, \"Holiday Touchdown,\" which premiered on the network Nov. 30. The film follows a Chiefs super fan and the team's director of fan engagement and marks Donna Kelce's film debut.\nMeanwhile, Lifetime told a more pulled-from-the-headlines story with \"Christmas in the Spotlight,\" which follows a pop star and football player falling in love, featuring a script full of references to Swift.\nJan. 26, 2025: Taylor Swift celebrates on the field with Travis Kelce after AFC Championship Game\nThe Chiefs emerged victorious from the AFC championship for the fifth time in six years after beating the Buffalo Bills 32-29. Swift attended the game with her whole family.\nAfter the win, Swift joined Kelce on the field, where they were photographed sharing a hug.\nThe official X account for the NFL also shared footage of the couple talking on the field after.\n“This is so insane,” Swift said. “This is not a real-life situation.”\n“It wasn’t like this in Baltimore last year,” Kelce added.\nFeb. 2, 2025: Fans suspect Taylor Swift's Grammys outfit has a nod to Travis Kelce\nSwift’s outfit for the 2025 Grammys may have contained a special reference to Travis Kelce.\nThe football star was unable to attend the award show due to Super Bowl preparation (he also missed the Grammys in 2024, when Swift when album of the year for “Midnights”), but Swift’s red mini-dress at the event had some thinking of the Chiefs.\nPlus, the chain draping over her thigh featured a dangling “T” charm. While the “T” could represent a monogram for “Taylor,” many fans thought it referenced a lyric from “The Tortured Poets Department.”\n“that T chain is so ‘What if he’s written ‘mine’ on my upper thigh’ coded,” one person tweeted, referring to lyrics from the song “Guilty As Sin?”\nIf the “T” detail was a reference to the song, the initial likely stands for her boyfriend — Travis.\nFeb. 6, 2025: Travis Kelce's dad says the couple will be 'connecting more' after Super Bowl\nA few days before the 2025 Super Bowl, Travis Kelce's father, Ed, did an interview with Today Australia where he shared his thoughts on how the couple will use their free time after the Super Bowl.\n“I think, you know, we get past the Super Bowl it’s going to be a very good period of time for the two of them,” he said. “Without the NFL season, without the 'Eras Tour.' Just them alone really connecting more and I think that can only be a good thing.\"\nJune 24, 2025: Taylor Swift gives surprise performance at Travis Kelce's Tight End University event\nTaylor Swift and Travis Kelce attended their first red carpet event together in June 2025 when they appeared at his Tight Ends & Friends concert at the Brooklyn Bowl Nashville concert hall.\nTravis Kelce's organization, Tight End University, which he founded with fellow athletes George and Greg Olsen, holds the annual event to bring together tight end players for a bonding experience.\nDuring the evening, Swift took the stage to strum her guitar and sing her \"1989\" hit song \"Shake It Off.\" Fans captured videos of Swift performing for the crowd and receiving a roaring applause after.\nJuly 24, 2025: Travis Kelce posts Taylor Swift on his Instagram for the first time\nTo cap off his NFL offseason, Travis Kelce shared a carousel of photos to his Instagram July 24, including multiple pictures of his vacations with Swift. The post marked the first time that he uploaded snaps of the couple to the social media platform.\nOne photo showed him donning a \"Captain\" hat while she complimented him in a \"First Mate\" cap. In another picture, the couple matched in all black while enjoying a night out at dinner. The two also took a snowy trip with reporter Erin Andrews, her husband, Jarret Stoll, and sportscasters Steven Cundari and Charissa Thompson.\nTravis Kelce included more snaps of the pair spending time with friends and one of him and Swift playing hockey on an ice skating rink.\n\"Had some adventures this offseason, kept it 100.\"\nAug. 12, 2025: Travis Kelce gushes about being Taylor Swift's 'plus one'\nTravis Kelce opened up about his relationship with Taylor Swift and sharing the spotlight for the past two years in an interview with GQ.\nThe star athlete, who is the magazine's September cover star, said about their romance, \"I get to be the plus one. I get to go and be that fan. Because I am a fan.\"\nHe added, \"I’m a fan of the music. I’m a fan of art. And it’s so cool that I get to experience her being that plus one for me on the football field. I feel that same enjoyment every time she comes to my shows.\"\nAs for the attention the couple gets, Travis Kelce said that the public scrutiny does affect him.\n\"You can’t block that (attention) out,\" he shared. \"If someone says something that they don’t like about you, you have to be able to understand how you are portraying yourself for them to say that.\"\nTravis Kelce further explained, \"I’m a guy who doesn’t want anyone to say anything negative about me. Some people don’t give a f—. I’m someone who does care. I do want people to look at me like I’m doing good in the world. I’m influencing and being somebody that has done it the right way.\"\nHe also revealed some traits that his girlfriend shares with his mom, complimenting both for their kindness, authenticity and work ethic.\nAug. 13, 2025: Taylor Swift announces 12th album, 'The Life of a Showgirl,' on 'New Heights' podcast\nAfter teasing a special guest on the next episode of their podcast by simply sharing a silhouette of a woman, Travis and Jason Kelce waited a few hours before confirming Taylor Swift would make an appearance on their show.\nA clip was added to \"New Heights'\" social media accounts that showed Travis Kelce and Swift sitting side by side as she marveled \"We’re about to do a f---ing podcast?!\"\nAround the same time, a countdown also popped up on Swift's official website with the message, \"EXPIRES AUGUST 12 AT 12:12 A.M\" against an orange, sparkly background.\nSwifties immediately began to speculate on social media what the pop star had up her sleeve. Thankfully, she didn't make them wait too long. As soon as the countdown expired, Swift and \"New Heights\" shared a snippet of her announcing her 12th album: \"The Life of a Showgirl.\"\nAug. 26, 2025: Taylor Swift and Travis Kelce share they're engaged!\nIn a major relationship milestone for Swift and Travis Kelce (and a big moment for their devoted fans), the couple shared in a joint post on Instagram that they're engaged.\n“Your English teacher and your gym teacher are getting married,” the caption read, alongside a dynamite emoji.\nThe carousel post featured five photos, beginning with a shot of Travis Kelce on one knee holding Swift by the waist as she holds his head in her hands.\nSeemingly in a garden surrounded by flowers of white, pink and red hues, the next photo showed the two smiling, standing forehead to forehead. In the subsequent shots, Swift shows off her sparkling ring, while in another, the two are seen embracing. The last shot is taken from a vertical angle as the two pose on a couch with Swift's legs draped over Kelce.\nAriana Brockington, Anna Kaplan, Maddie Ellis, Samantha Kubota, Gina Vivinetto, Becca Wood, Chloe Melas, Doha Madani, Nicoletta Richardson, Drew Weisholtz, Francesca Gariano and Joyann Jeffery contributed to this article.\nThis story first appeared on TODAY.com. More from TODAY:",
  "word_count": 5363,
  "scraped_at": "2026-02-14T14:18:27.684863"
}