{
  "article_id": "ab6028b96467",
  "url": "https://www.richlandsource.com/2026/02/08/paul-newmans-knuckles-led-to-an-acting-career-instead-of-selling-bowling-balls/",
  "title": "Paul Newman knuckles led to an acting career , instead of selling bowling balls",
  "date": "20260208T124500Z",
  "domain": "richlandsource.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "History Knox\nMark Sebastian Jordan authors a column each Saturday reflecting on Knox County's history.\nA snowbound weekend is a good opportunity to retell one of the classic stories of Knox County history: the infamous brawl at the Bluebird Club, which resulted in the rise of one of the world’s most beloved actors, Paul Newman.\nWhile newspaper reports of the time give only the basics of what happened, there was oneparticipant who later wrote a memoir, and that was Newman himself.\nThe handsome young football player had relished his time at the Ohio University in Athens, but unfortunately, he had some trouble focusing on his studies, when, by his own admission, his attention had a tendency to drift toward the college’s ladies, many of whom were all too eager to spend some quality time with the attractive, blue-eyed young man.\nThe resulting plummet of his grades caused Newman’s father — a driven, high-achieving small business owner in the Cleveland suburb of Shaker Heights — to accuse his son of screwing up.\nDeciding to flee from college, Newman left school and joined the Navy as World War II dawned. After the war, Newman talked with his father, Art, about the difficulties — and distractions — he had experienced at Ohio University.\nBetween them, they came up with an idea for him to enroll in a different school, one that was not co-educational. A boys-only school where he wouldn’t be constantly tempted by attractive young women.\nAnd that’s how Paul Newman came to Kenyon College in Gambier. Unfortunately for his and his father’s intentions, the plan was faulty, because once Paul settled into Kenyon (and its party life), he discovered that there was a fatal flaw in their thinking.\nOn a campus without women, most of the students were absolutely possessed with the thought that they needed to connect with local girls, thus creating tension between the Kenyon students and local young men.\n“Your every waking hour was spent figuring how you could get yourself a Gambier, Ohio, town girl,” Newman said in his memoir ‘The Extraordinary Life of an Ordinary Man.’ “So, instead of having girls on campus and kind of basking in their company, being able to pick and choose, their absence became the preoccupation.”\nOn Oct. 26, 1946, a bunch of guys from the Kenyon football team decided to go over to a little bar south of Mount Vernon, the Bluebird Club, today part of the Irish Hills Golf Course complex.\nWithout question, picking up girls was part of the plan, and if that involved a little tension, a little pushing and posturing with the local young men, then that was part of a normal night out.\nIn fact, Newman claimed that it wasn’t unusual for a Kenyon student and a townie to pass on the street a few days after one of these altercations and nod to each other, sometimes with a joking barb about getting them the next time.\nBut the tensions were running a little higher on this occasion.\n“What precipitated things was that we Kenyon guys were regularly trying to take their girls away from them,” Newman wrote. “The townies would go to the john and when they came back, we’d be dancing with their dates.”\nOn this night, tensions flared up into an actual fist fight. As it turned into a full-out bar brawl, the bartender at the club telephoned the police. When two plainclothes detectives arrived, some of the students were too inebriated to rein it in.\nWhen the lawmen started to intervene, Bert Forman, the Kenyon quarterback, turned around and decked one of them. The other officer flashed his badge.\n“Come and get me,” Forman responded. “I’m right here. Where do you want me to go?”\nWhere they wanted him to go was to the jail in Mount Vernon. After the barman pointed out the ringleaders of the fight, the cops started loading them into their car. One of the Kenyon guys saw Newman standing there and tossed him his car keys, telling him to bring his car up to town.\nWhen Newman arrived at the police station with his friend’s car keys, the officer on duty said, “Let me see your knuckles.”\nWhen Newman showed his battle-scarred knuckles, the sergeant decided to throw him in with the other rowdies. Thus, Paul Newman served a night in jail in Mount Vernon.\nWire reports spread the news all over the state the following morning about the Kenyon football players getting arrested for brawling, and names were named. Coach Pat Pasini immediately kicked the students off the team, and four of them were expelled.\nLuckily, Paul was only put on academic probation, as he wasn’t one of the ringleaders of the fight. But that didn’t mean he got off easily.\nOne of the people who read the article was a certain small business owner in Shaker Heights, Ohio. When Art Newman drove down to Mount Vernon to bail out his son, he read him the riot act.\nHe said it was the last straw, that if Paul screwed up any more, he’d yank the boy out of college and put him to work in the family sporting goods store selling bowling balls.\nPaul wasn’t keen on that. So he resolved to buckle down, and stay out of trouble. After all, his own reputation at Kenyon was, “Prone to getting out of hand on long tiring evenings.”\nOn academic probation, and kicked off the school football team, Newman had a lot of those long, tiring evenings, and he was alarmed that without something to fill his time, he’d soon get back in trouble.\nLooking around for something to fill the hours, he saw that tryouts for a theater production were being held. Theater! That was something he might be able to do.\nHe had done a few play productions as a child, which his mother had supported. He didn’t suppose he was any good, for he never felt like he had any natural talent for acting, and for the rest of his life, Newman said acting was something he had to work at diligently.\nSo, he auditioned.\nBy Newman’s own admission, his work at Kenyon was mediocre, at best. Others, including his director and acting teacher, Jim Michael, saw things differently and encouraged him to keep at it.\nWhen tragedy struck a couple years later, and the Old Kenyon dormitory burned down, with a resultant high loss of life, the college president called Newman and other theater personnel into his office.\nThey were slated to be opening a farce the following weekend, and in response to the tragedy, had considered canceling the production. Instead, they were implored to go ahead with the show, for the college community desperately needed something to break the grim tension.\nThe show went on, giving a grieving campus something to laugh about, when laughs were most sorely needed.\nIt was the first of many times that Newman was to come through with work that brought joy to people.\nHe later parlayed his success in Hollywood into philanthropical pursuits which brought further joy to people worldwide, and still do, to this day. (Side note, your correspondent happens to be drinking a cup of Newman’s Own coffee as he writes this!)\nPaul Newman’s passing in 2008 was genuinely mourned.\nAnd without a bar brawl in Mount Vernon, Paul Newman may never have found that one thing he was passably decent at. His phenomenal acting career might never have taken place, and he may have ended up selling bowling balls in Cleveland.",
  "word_count": 1259,
  "scraped_at": "2026-02-14T12:38:12.583522"
}