{
  "article_id": "ab687c077a9a",
  "url": "https://www.masslive.com/tv/2025/03/how-to-watch-womens-march-madness-florida-state-vs-lsu-free-live-stream.html",
  "title": "How to watch Women March Madness : Florida State vs . LSU free live stream",
  "date": "20250324T220000Z",
  "domain": "masslive.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "There is a spot in the Sweet 16 up for grabs between the Florida State Seminoles and the LSU Tigers when they face off on Monday, March 24 in the 2025 NCAA Women’s Basketball Tournament at Pete Maravich Assembly Center in Baton Rouge, La.\nThe game is scheduled to start at 6 p.m. EDT and will be broadcast on ESPN. Fans looking to watch this college basketball game can do so by using FuboTV, which offers a free trial and up to $25 off your first month, or DirecTV Stream, which also offers a free trial. SlingTV doesn’t offer a free trial but does have other promotional offers available. ESPN+ plans are currently at $11.99 a month or $16.99 a month if you bundle with Hulu and Disney+.\nThe Second Round of March Madness wraps up on Monday, but not before the Tigers and Seminoles battle for the chance to take on NC State, the 2 seed in Regional 1 - Spokane.\nLSU is the 3 seed and advanced with a 55-point blowout of San Diego State. Florida State, the 6 seed in the region, also won in a blowout, defeating George Mason by 35.\nWho: 6 seed Florida State Seminoles vs. 3 seed LSU Tigers\nWhen: Monday, March 24 at 6 p.m. EDT\nWhere: Pete Maravich Assembly Center in Baton Rouge, La.\nStream: FuboTV; Sling; DirecTV Stream; ESPN+\nBetting: Check out our MA sports betting guide, where you can learn basic terminology, definitions and how to read odds for those interested in learning how to bet in Massachusetts.\nWhat is FuboTV?\nFuboTV is an internet television service that offers more than 200 channels across sports and entertainment including Paramount+ with SHOWTIME. From the UEFA Champions League to the WNBA to international tournaments ranging across sports, there’s plenty of options available on FuboTV, which offers a free trial and up to $25 off the first month for new customers.\nWhat is DirecTV Stream?\nDirecTV Stream offers practically everything DirecTV provides, except for a remote and a streaming device to connect to your television. Sign up now and get three free months of premium channels including MAX, Paramount+ with SHOWTIME and Starz.\nWhat is SlingTV?\nSlingTV offers a variety of live programing ranging from news and sports and starting as low as $20 a month for your first month. Subscribers also get a month of DVR Plus free if they sign up now. Choose from a variety of sports packages without long-term contracts and with easy cancelation.\nWhat is ESPN+?\nESPN+ is a one-stop shop for content from almost every single sport. In addition to on-demand replays of games across all sports shown on the ESPN and Disney family of networks, there is also exclusive access to select college football games, NHL games, soccer matches, UFC programs and the entire 30 for 30 catalogue. Additionally, there is ESPN+ exclusive original programing like NFL Primetime, Dana White’s Contender Series and The Breakdown with Peyton and Belichick. You can stream ESPN+ on your phone, tablet, smart TV or gaming console for $11.99/month or bundle with Disney+ and Hulu for just $16.99 per month.\nRELATED CONTENT:\nMarch Madness: South Dakota State, UConn can both call upon deep benches as they meet in 2nd round\nBy JIM FULLER Associated Press\nSTORRS, Conn. (AP) — If South Dakota State and UConn played in March Madness last season, neither team would have many options to summon players off the bench because neither had much dept due ot injuries.\nWhat a difference a year makes. The two teams will meet on Monday night with a spot in the Sweet 16 at stake.\nSouth Dakota State’s starters averaged from 28 to 31 minutes per game while UConn’s top six players were on the court for at least 30 minutes per game.\nHeading into the second-round game, nobody from second-seeded UConn is averaging at least 30 minutes per game while 10 players for the Jackrabbits see more than 10 minutes per contest.\n“I’ve gotten so used to not having a full complement of players that I had forgotten that coaching is hard,” UConn women’s basketball coach Geno Auriemma said. “A lot of coaches have to make decisions on what’s my lineup going to look like. I haven’t had to make that decision in four years. I haven’t had to sub in four years. So, I haven’t had any (ticked) off players in four years. Everybody plays 40 minutes and they all love life.”\nKK Arnold and Ashlynn Shade started for a UConn team that reached the 2024 Final Four. With Azzi Fudd back after being limited to two games a season ago and Princeton transfer Kaitlyn Chen earning a starting role, they now come off the bench.\n“Coming off the bench, you kind of emphasize that when you do when you go into the game, change the game when you are in there,” said Shade, who had 20 points in a first-round win over Arkansas State. “Just being a spark off the bench is something we take very seriously.”\nSouth Dakota State head coach Aaron Johnston tightened the rotation up a bit in the NCAA opener with Oklahoma State as he went with mostly a seven-player rotation for the 10th-seeded Jackrabbits. He can go deeper into his bench if he wants to give the favored Huskies a different look.\n“Rotations every year are always different just based on injuries, who’s available, things like that,” Johnston said. “So this year’s team, it’s worked out. We do have a lot of depth just because of things we’ve dealt with over the past couple years. We’ve had several players returning this year who have been starters for us at some point in their career.”\n“I think we have the talent. We have the depth where we can go into our bench and feel like it’s really productive. But at the same time, we’ve got key players that really have to be on the floor and have to play well, too.”\nMinnesota Stars Reunited In Storrs\nWhen the NCAA women’s basketball bracket came out, the four Minnesota natives on the South Dakota State team took a few seconds to wonder what it would be like to go up against Minnesota basketball prodigy Paige Bueckers and the 11-time national champion UConn Huskies in the second round of the March Madness bracket.\nThey will get their wish.\n“Paige Bueckers is an incredible player and we are excited to battle it out with them,” said South Dakota State guard Madison Mathiowetz, who didn’t play against Bueckers in either high school or AAU but could see plenty of her Monday night. “I watched in her AAU passing through the gym and on TV growing up. She is somebody who has put a lot of time into basketball.”\nSouth Dakota State senior forward Kallie Theisen had plenty of games against Bueckers in high school. Now, they will meet one last time in what will be Bueckers' final home game at UConn.\n“I have had quite a few matchups with her over the years,” Theisen said. “It is fun to play her on college basketball’s biggest stage. It has come a little full circle.\n“People are really drawn to her, she has been a great player since high school and she has a lot of eyes on her at all times and she handles it really well.”\nSo why are there so many girls' basketball players from Minnesota who make an impact at high-profile programs?\n“I attribute it a little to the cold weather and wanting to be inside,” Bueckers said. “I always found myself at the gym and I am sure a lot of people can say the same thing.\n“It is great for the state of Minnesota, I have always said Minnesota is a basketball state. Everybody knows it as a hockey state but for us to play on this stage and in March Madness, it is everything you dream of as kids.”\nThe Associated Press contributed to this article\nMore sports, gear and tickets\n- Where to stream Rising Stars Challenge and HBCU Classic live today\n- Where to watch NBA Celebrity All-Star Game today free\n- How to buy tickets to NBA All-Star Weekend: Celebrity Game, Rising Stars Challenge, All-Star Saturday Night, NBA ASG\n- Where to watch USA women’s hockey game today free\n- 2026 Olympics: How to stream Canada men’s hockey game today live",
  "word_count": 1400,
  "scraped_at": "2026-02-14T12:49:17.498226"
}