{
  "article_id": "abac55762df3",
  "url": "https://www.bbc.co.uk/sport/football/articles/c6282pm3j6mo",
  "title": "Euro 2025: Record attendances and carnival atmosphere makes it a hit for Swiss hosts",
  "date": "2025-07-27T07:52:26.898Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_bbc",
  "body_text": "Record attendances and carnival atmosphere - Euro 2025 a hit for hosts\n- Published\nAfter 25 days of football-filled drama, Euro 2025 is nearly over.\nThe winners will be decided in a heavyweight clash in Sunday's final in Basel, with England hoping to defend their title while world champions Spain search for their first Euro crown.\nHow has the tournament been received off the pitch? And what sort of hosts have Switzerland been?\nRecord-breaking attendances\nEuro 2025 has been a record-breaking tournament.\nAfter Spain's semi-final win over Germany in Zurich, the total attendance across the event stood at 623,088 - surpassing the 574,875 set in England in 2022.\nThat is especially impressive when you consider that Switzerland, unlike England, does not have 70,000-plus capacity stadiums like Wembley and Old Trafford.\nBasel's St Jakob-Park, which holds 34,250 spectators, is the country's largest stadium and will host the final.\nPlus, the Swiss Women's Super League is not yet professional and the average attendance across the league was just 569 last season.\nWith 29 of 31 matches at Euro 2025 sold out, the total attendance is set to exceed 650,000 when Sunday's final is factored in.\n\"It's a women's tournament but the number of fans, broadcast attention, broadcast deals, the enthusiasm of the cities hosting the games - all of this has combined to probably make this a breakthrough tournament for Uefa and all of the participating nations,\" said Uefa vice-president and former Wales captain Laura McAllister.\nAbout 35% of tickets have been bought by travelling fans, with 160 nationalities represented among the ticket holders.\nFans flock to Switzerland\nFans have flocked to Switzerland in their thousands to enjoy the football, along with the picturesque towns, crystal clear lakes and breathtaking Alpine scenery.\nMore than one million supporters have packed out the fan zones dotted around the eight host cities, while more than 95,000 fans have joined the pre-match fan walks.\nFor each of Switzerland's four games, a sea of red has flooded the streets, with 20,000 fans turning out in Bern before their quarter-final against Spain.\nThe popular marches have created a carnival-type atmosphere before kick-off with each nation's fans chanting, dancing and drumming their way to the stadiums - putting supporters in a party mood and enhancing the atmosphere inside the grounds.\nAs always, supporters have been decked out in their country's colours, but a recurring theme has emerged over the tournament, with fans adding flavour to the festivities with 'food war' signs.\nPasty over pasta. Paella over fondue. Jamon over currywurst.\nThose were just some of the witty food-related comments written on homemade signs to fuel the playful rivalries between fans.\nSupporters have also been helped by Switzerland's pledge to host a sustainable tournament with free public transport to games for anyone with a ticket.\nAnd Uefa has trained more than 10,000 visitors in CPR as part of its Get Trained Save Lives campaign.\n'More than I had dreamed of'\nIn what turned out to be Switzerland's last game of the tournament, when they fell to a 2-0 defeat by Spain, some fans held up signs that read \"women's football is here to stay\".\nIn reaching the quarter-finals for the first time, the hosts captured national attention.\nHome fans filled stadiums and roared on Pia Sundhage's side, while they stayed well after full-time following their quarter-final loss to thank the players for their efforts during the tournament.\nSwitzerland's kit manufacturer, Puma, said it sold seven times as many Swiss shirts during Euro 2025 as during the Women's World Cup in 2023.\n\"I am very, very proud of Switzerland,\" Sundhage said after the defeat by Spain.\n\"If you look at the people coming to the games, it has been phenomenal, it has been a once-in-a-lifetime feeling and very emotional.\n\"It was more than I had dreamed of.\"\nThe tournament feels like a pivotal moment for women's football in Switzerland, and one that will help the Swiss FA's ambition of doubling the number of girls and women playing football in the country from 40,000 to 80,000 by 2027.\nRelated topics\n- Published24 July 2025\n- Published30 June 2025",
  "word_count": 686,
  "scraped_at": "2026-02-14T11:17:43.499954"
}