{
  "article_id": "abaf1a090eb4",
  "url": "https://www.newcastleherald.com.au/story/8891493/newcastle-jets-squad-set-to-be-bolstered-for-pivotal-a-league-run/?cs=7580",
  "title": "Newcastle Jets squad set to be bolstered for pivotal A - League run | Newcastle Herald",
  "date": "20250214T004500Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Newcastle Jets look set to be bolstered by the return of key players as they eye a crucial three-match stretch in A-League Women.\nSubscribe now for unlimited access.\nor signup to continue reading\nNot only can a run of results breathe a glimmer of life into their slim finals hopes, it will also put some distance between themselves and the bottom of the points table.\nThe Jets are 10th on 11 points with eight rounds remaining.\nThey are 13 points adrift of the top six and face a Herculean task to bridge the gap to the finals contenders.\nConcerningly, Newcastle are in a four-way tussle for last place with their next three opponents - Western Sydney (nine points), Perth (12) and defending champions Sydney FC (10).\nThe Jets travel to Wanderers Football Park on Friday night.\n\"They're all against teams who are in and around where we are, so you want to start to move away from those teams,\" Jets coach Ryan Campbell told the Newcastle Herald on Thursday.\n\"You still keep in mind that top-six position. That might be slipping away a little bit, but you still want to make sure that you're moving away from the teams that are toward the bottom of the table. So, the next three games are key to that, in order to get a bit of a run on.\"\nThe Jets came from 2-0 down to draw 2-2 with Wanderers in their season-opener at Cessnock Sportsground in November.\nExperienced wide attacking player Lauren Allan sealed the point with an equaliser that day and looks set to be back in the Jets squad on Friday night after missing 5-1 and 2-0 defeats to sixth-placed Central Coast (24) and runaway leaders Melbourne City (36) respectively due to a knee injury.\nExplosive striker Lara Gooch, who represented Australia at the under-20 World Cup in Colombia last year, could also return from a back complaint pending clearance at training on Thursday night.\nDefender Claudia Cicco, also a former Young Matildas representative, will also be available for selection after serving a one-match suspension.\nWho will make way for the trio is not yet known but home-grown emerging talents Josie Allan and Claire Adams, both 18 and scholarship-holders, are expected to retain their places in the Jets squad.\nAllan and Adams are having eye-catching A-League campaigns and were this week rewarded by selection in the Young Matildas squad for a Four Nations tournament in Canberra starting Monday.\nAllan is in her third season as a scholarship player with the Jets. After five appearances in 2022-23 and four last season, all which were off the bench, the unpredictable strike weapon has featured 12 times this campaign.\nShe has started seven times and scored three impressive goals.\n\"At the moment, she's one of the most exciting players in the league to watch,\" Campbell said.\n\"When she gets the ball, she makes things happen. I allow her just to do her thing a little bit and not really limit her with what she does with the ball.\n\"I'm just trying to work on her understanding her defensive roles and responsibilities so that she's a good team player but then able to do her individual things that you can't coach. They're just natural for her.\"\nAdams, a skilful attacking midfielder, earned her first A-League scholarship this season and has impressed in nine appearances off the bench.\n\"She's a real No.10; she can create things,\" Campbell said.\n\"She can make something out of nothing with the ball and she's quite sharp in regards to what she does. She's a real attacking outlet.\n\"She's good on both feet and she sees things in the front third that other players don't. And now that she's starting to add defensive capabilities to her game as well, it just adds another layer that she was probably missing before.\"\nLining up for Wanderers will be another A-League rising star in Sienna Saveska.\nThe 18-year-old is having a break-out season. She has scored seven goals in 15 outings to be in the leading goalscorer race and was also named in a 26-player Young Matildas squad this week.\n\"She's had a really good season. She's obviously scored a lot of goals,\" Campbell said.\n\"She's always been on the radar of national teams but she's done well for herself and is one that's shown with game time and with exposure they're able to go out and do it.\n\"She's a real bright prospect and she's a danger one for us to be aware of.\"",
  "word_count": 753,
  "scraped_at": "2026-02-14T12:49:49.562573"
}