{
  "article_id": "abb2e2babf4d",
  "url": "https://www.irishecho.com/2024/4/katie-taylor-for-netflix-streamed-rematch-on-july-20",
  "title": "Katie Taylor for Netflix - streamed rematch vs . Serrano on July 20",
  "date": "20240424T214500Z",
  "domain": "irishecho.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Katie Taylor will face Amanda Serrano for a second time on the card of Mike Tyson versus Jake Paul on July 20 in Texas, with the undisputed super-lightweight championship on the line. Two years on from a history-making first bout at MSG, the Bray-born boxer will clash again with Serrano at the 80,000-capacity AT&T Stadium in Texas, in what is being billed as a co-main event. The fight will be broadcast free to subscribers on streaming platform Netflix in what is another new departure in Taylor’s career. It ends a period of uncertainty for Katie after a trilogy fight with Chantelle Cameron in Dublin, planned for this May, failed to materialize. Taylor was then set to face a mandatory challenger at an unknown U.S. venue, until talks with Serrano’s camp intensified in recent weeks. The long-awaited rematch between the London Olympic champion and Puerto Rican-born, Brooklyn-based Amanda Serrano will be the richest-ever fight in women’s professional boxing and the speculation is that Taylor’s share of the purse will be $6 million. The Irish woman will celebrate her 38th birthday a few weeks before the fight.\nMEATH’S O’ROURKE SLAMS\nPROVINCIAL ‘SHAMBLES’:\nAfter Meath’s heavy defeat to Dublin in the quarter-finals of the Leinster Senior Football Championship ten days ago Meath manager Colm O’Rourke said that the Leinster Championship ‘‘is a shambles,’’ but he quickly added that ‘‘it’s not Dublin’s fault.’’ With Dublin dominating for the past 14 years, there is no doubt that of the four provincial football championships Leinster is the weakest, with nobody able to ‘‘lay a hand on the Dubs.’’ The former Meath star, who is now trying to revive the fortunes of the Royals, reckons that the provincial championships should be played before the National Football League, as most counties don’t know which competition they are going to play in, the Sam Maguire or Tailteann Cup.\nHe said: ‘‘If the provincial championship were over, everyone would know exactly before the start of the National League, particularly those counties in the second and third division, what they had to do to ensure the play in the Sam Maguire Cup competition.’’\nO’Rourke normally speaks a lot of sense, but I don’t think this idea is in that category. In the National Leagues, which are now played in the months of February and March, counties get to play counties of their own level and normally there are no heavy defeats, which can happen in the provincial championships. Dublin are well ahead of the other 10 counties in Leinster (Kilkenny don’t field a senior football team) and that’s the way it is right now.. On Sunday it’s going to be another easy win for Dublin when they play Offaly in the Leinster semi-final at Croke Park. The current Offaly team are struggling and just avoided relegation from Division 3 last month. Since they stopped Kerry’s hopes of five in-a-row in 1982 the Faithful County has won only one Leinster final; that was in 1997. There is definitely more at stake in the other semi-final between Kildare and Louth as the winners, will be guaranteed a place in the Sam Maguire Cup, irrespective of how they fare in the Leinster final, probably against Dublin. A win is crucial for Kildare as they have no hope of qualifying for the Sam Maguire competition via their final National League placing where they lost all seven games, while Louth would have a better chance as they won two of their seven games in Division Two.\nIt will be a bit more competitive in the Ulster championship where Down play Armagh in Clones in the first of the semi-finals on Saturday evening, and on Sunday Donegal play Tyrone.\nSEPTEMBER FINALS\n‘POSSIBLE’ AGAIN\nGAA president Jarlath Burns has said that return to the traditional September All-Ireland finals is possible, but only if counties were willing to adopt uniformity in their own club championships. Speaking to GAAGO’s new “Ratified” discussion forum, Burns said the different formats in counties made it too great a challenge to develop a master fixtures plan that concluded in September. He said: ‘‘With uniformity, the GAA could build in gaps in the calendar where club activity could take place. There is a way of achieving that, going back to September with the two finals. The difficulty is that the people who are going to have to compromise are the counties with their own championships. If you are organizing the Premier League fixtures, very simple, all you have to look out for are UEFA and FIFA fixtures. But if you are organizing the GAA master fixtures plan you have to bump into 32 master fixture-making bodies, higher education, and multiply that by two as you have hurling and football. And then within that you have seven or eight different iterations of championships. It is totally ridiculous to think that we can organize a master fixtures plan around that.’’\nBurns also acknowledged that hotel prices for teams and supporters were also an issue for July All-Ireland finals. It looks like the current crop of inter-county players are happy with the split season, but GAA supporters and many former players are not as happy. Former Wexford All-Ireland hurling winner Tom Dempsey says the GAA should go back to September for the All-Ireland finals and the Association should also revert to playing the All-Ireland club finals on St Patrick’s Day. He said. ‘‘We have taken two key dates out of the equation, September and March. Basically we have conceded them.’’\nHOME GAMES FOR\nAVIVA, CROKE PARK\nLeinster will play the majority of their home games next season at the Aviva Stadium, while the RDS is being redeveloped, and Croke Park will also remain available to the province for bigger games. Leinster, who have invested heavily by adding All-Black Jordie Barrett and South African RG Snyman to their squad for next season, have added a new introductory rate for new season ticket holders, a family season ticket and a student season ticket in the hope of increasing numbers for next season. As it stands, Leinster has 12,800 season ticket holders. Leinster also have approval to play games at Nowlan Park in Kilkenny, but it appears unlikely they are unlikely to move any competitive games out of Dublin. The Blues will play their Champions Cup semi-final against Northampton Saints at Croke Park on May 4, while the later stages of the URC play-offs will also be staged at Croke Park if Leinster progress to that stage.\nTyler Bleyendaal has agreed to join Leinster Rugby ahead of the start of the 2024/25 season as assistant coach in place of the departing Andrew Goodman, who is joining Andy Farrell’s Irish backroom team. Bleyendaal is no stranger to these shores having played 62 times with Munster before a persistent neck injury forced him into early retirement in May 2020. Before joining Munster, the out-half had played 21 games for the Crusaders and 32 games for Canterbury in Super Rugby.\nSEASON ROUNDS OUT\nWITH PUNCHESTOWN\nCarlow trainer Willie Mullins had six runners in Saturday’s Scottish Grand National, but it was his 18/1 hope Macdermott that prevailed over Surrey Quest in a photo finish. Danny Mullins, his nephew, was on board.\nIt has been a great National Hunt season overall for Irish horses, trainers and jockeys with big wins in Cheltenham, Aintree and Fairyhouse. Now the Irish National Hunt season comes to an end with the Punchestown National Hunt Festival, which starts next Tuesday. After experimenting with some late evening starts in recent years the Punchestown management have made some changes for this year’s festival. Racing on Tuesday and Wednesday will revert to a traditional 2.30 p.m. start from the current time of 3.40 p.m. Market research shows that around 70 per cent of paying clients would like to see some of the festival days start and finish earlier. And following a review of ticket pricing there will be a price reduction to €30 for the first three days and €40 for Friday and Saturday for advance purchased tickets. The schools around Punchestown always close for the Festival and children under 14 years are admitted free.\nMullins is already guaranteed to be the top trainer for the season, but the jockey championship will be a tight race where Jack Kennedy is currently a few winners ahead of Paul Townend. However, Townend will probably get to ride a lot of Mullins’ horses during the Festival which could be to his advantage.",
  "word_count": 1405,
  "scraped_at": "2026-02-14T13:30:30.476910"
}