{
  "article_id": "abc941534019",
  "url": "https://www.sbs.com.au/news/podcast-episode/criticism-of-proposed-protest-laws-following-the-bondi-attack-midday-news-bulletin-22-december-2025/x17qsvzxt",
  "title": "Criticism of proposed protest laws following the Bondi attack | Midday News Bulletin 22 December 2025",
  "date": "20251222T014500Z",
  "domain": "sbs.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\nTRANSCRIPT\n- Criticism of proposed protest laws following the Bondi attack\n- The federal government proposes domestic gas reservation policy\n- And in football, Sam Kerr leads the way as Chelsea triumphs over Liverpool\nThe Coalition will move to establish a federal Royal Commission into the Bondi terror attack and antisemitism more broadly when federal parliament returns.\nThe Prime Minister has so far resisted calls from the Opposition and Jewish community leaders to announce a Royal Commission - but has ordered a review into federal intelligence and law enforcement agencies, and announced a national gun buyback scheme.\nThis morning, Opposition leader Sussan Ley laid out the Coalition's proposed terms for the inquiry, with key members of her cabinet.\nShadow Attorney-General Andrew Wallace says immigration is one of the issues that must be considered.\n\"One of the major issues that it must look into is radical Islamic extremism, and how the Commonwealth, state and territory governments and agencies have addressed or failed to address that issue. It must look into immigration and how people given visas, how they are given citizenship; and importantly, how people are entitled to review the decisions made by the Commonwealth government.\"\n---\nNew South Wales Parliament has been recalled for two days [[22-23 Dec]] to debate a range of measures contained in a single bill, following the Bondi terror attack.\nPremier Chris Minns says he wants to see the proposed measures on gun control, hate speech and restrictions on protests passed quickly.\n\"Rejects antisemitism unequivocally and hatred and intolerance in all of its forms. And recognises that we have no place in our modern multicultural community for this behaviour. Resolves to lead the eradication of antisemitism in any form that appears, and commits to do all we can to hasten the elimination of this hatred in our state.\"\nThe proposed legislation includes laws to cap gun ownership at four firearms, with strict exemptions for primary producers and sports shooters.\nThe gun limits have been questioned by the Nationals, while the Greens have opposed the proposed restrictions on protests, including a ban on public assemblies that could extend to three months - if a terrorist incident is formally declared under the Terrorism (Police Powers) Act 2002.\nDr Naama Blatman, an executive member of the Jewish Council of Australia, says the proposed restrictions on protests will stifle democracy.\n\"What happened in Bondi was an evil antisemitic attack. But let it be very clear, there is nothing connecting this attack to the movement for justice in Palestine. Criticism of Israel, as harsh as it may be, is not equivalent to antisemitism. We reject outright these claims, and we reject the notion that our community will be safer through passing draconian laws.\"\n---\nThe federal government has announced a domestic gas reservation scheme that would apply to new contracts from today.\nUnder the scheme, exporters would be required to reserve between 15 and 25 per cent of gas production for the domestic market.\nEnergy Minister Chris Bowen says continued investment in gas production is important to support the transition to renewable energy sources.\n\"Gas is an important support as we transition to renewables. It's flexible. A gas fired power station can be turned on and off, unlike coal or nuclear for that matter, and that's very valuable. If you can have a gas fired power station that you can turn on at times of peak demand and then turn off, so it's not emitting when we don't need it.\"\nMr Bowen says a detailed design of the scheme will be developed after consultation with industry and international partners.\n---\nVictoria Police will boost security for the Boxing Day Test at the Melbourne Cricket Ground, with officers from the Critical Incident Response Team to patrol the perimeter as a precaution.\nThe specialist officers will carry longarm semi-automatic rifles, in a move Victoria Police describes as proactive - but not in response to a specific new threat.\nThe officers, which will also patrol approaches to the park, come in addition to planned resources - involving the Public Order Response Team and mounted police.\n---\nAnd in football,\nAustralia's Sam Kerr has helped Chelsea score a 9-1 thrashing over Liverpool in the Women's League Cup quarter-final.\nIt's the first time the Australia captain has enjoyed consecutive starts for the Blues since returning from an ACL injury, and she made her presence felt with two first-half goals in the space of four minutes.\nChelsea now plays Manchester City in a rematch of last year's final.",
  "word_count": 765,
  "scraped_at": "2026-02-14T12:37:25.348129"
}