{
  "article_id": "ac5f8b57db55",
  "url": "https://auckland.scoop.co.nz/2023/12/fifa-womens-world-cup-2023-delivers-strong-economic-boost-and-leaves-lasting-legacy/",
  "title": "Auckland . Scoop » FIFA Women World Cup 2023™ Delivers Strong Economic Boost , And Leaves Lasting Legacy",
  "date": "20231214T224500Z",
  "domain": "auckland.scoop.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FIFA Women’s World Cup 2023™ Delivers Strong Economic Boost, And Leaves Lasting Legacy\nPress Release – Auckland Unlimited\nThe FIFA Women’s World Cup 2023 Impact Evaluation for Auckland report released today, reveals that the FIFA Women’s World Cup 2023™ (FWWC 2023) generated a net economic benefit of $48.9 million to Auckland, far exceeding expectations. The figure includes both direct and indirect spending and non-financial impacts, demonstrating the event’s positive economic and social benefits.\nAuckland played a major role in New Zealand’s co-hosting of FWWC 2023 across the Official Draw at the Aotea Centre in October 2022, the Play-Off Tournament held at North Harbour Stadium in February 2023, and nine World Cup matches at Eden Park between 20 July and 15 August 2023. The World Cup saw eight of the 32 participating teams call Auckland home through the group stage of the tournament, experiencing firsthand the warmth and manaakitanga of the region and residents.\nThe FWWC events injected $87.1m in GDP into the region’s economy and over 175,000 visitor nights surpassing initial projections by 49% and 35% respectively. Spectators contributed to the majority of visitor nights in Auckland, with an average stay of 4.5 nights*, highlighting the FWWC 2023’s success in not only attracting visitors but also encouraging them to explore and experience Auckland for longer durations, maximizing the event’s economic impact.\nThe influx of visitors spent $45.6 million, directly injecting money into various parts of the tourism sector including accommodation, hospitality and retail – significantly boosting activity in the region in July and August which are traditionally quieter months.\nBeyond the immediate economic benefits, the FWWC 2023 has left a legacy for Auckland with over $18 million invested in upgrading pitches, lighting and facilities which will continue to benefit local communities for years to come, providing access to high-quality sporting infrastructure for athletes of all ages and abilities.\nThe tournament witnessed a surge in interest in women’s sports, with 350,719 tickets issued across the nine Eden Park matches. A record crowd for a football match in Aotearoa New Zealand – women’s or men’s – was broken three times in Auckland and a capacity crowd of 43,217 was achieved for the final three matches played at Eden Park. The FIFA Fan Festival, open from the beginning to the end of the FWWC 2023 at The Cloud on Queen’s Wharf, attracted over 90,000 fan visits with its free access and family-friendly environment.\nNotably, 97% of attendees reported that the event significantly increased the visibility of women’s sports in New Zealand, highlighting the tournament’s potential to inspire and empower future generations of athletes and fans. Additionally, 90% of respondents acknowledged the event’s positive impact on Auckland’s image and atmosphere, showcasing the region’s ability to unite and uplift the community.\nFWWC 2023 has solidified Auckland’s reputation as a world-class host city for major international events. The region’s enduring legacy extends far beyond the economic benefits, leaving a lasting impact on its residents and visitors to the region.\nAuckland Mayor Wayne Brown says he’s pleased FWWC 2023 surpassed Auckland’s forecasts. “It is a good result and I was glad to be able to play a small part in encouraging this great event.”\nThe region’s benefit-cost ratio reached 1.32, indicating that for every dollar invested, Auckland received $1.32 in return.\nTātaki Auckland Unlimited CEO Nick Hill stated, “The FIFA Women’s World Cup 2023™ exceeded expectations on all fronts, leaving a lasting positive impact on Auckland. The event showcased Auckland’s position as a vibrant and dynamic region, but it also generated significant economic, social and cultural benefits. The tournament involved huge collaboration across the Auckland Council group and with wider city stakeholders, and we extend our appreciation to all our valued partners for their support in making it such a success. We are committed to leveraging this momentum to attract future major events and further strengthen Auckland’s position on the global stage.”\n*per overnight visitor\nContent Sourced from scoop.co.nz\nOriginal url",
  "word_count": 654,
  "scraped_at": "2026-02-14T12:05:31.694472"
}