{
  "article_id": "ac65dcdbc000",
  "url": "https://www.bbc.co.uk/sport/football/66574772",
  "title": "Karen Bardsley : Women World Cup team of the tournament",
  "date": "20230822T063000Z",
  "domain": "bbc.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Well, the 2023 Women's World Cup has come to a close and it has certainly been an exciting tournament filled with surprises and upsets.\nYoung players have announced themselves on the global stage. International footballing powerhouses have been felled, and Spain have emphatically etched themselves into the history books as they raised the trophy for the first time on Sunday night in Australia.\nWhat an incredible month it has been for women's football. And what better way to sum it all up than a subjective conversation about the team of the tournament.\nI've definitively selected an attack-minded XI.\nGoalkeeper: Mary Earps, England\nMary Earps had an enormously positive impact on England's World Cup campaign. An excellent communicator, her presence helped steady the Lionesses' defence.\nShe single-handedly secured England's top-of-the-group finish with her one-v-one shot stopping ability, consistent distribution, and big-game mentality. Not to mention she saved a penalty in a World Cup final.\nLeft wing-back: Esmee Brugts, Netherlands\nExpectations have changed for defenders and playing both sides of the ball (in and out of possession) is essential. Brugts - a young, lively and technical player - delighted with stellar strikes and deliveries into the box.\nShe also silenced many critics with her one-v-one defending and intelligence, which she demonstrated by anticipating and intercepting passes, pressing, and contributing to the attack by crossing from wide areas.\nHer dynamism up and down the left wing turned out to be critical for the Dutch.\nShe probably has the two goals of the tournament to her name and always made herself involved in the attacking third. But, defensively, Brugts also put up big numbers with 3.3 tackles and 2.5 interceptions per 90 minutes. At 20, the future certainly looks bright for Brugts.\nCentre-back: Alex Greenwood, England\nAlex Greenwood was tremendous both in and out of possession for England. When England moved to three at the back, it suited all of Greenwood's strengths.\nOut of possession, Greenwood's well-timed, last-ditch tackles and excellent positional discipline provided defensive stability. Her in-possession abilities were even more impressive, building up play and consistently splitting defences with a pass.\nA player the Lionesses couldn't do without this summer.\nCentre-back: Amanda Ilestedt, Sweden\nA stalwart in defence with a knack for scoring goals, Amanda Ilestedt offers Sweden the best of both worlds. Her positional intelligence disrupted opposition attacking threats and insured that she was hardly beaten on the dribble.\nMoreover, she dominated in the air in both boxes and was alert to second balls, scoring an impressive four goals in six games.\nRight wing-back: Ona Batlle, Spain\nAn accomplished and decisive defender, Ona Batlle ushered attackers right where she wanted them. Battle stopped attacks before they started.\nHowever, the excellent one-v-one defender made her presence felt by under and overlapping runs, faultless deep crosses, and the occasional darting dribble into the box.\nDefensive Midfield: Teresa Abelleira, Spain\nTeresa Abelleira pulled the strings and set the tempo in the Spanish midfield. Arguably the main cog, she disrupted opponents' attacks with tackles, interceptions, and regains.\nComplemented by her intelligence and deadly precision, she simultaneously protected the back line by killing counter attacks while providing threats from deep areas.\nCentral/Attacking midfield: Aitana Bonmati, Spain\nA perceptive midfielder, Aitana Bonmati is effective in all aspects of her game but movement and availability set her apart. Bonmati's constant scanning of the pitch ensured that she got on the ball consistently.\nThen, her skill and control allowed her time in tight spaces, where she linked play, carved the opponent's midfield and defence apart with her passing range. If that wasn't enough, her late arrival into the box allowed an additional goalscoring threat. World class.\nCentral/Attacking midfield: Jenni Hermoso, Spain\nHermoso was essential to Spain's success this summer. A key component in the Spanish midfield, her conviction in the press, blended with her ability to ghost into space unnoticed, build up attacks, hold the ball under pressure, link up play, and convert opportunities made her a handful for every opponent.\nForward: Hinata Miyazawa, Japan\nAt 23 years old and relatively unknown, Japan's Hinata Miyazawa made a name for herself as she memorably terrorised Spain with her speed and efficiency. Unmatched at the tournament, she converted 38% of her shots into goals (scoring five and earning the golden boot), making her brutal attacking transitions something to be feared by any opponent.\nForward: Linda Caicedo, Colombia\nAt 18 years old, Linda Caicedo lit up the international stage with her electric energy. Caicedo demonstrated exceptional balance, technical skill, and quick feet.\nAn elusive dribbler, she was a ceaseless threat down Columbia's left side and in half spaces, illustrated by the beautiful goal which exposed cracks in the Germany team.\nForward: Salma Paralluelo, Spain\nTalk about making an impact, where would Spain be without Salma Paralluelo?\nYes, she is rapid and can get behind defences. But with every performance, the 19-year-old Barcelona forward displayed positional and technical versatility.\nParalluelo's mastery with both feet allowed her to link up play or unbalance defenders. Plus, her ruthless goalscoring ability made her lethal in front of goal this summer.",
  "word_count": 844,
  "scraped_at": "2026-02-14T13:04:27.344498"
}