{
  "article_id": "ac89bde174fa",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=348298",
  "title": "Orange supports the TotalEnergies CAF Africa Cup of Nations , Morocco 2025 in delivering a connected and inclusive tournament",
  "date": "20251220T064500Z",
  "domain": "webwire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Orange supports the TotalEnergies CAF Africa Cup of Nations, Morocco 2025 in delivering a connected and inclusive tournament\nFor the 17th consecutive year, Orange is proud to announce its sponsorship of the TotalEnergies CAF Africa Cup of Nations, Morocco 2025 that will take place in Morocco from 21 December 2025 to 18 January 2026.\nAs a major telecommunications player, the Group provides connectivity and innovative services to ensure an optimal experience for fans, players and media across the continent. For this edition held in Morocco, ten of the national teams are from countries where Orange operates, and six are sponsored by Orange.\nThis partnership reflects the shared commitment of Orange and the Confederation of African Football (CAF) to promote inclusive, innovative and accessible African football.\nMax it: the AI enriched super-app at the heart of the fan experience\nWith over 22 million active users across 15 countries, the Max it mobile app will be at the core of Oranges digital offering during the TotalEnergies CAF Africa Cup of Nations, Morocco 2025. This all-in-one super-app enhances the supporters experience through the Digital Fan Zone, allowing real-time updates on the competition. It will also enable users to watch matches live, access interviews and summaries, and even create their avatar to share their passion for football within their community.\nThis space is complemented by a conversational bot, MaxGoal, equipped with advanced artificial intelligence technology. MaxGoal can instantly respond to fans questions (schedule, results, standings, etc.) in French, English, or Arabic, and also understands some local languages like Wolof or Darija for an even more inclusive experience.\nA tournament under the sign of inclusion\nAdditionally, Orange will set up physical Fan Zones in several African countries to allow everyone to experience the competition in a friendly atmosphere. In Morocco, solidarity Fan Zones will be created within 25 local associations, including youth centers, for the benefit of children from urban and rural areas. These spaces will be equipped by Orange with screens, connectivity, and technical devices, ensuring equitable access and an immersive experience for all.\nIn the same spirit, Orange Digital Center Champions 2025, organized ahead of the football tournament, brought together over 1,300 young talents from 14 African and Middle Eastern countries around coding challenges. This initiative illustrates Oranges commitment to fostering dialogue between sport and innovation, celebrating African talent, creativity, and youth.\nYasser Shaker, CEO of Orange Middle East and Africa, comments: [i\"We are proud of our partnership with CAF, because football is more than just a sport its a shared passion that unites and empowers communities across Africa. This year, with Max it, we are bringing our digital vision to life by delivering a fully integrated experience. Our customers can now immerse themselves in the excitement of the AFCON fan zone and experience the TotalEnergies CAF Africa Cup of Nations, Morocco 2025 closer than ever to the action. This initiative reflects our deep commitment to supporting our customers love for football and creating unforgettable moments that inspire and bring together millions across the continent. Together, we celebrate the spirit of football a symbol of hope, unity, and shared dreams.[/i]\nWhether in Africa or Europe, Orange is committed to the sustainable development of football and the promotion of diversity. Sport, and football in particular, is a powerful vector of inclusion that connects millions of people, bridges cultures, and inspires African youth. Through innovation and solidarity, Orange continues to affirm its role as a key player in the development of sport on the continent.\nOrange has been the official and exclusive global telecom partner of CAF since 2008. In this role, Orange is currently supporting the continents major competitions, including:\n- CAF Womens Africa Cup of Nations Morocco 2024\n- CAF U-20 Africa Cup of Nations Egypt 2025\n- TotalEnergies CAF Africa Cup of Nations Morocco 2025\n- CAF School Championship 2025/26\nAbout Orange\nOrange is one of the worlds leading telecommunications operators with revenues of 40.3 billion euros in 2024 and 124,600 employees worldwide at 30 June 2025, including 68,700 employees in France. The Group has a total customer base of\n300 million customers worldwide at 30 June 2025, including 262 million mobile customers and 22 million fixed broadband customers. These figures account for the deconsolidation of certain activities in Spain following the creation of MASORANGE. The Group is present in 26 countries (including non-consolidated countries).\nOrange is also a leading provider of global IT and telecommunication services to multinational companies under the brand Orange Business. In February 2023, the Group presented its strategic plan \"Lead the Future\", built on a new business model and guided by responsibility and efficiency. \"Lead the Future\" capitalizes on network excellence to reinforce Oranges leadership in service quality.\nOrange is listed on Euronext Paris (symbol ORA).\nFor more information on the internet and on your mobile: www.orange.com, www.orange-business.com and the Orange News app or to follow us on X: @orangegrouppr.\nOrange and any other Orange product or service names included in this material are trademarks of Orange or Orange Brand Services Limited.\nAbout Orange Africa and Middle East (OMEA)\nOrange is present in 18 countries in Africa and the Middle East and has more than 173 million customers at 30 November 2025. With 7.7 billion euros of revenues in 2024, Orange MEA is the first growth area in the Orange group. Orange Money, its flagship mobile-based money transfer and financial services offer is available in 17 countries and has more than 100 million customers. Orange, multi-services operator, key partner of the digital transformation provides its expertise to support the development of new digital services in Africa and the Middle East.\n( Press Release Image: https://photos.webwire.com/prmedia/7/348298/348298-1.png )\nWebWireID348298\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 963,
  "scraped_at": "2026-02-14T12:37:30.088424"
}