{
  "article_id": "ac89f7f7ee3b",
  "url": "https://www.fcbarcelona.com/en/club/news/4107186/blaugranes-well-represented-among-ballon-dor-nominations",
  "title": "Blaugranes well represented among Ballon dOr nominations",
  "date": "20240905T003000Z",
  "domain": "fcbarcelona.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Blaugranes well represented among Ballon d'Or nominations\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link\nThe nominations for the 2024 Ballon d'Or were announced today and FC Barcelona players are included on the list for the individual awards presented by France Football. The blaugrana nominees for the Kopa Trophy and the Women’s Club of the Year were also announced.\nSix women and two men's blaugrana players up for the Ballon d'Or\nBest 2023/24 Champions League player Aitana Bonmatí, Patri Guijarro, 2023/24 Liga F top scorer and most assist provider Caroline Graham, Salma Paralluelo, Alexia Putellas and Ewa Pajor with a good season with VfL Wolfsburg, were the first blaugranes to be nominated for France Football's Ballon d'Or. It's also worth mentioning that former FC Barcelona players Mariona Caldentey and Lucy Bronze are also nominated for a chance to be named world's best player.\nFor two seasons in a row, FC Barcelona Women have six players nominated for the Ballon d'Or, with last year being first time in the history of the award for the women's team.\nThe men's nominations followed the women's. The recent signing for this 2024/25 season for the men's first team Dani Olmo, and Lamine Yamal, who has broken every possible youth record and could be the youngest to win this award in 2024, complete the FC Barcelona nominations for the Ballon d'Or.\nBarça the team with most Ballon d'Or wins\nAfter learning about these nominations for the 2024 Ballon d'Or, it's worth remembering the 15 Ballon d'Ors won by blaugranes so far. Names who are the past, present and future of FC Barcelona who place the Club first for wins of the golden award. Barça and Madrid are tied in the men's category with 12 Ballon d'Ors. However, the wins in the women's category sees Barça ahead by three. What's more, the Club has the most women's award wins in history.\nThe full list of the 15 blaugranes who have won the award while wearing the blaugrana jersey are Luis Suárez (1960), Johan Cruyff (1973 and 1974), Hristo Stoichkov (1994), Rivaldo (1999), Ronaldinho (2005), Leo Messi (2009, 2010, 2011, 2012, 2015 and 2019), Alexia Putellas (2021 and 2022) and Aitana Bonmatí (2023). Let's see whether this select list of FC Barcelona players is added to on 28 October 2024 during the event at the Théâtre du Châtelet in Paris.\nMore recognition for young talent\nIt's also worth highlighting that two young La Masia talents and established first team members in Pau Cubarsí and Lamine Yamal have been nominated for the Kopa Trophy. The award acknowledges the world's best player aged under 21 years old, which other blaugranes Gavi and Pedri have already won.\nA superb year crowned by further nominations\nBeyond the 8 Ballon d'Or nominations, the women's team will also be up for the Women’s Club of the Year award. The nominations for the FC Barcelona women's team are the cherry on the top of a historic year. Last season Jonatan Giráldez' side won the Super Cup, the Liga F, the Copa de la Reina and the Champions League. This unprecedented quadruple came playing some out-of-this-world football, and led to the former blaugrana coach also being nominated for the Women’s Team Coach of the Year award.\nAll these nominations for the Barça Women side are well earned and they are set to begin competitive competition in the Liga F on 8 September. Will they go undefeated as they did last season?\nWe will find out how all these nominees representing FC Barcelona fare at the Théâtre du Châtelet in Paris on 28 October.\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link",
  "word_count": 630,
  "scraped_at": "2026-02-14T12:48:41.367502"
}