{
  "article_id": "ac956c4917a2",
  "url": "https://www.heritage.org/asia/report/enhance-south-korean-military-capabilities-opcon-transfer",
  "title": "Enhance South Korean Military Capabilities Before OPCON Transfer",
  "date": "20230518T210000Z",
  "domain": "heritage.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The U.S.–South Korean military alliance is strong and fundamentally sound.REF Military officers and policymakers from both countries highlight the strength of their military forces and the unique integrated command structure that enables highly effective warfighting capabilities. Alliance managers underscore their common threat perceptions, goals, and comradery of an alliance forged in blood and which has defended the ramparts of freedom for 70 years.\nWhile there is faith in the military alliance, there are concerns that diplomatic differences could impact the alliance. The problem is with the politicians and policymakers, not the warfighters. There are perceptions that neither President Moon Jae-in nor President Donald Trump values the alliance to the degree of their predecessors. President Trump’s harsh criticism of America’s allies has triggered growing uncertainty of America’s commitment to the defense of South Korea.\nWashington and Seoul have diverging objectives toward North Korean denuclearization. There are concerns that the U.S. or South Korean President may be willing to offer concessions on the alliance force posture as a down payment to stimulate progress on denuclearization negotiations. The allies may be tempted to sign a flawed agreement with Pyongyang that leaves a residual nuclear force in place or prematurely declares an end to the Korean War without first reducing the North Korean conventional forces threat.\nThere are also strong differences between the U.S. and South Korea over wartime transfer of operational control, cancellation of military exercises, and burden-sharing responsibilities. Amidst these political vagaries, South Korea is implementing the next iteration of defense reform. Seoul is acquiring impressive new systems and capabilities, but experts are divided in their assessments of these capabilities.\nU.S. and South Korean policymakers need to carefully navigate the rocks and shoals of military threats, shifting political objectives, and growing public trepidation to maintain the alliance that has served for decades as a stalwart defender of freedom and democracy.\nAddressing the North Korean Nuclear and Missile Threat\nIn response to Pyongyang’s expanding nuclear strike force, South Korea created a “3K” tiered defense strategy comprised of Kill Chain (preemptive attack); the Korea Air and Missile Defense (KAMD) system; and the Korea Massive Punishment and Retaliation (KMPR) system.\nKill Chain. Kill Chain is a comprehensive surveillance and first-strike strategy to deter North Korean missile attacks. South Korea would use reconnaissance assets to detect preparations for a North Korean missile launch and preemptively neutralize the threat or respond to an attack in real time.\nThirty reconnaissance and weapons systems will be incorporated into the system, including reconnaissance satellites, reconnaissance drones, high performance multi-spectral sensors, SDB-II long-range surface-to-surface missiles, F-15K and F-35A combat aircraft, Taurus air-to-ground missiles, and Apache helicopters. The “whole process of detection, identification, hit and results verification should be done in under 25 minutes.”REF\nHowever, the strategy requires perfect intelligence to identify and track a North Korean mobile missile in the field, discern the type of warhead, and assess the North Korean leadership’s intentions with sufficient time to attack before the missile launch. The strategy also assumes that the South Korean President would authorize a preemptive attack that could potentially trigger an all-out war on the Korean Peninsula with a nuclear-armed enemy.\nCurrently, South Korea is heavily reliant on U.S. national technical means but has plans to deploy its own surveillance system, including purchasing four RQ-4 Global Hawk unmanned aerial vehicles (UAV), building KOMPSAT-6 imagery surveillance satellites, and developing an indigenous high-altitude unmanned surveillance aerial vehicle.\nKorea Air and Missile Defense System. KAMD consists of PAC-2/3 Patriot missiles, Green Pine early warning radars, and, eventually, indigenously developed medium- and long-range surface-to-air missiles. Seoul has discussed purchasing SM-3 and/or SM-6 ship-launched Ballistic Missile Defense (BMD) systems to augment the current SM-2, which only has capability against anti-ship missiles.\nSouth Korea has refused to integrate its missile defense system into the more comprehensive allied BMD system due to bilateral tensions with Japan arising from sensitive historic issues. The U.S. Terminal High Altitude Area Defense deployed to South Korea in 2017 provides missile defense but is separate from South Korea’s missile defense system.\nKorea Massive Punishment and Retaliation System. Under the KMPR strategy, Seoul would retaliate against a North Korean attack by using ballistic and cruise missiles, aircraft- and submarine-launched missiles, and special forces to target the regime’s leadership, headquarters, and forces.\nIn recent years, South Korea added military capabilities to improve its preemptive and retaliatory precision-strike capabilities. These include the Hyunmoo 2A ballistic missile (300 kilometer (km) range); the Hyunmoo 2B (500 km range and 1,000 kilogram payload); and the Hyunmoo 3B and 3C ground-launched cruise missile with ranges of 1,000 km and 1,500 km, respectively. South Korea is also developing the Hyunmoo IV (capable of destroying North Korea’s underground military facilities and command centers) and long-range precision air-to-ground missiles, such as Taurus, deployed on F-15K and F-35 aircraft with a range of 500 km.REF\nIn 2016, then-President Park Geun-hye expedited the deployment of the 3K system from its original schedule of the mid-2020s to early 2020.REF Seoul devoted an additional $85 million to the defense budget to augment core weapons systems for Kill Chain and KAMD and to acquire a Medium Altitude Unmanned Aerial Vehicle, as well as the Ballistic Missile Early Warning Radar-II.REF\nIn 2017, the Moon Jae-in Administration renamed the 3K strategy the “three-axis system,” renaming Kill Chain as “Strategic Target Strike” and the Korea Massive Punishment and Retaliation as “Overwhelming Response.”REF\nThe U.S.–South Korean Alliance\nSouth Korea does not bear its security burden alone. The U.S.–South Korean security alliance has been indispensable in achieving Washington’s strategic objectives, including maintaining peace and stability in northeast Asia. The U.S. security guarantee to Seoul has long deterred a North Korean attack while providing the shield behind which South Korea was able to develop its economic strength and institutionalize democratic rule.REF\nTo fulfill its treaty obligations and to defend U.S. national interests in Asia, the United States maintains forward-deployed military forces in the region to deter aggression and enable immediate reaction to any threat. Presidents George W. Bush and Barack Obama both committed to maintaining 28,500 troops on the Korean Peninsula. This presence is centered mainly on the U.S. 2nd Infantry Division and a significant number of combat aircraft.\nThe U.S.–South Korea military relationship is one of the most integrated complex command-and-control structures in the world. Following the 1950 invasion by North Korean forces, South Korean President Syngman Rhee handed operational control (OPCON) of his country’s military to the United Nations Command (UNC). Although the 1953 armistice ended the Korean War, the UNC retained OPCON until 1978, when it was transferred to the newly established Combined Forces Command (CFC).\nThe CFC returned peacetime OPCON of South Korean forces to Seoul in 1994. If war became imminent, South Korean forces would become subordinate to the CFC commander who, in turn, remains subordinate to both countries’ national command authority. The CFC commander is currently the senior U.S. general on the Korean Peninsula, who concurrently serves as commander of UNC, CFC, and U.S. Forces Korea (USFK).REF\nIn 2007, then-President Roh Moo-hyun requested that the United States return wartime OPCON of South Korean forces to Seoul. The two countries agreed to transfer wartime OPCON in 2012 (which was delayed until 2014) and then to an undefined future date once specific conditions had been achieved.\nAfter wartime OPCON transfer, the CFC commander would be a South Korean general with a U.S. general as deputy commander. The U.S. general would continue to serve as commander of UNC and USFK. The CFC commander, regardless of nationality, would always remain under the direction and guidance of U.S. and South Korean political and military national command authorities.\nSouth Korean Defense Reform: An Evolving Process\nIn the early 2000s, South Korea realized that demographic trends portended a future challenge to its existing military structure. Because of declining birth rates, South Korea would no longer be able to fully maintain its current military force. If present trends continue, by 2025, there will not be enough 18-year-old males available for mandatory conscription to fully staff the military.\nIn 2005, South Korea initiated what became a series of defense reform plans (DRPs) driven by demographic, military, and political factors.REF The Roh Moo-hyun AdministrationREF developed a comprehensive defense reform strategy to transform the military into a smaller but more capable force. Overall South Korean military manpower would be reduced approximately 25 percent from 650,000 to 500,000. The army would face the largest cuts, disbanding four corps and 23 divisions and cutting troops from 560,000 in 2004 to 370,000 in 2020. The plan also reduced the length of mandatory military service from 24 months to 18 months.\nAt the time, South Korea perceived a decreasing North Korean threat. President Roh portrayed a smaller South Korean military as a means to alleviate tensions and improve relations with North Korea. He also saw reducing the length of conscription as a way to curry political support from young voters. President Roh presumed that Pyongyang would follow suit by reducing its own military and moderating its aggressive behavior. Instead, the regime maintained its conventional military forces and augmented asymmetric force capabilities.\nSeoul planned to compensate for decreased troop levels by procuring advanced fighter and surveillance aircraft, naval platforms, and ground combat vehicles. However, Seoul failed to devote sufficient resources, and the plan did not include sufficient measures to meet South Korean requirements for assuming wartime operational control from the United States.\nUpon entering office in 2008, President Lee Myung-bak directed changes to Roh’s defense reform plan. The Lee Administration delayed the 2020 completion date to 2025 due to budget shortfalls, increased military service duty from Roh’s 18 months to 21 months, and adjusted the planned 2020 troop level to 517,000 (as opposed to the DRP 2020 goal of 500,000). President Lee also mandated a delay in OPCON transfer, characterizing President Roh’s decision as a naïve, ideologically driven political decision that ignored military realities. The Lee Administration prioritized enhancing warfighting capabilities to fix deficiencies in the South Korean military’s response to two North Korean attacks in 2010.\nLee’s DR 307 plan sought to improve interoperability and combat effectiveness of South Korea’s armed forces by restructuring the top military command structure and better integrating the service branches with each other. DR 307 also strove to lay a strong foundation for the planned transfer of wartime OPCON to South Korea in 2015. The plan attempted, for the first time, an organizational structure capable of assuming independent military command while the United States served in a supporting role.\nSouth Korea planned to enhance its own strategic surveillance capabilities and reduce its reliance on U.S. systems. Greater emphasis was placed on anti-submarine warfare, counter-artillery, and acquiring next-generation capabilities, such as the future fighter program and Global Hawk reconnaissance.REF\nThe Park Geun-hye Administration continued ongoing defense reform plans to reduce the overall size of the military and the number of ground force units and general officers and to streamline ground forces by combining and reducing units. However, it cancelled the Lee Administration’s plans to incorporate the three service headquarters into the operational chain of command under the Chairman of the Joint Chiefs of Staff and to integrate the headquarters and operational commands of individual services.\nPresident Park agreed to change the wartime OPCON transition from a fixed date to a “conditions-based” procedure, which necessitated improving South Korean command, control, communications, computers, intelligence, surveillance, and reconnaissance (C4ISR) and increasing munitions stockpiles. Park’s Administration directed the Kill Chain initiative and KMPR program to develop to counter the ever-increasing North Korean nuclear and missile threats.\nMany of the components of the numerous defense reform plans were frequently delayed or not implemented due to budgetary restrictions and resistance from the South Korean legislature and “built-in bureaucratic interests and inertia; the army’s dominance over the budget, manpower, and other resources; high dependence of the armed forces and the MND [South Korean Ministry of National Defense] on USFK; and an ossified military leadership.”REF\nMoon Jae-in’s DRP 2.0\nIn July 2017, the Moon Jae-in administration announced Defense Reform 2.0, a continuation and augmentation of earlier defense reform iterations. The Ministry of Defense characterized the plan as a response to the changing strategic environment and evolving technological requirements.\nThe main tenets of Defense Reform 2.0 are:\n- Increase defense spending from 2.6 percent to 2.9 percent of gross domestic product, which is a higher percentage than every European member of NATO.REF The total five-year cost for Defense Reform 2.0 will be $240 billion from 2019–2023 at an overall annual increase of 7.5 percent. The 2020 defense budget will increase by 8.2 percent to $42.1 billion, the largest annual increase since 2008.\n- Expedite completion of the three-axis strategy of Kill Chain, KAMD, and KMPR by allocating 14.5 percent more in the defense budget to enable deployment by 2020 instead of original plan of 2022.REF\n- Shrink the military from 625,000 to 500,000 by 2022. The army will be reduced from 490,000 to 365,000, with other services remaining at current levels.REF\n- Reorganize army structure to accommodate reduced force levels.\n- First ROK Army and Third ROK Army will be combined to form Ground Operations Command.\n- Reduce regional corps from seven to five.\n- Reduce army divisions from 39 to 33, with frontline divisions reduced from 11 to nine.REF Several divisions were not fully manned and, by reducing the number of units, more would be at full or near-full staffing to enable quicker deployment.\n- Reduce the number of general officers from 436 to 360 by 2022 (66 army, five navy, and five air force will be eliminated).\n- Reduce length of conscription service:\n- Army/Marines from current 21 months to 18 months.\n- Navy from current 23 months to 20 months.\n- Air force from current 24 months to 22 months.\n- Create a cyber threat response team, a combat drone system, and a new reconnaissance aviation group; augment Marine Corps special operations and create a Marine aviation brigade; and develop air force space operations.\nSouth Korea plans to augment its existing forces and develop new capabilities, including K-2 tanks, K-9 artillery, 230 millimeter multiple rocket launchers, Gwanggaeto III-class destroyers, Jangbogo III-class submarines, LST-III amphibious transport ships, F-35A fighter aircraft, high-altitude surveillance aerial vehicles, and a tactical information communication network.REF The navy will acquire KDDX destroyers, FFX frigates, KSS-III submarines, and LPX landing craft to maintain maritime superiority around the Korean Peninsula. South Korea will reinforce detection, tracking, and interception capabilities against airborne threats.REF\nBy 2022, South Korea will spend more on defense than Japan—and will be the fifth-highest or sixth-highest spender in the world on defense. The defense budget prioritizes completing the 3K defense system; regaining wartime OPCON by improving the communications, reconnaissance, and counter-artillery assets; reinforcing maneuver, command, and control capabilities; and conducting research and development of new defense technologies such as robotics and drones.REF\nThe South Korean army is developing a “5 Game Changer” strategy comprised of:\n- All weather, high precision, high yield missiles;\n- Strategic Maneuver Corps (mechanized division and airborne division) to expeditiously seize key enemy targets;\n- Special Missions Brigade to eliminate the North Korean leadership;\n- Drone-bot scout and assault battle group to conduct continuous surveillance against North Korean leadership and WMD targets; and\n- Warrior Platform to augment combat power of soldiers.REF\nNew War Plan. In 2017, the Ministry of Defense announced a new plan to occupy Pyongyang within two weeks without having to wait for U.S. troop reinforcements. Vice Minister of Defense Suh Choo-suk commented that Seoul would respond to a North Korean invasion with an “aggressive, deep-offensive operation.” The plan reportedly includes 1,000 potential North Korean targets for precision-guided munitions and surface-to-surface missiles while deploying airborne troops and Marines making amphibious landings to bring down the North Korean regime quickly.REF\nIt is unclear if the new plan would operate independently of the current allied OPLAN 5015 war plan, which envisages U.S. aircraft carriers, attack planes, and Marines responding quickly prior to massive U.S. troop reinforcements. OPLAN 5015 also includes a preemptive strike option against North Korean nuclear and missile sites and decapitation strikes against the North Korean leadership. However, subsequent reporting in 2018 indicated the Moon administration may have discarded the two-week scenario to seize the North Korean capital in case of a war.REF\nAssessing Defense Reform 2.0\nDetermining the effectiveness of President Moon’s DRP 2.0 is hampered by its recent inception, as well as distinguishing unique aspects from long-standing defense trends. While technical aspects can be analyzed objectively, an overall assessment tends to be more subjective. A series of interviews with current and former U.S. officials and military officers, as well as U.S. defense experts, reveal sometimes strikingly different conclusions.\nSome experts cautioned against a tendency to assess South Korea’s military against that of the United States, which has global defense requirements. Overall, there was a consensus that South Korea’s military is highly capable, has taken great strides in recent years to redress shortfalls, and is diligently working toward assuming greater responsibility for the country’s defense.\nAll experts highlighted concerns over continuing deficiencies in South Korea’s C4ISR and ability to conduct joint and combined operations, which OPCON has ramifications for Seoul’s ability to assume wartime operational control in the near term. These topics also reflected the greatest disagreements amongst experts over the pace and extent of South Korean achievements.\nSomething Old, Something New. Overall, DRP 2.0 is largely a continuation of previous plans under Presidents Roh Moo-hyun, Lee Myung-bak, and Park Geun-hye. However, the evolutionary (rather than revolutionary) nature is not necessarily bad since dramatic shifts in military strategy, procurement decisions, and force structure can be disruptive and counterproductive. The overall objectives of reducing the size of the military, substituting quality for quantity, and developing sufficient indigenous capabilities to attain wartime OPCON remain the same. Many initiatives are unchanged, but it remains to be seen if President Moon can implement unfulfilled pledges of previous administrations.\nBeneath the surface, however, there are more differences than initially apparent. President Moon has a significantly different perception of the North Korean threat than his progressive predecessor, Roh Moo-hyun. Whereas Roh presumed a reduced North Korean threat, Moon perceives that, despite peace initiatives, the danger from Pyongyang will remain. Moon’s defense plans reflect a continued hedging against the North Korean nuclear, missile, and conventional threat. In this sense, Moon seems more in line with conservative Presidents Lee and Park than Roh, for whom Moon worked as Chief of Staff.\nAnother discernible difference is initial discussion of “Plan B,” based on growing concern and willingness to identify Chinese threats to South Korea. South Korea has not previously focused on the Chinese threat because it has been so absorbed with North Korea. While increasing the defense budget, Moon plans to shift money to the air force and navy to plan against the long-term Chinese threat.\nOf less interest to U.S. policymakers—but emphasized by several South Korean interviewees—Moon is working to shift the military away from a dominant army-centric viewpoint and reduce the influence of the “Korea Military Academy clique.” Moon is striving to increase the percentage of civilians in leadership positions to increase transparency and accountability of the military. This is to stimulate new thinking but also reflects progressives’ wariness of the military, given its involvement in coups and authoritarian South Korean regimes.\nThe Good News. The U.S.–South Korean alliance remains strong and resilient. The highly integrated nature of Combined Forces Command will remain even after wartime OPCON transfer. Unity of command is critical during wartime but would have been lost under the original transfer plan in which CFC was to be disbanded, leaving two separate, parallel South Korean and U.S. commands.\nThe current plan switches the U.S. and South Korean command and deputy command responsibilities but retains CFC. Another positive development was the decision to shift from a timeline-based transfer to a conditions-based one, in which South Korea must demonstrate it has attained requisite capabilities.\nThe South Korean military is a sizeable force with advanced weapons and innovative military education and training. South Korean military spending has increased, and Seoul appears to be procuring the right mix of capabilities. However, some experts criticize a tendency to procure “shiny baubles” rather than devoting sufficient resources to less flashy command and control and logistics stocks, such as ammunition.\nAt times, Seoul overemphasizes developing indigenously produced military systems. While doing so strengthens domestic military manufacturers, it leads to deploying more expensive, less capable weapons. The South Korean FSX fighter plane has been described as “having the capability of an F-18 but at F-35 cost.” South Korea’s long-range surface-to-air missile system, light attack helicopter, and torpedoes are all examples of systems with more capable foreign versions available at cheaper cost.\nThe most recent MND White Paper included several areas of new emphasis that were absent from the previous edition. Notably, Seoul prioritizes cyber warfare, the space domain, and using advanced technologies of the fourth industrial revolution.\nU.S. and South Korean interoperability has improved, due in part to continued purchases of U.S. weapons systems. During the past three to four years, South Korea purchased $13 billion in arms from the United States. Purchases included the RQ-4 Global Hawk, F-35A joint strike fighter, F-16 upgrades, Patriot BMD upgrades, AEGIS systems, and AH-64E Apache helicopters. In 2018, South Korea signed $2.16 billion in foreign military sales commitments.REF\nC4ISR and Jointness Still Lagging. South Korea has devoted considerable resources and attention to improving its C4ISR systems and enhancing its ability to conduct joint and combined operations. The MND plans to significantly improve intelligence, surveillance, and reconnaissance capabilities by establishing a surveillance, reconnaissance, and early-warning system by acquiring military reconnaissance satellites, surveillance aircraft, and drones, and electronic warfare and signal intelligence collection systems, as well as combined allied and joint Korean command-and-control systems.REF\nSeoul also plans to develop\nthe Intelligent ICT Surveillance and Reconnaissance System [for] combining and analyzing the imagery intelligence obtained from various sensors like military satellites, reconnaissance aircraft, and UAVs. The long-term plan is to develop an AI-based intelligent command and control system…to analyze and share battlefield situations in real time.REF\nHowever, while substantial progress has been made, significant shortfalls remain. Interviews with U.S. officials and experts underscore that insufficient interconnectivity among service branches is a critical deficiency. The South Korean military still lacks the necessary C4ISR equipment and training to conduct joint operations. Instead, military services and units remain stove-piped, with each branch prioritizing its own interests above achieving jointness.\nAlliance experts underscore that C4ISR is not just capabilities but also experience and mindset. To conduct high-end complex warfighting, U.S. military personnel are brought up with equipment, training, and doctrine that stresses joint operations across military services.REF U.S. acquisition procedures during the past 20 years have ensured systems link across platforms and services, first using voice, then data links, to securely pass massive amounts of information.\nWhile South Korea C4ISR capabilities have improved, it has been at a slower pace than the United States would like—and the gap between the allies may actually be expanding. South Korean inter-service coordination takes place at the senior level and then is pushed down to lower echelons. At the operational and tactical level, C4I remains disjointed and separated by independent systems. In the words of one interviewee, “There is no connective tissue across services.”\nAs a result, South Korean forces are not seen as being organized for joint operations, particularly at the tactical level. Nor does Seoul have the necessary systems to push tasking to U.S. forces or U.N. sending states, which would be a critical requirement after assuming command of CFC. These shortfalls raise serious questions about the viability of South Korea receiving wartime OPCON as quickly as President Moon is pressing for.\nChallenges to the Alliance\nDivergence on a North Korea Policy. President Moon, like progressive predecessors Kim Dae-jung and Roh Moo-hyun, has a more benign perception of the North Korean threat than Washington does. Kim and Roh downplayed the steadily increasing North Korean missile threat to South Korea in order to garner domestic support for their attempts to foster reconciliation with Pyongyang.\nMoon resurrected the progressive “sunshine policy,” in which extensive benefits are promised to North Korea in the hope that doing so would eventually induce Pyongyang to moderate its hostile policies. He advocated policies aimed at conflict avoidance and enhancing inter-Korean relations, while delegating denuclearization to the United States. The Moon administration promised a lengthy and ever-growing list of economic benefits to North Korea—despite the absence of any progress on denuclearization. All of Seoul’s proposed offers of economic benefit to North Korea would violate U.N. sanctions, U.S. laws, or both.\nPresident Moon embraced North Korea’s advocacy for a peace declaration ending the Korean War as a step toward Pyongyang’s denuclearization. South Korean officials downplayed concerns over the ramifications of an end-of-war declaration by highlighting that the document would only be symbolic, without any real effect or consequences. But advocates have yet to identify any tangible benefits to signing a peace declaration, neither a specific quid pro quo that the regime will provide, nor the expected change in North Korean policy or behavior resulting from the regime feeling “less threatened.”\nA peace declaration could have serious negative consequences for alliance security. Even a limited declaration could create a domino-effect advocacy for prematurely signing a peace treaty, eliminating UNC, reducing U.S. troop levels on the peninsula, and abrogating the mutual defense treaty—before reducing the North Korean threat that necessitated American involvement.\nMoon’s prioritization of improving inter-Korean relations over denuclearization put him at odds with the long-standing U.S. emphasis on eliminating the North Korean nuclear threat. Such policies exacerbate growing strains between Washington and Seoul and complicate a coordinated allied strategy toward North Korea.\nReturning OPCON to South Korea. During the 2017 presidential campaign, Moon Jae-in promised to pursue an “early takeover” of wartime OPCON of South Korean forces from the U.S. and “take charge of our defense ourselves.”REF During the 50th South Korea–U.S. Security Consultative Meeting in October 2018, the Minister of Defense vowed to “complete expeditiously the preparations necessary to exercise OPCON in accordance with the Conditions-based OPCON Transition Plan, such as by acquiring critical military capabilities, in conjunction with the ongoing defense reform.”REF\nBoth sides affirmed they would retain the current Combined Forces Command structure but with a South Korean four-star general as commander and a U.S. four-star general as deputy commander. The OPCON transfer was to consist of phased completion of Pre-Initial Operational Capability, Initial Operational Capability in 2019, Full Operational Capability, and Full Mission Capable by 2022, which is within President Moon Jae-in’s presidency.\nWashington and Seoul agreed on three prerequisites for OPCON transfer. The South Korean armed forces must have acquired requisite military and command means to be able to lead the combined forces, and have sufficiently developed indigenous missile defense and preemptive attack capabilities against North Korean nuclear and missile threats. Last, the security environment must have improved due to complete or significant North Korean denuclearization.\nNone of these preconditions have been achieved. There is a difference between an improved security condition simply from reduction of tensions and the actual reduction of the North Korean threat. Despite no progress toward North Korean denuclearization, President Moon still insists on OPCON transition. The U.S. continues to adhere to the conditions-based transfer agreement, but President Moon appears to be pushing for a timeline-based transfer based on political factors.\nTo ensure certification and completion of the OPCON transition process, it is necessary to have large-scale military exercises with South Korea in the commanding role. However, during the past year, the allies have cancelled or downsized military exercises. The post-OPCON transfer system has not been fully tested.\nOPCON transfer is a matter of when, not if. But the overriding determinant must be a military assessment of the effectiveness of a South Korean-led CFC. If South Korea has not attained the requisite capabilities, the result could be less agile combat capabilities that could potentially lead to more casualties.\nCFC vs. UNC. While the most publicly observable change in OPCON transfer would be switching the commander and deputy commander positions between the U.S. and South Korea, there will be other substantial changes involved when Seoul takes over primary responsibility and the U.S. becomes the supporting rather than supported command.\nThis new command structure requires extensive study of the UNC’s future role. With the senior American general wearing all three hats of commanding UNC, CFC, and USFK, the division of responsibilities is seamless. However, when South Korea assumes the CFC command, the relationship and division of responsibilities between the UNC and the CFC will become more uncertain and confusing.\nA major unknown is how a South Korean CFC commander would interact with and delineate responsibilities with UNC, particularly non-U.S. sending forces. Would the South Korean CFC chief command the non-U.S. forces on the peninsula? Would the CFC commander control U.N. naval forces beyond 12 miles from Korea’s shores or would that be under the control of the UNC or Indo–Pacific Command commanders?\nSome experts have suggested that the U.N. commander could ask the sending states to put their forces under tactical control of CFC for specific missions and a constrained time period. Others, however, assess that as an unviable alternative. Also, sending states may be less willing to place their forces under South Korean command than U.S. command.\nThere are serious doubts that the South Korean military can establish communication and coordination with the militaries of other countries that would be participating under U.N. Command. The planned transfer of full wartime operational control of South Korean forces to Seoul was twice postponed over Seoul’s inability to adequately exercise command and control of its forces and to coordinate wartime actions with U.S. and international forces.\nThe South Korean military still lacks the necessary C4ISR systems and capabilities to overcome stove-piped command structures and to enable interoperability across services. U.S. officials privately comment that at present the South Korean military is not capable of truly joint operations.\nSome identified deficiencies that should be redressed prior to OPCON transfer are:\n- Do South Korean and U.S. military forces have secure communications between their units? This should be down to battalion level for ground forces and individual ships and planes for navy and air force units.\n- Do South Korean forces have sufficient communications across their military services? U.S. officials commented that South Korean services were stove-piped and had to use U.S. communications as an intermediary amongst their own services.\n- Does the South Korean military have sufficient forces and logistics stocks for the first 60 days of conflict? For example, petroleum, oil, and lubicrants; munitions; chemical, biological, and radiation protective equipment; and disaster recovery supplies.\nCancelling Military Exercises. Since President Trump unilaterally announced the allies would stop “provocative wargames”—a North Korean term previously rejected by Washington—the U.S. and South Korea have cancelled 12 military exercises and imposed constraints on others. The U.S. has received no diplomatic reciprocal actions by North Korea—nor did the regime suspend any of its conventional military exercises, including its large-scale annual Winter and Summer Training Cycles. It was a fallacy to conclude that the unilateral concession of canceling military exercises would cause North Korea to change. Pyongyang continues to criticize even the scaled-down allied exercises and demands a suspension of “all war trainings.”REF\nCancelling exercises has serious consequences. It directly affects interoperability and ability to conduct combined operations. In the short term, it may be possible to minimize the danger with computer-based exercises and low-level exercises, but over time interoperability is degraded, as is overall allied deterrence and defense capabilities. Missing one exercise may not be critical, but each missing iteration has cumulative negative effects.\nMoving towards OPCON initial operating capability requires having more—rather than fewer—exercises, as does South Korea reducing its length of conscription service. Militaries need to train in the manner in which they would fight. It is necessary to bring together all of the elements in joint and combined exercises. Whether a football team, orchestra, or military, one cannot have sub-units train separately and presume everything will work perfectly when they are only integrated at the last moment.\nSpecial Measures Agreement Negotiations. The United States has long urged its allies to assume more responsibility for their own defense and to confront common security threats by increasing their defense expenditures and accepting new missions. Few allies have done so. However, South Korea spends 2.6 percent of its GDP on defense, more than all European allies.\nSeoul provides substantial resources to defray the costs of U.S. Forces Korea. It pays approximately half of all non-personnel costs for U.S. forces stationed in South Korea, as well as over 90 percent of the cost of relocation of U.S. forces to a new base at Camp Humphreys, south of Seoul.\nThe 2019 bilateral Special Measures Agreement negotiations were particularly contentious. President Trump demanded “cost plus 50 percent” as the basis for a significant increase in South Korea’s contributions. Washington eventually agreed to an 8 percent increase (to $880 million annually) in return for renegotiating the agreement every year rather than every five years. However, the U.S. is now reportedly demanding Seoul accept an exponential increase of $5 billion annually.REF Such an exorbitant demand is excessive and risks triggering a wave of anti-Americanism in South Korea.\nRecommendations\nYears ago, recommendations by U.S. officials focused on various weapons and C4ISR systems that South Korea should procure. In the intervening years, Seoul has largely fulfilled those recommendations. South Korea is developing or purchasing enhanced long-range, precision-strike capabilities; attack helicopters; precision-guided munitions; extended-range surface-to-surface missiles; and counter-battery radar and artillery systems.\nDespite these efforts, significant deficiencies remain in South Korea’s C4ISR and ability to conduct joint/combined operations. These shortcomings call into question Seoul’s ability to expeditiously assume wartime OPCON.\nWhat South Korea Should Do\n- Fully implement Defense Reform 2.0. President Moon’s defense reform initiative is an ambitious program to upgrade South Korea’s military. However, defense budget shortfalls undermined similar efforts in the past. If Moon’s effort is to fare better than its predecessors, Seoul must ensure legislative approval of necessary laws and sufficient budgetary resources.\n- Improve indigenous C4ISR capabilities. South Korea needs to enhance its anti-submarine warfare, multi-domain awareness; increase ammunition stocks particularly of precision-guided munitions; and continue development and deployment of ballistic missile defense systems. The most critical area for improvement is C4ISR at the strategic, operational, and tactical level. Failure to address existing deficiencies could constrain effective OPCON transition and hinder allied operations during wartime and increase the potential for fratricide.\n- Enhance the ability to conduct joint and combined operations. It may be unfair to directly measure South Korean capabilities against those of the United States since Washington has global defense requirements that Seoul does not. However, most U.S. experts interviewed were critical of South Korea’s ability to conduct joint and combined-arms operations in modern, multi-domain wartime conditions. Remedying the situation requires not only upgrading systems but also a change in mindset, doctrine, and training.\nWhat the U.S. Should Do\n- Maintain close consultation on South Korean defense reform. America’s national interests are inexorably enmeshed with those of South Korea. While defense reform is an internal South Korean issue, any initiatives can directly impact CFC’s deterrence and defense against the common North Korean threat. It is therefore imperative for U.S. warfighters and policymakers to remain fully engaged in the evolution and implementation of DR 2.0.\n- Affirm unequivocal commitment to defending South Korea. The Trump Administration’s strong criticism of America’s allies, emphasis on the cost of deploying U.S. forces overseas, and downplaying of theater-level threats has increased South Korean trepidation that the U.S. will not fulfill its defense treaty obligations. The U.S. should make absolutely clear to friend and foe alike that it will defend its allies.\n- Maintain a robust forward-deployed military presence in South Korea. U.S. forces are necessary to defend a critical ally. The Trump Administration should emphasize its commitment to maintaining U.S. forces at the promised 28,500 troop level—including after OPCON transfer—until the North Korean nuclear, missile, and conventional force threats have been reduced.\n- Seek a reasonable incremental increase in South Korean reimbursement for U.S. troop presence. U.S. troop presence overseas serves the country’s strategic interests, including maintaining peace and stability in northeast Asia. Seeking to profit off U.S. forces overseas is inconsistent with American values and commitments.\nWhat Both Countries Should Do\n- Maintain conditions-based OPCON transfer. Returning wartime OPCON to South Korea is a question of when, not if. But prematurely transitioning to a South Korean command of CFC before Seoul has ameliorated deficiencies in C4ISR and joint/combined operations could have detrimental consequences in wartime. President Moon’s push for transition during his term, prior to a decrease in North Korea’s nuclear forces, runs counter to the bilateral agreement for a conditions-based, rather than timeline-based, transfer. Both countries should identify the end-state of necessary military capabilities and hold the line against politically driven decisions.\n- Delineate the respective roles, missions, and authorities of CFC and UNC after OPCON transfer. The relationship amongst UNC, CFC, and USFK is seamless when the same general commands all three entities. OPCON transfer could lead to uncertainty over the chain of command, particularly of the U.N. sending state forces during wartime. The ongoing OPCON transition should ensure that any potential ambiguities are eliminated.\n- End unilateral allied disarmament by resuming military exercises. President Trump’s unilateral decision to cancel U.S.–South Korean military exercises was a major unilateral concession—for which the United States received nothing in return. Pyongyang neither codified its missile and nuclear test moratorium nor announced reciprocal constraints on its own military exercises. The U.S. decision risks degrading allied deterrence and defense capabilities. The exercises are necessary to ensure the interoperability and integration of allied military operations and ensure readiness to respond to North Korean attacks. Washington and Seoul should announce that, if by year’s end there is no progress in denuclearization negotiations, there will be a return to the previous level of exercises.\n- Define the future of the alliance. While North Korea must remain the predominant threat focus of the alliance, the allies should also focus on security challenges over the horizon. As South Korea continues to improve its military capabilities, Seoul should be called upon to assume greater responsibilities in regional and global security challenges. South Korea could play a larger role in ensuring freedom of navigation in the South China Sea. The country’s economic vitality is dependent on safe passage of foreign energy supplies, which are threatened by China’s expansionary actions. Seoul has been reluctant to engage in naval operations in the South China Sea for fear of antagonizing China.\nConclusion\nThe U.S.–South Korean alliance has maintained peace on the Korean Peninsula for over six decades. Service members from both countries have stood tirelessly on the ramparts of freedom, providing the shield behind which South Korea recovered from the devastation of war to become a beacon of democracy and economic vitality.\nMaintaining strong alliances and robust forward-deployed U.S. forces is a critical and cost-effective component to mitigating risk in northeast Asia. The U.S. military presence in South Korea is an indispensable signal of Washington’s commitment to defending its ally and deterring a North Korean attack. Alliances are not transactional relationships, but are instead based on shared values and strategic objectives. The value of alliances is not measured in dollars and cents.\nThe motto of CFC is katchi kapshida (“we go together”), but both nations need to ensure they are going in the same direction and at the same pace. The men and women in uniform deserve nothing less.\nBruce Klinger is Senior Research Fellow for Northeast Asia in the Asian Studies Center, of the Kathryn and Shelby Cullom Davis Institute for National Security and Foreign Policy, at The Heritage Foundation.",
  "word_count": 6606,
  "scraped_at": "2026-02-14T13:09:13.520127"
}