{
  "article_id": "ac9abe825af5",
  "url": "https://www.90min.com/posts/rosella-ayane-england-morocco-making-history-world-stage",
  "title": "Rosella Ayane : From England to Morocco & making history on the world stage",
  "date": "20230925T131500Z",
  "domain": "90min.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rosella Ayane: From England to Morocco & making history on the world stage\n- Rosella Ayane switched international allegiance to Morocco in 2021\n- Morocco became the first Arab nation to reach a Women's World Cup\n- Tottenham's Ayane has lit a new fire in her to do more for the country\nBy Emily Keogh\nWhen Rosella Ayane made the decision in 2021 to switch international allegiance to Morocco after representing England at junior level, she could have hardly expected to have made such history with the team within a couple of years.\nThe joyous celebrations peppered social media when Morocco found out they had advanced past the group stage in their first Women’s World Cup appearance; scenes of tears, praying and sheer elation proved exactly how much the momentous occasion meant to the 23 players.\nAnd in the middle of the celebrations was Tottenham Hotspur forward Ayane.\n\"It's lit another fire in my belly to continue doing things with Morocco,\" Ayane said, reflecting passionately on her World Cup summer in Australia.\n\"It's been a whirlwind couple of months...the World Cup. I only really realised what we'd done after the occasion had finished. And it's just an incredible achievement.\"\nBecoming the first Arab nation to play on the world's biggest stage, Morocco made history just by being at the World Cup. But in exceeding expectations and making it through the group stage into the knockouts, their star continued to soar.\nWhilst the tournament started badly, suffering a galling 6-0 defeat to Germany in their opening game, the tides turned for Morocco to beat South Korea and Colombia to leave them joint at the top of Group H. With their progression to the knockouts, it also helped prematurely eliminate Germany.\nThis sense of pride that representing the African country brings Ayane has only made her more determined to push more boundaries.\n\"I didn't really think I had another fire to light,\" the Spurs forward said. \"It's made me want to achieve even more with the women's national team and keep taking that extra step further.\n\"I think the World Cups just built a foundation for Moroccan women's football. And on a personal level, I think the experience and my role in the Moroccan team just only helps me when I come back to Spurs.\"\nYet returning to the WSL does not mean Ayane periodically drops the beacon of representing her country. In turn, it propels her visibility, using that as a driving force to not only represent Morocco, but Africa in one of the highest ranked domestic leagues in the world.\nSpeaking on the pressures of this, Ayane said: \"I do it with immense pride.\"\nFollowing Nigerian defender Ashleigh Plumptre's departure from the WSL and Reading's relegation that saw Cameroonian Easther Mayi Kith drop down to tier two, Ayane is the only African representative in England's top flight of women's football.\n\"When you think of the WSL, I'm not only representing Morocco, I'm representing Africa, and that's really important for me,\" she explained. \"When I'm playing for Morocco, there's always going to be a little bit of pressure on my shoulders. I'm taking it that people expect me to do things, which is understandable, and I think it's a really good thing.”\nOf Moroccan and Scottish descent, Ayane grew up in Reading, climbing the age groups with Chelsea before playing abroad in Cyprus and eventually signing for current club Spurs in 2019.\nAt international level, she represented England at both Under-17 and Under-19 levels before deciding to switch. Before the World Cup, Ayane had opened up about it, detailing she did it for her dad.\nAyane was 13 years old when her Moroccan father passed away. The decision to make the change allegiance from England at 25 did not come out of nowhere, but wearing the shirt made her feel connected to her father. She detailed that it was never about choosing an easier route to play international football but instead choosing to represent her father.\nAyane, seeing the World Cup success as an opportunity to grow the profile of Moroccan players, hopes their tournament can pave the way for other Atlas Lionesses to progress in more competitive leagues, with many currently playing in Morocco's developing domestic contest.\nReaching new highs last year, Morocco were runners-up at the Africa Cup of Nations. It was the Tottenham forward that made history for the side as her penalty sealed their place in their maiden AFCON final. Just reaching the last four had landed them a place in the World Cup.\n\"It's kind of hard to describe, but once you do what we did at the World Cup, and you see how many people you've inspired, and the historic things that we keep achieving...like off the back of AFCON, I thought it was really impressive what we achieved, historically, but we've just broke it all again, at the World Cup and inevitably, that's going to light a fire in anyone,\" Ayane reflected.\nWhilst representing Morocco helps the player honour her father, the opportunity to pave the way for the next generation of Atlas Lionesses made the historic summer just as important.\n\"For me being a role model, especially in Morocco, is one of the best things. So, I wear that, and I take that with immense pride. And if I can inspire even 10 girls in Morocco to play football, then that's a win for me,\" she concluded.",
  "word_count": 904,
  "scraped_at": "2026-02-14T12:56:06.317569"
}