{
  "article_id": "acb22fc70780",
  "url": "https://www.illawarramercury.com.au/story/8472329/figtree-junior-mackenzie-hawkesby-to-return-to-sydney-fc/?cs=300",
  "title": "Figtree junior Mackenzie Hawkesby to return to Sydney FC",
  "date": "20231229T020000Z",
  "domain": "illawarramercury.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "After a stint in the English Women's Super League for Brighton & Hove Albion, Figtree's Mackenzie Hawkesby will return to Australia with Sydney FC.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Figtree junior will be thrust straight into the squad for the club's match against Wellington on Friday, December 29.\nThe midfielder has been crucial to the on-going success of the sky blues over the past few seasons. The 23-year-old was named Sydney FC player of the year in 2022 and has won three premierships with the club.\nHawkesby was instrumental in the grand final win for Sydney FC against Western United last A-League Women's season and now she will return in her favoured number 15 shirt to try and lift the team up from their currently mid-table position.\n\"I'm delighted and excited to be returning to Sydney FC and I am looking forward to getting some match minutes under my belt,\" she said.\n\"I can't wait to get started and to help the girls defend both titles.\n\"There is a long way to go this season, we aren't even a third of the way through, and I am thrilled that I have a chance to make a big contribution to our final season position.\"\nHead coach Ante Juric said signing Hawkesby would be a welcome boost to the team.\n\"Mackenzie has been one of the standout performers in the Liberty A-League over the past three or four seasons, and we are very pleased to have her back on board.\n\"She has so much quality and it's a huge boost for our squad to have her ready to go for the rest of the season.\"",
  "word_count": 279,
  "scraped_at": "2026-02-14T12:30:50.873640"
}