{
  "article_id": "acd265f9959c",
  "url": "https://www.globenewswire.com/news-release/2025/05/23/3087269/0/en/Pub-Delivery-Heineken-brings-fans-matchday-ritual-and-their-lucky-pub-with-them-to-Lisbon-for-the-UEFA-Women-s-Champions-League-final.html",
  "title": "  Pub Delivery : Heineken® brings fan matchday ritual – ",
  "date": "20250523T074500Z",
  "domain": "globenewswire.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A Media Snippet accompanying this announcement is available in this link.\nAMSTERDAM, May 23, 2025 (GLOBE NEWSWIRE) -- Half of football fans have matchday rituals – and nearly as many (46%)* believe their superstitions can influence the score. For two Arsenal fans, that ritual meant watching every game from the same corner of The Twelve Pins bar in North London - same seats, same beers, same pre-match routine. So, when their team reached the UEFA Women’s Champions League final, Heineken did what needed to be done: packed up their lucky pub setup and shipped it to Lisbon. Rebuilt inside a truck, it gave the two women the ultimate matchday experience - ready for the game at the Estádio José Alvalade, ritual and all.\nFor years, London-based Amelie Margaret Kirk and Sophie Hurst have made The Twelve Pins their matchday home - pints in hand, seats unchanged. As part of its ongoing celebration of football’s most devoted hardcore fans and the women’s game, Heineken transformed their personal tradition into a portable pre-match pub experience.\nPainstakingly recreated and transported over 2,200 kilometres from North London to the heart of Lisbon, every detail of their ritual was brought to life - beermats, bar stools, pint glasses and all - so they could follow the same routine they believe helps set their team up for success. For these two superstitious fans, it’s not just a pub - it’s a travelling talisman.\nOf course, it wouldn’t be a real pub without Heineken on tap. Football legend and former Lioness, Jill Scott MBE, will be hitching a ride to raise a glass with two of football’s most superstitious fans.\nJill Scott MBE, former England midfielder, says: “I’ve seen plenty of matchday rituals over the years – some hilarious, some heartfelt, but all completely serious to the person who believes in them. I love that Heineken is matching the energy of superstitious fans at the UEFA Women’s Champions League final. It makes me happy to see hardcore fans of the women’s game being acknowledged and celebrated in this way.”\nNabil Nasser, Global Head of Heineken® Brand, says: \"Who are we to stand between superstitious fans and their matchday rituals? From recreating a lucky pub at the UEFA Women’s Champions League final to shining a light on the fans who make the game what it is, ‘Cheers to the Superstitious Fans’ is all about celebrating fandom in all its forms. Since joining the women’s game in 2021, we’ve seen it grow in incredible ways—and we’re proud to continue championing that momentum.”\nHeineken has supported the UEFA Women’s Champions League since 2021 and continues to spotlight the stories of real hardcore fans whose love for the game makes football more than just a sport.\nTo learn more about the campaign and celebrate fan superstitions, visit: HERE\nNotes to editors:\nEditorial information:\nFans can follow the campaign by searching using the hashtag #SuperstitiousFans\nPlease find the campaign video: HERE\nPlease find the high-resolution campaign image: HERE\nFor more information, please contact: HNKNFootball@edelman.com\nResearch:\nThe research was conducted by Censuswide, among a sample of 12,011 Football fans in the UK, USA, Germany, Brazil, Portugal, and South Korea. The data was collected between 01.04.2025 - 07.04.2025. Censuswide abides by and employs members of the Market Research Society and follows the MRS code of conduct and ESOMAR principles. Censuswide is also a member of the British Polling Council.\nAbout HEINEKEN:\nHEINEKEN is the world's most international brewer. It is the leading developer and marketer of premium beer and cider brands. Led by the Heineken® brand, the Group has a portfolio of more than 300 international, regional, local and specialty beers and ciders. We are committed to innovation, long-term brand investment, disciplined sales execution and focused cost management. Through \"Brewing a Better World\", sustainability is embedded in the business.\nHEINEKEN has a well-balanced geographic footprint with leadership positions in both developed and developing markets. We employ over 85,000 employees and operate breweries, malteries, cider plants and other production facilities in more than 70 countries. Heineken N.V. and Heineken Holding N.V. shares trade on the Euronext in Amsterdam. Prices for the ordinary shares may be accessed on Bloomberg under the symbols HEIA NA and HEIO NA and on Reuters under HEIN.AS and HEIO.AS. HEINEKEN has two sponsored level 1 American Depositary Receipt (ADR) programmes: Heineken N.V. (OTCQX: HEINY) and Heineken Holding N.V. (OTCQX: HKHHY).\nMost recent information is available on HEINEKEN's website: www.theHEINEKENcompany.com and follow us on Twitter via @HEINEKENCorp.\nA photo accompanying this announcement is available at: https://www.globenewswire.com/NewsRoom/AttachmentNg/062e05c1-2255-4726-a87a-ff85226f7df3",
  "word_count": 754,
  "scraped_at": "2026-02-14T12:50:27.191882"
}