{
  "article_id": "acd3ca829565",
  "url": "https://dailyexpress.com.my/news/257155/chelsea-eye-great-escape-against-barca/",
  "title": "Chelsea eye great escape against Barca",
  "date": "20250427T024500Z",
  "domain": "dailyexpress.com.my",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "LONDON: Quadruple-chasing Chelsea have a mountain to climb as they seek to overturn a 4-1 deficit against Barcelona on Sunday to reach the Women’s Champions League final.\nSonia Bompastor’s side conceded two late goals in the first leg of the tie in Spain last week—a hammer blow to their hopes.\nEwa Pajor put Barcelona in front at the Estadi Johan Cruyff and Claudia Pina doubled the hosts’ advantage with 20 minutes left.\nSandy Baltimore pulled a goal back for the visitors but Irene Paredes struck in the 82nd minute and Pina scored again to put Barcelona in command of the tie.\nThe two clubs are meeting at the semi-final stage of the competition for the third straight year.\nBarcelona have come out on top both times, going on to lift the trophy on both occasions.\nLast week’s painful defeat was just the second under Bompastor, who took over from Emma Hayes at the end of last season.\nChelsea bounced back strongly in midweek, beating Crystal Palace 4-0 to move within touching distance of a sixth successive Women’s Super League (WSL) title.\nThey are six points clear of nearest challengers Arsenal with just three games left to play.\n“Today, my plan was to be able to give the squad, first of all, the opportunity for some players to perform and show, but also to manage some players so they will have fresh legs going into the game on Sunday,” Bompastor said after the Palace win.\n“I think in those two aspects, everything was really positive too and there were no injuries.”\nChelsea have been the dominant force in English women’s football in recent years and show no signs of easing up.\nThe League Cup winners appear certain to wrap up the WSL title and face Manchester United in the Women’s FA Cup final next month.\nBut they have never won the Women’s Champions League—they finished as runners-up to Barcelona in 2021 and have lost four times at the semi-final stage.\nThe omens are not good for Chelsea, who have won only two of their previous 11 semi-final matches, while Barcelona have never lost a Women’s Champions League tie after winning the first leg.\nOn the plus side, they have already shown their powers of recovery this season—overturning a 2-0 first-leg deficit against Manchester City in the quarter-finals to win 3-2 on aggregate.\nEngland midfielder Keira Walsh, who previously played for Barcelona, is certainly not giving up hope that Chelsea can pull off a comeback for the ages.\n“We were probably a little bit too open in the second half and credit to Barcelona, they punished us,” she said.\n“But the tie isn’t over. They’ve still got to come to Stamford Bridge and we’re going to give it our all to turn things around.\n“It’s going to be tough to turn around a three-goal deficit, but we’ve done it before. We showed that against Manchester City, so we know we are capable of achieving this.”\nThe winners will meet Arsenal or Lyon in the final in Lisbon on May 24.",
  "word_count": 508,
  "scraped_at": "2026-02-14T12:23:23.043424"
}