{
  "article_id": "ad1c8dc5e9cc",
  "url": "https://www.thestranger.com/slog-am/2023/08/21/79131426/slog-am-seattle-smoke-will-clear-soon-tokitae-kicks-the-bucket-spain-wins-womens-world-cup",
  "title": "Slog AM : Seattle Smoke Will Clear Soon , Tokitae Kicks the Bucket , Spain Wins Women World Cup",
  "date": "20230821T161500Z",
  "domain": "thestranger.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "We have some of the worst air quality in the world: Did you enjoy your smoky hell weekend? No? Me either! The Air Quality Index in Seattle reached around 190 at one point Sunday evening. Being outside felt like being a chimney sweep trapped inside a chimney in Victorian England. Changing winds started moving into the region Monday morning. Hopefully, the smoke will leave pretty soon. Wish for a strong onshore flow. Wish for rain.\nTell us when the smoke leaves, weather people of Twitter: According to the Seattle Weather Blog's crystal ball, the smoke might linger most of Monday before it starts clearing out. However, the AQI was already down to 100 as of Monday morning. That's still bad, don't get me wrong, but it's better than 190! It's all about perspective.\nBest guess is that the Seattle area endures one more day of smoky conditions before influx of ocean air clears us out late Mon/early Tue.\n— Seattle Weather Blog (@KSeattleWeather) August 21, 2023\nTokitae goes belly up in Miami: Tokitae, also known as Lolita, was the last remaining southern resident killer whale in captivity. She was supposed to make her journey home to the Pacific Northwest after 50 years, but she died Friday from a renal condition. Ted Griffin, the man who first started capturing killer whales to have them perform in captivity, bagged Tokitae and greatly depleted the southern resident orca population. He said he had \"no regrets.\"\nMass shooting in Mount Baker: A shooting in a hookah lounger along Rainier Avenue South in Mount Baker at 4:30 am Sunday killed three people and injured another six. Police recovered five guns from the scene. So far, in 2023, the Seattle Police Department has seized 869 guns, the highest amount in 13 years, KING 5 reports.\nSouth King County has brain worms: Elected officials in Des Moines and Federal Way are working to shut down existing homeless shelters or deny permits to fully funded shelter projects because, as the Seattle Times reports, they \"think shelter and housing exacerbate the effects of the homelessness crisis in their neighborhoods.\" What???? I'm going to hazard a guess that giving people no shelter or housing will actually increase the visible signs of homelessness in your neighborhood and will not help find a solution to end homelessness at all! The state is investigating whether these practices are illegal since they may violate a 2021 law that requires cities have a certain number of shelter beds before regulating shelters or housing projects.\nEarthquake, hurricane tropical storm strikes California: A 5.1 magnitude earthquake struck Ojai, California on Sunday right as the tropical storm Hilary struck. Hilary's path took her through the Inland Empire and then into the heart of Los Angeles, where she hovered above Dodger Stadium and Compton for a while. Then, she went back on her path up the border of LA and San Bernardino. The deserts are flooding, San Diego had the most rain in a single day since 1873, flash flood warnings abound. More storm updates here.\nSoggy Dodgers:\nDodger Stadium is an island. pic.twitter.com/g2mQrKzgS3\n— Don Van Natta Jr. (@DVNJr) August 21, 2023\nHere comes the mud:\nA wall of mud surged through California’s Sheep Canyon, carrying wood and debris along with it, as Hilary, then a tropical storm, dropped heavy rain across the region. https://t.co/Hlf8MSlN9S pic.twitter.com/mdtj3yWBEp\n— CBS News (@CBSNews) August 21, 2023\nIs your package late? I'll tell you why. A historic drought hitting the Panama Canal means lower water levels and lower capacity for heavy ships. To conserve water, the Panama Canal Authority \"reduced maximum ship weights and daily ship crossings.\" The line to get through the canal earlier this month was \"backed up 160 vessels and delayed some ships by as much as 21 days.\" So crazy when climate change interrupts the profits of capitalism, the very thing standing in the way of stopping the impacts of climate change.\nRussia crashed into the moon this weekend: Russia bungled its first lunar landing attempt since 1976 when it lost contact with its unmanned Luna-25 craft and it crashed into the moon.\nIn case you forgot, here's yesterday's hell sun: This apocalypse sun knows that things can only get worse from here if we don't figure our shit out:\nJust an orb on the horizon for sunset tonight. And that's not dust on the camera lens. The thick smoke is making sun spots readily visible without a filter. #wawx pic.twitter.com/Dk86n2j34y\n— NWS Seattle (@NWSSeattle) August 21, 2023\nDon't read this if you're a nervous flyer: The US hasn't had a major plane crash in over a decade, but close calls are happening way more often than we think, and the problem seems to be getting worse. Just last month, the New York Times found \"at least 46 close calls involving commercial airlines.\" These close calls seem to all be potential collisions with other planes taking off or landing from airport runways. They're the result of human error likely caused by understaffed and over-stretched air traffic controllers. \"The close calls have involved all major U.S. airlines and have happened nationwide.\" Air traffic controllers interviewed by the Times said \"they feared it was only a matter of time until a deadly crash occurred.\"\nIn Maui news: There are 114 confirmed dead from the Lahaina fires, with only 27 people identified so far. However, 850 people are still missing.\nFrugals in Tacoma linked to listeria deaths: Three people in Tacoma have died and three others have been hospitalized after drinking milkshakes from a contaminated ice cream machine at Frugals restaurant in Tacoma.\nBig news for organ lovers: Surgeons transplanted a pig's kidney into a brain-dead man to see if the pig kidney would function. For a month, the pig kidney has worked like a normal human kidney and produced urine. Scientists will continue to monitor the kidney for a second month, but this is a huge scientific step for potentially easing shortages of transplantable organs with animal organs.\nSpain wins Women's World Cup: Spain's La Roja vanquished England's Lionesses 1-0 to take home the Women's World Cup trophy, the country's first Women's World Cup win. Olga Carmona, 23, was one of the breakout stars for Spain. She scored the game-winning goal in the final. Carmona's father died from a battle with cancer two days before the match, but her family didn't tell her until after she played. \"I know you have been watching me tonight and that you are proud of me. Rest in peace dad,\" Carmona wrote on social media.\n23-year-old Olga Carmona loves scoring a game-winner 👏\n— FOX Soccer (@FOXSoccer) August 20, 2023\nSpain's captain nets our Goal of the Day to secure La Roja's first-ever FIFA Women's World Cup title 🇪🇸🏆 pic.twitter.com/Lb5AoZt2t2\nIn other sports news: The Mariners are on a six-game winning streak and just finished a full sweep of the Houston Astros. Julio Rodriguez is so hot right now he's had 17 hits in four games—that's more than the entire New York Yankees team. Rodriguez broke a Major League Baseball record set in 1925.",
  "word_count": 1180,
  "scraped_at": "2026-02-14T12:16:18.859065"
}