{
  "article_id": "ad27d18c6499",
  "url": "https://www.newcastleherald.com.au/story/8926455/matildas-coach-says-emily-van-egmond-has-matured-into-leadership/?cs=7580",
  "title": "Matildas coach says Emily van Egmond has  matured  into leadership | Newcastle Herald",
  "date": "20250326T213000Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "MATILDAS coach Tom Sermanni remembers Emily van Egmond as an \"up-and-coming 15-year-old\" from a previous stint with the national women's soccer squad.\nSubscribe now for unlimited access.\nor signup to continue reading\nNowadays she's the most experienced player.\nVeteran midfielder van Egmond, ahead of an international fixture at home in Newcastle, has 156 Test caps to her name with only recently retired Clare Polkinghorne (167) in front on the all-time list.\nIn the Matildas group Steph Catley (135), Caitlin Foord (133), Alanna Kennedy (133) and Tameka Yallop (132) are the closest while star striker Samantha Kerr (129) remains sidelined with injury.\nVan Egmond, a Dudley Redhead junior, was listed as vice-captain alongside Ellie Carpenter for upcoming friendlies against Korea Republic. Catley's the skipper.\n\"All of the senior player's leadership qualities are important, but that's something Emily has really matured into very well,\" Sermanni said earlier this week when announcing the 21-player squad at Merewether Beach.\n\"I remember her starting out as a 15-year-old and now I see her as a really responsible senior player, on the field and off the field.\"\nVan Egmond, aged 31 and almost half a lifetime on from her international debut in 2010, returns to Australia from club commitments in the UK for Birmingham City.\nThe Matildas, building towards the Asian Cup in 12 month's time, host Korea Republic in Sydney next Friday (April 4) and McDonald Jones Stadium on Monday week (April 7).\nIt won't be the first time van Egmond has donned the green and gold uniform in the Hunter, but it marks a rare occasion to play in front of family and friends.\n\"She's one of those important senior players in and around the squad,\" Sermanni said.\n\"I think back to my second time with the Matildas and she was this young up and coming 15-year-old, she's now this very senior, hardened and extremely good professional.\n\"Coming back to your home town's very special for her and obviously she'll be a big part in that game.\"\nVan Egmond marks one of three players in the Matildas with local interest, joined by Adamstown junior Clare Wheeler and Jets defender Natasha Prior.\nWheeler, a midfielder with 26 caps and now at Everton, returns to the Aussie ranks following an injury-forced hiatus.\n\"It's really great to have her [Wheeler] back,\" Sermanni said.\n\"Clare was just starting to sort of get herself really established and push for a starting spot until about six months ago.\n\"Unfortunately the last two camps she's picked up an injury just prior and missed out on both of them, so it's really good to get her back.\"\nPrior will be available for A-League Women's commitments with the Jets against Western United on Sunday (4pm) before assembling in Matildas camp.\nIn terms of returning to play a Test in Newcastle, Sermanni supported the notion.\n\"Newcastle's a huge centre of football history, a lot of football history started here in Newcastle,\" Sermanni said.\n\"It's a typical football town, a blue-collar town and a town that has really supported football in the past in a fantastic way.\n\"It's also a town that has produced a lot of players for the Socceroos and Matildas.\n\"It's really important for us to come and play in these cities, particularly Newcastle, with the history that they've got.\"",
  "word_count": 548,
  "scraped_at": "2026-02-14T12:34:38.442351"
}