{
  "article_id": "ad5aa0ab0ba2",
  "url": "https://www.theblaze.com/fearless/google-most-searched-athletes-2024",
  "title": "Male boxers top Google most - searched athletes in the world for 2024",
  "date": "20241212T234500Z",
  "domain": "theblaze.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Photos by RvS.Media/Robert Hradil/Naomi Baker/Getty Images/Matt Winkelmeyer/Getty Images for Netflix © 2024\n© 2026 Blaze Media LLC. All rights reserved.\nMale boxers top Google's most-searched athletes in the world for 2024\nDecember 12, 2024\nYoung soccer players and Olympians also garnered particular focus throughout the year.\nThe most-searched athletes in the world on Google in 2024 coincided with some of the biggest events in the year, including the most-viewed boxing comeback of all time.\nAlthough World Series competitors the New York Yankees and Los Angeles Dodgers topped Google's list of most-searched sports teams for the year, neither of the teams’ uber-popular stars, Aaron Judge and Shohei Ohtani, made the list for individual athletes.\nInstead, those spots were reserved for boxers, Olympians, soccer players, and cricket stars.\nTopping the list at No.1 worldwide was Olympic gold medal boxer Imane Khelif. Khelif was accused of being a man who pummeled women en route to gold in the women's 66kg weight class.\nKhelif peaked in searches between July 28 and August 3, beginning right around the time it was revealed two boxers who failed gender tests would be competing in the Olympics.\nMultiple sources have claimed Khelif is a man, including the International Boxing Association and the World Boxing Organization. Two researchers also cited medical studies that claimed Khelif has male genitalia and XY chromosomes.\nDespite this bounty of evidence, Khelif has denied all accusations and claimed they are simply the product of a hate campaign.\nA different boxer who got all the love and almost as many searches was Mike Tyson at No. 2. Tyson made a landmark comeback at 58 years old in a live Netflix boxing special.\nTyson dominated Google between November 10-16, losing a decision to Jake Paul on November 15. Afterward, rumors swirled about the authenticity of the fight, leading to a Saudi Arabian entertainment executive offering Tyson a cool $700 million to take a rematch.\nPaul himself was ranked fifth on the worldwide list, peaking in popularity in the same time frame. However, the young boxer was out-ranked by No. 3 worldwide search Lamine Yamal.\nYamal was searched throughout the year, having started for top-tier soccer club Barcelona at just 16 years old. Yamal further entered into living rooms across the globe after appearing in the Euro 2024 international tournament.\nOlympic gold medalist gymnast Simone Biles appeared at No. 4 after another successful stint representing the red, white, and blue.\nBiles took home three gold and one silver at the 2024 Paris Olympics and has consistently stayed in headlines due to openly discussing mental issues. She is also married to NFL player Jonathan Owens, which surely provides crossover appeal with football fans.\nSimone Biles poses with her four medals at the Paris Olympics; she was the fourth-most Googled athlete of 2024.Photo by Jamie Squire/Getty Images\nOther soccer players like Nico Williams and Rodrigo Hernández Cascante cracked the top 10 along with multiple popular cricket players. Coming in at No. 8, however, was American golfer Scottie Scheffler.\nScheffler had one of the most wild years of any athlete, first getting arrested in May while on his way to compete in a tournament; the charges were later dropped. He again made headlines in August after winning gold at the Summer Olympics.\nA month later, Scheffler went viral for mocking a reporter's clueless questions at a press conference.\nAll's well that ends well for Scheffler, though; he ended the 2024 PGA Tour season with nearly $30 million in earnings.\nAdditionally, Scheffler ranked fourth on the U.S.-only Google list of most-searched athletes of the year. That list had Tyson at No. 1, Khelif at No. 2, and Biles at No 3.\nIt also included WNBA star Caitlin Clark at seventh place and popular, anti-woke NFL kicker Harrison Butker at eighth.\nLike Blaze News? Bypass the censors, sign up for our newsletters, and get stories like this direct to your inbox. Sign up here!\nWant to leave a tip?\nWe answer to you. Help keep our content free of advertisers and big tech censorship by leaving a tip today.\nWant to join the conversation?\nAlready a subscriber?\nAndrew Chapados is a writer focusing on sports, culture, entertainment, gaming, and U.S. politics. The podcaster and former radio-broadcaster also served in the Canadian Armed Forces, which he confirms actually does exist.\nandrewsaystv\nAndrew Chapados\nAndrew Chapados is a writer focusing on sports, culture, entertainment, gaming, and U.S. politics. The podcaster and former radio-broadcaster also served in the Canadian Armed Forces, which he confirms actually does exist.\n@andrewsaystv →more stories\nLoad More\nSign up for the Fearless newsletter\nBy signing up, you agree to our Privacy Policy and Terms of Use, and agree to receive content that may sometimes include advertisements. You may opt out at any time.\nRelated Content\nLoad More\n© 2026 Blaze Media LLC. All rights reserved.\nGet the stories that matter most delivered directly to your inbox.\nBy signing up, you agree to our Privacy Policy and Terms of Use, and agree to receive content that may sometimes include advertisements. You may opt out at any time.",
  "word_count": 846,
  "scraped_at": "2026-02-14T12:52:46.444712"
}