{
  "article_id": "ad7c91652045",
  "url": "https://indianexpress.com/article/opinion/columns/kerala-woman-arrested-toddy-post-pervasive-misogyny-8519902/",
  "title": "Arrest of woman in Kerala for post about toddy points to pervasive misogyny",
  "date": "20230326T091500Z",
  "domain": "indianexpress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Opinion Arrest of woman in Kerala for post about toddy points to pervasive misogyny\nSo, if toddy is tapped, it has to be consumed, right? However, in the so-called Left, liberal state, the excise department chose to arrest a woman for putting up an Instagram post with a picture of her consuming toddy with friends.\nWhen Pinarayi Vijayan became the chief minister of Kerala, he made headlines for being the son of a toddy tapper who rose through the ranks.\nThe Kerala government’s tourism website offers a page on “village life experience package” with details of packages under “Responsible Tourism Mission”. If you explore that, it has toddy tapping among the list of activities under “a day with farmers” in Kumarakom, while the home page itself has the picture of a toddy tapper climbing down a coconut tree.\nSo, if toddy is tapped, it has to be consumed, right?\nHowever, in the so-called Left, liberal state, the excise department chose to arrest a woman for putting up an Instagram post with a picture of her consuming toddy with friends. She was booked in the state’s “cultural capital”, Thrissur, under Section 55H of the Abkari Act for advertisement soliciting the use of, and promoting the consumption of liquor. She was later released on bail. The action was on a complaint “forwarded” by the commissionerate in Thiruvananthapuram. This comes at a time when the state government has decided to give star status to toddy shops under its new liquor policy.\nOpen any social media and search for Kerala toddy, and pages of posts will pop up, mostly of vloggers who promote Kerala’s own drink that is pitched to have several health benefits. Pure toddy with a negligible percentage of alcohol is even an integral part of Kerala cuisine.\nSo why did the excise department decide to swoop down on a woman over a social media post? Or is it a campaign that has just begun? Will they be booking all those who post a picture at a toddy shop? The action certainly smacks of the deep-rooted misogyny that runs through Kerala society: We have never heard of a similar action against a man.\nIs the excise department saying no one should promote toddy in Kerala while the sale of Indian Made Foreign Liquor (IMFL) in the state hits new records on Christmas, New Year’s Eve, Onam or the football World Cup? Or is it saying women drinking is not tolerable?\nOver-stretching a rule to resort to an opportunistic display of power over a woman is no heroic act. Prima facie, women are far more responsible drinkers compared to men. Ever heard of a drunk woman constantly making her husband’s life miserable and beating him up? Or a mother drinking with the money meant to pay her child’s school fees? Or a daughter satiating her intoxicant needs using money meant to fund her father’s medical needs? Such stories, if ever they are heard, are exceptions. Change the gender in the above instances, and they become almost cliché. And according to the National Family Health Survey 2019-21 figures, Kerala features among the states with the lowest consumption of alcohol among women.\nThis is not the first time the most literate state’s misogyny is on display. Last year, a sessions court in Kerala remarked that the outfit worn by the complainant provided sufficient legal ground to make comments offensive and disrespectful to women in a sexual harassment case while granting bail to the accused. During the #MeToo movement, too, victims who called out men in power were ridiculed by a section of society. Even the Association of Malayalam Movie Artistes headed by superstar Mohanlal failed to acknowledge or take a strong stand against the exploitation of women actors. The word “feminichi” (meaning feminist) became a commonly used term to mock a woman who stands up or speaks up for herself.\nCoupled with misogyny, the society is mostly conservative and patriarchal where moral policing does the rounds in subtle ways.\nIf a woman complains of eve-teasing after dusk, the first question that she faces from her own family is “why were you out there at this time”. If a woman complains of workplace harassment, they will ask her to leave the job; never encourage her to stand up and fight. Shirking the issue itself is a mark of this conservative society. They don’t want to involve and “defame” themselves as being modern.\nIf it does not want to be a part of this trend, the excise department ought to make its stand clear. Instead of resorting to such high-handedness, they should promote responsible drinking.\nyamini.nair@expressindia.com",
  "word_count": 769,
  "scraped_at": "2026-02-14T12:25:51.404740"
}