{
  "article_id": "ad847f9162d0",
  "url": "https://baysidenews.com.au/2025/01/13/all-eyes-turn-to-wallace-cup/",
  "title": "All eyes turn to Wallace Cup - Bayside News",
  "date": "20250113T073000Z",
  "domain": "baysidenews.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "SOCCER\nTHE focus of the local game switches to Lawton Park this Saturday and the 12th official staging of the annual Steve Wallace Memorial Day. The event commemorates the life of local soccer icon Stephen William Wallace who was 54 years old when he died on 19 July 2011 and was a former Langwarrin player, coach, president, life member, club council representative and Bayside League referee.\nCOVID-19 rules impacted on the event in 2022 and forced a series of one-off 90-minute games so no winner was declared but the tournament returned to a more familiar format in 2023 with the host club winning the trophy for the third time. Last year Baxter caused the biggest boilover in Wallace Cup history when it defeated Langwarrin on penalties in the final to become the lowest-ranked Football Victoria club to lift the trophy. A significant feature of the 2024 event was the introduction of the Steve Wallace Plate run concurrently with the Wallace Cup. Somerville Eagles defeated Rosebud 2-0 in the Plate final.\nThis year’s Wallace Cup will be contested by Langwarrin, Mornington, Peninsula Strikers, Skye United, Baxter and newcomer Chelsea while the Wallace Plate will feature Somerville Eagles, Frankston Pines, Rosebud, Seaford United, Mount Eliza and Mount Martha.\nThe Cup and Plate contestants will be split into two groups with group winners playing in the final.\nWallace Cup, Group A: Chelsea, Skye United, Peninsula Strikers.\nWallace Cup, Group B: Mornington, Langwarrin, Baxter.\nWallace Plate, Group A: Mount Eliza, Seaford United, Mount Martha.\nWallace Plate, Group B: Frankston Pines, Somerville Eagles, Rosebud.\nMatches will consist of 20-minute halves and the Cup will be played on the main pitch at Lawton Park with the Plate being played on the top pitch near the venue’s main entrance.\nBoth finals will be played on the main pitch.\nHere is the full draw:\n12pm: Chelsea v Skye Utd\n12.50pm: Mornington v Baxter, Mount Eliza v Mount Martha\n1.40pm: Peninsula Strikers v Skye Utd, Frankston Pines v Somerville Eagles\n2.30pm: Langwarrin v Baxter, Mount Martha v Seaford Utd\n3.20pm: Peninsula Strikers v Chelsea, Rosebud v Frankston Pines\n4.10pm: Langwarrin v Mornington, Seaford Utd v Mount Eliza\n5pm: Somerville Eagles v Rosebud\n5.10pm: Wallace Cup Final\n6pm: Wallace Plate Final.\nPrevious Wallace Cup winners are: Casey Comets 2013; Mornington 2014, 2015, 2016, 2017, 2018; Moreland Zebras 2019; Langwarrin 2020, 2021, 2023; Baxter 2024.\nIn State 4 news Frankston Pines are in the spotlight once more after senior coach Jason Grieve dropped a bombshell on the local club by resigning on Sunday. Grieve was appointed in December after knocking back the senior coaching job at Baxter. The former Mentone mentor held his first training session last Thursday and there was no indication that he would quit. “There were around 18 at training and some quality players but not enough yet so lots of work to do,” Grieve said after the session.\nGrieve and Pines president Liz Diaz spoke after Thursday’s session and again on Friday.\n“Everything was fine, we were both on the same page and we were about to announce a reserves coach,” Diaz said. “I truly don’t know what happened. “I’ll be honest this came completely out of the blue.”\nWhen Grieve took on the Pines job he spoke of his enthusiasm to grab “an opportunity to shape the whole club – it’s a much bigger role than just the senior men’s coach. “Right now we don’t have a playing squad of any note but that will change. “I want to assemble a squad mainly of under-23s with a selection of really experienced heads to help and to be as competitive as we possibly can.” Now that task falls to Alex Halikias who has taken over as interim head coach. Halikias was appointed as Pines senior women’s coach in December and has coached at a number of clubs including Peninsula Strikers, Richmond, Casey Comets and Mount Eliza.\nIn other State 4 news Rosebud has released its pre-season match schedule for January and February.\nCheck the cub’s facebook page for confirmation of these fixtures in case weather forecasts force changes:\nThursday 16 January v Mount Eliza, Olympic Park, 7pm\nThursday 23 January v Knox City, Olympic Park, 7pm\nSaturday 1 February, v Skye Utd, Olympic Park, 4pm & 6pm\nSaturday 8 February v Moonee Ponds Utd, Olympic Park, 4pm & 6pm\nSaturday 15 February v Yarraville, Olympic Park, 4pm & 6pm\nSaturday 22 February v St Kevin’s, Olympic Park, 4pm & 6pm\nIn State 5 news Chris Sanderson has taken over as president of Mount Martha with no fanfare whatsoever. The club’s AGM in November didn’t go to plan and process anomalies forced an extraordinary AGM which was held last month. Sanderson replaced Rhys Piper as president becoming the fifth person to hold the office in the 10 years the club has operated. Other members of the new executive are vice-president Jay Bartle, secretary Shelley Christie, treasurer Anton Mihoc and Piper is now operations manager.\nSanderson is keen to oversee the establishment of clearly defined player pathways bridging the junior and senior sections of the club. “We would have had around 40 junior teams last season from under-6s to under-18s,” Sanderson said. “But we tend to lose our A-grade players to other clubs which is a problem. “We don’t mind losing players to NPL juniors because they are testing themselves at a higher level but we should never lose them to other community clubs such as Rosebud and Mount Eliza.”\nMount Martha’s under-18s have been the talent pool from which the club’s senior men’s and women’s programs have been built and the results in the women’s program have been spectacular. The women won State 5 in their first season of senior competition and finished third this year in State 4 with top scorer Kira Greenwood winning the league best and fairest award.\n“I’m keen to make sure that what happened with the men doesn’t happen with the women,” Sanderson added. “There were some changes to the club’s approach a couple of years ago and they had a negative impact on the men’s program at the time but it’s back on track now. “Charlie (Platt) our senior coach has strong links with Mornington and hopefully we can attract some younger players from there by offering them senior football.”\nShire council has given Mount Martha access to the new clubrooms at Civic Reserve that are expected to be officially opened before the league season. “We’ll be applying for a liquor licence,” Sanderson said. “We can’t open the venue without the ability to sell alcohol as it’s an important revenue base for clubs nowadays and allows us to hire out the venue for various functions.”\nSanderson’s son Ethan is a former Mount Martha best and fairest and Golden Boot winner but it’s unlikely that he will return from last year’s State 5 champion Rosebud. “They really looked after him and he’s happy there so he’s looking forward to testing himself in State 4.”\nIn practice match news Langwarrin travelled to Shepparton on Saturday and drew 1-1 with Goulburn Valley Suns in oppressive heat. The Suns opened the scoring after five minutes but Archie Macphee equalised shortly after.\nOn Sunday Skye United drew 1-1 with Hampton East Brighton at Carrum Downs Recreation Reserve.\nA triallist scored for Skye.\nFirst published in the Frankston Times – 14 January 2025",
  "word_count": 1225,
  "scraped_at": "2026-02-14T12:58:13.977209"
}