{
  "article_id": "adb302069f5d",
  "url": "https://www.justarsenal.com/arteta-says-arsenal-women-and-men-inspiring-for-each-other-after-champions-league-win/336003",
  "title": "Arteta says Arsenal Women and Men  inspiring for each other  after Champions League win",
  "date": "20230401T164500Z",
  "domain": "justarsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal are on course to win their first Premier League title in two years. No one saw it coming, but here we are. It’s funny how many critics can’t shy away from giving praise to Arsenal. How times have changed. Arsenal have been imperious this season, and I bet they are ready to finish the 2022–23 season in style, probably going unbeaten in the remaining 10 games (that would be incredible).\nArsenal are currently at the top of the PL log with 69 points, 8 points better than second-placed Manchester City, with only 10 matches to be played. It’s been a long wait for Arsenal to be called league champions, but Arsenal is now a few matches away from giving the young Gooners a taste of an EPL title. If all goes well, Arteta and his boys will not only lift the Premier League, but they will also make a return to the Champions League after a 6-year absence.\nSo come next season, they will play Champions League football (that is almost guaranteed even if they don’t win the league), and it will be so interesting to see them play. Mikel Arteta, reacting to the\nArsenal women qualifying for the Champions League semi-finals after beating Bayern Munich at the Emirates, hinted his side will also be keen to make a return to the Champions League.\n“It was great to have the experience to live it there and the crowd that we had in the game, especially the way they played, in the first half, it was a real joy to watch,” Arteta said.\n“It is a big achievement; it hasn’t happened for many, many years at the club, and we have to catch them up. This is the beauty of it—getting things inside the club that are inspiring for each other and can make us closer and better.”\nDo you think Arteta, as a coach, could walk into the Champions League and win it at the first time of asking?\nMichelle Maxwell\nWatch our brilliant Arsenal Women beat Bayern Munich to reach the Champions League Semi-Finals (World class strike from Frida Maanum!)\nMore Stories / Latest News\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 381,
  "scraped_at": "2026-02-14T12:44:44.527058"
}