{
  "article_id": "adb8d23daf7e",
  "url": "https://www.westmeathexaminer.ie/2024/08/24/jermaine-jenas-apologises-after-bbc-sacking-i-am-ashamed-and-deeply-sorry/",
  "title": "Jermaine Jenas apologises after BBC sacking :  I am ashamed and deeply sorry  ",
  "date": "20240824T150000Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jermaine Jenas apologises after BBC sacking: ‘I am ashamed and deeply sorry’\nBy Ellie Iorizzo, PA Los Angeles Correspondent\nJermaine Jenas has apologised and said he is “ashamed” after being sacked by the BBC, but insisted his behaviour was not illegal.\nThe Match Of The Day and The One Show presenter was removed by the BBC from the presenting line-ups on Thursday after claims he sent inappropriate messages to two female colleagues.\nThe BBC has not offered details on why Jenas’s contract was terminated.\n“I am ashamed, and I am deeply sorry,” the 41-year-old former footballer said in an interview with The Sun newspaper.\n“I have let myself down, my family, friends and colleagues down, and I owe everyone an apology – especially the women with whom I was messaging. I am so, so sorry.\n“I am sorry for what I have put them through. I think it would be fair to say I have a problem.\n“I know I self-sabotage and have a self-destructive streak when it comes to my relationship especially, and I know I need help. And I am getting help.\n“I have made a lot of mistakes, and I am asking myself a lot of questions at the moment. I know there’s a lot of work that needs to be done, and it will be hard.”\nJenas said he fell below the standard of responsibility that “needs to be upheld when you’re a member of the BBC”, but insisted there was no criminality involved.\n“I did nothing illegal – these were inappropriate messages between two consenting adults,” he said.\nIt comes after a BBC spokesperson said: “We can confirm that he is no longer part of our presenting line-up.”\nJenas told The Sun: “I’m not proud of what I wrote and what I said. And I do consider it cheating, yes, although nothing physical ever happened.\n“This is all on me and I fully accept there is a level of responsibility that needs to be upheld when you’re a member of the BBC. And I fell below those standards. I must take the responsibility.”\nJenas said he felt as though he is “the number one target right now in the country” after allegations began to swirl around his sacking on Thursday.\nHe told the newspaper: “These were two consenting adults I was speaking to. With one she made it clear she was interested.\n“I don’t want to start going down the ‘who pursued who’ road, but when people are saying things that are wrong and false information is being spread, I do have to kind of defend my space.\n“In that particular instance, there was an adult conversation that took place in a bar in London where that person made it very clear that they had an attraction to me. Yes there was alcohol involved but I take full responsibility.\n“I feel people don’t know the truth and are forming opinions about me that aren’t accurate. I wasn’t going through some kind of BBC vault trying to get women’s numbers.\n“I’m obviously going to say I’m not a sex pest. These were consenting adults I was texting.”\nJenas has been married to model Ellie Penfold for 13 years.\nHe said he was sacked by the BBC on Monday, five days after a HR consultation process began where he was shown a string of messages he is said to have sent to two colleagues on The One Show.\nJenas, who played for Tottenham Hotspur and Nottingham Forest, said he was “speaking to his lawyers” after being axed by the corporation.\nAccording to official figures published last year, Jenas earned £190,000 to £194,999 for his work on the FA Cup, Match Of The Day and the World Cup at the BBC.\nHis salary for working on The One Show was not in the public domain, as it is produced by BBC Studios.\nIt is the latest blow to the BBC after the Huw Edwards child abuse scandal and bullying allegations on Strictly Come Dancing.\nMoments after it was announced he had been removed from all BBC presenting line-ups, Jenas began co-presenting a talkSPORT drive-time show with fellow former footballer Jermaine Pennant.\nTalkSPORT said: “There are no plans for Jermaine to broadcast as a presenter on talkSPORT in the immediate future.”\nJenas appears on TNT Sports’ football coverage from time to time but it is understood he is not scheduled to appear for a number of weeks.\nIt is understood TNT Sports was unaware of the status of Jenas’s employment with the BBC.\nThe father-of-four joined The One Show in 2020 as a stand-in co-host following the departure of Matt Baker. He was made a permanent fixture the following year.\nJenas has been a regular pundit on sports programmes Match Of The Day and Match Of The Day 2 and a presenter on BBC Radio 5 Live.\nHe has been widely regarded as a natural successor to replace Gary Lineker as host of Match Of The Day, but was noticeably absent from Saturday’s first episode of the new season.\nIn May, he was given an ally of the year award by the Women’s Football Awards.\nDuring his football career, he appeared for England and played for Nottingham Forest, Newcastle United, Tottenham, Aston Villa and Queens Park Rangers.\nJenas also hosts Formula E race coverage for TNT Sports.\nA Formula E spokesperson said: “Jermaine Jenas was part of Formula E’s presentation team for season 10, which ended in July this year.\n“As per the process followed in previous seasons, we will announce our presenter line-up for season 11 in due course.\n“This decision will be carefully considered, taking into account the high standards we expect to be upheld at Formula E.”\nHis agency, MC Saatchi, no longer represents him and his profile on the site now displays a “page not found” notice.",
  "word_count": 972,
  "scraped_at": "2026-02-14T12:57:42.793593"
}