{
  "article_id": "adbabdecab7a",
  "url": "https://www.burntorangenation.com/2023/2/23/23612353/longhorns-daily-news-texas-quinn-ewers-arch-manning-sec-big-12",
  "title": "Longhorns Daily News : Texa Quinn Ewers noted among QBs facing most offseason pressure",
  "date": "20230223T230000Z",
  "domain": "burntorangenation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "We all remember how Texas Longhorns redshirt sophomore quarterback Quinn Ewers’ 2022 season went. Not as well as expected, one could say, with much to be desired going into 2023.\nLonghorns Daily News: Texas’ Quinn Ewers noted among QBs facing most offseason pressure\nPlus: It’s the season of talk\n247Sports recently noted Ewers among the collegiate sport’s quarterbacks facing the most offseason pressure.\nFrom 247Sports: “By all accounts, the 2023 Longhorns belong to Ewers, the returning starter at Texas who is scheduled to help five-star freshman Arch Manning acclimate himself to the college game. However, what happens if Ewers is inconsistent during the spring and Manning shines as an early enrollee? That’s only going to increase the intrigue a bit surrounding Steve Sarkisian’s uber-talented quarterback room. This will be Ewers’ second full spring in Austin and he’s no longer saddled with learning the offense. That part is mastered at this point given his comfort level last season when he wasn’t playing hurt.”\nWHAT THEY’RE SAYING ABOUT THE LONGHORNS\nAustin American-Statesman: Golden: Could Texas basketball teams repeat 2003 Final Four double?\nDallas Morning News: Texas LB outlook for 2023: Jaylan Ford is due for another big season\nDallas Morning News: What can fans expect from the 2023 NCAA Women’s Final Four being hosted in Dallas?\n247Sports: The Insider: Look for freshman linebacker Anthony Hill to make an immediate impact\n247Sports: Source: Texas player personnel analyst Tony Shields expected to be hired by Memphis\nInside Texas: Xavier Worthy named one of On3’s top 10 receivers in college football\nInside Texas: On Texas Football: 2023 Spring Preview - wide receivers\nInside Texas: Breaking down Texas’ nearly impenetrable 2022 run defense\nInside Texas: Steve Sarkisian understands the positives and potential pitfalls of the NIL era\nInside Texas: Column: Don’t move the Red River Shootout (and thank you CDC for not wanting to do so)\nICYMI IN BURNT ORANGE NATION\nRECRUITING ROUNDUP\n247Sports: Mater Dei OL Deandre Carter looking to get back to Texas\n247Sports: Touted 2026 QB Julian Lewis locks in several spring visits\n247Sports: Ten 2024 prospects who could earn an offer this spring\n247Sports: Four-star defender Kolaj Cobbins talks Texas interest\nInside Texas: Rising 2024 DB Braylon Conley talks Texas, offseason plans\nBIG 12 BREAKDOWN\nAssociated Press: March Madness: Everything fans need to know about the 2023 NCAA Tournament\nViva the Matadors: A season opening sweep for Red Raiders\nFrogs O’ War: TCU 7, UTA 3: Frogs win 2023 home opener\nBring On The Cats: Tournament Thursday: Good to be home\nWHAT WE’RE READING\nSB Nation: Marquette built an elite offense overnight, and it’s made them a Final Four sleeper\nSB Nation: Chad Ochocinco lived in the Bengals stadium for 2 years to save money\nSB Nation: We need to talk about Fernando Alonso’s griddy\nNEWS ACROSS LONGHORN NATION AND BEYOND\n- Slow news day, folks.",
  "word_count": 474,
  "scraped_at": "2026-02-14T13:33:57.591301"
}