{
  "article_id": "adbd5e865e4d",
  "url": "https://www.dallascowboys.com/news/science-lab-a-sky-high-demand-for-2023-defense",
  "title": "Science Lab : A Sky - High Demand for 2023 Defense",
  "date": "20230907T200000Z",
  "domain": "dallascowboys.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "FRISCO, Texas — Having a longstanding belief that something is true doesn't mean it actually is, if it were a lie to begin with. For example, the sky is not actually blue (seriously, look it up), and the outcome of the 2023 season for the Dallas Cowboys won't be determined by a Super Bowl drought that began when Bill Clinton was in office but, for some reason, people swear by both of these things.\nIf you believe the latter, I'm selling bags of sand in the Sahara, if you're interested.\nPrice is negotiable. Make me an offer.\nWhat this season will be determined by is what they do or do not do over the next several months, from the coaching staff to the players to the front office via potential trades and/or signings (e.g., Johnathan Hankins, T.Y. Hilton), and it all begins on Sunday night against the New York Giants — under the scorching hot lights of primetime football.\nEveryone, and I do mean everyone, has to execute.\n\"This is one game, but this is one game we need to win.\" - Mike McCarthy, Week 1\nThe Tall Grass\nIn order to get off on the right foot, and against a division rival, no less, it's time to start answering every single question that has haunted Cowboys coverage all offseason.\nMost of those questions surround quarterback Dak Prescott and the new-look offense that is also now orchestrated largely by Mike McCarthy the Playcaller, has tweaked the positional coaching staff, done away with Kellen Moore, and features new playmakers in Brandin Cooks and Deuce Vaughn.\nI want you to walk with me on the road less traveled today, however, so grab your machete and let's head for the tall grass, where questions about the defense are hiding in plain sight.\nYes, I said the defense.\nDid you just gasp? That was rude, but I forgive you.\nHell, I understand. After all, it's the defense that's carried a lot of the water for much of the past two seasons, not so coincidentally correlating with the decision to fire Mike Nolan after one season and install Dan Quinn in 2021 and, in March 2022, trading Amari Cooper away from an offense that also featured a recovering Michael Gallup and a different version of Jalen Tolbert.\nNonetheless, it's fair to ask the defense to find a higher top gear, one that would make them not just a unit that is arguably the best in the league, but literally the best in the league; and one that can delete any mistake the offense were to make, because could you then imagine what that kind of defense would be capable of if the offense rarely made any at all?\nI heard you gasp again but, this time, it felt more sensual.\nThat's because what I just offered up is provocative. It gets the people going.\nBe Immortal\nCan this Dallas defense be No. 1 in the entire league in takeaways a third straight season, which goes to a rare consistency that is difficult to sustain in today's NFL?\nCan it truly take the next step and go from great to outright special?\nI believe it can be both, and I want to see it placed in conversation with the legendary Doomsday Defense of yesteryear. And since I don't do half-measures, I don't just want it to be comparable.\nI want it to be the best in franchise history.\nYou call that a lofty goal. All things considered, and the intoxicating romance of nostalgia aside, I call it attainable. After all, was the Doomsday Defense the Doomsday Defense before they earned the right to be the Doomsday Defense?\nIn other words, nothing exists until it exists.\nIt's easy to look at what this defense has been and start yelling about how the \"sky's the limit!\", but if I told you there really is no such thing as the \"sky\" in the first place, then telling you to skip the phantom blue stuff and aim for outer space should be a fairly easy pill to swallow.\n\"You walk into the defensive meeting room and the players, the engagement, the connection that they have — I feel us leveling up in a lot of ways.\" - Dan Quinn, June 2023\nLet's talk about this, I mean really talk about this.\nI just told you this defense was No. 1 in takeaways the past two seasons, and they've been in the top-3 in several other categories of significance, and top-5 in others. They achieved all of this with Hankins being dropped in halfway through the 2022 season with no time to get acclimated, and having lost both Jourdan Lewis and Anthony Brown — two starting cornerbacks — for the season with major injury.\nSo what did they go out and do? Add Mazi Smith with a first-round pick, trade a fifth-round pick for Stephon Gilmore and retain both Donovan Wilson and Leighton Vander Esch in free agency.\nBut wait, there's more.\nOverkill, On Purpose\nIf you thought Micah Parsons looked unstoppable the last two seasons, dare I say you haven't seen anything yet. His dominance in camp was other-worldly (you know, like, in outer space?) and DeMarcus Lawrence hasn't lost a step on the opposite edge.\nDorance Armstrong is coming off of a career year. Sam Williams is primed to break out and Dante Fowler returns after a resurgent season in his reunion with Quinn. Lewis is back and joins Gilmore and Trevon Diggs along with breakout sensation DaRon Bland, and I have incessantly beat the drum for a coming breakout season for Damone Clark in the LB corps.\n\"It's about learning… and going out there to hit some people.\" - Damone Clark, August 2022\nYes, they lost DeMarvion Overshown, but something tells me Quinn already has a plan..\nSo while the world, including myself, will tune in to see if the offense can get back on track, I will also be insatiable in my hunger for more from this defense this entire season.\nThe Giants are, to me, simply the first of a long line of opponents who can provide a hearty meal — at the expense of their own personal dreams and aspirations.\nThe mission has to be to force the game onto Daniel Jones, even with the addition of rookie speedster Jalin Hyatt and playmaking tight end Darren Waller. Fact is, the Cowboys not only have the blueprint to defeat Jones and Co., including Saquon Barkley, but they have proven they've had the personnel to do it, and that was before they added more defensive weaponry.\nIn the 10 wins the Giants pieced together in 2022 (including the playoffs), their first season under head coach Brian Daboll, Barkley averaged a robust 104.7 yards per game. That allowed Jones to have just a 70.8% completion percentage as the Robin to Barkley's Batman.\nBut what happens when someone stopped Batman?\nSpoiler: Nightwing didn't show up.\nHoly Lab Koat, Batman!\nThe Giants suffered eight losses (including the playoffs) and, in those contests, Barkley was held to an average of only 52.57 yards per game — stifled largely by NFC and NFC East teams — and Jones was then forced to try and win the game with his arm, but couldn't en route to a 9-7-1 finish on the season. And in those losses were where I discovered two magic numbers the Giants would prefer no one pay attention to: 62 and 27.\nJones went 1-5 in 2022 (including the playoff loss to the Eagles) when completing fewer than 62% of his passes, finishing with a completion rate of only 54% and 60%, respectively, in his two losses to Quinn and the Cowboys.\nIn his first matchup against Quinn (in 2021), Jones was held to a wildly unproductive completion rate of 38.46% before leaving with a concussion — in a 44-20 shellacking that featured Barkley exiting early with a high ankle sprain.\nSimply put, when Barkley isn't allowed to hop into the Batmobile, Jones has historically wilted.\nAs a relevant aside, Jones is also 0-3 against the Cowboys since the defense in Dallas was given to the capable hands of Quinn, with only one passing touchdown to go along with an interception in that stretch.\nFor those concerned about Jones' mobility, that's fair, but so is knowing he's taken off with the ball 15 times against Quinn's defense for an average of only 34 yards per game with no rushing touchdowns to show for it.\nBlueprint + personnel = checkmate.\n\"Everyone gets the smoke. …I'm treating everybody the same.\" - Micah Parsons, Week 1\nCarpe Omnia\nAs for the other magic number, namely 27, that's not nearly as complex for the Cowboys to figure out, at least not unless those aforementioned questions about the offense aren't ready to be answered. That is the average number of points allowed by the Giants defense in 2022 throughout their eight losses, and that has to be a glaring point of attack when it comes to the Cowboys' gameplan for Week 1.\nOf course they want to deliver a 40 burger with extra cheese, but if they're able to hit that amount of production on Sunday night — 27 points — the odds of victory against Jones and the Giants increases exponentially; and, again, I'm factoring in Hyatt and Waller as well in this equation, because I do believe they can be negated by the Cowboys' defensive personnel.\nAsk Terry McLaurin and Justin Jefferson.\nNone of the Giants' eight losses last season were to fewer than 22 points allowed, contrarily, they held opponents to an average of only 16.9 points per game in their 10 wins (playoffs included), further proving the point that while scoring the most points possible needs to be on the agenda for Prescott and McCarthy's offense, because a message needs to be sent that they are not kidding around in 2023, the science reveals all it might take is three touchdowns and two field goals, mathematically speaking, to get the job done.\nAnd that's against a secondary in New York that will field two rookie cornerbacks as primary defenders, who are going to be tested at every possible turn against the proliferation of Cowboys weapons at wide receiver.\nSo, honestly, I'm less concerned right now (less, not without concern entirely) about what the offense can do against the Giants (I contend practicing against this defense means there was no real benefit to play offensive starters in the preseason) as I am curious to see if the defense can make the villagers hide the women and children with every raid-and-plunder on a weekly basis.\nAnd when it's all said-and-done and they hoist the Lombardi trophy in February, looking up to the heavens with thanks the next morning and every day into the rest of their lives, knowing they've done what many before them couldn't, they'll suddenly realize what was always true:\nThe sky isn't actually blue.\nIt never was.",
  "word_count": 1827,
  "scraped_at": "2026-02-14T12:39:53.395052"
}