{
  "article_id": "adda387bf8a4",
  "url": "https://theathletic.com/4726390/2023/07/28/john-textor-crystal-palace-lyon-botafogo/",
  "title": "John Textor : His uncertain Palace future , Lyon boardroom battles and multi - club vision",
  "date": "20230728T113000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "You know the old joke about London buses?\nIn the multi-club ownership era, interviews with football club owners are a bit like that. You wait weeks and weeks for one and then three, sorry, four come along once.\nBecause, readers, the next in our occasional series of chats with owners of English clubs is John Textor, the founder and chairman of Eagle Football, a group that owns majority stakes in Brazil’s Botafogo, French side Olympique Lyonnais and RWD Molenbeek in Belgium, as well as a large slice of Crystal Palace.\nAdvertisement\nSo, that’s four relatively recent takeovers to discuss, two of which were bumpy, one was a pioneering move into a huge but largely unexplored market and one that… well, we’ll let Textor explain.\nThe 57-year-old American also provides updates on a significant corporate move, the sale of a successful American sports franchise and a merger involving the Europe’s best women’s team.\nThe Athletic: Let’s start with Eagle Football’s takeover of Olympique Lyonnais. What’s the latest?\nTextor: We’re moving through the growing pains of a takeover of a big and complicated club. When you buy a business from a founder, or someone who has been a leader for a long time, there are many similarities as to what you’d go through.\nFirst, the seller decides to invite you in and maybe cash out because they’re moving on or their life is changing.\nThen, we had to work through a complex group of parties but eventually put together a lot of capital: my own and from partners we brought in, Ares, Jamie Dinan, J-P Conte, Elmwood and some others.\nBut what happened next is what happens a lot. The guy who was running the business (Jean-Michel Aulas), who sold us two thirds of his shares, has seller’s remorse.\nThe first couple of months working with Jean-Michel were quite rocky. We paid him nearly €100million (£85.7m; $109.7m) but found we didn’t have much influence, despite owning 80 per cent of the business.\nAs the weeks passed, and his excitement over the financial transaction faded, I think the reality set in that his life had changed and he didn’t want to give up control. It happens. It’s human nature.\nI’d have great days with Jean-Michel and then I’d have surprising days with Jean-Michel but, ultimately, when you’re the 80 per cent shareholder and you’re being asked to put in more capital by the DNCG (French football’s financial regulator), we decided to take full control of ownership and management.\nThe Athletic: That’s the takeover, what about the football team?\nTextor: The team is very good, it was top three for the last half of the season. But there have been challenges because you literally need permission from this third party as to how much you can spend.\nGO DEEPER\nExplained: John Textor's Lyon takeover - and how it affects Palace\nOL are built for the Champions League and haven’t been there for the last three years, so the scale of the business, the investment, the facilities… you’ve got to rationalise all of that under the watch of the DNCG while developing a plan to get back to the Champions League.\nAdvertisement\nWe made an €86million capital increase when we bought the club, we paid down €50m in debt, we just funded €65m in a tender offer for the remaining public shares and I posted €60m in a cash account as additional assurance to the DNCG that we have no need for more working capital.\nBut I suspect they want to manage us more strictly than OL in the past.\nAnd it’s not an FFP issue. They’re not trying to cap us to a revenue limit. It’s that they get to decide how much we can afford even if we’ve proven we can afford it.\nIt’s not for the faint of heart, but we’ll get through it.\nThe Athletic: You mentioned buying up the remaining public shares — how’s that going?\nTextor: It started four days ago and we’ve offered €3 a share. As it’s a listed company, I can’t give you an update but we expect about 75 per cent of that €65m to be claimed by shareholders.\nWe have announced that OL Group will remain a public company but we’re planning to move to the New York Stock Exchange. It’s a well-run company but they’re just in an illiquid financial market where things don’t trade as well as they do in New York.\nWe’re acquiring shares in France now but, as a public company in New York, we’ll issue new shares on the global market.\nAcross all of our clubs, we own 90 per cent in Brazil, 80 per cent in Belgium and so on, but at some point soon 30 per cent of Eagle, as an aggregate, will be owned by the public.\nWe’ve completed a lot of the financial reporting work, as we’re already a public company in France, so it’s a pretty easy job to move across — less than six months, if you’re committed to it.\nThe Athletic: Going back to the relationship with Jean-Michel. With all his experience, he looked like a great asset. Could you not have made it work?\nTextor: True, but Eagle Football is all about collaboration and these great men, who have built great things, are not always about that.\nAdvertisement\nI didn’t want to run the club and we made a three-year management deal. But he made public statements that “if Eagle Football wants to influence my football strategy, the answer is no!”\nThese would have been things we would love to have heard before we bought the company!\nThe Athletic: One more question. Was there a hole in Lyon’s budget?\nTextor: No… well, actually that’s not quite true. It’s all about timing.\nUnder Jean-Michel’s budget, the club has cash and a working-capital revolver — many companies do that; you borrow from the bank at some times during the year but have a surplus at others. His budget for the coming season did show that the club would have a €36million deficit in June 2024.\nNow, to an American entrepreneur, that doesn’t even register. One, it’s 11 months away. Two, it’s a relatively small amount. And three, it assumes total failure on many of our projections.\nFor example, we are going to sell some non-core players, we are going to sell the women’s team in Seattle, we are going to raise capital. So, a €36m problem, 11 months out, isn’t a problem.\nL’Equipe (the French newspaper) ran an interesting article two days ago that explained how for the last 30 years French clubs have been able to go to the authorities and say we’re going do X, Y and Z, and the DNCG has accepted them. It gave Jean-Michel a pass every year.\nBut when John Textor shows up, a new American, and says: “I have €60million in cash in a stand-by account”, that’s not as good as a projection? Or when we made a projection, like we’re going to sell OL Reign and the value of NWSL franchises has held up really well, our projections are valued at zero.\nI think we’ve been held to a different standard. So that’s been a bit strange.\nThe Athletic: You mentioned OL Reign, is that sale on track?\nTextor: Raine Group is running the process and we had nearly 30 parties express their interest. A much smaller group have shown themselves to be serious and capable. There’s about half a dozen in that category.\nWe expected to close before year-end but we don’t yet have a value range. We have an indication of value from the franchise fee — the cost of the right to open a team — for Boston and San Francisco, where it was $53m (£41.3m). So their total investment would be $53m plus the cost of a squad, facilities, staff.\nAdvertisement\nFor a well-run club, historically successful, a bunch of terrific athletes and people, we would expect to get more than the base franchise fee, but we shall see.\nThe Athletic: The other Lyon-related move that attracted attention was the joint venture with Michele Kang for OL’s excellent women’s team.\nTextor: That’s the reason we’re selling OL Reign, because otherwise we would have joint ownership of two NWSL teams, with the Washington Spirit.\nIt was very important to me to give control of that entity to Michele. She’s a crusader for issues that are important to women and a very capable entrepreneur.\nI don’t think that a top women’s team should be run from under the umbrella of a men’s team, and, under OL, the women’s team shared an executive, a sporting director, scouts, physios, facilities. No matter how good they looked on the field, they were not being treated as well as they should by the lack of investment.\nIt’s a great project — built by women, for women. I’ve never been accused of being woke but there was just a certain amount of common sense to what we did.\nThe Athletic: OK, on to Brussels and RWD Molenbeek. Is the trouble you’ve met there another case of seller’s remorse?\nTextor: Absolutely! We bought 80 per cent from an individual (Thierry Dailly) and he signed a management agreement that specifically gave me control of football decisions, so it wasn’t really comparable to the Jean-Michel situation.\nBut, again, once he cashes the cheque, a new reality sets in. And for these men it’s been their identities for years. It’s very intoxicating to walk around Brussels or Lyon and be called “Mr President” everywhere you go.\nWe (Eagle Football) are heavy on collaboration. But in Belgium you get this constant “what do you know about Belgian football?” That was a problem with our former leadership and it was a problem with our coaching staff, which we’ve just dismissed this week.\nAdvertisement\nVincent (Euvrard, the former coach) is very capable, and deserves to coach at the highest level, but we had better choices to manage the team in the context of a global collaboration.\nThe Athletic: But there have also been issues with a late payment to KV Oostende for the signing of Mickael Biron, right?\nTextor: Yes, there have been lots of financial difficulties in Belgium. We were funding into a business but without control of its accounts.\nThe general manager (Dailly) was dismissed after money went missing (Dailly said last month that he denies any wrongdoing), so we had an awkward transition. I was only named on the bank accounts a couple of weeks ago.\nAnd on the late payment you refer to, typically, clubs don’t go to the federation when you’re 18 days late with a payment but that was the case with KVO. But they were paid and it was cleaned up within 30 days.\nThe Athletic: Let’s move to Botafogo, where you’re 11 points clear at the top of Serie A. Are you starting to feel intoxicated, Mr President?\nTextor: Ha! We recently played in the second leg of a Copa Sudamericana qualifier (against Argentinian side Patronato), and we put out lots of young guys. We drew, which allowed us to go through on aggregate, but we got booed! So I never feel insulated by the success.\nWe have a lot of work to do but what I love about that project is what I love about Eagle Football, and it’s what I don’t have at Palace. There, I’m a minority investor. But at these other clubs I can get really involved, especially on the youth side.\nWe bought Botafogo in March last year and had four weeks to assemble a Serie A roster. We had to survive relegation and finished 11th.\nThis year, people have said, “Who have you just signed?” But they were incredibly well scouted. There are no celebrities but they’ve just come together.\nI’ve no idea if we’ll end up as champions but we’re playing well and the locker room is great.\nAdvertisement\nIf I compare that to Belgium, all last year we had a divided locker room. We had players refusing to come back this season because it was so toxic.\nIt wasn’t that the boys didn’t get on well. It was that the original players had considerably more advantages than the new players and that culture of collaboration was not getting established.\nThe Athletic: Things are clearly going great on the pitch but there have been off-field problems. I’ve heard you put them down to being a “guinea pig” for Brazil’s attempt to bring more overseas investment into its club game.\nTextor: Sure, but we expected those stories. Keep in mind that when people say “Botafogo owe us money” even the judges have a hard time understanding that old Botafogo social club is not the same as new Botafogo corporation we’ve bought. The social club’s debts are separate, wrapped up in a nice bundle, and the money we deposit into a central account is then distributed to pay those debts.\nThose people still have the right to complain and file lawsuits, but when they do that they not only file them against the old club, where they belong, but also against our new company. It’s been hard for judges to work out when a claim is appropriate for the old regime and when it’s appropriate for us.\nYou’re going to see those headlines for some time and that’s why we’ve felt like a guinea pig. We had the power company turn off the electricity to the training facility for debts that were four years old and weren’t our responsibility. We had the money from our TV contract sequestered because a tax prosecutor believed he had a pledge from three years ago.\nSo we’ve had to keep going to court to get our money back. It’s getting much better, though. And luckily, there are many older judges in Brazil who are big Botafogo fans!\nThe Athletic: Let’s go back to when you and I first spoke in 2021, when you bought a stake in Crystal Palace. You’ve been very busy since… you just haven’t been so busy at Palace. Fair?\nAdvertisement\nTextor: Yes, but it’s for the reason I mentioned. I was first invited to buy a majority stake at Palace but I decided to buy less than half because I was trying to conserve personal capital to buy (Portuguese club) Benfica — that’s how we got the name Eagle Football, the eagles of Benfica and Crystal Palace.\nSo my capital came in at Palace and it paid off a bunch of shareholder notes, people got money off the table and it helped finish some of what Steve (Parish) was doing at the academy, which is a great project. The capital also helped to reduce the average age of the team.\nBut after those initial successes, it soon became clear that nobody wanted to sell any more shares. The shareholders at Palace love that club. I know some fans on social media think otherwise, but it’s true.\nI’m at a limit as to what I can buy. I’m at 46 per cent but I vote as one fourth of the board.\nI joined a partnership of three guys who are very close to each other and, while they would disagree with this, if it’s anything controversial the votes are three against one!\n(Sources close to Palace, who asked to remain anonymous to protect relationships, say that Eagle Football’s holding is around 45 per cent and that other shareholders will soon be injecting cash as part of a capital raise, which would dilute Eagle Football’s holding.)\nThe Athletic: You came in at 40 per cent, how have you increased it?\nTextor: By adding more capital — I put in £30million ($38.5m) in the first quarter of this year.\nThe Athletic: And the other shareholders, including Steve Parish, have been diluted?\nTextor: Yeah, a small bit. Everyone is when someone puts in some capital. But people are proposing new investment all the time, particularly around the new stand.\nIf I’m asked to put in more capital, we would but there’s not really an opportunity to get more involved in the stuff that’s really fun for me — the academy, squad construction, the commercial elements.\nAdvertisement\nThe club is run by Steve and a terrific sporting director Dougie (Freedman) and they’re not really listening to me on players.\nThe Athletic: Is there an amicable divorce coming?\nTextor: Strangely, even with the difficulty around the creation of Eagle Football and the consents I needed to do that (from Palace’s other main shareholders Parish, Josh Harris and David Blitzer), Steve and I talk two or three times a week. It’s quite civil; we get along — it’s fun.\nWe have a spiritual divide on the merits of multi-club collaboration versus single-club governance, but there’s no amount of fighting with him that’s going to benefit that discussion, so we don’t fight.\nThe Athletic: But how long can that go on?\nTextor: It’s weird. I’m really, really into Palace. My kids are really into Palace.\nBut then I have a different emotion when I’m responsible for the outcome of something — I have a stronger connection. So I’m proud of my role, within a small team of good friends, for the construction of the roster in Brazil. Building the roster in Belgium started in June of last year, so that was fun.\nChecking in on Palace at the weekend is different. I’m a fan but I’m not remotely responsible for the outcome.\nThe Athletic: That’s really sad to hear and I don’t mean to push you for a big headline but…\nTextor: Ha! I’m trying to think if there is a big headline that’s not disruptive.\nLook, people can call me an investor all they want but I’ve never been an investor in somebody else’s business. I’ve built businesses from start-ups, successfully and unsuccessfully. That’s what I do.\nBut the likelihood of me being a passive investor for a length of time? If you knew me, you’d know that’s not a long-term strategy.\nSo either we’re invited to take greater leadership over time or we’ll want to deploy our capital elsewhere. Because we think it’s important to have a UK partner that is as collaborative with our other clubs as they are today.\nBut I’m not an idiot! It just so happens that I am an investor at Palace and the value of that investment is significant. I can complain about whether Steve likes players with red hair and I like players with blue hair but the fact is the club is doing well, it’s cashflow positive and has an incredible academy.\nAdvertisement\nAnd that academy is the only category one academy in south London. That’s going to matter. It’s only been category one for a couple of years. In three or four years, you’re going to see what I see at Lyon, where nine of the starters are from the academy. That’s why I think Palace has a real opportunity to get to the top.\nIf you add that to an improved stadium and a squad that’s full of assets… I know it’s a two-edged sword but a couple of years ago we only had one player worth more than £30million, now we have several. So, I can complain about Steve’s style but he’s doing a pretty good job.\nI may not be a minority investor by disposition but I’m not stupid and I’m not going to hurt the investment.\nThe Athletic: Would it be fair to say you made a mistake on the way in?\nTextor: Huge mistake!\nI would still have asked Steve to stay on as a partner, but there are dozens of other shareholders at Palace who I could have bought out and they would have been happy to take the cash. But what happened is that my cash made the club better and now they don’t want to sell.\nThe Athletic: You said a moment ago that it was important for Eagle Football to have a UK partner. If you and Palace go your separate ways, would you try this at another English club?\nTextor: Yes, and there’s a reason why the UK strategy is important.\nWe have an expression… OK, it’s just me at the moment, but I’m hoping my partners will start saying it, too! You have to be a champion for the players before you can be a champion for the fans.\nThat’s the answer to the fans when they complain about me moving (Brazilian forward) Jeffinho to France (from Botafogo) or some other controversial move.\nChampionships are made out of love and great chemistry — they’re not made out of individualism and divisiveness. You need a great locker room. The players have to believe that you believe in them.\nPlayers often use this great word: “I went to that club for the project.” They don’t mean they want to build stadiums. The project is an alignment of the club’s leadership with their own career path.\nAdvertisement\nThe reason I moved Jeffinho from Botafogo to Lyon after one season is that he was seen as a young athlete because he came from a small academy and had very little professional experience, but he wasn’t young. He was 23 and had just become a father. His time to make the move to Europe was upon him.\nIf you are a champion for the players, you’ll become a champion for the fans because the best players will want to come.\nThe UK strategy is important because everyone wants to get there. I didn’t create the dynamics in Brazil that make a player want to get out of the favela and end up in London. But I can be the players’ champion so that players trust us, and then we can fill the team with enough new players to win the championship, while still creating the pathway, the project.\nThat’s my multi-club strategy. Everyone tells me I’m an anglophile, and it’s probably true, but I don’t buy that only the feet of kids born in England are blessed by God. There are kids all over north, south and central America who are better at $3million than English players who cost £10m.\nWhat the Premier League did with the GBE (governing-body exemptions for work permits) and those four extra places was genius. And Steve Parish played a huge part in it. That’s going to put different faces and skin colours on playing fields in England but we’ll still be able to protect the English game.\nI don’t think like the other multi-club guys. They think about money and synergies; I think about squad construction and player pathways. That’s why I’m in this hobby that’s become a business.\n(Top photo: Wagner Meier/Getty Images)",
  "word_count": 3787,
  "scraped_at": "2026-02-14T13:02:17.435179"
}