{
  "article_id": "adddbe37e35d",
  "url": "https://www.centralwesterndaily.com.au/story/8158776/signings-predictions-and-why-your-team-can-win-the-title-2023-peter-mcdonald-premiership-preview/?cs=103",
  "title": "Your complete 2023 Peter McDonald Premiership preview | Central Western Daily",
  "date": "20230414T060000Z",
  "domain": "centralwesterndaily.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Footy is back.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Peter McDonald Premiership begins in earnest this weekend and there's 12 teams vying for the title of best in the west.\nLast year's inaugural western-wide competition was a huge hit and after a number of big off-season signings there's the usual excitement and high expectations at each and every club.\nThe Forbes Magpies were the premiers last season, but who's the one to beat this year? Here's the view of your region's ACM reporters.\nGROUP 11 POOL\nDUBBO CYMS\nLast year finish: Grand finalists\nCoach: Shawn Townsend\nSignings: Claude Gordon (Bathurst Panthers), Chanse Burgess (Dunedoo Swans), Jye Day (Queanbeyan United)\nLosses: Brydon Ramien (Woy Woy), Fletcher Haycock (Penrith Panthers), Riley Wake (Penrith Panthers), Cooper Ferrari (Penrith Panthers), Luke Jenkins (retired)\nWhy they win the title: They were the most consistent team across 2022, only losing two matches all year. They just happened to their first and last games.\nA heartbreaking loss to Forbes in the grand final will no doubt still be stinging for the Fishies, a team who will be itching to take out the title.\nThe squad has changed a bit but there's star power throughout and Jeremy Thurston looks primed to take the mantle as the best player in western, if he hasn't already.\nWhy they will fall short: It's happened before.\nDubbo CYMS have a habit of making grand finals and not getting over the line. The Fishies have played in each of the past eight grand finals but have only won three. That could be a statistic which could come back to haunt them again.\nPlayer to watch: Kyjuan Crawford. He's earned rave reviews from his coach throughout pre-season and after working on his fitness and skills he's set to make the move from reserve grade to regular first grader.\nHe'll offer versatility - can play in the centres, the halves or back row - and has been described as the type of player who's just hard to tackle.\nQuote: \"I don't know what my mindset was. I don't know whether it was the loss last year and it just made me think we need to be bigger, better, tougher and stronger for longer periods.\"\nThat's coach Shawn Townsend on his intense pre-season campaign. If the coach at CYMS says it's been a big off-season then you know it's really something as the Fishies focus on fitness and high standards more than most already.\nPredicted finish: Second\nFORBES MAGPIES\nLast year finish: Premiers\nCaptain-coach: Nick Greenhalgh and Mitch Andrews\nSignings: Pio Seci (Manly Sea Eagles), Epeli Ulianavucu (Fiji), Nikola Sovatabua (Fiji), Tom Caldwell (Kotara), Alex McMillan (Orange CYMS)\nLosses: Jake Grace (retired), Ben Maguire, Jake Haddrill (Condobolin Rams), Alvin Maungaati (Corrimal)\nWhy they win the title: Know-how.\nForbes have won three titles in the seven seasons. They haven't won a minor premiership in that time but they just know what to do at finals time.\nThey've got Mitch Andrews and Nick Greenhalgh - proven performers and Western representatives - in key positions and they've added a couple of intriguing signings to the mix.\nWhy the will fall short: They have lost a lot of experience.\nJake Grace has retired the same goes for Ben Maguire, Jake Haddril has moved back to the Condobolin Rams while Brad McMillan, at this stage, is focused on coaching the under 18s.\nAll those players were vital parts of the forward pack last season and leave a huge hole.\nPlayer to watch: Tom Caldwell\nForbes won the premiership last season but the five-eighth from that campaign - Jordan Hartwig - missed out on a place in round one this year due to the arrival of Caldwell. That says a lot.\nGreenhalgh is excited to have Caldwell onboard and his versatility will be a real weapon this season. He could play in either of the halves positions, at hooker or could act as a bench utility.\nGiven the spine is otherwise the same this season, Caldwell can be a bit of a surprise factor for the Magpies.\nQuote: \"The foundations are there for something special again, that's for sure ... we'll welcome some guys back and some big names and fighting spots will be key for us. We're really excited about what this side can do.\"\nNick Greenhalgh on the belief in Forbes after the off-season changes. It's business as usual at the Magpies.\nPredicted finish: Seventh\nMACQUARIE RAIDERS\nLast year finish: Eliminated week one of finals\nCaptain-coach: Alex Ronayne and Jack Kavanagh\nSignings: Jack Kavanagh (Shellharbour Sharks), Billy Gilbert (Newcastle Knights), Richie Peckham (Wellington Cowboys), Wade Peachey (Wellington Cowboys), Zeke Heterick (Narromine Jets)\nLosses: Josh Merritt (Nyngan Tigers), Blake Merritt (Canterbury Bulldogs), Clayton Couley (Albury Thunder), Corey Cox (Nyngan Tigers), Jai Merritt (Wellington Cowboys), Brandon Hamilton (South Newcastle)\nWhy they win the title: They've got one of the best forward packs in the competition, one of the current Western captains plus a pair of lower grade players from Sydney and Queensland.\nIf Macquarie's forward pack has a massive year and their backs are solid, there is no reason why the Raiders can't win it all.\nWhy they will fall short: Halves depth. The Raiders have gone from having three strong starting halves in 2022 to just one.\nFilisone Pauta will get the nod at five-eighth to start the season but the majority of organising the side looks to fall on Harry Kempston's shoulders, a big ask for one player with limited first grade experience to take on.\nPlayer to watch: Billy Gilbert. The former QLD Cup player comes to Dubbo with a big wrap on him and looks to be vital for the Raiders.\nComing from the highly-competitive Newcastle first grade competition, Gilbert's ability to play at hooker or lock will provide a playmaker in the middle of the field for the Raiders, making their forward pack even more dangerous.\nQuote: \"I think that's where our strength comes from as well. We've got a very strong, fast and mobile forward pack. In my opinion, we have got the best forward pack in the comp.\"\nRaiders co-captain/coach Jack Kavanagh has all the faith in his group of forwards, rating them as highly as anyone in the competition.\nPredicted finish: Fourth\nNYNGAN TIGERS\nLast year finish: Fifth (Group 11 pool)\nCaptain-coach: James Tuitahi\nSignings: Josh Merritt (Macquarie Raiders), Corey Cox (Macquarie Raiders), James Tuitahi (Mounties), Mason Williams (Wellington Cowboys), Loma Atuau (Cobar Roosters), Kiyan Shaw (Peak Hill Roosters)\nLosses: Jyde Dwyer (Brighton Roosters), Tyrone Tattersall (Wellington Cowboys)\nWhy they win the title: A host of new signings and some of the best supporters in the bush. Nyngan has revamped its side over the off-season with premiership winners like Josh Merritt, Corey Cox and Mason Williams joining the side.\nAdd in former NSW Cup player James Tuitahi as captain-coach and this Nyngan side has the potential to get some early wins, build momentum and then ride a wave of black and gold support through to September.\nWhy the will fall short: Tuitahi will miss roughly the first eight weeks of the season due to a pectoral injury and that's a big blow. A calm and positive influence, it seemed he was poised to keep some of the fiery characters in the Tigers side in check on the field.\nThe Tigers had a bit of an issue with discipline last season - they may say a lot seemed unfair and maybe it was - but nevertheless, composure will be key. As will maintaining fitness in the forward pack, there doesn't seem to be a huge amount of depth there.\nPlayer to watch: Josh Merritt. The obvious choice is sometimes the right choice.\nSimply, he's one of the best playmakers in the western area and that's some Nyngan missed for a lot of last season.\nAfter a season back at Macquarie, Merritt has returned to Nyngan to fill the void he left after departing the club following the 2021 season.\nIf he can build-up a connection with the likes of Williams and Jak Jeffery and stay composed and not spend too much time in the sin-bin or sideline then the Tigers can take a huge leap forward this year.\nQuote: \"There's passion for rugby league here. It gives me more purpose to do well.\"\nCaptain-coach James Tuitahi felt that huge one-team town support for the Tigers shortly after arriving at Nyngan. He knows how much rugby league means to the community and Larkin Oval will be the place to be if the side gets on a roll this year.\nPredicted finish: Ninth\nPARKES SPACEMEN\nLast year finish: Eliminated week two of finals\nCaptain-coach: Chad Porter\nSignings: Jack Buchanan (Cowra Magpies), Jake Dooley (Souths Newcastle), Rex Yallon (Tully Rugby League), Takitau Mapapalangi, Moni Mapapalangi.\nLosses: Sam Dwyer (Wests Devils), Jordan Pope (Newcastle), Jack Creith (retired), Benny Cokanasiga (Dunedoo Swans)\nWhy they win the title: It didn't seem possible a few months ago when Parkes were without a captain-coach and had lost some of their stars. But with Chad Porter in the top job and a host of new arrivals creating real excitement in the club and town, things are looking up.\nIt's also fair to say the last time Parkes had a forward pack looking this strong they were a Group 11 premiership-winning outfit.\nWhy the will fall short: Parkes have had the unwanted habit of making finals and then bowing out relatively quickly in recent years. They've been among the best sides in Group 11 each season for most of the past decade but a title hasn't been won since 2013 and they haven't made a grand final since 2015.\nThere needs to be the belief they can go all the way this season.\nPlayer to watch: Takitau Mapapalangi. If this prop is as good as some of the whispers from Parkes say he is then we're in for something special.\nNot a great deal is known about Mapapalangi but the NRL Victoria representative player of the year for 2022 can punch out big minutes and make a real impact alongside fellow prop Jack Buchanan then the Spacemen are well on their way to success.\nQuote: \"I think a lot of people wrote us off when we lost a few boys but we've got some boys there who are as good, if not better.\"\nThat's the view of captain-coach Porter, who's all too aware of what people were saying about his club during the off-season.\nPredicted finish: Sixth\nWELLINGTON COWBOYS\nLast year finish: Last in Group 11 pool\nCaptain-coach: Justin Toomey-White\nSignings: Rylee Blackhall (Yass Magpies), Jai Merritt (Macquarie Raiders), Tyrone Tattersall (Nyngan Tigers), Preston Simpson, Logan Conn\nLosses: Richie Peckham (Macquarie Raiders), Wade Peachey (Macquarie Raiders), Mason Williams (Nyngan Tigers)\nWhy they can win the comp: It's a huge ask but there is some optimism around the Cowboys this season and they're expected to make some strides forward after attracting some new faces.\nAny side with Justin Toomey-White leading the charge can be a threat and there's always a huge amount of passion and support in the close-knit community.\nThe Cowboys should win more games this year than they did in 2022 but reaching the finals seems a huge ask.\nWhy they will fall short: Experience. The Cowboys have got a few players who have played representative football in the past but they lack the star power of a lot of other sides in the competition.\nPlayer to watch: Rylee Blackhall is the obvious choice here. The star playmaker will return home in 2023 to his junior club and will likely take one of the starting halves spots for round one.\nBlackhall was a standout for the Western Rams during his junior days and earned experience with the Penrith Panthers and Wests Tigers before spending last season with the Yass Magpies.\nQuote: \"We've got a young side but we've got some older boys around them, it's something to look forward to.\"\nIt might not quite be \"we're going to win the competition\" but that statement from captain-coach Justin Toomey-White means a lot. The younger players in the side now have experience in first grade and there's more depth in the squad. Things seem positive at Kennard Park.\nPredicted finish: Twelfth\nGROUP 10 POOL\nBATHURST PANTHERS\nLast year finish: Eliminated week two of finals\nCaptain-coach: Jake Betts\nSignings: Tye Siakisoni (St Pat's), Andrew Bennett (CSU Mungoes), Jackson Vallis (St Pat's), Michael Latu (CSU Mungoes), Nic Tilburg (Wentworthville), Zac Hunt (CSU Mungoes), Doug Hewitt (returning).\nLosses: Willie Wright (St Pat's), Noah Griffiths (St Pat's), Keelan Bresac (Lithgow Workies Wolves), Kevin Large (Lithgow Workies Wolves), Lachlan Large (Lithgow Workies Wolves), Aidan Ryan (Windsor Wolves).\nWhy they can win the title: There were plenty of question marks hanging over Panthers during the pre-season following a player exodus, but that may now work to their advantage.\nThe men in black enter the season without a whole lot of hype, but that also means there won't be a whole lot of pressure and could mean rivals underestimate them.\nThe likes of Josh Rivett, the Betts brothers and Doug Hewitt all have Group 10 premierships on the resumes, while Zac Hunt and Mick Latu won a grand final as Mungoes.\nAnd yes Dave Sellers we didn't forget you - the prop won the Mid West Cup with Oberon in 2021.\nPanthers won their pre-season knockout when other Group 10-based clubs were rated a better chance and hey, everyone loves an underdogs story.\nWhy they will fall short: While Panthers will have plenty of youthful enthusiasm this season, there are question marks as to how those less experienced players will fare come crunch games.\nIt was a big boost for Panthers to have signed Doug Hewitt, but the former premiership winning captain-coach won't always be there to guide the side around.\nThe halfback has made it clear his harness racing commitments will come first.\nThere will no doubt be other unavailability and injury issues to deal with during the season and if it happens to be one of Panthers experienced men that go down, it could hurt.\nPlayer to watch: Zac Hunt.\nYes Panthers have got former premiership winning captain-coach Doug Hewitt back and a player who has represented Italy in Nick Tilburg alongside him in the halves, but they are threats everyone is well aware of.\nSecond rower Zac Hunt is a player who could be just as damaging for Panthers this season. He's mobile, he's agile and to rivals he's hostile.\nA former Panthers junior, Hunt has returned to the club after a stint with CSU Mungoes. He not only won a premiership with the university side, but was fearless in the face of forward packs which held significant size advantages.\nThe quote: \"I think you take the two halves out of any team and they are going to struggle, but we're not, we've got blokes back who have been around our club before and had been part of our junior system at the club.\"\nBathurst Panthers president Dave Hotham isn't rattled after an off-season exodus led to some supporters calling for him to stand down.\nPredicted finish: Eighth\nBATHURST ST PAT'S\nLast year finish: Eliminated week one of finals\nCaptain-coach: Zac Merritt\nSignings: Willie Wright (Bathurst Panthers), Noah Griffiths (Bathurst Panthers), Tyrese Edwards (Lakes United), Leroy Murray (Narrabri Blues), Ash Cosgrove (Penrith Panthers), Harry Reicher (Albury Thunder)\nLosses: Tye Siakisoni (Bathurst Panthers), Mitchell Squire (Port Macquarie Sharks), Kyle Mawhinney (Orange Hawks), Jackson Vallis (Bathurst Panthers), Blake Fitzpatrick (Oberon), Lee McClintock.\nWhy they can win the title: Because the 2023 Saints are spine tingling.\nNot only do they have last season's Group 10 player of the year Hayden Bolman at hooker and shifted proven weapon Jackson Brien to fullback to give him more space to attack, the Saints also have a new classy halves pairing.\nWillie Wright is one of those players that certainly brings the x-factor while Noah Griffiths - well he was once dubbed 'the next Cooper Cronk'.\nIt's a formidable spine and one which has a legitimate claim on being the best in the PMP.\nWhy they will fall short: As electric as some of the Saints players can be, they've also been prone to blackouts.\nWe've seen the Saints lead and look like they are going to blow teams away, but then that intensity disappears as fast as a West Tigers fan who said 2023 would be their year.\nEven when the Saints played their first game of finals footy since 2016 last year, they couldn't maintain effort for the entire contest.\n\"We've been in every game we've played this year but at times we've just turned off.\" That came from Merritt's own mouth.\nPlayer to watch: Ash Cosgrove\nAsh Cosgrove is player who collects premierships like others collect super hero comic books - he's got heaps of them and the stories are epic.\nHe won five grand finals as he rose through the junior ranks with the Saints and already this year he's added another when playing in the Western under 21s.\nCosgrove, who was named player of that successful under 21s final, returns to the Saints this season after a stint with Penrith.\nHe's quick, he's strong and he's versatile - Merritt has the option of playing him in centres, at fullback or on the wing.\nThe quote: \"Jackson Brien is going back to fullback, we've got the best hooker in the group and possibly the two best halves in the group as well. Which is exciting. I think we'll have the best spine in the Peter McDonald Premiership.\"\nSt Pat's captain-coach Zac Merritt certainly is a big fan of his new-look side. After making a number of signings, there's some expectations around the side this year.\nPredicted finish: Third\nLITHGOW WORKIES WOLVES\nLast year finish: Last in Group 10 pool\nCaptain-coaches: Jack Sullivan, Kyle Willmott.\nSignings: Keelan Bresac (Bathurst Panthers), Kevin Large (Bathurst Panthers), Lachlan Large (Bathurst Panthers), Tom Large (Bathurst Panthers), Jake Gale (Mudgee Dragons), Dylan Miles (Bathurst Panthers), Jayson Moon (The Oakes), Daniel Anderson (Wallaby RLFC)\nLosses: Isaac Thompson (St Marys), Tui Oloapu (Warwick RLFC), Greg Alderson (Emu Plains), Michael Barnett (Lower Blue Mountains)\nWhy they can win the title: They only managed to post two wins last season and there's no doubt that Lithgow are underdogs again in 2023.\nBut what Workies does have on its side is the 'no-one expects the Spanish inquisition' factor.\nPeople not expecting Workies to win might be exactly what helps them to do so. Underestimate them or think you'll have it easy, then the Wolf pack can bite.\nWorkies have signed a number of up-and-coming players this season and they won't be lacking in enthusiasm.\nCo-coach Jack Sullivan, a former Shute Shield player, only saw limited minutes last season but is now fully fit are hungry to fire at halfback.\nThrow in the likes of Western representative Keelan Bresac at fullback and Jake Gale at hooker - the duo returning to Lithgow this season - and there's some talent in the spine.\nWhy they will fall short: While Workies have lured a number of former players back to the Wolf's lair this season, there is still a big question mark over depth.\nWhile their full strength starting side is handy, Workies don't have the weapons to deploy off the bench that other sides do.\nIf you then factor in the inevitable injuries or people being unavailable and Workies will struggle.\nPlayer to watch: Keelan Bresac\nHe's home - star back and Western Rams representative Keelan Bresac has returned to Lithgow this season and he's unquestionably their biggest signing.\nHe's a player that is a massive threat in broken play and at fullback you can expect Bresac to be one of Workies biggest metre earners.\nHe will be to Lithgow what Dylan Edwards is to the Penrith Panthers.\nThe quote: \"We're trying to bring back that hard Lithgow mentality, back to the days where Lithgow were feared and known as a tough team.\"\nCo-coach Jack Sullivan knows what made Lithgow a force in the past. Tony Luchetti Sportsground was once a fortress and if Workies can get back to that kind of level, look out.\nPredicted finish: Eleventh\nMUDGEE DRAGONS\nLast year finish: Eliminated in semi-finals\nCaptain-coach: Clay Priest\nSignings: Alex Sutherland (Albion Park), Jayden Brown (Canowindra Tigers), James Goonery (Parkes).\nLosses: Tom Shearman (Dunedoo Sawns), Jake Gale (Lithgow Workies)\nWhy they win the title: A settled and consistent side, one of the best forward packs in the competition, and two former NRL players in key spots.\nThere's a lot to like about the Mudgee this year and ask around the majority of rival clubs and they'll tell you the Dragons are the favourites for the title. Injury and suspension probably cost them a spot in the grand final last year and it seems that could be the only thing which stops them again this winter.\nWhy the will fall short: It's hard to single out too many weaknesses but the decision to move former NRL half Jack Littlejohn to fullback in round one seemed an interesting choice. Are they making things too hard for themselves?\nLittlejohn also suffered an injury that match and if he or Priest have fitness issues it would be a concern, too.\nPriest is also notoriously one of the more fiery characters in the region - as seen in the Western Rams' recent representative clash with Newcastle - and keeping him controlled and on the field is key to the Dragons' success.\nPlayer to watch: Jayden Brown\nYes, there's bigger names in the side but Brown could be one of the few additions which helps Mudgee take that all-important next step this season.\nA former Woodbridge Cup player of the year, Brown has had a season with the Dragons previously and is back in red and white this season. He provides real versatility in the backline and, despite only kicking one successful conversion in round one, his goal-kicking helps too.\nThe quote: \"It was obviously disappointing to go down to them the way we did ... it was pretty hard to swallow but a long season too.\n\"You've got to be ready and on it from the get go, (in saying that) you don't win finals at the start of the year either but hopefully we can go a bit better.\"\nClay Priest is certainly driven by last season's semi-final defeat. There's motivation in Mudgee town this season.\nPredicted finish: First\nORANGE CYMS\nLast year finish: Eliminated in semi-final.\nSignings: Isaac Cardwell (Cargo Blue Heelers), Josh Hart (Coogee), Mitch Evers, Heath Phillips (England)\nLosses: Jay Mawhinney (Hawks), Daniel Mortimer (retired), Ethan Bereyne (Orange United), Alex McMillan, Lachie Munro (Albury Thunder) and Joe Lasagavibau (Manildra Rhinos).\nWhy they can win the title: CYMS will find themselves in unfamiliar territory this season, going into the year as underdogs.\nHaving just fallen short of reaching the inaugural Peter McDonald Premiership grand final in 2022, the green and golds will have a new look outfit hoping to go one step further this time around.\nBut with plenty of big name losses over the off-season, that it going to be tricky. One thing they do have going in their favour is that unfamiliarity. With a new halves pairing in the mix, they could use that surprise factor to their advantage.\nWhy they will fall short: Player numbers and availability come to mind as the biggest issues facing CYMS...that and losing an NRL premiership winning star to retirement.\nThe talk around town is CYMS are going to struggle mightily this season and it's hard to see a world where they crack the finals. With such strong competition, CYMS' draw looks like tough contest after tough contest and that wears on the body fast. If reports are correct and there's a shortage of players in green and gold, it might not be long until they start to see some cracks forming.\nPlayer to watch: The obvious player to pick here would be halves signing Mitch Evers, but we're going to look instead to Josh Hart.\nThe centre has come across from the Coogee Dolphins this season and impressed right from the jump.\nAlthough he is quick on his feet, he doesn't back down when defending either...something CYMS might be doing a lot of this season.\nThe quote: \"It's going to be about effort, if someone signs for a certain amount a game they're not automatically going to be in the side, it's going to be about who's performing at training and giving effort.\"\nWhat stands out about this is, for a team projected to not do that great, will the coach stick to his word if star players are underperforming or lacking effort? If so, it might see them struggle even more, but the last thing he'll want is to look scared to stamp his authority. A tricky decision either way, but one we're certainly going to keep an eye on.\nPredicted finish: Tenth\nORANGE HAWKS\nLast year finish: Fifth in Group 10 pool\nCoach: Shane Rodney\nCaptain: Nathan Potts\nSignings: Jye Barrow (Molong Bulls), Kade Barrow (Molong Bulls), Joseph Singura (Hay), Kyle Mawhinney (Bathurst St Pat's), Adam Hart (Central Newcastle), Jay Mawhinney (Orange CYMS), Nathan Swain (retirement), Scott Rosser (Coogee Dolphins), Joe Coady (CSU Mungoes), Ben French (Orange United Warriors)\nLosses: Waqasaqa Qiolevu (Fiji), Ethan McKellar (Orange CYMS)\nWhy they can win the comp: The Hawks have brought in a stack of talent and lost hardly any of their key players from 2022...that's usually a recipe for success.\nAfter turning a few heads to start last year, the Hawks quickly stepped off the gas pedal and missed the finals altogether. You would be a brave soul to say they'll miss out on the post-season two seasons running.\nLed by a former G10 player of the year in Nathan Potts, it will be the Hawks' consistency that will see them over the line this season.\nWhy they will fall short: A playing group that has already under-performed once and a tough start to the season on the schedule.\nIt's all well and good to bring in a bunch of fresh faces and expect things to turn around right away, but that's not always the case.\nWith expectations high for 2023, Hawks will need to get off to a strong start...just so that their heads don't drop right from the get-go.\nWith away games against Parkes and Nyngan first up, before matches against Lithgow (home), Mudgee (home) and Panthers (away), if Hawks could find themselves with just one or two victories after five rounds. If that were to happen, they could find themselves in a deep hole to dig themselves out of.\nPlayer to watch: In what will hopefully be one of the feel-good stories of the year, young Lachie Lawson is returning to the fold after he suffered a season-ending neck injury in round 4 of 2022.\nThe 18-year-old centre has worked hard in his rehab and has looked confident throughout the pre-season, probably the biggest thing for any player coming back from injury.\nHawks really missed his defence out wide last year and coach Shane Rodney is looking forward to having Lawson back on the field.\nThe quote: \"Injuries are part of (a season), everyone understands that but we probably lacked a little bit of depth and player numbers when that came about.\"\nHe knows - as do most - that injuries were probably the thing keeping Hawks from a finals spot. As previously noted, they have loaded up on recruits this off-season, which means they aren't just talking the talk in bringing depth to the club, they are walking the walk.\nHow good will those players be in and when the injury bug bites and they are called upon to perform? We'll have to wait and see, but it's always better to have more than less.\nPredicted finish: Fifth\nLADDER PREDICTION\n- Mudgee Dragons\n- Dubbo CYMS\n- Bathurst St Pat's\n- Macquarie Raiders\n- Orange Hawks\n- Parkes Spacemen\n- Forbes Magpies\n- Bathurst Panthers\n- Nyngan Tigers\n- Orange CYMS\n- Lithgow Workies Wolves\n- Wellington Cowboys\nReading this on mobile web? Download our news app. It's faster, easier to read and we'll send you alerts for breaking news as it happens.\nDownload in the Apple Store or Google Play.",
  "word_count": 4721,
  "scraped_at": "2026-02-14T12:39:43.573732"
}