{
  "article_id": "ae0ed1c25406",
  "url": "https://www.psu.edu/news/bellisario-college-communications/story/penn-state-communications-students-anticipate-appreciate",
  "title": "Penn State communications students anticipate , appreciate Super Bowl opportunity",
  "date": "20260203T001500Z",
  "domain": "psu.edu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "UNIVERSITY PARK, Pa. — Not long ago, they were seven aspiring, hopeful students from a half dozen states who showed up at Penn State intending to make the most of college.\nHonestly, they were not sure what that meant, they said. But they were ambitions and determined. They went to class, got over any hesitation or uncertainty and got involved beyond the classroom as they sought out opportunities to improve.\nThey made the most of their chances, made some mistakes, enjoyed valuable successes and completed internships or real-life experiences that helped them build a strong foundation for future success.\nThis week those students, all seniors in the Donald P. Bellisario Communications, are in the same place. They’re working at the Super Bowl in Santa Clara, California.\nAssociated Press partnership\nFour students are working with the Associated Press as part of a partnership model that Penn State, through the John Curley Center for Sports Journalism, has utilized at previous Super Bowls, as well as the Little League World Series, Paralympic Games and Women’s World Cup.\nThe students — Lyle Alenstein, Avery Hill, Giselle Jones and Cailey Thalman — will support AP efforts throughout the week. They’ll focus on feature stories, individual interviews and social media content from media availabilities leading up to the Feb. 8 game between the New England Patriots and Seattle Seahawks.\nAlenstein, from Briarcliff Manor, New York, was not planning to major in communications when he arrived at Penn State, he said. He only lasted a couple semesters as a potential accounting major, before finding a passion for communications.\nHis numerous internships have included spots with the Cape Cod Baseball League and the Pittsburgh Post-Gazette, and he has steadily earned additional responsibility as a sports reporter, football reporter and wrestling editor with the Daily Collegian.\n“We’ll be working at the Super Bowl, helping the Associated Press. It’s hard to imagine anything much better than that,” Alenstein said. “So, we want to make the most of it.”\nHill, from Suitland, Maryland, serves as an editor with the Collegian as well, and has an abundance of experience covering Penn State sports. He’s completed several internships, including one with the Providence Journal last summer, and traveled to cover the Paralympics in Paris in 2024. He’s also president of the on-campus chapter of the National Association of Black Journalists.\nThe Journal, based in Rhode Island, regularly covers the Patriots, so Hill enters this week with familiarity of the team and with journalists he worked with last summer who will be on site this week as well. All his previous experiences have him feeling good about what’s ahead, he said — much more so than when he first stepped onto campus four years ago.\n“It’s a big opportunity, but I definitely feel less stressed about it because of the other opportunities up to this point,” said Hill, who has earned a Collegian AIG Scholarship and the Donald P. Bellisario College of Communications Scholarship and Student Support Endowment. “I know I have a lot to learn but all the things during my Penn State career have been a confidence booster.”\nJones, from York, Pennsylvania, said she calls herself an extrovert and her mother tells people her daughter started talking at 11 months old and has not stopped. With that as a grounding, Jones has focused on honing her skillset and at the same time consistently made connections to grow once she settled on her journalism major and, ideally, a front-facing role on TV someday.\nShe first found the student produced “Culture Central” as a campus outlet and has subsequently earned opportunities with B1G+, ESPN+ and ROAR+ while covering a variety of Penn State sports. Last summer she completed an internship with the Kansas City Chiefs during the team’s training camp.\n“That experience helps a little big going into the Super Bowl, even if it was different than what we’ll be doing,” Jones said. “We’re prepared, but you also never know what will happen so having a variety of experiences, and learning from them is a good thing. I do try to push myself to improve, even to be uncomfortable, because you can learn from those situations.”",
  "word_count": 692,
  "scraped_at": "2026-02-14T12:38:22.828073"
}