{
  "article_id": "ae43fc38ec75",
  "url": "https://metro.co.uk/2025/09/21/strictlys-karen-carney-reveals-wardrobe-mishap-left-stuck-four-hours-24223853/",
  "title": "Strictly Karen Carney reveals mishap that left her stuck for  four hours  ",
  "date": "20250921T164500Z",
  "domain": "metro.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Sorry, this video isn't available any more.\nStrictly Come Dancing star Karen Carney has revealed how she was left stuck ‘for four hours’ after a wardrobe mishap.\nThe 38-year-old former professional footballer made an appearance on Channel 4’s Sunday Brunch following the launch of the beloved BBC programme on Saturday night.\nHosted by presenters Tim Lovejoy and Simon Rimmer, the pundit discussed how mesmerising it was to watch the pre-recorded episode.\nHowever, after being asked about her sporting background and competitiveness, Karen revealed one of the biggest challenges she is facing.\nGet personalised updates on Strictly\nWake up to find news on your TV shows in your inbox every morning with Metro’s TV Newsletter.\nSign up to our newsletter and then select your show in the link we’ll send you so we can get TV news tailored to you.\nThe series has always featured beautiful costume designs and set pieces, but dancing and rehearsing in high-heels is proving to be painsome.\n‘[The heels are] meant to be “easy release”, allegedly. They weren’t!’, Karen said.\n‘It was hooked in the wrong hole and I got stuck in them for four hours, because I genuinely couldn’t get them off.\n‘I was sweating, getting more anxious, there was no one around to try and help me.’\nShe continued: ‘So, I just ended up going, I’ll just stay in them and I’ll come back to it later. I was doing the hoovering, doing some breakfast, doing some emails.\n‘Then, about four hours later, I took a deep breath and got out of them. It was quite stressful.’\nKaren was the 14th celebrity to be announced for the new series of Strictly Come Dancing, and she has been paired with Carlos, who was benched from the last edition of the show.\nThis was despite Carlos finishing as a runner-up in 2023, dancing with Molly Rainford, and then finishing sixth with Angela Scanlon in the 2024 series.\nKaren was revealed as a Strictly contestant for this year on Vernon Kay’s BBC Radio 2 show, which was guest-hosted by Gary Davies on the day she was announced.\nThe new BBC dancing star is a former footballer who is now the lead female pundit for both men’s and women’s football, across TNT and ITV.\nOn joining Strictly Come Dancing, Karen said in a press release: ‘It really is a dream come true to be a part of this year’s Strictly Come Dancing line-up.\n‘I’m such a huge fan of the show, and I can’t believe I’m finally getting the chance to take part. I’m so excited to meet everyone and get dancing!’\nOther contestants in this year’s Strictly include Danni Dyer, Vicky Pattison, and Thomas Skinner, with the latter recently taking to social media with a lengthy rant about being ‘kicked down’ in recent weeks.\nMore Trending\nSkinner has long voiced his political views on social media, and was pictured at a barbecue and beers with JD Vance just before the Strictly announcement.\nHe also recently confessed to cheating on his wife just weeks after they married in 2022 and he apologised for storming out of a Strictly press conference after spotting some ‘messages about his personal story’ on a journalist’s phone.\n‘Life ain’t easy. I’ve been kicked down and called every name under the sun recently and probably some of it I deserve, as yes I ain’t always right,’ Skinner said in a new lengthy new social media post.’\nDeals of the Day\n-\nThe Traitors is over – but Claudia Winkleman’s shoes are everywhere\n-\nCraving sun, city streets or theme parks holdays? This £99 mystery deal has it all\n-\nThis easy concealer trick transformed how my makeup looks and lasts all day\n-\nTour Emily in Paris Season 6 Rome hotspots with a getaway from just £79pp\n-\n11 of the best expert-approved running shoes to buy now\nThe next episode of Strictly Come Dancing: BBC One is on September 27.\nGot a story?\nIf you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you.\nMORE: Strictly’s Stacey Dooley tearfully reveals ectopic pregnancy requiring urgent surgery\nMORE: Dragons’ Den star turned £60,000 investment into £36,000,000 business empire\nMORE: When does Celebrity Traitors 2025 start? Everything we know, from launch date to cast",
  "word_count": 736,
  "scraped_at": "2026-02-14T14:17:51.712836"
}