{
  "article_id": "ae52e0f69029",
  "url": "https://www.canberratimes.com.au/story/8926606/matildas-return-to-canberra-for-sam-kerrs-potential-comeback/?cs=14329",
  "title": "Matildas return to Canberra for Sam Kerr potential comeback | The Canberra Times",
  "date": "20250326T224500Z",
  "domain": "canberratimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Matildas will return to Canberra Stadium for the first time in three years, with officials confident a June blockbuster can sell out and potentially stage a Sam Kerr comeback.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe ACT government and Football Australia will confirm the deal on Thursday morning, with the Matildas to face Argentina in Canberra on June 2 to round out a two-game series on the road to next year's AFC Women's Asian Cup in Australia.\nThe deal to play in Canberra brushes off concern the ACT would be priced out of the market by states with bigger budgets following the Matildas' emergence as one of the biggest drawcards in Australian sport.\nFootball Australia officials see value in hosting internationals in Canberra, due to the political doors it can open and an impressive turnout for a Socceroos fixture at Canberra Stadium last year, when 25,023 watched a clash with Lebanon on less than four weeks' notice.\nThe ACT government struck the deal after turning its attention to securing one-off fixtures with Australia's national teams rather than spending big on World Cup games between minnow nations.\nThe decision sparked fierce debate in the fallout of the FIFA Women's World Cup in 2023 and the announcement of host cities for the 2027 Rugby World Cup, but government officials are backing their approach to pay off.\nThe Matildas will be the second national team to play in Canberra in the space of two weeks during what could be Sam Kerr's comeback series, with rugby union's Wallaroos to play the USA - featuring one of the game's most marketable stars in Ilona Maher - at Canberra Stadium on May 17.\n\"With just under one year to go until the AFC Women's Asian Cup 2026 at home, we are committed to continuing to seek out opponents that present a diversity of styles and footballing cultures to give the Matildas the opportunity to build and ensure they are peaking come tournament time,\" Football Australia chief executive James Johnson said.\n\"With the FIFA Women's World Cup in 2027 set for South America, we are delighted to secure Argentina, one of the top South American nations and who featured at the FIFA Women's World Cup 2023. They and their supporters bring a unique energy and passion for the game, and these matches will help us refine our approach heading into a tournament that will also serve as a Women's World Cup qualifier.\n\"Returning to Canberra is always special, and we are excited to bring the Matildas back to the nation's capital after three years. We remain committed to ensuring that football fans across Australia have the chance to witness their national team in action.\"\nMORE SPORT:\nThe potential return of Kerr - who has not played for the Matildas since 2023 and spent recent months embroiled in off-field controversy - could be a major incentive for fans to snap up tickets.\nThe Chelsea star has been ruled out of Australia's looming games against South Korea, but supporters will cling to hope she returns during the Argentina series as ACT Deputy Chief Minister Yvette Berry urges fans to secure their tickets in the hope of selling out Canberra Stadium.\n\"I'm proud to welcome the Matildas back to Canberra and provide another opportunity to showcase our city to the world,\" Berry said.\nWe have been supporting the Matildas for a long time and it's great to host them in what will be an important game against Argentina as they prepare for the AFC Women's Asian Cup 2026.\"\nFootball Australia account holders can purchase tickets from March 31, with tickets on sale to the general public on April 1.",
  "word_count": 614,
  "scraped_at": "2026-02-14T12:34:38.247218"
}