{
  "article_id": "ae71df6c8854",
  "url": "https://www.liverpoolfc.com/news/matt-beard-fa-cup-win-brighton-clash-and-kiernan-getting-stronger",
  "title": "Matt Beard on FA Cup win , Brighton clash and Kiernan getting stronger",
  "date": "20240215T120000Z",
  "domain": "liverpoolfc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "ColumnMatt Beard on FA Cup win, Brighton clash and Kiernan getting stronger\nIn his latest column, Liverpool FC Women manager Matt Beard reflects on the Adobe Women’s FA Cup win over London City Lionesses and previews Sunday’s trip to Brighton & Hove Albion in the Barclays Women’s Super League.\nIt was a pleasing performance from us on Sunday and it was great to reach the quarter-finals of the Women’s FA Cup.\nI want to give a special mention to the groundsman. I was speaking with him before the game and he told me it was the 50th game on that pitch this season!\nObviously we saw their game on Wednesday was postponed due to a waterlogged pitch so he deserves a lot of credit for how the pitch was, and I felt we played some good stuff.\nIt was important we progressed in this competition. It was a tricky tie, especially with their manager leaving earlier in the week and also the experience they have in their squad.\nI thought the girls were professional, I thought the performance was professional and we were worthy winners.\nYou have to accept cookies in order to view this content on our site.\nWatch on YouTubeSophie Roman Haug got our first goal, which was her first one this calendar year and I think that was important for her.\nThe assist was fantastic as well and it just shows what Sophie brings to this team because whenever that ball comes into the box and she meets it with her head, then nine times out of 10 she is going to be scoring goals, so I was really pleased for her.\nIt was a great finish from Mel Lawley for the second, in off the underside of the bar.\nIt was a well-worked goal and it’s something we have been working on with Sophie winning those aerial duels, so it was great for that to come off and what a finish from Mel.\nLeanne Kiernan came on and got more valuable minutes in the tank. I think after probably one more week she will be ready to start games. We are just taking it week by week with her.\nThe impact she is having from the bench is fantastic and it will be a great headache for me when she is fit to start games.\nIt was nice to get a home draw in the FA Cup against Leicester City and it’s an exciting tie to look forward to.\nIt will be a tough game as we’ve had some tough games against Leicester in recent years, but we are at home in front of our supporters and hopefully we can use home advantage and get through to the semi-finals.\nI’ve always said we want to do well in the cup competitions this season and we want to go as far as we can.\nOn Sunday we face another long trip when we head to Brighton & Hove Albion in the WSL (kick-off 12pm GMT at Broadfield Stadium).\nIt’s going to be a tough test. Mikey Harris has come in and steadied the ship, he knows the club, and my brother actually worked with him on the boys’ academy side so he is a good coach.\nBrighton play good football and there are no easy games in the WSL, as I say all the time. We’ve just got to make sure we are on our game because whenever we are we give ourselves a great chance of picking points up.\nWe’ve had some great games against Brighton recently. The 3-3 game away last season and we had a great win against them at Prenton Park back in November when we won 4-0, probably one of our best performances for sure.\nI think it’s a different test this time. Under the previous manager they were pressing with five or six players but leaving themselves vulnerable at the back and there was a lot of space in behind, while now with Mikey they have got that balance right since he’s been in.\nThey are a good side with a lot of quality players but we’ll prepare well, as we always do, and give ourselves the best chance of winning the game.\nThis will be the last game before an international break so it’s always important to get a positive result going into this and then the players go away with their countries in a good frame of mind, so it’s important we get a positive result on Sunday.\nOn the injury front, hopefully our Australian international Teagan Micah will be back in the squad this weekend. She has been going through the concussion protocols and doing bits with our goalkeeping coach Pottsy [Joe Potts] on Friday and Saturday, so she is progressing nicely.\nTaylor Hinds is progressing nicely and is back running on the pitch now, and our talented academy player Zara Shaw is flying through her rehab after her ACL. She is kicking a ball again so that’s great.\nAs always, thank you for your continued support.\nYNWA,\nMatt\nMatt Beard was speaking to Liverpoolfc.com's Steve Hunter",
  "word_count": 849,
  "scraped_at": "2026-02-14T13:29:51.976320"
}