{
  "article_id": "ae8d02f6b821",
  "url": "https://www.dailybreeze.com/2024/02/21/the-audible-all-star-angst-ucla-or-usc-madness-and-are-angel-fans-just-mad/",
  "title": "The Audible : All - Star angst ? UCLA or USC Madness ? And are Angel fans just mad ? ",
  "date": "20240221T223000Z",
  "domain": "dailybreeze.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Jim Alexander: The NBA’s All-Star Weekend has come and gone, and I’ll confess I didn’t watch a bit of it live (extenuating circumstances, because I was in the car headed home from Riviera both Saturday and Sunday evening). The only part of the weekend I really wanted to see was the Steph-vs.-Sabrina 3-point shootout Saturday night, and that turned out to be a great show. Watching the YouTube clip I was struck most by the sheer joy of their competition, coupled with the understanding of its sociological significance.\nThe game itself? Further evidence that All-Star exhibitions in contact sports are increasingly irrelevant. The NFL finally did the right thing by deep-sixing the Pro Bowl game in favor of a weekend of skills competitions and flag football. The NHL’s 3-on-3 competition is no longer an experiment, but it’s still a gimmick.\nAnd the NBA’s version? The 211-186 final score should be the final epitaph for what once was an at least reasonably interesting event. Nobody wants to get hurt, therefore nobody even tries to play defense, and it becomes a glorified 3-point contest. I love the NBA, but this is not the league’s finest weekend.\n(Baseball gets a pass, sort of, since its All-Star Game still at least resembles real baseball. My biggest gripe there is the insistence on Nike-inspired – or uninspired, actually – generic uniforms instead of each team’s colors on display. But that’s another subject for another time, especially since the new uniform manufacturer, Fanatics, has caused such an uproar this spring.)\nAnyway, Mirjam, what was your reaction to the weekend’s scoring orgy? And what are your ideas for improving it, or can it be salvaged at all?\nMirjam Swanson: The NBA certainly wants to salvage it. As intrepid Lakers podcaster Anthony Irwin pointed out yesterday when I chatted with him: The All-Star Game remains one of the NBA’s true tentpole events – which is why it’s so damaging when the show the players put on is so lackluster. But like another NBA reporter, my buddy Evan Barnes, pointed out – the All-Star Game is also very corporate – from all the trappings to the attendees to the players, who are all, at this point, corporations unto themselves. So, no, as you point out, Jim, they don’t want to risk their bodies and any earning potential for an exhibition.\nSo what to do? Some people – my husband – say lean into the gimmicky nature, make it a full-on MTV Rock ’N Jock-style affair, with 25-point baskets and/or, as Trae Young suggested, an in arena-emcee to taunt and trash talk players like they’re at the Drew League or Rucker Park. And I suppose there’s something to be said for being transparent about how unserious it is, but I don’t know that that will make it that much more fun to watch.\nThe reason everyone enjoyed Steph vs. Sabrina was because they were actually competing! That’s the not-so-secret sauce about sports – the competition. Take that away and what are we really doing?\nSo, how to fix it?\nMaybe – and I heard or read this a couple places too – move it to the beginning of the season when guys are getting warmed up for a long grind and not in the middle of it, and put the in-season tournament where the All-Star Game is, so they can be chasing the bigger extra money as a carrot, as some of the players suggested?\nMaybe???\nHonestly, I don’t know. Maybe, at some point, the players will realize that it won’t make business sense for them or their bottom lines, either, to actively diminish what should be a major marketing tool for the league. Maybe, at some point, someone will want to come in and bust someone’s butt and pride will get involved. But definitely more people are going to start tuning out – I watched 60 seconds and turned it off. Instead I finished cleaning the kitchen. That was more fun.\nJim: Ouch. We need to make sure Adam Silver reads that passage.\nI had the thought of moving the in-season tournament final to that mid-season slot, too. If we have to have one, why not use the week-long interruption of the season to really make the final a big deal? The only possible glitch there is that we’re only talking about two teams rather than something that is a league-wide celebration.\nBut how about this: Since the bag is what everybody’s chasing anyway, if you’re going to have an All-Star Game why not make it the central motivation. Winning team gets $1 million a man. Losing team gets $100,000 a man. Think guys would defend – would compete – under those circumstances?\nOtherwise, I like the idea of that looser, more informal, grittier atmosphere. I’ve often wondered why the Drew League doesn’t have a TV contract, because I bet those midsummer games would get some viewership!\nNext topic today: UCLA and USC play each other in men’s basketball for the final time as Pac-12 institutions this Saturday at Pauley Pavilion, barring a conference tournament meeting. At this point, the only way either team has a prayer of getting to March Madness seems to be to win that conference tournament next month.\nAs of today, UCLA (14-12, 9-6 in conference) is 91st in the kenpom.com metric (which the committee doesn’t use in its evaluation, as far as I know) and 105th in the NCAA’s NET ranking (which it does). The Bruins are 0-6 in Quad I games and have a loss to CSUN and a late scare by UC Riverside on their non-conference resume. And that’s with a recent six-game winning streak, which was snapped by Utah Sunday at Pauley. They have three potential opportunities left for a Quad 1 win in the regular season: at Washington State (20-6 and 37th in the NET) and Washington (14-12, 70th) next week, and at home the final week against Arizona (20-5, third).\nUSC? A dead team walking. (And, full disclosure, this was the same team I thought was poised to make a run to the tournament. Gotta own that one.) The Trojans are 10-16, 4-11 in conference, 1-8 on the road, and also 0-6 against Quad 1 opposition (with the same opportunities left that the Bruins have), plus early season losses to UC Irvine and Long Beach State. They’re 108th in the NET, 104th in kenpom.com, and need a miracle run at the tournament that I don’t believe they have in them. Case in point was last week’s overtime loss to Colorado, when they had opportunities but kept spoiling them with dumb plays.\nI’ll say it again: The best chance SoCal – at least the part of SoCal that doesn’t follow San Diego State – has at a tournament presence is Russell Turner’s Irvine squad (18-7, 79th in the NET, 76th in kenpom). The Anteaters’ issue? They play in a one-bid league, and strange things tend to happen to them in the Big West tournament.\nOther than that, it’ll be a good time to be out of the country for March Madness.\nMirjam: Indeed – though the USC and UCLA women are gonna put on a show, I’d bet.\nAs far as their peers on the men’s teams, though? You and seemingly everyone expected so much more from the Trojans – and even of the baby-faced Bruins.\nI’m re-reading some of the prognostications and, wooooo, we pundits were a wee bit off.\nFanNation: How good will USC men’s basketball be in 2023-24? “With leading scorer Boogie Ellis returning and USC adding a marquee recruiting class, the Trojans are expected to have one of the best teams of the Andy Enfield era”\nLA Times: “USC could make a run in Pac-12 with talented backcourt”\nAnd UCLA? CBS Sports on UCLA’s Aday Mara: “If coach Mick Cronin can figure out how to maximize Mara’s enormous frame alongside returning center Adem Bona, it could make UCLA a matchup nightmare.”\nAlas, that’s why they play the games. And that’s why, in UCLA’s case, they call it growing pains. I don’t think anyone, at this point, is all too surprised it took the Bruins a good chunk of the season to find a rhythm, and that they’d still stub their toe like they did last weekend against Utah. And still, there’s a sliver of hope beyond taking the Pac-12 Tourney, I think, if they win out in their final five games? Which makes Saturday’s game a biggie.\nAs for USC? The Trojans will be happy to get it over with. What will this stinker of a season mean for Andy Enfield? I know people are talking about that, but also – he’s had success in his time in L.A. On his watch, USC is 215-145 and he’s piloted the Trojans to five NCAA Tournament appearances and one of USC’s two Elite Eight bids in the past 70 years. That should count for something.\nJim: I guess, as is true in football, the big question here is how competitive the L.A. schools will be in the Big Ten next season. UCLA will be better as its roster matures, presuming everyone is back – never a certainty in the transfer portal era – and I’ve got to think Enfield’s track record will earn him a pass. But consider: There are seven Big Ten teams currently in the NET Top 75 (Purdue 2, Wisconsin 21, Michigan State 24, Nebraska 47, Northwestern 57, Iowa 65, Ohio State 65, and Minnesota just missing at 76). The Pac-12 has four: Arizona, WSU, Utah (46), Washington (70).\nThen again, consider what Arizona, ASU, Utah and Colorado will be dealing with in the Big 12: Five teams in the Top 20 (Houston 1, Iowa State 7, BYU 11, Baylor 13, Kansas 17) and six others in the top 75. I know these things can change from year to year, but that is a brutally tough conference.\nLast subject: Who are Angel fans more outraged at this week?\nArte Moreno told our Jeff Fletcher – exclusively, by the way – that not only is the team off the market but that he’ll be “here long term” – and added, “I’m not going to spend money just to show that we’re going to spend money unless it’s going to substantially change the team.” (I’m sure that Scott Boras loved hearing that, as the agent for the two remaining marquee free agents on the market as of this moment, Blake Snell and Cody Bellinger.)\nAnd two days later Anthony Rendon – already a target for not playing very often, and not well enough when he did play – basically invited ridicule when he described baseball as never “a top priority … It’s a job. I do this to make a living. My faith and my family come first, before this job.” There was, of course, more nuance to his interview session than that, but if there’s a better way to assure that you’ll be booed when introduced at the home opener, I don’t know what it is.\nMirjam: If that messaging doesn’t make fans want to invest their hard-earned money – and time – into the team (minus Shohei Ohtani), what will!?\nBut, yes, the takeaway from Rendon’s presser being that baseball isn’t his top priority is on one hand a little unfair because his more important priorities are family and faith and well, of course!\nBut by the same token, of course those are more important priorities than your job – no matter how seemingly cool your job is, no one would dispute that. It’s just that he doesn’t appear to think his job is especially cool, never mind that, at its core, it’s playing a game for millions of dollars.\nRendon strikes me as a good example for that old analogy: Lottery winners who were happy people before they won the lottery will continue to be happy rich people; lottery winners who were unhappy before they won, will be unhappy rich people.\nAs for Moreno? I guess Angels fans are stuck with him, considering he spurned a reported offer of more than $3 billion for the club? And how far can the Angels really ever go with him controlling the purse strings in his particular, peculiar way?\nTell you what: I commend the Angels fans who stick with their team year in and year out. That’s real loyalty. Or masochism. Somewhere in the middle.",
  "word_count": 2069,
  "scraped_at": "2026-02-14T13:11:13.914781"
}