{
  "article_id": "ae8e6cbfbb3e",
  "url": "https://www.arsenal.com/news/every-word-renees-pre-spurs-presser",
  "title": "Every word of Renee pre - Spurs presser | Press conference | News",
  "date": "20241115T163000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Renee Slegers was back in front of the media at Sobha Realty Training Centre for her pre-Tottenham Hotspur press conference on Friday.\nShe was asked about her role as our interim head coach, the latest team news and more.\nHere's everything she had to say on the following subjects.\non Tuesday’s win against Juventus:\nSuccess for us is huge, success in performances and ultimately results. I think we did really well against Juventus and I’m very proud of the players because it’s a very hard away game to go to with the pressure that was on us to get a result or at least not to lose. From a mental and physical perspective, it was a very intense and demanding game. Obviously you saw that they almost go player for player over the whole pitch, which means that every player has to be present every single second of the game because the pressure is there all the time but it also means there are big spaces to use and I think we did that really well. It’s the type of game that we usually don’t play, it’s a game you don’t play so often in your career so the way the players handled it was on a very high level I think.\non our first goal against Juventus typifying our confidence:\nIt was a beautiful goal. We used the spaces really well with support underneath. We go diagonal to a third player so it was a beautiful goal, but I also think the game against Juventus and the way they play allows you to move a lot and be creative. You have to to break them down and those things came together really well.\non the togetherness of the squad:\nThat’s what I see when I see the team play and train. They are together at the moment, trying to play to their own strengths and teammates strengths so I’m very happy with where we are at the moment. At the same time, tomorrow is a totally different game, a very demanding game as well, a big game. We do things really well at the moment so we have to maintain that but keep on developing and that’s what you hear the players saying after Juventus as well. They’re happy with the performance and the result, they know it’s big, but they still have little details that they want to do better, so I think the players show a great mindset at the moment.\non whether there’s any clarity on her future in this role:\nI don’t know. All I’m focused on is being here now. What makes us so strong is that we are a team at the moment, all taking ownership of where we want to go as Arsenal Women. That needs to be put first.\non a permanent solution:\nI think it’s good for the team if there comes a permanent solution and I know the club is really working hard on it in the background.\non why she wouldn’t want the permanent job:\nThat was nice! Why I wouldn’t want this job? I think this job is a very fun job, a demanding job as well, but again I don’t think so much about that. It’s mostly in the press conferences when I have to think about it with everyone asking me! I honestly don’t because there’s so much we have to do on a day-to-day basis. We’re spending long days getting things right. Obviously we’re staff members down so we work really hard from early morning to evening and we’re just in a moment and then I go home. I want to play with my son, a three-year-old, and then I go to bed really early. Honestly, there’s not much else to my life at the moment.\non prioritising living in the moment:\nAt the moment I feel like I’m good at being in the moment. I can imagine it fits for where we are at the moment, but again, what comes after this or what’s the future… I’m really not there with my thoughts.\non putting on a show this weekend:\nWhen did I stop playing? 2016. So that’s eight years ago. I think women’s football is growing so fast and the WSL in particular has some really attractive high level football being played, so I think this weekend is going to be massive and I hope it will attract more and more people. The way the game is being played at the moment is very attractive to go and watch.\non how much she’s looking forward to her first NLD as a manager:\nI was there last year so I did two or three even. You can see and feel it in the preparation for the game as well how big it is, so I’m looking forward to it a lot. I can’t say more than I look forward to tomorrow.\noh how much she’s enjoying the responsibility:\nI’m here for the team and the fact that the players are expressing themselves, you see the confidence growing and the way we perform at the moment, I’m just very happy that that’s happening. How much has to do with what, I always think a big group of so many human beings - we’re a staff of 25 and 25 players - there’s so much to it. Not only one person. There are so many things to it, a cocktail of things that’s really good for us at the moment which means that we’re putting on these good performances and growing as a team. I wouldn’t go too much to my part in this. I think there’s a bigger thing that makes us grow as a team at the moment.\non why the players have been playing with more freedom:\nWe’re still going back to the foundation that is here. What Jonas worked on for many years, we're still using that. I think big credit to the foundations that we have, because I don't think you can be creative and free if there's no foundation and no structure. We have a clear foundation and structure. But yeah, with success comes momentum, and if things are going well, players feel more free. And I think we want to allow them the freedom, but they still have to do certain things in their positions, which you can see that players start recognising things, spaces, partnerships, on the pitch. And I think that's very positive. Again, big credit to the players as well, because behind the scenes, they're putting in a lot of effort and work both on and off the pitch.\non Alessia Russo’s form:\nYeah, we're a team, and we need to get the ball to our forwards, so that's a team effort, and then one player has to be at the end of it and needs to put the ball into the net. So I'm happy for Alessia that she can get on the end of it, but there are more players. A lot of players are scoring at the moment. For us, that shows how versatile we are as a team, and also the players coming on. Alessia has been starting a lot of games and scoring, but you also see the players coming on like Stina, for example. They're all so valuable for us, so I'm happy that we see many players are performing well and scoring the goals for us. That's great.\non what we can learn from last season’s defeat in the NLD:\nIt was the last game before the Christmas break, I think. One big thing for us is that we are in the moment. We don't think about what's going to happen after the game and just be in the moment. I think what Tottenham did really well was closing spaces down, and they worked really, really hard to do that for 90-plus minutes. So that was a big learning. So how can we break things down? But obviously we don't know exactly what Tottenham are going to do tomorrow. Where are they at as a team? How are they going to attack this game? So we'll see what they will give us. We'll have to be on our toes tomorrow and be very present.\non whether she feels uncertainty about her role:\nI think we're quite settled now as a staff, and how we've picked this up during the block, so we still feel like, within this block, within the staff, the way we’ve picked up the roles, we have found some consistency. So we don't work with question marks. I think we are quite stable and consistent with what we're doing at the moment. So I don't have questions about the future or question marks on how we need to solve things or who does what. I think we're very settled at the moment. So I feel there are no questions or thoughts about the future. We're doing well at the moment as a staff.\non bringing in Steph Catley as a centre-back:\nYes, Steph has real qualities. I think Steph always brings the basics and the details, which are things that you don’t always see, but the way she covers spaces, the way she covers other players, the detail of her passes and her decision-making. It’s a really high level, so that’s what Steph brings to the team, but then obviously we have Laia Codina, Lotte [Wubben-Moy] and Leah Williamson as well, so we’re in a very luxurious position of having all these great centre-backs in the team. Looking at Steph, I think that’s definitely what she brings to the team.\non factors she considers when making a choice of goalkeeper:\nTwo great goalkeepers. Your number one job as a goalkeeper is to stop goals from going in and most goals are being scored by shots or by finishing from crosses, so I think that’s important to be good at as a goalkeeper. The way we play possession-based football, the goalkeeper can play a good role for us in passes, both short and long, to find a free player and I think they’re both at a really high level. They work extremely hard, together with Naomi [Williams] day in, day out. They’re both doing really well, obviously they’re not identical, they have differences, but it’s very good to have two good goalkeepers in the squad.\non the importance of closing down Spurs’ passing lanes:\nI think again, with the way Spurs have been playing, they’re a good team. They will ask us some questions and we’ll need to solve those questions. They might rotate in positions, so we need players on the pitch that can read that, defend that and communicate that really well.\non how exciting it is for all the WSL teams to be playing at main stadia this weekend:\nTo be honest, when I grew up I played with boys and I was playing in the garden with my brothers and I didn’t even know if there was a national team in the Netherlands. So I think where I come from and where we are now, all teams are playing in the big stadiums across the WSL and it’s fantastic. It’s unbelievable. I think about how fast things are growing, I put things into perspective as well. I think it’s growing really fast and yes we want more, we want things to be even better but it’s brilliant to see where we’re at.\non which improvements she would like to see in women’s football:\nThere’s many things. I think although parts can get better, education can get better. For example, for players who are still playing who might want a career in coaching, I know a couple of our players are actually doing their coaching badges. That would be one, and I think just acceptance around the whole society still.\non team news:\nThere will be changes because of the Champions League squad this week and then the WSL squad, so we’ll only have 20 players in the squad tomorrow. Everyone is fit who has been fit, but Amanda Ilestedt is away because of her baby and Victoria Pelova is still out.\non how important our supporters are:\nI can’t believe it, how much they invest time and money to come and watch us, both home and away. It’s brilliant and the players see it, they feel it and I think it really helps us and gives us that extra little push. I think it’s fantastic and in my opinion, although I might be a little biased, I think we have the best fans. It’s fantastic.\non focusing on ruthless efficiency:\nFor us at the moment, they are not actually. It's interesting to hear that [Lia Walti] pinpointed those as it was a couple of areas when we were planning for block two, things we wanted to do better as a staff, and then the players got to sit down as well and discuss what they think we need to do better in this block. And those were a couple, so being calm, being clear and ruthlessness, I definitely think they can go together, because if you're really clear and calm about what you want, you can actually be ruthless in those moments. And I think we're finding the right balance at the moment, and we're in a good place, but we have to maintain and do things even better.\non starting and finishing games with different personnel:\nIt's different from game to game. Whether it’s plan A, plan B, plan C, Plan D, even. And then, how you want to start a game and finish the game. But I think going back to the strengths of the players, it is personnel dependent; how we want to play and get the best out of the players. So that's why you've seen those changes, I think, in the games before, but now we have another game ahead of us that will look different.\non supporters rallying around her as a coach:\nI’m personally not on social media. I'm happy that we have something positive going on. I'm happy for the fans as well, because, again, the way they invest, you want to give something back. So, I'm very happy that we can give something positive to the fans at the moment.\non her role as a female coach within women’s football:\nI don't look at people if they're male or female. I don't think about that, so I would say that it shouldn't matter. It shouldn't matter if it's a man or a woman. So no, but I have my background. Obviously, I grew up as a girl in the Netherlands. I grew up playing football. So that's something I bring that I am as a human being, but that will be exactly the same for someone else. So, I, in my opinion, it shouldn't matter.\non her assessment of the Spurs squad:\nI think Tottenham are a strong team. They've been playing a top four opposition in quite a lot of games already, which are tough games. I think they might be stronger than the results they've had so far. So, we're really respectful of them as an opponent, they have some individual qualities. I think they show great mentality and do things together. So, it's going to be very hard opponent. But again, I think if we keep on bringing what we're bringing, I think we're a top team. So, it's going to be interesting to see the two teams against each other tomorrow.\non what she’s expecting in terms of atmosphere tomorrow:\nAtmosphere is going to be good, hearing all the away fans that are coming. It's going to be a challenging game I think to manage. I've played against Robert Vilahamn before, when he was coaching a team in Sweden. I think he's a good coach, and he reads the game well. He might make in-game changes; we might make in-game changes. So, it's going to be an interesting game, but I think apart from that, it's about what the players are going to bring on the pitch, and we have very intelligent football players on the pitch, so most of it, they're going to manage themselves, and we'll try to help from the sidelines.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 2742,
  "scraped_at": "2026-02-14T13:01:41.915382"
}