{
  "article_id": "aec325da90d7",
  "url": "https://www.illawarramercury.com.au/story/8368061/jamberoos-motogp-star-jacob-roulstone-makes-the-next-step-to-going-pro/?cs=302",
  "title": "Jamberoo MotoGP star Jacob Roulstone takes next step to becoming pro | Illawarra Mercury",
  "date": "20230929T001500Z",
  "domain": "illawarramercury.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "When Jamberoo's Jacob Roulstone moved to the other side of the world with his mum Leah at the start of 2020, he could have never imagined where his journey would take him.\nSubscribe now for unlimited access.\nor signup to continue reading\nAlmost immediately after arriving to Spain to pursue his dream of becoming a professional MotoGP rider, COVID-19 hit Europe - and the rest of the world - hard.\nIt could have been easily something that derailed his young career before it had even began.\nBut it didn't.\nJacob and Leah stuck it out and after spending over three years overseas, the youngster is now seeing all the blood, sweat and tears pay off, with the 18-year-old progressing through the ranks to sign with Red Bull KTM Tech3 in the Moto3 World Championship in 2024.\nRoulstone described his journey to the Mercury from the early beginnings to now signing with Tech3.\n\"2020 was a big year, not only with COVID hitting, but learning all about racing in Europe which is big and overwhelming,\" Roulstone said.\n\"I moved to Spain with my mum to race at the beginning of 2020 in the European Talent Cup with the Leopard Impala Junior Team, leaving my dad and sister here. Before that I was racing in Australia and in the Asia Talent Cup. In 2021, I was able to stand on the podium three times in the series and finish the year as the highest placed 'non-Spaniard' in the championship in ninth out of 50 riders.\n\"In 2022, I stepped up to the Junior GP World Championship on a moto 3 with the Aspar Junior Team - another great team and opportunity. I also was selected to compete in the Red Bull Road to Moto GP Rookies Cup. It was a tough year but I learnt a lot.\n\"This year, I have managed to be much more consistent in my racing. I competed in the Rookies Cup again and put in place all the things I needed to, achieving four podiums so far. Two in junior GP and two in Rookies Cup. Rookies Cup has finished for the year and I finished fifth in the Championship.\n\"The next 'natural' step is to move into the Moto 3 World Championship alongside Moto GP. Discussions for this commenced earlier in the year with several teams approaching us for me to ride for them in 2024. My mum, who manages me, met with them to discuss my future and to consider what they had to offer me. Many teams want a lot of money so some of them were just out of the question. It's a pretty tough sport in this way.\"\nBut after much deliberation, Roulstone finally made his move to Tech 3.\n\"So it's super exciting and a huge opportunity to be part of the Red Bull KTM Tech 3 team in 2024 and race on the world stage,\" he said,\n\"They are a very experienced and professional team who have brought through many great riders into the MotoGP paddock and one of the highest placed teams in the Championship.\"\nRoulstone will be guided by ex-racer Herve Poncharal.\n\"Having Herve as the team manager, who has been in the paddock for over 30 years and is also running the Tech 3 team, will be a great advantage to my rookie year as he will be able to guide me and provide me with so much advice and knowledge,\" he added.\n\"Stepping into the Moto3 World Championship means I'll be one step closer to my dream of racing MotoGP. I will be racing at 22 race events worldwide in 2024, alongside MotoGP and Moto2, including a race at Phillip Island in October 2024.\n\"Once that is over, at the end of November I will have a one day test with my new team before flying home to Australia for two months. I will start official testing at the start of next year around the end of February, and the first round in Moto 3 will be in March racing in Qatar.\n\"My goal for the 2024 season is to have some top 10 finishes in the races and finish the year as Rookie of the year.\"\nOur news app has had a makeover, making it faster and giving you access to even more great content. Download The Illawarra Mercury news app in the Apple Store and Google Play.",
  "word_count": 733,
  "scraped_at": "2026-02-14T12:39:47.895950"
}