{
  "article_id": "aecb898d7f53",
  "url": "https://www.theguardian.com/world/article/2024/may/30/first-edition-diane-abbott-labour-party",
  "title": "Thursday briefing : Diane Abbott , Faiza Shaheen , and how the Labour party is changing",
  "date": "20240530T064500Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning. The Labour party spent most of yesterday talking about Diane Abbott, and the question of whether an unedifying back-and-forth over her future was evidence of a calculated attack on the party’s left. By the end of the day, two other prominent left-wing candidates had been suspended, and a group of candidates who stand firmly on Labour’s right had been abruptly parachuted into winnable seats. So there doesn’t seem much suspense about that question any more.\nYesterday began with Britain’s first Black female MP confirming a story in the Times saying that she would not be allowed to stand, only for Keir Starmer to claim that “no decision has been taken to bar Diane Abbott”. Last night, Abbott said that she wanted to be an MP as long as possible. As of now, she is a Labour MP, and the party’s candidate for Hackney North and Stoke Newington is yet to be confirmed.\nThere are likely twists ahead for Abbott – but the case of Faiza Shaheen has been ruthlessly closed. Shaheen, one of only six 2019 Labour candidates to secure a swing against the Tories in her contest with Iain Duncan Smith, appeared shellshocked in an interview with Newsnight where she said she had been told she had been removed as a candidate in relation to 14 tweets over the last decade. The Brighton Kemptown MP, Lloyd Russell-Moyle, has meanwhile been suspended over what he claimed was “a vexatious and politically motivated complaint”. And Apsana Begum, MP for Poplar and Limehouse, became the third woman of colour to have her candidacy thrown into doubt after a deselection attempt in her constituency.\nStarmer’s allies insist that everything has been done by the book. But if the Labour leader has ambitions to focus on his policy agenda today, he will first have to contend with questions about what looks to many like a purge. Today’s newsletter runs you through the possible explanations of the Abbott saga, and what they tell us about the composition of the likely next government. Here are the headlines.\nFive big stories\n-\nIsrael | Efforts by Israel’s intelligence agencies to undermine the international criminal court (ICC) could amount to “offences against the administration of justice”, legal experts have said. Lawyers called the findings of a Guardian investigation “deeply disturbing” and said they should be investigated by the court’s chief prosecutor.\n-\nGeneral election 2024 | HM Revenue and Customs has confirmed that Angela Rayner owes no capital gains tax for the sale of her former council house and that no further action will be taken, according to a document seen by the Guardian. Meanwhile, Rishi Sunak has ruled out a deal with Nigel Farage after the Reform politician hinted at the possibility.\n-\nNHS | Junior doctors in England are to strike for five days in their long-running pay dispute, bringing a fresh wave of disruption to the NHS in the week leading up to the general election. The timing of the strike led Rishi Sunak to claim that it was politically motivated, a claim rejected by the British Medical Association.\n-\nEuropean security | Security services around Europe are on alert to a potential new weapon of Russia’s war – arson and sabotage – after a spate of mystery fires and attacks on infrastructure in the Baltics, Germany and the UK. Foreign and defence ministers have been warned that they could be part of a systemic attempt by Moscow to destabilise the west.\n-\nEnvironment | Temperatures in Delhi have hit a record high of 50.5C (122.9F), as authorities warned of water shortages in India’s capital. The India Meteorological Department (IMD), which reported “severe heatwave conditions”, recorded the temperature on Wednesday, breaking the landmark 50C measurement for the first time.\nIn depth: Factional vendetta or honest misunderstanding?\nWhatever was behind Starmer’s wholesale reversal of the position briefed by Labour sources to the Times the previous day, there can be little doubt that Abbott has been treated shabbily. No matter your view of what she wrote in April last year – that Irish people, Jewish people and Travellers were “not all their lives subject to racism” – a 13-month period of limbo followed by her use as a political football feels hard to justify, particularly in light of her rapid and profuse apology.\nShaheen was meanwhile called to a meeting yesterday and presented with 14 tweets said to raise concerns about her suitability as a candidate. One of those she liked, a link to a Jon Stewart sketch, included a reference to critics of Israel coming under attack from people “mobilised by professional organisations”.\nShaheen said she did not remember liking the tweet, and would have been reacting to the sketch, but recognised that the message “played into a trope” and apologised. Others included a like for a friend being selected as a Green candidate in 2014, before she was a Labour member, and a post about her experiences of Islamophobia in the party. On such grounds can promising careers be left in ruins.\nEven if you are untroubled by the question of whether all of this has been fair to Abbott or Shaheen, you still have to ask why their defenestration would have seemed worth a predictable political cost: huge anger on the left, credible accusations that Keir Starmer has lied and the total loss of control of the news agenda during an election campaign. Here are four possible explanations for the Abbott case.\n1. It was a genuinely independent disciplinary process\nSenior Labour figures have repeatedly claimed that Abbott’s fate is out of their hands, instead sitting with the national executive committee (NEC). Starmer himself said in March: “That’s an independent Labour party process.”\nBut if this is all a matter of allowing a legitimate (and astonishingly drawn-out) arms-length process to run its course, it is unclear why the matter was not swiftly concluded when – as it now turns out – the NEC’s investigation ended last year. And that fact raises legitimate questions about whether Starmer was telling the truth when he said last week on LBC that “Diane is going through a process in relation to the investigation of an issue relating to her that’s not yet finally resolved”.\nSo was Starmer not informed that the investigation had run its course? Kremlinological though it is, the important point here is that once the NEC investigation concluded, the matter passed back to the chief whip, Sir Alan Campbell – who is a member of Starmer’s shadow cabinet, and whose job is to enforce discipline on his behalf.\nIt is hard to credit that Starmer was not told. And while the NEC may be a nominally arms-length process, the chief whip’s decision over Abbott’s status in the parliamentary party is not. Nor is there any prospect that Abbott would not be allowed to run again if that was what Starmer wanted.\n2. It is an attempt to say ‘Labour has changed’\nSenior Labour figures keep saying this when they’re asked about Abbott. “This Labour party is a changed Labour party,” Starmer said in this LBC interview last week. “The Labour party has fundamentally changed from the party that was rejected in 2019,” shadow health secretary Wes Streeting told the BBC yesterday. On Newsnight on Tuesday, political editor Nick Watt quoted allies of Starmer: “She is in their view a reminder of the Jeremy Corbyn era which they say was an era of failure.”\nThe other claim made by allies of Starmer to Newsnight was that Abbott’s removal as a candidate would make sense because “the incident where Abbott struggled to explain numbers behind policy comes up on the doorstep, and that is damaging”.\nThat analysis is at best uncomfortably adjacent to the disproportionate abuse that Abbott always suffers over any mistake she makes: in 2017, the New Statesman found that Abbott received half of all abusive tweets sent to female MPs, much of it explicitly racist.\n3. It is vindictive\nOther explanations are available – but we should at least consider the possibility that Abbott’s treatment has been motivated by factional loathing.\nThe 2022 Forde report on factionalism in Labour found Abbott was a lightning rod for abuse even within the party: text messages among anti-Corbyn staffers described her as “truly repulsive”, “a very angry woman”, and said that she “literally makes me sick”. Forde called these messages “expressions of visceral disgust, drawing (consciously or otherwise) on racist tropes.”\nThere is further evidence for the idea that Abbott has been singled out in the very different way others in the party have been treated: MP Neil Coyle was found to have been drunkenly abusive and to have made racist comments, and is standing for re-election in Bermondsey and Old Southwark. Barry Sheerman apologised over sending a tweet linking Jewish businessmen to “a run on silver shekels” and faced no further action. Darren Rodwell told the audience at a Black History Month event that he had the “worst tan possible for a Black man” and was cleared of wrongdoing. He is the Labour candidate for Barking. All three are supporters of Keir Starmer.\nFinally, we should consider the motives of whoever leaked the story to the Times. As Robert Peston lays out here, it had been expected that Abbott would be allowed to announce her own retirement after being readmitted. The Times briefing blew that plan up. We don’t know the source of that story – but it is not hard to see that it might be grounded in spite.\n4. It is part of an effort to build a more biddable party\nIf you read First Edition on Monday, you’ll remember Michael Crick explaining that the left of the party has been ruthlessly purged in the candidate selection process. “The people running the show are hugely partisan,” he said.\nLuke Akehurst, a member of the NEC, accepts that there is “a political element to this” and told PoliticsHome last year: “I don’t want to have allowed people to become Labour MPs that effectively are not solid votes for the Labour party.” All this is so explicit that it’s not really a secret plan, as it is sometimes characterised. It’s just a plan.\nAbbott’s treatment should be viewed in that context – and in the context of a slew of retirements of Labour MPs in recent days. When the decision is taken this close to an election that an MP will not stand again, the central party exercises much more control over the process – meaning that it can parachute in preferred candidates at will. One example yesterday: Luke Akehurst is now the Labour candidate for North Durham, where the MP has retired. Another senior Starmer ally, Josh Simons, was handed another seat freed up by retirement. And Rachel Reeves’ former communications chief, Heather Iqbal, was selected in Dewsbury and Batley.\nSupporters of Starmer view these selections – and, presumably, deselections – as evidence of higher standards in Labour. But even some loyal MPs are said to be unnerved by events of the last couple of days, and the existing pattern they follow. Abbott’s fate may not yet be clear. But it is certainly clear that the Labour backbenches would be more obedient without her on them.\nWhat else we’ve been reading\n-\nSocial housing campaigner Kwajo Tweneboa (above) is now a Guardian columnist. In this first instalment, he writes about his journey from living in a dangerous housing association flat in London, to advocating for others enduring what he describes as “slum conditions”. Hannah J Davies, deputy editor, newsletters\n-\nThe Liberal Democrats’ real campaign slogan, Marina Hyde feels, is “Yeah but you’re talking about us, aren’t you?” If you’ve had a funny feeling you’re being played as you marvel at Ed Davey falling off a paddleboard or whatever this week, this piece will make it make sense. Archie\n-\nDitch the wedding car, keep the cocktails flowing, and remember to have fun: Guardian US has a fun but practical guide to “new wedding etiquette”. Hannah\n-\nIt’s a great week for fans of Simon Hattenstone interviews with talkative icons of advancing years: first Tracey Emin, now Lenny Kravitz. Hard to pick the best bit: is it the explanation of why he works out in leather trousers, or the admission that he employed a guy to roll his joints? Archie\n-\nRoll up, roll up for Felicity Cloake’s Vietnamese summer rolls with pork belly and prawns. Hannah\nSport\nFootball | Olympiakos won their first major European title as Ayoub El Kaabi’s late extra-time winner inflicted a second straight Europa Conference League final defeat on Fiorentina. The Greek side are the first team from their country to win a European trophy.\nTennis | World No 1 Iga Świątek survived a match point on Naomi Osaka’s serve to prevail 7-6, 1-6, 7-5 in a second-round classic at the French Open. Meanwhile, Carlos Alcaraz overcame Dutch qualifier Jesper De Jong in an unconvincing 6-3, 6-4, 2-6, 6-2 victory.\nFootball | Bayern Munich have appointed Vincent Kompany as their new head coach after agreeing a compensation package of about £10m with Burnley. Kompany has signed a three-year contract with Bayern, who made a surprise move for him having failed to persuade Thomas Tuchel to remain at the end of the season.\nThe front pages\nThe Guardian’s splash is “Abbott defies Starmer with vow to remain MP for ‘as long as possible’”. “Abbott dares Starmer: try to stop me” – that’s the Metro, while the Daily Telegraph has “Abbott: ‘I will not be intimidated by Starmer’”. “You’ve buckled! Hunt’s win as Labour back down on tax rises” – the Daily Express says the party was “bounced into a late night promise that it will not increase VAT”. Big number in the Daily Mail: “Revealed: the Crown’s case against Lord Lucan”. A war story in the Financial Times: “Europe has tiny fraction of air power needed to guard Nato’s eastern flank”. “‘Cynical’ election doc strike” is the Metro’s top story. “You are pure evil” – the Daily Mirror previews the sentencing today of a teacher who “murdered her lover, buried him at home then invited his mum for a drink”.\nToday in Focus\nHow an Indian state became a testing ground for Hindu nationalism\nHannah Ellis-Petersen reports from Uttarakhand, which offers a glimpse into what the future might look like if the BJP retains its power in national elections.\nCartoon of the day | Nicola Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nPop music is not always a welcoming place for women, and when they become parents the challenges can increase. But there is, some have found, a musical power in motherhood. Natasha Khan who performs as Bat for Lashes, recounts an almost explosive creativity after her daughter Delphi, now three, was born. “It gave a potency to the work that I haven’t had for years,” she says. “There was also a depth I’ve never experienced before.”\nBecoming a parent has inspired her new album, The Dream of Delphi, with songs about the hazy, liminal days she experienced as a new mother. Nell Frizzell speaks with Khan and other musician-mothers – from Berlin-based techno artist Samantha Poulter, who performs as Logic1000, to Sara Quin of Canadian indie duo Tegan and Sara – about the inspiration, energy and power that motherhood has brought to their work.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2600,
  "scraped_at": "2026-02-14T12:08:40.186615"
}