{
  "article_id": "aecedf91eeda",
  "url": "https://www.rockmnation.com/2025/1/29/24353851/rejoice-the-finish-line-to-dry-january-is-in-sight",
  "title": "Rejoice , the Finish Line to Dry January is in Sight ! ",
  "date": "20250129T144500Z",
  "domain": "rockmnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Rejoice, the Finish Line to Dry January is in Sight!\nThe Morning Commute for Wednesday, January 29th\nToday we’re talking about Dry January, because I’m doing it, and I’m ready to drag everyone down to my level of misery. I was asked by a co-worker last week what I’m looking forward to most in 2025, and my response was, “February 1st.”\nAnyone else out there trying Dry January? It’s honestly not that miserable, I’ve been really pleased with how I’ve been able to navigate it so far. It’s good to test yourself and your personal resolve to stick with something that’s not fun. Trust me, I miss having a beer or margarita in my hands watching the Tigers and Chiefs, but it’s been good for me to learn the concept of will power.\nIt’s probably a good news/bad news deal, but I’ve also lost about 15 pounds since I started, and some of that is likely due to the fact that I have been exercising a little more consistently, but the really bad news from my perspective is that I bet a lot of the weight loss can be credited to the lack of alcohol - and the eating habits that follow once you’ve slugged a couple of drinks on a weekend night. That’s a bummer, because I’d like to keep this weight off, but I’d also like to go back to having a drink when I want a drink.\nI have no idea if I’ll continue the dry concept into February - maybe I’ll try to make it to Super Bowl Sunday and then fall off the wagon in spectacular fashion that day.\nIn actual sports news, a nice honor came in for Tiger QB Brady Cook, as he was named on Tuesday as a second team academic all-American! Check out the story here.\nThe SEC Shorts team had a fun send up on a season in review for the SEC football teams. Check out the video below. Someone might have to explain the Dennis Hopper reference to me about Mizzou, but otherwise it was a fun take on the season that was.\nYesterday at Rock M and Rock M+\n- We all had certain expectations coming into the 2024 football season for our Tigers, and Rock M’s Nate Edwards reviews how omniscient his were in this recap of his preseason checklist...\nIncluding this year’s national championship game, no team has won a title with anything less than a Top 40 defensive unit, and other than Cam Newton in 2010, no team has done it without at least a Top 30 defense. As previously state Missouri finished ranked 20th in SP+ for ‘24 and whether that was thanks to a ton of experience or Corey Batoon’s tutelage, it was an elite unit last year. Now the trick is to do it again!\nOne of Nate’s markers that would lead to a 10-win season for Mizzou was for the Tiger defense to be at least a top-40 defense, and they passed that one with flying colors. I think a lot of us would give the defense a grade of ‘A’ for the season, as that side of the ball kept things afloat for the first two thirds of the season while the offense was surprisingly a little bit off...\nSpeaking of being the guy following the guy, now we have Pribula following Brady Cook’s 21-5 record. I think Pribula will elevate the designed quarterback run game, but it is a total unknown if the passing offense will be better, the same, or even worse with him taking snaps. It is going to be difficult to replace one of the grittiest, toughest, and most beloved leaders in school history. It could go swimmingly, heck, maybe Pribula is even an upgrade on the field, but in January, I am not confident that will be the case.\nThat was Dan’s take on his confidence level with the QB position heading into 2025 as the Tigers will break in a new signal caller, with most expecting the starting job to go to Penn State transfer Beau Pribula...\n- Karen Steger took a look at Mizzou’s Olympic sports, and FINALLY got to write about a women’s hoops victory!...\nI sit here hours later and I’m honestly still in shock like I don’t know what I just witnessed. I cannot believe they did it. They won an SEC game. For the first time since January 18, 2024, the Missouri Tigers won an SEC women’s basketball game. And against a GOOD team at that who will play in the NCAA Tournament and as Dylan said, could be a sneaky good team to advance to the second weekend.\nIt’s nice to see that the Tiger women won’t follow suit from the men’s team a year ago and post a winless SEC season!...\n- Tuesday’s Morning Commute by Sammy Stava had ranking updates for Tiger hoops (the men) and gymnastics, amid lots of other updates...\nThe Tigers (#20) are one of TEN SEC teams currently ranked. Even Vanderbilt comes in at No. 24 — who was predicted to finish last in the SEC. That win over the Commodores is looking better and better for Mizzou and has the potential to turn into a Quad 1 win when it’s all said and done.\nRock M Radio: Latest in Olympic Sports News\nSubscribe to Rock M Radio on Apple Podcasts. Or stream episodes through Megaphone or Spotify. Have a question for us? Leave a 5-star review with your question and that show just might answer it in an upcoming episode!\nIf you like Rock M Radio drop us a Review and be sure to subscribe on your preferred podcasting platform. Follow @RockMRadio on Twitter and if you heaven’t already head over to our YouTube channel and click that subscribe button!\n(** RockMNation has affiliate partnerships. These do not influence editorial content, though RockMNation may earn commissions for products purchased via affiliate links.**)",
  "word_count": 991,
  "scraped_at": "2026-02-14T13:19:58.270563"
}