{
  "article_id": "af078bf67e72",
  "url": "https://cartilagefreecaptain.sbnation.com/tottenham-hotspur-women/65541/tottenham-women-vs-west-ham-game-time-open-thread-and-how-to-watch-online",
  "title": "Tottenham Women vs . West Ham : game time , open thread and how to watch online",
  "date": "20250907T104500Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It may be the international break, but Tottenham Hotspur do play football today! Tottenham Hotspur Women open their WSL season at home vs. West Ham United at Brisbane Road. It will be the first time we’ll have had the opportunity to watch Spurs Women play a competitive match this season, though there were a couple of friendlies that were streamed on SpursPLAY earlier this summer.\nTottenham Women vs. West Ham: game time, open thread and how to watch online\nTottenham Women kick off their new season at home to the Hammers.\nIt’s been a weird, and a little disappointing, offseason for Tottenham. They had a miserable campaign in 2024-25, finishing 11th out of 12 teams in the league and only avoiding relegation thanks to the near record level ineptitude of Crystal Palace.\nThe terrible season cost Robert Villahamn his job, and new manager Robert Ho comes in with a strong track record of success with SK Brann in Norway, and a good reputation. But he won’t have many new tools to play with — Spurs made only two acquisitions this summer, signing promising 19-year-old Japanese defender Toko Koga, and Norwegian forward Cathinka “Tinka” Tandberg. Spurs lost Hayley Raso to Eintracht Frankfurt and sent Hungarian midfielder Anna Csiki on loan to West Ham. Defender Ella Morris is also out for the season with a long-term injury.\nBut if you’re the optimistic type, maybe a new manager and a new season are all that Spurs need to galvanize this squad and turn things around? Martin Ho certainly has an idea of how he wants his Tottenham Women to play:\n‘I want the team to look exciting. I want to be able to stand and watch my own team and feel the energy and feel the passion and kick and head every ball with them. And yes, the team’s going to be exciting.’\nWe’ll find out if that’s the case today at Brisbane Road.\nLineups\nHow to Watch\nTottenham Hotspur Women vs. West Ham Women\nSunday, September 7, 2025\nBrisbane Road, Leyton, East London\n7:00 a.m. ET / 12:00 p.m. BST\nTV: Not televised (USA/UK)\nStream: ESPN Select (formerly ESPN+), Sky Sports+. The match may or may not be streamed on YouTube… unclear at the moment.",
  "word_count": 373,
  "scraped_at": "2026-02-14T13:32:37.692826"
}