{
  "article_id": "af14697c9239",
  "url": "https://www.jamaicaobserver.com/2024/12/22/christmas-presence/",
  "title": "Christmas presence - Jamaica Observer",
  "date": "20241222T150000Z",
  "domain": "jamaicaobserver.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Christmas presence\nSly: Marry I will; let them play it.\nIs not a comonty a Christmas gambold\nOr a tumbling trick?\nPage: No, my good lord, it is more pleasant stuff.\n— Shakespeare\nA comonty is a piece of land owned by two or more persons, and gambol means to frolic, jump around in a playful way.\nWhat is more pleasant stuff than Christmas? Not many things, despite what those two gentlemen were talking about in the quote above. Yes my friends, it’s almost Christmas, just three days away to be exact, but as far as us Jamaicans are concerned, the Christmas season starts from late October to November, as the thoughts and plans are put into motion.\nIn fact, some merchants start advertising from late September. For the children, it’s the anticipation of getting presents, if they’re fortunate, and for the older folks, it’s the wish of having the presence of others in their lives. As for lonely ladies lacking love, they want both presents and presence.\nYes, my title this week was no mistake or printer’s imp as it’s called in newspaper terms, but is a deliberate attempt to point out the importance of the presence of friends, family, loved ones and lovers at this festive season.\nChristmas can be a lonely time, even made more apparent when people see how others around them are surrounded with the presence of companionship, while they have none. As the song goes, “What do the lonely do at Christmas?”\nIt’s supposed to be a joyous time, but it’s often so sad for some, as they have no one to call their own, nobody to share a drink or meal with, not a soul to hug up and kiss. All they wish for is a presence.\nChristmas presence, that’s our offering today, right after these present responses to what I had to say about ‘High body count’.\nTeerob,\nI’m here twisting up with laughter. This was well written, very informative and witty. But I am in agreement with you, if the numerous body counts were to happen, then the man should take heed of the woman’s past to avoid future ‘mischief.’ Certainly a high body count is a dangerous choice for a good marriage. Even if my brother was a playboy, I wouldn’t want a woman with a high body count to capture him.\nPaulette\nTony,\nDo not be too judgemental and quick to condemn women who happen to have a colourful and torrid sexual history, or a high body count as you call it. Sometimes those women were simply looking for love, but got tricked by numerous men who just wanted them for sexual gratification then moved on. What then should those women do, stop seeing other men because the previous ones let them down? Not everyone finds love on the first try.\nTheresa\nSo, Christmas Day is a few hours away and anticipation is running high for that blessed day. For many, there’s the promise of merriment, lots of food and drink shared by friends and family. But even as the day approaches, strange things occurred in the lead-up to that special day. As the saying goes, ‘There’s many a slip between the cup and the lip.’\nMany men who are up to no good had to start planning their escape strategy from as early as late October to early November. Remember, I told you that the season starts from then.\nSo, all those guys who are players, jugglers who managed to keep many belles of the balls in the air at the same time, started to concoct slippery schemes to let those damsels down gently, without breaking any hearts and leaving them distressed.\nDuring the year he could be like a circus clown and juggle to his heart’s content, but this time of the year is special, as it’s not only presents that the ladies want, but presence as well, his. Maybe he’s married, but even if he’s not, he can only be in one place at one time on Christmas Day, as there’s only one of him to go around.\nSo what he does is spend time with the woman who’s not the main squeeze, but the second string, the side dish, the reserve goalie on a football team. He buys her early presents and also shares his presence with her, spending quality time in the pre-season.\nBut this can backfire, as that woman now feels special, and expects more from him as the season progresses and leads up to Christmas Day. So to temper this, he breaks up the time spent with her, or even in extreme cases breaks up with her, but usually his presence is not as omnipresent in her life at this time.\n“Here honey, here’s your early Christmas present, I’ll be kinda busy with work this season.”\nThat’s another reason those men are called players, for not only do they play with the emotions of women, but they know how to play the game and are masters of illusion. Now you see them, now you don’t, as they master the disappearing trick that rivals that of Mandrake the magician.\nA good angler doesn’t just throw out the line and reels in the catch, but lets the tension on the line relax, gives a little tug occasionally, eases the slack, lets the fish become relaxed and not get too stressed, then gently pulls it in.\nNow you’re going to ask, “How him know suh much?” But that’s for me to know and for you to find out. I wasn’t born yesterday, plus I’m a student of the human condition.\nBy the time those guys are finished with the secondary lady, they’ll have all the time in the world to be with the primary woman, the number one, el numero uno. If he’s married, he can relax and spend all the time necessary with his wife and family, let his presence be felt and be the devoted husband and father that he purports to be.\nThe woman on the periphery though, the satellite side dish who orbits around his life for 11 months out of the year, but reaches the apogee of her orbit, the furthest distance from the man at this time, now has a plethora of problems.\nSure, he may have given her presents and graced her with his presence, but at this time when it matters most he’s missing in action.\n“Every year I go through the same thing; he abandons me with lame excuses.”\nMy advice to you ladies, don’t date married men, but if you do, don’t expect his presence at this time. His priority to his wife and family is non-negotiable.\nWhat often happens though, is that some ladies aren’t involved with married men, but nevertheless are not number one in the man’s life. So even though he’s not married, she’s still treated like the reserve goalie that I mentioned, in a football team, only called upon when the first string goalie is unavailable.\nIt’s so hard having no presence at this time, for you look on and see your friends deeply involved with their significant other, living it up at Christmas, while just like the cheese in the nursery rhyme you stand alone. It can be depressing, and in some jurisdictions suicides increase. Do not take the lack of presence lightly. It’s the type of present that Santa does not bring.\nMen experience it too, but manage to mask it as best as they can. It’s somewhat easier for a man, as he can travel solo or meet up with colleagues to plan a sporting event on that day.\n“Come man, we organising a six-a-side curry goat football game on Christmas Day.”\nSometimes men might even recycle past girlfriends and hook up on that day, if she happens to be free. Sometimes it works, other times it doesn’t.\n“Why are you calling ne on Christmas Eve to see if I’m free tomorrow? Go to hell.”\n“Are you serious, calling me after two years, I’m seeing someone.”\nAt least a man can try, a woman has no such luxury, but is often doomed to spend Christmas Day with no human presence in her life. Those women don’t need presents, but prefer presence at this time.\n‘\nIt’s been a long year\nThe toughest of my life so far\nI’ve tried to feel cheer\nI’m further than the northern star\nSo when you ask me\nWhat I want under the tree\nI just want you with me.’\n— Sabrina Claudio and The Weekend (Christmas Blues)\nChristmas can be a wonderful, joyous time, especially for those who receive presents, but it means far more to those who actually get the gift of human presence in their lives.\nMore time.\nseido1yard@gmail.com\nFootnote: Christmas Day is just hours away and I’m sure that most people are feeling the vibe and looking forward to that special time. Many will have their hopes and dreams fulfilled, while others will not. I wish for you all a very peaceful time with friends, family and loved ones. Enjoy every moment and let us give thanks for all mercies, big or small. Let us also not forget our fellow brothers and sisters who may not have good fortune. Please enjoy the day, have a wonderful season and be kind to all. Thank you for allowing me to be a part of your lives through these pages. That is your gift to me. Merry Christmas.",
  "word_count": 1576,
  "scraped_at": "2026-02-14T12:34:07.667167"
}