{
  "article_id": "af438cc91cd0",
  "url": "https://www.lusakatimes.com/2025/03/25/mumba-leader-with-track-record/",
  "title": "Zambia : Mumba : leader with track record",
  "date": "20250325T024500Z",
  "domain": "lusakatimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "… running for veep once again with his focus on genuine football development\nBy Benedict Tembo\nFor Justin Mumba, his humble personality and strategic football leadership is exemplified and set to inspire the next generation of administrators.\nMumba, the incumbent Football Association of Zambia vice-president is a football administrator of note, with a proven track record that has driven results based on one word – excellence.\nBecause of success and his unmatched passion, Dr Mumba has yet again offered his service to the leadership of FAZ and will be recontesting his position as vice president of FAZ.\n“As a qualified and dedicated football administrator, I have spent over two decades involved and shaping Zambian football through creativity, innovation, and a deep passion for the game. My journey began in 1995 with Zesco United Football Club where I played a key role in the club’s transformation, emanating from a nonentity to a powerhouse in Zambian football,” he says.\nUnder his watch, results were driven through execution with a focused secretariat staff and supportive executive committees.\nWith Zesco as a third force in Zambian, Mumba helped the Ndola based giants win promotion to the Super League in 2004.\nTwo years later, the club won the Mosi Cup in 2006, the Coca Cola Cup 2007, the Barclays Cup (now Absa Cup) a record five times and the Charity Shield four times.\nOther accolades include winning the Super League six times and emerging as runners up five times.\nThe ‘Team Yaziko’ also qualified for the CAF Champion League semi-finals in 2015 and the CAF Confederation Cup quarter-finals in 2016.\n“As FAZ vice-president from 2021, I am proud to be part of the FAZ Executive Committee which had done relatively well during our term,” Dr Mumba said\nDuring his tenture, FAZ implemented the decentralisation of football administration across 10 provinces. Under this arrangement, the provincial executive committees are now managing football programmes within their regions.\n“As FAZ, we have continued giving equipment support and grants to 720 teams across the 10 provinces including the provincial administration, a very expensive but worthwhile undertaking. We want to enhance funding to provincial offices and provincial teams and also through capacity building in provincial leagues to drive strategic direction and business models to Leagues and attract sponsorship,” Dr Mumba said.\nHe said this will enable leagues to improve and make team ready to play in ZPL once they earn promotion to the Premier League and/or sell players to ZPL teams.\n“It is our belief that all provinces get to fully set up provincial teams for u-13, u-15, u-17, and u-20 for both boys and girls to ease the selection of players for junior national teams. Referees match officiating and transport fees in our provincial leagues remain a priority area to motivate them for the work they continue doing,” Dr Mumba said\nHaving been part of the FAZ League restructuring committee that led to the setting up and delinking of the ZPL from FAZ, he believes the ZPL will now run professionally and profitably under its board and grow the ZPL brand to attract more sponsors to make the leagues attractive.\n“The successful league delinking from FAZ shall see our leagues under ZPL grow and our teams will be able to compete and challenge for honours in CAF champion League, Confederation Cup and CAF Women’s Champions League. Our clubs have done it before with Power Dynamos winning the Mandela Cup in 1991, Nkana reaching the finals of the CAF Champion League in 1990 and ZESCO United in 2016 getting to the semi-finals of the CAF Champions League,” Dr Mumba said.\nHe hopes to see women leagues and National Division One (men) grow and attract sustainable sponsorship deals.\n“We can only thank companies and individuals for keeping the game going. We extend our gratitude to the ZPL board for the smooth take off and we believe they will bring in much-needed sponsorship. With modern technology in football, our clubs have not remained behind after FAZ acquired GPS equipment for all Super League clubs for men and women, through the FIFA Forward Programme,” Dr Mumba said.\nHe said further efforts to acquire GPS equipment for the other teams in ZPL (National Leagues for men and women) shall be made so that all ZPL teams are exposed to modern technology to improve our game.\nDr Mumba said at the time of taking office in 2021, the senior national team had not qualified for Afcon three consecutive times despite winning the COSAFA Cup by the senior and junior teams for both genders.\n“I was privileged to be appointed chairman for football development and chairman of the national team’s subcommittees. Our focus was to see that our national teams get back to qualifying for the Africa Cup as a starting point. With the support of the FAZ President and Executive Committee, our teams did relatively well during our four years in office,” he said\nThe under-17 and under-20 boys qualified back-to-back for the Africa Cup and won the Cosafa Cup while the Under 20 girls won Cosafa while the Under 17 girls won the Cosafa and qualified for the World Cup. “The senior women’s team qualified back-to-back for WAFCON, back-to-back for Olympics and qualified for the World Cup. The senior men’s team qualified back-to-back for AFCON and the CHAN,” Dr Mumba said\nHe said going forward, FAZ intends to build on the achievements have national teams to start competing for honours at major tournaments.\n“Efforts have been put in place to find additional sponsors for our national teams to supplement Government support in funding both men and the women’s senior nation teams. Sponsorship will also be extended to junior national teams,” Dr Mumba said\nDuring his term, FAZ facilitated training programmes for coaches in E, D, C, B, A and CAF pro – licenses, training of coaches in scouting to ensure there are coaches in all the 10 provinces for talent scouting/identification.\n“Furthermore, training for referees and match commissioners was conducted. We held workshops for administrators. Plans are underway to bring in CAF and FIFA Instructors to conduct further training and workshops to empower coaches, referees, match commissioners and administrators (provincial excos, ZPL clubs and provincial clubs) so that everyone is brought to speed with modern trends of football in coaching, refereeing and administration,” Dr Mumba said\nHe said football has evolved with technology playing a big part and Zambian coaches and referees need to be up to date if they are to develop football and be able to compete with the best.\n“Through the FIFA Forward funding, FAZ has been able to rehabilitate four stadia albeit with challenges and delayed completion. We also managed to secure a modern luxury bus for the senior men’s national team and GPS equipment for all national teams,” Dr Mumba said.\nHe said the GSP will help with the modern technology used in football.\n“There are plans to build a new Technical Centre with support from FIFA on 90 hectares of land situated in the Chongwe area. Our goal is to have good football facilities across 10 Provinces to ensure the development of talent over the years as well as provincial leagues,” he said\nDr Mumba was honored to have been appointed a member of the CAF youth organisating sub – committee which successfully organised youth tournaments for u-23 in Algeria, u-20 in Egypt, u-17 in Algeria in 2023.\n“This gave me a great experience which shall come in handy when organising tournaments in our country. The committee will this year organise the u-17 in Morrocco and u-20 in Ivory Coast. It’s time to build on what we have achieved and deliver the much-needed results and let our works speak for us,” he said.",
  "word_count": 1285,
  "scraped_at": "2026-02-14T12:34:49.450687"
}