{
  "article_id": "af53bf53ac1b",
  "url": "https://connachttribune.ie/jurgens-pulled-hamstring-is-justice-for-the-human-sponge/",
  "title": "Jurgen pulled hamstring is justice for the human sponge – Connacht Tribune – Galway City Tribune : ",
  "date": "20230504T054500Z",
  "domain": "connachttribune.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "-\n-\nAuthor: Dave O'Connell\n~ 3 minutes read\nA Different View with Dave O’Connell\nEvery dad who has ever stood on a sporting sideline had to feel a small twinge in the back of their leg at the sight of Jurgen Klopp hobbling back with a pulled hamstring after berating John Brooks, the fourth official in Liverpool’s weekend win over Spurs.\nI say ‘dad’ not to be sexist – but because women, for the most part, aren’t the parents who fling abuse and insults in the direction of the officials at football matches.\nAnd it’s also a sort of admission of shamefully bad behaviour in the past.\nIndeed my first thought, as Klopp hobbled back to his seat carrying his leg and embarrassment in equal measure, was that Jurgen could so easily have been me.\nNot at Anfield as the manager of any team obviously, let alone Liverpool; more likely on the sideline in Westside on an inclement Sunday morning, when Corrib Rangers were denied a definite penalty or conceded a goal that was a mile offside.\nThe problem would have been that, if I pulled something, there would be no seat to go back to and recover my walk and my pride.\nIf I had a hamstring problem, there was the possibility of being carried across traffic on the Seamus Quirke Road, through the field where the helicopter lands with actual medical emergencies, over the hospital grounds and into casualty.\nIt wouldn’t be the first time that someone left the sporting field with an injury that required medical attention, but it might be the first time that an animated dad was on the trolley with a mouth problem that led to muscle strain.\nFor more, read this week’s Connacht Tribune.\nConnacht Tribune Digital Edition App\nDownload the Connacht Tribune Digital Edition App to access to Galway’s best-selling newspaper.\nClick HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play.\nOr purchase the Digital Edition for PC, Mac or Laptop from Pagesuite HERE.\nGet the Connacht Tribune Live app\nThe Connacht Tribune Live app is the home of everything that is happening in Galway City and county. It’s completely FREE and features all the latest news, sport and information on what’s on in your area. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play.\nFor more, read this week’s Connacht Tribune:\nConnacht Tribune Digital Edition App\nDownload the Connacht Tribune Digital Edition App to access to Galway’s best-selling newspaper. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play.\nOr purchase the Digital Edition for PC, Mac or Laptop from Pagesuite HERE.\nGet the Connacht Tribune Live app\nThe Connacht Tribune Live app is the home of everything that is happening in Galway City and county. It’s completely FREE and features all the latest news, sport and information on what’s on in your area. Click HERE to download it for iPhone and iPad from Apple’s App Store, or HERE to get the Android Version from Google Play.\nMore like this:\nTeam reveals latest update on excavation at Tuam Mother and Baby Home\nA further 22 sets of infant remains have been discovered as part of the ongoing excavation at the...\nJudge ‘horrified’ at man walkingdown street with samurai sword\nBy Ronan Judge A Judge has said she was \"horrified\" that a man would walk down a busy street i...\nGalway GAA launches Muintir na Gaillimhe 2026 Business Partnership Programme\nGalway GAA is tapping into the city and county’s business community in an effort to maximise supp...\nTeenager refused bail over string of violent incidents\nBy Ronan Judge A teenager accused of involvement in a number of violent incidents in Galway Ci...\nFilm groups ‘must be kept in the picture’ when Pálás reopens\nBy Avril Horan LOCAL film organisations such as the Galway Film Fleadh, the Galway Film Societ...\nTeen drove wrong way around a roundabout\nA Ballinasloe teenager who drove the wrong way around a roundabout was fortunate not to have caus...\n24-year-old accused of involvement in drugs distribution\nBy Ronan Judge A 24-year-old man accused of enhancing the activity of a criminal organisation ...\nAquatic centre facing a €7m gap in funding\nBy Avril Horan THE FUTURE of the proposed regional aquatic centre in Knocknacarra rests on clo...\nUnited boss Caulfield to make changes for away clash with St Patrick’s Athletic\nJOHN Caulfield has hinted at changes to his starting XI when Galway United travel to Dublin on Fr...",
  "word_count": 780,
  "scraped_at": "2026-02-14T13:25:01.489921"
}