{
  "article_id": "af6cb850fb77",
  "url": "https://www.sandiegouniontribune.com/news/nation-world/story/2023-07-30/for-remote-and-laid-back-dunedin-a-warm-welcome-to-the-womens-world-cup",
  "title": "For remote and laid back Dunedin , a warm welcome to the Women World Cup",
  "date": "20230731T050000Z",
  "domain": "sandiegouniontribune.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "DUNEDIN, New ZealandDUNEDIN, New Zealand — Hanging on the edge of the stunning South Island, in one of the world’s more remote countries, sat a scenic, minor-league sized city founded by Scottish immigrants.\nThen, a few weeks ago, one of the world’s biggest sporting events came to town, bringing in thousands of visitors.\nReporter, in a cab: “So, is Dunedin excited for the Women’s World Cup?”\nCab driver: “Yes – and no.”\nWelcome to Dunedin, which at a latitude of 45.88 degrees South is the southernmost city to ever host a match in a soccer World Cup, men’s or women’s.\nIt may also be among the quirkiest spots, a place of contradictions. Locals have been excited to host the Women’s World Cup, but not necessarily to go see a game.\nWith the city about to host its last game of the Women’s World Cup on Tuesday — Netherlands vs. Vietnam with first place in Group E on the line for the Dutch — it’s time for a little tour of what soccer at the bottom of the world has looked like.\nQUIET FANDOM\nDuring Dunedin’s time in the soccer spotlight, there’s been the usual hum of life here: People returning home from work and University of Otago students enjoying beers in the octagonal heart of downtown, fittingly named the Octagon.\n“New Zealanders have their own way of showing interest or passion,” said 78-year-old Ron Palenski, historian and a renowned New Zealand sports writer. “Their support is more low-key.”\nPeople here don’t need to deck themselves out in team apparel to be considered fans, it’s all about what’s in the heart.\n“When it’s a New Zealand team, I am just a devoted fan,” Dunedin resident and retired neuroscience professor Ruth Napper said. “It doesn’t matter what it is. I think it’s about being a small country at the bottom of the world that, you know, we’ve got to stand up and be noticed. And I think on a sports field, we punch above our weight.”\nDunedin’s six matches have all taken place in the covered Forsyth Barr Stadium, nicknamed the Glasshouse, and also known as Dunedin Stadium. Not unlike the cab driver’s “yes and no” answer, while it provides shelter from rain and wind, the stadium has open sides and provides little insulation from the cold.\nAnd while tickets for New Zealand’s match against Switzerland sold out to fill the stadium’s 25,947 seats, attendance at the other matches has ranged from just under 7,000 to about 13,700.\nSOUTHERN HOSPITALITY\nSouthern hospitality isn’t just in the United States. Dunedin is known for its welcoming vibe. People are approachable here, the style is casual and many stay because they love it.\n“I came down here on a trip and basically never left,” said Dan Hendra, Dunedin City Council’s events team leader, who arrived 20 years ago and is originally from Auckland, on New Zealand’s North Island. “I fell in love with the place and how friendly everyone was. The hospitality and friendliness and welcoming of the locals is awesome. That’s why I live here.”\nCertainly, it’s a place to get away from it all.\nThe city of about 130,000 residents is roughly 2,650 miles (4,265 kilometers) from Antarctica, around the distance from New York City to Los Angeles. Souvenir shops sell items that read, “Dunedin: the Riviera of the Antarctic” and “Dunedin: Bottom of the World.”\nFounded in 1848, it’s often called the Edinburgh of the South, as its name originates from “Dun Eideann,” the Scots-Gaelic word for Scotland’s capital city, Edinburgh. Like Scotland, there’s a wildness to the area, and nature is a big draw.\nOn non-game days, Women’s World Cup tourists have explored the Otago Peninsula’s rolling green hills, grassy cliffs and deep turquoise waters, where they watched blue penguins emerge from the surf each night to nest along the beach.\nBlue penguins, or kororā in the Māori language, are the world’s smallest penguins, averaging about 10 to 12 inches (25-30 centimeters) tall and weighing two or three pounds (about 1 kilogram). The area also is home to seals, sea lions, albatross and other native birds.\n“It’s great to show off what we have down here and what we are as a city,” Hendra said. “Given that we are the wildlife capital of the country, that’s something that we are really proud of and love to showcase.”\nGAME DAY\nThe sports scene in Dunedin is influenced by the University of Otago, which was founded in 1869 and now boasts 21,000 students. The Glasshouse, which often hosts rugby matches and other sporting events, has a university student section known as “the Zoo,” which “creates a buzzing atmosphere,” according to 22-year-old Barnaby Kelly.\nMostly, what those students watch is rugby – the most popular sport in this area and New Zealand by a long way. Dunedin was a host city for the Rugby World Cup in 2011.\nNestled in a quiet upstairs space at the Dunedin Railway Station is the New Zealand Sports Hall of Fame, opened in 1990.\nProminently displayed are photos and memorabilia from revered athletes in rugby, cycling, golf, tennis and more. But soccer? There’s only one display — a 6-by-3 glass case.\nEven 13-year-old Izabella Christofoletti, who plays soccer for her school and a club team, and has been a ball girl for several Women’s World Cup matches, can talk about how soccer lags behind rugby in interest. Soccer “is not a well-known sport amongst different areas, so it’s good (the tournament) is here because it creates knowledge of it,” she said.\nNonetheless, when New Zealand played its last match against Switzerland on Sunday, a painful 0-0 tie that knocked the Football Ferns out of the tournament, the fans finally turned out and made noise, stomping their feet and cheering at every chance on goal for the Ferns.\nEven though the result wasn’t what they wanted, New Zealand players were proud of their fans.\n“I think there’s nothing better than Kiwis and especially in Dunedin and a sold-out crowd,” New Zealand midfielder Malia Steinmetz said. “You could hear it, you could feel it. I think they pushed us through a lot in that game.”\n___\nEllen McIntyre is a student in the John Curley Center for Sports Journalism at Penn State.\n—-\nAP Women’s World Cup coverage: https://apnews.com/hub/fifa-womens-world-cup and https://twitter.com/AP_Sports",
  "word_count": 1051,
  "scraped_at": "2026-02-14T12:16:42.412058"
}