{
  "article_id": "af6fe40a7a49",
  "url": "https://www.solomonstarnews.com/pegi-shines-in-fiji-womens-super-league-debut/",
  "title": "Pegi shines in Fiji women super league debut – Solomon Star News",
  "date": "20250730T083000Z",
  "domain": "solomonstarnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Solomon Islands Women’s National Team captain Ileen Pegi has hit the ground running in Fiji, registering a goal and an assist in her debut for Labasa Women’s Football Club.\nThe 33-year-old was instrumental in Labasa’s 3-0 win over Rewa in the Fiji FA Women’s Super League clash at Ratu Cakobau Park in Nausori on Sunday.\nPegi also made history in 2023 by becoming the first female footballer from the Solomon Islands to sign an international transfer deal, joining AS Féminine in New Caledonia.\nIn an interview with Star Sports, Pegi expressed her gratitude for the opportunity to join Labasa and her desire to contribute to the team’s success.\n“I thank God for giving me this opportunity to sign with Labasa. I am grateful and proud, and I’m looking forward to giving my best to help this team,” she said.\nReflecting on the level of competition in Fiji’s top tier women’s league, Pegi noted the competitiveness.\n“The Fiji Super League is quite similar to our league back home, but here, every team is strong and competitive,” she shared.\nPegi, now 33, said she is embracing every opportunity as her career nears its end.\n“I know I will retire one day, so I’m just making the most of every opportunity that comes my way. If it’s God’s will, I would love to reach New Zealand or Australia too,” she said.\nShe also took a moment to encourage young female footballers in the Solomon Islands.\n“Always believe in yourselves, work hard, and never give up. Accept criticism, be willing to learn, and always make discipline a priority. Don’t compare yourself to anyone else because you are unique in your own way,” she added.\nPegi’s strong showing in Fiji follows her recent success in leading the Solomon Islands to their first-ever OFC Women’s Nations Cup title earlier this month.\nBy TIMOTHY INIFIRI JNR\nSolomon Star, Honiara",
  "word_count": 312,
  "scraped_at": "2026-02-14T12:43:54.381869"
}