{
  "article_id": "af7552e07fcf",
  "url": "https://tuoitrenews.vn/news/society/20230626/breakfast-tuoi-tre-news-june-26/74025.html",
  "title": "Breakfast @ Tuoi Tre News June 26",
  "date": "20230626T050000Z",
  "domain": "tuoitrenews.vn",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Read what is in the news in Vietnam today:\nPolitics\n-- Upon his arrival in Beijing to commence his first official trip in China and attend the 14th Annual Meeting of the New Champions of the World Economic Forum, Vietnamese Prime Minister Pham Minh Chinh on Sunday afternoon paid a visit to the Vietnamese Embassy in the countrty and engaged in discussions with the Vietnamese community there.\nSociety\n-- A bus transporting about 30 members of the youth football team of Quang Nam Province in central Vietnam on Saturday experienced brake failure and flipped over on the Vi O Lak pass, situated at the border of Kon Tum and Quang Ngai Provinces, resulting in the tragic death of one player and the hospitalization of several others.\n-- A delegation of Ho Chi Minh City high-ranking officials led by secretary of the municipal Party Committee Nguyen Van Nen toured the Seine River on Sunday morning (France time) to take a survey on the planning and development of the Saigon River embankment and its economic services.\n-- Two groundbreaking ceremonies for a section of the Ring Road 4 project in Hanoi and the first phase of Cao Lanh-An Huu Expressway in the Mekong Delta province of Dong Thap were held on Sunday.\n-- A male student went missing during a traditional swimming competition that proceeded as planned despite heavy rain in Dong Trieu Town, Quang Ninh Province, northern Vietnam on Sunday.\n-- Residents of Nghi Loc District have prevented trucks from entering or exiting Vissai seaport in Nghe An Province, north-central Vietnam for two days over unresolved concerns relating to environmental matters and resettlement.\nBusiness\n-- The Vietnamese government’s standing committee has urged the arrangement for transitioning the ownership of Vietnam Air Petrol Company Limited (Skypec), with a capital of VND800 billion (US$34 million), from Vietnam Airlines to the state-run Vietnam Oil and Gas Group (PVN) in order to restructure the national carrier and address its ongoing significant financial losses.\nSports\n-- Vietnam defeated hosts Indonesia 3-2 in a thrilling match on Sunday evening, thereby clinching the championship title of the 2023 Asian Volleyball Confederation Challenge Cup and securing qualification for the FIVB Women’s Challenge Cup.\nWorld news\n-- One person was killed and nine injured, including children, in a roller coaster accident at the Grona Lund amusement park in the Swedish capital of Stockholm on Sunday, Reuters quoted representatives of the park as saying.\nLike us on Facebook or follow us on Twitter to get the latest news about Vietnam!",
  "word_count": 419,
  "scraped_at": "2026-02-14T12:29:38.674370"
}