{
  "article_id": "af7a5475abd7",
  "url": "https://www.historyextra.com/period/british-empire-exhibition/",
  "title": "The British empire last hurrah ? Why an epic celebration of imperialism in 1924 failed to mask a superpower in decline",
  "date": "20240926T131500Z",
  "domain": "historyextra.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The British empire’s last hurrah? Why an epic celebration of imperialism in 1924 failed to mask a superpower in decline\nIt featured exotic pavilions, sporting spectacles and even a replica of Tutankhamun’s tomb. But, as Matthew Parker explains, when the British Empire Exhibition opened its doors in Wembley a century ago, it also spoke of a superpower in decline\nIn the summer of 1924, Scientific American’s ‘Special Correspondent in Great Britain’ warned his readers that, “the size and scope of the British Empire Exhibition, like the British empire itself, is almost too big to be grasped”. Within a vast area of 216 acres – 10 times the size of the famous Great Exhibition of 1851 – the “industries, manner of life and art of the 460 million people of the British empire [were] represented”. The reporter was not only awestruck by the organisers’ ambitions of attracting 46 million visitors during its initial six-month run, but the sheer scale of the exhibits themselves. Constructed in Wembley Park, north-west of London, the sprawling site included “by far the largest sports arena in the world”, “two palaces of industry and engineering”, as well as the latest “developments in telegraphy, telephony and wireless communication”.\nBut that wasn’t all: there were working models of timber mills, oil wells and mines of all descriptions, as well as sheep stations, ostrich farms, rice paddies and cotton fields. In the exhibition’s Canadian Pavilion, visitors could view a mocked-up Niagara Falls and a life-sized refrigerated butter statue of the Prince of Wales, while the Indian Pavilion boasted snake charmers, acrobats, jugglers and veiled dancers. To the south of the site, in the Empire Stadium, visitors could watch military tattoos, historical pageants and Wild West rodeos, before enjoying the delights of the exhibition’s 47-acre fairground. In another corner, there was even a replica of Tutankhamun’s recently opened tomb.\nOther commentators feared that visitors might experience sensory overload once they had paid their one shilling and sixpence entrance fee and clicked through the turnstiles. Indeed, Eric Pasold – a recent immigrant from central Europe – remembered being “overwhelmed” as he made his way around the exhibition and jostled with “Nigerians in their colourful robes, cowboys from Calgary, dusky east African beauties, Indians, Malays, Chinamen, Australians, New Zealanders and Fiji islanders”. And yet, he was also left feeling inspired. “All were members of one great empire, united under one king and flag, linked by the English language, financed by sterling, ruled by British justice and protected by the Royal Navy. How proud they must all feel, I thought, and how I envied them.”\nImperial glamour\nPasold’s words would have no doubt delighted the exhibition’s government-appointed organising committee. The extravaganza, opened by King George V on 23 April 1924, sought to celebrate the British empire and its constituent parts. More than 50 of the empire’s territories were represented with displays or specially constructed pavilions, with other exhibits supplied courtesy of the event’s commercial partners. Pears’ Soap, for instance, had a kiosk featuring actresses dressed as Helen of Troy, Cleopatra and other “beautiful women from history”.\nBeneath the frivolity, though, the exhibition’s rhetoric suggested that nothing had been changed by the Great War, and that the certainties of the Victorian and Edwardian ages – the power and unity of the empire, the loyalty of its subjects, its old hierarchies, and even the glamour of imperialism itself – were alive and well. The Times newspaper was convinced: how could visitors fail to “feel pride [in] the unity and the power of the British nations?”\nBut not everyone was converted. The exhibition was lampooned by Punch magazine, and pretty much ignored by the left-leaning New Statesman. For the Daily Herald, the performance of ‘Rule Britannia’ at the exhibition’s opening ceremony, as well as the involvement of imperialist author Rudyard Kipling, who named the site’s interconnected streets, made the spectacle particularly offensive. “Opportunist politicians have made the word ‘patriotism’ stink in the nostrils of thousands of decent men and women,” the paper declared. “To this debased spirit we owe many unnecessary wars, the loss of much valuable blood.”\nFor some, the exhibition’s military displays – which included reconstructions of famous battle scenes from British history and narratives of heroic martial adventure – sat uneasily in the shadow of the western front. Even the composer Sir Edward Elgar, who conducted performances of ‘Jerusalem’ and then his own ‘Land of Hope and Glory’ at the opening ceremony, described the pomp as being “irredeemably vulgar”.\nPerhaps unsurprisingly, there was a strong level of distaste for the exhibition among North London intellectuals, who went as far as to form a society in opposition to the exhibition: WGTW, or ‘Won’t Go To Wembley’. Novelist Virginia Woolf did deign to visit, but concluded that it was an “outmoded piece of antiquated fiction”.\nIn many respects, Woolf was right. The British Empire Exhibition was part of a longer tradition of public spectacles, going all the way back to the Great Exhibition of 1851 – a time now seen as the apex of Britain’s industrial and commercial supremacy. Back then, there had been very little emphasis on the colonies – the focus had instead been on international industry and technology. But in 1886, as belligerent popular patriotism coincided with a new wave of imperial expansion, South Kensington played host to the Colonial and Indian Exhibition – the first of its kind to be funded with government money, and thus made ‘official’. Here, foreign exhibitors were replaced by an emphasis on the raw materials of the colonies, and ethnographic displays of ‘native’ art, archaeology and religion. And to give the proceedings an added air of authenticity, colonial peoples were shipped in and ‘installed’ in mocked-up villages or temples.\nGetting the show on the road\nBy the end of the 19th century, such exhibitions were a worldwide phenomenon, and whether they were held in Britain, France, the United States or lesser colonial powers such as the Netherlands or Belgium, they sought to demonstrate their home country’s military and technological dominance over their territories, as well as their knowledge of and care for ‘native’ cultures. In addition to these official exhibitions, private sector commercial exhibitions became almost annual events at London venues such as the Crystal Palace and Olympia, along with other, imperial exhibitions of an explicitly theatrical nature.\nMost of the latter were staged by the Hungarian impresario Imre Kiralfy, who had worked with the American showman PT Barnum, and was very much part of the spectacular theatre movement of the time. Kiralfy’s productions often had a strongly orientalist style, bringing the wonders of exotic faraway places to a single site, with architecture of temporary wood and plaster not unlike a Hollywood film set. Notably, in 1899, he staged the Greater Britain Exhibition at Earl’s Court, which included re-enactments of recent colonial battles and tableaux with titles such as ‘Savage South Africa’. And later, Kiralfy would be consulted by the planners of the British Empire Exhibition, which attempted to bring these ‘official’, ‘commercial’ and theatrical traditions together in one location.\nGetting the Wembley venture off the ground, however, would prove to be a lengthy process. The initial idea for the exhibition had first been mooted by the imperialist British Empire League in 1902, only to be killed off by the Liberal Party’s landslide election victory in 1906. The concept was then briefly revived in 1913 by uber-imperialist Lord Stathcona, before the outbreak of the First World War put an end to the plans once again.\nIn May 1919, however, the British Empire League hosted a lunch attended by all the Dominions’ high commissioners, as well as Australian prime minister Billy Hughes. Recalling the League’s original 1902 resolution, Hughes declared that a new exhibition was “essential” to promoting unity with the empire, and reigniting the spirit that had won the war and would pave the way for the reconstruction that lay ahead. According to Hughes, there was an educational imperative, too: “The depth of ignorance of the different parts of the empire about each other [is] rather appalling.”\nFraying at the edge\nsThus, the manifesto that emerged for the new exhibition, as outlined in the official guide, was to “foster inter-imperial trade… To make the different races of the British empire better known to each other, and to demonstrate to the people of Britain the almost illimitable possibilities of the dominions, colonies, and dependencies overseas.” Its main aims, then, were economic, and to inspire, educate and entertain. All these factors, however, would prove problematic.\nIn sharp contrast to the Great Exhibition of 1851, the economic aims of Wembley spoke more of desperation than dominance. Burdened by war debt and unprecedented mass unemployment, Britain had also lost a considerable share of world trade to Japan and the United States. Most importantly, the European market – on which exporters relied far more than the empire – had pretty much disappeared due to political unrest and hyper-inflation. The slightly vain hope was that trade within the empire could make up the shortfall. It was a short step from this to what the exhibition seemed to promise: the empire as not just a mutually beneficial unit, but an economically exclusive one, too.\nThis was certainly the ambition of most of the Dominion leaders. New Zealand prime minister Bill Massey reckoned that “the exhibition [would afford] striking proof of the empire’s capacity to become self-supporting”, and that the countries of the empire would “learn to buy from each other rather than from outside”. But the 1923 general election had shown that this was a non-starter: an exclusive empire of commerce meant the introduction of tariffs. Dominion leaders had called for such measures the previous autumn, and prime minister Stanley Baldwin’s small accessions to these demands had been enough for him to lose power – no one was going to vote for more expensive food.\nFurthermore, recent events had shown that the exhibition’s promotion of military unity was also something of a sham. During the Chanak Crisis of September 1922, the then prime minister David Lloyd George had pledged Dominion troops to join what looked like a possible war against Turkey. But of the empire’s constituent parts, only New Zealand responded favourably. South Africa didn’t even acknowledge the request, and Canada replied by stating that it was a matter for its own parliament to decide. Then, at the 1923 Imperial Conference in London, there had been no agreement on a shared foreign policy, and Canada even refused to guarantee military help if any part of the empire was threatened. All the conference had agreed on in terms of unity was shared loyalty to the monarch – a situation that The Times considered “very worrying”.\nEach of the Dominions, to varying degrees, were asserting their autonomous identities – something that was reflected in their contributions to the exhibition. At the nations’ requests, the historical pageants staged about Canada and South Africa were rewritten to explore the multiple historical origins of their nations, rather than just the British involvement. In their pavilions, too, the Dominions took the opportunity to display and celebrate their independent industries, wealth, landscapes and cultures.\nTusks and technology\nIn previous imperial exhibitions, the Indian pavilions had always been relied on to provide a taste of the ‘exotic’. But at Wembley, among the inevitable elephant tusks, animal heads and traditional crafts, there were railway and telecommunication displays that aimed to show India as advancing both industrially and technologically. The Government of India Act of 1919 had gone a considerable distance towards granting self-rule – at least at a provincial level – and since then, such had been the level of unrest and protest that most of the British in India believed that the game was up.\nBut the exhibition’s official guide was having none of it. While inviting the British visitor to have pride in the way the imperial project in India had created a story of “progress” and of a victorious fight against “ignorance, famine, flood and pestilence”, it described the India Pavilion as having “the majesty of the east [and] also some of its mysticism”.\nThe exhibits of Malaya (encompassing parts of modern-day Malaysia and Singapore), Ceylon (Sri Lanka) and Burma (Myanmar) were also seen through the prism of the exotic and primitive, clearly inferior in the imperial hierarchy and frozen in time. “If you are looking for romance at Wembley, you have to travel east,” The Times reported. Here, perhaps more than anywhere else, Virginia Woolf’s “outmoded” criticism rang true. Malaya, one of the empire’s richest colonies, was producing tin and rubber on an industrial scale, and the island of Singapore had one of the most important ports in the world. Meanwhile, in Burma and Ceylon, as in India, political reform had enfranchised significant parts of the populations.\nEven more than the ‘exotic’ east, the West Africa exhibit attracted comment by journalists who wanted to have their outmoded prejudices confirmed. No Africans were consulted about the make-up of the exhibit, even though it was paid for out of the colonies’ revenue. Inside its replica walled fort, based on Kano and Zaria in Northern Nigeria – an area of indirect rule that had nothing to do with the region’s ever-increasing political activity – were three villages representing Nigeria, Sierra Leone and the Gold Coast (Ghana).\nInside, lived some 60 Hausa, Yoruba, Mendi, Ashanti and Fanti people who, during opening hours, demonstrated local skills in weaving, dyeing, metalwork, woodcarving and pottery. This was interpreted by The Illustrated London News as “African industries as encouraged under British rule”, which “[had] turned the native from a savage into a civilised being”. A journalist for the Evening News went even further. “Civilised government,” he wrote, had only recently ended “cannibalism, slave-trading [and] obscure black-magic rites of almost incredible barbarity.”\nThe Evening News article prompted a complaint from Ladipo Solanke, representing the Union of Students of African Descent (USAD), a recently formed alliance of London-based West African and Afro- Caribbean student groups, who were already irked that visiting friends and relatives were finding it almost impossible to locate hotels that took ‘coloured’ people. But the complaint did nothing to stop the deluge of racist cartoons, picture captions and articles in the popular press, all of which placed Africans at the bottom of the cultural hierarchy.\nRacist cartoons, picture captions and articles all placed Africans at the bottom of the cultural hierarchy\nAlarmingly, the exhibition had also prompted a rush of racist songs. One, entitled ‘In my little Wigwam, Wembley Way’, had the lines “[T]here you will find me in a costume gay / In charge of the girls from Africa / All they wear is beads and a grin”, before referencing “dusky Eves”, “dressed in nothing but leaves”.\nThe tipping point, however, arrived when the Sunday Express printed a piece entitled ‘When West Africa Woos’. Through an interpreter, one of the newspaper’s journalists had arranged an interview with a woman residing inside the exhibition, Akosua Baa – the daughter of the Ashanti queen mother – only to ask her a series of blunt questions about sexual practices and native marriage rituals. Complaints to the Colonial Office got nowhere, but the Gold Coast Governor intervened and had the press barred from the West Africa exhibit.\nSporting spectacles\nDespite the press ban, the West Africa exhibit remained one of the event’s most popular attractions, in part due to its proximity to the newly constructed Empire Stadium. From the earliest planning stages of the exhibition, the idea had been to include a “great national sports ground” capable of hosting football matches, and thereby attract members of Britain’s working classes. The 125,000-capacity venue – the predecessor of the modern-day Wembley Stadium – had even been completed early enough to stage the FA Cup final between Bolton Wanderers and West Ham United in April 1923.\nMaking sure that people from a variety of socio-economic backgrounds could access the exhibition was paramount. The franchise had only been extended to all men over 21 (and most women over 30) in 1918, and their support of the imperial project was crucial if the empire was to have a healthy future. “In a democratic age, everything depends on public opinion,” wrote the Independent Conservative politician Lord Robert Cecil. “This means that the public must have an opinion on international affairs, and that its opinion must be right.”\nOverall, the attractions needed to highlight the benefits of the empire, and make it seem exciting for a new and more cynical postwar generation, considered by some of the ruling class to be less inclined to respond to calls for patriotism – and by most to be ignorant. HG Wells, for instance, reckoned that 19 out of 20 Englishmen knew no more about the British empire than they did about the Italian Renaissance – a type of criticism that led the exhibition’s guide to claim that the visitors would learn more about the empire in a few days than several months of travel.\nYet cynics pointed to the fact that the most popular attractions – the Queen’s Dolls’ House, the Wild West Rodeo, the dance pavilions and the amusement park – had little or nothing at all to do with the empire. Indeed, in his 1924 short story The Rummy Affair of Old Biffy, PG Wodehouse sends Bertie Wooster to Wembley, where he is quickly bored by “the spectacle of a stuffed porcupine-fish or a glass jar of seeds from Western Australia”, and instead takes “a quiet sneak in the direction of that rather jolly Planters’ Bar in the West Indian section”. Similar scenes also made their way into theatre: “I’ve brought you here to see the wonders of empire,” complains the father in Nöel Coward’s This Happy Breed, “and all you want to do is go on the dodgems.”\nIn terms of attendance, the exhibition was a disappointment, failing by some margin to meet the hopes – and budgeting – of the organisers. In 1924, there were some 18 million visitors. Facing a large deficit, it opened again the following year, attracting 9 million people before closing permanently on 31 October 1925. Unlike the hugely profitable Great Exhibition of 1851, Wembley in 1924–25 made a considerable loss.\nThe sun never sets?\nDespite these setbacks, it would be wrong to conclude that this necessarily pointed to a British public weary of or antagonistic to empire and all it entailed. Twenty-seven million was still a considerable number, representing more than half the then population of Great Britain. The exhibition also garnered huge coverage in the press, far more than the other large exhibitions that followed: the Glasgow Empire Exhibition of 1938, the Festival of Britain of 1951 and the Millennium Experience of 2000. More than 2,000 articles about the British Empire Exhibition appeared in The Times from 1923 to 1925.\nFurthermore, the opinions of intellectuals like Virginia Woolf were far from representative. The mass middlebrow culture of interwar Britain was largely traditional, representational and conservative, and the antithesis of modernist preoccupations. Youth literature in the adventure tradition remained replete with militarism and patriotism, while the displays and re-enactments at the exhibition drew huge crowds.\nThe unifying principle of empire as expressed by the exhibition – the monarchy – also continued to be popular. At least 6 million people tuned in to the new BBC to hear the radio broadcast of King George V’s speech at the opening ceremony, and ordinary people still frequently hung pictures of the monarch and his wife, Queen Mary, in their houses. You could even argue that an enduring pride in the empire, a heroic view of its wars and the popularity of the monarchy survives in many quarters to this day.\nAs for the exhibition itself, revisiting it a century later provides an intriguing snapshot of an empire torn between looking backwards or forwards – and ignorant of its looming collapse.\nMatthew Parker is the author of One Fine Day: Britain’s Empire on the Brink (Abacus, 2023)\nThis article was first published in the May 2024 issue of BBC History Magazine",
  "word_count": 3337,
  "scraped_at": "2026-02-14T12:33:01.417597"
}