{
  "article_id": "af81a1aaa498",
  "url": "https://wwd.com/footwear-news/shoe-features/noah-lyles-medals-track-field-championships-adidas-1238342377/",
  "title": "Noah Lyles Talks Gold Medals , Adidas and Breaking Boundaries in Athletics",
  "date": "20251111T181500Z",
  "domain": "wwd.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "On a warm and sunny October afternoon, a reflective Noah Lyles sits near his locker at the National Training Center in Clermont, Fla., a suburb 22 miles west of Orlando where he practices with Adidas’ Pure Athletics Team.\nThe American runner replays a conversation he had with fiancée Junelle Bromfield a few hours earlier — right after Lyles found out he was nominated by World Athletics as Male Track Athlete of the Year. (He was later named a finalist, and a fan vote determines the ultimate winner named Nov. 30.)\nLyles’ response to the nod belies the confidence he’s known for: shock. Bromfield, a Jamaican sprinter, set Lyles straight, rattling off his long list of recent accomplishments: the most medals at the 2025 World Athletics Championships, two of them gold; an undefeated streak in the 200-meter race; a sixth Diamond League title.\nYou May Also Like\n“Some good points,” Lyles says in falsetto for emphasis. “I was just so focused on trying to be in the best\nshape of my career for Worlds that I didn’t get to look at the season as a whole. Now that I’m looking back, I actually got a pretty good chance of winning this thing.”\nLyles is in full recovery mode after his impressive performance at the championships in late September. He won both the 200m and 4 x 100m relay and came in third in the 100m event. For six weeks, he has time off from the track — except for today, when he’s back at the training facility and in his element for an FN cover shoot.\nThe 28-year-old veteran arrived 15 minutes before his call time in a black 100 Thieves x Adidas jersey, waxed denim Demobaza combat trousers and Raf Simons x Adidas sneakers, the bottom two pieces both bright red. They’re in constant rotation — Lyles approves of outfit repeating.\nBoth the jersey and sneakers, as well as the Y-3 looks he changes into for some of the photos, are indicative of the range the athlete has as a face for Adidas, his sponsor since 2016.\nThe brand regularly flexes its performance muscle with Lyles’ race-day ensembles and track cleats, and it has recently started leaning into his fashion cred by putting him in campaigns for the Climacool, a 3D-printed lifestyle shoe, as well as a 100 Thieves collab. Lyles is a passionate gamer, making him a natural partner for the esports and lifestyle brand.\n“Noah is more a part of mainstream culture than almost any other track and field athlete,” said Patrick Nava, global vice president of product management for Adidas Running. “Not many athletes extend beyond the sport. It’s not like football or soccer or basketball where you have plenty of these personalities.”\nA Long Run\nIt’s been a little more than a year since the Paris Olympics, when Lyles became one of the standout athletes with his captivating win in the 100m race. His explosive entrance — he ran, jumped and pumped up the crowd as he arrived on the track and showed off his painted nails — only seemed to enhance his performance.\nA photo finish left the winner unclear for roughly 30 seconds before the official results came in, and even the TV announcer initially thought competitor Kishane Thompson of Jamaica had prevailed.\nAn elated Lyles planned to compete for three more gold medals, but just days later, the tide turned quickly when the sprinter, who has battled asthma since childhood, tested positive for COVID-19. Lyles kept it quiet and still managed to nab a bronze in the 200m race. But that would be his last event at the Summer Games.\nGetting back in shape this year proved to be more challenging than expected. Lyles is still managing a tendon issue that caused him to delay training. He started the season in July, just two months before the World Athletics Championships, rather than in May.\nDuring the setback, he fasted for a period and took the opportunity to reconnect with God. “I was in a better position mentally and physically, and I was able to quickly adapt,” Lyles said. “A younger Noah would have definitely found himself in more of a, ‘Whoa, what is this situation? Why is this happening? Why is it taking so long?'”\nLyles has been candid throughout his career about how anxiety and depression have affected him, particularly during the 2020 Olympics (held in 2021 because of the pandemic). Looking back, he believes taking on too many sponsors, with their subsequent requirements, played a part in him feeling overwhelmed.\nWith age and perspective, his mindset has clearly shifted. Because of the truncated time to prepare this year, neither the athlete nor his coach, Lance Brauman, are hung up on the bronze finish in the 100m. (Jamaicans Oblique Seville and Thompson won gold and silver, respectively.)\n“We’re both very pleased considering those guys are running fast enough that you have to be 100 percent. If you miss that amount of time, you’re not going to be,” said Brauman, a quiet force who’s been working with Lyles for as long as he’s been at Adidas. “I thought Noah did a very good job of getting back to the point where he could get on the medal stand and then put himself in a position to win the 200m.”\nBy winning the 200m race for the fourth consecutive time at the World Athletics Championships, Lyles has joined track legend Usain Bolt as the only person to achieve such dominance in the race. On top of the hardware, Lyles thinks he had some of the best starts and corners of his career — the former of which has been an area of emphasis since 2022.\nIn a press conference after the race, the sprinter said, “I can’t wait for 2027 to become the only man to win five 200m titles.”\nWithout a world championship or Olympics to compete in, 2026 will be a down year of sorts, providing Lyles with the opportunity to build a strong base for those competitions in 2027 and 2028.\nOff the track, Lyles is already busy plotting some new goals — he thinks 10 years in advance — but isn’t yet ready to reveal those plans. “A lot of my ideas are very out of the box,” he said. “And I just have to make sure that I can actually make them come true first before I start talking about them.”\nOne clue about his intentions came during an interview on sports show “Speakeasy” last month, when Lyles said he needed one more Olympic gold in the 100m before he can lay claim to the title of America’s “best sprinter of all time.”\nWhat he’s less coy about discussing might be even more ambitious: a desire to remake the sport for himself and his peers.\nMaking Track Cool\nSo far, the breakthrough Lyles is most proud of is bringing the “tunnel style” movement to track. NBA and NFL players were getting attention for their pre-game looks, and in 2022, Lyles decided he wanted in on the action.\nI’m looking at outfits of athletes walking into big championships or finals, and I’m like, ‘I got better outfits than these’,” he said. “Where are my ‘fits?”\nLyles began to push track meet organizers to stage photo opportunities as he arrived for races. Despite the clear proof of concept in other sports, he encountered pushback, but eventually the tunnel moments became commonplace.\nOn top of securing more attention for what he wears before a race, Lyles has brought more intrigue to what’s on his feet for the main event. Typically, running spikes don’t get as much attention as basketball sneakers or even the shoes worn by long-distance runners.\nBut for his 100m gold medal at the Olympics, Lyles wore a pair from Y-3. And at this year’s World Athletics Championships, the Three Stripes on his electric green shoes were embellished with pearls.\n“He’s very specific in the amount of stiffness he wants in the shoe, energy return, comfort — really down to stuff that is in the fraction of inches,” said Nava. “It’s a part of his persona, and it’s not just about the performance. It’s also about the way it looks, almost like a great racing car.”\nOutside of his ’fits, one of Lyles’ other attention-grabbing moves is pulling Yu-Gi-Oh! (the Japanese\nmanga series) cards out of his singlet immediately before races. “I’ve gotten hotel upgrades because of that. That’s for pulling out the ‘Blue-Eyes White Dragon’ [one of the most mythical cards in the game] and not because I’m a living champion,” he joked.\nEstablishing himself as more than a sprinter has been a natural consequence of Lyles being unceasingly true to himself in the public eye. But it also was an intentional part of his effort to grow the sport, much like the display of showmanship prior to his Olympic gold. His other dimensions give people who might not otherwise be interested in track a reason to root for him.\n“I have music, I have anime, I have fashion. They resonate with someone,” Lyles said. “My brother and his fiancée said they were at church yesterday and someone said, ‘Oh, I love Junelle and Noah. They’re the reason I started watching track and field.'”\nFor the 2023 World Athletics Championships, Lyles took it upon himself to sell his own commemorative merchandise. The idea came to him during his research of other sports, which ultimately led to his infamous “world championship of what?” quote criticizing the NBA — a league consisting exclusively of teams in the U.S. and Canada — for billing the winner of its finals as the best in the world.\n“They’re ready for the moment. They have hats and shirts that all say ‘World Champion’ or what not. And I was like, ‘Why am I not doing that?'”\nAdidas is leaning into the off-track persona with product, having recently worked with Lyles and Crunchyroll, an anime streaming service, for a collaboration of lifestyle apparel with illustrated graphics of him. The tagline: “The fastest anime fan in the world.”\nIt’s that kind of marketing that is attractive to Lyles, who attended the second edition of Athlos, the women’s only track and field event in New York City, this fall. He’s jealous he couldn’t compete and said it was probably the best meet he’d ever attended. Fans on their feet, celebrity attendees, strategic camera angles, musical performances — these are the kinds of elements Lyles believes more track and field events should embrace.\nA big part of the challenge, in his eyes, is that there’s no true league. Instead, there are individual meets with their own directors and no unifying element. World Athletics sets the rules, handles drug testing and organizes the championships, among other duties, but still doesn’t have the power to make the more sweeping changes Lyles thinks track and field needs.\nThe future Lyles wants to see would come via a player-owned league. He’d also like a say in what the field of competitors looks like.\n“I don’t want to run in a race with a high schooler. I’m a professional athlete. I got an image to uphold,” he said. “There’s a few too many things that just need more direction, and I would very much like to have a league where we can change that and have ownership.”\nEven a system more akin to most professional sports in America, in which there are contracted revenue splits between team owners and the players, would be a huge step up in Lyles’ eyes. “We can’t even unionize because we’re contractors, not employees,” he said.\nWhen it comes to more personal goals, Lyles has been vocal about his pursuit of a signature shoe with Adidas. Nava said he couldn’t confirm any details on the matter but wouldn’t rule out a shoe happening, adding, “We’re excited to explore any opportunity with Noah.”\nNo precedent exists for sprinters getting signature models, and there’s a case to be made against it because they compete in spikes, a category that isn’t exactly moving vast units and doesn’t have a lot of fanfare around it outside of big races.\nWhen asked if he’s still pushing for it, Lyles said succinctly: “Keep your head up and your eyes open. I think 2026 will be very big.”",
  "word_count": 2052,
  "scraped_at": "2026-02-14T14:21:22.603788"
}