{
  "article_id": "afbf3f0070d1",
  "url": "http://www.eastcountymagazine.org/comment/50431",
  "title": "FOUR CANDIDATES NOW IN RUNNING FOR TWO SEATS ON LA MESA CITY COUNCIL",
  "date": "20240822T223000Z",
  "domain": "eastcountymagazine.org",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "By Miriam Raftery\nPhotos, top left to lower right: Kristine Alessio, Genevieve Suzuki, Lauren Cazares, and Shawn Townsend.\nAugust 22, 2024 (La Mesa) – Former La Mesa City Councilmember Kristine Alessio is the latest to file papers to run for the La Mesa City Council. The three other candidates in the race, previously profiled by ECM, are Lauren Cazares, Genevieve Suzuki, and Shawn Townsend.\nLa Mesa’s City Council will have two new members after the November election. That’s because Councilman Jack Shu is retiring and Councilman Colin Parent, whose term expires, is running for State Assembly. The top two vote-getters will fill the seats.\nHere are highlights of the four candidates vying for the two open seats, hoping to represent La Mesans.\nKristine Alessio: An attorney and small business owner with a background in real estate and land use, Alessio spearheaded several local initiatives on the Council. Those included including term limits, the Climate Action Plan, the PARS pension liability paydown plan, the Smoke Free La Mesa ordinance and the Affordable Homes Bonus program. A native La Mesan who raised her daughter here, she also directs a nonprofit cat rescue organization.\nOn the Council, she had a reputation as a moderate. Elected as a Republican, Alessio left the party briefly during the Trump administration but later returned to the party when she ran unsuccessfully for Mayor in 2022.\nOn her candidate statement, she says she is running to bring positive change focused on three priorities: streets(from repairing potholes to improving public transit and pedestrian infrastructure), “responsible” development including “championing preserving neighborhoods” with high standards for design, and safety (including community engagement and investing in prevention as well as expanding the police force for more effective response).\nShe also wants to give the Community Development Departmentguidelines for neighborhood engagement on large and small development projects. \"The City, not Facebook or Next Door, needs to be engaging and informing you,\" Alessio says.\nGenevieve Suzuki\nSuzuki is an attorney, journalist and active community volunteer endorsed by the San Diego County Democratic Party and prominent Democrats including Councilmembers Parent and Shu. She has practiced law in La Mesa for 10 year and now leads a law firm in San Diego. She was named a Rising Star by Super Lawyers, one of San Diego’s top young attorneys by the San Diego Daily Transcript, and one of San Diego Metro Magazine’s Top 40 Under 40. She received her law degree from California Western School of Law in San Diego.\nSuzuki was former editor-in-chief of the La Mesa Courier, holds a journalism degree from the University of Hawaii, and is co editor of San Diego Lawyer Magazine, a publication of the County Bar Association.\nShe and her husband, Derek, have lived in La Mesa for 15 years. If elected, she would be the first Asian-American Pacific Islander woman on the Council.\nShe has also been an active community volunteer, serving more than a decade on the City of La Mesa Community Services Commission, on the board of directors for the La Mesa Park and Recreation Foundation, and president of the Parent-Teacher Group at St. Martin Tours Academy, where she is a parish member and her two children have been students.\nSuzuki calls La Mesa a “fabulous community with a unique identity.” She says she is running to do more to make the city “safe, prosperous, and welcoming for families, workers, and small business owners.”\nLauren Cazares\nAs policy advisor at the San Diego Regional Chamber of Commerce, Lauren Cazares specializes in environment and sustainability, education and workforce, small business, and economic development. Cazares is endorsed by the County Democratic Party and numerous Democratic officials, including Councilmembers Parent and Shu.\nShe has volunteered to serve on the La Mesa Community Police Oversight Board, San Diego Community Power advisory committee as La Mesa’s representative, San Diego Leadership Alliance board, as well as volunteering with the League of Women Voters, MTS Community Advisory Committee, and more.\nDaughter of small business owners and granddaughter of Latino immigrants, her passion for politics began in her youth. Later, her political experience included working for San Diego Mayor Todd Gloria as director of scheduling and administration, and as his campaign manager and fundraiser.\nShe holds a bachelor’s degree in political science and women’s studies from Point Loma Nazarene College, where she graduated cum laude and has worked toward equality for students and faculty. If elected, she would be the first openly LGBTQ+ member of the La Mesa City Council. She also has a background in arts and sports, including dance, theater and soccer.\nCazares says, “As a lifelong La Mesan , I am committed to the quality of life for all La Meas residents by enhancing public safety, keeping our city clean, and promoting smart growth to ensure that local business can flourish and working families can enjoy all that our beautify City has to offer,” adding that she aims to make the “Jewel of the Hills sparkle.”\nShawn Townsend\nShawn Townsend is the CEO of Reflection Training Gear and a former clinical exercise physiologist at Nellis Air Force Base, according to his Facebook page. He has also worked as a fitness instructor at the Navy Base in San Diego, at the Navy Seal Base, and at private fitness companies.He studied psychology at the University of North Carolina at Chapel Hill as well as sports and exercise science at San Diego State University.\nAs a city council member, Townsend says he would strive to promote policies that encourage healthy lifestyles, support local businesses, and enhance the quality of life for all residents. His priorities would include fiscal responsibility, transparency, and collaboration to ensure that La Mesa thrives for generations to come.\nTownsend says since making the decision to run for office in 2022, “I have incorporated my campaign into my training for the 2023 Triple Crown, a challenging series of three half marathons.” As a result, he says, “In less than a year, I had the privilege of running on every street in La Mesa, gaining firsthand knowledge of the city's infrastructure, neighborhoods, and landmarks. Along the way, I engaged with residents, business owners, and community leaders, listening to their concerns and aspirations. This experience reinforced my belief that I can make a positive impact on our city.”\n“My passion for fitness and my commitment to community service have always been intertwined,” he says. “As a personal trainer, I have had the opportunity to help countless individuals achieve their health and wellness goals. This experience has taught me the importance of setting realistic objectives, developing tailored plans, and providing unwavering support. I believe these same principles can be applied to addressing the challenges and opportunities facing our city.”\nComments\ni hope two of them win\nseems like a great crew i hope the competition is friendly",
  "word_count": 1132,
  "scraped_at": "2026-02-14T12:17:46.445778"
}