{
  "article_id": "afe5315731ee",
  "url": "https://100.duke.edu/story/nan-keohane-phd/",
  "title": "Nan Keohane , PhD - Duke Centennial",
  "date": "20241111T170000Z",
  "domain": "100.duke.edu",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Duke University’s Centennial Oral Histories Program includes one-hour videotaped interviews with former and current leaders of Duke University and Duke Health, during which they share memories of their time at Duke and their hopes for Duke’s future. The videos will be archived in Duke’s Archives as a permanent record and enduring legacy from Duke’s 100th anniversary. Subscribe to the podcast to watch or listen to the interviews as they are released.\nNannerl (Nan) Keohane served as president of Duke University for 11 years – from 1993-2004. In this interview, she talks with fondness about the people with whom she worked and about pivotal decisions made and enduring programs launched during her tenure.\nNannerl (Nan) Keohane\n- Duke University President (1993-2004)\nInterviewed by\nPeter Lange\n- Duke University Provost (1999-2014)\n- Thomas A. Langford University Distinguished Professor (2010-2018)\n- Chair, Department of Political Science (1996-1999)\n- Professor of Political Science (1989-2018)\nSeptember 27, 2024 · 9:00 a.m.\nPresident’s Lounge, Forlines Building, Duke University\n00:00:19:01 – 00:00:28:06\nPeter Lange\nWelcome to the Duke Centennial Oral Histories Program. Today we’re going to be talking with [Nannerl] Nan Keohane. And Nan, welcome to you. Welcome back.\n00:00:28:09 – 00:00:29:06\nNannerl Keohane\nThank you.\n00:00:29:08 – 00:00:54:06\nPeter Lange\nI can say back because I still live here. Let me start with the question, which I think often occurs to people, which is why did you agree to accept the presidency of Duke when you did? You were a very successful president at Wellesley [College]. And you had options, I’m sure, including not doing it anymore [laughs]. So why did you come to Duke?\n00:00:54:08 – 00:01:13:18\nNannerl Keohane\nWell, it’s partly a question of timing. I had just finished a big capital campaign at Wellesley. I’d been there 12 years. It felt like it was time to move on. I had thought that I would go back to being a professor, because I love teaching and research. I hadn’t all my life wanted to be a university president, so it wasn’t a necessary next step.\n00:01:13:20 – 00:01:38:06\nNannerl Keohane\nBut John Chandler, who was chair of the Board of course, came to me at Wellesley and persuaded me that this is something I should be willing to be considered for. And one of the things he talked to me about was — I mean, he didn’t use this phrase — but you’ve developed all these sorts of mental muscles about being a president, and you should use them. Instead of necessarily going back to the library and the classroom.\n00:01:38:08 – 00:02:17:12\nNannerl Keohane\nSo I thought, “Well, it’s worth talking.” And also, I’ve always admired Duke. I had given a talk here invited by [Duke faculty member] Anne Firor Scott on women’s leadership. Which was a wonderful occasion. But I hadn’t known Duke intimately. My mother actually went to Chapel Hill and loved it. So I knew the area. But I, as a Southerner — having gone away to college and not really come back to the South — thought it would be great to go back to what I thought of and still think of as the best university in the South, and do whatever I [could] to help to help it in its next phase.\n00:02:17:14 – 00:02:21:04\nNannerl Keohane\nAnd so when they offered me the opportunity, I was very ready to say yes.\n00:02:21:08 – 00:02:38:16\nPeter Lange\nOkay, great. Well, let’s talk a little bit about thinking about that next phase. So after you were here for a little while, how did you perceive Duke, and what both the opportunities and the challenges would be for your presidency? I mean, the institution as a whole.\n00:02:38:18 – 00:03:13:02\nNannerl Keohane\nWell, I got the impression of people who were happy with Duke, but certainly not complacent. Hungry for more, and aware that this place has — there’s a reason why Terry Sanford talked about “outrageous ambitions.” That Duke had, and has, so much potential to be an even finer university. The interesting thing was that it was true of people across the institution, and you could feel it with people in every school and people who were working in middle management or in the trenches.\n00:03:13:03 – 00:03:34:12\nNannerl Keohane\nI mean, it was palpable. And I thought that was a wonderful sort of wave to be joining. I also got the sense, rightly, that this is a place that cares about its traditions. Which I do as well. I’m an institutionalist. And I’ve always thought of college presidents doing different things — being founders, being fixers, or being sustainers.\n00:03:34:14 – 00:03:52:10\nNannerl Keohane\nI would be very bad as a founder. And I’m not interested in fixing. But Duke was a place that was [and] is very strong and wanted to go to the next step. So it felt like it was the right thing for all of us as partners to do that. I guess those are the main things.\n00:03:52:11 – 00:04:16:22\nPeter Lange\nDid you see a particular pressure point? I mean, let’s take the freshman campus. So you’re thinking about how we can improve the undergraduate experience and bring it up to the level of the expectations. So talk through those kinds of pressure points where you thought, “Well if we make changes here, we will actually affect the culture in a very positive way.”\n00:04:16:22 – 00:04:36:08\nNannerl Keohane\nRight. East Campus is a perfect example because when I came, even before I took office, people said, “So this is a problem you need to solve and you need to make a decision right away. Are we going to have a first year East Campus?” And I thought, I hardly know the place, and they want me to make one of the momentous decisions in its history.\n00:04:36:10 – 00:05:15:20\nNannerl Keohane\nSo I said to people, “I’m not going to make that decision this year. I’m going to get to know the place better. Talk with the board, the faculty, the students.” And as it happened, I found that it was very controversial, which made it a harder decision because there were good arguments on both sides. But I became more and more convinced, partly on the basis of having known a couple of campuses that have freshmen yards, or whatever, where people really do live together. Not as dramatically as a campus a mile away, but so that they get to know their classmates and have a sense of belonging, rather than being lost immediately in a large or even\n00:05:15:20 – 00:05:39:09\nNannerl Keohane\na medium university. And I also thought that it would be a way to give people an introduction both to the intellectual life and to the broader extracurricular life of the university, in sort of manageable quantities. So more and more I became convinced that it was the right answer and went to the Board in the spring saying that this was where I thought we ought to go.\n00:05:39:11 – 00:05:59:21\nNannerl Keohane\nAnd I think that was right. I still am aware that there are pros and cons, but I think on balance, for first year students it was very fortunate to have their own campus and their own lives, as well as being part of the larger university. It’s a little hard to have to take a bus to it. But that’s the way we are, and it’s beautiful.\n00:05:59:23 – 00:06:06:19\nPeter Lange\nDid you bump into the fraternity culture as you were thinking through that decision?\n00:06:06:21 – 00:06:26:14\nNannerl Keohane\nYou know, it’s funny, Peter, it’s one thing I had not really thought about. I never been in an institution where fraternities were important. So to me, it was a new phenomenon. And I did begin to think about it once I was here. But it wasn’t a factor that I had thought about in advance.\n00:06:26:16 – 00:06:47:02\nPeter Lange\nOkay. So that’s one major step. Another major step was when you led the Women’s Initiative. So could you talk to us a little bit about how you perceived your role as a woman president? The first one at Duke.\n00:06:47:06 – 00:06:48:02\nNannerl Keohane\nSo far. First one, so far.\n00:06:48:02 – 00:06:58:01\nPeter Lange\nRight. Well, the first one at the time, for sure. And I think probably the first one, at least at a major university in the South.\n00:06:58:03 – 00:07:00:19\nNannerl Keohane\nSure. And the second in the country after [University of Chicago President] Hanna Gray.\n00:07:00:19 – 00:07:10:16\nPeter Lange\nRight. So talk about how you perceive the importance of that, in terms of being the president of the institution.\n00:07:10:18 – 00:07:32:06\nNannerl Keohane\nWell, that’s another very good question. And it’s interesting because the Women’s Initiative itself, of course, was the other bookend. East Campus at the beginning, the Women’s Initiative at the end. So one question is why did it take so long. And that I think reveals a lot in answer to your question. When I came to Duke from Wellesley, I know there were a number of people\n00:07:32:07 – 00:07:47:20\nNannerl Keohane\nfirst of all, people thought I was a Yankee until I got here. And my Southern accent all came back quite naturally. It wasn’t that I suddenly decided to say “you all.” I mean, I just did. I was in the midst of it. And so it was very clear I wasn’t a Yankee, but it was also clear I was a woman.\n00:07:47:20 – 00:08:16:10\nNannerl Keohane\nAnd having a woman was a very unusual thing to do for a university like this. I felt very much supported, although I know that there were some people who thought, “A woman is never going to succeed at Duke.” Being Duke, they were gracious and they didn’t trumpet it abroad. But I knew that there were some people who were quite skeptical. Some on the board, some around, some alumni. But people were willing to give me a chance, which is all I needed.\n00:08:16:12 – 00:08:43:04\nNannerl Keohane\nAnd so it ceased to be an issue fairly quickly, as far as I’m concerned. I don’t know if it was an issue for other people, but it didn’t bother me. I mean, the only thing I thought about during the next few years was how important it was for Duke students and junior faculty to see that a woman could be president and a woman could do the sorts of jobs that I hoped some of them might be interested in doing.\n00:08:43:06 – 00:09:03:13\nNannerl Keohane\nBut one of the things I thought about then was — what about the situation of women at Duke, across the years? What is it like for them? And there, I was thinking in part of the fraternity culture. I knew that the sororities were strong and they mattered to people, but they didn’t do most of the big parties, and they didn’t set the social life in quite the same way.\n00:09:03:15 – 00:09:24:13\nNannerl Keohane\nAnd so I wanted to know what life was like for women at every level of Duke. But I thought it would be bad strategically to have my first big initiative, [be] something on the situation of women. Everybody would say, “Well, that’s obvious. That’s all she cares about.” So we did some research and began to track the situation of women [at Duke].\n00:09:24:13 – 00:09:42:08\nNannerl Keohane\nBut we didn’t do more than that. And then toward the end, when we finished that wonderful capital campaign that took most of my energy for a very good cause, and I took a deep breath and I thought, “What do I want to do before I leave?” That’s what came back. I wanted to do something for women at Duke.\n00:09:42:10 – 00:10:07:18\nNannerl Keohane\nSo that’s why we did the Initiative at the end. And I thought it was very valuable for Duke. It was certainly valuable for some of the people I talked to. The institution of the Baldwin program, [the] Baldwin Scholarships, I think is one of the most important legacies of my time here. Trying to introduce the values of being in a women’s institution within a great co-ed institution.\n00:10:07:20 – 00:10:15:07\nNannerl Keohane\nSo those are — but in the intervening years, I didn’t think about it very much at all.\n00:10:15:13 – 00:10:29:15\nPeter Lange\nOkay. The thing is, we’re now touching on points that were transformational for the culture, right? I mean, East Campus, that was a cultural transformation. The focus on women, that was a cultural transformation.\n00:10:29:17 – 00:10:34:23\nNannerl Keohane\nTo some extent. Remember that the Women’s College was a crucial part of Duke’s history.\n00:10:35:01 – 00:10:37:02\nPeter Lange\nRight, but bringing that back, I think.\n00:10:37:04 – 00:10:44:12\nNannerl Keohane\nOkay. It was more sort of a reformation. A reformation, rather than a transformation.\n00:10:44:14 – 00:10:50:12\nPeter Lange\nOkay, fine. Can we talk a little bit about Athletics? That’s another touchpoint.\n00:10:50:14 – 00:10:52:10\nNannerl Keohane\nIf we didn’t, we would be having [inaudible].\n00:10:52:15 – 00:11:12:09\nPeter Lange\nExactly, we have two of those topics. One of which is Athletics. So talk about the place you saw for athletics, the way you thought it was affecting the culture, and whether there were changes that needed to be made there. And I do remember one particular project we had together in that regard.\n00:11:12:11 – 00:11:39:01\nNannerl Keohane\nWell, it became very clear to me when I got here, if it hadn’t been before, that Athletics were foundational to Duke. Very central. And I had come from a place, I mean, Wellesley in Division III was a competitive and good place, but it was nothing like Duke. So that, to me, was one of the things that was most different. That, by the way, and having deans of every school. Because at Wellesley, everybody was supposed to be part of the same shooting match.\n00:11:39:03 – 00:12:02:15\nNannerl Keohane\nAnd also the Medical Center, which was so important to Duke, and so huge. We’d had nothing like that at Wellesley. So athletics, and having all the deans, and having a big medical center were the main differences from Wellesley. People always assume it was [that it was] co-ed, but it didn’t make that much difference. So the athletics [focus] was one of the big differences. And I felt I had to get to know how and why it was so important.\n00:12:02:15 – 00:12:30:05\nNannerl Keohane\nSo it became very important to get to know Coach K from the beginning. Because he was, and has always been, and will be so significant to Duke. I remember when I came to Duke shortly after I was named president but before I took office, we went to Cameron [Stadium] for the first time. And we were at a basketball game where we were playing, I think it was Iowa. And we’d had a good season, but not a great season.\n00:12:30:05 – 00:12:52:13\nNannerl Keohane\nBut we had not, I think not ever, lost to a non-conference team in Cameron. Or some statistic like that. And then we were losing to Iowa at halftime. And people literally came up to me at intermission at halftime and said, “If we lose to Iowa tonight, you know, everybody will think it’s your fault.” And I thought, “What?”\n00:12:52:14 – 00:12:54:21\nPeter Lange\n[Laughs]\n00:12:54:23 – 00:13:29:23\nNannerl Keohane\nThis is now part of my job [laughs]. Fortunately, we won. But I’ll never forget that. That was a way of understanding how important it was. I found Coach K really a very valuable partner. And when we started out, I thought, “Okay, he’s over there in Athletics, which is important. [I’ll] get to know that.” But Mike wanted very much to be part of what the University does to shape student athletes. To make sure that the athlete part, as well as the student part — which he cares about — were being put forward appropriately.\n00:13:30:01 – 00:13:55:13\nNannerl Keohane\nAnd so as I got to know that, and got to realize how valuable his judgment is and how wise he is, he became part of counsels and conversations that were really important to me. And I remember once — I’ll never forget this piece of advice, when I was in the middle of one of the brouhahas, one of the things that we had to take on. And I was sort of charging out ahead and Mike said to me, “You know, good generals don’t always have to be right out in front.”\n00:13:55:15 – 00:14:15:05\nNannerl Keohane\nAnd I thought, “He’s right.” But anyway, Athletics in general, football at that time was not nearly as good as it is today. And football was a very different issue from basketball. We loved Cameron. And I remember people would ask, “Do you have to go to all the games?” And I thought, “What are you talking about?” Sitting in the president’s seats.\n00:14:15:05 – 00:14:37:04\nNannerl Keohane\nAnyway, football at that point was very different. And we had — instead of the lovely current president’s box — we had a concrete bunker where people had to come. You remember it, right? And often we were losing, and at halftime it would be pretty difficult. I still loved Duke football, and I do today. But it’s a lot nicer when you win more often.\n00:14:37:06 – 00:15:01:22\nNannerl Keohane\nAnd the rest of the sports, I enjoyed. And it’s important to remember the women’s sports, for example, have all been important to Duke. So knowing why and how the situation of being a true student athlete and scholar athlete was being instantiated at Duke and genuinely was one of the most important and rewarding things I learned.\n00:15:02:00 – 00:15:18:20\nPeter Lange\nDid you think that in the image of Duke that was projected externally, Athletics played too large a role? We did have a project — I don’t know if you remember rethinking the admissions materials, for instance?\n00:15:18:22 – 00:15:44:15\nNannerl Keohane\nYes. Well, I remember when somebody at Duke did a study that showed that the least courteous and the least warm city in the country was Philadelphia, The City of Brotherly Love. And that was published. And it got a lot of attention. The mayor of Philadelphia was quoted as — or maybe not he, but someone in his office — saying, “Duke? Duke, that’s a basketball school, they have classes and stuff?”\n00:15:44:20 – 00:16:18:18\nNannerl Keohane\nSo I knew that the reputation was very much, for some people, centered on basketball. I didn’t worry about that. Our basketball team deserved that reputation. But I was also — you and I both, as a partnership — very much involved in making sure that the equally or, you know, strongly meritorious part of the university in academics received equal recognition outside the university. And [that] in the circles where it was appropriate, was more the first thing people thought of, and not Duke athletics.\n00:16:18:20 – 00:16:19:04\nNannerl Keohane\nSo.\n00:16:19:10 – 00:16:47:16\nPeter Lange\nOkay, good. If we talk about — you just raised the issue of the intellectual life of the university. Did you see things there where you thought you could play a role in improving and helping to raise the intellectual level? Both for students in terms of what they were being taught and what they were learning, and in terms of the quality of the faculty?\n00:16:47:18 – 00:17:14:19\nNannerl Keohane\nWell, the quality of the faculty was more your job, and you did a great job. No, seriously, you did a great job with it. In terms of my own perception, instead of thinking abstractly, what can we do to make the experience of the students better? I found myself thinking of particular enhancements that were often suggested by people who had some ideas in mind that might not have occurred to me.\n00:17:14:21 – 00:17:41:00\nNannerl Keohane\nFor example, better connections between faculty and students outside the classroom. Sort of intergenerational connections. Faculty, graduate students, undergraduates. And that gave rise to the University Scholars [Program]. But Melinda French Gates was very interested in that and made it possible. So it was more each project that I got involved in was a way of enhancing specific things about the education.\n00:17:41:00 – 00:18:06:13\nNannerl Keohane\nRobertson Scholars, for example, with Julian Robertson, was about having people have an opportunity to take advantage of this great university 12 miles away. Instead of having it be only about athletic rivalry. We once joked that it was like the Montagues and the Capulets fighting in the streets, but having a thriving law firm on the side. And I thought it was very important, partly because my mother and my daughter-in-law had gone to Carolina.\n00:18:06:15 – 00:18:30:09\nNannerl Keohane\nAnd so having that opportunity to have some access, particularly for graduate students and faculty to the resources on the other side without having to drive and park. But also for the undergraduates fundamentally to have some sense of deep involvement in both great universities and feel attached to both. And having a cohort of people who had that experience.\n00:18:30:11 – 00:18:56:08\nNannerl Keohane\nSo that was another way in which we could enhance, particularly for some. The Baldwin Scholars was another. The Bass Professorships was a way of, as you well recall, making it clear that Duke believed that research and teaching are both important to fine professorships. Because there has to be emphasis on research if you’re a proper research university. And there should be.\n00:18:56:10 – 00:19:17:04\nNannerl Keohane\nBut teaching is so important to Duke as an undergraduate-focused institution for so much of its life. And the problem is people think, “Well, you can do one or the other, but you can’t do both.” And I knew that that was wrong. I know that it’s hard to be both good at teaching and at research, but I’ve known people who are.\n00:19:17:06 – 00:19:28:12\nNannerl Keohane\nAnd I thought it was crucial to recognize that the Bass Professorships, therefore, were a way of saying, “Yes, you can be excellent at both. And we have people who are, and here they are.”\n00:19:28:15 – 00:19:29:08\nPeter Lange\nAnd we value them.\n00:19:29:08 – 00:19:45:18\nNannerl Keohane\nAnd we value them very much. The Kenan Institute was similar, the John Hope Franklin Institute. In each instance, it was part of the institution that was dedicated to enhancing some parts of the education which I thought could be strengthened.\n00:19:45:20 – 00:19:54:13\nPeter Lange\nRight. And by doing that, I think you were elevating the whole academic side in the broad understanding of it.\n00:19:54:17 – 00:19:54:20\nNannerl Keohane\nI hope we did,\n00:19:54:20 – 00:20:18:07\nPeter Lange\nI think we did that. So we haven’t discussed the Health System. So you came. You were a political philosopher. You had taught at a women’s college in the northeast. And you arrive on this campus and half of the budget is over there. [NK: More than half.] Well, at that time, more than half. Still more than half was over there.\n00:20:18:09 – 00:20:29:13\nPeter Lange\nSo talk to us a little bit about your experience with the Health System, with learning that, and then with finding the right balance right across the university.\n00:20:29:15 – 00:20:56:01\nNannerl Keohane\nWell, it’s interesting you use the phrase over there, which is certainly true at one level. But it was important to Duke through its history, I think, that in fact the first entrance to the Medical School was on the main campus. So it felt very — I mean, it was designed specifically to feel that it was all part of the same university, even if there was this enormous medical complex behind it.\n00:20:56:03 – 00:21:24:00\nNannerl Keohane\nAnd that struck me from the beginning. I remember one of the things that I did on my tours before I was actually in office was to go over to the Medical Center. And Ralph Snyderman sort of took me around to show me things. And I remember standing on a little stand at the head of a bed where somebody was having open heart surgery. And I was properly sort of, you know, put in scrubs and able to watch it.\n00:21:24:02 – 00:21:55:19\nNannerl Keohane\nI thought, “Wow. This is just one instance of where this great Center is doing.” And I was in awe of what it meant to do something like that. I now have two granddaughters who are doctors, and I think I have a little better sense of what that means because of my Duke experience. It is rightly, along with that Athletics, one of the things Duke is known for. Particularly in this area, where Duke Hospital is just the coin of the realm.\n00:21:55:21 – 00:22:18:17\nNannerl Keohane\nAnd I became aware of that, and I wanted to make sure that we supported that. The Hospital and the whole medical complex have a strong sense of itself as having its own rules and its own world. And we all had to wrestle with, “So, what does that mean?” Not to try to treat it as though the Medical Center was just like, you know, the English department.\n00:22:18:20 – 00:22:38:04\nNannerl Keohane\nAnother wonderful part of Duke. And I had to learn that. But I also wanted to be sure that the Medical Center remembered that they are part of Duke. And that we’re very proud of what they’re doing, but we are all part of the same enterprise. I remember when somebody asked me what it felt like to be the captain of such a big ship.\n00:22:38:04 – 00:22:55:14\nNannerl Keohane\nI said, “It is not a big ship.” They said, “It’s very hard to move such a big ship around, isn’t it?” I said, “Well, I don’t think it is a big ship. It’s a flotilla. And I’m the admiral at this point, and I’m supposed to make sure that all the ships are moving roughly in the same direction, and that we all get there at the same time.”\n00:22:55:16 – 00:23:23:08\nPeter Lange\nRight. With regard to leadership, one of the roles of the president is to pick leaders. And I could enumerate a number of leadership choices that you made that had a big impact on the institution. We could talk about the [Nasher] Museum. We could talk about the Kenan Ethics program. We could talk about the executive vice president’s role.\n00:23:23:08 – 00:23:45:14\nPeter Lange\nWe could even talk about my role. So, talk about those leadership choices and how you approached them. Because they’ve made a huge difference. If you look at our peer institutions now, none of them have had the strength and continuity of leadership at that level that we’ve had at Duke.\n00:23:45:16 – 00:24:12:11\nNannerl Keohane\nWell, I certainly agree with you that that’s an important part of the president’s job, more than I had realized, actually, before I took office. Because I had never been a dean or a provost or anything. So I really had never “managed” anything. But learning how crucial the key roles are and how crucial it is that a team work together, were some of the things that were most important in my first years. Well, recruiting you to be provost was one of them, Peter.\n00:24:12:11 – 00:24:33:16\nNannerl Keohane\nAnd so we should start talking about that [PL: Oh, no, we don’t need to talk about that.]. No, we should, because you’ve been so important to this place. And you and I have always been in sync in a very fundamental way, but have real differences, too, in which we strengthen each other. And I remember when I said I wanted to choose you as the provost and people said, “Well, you can’t have two political scientists.”\n00:24:33:16 – 00:24:54:13\nNannerl Keohane\nAnd I said, “Look, political science is a very diverse discipline. I study Rousseau, you know, Peter’s a comparative politics person. We’re doing very different things.” And that didn’t matter at all. The difference was the way we thought about Duke [and] the strengths we brought to our conversations. And so your leadership in the academic world here has been just phenomenal.\n00:24:54:13 – 00:24:59:01\nNannerl Keohane\nAnd I think that it was wonderful that you decided to say yes.\n00:24:59:03 – 00:24:59:18\nPeter Lange\nWell, it wasn’t a hard choice.\n00:24:59:23 – 00:25:35:17\nNannerl Keohane\nAppointing [Executive Vice President] Tallman [Trask] was equally important. Because the university’s buildings, and its campus, and the people in the administrative side, are so important to the success of this place. Recruiting Tallman was not as easy as recruiting you, partly because he had a very good job out on the West Coast and initially was not interested. But after we interviewed somebody from Stanford who we thought might be a good V.P., but I was still very intrigued by Tallman,\n00:25:35:19 – 00:25:46:22\nNannerl Keohane\nI took him to the top of The Pickle. Whatever that building is, in between Chapel Hill and Duke. And I showed him around so proudly. And he looked around and he said, “There sure are a lot of trees. And I thought, “Wow.\n00:25:46:22 – 00:25:49:05\nPeter Lange\n[Crosstalk]\n00:25:49:07 – 00:26:20:05\nNannerl Keohane\nIf he thinks that, he’s not going to be real happy at Duke.” And fortunately that didn’t work out. And then Tallman was available. And his understanding of what it means to build buildings — people always say Tallman was an architect who didn’t quite get the license, but does it anyway, and I always loved it. Working with Tallman was always a very good experience, because we both enjoy very much what it means to design and build and live in a building.\n00:26:20:07 – 00:26:40:18\nNannerl Keohane\nSo that was very important to the university as well. But there were also really — I mean, [Vice President of Institutional Equity] Myrna Adams was a great appointment. We had such an important sense of what it really means to work for what’s now called diversity, equity, and inclusion. But we did it, I think, much more sensitively because of Myrna. And [Vice President for Student Affairs] Larry Moneta.\n00:26:40:18 – 00:26:45:08\nNannerl Keohane\nI mean, there’s a whole long list, but certainly recruitment was very important.\n00:26:45:10 – 00:27:11:07\nPeter Lange\nRight, I wanted to come back to that kind of issue, with respect to the Nasher Museum. Because the Nasher Museum was something which you just stuck with, for years, through a lot of obstacles, and eventually were able to bring it — which was another one of those points at which Duke was saying something new about itself. So talk a little bit about the whole [process].\n00:27:11:07 – 00:27:33:04\nNannerl Keohane\nBut we owe a lot to [Raymond] Ray Nasher and his family, who were willing to wait. Because Ray was ready to build the Museum almost as soon as I got here. But there were other priorities that we felt needed attention that were more pressing. The Engineering school, and others. And so we were not able to do it right away.\n00:27:33:04 – 00:27:54:23\nNannerl Keohane\nBut when we were ready, Ray was patient [and] was willing to wait, and so we could do it at the right time and in the right place. And I’ve always thought of that as one of the most enjoyable parts of my time here was building that building. And we are very fond of art and enjoying being there as part of Duke.\n00:27:55:01 – 00:28:08:03\nNannerl Keohane\nBut the Nasher family was really wonderful about that with the delays. They never said, “Well, we’re going to, you know, take our money elsewhere.” They cared a lot about Duke. Nancy, especially. And so we got it done.\n00:28:08:05 – 00:28:36:06\nPeter Lange\nWe did. I want to come back to the academic side. So you mentioned the deans at different schools. The president has a different relationship with the deans, not just with the provost. And how did you perceive the appropriate role for you as a strong academic in your relationship to the academic enterprise overall, and to the deans in particular?\n00:28:36:10 – 00:28:39:17\nPeter Lange\nAnd then we can come back to the faculty as well?\n00:28:39:19 – 00:29:06:11\nNannerl Keohane\nWell, as I said, having so many deans was a different thing entirely from what it was like to be at Wellesley. And I was not sure at first exactly how that would work out. I went around and visited the deans when I got here, and I went to a meeting of the Dean’s advisory group at Fuqua [School of Business] quite soon. And basically they gave me [a] feel like, you know, “We are Fuqua, and it doesn’t matter a whole lot what Duke’s doing.”\n00:29:06:11 – 00:29:43:16\nNannerl Keohane\nLiterally. And I thought, “Whew, this is going to be an interesting challenge.” [Laughs] And I had a little bit of the same sense with the Law School, but not quite so much. And we’ve talked about the Medical School. So I realized that these deans had very strong and well-founded opinions about what their school ought to be doing. And part of my job was to make them aware that they were, more perhaps than they were, also part of a larger enterprise. And that they should feel that their network of ties within Duke with other deans and with other faculty members was an important part of their strength.\n00:29:43:18 – 00:29:59:05\nNannerl Keohane\nAnd then when you came along and made the Dean’s Council a really important part of the university. That was huge. And I was very glad that you invited me and encouraged me to attend the Dean’s Council meetings, because that’s not true on every campus.\n00:29:59:05 – 00:30:00:04\nPeter Lange\nNo, it’s not true on most campuses.\n00:30:00:06 – 00:30:12:00\nNannerl Keohane\nExactly. And for me, those meetings were among the most important incidents of my time in the President’s Office, because I got to hear what the deans were concerned about.\n00:30:14:00 – 00:30:39:03\nNannerl Keohane\nAnd they didn’t — I very rarely spoke, except when you asked me to make some presentation. But getting to know through those discussions what was going on in each of the schools, and recognizing how you were bringing the deans together to feel — I think, for the first time, at least in our experience — as part of a team, was a really important part of what I was doing at that point.\n00:30:39:05 – 00:31:13:04\nPeter Lange\nSo, that’s an interesting observation, because a lot of times people think of the presidency as the external face of the university, right? The president’s the person who raises the money and presents the university to the public, etcetera, etcetera. And what you were just describing was a way that the president could be more – if not an ongoing daily force on the inside, at least be fully informed and a real partner, actually, to the provost also\n00:31:13:06 – 00:31:17:11\nPeter Lange\non the inside. So talk about that experience.\n00:31:17:11 – 00:31:42:13\nNannerl Keohane\nNo, I think that’s really important. I want to spend a few minutes on it. Because I had been, as I said, a very deeply engaged professor at Stanford. And I was doing research on 18th century, 17th and 18th century French thought, doing a lot of mucking about in archives. I enjoyed teaching very much. So it was hard to leave being a professor,\n00:31:42:15 – 00:32:12:04\nNannerl Keohane\nas I said. And I always still sort of thought of myself as a professor. I remember when I got to Wellesley, where I had been an undergraduate, some of the faculty members remembered me as an undergraduate. I think it was weird for them to have Nan Overholser back as their president [laughs]. But anyway, I found that I had to understand that I was no longer a member of the faculty. Even though I wanted to keep close faculty ties.\n00:32:12:04 – 00:32:40:15\nNannerl Keohane\nSo I had that preparation before I came to Duke, and that was very helpful. The faculty were very welcoming. It was very clear I was the president, and that was a different position. For me personally, it was always important to be in touch with the academic life, to feel that I knew the faculty, inviting people [like] newly-tenured faculty to lunch at the Wa-Duke [Washington Duke Inn] every year. That sort of thing.\n00:32:40:17 – 00:33:12:17\nNannerl Keohane\nIt would have been very hard for me to be only external. I knew that that was probably the most important part of my job on balance, but I felt very much involved internally as well. I thought that was important for Duke. I know we’re — I hope we’re going to talk a little bit about the external part too. But the research and the teaching, having a sense of what was actually being done at Duke, and how the deans were thinking about their schools, was an important part of my life.\n00:33:12:23 – 00:33:42:08\nPeter Lange\nGreat. So I want to move then to the relationship between the president and the Board [of Trustees] and then the president and fundraising, basically. But let’s talk a little about the relationship of the president to the Board. How you perceived the Board, and how the Board you thought perceived you in your role? Duke to me has always had a board which was more appropriately hands-off than some boards are.\n00:33:42:10 – 00:33:50:11\nPeter Lange\nThat was the perception that we had on the academic side. But I’d like you to talk a little bit about your relation to the Board.\n00:33:50:13 – 00:34:24:16\nNannerl Keohane\nThe Board was very important to me as president. Obviously at some level, being a member of the Board and participating fully in the Board discussions gave me a sense of how crucial members of the alumni body and those who were not Dukies but who cared about the University thought about it at some distance, removed from the day-to-day. I became very close to several board members and found their wisdom very valuable – both individually and collectively.\n00:34:24:18 – 00:34:45:18\nNannerl Keohane\nI knew that they were my bosses, so to speak. But I never felt like I was working for them. It was very much working together. I found the board quite supportive from the beginning. I know that, as I said, there may be some people who felt it was a little odd to have a woman president. But they didn’t seem to feel that way for very long [laughs].\n00:34:45:20 – 00:35:10:06\nNannerl Keohane\nWe got to be very close, and I admired a number of the board members as well as becoming friendly with them. But it was more working together to set policy and thrash out big problems. And having a group that I could respect and trust for that wisdom. One of the things that’s true about Duke’s board, as you know, is that there’s the Executive Committee, and then there’s the larger group.\n00:35:10:08 – 00:35:39:07\nNannerl Keohane\nAnd both of them were valuable. With the Executive Committee [of] 12 people, we could talk at great length and in great depth about problems, and work things through before they got to the larger board. But with a larger board, there was such a wonderful variety of people with different backgrounds and different interests and perspectives. And so we also found then that there were ways of thinking about things that a smaller group wouldn’t have come up with.\n00:35:39:09 – 00:36:03:02\nNannerl Keohane\nI enjoyed very much the Board retreats where we had time to get to know each other even better. I’m not sure everybody on campus really understands how important the Board is to Duke, not just formally as the source of authority, but also as individuals and collectively a source of wisdom and judgment and loyal support. So I always enjoyed working very much for the Duke Board.\n00:36:03:04 – 00:36:16:21\nNannerl Keohane\nOne of the things that I owe — I owe several things to my predecessors, and one of the things I owe to [former Duke President] Keith Brodie [is that] he worked very hard to make the Board a stronger Board, and that’s the way it felt when I got here.\n00:36:16:23 – 00:36:17:22\nPeter Lange\nSo fundraising.\n00:36:18:02 – 00:36:18:15\nNannerl Keohane\nFundraising.\n00:36:18:15 – 00:36:48:22\nPeter Lange\nI mean, you led the largest campaign in Duke’s history. I guess the second or third largest campaign of any university [NK: At the time]. At the time [laughs]. Yeah, it’s sort of not there anymore. And we had not had a tremendous campaign before that, certainly not a university-wide campaign. So talk with us about the process of getting to that, setting the targets, and then hitting those\n00:36:48:22 – 00:36:49:18\nPeter Lange\ntargets.\n00:36:49:20 – 00:37:19:20\nNannerl Keohane\nWell, on fundraising. This was something I had no experience about when I got to Wellesley. Literally zero. Had sort of a little bit of uneasy anticipation, [thinking] “What’s this going to be like, going and asking people for money?” So fortunately, the head of development at Wellesley — this is relevant to your question, it sounds not, but it is — saw that I needed to have a good experience with my first major fundraising, so that I would look forward to it rather than seeing it as an onerous task.\n00:37:19:22 – 00:37:43:03\nNannerl Keohane\nSo he sent me out to Los Angeles with one of the trustees from there, to visit a woman who had been a professional golfer. Which is very unusual. [From] the class of 1934. So we knew she was interested in athletics. My job was to persuade her to give the naming gift for a fieldhouse. Because when I got back to Wellesley, the gym was still the one I had had as a student.\n00:37:43:03 – 00:38:08:20\nNannerl Keohane\nAnd I mean, it was 103 years old. It was a museum. And all our colleagues were building new gyms, and we just had to have a new fieldhouse. I went to Los Angeles with that intention. And on the way I had this inspiration. Her husband had died recently, and they were very close. He had given a fieldhouse at Williams [College] in his name.\n00:38:08:22 – 00:38:23:22\nNannerl Keohane\nSo of course the obvious thing was to say, “We can have ‘his and hers’ fieldhouses at Williams and Wellesley.” So that was what I was going to say. When I got there, she said, “I know you’ve come to ask me for money.” This is the way fundraising often goes. “I know you’ve come to ask me for money.\n00:38:23:22 – 00:38:47:01\nNannerl Keohane\nI’ve decided what I want to do. I want to give a birdhouse. A birdhouse, sort of a fountain with a bird in between, in front of the museum.” And I said, “Thank you very much. That’s an interesting idea but let me tell you what I’ve come to ask you for.”\n00:38:47:01 – 00:38:58:04\nNannerl Keohane\nSo then I shifted into my request. She said yes. I went home and I said to Bob [Keohane], “I should have asked her for more.” And then I knew I was into fundraising.\n00:38:58:06 – 00:38:58:14\nPeter Lange\nRight.\n00:38:58:17 – 00:39:21:02\nNannerl Keohane\nAnyway, when I got to Duke, I had that kind of experience from Wellesley. I found then wherever I’ve tried to raise money, that the important point to keep in mind — and you don’t even have to tell yourself, it becomes relevant always — is [that] these people have money. You’re not asking them to give away their last dollar. And they are philanthropic, and they will give.\n00:39:21:02 – 00:39:47:23\nNannerl Keohane\nAnd my job was to make sure that they gave a significant portion of it to Duke. They were people, almost always, who had ties to Duke, cared about Duke. And my job was to make sure that they saw how those ties might be strengthened by giving significant gifts. Duke alumni are wonderful people, and I almost always found it fascinating and enjoyable to be fundraising.\n00:39:48:05 – 00:40:09:05\nNannerl Keohane\nIt was challenging, too. Because you would be having a lunch at which you were supposed to be bringing up giving money, and you have to decide when and how do I do it? But I found that mostly it was a rewarding part of my job, and I got to know some wonderful people that way. So fundraising really doesn’t feel like going to some people begging hat in hand.\n00:40:09:05 – 00:40:27:18\nNannerl Keohane\nIt’s more a partnership. I think about Frank Kenan and the Kenan Institute, Julian Robertson and the Robertson Scholars, Melinda Gates and a number of projects. Those were real partnerships, and they were a very important and deeply significant part of the time at Duke.\n00:40:27:20 – 00:40:59:01\nPeter Lange\nSo one topic we haven’t talked about, which I know repeatedly arose including marching through the halls of the Allen Building, was race. And you were a Southern woman at a Southern university. And you had to deal with race issue with a particular perspective, which you brought. Can you talk about how you perceived racial issues at Duke at the time?\n00:40:59:06 – 00:41:14:14\nPeter Lange\nNow we call it all DEI. But it was fundamentally about the relationship between Duke and the African American community in Durham, on campus, and further so.\n00:41:14:16 – 00:41:45:10\nNannerl Keohane\nSo I was indeed a Southern woman. I was raised in Arkansas and South Carolina. My father was a minister, and my mother was a Texan and not really a Southerner in that sense. They were very liberal. They weren’t fighters, but they were liberal, and they took steps. And that taught me. My father made sure to invite members of the Black Presbyterian Church in our town occasionally to worship with us, and we went and worshiped with them.\n00:41:45:12 – 00:42:20:18\nNannerl Keohane\nSo I was brought up believing that segregation was wrong in any form, and that Jim Crow was a horrible stain on our country. My family hadn’t been active ardent fighters for racial justice, but they did important things in their own way. So that was the way I was brought up. And when I got to Duke, I was well aware that one of the most important things for Duke was to be seriously successful in dealing with the challenges that race brought to America.\n00:42:20:18 – 00:42:59:09\nNannerl Keohane\nThis was 1993. Still, the civil rights issues were very visible, as they are today. One of the most valuable things was discovering how many Black professionals and middle-class leaders were involved with Duke from the community, and within Duke. Which had not been true at Wellesley, because there just weren’t as many African Americans around. And since Durham is, of course, a robustly populated and led city by African Americans, that was a great advantage. Because there were people we could work with on race.\n00:42:59:11 – 00:43:23:07\nNannerl Keohane\nOne of the worst moments was when there was the lynching. When people came to work early one morning, you’ll help me through the details here, [at] the bus stop on West Campus. And there was a figure of a lynched person hanging there. And it was horrible. Particularly for the African American people who were coming to work early.\n00:43:23:09 – 00:43:50:18\nNannerl Keohane\nIt turned out in the end this was a statement that was being made, and we had to deal with that. And that was not — that was a very difficult moment. But in general, I found that people on this campus were very interested in improving any racial tensions that remained. And working with people in Durham on this was one of the best parts of my job.\n00:43:50:18 – 00:44:29:00\nNannerl Keohane\nThe Duke-Durham Neighborhood Partnership, which is not just a matter of race, but race was certainly involved. I was shocked when I learned that Duke was regarded as the plantation by workers in some instances. I thought, “That’s a horrible thing to be true.” One of my main purposes was to try to dissolve that antagonism, and make sure that people in Durham understood that Duke was their institution as much as it was anything else. So that was a complicated part of our job, but a really high priority one.\n00:44:29:02 – 00:44:57:20\nNannerl Keohane\nI think the Duke-Durham Neighborhood Partnership was a very crucial step for us and for the city. And a lot has been done since I left building on it. Clearly, it’s just very different from what it was when I came. So having race partly at the center of that was one of the spurs. And I think that this university has done a better job than most, even though there are still problems.\n00:44:57:20 – 00:45:00:21\nNannerl Keohane\nThere are everywhere, at tackling that.\n00:45:00:23 – 00:45:10:04\nPeter Lange\nOkay. And you saw the Neighborhood Partnership partly in that context. And what else did you think was important?\n00:45:10:06 – 00:45:37:03\nNannerl Keohane\nI thought it was important that we were talking about neighborhoods right around our East Campus, our freshman campus. And I hadn’t really realized how big that problem was, until [Duke Senior Vice President for Public Affairs and Government relations] John Burness and [Duke Executive Vice President] Tallman Trask and I got into it. One of the specific instances that I recall was the small sort of convenience store about two blocks from East Campus that was a notorious site for selling drugs.\n00:45:37:05 – 00:45:56:15\nNannerl Keohane\nEverybody seemed to know that it was a site for selling drugs. But nobody seemed to be able to do anything about it. And here we were, two blocks from East Campus. So I think it was Tallman’s idea to buy the store and turn it into a center for ministerial support for the ministers of the churches around us. Which was great.\n00:45:56:15 – 00:46:07:04\nNannerl Keohane\nIt was so perfect. People come for solace, and what do they find? Not drugs, but ministers. And what — I know I’m saying “and” too much. But all of it seems to fit together.\n00:46:07:04 – 00:46:22:18\nPeter Lange\nWell, I think it does fit together. I mean, I think that was my point at the beginning when I talked to you about the transformational moments. Yeah. It’s an accumulation of small interventions.\n00:46:22:20 – 00:46:52:05\nNannerl Keohane\nOne of the things I did want to say about the Duke-Durham Partnership was we discovered what now seems obvious. We discovered that “the neighborhood” wasn’t a single place. There were many neighborhoods around Duke University of people with their own particular schools, their ways, their playgrounds, their leaders, their places to hang out. They each felt very much like a specific neighborhood within this larger mosaic of Durham.\n00:46:52:07 – 00:47:15:12\nNannerl Keohane\nI, at least, didn’t know that in the beginning. People like [Durham Mayor] Bill Bell and [Vice President of Duke’s Office of Durham and Regional Affairs] Phail Wynn helped us so much to understand what Durham was really like. And dealing with it by going — because there had been this sense of Durham as well, sort of, “There’s this big university over there, they think they know how to do anything. And when they come to us, they come to tell us what to do.” Going instead and asking, “How can Duke help?”\n00:47:15:16 – 00:47:29:21\nNannerl Keohane\nNot, “Here’s what we want to bring you.” What can we do to help? And that made all the difference because some of the things they said surprised us. They didn’t all just want a lot of money. They wanted help with schools, they wanted tutorials, they wanted [us to] buy out the store, whatever.\n00:47:30:01 – 00:48:02:15\nPeter Lange\nGreat. Let’s move a little bit toward the present and the future. And a lot of college presidents these days are facing the challenge of protest. And you faced the challenge of protest at various points. And from my perspective, I would say that you found a way to be both firm and tolerant. And I can still remember allowing the students to walk through the Allen Building when there was a threat of occupation, and we found that.\n00:48:02:17 – 00:48:18:20\nPeter Lange\nSo talk a little bit about the role of the president and creating a climate on campus which is both tolerant of and firm about the nature of protest.\n00:48:18:22 – 00:48:30:04\nNannerl Keohane\nI’ll be glad to talk about that. Although I feel that I was relatively lucky, and that we didn’t have any protests of the profundity and force that we’re looking at right now.\n00:48:30:05 – 00:48:31:17\nPeter Lange\nYeah, well, things…\n00:48:31:19 – 00:48:33:08\nNannerl Keohane\nThings were somewhat different.\n00:48:33:10 – 00:48:42:22\nPeter Lange\nNot only that, but I mean, the climate that you’ve created around that makes a difference to the form that the protest takes when it happens.\n00:48:43:00 – 00:49:03:06\nNannerl Keohane\nThat’s true. But I was thinking about my predecessors as well as my successors. Not only specifically at Duke, but predecessors, yes, at Duke. [Former Duke President] Terry Sanford, when he came, it was in the middle of the Vietnam War protests. And people were sitting out — huge numbers of people out in the main quad. And Terry Sanford stopped by and said, you know, “What are you here for?”\n00:49:03:06 – 00:49:11:04\nNannerl Keohane\nAnd they said, “We’re trying to take over the Allen Building.” He said, “I’ve been trying to do that for two weeks. Can I go with you?” I mean, the students were totally [shocked], “What’s this?”\n00:49:11:06 – 00:49:12:05\nPeter Lange\n[Laughs]\n00:49:12:07 – 00:49:34:18\nNannerl Keohane\nIt was perfect. And he would have been great today as well. [Former Duke President] Doug Knight, who was a wonderful guy, really had a hard time with the protests. And that’s why he resigned. I remember when I would host people at the Knight House. And in the living room, sometimes alumni would tell me as we were having the cocktails, “You know, when I was here occupying this building, that’s where I slept.”\n00:49:34:18 – 00:49:46:11\nNannerl Keohane\nI thought, “Okay.” [Laughs] So there had been much more dramatic protests before we came. The one that I remember most clearly from our time was about sweatshops.\n00:49:46:17 – 00:49:47:12\nPeter Lange\nYeah.\n00:49:47:14 – 00:50:33:02\nNannerl Keohane\nAnd for that one, I was very sympathetic with the students. I thought that it was relevant that wearing a Blue Devils sweatshirt meant that where it was manufactured had something to do with what we were like. So for that one, the protests were easily successful with me as president. because I agreed with them. That’s not true of all the protests. But setting limits in the sense that people understand that radically disrupting the education, destroying property, or making life difficult to impossible for some other members of the community, is not acceptable.\n00:50:33:02 – 00:50:57:01\nNannerl Keohane\nAnd there will be barriers, and there will be consequences. We never really had to get into that, because the times were different. I have a lot of sympathy for the people who are grappling with it today. But I realized that that was not at that depth, something we had to deal with. At Wellesley, I did. With the protest over divestment.\n00:50:57:03 – 00:50:58:15\nPeter Lange\nOkay.\n00:50:58:17 – 00:51:00:01\nNannerl Keohane\nBut not at Duke.\n00:51:00:03 – 00:51:30:03\nPeter Lange\nIf we switch from the present, or the past and the present, to the future. So, you have a long view of Duke now, and a long view of higher education now. And I’d love for you to reflect a little bit on what you see as both the best future for Duke, and how that fits into the future for higher education.\n00:51:30:05 – 00:51:54:05\nNannerl Keohane\nI was thinking of my conversation with [Duke Presidents] Dick Brodhead and Vincent Price last night, which was a wonderful experience for all of us. One thing I said last night [that] I would start with in answering your question — when I came to Duke, I thought of it as being on a trajectory between being a fine regional university, a national university, and on its way to being a global university.\n00:51:54:07 – 00:52:17:08\nNannerl Keohane\nAnd we’ve been moving along that spectrum ever since. I think we are now a globally-recognized university. What I hope for Duke in the future is that we continue to occupy that large spectrum as a very fine and respected institution. We also remain true to our roots. I think Duke people are rightly interested in tradition.\n00:52:17:08 – 00:52:59:18\nNannerl Keohane\nIt’s one of the few places in the world where the founding family remains deeply involved. The Duke family are having a breakfast reunion here as we celebrate the centennial. I don’t know anyplace else that’s like that. And having the sense of continuity with the past, as well as an optimistic view of the future –for me, in order to make that future truly meaningful, we must remember that we are strongly rooted in the South. That we have a certain kind of history as an institution that is different from the histories of the northeastern Ivy leagues or the West.\n00:52:59:20 – 00:53:29:05\nNannerl Keohane\nAnd [that we] not lose that. I don’t know exactly what that is going to mean in the future. But I have every belief that it will matter, and that we should find ways to continue our regional distinctiveness and be faithful to our roots and our traditional obligations, at the same time that we celebrate our international growing prominence.\n00:53:29:07 – 00:53:42:06\nNannerl Keohane\nSo I think for me that sort of moving along that trajectory and finding comfortable places at each point along the way and holding on to them, is the way I would think about Duke’s future.\n00:53:42:08 – 00:53:58:00\nPeter Lange\nSo it’s interesting, because I can remember a conversation you and I had a while back now about this topic. And the metaphor I used was that Duke was like a late teenager becoming a young adult.\n00:53:58:01 – 00:53:58:13\nNannerl Keohane\nRight.\n00:53:58:13 – 00:54:01:03\nPeter Lange\nAnd perhaps now it’s an adult.\n00:54:01:03 – 00:54:02:21\nNannerl Keohane\nI think it’s definitely an adult.\n00:54:02:21 – 00:54:16:04\nPeter Lange\nRight? But the question still becomes, as you mature — what changes as you mature? And how does the university right move into maturity without becoming complacent?\n00:54:16:09 – 00:54:42:15\nNannerl Keohane\nThat’s exactly right. That’s what I was going to say. The great threat of — and I think of some other very fine universities that have been threatened by complacency. They’ve lost their sense of hunger and ambition and desire to get even better. I hope that Duke always retains a sense of humility. We can do even better, but we need to be proud of what we are without becoming complacent.\n00:54:42:15 – 00:54:49:19\nNannerl Keohane\nI think that’s the main threat. I think Duke’s far from that. But someday it may be a threat.\n00:54:49:21 – 00:54:59:14\nPeter Lange\nWell, this is great. Are there things you’d like to add about your experience, or about how you think about Duke these days?\n00:54:59:16 – 00:55:26:23\nNannerl Keohane\nWell, I would simply emphasize how wonderful the people are, and were. Getting to know students, getting to know faculty members and the administrative team and the board and townspeople who worked with us. I have always been struck — and coming back to Duke now for this celebration — I’m struck once again how pleasant people are. I mean, people are not all sort of mealy-mouthed or anything, but people say hello to you.\n00:55:27:05 – 00:56:04:12\nNannerl Keohane\nPeople greet you. This is not so true in Boston, or New York. And it just feels good to be in a place where people feel warm enough to each other, or courteous enough to each other, to make you feel welcome. I also think about the ways in which Duke’s academic prominence has continued to infuse the rest of what we do. And I hope that will always be true, that it won’t get lost in the feeling that we must also be high with tech transfer and other things that we do. That’s important.\n00:56:04:14 – 00:56:27:13\nNannerl Keohane\nBut what happens in the classroom, what happens in the libraries [and] in the laboratories, is so central to what we do. And I don’t want to think that we might ever lose sight of that in getting caught up in other aspects of Duke’s prominence today. You’ve asked so many good questions. I don’t really have anything else that I would add, except pride and humility\n00:56:27:13 – 00:56:36:21\nNannerl Keohane\nin having been part of this place. And a sense of its very special nature, which really hits you coming back.\n00:56:36:23 – 00:56:44:18\nPeter Lange\nWonderful. Well, thank you so much for spending the time with us. I think it’s been great. Thank you. And I think it will be enlightening for those who see it. So thank you.\n00:56:44:21 – 00:56:46:03\nNannerl Keohane\nThank you, Peter.",
  "word_count": 10424,
  "scraped_at": "2026-02-14T13:18:20.815244"
}