{
  "article_id": "aff5f3c1656b",
  "url": "https://newsday.co.tt/2024/11/14/yaya-cordner-joins-beylerbeyi-sk-in-turkish-super-league/",
  "title": "  YaYa  Cordner joins Beylerbeyi SK in Turkish Super League - Trinidad and Tobago Newsday",
  "date": "20241114T084500Z",
  "domain": "newsday.co.tt",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "'YaYa' Cordner joins Beylerbeyi SK in Turkish Super League\nVeteran TT women's striker Kennya \"YaYa\" Cordner has signed a deal with Beylerbeyi SK in the Turkish Women’s Super League.\nThe 36-year-old Cordner, who hails from Speyside, Tobago, is one of TT’s most recognised female footballers, having copped three TT Football Association (TTFA) Female Player of the Year awards.\nBeylerbeyi SK, who finished fifth in the Turkish Women’s Super League last season, announced the signing of Cordner via Instagram on November 13.\nThis will not be Cordner's first stint in Turkey, as the exciting attacker previously featured for Fenerbahce – registering a whopping 34 goals in her debut campaign after signing in November 2021. Cordner's prolific display in front of goal helped Fenerbahce to the playoff semis that season.\n\"In everything I do, I must first give thanks and praise to God, because without Him, I would not be where I am today,\" Cordner said via a Facebook post.\n\"Lord, I thank You as I embark on this new journey. I pray that You guide my every step, my every move. With You by my side, my new family, Monsta, is ready...\"\nCordner was most recently with Chinese Women's Super League club Henan Jianye WFC.\nWith over 60 senior international goals to her name in 52 matches, Cordner has also plied her trade in Australia, Norway and the US.\nA decade ago, Cordner was a member of the TT women's team which agonisingly came within one win of qualifying for the 2015 Fifa Women's World Cup in Canada.\nThough she's no longer terrorising defenders in TT colours, Cordner will hope to a make lasting impression on her return to Turkey.",
  "word_count": 279,
  "scraped_at": "2026-02-14T12:42:46.083039"
}