{
  "article_id": "b01470fb3ec4",
  "url": "https://www.eastbaytimes.com/2024/03/29/you-have-to-put-your-money-where-your-mouth-is-why-bay-fc-is-spending-big-in-first-nwsl-season/",
  "title": "Why Bay FC is spending huge in 1st NWSL season with plans to spend more",
  "date": "20240330T001500Z",
  "domain": "eastbaytimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Bay FC women will take the field Saturday at PayPal Park, a stadium built for men to play in, and kick off in front of their sold-out home crowd for the first time in franchise history.\nIt’s not just a game to Alan Waxman, the chief executive officer of Sixth Street who invested $125 million to help found the team last year.\n“We’re trying to change women’s soccer,” Waxman said in an exclusive interview with Bay Area News Group.\nTo do that, Waxman has a long-term plan. And while the club is grateful to be starting its inaugural season in the National Women’s Soccer League at PayPal Park, the home of the San Jose Earthquakes in Major League Soccer, that’s not Bay FC’s long-term vision.\n“Let me say it this way: We will have our own stadium and our own world-class practice facility,” Waxman said. “We’re thinking about building something for the long term. Something durable. And becoming one of the top global franchises in the world.”\nThey’re big words full of big ambitions. But from the start, Bay FC has put its money where its mouth is.\nThe $125 million initial investment in 2023 included a record $53 million expansion fee.\nIn comparison, in 2022, the San Diego Wave paid a $2 million expansion fee to join the NWSL. Earlier this year, billionaire Ron Burkle sold that club for an estimated $120 million, almost doubling the previous league record, also from this year, when the Portland Thorns were sold for $63 million.\nMoney is flying around the NWSL, and Bay FC is no exception.\nThe league’s salary cap this year is $2.75 million; Bay FC blew through that number and will pay a tax of 25% on anything over the cap. This year, the club expects to pay close to $70,000 in salary tax alone.\n“The ownership group has been incredible and supportive,” said general manager Lucy Rushton. “They want me to spend our cap, they want us to be pushing boundaries.”\nRushton, the former GM of DC United and the second-ever female general manager in major American men’s professional sports, built an entire defensive unit with free agent signings and trades early in the offseason.\nHer plan: find defensive players domestically and lure the world’s most prolific goal-scorers from their international clubs.\nWaking up at 5 a.m. to get on Zoom calls with top clubs in Europe, Rushton managed to pull off a stunning deal to acquire two-time Ballon d’Or finalist Asisat Oshoala from Barcelona, where the 29-year-old had scored 107 goals in 149 appearances over five seasons, helping the club win 14 trophies in the process.\nBut the biggest surprise came soon after, when Rushton convinced Madrid CFF to part ways with 23-year-old superstar Racheal Kundananji, who had scored 25 goals in 29 games with Madrid.\nThe cost? Almost $800,000, toppling the world record for the most expensive transfer in the history of women’s soccer.\n“You have to put your money where your mouth is,” Rushton said. “It’s really important we put that statement out. We’re here, we’re serious and we want to improve this league.”\nKundananji got hurt while playing for Zambia during international duty last month, but is expected to make her Bay FC debut on Saturday.\nFor Waxman, signing off on the deal wasn’t a difficult decision.\n“I think when Lucy brought it to me, she was a bit nervous because we’re smashing the record,” Waxman said. “But I was like, ‘No, we should do it.’”\nWaxman thought of Real Madrid president Florentino Perez, who Waxman considers a friend.\nIt was back in 2000 that Perez made his mark on soccer history. Nine days after Portuguese legend Luis Figo told the press he would never leave Barcelona, Real spent about £50 million on a release clause in Figo’s contract, shattering the previous record of £38 million and bringing Figo to Madrid, where his new club turned into a soccer superpower.\n“That was a bold move,” Waxman said. “Look what happened to Real Madrid. They were floundering and since then, they’ve been one of the top football clubs in the world over the last 20-plus years. Sometimes you have to not worry about what everyone else has done. That’s the past. Figure out what you need to do. Sometimes you need to make bold moves.”\nForbes reported that transfer fees in the January window were up 165% this year. And Rushton said she expects the record fee she spent on Kundananji to be broken again this summer.\n“For me, improving this league is also about bringing the best international players here too,” Rushton said. “That’s how we develop our league and build a global fanbase, for the league and Bay FC.”\nWaxman, who said his wife originally convinced him to take a meeting with the Bay FC founding members, said he was initially shocked when he looked at the data on the growth of the NWSL, which averaged over 10,000 fans per game last year, an increase of 32% from the year before.\nIt didn’t add up, “in a good way,” he said. People were overlooking perhaps the most important part of the league: It’s accessible.\nThe league can broadcast its own games on its own network, NWSL+, which it offers to fans free of charge. It also has partnerships with streaming services and cable companies, giving fans multiple avenues to watch.\nThe buzz around Bay FC is exciting — the club sold out its first game at PayPal Park with 18,000 tickets — but Waxman said he hasn’t forgotten the key component: build a culture that takes care of the people first.\n“It’s about investing in good humans, you can really see that,” said veteran defender Caprice Dydasco, who has played for five teams worldwide. “We’ve had owners previously where they were investing, but it was almost like a tax write-off. They didn’t have any ties with us. This year, Alan is a busy man with a busy work schedule and he took time to come spend a whole day with us, talk with us about how he really cares about the product we put on the field but more importantly, how we get treated off the field.”\nThere’s currently only one NWSL club, the Kansas City Current, that plays in its own stadium. The Current, partially owned by Chiefs quarterback Patrick Mahomes and his wife, Brittany, just spent $120 million on an 11,000-seat stadium that is believed to be the first in the world to be primarily used for women’s professional soccer.\nFor now, Bay FC will practice at San Jose State University, but Waxman promised a new training facility soon. The club expects to spend $30 to $50 million on its facility, and surely more when the time comes to build an actual stadium. Sites are being explored in the Bay Area, but Waxman wasn’t ready to say where.\n“Traditional wisdom says, ‘Wait until you have a bunch of revenue (before spending big),’” Waxman said. “We’re playing a different game. We’re trying to lead.”",
  "word_count": 1173,
  "scraped_at": "2026-02-14T13:10:44.568821"
}