{
  "article_id": "b0670384e609",
  "url": "https://www.fwweekly.com/2024/09/15/summer-transfer-roundup-4/",
  "title": "Summer Transfer Roundup",
  "date": "20240916T064500Z",
  "domain": "fwweekly.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hello, everyone. I meant to publish this transfer column after the window closed on Sept. 1, but then stuff kept happening after that, so this arrives well into football season. My apologies. With me as always is Ludovic Brainfart, my imaginary interlocutor.\nThat’s not my name! Who are the big names who have shifted this offseason?\nAs reported earlier, Kylian Mbappé’s move to Real Madrid finally went through, and after his fruitless seasons of trying to bring a Champions League title to Paris, he currently has five of the 11 goals that Real has scored. Meanwhile, their crosstown rivals Atlético Madrid went on an atypical spending spree that netted them Julián Álvarez and Conor Gallagher from Premier League big wheels and Alexander Sørloth from Red Bull Leipzig, which leaves Atleti’s offense looking unusually hefty. In England, Arsenal signed Italian defender Riccardo Calafiori and Spanish striker Mikel Merino, both of whom immediately got hurt, but the Gunners are still winning without them. Also, watch Zion Suzuki, Parma’s new 22-year-old goalkeeper brought in from Urawa Red Diamonds. He was eligible to play for either Ghana or USA, but has chosen Japan, where his mother is from. He has already backstopped the gialloblu to an upset win over AC Milan, and he spoke Italian at his introductory press conference, earning high marks from the reporters present.\nWhat about American players?\nNot much in terms of movement, but the U.S. women’s national team returned to glory by winning the Olympic gold medal. With very little time to prepare, new coach Emma Hayes swallowed hard and dropped Alex Morgan from the team. There might have hell to pay if the women’s team had then laid an egg in Paris, but the new forward line of Trinity Rodman, Sophia Smith, and Mallory Swanson (collectively nicknamed “Triple Espresso” with some help from Sabrina Carpenter) formed a potent attack and goalkeeper Alyssa Naeher (one of the few holdovers from the old World Cup-winning squads) made some tremendous saves in the clutch to get Team USA through the knockout stages. Hayes is a British manager who learned her coaching chops in this country, and winning a major honor for USA meant a great deal to her.\nDo you have a message for the haters of USA’s women?\nLast time they won a major tournament, I gave them the Kawhi Leonard laugh, but now my cultural references need updating. Ladies and gentlemen, I give them the Kamala Harris laugh:\nWhat about USA’s men?\nTons of bad news followed by some potentially great news. The men absolutely crapped on themselves at the Copa América. A shock loss to Panama followed by a non-shock loss to Uruguay meant that they didn’t even get out of the group stage on home soil. The early exit cost Coach Gregg Berhalter his job. The under-23 team then showed signs of life by first qualifying for the Olympics (for the first time since 2008) and then advancing from the group stage there before being absolutely skunked by Morocco. To pile more misery on top, Team USA then lost to Canada at home for the first time since 1957, and Canada’s coach Jesse Marsch (who was passed over for the USA job earlier) couldn’t resist rubbing it in.\nYeesh, what good news is there?\nAfter a failed pitch at hiring Jürgen Klopp (who really seems to want some time thinking about things other than soccer), U.S. Soccer landed another coach who qualifies as the biggest coaching talent in their history. Mauricio Pochettino made his name as a hard-nosed Argentinian defender, and then got Southampton and Tottenham Hotspur to overachieve, taking the latter team all the way to its only Champions League final. He didn’t find similar success at Paris St.-Germain and Chelsea, but the soft domestic competition with the former and the organizational dysfunction with the latter hampered him. Here, he’ll be in place for the 2026 World Cup on our turf, and he’ll have time (if not many matches) to sort out how Team USA is going to play. The challenges are steep, but with his tactical mind, I wouldn’t bet against him.\nWhat else has happened?\nArgentina won the Copa América, and midfielder Enzo Fernández was so happy that he started racist and homophobic chants on the bus following the win. We all have our ways of celebrating, I guess. For this, Argentina’s undersecretary of sport Julio Garro demanded that Fernández’ teammate Lionel Messi apologize for some reason, for which Argentina’s president Javier Milei fired him. Fernández, meanwhile, offered up a mealymouthed apology and was named team captain of Chelsea by their rookie manager Enzo Maresca, and it was awfully disappointing that Fernández’ Black teammates rallied to his defense. Not rallying to his defense was former Chelsea striker Demba Ba, who pointed out how Argentina was a haven for Nazis after World War II. (Which, true.) In response, Argentina’s vice president said they weren’t going to listen to a bunch of colonizers, which is ironic considering that Ba is Black. All in all, Fernández got rewarded for calling Black people a bunch of monkeys while other people lost their jobs, so we’ll just have to console ourselves that he, Maresca, and Chelsea all look adrift right now in the Premier League.\nAnything else in the racism department?\nOver in Naples, SSC Napoli were the feel-good story of Italian soccer in 2023 as they won their first league title in 30 years playing electrifying soccer. Over the next 12 months, it all fell apart as the front office mismanaged the club’s finances and the social media team posted a racist meme on TikTok along the lines of Osimhen and other Black people being coconuts. Not surprisingly, Osimhen was no longer so enthusiastic about scoring goals for Napoli, though he continued to put them in the net at a decent clip.\nWhy would the social media team do that?\nI don’t know. Napoli’s management refused to admit that their people had been racist, and it led to an impasse where one of the world’s best goal-scorers was put up in the shop window this past summer. They seemed to have a deal with Al-Ahli, but Napoli then jacked up the price at the last minute and the Saudi outfit wouldn’t meet the new price, so Osimhen got benched, stripped of his jersey number, and then loaned out to Galatasaray.\nWhere is that?\nIstanbul. The soccer in Türkiye at least will be of a higher competitive standard than it is in the KSA. The Turkish Süper Lig is coming off a drama-filled season of its own, where both Galatasaray and their crosstown archrivals Fenerbahçe accused the league of rigging games for the other club and all the matches were briefly suspended after Ankaragüçü’s team president Faruk Koca charged the pitch after a loss to punch the referee in the face. (There was briefly talk that the ref would lose an eye, but thankfully that didn’t happen.) Koca has now been banned for life from Turkish soccer.\nWho else should we say goodbye to?\nAfter the Olympics, Alex Morgan suddenly announced her retirement and also her pregnancy with her second child. She played her last game on September 8 and was substituted in the 13th minute in recognition of the number 13 that she wore throughout her career. This column has on many occasions recognized her electrifying talents on the pitch, and she remains one of the most devastating strikers I have ever seen on breakaway chances. (In fact, the most devastating on the women’s side — on the men’s side, Thierry Henry and Cristiano Ronaldo are comparable, and Erling Haaland might just get there, too.) Now it’s time to recognize everything she accomplished off the pitch. From the time she contributed an MVP-worthy showing at World Cup 2009 and her teammates were still calling her “Baby Horse,” she was on track to become the public face of the sport (and it was a very pretty face — there’s no use pretending that her looks weren’t part of her stardom). She embraced everything that that meant and used it to not only raise the profile of women’s soccer but also get equal pay for her fellow players and stand up for LGBT players on her team and everywhere else, and she did it all while hanging with Taylor Swift and presenting people’s daughters and sons with a role model. The whole sport owes her a great debt.",
  "word_count": 1408,
  "scraped_at": "2026-02-14T12:33:29.400489"
}