{
  "article_id": "b079aaff37ed",
  "url": "https://www.ksl.com/article/50825591/battle-tested-despite-nfl-aspirations-miles-battle-looking-to-finish-out-with-a-bang",
  "title": "Battle tested : Despite NFL aspirations , Miles Battle looking to  finish out with a bang  ",
  "date": "20231221T204500Z",
  "domain": "ksl.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Estimated read time: 4-5 minutes\nThis archived news story is available only for your personal, non-commercial use. Information in the story may be outdated or superseded by additional information. Reading or replaying the story in its archived form does not constitute a republication of the story.\nLAS VEGAS — One year wasn't enough for Ole Miss transfer Miles Battle.\nThe rangy cornerback entered the transfer portal last season looking for a place that had a more NFL-ready defense and one that featured a defensive coaching staff that could fine tune his technique.\nBattle felt that Utah was that place.\nHe joined the program in spring, ready to do whatever the coaching staff — primarily his position coach Sharrieff Shah — told him he needed to do to see the field. As a proven and veteran player at Ole Miss, Battle learned he had to work even harder at Utah.\n\"Miles was made no promises,\" Shah said. \"Come out, come learn the defense, and if you're good enough, you'll play — not start — you'll play, but that's if you're good enough.\"\nShah said the spring was \"hard for Miles\" as the team broke habits and tried to mold him into the player they wanted him to become — not an easy task after four seasons at Ole Miss. But Battle took it in stride and put in the work, and even became a vocal leader in an already experienced cornerback room.\n\"This is the mentality, this is who we are,\" Shah said. \"I'm not going to try to surprise anybody. We're not going to give you a individual party because you're coming here. It's a, 'Hey, we love you, you're part of our family, this is our family dynamic now, this is how we do business.' And Miles was awesome, because he's like, I love it.\n\"When you have a kid like Miles say, 'Coach, I wish I was here for another year' — as many times as I yelled at him I didn't think he was gonna say that, but it makes you feel good that what we believe in as our culture is something that kids appreciate, need, want and then thrive in it.\"\nBattle certainly thrived in that culture and became a standout corner for the Utes, even in just one season with the team.\n\"I got a lot of reps under my belt, honed in on my technique — that was a big thing for me — and then playing in all types of weathers, as well, which I said when I first got here,\" Battle said. \"So just overall learning different defenses, learning a more NFL-ready defense, I feel will help me in the long run, as well.\"\nBattle will soon turn his attention to the NFL, where he hopes to make a roster — whether that be through the spring's draft or as an undrafted free agent. But unlike some other players in a similar position, Battle didn't opt out of the Las Vegas Bowl.\nUuuuhh I'm still playing in the Bowl 🙋🏾♂️ dont get it twisted lol #uboyzontophttps://t.co/wlwlxjwfm7\n— MB1 (@milesbattle2) December 10, 2023\nBattle said he made a commitment to his team, and he wants to see the season through. It's not a knock on players that have decided to not play, it's just how he's approaching the end of the season.\n\"I love my teammates,\" he said. \"That's another reason why I'm playing in a bowl game; it's more than just a game. I came here wanting to play with these guys and I gave them my all, they gave me their all, so I've got to finish it out with them.\"\nIt's a decision, he said, that \"wasn't really hard.\" It's another chance to be on the field, another chance to showcase his skills, and another chance to improve his NFL stock — all while doing it with the teammates.\n\"I never had in my mind that I would opt out,\" Battle said. \"I've played in every bowl game before this. Last year, I played in a bowl game and I was in the portal, so it's like why not play my last college game ever — finish out with a bang.\n\"I feel like it can do nothing but help me if I go out there and put on a good show. Hopefully, that can also help me get into one of the senior bowls, like either the Reese's or East-West Shrine bowl. Hopefully they're watching and see me do good things.\"\nIts a special place out here in the mountains. I encourage everyone to come see it 🖤❤️ pic.twitter.com/qVI94omIkL\n— MB1 (@milesbattle2) November 28, 2023\nThough many of his teammates have either transferred out of the program already or will be absent Saturday in pursuit of an NFL dream, Battle remains engaged with Utah and the team's attempt to beat Northwestern.\nHe's even ready — should Utah win — with another one of his quips he traditionally posts on X after a win.\n\"When I was little I used to watch wrestling a lot,\" he said. \"And they always have like little quick comebacks at each other, and so I guess it kind of stems from that from my childhood. But I think of them sometimes weeks in advance before we even play teams. I've got one for Northwestern, too, but I ain't gonna let nobody know about it just yet.\"\nThat's just another reason for Utah to win Saturday.\nUtah Update: AS soon as U count us out; its our time to eat.. Put your forks down‼️ #Uboyzontophttps://t.co/oEiAy0nVLj\n— MB1 (@milesbattle2) November 4, 2023",
  "word_count": 937,
  "scraped_at": "2026-02-14T13:10:12.071117"
}