{
  "article_id": "b0b66fb6de5a",
  "url": "https://www.managingmadrid.com/2023/11/28/23970632/six-months-later-all-the-same-story-copa-de-la-reina-aftermath-real-madrid-femenino-essay",
  "title": "ESSAY : Six Months Later All The Same Story",
  "date": "20231128T224500Z",
  "domain": "managingmadrid.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It’s been half a year since the infamous Copa de la Reina final, so I decided to rewatch the full match again. There are two important things to note for why I’m writing this article - I’ve never stopped looking for answers on why things that happened that day happened, and this was my first time going back to watch the extra time. It was also addressed in the episode of Las Blancas Podcast that neither Yash or I watched the last 30 minutes, and the episode was filmed around 16 hours after the match had ended.\nSix Months Later All The Same Story\nCopa de la Reina aftermath is still present - an essay\nWhen I say I never stopped looking for answers, I’m not joking. Every once in a while, I’d get a thought related to this final and raise the question “why?”. It’s a different kind of why every single time. There’s another question that pops into my mind often and it’s “was there any silver lining from us losing this match and the way we lost it?”. To this question, the answer is still no. As long as I’m aware of, at least.\nI’m not going to go over details of how the match went, that can be found in this article that I wrote right after the final. It wasn’t easy to finish that piece, just to clear it up. Nevertheless, this one serves as an add-on, a general view on which things never changed from this very match. It’s been 6 months and 16 matches played since that final. How bad can the parallels possibly be?\nFirst thing I noticed was the fact that all 16 players who played in the final are still in the club. This was my main thought during the first half. I went to Google to check the lineup and substitutions. Not like I didn’t already know them by heart, but seeing the names written down helped. The main name that comes to my mind when reading the people left out of this game is Esther. It’s her because Alberto Toril had trusted her during the entire season, even when she needed rest to recover her level. He had been building the connection between Esther and the team for months only to completely toss it away a month prior to this final. To this day, I don’t get it. I get that it was already decided that she’d leave, but not using her while he could is plain madness. Not to forget Nahikari whose situation has the reason and outcome reversed from Esther’s. Not going to lie, I’m already thinking about who will end up in a similar situation at the end of this season, if he lasts that long.\nQuick thought: how happy the entire squad was when celebrating the goals. The camera that focused on the bench in both Toletti’s and Ivana’s goal gave some wholesome content, at least for a little while. Watching their reactions now, in the new season, in November of 2023, is bittersweet.\nNow, the substitutions, they were bad, but how bad? The first change, in 70’, was Maite and Møller replacing Feller and Athenea. Alright, not that bad still. A midfielder suited for #10 role and a striker who has been used as a winger the whole time, but had Weir still on pitch to help. Attacking midfielder and a striker-winger on for two attackers. Not bad. It was the sub in 83’ that ruined the whole flow. Sofie Svava and Teresa Abelleira for Zornoza and Caicedo. A defender and a defensive midfielder, for a winger and a box-to-box midfielder. See the problem here? There was no attack left. And why would there be? We were 2-0 up and “only” 7 minutes to go.\nManaging games was never our strong suit. The attack at this point was Olga-Møller-Maite with Weir pulling up more to serve as the second striker at times, which she was doing the whole match, and for weeks prior to the final. There was another problem, though, and it was that the rain that started during halftime, got much stronger from the 60th minute. The match got a lot more physical. Aggressive fouls were growing to be less avoidable while the pitch was turning into a pool. The tension in the players grew higher too with every foul committed.\nIn the past month or so, there have been games where the substitutions were managed properly. However, there’s another thing. When injuries come along, and they have come along at a rapid pace lately, the coach needs to rely on the rest of his squad. Caroline Møller was renewed at the end of last season for 2 more years but has played mere 170 minutes this season. And there were 14 competitive games since her renewal. There’s also the case of Freja Siri who was bought at the start of the last season to barely ever play, and when she would play, it would be in the last minutes of the match where the “game management” came in. Like in this final. I mean, who puts on a natural defensive midfielder 5 minutes before the penalties when you don’t have an attack? More importantly, who gets surprised when things don’t work out after making a whole array of illogical decisions?\nThus, basically, in order to manage your substitutions in one game, you would need to have trusted your players prior to the very match. This problem had gone on for months actually. Real Madrid were eliminated from the Women’s Champions League in the group stage last season because of the lack of trust the coach had for his players. So, it’s not like there weren’t signs, major ones, even before the end of the season. It’s just the decision to never learn about the squad at hand.\nSpeaking of substitutions, one fun detail I noticed was that even after Freja got on in 115’ - there were people still warming up. There were clearly people warming up, shown on the stream, 20 seconds before the very end of the extra time. More so, after Freja got on, there were no substitution windows left to make another change. Once again - it had been pouring rain for over an hour at that point and all the players were drenched.\nIt’s a very fun little detail actually, really shows the lack of compassion for the players’ health. Imagine, I have another parallel to a recent event that’s connected to this. From last season, I can remember 3 times a player of ours was at risk of a concussion and was either never subbed off or subbed off after a significant amount of time. Just this past week, Signe Bruun suffered a hit in the head at around 64’ and it would be 9 minutes later that she realized she couldn’t go on. Ivana had to tell the medical staff to get her out before a freekick would be taken. In those 4 or so minutes without Bruun on the field, we were a player down and conceded to finally lose the game against Häcken. So, there were around 10 minutes for Caroline Møller to warm up and get on right when Bruun would ask for a change. Instead, everything was done last minute, and even later, considering we had already conceded by the time we got the 11th player back.\nJust to clarify - I don’t care if it’s a Champions League final, a concussion-prone player has to be subbed off immediately. Even if there are no subs left, the player needs to get out as soon as possible. A lost game is nothing compared to possible health problems of the player in question. Even in this aspect, we haven’t changed.\nThere is one thing Toril changed, and that’s quite literally being forced to play without his simplest solution to every problem - Caroline Weir. There were quite a lot of experiments with different gameplay types last season and whenever one of them would work, that thing would never be seen again, and we’d resort to the same ol’ same ol’. That would result in some hideous teamwork, and ultimately the game would oftentimes be won thanks to individual talent. It was Weir most of the time, of course. With her tearing her ACL early on this season, Toril was left without his go-to solution so there came the time to stop being lazy and think of tactics. Except that there was nothing to see still. He did learn to occasionally make good substitutions, but when it came to trusting the players he refuses to trust, it would all come crushing down. For that we have the games against Chelsea, Barcelona and BK Häcken as proves of that. I mean truly, even without looking at the scoreline, in all three games there was nothing to see from Real Madrid on the pitch.\nThe squad changes but the coach doesn’t. He got rid of a lot of players that he didn’t choose - that were already there when he was appointed as a coach. Which is fair, okay, he didn’t choose them, but the mere perseverance to never even try to learn about majority of those players still blows my mind. He doesn’t even make this effort for the players he chose to sign; let alone those he pushed out in some way.\nAll players can be valuable when trusted and used in the best of their abilities. The same way how the same players can produce the worst possible team football, when none of them are used correctly. Caroline Weir really fixed a lot of those holes even when it was the second option in motion, but at the end of the day - football is a team sport. These holes would come out eventually.\nLast but not least, I’d like to address the infamous statements of Alberto Toril after losses in major games. His absolute favorite excuse he seems to love using is that this is still a young team - mentioning the 4 years of existence of Real Madrid Femenino. It’s funny how it’s been his go-to excuse for the past 2 years. More recently, there was his excuse where he said “It’s football” after an embarrassing display of football and an even worse score against BK Häcken. And finally: “It was our first final and it’s important to get experience” after losing the chance at our first ever trophy in the worst possible manner.\nSix months later, and it’s all the same story, over and over again. Starting from the root - the narrative, the mindset - to the on-field tactics. Never changing, never growing.",
  "word_count": 1786,
  "scraped_at": "2026-02-14T12:56:51.568309"
}