{
  "article_id": "b0e270907b9f",
  "url": "https://theathletic.com/4731110/2023/07/29/devilish-in-swinging-corners-world-cup/",
  "title": "Devilish in - swinging corners are making all the difference at this Women World Cup",
  "date": "20230729T113000Z",
  "domain": "theathletic.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "If ever there was a game of football to demonstrate the importance of set pieces, this was it: Sweden versus Italy, July 29th 2023, Wellington.\nIn the 20 minutes of one of the most eagerly anticipated games of the World Cup 2023 group stage, Sweden were a shambles. Yet at half-time, they were 3-0 up, had won the game, and had effectively wrapped up Group G thanks to the goal-difference boost too. The difference, quite obviously, was set pieces.\nAdvertisement\nFirst, we shouldn’t overlook what happened during the opening period. In a World Cup that has thus far been mundane tactically, with most of the big sides playing similar 4-3-3 systems and relying heavily on the flanks for their attacking, Milena Bertolini used an unusual approach that completely flummoxed Sweden.\nDescribing it in traditional formation terms would be tricky, but this was something of a cross between a diamond midfield and a 4-2-3-1. It involved Giulia Dragoni playing as a No 10, left-back Lisa Boattin pushed high to allow left-winger Barbara Bonansea to become a second striker, and — most dangerously of all — Sofia Cantore used in a strange hybrid role: a centre-midfielder on the right without possession and a touchline-hugging right winger in possession. Sweden’s left-back Jonna Andersson was being regularly bypassed.\nItaly dominated the opening stages to the extent that on two occasions — once when there was a break for an injury and again when they simply needed a moment to work out what on earth was going on — Sweden’s players gathered together for an impromptu committee meeting in the centre of the pitch, frantically pointing around and adjusting their tactics on the fly.\nIn fairness, it seemed to work. After being on the back foot for 20 minutes, Sweden stabilised the game for 10 minutes. They offered more going forward, particularly with the speed of Stina Blackstenius running into the channels.\nBut Sweden won the game almost solely from set pieces. Three of their four goals were from the exact same source, the right-wing, in-swinging corners from the left boot of Andersson. This was a perfect encapsulation of Andersson, more naturally a wing-back than a full-back — never entirely secure defensively, but an expert crosser.\nSo, after 39 minutes, it was her in-swinging corner, high and looping towards the near-post zone, which dropped perfectly for Amanda Ilestedt, scorer of Sweden’s winner against South Africa last Sunday from a set-piece situation. 1-0.\nAdvertisement\nAfter 44 minutes, Andersson tried the exact same ball, towards Ilestedt. This time, Italy captain Bonansea challenged her and got some kind of contact on the ball but it fell for Fridolina Rolfo at the far post to tuck home.\nOn the stroke of half-time, Sweden had the good grace to actually score in open play, courtesy of Blackstenius.\nBut then the pattern continued in the second half. Four minutes in, another Andersson corner towards Ilestedt, and this time Bonansea nodded it away for another corner. That was no good.\nAndersson yet again dipped it in towards the near post, and Ilestedt nodded home her second of the game and her third of the tournament. No one has scored more at World Cup 2023 so far.\nClearly, Italy could have coped much better with the deliveries, and this was an exaggerated example. But devilish, in-swinging corners have become one of the patterns of this World Cup. Andersson was trying the same thing in the opening game here in Wellington against South Africa, at one stage curling a corner just over the bar and onto the top of the net.\n“Maybe I didn’t expect three goals, but it’s one of my strengths and something I’m working on a lot in training,” said Ilestedt. “And about the set pieces — we are really good. We have a lot of players who are good headers.”\n“We know they’re very strong from set plays — they’re very strong physically and they’re very skilled with their set pieces,” said Bertolini. “They score a lot, and unlock games in that way. We tried to defend zonally because we think for a team that has weaker players (aerially) it’s the best solution. We can’t play one-against-one.”\nSometimes it feels like corner takers are shooting for goal at this tournament — the most obvious example being Katie McCabe’s opener against Canada, when the Irish captain was wheeling away in celebration almost before the ball struck the far post and bounced in.\nAdvertisement\nThis isn’t anything new in women’s football, as the graph below demonstrates. Data from Fbref.com, using Opta data, shows an obvious pattern: women’s competitions feature a higher percentage of in-swinging corners than the equivalent men’s competitions.\nThis World Cup is right up there in terms of in-swinging corners. All 19 of Sweden’s corners have been in-swinging: using Andersson’s left-footed corners from the right, and Kosovare Asllani’s right-footed corners from the left. Australia have gone one better: 20 corners, 20 in-swinging, and one goal thanks to Alanna Kennedy’s late, headed consolation against Nigeria. Of everyone in the competition, so far only Spain — never tempted to go direct in any situation — are obvious exceptions in terms of favouring out-swingers.\nThe focus on in-swinging deliveries in the women’s game fairly obviously seems to exploit the fact goalkeepers are shorter and less capable of both covering the height of their goal, and coming to claim balls in the six-yard box. That doesn’t entirely explain the struggles of Italy goalkeeper Francesca Durante, listed as 5ft 11in (1.81m) — above the average for goalkeepers in the competition — in this game. Of course, her outfielders were equally to blame. And it’s interesting that the one outlier in the above graph is the Italian top flight — maybe Italian players aren’t quite as accustomed to the relentless use of in-swinging corners.\nBesides, Sweden are a formidable side in the air, offering aerial ability not just from the positions you’d expect, like centre-back and centre-forward, but also from the likes of left-winger Rolfo and right-back Nathalie Bjorn. Manager Peter Gerhardsson places a big emphasis on practising set plays the day before a game, and his analysis team are asked how to exploit the opposition’s deficiencies at them.\nIt’s also significant that Gerhardsson has, to the surprise of some, opted for Zecira Musovic over Jennifer Falk in goal. Musovic is probably not a better shot-stopper than Falk, and often spills powerful efforts, but she’s unquestionably more physically imposing — and is less likely to be dominated inside her own six-yard box.\nSweden eventually won this game 5-0, the final goal being scored by Rebecka Blomqvist on the counter-attack, straight from an Italy corner. The corner was, out of keeping with the tournament — but in keeping with Italy not quite getting the drill — an unfashionable out-swinger.\n(Photo by Catherine Ivill/Getty Images)",
  "word_count": 1137,
  "scraped_at": "2026-02-14T13:26:45.260125"
}