{
  "article_id": "b0e80b9ef379",
  "url": "https://www.theguardian.com/australia-news/2024/mar/06/morning-mail-tesla-accuses-car-lobby-of-false-claims-super-tuesday-polls-in-the-us-ukraine-sinks-russian-warship-ntwnfb",
  "title": "Morning Mail : Tesla accuses car lobby of  false claim , Super Tuesday polls in the US , Ukraine sinks Russian warship | Australia news",
  "date": "20240305T223000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Morning everyone. It’s not every day that a company run by one of the richest people in the world lends the Labor government a helping hand. But Elon Musk’s Tesla has launched a fierce attack on the Australian car lobby for misleading the public about the impact of the Albanese government’s clean car policy. We have the full, exclusive story, plus a new UN report describes the abuse of Palestinian detainees in Israeli detention centres, and Taylor Swift urges her fans to vote as the US Super Tuesday elections get under way.\nAustralia\n-\nCoral fears | Scientists fear excessive ocean heat – which is bleaching corals in parts of the Great Barrier Reef – is now hitting the world’s most southern coral reef at Lord Howe Island. And global heating could also see ice-free Arctic summers within 10 years, scientists fear.\n-\nExclusive | Tesla has launched a scathing attack on Australia’s main auto industry lobby group, accusing it of attempting to delay climate action by repeatedly making “plainly false” claims to the public about an Albanese government clean car policy.\n-\nDisability delay | Claims for the disability support pension took more than 80 days on average in the final months of last year and some local government areas are experiencing average wait times of more than 200 days, data has revealed.\n-\n‘Negative impacts’ | A Melbourne private school launched an unsuccessful legal bid to block a 24-hour mental health facility from being built next door, after it argued it posed a risk to students’ safety and would affect its future viability.\n-\nElectric Euro dream | South Australia’s dance pop duo Electric Fields, made up of vocalist Zaachariaha Fielding and Michael Ross on keyboards, will represent Australia at Eurovision in May, after missing out on the honour in 2019.\nWorld\n-\nSuper Tuesday | Voting is under way in the US “Super Tuesday” primaries with Donald Trump expected to wrap up the Republican presidential nomination, while Taylor Swift has urged her fans to make sure they vote. Follow the action at our live blog. And according to a leading historian, the US supreme court “erred badly” in ruling Colorado was wrong to seek to remove Trump from the ballot.\n-\nAbuse allegations | An internal UN report describes the widespread abuse of Palestinian detainees in Israel, detailing beatings and sexual assault. It comes as negotiations aimed at brokering a ceasefire in the Israel-Gaza war appear to have stalled, days before an unofficial deadline of the beginning of Ramadan.\n-\nMenopause ‘misinformation’ | Many companies have a commercial interest in portraying menopause as a “medical problem”, leaving women inundated with misinformation, a series of papers published in the Lancet has found.\n-\n‘Historic humiliation’ | Ukraine has sunk a Russian warship near the Kerch strait in occupied Crimea, it said, in a further challenge to Moscow’s naval power and its control over the Black Sea despite Ukrainian losses elsewhere.\n-\nTarde response | Spain’s leftwing labour minister has drawn a storm of criticism after describing the country’s custom of keeping restaurants open until late into the night as “madness” and bad for the mental health of staff.\nFull Story\nBlack Box episode one: the connectionists\nTo begin our podcast series Black Box delving into the world of artificial intelligence, we have the story of Geoffrey Hinton, a man who set out to understand the brain and ended up working with researchers who invented a technology so powerful that even they don’t truly understand how it works.\nIn-depth\nSam Kerr’s shock court appearance in London has stunned her loyal fans. They, like football administrators and coaches back in Australia, had no idea about the story until media reports about an incident that happened in January last year. The Matildas star player denies the charges. Jack Snape considers what’s at stake for the game’s golden girl.\nNot the news\nIf you’re looking for a good read, our resident bookworms have sifted through the best books published in Australia this month. Recommendations include the “generous intellectual tapestry” of Nam Le’s 36 Ways of Writing a Vietnamese Poem, to Appreciation, Liam Pieper’s “spot on” satire of the Australian art world, and from the “irresistibly” titled Loving my Lying, Dying, Cheating Husband by Kerstin Pilz to Emma Darragh’s thought-provoking Thanks for Having Me.\nThe world of sport\n-\nAFL | St Kilda defender Jimmy Webster has received the longest AFL suspension in six years after being given a seven-game ban for his ugly bump on North’s Jy Simpkin.\n-\nChampions League | Bayern Munich take on Lazio and Real Sociedad welcome PSG in this morning’s last-16 second leg ties. Follow the action on our live blogs.\n-\nTennis | Simona Halep is free to resume her career after the court of arbitration for sport reduced her doping ban from four years to nine months.\nMedia roundup\nThe Malaysian prime minister has urged the world to accept China as a superpower in comments at odds with Penny Wong’s own remarks to the Asean summit, the Age reports. Firefighters tell the Newcastle Herald their worst fears appear to have come true after a faulty lithium battery sparked a house fire that killed two women near Lake Macquarie. Work will start on the long-delayed cycle ramp at the northern end of the Sydney Harbour Bridge this year, the Sydney Morning Herald reports.\nWhat’s happening today\n-\nCanberra | Greens MP Max Chandler-Mather will debate the Property Council chief executive on the housing crisis at the National Press Club.\n-\nAdelaide | South Australia government application to keep Snowtown murders accomplice under watch.\n-\nPerth | Family lawyers of Aboriginal woman Miss Dhu, who died in police custody, meet Western Australia government to discuss their civil claim.\nSign up\nIf you would like to receive this Morning Mail update to your email inbox every weekday, sign up here. And finish your day with a three-minute snapshot of the day’s main news. Sign up for our Afternoon Update newsletter here.\nPrefer notifications? If you’re reading this in our app, just click here and tap “Get notifications” on the next screen for an instant alert when we publish every morning.\nBrain teaser\nAnd finally, here are the Guardian’s crosswords to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 1050,
  "scraped_at": "2026-02-14T12:47:26.942614"
}