{
  "article_id": "b1140d8f3c9b",
  "url": "https://www.stamfordmercury.co.uk/news/travel-back-in-time-with-mercury-memories-9305048/",
  "title": "Hundreds of years of history from Stamford , Rutland , Bourne and Market Deeping",
  "date": "20230324T190000Z",
  "domain": "stamfordmercury.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hundreds of years of history from Stamford, Rutland, Bourne and Market Deeping\nStamford named the best place to live, a mother's attempted murder of her children and accidents in extreme darkness.\nThese are just some of the stories from this week's Mercury Memories, which delves into stories from up to 200 years ago thanks to the support of the Stamford Mercury Archive Trust.\n10 years ago\nMarch 22, 2013\nPeople who live in Stamford have known it for ages, but now the whole of Britain knows it too... Stamford is the best place to live.\nThe town has topped the Sunday Times list of best places to live in Britain.\nThe newspaper said it was basing its list on hard data such as crime statistics, schools, house prices and life expectancy and also information on transport links, the beauty of the local area, community spirit and even if there was a Waitrose nearby! Whatever the criteria though, it seems everyone is agreed that Stamford has much to offer residents and tourists alike.\nMayor Bob Sandall was delighted with the accolade.\n“I agree entirely it’s the best place to live – it’s a marvellous town,” he said.\n“I have lived in Stamford all my life. I was born here and I have never wanted to leave.\n“We have got some of the finest stone buildings in the country.”\nA credit union has appealed for volunteers to help run a savings service which will allow people to steer clear of payday loan companies.\nThe Stamford and Deepings branch of Lincolnshire Credit Union is offering small, low interest loans to people who need some extra cash before payday.\nThe group, which is controlled and funded by members, wants to offer an alternative to people tempted by payday loan companies which offer small sums of money with huge interest rates.\nBut the group needs the help of volunteers to donate one or two hours every Wednesday to run the service.\nMember Harrish Bisnauthsing said: “We don’t want anyone to be destitute or fall into the arms of loan sharks.\n“If someone is in difficulties we will offer them a loan of up to £300 if they open up an account with us with just £5.\n“They would only need to pay about £6 back per week.\n“I know we are living in a difficult economic situation and we want to help people if they are in difficulties.”\nVolunteers for a charity are celebrating after collecting £70,000 to train hearing dogs – more than double what they hoped to raise.\nDenise and John Taylor, of South Witham, and Pauline Shepherd, of Melton, from Hearing Dogs for Deaf People set out to raise £30,000 at the start of last year as part of a campaign called Merlin’s Mission.\nThe aim was to raise enough money to fund three hearing dogs for deaf children and mark the retirement of springer spaniel Merlin, which has worked for several years as a demonstration dog – showing how much of a difference a hearing dog can make to a deaf person’s life.\nThey were thrilled when they sailed past the target in the autumn and have finished the campaign, having raised more than £70,000.\nThe additional money will go towards training hearing dogs for adults as there is a five year waiting list for a dog.\nDenise said: “What we raised is just an absolutely amazing amount. None of us can really believe it.”\n25 years ago\nMarch 20, 1998\nResidents are calling for play equipment to be taken away after a year of misery from rowdy youths.\nPeople living in the Mountbatten Avenue area of Stamford say the equipment installed in the Rainbow Playground was unsuitable for young children and takes up space where they used to play football.\nLetters of complaint from 17 residents were sent to Stamford Town Council in May last year, after youths who use the site as a meeting place vandalised the equipment. The police also promised to increase patrols in the area.\nJoan Smith, of Mountbatten Avenue, said the ground under one of the climbing frames is littered with broken glass, and the area is frequently used by dog owners who flout the law by failing to clean up after their pets.\nShe said: “The police patrol the area first thing in the morning and at midday, but they don’t come around at night when the trouble starts. Nothing is being done about it.\n“The equipment is not well-used, and children play football in the space at the side of my house. It’s a total waste of money.\n“People living in Rutland Heights wanted play equipment in their area.\n“We’d be quite happy if this equipment could be moved there.”\nThe fight is on to stop plans to build houses on one of Stamford’s main sports grounds.\nStamford Town Council backed a motion by Coun John Aylin on Tuesday to “take any steps necessary within its powers to oppose any proposed development of the Lincoln Road sports ground”.\nIts future was threatened after owner BTR admitted it struck a “legally binding” deal on the ground with a property developer in February.\nCoun Aylin said: “These facilities are few and far between because Stamford is the poor relation in South Kesteven.\n“As well as being home to the Blackstone’s Football Club, there are also coaching facilities for youngsters, a netball league, and I understand it has the best bowling green in Stamford.\n“There is nowhere in the town that can provide all these facilities on one site.”\nThere has been speculation over the site since houses were built at the top end of the ground in the 1980s.\nTown clerk Tony Wain will write to BTR to ask about its intentions for the ground.\nHe said: “It was suggested at the meeting that it could be considered a Millennium project but we don’t know what the situation is at the moment.”\nThe Friends of Stamford Hospital are backing major changes which will mean improved patient care.\nThe group raised more than £16,000 last year. This is being spent on equipment and the Friends are now embarking on fund-raising efforts to help back the alterations.\nThe hospital is looking to extend the range of surgical services provided, and plans for a second theatre to improve and expand the number of day care patients treated are in discussion.\nThe outpatient and casualty department has also been reviewing the services provided.\nGlen Boughton, press officer for the Friends, said: “We will be supporting the hospital’s plans and welcome the changes as it will mean better patient care.\n“A project we are involved with at the moment is showing patients around when they first arrive. This helps them to feel more at ease and takes some of the pressure away from the reception staff.”\n50 years ago\nMarch 23, 1973\nStamford’s cheap bus fares scheme for pensioners will go ahead – despite a snub from the town’s biggest operators.\nBartons, who operate the town service, opted out because the borough council refused to pay them a £75 handling charge to cover administrative costs.\nBut there were hopes on Wednesday that United Counties would change their mind and take part in the scheme after all.\nThe cheap fares project – every pensioner living in Stamford will get one hundred 2p tickets free – is due to start on April 1.\nSaid a council spokesman: “We will definitely go ahead with the scheme despite the attitude of Bartons.\n“It will mean it is not so effective, but will still provide a valuable service for people living in Stamford who want to visit people in outlying villages.”\nThe spokesman said he did not think there had been any further negotiations with Bartons. But talks had gone on with United Counties.\nA 73-year -old Stamford widow is having to boil kettles of water each time she wants a bath.\nA year ago Mrs Alice May Smith, of Clare Close, had a major operation that makes it vital that she has a bath every day.\nBut for some days ever since she reported a leak in her gas central heating appliance, she has had to carry kettles and pans full of boiling water to the bathroom each time she wants to bathe.\nGas Board workmen came to her home to repair the heating appliance, and whilst they were there, they removed a piece of piping that was vital to keep the boiler supplying hot water working.\nMrs Smith is not entirely without heat. She does have a small electric fire in her living room.\nShe said: “It may keep the living room warm, but it’s very cold when you go into the bathroom or kitchen with no heating.”\nFor clearing away the rubbish from Oakham Market Place after each market the Urban Council receive 20 per cent of the market tolls, but they say this does not cover the present cost of the service.\nThey suggested to the agents for the owner of the Market Place that 30 per cent of the tolls would be a more appropriate figure.\nReplying to this suggestion the agents stated that there was a possibility of market tolls being adjusted when the government freeze on prices ended.\nAs a result gross takings could increase and this could possibly meet the Council’s increased cost.\nThe Council on Wednesday agreed that subject to any adjustment of market tolls producing an equivalent of at least 30 per cent of the existing gross takings, to accept the agents’ suggestion.\nThe trees screening Barnack sewage depot look “scruffy and unkempt,”Coun J. C. S. Spry-Leverton (vice chairman) told Barnack Rural Council on Thursday.\n“They are miserable little things growing in long grass,” he said.\nCoun Spry-Leverton was commenting on a reply from Hunts and Peterborough County Council to a letter the rural council sent them telling them the present screen of trees was inadequate.\nThe reply told them that the present trees had been planted in 1971.\nIt agreed gaps needed to be filled, but told the rural council that the cost of mature trees was prohibitive.\n100 years ago\nMarch 23, 1923\nStamford and Rutland Infirmary – week ending March 20th, 1923 – Admissions and discharges of patients: In – admitted 9, discharged 9, in house 38; out-patients made in-patients 2, admitted 16, discharged 13, on books 46; medical attendant, Dr. Hawes; weekly visitor, Messrs. Martins’ Cultivator Co.; weekly board, the Marchioness of Exeter, Mrs. Crichton-Maitland, Mrs. Martin, Mr. H. Young, Dr. Greenwood, Dr. Hawes, Mr. Hy, Allen, Mr. Duddington, Mr. Phillips. Acknowledged with thanks: Miss D. Blackstone, toys; Dr. Greenwood, appliances.\nNovel Ball – A fancy dress ball is to be held in the Drill-hall on Friday evening, March 23rd, at which prizes amounting to £12 are offered for the best fancy dress which has been dyed with Twink dyes. The affair, which is under the auspices if the Stamford Town Football Supporters’ Club, promised to be most enjoyable.\nBourne\nChild Life Protection – the annual collection on behalf of the Royal Society for the Prevention of Cruelty to Children has just been completed and resulted in £19 11s. 7d., a small increase on last year’s proceeds, being forwarded to the Society, of which Miss A. Bell, J.P. is local hon. Secretary and Mr. H. C. Tointon treasurer. During the past year the society has intervened in several cases in the district.\nLocal History – On Monday evening Mr. J. T. Swift gave a further instalment of his series of interesting records of Bourne under the title of “Recollections of the Bourne Church Tower.” Rev. Glyn Morgan presided over a very good attendance.\nCouncil Criticised – Urban Authority’s “Lack of Foresight”?\nIt was reported to the Bourne Board of Guardians on Thursday that there were several applications for relief through unemployment, and in one instance it was stated that the parties had been without a fire and had lived for two or three days on carrots.\nAs some of the applicants were from Bourne the question was raised as to what was being done by the Urban Council to provide work for the unemployed.\nMr. Sneath pointed out that the Rural Council had spent £1000 on work for the unemployed, and it appeared to him that Bourne was shirking its responsibility.\nMr. Kelby considered that Bourne was not acting up to its agreement at a conference that was held between the Guardians, the Rural Council, and the Urban Council. The Urban Council had not done their duty and it appeared to him that unless something was very quickly done there would be more applications for relief.\nThe Chairman invited the members of the Urban Council to speak on the matter, and Rev. J. Carvath, the vice-chairman, said that the Council had found work for certain cases, but he emphasised the fact that getting local stone could not be proceeded with now owing to the quantity of water, and there was the added cause that they were at present without a surveyor. He denied that the Council were shirking their responsibility.\n150 years ago\nMarch 21, 1873\nWe are requested to state that Burghley House will be closed to the public from Saturday the 29th of March until Monday the 14th of April.\nA very beautiful stained-glass window, the work of Messrs Wailes, of Newcastle-upon-Tyne, has just been fixed in the western aisle of the Catholic church, Broad-street, Stamford. It represents the Holy Family in the two lancets, whilst in the rose window over is the figure of an angel holding a scroll, with the words “Ave gratia plenna, Dominus tecum”. The window is well worthy of the fame of Messrs. Wailes, and is pronounced by all who have seen it as exceedingly beautiful.\nWe understand that more than eighty shares in the Stamford Permanent Benefit Building Society have already been taken, and as the shares are of the nominal value of £25 each they will, if fully “paid up,” represent a capital of £2000. As announced at the public meeting last week, Mr. John Torkington has expressed his sympathy with the movement and his readiness to render assistance; and it is not unlikely that before long building land in various parts of the town will be in the market.\nIt is believed that Stamford Midlent fair, which takes place next week, will be more lively than of late years, most of the ground usually assigned for exhibitions having been already taken up. The principal show will be Mrs. Edmonds’ (late Wombwell’s) menagerie, whose husband succeeded to it on the death of the well-known proprietor.\nAt Stamford Midlent horse fair on Monday only few animals were shown: those sold commanded good prices.\nAccidents, though not of a serious nature, occurred in several parts of the town on Sunday night last, in consequence of the extreme darkness of the streets, the lamps not being lighted, and the moon, if it had risen, not being able to force its beams through the dense clouds which pervaded the atmosphere. The confusion was very great as the congregations were leaving the several churches and chapels after the evening service, and we are informed there were several escorts with lanterns. A remedy for inconvenience of this kind has been twice sought in the Sanitary Committee but complaints appear to have no effect. A return of the Improvement Commissioners, if only for a brief period, would be of some advantage to the borough. The Local Board, which was expected to do wonders, seems to get everything into a muddle, and that too at a very costly figure.\nOn Thursday evening the 13th Mr. Collins’ large room at Easton was crowded on the occasion of a tea and public meeting held by the Primitive Methodists. Mr. Parr, Mrs. Cobley, and Mr. Clarke gave short addresses, and the interest of the meeting was fully sustained by the excellent singing of the Ketton tonic-sol-fa choir.\nMr. Justice Denman before the conclusion of the assizes, ordered £5 to be given to Thomas Butlin, in recognition of his successful endeavour to rescue from drowning the woman Sarah Ann Harding, who was indicted for attempting to murder her two children by jumping into the Welland with them.\nAt the sale by auction of livestock and implements upon the premises of Messrs. Pick, at Thetford, on the 12th inst., there was a very numerous company, and the bidding throughout was spirited. The sale realised over £4200.\n200 years ago\nMarch 21, 1823\nWe perceive by advt. That Messrs. Marshall’s highly interesting Panorama of the Bombardment of Algiers continues exhibiting in our Assembly-room until Wednesday evening next, when it will positively\nclose.\nOn Monday night last, before nine o’clock, whilst Mr. Gillatt, hatter, in Red Lion Square, Stamford, left his shop for about ten minutes, some person entered and robbed it of fur caps and other articles to the amount of £7 and upwards, with which the thief got off undiscovered.\nAt the close of last week, everybody complained that what had heretofore been considered the “great fair” at Stamford in Mid-lent, has this year been spiritless even beyond what could have been expected: the travelling tradespeople declared they lost money by coming, and the resident shopkeepers found none!\nOn Monday evening the 10th instant, between seven and eight o’clock, the house of Mr. Francis Thorpe, of Heckington Fen Side, was broken open, and robbed of 8 one-pound notes, a cheque upon Sleaford Bank for £40, and a note of hand for £120. The thieves broke through the parlour wall, and took the property out of an oak chest, whilst Mr. Thorpe’s family were sitting in the adjoining room. They also stole some title deeds, which were found a few days after, in a ditch near his house, covered over with flags.\nOn Wednesday an inquest was taken at Pickworth, near Falkingham, before Geo. White, Gent. coroner, on the body of Charlotte Harvey, a child about 11 years of age, whose death was occasioned by a gun which her brother had put into the fire to straighten, exploding. The gun had been loaded by the brother a few days before; but he, forgetting the circumstance, imprudently placed the breech end of the barrel in the fire for the purpose above-mentioned, and laid the muzzle upon a chair on which his sister was sitting. In a few minutes the piece went off, and lodged its contents, with part of the clothes, in the child’s thigh. The femoral artery being wounded, she bled very profusely, and died the following morning. The jury pronounced the gun to be a deodand, which was accordingly forfeited to the lord of the manor, and a severe admonition was given by the coroner to both the father and the son, on the subject of keeping guns, for which they could have no lawful occasion.\nChild Dropping.\nOn Tuesday evening the 11th March instant, between the hours of eight and nine, a Male Infant, apparently about three days old, was exposed in a basket upon the door step of Mr. Bedford, druggist, in the bail of Lincoln, by some inhuman person or persons.\nThe child was wrapped in an infant’s blanket, two women’s petticoats (one nearly new), and had on a double-bordered cap, and a long white frock.",
  "word_count": 3214,
  "scraped_at": "2026-02-14T13:44:58.713916"
}