{
  "article_id": "b11c08ae788a",
  "url": "https://hoganstand.com/County/National/Article/Index/328255",
  "title": "Armagh Louise Kenny on her long road back from injury",
  "date": "20230624T121500Z",
  "domain": "hoganstand.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Aimee Mackin of Armagh, right, celebrates with team-mate Louise Kenny after their side's victory in the Lidl Ladies Football National League Division 2 Final. Photo by Sam Barnes/Sportsfile\nBy Daire Walsh\nIn the eight years that separated Armagh’s Lidl National Football League Division 2 final triumphs of 2015 and 2023, Louise Kenny has more often than not found herself as a spectator at inter-county matches instead of being an active participant.\nJust a number of weeks after securing the second-tier League title with the Orchard women in 2015 – alongside her clubmate Aimee Mackin – with a final victory over Donegal at Parnell Park, Kenny was ruled out for the remainder of the season with an anterior cruciate knee ligament injury.\nAlmost three years passed before she donned the Armagh colours again, but she damaged her ACL for a second time while on colleges duty with St Mary’s University College in the spring of 2018. Although she bounced back to play a starring role with Shane O’Neill's at local level, it wasn’t until the beginning of this year that she was back in the Orchard fold.\nHaving made her return in an opening round success against Cavan at Drumlane, Kenny went on to feature six more times in their Lidl NFL Division 2 campaign. This included the competition’s showpiece encounter with Laois at Croke Park on April 15, when Kenny was selected at left corner-back as Armagh ran out 4-9 to 2-10 winners.\n“I had been approached by the last few managers that have taken the teams, but I just didn’t think that I was in the right space. I know it has only been a few years since I did the knee, so I was just making sure that I was looking after myself first,” Kenny explains.\n“Because I’d be close friends with Aimee, and she was playing away and training away, I had it in my head that I probably would like to go back at some stage. It was just maybe the injury side of things that was holding me back.\n“I was doing well with the club and I just felt ‘sure why not give it another go?’ I’ll not be playing football for too much longer. Give it another go and see how it goes. I’m happy with how it’s going.”\nAfter that League victory a little over two months ago – which was also her first time to play at Croke Park in a competitive game – Kenny went on to make two appearances as a substitute against Cavan and Donegal in the TG4 Ulster Championship before earning another starting berth in last weekend’s win against Laois in Portlaoise in the All-Ireland series.\nShe is fully embracing her latest re-emergence onto the inter-county scene, but given how difficult it has been to get to this point, Kenny continues to apply a cautious approach with the help of Ruairi Grimes and Dermot Bellew – the strength and conditioning coach and physio to the Armagh team respectively.\n“Between the three of us, I just have to be honest and manage it as best as I possibly can. I did think ‘should I go back?’ With club, you probably don’t have the resources or the same professionalism as your county set-up. They are looking after me this year and making sure that everything is okay before I step onto the field.\n\"It definitely is a better set-up to ensure players are fit before going onto a pitch with injuries like myself. I just need to be careful with injuries and make sure I manage my load across the training week.\"\nIn Kenny’s time away from the panel, one very significant change happened within Armagh LGFA.\nHaving first started using it on a semi-regular basis in April 2021, last winter saw floodlights being installed at the county’s current training base of McKeever Park in Killean. This venue is a unique and historic one as it is the first of its kind in Ireland to be solely dedicated to Ladies Football.\nKenny, who is a teacher at St Joseph's High School in Crossmaglen, believes it can’t be underestimated how much of a difference this makes and praised Armagh LGFA chairperson Sinead Reel for the work she has put in to make all this possible.\n“She has put in a tremendous amount of work and we’re very grateful for her doing that. She’s pushing Ladies Football tremendously in Armagh at the minute and hopefully some counties will be able to follow in our footsteps. It’s great just to know where you’re training.\n“Back in 2014, when we were going to sessions, it was an hour beforehand, we didn’t even know where we were. Whether we were in Lurgan, South Armagh, Mid Armagh, we just didn’t know from day to day.\n“Having Killean is a great set-up and it’s something again that younger girls can use. The U14s, U16s, minor teams. Some of them have been on training before our sessions. It’s great to see them out using it as well. For any county to have their own set-up is massive.”\nDespite the disappointment of losing out to Donegal in last month’s Ulster SFC final, that 3-12 to 2-8 success against Laois seven days ago has put Armagh within sight of a spot in the knockout rounds of the Brendan Martin Cup for a seventh consecutive season.\nHowever, another tough group assignment awaits them in the form of Connacht champions Mayo at the Athletic Grounds tomorrow afternoon (throw-in 3.30pm) and that is all that Kenny and Armagh are focusing on at the moment.\n“Obviously they’re a Division 1 team and have been playing great football over the past number of years. It will be a big test for us, but we’re looking forward to it and everybody is going well. It will be a good game on Sunday,” Kenny added.\n“Obviously we had to dust ourselves off quite quickly after the Ulster final. Things just didn’t go our way, but we had a quick turnaround, two weeks. We had played Laois twice already this year, we know each other quite well.\n“They’re a great team Laois, they never give up as we saw on Saturday there as well. They played right until the final whistle. It was good to get back into winning ways, but we’ll take each game as it comes and we’ll look no further than Sunday.”\nTweet",
  "word_count": 1069,
  "scraped_at": "2026-02-14T12:45:31.606331"
}