{
  "article_id": "b12490e55deb",
  "url": "https://www.canberratimes.com.au/story/8374139/revealed-why-canberra-was-sidelined-during-the-world-cup/?cs=14280",
  "title": "Locker Room : Why ACT government brushed FIFA Women World Cup in Canberra | The Canberra Times",
  "date": "20231005T220000Z",
  "domain": "canberratimes.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Read on for the latest news from around the grounds in Canberra sport. We've got the latest on the ACT missing out on the FIFA Women's World Cup, and two impressive Brumbies on show in Japan.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe warning was there in black and white.\n\"It would be a lost opportunity\" if the ACT government turned its back on the chance to host FIFA Women's World Cup games. But Canberra's political powerbrokers weren't interested.\nEven when Football Australia [then known as the FFA] went back to them with confirmation FIFA would add more teams to make this the biggest World Cup yet, creating more opportunities to host matches, ACT Chief Minister Andrew Barr still wasn't interested.\nAll before a Matildas game became the nation's most-watched TV program of the year, before what FIFA president Gianni Infantino billed \"best and greatest and biggest Women's World Cup ever\" generated $A887 million and pumped more than $7 billion into the Australian economy.\nMORE SPORT:\nDocuments recently released after a freedom of information request reveal the ACT government's reasons for walking away from the chance to bring World Cup games to Canberra Stadium.\n\"The opportunity to be part of Australia's bid to host the 2023 FWWC has been considered against a series of key metrics - including economic impact, social and community benefit, city brand alignment, marketing potential, risk profile and synergy with ACT government objectives,\" Barr wrote in a letter stamped July 29, 2019.\n\"While it was acknowledged that the tournament presents a number of positive opportunities and potential benefits for prospective host cities, I can confirm that the ACT government is unfortunately not in a position to proceed to the next phase of the bid process.\"\nAustralian soccer supremos pushed to bring games to Canberra, with the FFA bid team vowing to work with Events ACT to \"explore every possibility to ensure Canberra is a host city\" before the deadline for commitment of support to FFA on October 4 2019.\n\"The FIFA Women's World Cup would once again bring Canberra to life and provide the ACT with the opportunity to capitalise on the benefits the tournament will provide,\" a letter to the ACT government said.\nTournament expansion and the potential for a joint Australia-New Zealand bid pushed the door open enough for the ACT government to ask how a joint bid model would impact participating jurisdictions - but on October 28 2019, the final nail went into the coffin. The ACT government would not budge.\nNow there are fears Canberra could be left with a sense of déjà vu amid concern the 2027 Rugby World Cup will bypass the home of Australia's most successful Super Rugby club.\nThe state of the ageing Canberra Stadium coupled with the government's refusal to enter a bidding war for games played between minnow nations - despite the fact fans would travel from abroad to be in the stands - means Canberra fans could be left in the cold again.\nCanberra is out of contention for any Wallabies games during the 2027 World Cup and Barr won't budge on a financial commitment to Rugby Australia for a four-game package which could see the capital priced out of the market.\nBarr has made clear his desire to ensure the cash-strapped ACT Brumbies can survive a period of financial turmoil, putting World Cup games on the backburner. Rugby fans can only dream the pockets are deep enough to have both.\nUNITED'S PRECARIOUS POSITION\nIvan Slavich's decision to walk out on Capital Football after finding himself at odds with the board and clubs is set to leave Canberra United in a precarious position.\nThe Capital Football board met on Thursday to map out the next steps as the association searches for its fourth chief executive in less than two years at a critical juncture for the code.\nSlavich quit after he publicly criticised the board for axing the Canberra United Academy - just as the Australian Professional Leagues scrambles to find investors for an A-League Men's team in the city.\nCapital Football holds the licence for Canberra's A-League Women's team - but the ideal result is for the side to fall under one banner when, or if, a deal to build a men's team is struck.\nGiven the APL wants to move on its expansion plans - having already pushed back its deadline - Capital Football could be without a chief executive when talks ramp up.\nAs a result, Canberra United's women's side will be wondering who their voice is.\nThe clock is ticking on the ALM's move to Canberra, while Capital Football is already under pressure to lock in plans to build a high performance base at Throsby amid fears the costs could blowout to close to $50 million after years of waiting.\nWHAT'S MORE IMPRESSIVE?\nSapporo city mayor Katsuhiro Akimoto is already a head shorter than Harry Vella - so imagine how he felt when he got a look at the Wesley Snipes on the big unit.\nThe ACT Brumbies prop didn't spend too much time on the track this year after recovering from an anterior cruciate ligament tear, but he clearly wasn't skipping the gym.\nThe young loosehead is highly regarded at Brumbies headquarters, and the two-time former Junior Wallabies squad member could close in on a Super Rugby debut this year.\nBut perhaps the only thing Akimoto found more impressive than Vella's size was the handlebars on the face of winger Ben O'Donnell.\nVella and O'Donnell joined Brumbies coach Stephen Larkham and his assistant Ben Mowen at the Sapporo City Hall this week to mark the start of the club's two-game tour of Japan.\nThey were met by Akimoto and a handful of government and business delegates, presenting a boomerang and a signed Brumbies jersey upon arrival.\nThe Brumbies will play two matches in Japan - first against Tokyo Sungoliath at the Sapporo Dome on October 7, and then against Black Rams Tokyo at Ricoh Fields on October 14.\nLarkham has adopted a club rugby-style training schedule for the trip in Japan with the squad staying 45 minutes outside Sapporo.\nThe Brumbies are training on Tuesdays and Thursdays - but that's about where the similarities to club football end given they board a bus at 7am and return at 5pm.\n\"We've been crying out in Australia to play more high-level games,\" Larkham said. \"There's certainly some chat of a third tier rugby competition starting up in the next two years, which these boys need.\n\"It's a good opportunity for these guys to test themselves, to see where they're at, and find a connection.\"\nROGIC TO COME HOME?\nTom Rogic has called time on his career, but could there be a pulse in the plans for a Canberra homecoming?\nThe notoriously private Rogic revealed his family's fertility battle and the impending arrival of twins as the reason for his sudden retirement this week.\nBut could he come out of retirement if Canberra can find the investors to secure a place in the A-League Men's competition?\nCanberra's A-League bid insiders were at one stage genuinely hopeful of luring the Socceroo home as a marquee signing amid plans to launch its men's team for the 2024-25 season.\nIt seems a tall order now - but perhaps not quite as difficult as locking in the financial backers to ensure the A-League can finally move into Canberra after years of false dawns.\nThe Tuggeranong United junior burst on to the soccer stage via a Nike Academy, which led to him signing a deal in the A-League with the Central Coast Mariners. Rogic played 53 games for the Socceroos and has spent the past 10 years playing abroad with Celtic and West Bromwich Albion.\nTIGERS MOURN GREAT\nYou might have heard him on the Queanbeyan airwaves or even seen his name on the wall of the Tigers Club.\nNow the Queanbeyan Tigers are remembering Mark Thompson as one of the club's favourite sons after the beloved administrator lost his battle with cancer on Monday evening.\nThomson captained the Tigers' under 19 premiership team in 1984 and would go on to play 37 first grade games before injury forced him into an early retirement - but he wasn't going anywhere.\nHe would eventually become a Tigers football club life member in 2000, and a licenced club life member six years later, having served as the football club's secretary from 1992 to 2014.\nMore recently he spent time alongside friend and ex-teammate Peter Newham on the radio during Tigers games on QBN FM 96.7.\nHe leaves behind wife Linda, and children Riley and Andrea - though his legacy remains with his name on the Tigers' wall of fame.\nHave your say\n- Have you heard something and want to get in touch?\n- caden.helmers@canberratimes.com.au\nWe've made it a whole lot easier for you to have your say. Our new comment platform requires only one log-in to access articles and to join the discussion on The Canberra Times website. Find out how to register so you can enjoy civil, friendly and engaging discussions. See our moderation policy here.\nOur journalists work hard to provide local, up-to-date news to the community. This is how you can continue to access our trusted content:\n- Bookmark canberratimes.com.au\n- Download our app\n- Make sure you are signed up for our breaking and regular headlines newsletters\n- Follow us on Twitter\n- Follow us on Instagram",
  "word_count": 1576,
  "scraped_at": "2026-02-14T12:17:10.177936"
}