{
  "article_id": "b137701b40f6",
  "url": "https://www.wrestlinginc.com/2094496/tna-impact-february-5-2026-3-things-hated-loved/",
  "title": "TNA Impact - 2 / 5 / 2026 : 3 Things We Hated & 3 Things We Loved",
  "date": "20260206T053000Z",
  "domain": "wrestlinginc.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "TNA Impact - 2/5/2026: 3 Things We Hated & 3 Things We Loved\nIt's week four of \"TNA Impact\" on AMC, and if we're being honest, what momentum the show had has slowed to a crawl. Apart from a few bright spots here and there, this was a dour affair, full of squash matches and awkward promo segments.\nThe matches that featured more even competition weren't half-bad, however. We saw the return of a wrestler previously feared to be forced into early retirement, and in the same match, Lei Ying Lee continued to prove why she's the right choice to hold the TNA Knockouts World Championship for the time being.\nAs always, we've found a few things to love and hate throughout tonight's \"Impact.\" If you're looking to learn every single thing that happened on the show, our results page is the place for you. Otherwise, continue reading to learn what we thought about the latest installment.\nHated - Too many squash matches\nWhile I totally understand the need for TNA to establish its roster, tonight's \"Impact\" had at least one too many one-sided matches. First came Trey Miguel taking on Adam Brooks, and you could make an argument that this one was a notch above a squash match. Nonetheless, it was short, with a strong emphasis on getting the audience familiar with Miguel.\nThe next match saw The Righteous take on a pair of lovable jobbers referred to as TW3 and Two Scoops. I'd honestly love to see these guys brought back, just from the combination of their names and general vibe. Vincent and Dutch weren't amused, though, and made short work of the tag team. This was followed up by a fun mixed tag match, only for TNA to present another squash, this time featuring Tessa Blanchard, who I guess the promotion still plans to push.\nPersonally, I'm looking to see no more than one \"enhancement talent\" match per show. We're here to see wrestling, so let's watch some actual wrestling. This show had two solid-to-good matches, and it'd be great to see more of an emphasis on bouts like that going forward.\nWritten by Nick Miller\nLoved: Mixed tag team chaos\nI'll be honest: there wasn't much on this episode of \"Thursday Night iMPACT\" that really stood out to me or much on this card that I was interested in. However, the one thing that stood out above everything else for me was the Mixed Tag Team Match between Jada Stone and Elijah, and Tasha Steelz and Mustafa Ali.\nStone is arguably the least well known of the four competitors who took part in tonight's match, and likely hasn't been exposed to many of the newer TNA viewers who came in after the AMC debut (myself included). For that reason, it was really awesome to see her get so much time in the ring during the match to show off what she can do to the fanbase as she continues to make a name for herself at the young age of 23. Not only was she given plenty of time to wrestle against Steelz, but she was also given plenty of time to wrestle Ali as well.\nWhile intergender wrestling might not be everyone's cup of tea, I personally think that it actually worked really well within the context of this match as Ali really helped to put Stone over and it allowed to have the match end in a little bit of a different fashion with Ali landing the Tombstone on Stone while the referee was distracted.\nWritten by Olivia Quinlan\nHated: The Righteous deserve a better showcase than that\nThe color white symbolizes innocence, but when it comes to The Righteous (Dutch and Vincent), their match was a clean victory squash. Sadly, tonight's showcase didn't live up to the eerie façade they've carried since their Ring of Honor days.\nWhat makes the Righteous such a compelling tag team is the fact that they preach the word of peace, yet their actions speak otherwise. They are excellent at playing mind games with their opponents and orchestrating them in the ring; however, that art was lost in tonight's squash match against TW3 and Tommy Two Scoops (why only two scoops, Tommy?). Most squash matches display the importance of that wrestler, but tonight's didn't do it for the Righteous.\nAlthough this match didn't do much, what Vincent said after piqued my interest. He and Dutch would like to stand next to the current TNA World Tag Team Champions The Hardys (Matt and Jeff) rather than across from them? See, this is where the mind games get interesting. They already lost to the tag champs at Genesis last month in their debut match, but do we seriously believe they'd rather be allies than enemies? Heck no!\nYes, tonight was the second-ever match they've had in their new tenure with TNA, but can we see The Righteous stand toe-to-toe to other tag teams like The System or even The Nemeth brothers. If fans are new to their work and haven't followed their previous journey in ROH or AEW, now would be the time to showcase why their presence literally carried a cult-like following. I'll be snapping my fingers in the corner until bigger matches come their way.\nWritten by Brie Coder\nLoved: Ash By Elegance back in action\nLast September, the wrestling world thought that Ash By Elegance's in-ring career was over for good. Tonight, she officially kicked off her comeback tour, and I have to say, I'm happy to see it.\nAt the time of her retirement announcement, Ash's career seemed to be at an all-time high. She led a dominant stable with promising talents. She established herself as a top heel in TNA. And she reigned as the TNA Knockouts Champion. Unfortunately, an undisclosed issue then forced her to step away from in-ring competition and vacate the Knockouts Championship.\nIn her return tonight, Ash reunited with her mentees M and Heather By Elegance to take on the current Knockouts Champion Lei Ying Lee, Xia Brookside, and Indi Hartwell in a six-woman tag bout. The latter trio emerged victorious when Brookside pinned Heather. Still, Ash managed to impress in the ring, which to me, is a good sign of things for her, both physically and potentially in her hunt to reclaim the KO Title.\nWith a reign of only 33 days, we never got to see the full Ash By Elegance world championship experience. Maybe after Lee possibly conquers Arianna Grace at TNA No Surrender, we can get back on track to it, though.\nWritten by Ella Jay\nHated: Mara Sade and Ryan Nemeth's weird feud\nI've little to no idea as to why Mara Sade and Ryan Nemeth were feuding to begin with and this week did nothing to really remedy that. Sade got beat by Nemeth for some bizarre reason at Genesis, albeit by cheating and taking cheap shots, and since he keeps \"getting the better of her\" in the ring they decided to have a gauntlet of other sporting activities in a vignette.\nFirst, they were on a football field and Sade launched the pigskin into the end zone to be caught by... herself? Then Nemeth went to match the feat, but pulled his arm in doing so. The next game saw them play darts, with Nemeth hitting the bullseye. But then Sade threw her dart in his rear-end, so I guess she was the winner there as well. Lastly, it was a game of H.O.R.S.E, shooting hoops.\nSade won the game, only for Nemeth to argue that she had to get a trickshot. She superkicked him, and as he fell over he threw the ball into the hoop and that was her trickshot. And I am so beyond brain dead having watched and written that out.\nI don't really understand what was trying to be achieved here. And I don't understand who is going to benefit from this. Sade has lost to Nemeth, which does no favors for her. Nemeth had to cheat to beat Sade, which does no favors for him. And this segment was literal garbage that served to do nothing for either character except pigeonhole them into parodies.\nGranted, Nemeth was already heading there and appears to be content working the bottom-of-the-barrel comedy style. But I would have thought the company might have better things in mind for Sade, at least something that sees her benefit the Knockouts division.\nWritten by Max Everett\nLoved - There is potential here\nLook, it's easy to pile on TNA, and I'm certainly not going to pretend that \"Impact\" has floored me in the first month on AMC. However, I also wouldn't go as far as saying this show or promotion is a lost cause. There's a lot of talent on the roster, even if they aren't always utilized to the best of their abilities.\nTake the mixed tag match, for instance. Mustafa Ali is someone who clearly understands the magnitude of the opportunity they're working with being on AMC, and Jada Stone made her in-ring debut on the network with an impressive showing here as well, not to mention Tasha Steelz and (somewhat begrudgingly) Elijah.\nA great deal of TNA's potential lies in the Knockouts division. Currently led by Léi Yǐng Lee as the Knockouts World Champion, TNA's roster of women is loaded with talent, with former WWE NXT star Xia Brookside also deserving a shout-out for her performance on tonight's show.\nHopefully, TNA's creative department and production can shake some of these early missteps and put together a show that's worth looking forward to each week. They're not quite there yet, but we'll see where things go from here.\nWritten by Nick Miller",
  "word_count": 1619,
  "scraped_at": "2026-02-14T12:38:15.846262"
}