{
  "article_id": "b155f5c0bb3f",
  "url": "https://www.si.com/college/arizonastate/sun-devils-wbb-players-who-will-define-rest-2025-26-season",
  "title": "3 ASU WBB Players Who Will Define Rest of 2025 - 26 Season",
  "date": "20260115T174500Z",
  "domain": "si.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "3 ASU WBB Players Who Will Define Rest of 2025-26 Season\nIn this story:\nTEMPE -- The Arizona State women's basketball program had been stuck in an era of dormancy for much of the 2020's decade, as they had only won 53 total games across the first half of said decade.\nMolly Miller was hired as head coach in March of 2025 in hopes that the proven winner would shift the culture back into the mold of what was seen under Charli Turner Thorne.\nNow, the Sun Devils sit at 16-2 going into a major battle with the Kansas Jayhawks on Saturday afternoon - while the program appears poised to reach their first NCAA tournament since 2018-19, they have potential to reach even higher ambitions.\nArizona State on SI names the three most crucial players in the quest of reaching lofty goals over the remainder of the season below.\nLast-Tear Poa\nPoa is a senior and three-season contributor at LSU, deciding to spend her final season of collegiate eligibility playing for Miller in Tempe.\nThere's little doubt that Poa is incredibly talented, but a minor hand surgery early in the season is possibly playing a role in not having a \"takeover\" game to this point.\nWatch out for the Australia native to have signature performances moving forward, including as a playmaker - as the point guard leads the team with 4.1 assists per contest.\nMcKinna Brackens\nThere's a very real chance that Brackens emerges as the face of Arizona State basketball next season - the junior and UNLV transfer might be taking over as that in the middle of this season.\nThe Texas native has scored in double figures in 15 of 17 games played in this season, while recording double-doubles in six of those contests.\nBeyond this, Brackens' efficiency from beyond the arc (on low volume albiet), and ability to get to the free throw line at a high level will continue to be instrumental to the team during the stretch run.\nMarley Washenitz\nWashenitz is certainly an ideal fit in Miller's hard-nosed, chaos-causing defensive system. The senior guard is averaging 2.1 steals per game, playing an indispensable role in the disruption that the Sun Devils present to opponents.\nWashenitz has improved upon last season's field goal percentage, but the three-point efficiency has taken a dip in recent games. Arizona State needs a jolt from behind the arc from the former Pittsburgh standout to remain in the upper-tier of the Big 12 come conference tournament time.\nRead more on why the Arizona State men's basketball team will exceed expectations in the 2025-26 season here, and on why the bright future of the football program isn’t dimmed by the loss to Arizona here.\nPlease let us know your thoughts when you like our Facebook page when you click right here.\nPlease follow us on X when you click right here, as well as @khicks_21 for nonstop Arizona State coverage!\nKevin Hicks is an Arizona State alumni and now serves as the Arizona State Beat Writer On SI.",
  "word_count": 507,
  "scraped_at": "2026-02-14T13:23:34.168976"
}