{
  "article_id": "b15c22fad578",
  "url": "https://www.odt.co.nz/regions/queenstown/whats-todd-barclay-doing-saudi-arabia",
  "title": "What Todd Barclay doing in Saudi Arabia ? ",
  "date": "20240914T184500Z",
  "domain": "odt.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "You could probably think up a few reasons not to visit Saudi Arabia.\nApart from a total lack of bars — gulp — the capital, Riyadh, looks very much like a sprawling city in the middle of a desert, which of course it is.\nThe city — population 7million-plus — also appears to boast very few green spaces, and its arterial routes are, like Queenstown’s Frankton Rd, regularly clogged up with vehicles.\nThe country’s not renowned as a liberal democracy — it’s in fact a strict Muslim kingdom — and it’s hard to identify the local women as they’re mostly hidden in traditional black garb where only their eyes are showing, though the men, too, are mostly dressed in full-length white cloaks.\nAnd, note to self, maybe don’t try to visit in August when the temperature’s in the furnace-like 40s.\nCompared to the glitzy nearby tourist destination of Dubai, you could possibly call Riyadh a bit boring, aside from the restored Unesco world heritage site of Diriyah.\nA director focusing mainly in the energy and natural resources sector, he says he didn’t really know what to expect, \"but all of the impressions have been exceeded on all counts\".\n\"It’s a really safe place, everybody’s really nice, and they’re really interested, particularly locals, as to kind of why you’re here and how you’re finding it, and they’ll go out of their way to accommodate you and make sure you’re having a good experience.\n\"You’re coming to a place where English isn’t the first language, where the cultural diversity is so much different to what we’re used to.\n\"I think that experience is amazing, and I think going into something like that with your eyes wide open, and being adaptable and flexible and actually wanting to embrace it, is definitely the way to do it.\"\nIn addition to the distinctive-sounding Islamic calls to prayer ringing through the city every day, Barclay notes how national holidays fit around religious celebrations like Ramadan and Eid.\nAnd with Friday being a holy day, he says the working week’s from Sunday to Thursday.\nWhat excites him most is seeing the pace of growth in Saudi, which Crown Prince and Prime Minister Mohammed bin Salman kicked off in 2016 with Vision 2030 and which could explain why thousands of cranes are dotted around Riyadh.\nVision 2030’s brought about 14 ‘giga-projects’ aimed at diversifying Saudi’s economy from its reliance on oil and gas.\nIn Riyadh this includes building the world’s largest urban park with about 1m trees.\nThe city’s also hosting the 2030 World Expo, and as part of the country’s huge push to become an international sporting destination it’s bidding to host the 2034 Football World Cup — eight of the 15 stadiums would be in Riyadh.\n\"It’s similar to what UAE has done over the last sort of 10-15 years, but Saudi is just at the start of the journey so it’s quite an interesting time to be here,\" Barclay says.\nHe adds Saudi’s second national airline will also be based in Riyadh.\n\"There’s always been expats here, but we’ve been told that’s just increased with these big projects attracting more people from overseas.\"\nAs for the heat, \"we’ve spent a bit of time in UAE and other places where it’s very humid, here it’s a much drier heat so it doesn’t feel kind of claustrophobic as it does in more humid places\".\n\"And there’s aircon everywhere, obviously — there’s a bit of a joke in our office that none of the buildings seem to have struck the right balance around what’s the optimal aircon temperature, so we start opening the window to let warm air in.\"\nBarclay also notes people tend to dine out later than in Western countries — \"everything just happens late here, I think mainly because of the temperature\".",
  "word_count": 637,
  "scraped_at": "2026-02-14T12:33:31.208643"
}