{
  "article_id": "b16396ded110",
  "url": "https://abc11.com/post/courage-gk-casey-murphy-reflects-cracking-olympic-roster/15006280/",
  "title": "NC Courage GK Casey Murphy reflects on cracking Olympic roster , soccer rise in the Triangle",
  "date": "20240628T001500Z",
  "domain": "abc11.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Thursday, June 27, 2024\nCARY, N.C. (WTVD) -- A Triangle soccer star is shipping off to Paris to represent her country in the upcoming Olympic Games.\nCasey Murphy, goalie for the NWSL's North Carolina Courage, was one of just 18 players selected this week for the Olympic roster.\nMurphy is the club's all-time leader in wins with 30 and has been in goal for the Courage since 2021.\n\"I was nervous, and obviously once I got the call I made it, I was overwhelmed with joy and happiness,\" she said.\nMurphy told ABC11 it wasn't that long ago that she was a youth soccer player, reminiscing about her own trip to watch the US Women's National Team at the 2012 Olympics in London.\n\"We had our faces painted, we were all teenagers, and we had signs. So it's kind of crazy to think that now I'll be on the field, and there will be all these fans in the stadium rooting for us,\" she said.\nCourage head coach Sean Nahas has seen the game grow exponentially in his more than 20 years in the Triangle. He says the spotlight of major events like the Olympics and World Cup can amplify interest and energy around the spot -- and that the youth soccer foundation here is strong.\n\"The foundation is there, there's zero question about it. This is the hub of football, women's football. For me, in the country, this is the hub of women's football,\" Nahas said.\nBy the numbers, that foundation is getting stronger by the day. Taylor Pilkington runs Raleigh-based soccer training facility Soccer Genome, working with the next generation of players.\n\"We'll start the day with little kids just beginning soccer, and finish the night with collegiate players playing at UNC Chapel Hill, playing at NC State, Duke,\" Pilkington said.\nHe said their facility -- which provides young soccer players with supplemental training -- has never been busier. The ascent of the area's professional soccer teams is a big part of that.\n\"Kids can have a real tangible experience of, you can come train, play, then see an actual pro game right down the road, and feel from a club branding standpoint if they play with NCFC, they have an immediate emotional connection with the senior team,\" he said.\nThe US Women's National Team will begin their quest for an Olympic gold medal on July 25th at 3 p.m. in Nice, France.\nCopyright © 2026 WTVD-TV. All Rights Reserved.",
  "word_count": 412,
  "scraped_at": "2026-02-14T12:32:16.895099"
}