{
  "article_id": "b1b2d6903a63",
  "url": "https://www.palatinate.org.uk/arsenal-womens-revival-under-renee-slegers-can-they-keep-the-pressure-on-chelsea-and-manchester-city/",
  "title": "Arsenal women revival under Renee Slegers : can they keep the pressure on Chelsea and Manchester City ? – Palatinate",
  "date": "20241121T131500Z",
  "domain": "palatinate.org.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Arsenal women’s revival under Renee Slegers: can they keep the pressure on Chelsea and Manchester City?\nBy Isobel Gilligan\nWhen people hear ‘Arsenal Women,’ they think of a table-topping, trophy-winning side fuelled by endless fan support and feared by other clubs. Despite the ever-growing fanbase and expectations of silverware, this season has been anything but straightforward. Jonas Eidevall’s tenure came under immense scrutiny, with fans expressing frustration through graffiti outside the Emirates Stadium reading ‘JONAS OUT” and brandishing fake P45 signs at games. The players looked despondent and unmotivated after a string of bad results and fans had been calling for Eidevall’s exit since the end of the 23/24 season, exacerbated by the club’s decision not to extend Arsenal legend and all-time WSL top goal scorer Vivianne Miedema’s contract.\nEidevall eventually stepped down, leaving the club at a low point in October after losses to Chelsea and Bayern Munich. To fill his shoes, Arsenal appointed Renee Slegers. The 35-year-old ex-Dutch-national team player previously worked under Eidevall at Rosengard B before succeeding him on his departure. She led the Swedish side to successive Damallsvenskan titles before departing the club and reuniting with Eidevall as an assistant coach at Arsenal. Now the interim manager, Slegers, already familiar with the team has made a good impression.\nArsenal forward Beth Mead captured the team’s mood perfectly during a recent press conference: “I think she has taken to it like a duck to water. It has been an easy transition. We know what she gives us – the confidence she gives us; we’re playing good football”. Mead went on to praise Slegers, saying: “As individuals and as a collective, we’re really happy with what Renee is doing for us right now. She deserves the credit”.\nIt is hard to argue with that assessment. Under Slegers, The Gunners have looked rejuvenated. The players seem more animated, celebrating goals with passion and showing a renewed drive to score. They appear invested in every match, coming together in team huddles with a sense of unity that was missing earlier in the season. The morale is visibly higher, and it’s translating to results on the pitch.\nSince Slegers took charge, Arsenal have beaten Valerenga 4-1 and Juventus 4-0 in the Champions League, secured a 2-0 victory over West Ham in the Women’s Super League, drawn with a tough Manchester United side and demolished Brighton 5-0 before trouncing arch rivals Tottenham Hotspur 3-0 away from home. This run has given fans hope, but is it enough to dream of catching up with current frontrunners, Manchester City and Chelsea?\nCurrently sitting fourth in the WSL table with 15 points, Arsenal are four points adrift of second place Manchester City, who have been relentless this season, aiming for WSL glory after narrowly missing out on goal difference last year. City had been unbeaten prior to last weekend’s top of the table clash against Chelsea, and they boast the league’s top goal scorer, Bunny Shaw, and the top assist maker, Lauren Hemp, making them a formidable challenge for any side. Chelsea, on the other hand, have adapted seamlessly under new manager Sonia Bompastor. Despite fans fearing a decline after the departure of long-term leader Emma Hayes, the Blues have won every WSL match this season and sit top with 21 points and a game in hand on all their competitors. With a strong bench and dangerous players in all areas, Chelsea are determined to remain at the top level.\nThis sets a daunting task for Arsenal. To have any chance at the title, Arsenal can’t afford to drop any more points, and they must hope for their rivals to falter. However, The Gunners’ earlier draws against Everton and Manchester United and the 2-1 defeat against Chelsea may prove too costly. Arsenal seem to have entered a pattern of bad results against mid- to low-table teams, which has impaired their standings in the last few seasons, something they’ll hope to avoid going forward.\nBut are Arsenal’s title hopes already slipping away, even before the halfway point of the season? Some fans believe the focus may need to shift to securing a third-place finish to guarantee Champions League football for next year. Achieving this would mark a third consecutive year in the bronze medal spot, a result that would undoubtedly feel disappointing for Gooners and Gunners alike. To salvage the season and maintain their status as a top-tier club, Arsenal will need to set their sights on the FA and League Cups where strong performances and potential silverware could provide a much-needed boost and sense of accomplishment.\nAdding to the intrigue, Arsenal are on the hunt for a new permanent manager. This prospect excites fans who hope to see a proven winner take the reins, but many are also advocating for Slegers to stay on after her success so far. The club has confirmed that Slegers will remain in charge until the next international window, leaving questions about what direction they will take. Will they bring in a high-profile name or will Slegers’ successful start convince the board to give her the chance?\nAs the season unfolds, one thing is clear: Arsenal must continue their resurgence under Slegers if they want to keep their European hopes alive and give fans something to cheer about. The fight is far from over, but the margin for error has become razor-thin.\nImage: Katie Chan via Wikimedia Commons",
  "word_count": 899,
  "scraped_at": "2026-02-14T12:23:04.439469"
}