{
  "article_id": "b1e4694eb438",
  "url": "https://www.ign.com/articles/nhl-26-review",
  "title": "NHL 26 Review - IGN",
  "date": "20250913T003000Z",
  "domain": "ign.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "It might not have the audience of football, baseball, or soccer, but to its proud fans there’s something truly special about hockey. It’s the cold air of the arena, the weight of the puck against your stick, and the feel as your skate glides across the surface of the ice. To their credit, the developers at EA Vancouver seem to get all of that, and it’s led them to create an enjoyable NHL simulation that has earned a dedicated audience. That dedication, however, has increasingly been tested in recent years as the series has failed to truly move forward in any meaningful way. EA Sports NHL 26 continues this dynamic with a game that nails most of the elements that make hockey special, but it never feels like the kind of significant jump over what’s come before that might make buying yet another version exciting rather than obligatory.\nIf you’ve played a hockey game from EA at any point over the last few years, you have a good idea of what to expect from NHL 26. The lynchpin of the series is Franchise mode, which allows you to take the team of your choosing on a season-long quest to hoist the Stanley Cup. It’s basically the default mode, showcasing what the series is best known for and it still does that all pretty well. Individual games are fast, the controls are intuitive, and EA Vancouver has spent years refining a formula that mostly works. Granted, there are very few other hockey games available right now, and those that do exist don’t have the official NHL players or teams; that lack of competition might be what leads the developers to play things so safe and leave so much unchanged year to year. To be fair, it’s hard to fault them too much for not fixing what isn’t broken.\nHowever, this situation has created an unfortunate trend for the series that’s made each year’s version feel like baby steps, and NHL 26 continues to focus more on smaller tweaks than on substantial changes. As a result, it’s easy to miss adjustments made beyond mirroring the big roster changes we’ve seen over the offseason, such as Mitch Marner being on the Golden Knights after leaving the Leafs, and Matt Dumba appearing on the Penguins following his Dallas departure. As of this writing, EA Vancouver seems to have done a pretty good job making sure everything is up to date, including representing the Utah Mammoth with their new name, uniforms, and arena (following a season under the temporary “Utah Hockey Club” label). Lastly, PWHL has been updated to add the women’s league’s two new teams from the 2025-2026 season, though that mode feels completely unchanged beyond that.\nThough Franchise mode seems to be the most popular single-player mode in EA’s yearly NHL games, I really enjoy the customization options and the general approach to the sport found in the narrowed focus of Be a Pro. As someone that grew up playing hockey, there’s something that feels really authentic about focusing on controlling an individual player. There’s a greater need to consider line changes, playing in position, and setting up CPU-controlled characters.\nSo I was pleased to find that some of the bigger changes this year can be found here, but I’ve found that they aren’t all positive. Some of the biggest improvements come from cutting out what hasn’t worked: NHL 26 has finally dropped the often-mocked and frequently repeated “pricey pond hockey” opening scene that appeared across multiple games. You’ll no longer see the same repeated cinematic sequence with an agent talking about how you’re so passionate about hockey that you’re playing pond pick-up with a bunch of kids. Instead, you’re dropped right into the player maker. And mercifully, EA has also scaled back on the frequent coach meetings from past Be a Pro modes, but the catch is that the replacement might be even more monotonous: press conferences.\nThe idea of taking part in press conferences is actually kind of neat, and the initial questions help to shape your on-ice personality. The hockey press will ask questions like your approach to free agency, and choosing one option will improve your likeability with teammates, while the other helps your brand. However, the execution gets dull fast once you’ve taken part in several in a row. That might be a little too real: I’ve attended real-life NHL press conferences, and the questions from sports journalists really can be as groan-inducing as they are here sometimes. How do I feel about not winning the division? How do you think?\nOn top of that, the impact from press conference responses on player stats often feels unfair. At one press conference, I was asked about modeling my career around a specific player, with multiple options to choose from. I apparently picked the wrong one, and it immediately led to a decrease in my brand stat. Even worse, NHL 26 doesn’t always make it clear what answers will have a negative impact on your brand or the feelings of management, so a seemingly innocuous response can have an unforeseeable consequence.\nA smart change, though, has made NHL’s most intimidating mode more approachable for me. Putting together a team built out of NHL greats in Hockey Ultimate Team (HUT) takes a lot of time and effort. It can also take some real currency, though you are awarded with daily freebies that can help shape a decent team without paying extra. I still don’t necessarily want to take my team up against the passionate players who dominate online with a combination of skill and large wallets, though; sometimes you want to play without the pressure of competing with real people. So it’s a welcome change that for NHL 26, EA has replaced last year’s HUT Squad Battles with a new offline Cup Chase mode that offers a chance to build up a team and try them out in a full single-player campaign with multiple difficulty levels. I was grateful to have the chance to jump into games using my custom team without having to worry about getting schooled by people fiercely protecting their online rankings. And anybody that wants to do so can take that team online just as they normally would in HUT.\nOnline or off, though, NHL is feeling increasingly behind the annual sports game pack graphically. That’s despite the fact that last year, NHL 25 marked the first game in the series to abandon PS4 and Xbox One and shift focus to current platforms. But NHL 26 still doesn’t feel like it’s really pushing PS5 and Xbox Series X|S to the fullest. The ice itself pops on the screen nicely, and there are lots of impressive details, including wear to the surface as a game progresses, but just about everywhere else is a letdown. The character models are rough, with players, coaches, and fans often looking pretty ugly relative to what we’ve seen in other recent sports games. There are also some weird choices and oversights that are holdovers from past games, like team logos getting cut off on specific screens. Crowd reactions also feel stuck in the past, with awkward celebrations that would be right at home on PS3, Xbox 360, and Wii.\nThankfully, I found the audio much more enjoyable. The menus have some great new songs this year, including tracks from groups like Wet Leg and The Hives. I never would have thought of “Catch These Fists” as a hockey song, but it fits undeniably well. In the games themselves, EA Vancouver continues to replicate the authentic sounds of each rink, with team-specific cheers and organ sounds. The commentary is also pretty faithful to the current NHL viewing experience; it feels like watching a nationally televised game, offering the same chatty play-by-play that you’d expect to hear on TNT. That said, I was grateful for the option to toggle it off when it got repetitive.\nPossibly the worst audio in NHL 26 belongs to Macklin Celebrini, though. The San Jose Sharks forward can be heard offering career advice in Be a Pro mode, and it’s clear not all hockey players are cut out for acting.",
  "word_count": 1360,
  "scraped_at": "2026-02-14T12:20:04.881605"
}