{
  "article_id": "b1e8cba6f778",
  "url": "https://www.winnipegfreepress.com/uncategorized/2025/08/18/texas-techs-joey-mcguire-feels-the-pressure-after-cash-driven-roster-overhaul",
  "title": "Texas Tech Joey McGuire feels the pressure after cash - driven roster overhaul – Winnipeg Free Press",
  "date": "20250818T104500Z",
  "domain": "winnipegfreepress.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Texas Tech’s Joey McGuire feels the pressure after cash-driven roster overhaul\nAdvertisement\nJoey McGuire is the first Texas Tech coach since the late Mike Leach two-plus decades ago to get through his first three seasons without a losing record.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nJoey McGuire is the first Texas Tech coach since the late Mike Leach two-plus decades ago to get through his first three seasons without a losing record.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nJoey McGuire is the first Texas Tech coach since the late Mike Leach two-plus decades ago to get through his first three seasons without a losing record.\nThe former Texas high school coach might need more than another winning season to see a fifth year with the Red Raiders, whose No. 23 ranking is their first in The Associated Press preseason poll since 2008.\nExpectations are as high as ever on the South Plains of Lubbock, Texas, with apparently one of the most expensive rosters in college football joining a program without a Big 12 championship in the conference’s first 29 seasons.\n“I know there’s pressure, man,” McGuire said. “I would rather be here than be at a place where you’re hoping like crazy everything goes right just to maybe win four or five games. My job that I’m going to really try to do is keep the pressure on me and the coaches. (The players) shouldn’t feel the pressure. Let us have the pressure and see if we can’t go out and beat those expectations.”\nLed by megadonor Cody Campbell’s funding of an aggressive haul from the transfer portal, the Red Raiders are the talk of the league with their spending spree, just a couple of months after the first $1 million player in softball — NiJaree Canady — carried Texas Tech to the championship round of the Women’s College World Series.\nQuarterback Behren Morton is a holdover on offense, while linebacker Jacob Rodriguez returns from a defense that was among the worst in the country and underwent a portal makeover at defensive line and in the secondary.\nThe Red Raiders also have a new defensive coordinator in Shiel Wood, while the offensive play-caller is changing as well after Zach Kittley took over at Florida Atlantic.\n“It’s a challenge to try get those guys to buy in to what we’re talking about,” Rodriguez said. “But everybody who’s supposed to be in the building is here. And so we love every single one of them. They jumped in head-first, and they’re all in for us. They’re believing in what we’re talking about.”\nMorton had shoulder surgery in June, and the Red Raiders are hoping for a full season of health at the most important position for the first time in years.\n“I haven’t gotten to play a healthy season since my redshirt freshman year,” said Morton, a senior. “It’s going to be a lot different playing with a healthy shoulder. I’m really excited about it.”\nKeeping the pace\nMorton directed the No. 4 scoring offense in the country a year ago, and there’s a big void behind him with the departure of Tahj Brooks, the school’s all-time leading rusher. J’Koby Williams is among the candidates to replace him.\nReceivers Caleb Douglas and Coy Eakin scored 13 touchdowns between them last year, while the most intriguing pass-catcher is sophomore Micah Hudson. The highest-rated recruit in program history transferred to Texas A&M after a frustrating freshman season, but changed his mind and returned.\nShoring things up\nThere are so many new faces on defenses, it’s hard to pinpoint who the producers might be beyond Rodriguez, who finished in the top 10 nationally in tackles last year.\nStopping the run is a big focus, and 300-pound defensive tackle Anthony Holmes Jr. followed Wood from Houston. Edge rushers Romello Height (Georgia Tech) and David Bailey (Stanford) were among the leaders in pressure stats at their previous schools.\nThe schedule\nThe first intriguing test is Sept. 20 at Utah, which is coming off just its third losing season in 20 years under Kyle Whittingham. A big test comes Oct. 18 at defending Big 12 champion Arizona State followed two weeks later by a visit to Kansas State.\n___\nGet poll alerts and updates on the AP Top 25 throughout the season. Sign up here. AP college football: https://apnews.com/hub/ap-top-25-college-football-poll and https://apnews.com/hub/college-football",
  "word_count": 912,
  "scraped_at": "2026-02-14T13:22:56.599586"
}