{
  "article_id": "b1f795f41164",
  "url": "https://www.caughtoffside.com/2023/09/19/transfer-news-man-utd-takeover-odegaard-arsenal-deal/",
  "title": "Transfer news : Man Utd takeover , Odegaard Arsenal deal",
  "date": "20230919T231500Z",
  "domain": "caughtoffside.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Hello and welcome to my weekly exclusive column for CaughtOffside – click here to subscribe for more content from myself, Fabrizio Romano, and more!\nThe mood inside Manchester United as bust-up reports denied\nIt’s been an uncertain summer at Manchester United. The good news is that Erik ten Hag was delighted with the club’s summer business. Mason Mount was a priority target and Rasmus Hojlund has a big future ahead of him.\nBut a drawn-out sale process – which remains active even though the Glazers are yet to show their hand – and some notable fallouts and injuries have contributed to an indifferent start to the season.\nThe club deny reports there was a dressing-room bust up after the 3-1 loss to Brighton, but what is clear is things are tense with Manchester United 13th in the Premier League. You would expect this. It would almost be more surprising if it wasn’t this way after three league losses in five games.\nThere is no doubt Ten Hag has the support of Manchester United’s hierarchy. He won plaudits for how he handled Cristiano Ronaldo’s exit a year ago. And the Manchester United boss believes his ‘firm but fair attitude’ is necessary to change the culture at the club and is instructed from the top.\nBut Ronaldo, and it’s fair to say Jadon Sancho as well, view the Manchester United boss as too much of a taskmaster at times. Sources say Ronaldo complained he was made to run ‘punishment’ laps and that training felt too much like boot camp.\nAs for Sancho, he simply feels scapegoated. He made that clear in a now deleted social media post. Yet several Manchester United sources argue he needs to be more disciplined and focused in training. There are clearly two sides to that story.\nThe fact Al-Ettifaq, when they enquired on September 7, were told a £50m obligation to buy was necessary shows Manchester United were prepared to let Sancho leave. And he could yet be sold in January if the situation doesn’t improve.\nThe Sancho case is a test of Ten Hag’s man-management, and how adaptable he is. A hard-line approach, not tailored to Sancho’s personality, will probably only make the situation worse.\nThen there’s the Antony situation, with his return from international duty delayed so he can address assault allegations. Manchester United have clearly tried to act quickly in what is a complicated situation. It’s only right to let the process play out before taking any definitive judgement, but it’s important Manchester United handle this seriously and transparently and that will likely mean a number of missed games for Antony.\nAdd to all this the growing injury list, with Aaron Wan-Bissaka the latest player to miss several weeks due to a hamstring injury, and it’s hardly ideal prep heading into Wednesday’s Champions League opener against Bayern Munich.\nManchester United’s next four league games are against Burnley, Crystal Palace, Brentford and Sheffield United. Three wins are required otherwise Ten Hag may start to be under some pressure. His type of management style is clearly respected but when results don’t come that’s when dissenting players can start to make their voices even more heard and cracks appear, especially at a club like Manchester United and with a number of players not afraid to say their piece.\nThere’s no doubt Ten Hag has the support of the club’s leadership, on and off the field, but that doesn’t mean much in football if you lose the dressing room. That hasn’t happened yet, though, despite all the drama at Old Trafford.\nMartin Odegaard to more than double his salary with new deal agreement close\nMartin Odegaard is expected to sign a new Arsenal contract. An agreement in principle is not far off. Talks are advanced and the Arsenal captain could extend until 2027.\nArsenal are very optimistic. They know Odegaard wants to stay, and after a flurry of renewals last season the 24-year-old is now next in line.\nMuch like Bukayo Saka’s extension, which took time but was never really in doubt, Odegaard is seen as ‘untouchable’ right now. But there will still be some finer points to thrash out.\nOdegaard is on about £115k-per-week and will be looking to more than double that. And that pay hike is richly deserved after 15 goals last season and two already this campaign, including a key equaliser against Manchester United in a 3-1 win, which came just a minute after the visitors opened the scoring.\nI would expect, now the international break is over, for talks to move relatively fast. You may remember with Saka, the agreement in principle in the back half of last season still took a couple of months to then get signed and announced, but that didn’t mean that progress wasn’t made. Regardless of when it’s all official, Arsenal know Odegaard wants to stay and that should make his renewal relatively smooth.\nHow previous panic buy led to Chelsea deciding against Dusan Vlahovic risk\nChelsea were offered a number of players this summer that they turned down. This is normal for any big club, but especially one that’s spent £1bn over the past three windows. Sellers and agents will always target an active club in the market.\nAlthough Juventus’ Dusan Vlahovic was a name Chelsea had tracked over multiple windows they never seriously entertained a swap deal for Romelu Lukaku, who is now at Roma. This was because Mauricio Pochettino wasn’t on board. Chelsea would have had to pay €35-40m in addition to Lukaku, but I understand it wasn’t the money that put off the club.\nChelsea do admire many of Vlahovic’s qualities but had some concerns about his injury record. And, more importantly, they wanted to give priority to Nicolas Jackson and Armando Broja.\nI also think after signing Pierre-Emerick Aubameyang in a bit of a panic last summer from Barcelona, Chelsea didn’t want to rush into adding another big-money forward. If the goals don’t come this year, they’ll move in January instead with Brentford’s Ivan Toney one option. Nothing is advanced on that front yet. It will all depend on how Chelsea fare between now and January.\nAs Fabrizio Romano revealed, Chelsea were also offered Marcelo Brozovic prior to his Al-Nassr move. In the end the Croatian midfielder was sold on going to Saudi. And he never had a chance to seriously consider Chelsea because they quickly ruled him out. There would almost have been no point in selling Mateo Kovacic to Manchester City if Chelsea simply replaced him with 30-year-old Brozovic.\nAll manner of names were considered by Chelsea in addition to those players offered. Club Brugge striker Antonio Nusa was one talent Chelsea really liked, but the 18-year-old didn’t want to move until 2024. Marco Verratti and Wilfried Zaha were other names discussed. Neither quite fit the profile Chelsea wanted and this summer and the recruitment team were quite strict in their requirements.\nWho could succeed Gareth Southgate as England manager?\nGareth Southgate has come under some criticism of late, although I thought England were excellent in the 3-1 win over Scotland. The 1-1 draw against Ukraine was drab, though.\nSouthgate won’t be sacked. That’s not an option being considered, and rightly so in my view. It’s just a case of whether he stands down after Euro 2024. His contract expires in 2024 as it stands.\nThe FA are already considering options. This is normal, since international jobs (and the recruitment for them) work differently than in club football with a bit more forward planning. But obviously things can be entirely influenced by how England perform at Euro 2024, which is why it’s a bit early to be making predictions.\nGraham Potter will definitely be a candidate. He was the leading choice for the next England manager prior to joining Chelsea. But the way he handled that (albeit difficult) job may have given The FA a few doubts.\nEddie Howe is another name on The FA’s radar. I just don’t see Howe wanting to leave Newcastle, though, next year if everything goes according to plan this season.\nLee Carsley is also someone worthy of consideration having won the Under-21 Euros with England this summer. But a vacancy, should one arise, might come too soon for him.\nSarina Wiegman has already said she’s happy managing the Lionesses. There’s no reason for her to leave her role in 2024 as England look to defend their Women’s Euros crown in 2025.\nAnd Manchester City boss Pep Guardiola is an interesting one to watch. The FA would love to have him. If Manchester City again dominate, could Pep be tempted by a fresh challenge? Sources do indicate he likes the idea of managing at a World Cup, but he could also miss the day to day of club football at this stage of his career. Pep, a bit like Jose Mourinho has said in the past, may wait until slightly later in his career for an opportunity in international football.",
  "word_count": 1494,
  "scraped_at": "2026-02-14T13:03:51.724338"
}