{
  "article_id": "b210812fa9aa",
  "url": "https://www.archdaily.com/995364/ljubljana-architecture-city-guide-23-projects-to-discover-in-the-capital-of-slovenia",
  "title": "Ljubljana Architecture City Guide : 23 Projects to Discover in the Capital of Slovenia",
  "date": "20230125T124500Z",
  "domain": "archdaily.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Ljubljana is Europe’s little secret. This small capital city (less than 300,000 inhabitants) is perhaps surprisingly big in terms of architecture, and the variety of its built history makes it a mandatory stop in your architectural journey. From richly painted churches to sobering Brutalism. From classical Baroque and Habsburg-inspired architecture to delightful Art Nouveau façades and interiors. And of course, abundant greenery (Ljubljana is Slovenia’s – and now Europe’s – green capital) and food.\nLjubljana is a city that has many layers. Its beginnings as a Roman city are still visible (a wall, the world’s oldest wooden wheel, and the roads in and out of the city to name a few). Its contemporary vestiges might have aged, but their meaning hasn’t – think of the Republic Square or Brutalist petrol stations. It’s when we visit in person that we are able to truly feel these places and understand these layers.\nSome people can cover Ljubljana on a weekend, but to the architecture lover, it might be impossible. Please find the map containing all locations at the end of this article.\n1- Ljubljana Castle\nArchitect: Ambient\nLocation: Grajska planota, 1000 Ljubljana (Google)\nYear: 2009 (Lapidary KLMT and mini theatre)\nLjubljana’s most symbolic point of reference is the Castle. Perched on a hill above the city for about 900 years, Ljubljana’s Castle defended the empire against the Ottoman invasion as well as peasant revolts. In the 17th and 18th centuries, the castle became an arsenal and a military hospital. It was damaged during the Napoleonic period and – once back in the Austrian Empire – became a prison, which it remained until 1905, resuming that function during World War II. Most recently, renovation efforts have brought back to life forgotten areas such as the lapidary (see photo above), a space for showcasing well-preserved, undamaged, buried inner structures of the rampart as well as the archaeological remains of the castle’s earlier stages. Read more here.\n2- Cukrarna\nArchitect: Scapelab\nLocation: Poljanski nasip 40, 1000 Ljubljana (Google)\nYear: 1934/2021\nLording it by the languorous Ljubljanica river, Cukrarna – a former sugar refinery – stands proud. Its renovation is one of the most successful building conversions of the last ten years. Ljubljana, full of abandoned and semi-ruined architecture, is advocating for transformation, not demolition, a difficult task nowadays. In late 2018, the Municipality of Ljubljana began, with the financial support of the Slovenian Government and European Regional Developmental Fund, and in cooperation with the Museums and Galleries of Ljubljana, the first real renovation of the building. The essence of the project is the creation of a space dedicated to contemporary art and culture on the national and international levels. The result was a success. Read more here.\n3- Republic Square\nArchitect: Edvard Ravnikar\nLocation: Trg republike, 1000 Ljubljana (Google)\nYear: 1960-1983\nRepublic Square was the result of a competition that was intended to create an appropriate site in which to erect the Monument to the Revolution. Architect Edvard Ravnikar, a student of architect Jože Plečnik in the years 1938-39, won the open-call competition. He wanted to introduce a new dimension and a new social place to the nation’s capital. The resulting design has its roots in the country’s history, marked with public buildings and places where important events have taken place. Republic Square, –which was originally called Revolution Square and renamed after Slovenia became independent in June 1991 – is the largest square in Ljubljana. Read more here.\n4- Triple Bridge\nArchitect: Jože Plečnik\nLocation: Adamič-Lundrovo nabrežje 1, 1000 Ljubljana (Google)\nYear: 1932\nLjubljana is replete with gorgeous bridges, but few are as charming as Tromostovje, the Triple Bridge. The central of the three bridges forming the Triple Bridge has stood in its place since 1842 when it replaced an old, strategically important medieval wooden bridge connecting the north-western European lands with south-eastern Europe and the Balkans. Between 1929 and 1932, the side bridges, intended for pedestrians, were added to the original stone bridge to a design by the architect Jože Plečnik. Nowadays, all three bridges are fully pedestrian. It has a key position on the crossing of Plečnik’s two urban axes, the river axis and the axis running between the Rožnik and castle hills. Read more here.\n5- National and University Library of Slovenia (NUK)\nArchitect: Jože Plečnik\nLocation: Turjaška ulica 1, 1000 Ljubljana (Google)\nYear: 1941\nAmongst the cobbled streets around the university area of Ljubljana, you’ll find the imposing walls of the National and University Library of Slovenia: A gem of a building bequeathed to the city by Jože Plečnik. It was modeled in the manner of the Italian palazzo, similar to the house of the Italian architect Federico Zuccari. The interior comprises four wings and a central hallway. Light comes to the main entrance through windows in the main reading room, which is at the top of the main staircase, oriented crosswise. This symbolizes the central thought of the building’s architecture, ‘From the twilight of ignorance to the light of knowledge and enlightenment’. The staircase and its 32 columns are built of dark Podpeč marble, which is actually limestone. Don’t miss the handles of the main door, they end with a little head of Pegasus. Read more here.\n6- Petrol Stations\nArchitect: Milan Mihelič\nLocation: Tivolska cesta 46, 1000 Ljubljana (Google)\nYear: 1970’s\nOne of the surprising concrete structures that you’ll find across the capital are these unique petrol stations, they were built between 1950 and 1970 by Milan Mihelič. They typify a distinct time period of mid-century modernism in Yugoslavia. These petrol stations were of a pioneering design that combined the material sciences and engineering innovations occurring through the early 1950s and combined these advances with the modernist architectural aesthetics of a style of regional building design called “Slovene Structuralism”. Out of this combination came a series of mushroom-shaped concrete structures whose streamlined gravity-defying shapes inspired one to think to the future, while simultaneously ushering in some of the very first ‘modern’ service stations in Slovenia. Read more here.\n7- Narodni muzej Slovenije\nArchitect: Jan Vladimír Hráský\nLocation: Muzejska ulica 1, 1000 Ljubljana (Google)\nYear: 1885\nAlong with the Slovenian Museum of Natural History, located in the same building, the National Museum of Slovenia is the country’s oldest scientific and cultural institution. The museum has an extensive collection of archaeological artifacts, old coins and banknotes, and displays related to the applied arts. The main building of the National Museum – the true gem for the archie lover – was built in the Neo-Renaissance style by the master builder Wilhelm Treo in collaboration with Jan Vladimír Hráský between 1883 and 1885. Treo mostly followed the plans of the Viennese architect Wilhelm Rezori. The interior was designed by Hráský, with the ceiling of the main hall decorated with medallions by the painters Janez and Jurij Šubic. Read more here.\n8- Cathedral of St. Nicholas\nArchitect: Milan Mihelič\nLocation: Tivolska cesta 46, 1000 Ljubljana (Google)\nYear: 1970’s\nWith its classic twin towers and trademark single, weather-worn green dome, the city’s cathedral encapsulates everything that represents Ljubljana. Small and interesting, but not too exciting at first glance, a longer look at its history and finer details reveals its hidden charm and beauty. Built on the site of a much earlier church, the cathedral’s main structure and appearance date from the first half of the 18th century. Inside the Baroque masterpiece is a cavalcade of classic creams and golds, littered with extraordinarily detailed frescoes and possessing that calming feeling that only a great church can bring. Don’t forget to check out the astonishing pair of bronze doors on the western and southern sides. Read more here.\n9- Vurnik house\nArchitect: Ivan Vurnik\nLocation: Zadružna Gospodarska Banka, Miklošičeva cesta, 1000 Ljubljana (Google)\nYear: 1921\nThe Cooperative Commercial Bank in Miklošičeva street is one of Ljubljana’s landmark buildings. It was designed by architect Ivan Vurnik in 1921 and is considered one of the finest examples of national style. The interior includes a Baroque-painted hall with a glass ceiling, consisting of small blue glass squares, with a decorative strip of glass pieces of different colors. Stained glass windows depicting geometric patterns decorate also the staircase hall on the first two floors. The painted hall and façade are the work of the architect’s wife Helena Vurnik, a Viennese by birth, who was involved in her husband’s exploration and creation of typical Slovenian architecture. The geometric decoration is executed in red, white, and blue, the color combination of the Slovenian flag, featuring motifs from the wealth of Slovenian iconography: a stylized landscape of spruce forests, wheat fields, and vines, and the motive of women in the Slovenian national costume. Read more here.\n10- Semeniška knjižnica\nArchitect: Giulio Quaglio\nLocation: Tržnica, Tržnica, Dolničarjeva ulica 4, 1000 Ljubljana (Google)\nYear: 1721\nThe library in the Seminary Palace is the hidden pearl of the Baroque Ljubljana. You enter through the impressive entrance portal, made in 1714 in Luka Mislej’s workshop, supported by the statues of Hercules, which are the work of the sculptor Angelo Putti. The two-story library was founded in 1701 on the initiative of Academia Operosorum members and was the first public library in Ljubljana. The library was dedicated to the public for 50 years, and then it was left to the theologians. In 1721, Giulio Quaglio painted the ceiling of the library. Qualio’s painting represents the Allegory of Theology that gives power to Faith, next to it are Hope and Love. A massive reading table is adorned with three baroque globes. Read more here.\n11- Skatepark under the Fabiani bridge\nLocation: Poljanski nasip 40, 1000 Ljubljana (Google)\nYear: 2018\nAt the initiative of skateboarders, a new skate park under the Fabiani bridge near Cukrarna was constructed, reviving the entire lower part of the Fabiani bridge. The skate park is equipped with a semi-circular mini-ramp and is placed between the 4 pillars of the bridge and two smaller concrete elements. The entrance to it is through a swinging double door, and lighting is provided at bight so that skateboarders can use it even in the evening hours. By building skateboard parks, the young (and the young at heart) can spend their free time actively. Read more here.\n12- Ljubljana Central Market\nArchitect: Jože Plečnik\nLocation: Adamič-Lundrovo nabrežje 6, 1000 Ljubljana (Google)\nYear: 1944\nThe so-called ‘Plečnik’s Covered Market’, built to designs by the architect Jože Plečnik between 1940 and 1944, is conceived as a two-story range of riverside market halls following the curve of the river. Shops offering Slovenian products and catering establishments are located in the upper story. The Central Market consists of an open-air market, located in the Vodnikov trg and Pogačarnev trg squares, a covered market situated in between the two squares, and a series of small food shops along the river Ljubljanica, which are referred to as ‘Plečnik’s Covered Market’ as they are located in a colonnade designed by Ljubljana’s famous architect Jože Plečnik. Read more here.\n13- Arena Stožice\nArchitect: SADAR+VUGA\nLocation: Arena Stožice, 1000 Ljubljana (Google)\nYear: 2010\nThe Sports Park Stožice is a hybrid project. Its implementation is the result of the public-private partnership between the City of Ljubljana and the Grep development company. The Sports Park Stožice integrates a football stadium and a multi-purpose sports hall with a big shopping center, covered by the artificial landscape of the recreational park. The park’s plateau, the edge of the shell scallops and opens towards the interior. The ridges continue all the way to the top, where the facade meets the dome. This outlines the shape of the hall, a shell that opens towards the perimeter with large crescent openings overlooking the park. Read more here.\n14- Ferant Garden\nArchitect: Edvard Ravnikar\nLocation: Slovenska cesta 9, 1000 Ljubljana (Google)\nYear: 1975\nThe business and residential complex Ferant Garden demonstrates that Edvard Ravnikar was not only the most visible and prominent representative of Modernism in Slovenia but was also its most unrelenting critic. The design of Ferant Garden is an expression of Ravnikar’s critique of the block-of-flats residential construction that accompanied the growth and modernization of cities in the mid-20th century, and a critique of the principles of modern urban planning that failed to recognize the social importance of open public spaces, streets, and squares, or the program diversity of the city parterre. Edvard Ravnikar built the building named Ferant Garden in the exact spot where Jože Plečnik’s birth house once stood. Read more here.\n15- Slovenian Philharmonic Building\nArchitect: Adolf Wagner and Jože Plečnik (annex)\nLocation: Kongresni trg 10, 1000 Ljubljana (Google)\nYear: 1882\nThe Slovenian Philharmonic (Slovenska filharmonija) is one of the world’s oldest institutions of its kind. Its rich history dates back to 1701 when the first musical association and main promoter of Baroque music in Slovenian inhabited areas were established under the name of Academia Philharmonicorum. The Slovenian Philharmonic Building was constructed in 1891 on the foundations of the former Estate Theatre (Stanovsko gledališče), built in 1763 to mark Emperor Joseph II’s formal visit to Ljubljana and destroyed in a fire in 1887. As a result of a competitive tender, the Graz-based Austrian architect Adolf Wagner was commissioned to develop the plans for the Slovenian Philharmonic Building. The building’s façade was designed in the neo-Renaissance style with rounded corners characteristic of theatre buildings of the time. In 1937, the architect Jože Plečnik added an annex at the back of the building and redesigned the back facade. Read more here.\n16- Žale Cemetery\nArchitect: Jože Plečnik\nLocation: Na Žalah 5, 1000 Ljubljana (Google)\nYear: 1940\nThe romantic Žale Cemetery is another of Plečnik’s designs. Originally commissioned in 1936 to architect Ivo Spinčič, Plečnik came to the rescue after the plans failed to please the authorities. 1940 saw the completion of an unconventionally designed funeral home called Žale, which housed Ljubljana’s first chapels of rest and was quite unlike any other funeral home of the time. Its name subsequently became the name of the entire cemetery complex. The entrance to the Žale Cemetery is marked by a monumental arch with a two-story colonnade (see photo above), which symbolically divides the world of the dead from the world of the living. Opposite the arch stands the cemetery’s main oratory, inspired by classical models. Chapels of rest are designed on a variety of different architectural models, from classical Greek to Byzantine and Oriental. Some are based on a combination of the three styles, and some on pure imagination. In this way, Plečnik enhanced the concept of equality of all religions. Read more here.\n17- ALEJA\nArchitect: ATP architects engineers\nLocation: Rakuševa ulica 1, 1000 Ljubljana (Google)\nYear: 2020\nALEJA integrates the genius loci of the city into its modern, highly-functional retail architecture. The interior invokes the urban-poetic charm of the historic center of Ljubljana, while the form and the elevations are inspired by the city’s heraldic animal. With its diamond-shaped shingles of metal and colored glass, the façade recalls the skin of a dragon, as well as meeting ambitious targets in terms of lighting technology and energy efficiency. Read more here.\n18- Plečnik House\nArchitect: Jože Plečnik\nLocation: 6, Karunova ulica 4, 1000 Ljubljana (Google)\nYear: 1930\nPlečnik House comprises a complex of two neighboring houses and an adjacent garden with a lapidary, which, along with Plečnik’s original furniture, library, drawing tools, personal belongings, and a large archive of sketches, plans, photographs, and models all form part of the Plečnik Collection. One of the two houses within the complex was bought by the architect’s brother Andrej in 1915. When Plečnik returned to Ljubljana in 1921, he and his two brothers and sister decided to live together, so the architect built a cylindrical annex to the house (1925). Later he added a glassed porch and, after purchasing an older suburban house next door, a conservatory (1930). Despite the agreement between the siblings to live together, only the architect’s brother Janez lived in the house for a while. When he moved out, Plečnik refurbished the house to make it suit his own requirements. Interestingly, the refurbishment and extension work to the two houses were often done using leftover materials from Plečnik’s other projects. Read more here.\n19- Ljubljana Mosque\nArchitect: Bevk Perović arhitekti\nLocation: Džamijska ul. 10, 1000 Ljubljana (Google)\nYear: 2020\nMuch like its historical predecessors – the case of Sarajevo mosques during the 19th century being a nearby example, where mosque complexes (built by rich donors) were the starting points, the ‘seeds’ for the development of the new parts of the city, the new complex becomes one such thing for this part of Ljubljana. The program of the center consists of a religious school building, a cultural and office program, an apartment building for the employees of the community, a restaurant, as well as a mosque, the first one to be built in Slovenia, all of them supported by car parking in the basement. The new buildings of the center are positioned as separate entities, autonomous buildings surrounding the central square area with a mosque in the center of it. They are simple volumes, oriented always towards the ‘outside’ world with their respective programs, simultaneously surrounding the mosque building and allowing views towards it from all sides through the gaps in-between them. Read more here.\n20- Nebotičnik\nArchitect: Vladimir Šubic\nLocation: Štefanova ulica 1, 1000 Ljubljana (Google)\nYear: 1933\nThe Nebotičnik Cafe, located on the top of the Nebotičnik (Skyscraper) building, a venerable example of architecture between the two World Wars, affords some of the most beautiful views of Ljubljana opening out in all directions. Built in 1933 to designs by Vladimir Šubic, the Skyscraper was the tallest building in the Balkans and the 9th tallest building in Europe at the time of its construction. The slightly above 70-meter high Skyscraper was built on the model of American skyscrapers and equipped with several technical novelties of the time, including fast lifts, air conditioning, and fuel oil central heating. Read more here.\n21- Brilejeva ulica\nLocation: Brilejeva ulica, 1000 Ljubljana (Google)\nYear: 1950’s\nNo architect should miss the suburban architecture of the post-war. The shortage of housing, tight budget, and political situation, make these dense blocks an interesting case study. Amongst the many blocks of council housing, I found these rather representative. They are organized in pairs, with a road in the middle separating traffic from pedestrian traffic, and are roughly 10 stories high. At the basement level, there’s a parking, then small shops – convenience stores, launderette, and small shops – and then the residential block.\n22- JB Restaurant\nLocation: Miklošičeva cesta 19, 1000 Ljubljana (Google)\nYear: 1992\nThough strictly speaking this is more art than architecture, what’s better than eating in the most beautiful environment? Janez Bratovz is a chef renowned throughout Slovenia and further afield but his restaurant in the center of Ljubljana not only offers a refined culinary experience but also immaculately curated modern art. This sets the scene for the food, where experience, consistency, and thorough local sourcing have been the key ingredients for more than a quarter of a century. The tasting menus are the ideal introduction to Slovenia’s cuisine and provenance. It’s one you don’t want to miss! Read more here.\n23- Farewell Chapel\nArchitect: OFIS Arhitekti\nLocation: Krašnja, 1225 Lukovica (Google)\nYear: 2009\nThis farewell chapel is located in a village close to Ljubljana. The site plot is next to the existing cemetery and the chapel is cut into the rising landscape. The shape is following the lines of the landscape trajectories around the graveyard – three curved walls are embracing and dividing the programs. The external curve is dividing the surrounding hill from the chapel plateau and reinstates the main supporting wall. Services such as storage, wardrobe restrooms, and kitchenette are on the inner side along the wall. On the other hand, the internal curve is embracing the main farewell space. It is partly glazed, and it is opening towards the outside plateau for summer gatherings. Read more here.\nCheck these and other amazing locations on the map below or download The Free Architecture Guide of Ljubljana",
  "word_count": 3338,
  "scraped_at": "2026-02-14T12:59:58.332290"
}