{
  "article_id": "b2329935f3ad",
  "url": "https://www.arsenal.com/news/anthony-yarde-importance-no-more-red",
  "title": "Anthony Yarde on the importance of No More Red",
  "date": "20230106T113000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Anthony Yarde is a British professional boxer and Arsenal fan. He grew up in London, and was involved in the No More Red campaign in 2022.\nHere he shares why he is proud to be a part of the initiative and what he hopes it can achieve:\nI saw a lot growing up, levels of youth violence that no child should have to see or experience. I never shy away from my childhood and where I was raised because it has a part to play in who I am today.\nMy mum raised me so she has had a huge influence on my life and the person I am. I was raised with love and communication, and she allowed me to make decisions for myself and gave guidance, make mistakes, learn for myself and become a man. The love between us and my siblings has a big role to play in me achieving the success I have had thus far.\nI understand that some are very good kids getting led astray, they see crime as a resolution, but need to see the bigger picture and seek opportunities.\nI think community is very important because people need people. When people come together in a positive way, it's powerful. It can be powerful in different ways, for businesses, families, sports and any other gathering you can think of.\nCampaigns like No More Red are so important because they shine a light on the opportunities that are actually out there. In my opinion, it shines a light on choices.\nThere are so many people that come from the same area that I came from, and people have different outcomes for different reasons. Often those different outcomes are based on choices.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 314,
  "scraped_at": "2026-02-14T12:59:59.026368"
}