{
  "article_id": "b2416641d374",
  "url": "https://www.fox5atlanta.com/news/trump-says-marjorie-taylor-greene-has-lost-her-way-amid-policy-rift",
  "title": "Trump says Marjorie Taylor Greene has  lost her way  amid policy rift",
  "date": "20251111T030000Z",
  "domain": "fox5atlanta.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Trump says Marjorie Taylor Greene has 'lost her way' amid policy rift\nWASHINGTON - President Donald J. Trump said Monday that Republican Rep. Marjorie Taylor Greene of Georgia had \"lost her way\" after she criticized his emphasis on international affairs over rising domestic costs.\nTrump on Greene\nWhat they're saying:\nIn remarks at the White House ahead of a meeting with Syrian President Ahmed al‑Sharaa and the swearing-in of a U.S. ambassador, Trump told reporters, \"I don’t know what happened to Marjorie, nice woman. She’s lost her way, I think.\"\nGreene has publicly challenged the administration’s foreign-policy focus, arguing that \"watching the foreign leaders come to the White House through a revolving door is not helping Americans.\" She charged that the president’s agenda \"is doing nothing about health insurance premiums. It’s doing nothing to solve the problems that are really plaguing vulnerable segments of our population, especially young people.\"\nRep. Marjorie Taylor Greene, R-Ga., talks with reporters after a meeting of the House Republican Conference at the Capitol Hill Club on Tuesday, Sept. 9, 2025. (Tom Williams/CQ-Roll Call, Inc via Getty Images)\nTrump defended his global focus as necessary, saying he must \"view the presidency as a worldwide situation, not locally,\" because \"we could have a world that’s on fire, where wars come to our shores very easily, if you had a bad president.\"\nHe also accused Greene of \"catering to the other side,\" a reference to Democratic viewpoints, saying her remarks showed she \"doesn’t know\" the consequences of unfocused criticism.\nGreene responded that she remains committed to her \"America First\" agenda and said she has \"100% America first and only!\" in a statement following the Senate's end to the government shutdown stalemate:\n\"I support President Trump and I support an America First agenda. My angst is with my colleagues and their failure to deliver for the American people. Republicans have the supermajority and it's time to put our policy into action.\"\nRep. Alexandria Ocasio-Cortez on Rep. Marjorie Taylor Greene\nThe other side:\nRep. Alexandria Ocasio-Cortez, a Democrat from New York, has offered her own explanation for Rep. Marjorie Taylor Greene’s recent break from President Donald J. Trump. In an interview first reported by People magazine, Ocasio-Cortez claimed Greene’s behavior stems from frustration over being blocked from pursuing higher office in Georgia.\nOver 13,000 people pack Forest Hills Stadium in Queens, New York, for mayoral candidate Zohran Mamdani's New York Is Not For Sale rally on Oct. 26, 2025. (Photo by Neil Constantine/NurPhoto via Getty Images)\n\"Marjorie Taylor Greene wanted to run for Senate in Georgia,\" Ocasio-Cortez said. \"She wanted to be the Republican nominee for Senate. So, she was gearing up for that statewide race, and Trump told her no. Trump said no, and the White House and Trump Land shut down Marjorie Taylor Greene’s personal ambitions to run for Senate, and she has been on a revenge tour ever since.\"\nRepublicans vying to claim the nomination in the race to unseat Sen. Jon Ossoff include Rep. Buddy Carter, Rep. Mike Collins, and Derek Dooley, son of former Georgia football legend Coach Vince Dooley. President Donald Trump has not yet thrown his support behind any of the candidates currently.\nRep. Marjorie Taylor Greene's shift in tone\nThe backstory:\nGreene, who represents Georgia's 14th congressional district in northwest Georgia, has made a string of remarks in recent weeks that reflect both a shift in tone and mounting criticism of her own party’s leadership, signaling a possible recalibration of her positioning ahead of the 2026 election cycle.\nGreene urged lawmakers from both parties to end the federal government shutdown and prioritize domestic issues including health care and cost-of-living pressures. She said \"both parties share responsibility\" for the stalemate and stressed that lawmakers \"must be getting to work for the American people.\"\nShe also said she will not accept a congressional paycheck during the shutdown and called for an end to the \"political drama\" in Washington.\nOn Nov. 4, Greene appeared on the ABC show The View for a wide-ranging discussion about the shutdown, women’s rights, free speech and other issues. She adopted a more measured tone than is typical for her, engaging civilly with a largely Democratic panel while maintaining her political positions.\nIn an interview earlier this year, Greene voiced frustration with the Republican Party, saying she wonders whether the party has \"turned its back\" on its \"America First\" base. She stated she is urging her party to return to core conservative principles rather than stray into what she characterized as \"neocon\" territory.\nHer recent tonal shift has drawn the attention of satirists and late-night talk show hosts, who repeatedly expressed \"shock\" that they were agreeing with the controversial Georgia congresswoman.\nPublic reaction online has been sharply divided, with Greene’s supporters applauding her push for domestic priorities while critics accused her of undermining the president ahead of an election year.\nSEE ALSO:\n- Rep. Marjorie Taylor Greene: Senate Republicans should use nuclear option to pass continuing resolution\n- Marjorie Taylor Greene calls for bipartisanship to end government shutdown\n- Rep. Marjorie Taylor Greene discusses shutdown, more on 'The View'\n- Marjorie Taylor Greene blames GOP leadership for shutdown\n- Rep. Marjorie Taylor Greene rejects continuing resolution, citing Biden policy concerns\nRep. Greene's future\nWhat we don't know:\nIt’s unclear whether Greene’s comments mark a lasting break from the president or a temporary rift. Trump’s campaign has not said whether she’ll continue to have a role in reelection efforts for the party, and Greene hasn’t indicated if she plans to pursue higher office after her current term. No official comment has been issued by the Georgia Republican Party regarding the dispute.\nThe GOP and the economy\nWhy you should care:\nIt also underscores growing divisions inside the Republican Party as the 2026 midterm cycle approaches. Greene’s calls to refocus on domestic issues reflect voter frustration over rising costs and inflation, while Trump continues to emphasize foreign diplomacy and national security. The rift could influence both Georgia’s Senate race and the national conversation over the GOP’s economic message heading into next year’s campaigns.\nThe Source: This article is based on details reported by FOX News, the Associated Press, and People Magazine. Previous FOX 5 Atlanta reporting was also used. This article is being reported out of Atlanta.",
  "word_count": 1045,
  "scraped_at": "2026-02-14T14:21:20.895926"
}