{
  "article_id": "b263addec707",
  "url": "https://www.irishecho.com/2023/6/burnley-snap-up-o-shea",
  "title": "Burnley snap up OShea",
  "date": "20230629T203000Z",
  "domain": "irishecho.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Republic of Ireland defender Dara O’Shea will play in the EPL next season. Last week the 24-year-old Dubliner completed the move from West Bromwich Albion to newly promoted Burnley for a fee believed to be in the region of £7 million. He has signed a four-year contract. Four other clubs in England were reported to be monitoring O’Shea’s situation, while interest from abroad was strongest in Italy, with Serie A clubs apparently keen to try to take advantage of West Brom’s financial situation.\nO’Shea was left out of the Irish team for the recent game against Greece in Athens, but was recalled by manager Stephen Kenny for the win over Gibraltar three days later to win his 19th cap. Speaking to the Clarets website, O’Shea said: ‘‘It feels great to be here and I really can’t wet to get going. Burnley were the outstanding team in the Championship last season and they achieved exceptional things. I want to improve as a player first and foremost and I want to help the club achieve their goals. I am at the stage of my career where I want to push myself. I want to be the best I can be and this is the club that can help me to do that and I can help them too.’’\nThe Dublin native joins fellow Irish international Josh Cullen at the club, while Michael Obafemi has been on loan there from Swansea City.\nPAUW WANTS\nTO STAY ON\nIrish women’s manager Vera Pauw, who will name her World Cup squad today, says she wants to stay on as Irish manager. Pauw, whose current deal expires later this summer, indicated recently that talks had started between her agent and the FAI regarding an extension, admitting she was hoping to get things signed off before heading to Australia for the tournament, which begins on July 20.\nLast week she said: ‘‘For now I am just busy with the World Cup. We need to be ready on the 20th of July. That needs my full attention. Let me be clear, I’m very happy in Ireland. Everybody can see that. Everybody feels that. I want to stay. But I’m not part of that process.’’\nLast Thursday, the Irish women beat fellow World Cup debutants Zambia 3-2 in a friendly at Tallaght Stadium, with two goals from Amber Barrett, while Claire O’Riordan got the other.\nClaire O’Riordan scoring Ireland’s second goal in last Thursday’s friendly 3-2 win against Zambia in Tallaght Stadium. Inpho/Ryan Byrne\nBENITEZ JOINS\nLA LIGA’S CELTA\nFormer Liverpool and Newcastle manager Rafael Benitez is returning to management after being named Celta Vigo manager, which play in La Liga in his native country. The 63-year-old Spaniard has been out of the game since being sacked by Everton in January 2022.\nMILLWALL CHARGED\nOVER MCCLEAN\nEnglish Championship club Millwall have been hit with Football Association charges related to three alleged instances of religiously offensive abuse aimed at Republic of Ireland international James McClean during their Championship game against Wigan in April. The 2-1 win for the Latics was marred by chanting from the away end at the DW Stadium and now the FA has acted.\nAn FA statement read: ‘‘Millwall FC has been charged with three breaches of misconduct in relation to crowd control for incidents that took place during its EFL Championship game against Wigan Athletic FC on April 22 2023. It’s alleged that the club failed to ensure its spectators and/or supporters and anyone purporting to be its supporters or followers, conduct themselves in an orderly fashion at the game, and do not use words or behave in a way which is improper, offensive, abusive, indecent, or insulting, with either express or implied reference to religion, in the 8th, 12th and 45th minutes.’’\nNEVILLE CALLS\nFOR SAUDI PAUSE\nFormer Manchester United star Gary Neville has asked the EPL to pause players’ transfers to Saudi Arabia for ‘integrity’ reasons, but last week was busy week of deals there is no sign of it stopping. On Friday 26-year-old Wolves captain Ruben Neves join Al-Hilal for £47m, a record for the Molineux club. Chelsea goalkeeper Edouard Mendy is the latest big European name heavily linked with a deal to join the Saudi Pro League. Cristiano Ronaldo Karim Benzema and N’Golo Kante have already signed up, marquee names but nearing the end of their career and there was speculation Lionel Messi would too, before his move to the US. But a growing number of players at their peak are also attracting interest, including two other Chelsea players in Kalidou Koulibaly and Hakim Ziyech, plus Arsenal's Thomas Partey.\nBohemians’ James Akintunde dejected after Shamrock Rovers opened the scoring in what was eventually a 2-2 game at Dalymount Park. [Inpho/James Crombie]\nDIGNAM HONORED\nAT DALYER DERBY\nIn the big Dublin derby on Friday night between Bohemians and Shamrock Rovers, which ended at 2-2 at Dalymount, Bohs wore a special one-off jersey to honor the late Christy Dignam with Aslan’s name on the front of the shirt. At half-time Dignam’s daughter Keira sang some of her father’s songs including “Crazy World.” Dignam, who died on June 13, was a big League of Ireland fan and he was also associated with The Hoops. Rovers went 2-0 up but Bohs came back to force a draw and cut Rovers lead over Derry City at the top to 4 points. At Weaver Park in Drogheda Galway-born striker Patrick Hoban scored twice in Dundalk’s 2-1 win to bring his goals tally for “The Town” to 144, breaking the record held by Joey Donnelly. Derry beat Cork City 2-0 at the Brandywell, while St Pat’s stay third after a 1-0 home win over Shelbourne.",
  "word_count": 946,
  "scraped_at": "2026-02-14T12:28:07.684567"
}