{
  "article_id": "b276383f45d9",
  "url": "https://www.texasmonthly.com/the-culture/ring-of-fire/",
  "title": "Ring of Fire – Texas Monthly",
  "date": "20240428T160000Z",
  "domain": "texasmonthly.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "“The bonfire symbolizes two things,” reads the 1947 Texas A&M freshman handbook. “A burning desire to beat the team from the University of Texas, and the undying flame of love that every loyal Aggie carries in his heart for the school.”\nThe tradition began as a wood-and-trash pile in 1909, when A&M was still an all-male military college. Over time it grew in scale and ambition, eventually setting a world record in 1969, when it reached 109 feet. In keeping with A&M’s belief that Aggies should learn as much outside the classroom as they do in it, the arduous task of constructing Bonfire was left entirely to students. Until 1999, it burned every year except for 1963, when it was torn down after the assassination of President Kennedy. Head yell leader Mike Marlowe explained, “It is the most we have and the least we can give.”\nAnd then, in the early-morning hours of November 18, 1999, the million-pound structure—which took almost two months, five thousand logs, and 125,000 man-hours to build—collapsed in a matter of seconds. Nearly sixty Aggies were working on Bonfire when it fell; twelve were killed.\nThough the tradition had always held great meaning for A&M, it was not without controversy. Earlier warnings that its design was flawed had gone unheeded. Critics pointed to the marginalized role played by female students (for most of the seventies they were excluded from working on the project), as well as its demanding construction schedule, which caused some students’ academic performances to suffer. But many Aggies were still outraged when the administration suspended the beloved tradition. This fall, the controversy began anew when Governor Rick Perry, an Aggie alum, said in an interview with Texas Monthly that he believed that Bonfire will return to A&M as soon as next year.\nTen years after the collapse, on what marks the hundredth anniversary of Bonfire, Texas Monthly tracked down many of the students who were working on or around the structure when it fell. Drawing on more than one hundred hours of interviews with student leaders, workers, medics, football players, professors, parents, and alumni, this is the untold story of Bonfire, in the words of Aggies themselves.\n“We were all gathered around a fire, trying to put some voodoo on a football game.”\nBonfire was set ablaze every November before the Aggies-Longhorns football game. The construction was supervised by redpots—the elite group of juniors and seniors who wore red Army surplus helmets, or “pots.” On the night it was lit, the crowd could swell to 70,000 people.\nJames Brown, class of 2001, was a biomedical science major and a student medic. He lives in Jackson, Wyoming, and owns an outdoor guiding company. There’s that famous line about A&M: “From the outside looking in, you can’t understand it. From the inside looking out, you can’t explain it.” That’s true of Bonfire too. You can’t understand the intensity—neither in size, nor in temperature, nor in emotion, nor in any measurable aspect—unless you saw it burn.\nChip Thiel, class of 2000, was an agricultural economics major and a cadet in the Corps. As a brownpot, he was one of the few leaders who were allowed to use mechanized equipment. He is the vice president of a wealth management company in Houston. We cut, loaded, transported, unloaded, and stacked a forest full of trees to create the largest bonfire in the world.\nAaron Horn, class of 1998, was an agricultural development major, a cadet in the Corps, and a redpot. He owns an automotive repair shop and lives in College Station. Five thousand logs, cut by hand. Five thousand logs! The center pole alone was a hundred feet tall. When you stood on top of stack, it felt like you were on top of the world. We lit it around Thanksgiving, and when we got back from Christmas break, it was still smoldering.\nMike Fossum, class of 1980, was a mechanical engineering major and served as a squadron commander in the Corps. An astronaut, he is a veteran of two space missions and lives in Houston. It was a herculean effort to build. And then came the night when we actually burned it. The band would come marching in, and the yell leaders and the redpots would circle around with flaming torches. On cue, they would throw their torches onto Bonfire. When that sucker went up, it was an amazing sight to see, especially if you had built it with your own blood, sweat, and tears.\nRick Perry, class of 1972, was an animal science major, a cadet in the Corps, a yell leader, and a redpot. He is the governor of Texas. At Bonfire, I led the band with my date, who subsequently became my wife. Those are moments you never forget. As you get older, they become more poignant.\nMike Rusek, class of 1998, was an agricultural development major and a cadet in the Corps. He lives in La Grange and is a terminal manager for an oil field transportation company. The goal was for Bonfire to fall after midnight. If it fell after midnight, then we were going to beat Texas. The kicker was the moment when the whole thing would topple over. A wave of heat would come off of it—like a sonic boom of heat—and everyone would go crazy. The entire crowd had to back up, because the heat got so intense. I mean, it was almost medieval. We were all gathered around a fire, trying to put some voodoo on a football game.\nEthan McDaniel, class of 2003, was an interdisciplinary studies major and a cadet in the Corps. He teaches Texas history at a middle school in Mansfield. I drove to College Station with a buddy when I was still in high school to watch Bonfire. My car got completely caked in ash, and being a dumb kid, I thought that was so cool. I didn’t wash my car for weeks.\nMark Ferrell, class of 2000, was an agricultural economics major and a cadet in the Corps. As a center-pole pot in 1999, he helped manage the construction of Bonfire. He is a high school social studies teacher and coach in Eustace. When we lit it my junior year, I felt like I was standing inside a furnace. Everything turned red-orange. I was 100 percent sober, but it was almost hallucinatory. It felt like—and I think I’ve read about this happening in Hiroshima or Nagasaki—your shadow was burned on the ground. Everywhere you looked, there was heat and flame. It was like something from a dream or a nightmare. It was beautiful.\nHenry Cisneros, class of 1968, was an English major, a cadet in the Corps, and a commander of the combined band. A former mayor of San Antonio, he served as the U.S. Secretary of Housing and Urban Development from 1993 to 1997. For the visitors and parents and game attendees, watching it burn was the big moment—and seeing a fire of that scale was spectacular. But Bonfire was more than just an aggregation of logs that was burned for a pep rally. It was a lesson in working very hard, as a team, to complete an immense task. For those of us who built Bonfire, watching it burn was anticlimactic.\nMike Rusek: Watching it burn was a humbling experience. You worked your tail off every day for months, and then it fell in a couple hours. My freshman year, I remember thinking, “We do all this work and then we burn the damn thing?”\nAaron Horn: Most people just came to see it burn. But the way my buddies and I looked at it, burning it was the least important part. We didn’t build it to burn it; we burned it to get it out of the way, so we could do it again.\nStephen Mason, class of 1999, was an electrical engineering major. He is an attorney and lives in Austin. Football was what Bonfire was supposed to be about, but Bonfire came to take on its own meaning. We used to tell freshmen, “We’re not building Bonfire; we’re building you.” There was great purpose in what we were doing. We were building community. We were forging young men and women through this physically demanding experience. We were teaching them that there was dignity in hard work.\nJacqui Martinez Kellog, class of 2003, was an English major. She lives in San Antonio and is a stay-at-home mom. We were eighteen years old and away from home for the first time. We came from all different backgrounds, from all over Texas, but we were all working toward one goal. The friends you made became your friends for life.\nRick Perry: An experience that’s comparable, maybe, is people serving in the military. They become very close. There was shared effort, shared sacrifice.\nRay Bowen, class of 1958, earned a bachelor’s degree and a doctorate in mechanical engineering. He was the president of Texas A&M from 1994 to 2002. Now president emeritus, he is a professor in the mechanical engineering department. If you look at cultures that have undergone great change, they tend to hang on to certain symbols of their past. A&M has undergone great change. Its traditions—Muster, Elephant Walk, Bonfire—are all symbolic of different parts of our past. Bonfire was symbolic of A&M before the Corps became optional, before women, before enormous growth, before national aspirations for its academic reputation. Certain people hung on to that, and Bonfire became more important than perhaps it really was back when it all started. Football was the catalyst for it in the old days, when I was a student who worked on Bonfire, but the importance of the athletic rivalry became diminished over the years. Bonfire became an entity in itself.\n“Those blisters on your hands were a badge of honor.”\nEvery September students took part in “cut,” the harvesting of trees for Bonfire. In 1999 land in nearby Somerville was donated for the task, and over several weekends, thousands of trees were chopped down and hauled back to campus. Around two thousand people turned out for the first day of cut.\nTravis Johnson, class of 2000, was a finance major, a cadet in the Corps, and a redpot. He held Bonfire’s highest leadership position, “head stack,” in 1999. He lives in Harlingen, where he is the office manager of a family practice medical clinic. When fall rolled around and the weather started cooling down, that meant three things: football, hunting, and Bonfire. People camped out so they could be the first ones inside the gate on the first day of cut. There was a line of cars out there by four o’clock in the morning.\nCash Donahoe, class of 2003, was an aerospace engineering major. He lives in League City and is a flight controller for the International Space Station. Every Saturday, the dorm leaders would wake us up at around four-thirty in the morning. They would blast music in the courtyard and run around pounding on our doors to get everyone up for cut. They cranked the volume up as loud as they could, so between that and having your door banged on, there was no hope of actually sleeping.\nStephen Mason: The thing I loved about cut was the raw physicality of it. I don’t know if you’ve ever chopped down a tree with an ax, but it’s not easy. I remember one tree that took us an entire day to cut down. It required the power of thirty men to move it.\nDerek Woodley, class of 2003, was a political science major and a cadet in the Corps. An Air Force captain, he is stationed at Goodfellow Air Force Base, in San Angelo, where he is an intelligence instructor. Only brownpots were allowed to use anything mechanized. Everybody else had to use axes and saws and do everything by hand.\nAaron Horn: We’re Aggies, so we do things the hard way. Those blisters on your hands were a badge of honor.\nSteve Christopherson, class of 2002, was a mechanical engineering technology major. He is a construction engineer in Beaumont. You could have paid a professional company to do what we did. They could have come in with heavy equipment and cut the trees down and then stacked them up with cranes and hydraulic equipment. But that wasn’t the point. The whole purpose of Bonfire was to all work together and do something great.\nDoug Keegan, class of 1999, was an applied mathematics major. He is a software engineer and lives in Austin. About ten people would take turns swinging on a tree, trying to kill it. At the risk of offending environmentalists, I should explain that that’s what we called it: killing trees. When that tree started to drop, someone would yell, “Headache!” Everyone would stand back, and when it fell, there was a lot of celebratory whooping.\nSteve Christopherson: At the end of the day, you could see what you had accomplished and be proud of the work you had done. It was work that you simply could not do by yourself. You could not pick up a 2,500-pound log and load it onto a truck on your own. As a group, we were able to accomplish things that no individual could ever dream of doing.\nChip Thiel: You would be surprised at how many people had never swung an ax in their life.\nJames Brown: We had accidents. Before I was at A&M, we had a fatality; a kid got run over by a tractor [in 1981]. But for the most part, it was pretty benign: sprains, cuts, things like that. I mean, there was something every week. A log rolled over someone’s leg or a guy stuck an ax in his foot. Eight stitches later, he would be limping back to class.\nHolly Rotenberry, class of 2002, was a speech communication major. She lives in Houston, where she works for a technology company. By the end of the day, we were covered in dust and dirt and sweat. My hands looked like hamburger meat.\nKevin Jackson, class of 2003, was a poultry science major. He is a first lieutenant in the Army’s 10th Mountain Division and is currently serving in Iraq. Your “grodes” were your work clothes, and you didn’t wash them for the entire Bonfire season. They stunk pretty bad, but you took pride in how rank they were. Grodes showed your dedication.\nAustin Townsend, class of 2001, was a construction science major, a cadet in the Corps, and a redpot. He is a project manager at a construction company in Houston. In the Corps, you washed your work clothes. You kept your hair very short, and you stayed clean-shaven. We used to call the non-regs [students not in the Corps] “dirty hippies,” because some of them would grow their beards out and dye their hair crazy colors during Bonfire season.\nThomas Kilgore, class of 2001, was an agricultural development major, a cadet in the Corps, and a center-pole pot. He is a cable operations technician in College Station. Everybody had to wear a pot. Some of my buddies got them from their older brothers, but I got mine from the local military depot store. People painted slogans on them.\nMike Rusek: A favorite line on everybody’s pot was “BTHOB,” for “Build the Hell Outta Bonfire.” Or “Tuck Fexas”—that was very popular. Yeah, any bit of sophomoric humor that you can think of was carried on out there, from wrestling in the mud to telling fish [freshmen], “Hey, go find me a left-handed ax.”\nWes Johnson, class of 2002, majored in architecture and construction science and was a cadet in the Corps. He lives in Midland and works for a car rental company. Fish were required to wear a “virgin stripe.” It was a piece of white athletic tape around your leg to show you were a Bonfire virgin.\nChip Thiel: The day of “First Sergeant Cut” always got a big turnout. Freshmen in the Corps got to strip their first sergeant—unless their outfit was integrated [with women], in which case he got stripped down to his underwear. Then he had to cut down a tree they picked out for him. The freshmen would be enjoying themselves because they didn’t know what was coming. Their first sergeant would start cutting down the tree and then he’d say, “Y’all think this is funny? Start doing push-ups.” And for the next hour, they would get smoked: push-ups, sit-ups, the whole nine yards. The joke was on them.\nErica Alcala, class of 2003, was a general studies major. She is the general manager of a bar in College Station. The guys got picked on a lot more than the girls. We had it easier. We were given the smaller trees to cut down—the “estrogen logs.”\nMandy Nakai Lucke, class of 2003, was an aerospace engineering major. She is an aerospace engineer and lives in Fort Worth. Girls weren’t in any of the senior leadership positions, but they did have some special responsibilities. The pinkpots were in charge of coordinating and providing all the food and water for cut. They brought water and sandwiches around to everyone.\nJacqui Martinez Kellogg: There was definitely a hierarchy and different roles for the guys and the girls. But it was cool trying to be one of the stronger girls. We poked fun at the girls who sat on the sidelines, fixing their makeup instead of getting out there and working hard. I liked the competitive nature of it. The guys were bigger, stronger, faster. But I’d tell myself, “I’m going to get out there and match the guys swing for swing.”\nThomas Kilgore: When cut was over, a couple of us went to Lufkin and picked up the center pole. It was actually two Southern yellow pines that we spliced together. We brought it back to College Station in a semi, and everybody was so excited because we were itching to get started.\nMike Rusek: We drove those logs right up University Drive, past the Dixie Chicken, honking the horn on that truck and raising all kinds of hell. It was time to build Bonfire.\n“There was no instruction manual . . .”\nBonfire construction began in early November on the campus polo fields. Once the center pole had been erected, students started filling in logs around it, binding them together with baling wire. The goal was to build six tiers, each stacked on top of the other, like a wedding cake. Students worked all-night shifts during the last two weeks of construction, called “push.”\nAaron Horn: We were just kids, and we were running a major construction project, with thousands of lives and millions of dollars of equipment on the line. That was my education right there.\nCindy Lawson was A&M’s executive director of university relations from 1999 to 2005. She is now the assistant to the chancellor for marketing and communications at the University of North Carolina–Wilmington. Anybody outside of A&M would have said, “Are these people crazy? How can you let students be in charge of a project of this magnitude?” But one of the things A&M is known for is the tremendous leadership opportunities it gives students. It’s all part of “the other education,” the learning experience outside of the classroom that A&M emphasizes.\nLarry Grosse was a professor in A&M’s construction science department from 1981 to 1996 and served as its department head for his last four years. Now retired, he lives in Fort Collins, Colorado. Bonfire was a great learning tool. Students got to oversee a true construction project. They had a budget, workers, materials, and a timetable that they had to stick to. Obviously Bonfire had to be finished before the game.\nMike Rusek: The joke was that we were all majoring in Bonfire. I learned a lot more out there than I did in class. My grades probably reflect that too.\nAaron Horn: When you first came onto the polo fields, stack looked like an anthill. A hundred different tasks were being done at the same time.\nPaul “Alex” Jones, class of 2003, was a civil engineering major. He is a construction engineer in Las Vegas. We would get nine or ten guys around a log, put it on our shoulders, and walk it fifty feet or so to stack. From there, a crane would pick it up and set it in place. It was wired in by a team of two guys—one standing at the base of the log and the other sitting in a swing above him. It was all very carefully choreographed by the redpots.\nDoug Keegan: Up on stack, you could hear the dull hum of the crane engines and redpots’ voices echoing upward: “I need a log!” “Wire, wire, wire!” “If it ain’t tight, it ain’t right!” Looking out, you could see the little perimeter fires burning where students who didn’t have pots gathered to warm up and visit and watch Bonfire being built.\nStephen Mason: It was this wonderful, nocturnal world that existed for only a few weeks in November.\nChad Hutchinson, class of 2002, was an industrial distribution major. He lives in Spring and is a manufacturer’s representative. There was always music playing out there—mostly rock and old country. Johnny Cash’s “Ring of Fire” was our favorite.\nAaron Horn: The redpots walked around with ax handles, prying on logs, making sure the wiring was tight. We told stories and cracked jokes and kept people motivated. The idea was to have fun, but not too much fun. We had to do the job right.\nMark Ferrell: We had this old rodeo-style PA that we would use. My favorite thing to do on the PA was pretend I was reading from Playboy. I’d say, “Okay, guys. The Playmate of the Month is Amber. She’s five feet ten, blond, and she’s from Alabama. Amber’s likes are guys who smell like diesel and sweat, whose clothes are covered in bark, and who wear pliers on their pants. Her turnoffs are teasips and guys from Austin.”\nKevin Jackson: Stack was not a place to take the family. It was loud and rowdy and vulgar. We would call each other names and yell at each other to hurry up and cuss each other out. When I was up on stack, I said whatever I wanted, because I was untouchable. Sometimes I’d think, “Man, when I get down, someone’s going to kick my ass.”\nChip Thiel: If we caught people with alcohol, we would confiscate it and send them home. One of the ancillary benefits of being over 21 and a brownpot was that we were the ones who did the confiscating. We didn’t pour it out; we stuck it in our trucks. So it was in my best interest to catch guys drinking because then their alcohol went into my toolbox for later.\nCollin Zacek, class of 2002, was a business administration major and a cadet in the Corps. He is a mortgage banker and lives in Rockwall. There was a small group that drank a little too much and shouldn’t have been out there. It wasn’t the majority. Drinking wasn’t something that most of us did out there. Still, it shouldn’t be ignored, because it definitely happened.\nLuigi Angelucci, class of 2003, majored in construction management. He lives in San Francisco, where he is a project engineer. If there is one feature that modern-day construction and Bonfire do share, it’s that Bonfire was, on the whole, a sober activity. But that’s where the similarities end. There really were no safety measures. Climbing stack, we weren’t tied off to anything. Our only protective gear was our Army surplus helmets. We were building a structure out of five thousand trees that had no engineering to it at all.\nStephen Mason: Bonfire had evolved incrementally from a trash fire in 1909 to a much larger and complex structure over the next nine decades. No one ever sat down and said, “We’re going to build a seventy-foot structure. How should we do that?” We just did what we had always done. We never stepped back and said, “This is really different from what we initially conceptualized.” It had always worked, so there was never an imperative to change. Because we burned it, its structural integrity was never analyzed with the same rigor as, say, the integrity of a seven-story building.\nAaron Horn: There was no instruction manual for building Bonfire—no written plan, no drawings, no specifications.\nLarry Grosse: Each year, a new group of students would be in charge of Bonfire. The building plans were passed down by word of mouth, from one generation of redpots to the next. So each year, the structure changed a little bit, with different interpretations.\nSteve Christopherson: What we came to realize later was that each deviation compounded the last deviation, and that made Bonfire incrementally more dangerous.\nTeddy Hirsch, class of 1952, earned bachelor’s, master’s, and doctorate degrees in civil engineering from A&M and served on the faculty from 1956 to 1995. For 25 years, he was the head of the university’s structural engineering department. Over the decades, Bonfire became more and more vertical. When the first all-log Bonfire was built, in 1945, it had a tepee shape. So the logs didn’t stand straight up; they leaned in at an angle of about 30 degrees from the vertical, which made the structure very rigid. After the wedding cake design was introduced, in the seventies, the logs leaned in at angles that gradually became steeper and steeper. By ’99, the logs were standing almost vertical—they were leaning at angles varying from only 2 to 5 degrees—which was totally unstable. Imagine trying to get a handful of pencils to stand on end and you can see the problem.\nTravis Johnson: When you’re twenty years old, you think you’re ten feet tall and bulletproof. We thought we knew it all. Having now worked in construction for eight years, I’m painfully aware that there was a lot we didn’t know. We were hardheaded, and that’s kind of the culture of A&M, I guess—good and bad.\nLarry Grosse: Most of the redpots were not construction management students and did not understand the requirements of building a structure that was often 85 or 90 feet tall. Throughout the eighties and early nineties, I worked with them to develop improvements that would strengthen the design, like interlocking the logs on different tiers and cinching up stack with a cable. From what I understand, those practices fell by the wayside not long after I left A&M. Students who didn’t understand their significance simply stopped doing them. By ’99 the only thing holding those logs up was baling wire.\n“I was standing on top of the world . . . ”\nOn November 18, 1999, the monumental task of building Bonfire was almost complete. It was scheduled to burn one week later, and students planned to work through the night to finish it in time. Some wired logs together at the base; others sat higher up, in makeshift swings suspended from the structure’s center pole, guiding logs into place. Four of its six tiers had been built, making “fourth stack” its apex and the most enviable position. The unfinished structure stood 59 feet high.\nLucas Gregory, class of 2003, majored in agricultural systems management and was a cadet in the Corps. He is the project manager for A&M’s Texas Water Resources Institute and lives in Bryan. At midnight, when our shift began, the redpots drew a line in the ground, and they made all the freshmen and whoever else wanted to work on Bonfire line up behind it. Then they hollered, “Go!” and everyone started running. We had to scale stack as fast as we could.\nChip Thiel: You had to compete to get all the way up to fourth stack. You raced up there for bragging rights.\nJeremy Carpenter, class of 2002, was an agricultural development major and a cadet in the Corps. He is an account representative for an industrial supply company and lives in Santa Fe. You climbed hand over hand, straight up, and before you knew it, you were thirty or forty feet in the air. There was no safety harness or anything to keep you from falling, so it was scary. But once you were up there, it was a beautiful sight to behold.\nCash Donahoe: I remember how peaceful it was up there that night. Stack was lit up with floodlights, but beyond that circle of light, campus was asleep. It was dark, but you could see the whole town spread out below you.\nWilliam Lyckman, class of 2002, was a food science and technology major and a cadet in the Corps. An Army captain, he commands a company of combat engineers stationed in Schweinfurt, Germany. I did notice that there was something different than the ’98 Bonfire. In the past, once the stack reached a certain diameter, we would put two cables all the way around the first stack to ensure it was tight: one around the bottom of the stack and one around the top. That night I noticed there were no cables.\nPaul “Alex” Jones: It seemed like one side of stack was being built out faster. Standing on top of first stack, I noticed there was more walking room on one side than on the other.\nCollin Zacek: We had joked about how stack looked a little crooked and how we hoped it wasn’t going to fall down. We joked about it the year before too. We never thought it was going to actually happen.\nChip Thiel: I was one of those guys who was out there every day, working on Bonfire. I would not have stood on top of it if I didn’t believe it was safe.\nHolly Rotenberry: I’ve always been terrified of heights, but that night, I climbed up on top of stack. I figured that you shouldn’t go through life being scared of things.\nLeslie Graham Kirk, class of 2002, majored in geology. She is a geologist in Corpus Christi. I wanted to be as high up as possible so I could see the meteor shower.\nDerek Woodley: Tim Kerlee and I raced to the top to get a spot. We had decided ahead of time that we were going to climb to the highest stack. He got in the swing on fourth stack, and I stood below him, working as the ground man. We were a team. About ten minutes before the collapse, I told Tim that I wanted to try the swing, and he graciously got down and let me up there.\nThomas Kilgore: Sometime after two a.m., I was walking around stack, checking everybody’s work. Usually I never slowed down, but I remember stopping on the west side for a minute—close enough that I could touch it. I took a few steps back to admire it. We were getting pretty close to finishing, so it was big. I looked up, took a deep breath, and thought, “Wow, this is so beautiful.” And that’s when it happened.\nChip Thiel: I was standing on top of the world—perched on fourth stack with three of my dearest friends—when stack started to sway.\nDerek Woodley: I felt my swing sink a foot or two in the air. There was a loud snap, and then a god-awful cracking sound as the whole thing began to collapse.\nTravis Johnson: I heard a horrible noise, and when I turned around, I saw it all come down. It was just horrendous, like something out of a bad dream.\nCash Donahoe: The whole thing shook, like a jolt had gone through it. Next thing I knew, I was falling backward. The world dropped out from underneath me.\nEthan McDaniel: It was probably the worst sound I have ever heard in my life; it was this giant pop, crack—like an enormous branch had been broken. That was the sound of the center pole splitting apart.\nChad Hutchinson: All I remember is the sensation of falling.\nChip Thiel: Suddenly, in some unforeseeable twist of fate, my life changed, and the life of every Aggie who came before and after me changed. Texas A&M changed.\n“Inside that cloud of dust, it felt just like hell.”\nApproximately sixty Aggies were working on stack when it collapsed, at 2:42 a.m.\nJim Daniel, class of 2003, was a journalism major and a cadet in the Corps. A captain in the Air Force, he is stationed with the 116th Air Control Wing at Robins Air Force Base, in Georgia. The collapse kicked up an incredible amount of dust. Inside that cloud of dust, it felt just like hell. There was blood, broken people screaming, and chaos.\nPaul “Alex” Jones: The lights had been knocked out, so it was hard to see. There was just an eerie, dusty haze. It sounded like what you might hear after a battle—groans and different sounds of people in pain.\nLeslie Graham Kirk: I remember one of the redpots screaming—he sounded so terrified—“Medic, medic! Oh, my God, we need medics!”\nCollin Zacek: It took about a minute for your eyes to adjust. It was total chaos. In the distance, I could hear sirens.\nCash Donahoe: When the dust settled, I realized that I was lying on my back looking up at the sky. I did a self-check. “Can I move? Am I bleeding?” I could see the center pole exposed. Stack had split open, and I had tumbled into a crevice between the second and third stacks. That was one of those really serene, freaky moments, when I realized that this thing—this huge structure—had just collapsed underneath me.\nHolly Rotenberry: Apparently I jumped off of stack, though I have no memory of it. I landed on the ground, where I was crouched inside this perfect little cave of logs. The logs had fallen all around me—one lay right above my head, and others were on either side of me—but none of them were touching me. I lay down on my stomach and crawled out. If I hadn’t been a Christian already, that would have made me a believer.\nJeremy Carpenter: We could see people, right there, trapped underneath the logs. We could hear them screaming. And there was nothing we could do. Those logs—some of them had taken fifty or sixty guys to move—were all wired together. We couldn’t just get in there and pull logs off of people. It was the most helpless I’ve ever felt in my life.\nMike Rusek: I was looking for people who needed help when I came across two friends who had died. I had literally eaten dinner with them just a few hours before. When I saw them, time stood still.\nBrittny Allison, class of 2002, was an environmental design major and a cadet in the Corps. She is the superintendent for a general contractor in Houston. The dorms and Corps outfits lined up to do head counts. It only took a short amount of time to know that everyone could not be accounted for.\nJon Egenes, class of 2002, was a telecommunications engineering technology major and the medic-in-charge on the night of the collapse. He lives in Kent, Washington, where he is a network engineer. It was the student medics—there were six of us, including myself—who triaged everyone. We made our way around stack assigning color-coded tags: green, yellow, red, or black. Green was given to the walking wounded. Yellow was more serious. Red was urgent. And black—well, I think that one is self-explanatory.\nJames Brown: An officer stopped me when I approached the scene, and I told him that I was a medic. He said, “Please get in there.” I could tell from his voice that it was much worse than I had thought. The first thing I walked up on was three bodies.\nCollin Zacek: Our unit kneeled together, and we all broke down. After a few minutes of that, we realized we had to do something. We were going to need a lot more people if we were going to take stack apart and save whoever was left to save. So we all started running back to the Corps dorm to wake everybody up.\nEthan McDaniel: It was only about three quarters of a mile, but that run seemed like it lasted forever. We were running through campus in the dark, in our combat boots and pots, and I remember feeling weighted down, like I couldn’t get there fast enough.\nWill Hurd, class of 1999, was a computer science major and the student body president. A former CIA officer, he lives in San Antonio, where he is considering a run for Congress. There was some tension between the students and the emergency personnel who responded to the incident. The professionals were cautioning everybody that stack was an unstable structure that needed to be taken apart piece by piece. And then there were students who just wanted to rush in there and pull all the logs off and save their friends.\nAustin Townsend: It was a one-log-at-a-time Jenga puzzle. How do you remove the logs and not cause stack to collapse? The rescue effort seemed painstakingly slow.\nJames Brown: I was assigned to a kid who was trapped inside stack. I remember I was pretty freaked out because the only thing that was keeping this kid from being crushed by a log was the body of the kid next to him. We had to wait for the fire department to bring an airbag to lift a log off of him, and that took a couple of hours. All I could do was give him oxygen and try to keep his airway open. He was drifting in and out of consciousness, but at one point we started talking. I joked with him, “After this is all over, we’re going to go have some beers at the Chicken.” I said it more for myself than for him. I needed to believe he was going to make it.\nStephen Mason: Some of us were put to work pulling logs off stack. Nobody was using heavy equipment because the search-and-rescue experts were afraid that it would destabilize the structure. So what we did was literally the inverse of building stack. We grabbed logs, pulled them off, carried them out—and then, eventually, we got to a body. That was horrible, because we were too late. I remember thinking that if I had just worked a little harder, or a little faster, maybe I could have saved that guy’s life.\nThomas Kilgore: A couple of buddies and I helped carry the deceased off of stack. A makeshift morgue had been set up; medical crews had cordoned off an area with school buses and hung some sheets between them. I wish I hadn’t gone in there. But I guess we felt like it was our responsibility. These were our friends, and this had happened on our watch.\nDerek Woodley: When I woke up, I was lying on stack, about fifteen feet off the ground, and someone was untangling me from my swing. My left wrist and my right ankle were broken, and I thought I had broken my back because the pain was so intense. I kept asking everyone about Tim. “Where’s Tim? Is he okay?” No one would tell me anything.\nJim Daniel: I didn’t know Tim Kerlee, but I knew with one look, seeing him twisted as he was, that he wasn’t going to make it.\nCollin Zacek: I will never forget Tim Kerlee. He was up on stack, trapped under a pile of logs, but every time one of us approached him to help, he would turn us away. He would say, “I can see so-and-so over there. Go help him. He needs the help. Don’t worry about me.”\nJames Brown: When you look down the line, I think he was probably the biggest hero of the night. Without a doubt, he saved a couple of people’s lives. He was up high enough that he could spot people who were injured. I mean, you’ve got to imagine—it’s dark and dust is coming off the ground and we could barely see, but he helped direct us to people.\nCarrie Lunceford, class of 2002, was a psychology major and a student medic. She is an academic adviser at the University of Texas at San Antonio. It was a while before the fire department was able to extricate Tim and get him to a hospital. I reached up and held his hand. He squeezed my hand strong, and I made sure he was always squeezing my hand strong. We prayed together, and I prayed for angels.\nChip Thiel: All three of my buddies who had been standing with me on fourth stack were thrown to the ground. They fell one way, and I fell the other. I had seen a rope and jumped for it, and that’s what saved my life. Long story short, one’s buried in Austin, one’s buried in Fort Worth, and one’s buried in California.\nJames Brown: Sometime after dawn, the rescue team dropped microphones—the kind that are used in confined-space rescues and mining accidents—down into stack to determine if anyone was still alive. We were told that we needed to stay perfectly quiet while this was done, and I remember the incredible silence that fell over that whole place.\nAustin Townsend: The football team came out to help that day. We were worn-out and emotionally fried—and then we saw our team. They had a game to play in a few days, but there they were, ready to help. They seemed to just throw those logs over their shoulders. That was an amazing sight, one bright spot within the darkness.\nCindy Lawson: I remember when it hit me. We were waiting for the last body to be pulled out, and the dust in the air made everything look surreal. I was sitting on top of a police car, trying to make sense of it all. I wasn’t cursing God, but I was questioning him: “Why must there be so much pain? Why one kid and not the other? How do you make these choices?” Later, when I struggled with those questions, I thought of the Book of Hebrews: “Faith is the substance of things hoped for, the evidence of things not seen.” We are not going to understand this until we get to the other side.\n“The whole campus was in the wake of a big funeral procession.”\nTwenty-seven students were injured in the collapse. Forty-two hours after the accident, Tim Kerlee, who was seventeen years old, became the twelfth, and last, student to die. The number resonated with the Aggie community because of the long-standing Twelfth Man tradition, which began with E. King Gill, a student who suited up and stood ready to help his team during a hard-fought football game in 1922. Ever since then Aggies have stood for the duration of their football games to show their willingness to support the eleven players on the field.\nCollin Zacek: Tim lived long enough for his parents to fly in from Tennessee to say goodbye.\nJanice Kerlee, Tim’s mother, left behind a teaching job in Tennessee to volunteer at a campus ministry in College Station after her son’s death. She is now the pastor of Lissie United Methodist Church, in Lissie. Most of his squadron and close friends stayed at the hospital. They brought sleeping bags with them and slept on the floor. They did not leave him. Finally the doctor said, “Let anybody in who wants to see him,” because he knew Tim wasn’t going to make it.\nRick Perry: The significance of the number twelve was not lost on Aggies.\nAaron Horn: I think “eerie” is the word. You know, twelve means so much to this school, and then Bonfire meant so much, and by God, twelve kids died.\nDerek Woodley: I always tried to figure out why Tim hadn’t made it and I had.\nChip Thiel: I struggled with survivor’s guilt. I wondered, “Why them? Why not me?” Man, that can eat you up. But what I always come back to is this: I’m a Christian, and when God wants me, he will take me. Everyone reacts to situations differently, but mine was simple, you know? Can’t change it. Move forward. Keep moving forward.\nPaul “Alex” Jones: There was a gray feeling over campus, like the whole campus was in the wake of a big funeral procession.\nMark Ferrell: We were a band of brothers, the Bonfire leaders. When we were grieving and struggling to understand how this had happened, we didn’t say much to each other. I could know the heart of another guy just by looking at him. He could look at me and know the pain I was in. Bottom line, we knew that what had happened was our responsibility. It was nobody’s fault—it was an accident—but it was our responsibility.\nRay Bowen: The soul-searching started on the day that Bonfire fell, and it continues today. Our engineering college is right across the street from where Bonfire was built. Probably a hundred engineering professors were a rock’s throw away from the thing every day. What did we not see that we should have seen? That’s been the torture for everyone ever since.\nDoug Keegan: Everyone was trying to figure out what had happened. Had stack been leaning? Was center pole a bad piece of wood? Did a crane hit stack? Was one side built out more than the other? Was the ground uneven? Had anything changed from previous years?\nMike Rusek: There was tons of speculation, and unfortunately for me, I was the first guy to get thrown under the proverbial bus. I operated one of the cranes, and a story came out in the paper that a crane had hit stack and that that might have been responsible for the collapse. That was later disproven, but for a while, the fingers were pointing at me. It wasn’t enough that I had lost my friends. I was basically being accused of killing them.\nTravis Johnson: My eye twitched for a year after the collapse. I had nightmares. People didn’t know what to say to me, and I wouldn’t have known what to say either.\nStephen Mason: The trajectories of people’s lives and the way they looked at the world were altered by what happened. We all came out permanently bent in one way or another.\nRichard West is the father of Nathan Scott West, a sophomore in the Corps who died in the collapse. He is an architect and lives in Bellaire. Before Scott’s funeral, an Aggie showed up—someone we didn’t know—and gave us his own pair of senior boots. He said, “No Aggie should have to be buried without his senior boots.” He was totally anonymous, and he wanted it to stay that way.\nSylvia Grider was on the faculty of the anthropology department from 1988 to 2007. She cataloged the thousands of mementos that people left at the Bonfire site. She is retired and lives in Bryan. Thousands of visitors went to the site and left behind everything imaginable: Bibles, rosaries, Aggie boots, hand-drawn pictures of Bonfire, poems and messages. There were these little stacks of folded-up clothing that the students called grodes, which they carefully laid out next to their pots and their work boots. They left behind axes, ax handles, and wire cutters. A twelve-pack of Pearl beer. After graduation, someone left a diploma. Someone else left a cap and gown. As many as fifty people left their senior rings at the base of the flagpole.\nJames Brown: Stack fell on a Thursday, and the football game took place the following Friday, at Kyle Field. The night before the game, we had a candlelight vigil in place of Bonfire. Now, I’m not the most religious person, but I remember praying: “You know what, God? We could really use this win.” It was a silly thing, I guess, but it wasn’t about a football game. It was about healing.\nChip Thiel: My leg was shattered in sixteen different places, and my ankle and the bone just below my knee were broken. I had broken ribs and a punctured lung. I was just beat to hell. But I was not going to miss that game.\nHolly Rotenberry: I was on crutches, but I stood for the whole game.\nChris Valletta, class of 2000, was a speech communication–rhetorical theory major and an offensive lineman for the 1999–2000 season. A former NFL player, he is now an entrepreneur in New York City. Before the game, some of the other players and I wrote the names of the students who had died on our jerseys. Coach R.â€†C. Slocum told us, “Guys, you know what you’re playing for.” I understood that to mean that we were playing for something much greater than another win. For eternity this game would be remembered.\nRandy McCown, class of 1999, was an agricultural development major and A&M’s quarterback for the 1999 season. He owns a pallet and lumber company in Jacksonville. We were the underdogs, but I remember having this calmness, this sureness, that we were going to win.\nThomas Kilgore: We were behind at halftime, 16–6. Up until then, I was the typical A&M guy who hated Texas. But I will never forget halftime. The Longhorn band played “Amazing Grace” and raised A&M’s flag. I mean, we have a huge rivalry, so I never, ever thought that would happen. Then they played taps and took off their hats. The amount of respect they showed was extraordinary. There wasn’t a dry eye in the place.\nRandy McCown: [Wide receiver] Matt Bumgardner was my roommate, and whenever we couldn’t sleep, we would stay up talking, running plays. Bum would say, “If you ever get in trouble, just throw it up and I’ll get it.” I thought of that when we were down three points in the fourth quarter, with five minutes left on the clock. I threw it up, and sure enough, he caught it.\nChris Valletta: I remember Matt going up for it. It was like I was watching him in slow motion. I saw him leave his feet, and the ball was in the air, and I knew for a fact that he would catch the ball.\nJames Brown: Matt Bumgardner caught the ball in the end zone, and then Brian Gamble recovered that fumble at the end of the game, and then it was over.\nLeslie Graham Kirk: There was absolute pandemonium when we won. Everyone was crying.\nPaul “Alex” Jones: That revived our spirit, like a jump start to the heart.\n“A&M is less of a school without it.”\nSix months after the collapse, a five-member commission created by the university to study the incident issued its report. The commission identified two core structural problems that contributed to the collapse—“excessive internal stresses” and “weakened containment strength”—as well as a “cultural bias” at A&M that fostered “tunnel vision” about Bonfire’s risks. “The collapse was about physical failures, driven by organizational failures, whose origins span decades of administrations, faculty, and students,” stated commission member Veronica Kastrin Callaghan. “No single factor can explain the collapse, just as no single change will ensure that a tragedy like this never happens again.”\nBonfire was not held in 2000 and in 2001. In 2002, after two years of review, the administration determined that the cost of constructing Bonfire with the proper oversight and liability insurance could run as high as $2.5 million. Before Dr. Bowen stepped down as president that year, he canceled that fall’s Bonfire, and his successors have declined to reinstate the tradition. In response to Bowen’s decision, some Aggies began an off-campus bonfire, called Student Bonfire, which the university does not condone. It continues to this day.\nRay Bowen: After I announced that Bonfire would not be held in 2002, about three hundred students marched on the president’s home. Everyone was very polite. They stayed on the sidewalk and the big circle driveway so they would not damage the grass, which is a very typical Aggie way of dealing with conflict. I came outside and spoke with them, and no one raised their voice, although one student did say that he didn’t think I was really an Aggie. I told them that I wore the same Aggie ring as they did and that I had the same passion for A&M’s history and traditions. I talked about the last time that students marched on the president’s home, which was when [former A&M president James Earl] Rudder announced that women would be admitted to the university. I explained how that decision had transformed A&M for the good and that I hoped, someday, they would look at my decision as good for A&M too.\nJim Daniel: A&M is irrevocably changed without Bonfire. No tradition on campus defined A&M as much as Bonfire did. No tradition was as central to the spirit and heart of Aggieland, and A&M is less of a school without it.\nWesley Capps, class of 2001, was a psychology major and student medic. He is earning a master’s of divinity at the Pacific Church of Religion, in Berkeley, California. When I visit campus, I don’t get greeted with “howdy” anymore. The crowds at Midnight Yell aren’t as large. People don’t remove their hats during yells and the “War Hymn.” A lot of traditions aren’t as strong as they were.\nJim Daniel: The great unanswered question is, Is Bonfire worth the lives of A&M’s students? If so, how many? One? Three? Twelve? We talk about this all the time in my Professional Military Education courses. What is worth going to war over? One man? Twenty? One thousand? It always comes down to the fact that you go to war over the principle, not the circumstances. To me, the analogy fits. Bonfire is worth it because of what you become through the process of building it. It’s worth it because it makes Aggies and it defines Aggieland. Not everything about Bonfire is bright and shiny and deserves to see the light of day. A lot of it is really gross and disgusting. But what it accomplishes for the students and for the school—there is no reproducing that. It is what makes A&M unique, and I think it is certainly worth whatever it takes to make it happen.\nThomas Kilgore: I was on the Student Leadership and Participation Committee—the committee to bring back Bonfire—and we were told that the only way we could bring Bonfire back was if we hired a construction company to go out and cut the wood. Then a trucking company would move the logs. And then another company would stack it.\nMike Rusek: What the administration proposed was basically the equivalent of parents doing their kid’s science fair project. It took every bit of the learning out of it.\nMark Ferrell: Bonfire was offensive to a lot of people. We stunk. We talked rough. We didn’t exactly fit in with the idea of a learned university. I think the administration was glad to finally have a reason to get rid of Bonfire.\nSteve Christopherson: Bonfire didn’t contribute to the image that A&M wanted to have of a serious, top-tier university. Dr. Bowen had started Vision 2020, whose goal was to make A&M one of the top ten public universities by the year 2020. That sounds wonderful, but how do you define a top ten university? It all depends on the metrics that you judge A&M on. If the metrics were about student loyalty—well, ten years ago, I guarantee you that there weren’t ten universities out there that would have beat A&M.\nDarrell Keith is a trial attorney in Fort Worth. He represents the parents of three students who were killed in the Bonfire collapse and two students who were injured and has won settlements against A&M and the redpots. Bonfire was a great tradition. My clients don’t oppose the restoration of Bonfire, provided that the student leaders and workers are given the appropriate professional engineering and architectural guidance. What we don’t want is a return to a fatally defective Bonfire, where arrogance and ignorance are substituted for safe design and construction practices.\nRay Bowen: I was heartsick when I made the announcement about Bonfire, because I wanted it to return to campus. But my thinking has changed since then. After reading the depositions that Bonfire’s student leaders gave in 2004, I became aware that the behavioral issues associated with Bonfire were much worse than we had ever realized. That is a pretty devastating record. Since then, I’ve felt that it would be a serious mistake to bring Bonfire back.\nRick Perry: It’s really going to be interesting when Bonfire is reintroduced on the campus again, and it will be. I will not be surprised if it happens by 2011, maybe even 2010. I think Bonfire will be back on campus. The kids will have the experience again. I’d leave that up to the board and the current administration to sit down and decide the safety parameters, the oversight, et cetera. They are very capable men and women, and I trust their judgment.\nWesley Capps: I used to be gung ho about bringing Bonfire back, but now, with some distance, I’m less inclined. Is Bonfire really the only unifying experience that can strengthen the A&M community? This is the minister coming out in me, but I wish that the same energy and focus that went into Bonfire could be put toward expanding other amazing projects that A&M students do.\nRay Bowen: Students have the power to create an alternate tradition. A Habitat for Humanity program—where students would build fifteen or twenty shell homes—would require just the same blood, sweat, and tears.\nLeslie Graham Kirk: I felt a lot of anger when people would talk about Student Bonfire, because it seemed so silly. I mean, people had lost their lives. Miranda [Adams] was only nineteen years old. She never got to graduate, she never got to have a wedding, she never got to have children. Bonfire was a great thing, but it had flaws. The flaws ultimately were too great, and people died for it.\nMandy Nakai Lucke: As I have hit each milestone in my life, I have always thought, “Miranda never got to do this.”\nHolly Rotenberry: For weeks after Bonfire fell, I didn’t sleep for more than 45 minutes at a time. Years went by, and I still had nightmares. I can honestly say that this experience changed my life forever. It made me want to be better, you know? For some reason, I was spared—so I had better do something with this life that I was given.\nMark Ferrell: There’s no point in bringing Bonfire back, because it will never be the same. And it shouldn’t be—twelve people died. The good old days are gone. You know, as neat as a ’55 Cadillac might look, it gets five miles to the gallon. It’s not the best idea anymore. Everything has its time and season, and the season for Bonfire has passed.\nThomas Kilgore: Whenever the weather turns colder and I step outside and feel that crisp fall air for the first time, all the memories—good and bad—come flooding back.\nChip Thiel: I still walk with a limp. Every step I take, I feel the pain. But it helps to put life in perspective. Sometimes I’ll think, “Man, that really hurts.” And then I’ll say to myself, “So? You’re alive.” Every time my left foot hits the ground, I feel it. Every step.",
  "word_count": 9962,
  "scraped_at": "2026-02-14T12:08:57.436597"
}