{
  "article_id": "b27df0b82c08",
  "url": "https://awfulannouncing.com/the-cw/pac-12-full-details-new-media-deal.html",
  "title": "Pac - 12 reveals full details of new media deal with The CW",
  "date": "20250828T003000Z",
  "domain": "awfulannouncing.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The full media rights picture for the new-look Pac-12 Conference is clearing up.\nOn Wednesday, the Pac-12 announced the full details of its new media rights agreement with The CW, which will take effect during the 2026-27 football season, coinciding with the addition of seven new conference members. The deal will run through the 2030-31 season. No financial details were disclosed.\nAs part of the agreement, The CW will air 13 regular-season Pac-12 football games, amounting to about one per week, in addition to 35 regular-season men’s basketball games, 15 regular-season women’s basketball games, and the semifinals and championship of the women’s basketball tournament.\nThe CW joins CBS, which was previously announced as the Pac-12’s new lead media partner earlier this summer. However, CBS is slated to air just three regular-season football games, three regular-season men’s basketball games, and the championship of the men’s basketball tournament, leaving a significant volume of inventory unaccounted for. CBS Sports’ Brandon Marcello today reported that the CBS deal will also include a maximum of 10 football and 17 men’s basketball games on the CBS Sports Network cable channel.\nAt most, that means 26 Pac-12 football games are accounted for under the new agreements. Given that this amounts to less than half of the conference’s total football inventory beginning next season, it’s safe to say that the Pac-12 will likely find a third media partner to purchase the remaining games.\nNotably, Pac-12 Enterprises, the media and production arm of the conference, will produce all games that air on The CW.\n“Our partnership with The CW has been one of mutual growth and transformation, from the development of our Pac-12 Enterprises’ broadcast production business to the significant added value and positive impact to our current and future members via true national reach across 100% of U.S. television households,” Pac-12 Commissioner Teresa Gould said in a press release.\nThe new deal will guarantee the Pac-12 secures national reach for its most important games for the next five seasons. It also ensures that its top men’s basketball inventory, which will now include Gonzaga games, has a widely accessible home.",
  "word_count": 351,
  "scraped_at": "2026-02-14T14:18:20.147468"
}