{
  "article_id": "b281b170c6ef",
  "url": "https://www.rockmnation.com/2023/11/23/23973263/mizzou-celebrates-jadens-birthday-hoops-win-thanksgiving",
  "title": "Mizzou celebrates Jaden birthday , Hoops win , Thanksgiving",
  "date": "20231123T153000Z",
  "domain": "rockmnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Mizzou celebrates Jaden’s birthday, Hoops win, Thanksgiving\nMizzou Links for Thanksgiving 2023\nFirst things first. Let’s wish a very happy birthday to our beat writer, Jaden Lewis, who had a birthday on Wednesday and spent the evening covering the Mizzou Hoops game. A beat writer’s reporting never stops, y’all. That, and Jaden lives in CoMo so it makes it easier for him to still attend the games during the break, and he’s a lifelong Mizzou fan and says he would have been there regardless.\nSpeaking of Mizzou Hoops... the Tigers played 3⁄4 of a game well against South Carolina State on Wednesday. Here’s some highlights & fun facts. Read the recap at MUTigers.com.\nAnd Thanksgiving... here’s some thankful posts from Mizzou’s various athletic teams.\nWomen’s Hoops has officially arrived in the Sunshine State for the Daytona Beach Classic. They’ll take on Tennessee Tech on Friday and Kent State on Saturday. I expect there will be some Mizzou fans in attendance, as my parents will be there. Watch on FloHoops, if you’re willing to fork over $30.\nAnd finally, to get you in the spirit for Friday’s regular season finale against the Hogs, let’s watch this glorious mini movie.\nAnd that’s all from me, y’all. I finally caught the ‘Vid after all these years and I’m just exhausted. Hope everyone has a great Thanksgiving.\nYesterday at Rock M\n- From Parker: Tigers rally from 16-point deficit and cruise to 82-59 victory over SC State\n- From Nate: LOOK: Shirts and Pants arrive precisely when they mean to. (We think they decided to share the video because Mizzou Hoops was losing big at the time, ha)\n- From Jaden: Live Game Thread and Preview: A rebound opportunity presents itself as Mizzou faces South Carolina State\n- From Sammy: Missouri Football Week 13 Bowl Projections: Where Things Stand Heading Into the Final Weekend of the Regular Season\n- From Matt Harris: Is Mizzou hoops sorting out an identity crisis?\n- From Nate: Arkansas Razorbacks Preview\n- A new BTBS podcast (the last with BK, how sad): I am thankful for Missouri Football and see you again, BK\n- Have you BOUGHT YOUR ROCK M SHIRT WHICH WILL SUPPORT MIZZOU ATHLETES? Head over to 573tees.com to shop. Local pickup available. 50% of proceeds go to Mizzou NIL fund. More designs to come.\nMore Links:\nNewsy stuff\n- St. Louis Post-Dispatch: Mizzou overcomes slow start, big deficit to pull away from South Carolina State (Eli Hoff) | Crowded Missouri roster creates early season challenges for Gates (Jeff Gordon) | How defense is developing for Mizzou men’s basketball through 5 games (Eli Hoff) | Mizzou football shows growth with dramatic win over Florida, men’s hoops raises questions after Jackson State loss: Eye on the Tigers (Hoff & BenFred) | Already part of St. Louis community, Kyle Gibson homes in on his part of Cardinals’ comeback (Derrick Goold)\n- Columbia Tribune: Mizzou overcomes horrid start to handily defeat South Carolina State (Calum McAndrew) | Aidan Shaw shines, sparks game-saving run in Mizzou’s win over SC State (McAndrew)\n- Columbia Missourian: ‘Tiger Kickoff Show’: Florida recap, Arkansas lookahead, Thanksgiving special | Breakout performances fuel Missouri’s comeback against South Carolina State (Christian Riley Dutcher)\n- Saturday Down South: Mizzou to be without key defender against Arkansas, per report (Grant Bricker)\n- MizzouCentral (SI.com FanCentral): Mizzou Men’s Basketball Wins by 23 Over South Carolina State Despite First Half Struggles (Joey Van Zummeren) | “These Guys Want to Dominate Teams”: How a Struggling Mizzou Offensive Line Transformed to a Joe Moore Award Finalist (Van Zummeren)\n- The Maneater: Missouri and Kansas have found a new place to duel: esports (Guilherme Name) | Eli Drinkwitz Preparing for ‘Difficult Challenge’ Against Arkansas Quarterback KJ Jefferson (Hunter de Siver)\n- PowerMizzou: Post game Video: Mizzou 82, South Carolina State 59 | Instant Reaction: Mizzou 82, South Carolina State 59 (Gabe DeArmond) | Mizzou’s comeback not nearly enough to satisfy Dennis Gates (DeArmond) | Four Down Territory (Jarod Hamilton) | Watch Connor McLain’s new Sights & Sounds vs. Florida\nSocial Media Stuff\n- Just one more matchup for Dawn Sullivan’s squad before Selection Sunday.\n- So fun.\n- Highlight video from the Mizzou Invite\n- Love this.\n- Awesome.\n- If you’re looking to sign up for ESPN+, Rock M Nation now has an affiliate link: click Here for ESPN+ Now! (** RockMNation has affiliate partnerships. These do not influence editorial content, though RockMNation may earn commissions for products purchased via affiliate links.**)",
  "word_count": 748,
  "scraped_at": "2026-02-14T14:22:58.951197"
}