{
  "article_id": "b2a06fa94167",
  "url": "https://www.theguardian.com/world/2023/mar/08/wednesday-briefing-first-edition-international-womens-day-key-issues",
  "title": "Wednesday briefing : Five key issues facing women – from misogyny to the  motherhood penalty  | International Women Day",
  "date": "20230308T103000Z",
  "domain": "theguardian.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Good morning.\nInternational Women’s Day is upon us. For the last century, 8 March has been a day to celebrate women’s achievements, to rally around the progress that has been made to achieve gender equality and to bring attention to the mountain of work that still needs to be done to protect women and girls.\nWhile it is hard to ignore the fervent commercialisation of the day, with corporations aggressively pushing contrived gimmicks to get some of that sweet, sweet PR, its roots in socialism and the suffrage movements of the early 20th century expose its more radical origins. And it is with this in mind that many come together, every March, to agitate for gender parity. The past few years have felt particularly fraught for women’s rights – violence against women and girls around the world has increased, the pandemic has intensified gender inequality and decades of progress are threatened as new forms of misogyny find their way into classrooms and online forums.\nToday’s newsletter runs you through a selection of the Guardian’s coverage around women’s issues. That’s right after the headlines.\nFive big stories\n-\nImmigration and asylum | Rishi Sunak’s government has been accused of “extinguishing the right to seek refugee protection in the UK” by the United Nations refugee agency. In an unusually critical statement, the UNHCR said a contentious new law to stop small boats crossing the Channel “would amount to an asylum ban”. Here’s an explainer on the bill’s contents.\n-\nUK news | Olivia Pratt-Korbel, the nine-year-old girl who was shot dead in her home in Liverpool last August, screamed “Mum, I’m scared” before she was hit by a bullet, a court has heard. Thomas Cashman, 34, killed Olivia in a shooting that went “horribly wrong”, a prosecutor told Manchester crown court.\n-\nFrance | More than 1.2m protesters marched in France on Tuesday as rail workers and refinery staff began rolling strikes and trade unions stepped up their campaign to try to stop Emmanuel Macron’s plan to raise the pension age to 64. The action was the sixth such nationwide strike of the year.\n-\nAbortion | Nurses and midwives should be able to approve abortions, MPs have been told, in what would be one of the biggest shake-ups of regulations in more than 55 years. A government-commissioned study calls for the end of a rule saying that abortions have to be authorised by two doctors.\n-\nHealth | In a groundbreaking clinical trial involving 100 women, researchers will assess a potential new treatment for endometriosis. If successful it will be the first non-hormonal, non-surgical treatment for a condition that affects roughly one in 10 women of reproductive age.\nIn depth:\nViolence against women: systemic failings\nEarlier this week, former police officer Wayne Couzens was sentenced to 19 months for three offences of indecent exposure that occurred in the months before he raped and murdered Sarah Everard in 2021. The extra months on his sentence do not change the reality that Couzens will spend the rest of his life behind bars, but the trial has exposed police failures that allowed Couzens to continue acting as a serving police officer with a firearm.\nThe Metropolitan police has apologised for failing to arrest Couzens for his offences, including one that happened a few days before he killed Sarah Everard. But this apology has felt insufficient to many: one of his victims suggested that Everard’s life “could have been saved” had the police acted on the reports. The incident reveals a systemic inability to deal with flashing – in 2021 the Guardian reported that police in England and Wales logged more than 10,000 cases of indecent exposure in the previous year but took fewer than 600 people to court over them.\nDr Jennifer Grant said: “The system reflects our society, which has tended to see indecent exposure as a nuisance offence,” as opposed to a sexual crime. “We know that some men who indecently expose themselves go on to commit further sexual and violent crimes,” Grant adds, pointing to a study from the US that found that 5- 10% of men do escalate to more serious offences.\nFlashing is one facet of a growing problem: John Harris spoke to Laura Bates about online misogyny and revenge porn, and how the so-called “manosphere” has been radicalising boys and young men.\nThe workplace: women pay the ‘motherhood penalty’\nWomen continue to face serious impediments to equality in the workplace, several stories published today suggest. Under current trends, the gender pay gap between men and women will not close until 2044 in the UK, with older women worst affected. Labour will announce today that former Trades Union Congress chief Frances O’Grady will lead a review of how best to accelerate that progress, Pippa Crerar reports.\nOne crucial contributor to the problem is the so-called “motherhood penalty”: data published by consultancy group PwC finds that the gender pay gap widened four times faster in the UK in 2021 than the average across the OECD, primarily because of the specific disadvantages faced by women with children. Alexandra Topping covers a study by academics at the University of Kent which finds that the impact of having children is greater now for university-educated women than it was 40 years ago.\nThat PwC data also shows that childcare costs represent almost one-third of the average family income in the UK, compared with as little as 1% in Germany. For a sense of the impact of that situation, see this piece by Lucy Pasha-Robinson, which is stuffed with alarming figures and reflects her own experience of her daughter’s recent bout of flu: “Patchy earnings, alongside the nursery fees we paid despite her being unable to attend, left us at least £700 in the red – for the second time in three months.”\nMental health: the inevitable toll of the patriarchy\nSome figures suggest that women are more likely to have mental health problems than men: one study by a clinical psychologist at Oxford University found that women are up to 40% more likely than men to develop mental health conditions. But these numbers that seem to show a growing gender disparity in mental health obscure a bigger context, writes Sanah Ahsan today.\n“We are not living through a crisis of chemical imbalances, but of power imbalances,” she says, pointing to a world where women are more likely to experience poverty, as well as sexual and domestic violence. Some of these women are then put through a mental health system that often ignores the patriarchal causes of their suffering and itself has a long history of misogyny. Psychiatric diagnosis can be extremely helpful – but Ahsan invites us to think bigger and begin to “dismantle the systems of oppression that are hurting us”.\nA global strategy\nThe Foreign, Commonwealth and Development Office (FCDO) has launched a global initiative to advance gender equality, support sexual and reproductive health programmes and fund grassroots women’s rights groups, writes Kaamil Ahmed. Advancing gender equality is a noble goal, and on International Women’s Day no less, however critics have called the proposed strategy “meaningless” and said that it simply is not enough. The news also comes on the same day as the start of a parliamentary inquiry that will investigate the impact of the government’s aid funding cuts on women and girls in low-income countries.\nInternational Women’s Day: “Dumbed down into a marketing opportunity”\nWhile IWD remains a crucial means of gathering attention and information around women’s causes, there are real concerns that it has been “captured by commerce”, writes Nilanjana Bhowmick in New Delhi.\nIn this piece, she notes one example of an endless stream of businesses jostling for attention in her inbox: “No amount of discounts or offers are enough to appreciate women. However, here’s our little effort in making them feel ultra-special … up to 50% off all our products until Women’s Day.” Bhowmick adds: “We don’t need vouchers or discounts. We need equal rights at home and at work. We need to be heard.”\nWhat else we’ve been reading\n-\nYuval Noah Harari’s speech at a pro-democracy demonstration in Israel on Saturday, repurposed as a comment piece here, sets out the stakes of opposition to Benjamin Netanyahu’s far-right government in the starkest possible terms. “We must raise our voices now – or keep our mouths shut for the rest of our lives,” he writes. “When a tiger comes to devour us, we cannot negotiate a compromise.” Archie\n-\nKatie Cunningham looks at the fringes of the sharing economy, a model that is helpful, lucrative and generally positive for some, but one that without the relevant regulation can be, quite literally, a car crash. Nimo\n-\nAs a Peckham local, Steve Rose writes, a new romcom set in his neighbourhood – Rye Lane – isn’t all it’s cracked up to be: “A love letter can also be a marketing brochure.” It’s part of a surprisingly long, and totally fascinating, history of “gentrification by genre”. Archie\n-\nThe long-trendy mullet is still going strong. Lucy Knight’s piece on this retro haircut, kitted out with a number of very cool photos of her own mullet journey, examines why it so popular right now. Nimo\n-\nPregnant Russians are coming to Argentina in droves in search of a “golden ticket” of a passport that allows visa-free access to more than 170-countries. This Washington Post story is a fascinating explanation of how that’s playing out in Buenos Aires. Archie\nSport\nFootball | Kai Havertz’s retaken penalty ensured Chelsea made it through to the quarter-final of the Champions League after beating Borussia Dortmund 2-0. Chelsea’s win potentially marks the beginning of Graham Potters comeback, writes Jacob Steinberg, as just a week ago “he was two defeats away from the sack”.\nCrowd safety | Uefa has confirmed that Liverpool fans (pictured above) who bought tickets for last May’s Champions League final are eligible for a refund after the chaos that marred the match in Paris. The European governing body acted in response to a report finding it bears “primary responsibility” for catastrophic organisational and safety failures.\nRugby | In the Breakdown newsletter, Robert Kitson writes about the debate in England’s camp over who should play fly-half: Owen Farrell, Marcus Smith, or George Ford. His piece is a really interesting dissection of a rugby debate that “has been the same for as long as the game has been played”. Do you prefer a “fancy dan” or “defensive solidity”? “After a while it becomes less a sporting debate than a soul-baring symbol of your entire personality.” Sign up to get the Breakdown every week here.\nThe front pages\n“Tories ‘extinguishing right to seek refugee protection in UK’, says UN” – welcome to our paper summary, beginning with the front page of today’s Guardian print edition. “Sunak ready to battle judges over migration” – papers tend to use “migration” in headlines, as the Times has done here, to mean “immigration” when the latter won’t fit. The Daily Telegraph goes after the BBC, which it says is “urged to sack Lineker after ‘Nazi’ migrant jibe” – a word Gary Lineker does not appear to have actually used in saying the Tories’ crackdown was couched in language “not dissimilar to that used by Germany in the 30s”. The Daily Mail’s take is more accurate: “Lineker faces BBC rebuke for likening small boats plan to Nazis”. The Daily Express has “Rishi lays down law: we decide who comes here”. “Carry on sewage pumping: water firms are told to self-police their pollution” says the i. “Mum, I’m scared” – little Olivia Pratt Korbel’s plea before she was shot and killed leads the Daily Mirror. The Metro uses the same. The splash in the Financial Times is “Powell signals return of larger Fed rate rises amid battle to cool inflation”.\nToday in Focus\nRupert Murdoch and the lawsuit blowing open Fox News\nRupert Murdoch has been drawn into a defamation lawsuit brought against Fox News for spreading the conspiracy theory that the 2020 US election was rigged. Ed Pilkington reports\nCartoon of the day | Ella Baron\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nFor New York-based writer Rae Meadows, taking up gymnastics in her 40s was physically tough and humbling. However, she soon found her way back to the sport she had loved as a child, and now practices three times a week. Writing for the Guardian’s “what makes me happy now” series, she describes how pushing herself in the gym has helped her to surpass her perceived limits. “My body hurts all the time: sore muscles, stiff joints, nagging echoes of old injuries. Sometimes to get out of bed I have to roll on my side and push myself up,” she writes. “But it’s a small price to pay for such wondrous returns. At a time in life when many things feel like they are sliding down the slope towards old, gymnastics is a gift of fluency and competence in motion … I’m a better gymnast now than I was at 16.”\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day – with plenty more on the Guardian’s Puzzles app for iOS and Android. Until tomorrow.",
  "word_count": 2229,
  "scraped_at": "2026-02-14T11:59:30.318064"
}