{
  "article_id": "b2cf6f43e6e7",
  "url": "https://www.bostonmagazine.com/boston-power-list-2023/",
  "title": "The 150 Most Influential Bostonians of 2023",
  "date": "20230418T180000Z",
  "domain": "bostonmagazine.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "For years, Boston’s women have fought for a seat at the tables of power. Now, in a stream of elections, appointments, and hires over the past year or so, female leaders have finally positioned themselves at the head of many of those tables.\nThat’s represented throughout our 2023 ranking of the most influential Bostonians—in fact, nearly half of the people on the list are women. The most obvious example is our new number one: Maura Healey, who became the state’s first woman elected governor just a year after Michelle Wu became the first woman elected mayor of Boston.\nVoters seem to be ahead of the curve, but boards of directors and search committees are catching up. Look around the city, and you’ll find women newly named as president of the Federal Reserve Bank of Boston, CEO of Blue Cross Blue Shield of Massachusetts, president of GBH, and editor of the Boston Globe. The biotech industry and universities are also leading the charge: New presidents at Harvard and MIT—Claudine Gay and Sally Kornbluth, respectively—exemplify the latter, while CEOs Reshma Kewalramani of Vertex and Yvonne Greenstreet of Alnylam represent the former.\nSomething else that’s different about our list this year? We’ve expanded it from 100 to 150 people, reflecting the more-diffuse nature of power across the city as the former old boys’ network becomes more diverse and inclusive. Whether you agree with the very subjective nature of the rankings or not—we’re certainly counting on them kickstarting more than a few heated debates!—one thing is for sure: What it means to be a leader in Boston keeps changing and moving forward.\n1. Maura Healey, Governor\nThere’s a new governor in town, and by winning 85 percent of the primary vote and 63 percent in the general election, Healey starts with a clear political mandate while serving as an inspiration to a new generation of LGBTQ+ leaders and politicians. Sure, she’ll find the usual roadblocks among the state legislature, business community, and activists, but with apparent goodwill among all of those groups—as well as popular support—she’ll have the power to forge ahead on tough issues such as housing, transportation, and climate. She seems, frankly, to have nothing but allies or at least no significant vocal opposition (as some other local pols have accumulated). Drink it in, Governor!\n2. Ayanna Pressley\nU.S. REPRESENTATIVE\nShe’s known most for taking on the big, bold fights, such as her “baby bonds” bill, student debt cancellation, and the attempt to (finally) enshrine the Equal Rights Amendment. But she’s also bringing home the bacon: funding for infrastructure in downtown Chelsea, electric-vehicle charging stations in Cambridge, and free library mobile services in Randolph.\n3. Lee Pelton\nPresident and CEO, the Boston Foundation\nWhen Pelton speaks, Bostonians listen. Under his leadership, the Boston Foundation has continued to provide wide-ranging grants while delivering key research on climate, housing, and equity. It has also moved nimbly in response to real-world change, reworking its Equality Fund’s LGBTQ+ strategy to focus on racial and ethnic inequities, and launching a new Fund for Reproductive Health following the 2022 Dobbs ruling on abortion.\n4. John Fish\nChairman and CEO, Suffolk Construction\nNever mind its growth nationally, Suffolk still builds more of the Bay State’s buildings than any company—more than $2 billion worth a year. And in Boston, where there’s nowhere left to go but up, the construction king still has his say in every political and civic aspect of the city.\n5. Bob Rivers\nChairman and CEO, Eastern Bank\nComing off Eastern Bank’s most profitable year ever, its chief executive remains a ubiquitous leader in the city, speaking often about Boston’s civic life. Rivers also chairs the Dimock Center Community Foundation Board and is one of the first to help out with many other causes.\n6. Katherine Clark\nU.S. Representative\nClark’s meteoric rise from private citizen to second in power among all U.S. House Democrats—she assumed the prestigious Whip post at the start of 2023—has taken just 15 years. For what it’s worth, two other Bay Staters have held that position: Tip O’Neill and John McCormack, both of whom later became Speaker of the House.\n7. Jim Canales\nPresident, Barr Foundation\nWith well over $2 billion in assets at his disposal, Canales continues to drive discussion and action on the city’s biggest issues. Case in point: The Barr’s increased focus on racial equity isn’t just talk. Among other things, under Canales the foundation has given a grant to the Boston Globe to increase coverage of the issue and hired Lisette Le to lead its Racial Wealth Equity Initiative.\n8. Linda Pizzuti Henry\nCEO, Boston Globe Media Partners\nShe finally got the chance to name a new Globe editor; has launched the paper’s first television show, on NESN; and is reportedly bidding to bring a National Women’s Soccer League franchise to Boston. And then there’s the powerhouse annual Globe Summit—where last year she personally interviewed the legendary David Ortiz, who used to work for her Red Sox–owning husband, John.\n9. Michelle Wu\nMayor of Boston\nNot afraid of controversy, Wu is standing firm—and showing that she’s ready to shoot big. This includes her efforts to reconfigure the city’s planning and development structure, institute a form of rent control, and consider reparations. As for standing firm: See her defiance of North End restaurateurs and elected school committee advocates.\n» Five Things to Know about Life in Michelle Wu’s Office at City Hall\n10. Thomas O’Brien\nFounding partner and ceo, HYM Investment Group\nThe vacant lot across from Boston Police Headquarters in Roxbury has been known only as Parcel 3 for the past 50 years. Partnering with Reverend Jeffrey Brown, O’Brien is building housing and a Martin Luther King Jr. museum on the site. Meanwhile, he’s broken ground on the massive Suffolk Downs redevelopment project, another key part of O’Brien’s role in remaking and shaping the new Boston.\n11. The Kraft Brothers (Jonathan, Daniel, and Josh)\nPresident, Kraft Group and the New England Patriots; president, Kraft Group International; President, New England Patriots Foundation\nThe sons of Robert and Myra are, in some ways, Boston’s 21st-century version of the Kennedy brothers. Jonathan has been trying to get the Patriots back to the Super Bowl and chairs Massachusetts General Hospital’s Board of Trustees. Daniel runs the family paper-products business and serves on the board of the Dana-Farber Institute. And Josh gives out millions in family funds every year, including a recent $50 million gift to MGH to address local healthcare disparities, and cochairs the state’s Task Force on Hate Crimes.\n12. Sandy Edgerley\nCofounder, the ‘Quin House\nEdgerley’s red-hot social club hosts elite speakers and events—as well as many people on this list as members—while fostering the networks of tomorrow’s most influential. Building the ‘Quin hasn’t slowed her roll elsewhere, though: When Boston hosted the Earthshot Prize ceremony, she was its cochair, and she’s also added Boston College to the long list of boards she serves on.\n13. Abigail Johnson\nChairman and CEO, Fidelity\nHer company is coming off another blockbuster year—maintaining its $10 trillion in assets under management—and is currently on a hiring spree. The notoriously media-shy mogul and philanthropist has also been making more public appearances, offering a keynote address at the Boston Chamber of Commerce’s annual meeting last year and even occasionally chatting with some reporters.\n» Who’s Afraid of Abby Johnson?\n14. Jim Rooney\nPresident and CEO, Greater Boston Chamber of Commerce\nWhenever there’s a new policy proposal at City Hall or the State House, the media turns to Rooney for his take. And he’s usually quick to give it. Congestion pricing for drivers? Good idea. Millionaires’ tax? Bad idea. MBTA problems? Pay a higher salary to the next general manager. This year Rooney even debuted an annual “State of Business” address to lay it all out for everyone.\n15. Anne Klibanski\nPresident and CEO, Mass General Brigham\nKlibanski has ushered in virtual urgent care, launched an anti- racism campaign, and overseen $2.3 billion of annual research funding—all while promising more than $125 million in spending cuts to combat skyrocketing healthcare costs. In short, she’s leaving a lasting mark on the state’s largest private employer and predominant healthcare provider.\n16. Elizabeth Warren\nU.S. Senator\nWarren made it clear early on that she’s running for re-election in 2024, and polls suggest that Massachusetts voters are perfectly happy returning her to Washington. She’s still making headlines confronting business and finance leaders—including, lately, Fed chair Jerome Powell and various cryptocurrency executives—while handling constituent services like the legendary Ted Kennedy used to.\n17. Reshma Kewalramani\nCEO, Vertex Pharmaceuticals\nThe India-born, Boston University–educated Kewalramani was named one of 10 people transforming healthcare by Business Insider—and it’s clear why. She’s entered Vertex into a partnership with CRISPR Therapeutics and says her company could launch new products for five different diseases in the next five years. She’s also working on building a better STEM pipeline with Boston Public Schools.\n18. Sarah Iselin\nPresident and CEO, Blue Cross Blue Shield of Massachusetts\nTaking over from the outspoken Andrew Dreyfus, Iselin is now in charge of steering the ship for the insurer’s 2.9 million members—and the Boston healthcare industry as a whole. She should be up to the challenge: While in her mid-thirties, she helped enact the state’s 2006 breakthrough healthcare reform law as commissioner of the state Division of Health Care Finance and Policy.\n19. Lisa Wieland\nCEO, Massachusetts Port Authority\nWe tend to think of Boston’s economy in terms of life sciences, healthcare, and finance, but don’t discount the importance of goods arriving and departing at the ports. A new freight corridor, deeper-dredged berths, and ship-to-shore cranes now allow bigger ships to dock and more containers to be loaded and unloaded—and are all now part of Wieland’s get-it-done legacy.\n20. Rachael Rollins\nU.S. Attorney\nYou can’t say Rollins has taken it slow in her first year as U.S. attorney: She successfully established an anti-human- trafficking team and launched a hotline for reporting hate crimes. And an inquiry into the ethics of a fundraiser she attended didn’t stop her from speaking out on voting rights, protections for the trans community, and Florida Governor Ron DeSantis for sending asylum seekers to the Vineyard.\n21. Robert Popeo\nChairman, Mintz, Levin, Cohn, Ferris, Glovsky and Popeo\n“FemTech” is not a term you’d expect to hear in the same breath as a 90-year-old Boston law firm, but that’s how folks are referring to Mintz’s new Women’s Health and Technology practice. It’s one of many ways that Popeo’s influential firm keeps growing and adapting. And the legal legend is no stranger to the courtroom—he helped gain a rare acquittal in one of the so-called Varsity Blues cases.\n22. Roger Crandall\nChairman, president, and CEO, MassMutual\nFor the first time in history, the 2023 Red Sox are sporting a company logo on player jerseys—and it’s MassMutual’s. The very visible sponsorship reinforces Crandall’s message that the life insurance giant, after opening its new 310,000-square-foot Seaport office, is now very much a leading Boston company, even though its HQ remains in Springfield.\n23. Corey Thomas\nChairman and CEO, Rapid7\nApparently, Thomas wasn’t busy enough running a successful digital security company, serving as an angel investor, and sitting on the board of Blue Cross Blue Shield of Massachusetts. He’s now joined the board of directors of the Red Sox Foundation, been appointed to President Joe Biden’s National Security Telecommunications Advisory Committee, and taken on the role of chairman of the Federal Reserve Bank of Boston.\n24. Kimberly Budd\nChief Justice, Supreme Judicial Court\nWith the pandemic retreating, this past year Budd was finally able to visit far-flung state courts that she oversees, give a commencement address at Boston College Law School, and testify before the state legislature for more court and legal aid funding. Meanwhile, her SJC will decide thorny issues ranging from tenants’ rights to fetal homicide.\n25. Jaylen Brown\nShooting guard, Boston Celtics\nThe outspoken Celtics superstar is on the cusp of entering a new phase of his life—and career—as he focuses on promoting social justice in the city and beyond. His 7uice Foundation is dedicated to fighting systemic racism, while the related Bridge Program has partnered with the Community Biotechnology Initiative at the MIT Media Lab to provide science and technology opportunities for children in Boston’s underserved communities.\n26. James Arthur Jemison\nDirector and Chief of Planning, Boston Planning and Development Agency\nWhatever Mayor Wu does when it comes to reconfiguring the BPDA, developing city-owned parcels of land, and creating more housing, one thing is certain: Jemison will be her man in charge. That was made clear when she maneuvered to give him the legally dubious status of holding two key planning positions in the city. The physical future of the city is entirely in his hands.\n» Can This Man Blow up City Development without Destroying Boston?\n27. Ed Kane\nOwner, Big Night Entertainment Group\nIf Kane is the king of Boston’s nightlife scene—as this magazine has dubbed him—imagine if Mayor Wu comes through on promises to turn Boston into an actual nightlife town? Kane isn’t waiting, of course. He’s just partnered with restaurateur Nia Grace on a new Seaport venue and is planning some major operations at the coming Encore Boston Harbor expansion.\n28. Andrea Campbell\nAttorney General of Massachusetts\nAs attorney general, Maura Healey avoided making local waves by focusing much of her firepower on the Trump administration. Campbell seems likely to take a more confrontational path: The Mattapan pol is set on tackling corruption alongside gun violence and employer malfeasance, and is willing to step on anyone’s toes to achieve her goals.\n29. Marty Meehan\nPresident, University of Massachusetts\nHis wedding last summer to Jennifer Maguire Hanson in Ireland made the news, but his support for free community college and a locked-in tuition rate for all four-year students at UMass has him at the forefront of conversations about the future of higher ed. Around Boston, whether advocating on Beacon Hill or pressing palms at the UMass Club, Meehan certainly has everyone’s attention.\n30. Martha Sheridan\nPresident and CEO, Meet Boston\nShe’s rebranding her quasi-public agency from its old Greater Boston Convention & Visitors Bureau moniker and rebranding the city as a lively, diverse group of neighborhoods to outsiders mainly familiar with the historical downtown. To do it, she convinced both state and local government to create a new funding stream just for her. Influential, indeed.\n31. Robert Reynolds\nPresident and CEO, Putnam Investments\nIn addition to helming one of the top investment outfits in town, Reynolds currently serves as chairman of the Massachusetts High Technology Council and has plans for the state. Big plans. To make them a reality, he launched MassVision2050, a project intended to guide the state toward a strong, long-term economy—covering everything from clean energy to housing and supply chains.\n32. Segun Idowu\nChief of Economic Opportunity and Inclusion, City of Boston\nAll growth in the city—and there’s plenty of it—goes through Idowu, arguably Mayor Wu’s most important cabinet member. That includes the coup of luring Lego’s corporate headquarters from Connecticut, plans for a more-active nightlife scene, and greater opportunities for contractors of color.\n33. Kendalle Burlin O’Connell\nPresident and CEO, Massachusetts Biotechnology Council\nBurlin O’Connell has now taken the helm of the most influential organization in the region’s critical growth industry after years spent advancing through its ranks. “MassBio wouldn’t be what it is without her,” raves the group’s former CEO, Bob Coughlin. More evidence of her influence? One of her brainchildren, a biotech workforce training center in Dorchester, is expected to open later this year.\n34. Susan Goldberg\nPresident, GBH\nGBH’s fearless new leader recently left the top job at National Geographic and has all the journalistic chops to continue expanding the reach of our local PBS TV station, public radio station, and website, which produces more national PBS content than anyone. With an annual budget of roughly a quarter-billion dollars, Goldberg’s only limit is her imagination.\n35. Stéphane Bancel\nCEO, Moderna\nBancel spent 2020 and 2021 helping to save the world with a pandemic-stopping vaccine and, as a result of his work, became wealthy beyond imagination. He spent 2022 and early 2023 giving a good chunk of it away to charity, including some $250 million to his two foundations, which have made grants to Pine Street Inn, Boston Health Care for the Homeless Program, and Breaktime Community Fund, among others.\n36. Vanessa Calderón-Rosado\nCEO, Inquilinos Boricuas en Acción\nShe’s added Blue Cross Blue Shield of Massachusetts to the list of powerful boards on which she sits. She also advised Governor Healey’s transition, calling for a cabinet-level housing chief. And her tepid view of rent control, coming from the perceived local leader in affordable-housing advocacy, might well deflate Mayor Wu’s chances of getting that plan through Beacon Hill.\n37. Niraj Shah\nCEO, Wayfair\nTwenty years after cofounding Wayfair, Shah is still running the company while remaining a fixture in local business and civic circles. His philanthropic foundation, run by his wife, Jill Shah, has become a major player thanks to its support of local education, nutrition, and mental health initiatives.\n38. Jeremy Sclar\nChairman and CEO, WS Development\nThe 2,000 Amazon employees who moved into the Boston Tech Hub last summer? They’re working in one of Sclar’s latest projects. But it’s not just about buildings for the mega-developer. Sclar also led the first round of investments at Stackwell Capital, providing seed money for the platform’s goal of eliminating the racial wealth gap. And he made his first big local political contribution in 2022: $50,000 to a committee supporting Lieutenant Governor Kim Driscoll.\n39. Jim Davis\nChairman, New Balance\nLast year, Davis opened the latest piece of his Boston Landing mini empire—a world-class track-and-field facility—as well as his latest in-state shoe manufacturing plant. And he showed how committed he is to using his multibillion-dollar fortune in local politics, giving a whopping $1 million in opposition of the Millionaires’ Tax.\n40. Deborah Jackson\nPresident, Cambridge College\nJackson, a frequent presence in the civic life of Greater Boston, also keeps her 52-year-old school on the cutting edge. Most recently, she made Cambridge College a founding member of the new CyberTrust Massachusetts consortium. And its focus on adult learning now extends to age 92—a record set when Carlos Rezende of Dorchester graduated last year.\n41. Brian Moynihan\nChairman and CEO, Bank of America\nHe’s being honored in 2023 as a “Distinguished Bostonian” by the Greater Boston Chamber of Commerce—fitting for a guy who loves it here so much that he commutes to BoA’s North Carolina HQ. Moynihan’s fondness might also help explain the $50 million in grants directed to local recipients since 2018. A national and global opinion-setter, Moynihan also weighs in at home as chair of the Massachusetts Competitive Partnership.\n42. Kevin Phelan\nBoston Office Cochairman, Colliers International\nYes, he remains at the forefront of many big real estate deals, but it’s what he does during his off-hours that makes Phelan one of Boston’s leading lights. He plays a part in too many philanthropies and associations to list—and in a town where power is less centralized than ever, his breakfast group comprised of economic and civic powerhouses is more vital than ever.\n43. Kevin Churchwell\nPresident and CEO, Boston Children’s Hospital\nChurchwell has had to deal with an ongoing pandemic, rising costs, an influx of patients due to the closing of Tufts Children’s Hospital, and ongoing threats from opponents of gender-affirming care. Meanwhile, he’s been trying to draw national leaders’ attention to a childhood and adolescent mental health crisis. Oh, and he’s still got the top-ranked children’s hospital in the country.\n44. David Fialkow\nCofounder and managing director, General Catalyst\nThe filmmaker/producer/VC pro recently co-produced the Oscar-winning documentary Navalny, as well as one about the “never-Trump” Lincoln Project, and helped fund the Brandeis art exhibition “Peter Sacks: Resistance” featuring portraits of Nelson Mandela and Volodymyr Zelensky. (Sense a theme here?) He’s also still investing in promising companies and raising money for charities.\n45. Bruce Percelay\nFounder and chairman, Mount Vernon Company\nAs Nantucket Magazine publisher (and interviewer), Percelay is leading the conversation among decision makers on the exclusive island; as a local real estate mogul, he is leading the conversation about development in the Mayor Wu era, representing himself and others by stepping forward as a vocal critic of local housing policies. He also helps shape discourse as board chair of the Edward M. Kennedy Institute.\n46. Kimberly Sherman Stamler\nPresident, Related Beal\nThis developer seems to be building, or planning to build, nearly everywhere in and around Boston: a million square feet at Fort Point, a lab in South Boston, three South End buildings, and One Kenmore Square, among others. Stamler, who is putting these deals together, also recently received a Social Leadership Award from the Boston Business Journal.\n47. George Regan\nChairman and CEO, Regan Communications Group\nWhen the state’s most powerful PR man gets married, you’ll find a former governor (Charlie Baker), former U.S. senator (Scott Brown), former congressman (Marty Meehan), and a couple of billionaires (Robert Kraft and John Fish)—and that’s just among those with official wedding roles. Regan’s nuptials last summer to Elizabeth Akeley merely reinforced his A-list status among Boston’s A-listers.\n48. Claudine Gay\nPresident-designate, Harvard University\nGay hasn’t even technically started her job yet, but is already asserting her authority by taking over the search for four open dean positions at one of the world’s top universities. As Harvard continues to expand in Boston, physically and otherwise, it will be led by a woman described to the Crimson by her cousin, bestselling author Roxane Gay, as “very resolute and badass.”\n49. Colette Phillips\nCEO, Colette Phillips Communications\nA leading light of New Boston, Phillips “has emerged as a key liaison between the Boston business community and local minority enterprises,” the Bay State Banner recently wrote. Got that right. Phillips and her Get Konnected! networking group have been so successful that Harvard Business School just published a case study on how she did it.\n50. Amy Latimer\nPresident, TD Garden\nAs Boston continues to recover from the pandemic, one spot in the city is miraculously ready to usher everybody back to regular life: TD Garden. There are the enhanced concessions systems, the lively Hub on Causeway development, and, of course, the dual league-leading performances of the Celtics and Bruins. Perhaps Latimer can’t take credit for the team records, but the rest is all her.\n51. Darryl Settles\nPresident, Catalyst Ventures Development\nSettles has been a leader in the community for years through his restaurants, housing developments, business mentorship, and activism. Now, add his involvement with the Builders of Color Coalition and the Boston Real Estate Inclusion Fund, and you have one of the most respected movers and shakers in town.\n52. Imari Paris Jeffries\nPresident and CEO, Embrace Boston\nTo say Jeffries has been keeping busy is an understatement: After the successful unveiling of The Embrace MLK monument, the organization’s fearless leader is overseeing the Embrace Ideas Festival, the Juneteenth Block Party in Roxbury, and the planning and construction of the upcoming Embrace Center, part of a larger expansion of Nubian Square.\n53. Betty Francisco\nCEO, Boston Impact Initiative\nFrancisco’s Boston Impact Initiative is looking to put $20 million toward funding diverse local businesses; meanwhile, Amplify LatinX, the advocacy group she cofounded, is growing by leaps and bounds. Her influence and connections go even further: She and her husband, State Street’s Paul Francisco, are one of Boston’s most powerful couples.\n54. Jenny Holaday\nPresident, Encore Boston Harbor\nThe effects of the state’s new sports-betting law—which Holaday lobbied for—remain to be seen, but as they say in the casino biz, the house always wins. Holaday has now added a sportsbook to her five-star Forbes Travel Guide resort; she has also expanded her influence by joining the Massachusetts Taxpayers Foundation executive committee and speaking at local events, including the Massachusetts Conference for Women.\n55. Sheena Collier\nFounder and CEO, Boston While Black\nIt’s now almost unthinkable to discuss Black life and business in Boston without seeking Collier’s input. After all, she has the ear of both the mayor and governor, and in less than three years, her Boston While Black network has grown to more than 1,200 members, held close to 100 events, and partnered with DraftKings, Vertex, Wayfair, and others to attract and retain Black talent.\n56. Susan Collins\nPresident and CEO, Federal Reserve Bank of Boston\nThe first Black woman ever to lead a regional Federal Reserve bank, Collins has not been shy with her (somewhat hawkish) calls for interest rate hikes and (fairly optimistic) predictions about jobs since she was named last summer. Boston’s economic ecosystem—and all of New England’s—hangs on the research she oversees, including the so-called Beige Book released eight times a year.\n57. Nancy Barnes\nEditor, the Boston Globe\nBarnes is the first woman to helm the region’s dominant daily newspaper, and only the second editor in modern times to arrive without extensive experience at the Globe or in the Boston market. The other was the transformational Marty Baron; if Barnes has a similar effect, she will quickly rise even higher on this list.\n58. Ibram X. Kendi\nFounder and director, Boston University Center for Antiracist Research\nHe’s officially a Bostonian now: In October, Kendi donned a Sox jersey and threw out the ceremonial first pitch at Fenway Park. Kendi also, in the past 12 months, published three more bestsellers—including How to Be a (Young) Antiracist—making him the highest-profile intellectual on race in a city prioritizing the issue in almost everything it does.\n59. Herb Chambers\nOwner and president, The Herb Chambers Companies\nYou might have seen his stunning 263-foot yacht in Boston Harbor, but Chambers is more often aboard the helicopter that still shuttles him to work in Somerville, running New England’s largest auto dealership chain. Meanwhile, keep your eye on the hard-working mega-dealer’s niece, Melissa Steffy, who runs the BMW and Mini dealerships and is a rising power herself.\n60. Quincy Miller\nPresident and vice chairman, Eastern Bank\nMiller recently created a program to make it easier for local business owners of color to get loans, just the latest in Eastern Bank’s history of socially conscious efforts. Miller fits in personally with that ethos, sitting on nonprofit boards all over Boston, including the Boys & Girls Clubs of Boston and the Urban League of Eastern Massachusetts.\n61. Michael Curry\nPresident and CEO, Massachusetts League of Community Health Centers\nHe has served on both state and city task forces on health equity and started equity initiatives through the association of community health centers he leads. This summer, he’ll be the host with the most as the NAACP National Convention finally comes to Boston, in large part due to his advocacy on the NAACP national board.\n62. Stephen Davis\nPresident, Davis Companies\nAs Davis has stepped up his role in the giant real estate company his father founded—he became president late last year—he has also stepped up his public role, cochairing the housing committee on Governor Healey’s transition team. Looks like he plans to be a big part of the housing solution, too: He is currently developing a four-building, 500-unit apartment and condo project on Soldiers Field Road.\n63. Jackie Jenkins-Scott\nInterim President, Roxbury Community College\nThe former head of Dimock Health and Wheelock College was reportedly the RCC board’s unanimous choice to lead the school—at a time when Governor Healey’s free community college plan promises to supercharge RCC’s already crucial role in the lives of young, primarily Black Bostonians.\n64. Yamini Rangan\nCEO, HubSpot\nNamed the best CEO for female employees in America by Comparably, Rangan is keeping her customer-relations software company booming, with 33 percent revenue growth last year. More proof of her clout? She convinced Barack Obama to speak in Boston at the company’s Inbound conference. Not bad for just taking over for HubSpot cofounder Brian Halligan less than two years ago.\n65. Sam Slater\nManaging Partner, Tremont Asset Management\nA billionaire developer, philanthropist, film producer, and sports-team owner who may have recently bought the Playboy Big Bunny luxury jet—is this really a Bostonian? Yes, and Slater isn’t slowing down—he’s now trying to build a 19-story apartment tower in the Fenway.\n66. Aaron Michlewitz\nState representative\nNever underestimate the power of the state’s purse. Michlewitz chairs the Ways and Means committee, and it’s widely believed that he will be the next Speaker—the first from Boston since his North End predecessor, Sal DiMasi. He was key to the passage of the state’s new sports-betting law and will have a big say in what taxes you pay next year.\n67. Sally Kornbluth\nPresident, MIT\nKornbluth has taken charge of MIT at a crucial time, as the institution works to find solutions for the world’s biggest issues—from climate change to energy—while maintaining its position in the world as a top place to study. So far, she seems up to the challenge, having already taken a seat on the board of the renowned Broad Institute and connected with students by recording a video message on her iPhone in response to a free-speech controversy on campus.\n68. Matthew Teitelbaum\nDirector, Museum of Fine Arts\nRebranding an institution as well known as the MFA for a new generation of museum patrons is a tough task—it’ll take more than the new logo introduced last year, and Teitelbaum clearly knows it. His big “get” of the official Obama portraits sure helped. So did Jaylen Brown deciding to hold his foundation gala there at the museum.\n69. Peter Palandjian\nChairman and CEO, Intercontinental Real Estate Corporation\nLast year, his company bought the “Yard 5” development nearing completion in Hyde Park; made major West Coast moves, including a nine-story Seattle life-sciences tower; and picked up a Corporate Citizenship Award from Boston Business Journal. Personally, Palandjian was recently honored, along with former Mayor Marty Walsh, by 3Point Foundation for his contributions to local education in Boston.\n70. Jerome Smith\nHead of Community Affairs, New England Region, Amazon\nHaving spent much of his career in government—he was chief of staff to Senate President Therese Murray, then a member of Mayor Marty Walsh’s cabinet—Smith has now taken his talents (and extensive contacts) into the private sector. His primary task: handing out Amazon’s money to local organizations, such as a million dollars to youth sports teams last year.\n71. Kirk Sykes\nManaging Director, Accordia Partners\nEverything’s coming up Sykes. Mayor Wu has tapped him to help streamline the city’s development process. He’s partnered with developers Darryl Settles and Richard Taylor to form the Boston Real Estate Inclusion Fund. And the community is already gaga for his ambitious Dorchester Bay City project—which now includes the creation of an entirely new waterfront esplanade.\n72. Demond Martin\nPartner, Adage Capital Management\nNot yet 50, Martin is already being referenced more as a philanthropist than a venture capitalist, and, truth be told, he’s awfully prolific at both. In addition to his success at Adage, he was an initial seed funder of Embrace Boston and serves on the Obama Foundation board of directors; you’ll find his name, along with his wife, Kia, in the contribution lists of nonprofits throughout the city.\n73. Wyc Grousbeck\nOwner, Boston Celtics\nGrousbeck is reportedly in a win-this-year mood—“running the Celtics like a fan,” as Celtics Wire put it—and the city’s many other fans are loving it. With last year’s finals loss and the off-court head-coach drama now behind us, this town has Celtics fever again. Let’s all just pray he can re-sign star Jaylen Brown come the off-season.\n74. Elizabeth Lowrey\nPrincipal, Elkus Manfredi Architects\nThe city’s rapid growth and attempted return to new-normal office life have provided plenty of opportunity for Lowrey’s sought-after interior design work. That includes projects for AEW, Simmons University, Emerson College, St. Regis Residences, and Encore Boston—just a few of the spaces she and her team are designing or redesigning within the city.\n75. Josh Bhatti\nSenior vice president, the Bowery Presents\nBhatti has been making music happen around Boston for years at the Bowery Presents Royale and Sinclair, but with last spring’s opening of the Roadrunner in Brighton and this year’s debut of the Stage at Suffolk Downs, he’s bringing our live-entertainment scene to another level—essential work when it comes to making the city a place where young people want to remain after college.\n76. Jane Steinmetz\nBoston Office Managing Principal, Ernst & Young\nThe first, and still the only, woman to head the Boston office of a Big Four accounting firm, it’s no surprise that Steinmetz recently received a Leading Woman honor from Girl Scouts of Eastern Massachusetts—one of many nonprofits she’s involved with. She’s also the chair of the influential Massachusetts Business Roundtable and serves on boards of the Massachusetts High Technology Council and Massachusetts Taxpayers Foundation.\n77. Barbara Lee\nFounder and President, Barbara Lee Family Foundation\nFor years, Lee has funded efforts to elect female governors all over the country—especially in Massachusetts. In 2014, while supporting Martha Coakley in her (ultimately unsuccessful) bid for governor, Lee also helped recruit Maura Healey to run for attorney general. Eight years later, Lee at long last got her wish—and a friend in the corner office. She even cochaired Healey’s gubernatorial inaugural party, raising a record $2.9 million.\n78. Jason Robins\nChairman and CEO, DraftKings\nRobins finally got his sports-betting app legalized in Massachusetts, launching it this March in time for the Celtics and Bruins playoff runs. The Beacon Hill lobbying success reflects, in part, the growing status and sway of Robins in Boston—where he promises more hometown jobs as Draft-Kings expands into additional states across the country.\n79. Roxann Cooke\nRegional director for New England, JPMorgan Chase\nThe first Chase Bank branch in Massachusetts opened five years ago; there are now more than three dozen, and Cooke plans to more than double that number by 2025. And she’s making sure that often-overlooked lower-income areas are included—such as Blue Hill Avenue in Mattapan, where there’s now a branch down the road from where she grew up in Grove Hall.\n80. Tracy Campion\nPrincipal and Owner, Campion and Company\nCampion, the top-ranked local home seller year in and year out, keeps proving her value—and her connections. She sold four of the city’s six most expensive homes last year: two in Louisburg Square, one in the Mandarin Oriental, and one on Beacon Street. That doesn’t even include Tom Brady’s former home on Commonwealth Avenue.\n81. Nia Grace\nRestaurateur and activist\nSince cofounding the Boston Black Hospitality Coalition, Grace has seen her work pay off in the form of new businesses galore—and her own expanded presence on the restaurant scene. First, she opened the Underground Café and Lounge; this spring, it’s Grace by Nia in the Seaport. A real estate website recently called her a “hospitality luminary,” and we wholeheartedly agree.\n82. Aisha Francis\nPresident and CEO, Benjamin Franklin Cummings Institute of Technology\nMany expected the college to shutter before Francis took the top job at the financially troubled, century-old college in 2021. But under her leadership, the facility has been revived and renamed and will soon be relocated—thanks in part to a massive gift Francis obtained from the Cummings Foundation. It’s also accepted a multimillion- dollar donation this spring for scholarships to its new biotech program.\n83. Raj Sharma\nFounder, the Sharma Group, Merrill\nYou need $10 million to get in the door with this Barron’s Hall of Fame wealth adviser, but for just $30, you can get his new book on what to do with your money. His opinions can make waves: When the national discourse turned against ESG (environmental, social, and governance) investing, Sharma spoke out, telling his fellow advisers to get on the ESG bandwagon or get left behind.\n84. Yvonne Greenstreet\nCEO, Alnylam Pharmaceuticals\nEven before Greenstreet made the move from COO to CEO of Cambridge’s Alnylam early last year, she promised to make the RNA interference developer a top-five biotech company (by market capitalization) by 2025. Its pipeline includes potential treatments for Alzheimer’s, hypertension, and hepatitis B. Business Insider recently called the company a “powerhouse” while naming Greenstreet one of its 10 leaders transforming healthcare. And she’s stepping out in Boston more, recently cochairing a Kennedy Institute event.\n85. Ernie Boch Jr.\nPresident and CEO, Subaru of New England\nBoch’s commitment to Boston, and his philanthropic drive, has only increased since he sold most of his auto dealership empire. See: the interactive hologram he introduced as part of the Folk Americana Roots Hall of Fame, featuring part of his impressive guitar collection at what is now the Boch Center Wang Theatre.\n86. Andrew Meyer Jr.\nFounding partner, Lubin & Meyer\nIn a city where medical institutions rule the roost, Meyer’s name is one of the few that make healthcare CEOs quake in their boots. Armed with a mission to help victims of medical malpractice, he and his team of attorneys procured 34 settlements of $1 million or more last year alone, by far the most in the region—and already won a $20 million verdict against Lowell General this year.\n87. Sam Kennedy\nPresident and CEO, Boston Red Sox\nHe is, reportedly, the one who connected Charlie Baker with the NCAA. And he’s involved in plenty of boards and committees, from Camp Harbor View to Dana-Farber, not to mention significant development in the Fenway. But obviously, Kennedy’s biggest influence is over the mood of the city, which rises and falls precipitously with the quality of the team he fields.\n88. Grace Lee\nEastern Massachusetts Regional president, M & T Bank\nActive in business, legal, academic, and justice circles, Lee has said that in her new M & T Bank role, she will continue to focus on financial empowerment work. It was her question, at a January business forum, about expanding diverse supplier incentives that prompted Governor Healey to commit to an inter-agency equity audit. She also finds time to cochair the Boys & Girls Clubs of Boston annual fundraising dinner.\n89. Nicole Obi\nPresident and CEO, Black Economic Council of Massachusetts\nShe succeeded the man who now heads the city’s economic development arm; advises the governor; and runs the Mass Black Expo for Black-owned businesses. So when Obi says she’s going to close Boston’s notorious racial wealth gap, don’t bet against her.\n90. Jill Medvedow\nDirector, Institute of Contemporary Art\nNewly elected into the American Academy of Arts and Sciences and back from presenting the official U.S. entry at the Venice Biennale, Medvedow continues to focus on connecting Boston with important art. That includes the Simone Leigh exhibition she commissioned for the biennale.\n91. Lydia Edwards\nState Senator\nAfter an impressive run as city councilor, Edwards is now in the state Senate—and has already been elevated to chair of the crucial Joint Committee on Housing. Her golden-touch record of endorsing winning candidates now includes the mayor, attorney general, auditor, and district attorney—demonstrating her influence on voters and the powerful friends who owe her.\n92. Christine Schuster\nPresident and CEO, Emerson Health\nAs local hospitals keep consolidating, it’s notable that the powerful Massachusetts Health & Hospital Association has chosen Schuster, head of one of the remaining independent community hospitals, as its new chair. The former nurse will head a major effort to get help from Beacon Hill on the industry’s challenges, particularly a nurse staffing shortage.\n93. Carolina Alarco\nFounder and principal, Bio Strategy Advisors\nAfter 25 years as a leader in the local biopharmaceutical industry, Alarco hung up her shingle as a strategic consultant. But her community involvement ranges much wider, from serving on the Massachusetts STEM Advisory Council to cofounding AccelHub Venture Partners to most recently joining Eastern Bank’s Board of Advisors. And if you’re thinking that it’s unusual to find a woman from South America in this industry, well, that’s why she cofounded Latinos in Bio.\n94. Alastair Bell\nPresident and interim CEO, Boston Medical Center Health System\nKate Walsh—who left to join Governor Healey’s administration—is a tough act to follow, but the newly named interim head of BMC Health System seems to be up to the task. He’s already guided BMC’s financial turnaround and the growth of BMC Health System, hired a new COO, and signed on to the National Health Care CEO Council on Gun Violence Prevention & Safety.\n95. Chris Jamison\nCEO, COJE Management Group\nIf Boston becomes the fun after-hours destination local leaders want it to be, we’ll have nightlife heavyweight Jamison in part to thank. His restaurant group’s latest is Caveau, a lounge at Center Plaza. It joins clubby dining-and-drinking hot spots Yvonne’s, Mariel, Coquette, Ruka, Mariel Underground, and the newly remodeled Lolita as bastions of the city’s burgeoning nightlife scene.\n» How COJE Restaurants Put the Sizzle Back into Boston Dining\n96. Sean O’Brien\nGeneral President, International Brotherhood of Teamsters\nWho was this, videotaping a message urging cannabis-industry workers to form unions? That would be the new, clearly different head of the Teamsters, Charlestown-raised Sean O’Brien. He’s a national big shot now, testifying before the U.S. Senate and negotiating major national worker contracts, but he still shows up for local picket lines and his Local 25 autism gala.\n97. Alberto Vasallo III\nPresident and CEO, El Mundo Boston\nVasallo has continued making it his mission to promote anything and everything good in the local Latino community. Case in point: Last fall, his media outlet put on an inaugural Latino Small Business and Entrepreneurial Summit. The media titan has also played host at events for East Boston Neighborhood Health Center, LifeScene in Lynn, Boston’s Hispanic Heritage Breakfast, and Latino 30 Under 30.\n98. G. Scott Uzzell\nPresident and CEO, Converse\nHe has one of Boston’s most iconic companies in his hands. Now, four years into his job with the shoe and apparel company, the new Bostonian is stepping into more of a local civic leadership role through his work with the Greater Boston Chamber of Commerce and efforts such as the Piers Park project in East Boston. Now, about those new high-heeled Chucks….\n99. Cain Hayes\npresident and CEO, Point32Health\nPoint32Health, in case you’ve lost track, is the name adopted by the health insurance company formed from the merger of Tufts Health Plan and Harvard Pilgrim Health Care. Hayes, brought in to lead it, has quickly made an impact, launching racial equity initiatives both internally and in the community—such as Massachusetts’ Health Equity Compact.\n100. Julie Jones\nChair, Ropes & Gray\nShe represents the American Lawyer Law Firm of the Year—an honor that weighs diversity and pro bono cases along with the $2 billion worth of revenue-generating work done by 1,500 attorneys at Ropes & Gray. Jones also helped lead the cautious post-pandemic reawakening of daily city life, mandating three in-office “anchor days” for employees at Ropes’ Prudential Center headquarters.\n101. Latoyia Edwards\nAnchor, NBC10 Boston\nThe Dorchester native, a recipient of a 2022 Boston Arts Academy Honor, seems to be everywhere lately: moderating a gubernatorial debate, anchoring the morning news daily (plus This Is New England on weekends), and speaking or emceeing at high-profile events all over town. All of which made her the natural choice to emcee The Embrace unveiling this past winter.\n102. Iván Espinoza-Madrigal\nExecutive director, Lawyers for Civil Rights\nWhen Florida Governor Ron DeSantis routed nearly 50 Venezuelan migrants to Martha’s Vineyard, Espinoza-Madrigal jumped into action, ultimately filing a lawsuit on their behalf. That intervention earned him a Lawyer of the Year nod from Massachusetts Lawyers Weekly, but it’s a matter of course for Espinoza-Madrigal, who has the attention of Boston’s most needy and the ears of its most powerful.\n103. Willie Bodrick II\nSenior Pastor, Twelfth Baptist Church\nBodrick carries on the tradition of thoughtful, community-minded figures leading the historical Twelfth Baptist Church— though he’s one of the youngest to do it. He’s well connected politically, having held roles with Senator Ed Markey and now-Governor Healey at the AG’s office. Last summer, he also became CEO of the American City Coalition, a nonprofit doing community revitalization work.\n104. Peggy Fogelman\nDirector, Isabella Stewart Gardner Museum\nThe Gardner continues to play a key connecting role in the city with concerts, lectures, and private events. Fogelman also keeps the museum fresh with such offerings as the recent Maurice Sendak exhibition. And under her stewardship, the institution has now published a new biography of Gardner herself in advance of its “Inventing Isabella” exhibition later this year.\n105. Lauren O’Neil\nChief Operating Officer of private equity, AEW\n“A powerhouse in Boston’s real estate community,” says Boston Real Estate Times of O’Neil, who served last year as president of the Real Estate Finance Association. The praise makes sense when you consider O’Neil’s role heading up private equity deals for AEW, a global company with nearly $100 billion in assets under management.\n106. Natanja Craig Oquendo\nExecutive director, Boston Women’s Fund\nNow in her third year leading the Boston Women’s Fund, Oquendo is one of a growing number of Bostonians of color directing local philanthropic initiatives. And as the recipient of this year’s Social Capital Inc. Idealist Award, she’s finding and funding programs—such as Abilities Dance Boston and the Massachusetts Transgender Political Coalition—that help those who need it most.\n107. Daren Bascome\nFounder and managing director, Proverb\nBascome’s brand strategy and advertising agency operates on a foundation of innovation, authenticity, and inclusion, which is why he was the perfect choice to collaborate on a tourism campaign aimed at showcasing Boston in a way that better represents the diversity of the city’s neighborhoods—and the people who reside in them.\n108. Chris Dagesse\nPresident, DCD Automotive Holdings\nDagesse runs this growing conglomeration of Nucar and Boch car dealerships with his family: He is currently the company chairman, while his father is reportedly phasing out of the business. In other words: At barely 40, Dagesse is looking like the great New England car-selling mogul of his generation.\n» The New Race to Rule the Automile\n109. Robert Higgins\nPresident, Brigham and Women’s Hospital\nWithin weeks of moving from Baltimore to lead this crucial Boston healthcare institution, Higgins—who just received the Society of University Surgeons Trailblazer Award—was making himself known in the community. He’s already popped up on local civic boards and even spoke out in a Globe interview about his intention to push Boston’s medical world toward true inclusion and equity.\n110. Diane Paulus\nArtistic director, American Repertory Theater\nIt just wouldn’t be Boston without the amazing things Paulus brings to the stage. Coming next: a new musical based on The Great Gatsby, directed by a Tony Award winner with music from lead singer Florence Welch of Florence and the Machine. Who else does that? And just wait until Harvard builds her that new venue in Allston.\n111. Steve Walsh\nPresident and CEO, Massachusetts Health & Hospital Association\nWalsh has, some argue, turned MHA into the most important organization in the state’s most important sector. He has everyone’s ear on Beacon Hill—at MHA’s annual meeting this year, one panel featured the two current legislative Ways and Means chairs, and was moderated by a former Ways and Means chair.\n112. Danielle Johnson\nFounder and CEO, Spark FM\nMs. HotSauce, as listeners know her, is now in her third year running the Spark FM digital radio station out of Hyde Park. It’s become an essential forum for Boston’s Black and Caribbean communities, and Johnson keeps adding new live shows and in-person events, such as last summer’s Spark the Block: Culture Festival.\n113. Ben Hires\nCEO, Boston Chinatown Neighborhood Center\nHires is emerging as a much-needed next-gen leader for Boston’s Asian-American residents. With a background in arts organizations and connections gained from being Boston Public Library’s director of strategic partnerships, his unique skill set has proven ideal for guiding Chinatown through COVID, a rise in anti-Asian hate, and the usual struggles of housing and transportation in the neighborhood.\n114. Michael Moran\nMajority Leader, state House of Representatives\nThe Brighton state rep was just promoted to the number two House job behind Speaker Ron Mariano. And as a critical ally of Mayor Wu, he holds the key to her Beacon Hill agenda, including rent control.\n115. Herby Duverné\nFounder and CEO, RISE Development and Construction\nHow’s this for range: Charlie Baker appointed Duverné to the Commission on Judicial Conduct, and Maura Healey named him to her transition team on housing. It’s not much of a surprise, considering the Haitian-born risk management leader is not only the CEO of Charlestown-based Windwalker Group but also RISE Development and Construction, which has been called a “pathbreaking” firm by Banker & Tradesman since its founding in 2019.\n116. Michael Cox\nCommissioner and chief, Boston Police Department\nHis return to lead the department he once served is extraordinary, but what matters now is whether Cox can forge some common ground between the reform-minded mayor and a headstrong police force—while quelling fears about rising gun violence. So far, the city seems ready to support him.\n117. Yawu Miller\nSenior editor, Bay State Banner\nHis uncle, Melvin Miller, just sold the Banner after nearly six decades—ensuring that the vital media outlet of Boston’s Black community will carry on. The announcement that Yawu Miller will remain as editor was greeted as welcome news all around—except perhaps among the city officials and developers he keeps zealous watch over.\n118. Eric Papachristos\nRestaurateur\nFrom Atlantic Wharf to Harvard Square, Papachristos is bringing his Greek heritage—and the talents of his partner, chef Jody Adams—to Boston diners. The growth of his local empire shows no signs of slowing down—in fact, he’s now moving into development, preparing to transform Weymouth’s Jackson Square into the next suburban hot spot.\n119. Aaron Tanaka\nCofounder and executive director, Center for Economic Democracy\nTalk to Boston-area activists, and they’ll tell you that Tanaka is the driving force behind just about every local labor or social justice initiative around—at least, the ones that get funding and make a difference. He helped start the Boston Ujima Project, which builds collective action, and the Boston Impact Initiative, which invests in businesses owned by people of color.\n120. Denella Clark\nPresident and CEO, Boston Arts Academy Foundation\nClark has raised tens of millions of dollars for the foundation, which is a big reason for that spiffy new BAA building across the street from Fenway Park. She has been a leader and fundraiser in Boston for a long time, but you knew she’d made it when she got Mayor Wu, Celtics forward Grant Williams, and Sox Hall of Famer David Ortiz to visit on the first day of class.\n121. Beth Boland\nSecurities Enforcement and Litigation Practice Chair, Foley & Lardner\nOne reason Maura Healey is now governor is the copious money raised by Boland, her campaign finance cochair. In fact, Boland, who also chairs the New England chapter of the National Association of Corporate Directors, has raised money for many of the Bay State’s most successful female politicians—who, you might have noticed, now hold most of the top offices.\n122. Josiane Martinez\nFounder and CEO, Archipelago Strategies Group\nThe slogan for Martinez’s company is “Marketing with Purpose”—a mission she’s been fulfilling lately with campaigns to help spread the word about vaccinations and business opportunities. Martinez personally is in demand as a public speaker and a writer for WBUR, and the former Deval Patrick aide still gets tapped for government advisory roles, too.\n123. Armani Thao\nFounder and Content Curator, @ForkingwithArmani\nBy day, Thao is an executive assistant at Boston Medical Center. Then he heads out to eat at night, and Bostonians await every bite. His restaurant posts generate thousands of likes and great discussion on Instagram and other social media channels. Just be prepared for a heaping side of food puns—did he really recommend “CLAW-some” lobster dishes? Yes, he did.\n124. Priscilla Douglas\nFounder, PHDouglas & Associates\nThe title of Douglas’s latest book, Woke Leadership, kind of sums it up: The top-flight executive coach (and former cabinet secretary under William Weld) is constantly pushing the powerful for forward progress. As chair of the Boston Public Library Board of Trustees, Douglas is a trusted resource and powerful public speaker throughout the region.\n125. Liz Walker\nCofounder and cochair, Embrace Boston\nHaving completed two successful careers—first as a journalist, then as a pastor—Walker could have relaxed in retirement. But she keeps on going. She recently raised $2.4 million for her Legacy Fund, benefiting local churches, and spearheaded the effort that brought the new Martin Luther King Jr. sculpture to Boston Common.\n126. Adam Franklin\nPresident, Franklin Sports\nHis third-generation company is practically synonymous with batting gloves, but Franklin has expanded its roster in recent years. He’s just inked a deal to manufacture Nerf Sports products and is on his way to dominating the fastest-growing sport around: pickleball. It’s no laughing matter—Franklin is now the official ball of U.S. Open Pickleball Championships and the Pickleball Slam.\n127. Garrett Harker\nRestaurateur\nWhen Harker closed his three Kenmore Square establishments two years ago, it seemed like the end of an era for Boston diners. This year, though, Mr. Hospitality is getting ready to make a big comeback as he prepares to open four new restaurants and bars—staffed with Eastern Standard alums—in a neighborhood that’s positively exploding with development.\n128. Ernie Herrman\nPresident CEO, TJX\nWith Raytheon’s move to Virginia, Herrman’s company trails only GE among the state’s largest-revenue public companies. He’s doing all of the popular things, too, committing the company to environmental sustainability and inclusivity. If you don’t know him…well, it’s not his fault that Bostonians view Framingham, where the retail giant is headquartered, as somewhere west of the Mississippi.\n129. Patrick Tutwiler\nSecretary of Education, Massachusetts\nAfter years of pandemic-related learning loss, the state’s students—and their parents—are counting on Tutwiler, who previously developed high school programs at the Barr Foundation and ran Lynn’s schools as superintendent. Just a few months into the job, he’ll be dealing with the promises and challenges of phasing in Massachusetts’ 2021 Student Opportunity Act—and soon, the promised education funding from the new Millionaires’ Tax.\n130. Kassia Davis\nFounder and CEO, KADA\nHer sustainability-focused clothing line brightened up the Seaport last year, and her revival of PF Flyers kicks—a brand Davis purchased from her father Jim Davis’s company, New Balance—is jazzing up women’s feet. But her philanthropy and devotion to empowering women are making as much of an impact as her brand development.\n131. Julia Mejia\nCity Councilor at-large\nAs one of the top vote-getters in the city and a champion for grassroots activists, Mejia has a way of forcing issues into the public conversation. Her persistent call for a slavery reparations conversation has resulted in a new task force. She also helped force a vote on returning to an elected school committee.\n132. Nick Varano\nOwner and CEO, the Varano Group\nWant to know where all of Boston’s celebs and athletes go to eat? Just pop into Strega North End, and you’ll quickly find out. At the center of it all is Varano, who’s been a fixture on Boston’s restaurant scene since the early aughts and continues to bring glitzy, fun experiences to Boston diners as co-owner of Fratelli and Frank & Nick’s at the Encore Boston Harbor.\n133. Lynn Dale\nOwner, Lynn Dale Events\nA trustee of Boston Ballet and an adviser at the MFA and the BSO, Dale is like a human nuclear reactor. Meanwhile, her successful event-planning business organizes some of the city’s swankiest soirees (including charity galas), taking them from drab to fab every time.\n134. Maggie Gold Seelig\nFounder, MGS Group Real Estate\nYes, she’s the one who sold Tom Brady and Gisele Bündchen’s amazing Brookline mansion. Lots of other high-end homes in and around Boston as well. Seelig is also serving on the American Repertory Theater Board of Advisors.\n135. Kate Cook\nChief of Staff, Governor Maura Healey\nShe is the gateway to the new governor (second only, some say, to Healey’s partner Joanna Lydgate). Cook was a major player in Governor Deval Patrick’s office, so she knows the ins and outs of statehouse politics and policy. More recently, she was Healey’s first assistant in the attorney general’s office, meaning she has the governor’s full trust and confidence.\n136. Nikko Mendoza\nState director, Senator Elizabeth Warren\nMendoza isn’t just Warren’s eyes and ears—and frequent stand-in—here at home; she’s also a super-connected go-to for everybody in Massachusetts politics and beyond. The former staffer for Governor Deval Patrick and Mayor Thomas Menino reminds some of a former political director for Senator John Kerry: Ayanna Pressley.\n137. Katie O’Leary\nDirector of Recovery, North Suffolk Community Services\nCharlestown-raised O’Leary has quietly become a catalyst for change in a region that continues to struggle with addiction-related issues. Case in point: She’s helped open three new recovery facilities, namely StepRox in Roxbury, Recovery on the Harbor in East Boston, and, most recently, Hanton House in Chelsea.\n138. Diane Hessan\nCEO, Salient Ventures\nLast April, Hessan—who’s also the chair of C Space and Brightcove—hosted a get-together of innovators; it was there that future Governor Healey met Yvonne Hao, whom she would name the state’s head of economic development. That’s not an anomaly: The Wall Street Journal recently called Hessan “one of the best-connected business figures in Boston—and something like a password-keeper at a speakeasy for six-figure job seekers.”\n139. Marlo Fogelman\nFounder and CEO, Marlo Marketing\nTalk about influential: Former Governor Baker and Mayor Wu are among the bigwigs who get a copy of Fogelman’s “Marlo Monthly” newsletter—highlighting exciting news from her clients, including Lawn on D and restaurants such as Kelly’s and Yvonne’s. Not content to rest on her laurels, Fogelman—who celebrated her firm’s 19th anniversary last month—has grown her business from a public relations firm into a full-service integrated marketing and creative agency.\n140. Chimel “Real P” Idiokitas\nDJ, producer, and event curator\nTo simply call him a DJ does Real P a disservice. He’s an educator, a mentor, a businessman, and, above all, someone with a knack for bringing people together. His Silk R & B parties attract thousands of Boston’s Black and Latino residents to venues such as Big Night Live. He also serves as the assistant vice president for city and community affairs at Northeastern.\n141. Julie Gordon\nPhilanthropist\nA scion of the Brahmin Sprague clan, she’s the ringleader of the fortysomething social set that gets things done. A former chair and current board member of the mega- fundraiser Party in the Park for the Emerald Necklace Conservancy, she’s also an adviser at Boston Ballet, and she carefully, quietly oversees much of her family’s support for countless nonprofits.\n142. Jimmy Hills\nHost, “Java With Jimmy”\nEarly in the pandemic, Hills turned on a web camera, started a Facebook livestream, and became “a one-stop shop” for the community to find health information, as Mayor Wu recently put it. Hills’s connections from his years in government and advocacy, and his impressive interviewing skills, have turned a simple COVID-inspired production into a popular show that gets everyone from Ayanna Pressley to Maura Healey as guests.\n143. Susan Paine\nPhilanthropist\nHer perfectly lovely and ladylike appearance—punctuated by a coif of white hair—might seem unassuming, but don’t underestimate Paine. The first woman to chair the board of the Museum of Fine Arts and the Boston Symphony Orchestra, she has the ear of everyone who matters to go with the skills of a Fortune 500 CEO.\n144. Oompa\nRecording artist\nA poet, rapper, and vocalist born and raised in Roxbury, Oompa found her voice as an orphaned, queer woman navigating Boston’s music scene, then fought to carve out a space in a music industry that rarely embraces unique artists who refuse to compromise themselves. Her new song “Think Too Much”—and the overwhelming response to it—is proof positive that 2023 will be her biggest year yet.\n145. Uzo Erlingsson\nFounder and Managing partner, Haegrun Holdings\nA Nigerian-born MD with a specialty in genetics, Erlingsson created Haegrun Holdings, a VC firm that backs small, women-owned startups. In her spare time, she moves modestly and quietly among the highest echelons of medicine and philanthropy as a founding partner of innovator FHIOS Health, a cofounder of LEAS Lab, and a board member of the Trustees.\n146. Frank DePasquale\nFounder, DePasquale Ventures\nNot satisfied with his eight restaurants, deli, and bakery, DePasquale recently helped Giovanni Oliva’s widow reopen Trattoria Pulcinella and is even feeding gamblers at Encore Boston’s new sportsbook. And coming in June, he’ll be throwing open the doors to Umbria, a three-story restaurant on Hanover Street with a rooftop lounge that’s sure to become a gathering spot for the city’s movers and shakers.\n147. Jim Sullivan\nPresident and CEO, NWN Carousel\nEnjoy working from your couch? You may have Sullivan to thank for that. His Boston-based cloud communications service provider currently powers hybrid work for more than 7,000 organizations and counting in North America, with $1 billion-plus in sales. He’s also leading a company that makes its own employees happy: NWN Carousel was recognized by Comparably as a “Best Place to Work” in 2022.\n148. Na’tisha Mills\nProgram manager, Embrace Boston\nAs the muscle behind Embrace Boston’s activities and events (including the MLK monument on the Common), Mills has proven to be an essential part of an essential local organization. Equally as important, the twentysomething powerhouse is also committed to ensuring a more equitable and fairer Boston for all residents as a member of Mayor Wu’s Reparations Task Force.\n149. Sinesia Karol\nOwner, Sinesia Karol\nYou could hear the private jets lining up from Hanscom to Beverly when Karol threw her daughter’s elaborate wedding in Arizona last November, and in February, she hosted a splashy fashion show featuring her eponymous swimwear line to benefit the Breast Cancer Research Foundation at the White Elephant in Palm Beach. Trust us, she’s got juice.\n150. Daniel Kwan and Daniel Scheinert\nFilmmakers\nGoing to college in Boston became so much cooler this past March when Oscars viewers everywhere saw these two Emerson grads—’09 and ’10—take the stage three times, accepting Best Picture, Best Director, and Best Original Screenplay awards for Everything Everywhere All at Once. (This after Jennifer Coolidge—Emerson ’85—won a Critics’ Choice Award for White Lotus.) Are “the Daniels” Boston’s new, slightly nerdier Ben and Matt? Only time will tell.\nPhoto Credits: Ken Richardson (Healey, Pizzuti Henry, Kewalramani, Iselin, Idowu, Jemison, Budd, Sheridan, Burlin O’Connell, Francisco, Goldberg, Phillips, Holaday, Collins, Barnes, Miller, Jenkins-Scott, O’Brien); Courtesy of Representative Pressley (Pressley); Mona Miri (Pelton, Wu, Obi); Suffolk Construction (Fish); Matt Kalinowski (Clark, Canales); Courtesy of the New England Patriots/David Silverman (Jonathan Kraft); Courtesy of The Kraft Group (Daniel Kraft); MediaNews Group/Boston Herald/Getty Images (Josh Kraft); Drew Altizer (Edgerley); Courtesy photos (Johnson, Rooney); Greg Mueller/Mueller Design (Klibanski); Wikipedia (Warren); Diana Levine (Rollins, Michlewitz); The Boston Globe/Getty Images (Wieland, Campbell, Moynihan, Churchwell, Gay, Settles); Courtesy photos (Popeo, Thomas); MassMutual (Crandell); NBAE/Celtics/Getty Images (Brown); MediaNews Group/Boston Herald/Getty Images/Stuart Cahill (Kane); Courtesy of UMass (Meehan); Courtesy photo (Reynolds); Moderna (Bancel); Marilyn Humphries (Calderón-Rosado); Douglas Leavy (Shah); Courtesy photos (Sclar, Jackson, Phelan, Percelay, Regan); New Balance (Jim Davis); John Goodman (Fialkow); Tyson Reist (Stamler); TD Garden (Latimer); Courtesy photo (Jeffries); Nikki Monet (Collier); Stephen Voss (Kendi); Jessica Rinaldi/The Boston Globe/Getty Images (Chambers); MediaNews Group/Boston Herald via Getty Images (Curry); Courtesy photo (Davis); Matt Winkelmeyer/Staff/Getty Images (Rangan); Paul Marotta/Stringer/Getty Images (Slater); Boston Globe/Getty Images (Kornbluth, Grousbeck, Francis, Kennedy, Lydia Edwards, Greenstreet, Hayes, Higgins, Cox, Douglas); Museum of Fine Arts, Boston (Teitelbaum); Courtesy photos (Palandjian, Smith, Sykes, Martin, Bhatti, Steinmetz, Cooke, Sharma, Grace Lee); Thomas Hart Shelby (Barbara Lee); Trevor Reid (Lowrey); DraftKings (Robins); Mitch Weiss (Campion); Emmanuel Appiah Boakye (Grace); David Yellen (Boch Jr.); Tara Bricking/MediaNews Group/Boston Herald/Getty Images (Meyer Jr.); Liza Voll Photography (Medvedow); Courtesy photos (Schuster, Alarco, Bell, Jamison, Uzzell, Jones); International Brotherhood of Teamsters (Sean O’Brien); Karen Greisdorf (Vasallo III); NBC10 Boston (Latoyia Edwards); The Boston Foundation (Espinoza-Madrigal); Twelfth Baptist Church (Bodrick II); Stephanie Berger (Peggy Fogelman); Goff-AEW (O’Neil); Courtesy photos (Craig Oquendo, Bascome, Walsh, Moran, Miller, Papachristos, Tanaka, Walker, Franklin); Christopher Churchill (Dagesse); Susan Lapides (Paulus); Cody Pike (Johnson); The Boston Foundation/hmarieb (Hires); Kure Creative (Duverné); Boston Arts Academy Foundation (Denella Clark); Joanne Smith (Boland); WBUR (Martinez); Nic Supple (Thao); Cheryl Richards (Harker); Courtesy of TJX (Herrman); Commonwealth of Massachusetts (Tutwiler); Michael Blanchard (Kassia Davis, Varano); Vania Arroyo (Mejia); Flavio Photography (Dale); Rachel Gianatasio/MGS Group (Gold Seelig); Boston Bar Association (Cook); Courtesy photos (Mendoza, O’Leary, Idiokitas, Erlingsson, DePasquale, Sullivan); Sam Moody (Hessan); Ellen Callaway (Marlo Fogelman); MediaNews Group/Getty Images (Gordon); YouTube (Hills); Hilary Scott (Paine); OJ Slaughter (Oompa); The City of Boston (Mills); Alexander Tamargo/Getty Images (Karol); John Sciulli/Getty Images (Kwan and Scheinert).",
  "word_count": 10742,
  "scraped_at": "2026-02-14T12:15:09.018749"
}