{
  "article_id": "b2ea13c37a30",
  "url": "https://www.prokerala.com/news/articles/a1510568.html",
  "title": "Germany beat Netherlands to qualify for Paris Olympics in women football",
  "date": "20240229T063000Z",
  "domain": "prokerala.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "The Hague Feb 29 : Germany secured a place at the 2024 Paris Olympics women's football event with a 2-0 win over the Netherlands in the UEFA Nations League's third-place play-off.\nKlara Buhl and Lea Schuller struck second-half goals to give Germany victory in Heerenveen and, with it, the bronze medal and Europe's third berth in the Olympic women's football tournament alongside Spain and hosts France.\nThe third-place play-off in the Nations League was the last chance for the two teams to qualify for Paris 2024. Spain captured a ticket last Friday by defeating the Netherlands 3-0 in Seville in the semifinals of the tournament, while France, already assured an Olympic spot as the host, beat Germany 2-1.\nFollowing this win, Germany joins Spain, who clinched the Nations League title by defeating France 2-0, and the host nation France, as the three European representatives in the Olympic women's football tournament.\nGermany have participated in five of the seven Olympic women’s football tournaments. They won gold in 2016 at Rio Olympics (but did not qualify to defend the title in 2021) and also took bronze in 2000, 2004 and 2008.\nA total of 12 teams will play in the women’s football tournament at the 2024 Games. Matches will be played in Bordeaux, Decines, Marseille, Nantes, Nice, Paris (with the final at Parc des Princes) and Saint-Etienne.\nAlso qualified so far are defending champions Canada, Australia, Brazil, Colombia, Japan, New Zealand and four-time winners the United States, with two teams from Africa to be decided in April.",
  "word_count": 255,
  "scraped_at": "2026-02-14T12:47:32.688806"
}