{
  "article_id": "b30f16b4fd0b",
  "url": "https://www.ksl.com:443/article/51293776/utah-royals-drop-3rd-straight-still-searching-for-1st-win-of-season",
  "title": "Utah Royals drop 3rd straight ; still searching for 1st win of season",
  "date": "20250412T081500Z",
  "domain": "ksl.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Estimated read time: 2-3 minutes\n- The Utah Royals lost 1-0 to Portland Thorns, marking their third straight defeat.\n- Rising star Ally Sentnor hasn't scored this season and Royals struggle offensively.\n- Coach Jimmy Coenraets emphasizes need for improvement with the next match against the Chicago Stars.\nSANDY — The two-week international break did not help jump-start the season for the Utah Royals.\nFour games into the 2025 campaign and the Royals are still searching for their first win after a draw in the season opener and a loss in the last three contests since then.\nThe most recent was Friday's 1-0 home loss to the Portland Thorns, marking two games in a row without a goal scored for the ice-cold team from Utah.\nEven more concerning for Utah may be the fact that rising star Ally Sentnor has yet to score this season for the Royals after getting her first goal with the U.S. women's national team earlier this year.\nPortland's Reilyn Turner got the lone goal of the evening on an assist from Hina Sugita in the 14th minute as Utah lost track of the ball in its own box and the Thorns took advantage.\n\"All of a sudden, you don't have to score one goal, we have to score two goals,\" head coach Jimmy Coenraets said of the early deficit. \"It's already very hard for us to score a goal at the minute, but all of a sudden you have to score two.\"\nReilyn Turner scores to send the Thorns home with the W and 3 points 🌹\n— National Women's Soccer League (@NWSL) April 12, 2025\nUtah vs. Portland highlights, presented by @Nationwidepic.twitter.com/Mus3eZqgdO\nThe injury report continues to give and take, with Ana Maria Guzman making her NWSL debut for the Royals after a preseason injury, but Mina Tanaka joining the infirmary with a hamstring injury she picked up with the Japan national team.\n\"We do have injuries, but that is not the issue,\" midfielder Claudia Zornoza said. \"We need to keep working harder. We should all be giving more, but it's not the injuries that are causing this difficulty.\"\nGuzman came on in the 70th minute and almost immediately sent a long ball into the far side of the goal, but Portland keeper Bella Bixby got to it to earn her second clean sheet of the season with the U.S. national team goalkeeper coach watching in the America First Field stands.\nUtah natives Brecken Mozingo and KK Ream also had chances on goal but were unable to put a shot on frame as the Royals finished with just one shot on target from nine total attempts.\n\"We need to be better,\" Guzman said. \"We need to be more aggressive and work more as a team in order to move forward.\"\nThe Royals stay at home for next Friday's match against the Chicago Stars at 7:30 p.m. MDT.",
  "word_count": 483,
  "scraped_at": "2026-02-14T12:24:05.602441"
}