{
  "article_id": "b3140f5c6ffc",
  "url": "https://www.wrestlezone.com/news/1534667-wwe-smackdown-viewership-decreases-demo-also-drops-against-cfp-game",
  "title": "WWE SmackDown Viewership Decreases Against CFP Game",
  "date": "20250114T043000Z",
  "domain": "wrestlezone.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WWE SmackDown saw another decrease in viewership on January 10.\nAccording to Wrestlenomics (via Programming Insider), SmackDown averaged 1.436 million viewers on Friday. The show drew a 0.40 rating in the 18 to 49 demographic. The viewership is down from last week’s episode when an average of 1.528 million viewers tuned in. The demo rating is also down from last week’s show (0.45 rating in the same demographic).\nSmackDown ranked #2 in the 18-to-49 demographic on cable. The show was up against the College Football Playoff game between Ohio State and Texas (19,598,000 viewers and a 4.95 P18-49 rating) on ESPN).\nWhat happened on WWE SmackDown this week?\nThis week’s show kicked off with a promo from Paul Heyman who asked Cody Rhodes to come to the ring. Heyman informed Rhodes he’s coming after the Undisputed WWE Championship. Kevin Owens interjects and the two brawl as Jacob Fatu and Tama Tonga try to attack Heyman who is saved by Jimmy Uso.\nChelsea Green successfully defended the Women’s United States Championship picking up a win over Michin.\nElsewhere on the show, Bayley won a four-way over Nia Jax, Naomi, and Bianca Belair to earn the right to challenge Tiffany Stratton next week on SmackDown.\nIn the main event of the evening, Jacob Fatu and Tama Tonga picked up a win over Cody Rhodes and Jimmy Uso.\nREAD MORE: WWE Women’s Title Match Set For 1/17 WWE SmackDown\nWhat did you think of WWE SmackDown this week? What was your favorite match or segment? Let us know your thoughts by sounding off in the comments section below.",
  "word_count": 265,
  "scraped_at": "2026-02-14T12:58:09.370261"
}