{
  "article_id": "b317f7539b19",
  "url": "https://www.12news.com/article/news/nation-world/netflix-streaming-its-first-nfl-games/507-3e39c446-a164-487d-88c9-9a4ba95aaa1b",
  "title": "Netflix hoping for no streaming issues as it hosts its first NFL games",
  "date": "20241221T190000Z",
  "domain": "12news.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "WASHINGTON — Netflix is planning to provide plenty of gifts for viewers of its two Christmas Day games, including Mariah Carey kicking it all off with a taped performance of \"All I Want for Christmas is You.”\nYet, Netflix executive Brandon Riegg realizes it all amounts to a lump of coal if there are streaming problems.\nRiegg, vice president of nonfiction series and sports, has had to answer plenty of questions about the streaming giant's readiness for the influx of viewers on what could be its biggest day ever, especially after streaming problems during the Nov. 14 fight between Jake Paul and Mike Tyson.\n\"The sheer tonnage of people that came to watch was incredible. And for all the testing that the engineering team had done ahead of that, and I think they’re the best in the business, the only way to test something of that magnitude is to have something of that magnitude,” Riegg said. “We never want to have technical issues or a disappointing experience for our members. There was a subset of people that were watching that struggled with that and we acknowledge that. The good news is they stress-tested the system to such a degree that there’s a lot of these fixes and improvements that they realized that they could make, and they’re applying all that stuff.”\nNetflix has two games Wednesday, starting with a two-hour pregame at 11 a.m. EST before the Pittsburgh Steelers host the Kansas City Chiefs. The second game between the Baltimore Ravens and Houston Texans kicks off at 4:30 p.m. EST.\nThe games will be available to Netflix's 282.3 million subscribers in over 190 countries, marking the first time one outlet has distributed an NFL game globally.\nMany observers had not expected Netflix to make a foray into carrying games for one of the four major sports leagues.\nThe NFL games, though, are part of a pronounced push by Netflix to become a destination for all sports fans. On Friday, it secured the U.S. rights for the 2027 and 2031 FIFA Women’s World Cup.\nNetflix's worldwide partnership with World Wrestling Entertainment will begin on Jan. 6 when “Monday Night Raw” moves to the streaming service.\nNetflix said the Tyson-Paul fight was viewed by a worldwide audience of 60 million and peaked at 65 million concurrent streams, including 38 million concurrent streams in the United States.\nAccording to the website Down Detector, nearly 85,000 viewers logged problems with outages or streaming leading up to the fight.\nBy comparison, the largest audience for a streamed-exclusive NFL game was 23 million on Peacock for last season's AFC wild card game between the Miami Dolphins and Chiefs. For a regular-season game, it was 17.3 million on Amazon Prime Video on Dec. 5, when the Detroit Lions rallied to beat the Green Bay Packers.\nNielsen will measure the ratings for the Christmas Day games, with early numbers expected late afternoon on Dec. 26.\nThe games will air on CBS affiliates in Kansas City, Pittsburgh, Baltimore and Houston as part of a long-standing league policy where games that are on cable or are being streamed must also be on an over-the-air station in the markets of the competing teams.\nThe heaviest demand will likely come around 6 p.m. EST, which would be halftime of the Ravens-Texans game and when Beyoncé will be performing.\nThe games are the first in a three-year deal for Netflix, which also has one game apiece in 2025 and ’26. Netflix is paying $150 million for this year's package.\nWhile acquiring a season-long package of games does not fit with Netflix’s philosophy, doing games on Christmas Day made sense.\nMike North, the NFL’s vice president of broadcast planning, said in May when the schedule was announced that the league wasn't thinking about putting games on Christmas this year because it falls on a Wednesday. The increased ratings, though, made it impossible to pass up.\nLast year’s three Christmas games averaged 28.68 million viewers. The early afternoon contest between the Las Vegas Raiders and Chiefs led the way, averaging 29.48 million.\nNFL owners approved doing two games on Christmas during its spring meetings in March. Shortly afterwards, Netflix expressed its interest.\nNetflix already had a relationship with the league through the “Quarterback” and “Receiver” series.\n“It’s sort of an event. It’s not just a random Week 17 game,” Riegg said. “My north star to everyone has been this needs to feel warm, festive, family and fun. We're really going to try to make it feel elevated and something that feels consistent with what holiday represents.\"\nNetflix is also trying to make this a family affair with its announcers. The father and son duo of Ian and Noah Eagle will be the play-by-play announcers, JJ Watt will be the analyst for Chiefs-Steelers as his brother, linebacker TJ Watt, tries to limit Chiefs QB Patrick Mahomes.\nBrothers Jason and Devin McCourty will be part of the pregame crew from Pittsburgh, with Laura Rutledge serving as host.\nIan Eagle will call the game in Pittsburgh with Watt and Nate Burleson as the analysts. Melanie Collins and Stacey Dales will be the sideline reporters.\nNoah Eagle and Greg Olsen have the action in Houston with Jamie Erdahl and Steve Wyche reporting from the sidelines.\nThere will also be a crew anchoring pregame, halftime and postgame coverage throughout the day from NFL Network's studios in Inglewood, California. Kay Adams will be the host with analysis from Drew Brees, Robert Griffin III, Mina Kimes and Manti Te'o.\nNFL Network's Ian Rapoport and CBS Sports rules analyst Gene Steratore will also be part of the coverage.\nCBS Sports will produce the games, with NFL Media producing studio programming. EverWonder Studio will executive produce NFL Christmas Gameday.\nHans Schroeder, the executive vice president of NFL Media, said he has been impressed by Netflix's efforts and planning.\n“It’s going to feel like a high-quality football experience, but also a global event. I think they’ve done an incredible job delivering that vision,” Schroeder said.\n___\nAP NFL: https://apnews.com/hub/nfl",
  "word_count": 1004,
  "scraped_at": "2026-02-14T12:34:14.251121"
}