{
  "article_id": "b31a8e6ed390",
  "url": "https://www.namibian.com.na/womens-super-league-to-clean-up-katutura/",
  "title": "Women Super League to clean up Katutura",
  "date": "20230623T194500Z",
  "domain": "namibian.com.na",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Led by the Brave Gladiators, the FNB Women’s Super League stars will conclude their season with a clean-up exercise around Katutura in Windhoek on Sunday.\nFootball lovers and the public are encouraged to be part of the community initiative and get to mingle with the women’s top-flight footballers.\n“All volunteers wishing to join the Brave Gladiators and Women Super League players are invited to assemble at the NFA Football House at 09h00. The City of Windhoek committed rubbish bags and protective hand gloves to assist the clean-up campaign,” Brave Gladiators defender Lovisa Mulunga, the brains behind the women’s football charity campaign, said in statement on Friday.\nMulunga, of league champions Tura Magic, added that: “The girls feel duty-bound to do some community work by cleaning Katutura among other suburbs. Our community service is not limited to Katutura only, we are considering other charitable initiatives.”\nFor further information on the clean-up campaign, contact Lovisa Mulunga at +264-857-368-031 or Veronica van Wyk at +264-812-016-036.\nThe FNB Women’s Super League concluding fixtures are as follows:\nFriday – Ramblers v Omaheke Queens, NFA Centre 19h00;\nSaturday – V Power Angels v Nust Babes, Unam Stadium 09h00; Arrows Ladies v Namib Daughters, Unam Stadium 11h15; Unam Bokkies v Omaheke Queens, Unam Stadium 13h45; Girls & Goals v Khomas Nampol, NFA Centre 11h30; Ramblers v Ongwediva Queens, NFA Centre 13h45; Rightway Phoenixes v Tura Magic, NFA Centre 16h00; Okahandja FC v Beauties FC, Nau-Aib Stadium 13h45.\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 344,
  "scraped_at": "2026-02-14T12:45:33.947585"
}