{
  "article_id": "b322bc39979f",
  "url": "https://www.arsenal.com/news/no-more-red-mural-community",
  "title": "A mural for the community , by the community",
  "date": "20230112T140000Z",
  "domain": "arsenal.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "A No More Red mural has been installed in Islington's Rosemary Gardens in a joint community effort to inspire our young people.\nA collaboration between Arsenal and adidas, the mural was created by artist Stazzy as a visual representation of the voices of our community. Beforehand, Arsenal in the Community staff and coaches spoke to young people about what our community meant to them.\nThe importance of positive role models to aspire towards is a key element of the artwork, which features Aaron Ramsdale, Vivianne Miedema, Emile Smith Rowe, and Gabriel Martinelli. Our current Gunners are portrayed alongside Arsenal legend Ian Wright, who was also present at the mural's unveiling.\nStanding beside the finished mural, Stazzy said: \"We did this in the community because we wanted to create an inspiring piece of art. When the kids are playing football on the pitch, they'll be able to look up and be inspired and hopefully take steps forward in their careers.\"\nIslington Council leader, Kaya Comer-Schwartz, reiterated the council's support of the No More Red campaign and for Arsenal's work in the community as a whole.\n\"As a council, our number one priority is making sure that Islington is the best possible place to grow up, and we need to make sure that part of that is keeping our children safe. We know how important it is that we tackle knife crime.\n\"What's always struck me is that a teenager is going through a lot in their life and having role models, having people around to support and inspire them, is a huge opportunity. It's huge to have a well-known name like Arsenal where supporting our young people is really steeped in its values.\n\"Part of the No More Red campaign which I've loved is that of course, it's about football and giving people opportunities in sports but it's also about backing their passion for art or music or politics. It sees young people for all that they want to be back to them and I think that's a wonderful endorsement.\"\nCheck out the mural in full through our photo gallery below.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 377,
  "scraped_at": "2026-02-14T12:59:59.618532"
}