{
  "article_id": "b3850a73e229",
  "url": "https://www.birminghammail.co.uk/news/showbiz-tv/love-blind-uk-star-reveals-29862604",
  "title": "Love Is Blind united kingdom star reveals  shame  of endometriosis battle",
  "date": "20240903T193000Z",
  "domain": "birminghammail.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Love Is Blind UK star reveals 'shame' of endometriosis battle\nHer symptoms were so bad she once mistook the pain for a miscarriage\nLove is Blind star Demi Brown has revealed how it took years of 'crippling' pain before she was finally diagnosed with endometriosis. Demi told how she felt 'shame' and was told her symptoms were 'just a painful period'.\nThe Netflix star would also suffer with numb legs, severe back pain and sickness which left her bed-bound for days. She even once mistook the pain for a miscarriage.\nIt was only when she was 25 that she was finally 'taken seriously' and referred to a gynaecologist. But she recalled how she 'broke down' in tears when medics diagnosed her with endometriosis and said she may have to go through IVF to conceive.\nREAD MORE: Baby P's dad says Tracey Connelly 'can go to hell' as killer ends up back behind bars\nDon't miss the biggest and breaking stories by signing up to the BirminghamLive newsletter here.\nDemi said doctors discovered she had a fibroid - which Black women are more likely to develop than white women - before she had investigative surgery in 2019. But she was completely devastated when medics told her she had the condition, Mirror reports.\nDemi said: \"I broke down. After they told me, I was like \"I want my mum\". No one was in there with me. It was just me. I had just woken up from the anaesthetic. I remember my mum came into the room and I just started crying. I just literally cried and cried.\"\nEndometriosis affects 1.5 million people in the UK. It takes on average 8 years 10 months from the first GP visit to get a diagnosis, according to charity Endometriosis UK.\nThe chronic inflammatory condition causes tissue similar to the lining of the uterus to grow on areas such as the ovaries, intestines, bladder and bowels. Treatment for the condition also costs the UK economy £8.2bn a year.\nThe reality star shared her diagnosis with her fiancé Ollie on Love is Blind. Demi, who played Sunday league football, said she began to suffer heavy bleeding at the age of 13 after starting her period.\nThe symptoms later developed into numb legs, severe back pain and a car-sickness-like feeling which would leave her bed-bound. She said: \"My teachers used to moan at me for going to the toilet.\n\"But I used to change a lot more than my peers. I used to dread being on my period if there was a big football match coming up. I used to dose up on painkillers.\n\"My doctor was saying take two and I’d take four. It was the fear of missing out on opportunities. I was trying to get into an academy and I didn’t want them to know I suffered.\"\nSchool safeguarding and attendance manager Demi said she was misdiagnosed with irritable bowel syndrome and wrongly given physiotherapy for what doctors believed was a sports injury. Her symptoms continued to worsen and at one point she thought she was experiencing a miscarriage.\nThe 30-year-old said: \"In my early twenties I thought I had a miscarriage because the [bleeding] was so heavy and I had to go to the hospital.\"\nThe condition even affected her at work. She said: It’s been embarrassing. There was a time I went to work, I was in a school environment and I leaked all over the chairs. I was so ashamed. I ran to the bathroom to try and clean myself up and have a little cry and try to get on with it.\"\nDemi added: \"I was trying to put on a big front but actually it was making me question my worth and it was making me question a lot of things. I was trying to do a job I couldn’t do at the time because of the condition.\"\nThe reality star claimed women are forced to 'downplay' their symptoms which can delay seeking help. Demi said: \"I feel like there’s even more pressure on Black women.\n\"That’s my opinion. I think it’s taken a lot for women to get where they are but especially Black women. You don’t want to jeopardise it. You want to keep going forward and sometimes you feel like showing the weaker side of you or the more vulnerable side of you, that makes you go ten steps back.\"\nSince being diagnosed, Demi said she knows how to manage her endometriosis better through diet. She said: \"I kind of understand the things that deal with it. But I think the thing that holds weight over me is the fertility journey.\n\"I do want to be a mum. I do want to have children and obviously in an ideal world, I’d naturally conceive. I’ve come to terms with endometriosis.\"",
  "word_count": 802,
  "scraped_at": "2026-02-14T13:30:39.946730"
}