{
  "article_id": "b3db8e5e55c3",
  "url": "https://www.newcastleherald.com.au/story/8921360/cody-nancarrow-trades-cooks-hill-for-magic-in-npl-nnsw-move/",
  "title": "Cody Nancarrow trades Cooks Hill for Magic in NPL NNSW move | Newcastle Herald",
  "date": "20250320T061500Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Belmont Swansea felt hard done by while big guns Broadmeadow felt as though they got out of jail after scoring two late penalties to beat the NPL Men Northern NSW newcomers 2-1 at Blacksmiths Oval on Saturday.\nSubscribe now for unlimited access.\nor signup to continue reading\nBoth penalties came in the space of three minutes for the defending premiers and champions, who trailed 1-0 before producing a great escape in the round-five exchange.\nBelswans, back in Northern NSW Football's top-flight competition after a 26-year absence, went ahead in the 75th minute through Adam Woodbine.\nBut the game turned quickly.\nThe first penalty came on the counter-attack in the 78th minute, when Jarred Baker was adjudged to have been fouled by Belswans keeper Kye Abrahams in the 18-yard box.\nThree minutes later, Samuel Kirk was deemed to have felled Ben Diamond in the area.\nBaker converted both spot kicks.\nBelswans coach Mick Stafford was disappointed by what he described as \"super-soft penalties\" but was pleased to have \"a good crack at a very well-established club\".\n\"We should definitely take a lot of pride out of what we produced against the best team in the league,\" Stafford said.\n\"We peppered their goal. I think their goalkeeper would've been man-of-the-match out of the game. We created a lot of chances and kept them to a minimum most of the game, which was pleasing, but stuff you can't control came into the game, which is sad, and took the points away from us.\n\"Both decisions were poor ... They'll need to be reviewed and hopefully accountability shown there, and everyone can move on and be better all-round.\"\nBroadmeadow rose to 12 points and assumed the outright lead on the points table after Charlestown Azzurri (10) slipped to third following a 1-1 draw with Lambton Jaffas at Lisle Carr Oval earlier on Saturday.\nMagic coach Jim Cresnar described Belswans as \"the hardest team we've played against\" this campaign and conceded his side were \"extremely lucky to get a result\".\n\"They've already upset bigger, stronger teams with results they've had and they're going to be very difficult to play against at home, and even away,\" Cresnar said.\n\"It was a crucial game for us and it was good to get away with three points.\"\nAt Lisle Carr Oval, Azzurri coach Jimmy Pascoe felt the hosts should have held a 2-0 advantage at the break.\nHarrison Frendo headed past Jaffas goalkeeper Ben Kennedy in the 35th minute to ensure Azzurri led 1-0 at the break.\nFrendo also had the ball in the back of the net in the 24th minute only to be ruled offside.\n\"We were probably a bit disappointed,\" Pascoe said.\n\"We had a couple of good chances that we didn't take, and had a goal that was ruled out for offside that clearly wasn't.\n\"You go in at two-nil at half-time and you can probably manage that a little better, and/or take out the fact that a world-class goal might go in against you, and that's what it was. What a strike.\"\nThe equaliser was nothing short of spectacular with Pat Bond launching a long-range missile into Azzurri's net in the 66th minute.\nJaffas coach David Tanchevski felt there were \"some encouraging signs\" after a slow start to the season.\nEdgeworth beat Adamstown 4-0 on Friday night to improve to 11 points and second spot. Flynn Goodman, Joseph Melmeth, Ryan Feutz and Jose Atayde all got on the scoresheet for the Eagles.\nDean Pettit and Hiroumi Ikeda both bagged match braces as Valentine beat Cooks Hill 4-0 on Saturday to post their first win of the season.\nOn Sunday, Newcastle Olympic came from behind three times to beat Maitland 5-3 at Cooks Square Park. Nicholas Cowburn (eighth minute) and Daniel McFarlane (16th minute) gave the Magpies a 2-0 lead early.\nNathan Toby struck back for Olympic, scoring in the 17th minute before McFarlane restored the two-goal advantage in the 29th minute.\nToby pulled a goal back for a second time in the 37th minute then Kale Bradbery scored in the 39th minute to ensure the score was level at 3-3 by half-time.\nAdam Zervas pounced to win the ball and score in the first minute of the second half to give Olympic a 4-3 lead before Bradbery sealed the win in the 68th minute.\nAt Alder Park on Sunday evening, a 10-man New Lambton succumbed 5-1 to Weston.\nNew Lambton's Kent Harrison scored in the 65th minute to cancel out Aaron Niyonkuru's 44th-minute free kick.\nBut the Golden Eagles were reduced to 10 players in the 67th minute when Giles Harrison was sent off for a second yellow card offence after Dylan Christoffersen fouled Weston's Dogen Gyoja on the edge of New Lambton's 18-yard box.\nBurke Fahling scored from the ensuing free kick.\nChris Hatfield then extended the scoreline with a hat-trick of goals, scoring in the 77th, 87th and 92nd minutes.\nOlympic and Weston joined Azzurri on 10 points.\nIn NPL Women on Saturday night, twice-capped Matilda Tara Andrews was in a ruthless mood as she produced a seven-goal haul in New Lambton's 13-1 rout of Broadmeadow at Alder Park.\nBrianna Trappett, Sienna Denholm and Rosie Copus all bagged goal doubles while Larissa Ryan was Magic's sole scorer.\nIt was an important win for the Golden Eagles, who face the second half of their abandoned round-five clash with Adamstown on Wednesday night.\nNew Lambton held a 4-2 lead when the match was abandoned at half-time due to heat on March 16.\nOn Friday night, Azzurri beat Adamstown 3-0 at Lake Macquarie Regional Football Facility.\nAzzurri and Magic are set to meet in a rescheduled fixture at Lisle Carr Oval on Wednesday night.\nMaitland were 3-1 winners over Olympic at Cooks Square Park on Sunday evening. Former South African international Marry Ntsweng scored in the 33rd minute to give the hosts at 1-0 lead at the break.\nCeanna Frost made it 2-0 in the 58th minute before centre-back Tahlia Gossner headed home for a 3-0 advantage in the 61st minute.\nOlympic hit back late with a goal through Kealah Boldery in the 88th minute.\nThe win kept Maitland unbeaten and elevated the Magpies to 13 points, one ahead of Azzurri (12), who have a game in hand while Olympic stayed third on seven points.\nCOOKS HILL YOUNG GUN JOINS MAGIC AS JAFFAS SAY SAYONARA TO IMPORT, March 20, 2025\nNPL Northern NSW youth player of the year Cody Nancarrow has left Cooks Hill for Broadmeadow and could be set for his first match minutes in Magic colours on Saturday.\nNancarrow was Cooks Hill's leading scorer last year, and had the third-highest tally in the league with 16 goals.\nThe 19-year-old was back in black and white this campaign but left the club after scoring a brace in Cooks Hill's 3-1 win over Belmont Swansea on March 7.\nHe has since joined the defending premiers and champions.\nAs Nancarrow is under 20, he can be signed outside of the transfer window.\nBoth clubs said the move was motivated by opportunity.\n\"He's been a great player for us and will be certainly missed,\" Cooks Hill United Football Club president Mitch McPherson said.\n\"But we're aware that the big clubs of Newcastle are able to offer things to talented young blokes like Cody that we just can't, particularly promises of B [national second-tier] league and things like that.\n\"We wish him all the best.\"\nAn added incentive for NPL premiers this year is the chance to play in the newly created Australian Championship, a national second-tier competition.\nThe Australian Championship will be played between October and December and comprise 16 teams, including the eight premiers from the NPL competitions around Australia.\nMagic, who sit atop the competition standings with Charlestown after four rounds, are hoping to defend their premiership and book entry into the Australian Championship.\n\"He is a very talented player,\" Broadmeadow coach Jim Cresnar said.\n\"He wanted to look at opportunities at Magic. He was looking for an opportunity to play with the likes of Bailey Wells and Jack Simmons.\"\nCresnar said Nancarrow would be considered for squad selection on Saturday (4.30pm), when Magic travel to Blacksmiths Oval to play Belswans.\n\"It's going to be a challenging game for us,\" Cresnar said.\n\"They've got a lot of enthusiasm and are well-coached by Mick [Stafford], so it's going to definitely be a very difficult game for us.\n\"I've watched them a few times and they've got some good players and good strengths.\"\nIn other NPL squad news, Lambton coach David Tanchevski confirmed the club and Japanese import Yuhei Sato had parted ways.",
  "word_count": 1437,
  "scraped_at": "2026-02-14T12:49:20.650953"
}