{
  "article_id": "b3ea3c8d8a6b",
  "url": "https://www.thenationalnews.com/opinion/comment/2025/05/28/no-uk-politician-including-starmer-will-overturn-brexit-but-thats-ok/",
  "title": "No united kingdom politician including Starmer will overturn Brexit , but that OK",
  "date": "20250528T084500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Here’s a prediction. Future historians will look back on just 16 words and reflect on the extraordinary self-harm they caused the UK in the first quarter of the 21st century. Those 16 words are: “Should the United Kingdom remain a member of the European Union or leave the European Union?” That was the question asked in 2016 of UK voters over the age of 18 who took part in their country’s supposedly “advisory” Brexit referendum.\nHistory teaches that future generations sometimes look back on their ancestors and wonder: “What on Earth were they thinking?” Brexit already fits into that category. Vote Leave narrowly won the referendum and the UK left the EU. But far from ending arguments about the country’s relationship with Europe, these arguments have never gone away. They have intensified in almost a decade of recriminations, regret, rethinks and now renegotiations.\nOne result is the miserable state of the UK’s Conservative party that brought its people Brexit. They are in deep trouble, intellectually adrift, led (for now at least) by the hapless Kemi Badenoch, bereft of ideas, lacking real talent and facing challenges from the right and Nigel Farage’s Reform UK party. It would of course be foolish to underestimate the survival instincts of the party of Benjamin Disraeli, Winston Churchill and Margaret Thatcher. The Tories will probably recover eventually.\nBut Brexit won’t. Brexit is already brain dead, clinging on life support.\nPrime Minister Keir Starmer’s government is reluctant to bury it, at least for now. But they appear to be gradually changing UK-EU relations towards something that looks like Brexit in name only, with their new deal to reduce trade friction and costly border bureaucracy. This will eventually enable UK goods and holidaymakers to pass more rapidly through European seaports and airports. These and other changes have been welcomed by supermarkets, retailers, exporters and meat and food processors across the country, plus many individual businesses and trade organisations, and by the public.\nThe deal is of course opposed by the people who helped bring the country the Brexit fiasco – Ms Badenoch and Mr Farage. They claim the new deal is a “betrayal” of the referendum result. But since the referendum was a supposedly “advisory” vote on that vague 16-word question, the Brexit bunch are left fighting yesterday’s political battles.\nIt is true that since 1945, UK politicians have constantly argued and dithered about their country’s relationship with Europe. After the Second World War, as former US secretary of state Dean Acheson memorably put it, “Great Britain has lost an Empire and not yet found a role”. Mr Acheson believed the obvious role meant the UK joining with other Europeans.\nUS President Donald Trump’s “America First” policies may confirm that observation and accelerate that process in future. Even so, the UK has often been reluctant to accept that its islands are tied by geography and history to the European continent just 40 kilometres from its shores. In 1952, France and Germany created the European Coal and Steel Community, followed in 1957 by the European Economic Community (later the EU). The UK did not get on board until 1973. Later, Mrs Thatcher negotiated hugely beneficial terms for the UK in the EU, but Brexit upended all that and upended her Conservative party too.\nFormer prime minister Boris Johnson ruthlessly got rid of Conservative MPs who opposed the UK’s exit from the EU. The resulting Brexit deal was a mess of trade restrictions, border checks, bureaucracy, long queues of lorries and forlorn UK holidaymakers delayed at EU passport control. This debacle explains why the Conservatives are currently enduring their fourth leader in three years under Ms Badenoch. Astonishingly, the Tories are now so unpopular in opinion polls that they lie fourth behind the governing Labour party, the Liberal Democrats and the upstart Reform UK.\nThree things are now absolutely clear.\nFirst, the UK’s people overwhelmingly think Brexit was a mistake. Second, while few politicians dare speak about “overturning” Brexit, the “reset” announced by Mr Starmer is the beginning of the end for the Brexit delusion. Third – unfortunately – it is unlikely that the UK will ever achieve in future as good a deal with the EU as that negotiated by Mrs Thatcher in the 1980s.\nEven so, the world has changed unimaginably since the 2016 vote – changed by Russia’s full-scale invasion of Ukraine, Mr Trump’s unpredictability and the constant threats about trade wars and tariffs. More positively, many European governments understand the value of the UK’s defence industry, its military and its support for a secure Europe. Many people in the UK also now more clearly understand their common European home and the need to work together with their closest neighbours, friends and trading partners.\nRecent YouGov polling reflects how the public mood has changed. Almost two thirds (62 per cent) of Britons think Brexit has failed. More than half (53 per cent) say they would vote to rejoin the EU. Unfortunately, rejoining doesn’t appear to be an option. And if the UK’s people ever vote in any future referendum, it needs to be more carefully constructed than that vaguely phrased sentence of 16 ill-defined words that got the country into the Brexit mess in the first place.",
  "word_count": 871,
  "scraped_at": "2026-02-14T12:53:36.761729"
}