{
  "article_id": "b3ecea221b8a",
  "url": "https://www.anglocelt.ie/2025/05/16/fridays-briefing-man-utd-and-tottenham-focus-of-premier-league-games/",
  "title": "Friday briefing : Man Utd and Tottenham focus of Premier League games",
  "date": "20250516T103000Z",
  "domain": "anglocelt.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Friday’s briefing: Man Utd and Tottenham focus of Premier League games\nBy PA Sport Staff\nManchester United and Tottenham continued to fine tune preparations for the Europa League final – but first both clubs will be back in Premier League action on Friday night.\nCharlton beat Wycombe to reach the Sky Bet League One play-off final at Wembley.\nFriday will also see focus turn towards the FA Cup final between Manchester City and Crystal Palace.\nRuben Amorim – focus on Stamford Bridge not Bilbao\nManchester United boss Ruben Amorim says there is still time for players to secure their place in his Europa League final line-up as they look to head to Bilbao buoyed by a morale-boosting win at Chelsea.\nThis is comfortably United’s worst season of the Premier League era, with the 16th-placed side travelling to London looking for some much-needed positivity having lost 2-0 at home to West Ham last time out.\n“The best way is to face the game like we should face the game – it is to win the game,” Amorim said of Friday night’s clash at Stamford Bridge.\n“We need to perform, we need to win points in the Premier League and that is the feeling.\n“We have time to recover (after Chelsea). The best thing to prepare for the final is to play the game and then the players have to understand that if you play or don’t play against Chelsea, it means nothing to the final. That is important.”\nBig Ange set to ring the changes\nTottenham boss Ange Postecoglou has hinted at wholesale changes for the trip to Villa Park.\nSpurs have been rocked by Dejan Kulusevski becoming the latest key player to suffer an injury ahead of Wednesday’s showpiece in Bilbao against Manchester United.\nKulusevski sustained a right knee injury in Sunday’s 2-0 home defeat to Crystal Palace to join Lucas Bergvall and James Maddison on the treatment table.\nPostecoglou decided to rest Guglielmo Vicario, Cristian Romero, Micky van de Ven, Destiny Udogie, Brennan Johnson and Dominic Solanke after they sealed progression into the Europa League final.\n“Look, in a normal world you use this to be sharpening up but we’re not living in a normal world,” the Spurs boss said.\n“That’s the reality of our existence at the moment where we can’t lose another player to an injury. It’s just too finely balanced for us considering what’s at stake.”\nAddicks book Wembley date\nMatty Godden’s late strike sent Charlton through to the League One play-off final after a 1-0 win over Wycombe at The Valley.\nGodden scrambled the only goal over the two legs after 171 minutes of attritional football to secure a Wembley date against Leyton Orient on May 25.\nAddicks boss Nathan Jones sunk to his knees as fans invaded the pitch in emotional scenes after the final whistle.\nLloyd Jones had earlier missed a golden chance for Charlton, while Kayne Ramsay made two stunning blocks to deny Wycombe.\nPhallon Tullis-Joyce up for the cup\nPhallon Tullis-Joyce admits she is “pretty astounded” by the progress she has made as the Manchester United goalkeeper’s impressive season nears its conclusion with the FA Cup final against Chelsea on Sunday.\nAfter joining in 2023, the American spent her first year with United as understudy to Mary Earps, sitting on the bench throughout their Women’s Super League campaign, as well their FA Cup run which ended with the trophy after a 4-0 victory over Tottenham at Wembley.\nEarps then left last summer, and Tullis-Joyce has subsequently kept 13 WSL clean sheets for third-placed United to take a share of the Golden Glove award – and helped them again make the FA Cup final.\n“Personally, there have been some moments where I look back and cringe still watching the video,” Tullis-Joyce said.\n“But I see the progress I’ve made in this season alone and I’m pretty astounded by how much I’ve grown.”\nWhat’s on today?\nManchester United head to Chelsea while Tottenham are away at Aston Villa – but will both managers have one eye on the Europa League final when it comes to their team selection?\nWalsall take on Chesterfield in the second leg of the League Two play-off semi-finals, with the Saddlers looking to protect a 2-0 lead.\nManchester City and Crystal Palace will both hold press conferences ahead of the FA Cup final on Saturday.",
  "word_count": 726,
  "scraped_at": "2026-02-14T12:43:27.679719"
}