{
  "article_id": "b40f72fb6fad",
  "url": "https://www.thehindu.com/news/top-news-of-the-day-upset-fans-vandalise-kolkatas-salt-lake-stadium-after-messis-brief-visit-bjp-led-nda-wins-in-thiruvananthapuram-corporation-and-more/article70392559.ece",
  "title": "Top news of the day December 13 , 2025",
  "date": "20251213T144500Z",
  "domain": "thehindu.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Messi in Kolkata: Upset fans vandalise Salt Lake stadium; organiser detained; CM orders enquiry\nViolence erupted at Salt Lake Stadium in Kolkata on Saturday (December 13, 2025) after football legend Lionel Messi made a brief public appearance there. Thousands of spectators were not able to catch a glimpse of Messi because a crowd of about 70 to 80 people, which included the organisers, State’s Sports Minister Aroop Biswas and representatives of football clubs, surrounded him. Football fans were angry that despite buying tickets at steep prices they were not even able to catch a glimpse of their favourite star. Within minutes angry football fans started breaking chairs in the gallery and throwing them on the field. The police personnel tried to push back the crowd but they were outnumbered.\nKerala local body polls 2025 results: UDF clinches decisive win; PM Modi thanks voters as NDA scripts history in Thiruvananthapuram Corporation\nThe Congress-led United Democratic Front (UDF) has scripted a decisive win in the 2025 Kerala local body polls even as the Left Democratic Front suffered a setback. The BJP-led National Democratic Alliance (NDA) made a historic win in the Thiruvananthapuram Corporation, where it secured its first-ever win.\nThree U.S. lawmakers introduce resolution to end 50% tariffs imposed by Trump on India\nThree influential U.S. lawmakers have introduced a resolution in Congress aimed at ending the tariffs imposed by President Donald Trump on India, saying the “irresponsible tariff strategy” toward Delhi is a counterproductive approach that “weakens a critical partnership”.\nMessi to enter Hyderabad stadium at 7.50 p.m. and leave at 9 p.m.\nIn view of the violence that erupted during the football legend Lionel Messi’s programme in Kolkata, the Hyderabad police have issued a warning of stringent action if there is any misconduct by those attending the match in Hyderabad. The officials released a minute-by-minute programme of Messi’s schedule, leaving no scope for any problems.\nModi government ‘master’ at renaming schemes: Congress hits out at Centre over MGNREGA name change\nWith the Cabinet approving a Bill to rename the Mahatma Gandhi National Rural Employment Guarantee Act (MGNREGA), the Congress on Saturday (December 13, 2025) said the PM Modi government is a “master” at renaming schemes and asked “what is wrong with the name Mahatma Gandhi” that it had to take this step.\nDelhi air pollution: GRAP-III implemented as air quality worsens to ‘severe’\nAs the air quality of Delhi deteriorated to the “severe” category on Saturday (December 13, 2025) morning, the the Commission for Air Quality Management in NCR and Adjoining Areas (CAQM) has imposed stage 3 of Graded Response Action Plan (GRAP), a set of emergency measures to control air pollution.\n2 killed in Russia while Ukraine’s energy infrastructure is targeted as peace talks press on\nAt least two people were killed in a drone attack in Russia’s southwestern Saratov region, and parts of Ukraine went without power following targeted assaults on energy infrastructure, local authorities said Saturday (December 13, 2025), as U.S.-led peace talks on ending the war press on.\nYouTuber ‘Savukku’ Shankar arrested by Chennai police\nYouTuber ‘Savukku’ Shankar was arrested by the Greater Chennai City Police on Saturday (December 13, 2025) afternoon in connection with a criminal case registered against him. Earlier, in a video posted on social media, Shankar claimed that the police had come to arrest him in connection with a criminal case registered by the Adambakkam police based on a complaint lodged by film producer Purushothaman in June last year.\nWill make Bastar the most developed tribal region by 2030, says Shah\nUnion Home Minister Amit Shah on Saturday (December 13, 2025) said that India stood on the verge of eliminating Maoism by March 2026 and that the government has now set its sights on making Chhattisgarh’s Bastar the most developed tribal division in the country by 2030.\nSecond airport for Bengaluru: Tenders invited for feasibility study, says Minister M.B. Patil\nThe Karnataka State Industrial and Infrastructure Development Corporation (KSIIDC) has invited tenders to select an expert consultancy firm to prepare a location suitability and comprehensive technical and financial feasibility report for the proposed second international airport for the State capital.\nJohnson & Johnson ordered to pay $40 million to two women in latest talc trial\nA California jury in the U.S. on Friday (December 12, 2025) awarded $40 million to two women who said Johnson & Johnson’s baby powder was to blame for their ovarian cancer. The jury in Los Angeles Superior Court awarded $18 million to Monica Kent and $22 million to Deborah Schultz and her husband after finding that Johnson & Johnson knew for years its talc-based products were dangerous but failed to warn consumers.\nPublished - December 13, 2025 06:50 pm IST",
  "word_count": 783,
  "scraped_at": "2026-02-14T12:12:54.686169"
}