{
  "article_id": "b425bb896d67",
  "url": "https://www.mayonews.ie/news/gaa/1822300/opinion-bright-young-lights-can-lift-the-darkness-in-mayo.html",
  "title": "OPINION - Bright young lights can lift the darkness in Mayo",
  "date": "20250610T210000Z",
  "domain": "mayonews.ie",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Tony Carey, Mayo minor footballer, is one of the bright attacking talents coming through in the county's GAA scene. Pic: Sportsfile\nWhile faith in Mayo's senior prospects in both the men’s and women’s codes has wavered and waned over the past four years, there are definitely some bright lights on the horizon in the underage ranks, if we can manage to bring them ashore.\nOn the men’s side, after a decade at the very top of the top table, the scale of Mayo’s ambitions has declined to provincial titles and perhaps, All-Ireland quarter-finals.\nALERT: Final call for 'Mayo's Greatest Supporter' applications\nOur performances over the last three seasons have failed for the most part to deliver even on these modest ambitions, despite strong league showings, and we have seen an alarming level of player drop-out. But despite this, it may not be all doom and gloom for Mayo.\nThe most recent sign of promise is the Mayo minors’ victory over Offaly on Sunday; a hard-fought and physical contest, with several twists and turns.\nMayo teams of late have come in for criticism for failing to close games out, but the teenagers answered this comprehensively at the weekend. Leading by nine points at half time, their lead was cancelled out by the Leinster champions, who, in a goal-fest, managed to edge one in front with just eight minutes to go.\nDavid Heaney and Tom Reilly’s lads dug deep, scoring four unanswered points down the stretch to claim victory in front of a small Mayo crowd in Dr Hyde Park, and a place in the All-Ireland semi-final in two weeks’ time.\nThere were some mutterings among those who did attend about the lack of Mayo support in Roscommon. For years, Mayo fans have been accustomed to outnumbering their opponents in the stands and terraces, but this is absolutely no longer the case, and undoubtedly, the decline at senior level affects attendance at all levels.\nREAD MORE: Mayo-made RTÉ series on history of the GAA set to air tonight\nHUGE DROP-OUTS\nThree weeks ago, the Mayo Under 20s were unfortunate to lose out to a talented Louth team in the All-Ireland semi-final. It is interesting to note that in a county that has traditionally produced robust defences, that our greatest challenges in both campaigns were defensive ones.\nConversely, up front, we are seeing some real promise emerge; the challenges will be to retain and nurture these players, and to avoid the type of over-prescriptive coaching that stifles creativity and risk-taking.\nThe Mayo women’s and girls’ teams are in a similar place. A deeply concerning decline at senior level, along with unprecedented levels of drop-out, suggest that all is far from well. At underage, the signs are promising with lots of talent on the horizon. The minors were desperately unlucky to lose their Connacht final clash on a free-kick shoot-out.\nThe U-16s retained their Connacht title to make it three in a row, and the U-14s made it all the way to the All-Ireland semi-final, losing to eventual champions, Cork.\nWord is that there is some serious talent in the ranks, but the challenge in retaining that talent is even greater, given the high drop-off in sports participation among girls and young women, combined with a lack of resources and facilities for Ladies' Gaelic football.\nLEGITIMATE CONCERNS\nSo, for the optimists among us, there is plenty to be excited about, but also, some very legitimate concerns about how we can really capitalise on the talent coming through. Ultimately, if Mayo’s on-pitch potential is to be realised, it is vital that the off-pitch issues that plague both men’s and women’s football be resolved.\nBoth county boards are dealing with legacy issues, albeit different in nature, but both impairing progress. It has often been a criticism of Mayo football that there are factions pulling in different directions, to the detriment of on-field success, and this is undoubtedly still the case.\nIn any situation where the running of an organisation is the responsibility of volunteers, there will always be challenges, but a good guide in these situations – and indeed, outside of the running of the organisation - could be to ask when decisions are to be made: “Is what I am doing here genuinely for the good of Mayo football?”\nREAD MORE: Referee confirmed for crunch Mayo-Donegal All-Ireland tie\nTRAINING FACILITIES\nFinancially, any decline in a senior team’s fortunes will affect the level of financial support available, be that from gate receipts, in-kind or sponsorship. This is particularly difficult when it comes to the LGFA, because of its lower profile to begin with, and its relative lack of resources.\nAdd to this the severe difficulty experienced by coaches and executives trying to get access to pitches for the girls and women’s training and games – an activity that hoovers up time and energy that is desperately needed elsewhere across the LGFA.\nHappily, Mayo LFGA will, within the next couple of year,s have access to their own training facility after agreeing a partnership and a licence agreement with Durkan Bohola Community Park – a hugely positive initiative on which the community is to be warmly congratulated.\nHowever, unity at administrative level will be vital, as will a robust management review process at the end of this season. None of this work is easy, and those who are currently putting in countless invisible hours of work behind the scenes should be commended.\nThe men, meanwhile, as has been recently highlighted by former manager James Horan, still do not have access to a county Centre of Excellence, instead renting space at the Connacht Centre of Excellence in Bekan.\nPlans continue afoot to develop a Mayo GAA Centre of Excellence and other sporting facilities on land at Bohola, which is all very well in theory and is desperately needed, but is a monumental ask in terms of financing, layered on top of the monstrous crippling debt on a gargantuan stand development in MacHale Park inherited by the current administration.\nThe latter is a cautionary tale in terms of governance and decision-making, and surely is one the people responsible for green-lighting it must now severely regret. None of this helps the current volunteer executive, who have had to deal with the repercussions of those decisions and remain exposed to continued unrelenting unpleasantness.\nREAD MORE: Mayo's mighty Minors secure place in All-Ireland semi-final\nNeither will the negative PR of late assist in the long term with attracting sponsorship.\nSo whether the bright lights of our younger players can help to lift the darkness that lies over both codes in Mayo very much remains to be seen.\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nSubscribe or register today to discover more from DonegalLive.ie\nBuy the e-paper of the Donegal Democrat, Donegal People's Press, Donegal Post and Inish Times here for instant access to Donegal's premier news titles.\nKeep up with the latest news from Donegal with our daily newsletter featuring the most important stories of the day delivered to your inbox every evening at 5pm.",
  "word_count": 1220,
  "scraped_at": "2026-02-14T12:49:55.135560"
}