{
  "article_id": "b42f7281ff8c",
  "url": "https://www.rockmnation.com/2024/5/15/24156967/womens-hoops-receives-marching-orders-in-new-look-sec",
  "title": "Mizzou Women Hoops receives marching orders in new - look SEC",
  "date": "20240515T131500Z",
  "domain": "rockmnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Women’s Hoops receives marching orders in new-look SEC\nThe Morning Commute for Wednesday, May 15\nToday we’re talking about the release of the women’s basketball SEC opponents. I know, it’s SHOCKING, considering all I’ve talked about recently is softball. Don’t worry; there’s a lot more coming with that.\nThe conference opponent slate was released on Tuesday afternoon, and oh boy, it’s a doozy. In all fairness, it always seems to be a doozy.\nAs Dylan mentioned in his quick hitter late yesterday, like usual, the Tigers will play a 16-game conference slate. Only this year, since the conference is “welcoming” two new teams in the Sooners and the Longhorns, things will change up a bit.\nWith the additions of Oklahoma and Texas, the Tigers will play each team once along with a rotating opponent for a home-and-home every season. This year, that rotating opponent is newcomer Oklahoma, reviving an old Big 8 rivalry.\nLet’s take a look at the slate, shall we? (highlighted stats are the 2023-24 league leaders)\nAWAY OPPONENTS\n- ALABAMA (24-10, 10-6) — 73.2ppg | allows 62.2ppg | 43.4% FG | 35 3PT% | 71.2 FT% | 38.9 RPG | Loss in 2nd round of NCAAT\n- ARKANSAS (18-15, 6-10) — 69.5ppg | allows 68.8ppg | 37.4 FG% | 29.7 3PT% | 72.1 FT% | 37.7 RPG\n- AUBURN (20-12, 8-8) — 66.4ppg | allows 58.8ppg | 40.5 FG% | 28.8 3PT% | 70.4 FT% | 37.1 RPG\n- GEORGIA (12-18, 3-13) — 63.2ppg | allows 66.9ppg | 40.5 FG% | 27.5 3PT% | 68.7 FT% | 38.5 RPG\n- OKLAHOMA (23-10, 15-3 Big 12) — 76.6ppg | allows 69.1ppg | 42.4 FG% | 31.3 3PT % | 71.2 FT% | 43.4 RPG | Loss in 2nd round of NCAAT\n- OLE MISS (24-9, 12-4) — 68.5ppg | allows 59.4ppg | 41.6 FG% | 26.5 3PT% | 69.5 FT% | 40.6 RPG | Loss in 2nd round of NCAAT\n- TEXAS (33-5, 14-4 Big 12) — 80.1ppg | allows 57.7ppg | 49.1 FG% | 36.5 3PT% | 71 FT% | 40.1 RPG | Loss in Final 4\n- TEXAS A&M (19-13, 6-10) — 68.4ppg | allows 58.7 ppg | 40.8 FG% | 27.9 3PT% | 68.2 FT% | 42.1 RPG\nMizzou was 2-9 overall on the road last season, taking just one SEC game on the road, vs. Vanderbilt in mid-January, and they’ll face four NCAA Tourney teams from a year ago, all of whom made it to the 2nd round (or later, in case of newbie Texas). Per Dylan, this will be Mizzou’s first trip back to Austin since they faced off in the 2nd round of the NCAA Tournament in 2016.\nHOME OPPONENTS (8-7 at Mizzou Arena last season)\n- FLORIDA (16-16, 5-11) — 74.7ppg | allows 71.3ppg | 43 FG% | 32.3 3PT% | 71.7 FT% | 36.7 RPG\n- KENTUCKY (12-20, 4-12) — 64.4ppg | allows 74.4ppg | 39.3 FG% | 29.2 3PT% | 63.4 FT% | 34.2 RPG\n- LSU (31-5-1, 13-3)— 85.9ppg | allows 63.3ppg | 46.2 FG% | 32.7 3PT% | 74.5 FT% | 46.2 RPG | Loss in Elite 8\n- MS STATE (23-12, 8-8) — 75.6ppg | allows 65.8ppg | 44.9 FG% | 35 3PT% | 73 FT% | 40.6 RPG\n- S CAROLINA (38-0, 16-0) — 85.5ppg | allows 56.55ppg | 49.2 FG% | 39.5 3PT% | 68.8 FT% | 46.3 RPG | Won National Championship\n- TENNESSEE (20-13, 10-6) — 76.30ppg | allows 69.7ppg | 43.5 FG% | 32.1 3PT% | 74.5 FT% | 43.3 RPG | Loss in 2nd round of NCAAT\n- VANDERBILT (23-10, 9-7) — 68.5ppg | allows 67.3ppg | 40.9 FG% | 32 3PT% | 71.1 FT% | 37.6 RPG | Loss in 1st round of NCAAT\n- OU [see above]\nMizzou (11-19, 2-4) — 69.97ppg | allows 71ppg | 44.2 FG% | 35.5 3PT% | 76.9 FT% | 35.2 RPG last season, was 8-7 in the friendly confines of Mizzou Arena, which is normally good for a couple SEC wins. Alas, the Tigers won just one SEC home game, against Kentucky, in the game after the Vandy road win in mid-January. They’ll face four teams who made the NCAA tourney a season ago, including the two most recent national champs at home in LSU (ew) and South Carolina.\nMuch like its women’s sports counterparts like gymnastics and softball, the SEC is a gauntlet, and gets even tougher with the additions of the Big 12 schools. The schools are literally just beating up on each other every week (well, except for SCar last year, who just wiped the floor with everyone). Vanderbilt, a perennial cellar dweller in the SEC, qualified for the tournament last year. Kentucky, who was pretty bad last season, fired their head coach and brought in a ringer in Virginia Tech’s Kenny Brooks Jr.. Along with him comes Aussie Georgia Amoore, who is outstanding. The Lady Vols fired their coach, former MO State coach Kellie Harper, for “not making enough Sweet 16s or finishing higher than 3rd in the SEC standings” and brought in Kim Caldwell, so yeah... the SEC ain’t playin around.\nAlso, it must be said. I’m really looking forward to the fashion that will be gracing the sidelines this winter. Dawn Staley always looks amazing and classy and I would wear any of those designer duds in a second, but Sydney Carter, the Director of Player Development at Texas, is legendary. She’s aspirational. You’ll notice Kim the Clown is NOT included in my “Fit Off,” dear readers.\nIn case you need a refresher, here’s the roster as is:\nYesterday at Rock M and Rock M+\n- SEC opponents revealed for Mizzou WBB- a short snapshot by Dylan Heinrich\nThis piece goes along with what I’ve written above, so read both!\n- 2024 Missouri Football Opponent Previews: Murray State Racers by Nate Edwards\nThe simplest way of putting is that they are “bad”. They won two games last year and wound up firing their coach, Dean Hood, after a 15-25 record over 4 years. Hood had previously been the coach at Eastern Kentucky and managed to get the Colonels to three Playoff appearances and 55 wins over 8 seasons; at Murray State he managed one 6-5 season and multiple 2-win seasons.\nOMG! It’s already time for preseason opponent previews?!? Good god. Nate reminds us that sometimes an FCS team will beat an FBS team, but really, he’s not concerned.\nIf Mizzou wants to contend or even compete in this gauntlet of the SEC, more commitment from the athletic department is desperately needed. Perhaps there’s hope for that, as AD Laird Veatch hired Jackson at Memphis and Blair DeBord is a baseball-minded guy for the Tiger Scholarship Fund.\nSammy makes some great points here in his Morning Commute piece, looking at how KJ did in his first season at the helm, as well as what kind of investment is needed to be more successful.\n- Over at Rock M+, there was plenty of discussion about favorite rap albums, the dwindling big portal. and whether or not ADs should be more cautious in extending coach’s contracts.\nIn Case You Missed it\n- Mizzou softball named No. 7 overall seed in NCAA Tournament by me & Brandon Haynes\nThe Tigers leapt to their feet and roared with excitement when Missouri was revealed as the No. 7 overall seed during a watch party at the South Endzone Complex on Sunday evening. That is, except for the front row, consisting of seniors Chantice Phillips, Alex Honnold, Laurin Krings, Jenna Laird and Maddie Gallagher, who remained seated and poised, almost like they were reminding everyone that they have their eyes set on one ultimate goal — a championship.\nWhat I’m Reading\n- The St. Louis Post-Dispatch’s Eli Hoff writes How Mizzou guard Anthony Robinson II is approaching his sophomore year after ‘long season’\nI really liked this offseason piece from Eli, which detailed what Ant is hoping to do in the offseason, and the value that coaches like Kyle Smithpeters, interviewed here, see in him.\nMizzou’s fired-up fireballer actually is more of a firefighter — she’s out there to extinguish any spark of hope. This season, she sports a 0.97 ERA with 29 strikeouts in 29 innings. She’s essentially Mizzou’s Ryan Helsley. The aptly named Cardinals closer comes out to the song “Hells Bells” — a song Pannell thoroughly enjoys. She listens to AC/DC before games.\nThis is an excellent tee-up for Brandon’s piece on Taylor that will come out on Friday. He also takes a really cool approach in this piece, talking to the person whose record she broke, Mizzou alum Kacey Marshall, who is 51 years of age now, as well as the oneof the two NCAA record holders, of which Taylor is one away, Canisus alum Mallory Aldred.\n- ESPN’s Alexa Phillippou explains what all went into the creation of the newest W team. It’s super interesting\n“The beautiful thing about Valkyries is that it’s plural and it’s together,” Smith said. “We need everybody — the on-court visual representation of these athletes coming together in games, but how we win together, with partners and fans and broadcast and league and everyone else by our side, is really where the real impact will be. We hope that being a Valkyrie, and for folks to kind of find their inner Valkyrie and where they’re going to be a piece of that puzzle, becomes a big piece of what makes this strong.”\n- Another piece about the shambles that are the NCAA, by Yahoo! Sports’ Ross Dellenger: NCAA could face $20B in damages, bankruptcy if proposed settlement offer isn’t agreed upon\nDocuments sent to league presidents detail House settlement terms, including damages of $2.776B; $21M athlete rev-share projections; a new “enforcement arm” to police collectives; and looming bankruptcy if a settlement fizzles.\n- And here’s one more, this time from ESPN’s Dan Murphy & Pete Thamel, if you can’t get enough.\nHere’s the breakdown of the landscape, according to multiple industry sources: The Big Ten is generally on board with settling. The SEC has some detractors of settling but is trending to a majority. The Big 12 is expected to follow along. There’s some dissension in the ACC, which has amplified why Florida State and Clemson are suing to leave the league, but sources say it’s unlikely the ACC will end up voting against it.\nHoly shit. This is wild. That’s my comment.\nPer Missourian football writer Adam Busack, Mizzou checks in at 17th nationally in returning production for the 2024 football season, good for 2nd in the SEC behind Kentucky. Last season, Missouri was second in the nation in returning production. Translation: this group of guys has played together for a looong time.\nFun Stuff\n- Great job, Mizzou Men’s Golf!\n- Why is Truman the only naked one?\n- Welcome home, Rahel Brommel!\n- We simply LOVE to see it.\n- (** RockMNation has affiliate partnerships. These do not influence editorial content, though RockMNation may earn commissions for products purchased via affiliate links.**)",
  "word_count": 1842,
  "scraped_at": "2026-02-14T12:41:49.040940"
}