{
  "article_id": "b43088090472",
  "url": "https://mwnation.com/malawi-stun-south-sudan/",
  "title": "Malawi stun south Sudan - Nation Online",
  "date": "20250924T100000Z",
  "domain": "mwnation.com",
  "source_country": "",
  "language": "English",
  "gender_category": "women",
  "source_pipeline": "women_expanded_gdelt_simple",
  "body_text": "Malawi stun south Sudan\nMalawi Under-20 Women’s National Football Team are edging closer to the Fifa Under-20 Women’s World Cup Poland qualification after yesterday’s 2-0 victory over South Sudan in the second round first leg at Juba Stadium.\nEnelles Fabiano and Sarah Mulimbika netted in each half to hand Malawi an advantage going into the second leg set for Friday at the same venue after Football Association of Malawi opted to play the home tie in South Sudan on logistical grounds.\nThis means Malawi just need a draw in the return leg to sail through to the third round.\nIn the first round, Malawi was among the 12 lowest-ranked teams based on previous Under-20 Women’s World Cup qualifiers.\nHowever, the team booted out Central Africa Republic (CAR) 4-2 on aggregate to advance alongside five other winners and join the 26 top-ranked teams exempted from the first round.\nMalawi won the first leg 3-1 at Bingu National Stadium in Lilongwe before being held 1-1 at Japoma Stadium in Douala, Cameroon where CAR hosted the match since their stadiums did not meet Confederation of African Football minimum requirements.\nIf successful in the second round, Malawi will play Guinea Bissau in February 2026 in the third round where 16 teams will compete in a knockout format to determine the eight teams advancing to the fourth round.\nThe winners in the fourth round will earn qualification to the finals set for Poland next year.\nIn a post-match interview, Malawi head coach Maggie Chombo-Sadiki was overjoyed.\nShe said: “First of all, let me thank God for the victory. And let me also thank the players for a job well done. I am very happy with the players’ performance.”\nChombo-Sadiki, however, warned her charges that the battle is not over despite the victory.",
  "word_count": 297,
  "scraped_at": "2026-02-14T12:36:26.695128"
}